{"Content": "[Caption, Close, State Board of Education Chair Donna Bahorich, R-Houston, State Board of Education board members, from left, Donna Bahorich, David Bradley, and  Thomas Ratliff, raise their hands to ask questions during a public hearing for new textbooks up for adoption and use in classrooms statewide, Tuesday, Sept. 16, 2014, in Austin, Texas. The Texas Board of Education is considering 104 proposed social studies, history, geography and government textbooks that publishers have submitted for approval and use in public schools statewide. (AP Photo/Eric Gay), AUSTIN - In a nod to the Texas Republican Partys most conservative wing, Gov. Greg Abbott on Thursday appointed home schooling advocate and former Dan Patrick campaign manager Donna Bahorich to chair the State Board of Education. The choice already is sowing dissent among the boards Republican factions as the 15-member panel enters a period in which it could be making a number of contentious policy decisions, including reviewing sex education standards. \"I take the responsibility very seriously knowing just how many Texas children are depending on the board to do a great job for them,\" Bahorich said in statement late Thursday. \"I look forward to working alongside the governor, legislators, fellow board members, education stakeholders and parents as we dedicate ourselves anew to serving the 5.2 million public school students of Texas.\", Fellow board member Ken Mercer called the appointment an \"excellent choice\" and highlighted her conservative bona fides. \"Youve got to stand for something and Donna stands for a lot of great things,\" said Mercer, R-San Antonio. \"Shes a rock-solid conservative.\", Barbara Cargill, R-The Woodlands, the boards outgoing chairman, added, \"She is a tireless advocate for our schoolchildren and is well respected by board members, legislators and other stakeholders in education. I wholeheartedly support Donna in this role.\", Other board members were not as sanguine about the appointment. The announcement even spurred one member, Thomas Ratliff, R-Pleasant Valley, to reconsidered his decision to not seek re-election. \"I think its a step backward,\" Ratliff said. \"I dont believe that I can say Im leaving the board in a better place than when I got there with her as the chair.\", Where the board once had a clear majority of far-right, entrenched Republicans, it now is, more or less, evenly divided into three voting blocs  Democrats, far-right Republicans and comparatively moderate Republicans. The division means discussions are more balanced and the middle-ground Republicans often end up acting as tie-breakers than in previous years, when debate over standards and textbooks often degraded into embarrassing public fights. The chair steers the focus and moderates discussion during the boards meetings, which usually occur bimonthly in Austin. Ratliff said he thinks Bahorichs appointment will move the board back toward the fractious infighting of those years. \"This is not personal. She is a wonderful lady. Were friends with each other. I just believe this appointment has more to do with politics than with policy,\" he said. \"I was hoping for another choice.\", It became clear as Cargills tenure was coming to a close that the governor was choosing between Bahorich and Amarillo Republican Marty Rowley, who is seen as a consensus-maker. Rowley would not comment on Ratliffs concerns Thursday, saying, \"There are a lot of challenges that are facing the state board moving forward from here and were all going to have to unite together.\", Reached for comment late Thursday, Bahorich also would not comment on Ratliffs concerns. \"His remarks need to stand for themselves,\" she said. Noting her long tenure working with the Legislature, she added, \"I feel like Im a pretty quick study and I kind of have a proven track record.\", Mercer, meanwhile, said he was \"very disappointed\" with Ratliffs statements about the new chair. \"Shes not a registered lobbyist,\" Mercer said, referring to Ratliff, who lobbies for the likes of Microsoft and T-Mobile. \"She understands her job is to do whats best for the children of Texas.\", Bahorich has served on the board since 2013. She spent most of the last decade working for Lt. Gov. Dan Patrick, acting as his campaign manager when he first was elected to the state senate and as his treasurer. She has also been active in the home schooling movement. In 1998 she helped fund Home Ed Plus, an online nonprofit that offers home schooling parents classwork help and tips to \"provide a Christian environmentin which their student may learn and participate with other students.\", Ratliff said he is concerned she has not experienced the public school environment personally with her own children, and said her history of advocating for charter schools at the state Legislature - and with her former boss are concerning. Mercer shrugged off his concerns: \"We all have our opinions. We have a right to voice that as long as we all come to a vote.\", The board next meets in July.]", "Date": "20150618", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Abbott-appoints-conservative-former-Patrick-6336306.php", "Title": "[Abbott taps Bahorich to head state education board]"}