{"Content": "[Caption, Close, 15: Canada - 8,6 Less than 1 pct of foreign-b , U.S. Sen. Ted Cruz was born in Canada. . Texas Sen. Ted Cruz roused conservative activists with a fiery speech Thursday positioning him as the only 2016 presidential candidate who would be bold enough to take on Washington, D.C. from within. Speaking at the Conservative Political Action Conference outside the nations capital, Cruz most notably sought to tie the presumptive Democratic nominee to the city, saying former Secretary of State Hillary Clinton \"embodies the corruption of Washington.\" He opened his speech with yet another shot at Clinton, bringing up reports that her familys foundation took money from foreign countries while she was the United States top diplomat. \"We couldve had Hillary here, but we couldnt find a foreign nation to foot the bill,\" Cruz said. Playing word association with Fox News host Sean Hannity after the speech, Cruz again jabbed at the Clintons. He equated Hillary with \"Washington\" and her husband -- the former president -- with \"youth outreach,\" an apparent reference to the Monica Lewinsky scandal. As he has in recent speeches, Cruz pressed Republican primary voters to hold accountable candidates who claim they are conservative. He suggested GOP voters should not only pick a candidate in 2016 who has stood up against Democrats, but also fellow Republicans when the cause was right. \"The word tells us you shall know them by their fruits, and so I would encourage all of the men and women gathered here today -- demand action, not talk,\" Cruz said. Reiterating his prescription for the GOPs 2016 nominee, Cruz urged activists to elect someone who represents the three-legged stool of conservatism championed by Ronald Reagan. In perhaps a nod to his own reputation, Cruz reminded his audience Washington \"despised\" Reagan when he ran for president in 1980, four years after launching a primary challenge against fellow Republican Gerald Ford. Speaking with Hannity, Cruz acknowledged ruffling some feathers in Washington is part of his plan, comparing himself to ride-sharing apps like Lyft and Uber that have riled the taxi industry in major cities. \"What Im trying to do more than anything else,\" Cruz told Hannity, \"is bring a disruptive app to politics.\"]", "Date": "20150226", "Author": "[Patrick Svitek]", "Link": "http://www.chron.com/news/politics/texas/article/Ted-Cruz-blasts-Hillary-Clinton-Washington-in-6103606.php", "Title": "[Ted Cruz blasts Hillary Clinton, Washington in CPAC speech]"}