{"Content": "[With polls showing New Jersey Gov. Chris Christies status as a potential frontrunner in the next presidential election slippingin the wake of his \"Bridgegate\" scandal, a familiar name is returning to the fore  Rep. Paul Ryan. But while some Republican operatives see a clear path to the White House for Mitt Romneys former running mate, no one seems sure whether Ryan is actually interested in running. \"If he wants it, he can probably have it,\" one Republican strategist told Business Insider of the 2016 GOP nomination. \"The thing is, Im not sure if he wants it.\", Christies diminished standing in presidential polls has left Ryan among the leaders of potential Republican candidates.Two other GOP governors  Wisconsins Scott Walker and former Florida Gov. Jeb Bush  have also seen their stocks rise as Christie stumbles. But the consensus among nearly a dozen Republican consultants and political strategists is that Ryan is one of the strongest potential 2016 GOP candidates. In their minds, the only remaining question is whether Ryan actually wants to run in 2016  and if hes ready to forego years of powerful positions in the House of Representatives. Heres the case for Ryan: Hes viewed as one of the smartest people in the Republican Party. Ryan already survived a trial run and vetting in 2012 and he handled his time well on the national stage. Hes also starting to build a brand of bipartisanship  he recently struck a budget deal with Senate Democratsand has been one of the leading voices urging Republicans to take up the issue of immigration reform. \"His numbers are robust, the field is wide open and he acquitted himself well in 2016,\" Republican strategist Rick Wilson told Business Insider in an email.\"Like of lot of people, I suspect there are those around Paul whispering, Do it. Go for it. Whats the worst that can happen? knowing he could hold his House seat and seniority if the Presidential doesnt work out.\", Then there are the caveats: This early in the cycle, with about two years to go before the first nominating contests, Ryans prime positioning in the polls could simply stem from the fact he has higher name recognition than other candidates after his presence on the ticket in 2012. Furthermore, the recent poll showing Ryan leading the pack isnt necessarily a sign of a stronger trend. Other polls have left him in the middle of a crowded field that includes Christie, former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker, and Sens. Ted Cruz (R-Texas), Marco Rubio (R-Fla.), and Rand Paul (R-Ky.). However, Ryans poll numbers may be a moot point. Several consultants, indicated the prevailing sense among Republican politicos is that Ryan wants to stick around for a while in the House. The 44-year-old Ryan is in line to become chairman of the powerful Ways & Means Committee, where he could lead an overhaul of the tax code. Ryan could take over as chairman of the committee next January, and Republicans are ready to rally around him. The chairmanship would put Ryan at the forefront of many of the most high-profile and critical policy issues, including health care and tax policy. Ryan could still run for president as Ways & Means chairman, but the time commitments and high-profile nature of the position could present potential pitfalls. Because of this,GOP strategist Matt Mackowiack told Business Insider he thinks the committee is Ryans top priority. \"The primary objective and the goal, I think, is Ways & Means,\"Mackowiack said. \"And the stars are aligning for that.\", Ryan also has two young children, and is described frequently as someone who \"enjoys his weekends\" home in Wisconsin with them. And others worry that if Ryan does want to get into the race, hes already far behind his potential competitors. \"Hes one of theleast political politicians Ive ever come across,\" said Mackowiack, who heard Ryan speak a few weeks ago in San Antonio, Texas, where he disavowed any desire to become the next Speaker of the House. Mackowiack also cited an absence of the chatter that typically surrounds potential presidential candidates. \"There are just little things  no ones evenwhispering name to reporters, like other candidates are doing.\", Still, despite questions about his desire, Ryan has understandable appeal for Republican operatives eager to win a White House race after back-to-back losses. Ryan is frequently cast as the type of candidate  like Christie before \"Bridgegate\" and, perhaps, fellow Wisconsinite Scott Walker  who has bipartisan bonafides and can bridge the divide among staunch conservatives, more moderate Republicans, and Independent voters. Ryan has been on both sides of recent issues dividing the conservative grassroots from the Republican establishment in Washington. In December, he joined House Speaker John Boehners war of words with conservatives over his budget accord. After Rubio criticized the deal, Ryan seemed dumbfounded and accused him of not reading the bill.About two months later, Ryan went against leadership in joining the vast majority of Republicans to vote against the recent suspension of the debt ceiling. \"Theres conservative angst about him on some votes,\" a Republican strategist said, citing Ryans support for TARP and a debt-ceiling hike. \"In this case, especially since there was just nothing there for conservatives to like, I think he played it smart.\", Ryan, for his part, isnt actively putting a stop to the speculation. Last month, Ryan visited New Hampshire, which is a regular stop for presidential aspirants due to its traditional status as the first state in the nation to hold a primary election. During his visit to the Granite StateRyan was asked whether he has his eye on 2016. He told reportershes focusing on his job as chair of the House Budget Committee and would \"worry about those things\" later. Still, theres a very real feeling that Ryan is primed to be next in line among Republican candidates -- if he wants it. \"To the extent we have an heir apparent,\" one consultant said, \"hes it.\", Join the conversation about this story , See Also:]", "Date": "20140304", "Author": "[Brett LoGiurato, provided by]", "Link": "http://www.chron.com/default/article/Paul-Ryan-Could-Be-The-GOP-s-Secret-Weapon-In-5285459.php", "Title": "[Paul Ryan Could Be The GOP's Secret Weapon In 2016  If He Wants To Run]"}