{"Content": "[House Speaker John Boehner says President Barack Obama has continually overstepped his constitutional authority, forcing his hand in a coming lawsuit set to be filed by the House of Representatives. Boehner justified the Houses pending actionin an op-ed on CNN.com Sunday. Boehner has hinted at the lawsuit for the past two weeks, but for the first time on Sunday he detailed specific areas the House will likely target, including Obamas actions with regard to the Affordable Care Act, energy regulations, foreign policy, and education. \"I dont take the House legal action against the President lightly. Weve passed legislation to address this problem (twice), but Senate Democrats, characteristically, have ignored it,\" Boehner wrote. \"In the end, the Constitution makes it clear that the Presidents job is to faithfully execute the laws. And, in my view, the President has not faithfully executed the laws when it comes to a range of issues, including his health care law, energy regulations, foreign policy, and education.\", Somewhat notably, Boehner didnt mention anything related to immigration reform, an area on which Obama has acted unilaterally before and is planning to do so again by the end of the summer. Boehner said Obamas overstepping started after Republicans retook control of the House of Representatives in 2011, and he said his chamber must act now \"before its too late.\", Boehner sent a memo to the House Republican conference late last month, informing them of his plans to file legislation in July that would allow the House of Representatives to file suit to compel Obama to \"faithfully execute the laws of our country.\", The White House and the president himself have jokingly dismissed the lawsuit. Most notably,Obama taunted House Republicans during a speech last weekin which he pressed them to find a solution to replenish the Highway Trust Fund. \"I told him, Id rather do things with you, pass some laws, make sure the Highway Trust Fund is fundedsowe dont lay off hundreds of thousands of workers. Its not that hard,\" Obama said of Boehner. \"Middle-class families cant wait for Republicans in Congress to do stuff. So sue me. As long as theyre doing nothing, Im not going to apologize for trying to do something.\", Join the conversation about this story , See Also:]", "Date": "20140706", "Author": "[Brett LoGiurato, provided by]", "Link": "http://www.chron.com/default/article/BOEHNER-Here-s-Why-I-Have-To-Sue-Obama-Now-5602579.php", "Title": "[BOEHNER: Here's Why I Have To Sue Obama Now]"}