{"Content": "[Caption, Close, State Rep. Charles \"Bubba\" Chaney, R-Rayville, listens to a presentation about Louisianas projected budget shortfall during a meeting of the Joint Legislative Committee on the Budget, Friday, Aug. 14, 2015, in Baton Rouge, La. BATON ROUGE, La. (AP)  Only two months after a difficult budget-balancing session, Louisiana lawmakers Friday got their first official glimpse of the shortfall they already face for next year: $713 million. News of a horizon filled with future budget gaps wasnt unexpected for the Joint Legislative Committee on the Budget. The $25 billion budget for the fiscal year that began July 1 contains $542 million in patchwork financing that isnt expected to be available a year later, accounting for much of the projected gap forecast for the 2017 budget year. The shortfall also assumes inflationary increases in health care, retirement and salary costs that lawmakers dont always choose to fund. Senate Finance Committee Chairman Jack Donahue said use of the piecemeal financing from a tax amnesty program, state surplus and agency reserve accounts helps keep the state from having to make deep cuts to public health care services and colleges. \"I think using one-time money under those circumstances is the right way to go,\" said Donahue, R-Mandeville. Though the shortfall projection was steep, legislative leaders noted it was smaller than the $1.6 billion gap they closed this year. Lawmakers were more immediately worried that this years budget will have to be slashed, to account for oil prices falling below state forecast. Only one month into the budget year, lawmakers Friday already had to trim $4.6 million in planned spending because a package of recently-approved tax and fee bills arent expected to generate all the money used in the budget. Nearly $3.8 million of the cut will fall on public colleges, despite efforts from lawmakers to shield campuses from reductions. Commissioner of Administration Kristy Nichols, Gov. Bobby Jindals chief budget adviser, said the dollars will be restored if income forecasts improve, rather than drop. But lawmakers expect they could face more bad news in the coming months. While oil price declines are good for drivers at the gas pump, large dips in per-barrel price can wreak havoc on Louisianas budget, which gets money from severance taxes and mineral royalties tied to energy production. Every dollar drop in the annual oil price for income projections represents an estimated $11 million hit to the state general fund. This years budget is built on a nearly $62 per barrel oil price. \"The price of oil is a whole lot less than that,\" said Sen. Ed Murray, D-New Orleans. \"That puts the budget significantly out of balance.\", Oil prices have recently hovered around the low-$40 range per barrel. Decisions on adjusting oil and gas revenue projections, however, arent expected to be made until economists gather more data. The states income forecasting panel, the Revenue Estimating Conference, met Friday but didnt rework projections to address oil price changes. Economists are awaiting more information across the states various tax types to see if income taxes, sales tax or other revenue sources are performing better than expected and can make up the gap for sliding oil prices. The income forecasting panel instead gathered to adjust the states revenue projections to account for millions of dollars from fee hikes, tax increases and tax break scale-backs approved by lawmakers in the last legislative session to raise money for the state treasury. Nearly $767 million in new revenue from the tax and fee changes was added to this years forecast. The budget hole forecast for the following year comes even after assuming that $653 million will continue to be generated from those taxes and fees next year.]", "Date": "20150814", "Author": "[Melinda Deslatte, Associated Press]", "Link": "http://www.chron.com/business/energy/article/Next-year-s-state-budget-shortfall-projected-at-6444483.php", "Title": "[Next year's Louisiana budget shortfall projected at $713M]"}