{"Content": "[Caption, Close, ,  On his relationship with Judaism: Im more Jewish than you think I am,\" he told the New York Times. \"I read the part of the Bible that said the Jews are Gods chosen people. Im more Jewish than...  On gays and lesbians: \"I may have the genetic coding that Im inclined to be an alcoholic, but I have the desire not to do that, and I look at the homosexual issue in the same way,\" he said during an appearance at the Commonwealth Club of California. \"I may have the genetic coding that Im...  On gays and lesbians in his 2008 book: \"Even if an alcoholic is powerless over alcohol once it enters his body, he still makes a choice to drink. And, even if someone is attracted to a person of the same sex, he or she still makes a choice to engage in sexual activity with someone of the same gender.\", \"Even if an alcoholic... On the age of our planet and the theory of evolution: \"How old do I think the earth is? You know what? I dont have any idea. I know its pretty old. So it goes back a long, long way. Im not sure anybody actually knows completely and absolutely how old the earth is ... I hear your mom was asking about evolution and, you know, its a theory thats out there. Its got some gaps in it, but in Texas we teach both creationism and evolution in our public schools. Because I figure youre smart enough to figure out which one is right,\" he told a young boy in downtown Portsmouth. \"How old...  On former U.S. President George W. Bush: George W. Bush did a incredible job in the presidency, defending us from freedom,\" he said on NBCs The Today Show. George W. Bush did...  On the 2010 Deepwater Horizon oil spill: \"From time to time there are going to be things that occur that are acts of God that cannot be prevented,\" he told the Chamber of Commerce in Washington. \"From time to time...  On intelligent design: \"I am a firm believer in intelligent design as a matter of faith and intellect, and I believe it should be presented in schools alongside the theories of evolution,\" he told the San Angelo Standard Times in 2010. \"I am a firm believer in intelligent...  On getting the younger vote: \"Those of you that will be 21 by November the 12th, I ask for your support and your vote,\" he told college students in New Hampshire. (The voting age has been 18 since 1971), \"Those of you that will be 21 by...  On President Barack Obamas birth certificate: \"Its a good issue to keep alive. Its fun to poke at him,\" he told CNBCs John Harwood.\", \"Its a good...  On U.S. Cabinet departments: \"Its three agencies of government when I get there that are gone -- Commerce, Education and the, um, whats the third one there?\" he asked during the 2012 GOP presidential debate. \"Its three agencies of... If you thought Rick Perrys \"oops\" moments were all tapped out in the last presidential election, the former Texas governor has managed to wring out a few more over the massacre in Charleston, S.C. the Guardian reports. Late Wednesday night, police say Dylann Storm Roof, 21, opened fire inside a historic black church, killing 9 people. Prior to the shooting, one of the surviving witnesses said Roof told the victims this:, \"I have to do it. Youre raping our women and taking over the country. You have to go.\", Friday, the 2016 GOP presidential candidate talked about the shootings with Newsmax TV, calling the murders \"an accident\" and the possible result of \"prescription drug abuse.\", \"This is the M.O. of this administration, any time there is an accident like this, the president is clear. He doesnt like for Americans to have guns and so he uses every opportunity, this being another one, to basically go parrot that message,\" he said. Calling the shootings an accident was likely just a word flub as Perry did clarify they were a hate crime though he did not want to say directly that it was a \"act of terror.\" He did go on to say the \"real issue\" was Storms reported abuse of prescription drugs. \"It seems to me  again, without having all the details about this one  that these individuals have been medicated. And there may be a real issue in this country, from the standpoint of these drugs, and how theyre used,\" Perry said. UPDATE: Later in the day, Perrys communications adviser told Business Insider he meant to say \"incident\" not accident. Theres been outspoken criticism regarding both the coverage and discussion taking place over the South Carolina shootings, particularly over the reluctance of some news organizations and notable persons to label it both a hate crime and terrorism.]", "Date": "20150619", "Author": "[John-Henry Perera]", "Link": "http://www.chron.com/news/politics/article/Interview-Rick-Perry-says-hate-crime-mass-6338328.php", "Title": "[Rick Perry flubs on Charleston hate crime-mass shooting in interview]"}