{"Content": "[Caption, Close, FILE - In this Sept. 11, 2015 file photo, Republican presidential candidate Ben Carson speaks in St. Louis. Carson has moved into the top tier of the 2016 presidential race as quietly as Donald Trump crashed the party with bombast, and hell join the billionaire real-estate mogul as a focus of attention at the GOPs second debate. LOS ANGELES (AP)  Amid all the bombast in the Republican race for president, Ben Carson comes across more like a whisper. He is, in some ways, the anti-Trump  a gentle candidate who lets his record as a renowned brain surgeon speak for itself. The bragging about his resume and place in the polls, on the rare occasions it comes, is delivered with none of the superlatives that Donald Trump cant seem to go without. Yet the 63-year-old Republican, the only African-American seeking the White House in 2016  has tapped into the same wave of anti-establishment outrage fueling the billionaire realty TV stars rise. \"The likelihood of someone like me getting through this process and making it to president is virtually impossible,\" Carson told The Associated Press in a recent interview. \"I just have to be myself. And if being myself resonates with the American people, then they will choose me. \"And if it doesnt,\" he said, \"they will choose somebody else.\", Like Trump, Carson was dismissed early as a gaffe-prone novice lacking a national profile and any significant political network. But he appears to be connecting with Republican voters at a rate that even his closest aides didnt predict. Heading into Wednesday nights second debate of the GOP contest, Carson finds himself alongside Trump atop the field. A New York Times/CBS News poll released Tuesday shows Carson favored by 23 percent of likely Republican primary voters compared to Trumps 27 percent. Former Florida Gov. Jeb Bush and Wisconsin Gov. Scott Walker, meanwhile, have plummeted to 6 percent and 2 percent respectively. It should be noted the poll found that 63 percent said they could change their minds before the primaries begin with the Iowa caucuses in February. Yet it was just one of several in recent days that feature the political rookies Trump and Carson leading a field of veterans of elected office, offering the clearest example yet that Republican voters have deep frustrations with the political establishment. It shows in Carsons fundraising, too. His campaign says it has raised $5 million so far this month, adding to the $9 million it pulled in during July and August  a strong performance at what is typically one of the hardest times for candidates to raise money. Wednesday night offers Carson a new chance to build on that momentum. A stage full of Republican candidates will face off at the Reagan Presidential Library for the partys second formal debate. Carson emerged from the first as a surprise success, his popularity fueled by his nice-guy image on a night when his competitors came out swinging. Yet he remains rough around the edges and has little experience with issues beyond health care and business, particularly foreign policy in an election where international affairs are a major part of the discussion. \"Hes memorized every nerve in the body, he can memorize the top 12 terrorists in the world,\" said Carson campaign manager Barry Bennett, dismissing any concerns. His team hopes to use any additional airtime hell get Wednesday night to highlight Carsons biography. He rose from the streets of inner-city Detroit to be head of pediatric neurosurgery at Baltimores Johns Hopkins Hospital. The story inspired a television movie and gives Carson unique standing in a Republican Party often criticized as the party of older, wealthy, white men. Carson briefly focused on race late last week by touring Ferguson, Missouri, the St. Louis suburb hit by rioting after a white police officer shot a black teen. After the tour, however, Carson condemned the \"Black Lives Matter\" movement and said the nation should \"de-emphasize race\" and instead \"emphasize respect.\", A religious conservative, Carson said hed prefer the movement change its name to \"All black lives matter\"  to include the unborn children of black women who have abortions. Better yet, he said, the group would change its name to simply, \"All lives matter.\", Hes expected to focus on party unity on the debate stage after declining to respond to his competitors jabs in recent days. \"Trump will be Trump, Ben will be Ben, and the contrast couldnt be clearer,\" Bennett said. In contrast to other campaigns, no one has been playing Trump during Carsons debate preparation sessions, which are somewhat unusual. Bennett described an all-day \"knowledge session\" Monday in which experts delivered presentations on various domestic and foreign policy topics. \"They dont pepper him with questions, he peppers them,\" the campaign manager said. And while Carson doesnt focus on race, his campaign suggests his status as the only African-American in the contest is a political asset. \"In a crowd of 17 candidates, it is important that you can differentiate yourself in as many ways as possible,\" Bennett said. \"Hes soft-spoken, hes African-American and hes a doctor.\", The campaign has begun running TV ads in Iowa and New Hampshire promoting Carsons biography. And its looking to expand a paid staff of 80 now divided between the campaigns suburban Washington headquarters and early voting states across the country. The political establishment remains skeptical of his chances, but Carson doesnt seem to mind. \"My whole life people have told me you cant do this, no ones ever done this before, this is impossible,\" he said. \"I dont even get charged up until I hear those words.\", ", "Date": "20150916", "Author": "[Steve Peoples, Associated Press]", "Link": "http://www.chron.com/news/article/Amid-Trump-bombast-quiet-Carson-rises-in-GOP-s-6505993.php", "Title": "[Amid Trump bombast, quiet Ben Carson rises in GOP 2016 field]"}