{"Content": "[Caption, Clos To U.S. Hispanic Chamber of Commerce: \"I dont think Ive ever seen a Hispanic panhandler. And the reason is in our community it would be shameful to be begging on the streets.\", See the Ted Cruz social media posts that lit a fire to Facebook and Twitter, Senator Ted Cruz took this street artists rendering of him shirtless and tattooed in stride. Of course Cruz, like many other politicians, took part in 2014s ALS ice bucket challenge fad. Independence Day allowed Cruz to reiterate his personal beliefs to followers. Hobby Lobbys controversial 2014 was a flashpoint for Cruz supporters. (Source: Politiwoops), Some tweets get deleted for one reason or another, though, with no explanation. (Source: Politiwoops), Cruzs took to Facebook to congratulate Craig Biggio on his Hall of Fame election. Some tweets get deleted for one reason or another, though, with no explanation. (Source: Politiwoops), Of course on Facebook posts like this get shared thousands of times over. Some tweets get deleted for one reason or another, though, with no explanation. (Source: Politiwoops), Anything with a call to share and a quote usually gets shared all around Facebook within minutes. Some tweets get deleted for one reason or another, though, with no explanation. The tiger rug might have rubbed some the wrong way.(Source: Politiwoops), Sometimes simple things like hashtags and images have caught fire on Twitter Beyonc has been a vocal advocate all over social media. \"If you like it you should be able to put a ring on it,\" she quipped on Instagram. \"I hope the Supreme Court moves us into the future.\" -- Mayor Annise Parker, Selena Gomez joined several celebrities in a viral video called \"Vote for Stuff.\", Connor Barwin may no longer be a Houston Texan, but hes been a fierce advocate for equal rights. He has a gay brother. Houston Rep. Sheila Jackson Lee posed for a NOH8 photo. Renee Zellweger. Hilary Duff. Betty Buckley. \"When couples are committed to each other and love each other, then they ought to have the same sort of rights that everyone has.\" -- former First Lady Laura Bush, Arian Foster says he expects an NFL player to come out soon. Dog the Bounty Hunter and his family also posed for the NOH8 campaign. Designer Tom Ford. \"American Idol\" semifinalist Kady Malloy has been a longtime supporter of LGBT rights. \"The Voice\" finalist Sarah Golden. A.D. Rowntree, a popular DJ on 94.5 FM the Buzz, changed his Facebook photo the red equality sign and calls it \"common sense.\", Mix 96.5 FMs Blake Hayes, Houston musicians Bill Curtner, left, and Jef Rouner. Jazz singer Kristine Mills says, \"Its whats correct.\", Longtime PBS Ch. 8 anchor and producer Ernie Manouse. Jazz diva Tianna Hall is a fierce advocate for LGBT rights. Daniel Joseph Baker from \"Americas Got Talent.\", Houston makeup artist Edward Sanchez, owner of Edward Sanchez Vanity Lounge in West Ave. Eva Longoria. Matthew McConaughey. Houston rapper Nosaprise went red on Facebook. So did longtime local performer Guy Schwartz. \"The Voice\" finalist Nakia. Ethan Hawke. Morgan Fairchild. Shannon Elizabeth. Patrice Pike. Houston jazz singer and pianist Henry Darragh. Local author Gwendolyn Zepeda. \"American Idol\" season 2 finalist Kimberly Caldwell. Leann Rimes (with husband Eddie Cibrian). Kelly Clarkson, the original Idol. \"American Idol\" winner David Cook, who was born in Houston. 104.1 FM KRBE personality Kevin \"Special K\" England. Fiona Dawson, local advocate, volunteer and personality. \"Everyone deserves a chance at forever\" -- Hot 95.7 FM DJ Sarah Pepper (with producer Ivan). U.S. Senator and presidential candidate Ted Cruz (R-Texas) recently made comments on a conservative radio show that suggest \"mandatory gay marriage\" may be on its way. The vocally Christian Tea Party politician has long been sounding the gay marriage alarm. He believes that efforts to mandate equal treatment of people who marry someone of their same sex are unconstitutional censorship of people who believe their religion prohibits them from affirming homosexuals. In an interview with conservative talk radio host Eric Metaxas on Friday, Cruz apparently alleged his political opponents were trying to force all Americans into same-sex unions. \"The modern Democratic Party,\" he said, \"has gotten so radical and so extreme in its devotion to mandatory gay marriage that theyve decided theres no room for the religious liberty protected under the First Amendment.\", A spokesman for the Cruz campaign said the candidate meant Democrats want every state to give same-sex couples the option to wed, not that they want to mandate gay marriages. He cited the ongoing case in the U.S. Supreme Court that will determine the constitutionalityof prohibiting marriage on grounds of gender and could force state governments to allow gays to marry. RELATED:Same-sex marriage the end of America, Texas GOP speaker says, Cruz mentioned the mandate in the context of recent political battles over \"religious freedom\" legislation in Arkansas and Indiana that would have let businesses claim religious protection to deny services to gay people. Both states eventually toned down their proposed laws and included specific protections outlawing discrimination on basis of gender of sexuality. In the interview, Cruz called the outcome of the religious freedom debates \"heartbreaking.\", \"We are seeing today profound threats to religious liberty in America, the greatest threats weve ever seen,\" he said. In April, he described the movement to legally sanction same-sex marriage in America as \"jihad\" against Christians. That month, a survey of 40,000 Americans by the Public Religion Research Institute found 60 percent of American Catholics, 62 percent of American mainline Protestants and 28 percent of American evangelical protestant (with whom Cruz identifies) favor allowing same-sex couples to wed. But Cruz claimed efforts to force Americans to accept people whom their religion condemns is a violation of the fundamental freedom the country boasts. \"Were a nation that was founded by men and women who were fleeing religious oppression,\" he told Metaxas. \"That is under profound jeopardy today.\", RELATED:Texas conservatives hold controversial cake-cutting over gay marriage ban, Cruzs complete comments:, \"We are seeing today profound threats to religious liberty in America, the greatest threats weve ever seen and just a couple of months ago we had the battles in Indiana and Arkansas when they passed their religious freedom restoration acts. What happened afterwards was heartbreaking. We saw, number one, a perfect storm of the modern Democratic Party that has gotten so radical and so extreme in its devotion to mandatory gay marriage that theyve decided theres no room for the religious liberty protected under the First Amendment. And sadly Democrats joined with big business in an effort to vilify our religious liberty. But what was most striking is how many Republicans, including Republicans running for president in 2016, ran and hid in the hills, were afraid to stand and be counted. I think that Indiana and Arkansas, as Reagan put it, were a time for choosing, that was a sorting moment. \"And Ill tell you one of the things Ive been blessed [sic] for the last two decades is to have the opportunity over and over and over again to stand and defend religious liberty and to win nationally over and over again and I will not shirk from defending the religious liberty of every American. Were a nation, and you know this so well, Eric, who were freeing religious oppression and coming to seek out a land where every one of us could worship God Almighty with all of our hearts, minds and souls. And that is under profound jeopardy today.\"]", "Date": "20150521", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/texas/article/Ted-Cruz-decries-push-for-mandatory-gay-marriage-6278493.php", "Title": "[Ted Cruz decries push for 'mandatory gay marriage']"}