{"Content": "[Caption, Close, African hair braiding regulations - Declared unconstitutionalJan. 7, 2015, Police can draw blood from suspected drunk drivers without a warrant - Declared unconstitutional Nov. 26, 2014, Improper photography (\"upskirting\") - Declared unconstitutionalSept. 10, 2014, Texas voter ID laws - Declared unconstitutional Oct. 9, 2014, Key piece of restrictive abortion law - Declared unconstitutionalAug. 29, 2014, School finance system - Declared unconstitutionalAug. 18, 2014, Waiting period for new political action committees - Declared unconstitutionalAug. 13, 2014, , New Braunfels ban on disposable drinking containers on local rivers - Declared unconstitutionalJan. 27, 2014, Sex toys ban -Declared unconstitutional Feb. 12, 2008, Anti-sodomy law -Declared unconstitutionalJune 26, 2003, A ban on non-Texans receiving liquor licenses - Declared unconstitutionalJan. 13, 1994, Back in the saddle in Austin, the Lone Star States legislative cowpokes lassoed up more than a few unusual critters for their 84th lawmaking roundup.  Heres a sampling of some of the interesting and odd bills in the corral for 2015. HB 483 from Rep. Giovanni Capriglione (R-Keller): Would create a Fort Knox-like repository for state bullion. HCR 35 from Rep. Marsha Farney (R-Georgetown): Would make the cowboy hat the state hat of Texasciting the significance of the cowboy headgear in Texas history. HB 2918 from Rep. Jason Villalba (R-Dallas): Would make private citizens photographing or recording the police within 25 feet of them a class B misdemeanor, and those who are armed would not be able to stand recording within 100 feet of an officer. HB 3916 from Jonathan Strickland (R-Bedford): Wouldcut off electricity and water to NSA facilities in Texas. SB 191 from Sen. Donna Campbell (R-New Braunfels): Would prohibit foreign ownership, control or management of the Alamo complex by a foreign entity such as the United Nations. HB 3389 from Rep. Senfronia Thompson (D-Houston): Would dramatically reduced the amount of beer craft breweries could sell with a self-distribution license. The number of barrels would fall from 40,000 annually to 5,000 annually. HB 336 from Rep. Tony Dale (R-Austin): Would allow people carrying an alcoholic beverage to enter or leave a stadium built no later than 1994 that seats at least 45,000 in a county with a population of more than 1.6 million or a stadium seating more than 6,000 in a county with a population of 420,000 or more that is adjacent to the county containing the state capitol. Travis and Williamson counties would meet the requirements. HB 150 from Rep. Dan Flynn (R-Canton):Would exempt Texas from Daylight Saving Time, HB 92 from Rep. James White (R-Woodville): Would make Bowie knives legal to carry. HB 1751 from Rep. David Simpson (R-Longview): Would exempt Texas from federal laws that violate the state constitution. HB 166 from Rep. Lyle Larson (R-San Antonio): Would provide auto stickers exempting drivers from wearing seat belts for medical reasons. HB 113 from Rep. Allen Fletcher (R-Tomball): Would prohibit performing or attempting to perform abortions on the basis of fetus gender. HB 138 from Dan Flynn (R-Canton): Would prohibit school boards from banning the 10 commandments. HB 161 from Lyle Larson (R-San Antonio): Would allow authorities to house prisoners in tents for the duration of their sentence. HB 1498 from Rep. Sarah Davis (R-Houston): Would allow students to possess and use sunscreen while at school and would allow teachers to help apply with parental consent. HB 3320 from Rep. Tony Tinderholt (R-Arlington):Would make gold and silver bullion legal tender in the state of Texas. HB 1106 from Rep. Larry Phillips (R-Sherman): Would rename the Texas Railroad Commission the Texas Energy Resources Commission. HB 72 from Rep. Craig Goldman (R-Fort Worth): Would prohibit cities and counties from selling police vehicles before removing sirens, lights and other law enforcement gear. Local and federal judges have declared a handful of Texas laws unconstitutional in recent years. But legislators dont seem eager to take all of them off the books. BREAKING: Texas Senate approves open-carry bill, A bipartisan effort is under way in Austin to eliminate a statute on hair braiding regulations declared unconstitutional last December. However lawmakers likely will maintain another unconstitutionalstatute  overturned more than a decade ago  that was designed to discriminate against the LGBT community. The U.S. Supreme Court ruled the law unconstitutional in 2003 in a landmark gay rights case (Lawrence vs. Texas) brought on by two Houston residents.Yet the statute has outlived the two plaintiffs in the case, John G. Lawrence (died in 2011) and Tyron Garner (died in 2006). And once again the Texas legislate has no serious desire to get rid of the anti-sodomy law that was struck down long ago, the Houston Chronicles Lauren McGaughy wrote Monday. Texas remains one of 13 states to maintain an unconstitutional anti-sodomy law, according to the Human Rights Campaign, an LGBT-advocacy group. The statute criminalizes deviate sexual intercourse with another individual of the same sex. Judges have determined a number of Texas laws unconstitutional, ranging from abortion restrictions to drinking beer cans on the river over the past few years. See the gallery above for controversial Texas laws that were declared unconstitutional. ]", "Date": "20150316", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/politics/texas/article/11-Texas-laws-that-courts-declared-6137512.php", "Title": "[12 controversial Texas laws that courts declared unconstitutional]"}