{"Content": "[Caption, Close, With a backstory as rich as an episode of \"House of Cards,\" the Rick Perry indictment can be a challenging case to keep up with. Here are some things you should know about whos involved, why and what happens next.  Who is Rosemary Lehmbe Lehmberg is the Travis County District Attorney. In 2013, she was arrested for drunk driving. After her arrest, a complaint was filed and Perry threatened to veto funding if she did not resign from the DA position. Lehmberg plead guilty to driving while intoxicated and served 45 days in prison, but kept her job. How did it start?While Lehmberg was in jail, the political pressure to resign from the district attorney position began to mount. Perry threatened to veto funding for the Public Integrity Unit if Lehmberg didnt resign. On June 14th, 2013, Perry followed through on the threat. A special grand jury was called to look into both Perrys veto threat and Lehmbergs arrest. It later found Lehmberg did not commit any wrongdoing in the process of her arrest and jail time and a judge ruled she was allowed to stay in office. What is Perrys histo Rick Perry has been the Republican Governor of Texas since 2000 and is widely believed to be planning for another presidential run after his failed attempt in 2012. This indictment is the first of a Texas governor since 1917. Who is on Perrys legal team?Mark Fabiani is the latest addition to the legal Dream Team Perry has assembled to fight his indictment. Fabiani comes to the team with experience working with Democrats, having served President Bill Clinton and Vice President Al Gore. Ben Ginsberg is most famous for working for President George W. Bush during his 2000 election run. Ginsberg and Fabiani fought on opposite sides of the fence for their candidat Tony Buzbee, a Houston-area attorney, leads the Perry legal team. Buzbee is often described as a tough and mean trial lawyer highly experienced with taking on big businesses and winning. David Botsford is an Austin attorney specializing in criminal defense. Bobby Birchfield, like Ginsberg, also is a former general counsel to President George W. Bush. Tom Phillips rounds out the legal team as a retired Chief Justice of the Texas Supreme Cour From left, David Botsford, Tony Buzbee, Bobby Birchfield and Ben Ginsberg (not pictured: Mark Fabiani), What is the Public Integrity Un The Public Integrity Unit is a department under the Travis County District Attorneys office. The role of this unit is to look into cases involving government crime such as corruption and fraud. What is the governor being charged wi A Travis County grand jury indicted the governor on two felony charges. Abuse of official capacity is a first-degree felony  and carries a five-to 99-year prison sentence while coercion of a public official is a third-degree felony and is punishable by two to 10 years in prison. What is Perrys take on the indictment?On the day Gov. Perry arrived at the Travis County Jail to take his booking photo and get fingerprints done, he delivered a short statement to the public sayi \"Im going to enter this courthouse with my head held high knowing that the actions I took were not only lawful and legal but right. If I had to do so, I would veto funding for the public integrity unit again. Im going to fight this injustice with every fiber of my being. And we will prevail. This indictment is fundamentally a political act that seeks to achieve at the courthouse what could not be achieved at the ballot box.\", , Whats next for Per The governor has already gone through the booking process, and entered a plea of not guilty. His legal team has also asked a judge to dismiss his indictment, claiming the case is an attack on his free speech rights. , Good, Good Bad, , Strange, , Strange, AUSTIN  A state judge Friday denied former Gov. Rick Perrys push for a list of people whose grand-jury testimony led to his indictment on abuse-of-power charges. Judge Bert Richardson said the prosecution is not required to produce those names, which Perrys lawyers had said he was entitled to get. Perry, who left the governors office last month after declining to run for re-election, has all but announced for the 2016 Republican presidential nod. He has dismissed the idea that the indictment will hurt his chances, calling it a \"badge of honor\" because he believes he acted properly. The indictment followed Perrys threat to veto state funding for the public corruption unit overseen by Democratic Travis County District Attorney Rosemary Lehmberg unless she resigned after serving time for a messy drunken-driving arrest. Lehmberg stayed in office, and Perry vetoed the money. Texans for Public Justice, a government accountability group, said he went too far in trying to force out a locally elected official and filed a complaint. A grand jury indicted him last August on two counts: abuse of official capacity, a first-degree felony punishable by five to 99 years in prison; and coercion of a public servant. RELATED:Perry indicted on two felony charges, Besides denying Perrys motion to get the witness names, Richardson set a schedule for prosecutors to provide relevant information to Perry in advance of a potential trial in the case  including any information that may be favorable to the former governors case. The judge said the information should be provided as soon as possible, or at least 21 days before any trial if one is set. Richardson also ordered that the prosecution have grand jury witness testimony transcribed if they may also testify at the trial. Richardson earlier denied Perrys efforts to toss the indictment. Perry has not asked for a stay while that ruling is appealed, according to the judges Friday order. RELATED:Judge refuses to toss out Perry charges, In his earlier ruling, Richardson said that the prosecution must amend the second count of the indictment to address a wording change. He said that special prosecutor Michael McCrum agreed to do that.]", "Date": "20150206", "Author": "[Peggy Fikac]", "Link": "http://www.chron.com/news/politics/texas/article/Judge-denies-Perry-request-for-grand-jury-6067187.php", "Title": "[Judge denies Perry request for grand jury witnesses]"}