{"Content": "[Caption, Close, San Antonio Mayor Ivy Taylor  (Photo by Rick Kern/Getty Images for HISTORY), Our big-city neighbor to the west elected a mayor last Saturday. Appointed Mayor Ivy Taylor became San Antonios first-ever elected African-American mayor, defeating in a runoff former state Sen. Leticia Van de Putte. Van de Putte, who also was the unsuccessful Democratic candidate for lieutenant governor last fall, won the general election with about 1,700 more votes than Taylor, with neither reaching the 50 percent margin to avoid a runoff. On Saturday, Taylor prevailed with 52 percent of the votes. A number of factors unique to San Antonio helps explain Taylors solid victory, and yet as Houston begins to pay attention to its own mayors race, some potential similarities are worth noting. The most obvious is turnout, or the lack thereof, particularly when it comes to Hispanic voters. In its general election, San Antonio fielded four capable and experienced candidates who represented a fairly broad demographic spectrum - an African-American woman with City Council and mayoral experience; a Mexican-American woman with 20 years of experience in the Texas Legislature; a Mexican-American male who, like Van de Putte, has held leadership positions in the Legislature; an Anglo male with years of experience in county government.  Although San Antonios municipal elections are officially nonpartisan, all four candidates in the race were Democrats at various points on the conservative-to-liberal spectrum. Taylor, a Yale-educated urban planning professor, was arguably the most conservative of the four. Despite a decent quartet of candidates from which to choose, only 12 percent of registered voters in a city of 1.3 million chose to exercise their vote in the general election, 14 percent in the runoff. That pathetic percentage means that roughly 9 out of 10 registered voters found something better to do than participate in self-government for their city. Low voter turnout is a problem Houston also has had in its own municipal elections and is likely to have again despite a diverse and interesting cadre of candidates. Except for the unfortunate fact that no female is running this time, the Houston mayoral candidates include an experienced City Council member; a former sheriff; a longtime leader in the Texas Legislature; a former small-town mayor and newspaper columnist; a former congressman and gubernatorial candidate; a former city attorney, and a businessman. Candidates include two African-Americans and one Hispanic. In San Antonio, a majority Hispanic city, turnout among Hispanic voters was particularly dismal. Taylor relied on North Side conservatives and evangelical voters who approved of her 2013 vote against a controversial nondiscrimination ordinance protecting the citys gay community, as well as her vote against a downtown street car system. Van de Puttes campaign manager said thousands of new voters participated in the runoff election, many of them Republicans who werent voting for Taylor as much as they were voting against her opponent. Van de Putte, who would have been the citys first Latina mayor, relied on Hispanic voters, who tend to vote  Democratic in San Antonio. They let her down. That pattern of Hispanic non-participation is a statewide problem. In fact, Hispanic turnout in Texas tends to be lower than elsewhere in the country. Its likely to continue in Houston too, unless some candidate or some issue galvanizes the electorate. Its hard to see who or what that might be, even though they probably could elect a candidate of their choosing, in Houston and elsewhere, if they voted in percentages comparable to African-Americans and Anglos. Meanwhile, in the words of San Antonio Express-News columnist O. Ricardo Pimentel, we have \"a government elected by the minority, their elections funded by an even tinier sliver of a wealthy minority and all allowed by the non-voting majority.\", Pimentel is talking about America in general, not just San Antonio. Regardless of who won last Saturday in the Alamo City, thats not the way democracy is supposed to work. ]", "Date": "20150617", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/What-will-it-take-6333872.php", "Title": "[What will it take?]"}