{"Content": "[Caption, Close, Republican presidential candidate Wisconsin Gov. Scott Walker speaks during a campaign event at a Harley-Davidson dealership Tuesday, July 14, 2015, in Las Vegas. COLUMBIA, S.C. (AP)  From her public statements of grief to removing the Confederate battle flag from outside her Statehouse office, South Carolina Gov. Nikki Haley has drawn wide praise since the massacre of nine black churchgoers from a historic Charleston congregation. Now the 43-year-old looks to her next role as the self-described host of a key early presidential primary, with the national attention feeding chatter about her potential as a running mate and as a voice for a Republican Party that needs more votes from women and minorities. Just how prominent she remains in 2016, though, depends on factors well beyond this latest chapter in Haleys intense, complicated rise from state representative to her tenure as South Carolinas first female and minority governor, a five-year stretch that has rankled many of her fellow Republicans. \"There are sometimes events in an elected officials life that transcend politics, and this certainly was one for Gov. Haley,\" said Ted Newton, who helped lead the research team that vetted vice presidential prospects for Mitt Romney in 2012. Newton praised Haleys \"skill and grace\" in recent weeks. Yet, he said, \"The fact that shes in the headlines briefly doesnt guarantee anything. If she stays on a short-list (for vice president), it will be because she survives more intense scrutiny.\", Besides, he said, more often than not, the deciding factor for a nominee picking a running mate is quite simple: personal and political compatibility. Wisconsin Gov. Scott Walker was campaigning Wednesday in South Carolina for the first time since formally launching his bid, the first out-of-state Republican candidate to visit since the Confederate flag came down Friday. According to her aides, Haley has met in recent months with Walker, Rick Perry, Jeb Bush, Chris Christie, Ted Cruz, Carly Fiorina, Bobby Jindal, Marco Rubio, Rick Santorum, and her hometown senior Sen. Lindsey Graham, fully 10 of the GOPs 15 prominent declared candidates. Haley refuses to discuss the massacre at Emanuel African Methodist Episcopal Church in the context of her future, and she maintains that her change of heart on the battle flag  she had steadfastly sidestepped questions about the banner despite longstanding calls for its removal  was not a political calculation. \"If people are talking about that, then Im not working hard enough to talk about the (Emanuel) families,\" Haley said in a recent interview with The Associated Press. \"I dont want to think about it or talk about it or even acknowledge it at this point.\", South Carolinas place as the first Southern presidential primary next February, weeks after Iowa and New Hampshire open the nominating process, offers a different reality. \"Everybody was going to covet Nikkis endorsement already,\" said Katon Dawson, a former state Republican Party chairman who backs the White House candidacy of Perry, the former Texas governor. \"Now business is really going to pick up for her.\", Haley, the daughter of Indian immigrants, first garnered national attention in 2010, when she won a bruising Republican primary and a competitive general election. She has sought to define her administration on job creation, primarily through the decisions by BMW, Mercedes-Benz, Volvo, Boeing and a host of tire makers to establish or expand plants in South Carolina. But shes also had to fend off ethics complaints and routinely battles with her fellow Republicans in the Legislature on tax and budget issues. In the weeks leading up to 2012 presidential primary, Haley endorsed Romney, who went on to lose South Carolina. The move angered tea party conservatives critical to Haleys 2010 election, but established her as a team player for the national party. State Rep. Rick Quinn, who has aligned with Haley in her fiscal fights, said the governor faces \"jealousy\" in the Republican-controlled state. But he said presidential candidates should take note of the governing skill she demonstrated in cajoling lawmakers to remove the battle flag. \"To get 170 politicians to come along with her was a tough task,\" Quinn said, adding, \"She did a lot more than just go have press conferences. She brought us in. ... She showed that shes more than just a talking head or a mouthpiece.\", The decision also helps presidential candidates who now wont have to answer uncomfortable questions about the banner, as candidates have faced in previous election years. Recalling a conversation she had with Walker about the flag after the church attack, Haley said she told him, \"If you have any uncomfortable things, well help you get through it, but Im going to take care of this.\", ", "Date": "20150718", "Author": "[Bill Barrow and Meg Kinnard, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Charleston-massacre-flag-debate-put-Haley-in-6385496.php", "Title": "[Charleston massacre, flag debate put Haley in 2016 spotlight]"}