{"Content": "[Caption, Close, FILE - In this photo March 22, 2013 file photo, the exterior of the Internal Revenue Service (IRS) building in Washington. The IRS provided poor customer service during this years tax filing season as taxpayers struggled with a rise in identity theft and complications related to President Barack Obamas health law, a government watchdog said Wednesday. A new report by the National Taxpayer Advocate says the IRS has been hampered by budget cuts. WASHINGTON (AP)  Hello? Hello? Customer service at the IRS hit new lows this year, just as taxpayers were grappling with a wave of identity theft and new requirements under President Barack Obamas health law. A report issued Wednesday by the National Taxpayer Advocate says the IRS has been hampered by years of budget cuts, which have diminished customer service and hobbled enforcement. The timing of the budget cuts was bad, the report said. The IRS blocked nearly 1.6 million suspicious tax refunds this year because of concerns about identity theft  more than double the number from a year ago. About a third of the refunds turned out to be legitimate, but for long stretches during the tax season, fewer than 10 percent of callers could get through to an IRS help line. \"For the majority of taxpayers who filed their returns and did not require IRS assistance, the filing season was generally successful,\" said the report by Nina E. Olson, the taxpayer advocate. \"For the segment of taxpayers who required help from the IRS, the filing season was by far the worst in memory,\" the report said. \"To a significant degree, the IRSs shortcomings are budget-driven.\", The taxpayer advocate is an independent office within the IRS. Overall, only 37 percent of people who called the IRS seeking to talk to a person reached one, the report said. Thats the lowest rate over the past decade, by far. For those who got through, the average time on hold was 23 minutes. About 50 million callers reached out to the IRS for help during the tax season. Help lines were so overloaded that the system hung up on 8.8 million callers, the report said. Thats a huge jump from last year, when the IRS hung up on 544,000 callers. The IRS calls the hang-ups \"courtesy disconnects,\" because the system hangs up early in the call, rather than making callers wait on hold, only to be disconnected later. \"It is important to note that the IRS must carefully balance limited resources to meet its dual mission of providing taxpayer service and enforcing the tax laws,\" the IRS said in a statement. \"With 75 percent of our budget being personnel, and one-third of our workforce providing taxpayer service, the continuing cuts to our budget have severely hampered our ability to provide taxpayers with the services they need and deserve.\", The report by the taxpayer advocate noted that taxpayer services suffered just as Americans were faced with new requirements under the health law. For the first time, taxpayers had to tell the IRS whether they had health insurance the previous year. Millions who received government subsidies to pay for premiums had to report those on their returns. Through April, about 6.6 million taxpayers had to pay fines because they didnt have health insurance, the report said. The fines averaged $190. Researchers identified more than 300,000 taxpayers who overpaid their fines, the report said. Most of these taxpayers didnt owe fines because their incomes were low enough to qualify for exemptions. A total of 10.7 million taxpayers claimed they were exempt from the fines. About 2.6 million families said they received subsidies to help pay for premiums. The subsidies come in the form of tax credits. They averaged $3,000 per tax return, for a total of about $7.7 billion. Overall, the IRS has done \"a commendable job\" implementing the initial stages of the health law, despite budget cuts, the report said. Republicans in Congress adamantly oppose Obamas health law, so some have been working to starve the IRS of funds just as its role in implementing the law ramps up. Congress has cut the agencys budget by $1.2 billion since 2010, and House Republicans are proposing more cuts next year. Congressional Republicans have been at odds with the IRS ever since the tax agency acknowledged that agents had improperly singled out conservative groups for extra scrutiny when they applied for tax-exempt status during the 2010 and 2012 elections. Since then, the IRS has streamlined the process of filing for tax-exempt status under section 501(c)(3) of the tax code. In Wednesdays report, Olson said agents are now approving applications, \"often based on insufficient information.\", Last year, the IRS approved 94 percent of applications for 501(c)(3) status, which allows donors to deduct contributions. The number of applications approved  94,400  was more than twice as many as the year before. ", "Date": "20150719", "Author": "[Stephen Ohlemacher, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Watchdog-Budget-cuts-lead-to-poor-taxpayer-6385899.php", "Title": "[Taxpayer service hits new low at IRS as 'Obamacare' kicks in]"}