{"Content": "[Caption, Close, Republican presidential candidate former Florida Gov. Jeb Bush speaks during a town hall meeting on Monday, Aug. 17, 2015, in Columbia, S.C. Republican presidential candidate, former Florida Gov. Jeb Bush speaks during a town hall meeting on Monday, Aug. 17, 2015, in Columbia, S.C. Click through the following photos to learn more about the declared 2016 presidential candidates. Jeb Bush, Ben Carson, Chris Christie, Hillary Clinton, Sen. Ted Cruz, Carly Fiorina   Rick Perry  CAMPAIGN SUSPENDED, Rick Perry  CAMPAIGN... Marco Rubio, Sen. Bernie Sanders, Rick Santorum , ATLANTA (AP)  Republican presidential hopeful Jeb Bush said Tuesday that the government should have broad surveillance powers of Americans and private technology firms should cooperate better with intelligence agencies to help combat \"evildoers.\", At a national security forum in the early voting state of South Carolina, Bush put himself at odds with Republican congressional leaders who earlier this year voted to end the National Security Agencys bulk collection of phone records. The former Florida governor said Congress should revisit its changes to the Patriot Act, and he dismissed concerns from civil libertarians who say the program violated citizens constitutionally protected privacy rights. \"Theres a place to find common ground between personal civil liberties and NSA doing its job,\" Bush said. \"I think the balance has actually gone the wrong way.\", Bush also said the U.S. should send more troops  he didnt say how many  and equipment to eastern European nations in response to Russias increasingly aggressive posture in the region. He said Russian President Vladimir Putin should know that his \"adventurism\" comes with \"a price to pay.\", \"Rather than reacting to the bad behavior, I think we need to be more forward-leaning as it relates to what the consequences will be,\" Bush said. The remarks were part of Bushs ongoing efforts to pitch an aggressive foreign policy as he struggles to break out of a crowded Republican presidential primary in which businessman and former television reality star Donald Trump has garnered much of the attention. Pushing a hawkish foreign policy is a staple of Republican presidential politics. The exception is Kentucky Sen. Rand Paul, and even the libertarian-leaning senator has refused to take military action off the table as he argues for a reduced American footprint around the world. Yet for Bush, the discussion comes with particular challenges as he tries to distance himself from former President George W. Bush, the candidates brother, who signed the Patriot Act into law and oversaw the 2003 invasion of Iraq. Congress voted in June to end the bulk collection of American phone records under the Patriot Act, a controversial program that NSA contractor Edward Snowden disclosed publicly in 2013. The Obama administration announced recently that the agency later this year would destroy all the remaining records that already had been collected. Bush doubled-down Tuesday on his assertions that there is \"no evidence\" the data collection violated civil liberties. \"Ive found not one\" case, he said. The Privacy and Civil Liberties Oversight Board, an independent bipartisan agency, declared NSAs phone records collections program illegal in 2014, and a federal court of appeals reached the same conclusion earlier this year. A May analysis from the Justice Department found that FBI agents interviewed by the inspector generals office \"did not identify any major case developments\" that came from using Section 215 that allowed the bulk records collection. Bush also criticized private technology firms for using encryption to make it harder for their customers to be surveilled. \"It makes it harder for the American government to do its job while protecting civil liberties to make sure evildoers arent in our midst,\" he said. Noting that companies like Google are getting pressure from customers, Bush said \"market share ... should not be the be-all-end-all,\" and he called for \"a new arrangement with Silicon Valley in this regard.\", Separately, Bush told CBS News that he disagreed with rival Donald Trump on the birthright of children born in the United States to parents who are immigrants living in the country illegally. \"Thats a constitutional right,\" Bush said. \"Mr. Trump can say hes for this because people are frustrated that its abused. We ought to fix the problem rather than take away rights that are constitutionally endowed.\", Bush also opposed Trumps idea of a fence or wall along the border. \"Its not realistic to create a fence in places where fences cant be built. Youd have people, American citizens, on the south side of the fence in some places. Or theyre on the wrong side of the fence,\" Bush said. -----, Follow Barrow on Twitter at https://twitter.com/BillBarrowAP .]", "Date": "20150819", "Author": "[Bill Barrow, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Jeb-Bush-NSA-needs-broader-powers-to-combat-6451146.php", "Title": "[Jeb Bush: NSA needs broader powers to combat 'evildoers']"}