{"Content": "[Caption, Close, , Which candidates do women donors love?, 1. Hillary Clinton -49.8 percent of funds from female donors, 2. Ben Carson -37.5 percent of funds from female donors, 3. Carly Fiorina -36.1 percent of funds from female donors, 4. Rick Perry -35.8 percent of funds from female donors, 5. Bernie Sanders -35.5 percent of funds from female donors, 6. Jeb Bush -32.9 percent of funds from female donors, 7. Marco Rubio -31.5 percent of funds from female donors, 8. Ted Cruz -30.5 percent of funds from female donors, 9. Martin OMalley - 28.9 percent of funds from female donors, 10. Lindsey Graham -25.2percent of funds from female donors, 12. Lindsey Graham -20.5percent of funds from female donors, 13. Donald Trump - 18.7percent of funds from female donors, Jeb Bush, while joining other GOP presidential candidates at the Southern Baptist Convention on Tuesday, made a remark that could haunt him all the way through the 2016 election. Hes already trying to walk about his comments on womens health issues. The incident occurred as Bush discussed abortion and recent undercover videos by an anti-abortion group thatpurport to show Planned Parenthood selling fetal parts.The former Florida governor hit on all the conservative talking points. He said the next president should defund Planned Parenthood and discussed creating a culture of life. RELATED: Undercover Planned Parenthood video focuses on Houston, Then Bush tacked on an addendum that could hurt him if he scores the Republican nomination. Said the top GOP candidate: Im not sure we need a half a billion dollars on womens health issues. Hillary Clinton jumped on the comment. .@JebBush: You are absolutely, unequivocally wrong. https://t.co/a6O17dlEh4, Remarkably, Bush made the comment while trying to explain how his plan to defund Planned Parenthood shouldnt be considered a war on women. Here are his full comments:, The argument against this is its a war on women and youre attacking womens health issues. You could take dollar for dollar  although Im not sure we need half a billion dollars on womens health issues  but if you took dollar for dollar there are many extraordinarily fine  community health organizations that exist, federally sponsored community health organizations that exist to provide quality care for women on a wide variety of womens health issues. But abortion should not be funded by the government. Although early in the election cycle, Bushs aside could hinder his campaign in the same way Mitt Romneys 47 percent\" remark or binders full of women remarks damaged his chances in the previous presidential election. That sound bite still that tarnishes his image with a large portion of the U.S. population. READ MORE: Republicans find out who made the cut for first GOP debate, Planned Parenthoods federal dollars do not go toward providing abortions. The government banned federal money going toward abortions in almost all cases in 1976. Heres a video of Jeb Bush speaking at the conference with the comments on womens health issues:]", "Date": "20150804", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/politics/election/article/Jeb-Bush-I-m-not-sure-we-need-half-a-billion-6424846.php", "Title": "[Jeb Bush: 'I'm not sure we need half a billion dollars for women's health issues.']"}