{"Content": "[A lengthy profile of Sen. Ted Cruz (R-TX) was published in the June 30 issue of the New Yorker. The story, which was written by Jeffrey Toobin, begins with Cruz, an outspoken conservative who is widely considered a potential GOP candidate in the 2016 presidential election, explaining why he doesnt think a moderate Republican will win that race. \"It is amazing that the wisdom of the chattering class to the Republicans is always, always, always Surrender your principles and agree with the Democrats,\" Cruz told Toobin. \"Thats been true for my entire lifetime. The chattering classes have consistently said, You crazy Republicans have to give up on what you believe and become more like Democrats. And, I would note, every time Republicans do that we lose.\", According to Toobin Cruz cited Presidents Richard Nixon and Ronald Reagan as examples of conservatives who won elections and President Gerald Ford as a moderate who lost. \"President George Herbert Walker Bush ran as a strong conservative, ran to continue the third term of Ronald Reagan, continue the Ronald Reagan revolution,\" Cruz said. \"Then he raised taxes and in 92 ran as an establishment moderatesame candidate, two very different campaigns. First one won, second one lost. In 1996, you got Bob Dole; 2000 and 2004, you have George W. Bush; 2008, John McCain; 2012, Mitt Romney. And what does the entire D.C. Republican consulting class say? In 2016, we need another establishment moderate! Hasnt worked in four decades. But next time will be the time!\", Later on in the story, Toobin questioned Cruzs theory. \"Cruzs historical narrative of Presidential politics is both self-serving and questionable on its own terms. Conveniently, he begins his story after the debacle of Barry Goldwater, a conservative purist whom Cruz somewhat resembles,\" wrote Toobin. \"Nixon ran as a healer and governed, by contemporary standards, as a moderate, opening up relations with China, signing into law measures banning sex discrimination, expanding the use of affirmative action, establishing the Environmental Protection Agency, and signing the Clean Air Act. Reagans record as governor of California included support for tax increases, gun control, and abortion rights, so he sometimes appeared less conservative than his modern reputation suggests. George W. Bush won (if he won) as a self-advertised compassionate conservative.\", Toobin also suggested Cruzs prediction a conservative Republican would have a strong shot at the White House \"has not evoked much fear in Democrats.\" He quoted one anonymous \"Democratic senator\" who described Cruz as the Walter Mondale of the GOP. Mondale, a Democratic former vice president, badly lost the 1984 presidential election to Reagan while running as an unabashed liberal. \"We all hope he runs,\" the senator said of Cruz. Join the conversation about this story , See Also:]", "Date": "20140623", "Author": "[Hunter Walker, provided by]", "Link": "http://www.chron.com/default/article/Here-s-Why-Ted-Cruz-Thinks-A-Moderate-Republican-5572454.php", "Title": "[Here's Why Ted Cruz Thinks A Moderate Republican Won't Win In 2016]"}