{"Content": "[Caption, Close, Republican presidential candidate, Sen. Ted Cruz, R-Texas, speaks to reporters in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, greets supporters in Little Rock, Ark. Wednesday, Aug. 12, 2015. A woman wearing a Cruz for President tee shirt holds a flag as Republican presidential candidate, Sen. Ted Cruz, R-Texas, speaks while wearing his cowboy boots in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, campaigns in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, speaks at a rally in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, walks to a media availability by his campaign bus in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, greets supporters in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate Sen. Ted Cruz, R-Texas, speaks at a rally in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate Sen. Ted Cruz, R-Texas, poses for a photo with Shannon Hanks of Cabot, Ark. while campaigning in Little Rock, Ark. Wednesday, Aug. 12, 2015. LITTLE ROCK, Ark. (AP)  Texas Sen. Ted Cruz enlisted the help of the legislator behind Arkansas religious objections law on Wednesday as the Republican presidential hopeful tried to rally support in rival Mike Huckabees home state. Cruzs Arkansas campaign is being co-chaired by state Rep. Bob Ballinger, who sponsored a state law aimed at preventing government from infringing on someones religious beliefs without a compelling reason. The measure was quickly rewritten in the final days of the legislative session over concerns an initial version was anti-gay. Cruz and the other GOP hopefuls defended Arkansas and Indiana, which both faced a backlash over their religious protection measures. Ballinger said Cruzs support for the measure wasnt the main reason for his support, \"Theres no doubt its a total package,\" Ballinger said. \"Hes got that, hes also a fiscal conservative. He also just understands the people and is willing to vote and work for the people, which is what excites me about him.\", The Texas senator touted Arkansas role in the 2016 presidential contest, noting it had joined other southeastern states in moving up their nominating contests to early March. \"Arkansas is going to play a critical role in the 2016 Republican presidential nomination,\" Cruz told a crowd of hundreds gathered outside the state Republican Partys headquarters in downtown Little Rock. Touting himself as a \"real and genuine conservative,\" Cruz called for the repeal of the federal health care overhaul and said he would scrap the Common Core education standards that have come under fire from many in his party. Huckabee, who served 10 years as Arkansas governor, launched his campaign in his hometown of Hope in May. But Republicans hope moving the states primary up to March from May will draw more presidential hopefuls to the state. Billionaire and Republican presidential hopeful Donald Trump headlined a fundraiser for the state GOP last month, the day before Democratic hopeful Hillary Rodham Clinton  who served as the states first lady for 12 years  spoke at a state party fundraiser. Huckabee has won endorsements from most of the states top Republicans, including Gov. Asa Hutchinson and nearly all of the states congressional delegation. But Cruzs \"leadership team\" announced this week includes some former allies of the governor, including Curtis Coleman, who managed Huckabees unsuccessful U.S. Senate bid in 1992. Cruz also planned stops in Russellville and Van Buren, where he was set to headline the Crawford County Republican Partys Lincoln Day Dinner. The Family Council Action Committee, a conservative group, initially said it planned at the dinner to give \"Power of Courage\" awards to Republican Reps. Charlene Fite and Justin Harris at Wednesdays dinner in honor of legislation they sponsored during this years session. But later Wednesday, Committee President Jerry Cox said the awards wouldnt be presented to the two lawmakers at the event at the request of the dinners organizers. Crawford County Republican Party Chairman Mark Shaffer said the awards presentation was never part of the dinners program. Harris earlier this year admitted he gave his adopted daughters to a man who later admitted to sexually abusing one of them, which prompted the Legislature to ban the \"re-homing\" of adopted children. Harris has since announced he wont seek re-election this year. ", "Date": "20150812", "Author": "[Andrew Demillo, Associated Press]", "Link": "http://www.chron.com/news/texas/article/Cruz-enlists-help-of-religious-objections-law-s-6440366.php", "Title": "[Cruz enlists help of religious objections law's sponsor]"}