{"Content": "[Caption, Close         , AUSTIN  With mere hours left in Texas 84th legislative session, more than 800 bills have been sent to Gov. Greg Abbott for his signature, leaving nearly 10,000 more in the political graveyard. Lawmakers will tell you the legislative process is not designed for passing bills. In fact, some insist it is exactly the opposite. The sheer number of bills filed each session does not bode well, as lawmakers struggle for their voices  and bills  to be heard. For some lawmakers, the death of a bill, or even the suggestion of imminent doom, can be an emotional experience. Security officers had to break up an intense confrontation between Rep. Jonathan Stickland, R-Bedford, and Rep. Byron Cook, R-Corsicana, last week after one of Sticklands bills failed to make it onto the House calendar before a decisive deadline. Emotions  may run higher still when a bill once presumed dead is resurrected. After hearing that a point of order that killed one of his bills was reversed, Rep. Jason Isaac, R-Dripping Springs, was spotted crying at his desk on the House floor before joining in a prayer circle with a number of his colleagues. Some see their bills die repeatedly. For the fourth straight legislative session, a bill to ban texting while driving died after Sen. Judith Zaffirini, D-Laredo, could not secure enough votes to bring it to the Senate floor for debate. A bill mirroring the federal Lilly Ledbetter Act was vetoed by former Gov. Rick Perry last session and was killed again this year in a Senate committee. Sometimes, the filing of a bill is merely the start of a conversation. The bills below garnered headlines, but failed to capture enough votes. Some never made it out of committee, others were shot down by a vote on the floor, and some fell victim to parliamentary tactics in the face of end-of-session deadlines. See some of the most prominent bills that didnt make it to the governors desk and why in the gallery above.]", "Date": "20150601", "Author": "[Madlin B. Mekelburg, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/article/Texas-bills-that-died-this-legeslative-session-6299466.php", "Title": "[Dozens of prominent bills died in Texas' legislative session]"}