{"Content": "[Caption, Close, Border wall \"I will build a great great wall on our southern border and Ill have Mexico pay for that wall.\"Keep clicking to learn more about the comments that are making Donald Trump persona non grata in Mexico, and read above to see the memes taking on Trump. Mexican immigrantsWhen Mexico sends its people, theyre not sending their best.\", Immigration stereotypes\"Theyre sending people that have lots of problems and theyre bringing those problems with us.Theyre bringing drugs, theyre bringing crime, theyre rapists, and some, I assume, are good people. Twitter attacksTrump followed up his anti-Mexico comments just a few days later on Twitter. Stoking border fears\"Druggies, drug dealers, rapists and killers are coming across the southern border. When will the U.S. get smart and stop this travesty?\",  Bashing Mexico\"Mexico is killing the United States economically because their leaders and negotiators are FAR smarter than ours. But nobody beats Trump!\", Some \"love\"\"I like Mexico and love the spirit of Mexican people, but we must protect our borders from people, from all over, pouring into the U.S.\", Firing off on MexicoFor those who thought Trumps  recent slams against Mexico were his first, theyre wrong. Earlier this year, the businessman made his thoughts clear on Twitter.Keep clicking to see what he said. Oscars recapTrump had this to say in a morning Tweet on Feb. 24:\"The Oscars were a great night for Mexico & why notthey are ripping off the US more than almost any other nation.\", Legal disputePart of the same  post-Oscars Twitter rant, he gave some background: \"I have a lawsuit in Mexicos corrupt court system that I won but so far cant collect. Dont do business with Mexico!\", Donald Trumps no-holds-barred march to the White House trampled over another Republican leader on Tuesday. The latest GOP member to bear the wrath of Trump: Lindsey Graham. The South Carolina senator called Trump a \"jackass.\" In turn, the well-coiffed businessman gave out Grahams alleged cellphone number to a group of supporters. Thats the gall it takes to be the top right-wing candidate in the 2016 election apparently. READ MORE: Donald Trump is surprise GOP frontrunner, The real estate magnate has no time for decorum and hes not afraid of crossing any line  even when it comes to messing with his own party. Trump has slammed Rick Perry and Jeb Bush on immigration. He stated Arizona Sen. John McCain was not a war hero since he got captured in North Vietnam, and spent five years in a POW camp. Even Ted Cruz seems afraid to mess with him. RELATED: Rick Perry, Donald Trump enter vicious political sparring match, Phone calls to the number go to voice mail after a few rings. Grahams voice mail box is now full. @GingerGibson rings a few times then goes to voice mail. Womans voice says \"Lindsey Graham\" is not available, While calling Graham an idiot, Trump also gave a very-backhanded compliment to Texas ex-governor. He doesnt seem like a very bright guy. He actually probably seems to me not as bright as Rick Perry, Trump said, while speaking in Grahams home state. He also claimed that Graham once asked him for help to get a segment on Fox News. Trump, who rises in the polls every time he makes a new offensive remark, will join nine other Republican candidates on stage at the first GOP debate on August 6 in Cleveland. UPDATE:, Probably getting a new phone. iPhone or Android?, Graham is in the market for a new phone.]", "Date": "20150721", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/politics/article/Donald-Trump-gives-out-Lindsey-Graham-s-phone-6397438.php", "Title": "[Donald Trump gives out Lindsey Graham's phone number following insult]"}