{"Content": "[Caption, Close, Texas State Senator and gubernatorial candidate Wendy Davis during after her speech Great Schools: Great State at the Baker-Ripley Neighborhood Center Wednesday, Feb. 12, 2014, in Houston.( James Nielsen / Houston Chronicle ), AUSTIN - State  Sen. Wendy Davis gave a fiery speech to volunteers from around Texas Saturday that laid out key themes guiding her campaign for governor, including an effort to define Republican Attorney General Greg Abbott as an out-of-touch \"insider.\" , \"Here we are together, to make history, to do something magical in this state,\" Davis told the grass-roots leaders gathered at an Austin Community College campus in East Austin. \"We have a choice this fall. And that choice is very, very clear. We can elect Greg Abbott, another insider who is not working for you,\" she said. \"Or we can elect a governor who will fight for all hardworking Texans.\", Targets education plan, Davis highlighted issues she has used against Abbott. She took direct aim at his education plan, which she called a feeble one that wouldnt properly serve all students. It was one more stop in the governors race that revved up months ago, with Davis and Abbott taking direct aim at each other well before formally winning their party nominations for governor in March.  , Abbott - a longtime statewide officeholder - said he wants to lead Texas to national greatness in key areas including education. He has sought to portray Davis as a liberal whose policy proposals are ill-defined and would harm the success Texas has enjoyed under a long stretch of Republican leadership. Defends her ethics, His campaign also has accused Davis of \"questionable ethics\" in conducting her work as a lawyer while serving as a state senator. She said she has behaved ethically. In Texas part-time Legislature, members often balance public service with private jobs. Abbotts staunch opposition to abortion - he appears to rule out the procedure even when pregnancies result from rape or incest - also is in stark contrast to Davis fight against tighter abortion restrictions that she said will interfere with womens access to health care and their decision-making   , The volunteer leaders gave Davis an enthusiastic reception as she looked ahead to next Saturday, when she said shell be in San Antonio to help her campaign go door-to-door across Texas. \"This army that youve recruited is on the march,\" Davis said, citing 14,225 volunteers around the state. \"People - Texas - they dont know whats coming.\"]", "Date": "20140405", "Author": "[Peggy Fikac]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Davis-Texas-doesn-t-know-what-s-coming-5379266.php", "Title": "[Davis: Texas doesn't know what's coming]"}