{"Content": "[Caption, Close, As U.S. policy toward Cuba softens, myriad changes are taking place across the island nation. More than 50 years ago, before Fidel Castro took power, Cuba was a playground for American tourists. FILE - In this Jan. 19, 2015 file photo, a Cuban and American flag wave from the balcony of the Hotel Saratoga in Havana. President Barack Obama will announce July 1 that the U.S. and Cuba have reached an agreement to open embassies in Havana and Washington, a senior administration official said.  (AP Photo/Ramon Espinosa, File), Steadily, wealth appears to be growing in Cuba, and smart phones are proliferating. As we rode around Havana in late May with a Cuban friend, his excitement was palpable. He had recently opened a highly successful paladar, or restaurant, was driving around in a shiny new car, constantly fielding calls on his cell phone and talking nonstop about starting more businesses in the crumbling, but still beautiful Cuban capital. \"Things are changing,\" he said. \"There is still much that needs to be done, but things are changing.\", It was easy to see why he thought so. My wife, Elena, and I were impressed by his material goods, his entrepreneurial spirit and his paladar, which had an American feel and a clientele that was primarily Cuban, but surprisingly affluent. Like our friend, some had cars, fashionable clothes and - always - a nice cell phone. By our standards, his prices were low, but paying the equivalent of $2 or $3 for a sandwich is a lot in a country where the average monthly salary is $20. It was clear that economic reforms begun by President Ral Castro in 2008 have had an effect. Without overstating it, there is more money around than when we lived in Havana from 2008 to 2013. Cubans can buy and sell homes and cars now and, due to revised U.S. regulations, get more remittances from friends and relatives in America. Both have generated cash and commerce, but the larger change has been the encouragement of private business by the Communist government, including the paladares and \"casas particulares,\" or bed and breakfasts, sprouting up everywhere. There are now more than 500,000 people on the island licensed for self-employment, or what Cuba calls \"cuentapropismo,\" versus 157,000 people five years ago. So things are changing, but it is still Cuba, which means most of the countrys 11 million people have little money, work for the government, live in downtrodden circumstances and exist in a time warp going back to 1959, the year Fidel Castro took power. It also means that if youve got your own business, youve got to deal daily with inefficiency, spotty supplies and excessive taxation and regulation. The latter is official policy - the Communist government wants private enterprise, but it doesnt want too much individual wealth or income disparity. Our friend, who asked not to be identified, said he often spends his entire day going to markets seeking food for his menu. He must comply with a stack of regulations that require endless paperwork and, worse, his business is examined by numerous inspectors who often demand a bribe. There are also nuisances like regular blackouts, which according to Jorge Pion, a Cuban oil expert at the University of Texas at Austin, are the indirect result of increased electricity demand from the many new businesses. Cuba cant afford to buy more oil, so \"they control energy demand by purposely switching the power off,\" he said. Of course, our main topic of conversation with everyone was the U.S.-Cuba rapprochement. I found Cubans reserved about their expectations, but happy in the belief that the old Cold War impasse was ending and their lives would improve as a result. And despite years of anti-American propaganda, they like America and Americans. \"We are waiting for the Americans to come. We hope there is an avalanche of them,\" a casa particular owner told me. We had heard Cuba is now packed with Americans, which wasnt quite true, but there are definitely many more. They were a rare sight when we lived there, but this time we saw them everywhere, piling in and out of tour buses. The last Cuban government figures showed 92,000 Americans visitors in 2013, not including approximately 350,000 Cuban Americans who the government considers nationals. It is estimated there are 20 percent more Americans this year. Some of them are among a wave of foreigners pouring in looking for business opportunities. On our first night in town, we met an Estonian woman searching for a 30-room mansion to convert into a boutique hotel and spa aimed at Americans. It all reminded me of a conversation I had in 2006 with a British diplomat in Havana who said he paid little attention to the then-endless U.S.-Cuba sparring. \"My opinion is that its all meaningless because in 25 years Cuba will be an American playground again,\" he said, referring to how the island was before Fidel Castro took power. He should be right. Cuba is a beautiful tropical island just 90 miles from Florida, and therefore a natural destination for American tourists. President Obamas announcement Wednesday that the U.S. and Cuba will re-establish diplomatic relations for the first time in 54 years was a key first step. But whether full normalization comes - this will require that the U.S. end the trade embargo - likely depends primarily on who wins the next presidential election. I would just say this: The old policy of isolation and embargo accomplished nothing except to deeply entrench the current Cuban government. The new policy holds the possibility for change in a way the old one never could. There should be no turning back. , Franks, a Houston resident, was bureau chief for Reuters from 2008 to 2013.]", "Date": "20150703", "Author": "[Jeff Franks]", "Link": "http://www.chron.com/opinion/outlook/article/Franks-New-scenes-in-Cuba-hint-at-what-could-be-6365755.php", "Title": "[Franks: New scenes in Cuba hint at what could be]"}