{"Content": "[Caption, Close, FILE - In this Jn. 24, 2015 file photo, Democratic National Committee Chairwoman, Rep. Debbie Wasserman Schultz, D-Fla. speaks during a news conference in Des Moines, Iowa. The Democratic National Committee barely has more cash than it does IOUs, and it is being outraised month after month by its Republican counterpart. Its $24 million debt from the 2012 presidential election, only recently paid down, has squeezed investments in the next White House race. Underdeveloped party resources such as voter data files could become a serious disadvantage for the eventual nominee, particularly if that person is not front-runner Hillary Rodham Clinton, who would enter a general election contest with her own outreach network. FILE - In this Aug. 26, 2016 file photo, Democratic presidential candidate Hillary Rodham Clinton speaks in Ankeny, Iowa. The Democratic National Committee barely has more cash than it does IOUs, and it is being outraised month after month by its Republican counterpart. Its $24 million debt from the 2012 presidential election, only recently paid down, has squeezed investments in the next White House race. Underdeveloped party resources such as voter data files could become a serious disadvantage for the eventual nominee, particularly if that person is not front-runner Hillary Rodham Clinton, who would enter a general election contest with her own outreach network. FILE - In this Aug. 23, 2015 file photo, Democratic presidential candidate Sen. Bernie Sanders, I-Vt. speaks in Salem, N.H.  The Democratic National Committee barely has more cash than it does IOUs, and it is being outraised month after month by its Republican counterpart. Its $24 million debt from the 2012 presidential election, only recently paid down, has squeezed investments in the next White House race. Underdeveloped party resources such as voter data files could become a serious disadvantage for the eventual nominee, particularly if that person is not front-runner Hillary Rodham Clinton, who would enter a general election contest with her own outreach network. MINNEAPOLIS (AP)  The Democratic National Committee barely has more cash than it does IOUs, and it is being outraised month after month by its Republican competitor. Its $24 million debt from the 2012 presidential election, only recently paid down, has squeezed investments in the next White House race. Underdeveloped party resources such as voter data files could become a serious disadvantage for the eventual nominee, particularly if that person is not front-runner Hillary Rodham Clinton, who would enter a general election contest with her own outreach network. Those fundraising realities are top of mind as Democratic officials, donors and activists meet Thursday through Saturday in Minneapolis. Clinton, Vermont Sen. Bernie Sanders, former Maryland Gov. Martin OMalley and former Sen. Lincoln Chafee of Rhode Island are scheduled to speak to attendees Friday. Federal Election Commission reports tell a disappointing story for the party: The DNC collected $36.5 million in the first six months of the year and had almost no money in special accounts, including one designated for its convention. It had about $7.6 million in available cash and $6.2 million in debts and loans. The Republican National Committee, coming out of years in the red, posted $63 million in receipts through June, leaving it with $16.7 million cash on hand and $1.8 million in debts and loans. Party fundraising dominance has flipped: At this point before the 2012 election, the DNC was outpacing the RNC. Republicans also have been far more active in using the accounts created last year by Congress that enable donors to give at higher levels, investing about eight times what Democrats have. Rep. Debbie Wasserman Schultz, the DNCs chairwoman, said she isnt worried. \"We are building the organization now to make sure that whoever our ultimate nominee is, they are in the best possible position to win next November,\" she said in a statement, \"and we are confident we will have the resources we need.\", Raymond Buckley, chairman of the New Hampshire Democratic Party, said that while state parties will always want more, hes happy with the investments the national committee has made across the country. \"A successful 2016 is going to depend on whats on the ground locally,\" he said, adding that the DNCs assistance to state parties, in the form of enhanced voter files and leadership training, is \"light years\" ahead of where it was in previous years. But the DNCs financial situation has given others pause. The Clinton campaign delayed signing a joint fundraising agreement with the party, in part because of perceived disorganization at the DNC. The next nominee is likely to send a new leadership team to the DNC. On Thursday, the DNC and Clinton campaign completed their joint fundraising plan. The four other Democratic candidates are still in negotiations with the party officials. Such arrangements are mutually beneficial, enabling the nominee to use the partys resources while helping the DNC raise more money to invest in voter outreach and technology. The role of the parties has diminished over the past five years as super PACs and nonprofit policy groups that dont reveal their donors have risen to prominence. Unlike candidates and the political parties, those outside groups arent constrained by contribution limits. Donors now have more choices about where to send their money and often see outside groups as a better way to influence elections. President Barack Obama  the de facto leader of the Democratic Party  has contributed to the array of options. After his 2012 re-election, his campaign formed a policy shop called Organizing for Action rather than folding back into the Democratic National Committee. That group raised about $5 million in the first six months of the year and has maintained control of a social network and data set on millions of Democrats, making it somewhat of a second DNC. The DNC recently began using the groups email list  which at one point included 20 million addresses of Obama supporters  and Democratic officials said Thursday that theyve finalized a way to make it \"a key piece of infrastructure\" for the party. \"President Obama is fully committed to seeing a Democrat elected to the White House in 2016, and hes taking this important step to help make that future a reality,\" Matt Compton, DNCs digital director, said in a statement. Obama remains a top fundraising draw for the party. He has spoken at 19 DNC fundraisers this year, more than his Republican predecessor George W. Bush did in his seventh year of office. Obama also is on track nearly to match President Bill Clintons prodigious fundraising pace from 1999, when he attended 44 DNC fundraisers. \"The president is the most effective fundraiser there is,\" said Brendan Doherty, an associate professor at the U.S. Naval Academy, who researches presidential fundraising. \"No one in political life is able to command more donors, and no one can better serve the party.\", The DNC is poised to quicken its fundraising pace. Top party financiers meet Friday in Minneapolis. In late September, the DNC will host an LGBT gala in New York, a major fundraiser. And Democratic presidential debates, which begin in October, also may foster donor interest in the party. __, Follow Julie Bykowicz on Twitter at: http://twitter.com/bykowicz]", "Date": "20150829", "Author": "[Julie Bykowicz, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Democratic-Party-lags-in-money-before-6469012.php", "Title": "[Democratic Party lags in money before presidential year]"}