{"Content": "[Caption, Close                 , Texas stands to gain billions of dollars and thousands of jobs by offering legal status to qualified undocumented immigrants according to a fresh analysis. The Center for American Progress, a liberal think tank in Washington, D.C. crunched numbers state-by-state to predict the effects of two contested federal amnesty programsDeferred Action for Childhood Arrivals, DACA, and Deferred Action for Parents of Americans, DAPA10 years down the line. Currently, Texas leads a group of 25 states that sued the Obama Administration to block the presidents executive implementation of the immigration programs that would have given legal status to about 11 million undocumented people in the United States. RELATED:Federal judge blocks Obama immigration order, The Center concluded that the increased wages and more advanced training opportunities made available to 746,000 qualified people in Texas would trickle strongly through the state economy, yielding a more than $38 billion increase in the state GDB, $17.6 billion cumulative increase in earning of all state residents and 4,800 new jobs annually by 2025. \"When people get legal status their wages increase,\" said Philip Wolgin, associate director of immigration policy at the Center. \"That extra spending works its way through the economy and supports growth.\", But the study will join the ranks of dozens of opposing analyses filed by liberal and conservative groups which offer conflicting takes on the economic impacts of amnesty. One 2013 national study by the conservative Heritage Foundation claimed that legalized immigrants would draw trillions of dollars more from public support programs than they would pay in. That contradicts a 2006 government report by the Texas Comptroller, which found that \"state revenues collected from undocumented immigrants exceeded what the state spent on services, with the difference being $424.7 million.\" It said the absence of the states 1.4 million undocumented immigrants would cost Texas about $17.7 billion. RELATED:Where Harris Countys immigrants come from, A report from Bloomberg Business also said 1986 federal immigration reform, which gave amnesty to almost 3 million in the United States, became a long-term bolster for the nations economy, raising the wages of the millions affected by 15 percent in less than six years. The Center estimated that newly-sanctioned workers in Texas would see their earnings grow 8.5 percent based on an earlier Center study. Wolgin said thats because legal workers would be free to seek jobs that better suit their training, wouldnt get lower-than-legal wages under the table and would be empowered to combat wage theft and lack of overtime pay from employers. According to the analysis, Texas stands to gain more than any U.S. state but California through amnesty programs. That, Wolgin said, is based mainly on the number of currently unsanctioned workers who would be affectedCalifornia has the most, with 1.5 million, and Texas has second most with 746,000. Each of those figures represents people eligible for legal status under DACA and DAPAabout half of the undocumented population in each state. The extent of financial benefits wrought by bringing more workers into the state economy would depend on outreach programs that help immigrants enroll in federal programs. In February, a federal judge in Texas blocked the presidents move to grant legal status to qualified immigrants. In May, a federal appeals court dealt a blow to the administration, blocking implementation of the programs for at least a few years while the case plays out in courts.]", "Date": "20150623", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/houston-texas/texas/article/Texas-would-rake-in-billions-through-federal-6330328.php", "Title": "[Texas would rake in billions through federal amnesty programs DACA and DAPA, study concludes]"}