{"Content": "[Caption, Close, A recent poll shows the independent candidate Deez Nuts is gaining traction.  Donald Trump - 23.2percent,  Jeb Bush - 12.8 percent, Scott Walker0.6 percent, Mike Huckabee -6.6 percent, Ben Carson -6.6 percent, Ted Cruz -6.2 percent, Marco Rubio- 5.2 percent, Rand Paul- 4.8 percent,  Chris Christie - 3.4 percent, John Kasich- 2.8 percent, , Rick Santorum- 1.4 percent,  Bobby Jinda.2 percent, Carly Fiorina- 1.0 percent, Lindsey Graham- 0.4 percent, George Pataki- N/A, Remember when Donald Trump said during the presidential debate that if he wasnt the Republican nominee, hes open to running as an independent? Well, a recent poll shows his potential competition. \"Deez Nuts.\", Public Policy Pollingreveals Trump is leading presidential candidates in North Carolina. The poll shows Trump in the number one spot at 24 percent, followed by 14 percent for Ben Carson, 13 percent for Jeb Bush, and 10 percent for Ted Cruz. But at the very bottom of the poll, a far more amusing discovery was found. RELATED: \"Deez Nuts\" makes his first presidential bid, From Public Policy Polling:, Finally another declared independent candidate, Deez Nuts, polls at 9% in North Carolina to go along with his 8% in Minnesota and 7% in Iowa in our recent polling. Trump leads Clinton 40/38 when hes in the mix. Rather deez nuts then Trump pic.twitter.com/mOrBIdNzZ2, Indeed, Sir Deez Nuts is making a run for the grand Oval Office. How you may ask? Possible President Nuts has filed the proper paperwork with the Federal Election Commission. His competition includes about 535 other presidential hopefuls. The only thing that could make this news even more amusing is if \"Deez Nuts\" had beat out the Trumpinator completely. However, recent reports from The Daily Beast show that Deez Nuts doesnt appear to exist, but instead is 15 year-old Brady Olson, an Iowa farmboy. RELATED: \"Deez Nuts\" flashes before drivers on Texas highway, \"When I heard about the Limberbutt McCubbins (another presidential hopeful) story, I realized I could,\" Olson told The Daily Beast. The address used for the FEC paperwork to file for presidential candidacy has the address of 2248 450th Avenue in Wallingford, Iowa. A certain Deez Nuts doesnt reside there. Instead, it is Olson. Regardless of the start of Mr. Nuts presidency, social media has taken off with amusing, but mostly inappropriate, comments and support for the candidate. The VERY few appropriate memes are below. Secretly praying the Deez Nuts candidate from Iowa is this guy. pic.twitter.com/jIaj1f1TlQ, Deez Nuts is running for President, just like our founding fathers intended. http://t.co/b4rJOYInut pic.twitter.com/iMPGWliS2n, Click through the gallery above to see the other poll rankings.]", "Date": "20150819", "Author": "[Heather Leighton]", "Link": "http://www.chron.com/news/politics/article/North-Carolina-poll-show-Donald-Trump-leading-in-6454143.php", "Title": "[Poll shows Trump leading, followed by 'Deez Nuts']"}