{"Content": "[FRANKFORT, Ky. (AP)  Politicians who may have thought they wouldnt have to say much at all about gay marriage once the U.S. Supreme Court effectively legalized it now must answer a different question: Do you support Kim Davis?, The Rowan County clerk, who has become a darling of many conservatives despite being a Democrat, cited \"Gods authority\" and religious liberty in choosing jail time over issuing marriage licenses to same-sex couples. Some social conservatives have cast Davis as a hero, shifting the gay marriage debate from one about civil liberties  a matter that appeared to have been settled  to one about religious liberty. Former Arkansas Gov. Mike Huckabee, a Baptist preacher running for president but trailing badly in the polls, rushed to Davis side and said it was unfair the government would not accommodate her beliefs. A judge ultimately freed Davis on the condition she not interfere with her deputies issuing the licenses. Texas Sen. Ted Cruz also traveled to Morehead to bask in her defiance. And Kentucky Republican governor hopeful Matt Bevin has tried to capitalize on her recent celebrity. Others find themselves in a more awkward position. Jack Conway, the Democratic nominee in the states closely watched governors race, eventually declined to defend the states gay marriage ban as attorney general and now must dodge attacks from Bevin, even though both candidates favor carving out an exemption in state law for Davis. Former Florida Gov. Jeb Bush, whose presidential campaign has focused more on economics than social issues, first said Davis should follow the rule of law. But in last weeks GOP presidential debate, he agreed that \"there needs to be an accommodation for someone acting on their faith.\", In the same debate, former U.S. Sen. Rick Santorum compared Davis to a student killed in the Columbine High School massacre who reportedly told one of the gunmen she believed in God before she was shot. And Huckabee said it wasnt fair that the government allowed the suspected Fort Hood shooter to grow a beard in prison for religious reasons but would not accommodate Davis beliefs. Piggybacking on Davis fight could be risky because she refused to fulfill her duties as an elected official and defied several federal court orders, said Matt Mackowiak, who leads the Super PAC \"Fight for Kentucky\" that is supporting Bevin. He said any ad built around Davis would have to be \"very, very carefully constructed.\", \"You dont have to defend every decision she made and the ramification of every decision she made,\" Mackowiak said, adding he has not decided if his group will make ads based on Davis and the gay marriage issue. \"Its a pretty narrow situation, but you know it does raise the question: Do you believe in religious liberty?\", Bevin spoke at a jailhouse rally telling the crowd of thousands to share Davis story with their neighbors and \"bring them to the polls with you.\" But since she has been released from jail, he has mostly used Davis as an avenue to remind voters that Conway, as the attorney general, chose not to appeal a federal judges order overturning Kentuckys constitutional amendment banning same-sex marriage. Kentucky voters approved that amendment in 2004 with 75 percent of the vote. His first television ad, released Friday, made no mention of gay marriage. Although populist Democrats have maintained a foothold in Kentucky, an otherwise socially conservative state, others in the party also have been subject to attacks. Republican Casey County Clerk Casey Davis called Democratic Gov. Steve Beshear \"a warrior against Christianity\" because he refuses to call a special session of the state legislature to pass a law exempting Kim Davis and him from issuing marriage licenses. Randy Smith, a pastor from Morehead, told the crowd: \"No action by Steve equals no votes for Andy,\" a reference to Beshears son, Andy, who is the Democratic nominee for attorney general. \"Im asking everybody I can to make sure that we hold the governor responsible for his inaction by holding Andy Beshear responsible and not allowing him to be the next attorney general,\" Smith said. However, Davis full impact on the November and 2016 elections remains to be seen. The rallies for Davis have been swarmed by supporters from other states, and Steve Beshear won more than 60 percent of the vote in Davis county in the past two elections. Andy Beshear, whose campaign declined comment, has not shied away from his father: He released two TV ads last week featuring his father, saying his parents taught him the values of \"family, faith, integrity and hard work.\", Conway has handled the issue with care, believing it to be inflamed by emotional rhetoric. Hes betting things will calm down now that Davis is out of jail and her office issuing licenses. \"No, the race hasnt changed. I think passions are high but I think the majority of Kentuckians want to see people follow the law,\" Conway said. \"Nothing that happened in Rowan County did anything to advance education or job creation in this state.\", ", "Date": "20150920", "Author": "[Adam Beam, Associated Press]", "Link": "http://www.chron.com/news/us/article/Gay-marriage-fight-shifts-as-politicians-spy-an-6517319.php", "Title": "[Gay marriage fight shifts as politicians spy an opportunity]"}