{"Content": "[Republicansfind success by wide margins, Suburban incumbents largely held off their challengers - if they had any - as city ballot measures to expand where alcohol can be sold and bonds to fund building projects passed easily in Tuesdays elections. The wide margins of victory for many Republicans in Houston suburbs suggest organized Democratic efforts, particularly by the nonprofit Battleground Texas, to increase turnout among key demographics were not as successful as hoped. Political analysts say the defeats might lead organizers to retreat in future elections to dense urban areas that are reliably Democratic. \"It shows it was a waste,\" Richard Murray, a University of Houston political science professor, said of Democrats efforts to increase turnout. Republicans secured all four county judge posts that were contested in suburban areas,including two with-out an incumbent in the race. In Brazoria County, Matt Sebesta, Precinct 2 Commissioner of Angleton, coasted to victory over Democrat Robert Pruett, who works as city administrator of Galena Park. The county judge post had long been held by E.J. \"Joe\" King, who  retired. Waller County Judge Glen Beckendorf, mired in a heated Hempstead debate over a proposed landfill, also announced he would not seek re-election. In that race, Republican Trey Duhon secured the seat rather than Democrat Sylvia Cedillo, a former county commissioner. Both Fort Bend and Galveston counties did not see a leadership change. Fort Bend County Judge Bob Hebert, a Republican, won his third county election handily over his Democratic challenger, James Pirtle. In Galveston County, Republican Mark Henry claimed a second term by beating Independent challenger Bill Young, a former police officer. Fort Bend County District Attorney John Healey, a Republican, secured his sixth win. He defeated Democrat Wilvin Carter, a criminal defense attorney who once worked for Healey. Carter represented Healeys first general election challenger. Obscured in the usual defeats were some promising signs for future Democratic efforts, Murray noted. In recent years, Democrats have wrapped up early voting behind Republicans in turnout by nearly 20 percent, but this year that gap was cut in half in many suburban counties, Murray said. He attributed the shift to new efforts by Democrats to sign up eligible voters for mail ballots and conduct organizing. In the days that follow the election, fellow University of Houston political scientist Brandon Rottinghaus said, both parties will be analyzing the age and ethnicity of who cast ballots to better understand who might have an edge in future elections. He also noted that despite the defeats, which Republicans will be sure to highlight, Democrats likely will say the effects of their efforts were dampened by poor weather and the fact that it was a midterm, not presidential, election year. \"In Texas, midterm elections hardly break 40 percent turnout,\" Rottinghaus said. \"So it could be a bit skewed, which is why theyll be looking at specific groups. Did we see Hispanics come out in support in greater numbers? Or Asians?\", , Incumbents re-elected in The Woodlands, Four incumbents running in The Woodlands Township elections held on to their seats in contests dominated by talk of transportation and growth issues. Despite a packed field, which included two races with at least three candidates, incumbents pulled in the most votes.Gordy Bunch was unopposed; Mike Bass, Jeff Long and Ed Robb each won their respective contests. Suburban townsOK bond issuesfor facilities, Voters approved the requests of three small suburban towns to issue $21 million in debt to build facilities and purchase fire trucks. Katy will build a second fire station and purchase a new fire truck to serve residents south of Interstate 10 after voters approved a $5 million bond by a wide margin. In the Memorial area, Spring Valley Village voters approved a $7.5million bond measure to build a new city hall and public safety building. Four bond requests totaling $8.5 million made by Seabrook, a town near Galveston Bay, were approved by similar margins. They will fund an animal shelter, a new fire engine, technical upgrades within city offices and splash pad upgrades. Conroe, Tomballexpand sales of alcoholic drinks, Two towns could expand the sale of alcohol to areas where it previously had been banned after it appears voters approved their ballot measures. In Conroe, voters supported expanding the sale of alcoholic beverages to the former Boy Scouts Camp Strake property that was recently sold to a local developer. Tomball, in northwest Harris County, had a similar measure pass, according to business owner Laura Wilson, who collected enough signatures to place it on the ballot. It repeals a ban on liquor sales in Tomballs booming historic downtown. Jayme Fraser]", "Date": "20141105", "Author": "[Jayme Fraser]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Republicans-find-success-by-wide-margins-in-5872999.php", "Title": "[Republicans find success by wide margins in suburbs]"}