{"Content": "[AUSTIN -- A controversial law requiring Texans to undergo an ultrasound before getting an abortion does not appear to be in any immediate legal trouble, even after the U.S. Supreme Court on Monday effectively ended any hope for a similar law in North Carolina. The high court decided not to review a federal appeals court ruling that found the North Carolina law unconstitutional, but that decision did not set a national precedent. A different appeals court already has upheld the Texas law, and its ruling was not appealed to the Supreme Court, ending that threat. \"It would be very difficult to revive that challenge to the law,\" said Caitlin Borgmann, a professor at the CUNY Law School in New York. Borgmann said opponents of the law could ask for the challenge to be reconsidered, but \"the courts are likely to say, weve already decided that issue.\", Lyle Denniston, a legal expert who writes for SCOTUSBlog, said a motion for reconsideration would be very unlikely to succeed. Absent a successful motion, he said, \"the Texas case is over and done.\", The 2011 law, written by now-Lt. Gov. Dan Patrick, requires women to watch the ultrasound or listen to it being described in detail. They then have to wait 24 hours before getting an abortion -- a waiting period that itself is an obstacle, particularly in a state that is losing clinics, opponents argue. Similar laws are in effect in Louisiana and Wisconsin, according to the Guttmacher Institute, which tracks abortion laws across the country. Oklahomas law is tied up in the courts, while 10 other states require doctors to perform an ultrasound and give women an opportunity to watch. The Virginia-based 4th Circuit U.S. Court of Appeals threw out North Carolinas law on First Amendment grounds, saying the law infringed on the free-speech rights of doctors. The Texas law was upheld by the 5th Circuit, a New Orleans-based court considered one of the most conservative in the country. On Monday, lawyers opposing the Texas measure did not reveal their plans, with a spokeswoman for the group that challenged the law saying the organization was \"in the process of evaluating our legal options.\", Activists on both sides of the issue in Texas said they did not expect a major move in the near future, however. \"We havent heard anything about a challenge,\" saidZoey Lichtenheld, a spokeswoman for NARAL Pro-Choice Texas, in an email.]", "Date": "20150615", "Author": "[Brian M. Rosenthal]", "Link": "http://www.chron.com/news/politics/texas/article/Texas-abortion-sonogram-law-in-little-danger-even-6328574.php", "Title": "[Texas abortion sonogram law in little danger even after SCOTUS ruling]"}