{"Content": "[Caption, Close, Mayor Annise Parker and supporters of Houstons Equal Rights Ordinance were all smiles after a news conference last month. Protesters gather outside City Hall after a proposed compromise was announced May 13 in the Houston Equal Rights Ordinance. Protesters gather outside City Hall after a proposed compromise was announced on May 13 in the Houston Equal Rights Ordinance. Jared Woodfill, left, David Welch, right, and others with a group seeking to repeal Houstons equal rights ordinance delivered boxes of signatures to the office of the Houston city secretary on July 3. Flanked by clergy, Mayor Annise Parker announces that the city will withdraw subpoenas issued in a lawsuit over Houstons equal rights law. Former City Council member Jolanda Jones speaks on the equal rights measure in August. In 2014, Rev. Dave Welch, executive director of the Texas Pastor Council, addresses the media after Mayor Annise Parker, City Attorney David Feldman and Council Member Ellen Cohen announced that the petition to repeal the Houston equal rights ordinance adopted by the City Council in May has fallen short of the number of signatures required due to errors in the signature collection process, The Texas Supreme Court has again overruled Mayor Annise Parkers administration in connection with the legal fight over her signature nondiscrimination ordinance, ruling Wednesday that the mayor and City Council erred in choosing the language that will appear on the November ballot when the ordinance faces possible repeal. The justices, writing in \"yet another mandamus proceeding concerning the City of Houstons equal rights ordinance,\" said the city charter is clear in requiring that voters be asked to vote for or against the ordinance. Parker had instead argued it was proper to vote for or against repealing the measure, and the council approved language with that approach Aug. 5. \"Though the ordinance is controversial, the law governing the City Councils duties is clear. Our decision rests not on our views on the ordinance  a political issue the citizens of Houston must decide  but on the clear dictates of the City Charter,\" the justices wrote. \"The City Council must comply with its own laws regarding the handling of a referendum petition and any resulting election.\", Plaintiff and conservative activist Jared Woodfill said the original ballot language was \"all about deception and trickery.\" Woodfill noted that opponents have now sought and won two opinions on the ordinance at the state Supreme Court -- the first essentially forcing a repeal or vote on the ordinance and now one on the actual ballot language. \"Its sad weve had to go to the Supreme Court twice,\" Woodfill said. \"It shows how vested the mayor is in this issue that she has broken the law twice.\", The ruling rejected an argument from the ordinances foes that the ballot should not contain the words \"Houston Equal Rights Ordinance,\" which they said was politically charged. The ordinance bans discrimination based not just on sexual orientation and gender identity -- the flash points for opponents -- but also, as federal laws do, sex, race, color, ethnicity, national origin, age, religion, disability, pregnancy and genetic information, as well as family, marital or military status. The ordinance applies to businesses that serve the public, private employers, housing, city employment and city contracting. Religious institutions are exempt. Violators could be fined up to $5,000. Opponents of the measure submitted a petition seeking to place the law on the ballot for repeal last summer following City Councils 11-6 approval of the ordinance. City Secretary Anna Russell initially counted enough valid signatures to qualify the petition for the ballot, but Mayor Annise Parker and former City Attorney David Feldman threw out many of those because they appeared on pages of the petition they said had not been properly collected or notarized. Foes sued, leading to a state district judges ruling earlier this year that the petition did not have enough valid signatures. The Texas Supreme Court overrode that in a separate decision last month, ordering the council to repeal the ordinance or place it on the November ballot; the group voted 12-5 to put the law before the public. The court stepped in Wednesday without the plaintiffs having first sought such an appellate court, they wrote, because the deadline to submit items for the November ballot is fast approaching. City Council typically meets every Wednesday but is not scheduled to meet this week. Parkers administration has not yet issued a statement.]", "Date": "20150819", "Author": "[Mike Morris and Katherine Driessen]", "Link": "http://www.chron.com/news/politics/houston/article/Texas-Supreme-Court-says-city-erred-on-HERO-6452930.php", "Title": "[Texas Supreme Court says city erred on HERO ballot language]"}