{"Content": "[Caption, Close, FILE - In this Aug. 29, 2015, file photo, Donald Trump supporter John Wang wears a shirt autographed by the Republican presidential candidate outside the National Federation of Republican Assemblies in Nashville, Tenn. Its been a tumultuous political summer. The unexpected rises of billionaire Donald Trump and socialist Bernie Sanders. When it comes to Trump, Ohio Republicans have a palpable excitement about his brash brand of politics, and a deep uncertainty about his qualifications to serve as president. FILE - In this Sept. 3, 2015, file photo, the back of a shirt of a supporter for Democratic presidential candidate, Sen. Bernie Sanders, I-Vt. during a town hall meeting in Grinnell, Iowa. Its been a tumultuous political summer. The unexpected rises of billionaire Donald Trump and socialist Bernie Sanders. In Ohio voters are taking a more measured view of a race they may ultimately decide and while some Democrats in Ohio are intrigued by Sanders, the self-declared \"democratic socialist\" from Vermont, many see the senator more as a novelty than a credible alternative. FILE - In this June 17, 2015, file photo, Barbara Hilliard, of Santee, S.C. puts a campaign sticker on her blouse as she waits for Democratic presidential candidate Hillary Rodham Clinton to speak during a campaign stop in Santee, S.C. Its been a tumultuous political summer. In Ohio voters are taking a more measured view of a race they ultimately may decide. Interviews highlight nagging concerns about Clintons honesty and trustworthiness amid the continued revelations about her use of a private email account and server while serving as secretary of state. FILE - In this June 15, 2015, file photo, buttons are shown for sale outside Miami Dade Colleges Theodore Gibson Health Center in Miami, Monday, June 15, 2015, before Jeb Bush announced his bid for the Republican presidential nomination. Its been a tumultuous political summer. The unexpected rises of billionaire Donald Trump and socialist Bernie Sanders. Signs of weakness for Democratic front-runner Hillary Rodham Clinton. And in Ohio, one political veteran whose name did come up frequently was Bush _ but only in the context of rejecting the idea of electing a third Bush as president. COLUMBUS, Ohio (AP)  Its been a tumultuous political summer. The unexpected rises of billionaire Donald Trump and socialist Bernie Sanders. Signs of weakness for Democratic front-runner Hillary Rodham Clinton. Curiosity about the future of Vice President Joe Biden. Yet in Ohio, the nations most reliable general election bellwether, voters are taking a more measured view of a race they ultimately may decide. \"Its all just chatter,\" said Judith Anderson, 40, a Democrat from Cincinnati. \"Were a ways out.\", Anderson is one of the more than 50 voters interviewed by The Associated Press the week before Labor Day in Ohio, which along with Florida will be one of the most coveted states in the 2016 election. They report that the Republican primary is wide open, even as Trump holds steady atop early polls. Theres little interest in establishment candidates such as former Florida Gov. Jeb Bush, and a surprising lack of energy for Ohios own governor, John Kasich. But they also say theres room for someone other than Trump to tap into voters frustration with a political system they believe has abandoned them. When it comes to Trump, Ohio Republicans have a palpable excitement about his brash brand of politics, and a deep uncertainty about his qualifications to serve as president. Earl Taggart, 44, a Cincinnati-area electrician, said Trumps bluntness is forcing other candidates to address issues they would rather avoid, including illegal immigration. But could Taggart see Trump becoming president?, \"I dont think hes got a shot in hell,\" he said. \"Hes not the mouthpiece we want for America.\", The interviews also highlighted nagging concerns about Clintons honesty and trustworthiness amid the continued revelations about her use of a private email account and server while serving as secretary of state. While some Democrats are intrigued by Sanders, the self-declared \"democratic socialist\" from Vermont, many see the senator more as a novelty than a credible alternative. Theres even less interest among Ohio Democrats in Biden getting into the race. The voters represent just a slice of the Ohio electorate, and many say theyre just starting to pay attention to the campaign. Still, their views provide insights into the direction the White House race might take as the turbulent summer fades into fall. ", "Date": "20150910", "Author": "[Julie Pace, Ap White House Correspondent]", "Link": "http://www.chron.com/news/politics/article/Ohio-voters-take-chaotic-start-to-2016-race-in-6488940.php", "Title": "[Ohio voters take chaotic start to 2016 race in stride]"}