{"Content": "[Caption, Close, Photo of a notice published in newspapers offering 60 million Mexican pesos (3.8 USD approximately) reward to anyone with information leading to the recapture of Joaquin \"El Chapo\" Guzman Loera in Mexico City on July 16, 2015. The government has offered a $3.8 million reward for Guzmans capture, double the amount it usually offers for the countrys most wanted criminals. AFP PHOTO/ Yuri CORTEZYURI CORTEZ/AFP/Getty Images, Less than two months after the PRI gained a marginal victory in Mexicos midterm elections, the administration of Mexican President Enrique Pea Nieto has been hit by two stinging setbacks. First was the humiliating escape of Joaqun \"El Chapo\" Guzman, the head of the infamous Sinaloa Cartel, and soon after was the energy reforms less than stellar first bidding round. All is not lost on either front, but moving forward will require a dramatic change of tone and direction on security measures, and serious recalibration on the energy side. On July 11, El Chapo slipped through a tunnel in his maximum-security cell and emerged as a free man some 1.5 kilometers away. The shocking escape rocked the country (and the world) and underscored the extent to which corruption permeates even the top and supposedly most secure parts of Mexicos security establishment. It also brings to light the issue of why El Chapo was sitting in that prison in the first place. Especially as U.S. officials had formally filed an extradition request less than three weeks before his escape. Carin Zissis of the Americas Society/Council of the Americas recently wrote about how extradition may be the Mexican governments most effective tool for fighting the cartels. Yet, since El Chapos capture 18 months ago, the bilateral cooperation on this front has waned. Of course, the security relationship between the United States and Mexico extends well beyond this singular issue. That said, the escape threatens to put our bilateral collaboration on less certain ground. As the nation reeled from El Chapos disappearing act, the government turned in an underwhelming performance in the countrys first energy auction. July 14 marked the bidding day for 14 shallow-water blocks up for exploration, and while interest among major energy companies had been high in the lead-up, only six of the blocks received any bids at all. Of these, two fields received bids that surpassed the governments minimum fiscal requirements. This meant that only two fields were assigned (a 14 percent success rate), falling short of the governments own 30 to 50 percent benchmark for measuring success. The reasons behind this lackluster performance are likely a combination of low global oil prices, concern over elements of the governments production-sharing contracts, the fields small size and geological considerations. On a positive note, the bidding round itself was highly transparent and efficient and the actual process of running a tender went off without a hitch. The government will certainly want to repeat this smooth process for future rounds, but it will need to aggressively review all commercial terms to make sure they are as attractive as possible for future investors. Since El Chapos quick apprehension and extradition is unlikely, what the government should do is immediately shift toward a serious, long-term and sustained commitment to building the countrys rule of law. Even bold steps and a strong policy agenda may very well be too little too late for regaining Mexicans frayed trust in their government, but are absolutely critical to maintaining investor confidence going forward. At this point this is not only the best path, but also the only one worth pursuing. Garza (@aogarza) is a former U.S. Ambassador to Mexico and is counsel in the Mexico City office of White & Case.]", "Date": "20150727", "Author": "[Antonio Garza]", "Link": "http://www.chron.com/opinion/outlook/article/Garza-Wanted-Bold-Steps-and-Rule-of-Law-6408373.php", "Title": "[Garza: Wanted: Bold Steps and Rule of Law]"}