{"Content": "[Caption, Close, A woman shields herself from the rain as she walks through a parking lot on Milam Street, Wednesday, Feb. 6, 2013, in Houston. (Cody Duty / Houston Chronicle), A woman shields herself from the rain as she walks through a parking lot on Milam Street, Wednesday, Feb. 6, 2013, in Houston. (Cody Duty / Houston Chronicle), Its often said that in Houston, and Texas, we love our cars. While thats probably true, it also seems that we are obsessed about parking. Perhaps some Houstonians feel that free, easy parking adjacent to every building that were trying to access is an inherently essential feature of Houstons quality of life. The mandatory on-site parking requirements, one of the citys most intrusive land-use regulations, would seem to reflect this viewpoint. And parking controversies tend to generate vocal and emotional responses from the electorate. As we enter the mayoral election season, I wouldnt be surprised if our candidates hear from citizens that our city isnt providing enough parking, so our officials need to \"fix it\" - in other words, do what it takes to get us closer to the ideal of easy-and-free parking anywhere we want to go, while no one else can park on our own street except me and my neighbors. However, I wonder if the politicians and bureaucrats who hear this perspective from the citizenry realize the prices paid for all the vast supply of parking that is implied to be necessary. While I could highlight many ways that the omnipresence of parking as a land use can negatively affect us, such as excessive and polluted storm runoff and urban heat islands, I want to focus on two main impacts: the reduced appeal and effectiveness of walking and the terrific financial burden our obsession with parking places on both the private and public sector. The negative impacts on walking as a means of mobility and access are pretty obvious. Massive on-site parking supply pushes destinations apart, meaning fewer destinations are available within a reasonable walking distance, diminishing the practicality of getting around on foot. Off-street parking facilities are also generally unpleasant to walk next to or through, reducing the qualitative experience of being a pedestrian as well. With such conditions, even folks who might not be predisposed against walking will be more likely to drive to and between their destinations (thus creating more traffic and pollution). In short, excessive on-site parking and walkable environments are not terribly compatible. Of course, the traffic congestion and health impacts are becoming more widely known as consequences of a lack of walkability. Not to mention the burden placed on those who walk because, for whatever reason, theyre unable to drive. Finally, from a more purely qualitative perspective, there are those who actually like walking in cities and who are denied that experience. The negative impact of the financial burden of excessive and poorly located parking may be even more pernicious, however. It would be silly to declare parking unnecessary at the present time, especially for most commercial uses in Houston; our relatively lower densities and sparse public transit network mean that parking is necessary for a sufficient number of employees, customers  and visitors to access destinations. But onsite parking, mandated by Houston city code and perceived as necessary regardless of code by most developers, comes at great cost - it takes extra money to build parking, not to mention to acquire and use the underlying land for that purpose. What ends up happening is that enormous resources are spent purely for vehicle storage, rather than using that capital and land for actual economic activity. Where does the Houston economy actually take place? Usually in buildings, not in parking lots or garages - yet what quantity of underutilized financial resources are locked into parking? How much more expensive, or financially tenuous, is a development project than it otherwise would have been if more land could be used productively? How might our built environment improve if more could be spent on creating quality buildings and more affordable housing rather than creating more parking?, There are serious ramifications for the citys fiscal health in this regard. I researched the assessed values of various types of recently built properties in the Washington Avenue corridor. An unwalkable parking-oriented retail big-box strip center development, dominated by surface parking, produces significantly lower taxable property value than a multifamily apartment development with a parking garage built underneath the living units. The retail property also produces less assessed value per acre than nearby single family town homes, even if a 20 percent homestead exemption is assumed on all units. One might point out that while retail lags on property-tax generation, it also produces sales tax for the city. This is true, but my calculations indicate that a typical retail center would need unrealistic levels of taxable sales productivity to approach the tax base generated by the multifamily apartments. I can tell you from my other experiences in consulting work that these examples of assessed value generation are quite typical. Parking, however seemingly necessary, hurts walkability and hurts municipal fiscal productivity. So where does this leave Houston? The city has enormous fiscal challenges. While certainly managing the expenditure side of the budget is critical regardless of how much revenue is coming in, allowing or encouraging low fiscal value development forced by both the mandatory and perceived need for excessive on-site parking is not a situation that should continue. Solutions will likely include some mix of relaxation or elimination of on-site parking requirements, community-shared parking facilities, better provision and management of on-street parking, improved public transit and eventually autonomous (self-driving) vehicles that do not have to be parked right at the destination. And as or more important, Houston needs improvements both in the design of developments and in the public rights of way to facilitate safe, comfortable walking. Houstons current densification trend provides a great opportunity to try out these options. A number of them can be directly influenced by public policies administered by the mayor and city administration. Id like to hear from our candidates if they have contemplated changes to the citys parking policies and, if so, what? After all, they have to live with the fiscal consequences. We often think of walkabilitys potential to improve our health, our natural environment and our city image. But just as important, it can help save our collective checkbook. Spillette is president of Houston-based CDS Market Research. His views do not represent those of the firm. A version of this commentary originally was written for the nonprofit urban planning think tank Houston Tomorrow.]", "Date": "20150717", "Author": "[Steve Spillette]", "Link": "http://www.chron.com/opinion/outlook/article/Spillette-City-parking-policies-have-negative-6391998.php", "Title": "[Spillette: City parking policies have negative health, fiscal impact]"}