{"Content": "[Caption, Close, Democratic presidential hopeful Hillary Rodham Clinton delivers a speech, Friday, July 24, 2015, at the New York University Leonard N. Stern School of Business in New York. Democratic presidential hopeful Hillary Rodham Clinton speaks Friday, July 24, 2015, at the New York University Leonard N. Stern School of Business in New York. Clinton says businesses need to \"break free from the tyranny of todays earnings report\" so they can take a more long-term view of the economy. Hillary Clinton urged the State Department to release her emails as quickly as possible. WASHINGTON (AP)  A new letter by intelligence investigators to the Justice Department says secret government information may have been compromised in Hillary Rodham Clintons private server, underscoring an inescapable reality for her presidential campaign: Email is forever. Clinton, the former secretary of state and now the leading Democratic presidential candidate, wants to focus on the economic issues she and her team believe will drive the next election. But they remain unable to fully escape the swirling questions surrounding her decision to run her State Department correspondence through an unsecured system set up at her New York home. The inspector general of the U.S. intelligence community recently alerted the Justice Department to the potential compromise of classified information arising from Clintons server. The IG also sent a memo to members of Congress that he had identified \"potentially hundreds of classified emails\" among the 30,000 that Clinton had provided to the State Department  a concern the office said it raised with FBI counterintelligence officials. Though the referral to the Justice Department does not seek a criminal probe and does not specifically target Clinton, the latest steps by government investigators will further fuel the partisan furor surrounding the 55,000 pages of emails already under review by the State Department. A statement from the intelligence inspector general, I. Charles McCullough, and his counterpart at the State Department, Steve Linick, said that McCulloughs office found four emails containing classified information in a limited sample of 40 emails. \"This classified information should have never been transmitted via an unclassified personal system,\" they said. For Clinton, the news amounted to a major distraction on a day when shed hoped to focus on unveiling a new set of economic policies. Instead, she opened her New York City speech by addressing the controversy, decrying some reports as inaccurate. Some media initially reported that Justice Department had been asked to consider a criminal investigation into whether she mishandled her emails. \"We are all accountable to the American people to get the facts right, and I will do my part but Im also going to stay focused on the issues,\" she said. It was not immediately clear whether the Justice Department would investigate the potential compromise highlighted by the intelligence inspector general. The office has not suggested any wrongdoing by Clinton, according to U.S. officials speaking on the condition of anonymity because they were not authorized to discuss the referral publicly. But the inspector generals office said in its letter to Congressional oversight committees that it was concerned that \"these emails exist on at least one private server and thumb drive with classified information and those are not in the governments possession,\" said Andrea Williams, a spokeswoman for McCullough. None of the emails were marked as classified at the time they were sent or received, but some should have been handled as such and sent on a secure computer network, said the letter sent to congressional oversight committees. Clinton has maintained that she never sent classified information on her personal email account, which she said in March she used as a matter of convenience to limit her number of electronic devices. The State Department has made public some of the emails involving Clinton, and is under court order to make regular further releases of such correspondence. The aim is for the department to unveil all of 55,000 pages of the emails she turned over by Jan. 29, 2016. But a federal judge this month chastised the department for moving too slowly in providing The Associated Press with thousands of emails submitted through the Freedom of Information Act. Republicans are pushing Clinton to turn over her server to a third party for a forensic evaluation. \"Her poor judgment has undermined our national security, and it is time for her to finally do the right thing,\" said House Speaker John Boehner. Clinton spokesman Nick Merrill said she had followed \"appropriate practices in dealing with classified materials.\", But theres little dispute among intelligence officials that Clinton should have been more careful with her information  though her behavior was likely not criminal. Current and former U.S. intelligence officials say they assume that all of the email that transited Clintons home server is in the possession of Russian or Chinese intelligence services, who would have easily bypassed whatever security measures she took. They, too, spoke on condition of anonymity because they werent authorized to discuss the Clinton email situation publicly. Whether a security violation or not, the risk for Democrats is that questions about her email harden into an early narrative about Clintons honesty and management skills. Already, Republicans have spent months depicting Clinton as a creature of Washington who flouts the rules for personal gain. Clintons people say questions about her correspondence wont sway voters, who they argue are more focused on economic and family issues. But, there are signs that the issue may have already affected views of their candidate. An Associated Press-GfK poll released last week found that voters view her as less decisive and inspiring than when she launched her presidential campaign just three months ago. Just 3 in 10 said the word \"honest\" describes her very or somewhat well. ", "Date": "20150727", "Author": "[Lisa Lerer and Eric Tucker, Associated Press]", "Link": "http://www.chron.com/news/article/Sources-Justice-asked-to-consider-probing-6403175.php", "Title": "[New inquiry into Clinton emails fuels political questions]"}