{"Content": "[Texans can use www.Texas.gov for nearly 1,000 services, such as applying for concealed handgun licenses and driver records, and renewing driver licenses, vehicle registrations and many state-required professional licenses. It is time to allow Texans to use this proven, secure online portal to register voters. Online voter registration does not allow online voting. Under the process that has been proposed for our state, Texans with a current Texas drivers license or Department of Public Safety-issued photo ID could electronically register to vote so long as the license and three other identification measures authenticate them to do so. Twenty-seven states have adopted online voter registration to save taxpayer money and provide citizen convenience. Oklahoma, New Mexico and Florida passed online voter registration bills in the past month. Arizona has been doing it since 2001 and, as with all the others,  has seen only positive results and major cost savings. Yet, bills in the Texas Legislature advancing online voter registration remain stalled, even with 76 House members co-sponsoring one of the bills. At a late April House Elections Committee hearing, 89 citizens registered to voice support of two bills. Harris County Tax Assessor-Collector Mike Sullivan led the only contingency testifying in opposition. Supporters include the Harris County Young Democrats, Houston Young Republicans and every statewide organization involved in registering voters. Online registration does not replace paper applications, but provides an added convenience for Texans. The National Council of State Legislatures calls online voter registration a truly bipartisan election issue. A 2014 Pew study reports states have not seen any change in the balance of party affiliation of registered voters following the introduction of online voter registration. States also report no security breaches or voter impersonation. The study further finds online registration applications five times more accurate than paper applications. The three Texas agencies - Secretary of States office, DPS and Department of Information Resources - that would execute online voter registration are confident in their ability. Their representatives testified that registering voters online can work in Texas. Department of Information Resources Executive Director Todd Kimbriel told the House Elections Committee that the state-contracted Texas.gov vendor processes more than $2 billion in annual payments from taxpayers. Since initiation in 2001, Kimbriel told lawmakers, there have been no security breaches. An existing Texas.gov platform for voter registration is already in place, used to update residential addresses when a voter moves within a county. To initiate registration online, a person would be required to possess a valid Texas driver license or DPS ID that can only be obtained in person. More than 60 percent of Texans polled in 2014 favor registering voters online. State Reps. Celia Israel, D-Austin and Carol Alvarado, D-Houston, bill authors, agree its an opportunity to work together to make our voter registration system more efficient, accurate and cost-effective. The Legislature should consider the widespread successes and the Texas agencies confidence in successful implementation. If you support registering voters online, call or email your legislator. You will find contact information for House and Senate members at http://www.capitol.state.tx.us/. With your help, we can improve voter registration in Texas. , Wiant is president of the League of Women Voters of Texas.]", "Date": "20150508", "Author": "[Elaine Wiant]", "Link": "http://www.chron.com/opinion/outlook/article/Wyant-Using-the-Internet-to-register-voters-6249421.php", "Title": "[Wiant: Using the Internet to register voters would save money, be convenient]"}