{"Content": "[Caption, Close, Joshua Cline, former aide to Michigan state Reps. Todd Courser and Cindy Gamrat, talks about the scandal engulfing them during a news conference at Dailey Law Firm , P.C. in Royal Oak, Mich. Monday, Aug. 17, 2015. (Brandy Baker / The Detroit News via AP) DETROIT FREE PRESS OUT, HUFFINGTON POST OUT, NO MAGS, , NO ARCHIVE, MANDATORY CREDIT, Joshua Cline, former aide to Michigan state Reps. Todd Courser and Cindy Gamrat, talks about the scandal engulfing them during a news conference at Dailey Law Firm , P.C. in Royal Oak, Mich. Monday, Aug. 17, 2015. (Brandy Baker / The Detroit News via AP) DETROIT FREE PRESS OUT, HUFFINGTON POST OUT, NO MAGS, , NO ARCHIVE, MANDATORY CREDIT, Joshua Cline, former aide to Michigan state Reps. Todd Courser and Cindy Gamrat, talks about the scandal engulfing them during a news conference at Dailey Law Firm , P.C. in Royal Oak, Mich. Monday, Aug. 17, 2015. (Brandy Baker / The Detroit News via AP) DETROIT FREE PRESS OUT, HUFFINGTON POST OUT, NO MAGS, , NO ARCHIVE, MANDATORY CREDIT, ROYAL OAK, Mich. (AP)  A former aide to embattled Michigan state Reps. Todd Courser and Cindy Gamrat said Monday that he was rebuffed when he confronted them about having an \"inappropriate physical relationship.\", Joshua Cline said at a news conference in the Detroit suburb of Royal Oak that during a late-night staff meeting in January, he confronted the two first-term lawmakers, who shared staffers in an unusual arrangement. \"I began to suspect ... they were having an inappropriate physical relationship (and said) they should stop and enforce personal boundaries,\" Cline said. \"They quickly dismissed my concerns. They said such a suggestion was not my place.\", The Republican lawmakers, who took office with tea party backing, have apologized for having an extramarital affair with one another. Courser admitted that he orchestrated a smear campaign against himself in which he had an email sent to Republican supporters from an anonymous account accusing him of having had sex with a male prostitute. Courser said he did so to distract attention from the actual affair, which he feared was about to become public. In a long audio statement Courser recently released, he said Cline, who quit in April, and other former aides tried to \"blackmail\" him to resign. He said the self-directed smear campaign also was an attempt to try and disrupt those who were blackmailing him. Courser, 43, and Gamrat, 42, are the subjects of a state House investigation into whether they misused public resources to hide their relationship and fired another aide for refusing to help. Neither lawmaker plans to quit and Gamrat has denied a role in the cover-up. Cline said Courser and Gamrat spent \"inordinate amounts of time going for walks,\" and \"greeted with long, personal embraces.\" He added that Courser often would take naps on Gamrats office floor, and \"upon seeing him, Gamrat would tuck him in with a pillow and blanket.\", Cline, who described Courser as a \"close, personal\" friend from before his 2014 election, said he shared his concerns with the office of GOP House Speaker Kevin Cotter \"when I felt there was no relief coming.\", \"I respect ... the state legislative branch,\" Cline said. \"I hope to help them discover all of the details of this unfortunate circumstance.\", The Detroit News broke the story earlier this month, citing secret audio recordings and texts provided by former staffer Ben Graham, as well as interviews with Graham, Cline and others. The newspaper documented at least one meeting at Gamrats official office in which she, Courser and Graham discussed the affair, and it noted that Courser missed a committee meeting during that time. The Michigan State Police opened an investigation Friday after Courser, on his own accord, visited the Lapeer post to speak with an investigator. \"We have not detailed what we are investigating,\" spokeswoman Shanon Banner said. ", "Date": "20150818", "Author": "[Jeff Karoub, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Embattled-lawmakers-ex-aide-I-confronted-them-6449168.php", "Title": "[Embattled lawmakers' ex-aide: I confronted them about affair]"}