{"Content": "[Caption, Close, Protesters gather outside City Hall after a proposed compromise was announced on May 13 in the Houston Equal Rights Ordinance. Jared Woodfill, left, David Welch, right, and others with a group seeking to repeal Houstons equal rights ordinance delivered boxes of signatures to the office of the Houston city secretary on July 3. Flanked by clergy, Mayor Annise Parker announces that the city will withdraw subpoenas issued in a lawsuit over Houstons equal rights law. Former City Council member Jolanda Jones speaks on the equal rights measure in August. In 2014, Rev. Dave Welch, executive director of the Texas Pastor Council, addresses the media after Mayor Annise Parker, City Attorney David Feldman and Council Member Ellen Cohen announced that the petition to repeal the Houston equal rights ordinance adopted by the City Council in May has fallen short of the number of signatures required due to errors in the signature collection process, Universalists and members of the Westboro Baptist Church held dueling protests of the citys Equal Rights Ordinance outside of City Hall in Downtown Houston, Monday, Nov. 10, 2014. (Johnny Hanson / Houston Chronicle), Opponents of Houstons non-discrimination ordinance failed to gather enough valid signatures to force a repeal referendum, a state district judge ruled Friday, validating city officials decision to toss out the petition foes submitted last summer. After separate rulings from both a jury and state District Judge Robert Schaffer, attorneys for both sides entered dueling counts of the valid signatures, adding and subtracting voters as Schaffer responded to motions. By early this week, the counts were closer together than ever before, fewer than 1,000 signatures apart. Ultimately, Schaffer on Friday ruled the final count of valid signatures was 16,684, leaving opponents short of the threshold required in the city charter of 17,249 signatures, or 10 percent of the ballots cast in the last mayoral election. \"The jurys verdict and the judges ruling are a powerful smack-down against the forces of discrimination and intolerance,\" said Geoffrey Harrison, lead attorney for the city, in a statement. \"And maybe, just maybe, theyll reconsider their misguided ways.\", The law, on hold during trial, is now in effect, according to a city spokeswoman. Mayor Annise Parker released a statement celebrating the verdict. \"I would hope that the plaintiffs would not appeal, they lost during a jury trial and today they also lost with the judges ruling,\" Parker said. \"Now all Houstonians have access to the same protections.\", But opponents, largely conservative activists and pastors whose objections center on the protections the law extends to gay and transgender residents, say they will appeal the decision. Andy Taylor, attorney for the plaintiffs, said he remains confident they will ultimately take the law to voters. He was particularly upset with rulings that some illegible signatures were disqualified. \"We intend to appeal and are confident the higher courts will agree that good handwriting is not a valid reason to deny citizens of their constitutional rights to vote,\" Taylor said. Mayor Annise Parker and her former city attorney rejected the petition last August, triggering the lawsuit. At issue in the case was not the ordinance itself, but whether opponents petition contained enough valid signatures. City officials said the 5,200-page document was riddled with forgery and errors, while opponents said the city sought and falsely found problems with the petition. Approved last May by the City Council, the ordinance bans discrimination among businesses that serve the public, private employers, in housing and in city employment and city contracting. Enforcement of the ordinance remains on hold while the law is tied up in the courts. Schaffers ruling reflects a higher but not wildly different tally than the 15,250-signature count former City Attorney David Feldman announced in rejecting the petition last year. Feldman threw out nearly half the petition pages, saying many of those who circulated the pages made serious errors. The court case, with a week of testimony followed by a week of jury deliberations, went into the weeds on these technical issues, often focusing on the validity of the signatures and even the penmanship of individual petition organizers and signers. Even this week, attorneys on both sides were still seeking to preclude or add signatures as Schaffer put together his finaly tally. On Friday morning, Taylor filed a last-minute plea for a recount, asking Schaffer to order City Secretary Anna Russell to count the number for registered Houston voters that signed the petition.]", "Date": "20150417", "Author": "[Katherine Driessen]", "Link": "http://www.chron.com/news/politics/houston/article/Judge-sides-with-city-in-equal-rights-case-6207417.php", "Title": "[Judge sides with city in equal rights case]"}