{"Content": "[Caption, Close, Hydraulic fracturing bans in the U.S. and beyond Scotland is the latest to join the ranks of governments that prohibit fracking. Last week, the countrys executive announced the practice would be stopped pending a survey of public input and studies into impacts on health and the environment.Pictured: A protest against Fracking in Scotland outside the SNP Autumn Conference on October 19, 2013 at the Perth Concert Hall, Perth Scotland. Alex Salmond opens the last autumn conference of the Scottish National Party before next years referendum on Scottish independence in Perth, attracting strong international interest. (Photo by Mark Runnacles/Getty Images), Denton, Texas--the birthplace of fracking less than 40 miles from ExxonMobiles headquarters--voted to ban shale extractions of oil and gas in November 2014. The states oil and gas regulator, the Railroad Commission, has challenged the citys authority in the ban. North Carolina reversed course on fracking in 2014, overturning a moratorium that had been in place for almost two years. The state also outlawed the disclosure of fracking chemicals. New Jersey doesnt have a single shale reserve, but activists in the state have been pressuring the legislature to impose a moratorium on fracking waste disposal from nearby Pennsylvania. Gov. Chris Christie has vetoed two of these bills. CAPE TOWN, SOUTH AFRICA - AUGUST 9: (SOUTH AFRICA OUT) Protesters carry a banner as they take to the streets on August 9, 2011 in Cape Town, South Africa. The march was in protest of Shells fracking plans in the Karoo. A 2011 fracking ban was overturned in 2012.(Photo by The Times/Gallo images/Getty Images), Germany outlawed fracking in 2012. The country plans to permit the practice only at depths greater than 3,000 feet to avoid groundwater contamination.  AFP PHOTO / GERARD JULIEN        (Photo credit should read GERARD JULIEN/AFP/Getty Images), Northern Ireland banned fracking in 2011. Pictured: Michael McIntyre from Enniskillen sits beside his boat with an anti-fracking banner in Enniskillen, Northern Ireland, on June 15, 2013. McIntyre will be taking part in the anti-fracking demonstration against the use of fracking to extract gas from shale rock in County Fermanagh ahead of the G8 summit. AFP PHOTO/ PETER MUHLY        (Photo credit should read PETER MUHLY/AFP/Getty Images), France was the first nation to ban fracking in 2011. The law was upheld in the countrys highest court when an American drilling company filed suit for revoked permits in 2013. Pictured: People demonstrate in streets of Montelimar, southern France, on October 19, 2013, to protest against the exploitation of shale gas and oil. Extracting shale oil and gas reserves through controversial fracking will in future require an environmental impact study, European lawmakers agreed on October 9, 2013, despite opposition this will add to costs and hurt jobs. AFP PHOTO / JEFF PACHOUD        (Photo credit should read JEFF PACHOUD/AFP/Getty Images), Bulgaria instated the worlds second national fracking ban in 2012. Pictured: Protesters gather and stage demonstration against the visit of U.S. Secretary of State John Kerry in Sofia, holding  posters saying,  KERRY, GO HOME and NO FRACKING SHALE GAS IN BULGARIA. (Photo by Hristo Vladev/Pacific Press/LightRocket via Getty Images), Hawaii County, on the states Big Island, banned fracking in 2013. Two California counties--Mendocino and San Benito--banned fracking in November 2014 elections. Pictured: Coastal town of Mendocino, California, Beverly Hills was the first in California to outlaw fracking in May 2014. Beverly Hills sign, Beverly Hills, California, United States of America, North America, Five Ohio cities have banned fracking since 2012: Athens, Mansfield, Broadview Heights, Oberlin and Yellow Springs. Bould County, Colorado, prohibited fracking in 2012. Last November, county officials voted to extend the ban until 2018, so they can review the results of a National Science Foundation study into health and environmental impacts of the practice. Pictured: Rod Brueske, silently protests outside the meeting room, Thursday, Dec. 13, 2012, at the Boulder County Courthouse in Boulder, Colo. (AP Photo/Times-Call, Matthew Jonas), Culver City, California, shares the largest urban oil field in the country with neighboring Los Angeles and has been considering a hyrdaulic fracturing ban since 2013. Local news has reported that the city is tentatively moving forward with its plans for a ban. Fracking opponents across California have criticized Gov. Jerry Brown, pictured, for showing no signs of considering a statewide ban. New York has imposed a moratorium on hyrdaulic fracturing across the entire state since 2010. In 2014 the states mayor outlawed the practice indefinitely. The Dallas city council effectively banned the process in December 2013, but that ordinance is in limbo following a lawsuit from Trinity East Energy LLC. Pittsburgh was the first city in the country to outlaw hydraulic fracturing in November 2010. Mora County, New Mexico, population 4,881, was the first county in the country to ban hydraulic fracturing in 2014. Mike Reitinger pulls weeds from a row of squash growing at the Shiloh Field  community garden in Denton, Texas,  Thursday, May 29, 2014. Unlike most Texas communities that have embraced the lucrative oil and natural gas booms, Denton leaders are considering a petition to ban hydraulic fracturing. Although sitting on top of the Barnett Shale, believed to hold one of the largest natural gas reserves in the U.S. Denton would rather be known for having the largest community garden in the U.S. (AP Photo/LM Otero), In this Oct. 15, 2013 photo, crews work at an EagleRidge Operating natural gas well in Denton, Texas. A petition with more than 2,000 signatures that was presented at City Hall in an attempt to force the city council to consider a ban on hydraulic fracturing, Wednesday May 7, 2014, in Denton. A recently adopted temporary ban is in place until September, but fracking opponents want to make that permanent through an ordinance that would prohibit the practice in Denton. (AP Photo/The Denton Record-Chronicle, David Minton), Natural gas well holding tanks sit next to a subdivision of homes in Denton, Texas,  Thursday, May 29, 2014. This North Texas city wants less gas and more hot sauce. Unlike most Texas communities that have embraced the lucrative oil and natural gas booms, Denton leaders are considering a petition to ban hydraulic fracturing and are trying to persuade Sriracha to move its massive pepper-grinding operations from California. Although sitting on top of the Barnett Shale, believed to hold one of the largest natural gas reserves in the U.S. Denton would rather be known for having the largest community garden in the U.S. (AP Photo/LM Otero), Mayor Chris Watts, holds a hand full of comment cards left by area residents and attendees at a public hearing to ban hydraulic fracturing as city attorney Anita Burgess looks on Wednesday, July 16, 2014, in Denton, Texas. The council governing the north Texas city that sits atop a large natural gas reserve rejected a bid early Wednesday morning to ban further permitting of hydraulic fracturing in the community after eight hours of public testimony. (AP Photo/Tony Gutierrez), Eleven-year-old Riley Briggs of Denton, Texas, draws a reaction from council members as he makes comments supporting a ban on hydraulic fracturing during a public hearing at City Hall, Wednesday, July 16, 2014, in Denton, Texas. The council governing a North Texas city that sits atop a large natural gas reserve rejected a bid early Wednesday morning to ban further permitting of hydraulic fracturing in the community after eight hours of public testimony. (AP Photo/Tony Gutierrez), A member in the audience uses his smart device to record part of the proceedings in the public hearing at City Hall, Tuesday, July 15, 2014, in Denton, Texas. A North Texas city could become the first in the state to ban hydraulic fracturing if city leaders approve a grassroots petition to outlaw the drilling method. (AP Photo/Tony Gutierrez), Area residents and registered speakers watch proceedings on a television screen from one of the three overflow rooms as others wait their turn to address the city council during a public hearing, Tuesday, July 15, 2014, in Denton, Texas. The North Texas city could become the first in the state to ban hydraulic fracturing if city leaders approve a citizen-led petition to outlaw the drilling method. (AP Photo/Tony Gutierrez), Council member George Campbell, left rear, talks with Mayor Chris Watts as council persons Anita Burgess and Dalton Gregory right, listen to Former Texas Railroad Commission executive director John Tintara, at podium, speak at a public hearing at City Hall, Tuesday, July 15, 2014, in Denton, Texas. Current and former Texas officials have warned a North Texas city that it lacks the authority to enact a ban its considering on hydraulic fracturing. (AP Photo/Tony Gutierrez), Rhonda Love, of Denton,Texas, and a member of Frack Free Denton, walks back to her seat after addressing the city council during a public hearing, Tuesday, July 15, 2014, in Denton, Texas. A North Texas city could become the first in the state to ban hydraulic fracturing if city leaders approve a grassroots petition to outlaw the drilling method. (AP Photo/Tony Gutierrez), A sign placed along the sidewalk reads, Common Sense Against Earthquakes, as a small group with Frack Free Denton protest outside city hall, Tuesday, July 15, 2014, in Denton, Texas. A North Texas city could become the first in the state to ban hydraulic fracturing if city leaders approve a grassroots petition to outlaw the drilling method. (AP Photo/Tony Gutierrez), Topher Jones, from left, of Denton, Texas, Edward Hartmann, of Dallas and Angie Holliday of Denton, Texas, hold a campaign sign supporting a ban outside city hall, Tuesday, July 15, 2014, in Denton, Texas. A North Texas city could become the first in the state to ban hydraulic fracturing if city leaders approve a grassroots petition to outlaw the drilling method. (AP Photo/Tony Gutierrez), A water tank is adorned with a Texas flag and city theme in Denton, Texas, Thursday, May 29, 2014. This North Texas city wants less gas and more hot sauce. Unlike most Texas communities that have embraced the lucrative oil and natural gas booms, Denton leaders are considering a petition to ban hydraulic fracturing and are trying to persuade Sriracha to move its massive pepper-grinding operations from California. Although sitting on top of the Barnett Shale, believed to hold one of the largest natural gas reserves in the U.S. Denton would rather be known for having the largest community garden in the U.S. (AP Photo/LM Otero), University of North Texas professor of Jazz Studies and Treasure of Pass the Ban political action committee Ed Soph poses for a portrait in his office in Denton. The PAC is working to ban fracking with in Denton. (Special to the Houston Chronicle/Brandon Wade), Treasurer of Denton Taxpayers for a Strong Economy Bobby Jones poses for a portrait in front of a well head that sits approximately 300 feet from his house in Denton. The group opposes banning fracking in Denton. (Special to the Houston Chronicle/Brandon Wade), President of Denton Drilling Awareness, Cathy McMullen, right, holds up a sign asking voters to vote in favor of banning fracking at the Denton Civic Center. (Special to the Houston Chronicle/Brandon Wade), President of Denton Drilling Awareness, Cathy McMullen, right, gives a thumbs up to passing motorist at the Denton Civic Center. (Special to the Houston Chronicle/Brandon Wade), Denton, Texas, has seen a lot of action in recent years for a small city with less than 150,000 people, and its in the spotlight again, this time facing off with the state government in Austin. Fracking matured in Denton, kicking off Texas shale oil boom and inundating the North Texas city with a swarm of drillers to tap the oil-rich Barnett Shale. An early anti-fracking movement emerged, and by November 2014 citizens voted overwhelmingly to prohibit drilling within city limits out of health, environmental and noise concerns. RELATED: Denton approves fracking ban, But the Texas House Energy Committee just told Dentonites; \"you cant do that,\" and that puts Denton at the center of a power struggle between state and local governments. House Bill 40, filed by state Rep. Drew Darby (R-San Angelo), was approved in committee and will now face a House vote. It places oil and gas activity under \"the exclusive jurisdiction of the state,\" protecting drillers from most types of local regulation and effectively requiring Denton to reverse its adopted ban. \"A municipality or other political subdivision may not enact or enforce an ordinance or other measure, or an amendment or revision of an existing ordinance or other measure, that bans, limits, or otherwise regulates an oil and gas operation within its boundaries or extraterritorial jurisdiction,\" the bill reads. On Monday, Dentonites traveled to Austin to join more than 100 citizens signed up to address the committee about the proposed bill, reported the Denton Record-Chronicle. Many feel that HB 40 and other bills addressing local regulation of oil and gas are direct attacks on the Denton voter initiative. Even the citys mayor and city attorney testified. They challenged the legislatures dominance over municipal governments and alleged the provisions permitting local regulation were too ambiguous, according to the Record-Chronicle. The bill allows local governments to make rules governing surface oil and gas activity that are \"commercially reasonable\" and dont \"effectively prohibit an oil and gas operation.\" But critics contend they dont know what \"commercially reasonable\" means, and fear it gives statewide industry too much representation in local politics. \"Currently, local rules are judged foremost in terms of the impacted communities: do they provide reasonable protections for health and safety and mitigations against nuisances?\" wrote Frack Free Denton, an organization that campaigned for the ban, in a Friday press release. \"HB 40 shifts the standard to the industrys perspective. It will require local rules foremost to be commercially reasonable.\", The ambiguous standard could affect other Texas cities that have imposed local regulation on drillers without banning them outright. In a release addressing HB 40, the Texas Municipal League said 67 cities impose minimum distances between drilling activity and residential or community buildings. Petroleum interests say regulation should be handled by the state, not cities. Before the committee, Texas Oil and Gas Association head Todd Staples said there is an urgent and growing threat to the oil and gas industry that \"must be fixed,\" according to the San Antonio Business Journal. \"Local ordinances that stop oil and gas production exceed the authority delegated to cities by the Legislature and result in the taking of property without compensation, in violation of the Texas Constitution,\" Staples said in a press release. RELATED: Texas bill to limit local anti-fracking ordinances advaces, HB 40 was one of almost a dozen bills filed this session to limit local authority over oil and gas. Others would have required municipalities to pay back tax revenue lost by closing down drillers, or would have required to get state attorney general approval for any regulatory ordinances. Supporters of fracking bans in Denton and elsewhere allege the process, which injects tens of millions of high-pressure, chemically-enhanced water thousands of feet below ground, could contaminate groundwater. They also complain about the bright lights and loud noises made by rigs near residential areas, and point to nearby North Texas examples where the fracking industry has been tentatively linked to recent earthquake swarms. RELATED: USGS to raise Texas earthquake hazard risk, A handful of other cities and states across the U.S. and the world have also banned fracking. Check out our slideshow to see where they are.]", "Date": "20150331", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/texas/article/Texas-lawmakers-want-to-ban-fracking-bans-6170954.php", "Title": "[Texas lawmakers want to ban fracking bans]"}