{"Content": "[Caption, Close, Technicians work behind the candidate podiums before the start of the CNN Republican presidential debates at the Ronald Reagan Presidential Library and Museum Wednesday, Sept. 16, 2015 in Simi Valley, Calif. ATLANTA (AP)  Jeb Bush calls his tax-cut plan \"Reagan-inspired.\" Scott Walker says \"the greatest foreign policy president ... was a governor from California.\" Ted Cruz pitches himself as the leader for a new \"Reagan revolution.\", Donald Trump makes time for Ronald Reagan, too, alluding to the 40th presidents support of Franklin Roosevelt and the New Deal as a defense for his own conservative makeover after years of taking liberal positions. Even if Wednesday nights Republican debate werent taking place at the Reagan Presidential Library outside Los Angeles, some of the candidates taking part would be likely to mention the GOP hero. And, standing on a stage in front of the giant Boeing 707 that flew as Reagans Air Force One, comparing themselves to their party icon was even harder to resist. Yet amid that scramble to claim Reagans legacy, the 2016 candidates sometimes obscure the actual record of the man who won two landslide elections a generation ago. Reagan was a champion of cutting taxes, but he also raised them. He called the Soviet Union \"the evil empire\" but forged a productive relationship with his counterpart in Moscow, Mikhail Gorbachev. He appointed conservative Antonin Scalia to the Supreme Court but also tapped Sandra Day OConnor and Anthony Kennedy  swing votes who protected abortion rights and helped legalize same-sex marriage. \"The more you knew Ronald Reagan, the less you want to speak for him. Its the people who didnt know him who find it so easy to say exactly what he would do,\" says Sal Russo, a Republican strategist and tea party mastermind who worked as Reagans personal aide during his tenure as California governor in the 1960s and 1970s. The complexities of Reagans history went on-air this week when a conservative, pro-immigration group called the National Immigration Forum starting running an ad nationally to chide Trump and others for their positions on illegal immigration. The ad cited Reagans farewell address, in which he described the country as \"shining city ... God-blessed and teeming with people of all kinds living in harmony and peace.\", Before taking his place in the Oval Office, Reagan became the face of outsider conservatism when he nearly toppled President Gerald Ford in the 1976 primaries. Russo said its amusing to see Reagan, \"who really rocked the boat\" in 1976, become \"the lodestar even for Republicans who always support the establishment.\", Author Will Bunch said its \"all part of this canonization process\" Republicans have employed for more than two decades to build Reagan into a utopian conservative, while avoiding inconvenient details. \"What we hear going into 2016 is often the mythical Reagan, not the real Reagan,\" argues the senior writer at the Philadelphia Daily News and the author of a Reagan analysis, \"Tear Down This Myth.\", Take taxes, for example. For much of Reagans tenure, several marginal personal income tax brackets had rates higher than todays top rate of 39.6 percent. The national debt roughly tripled during his two terms. On foreign policy, several 2016 contenders cite Reagans credo of \"peace through strength\" as they accuse President Barack Obama of capitulating to U.S. enemies. Walker, for example, has urged Obama to cancel the upcoming visit of Chinas president and declares that \"Iran is not a place we should do business.\", Left unmentioned is how Reagan sold arms to Iranians as part of a plan to aid rebel forces in Nicaragua, and Reagans famous summits with Gorbachev. Russo, even as he, too, criticizes Obama, said Reagans philosophy gets twisted. \"You have too many candidates who talk about strength so we can go out and win wars,\" he said. Reagan \"had a bitter hatred of communism,\" Russo said, but \"was dreadfully fearful ... of ending the world with a nuclear holocaust.\", Whats clear is that todays voters endorse Reagans legacy, however they see it. In a 2014 Quinnipiac University poll, 35 percent of voters nationally chose Reagan as the best president the United States has had since World War II  well ahead of Bill Clinton (18 percent) and John Kennedy (15 percent). Among Republicans, Reagan was the runaway favorite, with 66 percent picking him as the top president in recent history. Thats perhaps why opponents of the GOP White House hopefuls are also sometimes eager to stand the candidates up next to Reagan. In an online ad posted Wednesday, the super PAC backing Democratic front-runner Hillary Rodham Clintons campaign spliced some of the GOP contenders comments into Reagans famous \"Morning in America\" TV ad from his 1984 campaign. After the narrator from the original ad says, \"Its morning again in America,\" the ad cuts to Trump at a podium saying, \"Sadly, the American dream is dead.\", ", "Date": "20150916", "Author": "[Bill Barrow, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Reagan-a-certain-star-at-GOP-debate-whoever-else-6508741.php", "Title": "[Reagan a certain star at GOP debate, whoever else does well]"}