{"Content": "[RALEIGH, N.C. (AP)  Since Kay Hagan declined in June to run for a return to Washington, North Carolina and national Democrats have been looking for strong candidates to challenge Republican U.S. Sen. Richard Burr in 2016. After other conventional high-profile picks again said no, another crop of potential candidates are now seriously considering getting in, among them current and former state legislators and a small-town mayor. Those lack the broad name recognition compared to Hagan, who lost her Senate seat to Republican Thom Tillis nine months ago. Each day without an active rival to Burr, whose campaign had nearly $4 million in the bank in July, raises questions whether Democrats are truly keen on denying him a third term. A largely unknown candidate probably would have to raise at least $10 million for ads to help raise the persons voter familiarity enough. \"Were getting short in the process for fundraising,\" said Brad Crone, a longtime North Carolina Democratic consultant. \"The big fear is that as we come into Labor Day, Democrats have really got to put a push on to find a candidate just to be able to compete.\", Democrats expressing interest last week were Spring Lake Mayor Chris Rey, former state Rep. Deborah Ross of Raleigh and current Rep. Duane Hall of Raleigh. Former U.S. Rep. Heath Shuler, an ex-NFL quarterback, has been mentioned but sounds uninterested. Shuler said in a statement hes enjoying his job at Duke Energy  hes a lobbyist  \"and that is my focus.\", Hall, an attorney in his second House term, said he would most likely file federal candidacy papers in the coming week but suggested it didnt mean he was fully committed yet. \"Obviously, Im looking to see who else gets in,\" Hall said in an interview. He believes hes got a good chance of attracting independent and moderate voters, and highlights his ability to pass legislation in the Republican-led General Assembly. A former lobbyist for the state American Civil Liberties Union, Ross served in the Legislature for 10 years and now works for Triangle Transit. She was known for her outspokenness on womens rights and liberal-leaning causes but also put her imprint on bipartisan legislation, including a landmark ethics law. \"People have been very complimentary of my extensive legislative record of getting things done, and not just the things that appear in the newspaper,\" Ross said in an interview. Rey, head of a Fayetteville-area nonprofit, considers himself as someone who is speaking for people who arent benefiting from actions of the Republican-led Congress and state Legislature. \"I bring a different kind of voice for the people who are really hurting in North Carolina,\" Rey said. The three said theyve spoken to the Democratic Senatorial Campaign Committee in Washington. The DSCC says Burr is vulnerable due to low approval numbers, his voting record and running in a presidential year in a battleground state. Hagan, who upset GOP Sen. Elizabeth Dole in November 2008, didnt enter that race until October 2007. \"There is still plenty of time and we are confident we will have a great candidate who can and will beat Richard Burr,\" said Sadie Weiner, a DSSC spokeswoman. Raleigh-based Republican media strategist Marc Rotterman said he doesnt believe 2016 will be like 2008, when excitement in Barack Obamas campaign caused Democratic voter turnout to surge. Democrats also seem more interested in trying to defeat GOP Gov. Pat McCrory, Rotterman said. Burr, who joined the Senate in 2005 after 10 years in the U.S. House, said some potential Democratic hopefuls maybe have backed off running due to the fundraising demands or the influence of the gubernatorial and presidential races on the Senate election. \"Listen, Id like to think its that a majority of North Carolinians think Ive done a pretty good job,\" he said at a Raleigh event last week.]", "Date": "20150823", "Author": "[Gary D. Robertson, Associated Press]", "Link": "http://www.chron.com/news/article/After-Hagan-s-no-Democrats-wait-for-Burr-6460571.php", "Title": "[After Hagan's no, Democrats wait for Burr challengers]"}