{"Content": "[Caption, Close, Election Clerk Richard DeLosSantos prepares voting booths at the Metropolitan Multi-Services Center, Tuesday, May 27, 2014, in Houston. (Cody Duty / Houston Chronicle), Judging by the headlines, Texans may get the impression that the state attorney generals key duty is to sue the federal government. The real meat and potatoes of the office involves defending the states public information and open meetings statutes and enforcing the collection of child support judgments, in addition to providing legal opinions and representing the state in court. This election will give Texas our first new attorney general in more than a decade, and voters should look for an attorney who will emphasize those core functions of the office. Democratic candidate Sam Houston is the best choice on the ballot. A graduate of Baylor Law School and candidate for Texas Supreme Court in 2008, Houston is more than just a famous name (though it certainly doesnt hurt). Houston, 51, is board certified in civil trial advocacy and has 26 years experience as a Houston-based litigator, practicing civil law at the state and federal level. With executive experience managing his law firm, Houston will bring the attitude of an attorney over that of a politician. Meeting with the Houston Chronicle editorial board, Houston said that he would rely more on mediation than politically charged proactive lawsuits. That strategy may not make headlines, but it stands to save taxpayer dollars while getting good results for Texas. This balanced, professional attitude should help win over some traditionally Republican voters, who find themselves with a troubling candidate. State Sen. Ken Paxton, R-McKinney, puts forth the persona of a Sunday school teacher but has a history of lawbreaking and questionable business practices that should disqualify him in the minds of Texans. The most notable scandal involves Paxton directing his law clients to invest with a friends financial services firm, which paid Paxton a 30 percent cut. Not only did the Republican candidate for attorney general violate state law by failing to register with the State Securities Board, but he exploited the trust clients put in him for his own financial gain. Two of those clients went on to sue Paxton for breach of fiduciary duty. It wasnt just a one-time mistake. Paxton improperly solicited clients in 2004, 2005 and 2012. This habit reveals either a striking disregard for the law or chronic forgetfulness, neither of which are desirable qualities in a candidate for attorney general. As a result of the State Securities Boards disciplinary order, Paxton had to pay a $1,000 fine. But the ordeal isnt over. Paxton still faces a potential felony charge, which will be settled after the election. Voters shouldnt want a lawyer-in-chief who will confront the wrong end of a grand jury on day one. It doesnt end there. Paxtons recent ethics filings have failed to disclose his position on the boards of various nonprofit corporations. And in a circumstance that raises other ethical questions, Paxton was an early investor in a security camera company that went on to land a multi-million-dollar state contract. However, as the saying goes: It isnt the crime, it is the coverup. Paxton has routinely refused to meet with journalists, political groups and media outlets to answer questions about his history of shady - and illegal - practices. He has cancelled meetings with everyone from tea party groups to this newspaper, hiding from the very people he will be charged with defending, In his campaign, Paxton acts less like a candidate seeking the attorney generals office and more like someone who fears investigation by it. The attorney generals office is charged with enforcing transparency in government, and Paxtons stonewalling tactics do not bode well for Texas future.]", "Date": "20141010", "Author": "[Copyright 2014: Houston Chronicle]", "Link": "http://www.chron.com/opinion/recommendations/article/For-attorney-general-5815181.php", "Title": "[For attorney general]"}