{"Content": "[During a prominent gathering of conservatives in the first-in-the-nation primary state of New Hampshire, the largest spattering of boos among the crowd didnt come at speakers frequent mentions of President Barack Obama. The loudest jeers came when a speaker would mention former Florida Gov. Jeb Bush. \"You know, I heard Jeb Bush the other day,\" mogul Donald Trump said during his speech at the Freedom Summit, hosted by the conservative groups Citizens United and the Americans for Prosperity Foundation. He paused in his speech as the boos started. As chatter heats up about a Bush possibly running for president in 2016, he faces a potentially significant obstacle  convincing the conservative base to rally around him as a Republican nominee. Conservatives problems with Bush, the brother of former President George W. Bush and younger son of President George H.W. Bush,are threefold. First, he supports overhauling the nations immigration system, something that has made some on the right charge he supports \"amnesty\" for undocumented immigrants living in the US. Bush also has embraced the Common Core educational standards, a policy that is quickly becoming the \"Obamacare\" of education on the right. And, to a lesser extent, conservatives also agree with the sentiment of Bush over-saturation. They are tired of the Bush name representing the Republican Party, and they want to avoid a potential third Bush in office over the last five presidencies. \"Bushas a last name\" is an issue, said Erick Erickson, the editor in chief of the conservative news site RedState. \"It is the same problems the Democrats have. Lets go forward by going backward. Not exactly a winning slogan.\", But the bases problem with Bush begins with his positions on immigration and education. Some conservatives see Bush as pseudo-repeat version of 2012 presidential nominee Mitt Romney  a candidate they were reluctant to back in the 2012 election, before he became the Republican Partys go-to surrogate in this election cycle. Steve Deace, a prominent conservative in the crucial early presidential state of Iowa, summed up conservatives problem with Jeb Bush: Hes everything they hated about Romney, and nothing they liked about him. \"Im saying theres a chance\" Bush could win the backing of conservatives and the nomination, Deace told Business Insider in an email, adding, \"The same chance I have tolook good in a thong.\", , Bush was the target of ire at the Freedom Summit in April because of remarks he made earlier in the week about undocumented immigrants  many of whom, he said, came to the US out of an \"act of love\" for their families. In general, Bush supports an overhaul of the nations immigration laws, and he has saidthe bipartisan Senate bill passed last June was a \"good effort\" toward accomplishing that goal. The Senates bill, which garnered the support of 14 Republicans, has been a non-starter in the House amid fierce pushback from the chambers conservative wing. Conservatives disapproval of both Obama and congressional Republicans on the issue of immigration only heightened this summer, when tens of thousands of undocumented immigrants streamed across the US-Mexico border. Even Mike Huckabee, a fellow potential 2016 Republican candidate who is more sympathetic to immigration reform than other conservative prospects, attacked Bushs April comments. \"I think what Jeb was trying to say was that many people come to the United States to look for opportunity,\" Huckabee said. \"I dont personally support amnesty. I think we ought to have a secure border.\", But an increasingly important issue among conservative activists is the Common Core education standards, which one conservative who spoke to Business Insider called \"Obamacore.\" The activist said it had the potential to be \"Jebs Romneycare,\" referring to the Massachusetts healthcare law mirroring the federal Affordable Care Act that was passed during Romneys tenure as governor of the state. Bushs overall record on education during his tenure as governor is well-admired on the right. His \"A+ plan\" placed a greater emphasis on standardized testing in Florida, and he instituted broad school choice featuring vouchers and charter schools. However, Bush also took an active role in implementing the Common Core standards and continues to be perhaps their staunchest defender on the right. \"Hes the poster-child for Common Core,\" Deace said. The Common Core standards were developed by a group appointed by the National Governors Association, the bipartisan organization of the nations governors. The standards were adopted in mid-2009, intending to foster greater academic achievement and allow for comparable standards across states. One of its goals, as stated by the NGA, was to return power back to states after President George W. Bushs No Child Left Behind law let the federal government play a major role in state education standards. Conservatives began souring on the Common Core law after the Obama administration tied certain grants to states adoption of the standards. But as the rights opposition has grown, Bush and the group he co-founded,the Foundation for Excellence inEducation, have dug in with their support. Bush has even suggested opponents of Common Core are dabbling in conspiracy theories. \"Never under-estimate moms,\" Erickson said. \"The Chamber of Commerce types have spun this as no big deal and no causing harm. But it is only just rolling out. This is becoming an issue and will be an issue with the base that hurtsJebbecause of his defense.\", How Bush deals with conservative opposition to his stances on immigration and Common Core will likely determine how far he gets in the nomination process, should he choose to run.He has two options. One involves making a very un-Romney-like move and continuing to defend his views on both immigration and on Common Core. This would represent a contrast from Romney, who entered the 2012 GOP primary open to immigration reform before eventually famously saying undocumented immigrants should self-deport. Romney also moved markedly away from the universal healthcare law he helped design as governor of Massachusetts, even as some supporters touted it as his biggest achievement. But, if Bush adopts this strategy, it could also more firmly alienate a moderate base he needs to win over to win the nomination. Bushs second potential strategy would involve gently softening his position on both issues, like Romney did, over the next year. This is what multiple prominent conservatives believe he will do. On immigration, this will include likely pointing to his 2013 book, \"Immigration Wars,\" in which he came out against a path to citizenship for undocumented immigrants. On Common Core, Bush will likely emphasize that he only cares about the standards  not the name. As Erickson said, \"He has Romneys position, and Romney got the nomination.\", \"I think we need someone new to be the partys leader,\" he said. \"Its just no one is sure who that should be, which givesJeban advantage.\", , Join the conversation about this story , See Also:, SEE ALSO:Heres Why Jeb Bush Would Be The GOPs Immediate Front-Runner If He Runs For President]", "Date": "20141101", "Author": "[Brett LoGiurato, provided by]", "Link": "http://www.chron.com/default/article/Conservatives-Are-Already-Freaking-Out-About-Jeb-5863085.php", "Title": "[Conservatives Are Already Freaking Out About Jeb Bush's Possible Run For President]"}