{"Content": "[Caption, Close, , In a new YouTube video for IJReview.com, presidential candidate Sen. Ted Cruz, R-Texas, shows how to fry bacon off the end of smoking hot semi-automatic rifle while at at Central Iowa Impact Gun Range in Boone, Iowa. (screenshot from IJReview on YouTube), The good, the bad and the weird of Ted Cruz: See more of the candidates biggest (and sometimes strangest) political moments ... In a new YouTube video for IJReview.com, presidential candidate... Cruz: Hispanic panhandlers dont exist; no comment on African-Americans, Gay businessman hosts Cruz, endures backlash, , The Fortune 500s \"radical gay agenda\", We now interrupt \"Killing Jesus\" for this important message... \"As toilets flush, Heidi Cruz hunts for votes\", Campaign raises $4 million eight days, Your irony levels are too high, After 9/11, Ted Cruz gives up on rock music, TedCruz.com loves Obama, Liberty students forced to \"support\" Ted Cruz, The phone data dragnet has split GOP senators in several states including Texas, where Sen. John Cornyn, left, differs from Sen. Ted Cruz, who voted to halt the practice. Fighting against Sharia Law, A new video released today shows presidential hopeful Sen. Ted Cruz, R-Texas, cooking a few strips of bacon off the end of an semi-automatic rifle at Central Iowa Impact Gun Range in Boone, Iowa. So far Cruz appears to be the first Republican running for the highest office in the land who has cooked bacon with the hot end of a semi-automatic rifle. The video was posted today by the Independent Journal Review on YouTube. RELATED: A handful of Ted Cruzs notable social media posts, There is nothing I enjoy more than on weekends cooking breakfast with the family, Cruz says in the video. Of course in Texas we cook bacon a little differently than most folks. Cooking was achieved by wrapping a handful of slices around the barrel of the rifle. Cruz then fired more than several rounds through the weapon at a paper target at the range. Cruz shoots four magazines of 5.56 ammunition and then reports heavy grease accumulation on the weapon. According to Cruzs camp the senator was using a Smith & Wesson M&P15 Sport rifle with an EOTech sight. Cruz then eats the bacon with a fork of the rifle. Heres hoping that the rifle was cleaned after cooking. Its worth noting that Iowa  home of the Feb. 1 caucus that serves as the nations first presidential primary  is also the nations leading pork producer. As far as political stunts aimed at reaching out to rural Iowa voters, cooking bacon with a gun could be a win-win for Cruz. Your move, Chris Christie.]", "Date": "20150803", "Author": "[Craig Hlavaty]", "Link": "http://www.chron.com/news/politics/tedcruz/article/Ted-Cruz-frying-bacon-off-the-end-of-a-machine-gun-6421618.php", "Title": "[Ted Cruz frying bacon off the end of a machine gun in Iowa may be the most Ted Cruz thing ever]"}