{"Content": "[Caption, Close, Republican presidential candidate, former Texas Gov. Rick Perry, shown on June 20, said on Thursday: \"Im here to tell you that it is Republicans, not Democrats, who are truly offering black Americans the hope of a better life for themselves and their children Keep clicking to see a timeline of Perrys tenure as governor of Texas. When Rick Perry departed as Texas governor, after 5,114 days in office, nearly twice as long as anyone else, he insisted he will be remembered for the Lone Star States booming economy that is the envy of other stat And his education initiatives that he said will create a brighter future for Texas children. And tort reform that ensures more doctors are available to provide health care. Economy: Perrys formula was simple: Low taxes, light regulation and limited services. During Perrys tenure, the state government consistently has spent about 70 percent of the national average per person on services including roads, health care and public education. Texas has an unemployment rate of 5.1 percent and Perry has lured several big companies to move to Texas using the Texas Enterprise Fund. Schools: To say the outgoing governors record on public education is mixed would be an understatement. Perry started strong, picking up cues from his predecessor and focusing heavily on accountability and outcomes. Critics, however, say many of those gains later were reversed, mostly by budget cuts. Texas fourth graders rank 41st in the nation in reading and their scores have declined by 2 points in 12 years. Eighth graders rank 16th in the nation in mathematics and are in the top 10 for score growth. Higher Ed: Texas has met many of the higher education goals it set in Closing the Gaps, the long-term higher education plan unveiled in 2000. Last year, Texas public colleges and universities saw enrollment drop by 14,000, a dip that officials blame on rising tuition. Graduation rates have increased 59 percent since 1999, but leaving out Texas top performing schools, UT-Austin and Texas A&M, six-year graduation rates sit around 50 percent. Perrys call for a $10,000 college degree in 2011 has been offered at 13 campuses around the state, as tuition rates have risen elsewhere. The last two years of Perrys tenure have been punctuated by a pitched battle between those who want to fundamentally change the way Texas universities operate, one aspect being the fight between UT Regent Wallace Hall (pictured), who was accused of trying to oust UT President Bill Powers, and the state legislatur Health: In perhaps no other way has Gov. Rick Perrys conservative principles had more impact on Texas than in health and human services. Abortion access has plummeted to historically low levels, medical malpractice lawsuits have become dramatically less common, health insurance rates have remained the lowest in the country and the state agencies overseeing it all have become more consolidated, more politicized and more privatized. Justice: In 2007, the Texas Legislature, that once employed a lock-em-up-and-throw-away-the-key solution to crime, switched gears to embrace rehabilitation and treatment programs focused on returning criminals to society as productive, taxpaying citizens. These reforms are now touted as a national model, as are changes in police, forensic and prosecutorial procedures designed to curb wrongful convictions, particularly for condemned offenders on death row. Downside on an otherwise upbeat record: Failure to change a juvenile-justice system that still appears to be broken. Ethics: For a public official currently facing a criminal indictment over the way he vetoed state funding for the states ethics-prosecution unit in June 2013, Perry has drawn national acclaim for signing measures to make state spending more transparent, by making data on state spending available online, and for ordering more accountability over how federal funds are spent. Then, he vetoed a measure last year that would have required greater disclosure about so-called dark money contributed to campaigns. He also received criticism for packing school boards and commissions with big campaign donors and after his campaign donors received grants from a state cancer-research agency that ended up mired in investigations and audits. Transportation: In, perhaps, Perrys biggest public flop, the Trans Texas Corridor plan he proposed at the start of his tenure as governor was a grandiose scheme to build a 4,000-mile network of transportation links across Texas, incorporating private toll roads, railroads and utility lines into broad lanes of commerce that would take 50 years to build and cost untold billions. Facing strident opposition, Perry ultimately was forced to retreat, signing into law a bill that wiped from state law all references to his grand plan. Texas now has more than 500 miles of toll roads, a majority of which were built during Perrys tenure. More than 6,500 new miles of highway have also been added since Perry took office and Texans have faced no increase in the gas tax since 1993. That good news was tempered by the fact that Texas transportation needs are running about $5 billion short each year, that the oil and gas boom has ruined hundreds of miles of secondary roads in West and South Texas and that traffic congestion in urban areas is at an all-time high. Environment: Funding for the states environmental watchdog agency has been trimmed 20 percent since 2006, the construction of new coal-fired power plants was fast-tracked and Texas has sued the U.S Environmental Protection Agency 18 times to block additional environmental rules. As Perry departs, Texas leads the nation in emissions of greenhouse gasses: Houston (pictured) and Dallas are still among the most smog-ridden cities in the nation. Nineteen of Texas 254 counties fail to meet federal air-quality standards. WASHINGTON  Former Texas Gov. Rick Perry, struggling to break out of the 2016 GOP presidential primary pack, unleashed a striking speech on race Thursday, saying \"for too long, we Republicans have been content to lose the black vote because we found that we could win elections without it.\", The National Press Club speech, one of the first of his nascent campaign, placed Perry among the more moderate conservatives in the crowded GOP field, confronting issues of race and poverty seldom heard in a contest that has focused on winning over white, blue-collar voters in the early voting states of Iowa, New Hampshire and South Carolina. Facing a media audience lunching on brisket and fried okra, Perry recounted in startling detail the 1916 dismemberment and lynching of Jesse Washington, a 17-year-old mentally disabled youth convicted of rape in Waco. \"Weve made a lot of progress since 1916,\" Perry said, warming to the theme of racial reconciliation and the importance of mounting fresh Republican proposals to address the lingering problem of black poverty. Building on his more familiar pitch about the strength of the Texas economy, Perry argued that an economy unleashed from the yoke of government regulations can do more to alleviate poverty than traditional social programs favored by Democrats. \"Im here to tell you that it is Republicans, not Democrats, who are truly offering black Americans the hope of a better life for themselves and their children,\" he said. \"I am proud to live in a country with an African-American president,\" Perry added. \"But President Obama cannot be proud of the fact that the prevalence of black poverty has actually increased under his leadership.\", Perry argued that the \"party of Lincoln\" needed to reclaim its legitimacy with African Americans by offering alternatives to anti-poverty programs that he said have failed. Among his proposals were two well-worn Republican ideas: an expanded Earned Income Tax Credit for the working poor, and replacing federal programs with state block grants better tailored to local needs. One bipartisan proposal: sentencing reforms to help non-violent drug offenders get back on track.Democrats, casting a wary eye on Perrys second-chance campaign, cited Perrys support for stringent voter ID requirements, questioning his appeal to African-American voters. \"Governor Perry lost moral legitimacy when he signed into law one of the most restrictive voter ID measures in the country that would make it harder for an estimated 600,000 registered Texas voters to vote in person,\" said Michael Tyler, director of African American media for the Democratic National Committee. Democrats also attacked Perry for his opposition to a federal minimum wage and the expansion of Medicaid in Texas, the state with the highest percentage of uninsured people. \"Reminding black voters that Abraham Lincoln signed the Emancipation Proclamation isnt going to erase Rick Perrys record,\" Tyler said. Pointing to his record, Perry argued that the poverty rate for blacks in Texas is lower than it is in traditionally Democratic states like New York and California. And he could stand on a recent statistic showing Texas has the nations best graduation rate for black high school students. More critical to Perrys fortunes will be how his remarks resonate with conservative voters who play an outsized role in the early GOP primaries. \"I am running for president,\" Perry said, \"because I want to make life better for all people, even those who dont vote Republican.\", To Brandon Rottinghaus, associate professor of political science at the University of Houston, Perrys plan appears to be \"more like a wish list than a strategy list.\", \"I think Rick Perry is trying to rebrand the Republican Party in a way that the Party would like to be rebranded,\" Rottinghaus said, \"but that is in political terms very difficult to accomplish. This is especially true for African Americans where they are the most reliable group who vote for Democrats in history.\", Perry nodded to that history. He acknowledged Barry Goldwaters opposition to civil rights as a 1964 Republican presidential candidate, as well as the widespread support for \"states rights\" in the South \"as justification for keeping blacks from the voting booth and the dinner table.\", But he suggested that \"black poverty remains stagnant\" and that Democrats are out of ideas. He cited Obamas recent regulations on overtime pay, which Perry said will cost jobs and hurt African Americans at the bottom of the economic ladder. Whether the gambit will as a work as a campaign strategy remains to be seen. \"Its strategically smart for Perry to try to appear to appeal to a new group, but I think its difficult for him because it would imply that he feels he has some segment of the Republican vote locked up, and I dont think thats true,\" Rottinghaus said. \"I think theres no chance that theyre focusing on African American or the minority vote instead of trying to figure out how to appeal more directly to Christian conservatives or small business conservatives.\", Reporter Jennifer Reiley contributed.]", "Date": "20150706", "Author": "[Kevin Diaz]", "Link": "http://www.chron.com/news/politics/article/Perry-says-Republicans-are-best-hope-for-black-6363602.php", "Title": "[Perry says Republicans are best hope for black prosperity]"}