{"Content": "[Caption, Close, , Source: City of Houston campaign finance reports, Source: City of Houston campaign finance reports, , Source: City of Houston campaign finance reports, Source: City of Houston campaign finance reports, Bill King at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Adrian Garcia at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Sylvester Turner at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Chris Bell at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Marty McVey at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Stephen Costello at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Ben Hall at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. The 2015 Houston mayors race is on track to be the most expensive in the citys recent history, with the candidates filling their campaign coffers with more than $7 million in the first half of the year. This means Houstonians can expect to see no shortage of political advertising this cycle, as the crowded field of candidates lines up to pepper the web and televisions citywide in the four months leading up to Novembers election. \"If youre an Xfinity account executive, you have to be happy with these numbers,\" said Rice University political scientist Mark Jones. Campaign finance reports are not due until next Wednesday, but former Harris County Sheriff Adrian Garcia set off a cascade of early fundraising releases when he announced a $1.5 million haul Tuesday afternoon. City Councilman Stephen Costello led the pack with more than $1.8 million, including a $250,000 personal contribution and a $262,000 transfer from his city council account. Costello and Garcias campaigns were the only ones to release how much cash the candidates have on hand, with both saying they have more than $1.3 million in the bank. State Rep. Sylvester Turner, who started the race with some $900,000 from his legislative account, reported raising an additional $750,000. Because of a state fundraising blackout period that spans the legislative session, he was barred from accepting contributions until nine days before the close of the reporting period on June 30. Former Kemah mayor Bill King also broke the million-dollar threshold, having brought in about $1.25 million. Of that, $750,000 came from donors, with King donating the remaining $500,000 to his campaign. None of the candidates has released a complete fundraising report, so the Chronicle could not independently verify the campaigns announced totals. The identities of major donors and how the candidates are spending the money also remain unknown. Looking back to Houstons last open mayoral race in 2009, Costello, Garcia, King and Turner each took in more than what Mayor Annise Parker and runner-up Gene Locke had raised at this point in their campaigns  about $800,000 and $1.1 million, respectively. And while no one topped former mayor Bill Whites July 2003 haul of $2.9 million or former mayor Lee Browns $2.2 million in 2001, in total the six candidates raised more than everyone combined at this point in both of Houstons last two open-seat mayors races. University of Houston political scientist Brandon Rottinghaus called it a \"blockbuster\" showing.\"The streets will be littered with campaign paraphernalia,\" he said. Meanwhile, 2013 mayoral runner-up Ben Halls coffers swelled by nearly $800,000, $500,000 of which he donated himself, according to his campaign. Hall pursued a similar, though more robust, funding strategy in 2013, when he contributed $1.7 of his $2 million raised through the first half of the year. Former congressman and city councilman Chris Bell ended the reporting period having raised nearly $400,000. Bell came in third among likely voters in a June Houston Public Media/KHOU mayoral poll, but political observers said the lower fundraising total could prove problematic. \"He raised enough to be credible in the abstract. The problem is when you compare that figure to the others, it starts to look like hes not competitive,\" Rottinghaus said. However, Bells campaign manager, Patrick Devney, said the campaign is confident that Bells fundraising total puts him in a strong position. \"It cannot be overlooked that Chris starts out with millions of dollars of name ID,\" Devney said. Businessman Marty McVey said his campaign finance report will show his campaign has taken in about $1.175 million. However, he said $1 million of that came in the form of a loan. McVey, who said he personally contributed $75,000, did not identify the lender.]", "Date": "20150708", "Author": "[Rebecca Elliott]", "Link": "http://www.chron.com/politics/election/local/article/July-fundraising-preview-6372821.php", "Title": "[Mayoral candidates report more than $7M in campaign cash]"}