{"Content": "[Caption, Close, Republican presidential candidates gather on stage before a forum  Monday, Aug. 3, 2015, in Manchester, N.H. From left: Jeb Bush, Ben Carson, Chris Christie, Carly Fiorina, Lindsey Graham, Bobby Jindal, John Kasich, George Pataki, Rick Perry, Rick Santorum, and Scott Walker. (AP Photo/Bill Sikes), Its fight night in America. OK, that might be a bit too much, but it can easily feel that way for anyone who has watched the early machinations of the 2016 race for the White House. After months of staged candidate announcements and prepared speeches before sympathetic crowds, the Republican presidential hopefuls will have their first prolonged unscripted moment. The Fox debates tonight -- the first at 4 p.m. and the main one at 8 p.m. -- in Cleveland are the official start of the partys attempt to re-take the White House after years of devastating defeats (the 2010 midterm elections notwithstanding). Here are a few things to keep in mind: , * Insider Edition. The many millions who will eventually vote in the general election will likely not be watching. Tonight is not for them. Its for the people who can actually name each person on stage. Bonus points if you know who Jim Gilmore is. Hell be standing on the far left, at the last podium to be exact, on the 4 p.m. debate stage. All of that to say that while political reporters and campaign operatives will be watching the debate closely, and itll give them something to talk about until the next debate, itll be another Thursday night for most Americans. And yet, the non-politicos who do tune in will be hearing the candidates stump speeches and crowd-pleasing zingers for the first time tonight. That also matters. * Dont blink.This might not actually be a bloodbath, but if it does turn into one, then itll likely happen in an instant. There has been constant chatter since Donald Trumps rise in the Republican field that tonights debate is all but certain to be a free-for-all for attention, a nasty brawl between the bombastic, insult-hurling Trump and his rivals who will have no choice but to respond with force. Should they respond in kind or should they act like the adult in the room? For some of them, who desperately need a good report card after the debate, it might seem appealing to get in a few punches -- if they have to. But Trump might not even go there. Nobody, not even his close advisers, knows what he is going to do tonight. \"Id prefer no conflict, no infighting,\" he told The Washington Post. \"But if they hit me, Ill hit them harder. Its all going to depend on the moment.\" Trump will be at the center podium, perhaps fittingly, like the teacher in a crowded classroom, overshadowing the moderators and ready at a moments notice to give his rivals detention if he feels theyve earned it. * Its Perrys time to shine. How fitting that the former Texas governor will take the same place on stage at the 4 p.m. debate as Donald Trump will take at the 8 p.m. debate.After weeks of their back-and-forth, both men will arrive in Cleveland with enough pent up energy to set the room on fire. For Perry, this might very well be a blessing, a theory his advisers had shopped around after news broke that he would not make the prime-time debate. More than anyone else, Perry has been willing to attack Trump at every campaign stop. At first, it was an attempt to rise in the polls and get into the debate, but now that thats all settled, Perry has the opportunity to take a different tack. Its unquestionably a time for Perry to pivot. Tonight, he doesnt have to feel obligated to go after Trump in the same way, or at all. Out of sight, out of mind. The former governor presumably knows he cant keep up with The Donald, the GOPs summer entertainer-in-chief, so dont do it anymore. It was fun while it lasted, though. * What will Texans say? For a Texas angle, look for the debate reaction from elected officials. The incessant comparisons in recent weeks between Rick Perry and Ted Cruzs presidential campaigns have fueled the narrative that they are battling it out for the states major endorsements. Cruz, who will be at the 8 p.m. debate, has some major backing from the states tea party crowd, and they dont seem to be going anywhere. They most certainly wont back Perry, ever. Still, the former governor has tried to boost his endorsements by pursuing blessings from people who still very much animate the Republican Partys base. There was a reason Perrys announcement was heavy on military references, which included shout-outs to Marcus Luttrell, a veteran who survived an attack in Afghanistan, and Taya Kyle, the widow of Chris Kyle, the Texas veteran whose story was immortalized in the film \"American Sniper.\" The Texas contingent will matter much more as the process goes on, and especially when the candidates come here before the March 1 primary. But tonights debate could be a major turning point in how Texas Republicans, several of them well-connected and influential, view the viability of Cruz and Perrys candidacy. ]", "Date": "20150806", "Author": "[Bobby Cervantes]", "Link": "http://www.chron.com/politics/texas-take/article/2016-s-pre-season-ends-tonight-6428894.php", "Title": "[2016's pre-season ends tonight]"}