{"Content": "[As the raceheats up for the White House, new attention is being paid to questions raised about the way Sen. Marco Rubio (R-Florida) used campaign cash during his time in the Sunshine States Legislature. When Rubio entered the Florida House of Representatives in 2000, the then 28-year-old was laden with debt. The Tampa Bay Times described him as \"barely solvent\" as he plotted his ascent to Speaker of the House in 2006 and the lead up to his 2009 run for the U.S. Senate.During this time, Rubio apparently usedthe resources of his two political committees and an American Express credit card from the state Republican Party for some of his personal expenses. The Miami Herald and the Tampa Bay Times investigated Rubios questionable bookkeeping in 2010. Those reports showed Rubios free use of his party credit card to cover personal expenses like a $135 haircut, trip to a local liquor store and $10,000 family vacation. Rubio said at the time that honest bookkeeping mistakes were made and insisted he reimbursed the state party when necessary to pay for personal charges. Mother Jones revisited those reports this week and suggested Rubios handling of his finances could \"bring national scrutiny\" and haunt him as he is poised to pursue a White House bid in 2016. Reached for comment, Rubio spokeswomanBrooke Sammon dismissed the Mother Jones and Florida press reports. \"That report was nothing more than proven inaccuracies and false attacks from liberals trying to distract from Senator Rubios optimistic vision for our country in the 21st century,\" Sammon told Business Insider. The allegations surrounding Rubios finances fall in two major areas, his credit card usage and his political committees. During his time in the Florida House, Rubio started two separate political committees, Floridians for Conservative Leadership andFloridians for Conservative Leadership in Government. The groups received an estimated $600,000 in less than three years. Floridians for Conservative Leadership, Floridians for Conservative Leadership in Government , Rubio was dogged by questions about his spending when he ran against then-Florida Gov. Charlie Crist for Senate in 2010. During that campaign, Crist said Rubio usedhis political committees as \"slush funds.\" Crist alsoclaimed Rubio used his office in the legislature to \"enhance his personal enrichment.\", Rubio managed to escape the scrutiny and was victorious over Crist in 2010. But now that Rubio is eyeing a larger stage and is expected to run for President in 2016, his history will again be called into question. Though seen as the underdog in Florida since he will presumably face his former mentor, the states former Gov. Jeb Bush (R) in the Republican primary race, Rubiois still seen as a serious contender. The Washington Post reportedthis week thatRubio is expected to receive $10 million in backing from billionaire Miami car dealerNorman Braman in the presidential race. (Rubios wife works part time for Bramans charitable foundation.), Updated (5:15 p.m.): With comment from Rubios office. Join the conversation about this story , NOW WATCH: This 40-year-old Indonesian is Obamas doppelgnger, See Also:]", "Date": "20150306", "Author": "[Leslie Larson, provided by]", "Link": "http://www.chron.com/default/article/Marco-Rubio-has-a-big-money-problem-6119789.php", "Title": "[Marco Rubio has a 'big money' problem]"}