{"Content": "[Caption, Close, Shelly Rollins, from left, poll worker, and Chelsea Taylor, Alternate Election Judge at the polling location for Precincts 32, 45 & 84 at the Timber Lakes/Timber Ridge Fire Station in Spring, check out the voting machines before opening the polling location on Saturday, May 9, 2015. Former State Texas Representative Steve Toth, left, and Walt Sass expressed their difference of opinion on the road bond election during some early morning campaigning at the polling location at the South Community Building in The Woodlands on Saturday, May 9, 2015. Election Judge Paul Cravey helps Timber Lakes resident Mandy Spence with the voting process   at the polling location for Precincts 32, 45 & 84 at the Timber Lakes/Timber Ridge Fire Station in Spring on Saturday. Chelsea Taylor, alternate election judge at the polling location for Precincts 32, 45 & 84 at the Timber Lakes/Timber Ridge Fire Station in Spring, checks the voting machines before opening the polling location on Saturday. Voters decided whether to approve more than $1 billion for roads and schools in dozens of elections across the region Saturday. A record-high number of voters turned out in Montgomery County, where early returns Saturday signaled that a hard-fought election expected to be razor close over $350 million in road bonds could fail. With 28 of 32 precincts counted, 58 percent of voters opposed the bond proposal. Early voting was particularly heavy in The Woodlands, whose early votes comprised 45 percent of the early votes cast although this community makes up only 20 percent of the countys population. Montgomery County, Voters in New Caney ISD are deciding whether to approve$173 million bond to pay for a new middle school, new elementary, new or renovated stadium and other renovations. About 57 percent of voters supported that referendum, according to initial results. tMontgomery ISD voters cast ballots to decide whether to approve a $256.75 million bond election to fund a new high school, new middle school and new elementary school. About 78 percent of ballots cast are in favor of the bond. Montgomery County elections results can be found here. Harris County, The second-largest bond on the ballot this election came from Alief ISD, where 72 percent of voters approved $341 million bond. The referendum is the districts first since 2003. Taxpayers in the district can expect to pay an extra $6.02 a month if their home is valued at $100,000, but senior citizens whose property taxes are frozen will not be impacted. The amount paid in taxes depends on the value of the individuals home. tKlein ISD: $498.1 million bond that would fund the districts fifth high school, 10th intermediate campus and another elementary school and districtwide renovations. About 80 percent of voters supported that bond, according to preliminary results that tallied more than 30 percent of the votes. Harris County results will be here. Fort Bend County, With early ballots counted, Stafford mayorLeonard Scarcella, the longest serving mayor in the U.S. was withstanding a rare challenge. He was leading with about 63 percent of the vote. He was first elected in 1969. Fort Bend County results are hereand Galveston County results are here.Brazoria County voters can find their results here. ]", "Date": "20150509", "Author": "[Houston Chronicle]", "Link": "http://www.chron.com/news/politics/houston/article/Voters-take-to-the-polls-for-road-school-bonds-6253079.php", "Title": "[Montgomery County voters reject road bonds]"}