{"Content": "[Presidential candidate and Sen. Ted Cruz (R-Texas) apparently used to have a very different opinion about Chief Justice John Roberts than he expressed on Thursday. According to a 2005 Sun-Sentinelreport, Cruz once praised Roberts as\"one of the best constitutional minds in the country.\", Cruz reportedly made that comment while explaining why, as a domestic policy adviser for George W. Bushs 2000 presidential campaign, he brought Roberts to Florida to assist with his teams legal battle over the controversial post-election recount. And as the Texas Tribune reported three years ago,when Bush nominated Roberts to the Supreme Court in 2005, Cruz \"was an outspoken advocate for his confirmation, calling him brilliant and a lawyers lawyer.\", \"As an individual, John Roberts is undoubtedly a principled conservative, as is the president who appointed him,\" Cruz wrote at the time in the National Review.\"But, as a jurist, Judge Robertss approach will be that of his entire career: carefully, faithfully applying the Constitution and legal precedent.\", Cruz, now running a fiercely conservative campaign for president, seemed to have a much different take on Roberts on Thursday when the Supreme Court issued its second major ruling protecting the Affordable Care Act, also known as Obamacare, In a passionate statement, Cruz tore into the courts \"robed Houdinis\"who \"transmogrified\" the law to defend President Barack Obamas signature healthcare law. Roberts wrote both of the rulings Cruz criticized. \"Todays decision in King v. Burwell is judicial activism, plain and simple. For the second time in just a few years, a handful of unelected judges has rewritten the text of Obamacare in order to impose this failed law on millions of Americans,\" the senator said. Cruzs lengthy statementargued that the Supreme Court justices clearly screwed up and that they would have ruled againstthe Affordable Care Act if politics had not intervened. Cruz once clerked for then-Chief Justice William Rehnquist and, as Texas solicitor general, argued a number of cases before the Supreme Court. \"For nakedly political reasons, the Supreme Court willfully ignored the words that Congress wrote, and instead read into the law their preferred policy outcome. These judges have joined with President Obama in harming millions of Americans,\" he continued. \"Unelected judges have once again become legislators, and bad ones at that. They are lawless, and they hide their prevarication in legalese. Our government was designed to be one of laws, not of men, and this transparent distortion is disgraceful.\", Cruzs campaign did not respond to requests for comment from Business Insider on Thursday asking about the 2005 Sun-Sentinel report and whether his opinion of Roberts has changed. If his opinion about Roberts has indeed shifted, Cruz wouldnt be the only one. Roberts was nominated for his position by Bush, a Republican, and many conservatives criticized him for siding with the courts liberal wing in the Obamacare ruling. Similarly, as a senator, President Obama criticized and voted against Roberts confirmation in 2005. Obamalikely has a very different opinion of the chief justice today. Join the conversation about this story , NOW WATCH: 12 awesome facts about WWE superstar Brock Lesnar, See Also:, SEE ALSO:Republican presidential candidates are not happy about the Supreme Court Obamacare ruling]", "Date": "20150625", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/Ted-Cruz-is-bashing-John-Roberts-after-years-of-6349784.php", "Title": "[Ted Cruz is bashing John Roberts after years of praising him]"}