{"Content": "[Caption, Close, There are seven top-tier candidates for mayor in Houston. Mayor Annise Parker is term-limited. Mayoral candidate Sylvester Turner also is a Democratic state representative. Bill King at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Bill King at the Mayoral Forum focused on Arts and Culture on June... Mayoral candidate Chris Bell is a former Congressman and City Councilman. Mayoral candidate Marty McVey runs a private equity firm. Mayoral candidate Adrian Garcia is a former sheriff of Harris County and a former City Councilman. Mayoral candidate Ben Hall is a former city attorney. Mayoral candidate Stephen Costello also is a City Councilman. All seven top-tier candidates vying for term-limited Mayor Annise Parkers chair this fall appeared at a forum Saturday morning focused on labor and workers rights. The questions often revealed little distance among the hopefuls, and, indeed, a few noted it would be tough to find a Houston mayoral candidate opposed to comprehensive immigration reform or living wages for workers. All the candidates said they support those issues, as well as worker training programs and improved access to health care, two other questions posed by forum panelists. All seven candidates shared at least some level of concern about issues such as gentrification and low voter turnout.The one question to generate any fireworks was a predictable one: Whether the candidates support keeping and funding the defined benefit pension plan for municipal workers. First, some background on Houstons pension problem. Prior to benefit increases in the early 2000s, the citys annual contribution required to keep its three pensions fully funded had not topped 19 percent of payroll for police, 16 percent for firefighters or 10 percent for municipal workers for at least a decade. Those contribution levels now top 30 percent of payroll for police and fire and 25 percent for the municipal plan. The city has met the recommended payment to the police or municipal pensions only once since 2002, and keeping up will only get harder: Payments are projected to increase roughly 50 percent by 2019, to $440 million. This year, that payment tops $350 million, almost twice what the city spends on trash pickup, parks and libraries combined. Reforms to the police pension in 2004 and the municipal plan in 2007 mean retirement packages for new firefighters are by far the citys most generous, so the fire plan is most often discussed.Former Kemah mayor Bill King and former city attorney Ben Hall are the most hawkish on the subject. King said he opposes all defined benefit plans (as opposed to defined contribution, similar to many workers 401(k)s). \"We know in the public sector defined benefit plans create the temptation for elected officials to promise a benefit for workers on one hand and not ask the taxpayers to fund them on the other hand,\" he said. \"These plans will never be funded.\", Hall said he would honor all past promises to workers but would reform pensions for new hires, tying them to market risk rather than guaranteed specified benefits. City Councilman Steve Costello and former Harris County Sheriff Adrian Garcia struck a more moderate tone, with both saying defined benefit plans can be sustainable but calling for \"local control,\" or the ability for the city make pension decisions without going to the Legislature, which is the current situation. Former Congressman Chris Bell said he, too, supports defined benefit plans but acknowledged reform is needed. \"Is it sustainable as it presently is with the firefighters? No, and were going to have to address it,\" he said. \"But its also disingenuous to sit up here and try to lead people to believe that as mayor youre going to be able to cram a solution down the throats of the firefighters. You cant. Youre going to have to negotiate, and I will.\", Businessman Marty McVey and State Rep. Sylvester Turner positioned themselves as most cautious on pension reform. McVey said the city should issue debt to cover its multibillion-dollar pension underfunding and move on; \"We need to own up to our promise,\" he said. Hall, King and Costello all took swipes at Turner on pensions, prompting Bell to draw a sustained laugh from the crowd when he quipped, \"Dont worry Sylvester, Ill protect you.\", Turner, when his turn came, touted his work to place the state pension system on firmer footing, and said talk of \"local control\" is misleading because it suggests the Legislature has imposed more generous pension benefits on the city when every change since 1993 has been done with the mutual support of city and pension leaders. \"What is missing in this conversation is not just the benefits for the employees but governments like the city of Houston have consistently underfunded their contributions, have not made their payments, and now want to blame the employees,\" Turner said. \"You cannot balance the citys books on the backs of labor, and I think we need to be very careful when we address this issue.\", The events panelists (Richard Shaw of the Harris County AFL-CIO, Melissa Miranda of Mi Familia Vota, Tarsha Jackson of Texas Organizing Project, Hamilton Gramajo of Fe y Justicia Worker Center and Paul Puente of Houston Gulf Coast Building and Construction Trades Council) and moderator (Univisions Rebecca Suarez) didnt call a forum on pensions, however, and most questions focused in other areas. Here are some highlights of what the candidates said about economic inequality, workers rights and affordable housing:, - Bell said at least twice that he would put a labor liaison on his executive staff as mayor and also stressed the need to address growing economic inequality in Houston. \"If we dont address this issue were going to continue to have a city of haves versus have-nots,\" he said. - Costello focused several times on worker training. He advocated the use of \"best value\" rather than \"low bid\" selections in city contracting to enable the city to better penalize irresponsible companies that cut corners. On affordable housing, he advocated for the city to provide more incentives to developers to avoid gentrification, and for similar efforts creating an affordable district for artists. - Garcia: Touted his efforts while on City Council to get vaccines to Latino kids in his district when he learned his district had one of the citys lowest immunization rates. He focused heavily on affordable housing and gentrification, and said the city must find ways to prevent citizens from paying for their neighbors investments in their own taxes. - Hall said he would give preference in city contracting to companies that provide apprenticeships and said he would pursue policies to \"grandfather\" existing homes in gentrifying areas to prevent residents from being pushed out. - King: Said he would work to increase the number of and funding for Federally Quality Health Clinics, and would evaluate whether city clinics unnecessarily duplicate services with county clinics. He said any contractor caught stealing workers wages should be fired and banned from doing business with the city. - McVey said because the Legislature has blocked the expansion of Medicaid under the Affordable Care Act, the city should seek a way to get payments directly from Washington. McVey also called for more urban planning, with a focus on preventing gentrification. - Turner touted his support in the Legislature for expanding a health insurance program for impoverished youth and for increased funding for trauma centers, and took issue with an expansive subsidy program launched under Parker to pay developers $15,000 per apartment or condominium built downtown; \"Its about time we pushed that to the neighborhoods,\" he said.]", "Date": "20150612", "Author": "[Mike Morris]", "Link": "http://www.chron.com/politics/election/local/article/Pensions-provide-rare-fireworks-at-third-mayoral-6312573.php", "Title": "[Pensions provide rare fireworks at third mayoral forum]"}