{"Content": "[In an oft-quoted exchange, a woman buttonholed Benjamin Franklin as he exited a session of the 1787 Constitutional Convention and asked him whether the new government of the United States would be a monarchy or a republic. With a premonitory insight, Franklin answered, \"A republic, if you can keep it.\", At that stage, the republic did not extend the franchise to either enslaved people or women. Perfecting the union to grant full rights to all its members remained a task for the future that continues today. As Franklin envisioned, history served up severe challenges to the rights of citizens that the new Constitution enshrined. Times of crisis produced periodic lapses. It took the suffragette movement to earn women the vote, while their struggle for full economic equality continues. Although the Civil War resulted in the abolition of slavery, the subsequent disenfranchisement of freed blacks in the South would require a civil rights movement a century later to counter racial discrimination. The internment of loyal Japanese-American citizens on the West Coast during World War II was eventually seen as an illegal abrogation of their rights, and the post-9/11 erosion of hallowed judicial procedures such as habeas corpus and prohibitions against indefinite detainment and torture will likely be regarded in a similar light by future generations. Throughout it all, events have shown that the genius of our system lies in its ability to change course from those lapses and steer the ship of state back to the framework of law upon which it was launched. That process seems to once more be under way. Although Thanksgiving celebrations across the country this year are shadowed by stormy economic skies and continuing military conflicts and terror threats abroad, the mostly concluded national election has once again demonstrated both the good sense of the American voter and a commitment by both the winners and losers to the peaceful transition of power and a devotion to the common good. The gracious concession speech by Republican presidential candidate John McCain and the open-handed pledge of support by President George W. Bush for the transition to his successor, Barack Obama, epitomize and renew the sacred commitment to constitutional process. Likewise, the measured first steps of President-elect Obama, including picking chief party rival Hillary Clinton as secretary of State and current Bush Secretary of Defense Robert Gates as a holdover, promise a government of experience, bipartisanship and proven expertise. With nearly two months until he is sworn into office, Obama has already created an aura for his future administration of much-needed reassurance, competence and conciliation. One of the most encouraging reports to come out of the transition camp, according to The Washington Post, is a plan to remove the Federal Emergency Management Agency from the Department of Homeland Security and give it a higher priority, perhaps under former highly regarded Clinton-era FEMA administrator James Lee Witt. Given its poor performance during recent hurricane emergencies, that would be a change for which all Texas coastal residents could give thanks.]", "Date": "20081127", "Author": "[Copyright 2008 Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Hope-in-the-air-Americans-can-give-thanks-for-a767384.php", "Title": "[Hope in the air: Americans can give thanks for an enduring democracy that keeps faith with its Constitution]"}