{"Content": "[Caption, Close, FILE - In this Aug. 18, 2015 file photo, U.S. Attorney Conner Eldridge speaks at a Little Rock, Ark. civic club. Former U.S. Attorney Eldridge announced his bid to unseat Republican U.S. Sen. John Boozman next year in Arkansas, launching an uphill challenge in a state where Democrats have suffered heavy losses in recent years. LITTLE ROCK, Ark. (AP)  Former U.S. Attorney Conner Eldridge announced his bid Wednesday to unseat Republican U.S. Sen. John Boozman next year in Arkansas, launching an uphill challenge in a state where Democrats have suffered heavy losses in recent years. Eldridge, 38, is the first Democratic candidate to announce hes running for Boozmans seat. Boozman, a former congressman, was first elected to the Senate in 2010, and announced last year he would seek a second term in 2016. \"Washington is broken,\" Eldridge said in a statement released by his campaign. \"Im running for the Senate because Im committed to doing everything I can to fix it for Arkansas and for our country.\", Eldridge is running in a state where Republicans have swept statewide and federal offices in recent elections by tying Democrats to President Barack Obama, who remains deeply unpopular in Arkansas. Boozman defeated two-term Democratic U.S. Sen. Blanche Lincoln in the 2010 election. Eldridge distanced himself from the president, saying he opposes the Iran nuclear deal backed by the White House. Republicans have criticized the agreement, which aims to curb Irans nuclear program in exchange for billions of dollars in relief from international economic sanctions. \"I think the Iran deal is a bad deal for our country,\" Eldridge told The Associated Press. \"Reaching this deal enables $100 billion or more to go to the largest state sponsor of terrorism. Thats just not a good deal in my opinion.\", Eldridge stopped short of saying whether he would have voted for the presidents health overhaul, but said he opposes attempts to repeal the law and that he would push to improve it. Boozman and the rest of the states all-GOP Republican delegation have called for the laws repeal. Eldridge stepped down as the U.S. attorney for the western district of Arkansas last month, after widespread speculation he was weighing a Senate bid. Eldridge was nominated by Obama to the post in September 2010, and he was confirmed later that year. Boozman said he planned to run for re-election after he had emergency heart surgery last year. He reported having more than $872,000 in the bank for his re-election bid last month. Boozman vowed to continue fighting the presidents \"misguided agenda\" on issues such as illegal immigration and the Iran deal. \"I am committed to continuing to strongly advocate for Arkansas and I look forward to the campaign next year,\" he said in a statement. Eldridge didnt mention Boozman in his announcement and declined to say how hed contrast himself with the incumbent senator. \"Im ready to go to the senate and approach the job of a senator in that nonpartisan, result-driven way that cuts through the partisanship and problems in Washington,\" he told the AP. Candidates can begin filing paperwork to officially run for office in November. Eldridge is the second Democrat to launch a 2016 bid for federal office in the state. Former Little Rock School Board member Dianne Curry last month announced she was challenging U.S. Rep. French Hill in central Arkansas 2nd District. State Democrats cheered Eldridges entry in the race, calling him an energetic candidate. \"Hes a conservative Democrat in a state where most Democrats are conservative Democrats, so I think hes going to do well,\" state Democratic Party spokesman H.L. Moody said. Republicans were quick to try and cast Eldridge as too closely aligned with the president. \"Conner Eldridge might want to remove the line about working for President Obama on his resume, because his ties to the unpopular President make him unelectable in Arkansas,\" National Republican Senatorial Committee Communications Director Andrea Bozek said in a statement issued shortly after Eldridges announcement. ", "Date": "20150909", "Author": "[Andrew Demillo, Associated Press]", "Link": "http://www.chron.com/news/article/Ex-prosecutor-launches-bid-to-unseat-Republican-6493157.php", "Title": "[Ex-prosecutor launches bid to unseat Republican Sen. Boozman]"}