{"Content": "[Within minutes of the U.S. Supreme Courts decision on Thursday to uphold state-base exchanges under President Barack Obamas signature health care law reaction poured in on the long-awaited ruling from Austin to Washington D.C. Heres a sampling:, , U.S. Rep. Pete Olson, R-Sugar Land: \"The Supreme Court has spoken. We must respect their decision, even if we disagree with it. The Supreme Courts job is to determine the Constitutionality of law. Both good and bad laws can be Constitutional. Today, the Supreme Court determined that a bad law that most Americans want repealed is Constitutional.\", , Texas Democratic Party Chairman Gilberto Hinojosa: \"Today is a big victory for hard-working Texans. Close to one million people will keep their health care coverage at a reasonable and affordable price. The Affordable Care Act works. And, although we celebrate todays victory, we must remember that there are Texans still living without access to quality and affordable health care.\", , U.S. Rep. Randy Weber, R-Friendswood:  \"The Presidents health care law has been a major disappointment for hard-working Americans. Families are being forced to pay higher premiums for less coverage. The President promised that under this law all would be covered. According to the Texas Hospital Association, in my district alone, 164,976 Texans are still uninsured. Healthcare should be an affordable choice, not a mandate on taxpayers. The Supreme Courts decision today further reinforces the fact that in President Obamas America, the law no longer matters.\", , Ted Shaw, president of the Texas Hospital Association: \"With more than 1 million Texans purchasing private health insurance coverage through the federal marketplace, Texas hospitals can breathe a sigh of relief now that the Supreme Court has ruled in favor of Burwell. Texas still leads the nation in the number of uninsured and we have significant work to do to increase access to coverage. But there is little doubt that hospitals financial challenges would be even greater if more than 1 million Texans were added to the rolls of uninsured.\", , Texas Gov. Greg Abbott: \"The Supreme Court abandoned the Constitution to resuscitate a failing healthcare law. Todays action underscores why it is now more important than ever to ensure we elect a President who will repeal Obamacare and enact real healthcare reforms.\", , Mimi Garcia, Texas State director for Get Covered America: \"Todays decision from the Supreme Court is a victory for the 832,000 Texans who receive financial help to pay for their coverage through the Health Insurance Marketplace. In fact, 86% of Marketplace enrollees in Texas receive these tax credits, and the average tax credit in Texas is $247 per month. After finally being able to access quality, affordable health coverage, these consumers can now be certain that the promise of that coverage remains there for them and that they can get the care they need.\", , Texas Sen. Charles Schwertner, R-Georgetown:  \"Over the past five years, weve seen Obamacare repeatedly changed and contorted through executive actions by President Obama and controversial judicial decisions by the United States Supreme Court. This mornings ruling represents the latest tortured attempt to preserve a law that is fundamentally flawed and unworkable. As an American, I find it troubling that the letter of the law can be so easily subjugated to some implied legislative intent that exists only in the minds of a few congressional lawmakers in Washington, DC.\", , Dr. Alice Chen, executive director of Doctors for America: \"Today is a great day for the health and security of millions of Americans who can breathe a little easier knowing their health insurance will not be taken away. Doctors across the country can now focus on helping their patients get better. It is time for Americans across the political spectrum to embrace the idea that health care should be a right in the wealthiest country in the world. We cannot go back to the days when people with pre-existing conditions - the very people who need health care the most - were denied coverage.\", ]", "Date": "20150625", "Author": "[HOUSTON CHRONICLE]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Reaction-fast-and-furious-to-high-court-s-health-6348930.php", "Title": "[Reaction fast and furious to high court's health care ruling]"}