{"Content": "[Caption, Close, Border Patrol agents search a Salvadoran girl as her sister watches after the two were caught crossing the border illegally at Mission, Texas, in July.  (Photo by John Moore/Getty Images), Republican leaders in Texas and in Washington appear less and less interested in resolving the illegal immigration issue in a realistic fashion, perhaps because it has proven to be such a productive way of stirring up the party faithful at election time. This page has pointed out before that despite portrayals to the contrary, the U.S.-Mexico border is more secure, with far fewer illegal crossings and less crime, than it was a decade ago. At the same time, the number of U.S. Border Patrol agents has soared, and hundreds of miles of border fencing, 651 of them under President Barack Obama, have been constructed, even though their value is questionable. Yet, in Texas, Lt. Gov. Dan Patrick has proposed spending $815million in state money on border security measures, while in Washington, House Republicans are preparing a border bill that, among other things, would impose a five-year deadline to get \"operational control\" of the full border, which it defines as \"the prevention of all unlawful entries into the United States.\", Good luck meeting that requirement, because as long as economic disparities exist between the U.S. and its southern neighbors, and crime runs rampant in places like Honduras with its weak institutions, desperate people will find a way to come here, no matter the obstacles. As is often said in the Rio Grande Valley, where illegal immigration has long been part of border life, \"Build a 10-foot fence, and theyll get an 11-foot ladder.\", Our belief is that the U.S. can do better by helping nations that are the primary sources for illegal immigration do better, a point the Obama administration drove home last week with the announcement it would seek $1 billion from Congress to help El Salvador, Guatemala and Honduras start remaking themselves. People are leaving those countries, as well as Mexico, because they are looking for a better life than they can get at home, where political and economic systems have been damaged by, among other things, corruption, crime and a long history of inequality. In a column in the New York Times, Vice President Joe Biden said the money - three times what the U.S normally provides to the region - would go toward improved policing, governance and economic policy, but was just the beginning of a long process. The alternative, he pointed out, would be 6 million young Central Americans entering the labor force over the next decade with few economic prospects at home, the same kind of scenario that brought a flood of Central American youths to the U.S. border last summer. The U.S. has done something similar with Colombia under the so-called \"Plan Colombia,\" and works with Mexico to improve its criminal justice system, modernize U.S.-Mexico border infrastructure and promote community programs under the Merida Initiative signed in 2007 by President George W. Bush and Mexican President Vicente Fox. There have been varying degrees of success in the existing programs, which have been hindered in part by the lack of promised U.S. funding for some initiatives. But confronting what are in some cases centuries-old problems takes time and resolve, as well as money. We urge Congress to approve President Obamas $1 billion request for Central America and to look for other ways to help our southern neighbors, including full funding for existing programs under the Merida Initiative. It also needs to get serious about meaningful immigration, but that may be expecting too much. In the end, money invested in Mexico and Central America will be money much more productively spent than putting up a multi-billion-dollar fence of questionable efficacy or trying to flood a 2,000-mile border with Border Patrol agents or National Guard troops. It would be nice if Congress also recognized that the U.S. fuels violence, lawlessness and ultimately immigration in the region by being the largest consumer of illicit drugs from Latin American drug cartels and, because of our loose gun laws, their main provider of illegal weapons. The U.S. could help the region by doing better itself, but we seem unable to do so.]", "Date": "20150206", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Necessary-aid-6063059.php", "Title": "[Necessary aid]"}