{"Content": "[Caption, Close, , Remember the Texas economic miracle? In 2012, it was one of the three main arguments from then-Gov. Rick Perry about why he should be president, along with his strong support from the religious right and something else I cant remember (sorry, couldnt help myself). More broadly, conservatives have long held Texas up as a supposed demonstration that low taxes on the rich and harsh treatment of the poor are the keys to prosperity. So its interesting to note that Texas is looking a lot less miraculous lately than it used to. To be fair, were talking about a modest stumble, not a collapse. Still, events in Texas and other states - notably Kansas and California - are providing yet another object demonstration that the tax-cut obsession that dominates the modern Republican Party is all wrong. The facts: For many years, economic growth in Texas has consistently outpaced growth in the rest of America. But that long run ended in 2015, with employment growth in Texas dropping well below the national average and a fall in leading indicators pointing to a further slowdown ahead. In most states, this slowdown would be no big deal; occasional underperformance is just a fact of life. But everything is bigger in Texas, including inflated expectations, so the slowdown has come as something of a shock. Now, theres no mystery about what is happening: Its all about the hydrocarbons. Texans like to point out that their states economy is a lot more diversified than it was in J.R. Ewings day, and theyre right. But Texas still has a disproportionate share of the U.S. oil and gas industry, and it benefited far more than most other states from the fracking boom. By my estimates, this extractive-sector windfall accounted for about a third of the difference between growth in Texas and growth in the rest of the country. Like the rest of the Sunbelt, Texas is still benefiting from the long southward shift of Americas population that began with the coming of widespread air-conditioning; average January temperature remains a powerful predictor of regional growth. Texas also attracts new residents with its permissive land-use policies, which have kept housing cheap. Now one of the three big drivers of Texas growth has gone into reverse, as low world oil prices are bringing the fracking boom to a screeching halt. Hey, things like that happen to every state now and then. But Texas wasnt supposed to be like other states. It was supposed to be the shining exemplar of the economic payoff to reverse Robin-Hood economics. So its recent disappointments hit the right-wing cause hard - especially coming on the heels of the Kansas debacle. For those who havent been following the Kansas story, in 2012, Sam Brownback, the states hard-right governor, pushed through large tax cuts that would, he promised, lead to rapid economic growth with little, if any, loss of revenue. But the promised boom never materialized, while big budget deficits did. And, meanwhile, theres California, long mocked by the right as an economy doomed by its liberal politics. Not so much, it turns out: The budget is back in surplus in part because the emergence of a Democratic supermajority finally made it possible to enact tax increases, and the state is experiencing a solid recovery. The states, Louis Brandeis famously declared, are the laboratories of democracy. In fact, Brownback himself described his plan as an \"experiment\" that would demonstrate the truth of his economic doctrine. What it actually did, however, was demonstrate the opposite- and much the same message is coming from other laboratories, from the stumble in Texas to the comeback in California. Will anyone on the right take heed? Probably not. Unlike real experimenters, Brownback wasnt willing to take no for an answer, whatever happened, and the same is true for just about everyone on his side of the political divide. Or to put it another way, belief that tax cuts are a universal elixir that cures all economic ills is the ultimate zombie idea - one that should have died long ago in the face of the facts, but just keeps shambling along. Nothing that has happened in the past quarter-century has supported tax-cut mania, yet the doctrines hold on the Republican Party is stronger than ever. It would be foolish to expect recent events to make much difference. Still, the spectacle of the Texas economy coming back to Earth, and Kansas sliding over the edge should at the very least make right-wing bombast ring hollow, in the general election if not in the primary. And someday, maybe, even conservatives will once again become willing to look at the facts. Krugman is a New York Times columnist.]", "Date": "20150605", "Author": "[Paul Krugman]", "Link": "http://www.chron.com/opinion/outlook/article/Krugman-Texas-miracle-more-of-Lone-Star-stumble-6310160.php", "Title": "[Krugman: Texas 'miracle' more of Lone Star stumble]"}