{"Content": "[UNITED NATIONS (AP)  The Security Council unanimously approved a statement backing intensive preparatory talks on key issues to restore peace to Syria on Monday, a sign of possible change in the U.N.s most powerful body which has been deeply divided over how to end the war which has killed more than 250,000 people. Before all 15 council members approved the text, Russias U.N. Ambassador Vitaly Churkin said the presidential statement \"would be the first exclusively political document on the Syrian crisis adopted by consensus.\", The councils unity on a Syria political statement comes amid a flurry of diplomatic activity to try to end the conflict, now in its fifth year, which has created the gravest humanitarian crisis in the world today. The nuclear deal between Iran and six major powers appears to have opened the way for a series of diplomatic moves involving the United States, Russia and key Mideast and European nations as well as U.N. special envoy Staffan de Mistura, all seeking to find a way to break the political impasse though key differences remain, especially over the future of Syrian President Bashar Assad. The Security Council endorsed the recently announced plan by de Mistura aimed at setting the stage for new peace talks to end the civil war. It includes talks on a political transition leading to democratic elections and how best to fight terrorism. Venezuela held up approval of the statement, which had been expected last week, over its references to a political transition. The council statement demands that all parties in Syria \"work urgently\" toward fully implementing the roadmap to peace adopted by key nations in Geneva in June 2012 which calls for the formation of a transitional government with full executive powers \"on the basis of mutual consent.\" The roadmap would require Assad to relinquish power at some unspecified point. Venezuelas U.N. Ambassador Rafael Ramirez Carreno told the council after the statement was read at an open meeting that it violates \"the sovereignty and self-determination of the Syrian people by promoting a political transition including the establishment of a transitional government without its consent and thus goes against the Charter of the United Nations.\", Nonetheless, Ramirez Carreno said Venezuela decided to act in a \"constructive spirit in not preventing this document because we sincerely believe that we have to give peace a chance and that we have to give political solutions a chance.\", Frances deputy U.N. ambassador Alexis Lamek said what matters is that the Security Council has \"regained unity\" and adopted \"a significant statement on the political process in Syria\" by consensus. \"I think thats a major achievement,\" he said. Lamek said the statement also makes clear that \"we will not defeat terrorism if there is not an organized transition in Syria.\", The statement urges all parties \"to engage in good faith\" with de Mistura who plans to hold simultaneous discussions among the Syrian parties on key aspects of the 2012 Geneva roadmap. The four \"working groups\" he called for will tackle safety and protection of civilians including medical access and the release of detainees; political and constitutional issues; combating terrorism and military and security issues; and reconstruction and development. Secretary-General Ban Ki-moon has said the U.N. hopes to get the four working groups operational in September. The council statement condemns \"the ongoing and multiple terrorist acts\" in Syria by the Islamic State group and the al-Qaida-linked Nusra Front and \"reaffirms its resolve to address all aspects of the threat.\" It stresses that \"the only sustainable solution to the current crisis in Syria is through an inclusive and Syrian-led political process that meets the legitimate aspirations of the Syrian people.\", The statement reiterates the councils demands for all parties to stop attacks on civilians, including by shelling and dropping barrel bombs, and expresses \"grave alarm\" at the humanitarian crisis which has forced 12 million people to flee their homes, including over 4 million who have sought refuge in neighboring countries.]", "Date": "20150817", "Author": "[Edith M. Lederer, Associated Press]", "Link": "http://www.chron.com/news/us/article/UN-approves-statement-aimed-at-restoring-peace-to-6449121.php", "Title": "[UN approves statement aimed at restoring peace to Syria]"}