{"Content": "[Criminal justice and public safety took center stage at Wednesday evenings Houston mayoral forum, where candidates commented on issues ranging from gun safety and police brutality to the prosecution of low-level drug offenses. Though crime rates and police staffing have been routine talking points for many candidates throughout the campaign, only recently have some begun to articulate specific policy stances. The candidates remarks to a crowd of young professionals gathered at the University of Houston come on the heels of a series of high-profile Houston-area incidents, including last weeks massacre of a Harris County family of eight and Sandra Blands July death in the Waller County jail. Rather than responding to each question as a group, as has been routine in mayoral forums thus far, candidates were only allowed to answer questions posed directly to them. The event was attended by the seven major candidates. Former Congressman Chris Bell kicked off the event by calling for enforcement of the Class A misdemeanor of making a firearm accessible to a child, as well as voicing support for background checks of those who purchase firearms at gun shows on city property. \"If other cities have programs that are working in reducing gun violence in homes, then certainly we need to pick up on that and follow the lead,\" Bell said. Asked about low clearance rates at the Houston Police Department, former Harris County Sheriff Adrian Garcia cited his support for using DNA evidence to solve crimes, though he acknowledged the financial limitations. He also spoke to controlling police brutality. \"Im going to have a police chief that is in touch with the community,\" Garcia said. \"One thing that we cannot do as a law enforcement entity is lose peoples trust.\", Ben Hall, 2013 mayoral runner-up, criticized Garcias response as too shallow, while pointing to his own plan to bolster police transparency. \"The police have to answer to the public,\" Hall said. State Rep. Sylvester Turner later called for reform in the prosecution of low-level drug offenses. \"There are far too many people that are languishing in our jails and really should not have to go to a bail bondsman at all, because the offenses they are committing are so minor they shouldnt be there,\" Turner said, pointing to Blands case. \"We should reform the system. We need to be smarter.\", Turner also said Houston is under-policed and referenced his proposal to expand its police department by 540 officers over five years, which he estimated would cost $85 million. Garcia agreed, though he did not specify how many officers he would hire, pointing instead to a need for efficiency in light of the citys looming $126 million budget deficit. Other forum questions addressed ReBuild Houston, the citys controversial infrastructure improvement program, pension reform, income inequality and the citys embattled nondiscrimination ordinance, known as HERO. To close out the event, candidates were asked a series of six \"lightning round\" questions, to which they were allowed one-word answers. Heres how they came down:, 1.tWill you vote for the equal rights ordinance?Yes: Bell, Costello, Garcia, McVey, TurnerNo: HallAbstain: King, 2.tDo you support a change in the term limit length for councilmen and mayor in the city of Houston from two to four years?Yes: Bell, Hall, McVey, TurnerNo: Costello, Garcia, King, 3.tShould we repeal the revenue cap?Yes: Bell, Turner (for certain exceptions)No: Costello, Garcia, Hall, King, McVey, 4.tShould it be mandatory to meet and confer with all municipal unions?Yes: King, McVey, Garcia, BellNo: Hall, Turner, Costello, 5.tInfrastructure funding: debt or revenue financing?Debt: Hall, KingRevenue: Turner, McVey, Garcia, Costello, Bell, 6.tZero-based budgeting: yes or no?Yes: King, Hall, Turner, McVey, Garcia, Costello, BellNo: N/A]", "Date": "20150819", "Author": "[Rebecca Elliott]", "Link": "http://www.chron.com/news/politics/houston/article/Candidates-talk-criminal-justice-at-mayoral-forum-6454520.php", "Title": "[Candidates talk criminal justice at mayoral forum]"}