{"Content": "[Caption, Close, Senate Minority Leader Harry Reid of Nev. accompanied by House Minority Leader Nancy Pelosi of Calif. speaks to reporters outside the West Wing of the White House in Washington, Thursday, Sept. 17, 2015, after a meeting with President Barack Obama. WASHINGTON (AP)  The Democratic leaders of the House and Senate huddled with President Barack Obama on Thursday to discuss strategy as Congress prepares for some momentous decisions on how best to keep the federal government operating. A partial shutdown will occur Oct. 1 unless lawmakers provide money to keep the federal government functioning. A few weeks later, Congress likely will need to vote to raise the debt ceiling so that the government can borrow money to meet its existing financial commitments. The White House, in a statement Thursday evening, said Obama \"reiterated that threats by some Republicans to shut down the government and eliminate access to health care for men, women and families across the country is a game of chicken with our economy that we cannot accept.\", Obamas meeting with Sen. Harry Reid and Rep. Nancy Pelosi occurred as the Senates top Republican, Sen. Mitch McConnell of Kentucky, is promising there will be no government shutdown. McConnell reiterated Wednesday that there will be a negotiation with the White House over easing cuts to both the Pentagon and domestic programs, a key demand of Obamas. And he predicted for the first time that they would \"crack\" budget caps set by a 2011 budget-cutting law. The White House has repeatedly threatened to veto any spending bill that keeps the automatic spending curbs, also referred to as sequestration. In a speech to business leaders Wednesday, Obama told Congress to aim higher than just passing a budget. \"If we dont reverse the cuts that are currently in place, a lot of the drivers of growth that your companies depend on  research, job training, infrastructure, education for our workforce  they are going to be reduced effectively at a time when other countries around the world are racing to get ahead of us,\" Obama told members of the Business Roundtable, a group of CEOs from large companies. Obama made clear in his speech to the Business Roundtable that he will blame Republicans for any impasse that results in a government shutdown or leads to the impression there will be one, creating stress in the markets. \"Youll recall two years ago Republicans shut down the government because they didnt like Obamacare. Today, some are suggesting the government should be shut down because they dont like Planned Parenthood,\" Obama said. \"Thats not good sense, and its not good business.\", The president followed up his speech with a fundraising email to Democratic supporters Thursday. In it, he urged contributions to help elect Democrats to \"a Congress that wont play politics with peoples lives,\" and called the current budget standoff \"unacceptable.\", To reach a deal, the GOP-led Congress must take steps that include overcoming opposition from some lawmakers who want to block federal funding for Planned Parenthood, amid controversy about the organization providing fetal tissue from abortions for research. Some conservatives also face pressure to keep government spending within the levels agreed to through the 2011 legislation. \"Hard-working Americans deserve to have their policymakers live up to their promises on spending,\" said a letter to members of Congress signed by numerous conservative groups, including the Club for Growth, Freedom Partners Chamber of Commerce and Americans for Tax Reform. The letter said that \"even with these modest spending limits, discretionary spending will still increase in 2016 and every year thereafter.\", Going into the budget showdown, Obama is trying to make the case that the economy has greatly improved and that Congress shouldnt do anything that would jeopardize economic growth. \"Americas winning right now. Americas great right now. We can do even better,\" Obama said. ", "Date": "20150917", "Author": "[Kevin Freking, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Obama-using-business-CEOs-meeting-to-apply-budget-6507659.php", "Title": "[Obama, Democratic leaders huddle as shutdown threat looms]"}