{"Content": "[Caption, Close Moses Free market economy, Islam, Jim Crow, Issue: A requirement for public school students in Texas to evaluate efforts by global organizations such as the United Nations to undermine U.S. sovereignty.Related: Texas board to finish social studies guidelines, Several other issues also surfaced throughout the long debate, including the treatment of historical figures like Sam Houston and Caesar Chavez. Issue: Two experts appointed by the State Board of Education recommended Cesar Chavez, the late migrant farm labor union leader, be removed as an example of a significant model for \"active participation in the democratic process.\"Related: Social studies books turn a controversial new page, Issue: Towards the deadline for deciding the social studies curriculum, Sam Houstons political affiliation became a talking point. In reference to his opposition to Texas secession, was Houston a liberal?Read more: The interesting conundrum of Texas first president, Issue: One of the State Board of Education-appointed reviewers suggested the late U.S. Supreme Court Justice Thurgood Marshall be removed from history books on grounds that he is not an appropriate example as an historical figure of influence. Marshall was the NAACP lawyer who won the landmark 1954 U.S. Supreme Court school segregation case that led to the integration of public schools.Related: Social studies books turn a controversial new page, Issue: One of the State Board of Education-appointed expert reviewers recommended schoolchildren get a better understanding of the motivational role the Bible and the Christian faith played in the settling of the original colonies.Related: Social studies books turn a controversial new page, Issue: Before it was nixed, Democrats and a moderate Republican accused conservatives on the board of trying to stir up a needless controversy by referring to the presidents full name, Barack Hussein Obama, saying his middle name was loaded with negative connotation.Related: Texas board to finish social studies guidelines, Issue: The Texas Freedom Network argues the current curriculum gives credence to the idea that \"states rights and sovereignty\" were the causes of secession and the Civil War, rather than slavery.Related: Fight brewing over social studies textbooks, Issue: A change to the curriculum, pushed by a dentist, ensured students would study the violent philosophy of the Black Panthers in addition to Rev. Martin Luther King Jr.Related: Black Panthers overemphasized in Texas schools, NAACP saysSource: New York Times, Issue: While not in the curriculum, Texas Republicans have voiced their approval of teaching creationism and/or intelligent design alongside the theory of evolution in schools and in textbooks.Related: All four Republican candidates for Lt. Gov. say teach creationism in public schools, Confederate flags are coming down across the country, but the debate over the role of slavery in the Civil War is still raging. Keep clicking to see some of the historic documents and statements regarding the Confederacys founding.Source: The Atlantic, South Carolina (John McQueen)\"I have never doubt what Virginia would do when the alternatives present themselves to h intelligent and gallant people, to choose between an association wi her sisters and the dominion of a people, who have chosen their lead upon the single idea that the African is equal to the Anglo-Saxon, a with the purpose of placing our slaves on equality with ourselves a our friends of every condition! and if we of South Carolina have aid in your deliverance from tyranny and degradation, as you suppose,  will only the more assure us that we have performed our duty  ourselves and our sisters in taking the first decided step to preser an inheritance left us by an ancestry whose spirit would forbid i being tarnished by assassins. We, of South Carolina, hope soon to gre you in a Southern Confederacy, where white men shall rule our destini  and from which we may transmit to our posterity the rights, privileg and honor left us by our ancestors.\"Source: Library of Congress, Daily Dispatch (PDF), Mississippi (Sen. Albert Gallatin Brown)\"And a foot  in Central America will powerfully aid us in acquiring those oth states. It will render them less valuable to the other powers of t earth, and thereby diminish competition with us. Yes, I want the countries for the spread of slavery. I would spread the blessings  slavery, like the religion of our Divine Master, to the uttermost en of the earth, and rebellious and wicked as the Yankees have been, would even extend it to th I would not force it upon them, as I would not force religion upon th  but I would preach it to them, as I would preach the gospel. They ar  stiff-necked and rebellious race, and I have little hope that they w  receive the blessing, and I would therefore prepare for its spread  other more favored lands.\"Source: The Atlantic, Speeches, Messages and Other Writings of the Hon. Albert G. Brown, Mississippi (Sen. John Sharp Williams)\"Loc self-government temporarily destroyed may be recovered and ultimate retained. The other thing for which we fought is so complex in i composition, so delicate in its breath, so incomparable in its symmet  that, being once destroyed, it is forever destroyed. This other thi for which we fought was the supremacy of the white mans civilization  the country which he proudly claimed his own; in the land which t Lord his God had given him; founded upon the white mans code  ethics, in sympathy with the white mans traditions and ideals.\"Source: The Atlantic, Confederate Past and Present, Florida\"By the agency of a large proportion of the members from the non slaveholding States books have been published and circulated amongst us the direct tendency and avowed purpose of which is to excite insurrection and servile war with all their attendant horrors. A President has recently been elected, an obscure and illiterate man without experience in public affairs or any general reputation mainly if not exclusively on account of a settled and often proclaimed hostility to our institutions and a fixed purpose to abolish them ... What must be the condition of the slaves themselves when their number becomes so large that their labor will be of no value to their owners. Their natural tendency every where shown where the race has existed to idleness vagrancy and crime increased by an inability to procure subsistence. Can any thing be more impudently false than the pretense that this state of things is to be brought about from considerations of humanity to the slaves.\"Source: Civil War Causes, Florida (Sen. Duncan Fletcher)\"The South fought  preserve race integrity. Did we lose that? We fought to maintain fr white dominion. Did we lose that? The States are in control of t people. Local self-government, democratic government, obtains. That w not lost. The rights of the sovereign States, under the Constitutio are recognized. We did not lose that. I submit that what is called T Lost Cause was not so much lost as is sometimes supposed.\"Source: The Atlantic, Confederate Past and Present, Alabama \"Upon the principles then announced by Mr. Lincoln and his leading friends, we are bound to expect his administration to be conducted. Hence it is, that in high places, among the Republican party, the election of Mr. Lincoln is hailed, not simply as it change of Administration, but as the inauguration of new principles, and a new theory of Government, and even as the downfall of slavery. Therefore it is that the election of Mr. Lincoln cannot be regarded otherwise than a solemn declaration, on the part of a great majority of the Northern people, of hostility to the South, her property and her institutions  nothing less than an open declaration of war  for the triumph of this new theory of Government destroys the property of the South, lays waste her fields, and inaugurates all the horrors of a San Domingo servile insurrection, consigning her citizens to assassinations, and. her wives and daughters to pollution and violation, to gratify the lust of half-civilized Africans.\"Source: The Atlantic, Confederate Past and Present, Georgia\"The people of Georgia having dissolved their political connection with the Government of the United States of America, present to their confederates and the world the causes which have led to the separation. For the last ten years we have had numerous and serious causes of complaint against our non-slave-holding confederate States with reference to the subject of African slavery ...\"Source: Civil War Causes (Archive), Georgia (Judge Henry Benning)\"What was the reason t  induced Georgia to take the step of secession? This reason may  summed up in one single proposition. It was a conviction, a de conviction on the part of Georgia, that a separation from the North-w the only thing that could prevent the abolition of her slavery. Th conviction, sir, was the main cause. It is true, sir, that the effect  this conviction was strengthened by a further conviction that such separation would be the best remedy for the fugitive slave evil, a also the best, if not the only remedy, for the territorial evil. Bu doubtless, if it had not been for the first conviction this step wou never have been taken. It therefore becomes important to inquire whet  this conviction was well founded.\"Source: Civil War Causes, Georgia (Gov. Joseph E. Brown)\"Among us the poor wh  laborer is respected as an equal. His family is treated with kindnes consideration and respect. He does not belong to the menial class. T negro is in no sense of the term his equal. He feels and knows this.  belongs to the only true aristocracy, the race of white men. He black  masters boots, and bows the knee to no one save God alone. He receiv higher wages for his labor than does the laborer of any other portion  the world, and he raises up his children with the knowledge, that th belong to no inferior cast, but that the highest members of the socie in which he lives, will, if their conduct is good, respect and tre them as equals.\"Source: The Atlantic, Confederate Records of the State of Georgia, Louisiana (Gov. Thomas Moore)\"I do not think it comports with the honor and self-respect of Louisiana, as a slaveholding State, to live under the Government of a Black Republican President. I will not dispute the fact that Mr. LINCOLN is elected according to the forms of the Constitution; but the greatest outrages, both upon public and private rights, have been perpetrated under the forms of law. I maintain the right of each State to secede from the Union, and therefore whatever course Louisiana may pursue now. if any attempt should be made by the Federal Government to coerce a sovereign State, and compel her to submission to an authority which she has ceased to recognize, I should unhesitatingly recommend that Louisiana assist her sister State with the same alacrity and courage that the Colonies assisted each other in their struggle against the despotism of the Old World.\"Source: New York Times, Texas\"Texas abandoned her separate national existence and consented to become one of the Confederated States to promote her welfare, insure domestic tranquility [sic] and secure more substantially the blessings of peace and liberty to her people. She was received into the confederacy with her own constitution, under the guarantee of the federal constitution and the compact of annexation, that she should enjoy these blessings. She was received as a commonwealth holding, maintaining and protecting the institution known as negro slavery--the servitude of the African to the white race within her limits--a relation that had existed from the first settlement of her wilderness by the white race, and which her people intended should exist in all future time. Her institutions and geographical position established the strongest ties between her and other slave-holding States of the confederacy.\"Source: Texas State Library and Archives Commission, Tennessee\"We can, we must, carry our State. Our hearts would link within us, at the b thought of the degradations and infamy of abandoning our more South brethren united to us by all the views so sympathy and interest, and of be chained to the car of Black Republican States, who would themselves desp us for our submission; and worse than all, by moral influences alone, if not force of legal enactment destroy our entire social fabric, and all r independence of thought and action.\"Source: Government of Tennessee (PDF), , Six flags over Texas, Six flags over Texas Hoods Texas Brigade, Hoods Texas Brigade, Hoods Texas Brigade The Confederate Soldiers, The Confederate Soldiers, The Confederate Soldiers, The Confederate Soldiers, Portrait of Albert Sidney Johnston , Robert E. Lee , When students return to Texas public schools this fall, theyll crack open some new and controversial textbooks. New state education standards were adopted in 2010. New books selected in 2014the first time since 2002 the State Board of Education voted on new booksare set to hit desks next semester. But since the standards came to light, scholars have questioned the accounts in the new texts of the Souths history of racial violence and the Civil War. RELATED:State school board approves first social studies textbooks in 12 years, According to a recent Washington Post report, the academic standards \"barely address racial segregation,\" and dont mention the Ku Klux Klan or Jim Crow laws. And the standards on which the books are based give slavery relatively little prominence compared to states rights in the Civil War. Texas public education thus becomes entwined in a national debate, stirred up by a self-proclaimed Confederate loyalists massacre in a black church last month, over the legacy of the confederacy and the place of Confederate symbols in modern America. In 2010, former U.S. Secretary of Education and Houston ISD superintendent Rod Paige asked the State Board of Education to rethink its portrayal of slavery and race, saying \"we may not like our history, but its our history,\" according to a 2010 report by the Texas Tribune. According to The Washington Post, board of education member Pat Hardy called slavery \"a side issue to the Civil War\" when debating the new standards. RELATED:Fight brewing over social studies textbooks, When those standards were adopted, many questioned the prominence given to the influence of biblical figures like Moses and Solomon in the founding of the United States. Critics said the standards demonized Islam and glossed over conquests that spread Christianity. In November 2014, following the Boards approval of the new texts based on the 2010 standards, USA Today called the books \"misleading, racially prejudiced and, at times, flat-out false.\" And a 2014 review of the proposed textbooks by the left-leaning Texas Freedom Network documented extensive examples in which the authors \"gave undue legitimacy to neo-Confederate arguments about states rights and the legacy of slavery in the South,\" according to The Washington Post in 2014. Texas students will learn about a long list of Confederate officials, and will read the inaugural address of Confederate president Jefferson Davis, which didnt mention slavery. Absent, however, from required classroom reading is Texas 1861 declaration of secession from the United States, which indicates slavery was key in the states decision to leave the Union. Before any mention of federal domination over states rights, the declaration heralds the institution of slavery. RELATED:150 years after fall, Confederate memories linger in Texas, About 5 million Texas students will read the new text books.]", "Date": "20150707", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/education/article/New-Texas-textbooks-downplay-slavery-in-the-Civil-6370897.php", "Title": "[New Texas textbooks downplay slavery in the Civil War]"}