{"Content": "[Caption, Close, FILE - In this March 20, 2015, file photo, Illinois Gov. Bruce Rauner speaks at a news conference in Chicago.  Rauner has sent a memo to Illinois lawmakers imploring them not to overturn his dismissal of legislation that would send labor-union contract decisions to an unelected arbitrator. The Republican issued the missive to the Legislature Tuesday Aug. 18, 2015, on the eve of an expected Senate vote to override his veto of the measure that would ban a union strike or a government lockout in the event of an impasse. SPRINGFIELD, Ill. (AP)  Imploring them to \"let me do my job,\" Gov. Bruce Rauner asked Illinois lawmakers Tuesday not to undo his veto of a measure authorizing an unelected arbitrator to decide a potential labor-negotiation stalemate. The Republican governor is locked in negotiations over a labor contract to replace a pact that expired June 30 with about 36,000 state workers, members of the American Federation of State, County, and Municipal Employees. Rauner believes the plan, which would ban a union strike or government lockout in favor of third-party mediation, is linked to his having taken no union campaign money. \"If our ability to negotiate with AFSCME gets stripped away, its likely going to cost taxpayers in Illinois billions of dollars beyond what I think we could negotiate if we were allowed to do it in good faith and complete the process,\" Rauner said while visiting reporters in the Capitol. \"Its a big deal.\", AFSCME responded with a letter to lawmakers saying the governors \"crusade against this bill is based on hyperbole and misinformation.\", \"Nothing in the legislation compels the parties to go to arbitration,\" the letter states. \"In fact, either side could choose arbitration if negotiations fail to produce a settlement. As such, the bill does not short-circuit the negotiating process, but offers an additional path to a settlement free of the hardship, conflict and disruption that a lockout or strike could cause.\", Rauner says AFSCME members have benefited for years from generous salary and benefit boosts from, particularly, Democratic governors currying favor. AFSCME says a University of Illinois study found state and local government workers earn less than comparable private-sector workers. There has been little progress in months of talks between the two sides. Rauner now promises no lockout and no wage cuts. Rauner released his missive on the eve of an expected vote by the Democratic-controlled Senate to override the veto. \"Were asking them, Just let me do my job,\" Rauner said. The legislation, which appeared in the General Assembly in late May, sought to tamper fears of a lockout and replacement-worker hiring; Rauner had spoken admiringly of former President Ronald Reagans August 1981 termination of thousands of striking air-traffic controllers. In exchange, AFSCME was willing to give up the right to strike, although there has been no strike in 40 years of Illinois government collective bargaining. The measure, which would expire in four years, wouldnt take effect without override votes by both Senate and House. Senate President John Cullerton, a Chicago Democrat said the arbitration measure is one of three vetoes  the others are budget bills  the Senate is considering for override Wednesday. \"We are going to be in session, were going to have caucus and well talk about it in Springfield,\" Cullerton told reporters in Chicago Tuesday. The Senate will convene for a potentially dramatic showdown on what is Governors Day at the Illinois State Fair, where the GOP and, in particular, Sen. Mark Kirk, seeking re-election in 2016, will rally voters. Rauner was asked about the apparent stick in the eye. \"Its all good,\" Rauner said, laughing. \"Its all part of politics.\", ", "Date": "20150818", "Author": "[John O'connor and Sophia Tareen, Associated Press]", "Link": "http://www.chron.com/news/article/Rauner-on-union-strike-veto-Let-me-do-my-job-6451258.php", "Title": "[Rauner on union-strike veto: 'Let me do my job']"}