{"Content": "[BOSTON (AP)  U.S. Sen. Elizabeth Warren says the possibility she would run as a vice presidential candidate in the 2016 election is \"something Im not talking about\" and shes happy with her job as senator. The Massachusetts Democrat said on Tuesday that Vice President Joe Biden faces a tough decision as he weighs a White House run. \"Hes been through an awful lot, and thats something he will have to decide himself, and its going to be with his family and quietly in his own home,\" Warren said. Biden, a widower at a young age whos now grieving over the recent death of his son Beau Biden, held a private meeting with Warren last month at the Naval Observatory, his Washington residence. Warren, who has declined to say if shell seek a second U.S. Senate term in 2018, also has met privately with Democratic presidential front-runner Hillary Clinton and talked with hopefuls Bernie Sanders and Martin OMalley. Pressed on whether she would consider joining a Democratic ticket, she said the party isnt even sure if all potential candidates have declared. \"I think we need to take this one step at a time,\" she said. \"Let folks get out there, put out what theyre running on and what theyre going to stand for as candidates for president. Lets start there.\", Warren remains a powerhouse among the more liberal wing of the party, and her endorsement is coveted by those hoping to win the presidential nomination. She declined to say on Tuesday whether she anticipated endorsing a candidate during the primary. \"Not today, but well see what happens as it unfolds,\" Warren said. \"I am glad to have a chance to talk about the issues facing hardworking families in this country with all of our presidential candidates.\", Warren said those economic challenges remain her top concern. \"Our once solid middle class is starting to crumble,\" she said. \"If we dont make some changes in this country, what we once understood as opportunity for everyone, what we once understood as our children will do better than we did, will disappear.\", Asked if she was trying to keep her political options open as the primary battle unfolds, she again said she was happy with her day job. \"I have a job,\" she said, \"and my job is to go down to Washington and fight for the people of Massachusetts.\", Even though she hasnt committed to any future election, she has continued to raise campaign cash from supporters across the country. She collected nearly $1.6 million in contributions in the first half of this year, taking her campaign bank account to more than $2.4 million, according to Federal Election Commission filings. She also has been raising money for her political action committee, the PAC for a Level Playing Field. The committee pulled in more than $421,000 during the first half of the year, bringing the total cash on hand to more than $1.2 million. Warren, a consumer advocate, made her comments after an evening event helping students get rid of loan payments from a now-defunct for-profit college.]", "Date": "20150902", "Author": "[Steve Leblanc, Associated Press]", "Link": "http://www.chron.com/news/article/Sen-Warren-A-VP-bid-something-I-m-not-talking-6480022.php", "Title": "[Vice presidential bid something Warren 'not talking about']"}