{"Content": "[Caption, Close, Republican presidential candidate Donald Trump arrives to a fundraising event at a golf course in the Bronx borough of New York, Monday, July 6, 2015. Republican presidential candidate Donald Trump arrives at a fundraising event at a golf course in the Bronx borough of New York, Monday, July 6, 2015. Republican presidential candidate Donald Trump, left, talks the former New York City mayor Rudy Giuliani at a fundraising event in the Bronx borough of New York, Monday, July 6, 2015. WASHINGTON (AP)  Worried about \"Republican-on-Republican violence,\" top party donors are taking action, with one firing off a letter calling for more civility and another seeking to block businessman Donald Trump from the debate stage altogether. Foster Friess, a Wyoming-based investor and one of the partys top 20 donors in the last presidential contest, issued a letter to 16 White House prospects and the Republican National Committee late last week calling for candidates to stay on the \"civility reservation.\", \"Our candidates will benefit if they all submit to Ronald Reagans 11th Commandment, Thou shall not speak ill of a fellow Republican,\" Friess wrote in a letter sent to Republican National Committee chairman Reince Priebus. A copy was obtained by The Associated Press. In the dispatch, Friess cites the backing of casino magnate Sheldon Adelson and Chicago Cubs co-owner Todd Ricketts. \"Would you join the effort to inspire a more civil way of making their points?\" Friess wrote. \"If they drift off the civility reservation, lets all immediately communicate that to them.\", The call for calm comes as the sprawling Republican field shows signs it could tip into a bare-knuckles struggle for the nomination  a scenario that the partys elite donors see as a distressing echo of four years ago. New Jersey Gov. Chris Christie on Monday charged that Republicans dont need Texas Sen. Ted Cruzs \"lectures.\" Wisconsin Gov. Scott Walker repeatedly dismisses Republicans in Congress as doing little. And Kentucky Sen. Rand Paul regularly jabs his Republican opponents by name. Yet no candidate has injected more provocation into the 2016 Republican presidential primary than Trump. While few party officials see the reality television star as a credible candidate, he has lashed out at a growing number of Republican critics who have condemned his recent description of Mexican immigrants as criminals and rapists. Trump over the weekend posted a message from another user on his Twitter account charging that former Florida Gov. Jeb Bush \"has to like the Mexican illegals because of his wife,\" Columba, who was born in Mexico. Campaigning in New Hampshire over the weekend, Bush said he \"absolutely\" took the remark personally. Trump has not apologized, but said Monday evening \"somebody else\" retweeted the message and \"I dont know anything about it\" even though it was under his account. Trump stood firm on his comments about immigrants, saying earlier Monday \"the Mexican government is forcing their most unwanted people into the United States,\" and \"criminals, drug dealers, rapists\" are among them. He said \"many fabulous people\" come from Mexico and the U.S. is better for them, but this country is \"a dumping ground for Mexico.\", Republican donor John Jordan said Monday that GOP leaders should take steps to block Trumps access to the first presidential debate in early August. Debate organizers at Fox News Channel, backed by the Republican National Committee, have released guidelines saying the top 10 candidates in national polling will be allowed to participate. Trump would qualify under the current terms, while contenders such as Ohios two-term Gov. John Kasich would not. \"Someone in the party ought to start some sort of petition saying, If Trumps going to be on the stage, Im not going to be on there with him,\" Jordan told the AP on Monday. \"Im toying with the idea of it.\", \"Its something I feel strongly about as somebody who not only cares about the Republican Party, but also Latinos,\" Jordan said. Even as the other candidates say theyre trying to avoid intraparty backbiting, however, they cant seem to avoid it. In an interview Sunday on NBCs \"Meet the Press,\" Cruz refused to condemn Trumps comments, saying hes not going to perpetrate \"Republican-on-Republican violence.\" Christie, who entered the presidential race last week, wasnt having it. \"I find it ironic, right, that Ted Cruz is giving lectures on Republican-on-Republican violence,\" Christie said on Fox News, accusing the Texan of sponsoring hardball ads against Republican Sen. Lamar Alexander in the 2014 primaries. \"I mean, all due respect, I dont need to be lectured by Ted Cruz.\", The Republican National Committee has dramatically reduced the number of primary debates before the 2016 contest largely to avoid the kind of attacks that bloodied their 2012 nominee, Mitt Romney. As the last GOP nomination heated up in January 2012, Romney and former House Speaker Newt Gingrich got particularly nasty. Gingrich joined Obama supporters in attacking Romneys business background, calling him a \"vulture capitalist.\", Donors remember those exchanges well and fear a repeat of primary vitriol would lead to another general election loss. \"Ninety-nine percent of leading donors saw the candidates carve each other up in the 2012 primaries and come out weaker for it and are determined not to let that happen again,\" said Fred Malek, who has helped raise money for GOP presidential candidates for four decades. Responding to Friess letter, former Arkansas Gov. Mike Huckabee wrote he plans on \"becoming the nominee by playing a better game, not by breaking the legs of my rivals.\", \"I hope that we dont commit fratricide again as a party,\" Huckabee wrote, according to a copy of his response obtained by the AP. ", "Date": "20150707", "Author": "[Steve Peoples and Julie Bykowicz, Associated Press]", "Link": "http://www.chron.com/news/politics/article/As-Republican-infighting-grows-donors-call-for-6368892.php", "Title": "[As Republican infighting grows, donors call for calm]"}