{"Content": "[Caption, Close, Sylvester Turner:, El miembro demcrata de la Cmara de Representantes de Texas por el Distrito 139 est casi en un empate con Garca en las encuestas de los candidatos a la alcalda. Se espera que atraiga el voto de la comunidad afroamericana de Houston. Anunci su candidatura a fines de febrero. El miembro demcrata de la Cmara de... Sylvester Turner photographed in his office on Friday, Aug. 7, 2015, in Houston. ( Karen Warren / Houston Chronicle ), Mayoral candidate Sylvester Turner speaks during the Houston GLBT Political Caucus at the IBEW Hall, where they picked their slate of mayoral, controller and city council candidates on Saturday, Aug. 8, 2015, in Houston. A large crowd of nearly 300 members, was a traditional caucus-style event, with all of the progressive mayoral candidates present. Mayoral candidate Sylvester Turner unveiled a plan Thursday to add 540 officers to the Houston Police Department by 2020, an effort he said is necessary to enable officers to better engage the communities they serve and to improve trust between some neighborhoods and police. Turner said he would pay for the estimated $85 million \"Partners in Safety\" plan by seeking, \"as quickly as I can,\" voter approval to alter the citys decade-old revenue cap to allow more public safety spending. The cap, which the city hit for the first time last year, limits the revenue Houston can collect from property taxes, its main source of revenue. The longtime state representatives announcement is the second policing proposal released by a mayoral candidate this week, after Ben Halls call for fully funding HPDs $8 million request for officer body cameras, and for giving the citys citizen oversight board subpoena power. Turner said he seeks \"community policing,\" a term used by many leaders, including current Police Chief Charles McClelland. Turner did not criticize McClelland or term-limited Mayor Annise Parkers management, but said the citys police officers today are stretched too thin to exit their patrol cars and do the sort of engagement that is needed. \"In the last several years, the enemy to community policing has been the lack of resources,\" Turner said. \"When you have 5,300 police officers and that number has remained stagnant over the last 10 years, more people coming into the city the citys even more diverse, its very difficult to have effective and adequate community policing.\", Turners proposal also includes fully funding the body camera initiative, the first phase of which will launch this year, along with enhanced cultural and de-escalation training for officers, greater public input and more youth outreach efforts. Turner also backs offering police officers, as well as firefighters and municipal workers, incentives to live inside city limits. A similar proposal to lure officers to high-crime neighborhoods is being developed. Houston Police Officers Union has endorsed Turner, as have the citys other two employee unions. HPOU president Ray Hunt praised Turner as a \"unifier\" and backed his proposal. \"We know weve severely lacking in police officers in this city and we really appreciate the fact that youre stepping up and saying we have to do something about it,\" Hunt said.]", "Date": "20150813", "Author": "[Mike Morris]", "Link": "http://www.chron.com/politics/election/local/article/Turner-announces-policing-plan-6442874.php", "Title": "[Turner announces plan to add 540 cops]"}