{"Content": "[Caption, Close, U.S. Sen. Ted Cruz was born in Canada. His mother was an American citizen from Delaware; his father, a Cuban, was not. Sen. Ted Cruz, R-Texas, has announced his run for the White House, but how well do you really know this naturalized Houstonian? Click through to learn some well-known to not-well-known facts about our possible future president. 1. Hates avocadosCruz cant stand this native Mexican fruit, and went on record with his displeasure of the alligator pear. \"I despise avocado. Its the only food I dislike, and I dislike  passionately. Which is ironic, because Im Cuban, and  dad grew up with avocado trees in his backyard. My whole family ea avocados like crazy, but I cant stand them.Source: Houston Chronicle, 2. Made filibuster history, 3. Loves the Princess Bride? Inconceivable!Cruz, a self-described \"movie buff,\" says this movie is his favorite. When he confirmed it during an interview, it spawned a flood of jokes on social media.Source: Houston Chronicle, 4. The man behind the government shutdownSome held Cruz, in part, responsible for the 2013 federal government shutdown that lasted 16 days, the third-longest of its kind. His earlier filibuster and later refusal to approve the Appropriations Continuing Resolution were seen as key moments leading to the event. 5. One thing he has in common with Obama: Loves basketballIn a parallel universe where Cruz was not a junior senator from Texas, he said he would love to be a starting point guard for the Houston Rockets. \"Im confident that there is no universe in which that will ever come to pass,\" he said.Source: Houston Chronicle, 6. Smoked pot as a teen and once received an alcohol possession charg  1987, Texas authorities ticketed a then-younger Cruz for an alcoh possession charge. Apparently, he was driving with an unopened case  beer in his vehicle. \"Teenagers often make foolish mistakes, and th certainly applied to me as well,\" Cruz said in a statement provided  BuzzFeed News.Source: Houston Chronicle, 7. He gave up his Canadian citizenshipIn 1970, Cruz was born in Calgary, Alberta, Canada. Four years later, his parents moved to Houston. Legal experts say his Canadian birthplace doesnt bar him from a presidential run. Nevertheless, Cruz renounced his Canadian citizenship last summer.Source: Houston Chronicle, 8. Il ne parle pas franais (He doesnt speak French).In an interview with the Dallas Morning News, Cruz revealed French was his nemesis during his teen years.Source: Dallas Morning News, 9. Doesnt care much for Vladimir PutinCruz hasnt taken a liking to the sitting Russian president, even calling him a \"KGB thug.\" During the Ukraine civil war, Cruz called for oil and gas exports to the embattled country while also bolstering the missile defense system in the Czech Republic and Poland.Source: Houston Chronicle, 10. Disagrees with climate change scienceCruz has been fairly consistent in his opposition of anthropogenic global warming, even warning NASA to shift its focus from earth sciences to space-related ones.Source: Houston Chronicle, 11. Loves cheese, 12. Has made several Republican enemies, 13. His his own coloring bookFollowing Cruzs infamous filibuster in 2014, a St. Louis-based publisher came out with this little activity book for children. It sold quite a few copies, according to Breitbart, and spawned some hilarious reviews on Amazon, including this gem:  Apart from the fact that it only provided me with a white crayon, I didnt get to finish it, because as soon as I started to work, the Republicans came in and filibustered me before I could finish. Now my book is shut down, and theyre blaming me for political maneuvers.Source: Breitbart, 14. Not a fan of CubaCruzs father once supported Fidel Castros revolution against then-dictator Fulgencio Batista, but later fled the country when Castro began enacting harsh communist policies in the country. Following President Barack Obamas announcement he would reopen talks between the two nations, Cruz said it would be a \"tragic mistake.\"Source: National Review, 15. Wears a good luck charmIn an interview with the Dallas Morning News, Cruz said during his time as solicitor general, he would wear the same pair of black ostrich boots during oral arguments. Every American schoolchild learns in government class that any citizen can run for president so long as they are 35 years old and were born in this country. But black-and-white easily can become gray when a child of American citizens happens to be born outside the country. Are they natural born? Such is the case with U.S. Sen. Ted Cruz, who was born in Canada. His mother was an American citizen from Delaware; his father, a Cuban, was not. Q: What does the Constitution say about who is eligible to run for president?, A: The language of Article II Section 1 seems pretty clear: \"No Person except a natural born Citizen, or a Citizen of the United States, at the time of the Adoption of this Constitution, shall be eligible to the Office of President; neither shall any Person be eligible to that Office who shall not have attained to the Age of thirty five Years, and been fourteen Years a Resident within the United States.\", Q: So where does the ambiguity come in?, A: It lies in the definition of \"natural born.\" Originally, our nations founders had proposed a more liberal approach allowing that those who had lived in the U.S. for a certain period of time could be eligible. They changed their mind to restrict eligibility to those born on U.S. soil, with a few exceptions, such as the children of foreign diplomats, or worse, foreign invaders. Then an obvious oversight popped up. What about someone born to American citizens who were traveling or working outside the country? The Naturalization Act of 1790 addressed this by declaring \"children of citizens of the United States, that may be born beyond the sea, or out of the limits of the United States, shall be considered as natural-born citizens.\" The law, which has been revised a number of times, had one provision that now seems curious, stating that the right of citizenship did \"not descend to persons whose fathers have never been resident in the United States.\" That stipulation later was dropped. End of discussion? Not exactly. The use of \"considered as\" has a certain ambiguity in itself, at least to some. There are those who argue that the Constitution should be interpreted literally and that it would have to be amended to allow those born on foreign soil to legally serve as president. Q: Has this come up before?, A: Yes. John McCain, the Republican nominee in the 2008 presidential race, was born on a U.S. military base in the Panama Canal Zone. When the subject came up, the U.S. Senate passed a unanimous resolution stating that it had no doubt about his eligibility. The matter also was raised, without effect, in the campaigns of Barry Goldwater, born in Arizona before it was a state, and George Romney, who was born to American citizens in Mexico. President Barack Obamas birthplace was questioned as well during his first campaign. Some claimed he was not born in Hawaii as he said but in Kenya, and they claimed his Hawaiian birth certificate was fraudulent. Though he still would have been eligible to run for president, Obama was denounced by these critics and so-called birthers for having \"lied\" about his birthplace. Q: Is a challenge to Cruzs eligibility likely to go anywhere?, A: Probably not, but the U.S. Supreme Court never has addressed this matter specifically with respect to presidential eligibility. The Constitution Society, an Austin-based and Libertarian-minded organization, has said, \"Sen. Cruz is not eligible to be president.\" Its argument is based on the notion that natural-born must be related to geography and that \"citizen at birth\" conferred by U.S. laws does not imply eligibility. This view does not jibe with the scholarly consensus, which is that the Constitution is as clear as it needs to be on this subject - especially in light of long-standing British law at the time it was written. Such law deemed those born to subjects of the Crown even in far-flung outposts of the empire as subjects themselves for any and all purposes. The Framers, scholars say, were all too familiar with that concept, as they had complained vociferously about a lack of representation in parliament. Two recent U.S. solicitor generals write in the current issue of the Harvard Law Review that the eligibility question is a red herring when used to challenge Cruz. \"There are plenty of serious issues to debate in the upcoming presidential election cycle,\" write Neal Katyal and Paul Clement. \"The less time spent dealing with specious objections to candidate eligibility, the better. Fortunately, the Constitution is refreshingly clear on these eligibility issues.\"]", "Date": "20150324", "Author": "[Mike Tolson]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Is-foreign-born-Cruz-eligible-to-be-president-6153621.php", "Title": "[Is foreign-born Cruz eligible to be president?]"}