{"Content": "[RALEIGH, N.C. (AP)  North Carolina legislators are considering whether to move all primary elections next year to March, not just the presidential primaries, key House and Senate leaders said Wednesday. Primaries for state races including those for governor, Congress and the legislature  are currently set for next May 3. A shift to one date, if agreed to, could save several million dollars for taxpayers by eliminating the need for two statewide primaries but also force potential candidates for dozens of jobs to accelerate their decision-making and fundraising. For example, at least four Democrats now are weighing a bid to challenge Republican U.S. Sen. Richard Burr. A bill brokered by North Carolina Republican leaders this summer and already approved by the Senate would set March 15 as the presidential primary date. The House and Senate will now negotiate the scheduling issues after the House unanimously voted not to accept the Senate bill Wednesday. Rep. David Lewis, a Republican National Committee member, and Sen. Bob Rucho said lawmakers are discussing several other election changes, some of them technical and sought by the State Board of Elections. But they also said separately that holding only one primary in March also was being examined. \"Both chambers are considering options that streamline the primary process,\" Lewis, R-Harnett, wrote in an email. Lewis and Rucho emphasized that both chambers still support the March 15 presidential primary. Its a \"widely supported, bipartisan measure that will reflect the important role North Carolina plays in electing\" the president, Lewis added. The cost of statewide elections is largely borne by the counties, which spent at least $9.5 million on last Novembers general elections, including the early voting period, according to the State Board of Elections. The cost of a statewide primary election wouldnt be much different because all precincts must be opened in all 100 counties, said Josh Lawson, the boards attorney. Rucho, R-Mecklenburg, said a lot of unknowns about holding two primaries need to be addressed. The last time North Carolina held a separate presidential primary was in 1988. \"Its up for discussion. Nobody has a real answer for this,\" Rucho said in an interview. \"Weve never done this before.\", Republican leaders decided in 2013 to separate and move up the presidential primary so voters in the nations ninth most populous state could have more influence on choosing nominees. The 2013 law would set North Carolinas presidential primary in February, but the Republican National Committee threatened to take away most of the states 2016 convention delegates if the primary was held that early. National Democrats also have similar rules discouraging February primaries. The Republican National Committee wants state parties to finalize their presidential primary rules by Oct. 1. Should all primary elections be held March 15, the candidate filing period certainly would have to begin earlier. Currently, the filing period begins Feb. 8. Other races on the 2016 ballot include lieutenant governor and other members of the Council of State, as well scores of judgeships and county commission seats. Its unclear when any runoff primaries would be held. Lewis acknowledged having all the nominees chosen on one date may make it difficult for down-ballot candidates to get attention compared to presidential candidates, who are likely to buy up lots of expensive advertising time. \"I dont think that concern has gone away,\" Lewis said.]", "Date": "20150903", "Author": "[Gary D. Robertson, Associated Press]", "Link": "http://www.chron.com/news/article/North-Carolina-lawmakers-set-for-primary-date-6480771.php", "Title": "[N. Carolina weighing single March 2016 primary for all races]"}