{"Content": "[Caption, Close, FILE- In this Sunday, Aug. 16, 2015, file photo, former President Jimmy Carter reaches to embrace his brother Billys widow Sybil while greeting family following service at Maranatha Baptist Church in Plains, Ga. Carters nieces Mandy Flynn, left, and Jana Carter are also pictured. Jimmy Carter plans to discuss his recent cancer diagnosis Thursday, Aug. 20, for the first time since revealing last week that he was ill. (Ben Gray/Atlanta Journal-Constitution via AP, File), ATLANTA (AP)  Former U.S. President Jimmy Carter plans to discuss his recent cancer diagnosis, making his first comments since revealing he has the disease last week. The Carter Center on Tuesday said Carter will hold a press conference Thursday morning at its offices in Atlanta. The event will be closed to the general public, the statement said. Carter, 90, announced Aug. 12 that liver surgery found cancer that has spread to other parts of his body. That brief written statement indicated that the cancer has spread, but did not identify its type or say where it originated. Carter said he would rearrange his schedule for treatment at Emory Healthcare in Atlanta, where a spokesman wouldnt comment. His initial statement said further information would be provided when more facts are known. Carter attended a Sunday School class and worshipped at Maranatha Baptist Church on Sunday in his hometown of Plains, Ga. Church officials have said that Carter and his wife Rosalynn attend whenever they are not at the centers offices in Atlanta or traveling elsewhere. The church also has announced that the former president will teach a Sunday School class as planned this weekend. Carter has been leading the classes for more than 25 years. Carter was the nations 39th president, defeating Gerald Ford in 1976. Ronald Reagan succeeded him in 1980 after a landslide victory, but Carter didnt go quietly into retirement. He founded the Carter Center and became a global humanitarian, focusing on health care and democracy. He helped defuse nuclear tension between the Koreas and monitored the first Palestinian elections. In 2002, he won the Nobel Peace Prize. Carters father, brother and two sisters died of pancreatic cancer. His mother also developed the disease.]", "Date": "20150823", "Author": "[Kathleen Foody, Associated Press]", "Link": "http://www.chron.com/news/us/article/Jimmy-Carter-to-discuss-cancer-diagnosis-on-6451158.php", "Title": "[Jimmy Carter to discuss cancer diagnosis on Thursday]"}