{"Content": "[Caption, Close, People participate in a rally sponsored by the Magnolia State Heritage Campaign outside the state Capitol, Monday, July 6, 2015, in Jackson, Miss. Jeppie Barbour, a brother of former Mississippi Gov. Haley Barbour, is pushing state leaders to keep the Confederate battle emblem on the state flag. Jeppie Barbour, center, a brother of former Mississippi Gov. Haley Barbour, speaks to Mississippi state flag supporters outside the Capitol, Monday, July 6, 2015, in Jackson, Miss. Barbour is pushing state leaders to keep the Confederate battle emblem on the state flag. A person holds a Mississippi state flag during a rally sponsored by the Magnolia State Heritage Campaign, outside the state Capitol, Monday, July 6, 2015, in Jackson, Miss. Jeppie Barbour, a brother of former Mississippi Gov. Haley Barbour, is pushing state leaders to keep the Confederate battle emblem on the state flag. Jeppie Barbour, a brother of former Mississippi Gov. Haley Barbour, speaks with the media outside the Capitol, Monday, July 6, 2015, in Jackson, Miss. Barbour is pushing state leaders to keep the Confederate battle emblem on the state flag. Kristin Rushing, left, and her son Wyatt, second from left, talk about the Confederate flag with Bartholomew Allen following a save the flag rally outside the state Capitol, Monday, July 6, 2015, in Jackson, Miss. Jeppie Barbour, a brother of former Mississippi Gov. Haley Barbour, is pushing state leaders to keep the Confederate battle emblem on the state flag. JACKSON, Miss. (AP)  The Confederate battle emblem should remain on the Mississippi flag because it honors ancestors who fought for the South in the Civil War, a brother of former Gov. Haley Barbour told about 40 supporters of the state banner at a rally Monday outside the state Capitol. \"They were fighting for the freedom of the South not to get bossed around by a bunch of Yankees,\" Jeppie Barbour told reporters after he spoke on the Capitol steps. About 40 people  all of them white  participated in the rally. As a bagpiper played \"Dixie,\" several Mississippi banners or freestanding rebel flags fluttered in breezes that brought little relief on a hot, muggy day. One man wore a T-shirt with a rebel flag and the slogan: \"Fighting terrorism since 1861.\" Another carried a large Confederate battle flag emblazoned with the slogan: \"I aint coming down.\", Debate about Mississippis flag and other Confederate symbols reignited after the June 17 massacre of nine worshippers at a black church in Charleston, South Carolina. The man charged in the slayings, Dylann Storm Roof, had posed with the Confederate battle flag in photos posted online before the attack. Days after the attack, Mississippi House Speaker Philip Gunn became the first prominent Republican to say the state should change its flag. Citing his Christian faith, Gunn said the Confederate emblem had become divisive. At the rally Monday, people distributed yard signs with the slogan: \"Keep the Flag. Change the Speaker.\", William Flowers of Atlanta is vice chairman of the Georgia chapter of League of the South, which he describes as a Southern nationalist group. Southern Poverty Law Center has long listed League of the South as a hate group  a designation that angers league members who attended the rally Monday. Flowers said \"cultural Marxists\" in government and the news media are trying to eradicate Confederate symbols. \"I will do everything I can to promote secession today,\" Flowers said to scattered applause from the crowd. Don Jacobs, pastor of Tabernacle Baptist Church in Purvis, denounced the Charleston killings but said they shouldnt be used as an excuse to erase symbols of the Old South. \"I would like to reach out to black people because they do not understand history,\" Jacobs said. \"Many of them still believe the North is the one that freed the slaves.\", About 10 people  black and white  stood and watched the rally Monday. Among them was Joshua Herring, 25, who is African-American and works at the Nissan manufacturing plant north of Jackson. Herring said the flag should be changed to a symbol that would unify the state. \"We can all agree on a magnolia,\" Herring said of the state tree and flower. \"It can grow under any circumstance.\", Gov. Phil Bryant and Lt. Gov. Tate Reeves, both Republicans, have said they accept results of a 2001 statewide election, when people voted nearly 2-t to keep the Confederate symbol that has been on the state flag since 1894. Haley Barbour, a Republican who was governor from 2004 to 2012, has said hes not offended by the flag. As governor, he frequently wore a state flag lapel pin. Jeppie Barbour, who was Yazoo City mayor from 1968 to 1972, said the crowd at the rally represents a larger groundswell of everyday people who want to keep the banner. More than 100 people, black and white, took part in rallies last week to call for a new state flag. ", "Date": "20150706", "Author": "[Emily Wagster Pettus, Associated Press]", "Link": "http://www.chron.com/news/us/article/Mississippi-flag-supporters-rally-outside-state-6369057.php", "Title": "[Mississippi flag supporters rally outside state Capitol]"}