{"Content": "[Caption, Close, Michigan Gov. Rick Snyder addresses attendees during the 2016 Mackinac Republican Leadership Conference, Friday, Sept. 18, 2015, in Mackinac Island, Mich. MACKINAC ISLAND, Mich. (AP)  Gov. Rick Snyder on Saturday announced the creation of a political action committee to financially support like-minded \"problem-solving\" candidates, with an initial focus on 2016 races in the Republican-controlled Michigan House. Snyder, who is in his second and final term, said he has been \"reinventing\" the state, and his Relentless Positive Action PAC is an attempt to \"make sure that continues\" after he leaves office. \"Its geared toward continuing that legacy of success,\" he told The Associated Press in an interview at the Mackinac Republican Leadership Conference. The committee will help candidates for state-level offices committed to fiscal responsibility, long-term economic development, urban revival and education initiatives  and evolve beyond the House elections to 2018, when a new governor, other statewide officials and senators will be elected. The PAC also could back candidates for federal office, though Snyder downplayed any \"near-term\" involvement in the presidential race. \"The scale and scope of those presidential campaigns, particularly next year  the amount of money theyre raising and what theyre doing  this is better served and focused to stay on state House races, races like that,\" Snyder said. The PACs chairman is GOP donor William Parfet, who is CEO and president of Mattawan-based MPI Research, which conducts preclinical medical studies. Others running the PAC include executive director Kyle Robertson, who was Snyders re-election campaign manager, fundraiser Amanda Kornegay and communications and outreach director Bettina Inclan. The \"hybrid\" PAC will be registered at the state and federal levels and include two accounts  one to spend limited amounts going directly to campaign committees and the other to raise and spend unlimited amounts to promote or oppose candidates independently. All donors will be disclosed. Snyder flirted with running for president this year and established a 501(c)(4) group, Making Government Accountable, allowing him to travel the country to more aggressively tell of the states rebound. He decided against a bid and has declined to name his favorite presidential candidates but prefers a governor. Former Florida Gov. Jeb Bush spoke Friday at the conference, while Ohio Gov. John Kasich visited Saturday. Snyder said the U.S. has a \"broken political culture.\", \"The best answer for America is to get someone that says, Its not about fighting and blaming people. Heres the problem, heres the solution. Lets go,\" he said. ", "Date": "20150919", "Author": "[David Eggert, Associated Press]", "Link": "http://www.chron.com/news/article/Snyder-creates-PAC-to-back-problem-solving-6516177.php", "Title": "[Snyder creates PAC to back 'problem-solving' candidates]"}