{"Content": "[Caption, Close, In this July 2, 2015 photo provided by Emma Nozell, Republican presidential hopeful Chris Christie poses for a photo with Emma Nozell in Nashua, N.H. Nozell and her sister, Addy Nozell, of Merrimack, N.H. are attempting to take photos with every presidential candidate campaigning in the state. They came up with the idea after Emma took this picture with Christie. (Emma Nozell via AP), In this July 17, 2015 photo provided by Emma Nozell, Republican presidential hopeful Donald Trump poses for a photo with Emma Nozell, left, and her sister Addy Nozell in Laconia, N.H. The teenagers from Merrimack, N.H. are attempting to take photos with every presidential candidate campaigning in the state. (Emma Nozell via AP), CONCORD, N.H. (AP)  Addy and Emma Nozell arent the first New Hampshire residents to collect photos of themselves with as many presidential candidates as possible. But the in the age of selfies and social media, the Merrimack sisters are attracting a lot of attention, so much so that candidates now arrive in the state ready for their close-ups with the teens. Here are five things to know about New Hampshires presidential selfie sisters:, THE FIRST:, It all started on July 2, when 15-year-old Emma decided she wanted to snap a photo of herself with New Jersey Gov. Chris Christie. They caught up with him in Nashua, where Christie stopped at an ice cream stand and later picked up the endorsement of the citys former mayor. \"I took a selfie with him, and then Addy decided, Why not get em with everyone?\" Emma said. While that encounter marked their first foray into presidential selfies, the girls are no strangers to the campaign trail. Their parents have made a point of taking them to political events since they were babies, an experience that gave them confidence that theyd accomplish their goal. \"Since our parents bring us to all these events, we thought it was pretty do-able,\" said Addy. \"We were always in the parades, we were always making signs. We were always helping them with whatever was needed.\", THE WORST:, Of all the selfies so far, the sisters are least happy with their picture with former Texas Gov. Rick Perry because hes not looking at the camera. (Theyve offered him a do-over.) In terms of overall experience, the most difficult meeting was with Dr. Ben Carson, who wrote an op-ed for The Washington Post website criticizing the \"obvious narcissism of endlessly photographing oneself and blasting it over social networks for others to admire.\" Though her parents warned her not to be upset if she got turned down, Emma was determined, albeit nervous. \"I went up to him and said, I know you dont like selfies, I understand that, but Im doing this project with all the other candidates,\" Emma said. \"I was wondering if you could take a selfie with me.\", He said yes. THE METHOD:, Having honed their skills over several weeks, the sisters have some advice for fellow selfie seekers. \"We find a hole in the crowd, we make eye contact with them if we can, and we smile,\" Addy said. Asking permission is a must, but selfie sticks are a no-no, she said, because they are too unwieldy in large crowds. \"And dont be afraid to get up in there,\" said Emma, who generally is the one snapping the photos. On Thursday, the girls approached Wisconsin Gov. Scott Walker at a crowded diner in Amherst. He demurred at first, saying hed pose with them after his speech. But Emma knew there wouldnt be enough time afterward, and it would be too crowded. \"I was like, no, we gotta take it now,\" she said. \"Before he said one word.\", THE DONALD:, By the time the girls caught up with Donald Trump at the Weirs Beach Community Center on Thursday, however, something had shifted. Instead of having to push through a crowd, they faced a clear walkway and a candidate who appeared to be waiting for them. \"When we went up to Trump, his handlers said These are the girls, and he said, Oh, all right, lets get the selfie,\" Addy said. \"We were flabbergasted. Wow. He knew!\", THE FUTURE:, Neither girl will be old enough to vote in New Hampshires first-in-the-nation presidential primary, though Addy will turn 18 before the general election. She said she leans toward Democrats, but is open to Republicans as well, and has liked some of what she has heard on the campaign trail. \"I probably wont decide until the very last minute,\" she said. Both sisters said they have learned a lot, not just about the candidates but about the media after having been interviewed numerous times for print, radio, television and online audiences.]", "Date": "20150720", "Author": "[Holly Ramer, Associated Press]", "Link": "http://www.chron.com/news/us/article/Say-2016-Sisters-snag-selfies-with-6394091.php", "Title": "['Say 2016!' Sisters snag selfies with presidential hopefuls]"}