{"Content": "[AUSTIN -- Investigators have dismissed a complaint filed by the Texas horse racing industry against state Sen. Jane Nelson over her role in a funding dispute that has threatened to shut down the state agency that oversees the sport. The Texas Department of Public Safety, which had been asked to review whether the Flower Mound Republican misused her power by threatening the agency, informed the president of a state horsemens association Thursday that an initial examination had found no validity to her complaint. \"Nothing in the materials you have provided thus far raises a plausible possibility that criminal conduct has occurred,\" investigator D. Phillip Adkins wrote to complainant Jan Haynes. Haynes, president of the Texas Thoroughbred Horsemens Benevolent and Protective Association, had accused Nelson with \"bullying\" the Texas Racing Commission by pushing to withhold its funding until the agency repeals its approval of a controversial new racing game. The game, known as \"historical racing,\" allows players to bet on previously-run races that have been stripped of identifying markings. The commissions approval of it last summer angered Nelson and some other lawmakers, who thought the agency did not have the power to authorized the game because it would expand gambling. Led by Nelson, the Senate budget writer, lawmakers put part of the commissions funding under their control and, so far, have refused to release the money. The agency has said it cannot operate past Sept. 1 without the money. If it closes, so, too, will the horse racing industry. The Department of Public Safety found that Nelsons actions \"appear to be directly related to the appropriation and budget execution issues involving the Texas Racing Commission...(and) these matters are appropriate areas for Senator Nelsons concern and attention.\", Haynes disputed the investigators findings, saying he had conflated Nelsons actions with those of the Legislature. \"The Legislature never tied these funds to any action of the Racing Commission, much less repealing important rules...Senator Nelson is not the Legislature. She doesnt get to say what the law is,\" Haynes said. She added that, \"If the DPS wont investigate, we will look at other legal options.\", Racing commission officials say they believe they ultimately will get their money -- after they repeal the authorization of the game. They are expected to meet Aug. 25 to do that.]", "Date": "20150820", "Author": "[Brian M. Rosenthal]", "Link": "http://www.chron.com/news/politics/texas/article/DPS-dismisses-horse-industry-complaint-against-6456397.php", "Title": "[DPS dismisses horse industry complaint against senator]"}