{"Content": "[Caption, Close, Joe Straus accepts congratulations from Governor elect Greg Abbott and Lt. Governor elect Dan Patrick after being sworn in as Speaker of the House during the opening of the 2015 Legislature at the State Capitol on January 13, 2015. The legislation, Senate Bill 1819, is sponsored by state Sen. Donna Campbell, R-New Braufels.The proposal would repeal a law that allows certain students who are illegally in the U.S. and who have been accepted by the states public colleges and universities to pay in-state tuition just like any other Texas resident.  (AP Photo), Helen Taylor, 6, daughter of Rep. Van Taylor, R-Plano, prays during the invocation at the opening session of the 83rd Texas Legislature, Tuesday, Jan. 8, 2013, in Austin, Texas. (AP Photo/Eric Gay), AUSTIN - State senators are likely to pass Gov. Greg Abbotts \"gold standard\" pre-kindergarten legislation into law, but not before the chambers far-right conservatives make clear they question its necessity. On Thursday, the Senate Public Education Committee approved House Bill 4 by Dan Huberty, R-Houston, an Abbott-backed bill that would funnel $130 million to certain pre-K programs that meet additional quality benchmarks based on teacher training levels, child improvement measures and more. The legislation sailed through the House, passing unanimously in committee and by an overwhelming marginon the floor. The legislation has received a chillier reception in the Senate, especially from lawmakers and activists who align themselves with the tea party. On Thursday, Sen. Donna Campbell, R-New Braunfels, succeeded in touting the Abbott bill, as well as ripping the concept of full-day pre-K as untested and lacking in fiscal responsibility. As a sophomore lawmaker who once advocated for shifting pre-K money to 2 education, Campbell seemed an unlikely choice to shepherd the bill through the Senate. In fact, veteran lawmaker Judith Zaffirini was the odds-on choice for the job - and, she said, the governors choice - before Lt. Gov. Dan Patrick chose Campbell to be the Senate sponsor. Patrick already has a fraught history with the bill, however, having had to distance himself from a scathing review his \"grass-roots\" advisors released calling it \"socialistic\" and \"Godless.\", Educators who spoke before the Senate panel on Thursday were much more positive. Houston Independent School District Superintendent Terry Grier said \"I cant think of anything youve done since Ive been in this state that is this important,\" while Austin Police Chief Art Acevedo in written testimony called high-quality pre-K \"one of our most most important crime prevention tools.\", HB4 does not expand existing state-sponsored pre-k, which is offered currently just to four-year-olds from homeless, military and non-native English speaking families. In the House committee, most lawmakers discussed the positive impact full-day pre-K would have in Texas, if not for insurmountable political and fiscal barriers. The bill was approved by a vote of 9-2. Sens. Van Taylor, R-Plano, and Don Huffines, R-Dallas, were the dissenting votes. The bill now heads to the full Senate for a floor vote.]", "Date": "20150501", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Senate-panel-passes-Abbott-pre-K-bill-6234703.php", "Title": "[Senate panel passes Abbott pre-K bill]"}