{"Content": "[BATON ROUGE, La. (AP)  Louisiana needs to invest more in its $11 billion tourism industry, the four men running for lieutenant governor said at a forum on Wednesday. The lieutenant governor is Louisianas chief tourism ambassador, overseeing state parks, museums and tourism promotion efforts in the state Department of Culture, Recreation and Tourism. As the states financial problems have grown in recent years, cuts have whittled away the agencys budget, shrinking it from $112 million in 2008 to about $90 million this year. Such reductions make little sense, the lieutenant governor candidates told a tourism summit, if the state gets a 38 to 1 return on its investment in tourism efforts. \"Why arent you taking care of the agency that brings so much money into the state of Louisiana?\" said Baton Rouge Mayor Kip Holden, a Democrat. Three Republicans  former Plaquemines Parish President Billy Nungesser, Jefferson Parish President John Young and state Sen. Elbert Guillory  also are vying for the job in the Oct. 24 election. Lt. Gov. Jay Dardenne isnt seeking re-election because hes running for governor. Young talked of creating a special fund to promote major events in the state and protecting a state sales tax dedication to tourism marketing. He said the lieutenant governor needs to do a better job selling the importance of the industry around the state, highlighting the $800 million in tax revenue tourism generates. He also said the state needs to work with local officials on New Orleans crime-fighting efforts, particularly in the French Quarter, or risk losing a top tourist draw to Louisiana. \"If we dont get crime under control in the city of New Orleans, were going to kill the goose that laid the golden egg,\" Young said. Nungesser said hed rally support from local officials to pressure lawmakers and the states next governor, to be elected this fall, to maintain funding to promote tourism, maintain state parks and museums and end the raid of tourism-related reserve funds. Holden said hed work to secure more private investment for state parks and museums to provide operating cash. Both Holden and Guillory said theyd work to promote small Louisiana communities to tourists. \"One of our priorities has to be the selling of Louisiana,\" said Guillory, of Opelousas. \"No other industry is as clean. No other industry as much fun.\", All four contenders praised Dardennes leadership of the tourism department and said theyd make few changes to the agency staff and structure.]", "Date": "20150819", "Author": "[Melinda Deslatte, Associated Press]", "Link": "http://www.chron.com/news/article/Lt-governor-candidates-Louisiana-must-invest-in-6454275.php", "Title": "[Lt. governor candidates: Louisiana must invest in tourism]"}