{"Content": "[Caption, Close, In this Aug. 17, 2015 photo, Republican presidential candidate Sen. Rand Paul, R-Ky. speaks during an interview before participating in a cataract surgery clinic in Cap-Haitien, Haiti. An ophthalmologist by training, Paul left Haiti on Wednesday afternoon after spending four days on a humanitarian mission to the island nation. In this Aug. 17, 2015 photo, Republican presidential candidate Sen. Rand Paul, R-Ky. gets ready to perform cataract surgery in Cap-Haitien, Haiti, as part of a humanitarian mission to the island nation. Paul participated in a similar mission with the same group last summer in Guatemala.( AP Photo/Dieu Nalio Chery), In this photo taken Aug. 17, 2015, Republican presidential candidate, Sen. Rand Paul, R-Ky. puts on scrubs to perform cataract surgeries in Cap-Haitien, Haiti. Paul joined a team of eye surgeons on a four-day mission to Haiti, giving vision to nearly 200 who would not have been blind if they lived in the United States. In Haiti, the poorest nation in the western hemisphere, curable blindness from common ailments such as cataracts is the norm. In this photo taken Aug. 17, 2015, Mathieux Saint Fleur, 75, sits still as a doctor examines his left eye before undergoing cataract surgery in Cap-Haitien, Haiti. Saint Fleur said he wanted his vision back to see his family again. In this Aug. 17, 2015 photo, Republican presidential candidate Sen. Rand Paul, R-Ky. right, walks outside the clinic where hes performing cataract surgeries in Cap-Haitien, Haiti. Paul joined six eye surgeons who restored vision to dozens of impoverished Haitians, many living for years in blindness because of ailments such as cataracts that are easily treated in the United States. In this photo taken Aug. 17, 2015, Mathieux Saint Fleur, 75, rests at home with his son Jackilo Joseph, left, and his cousin after cataract surgery on his left eye in Cap-Haitien, Haiti. Saint Fleurs surgery was performed by Republican presidential candidate Rand Paul, an ophthalmologist by training, who volunteered with other surgeons on a trip designed to train local doctors and address curable blindness. In this photo taken Aug. 17, 2015, Leana Floreus wears a cap before undergoing cataract surgery in Cap-Haitien, Haiti. A group of voluntary surgeons completed over 100 surgeries on patients on the three days Republican presidential candidate Rand Paul was part of a team of volunteer surgeons. The team expected to finish nearly 200 by the time the full group left the country. In this Aug. 18, 2015 photo taken, Mathieux Saint Fleur, 75, second from right, sits in a clinic with other patients who had cataracts removed as they wait to have their bandages removed one day after surgery in Cap-Haitien, Haiti. After the white gauze was peeled away, Saint Fleur was speechless for a few moments. I see! I see! he said, joy spreading across his face. In this photo taken Aug. 18, 2015, Mathieux Saint Fleur, 75, walks with his son Jakilo Joseph after a follow-up doctor visit one day after cataract surgery on his left eye in Cap-Haitien, Haiti. After the gauze was peeled away from his left eye, he said he could see again and began reaching out for nearby medical staff, hugging anyone he could and  touching their faces. Then he spoke directly to his surgeon, Republican presidential candidate Rand Paul: If its for money, I could not do this. I have no money, he said through an interpreter. God sent you to me. CAP-HAITIEN, Haiti (AP)  Mathieux Saint Fleur has been virtually blind for two decades. In less than 24 hours, he will see again. As the 75-year-old Haitian patient lies on an operating table, a U.S. eye surgeon-turned-politician reassures him in broken Creole that the surgery is almost over. \"People need to be encouraged its not much longer,\" said Republican presidential candidate Rand Paul, an ophthalmologist by training, without taking his eyes off Saint Fleur. As many of Pauls competitors courted voters in Iowa and New Hampshire over the last week, Kentuckys fiery junior senator joined a team of eye surgeons on a four-day mission to Haiti, giving vision to nearly 200 who would not have been blind if they lived in the United States. But here in the poorest nation in the Western Hemisphere, \"curable blindness\" from common ailments such as cataracts is normal. \"If Jesus can give me back my vision, I will be happy,\" said Saint Fleur, who would soon have a cataract almost the size of a dime removed from his left eye. The aging man, who balances himself with a worn walking stick, said he wanted his vision back simply to see his family again. He was among scores of Haitians  adults and children  who streamed through the hallways of Vision Plus Clinique, a nondescript, two-story building set in the heart of Haitis largest north-coast city and guarded by a team of armed police and a private security detail for the mission. Despite the humanitarian focus, Pauls precarious place in the 2016 presidential contest was never quite forgotten. Considered a formidable White House contender for much of the last year, the first-term senators standing in the GOP field has suffered following billionaire businessman Donald Trumps sharp rise. Declining poll numbers could jeopardize Pauls place in next months prime-time debate as he struggles to attract major donors to fund a national network borrowed from his fathers passionate following. Paul acknowledged his recent struggle during an interview at a Cap-Haitien hotel, where razor-wire protects the outer walls and raw sewage flows into the nearby ocean. \"Its sort of like a schoolyard. Once you got em down, everybody piles on,\" Paul said of the 2016 contest. \"And Ive been under a dog pile for a couple of weeks.\", There may be cause for optimism, however, in the face of Gary Heavin, a cigar-chomping billionaire and Republican donor who was at Pauls side much of the week, having arrived with the senator and some of the other doctors on his private jet. Heavin, the Texas-based founder of the Curves health club franchise, has been active in Haitian charity work since a 2010 earthquake left more than 100,000 dead and millions homeless in the nations capital, Port-au-Prince. Roughly 75 percent of the country remains without electricity. \"If I support anyone in the Republican Party, its him,\" Heavin said in an interview outside the clinic while Paul worked with patients inside. He said he has the capacity to donate more than $10 million and would back Paul if \"confident in his ability to influence the process.\", Paul has worked aggressively to broaden his support beyond the small, but passionate group of his fathers loyal supporters. Yet many prominent donors and GOP establishment figures have balked, largely because of the younger Pauls foreign policy views. Like his father, former Rep. Ron Paul, Rand Paul favors a dramatically smaller footprint in the world. He has proposed federal budgets that would eliminate virtually all U.S. funding to foreign governments. He didnt back off such positions while in Haiti. \"The U.S. has had a big role for many, many years here,\" said Paul, who also is seeking re-election to the Senate. \"It hasnt fixed things.\", \"We borrow it from China to give it to Haiti. Thats not charity, thats just bad policy,\" he added, encouraging private donations instead of government support. He didnt rule out government aid altogether, however, particularly for food and water \"in an immediate disaster.\", At the eye center, at least, it was easy to find evidence that Pauls privately-funded mission made a difference. The trip was organized by the University of Utahs Moran Eye Center, which regularly leads trips designed to train local doctors and address \"curable blindness\" in poor areas around the world. Cataract surgeries often take no longer than 20 minutes, allowing teams of volunteer surgeons to perform dozens in a single day. The Haiti group completed 109 surgeries on the three days Paul was on hand and expected to finish nearly 200 by the time the full group left the country on Saturday. On Tuesday morning, the day after his surgery, Saint Fleur sat in a room crowded with patients quietly waiting for the bandages to come off. He was speechless for a few moments after the white gauze was peeled away. Then he began to smile. \"I see! I see!\" he said, joy spreading across his face. And with shaking hands, he began reaching out for nearby medical staff, hugging anyone he could and affectionately touching their faces. \"I love you,\" he told a nurse. \"Yesterday I couldnt see!\", Saint Fleur then spoke directly to Paul: \"If its for money, I could not do this. I have no money,\" he said through an interpreter. \"God sent you to me.\"]", "Date": "20150824", "Author": "[Steve Peoples and Dieu Nalio Chery, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Paul-talks-2016-challenges-between-eye-surgeries-6461351.php", "Title": "[Paul talks 2016 challenges between eye surgeries in Haiti]"}