{"Content": "[AUSTIN  The state will launch a special legislative inquiry next month, focusing on jail suicides, such as the high-profile death of Sandra Bland in Waller County, with a goal of curbing such tragedies, Senate officials announced Tuesday.  Source: Houston Chronicle , Lt. Gov. Dan Patrick and Senate Criminal Justice Committee Chairman John Whitmire, D-Houston, said the 29 suicides in Texas county and municipal lockups so far this year  compared with 22 in 2014  is a troubling sign that changes in jail supervision need to be made. \"Out of the million people who are in jails in this state each year . . . this is a very small number, but theyre human lives,\" Patrick said in announcing the special study at a Capitol press conference. \"\"Our goal would be to have zero tolerance.\", Whitmire, who said a lack of mental health care and medications for newly booked inmates at some jails is a part of the problem, said the study will begin with public hearings in September. And while Texas 244 regulated jails are \"generally a well-run system, some jails appear not to be doing everything they can to avoid suicides. \"Some localities are lacking in resources . . . where you might not get your insulin or other medications, and you might have to go into a coma for the jail to realize the problem,\" he said. \"That needs to change.\", He cited a recent jail death in Houston, and continuing problems with supervision at the Harris County Jail, as proof that the problems need to be investigated by his committee and changes need to be made to fix them. Caption, Close, Sandra Bland, shown in an undated photo that was provided by her family, was found dead in a Waller County jail cell July 13. FILE- In this July 10, 2015 file frame from dashcam video provided by the Texas Department of Public Safety, trooper Brian Encinia arrests Sandra Bland after she became combative during a routine traffic stop in Waller County, Texas. Encinia, a Texas trooper who arrested Bland after a confrontation that began with a traffic stop, had been cautioned about unprofessional conduct in a 2014 incident while he was still a probationary trooper. (Texas Department of Public Safety via AP, File), \"We can do better. We must do better,\" he said. Similar studies into jail deaths and supervision problems in 1985 and 2010 yielded recommendations for additional state supervision and rules, but many changes were never made because of opposition from local officials  who said the upgrades would be too costly to local taxpayers.]", "Date": "20150818", "Author": "[Mike Ward]", "Link": "http://www.chron.com/news/politics/texas/article/Interim-study-ordered-on-jail-safety-6450806.php", "Title": "[State Senate orders interim study on jail safety]"}