{"Content": "[Caption, Close, Republican presidential candidate Sen. Rand Paul (R-Ky.) speaks to a large crowd inside of the Bishop Barnwell Room during a \"Stand with Rand\" rally on the campus of Boise State University in Boise, Idaho, Thursday, Aug. 27, 2015. (Kyle Green/Idaho Statesman via AP) LOCAL TV OUT, LONDON, Ky. (AP)  Robert Abner knew Rand Paul wanted his vote. He just thought it was for president. Abner came to a campaign event to see Rand Paul the presidential candidate, the guy who goes after Donald Trump on Fox News. But this wasnt Iowa. This was central Kentucky, and the event was one of Pauls stops as a U.S. senator seeking re-election. \"I didnt know that until this morning,\" Abner said. Lost amid the crowded GOP presidential debate stages and attention-grabbing YouTube videos is that other high-stakes 2016 race: the battle for control of the U.S. Senate. Rand Paul has his hands in both, as he runs for president and re-election to the Senate. The candidate for two offices at once handles questions about the endeavors by saying hes running for re-election by doing a good job in the Senate. He suggests that whichever office he might win next year, hes working for the same policy goals. \"I continue to be someone who votes against spending, particularly spending money we dont have,\" Paul said. Pauls seat in Republican-leaning Kentucky is key to holding the new GOP majority next year. But so far Pauls campaign to keep that seat barely exists, overshadowed by his presidential bid. Since announcing his presidential candidacy in April, Paul has spent at least 26 days campaigning in early primary and caucus states while skipping the Fancy Farm Picnic and the Kentucky Ham Breakfast - essential cattle calls for statewide office seekers in Kentucky. In the last six weeks, he has held public events in Kentucky for four days. He has transferred $1.4 million from his Senate campaign to his presidential effort, leaving him with $1.5 million in cash for the Senate race. Fellow Kentucky U.S. Sen. Mitch McConnell, now the Senate majority leader, had nearly $10 million in cash available at the same time during his last re-election bid. \"I think right now voters are giving him a bit of a pass as he pursues the presidency,\" said Republican state Sen. Damon Thayer, one of Pauls allies. \"I do think there is a limit on it. But I dont know what that limit is.\", It probably helps Paul that he is facing scant pressure back home from Democrats, so far. Popular Democratic Gov. Steve Beshear and Louisville Mayor Greg Fischer have both said they will not run for Senate. Paul says he doesnt think the presidential campaign had weakened his re-election chances in Kentucky. \"If you look at most of the polls I think most people in Kentucky approve of what Im trying to do,\" he said. The Republican Party of Kentucky does. Last week, the partys central committee voted to create a presidential caucus in Kentucky. It allows people to be on the ballot for president on March 5 and be on the ballot again for Senate on May 17 without violating a state law that bans candidates from appearing on the ballot twice in the same election. Debbie Helton closed her Somewhere in Time antiques shop last week so she could come hear Paul speak in Corbin. For about an hour, Paul discussed concerns about drug addiction, government benefits and President Barack Obamas new emission standards for coal-fired power plants as rules imposed without approval from Congress. Helton said she doesnt see how Paul can \"concentrate on two areas at one time.\", \"I cant do it myself,\" she said.]", "Date": "20150828", "Author": "[Adam Beam, Associated Press]", "Link": "http://www.chron.com/news/article/In-Kentucky-the-other-2016-race-plays-out-for-6471692.php", "Title": "[In Kentucky, the other 2016 race plays out for Rand Paul]"}