{"Content": "[Caption, Close, Wisconsin Gov. Scott Walker speaks to supporters as he announces he is running for the 2016 Republican presidential nomination at the Waukesha County Expo Center, Monday, July 13, 2015, in Waukesha, Wis. Wisconsin Gov. Scott Walker waves to supporters as he announces he is running for the 2016 Republican presidential nomination at the Waukesha County Expo Center, Monday, July 13, 2015, in Waukesha, Wis. Wisconsin Gov. Scott Walker speaks to supporters as he announces he is running for the 2016 Republican presidential nomination at the Waukesha County Expo Center, Monday, July 13, 2015, in Waukesha, Wis. Wisconsin Gov. Scott Walker shakes hands as he announces he is running for the 2016 Republican presidential nomination at the Waukesha County Expo Center, Monday, July 13, 2015, in Waukesha, Wis. WAUKESHA, Wis. (AP)  Scott Walker vowed Monday to fight for Americas interests abroad and for his conservative policies in Washington, launching a 2016 Republican presidential bid by highlighting his clashes with labor unions as his campaign taunted his Democratic critics. The 47-year-old second-term governor embraced his \"fighter\" reputation as he formally declared his candidacy in an evening speech, his family at his side, and protesters gathered just outside the convention hall. \"We are running to serve as your president of the United States of America,\" Walker declared. \"Americans deserve a president who will fight and win for them,\" he said. \"You see, it doesnt matter if youre from a big city, a suburb or a small town, I will fight and win for you. Healthy or sick, born or unborn, I will fight and win for you.\", He becomes the 15th high-profile Republican to enter the GOP presidential contest, yet claims to occupy a unique space in the congested field. He not only fights for conservative principles, he says, but he also wins elections and policy debates in a state that typically supports Democrats. Speaking in the same hall where he celebrated his successful recall election three years earlier, Walker left little doubt that his successful, if divisive, fights with labor unions would serve as the foundation for his presidential campaign. Through five years in office, he enacted policies weakening organized labors political power and became the first governor in U.S. history to defeat a recall election. Labor unions spent millions of dollars to defeat him, but failed. \"Scott Walker is a national disgrace,\" said AFL-CIO President Richard Trumka, among the many detractors who lashed out against Walkers candidacy on Monday. Walker also highlighted a series of lesser-known triumphs he says set him apart from the crowded Republican field. He cut income and corporate taxes by nearly $2 billion, lowered property taxes, legalized the carrying of concealed weapons, made abortions more difficult to obtain, required photo identification when voting and made Wisconsin a right-to-work state. His budget this year, which plugged a $2.2 billion shortfall when he signed it into law Sunday, requires drug screenings for public benefit recipients, expands the private school voucher program, freezes tuition at the University of Wisconsin while cutting funding by $250 million and removing tenure protections from state law. Such achievements may appeal to conservatives who hold outsized sway in Republican primaries, yet some could create challenges in a general election should Walker ultimately become the GOPs nominee. Voter ID laws, abortion restrictions, liberal gun policies and education cuts are not necessarily popular among swing-state independents. Walkers record is well-known to Wisconsin voters, a state where the second-term governor engenders fierce loyalty and fierce opposition. Protesters who first crowded the state Capitol in 2011 in demonstrations as large as 100,000 still gather daily, although only about a dozen or so at a time, to sing anti-Walker songs. Dozens of protesters gathered Monday on the street outside the arena carrying signs that read \"Waukesha Against Walker!\" and \"Walker is a bully and a liar!\", Mary Mezera, a 46-year-old education research coordinator at UW-Madison, said she lost all union representation in the wake of Walkers public union restriction and is especially upset over the governor signing bills that make it more difficult to obtain an abortion in Wisconsin. \"I hope hell fall flat on his face,\" Mezera said. Walker begins his 2016 presidential bid with at least $20 million to spread his message, raised by two outside groups not subject to campaign finance donation limits, according to sources with direct knowledge of the fundraising operation. They spoke on the condition of anonymity to publicly discuss private fundraising strategy. While he has limited international experience, Walkers speech outlined a muscular foreign policy that would include more American forces in combat. He called for lifting the political restrictions on U.S. troops stationed in Iraq \"so they can help our Kurd and Sunni allies reclaim land taken by ISIS.\", \"On behalf of your children and mine,\" he said, \"Id rather take the fight to them than wait for them to bring the fight to us.\", Walker also highlighted rising test scores and graduation rates in Wisconsin as evidence that the 2011 union law worked. What he didnt mention is Wisconsins graduation rates were increasing for years before he took office, and the recent growth is not as strong as the national average. Wisconsins ACT scores have been among the best in the nation since before Walker was elected. They ranked third the year before he took office and ranked second in 2012. Critics note that Walker too often ignores where hes fallen short. The states chief economic development agency that Walker created, a hybrid public-private partnership, has been beset with problems, including handing out $124 million in loans without properly vetting the recipients. Walker was over 100,000 jobs short on his signature 2010 campaign promise to create 250,000 private-sector jobs. Hes also been dogged by two investigations, neither of which have yet to result in charges filed against him. The first resulted in a variety of criminal convictions against six of his former aides and associates when he was Milwaukee County executive. The second investigation, currently on hold while the state Supreme Court considers a trio of lawsuits, centers on whether Walkers recall campaign illegally coordinated with independent groups. Shortly before the speech, Walkers campaign distributed a list of Democratic criticism levied throughout the day, an unusual step for a presidential campaign, yet one that underscored his willingness to take on opponents. \"Democrats have spent their day launching attacks against him,\" said spokeswoman AshLee Strong, \"showing how scared they are of someone who is both a fighter and a winner.\", ", "Date": "20150716", "Author": "[Todd Richmond and Steve Peoples, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Walker-to-remind-voters-of-union-wins-as-he-6380934.php", "Title": "[Walker: 'I will win and fight for you']"}