{"Content": "[Caption, Close, FILE - In this May 16, 2015, file photo, California State Attorney General Kamala Harris speaks to California Democrats at the California Democrats State Convention in Anaheim, Calif. California Republican Party Chairman Duf Sundheim will enter Wednesday, Sept. 4, 2014, the 2016 race for the U.S. Senate seat Democrat Barbara Boxer will vacate. If there is a surprise in the campaign to succeed Sen. Barbara Boxer, its that the contest has been essentially one-dimensional. Democrat Kamala Harris has had the field mostly to herself, despite early predictions for a crowded political bloodbath. In this photo taken, Thursday, Sept. 3, 2015, former California Republican Party Chairman Duf Sundheim poses for a photo during an interview at The Associated Press bureau in Los Angeles. Duf Sundheim will enter the 2016 race Wednesday, Sept. 4, 2015, for the U.S. Senate seat Democrat Barbara Boxer will vacate. If there is a surprise in the campaign to succeed Sen. Barbara Boxer, its that the contest has been essentially one-dimensional. Democrat Kamala Harris has had the field mostly to herself, despite early predictions for a crowded political bloodbath. LOS ANGELES (AP)  The first open U.S. Senate seat in a generation in California was expected to attract a large cast of marquee candidates, leading to a spirited scrum next year to replace departing Democrat Barbara Boxer. So far, that hasnt happened. The announcement Wednesday that a third, little-known Republican entered the 2016 race speaks mostly to whats been absent from the campaign. Attorney General Kamala Harris got in quickly, established herself as an early Democratic favorite and hasnt been significantly pressured as the contest gradually takes shape. \"Right now, Harris is the front-runner and every other candidate, of any party, is an afterthought,\" said Rose Kapolczynski, Boxers longtime political adviser, who is not affiliated with any of the 2016 contenders. Duf Sundheim, who headed the state Republican Party when former Gov. Arnold Schwarzenegger was elected in 2003, released a video Wednesday declaring his candidacy and promising to work for improved schools, more jobs and better roads. \"Its an election, not a coronation,\" he said, in an apparent reference to Harris. The outlook for Republicans isnt promising. The 62-year-old lawyer joins two-term Assemblyman Rocky Chavez of Oceanside and Tom Del Beccaro, another former state GOP leader, as Senate long shots in a state that has become a Democratic fortress in statewide elections. Youd have to go back nearly three decades to find a Republican elected to the U.S. Senate from California  Pete Wilson, in 1988. Democrats hold every statewide office, control both chambers of the Legislature and a have 2.7-million edge in voter registration. The 2016 race is in fledgling stages  the primary isnt until June, candidates still have months to get in and early polls have found voters mostly unfamiliar with the race. Harris biggest potential threat comes from another Democrat, 10-term Rep. Loretta Sanchez from Orange County. However, Sanchez got off to a bumpy start last spring, apologizing in May after a videotape surfaced showing her making a whooping cry in reference to Native Americans that brought a cascade of reprimands from fellow Democrats. She also lags Harris in fundraising. After a summer lull when the presidential race dominated political headlines, Sanchez adviser Bill Carrick said the campaign will begin accelerating its public activity, including releasing a string of endorsements. \"I think the thing is wide open,\" Carrick said. Boxers announcement in January that she wouldnt seek a fifth term opened up a political opportunity that hadnt been seen in years in the state. She and fellow Democratic Sen. Dianne Feinstein were first elected in 1992. Twice elected attorney general, Harris benefited from an early start, and prominent Democrats, including former Los Angeles Mayor Antonio Villaraigosa and billionaire climate activist Tom Steyer, bypassed the race, perhaps to run for governor in 2018. Sanchez has sought to seize on contrasts with prosecutor Harris, referring to her experience in foreign and military affairs on Capitol Hill. But Roy Behr, another veteran Democratic consultant who has worked with Boxer and isnt tied to any of the campaigns, said Sanchez has yet to follow through on her promise to aggressively stake out policy positions to challenge Harris. \"You cant beat somebody with nobody, and thats the situation we have right now,\" Behr said, referring to Harris edge thus far. There are soft spots for Harris that could encourage other rivals. Shes not well known outside her home base in the San Francisco Bay Area, and her fundraising tallies have been so-so for a campaign that could cost $30 million or more. She had about $3 million in the bank at the end of June, far more than any other candidate, but it can cost $1 million to run a week of TV ads in the Los Angeles market alone. With the popularity of early, mail-in voting in California, those ads must go on the air weeks before election day. In the second quarter this year, she raised $1.6 million but spent over $900,000 on fundraising and other expenses, records show. As a candidate, she has limited her interactions with the media since entering the race in January, focusing her time on her day job in Sacramento. Kapolczynski said Sanchez needs to find an issue to turn the race. \"When the Anita Hill-Clarence Thomas hearings exploded, that created an opportunity for Boxer to become better known,\" she said, referring to the U.S. Supreme Court nomination fight that lifted Boxers profile in advance of the 1992 election, her first win. Sanchez, she said, \"needs to do something dramatic.\"]", "Date": "20150909", "Author": "[Michael R. Blood, Ap Political Writer]", "Link": "http://www.chron.com/news/article/In-California-another-Republican-joins-US-Senate-6494044.php", "Title": "[US Senate contest in California shaping up as one-sided]"}