{"Content": "[Caption, Close, A workers installs metal spikes onto the existing White House fence in Washington, Wednesday, July 1, 2015. The Secret Service says it will install sharp metal spikes on the White House fence after intruders scaled it twice in less than a year. In a news release, the Secret Service and National Park Service say the spikes are a temporary security measure until a long-term solution is found. Workers install metal spikes onto the existing White House fence in Washington, Wednesday, July 1, 2015. The Secret Service says it will install sharp metal spikes on the White House fence after intruders scaled it twice in less than a year. In a news release, the Secret Service and National Park Service say the spikes are a temporary security measure until a long-term solution is found. For many years, this is the only White House photo tourists were able to take home to remember their visit to whats arguably the most well-known building in Washington, D.C. Now, with the ban on social media and photos lifted, you can take all the photos you want inside. If you havent been inside  or if its been a while  click ahead to take a tour inside Americas first house.Source: Photos and captions from the virtual tour on WhiteHouse.gov, The Navy Mess: U.S. Navy stewards have been responsible for Presidential food service since 1880, when President Rutherford B. Hayes used the U.S.S. Despatch as the first Presidential yacht. Since the establishment of the White House Mess in 1951 under President Harry S. Truman, the Navy has assigned their best culinary specialists to provide food service at the White House. The West Wing Reception Room: Visitors who come to see the President, Vice President, and White House staff pass through the West Wing Reception Room. Renovated by President Richard Nixon in 1970 into a smaller, more intimate receiving room, it houses several paintings from the White House collection as well as a 1770 mahogany bookcase, one of the oldest pieces of furniture in the White House. The Roosevelt Room: The Roosevelt Room, an all-purpose conference room, was created in 1934. It occupies the original location of President Theodore Roosevelts office when the West Wing was built in 1902. President Richard Nixon named the room in 1969 to honor both Roosevelts  Theodore for building the West Wing and Franklin D. for its expansion. Portraits of both presidents hang in the Roosevelt Room. The Oval Office: The official office of the President and his primary place of work, the Oval Office provides the President with easy access to senior advisers and the Residence. It was created in 1909 when the West Wing doubled in size under President William Howard Taft. Each President may decorate the Oval Office to suit his tastes, though some features remain constant, including the white marble mantel from the original 1909 Oval Office. President Barack Obama chose to retain the famous \"Resolute Desk  recognized in the historic photograph of the young JFK, Jr. peeking out from its panel. Constructed from timbers of H.M.S. Resolute, the desk was presented by Queen Victoria to President Rutherford B. Hayes in 1880. In August 2010, the Oval Office was refurbished for President Obama with striped wallpaper, new sofas, and a mica-clad coffee table. An oval rug features the presidential seal and historical quotes of meaning to President Obama around the border. James S. Brady Press Briefing Room: Constructed in 1970 during the Nixon Administration, the Briefing Room provided more space to accommodate a growing White House Press Corps. The Briefing Room replaced a swimming pool that was installed in 1934 for President Franklin D. Roosevelts physical therapy. A staircase behind the stage provides access to the deep end of the one-time pool, which now contains 18-miles of cables and the signatures of White House staff and celebrities on the original tile walls. Currently, approximately 200 journalists make up the White House Press Corps. With just 49 chairs in the Briefing Room, the White House Correspondents Association decides who gets the coveted seats. A plaque on each seat displays the name of the news organization to which it is assigned. The Rose Garden: In 1913, First Lady Ellen Wilson began planting roses in the garden adjoining the Colonnade, and the Rose Garden was born. It was redesigned during the Kennedy Administration to serve as a Presidential reception area. When weather permits, the Presidents bill signings, press conferences and diplomatic receptions take place here. The North Portico: The front door of the White House opens out onto the North Portico, facing Pennsylvania Avenue. Constructed in 1829-30, the portico provides covered access to the Entrance Hall. Once the principal entrance to the White House for both the family and the public, the north doorway is now where the President and First Lady greet guests of state before gala dinners. Visitors on public tours also exit through this doorway. Entrance Hall and Cross Hal Originally used as the gateway to the White House for the First Family and the public, the Entrance Hall and Cross Hall were at the center of architect James Hobans plan for the White House. In 1835 President Andrew Jackson received a gift of a 1,400 lb. wheel of cheese and placed it in the Entrance Hall for the public. Crowds arrived in droves, and guests trampled cheese crumbs into the carpet. The Hall smelled for weeks. In 1841 the public passed through the Entrance Hall for a much more somber purpose: to view the body of President William Henry Harrison who died after only a month in office. The Entrance Hall still serves as the official entrance for state visitors. The State Dining Room: When Thomas Jefferson began his term in 1801, he used this room as an office and the adjoining Red Room to meet guests and visitors. President James Madison established the State Dining Room in 1809. The Gilbert Stuart portrait of George Washington hung on the west wall before First Lady Dolley Madison had it removed to safety in 1814 before the White House was burned by the British. During his large scale 1902 renovation, President Theodore Roosevelt greatly expanded the Dining Room, increasing its capacity to 140 seated guests. A centerpiece of that renovation was a collection of wild animal heads, including a moose head over the fireplace mantel. During the Obama Administration, state dinners have been held in the larger East Room and in tents on the South Lawn. The State Dining Room has been used for meetings with members of Congress and other groups. The Red Room: The Red Room received its name after red fabrics were used for the draperies, upholsteries and floor covering in the 1840s. Today the walls are covered in a red twill satin fabric with a gold design in the borders, and the furniture is upholstered in a silk of the same shade of red. The rug is a reproduction of a 19th century French Savonnerie carpet installed when First Lady Jacqueline Kennedy refurbished the room. Beginning in 1809, First Lady Dolley Madison held gatherings every Wednesday in the Red Room to encourage socializing between members of opposing political parties. In 1933, First Lady Eleanor Roosevelt used the Red Room to host the first of many press conferences for women reporters who at that time were excluded from the Presidents press conferences. The Red Room was also the site of the secret swearing-in of President Rutherford B. Hayes right after his hotly contested defeat of Samuel J. Tilden in the election of 1876. Inauguration fell on a Sunday that year. To avoid a possible coup, he took the oath of office in the Red Room and then again in public on March 5, 1877. The Blue Room: The Blue Room is located in the center of the State Floor of the White House. The President uses the Blue Room to receive many of his guests, from foreign heads of state to members of Congress. Originally decorated in red, blue was selected as the color for the drapes, upholstery, and carpet during an 1837 refurbishing under President Martin Van Buren. Blue walls were introduced in 1902. It has since been redecorated, but has always maintained its famous blue color scheme. During the holidays, the Blue Room is the location of the official White Houses Christmas tree. The Green Room: With its intimate size, green silk-covered walls and early 19th-century American furniture, the Green Room is a favorite White House parlor. The room was referred to as the Green Drawing Room\" as far back as 1825 after a green floor covering was placed there during the Jefferson Administration. In 1961, First Lady Jacqueline Kennedy began a program to give a more formal, museum-like character to the public rooms of the White House. The Green Room was one of the notable rooms that Mrs. Kennedy helped redesign. Artwork in the room today includes Henry Ossawa Tanners Sand Dunes at Sunset, Atlantic City, the first work by an African American artist to be added to the permanent White House collection. The East Roo Designed by George Washington and James Hoban as the public audience room of the White House, the large East Room has served a variety of formal and informal purposes. First Lady Abigail Adams would hang out her laundry here in the winter of 1800801. Thomas Jeffersons aide Meriwether Lewis used part of the unfinished East Room for sleeping quarters and an office before leaving to lead the famed Lewis & Clark expedition. In 1861, at the opening of the Civil War, the East Room was used as quarters by Union troops. It would later serve as the site of President Lincolns funeral.After Steinway and Sons donated a grand piano to the White House in 1903, the room became a venue for concerts and performances, particularly during the Kennedy administration when the White House became a center for Americas arts. During the Obama Administration, the East Room has been the site of the signing of the Affordable Care Act in March 2010, as well as a music series to celebrate the arts with performances by Paul McCartney, Stevie Wonder, Bob Dylan and many others. The South Portico: The South Portico was constructed by James Hoban in 1824 during the presidency of James Monroe. In 1948, President Harry S. Truman added the Truman Balcony to the second floor, a private porch enjoyed by First Families ever since. The White House Kitchen: The White House kitchen is where meals are prepared for the First Family and guests -- including everything from family breakfasts to state dinners. The work of the White House chefs ranges from tending to fresh produce harvested from the White House Kitchen Garden to constructing the holiday White House gingerbread house. Having found the kitchen to be below standards, First Lady Eleanor Roosevelt had it renovated with professional grade appliances in 1935. Today the kitchen has the capacity to cook dinner for 140 guests and appetizers for up to 1,000.  (Photo by Kevin Dietsch-Pool/Getty Images) *** Local Caption *** Bill Yosses;Michelle Obama, The Flower Shop: Located underground on the Ground Floor level, the Flower Shop is where White House florists prepare arrangements for anything from a state dinner to everyday floral accents throughout the White House. The Library: This room on the ground floor was originally a laundry room, then a waiting room, and finally, in 1935, the White House Library. The Library holds a range of books as well as portraits of four Native American leaders who visited the White House in 1821-22; the only known likeness of James Hoban, the original architect of the White House; and two armchairs from a set made in 1817 for President James Monroe. The Map Room: Primarily used as a meeting room for the President and First Lady, the Map Room was used as a war room by President Franklin D. Roosevelt during World War II. Early maps of Washington, DC hang in the room, as well as a case of world maps presented by the National Geographic Society and the last situation map prepared in the room for Roosevelt in 1945. From a meeting between President Obama and His Holiness the XIV Dalai Lama to a classical music workshop with renowned musicians and local music students  the Map Room serves a number of purposes today. The Diplomatic Room: Once the White House furnace room, the Diplomatic Reception Room was transformed during the 1902 Theodore Roosevelt renovation into a receiving room. It was from this room, during the Great Depression in the 1930s and through World War II, that President Franklin D. Roosevelt delivered his famous Fireside Chats radio addresses to the American people. President Obama occasionally uses the Diplomatic Room as the site of his weekly video addresses. First Lady Jacqueline Kennedy added the wallpaper of scenic American landscapes to the room in 1962. The emblems of each of the 50 states border the rooms rug. The room is now used as a meeting place for guests before large events and as the principal entry for the First Family. The China Room: Until the late 19th century, White House furnishings, including the china services, were sold off at auction to supplement funds for new furnishings. First Lady Caroline Harrison started a china collection to exhibit the tastes of her predecessors. In 1917, First Lady Edith Wilson created the China Room, now home to the famous White House collection.The red theme in the room matches the red dress worn by First Lady Grace Coolidge in a full-length portrait with her dog, Rob Roy. The display of china, glass and silver tableware is arranged in chronological order from left to right. The East Colonnad The East Terrace, originally built by Thomas Jefferson but demolished in 1866, was reconstructed during the Theodore Roosevelt renovation of the White House in 1902. The glass-enclosed Colonnade connects the East Wing to the Residence. The Family Theater: With the construction of the East Wing, President Franklin D. Roosevelt had an East Terrace cloakroom converted into a movie theater. Here the president enjoyed watching news reels and took special interest in the battles fought in Europe and Asia. With 42 seats in tiered rows, the First Family and their guests can view current movies, sports games and TV shows. In March 2010, Steven Spielberg and Tom Hanks joined President Obama, members of Congress, the Joint Chiefs of Staff, Veterans of Foreign Wars (VFW) and Women in the Military Service for America Memorial for a screening of The Pacific, a series that tells the story of the Pacific front during World War II. The Kennedy Garden: The Jacqueline Kennedy Garden of the White House, sometimes called the First Ladys Garden or the East Garden, is based on a traditional 18th century American garden. First Lady Jacqueline Kennedy worked with designer Rachel Lambert Mellon to design a well-defined lawn surrounded by flower beds, boxwood and topiary trees. The garden is also home to lavender and rosemary, herbs often used by White House chefs in meals. New seasonal flowers are added to keep the garden blooming year round. In 1965, First Lady Lady Bird Johnson dedicated the East Garden to Jacqueline Kennedy. The Basketball Court: Shortly after taking office, President Obama had the White House tennis court adapted so it could be used for both tennis and basketball. The White House has had a smaller outdoor court since 1991, but the adapted tennis court allows enough room for a full court game of basketball. The new court has played host to a number of distinguished visitors, from college basketball championship teams to Wounded Warrior players. The Kitchen Garden: The Kitchen Garden was planted in the spring of 2009 by First Lady Michelle Obama with the help of students from a local elementary school. The first kitchen garden on White House grounds since First Lady Eleanor Roosevelts Victory Garden during World War II inspired the First Ladys Lets Move! initiative to raise a healthier generation of kids.White House chefs use produce from the garden for preparing meals for the First Family, as well as for official functions like state dinners. Some produce is donated to Miriams Kitchen, a local homeless shelter providing services and homemade meals, a soup kitchen near the White House. The Beehive: Charlie Brandt, a White House carpenter for more than two decades, started beekeeping as a hobby, and the Obama White House quickly embraced the idea of making honey on-site to use in White House recipes. Brandt is now the official beekeeper of what is believed to be the first ever beehive on White House grounds. The beehive is located on the South Lawn, and the foraging bees help pollinate the Kitchen Garden. Anthony Quintano of Hillsborough, N.J. holds up a sign against taking photos while touring the White House in Washington, Wednesday, July 1, 2015. The White House says visitors can now take photos or use social media during public tours of the building. People take photos while touring the White House in Washington, Wednesday, July 1, 2015. The White House says visitors can now take photos or use social media during public tours of the building. People take photos while touring the White House in Washington, Wednesday, July 1, 2015. The White House says visitors can now take photos or use social media during public tours of the building. WASHINGTON (AP)  Want to take a picture inside the White House Blue Room? Well, its now OK to pull out your cellphone or camera and press \"shoot.\", The White House on Wednesday ended a long-standing ban on tourists taking photos or using social media during public tours of the building. Michelle Obama made the announcement in a video posted on her Instagram account. \"If youve been on a White House tour, you may have seen this sign,\" she says, holding up a placard that states \"No Photos or Social Media Allowed.\" Well, not anymore,\" she adds, and then dramatically rips the sign in half. Those visiting the presidential mansion on Wednesday with cameras in hand may have also taken note of another visual: sharp, metal spikes being installed atop the White House fence. The Secret Service upgrade comes amid concerns about would-be intruders scaling the fence and jeopardizing the presidents security, but is intended as a temporary measure until a long-term change for the fence can be put in place. The White House said the more than 40-year-old photo ban was lifted because changes in camera technology make it possible to take high-quality photos using less light. Strong light can damage the delicate pigments used in art work. Tourists arriving Wednesday were busily taking pictures. \"Im very happy they changed the rule. Im taking as many as I can,\" said Michael Labrecque of Palm Harbor, Florida. He posed in the East Room with sons Madison, 11, and Mason, 9, as his wife Melinda looked on. Korey Richardson, 47, of San Jose, California, was on his first White House tour. \"Im taking tons of pictures, at least 30 so far,\" Richardson said. \"Ive already uploaded some to Facebook friends.\", Other visitors took photographs of a new sign that said: \"Photography is Encouraged.\", Still on the banned list are video cameras, including action camcorders, cameras with detachable lenses, tablets, tripods, monopods and camera sticks. Flash photography and live-streaming also remain prohibited. ", "Date": "20150701", "Author": "[Darlene Superville, Associated Press]", "Link": "http://www.chron.com/news/politics/article/White-House-to-allow-photos-social-media-on-6360063.php", "Title": "[Photos, social media now allowed on White House tours]"}