{"Content": "[CONCORD, N.H. (AP)  A federal judge on Thursday upheld a New Hampshire law the Libertarian Party argued could prevent its candidates from getting on the ballot. Libertarians sued Secretary of State William Gardner last year, challenging new limits on how long parties have to collect signatures to petition their way onto the ballot. State law requires a third party to collect signatures equal to 3 percent of the total votes cast during the prior election. Under the change, parties cant begin gathering signatures until Jan. 1 of the election year. In a ruling Thursday, U.S. District Court Judge Paul Barbadoro said the law creates reasonable restrictions that are justified by the states interest in requiring parties to demonstrate a sufficient level of support. \"Reasonable minds can and do disagree about the wisdom of this countrys present two-party political structure, and there is little question that, for better or worse, (this law) promotes that structure to at least some degree by making it marginally more difficult for third parties to gain ballot access in New Hampshire,\" he wrote. But the law does not impose a severe burden on ballot access, he said, and is therefore constitutional. In 2012, the Libertarian Party ran candidates for president, vice president, congressional seats and several state-level seats after collecting the necessary signatures. But it began the collection process in 2011. For the 2016 election, it would need to collect 14,864 signatures. Represented by the New Hampshire Civil Liberties Union, the party argued that the window for collecting signatures is even shorter than what the law specifies given New Hampshires harsh winters. Barbadoro was unpersuaded. He said snowstorms and bitter cold may limit petition gathering, but the party could use that time for fundraising and volunteer recruitment. Libertarians also argued that the time limit effectively prevents the party from meaningfully participating in the general election because it would have to use its limited resources on collecting signatures instead of campaigning and fundraising. Barbadoro said the major parties face a similar obstacle when they have to focus on primary elections that come less than two months before the general election. \"The challenge that political parties of all sizes face to manage multiple tasks at once, even in an election year  to both walk and chew gum, so to speak  is a simple and essential fact of American political life, not cause for heightened constitutional scrutiny,\" he wrote. Gilles Bissonnette, legal director of the New Hampshire ACLU, said the party is considering an appeal. \"This law limits voter choice and stacks the deck against candidates who  like roughly 40 percent of Granite Staters  dont belong to a major party,\" he said.]", "Date": "20150827", "Author": "[Holly Ramer, Associated Press]", "Link": "http://www.chron.com/news/article/Judge-rejects-Libertarian-Party-s-ballot-access-6469876.php", "Title": "[Judge rejects Libertarian Party's ballot access challenge]"}