{"Content": "[As we roll into the 2016 election, all the candidates should expect to be asked: What keeps you awake at night? They have many issues from which to pick. There has never been in recent decades such an abundance of complex international dilemmas: Islamic terrorism, rampant Middle East instability, Russian imperial designs in Ukraine and elsewhere, Chinas growing military muscle, and a potentially unstable leader in nuclear North Korea. All of these present possible nightmare scenarios for policymakers and average citizens alike. My years in the intelligence business, including as former CIA chief of Iranian operations, lead me to believe, however, that we will somehow muddle through these challenges over the next decade. What should give us sleepless nights is the challenge posed by the very real possibility of nuclear weapons proliferation, and the attendant threat of a nuclear event, which would rock modern society to its foundation. We have dealt with the threat of proliferation for some time, but the great power toolbox seems to be shrinking, just at a time when potential proliferation dovetails with a region wrought by intractable instability. The fate of the Iran nuclear deal could determine which way the scale tips in the Middle East. The highly controversial nuclear deal, the Joint Comprehensive Plan of Action, stalls Irans development temporarily. This is a C- deal; not great, not terrible. The Iranians will adhere to its terms through the 2016 presidential elections and until it reaps the benefits of lifted sanctions and the release of 100 billion in frozen assets. But in possibly three to five years time, if the past is any guide, Iran will likely begin cheating on the agreement. They will continue to develop nuclear support capabilities at sites we are not inspecting. Intelligence agencies have a poor record of divining Iranian intentions and actions. Moreover, should we suspect cheating, our ability to \"snap back\" sanctions will be virtually impossible in practice. Although King Salman seems to have signaled that Saudi Arabia unenthusiastically supports the Iran deal, his support depends on the snap back provision. If Iran cheats and sanctions fail to materialize, the Saudis will very likely make good on their threats to match Irans nuclear capabilities. Regional players such as Turkey, Egypt and the UAE could well follow suit. Although nuclear programs arent built overnight, Saudi Arabia certainly has the resources and access to expertise to make it a reality. Already Saudi Arabia has launched an ambitious nuclear power program stating its plans to build sixteen nuclear power reactors over the next two decades, which will lower barriers to a nuclear weapons capability. Turkey and Egypt are also in the planning stages, and the UAE has three of four planned reactors under construction. Rather than waiting on Iran to cheat, we should continue to place vigorous pressure on proliferation in the Middle East. The 2015 Nuclear Non-Proliferation Treaty (NPT) Review Conference just concluded in May without any progress in advancing the badly needed Middle East Nuclear Weapons Free-Zone. Whats more, there is no indication that this will be successfully addressed any time soon. This is not a high risk problem we can afford to muddle through. There are many dangerous geopolitical challenges that confront us today, but only a nuclear exchange represents an existential threat to all of us. As global instability increases along with nuclear aspirations in the Middle East, we must keep nuclear weapons proliferation at the top of our and our allies national security agendas, and work relentlessly to reduce the existing pool of nuclear weapons. Above all, as we go forward, we need to put down an indelible marker that no nation can develop nuclear weapons for its arsenal, and that we will do whatever it takes, including using military force to prevent it. This needs to be made crystal clear. If Iranians do not believe there is a red line on this issue, then we have a three- to five-year agreement, not a 15-year agreement. To fail to change Irans mindset, would be to set up the world for many sleepless nights. , Devine is a former CIA deputy director of operations, president of The Arkin Group and author of \"Good Hunting: An American Spymasters Story,\" published by Farrar, Straus and Giroux (2014) and Picador (2015). ]", "Date": "20150804", "Author": "[Jack Devine]", "Link": "http://www.chron.com/opinion/outlook/article/Devine-Fate-of-Iran-deal-makes-for-sleepless-6424839.php", "Title": "[Devine: Fate of Iran deal makes for sleepless nights]"}