{"Content": "[REUTERS/Dominick Reuter, Following a major loss in the2012 presidential election  including a 73-27 decimation among Latino voters  the Republican National Committee released anofficial \"autopsy\" of what went wrong and how the party could grow. \"If Hispanic Americans perceive that a GOP nominee or candidate does not want them in the United States (i.e. self-deportation), they will not pay attention to our next sentence. It does not matter what we say about education, jobs or the economy; if Hispanics think we do not want them here, they will close their ears to our policies,\" the autopsy report said. More than two years and one campaign later,its unclear ifthe Republican field is fully heeding its own partys advice. Sparked by the release of current front-runner Donald Trumps immigration plan, in the past week, multiple Republican candidates haveresurrected the term \"anchor baby,\" a pejorative slangtermpopularized by immigration hard-linersa decade ago. The term refersto children of non-US citizens who come to the US explicitly togivebirth to children that will then be granted US citizenship. The theory among those concerned about the practice is that it would be easier for the parents to obtain US citizenship but US law requires children of noncitizen parents to wait until age 21 tosponsor family members to legally come to the US. Those concerns arent exactly unfounded  federal authorities have amped up enforcement against the multimillion-dollar, so-called \"birth tourism\" business. But Republicans are treading a thin line with Latino voters.Republican front-runner Donald Trump, whose focus on combatting illegal immigration has fueled his campaign, has used the term to push an argument that the US should end so-called \"birthright citizenship.\", And onWednesday, former Florida Gov. Jeb Bush (R) called for greater enforcement of the border to prevent women from coming to the US, intending to give birth. Thats [the] legitimate side of this,\" Bush said during a radio interview in New Hampshire. \"Better enforcement so that you dont have these, you know, anchor babies, as theyre described, coming into the country.\", When pressed in New Hampshire on Thursday about whether the term was offensive, Bush refusedto back down. \"Do you have a better term?\" Bush asked a reporter who questioned his use of the term. \"You give me a better term, and Ill use it. Im serious.\", After Bushs remarks on Wednesday,Louisiana Gov. Bobby Jindal (R) said that not only was the term \"anchor baby\" not offensive  but that hes also \"happy\" to use it. REUTERS/Dominick Reuter, The comments come as most of theRepublican presidential candidateshave abruptly embraced the idea of ending birthright citizenship, which allows children born in the US to automatically become citizens. Following Trumps lead, eight of the lower-polling candidates have called for the constitutional right, which most legal scholars argue is enshrined in the 14th Amendment to the US Constitution, to be revoked. Democratshave pounced Republicans call to end birthright citizenship. And the repeated useof the \"anchor babies\" slur, which some have labeled \"vile\" and racist, has brought renewed vigor to their attacks. Democratic front-runnerHillary Clinton has been relentless, first attackingBush on Twitter on Wednesday over the comments. Tweet Embed:https://twitter.com/mims/statuses/634126361368653824Theyre called babies. https://t.co/VyJJA26OVl, When Bush didnt back down on Thursday, Clinton went on the offensive again:, Tweet Embed:https://twitter.com/mims/statuses/634426115436740608How about \"babies,\" \"children,\" or \"American citizens.\" https://t.co/ofxEG6Za00, The Democratic National Committee has also jumped into the fray, blasting out statements condemning the termsuse. \"The phrase anchor babies is so vile in Latino politics that we dont even have a word for it in Spanish,\" Pablo Manriquez, the director of Hispanic Media at the Democratic National Committee,told Business Insider. \"It is unconscionable that he and his fellow GOP presidential nominees follow Trump down the slippery slope of criminalizing children  let alone with such a shamelessly foul term.\", As TheNew York Times has reported, Latinovoters are expected to make up 11% of the 2016 electorate. Former Massachusetts Gov. MittRomney (R) won only 27% of Latino voters in 2012, a number that was particularly devastating because of the concentration of Latino voters in key swing states like Colorado. While some right-leaning Hispanic groupshave winced at the statements, not everyone thinks thatthe rhetoric will inflictlasting political damage. REUTERS/Dominick Reuter, Top Republican political strategist Liz Mair, who advised Wisconsin Gov. Scott Walker (R),told Business Insider it mighthave been smarter forBush to focuson border security. But she said that the use of the term \"anchor baby\" wontbe as damaging as Romneys high-profile call for immigrants living in the US without permission to \"self-deport.\", \"Self-deportation implied a lack of sympathy for a full 12 million people and their American offspring. Anchor babies implies a disdain for a much smaller group of people, and, by the way, one that probably encompasses quite a few non-Hispanic immigrants who in many cases come from richer countries and who are more educated ... who want to give their kids access to the US economy without ever having to deal with our ridiculous and almost unnavigable immigration system as it applies to better educated and skilled prospective immigrants,\" Mair said. Still, Republicanswho are perceived as being a better bet to win the nomination, however, are treading slightly lighter on immigration issues. Bush andWisconsin Gov. Scott Walker (R) have both said that beefing up border security and enforcing current laws could make altering the 14th Amendmentirrelevant.Sen. Marco Rubio (R-Florida) and Bush have both reluctantly admitted that they would not try to alter the 14th Amendment, saying that it would be difficult. And for his part, Rubio demurred when asked about so-called \"anchor babies\" during an interview on Thursday. \"When I talk about 13 million people in this country [illegally], I say 13 million human beings,\"he told CNBCs John Harwood Thursday. \"Anchor babies,\" Harwood said. \"People are talking about anchor babies.\", \"Those are human beings,\" Rubio responded. \"And ultimately, they are people. They are not just statistics. They are human beings with stories.\", Join the conversation about this story , NOW WATCH: This animated map shows how the states voted in every presidential election since the Civil War, See Also:]", "Date": "20150822", "Author": "[Maxwell Tani, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/Democrats-are-pouncing-on-a-vile-term-that-6456297.php", "Title": "[Democrats are pouncing on a 'vile' term that Republican presidential candidates won't stop saying]"}