{"Content": "[Sen. Rand Paul (R-Kentucky) unveiled a formal declaration of war against the jihadist group Islamic State (also known as ISIS or ISIL) on Monday morning. In a statement,Pauls office said he would introduce the resolution declaring war on ISIS when the Senate begins its next session in December. Paul, a libertarian-oriented conservative looking at a 2016 presidential bid, is among those who have repeatedly argued President Barack Obama has overstepped his constitutional authority by not having Congress authorize the US fight against the jihadists in Syria and Iraq. Instead, the White House has relied on resolutions passed by Congress in 2001 and 2002 that authorized the use of force in Iraq and Afghanistan. In addition to declaring war on ISIS, Pauls resolution would terminate the 2002 authorization of military force in Iraq and set an expiration date for the 2001 resolution that applied to Afghanistan. The White House has argued the earlier authorizations of military force can still be used since they were aimed at Al Qaeda, which was a forerunner to ISIS. Pauls resolution wasfirst reported by The New York Times on Sunday night. His office released the full text in its statement on Monday morning. In it, Paul cited several founding fathers to bolster his arguments. \"Whereas President George Washington, who presided over the Constitutional Convention, lectured: The Constitution vests the power of declaring war with Congress. Therefore no offensive expedition of importance can be undertaken until after they have deliberated upon the subject, and authorized such a measure,\" the resolution declared. Both the Obama administration and Paul have faced accusations of flip-flopping in the fight against the Islamic State. Obama, who vowed to withdraw troops from Iraq, has nevertheless gradually expanded the US militarys role in the effort to battle ISIS in both that country and Syria. Meanwhile, Paul has sent mixed signals about how much whether he supports any the US military intervention in the region and whether Obama is at fault for the growth of jihadist militants there. Paul told the Times the war authorization issue should be a rallying point for conservative critics of the Obama administration. \"Conservatives are mad at him about immigration. And theyre mad about him using executive authority on Obamacare,\" Paul said. \"But this is another example where he doesnt have much respect for Congress, and some conservatives dont quite get that.\", View Pauls full resolution below:, Whereas Article I, section 8, of the United States Constitution provides, The Congress shall have the Power to . . . declare war;, Whereas President George Washington, who presided over the Constitutional Convention, lectured: The Constitution vests the power of declaring war with Congress. Therefore no offensive expedition of importance can be undertaken until after they have deliberated upon the subject, and authorized such a measure.;, Whereas James Madison, father of the Constitution, elaborated in a letter to Thomas Jefferson: The constitution supposes, what the History of all Governments demonstrates, that the Executive is the branch of power most interested in war, and most prone to it. It has accordingly with studied care vested the question of war in the Legislature.;, Whereas James Madison wrote in his Letters of Helvidius: In this case, the constitution has decided what shall not be deemed an executive authority; though it may not have clearly decided in every case what shall be so deemed. The declaring of war is expressly made a legislative function.;, Whereas the organization referring to itself as the Islamic State has declared war on the United States and its allies; And, Whereas the Islamic State presents a clear and present danger to United States diplomatic facilities in the region, including our embassy in Baghdad, Iraq, and, Whereas the Islamic State presents a clear and present danger to United States diplomatic facilities in the region, including our embassy in Baghdad, Iraq, and consulate in Erbil, Iraq:, Now, therefore, be it Resolved by the Senate and House of Representatives of the United States of America in Congress assembled,, SECTION 1. SHORT TITLE. This joint resolution may be cited as the Declaration of War against the Organization known as the Islamic State. SEC. 2. DECLARATION OF A STATE OF WAR BETWEEN THE PEOPLE AND GOVERNMENT OF THE UNITED STATES AGAINST THE ORGANIZATION KNOWN AS THE ISLAMIC STATE. (a) DECLARATION.The state of war between the United States and the organization referring to itself as the Islamic State, also known as the Islamic State of Iraq and the Levant (ISIL) and the Islamic State of Iraq and Syria (ISIS), which has been thrust upon the United States, is hereby formally declared pursuant to Article I, section 8, clause 11, of the United States Constitution. (b) AUTHORIZATION.The President is hereby authorized and directed to use the Armed Forces of the United States to protect the people and facilities of the United States in Iraq and Syria against the threats posed thereto by the organization referring to itself as the Islamic State, also known as the Islamic State of Iraq and the Levant (ISIL) and the Islamic State of Iraq and Syria (ISIS). (c) RULES OF CONSTRUCTION. (1) SCOPE OF AUTHORITY.Nothing in this section shall be construed as declaring war or authorizing force against any organization, (A) other than the organization referring to itself as the Islamic State, also known as the Islamic State of Iraq and the Levant (ISIL) and the Islamic State of Iraq and Syria (ISIS); or, (B) based on affiliation with the organization referring to itself as the Islamic State, also known as the Islamic State of Iraq and the Levant (ISIL) and the Islamic State of Iraq and Syria (ISIS). (2) LIMITATION ON USE OF GROUND COMBAT FORCES.Nothing in this section shall be construed as authorizing the use of ground combat forces except, (A) as necessary for the protection or rescue of members of the United States Armed Forces or United States citizens from imminent danger posed by the organization referring to itself as the Islamic State, also known as the Islamic State of Iraq and the Levant (ISIL) and the Islamic State of Iraq and Syria (ISIS);, (B) for limited operations against high value targets; or, (C) as necessary for advisory and intelligence gathering operations. (d) WAR POWER RESOLUTION REQUIREMENTS. (1) SPECIFIC STATUTORY AUTHORIZATION. Consistent with section 8(a)(1) of the War Powers Resolution (50 U.S.C. 1547(a)(1)), Congress declares that this section is intended to constitute specific statutory authorization within the meaning of section 5(b) of the War Powers Resolution (50 U.S.C. 1544(b)). (2) APPLICABILITY OF OTHER REQUIREMENTS.Nothing in this resolution supersedes any requirement of the War Powers Resolution (50 U.S.C. 1541 et seq.). SEC. 3. REPEAL OF PRIOR AUTHORIZATION FOR USE OF UNITED STATES ARMED FORCES AGAINST IRAQ. The authorization for the Use of Military Force Against Iraq Resolution of 2002 (Public Law 107243; 50 U.S.C. 1541 note) is hereby repealed. SEC. 4. NO EXISTING AUTHORITY. The Authorization for the Use of Military Force (Public Law 10740; 50 U.S.C. 1541 note) does not provide any authority for the use of military force against the organization referring to itself as the Islamic State, and shall not be construed as providing such authority. SEC. 5. SUNSET OF 2001 AUTHORIZATION FOR THE USE OF MILITARY FORCE. The Authorization for the Use of Military Force (Public Law 10740; 50 U.S.C. 1541 note) shall terminate on the date that is one year after the date of the enactment of this joint resolution. SEC. 6. EXPIRATION. The declaration and authorization in this joint resolution shall expire on the date that is one year after the date of the enactment of this joint resolution. Join the conversation about this story , See Also:]", "Date": "20141124", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/Rand-Paul-Releases-Declaration-of-War-Against-ISIS-5914386.php", "Title": "[Rand Paul Releases Declaration of War Against ISIS]"}