{"Content": "[Caption, Close, The Texas Legislature has been inundated with gun bills since pre-filing for the current legislative session began, and this time they have a better chance of passing.See some of the most interesting. HB176 - Only Texas laws apply, HB206-Tax holiday for guns, HB223 - Pop Tart gun bill, Open Carry, HB216 - Lowers the CHL age requirement, HB278 - Open carry for attorneys, HB308 - Expandswhere a person with a CHL can carry a weapon, HB353 -Allows open carry for volunteer emergency services personnel, HB421 - Texas made weapons, SB124 - Penalties for giving guns to criminals, SB229 - Penalizes illegal firearm seizure, AUSTIN  The state House gave preliminary approval to drastically watered-down campus carry legislation late Tuesday, just minutes before opponents of the controversial bill would have been able to kill it by running out the clock. \"Passing legislation on the House floor is a high stakes game,\" said Rep. Trey Martinez Fischer, D-San Antonio, who tried to kill Senate Bill 11 through a series of legislative maneauvers. \"This is a super-priority of the leadership. You never know when the stakes are this high whether you can kill a bill.\", The bill would allow concealed carry licensees to tote their handguns in most college buildings and dorms. Currently, they are only allowed in public spaces, like quads. With a midnight deadline to pass Senate bills looming, the House approved the legislation by a vote of 101-47. The vote was triggered when lawmakers, who had filed more than 100 amendments to the bill, agreed to pull them down after the bill was amended to a point amenable to both Democrats and Republicans. The legislation the House approved late Tuesday was a far cry from the original sponsored by Sen. Brian Birdwell, R-Granbury. Lawmakers filed more than 100 amendments to the bill, most with the intention of delaying debate or rendering the legislation impotent. The House adopted just a handful of these changes before taking a vote, but in doing so dramatically changed the nature and scope of the legislation. Two amendments adopted by the House are signficant: one would require private universities in Texas to also implement the legislation - the Senate version required only public institutions to do so - and the second would allow each campus to decide where concealed handguns would be allowed. The bill must now be approved once more by a majority of House members to be considered finally passed. It would then head back to the Senate, which is not expected to agree with the changes made to its legislation. Differences would be ironed out in a conference committee, where opponents of the legislation expect there could be deadlock. If a majority of the conference committee members from both chambers cannot come to an agreement on the bill, it will not become law. Both Birdwell nor Straus denied further comment on the vote Tuesday. Martinez Fischer said he still believes there was still a good chance to defeat the legislation. \"This is not over til its over. The notion that we could take an entire day and fight campus carry until 11:35, 11:40 at night, its a significant accomplishment, to know there are negotiated changes to make this proposition much more difficult to become a legislative reality,\" he said. The campus carry legislation is one of just several bills filed this session to expand the rights of gun owners in Texas. Both chambers have passed legislation to allow licensed open carry of handguns, but that would not extend to college campuses. Proponents of the campus carry bill, including House sponsor Allen Fletcher, R-Tomball, said it is necessary to ensure college students have the right to defend themselves at all times. They have argued the proposal would not result in many additional guns on campuses, since current lawrequired licensees be 21 or older as well as pass a background check and written and range test. \"The idea that this bill will increase is any increase in violence is unfounded,\" Fletcher said during debate Tuesday night. \"We should not unarm them or disarm them.\", Many of Texas higher education officials, including University of Texas System Chancellor William McRaven, disagree. The retired admiral and former head of U.S. Special Operations Command has called the legislation unnecessary and potentially costly, and has said it could hurt institutions ability to recruit and retain top faculty. \"The presence of handguns on Texas campuses, where we would be one of fewer than 10 states to allow this conduct, may well cause faculty to be discouraged from relocating from other states,\" McRaven wrote in an April letter to House lawmakers. \"The intuitive answer is that the presence of concealed weapons will make us less competitive.\", If ultimately approved in the conference committee, the bill will head to the desk of Gov. Greg Abbott, who has promised to sign legislation that furthers gun rights in Texas. The legislation is one of just several bills filed this session to expand the rights of gun owners in Texas. Both chambers have approved House Bill 910, which would allow anyone with a concealed carry license to openly display their handgun in a hip or shoulder holster. Texas law already allows the open carry of long arms like rifles without any such licensing requirements, but open carry of handguns has been banned here for more than 125 years.]", "Date": "20150527", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/article/House-passes-campus-carry-6288148.php", "Title": "[Texas House passes watered-down campus carry bill]"}