{"Content": "[Caption, Close, The Republican Party (Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Donald Trump(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Jeb Bush(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Ted Cruz(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Chris Christie(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Ben Carson(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Donald Trump(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Jeb Bush(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Rick Perry(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Scott Walker(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Donald Trump(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Rand Paul(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Bobby Jindal(Republican), Ted Cruz(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. John Kasich(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Rick Perry(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Ben Carson(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Mike Huckabee(Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Marco Rubio (Republican)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. The Democratic PartyBased on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Hillary Clinton(Democrat)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Hillary Clinton(Democrat)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Bernie Sanders(Democrat)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Martin OMalley (Democrat)Based on Googles \"autofill\" responses, Google users must ask some interesting (and quite offensive) questions about the candidates running for president in 2016. Click through the following photos to learn more about the declared 2016 presidential candidates. Jeb Bush, Ben Carson, Chris Christie, Hillary Clinton, Sen. Ted Cruz, Carly Fiorina   Rick Perry  CAMPAIGN SUSPENDED, Rick Perry  CAMPAIGN... Marco Rubio, Sen. Bernie Sanders, Rick Santorum , Democrats hate Fox News. Republicans hate MSNBC. They both kind of grumble at CNN. But whichever party the candidates for president in 2016 are from, the one organization theyll be glad isnt asking any questions is Google. While giving a thought-out, nuanced response to \"where do you stand on immigration?\" in a 30-second sound bite may be difficult, answering \"did you beat your wife?\" or \"why is your face so orange?\" can be much harder. Both of these questions were posed by Googles \"autocomplete\" function when performing a basic search on candidates running for president in 2016. RELATED: 2016 candidate guide| Candidates net worth | Meet their spouses, According to Google, the predictive autocomplete feature provides answers without human involvement based an algorithm aimed at boiling down possible web options into a representative range of just a few. So of all the questions the web might want to know about Hillary Clinton, whether she worked at Walmart pretty much sums up them all  at least as far as Google is concerned. See some of the other wild (and often offensive questions) Googles autocomplete feature had for the candidates running for president in 2016.]", "Date": "20150806", "Author": "[John Boyd]", "Link": "http://www.chron.com/politics/election/national/article/Awkward-Google-autofill-questions-for-Donald-6429328.php", "Title": "[Awkward Google autocomplete questions for Donald Trump, Hillary Clinton and other 2016 candidates]"}