{"Content": "[Caption, Close, Supporters reach to great Republican presidential hopeful Donald Trump as he leaves a brief stop to speak to supporters and the media in Laredo, Texas, Thursday, July 23, 2015. Trump predicted Hispanics would love him, because as president he said hed grab jobs back from overseas and give more opportunity to those who live in the U.S. legally. Republican presidential candidate Donald Trump  talks to the media after arriving by helicopter at a nearby ballpark before Trump attended the Iowa State Fair Saturday, Aug. 15, 2015, in Des Moines. (AP Photo/Charlie Riedel), , Increase presence of ICE officers: Trump wants to triple the number of Immigration and Customs Enforcement workers, saying the agencys enforcement arm has barely grown in the past decade. Mandate e-verify: Donald Trump wants nationwide use of the online program that lets companies determine if their employees are eligible for work in the U.S. Mandatory deportation of all immigrants who commit a crime while illegally in the U.S.: The Republican candidate says the process \"can be aided by canceling any visas to foreign countries, which will not accept their own criminals, and making it a separate and additional crime to commit an offense while here illegally.\", Defund sanctuary cities: Trumpwants to eliminate federal grants to cities that dont want cooperate with federal law enforcement on immigration matters. Cooperate with local gang task forces: The measure asks that ICE officers work more closely with local police departments in raids on street gangs, and deport members that are in the country illegally. Increase prevailing wage for Bs: Saying Silicon Valley uses the B program as an excuse to pull in cheap foreign labor, Trump wants to force the hands of companies to look harder at \"the domestic pool of unemployed native and immigrant workers in the U.S. instead of flying in cheaper workers from overseas.\", Require companies to seek American workers first: Trump says visa programs like the B need to require qualified American applicants get hired before foreign labor. Enhanced penalties for overstaying a visa:Calling immigrants who overstay their visas a threat to national security, Trump wants violators to be subject to criminal penalties. End birthright citizenship: The proposal would eliminate automatic citizenship the children born in the U.S. whose parents are in the country illegally. Get Mexico to pay for a border wall: How will the real estate mogul accomplish this? His plan says that the U.S. will \"impound all remittance payments derived from illegal wages,\" increase or perhaps cancel temporary visas to Mexican CEOs and diplomats, raise the costs on border crossing cards, \"increase fees on all NAFTA worker visas from Mexico\" and up the fees at U.S. ports of entries from Mexico. Foreign applicants must be able to pay for themselves: Trump says he wants to \"end welfare abuse\" by requiring immigrants applying to come to the U.S. to show \"they can pay for their own housing, health care and other needs.\", Make it harder to obtain asylum in the U.S.: Trump wants to crackdown on alleged abuses committed by refuges and instead spend more money on refugee programs fro American children. Immigration moderation: \"Before any new green cards are issued to foreign workers abroad, there will be a pause where employers will have to hire from the domestic pool of unemployed immigrant and native workers.\", The Trump bandwagon has come to Texas. Two months after billionaire mogul Donald Trump polled at a lowly 2 percent in a University of Texas survey of Texas Republican voters, hes shot up to the top  same as where he is in the national polls. A new poll released Thursday puts Trump in the lead at 24 percent support among registered Republicans in Texas, pushing native son Ted Cruz into the second spot at 16 percent. The latest poll was commissioned by a group called the Texas Bipartisan Justice Committee, which hired the Florida-based Gravis Marketing firm to conduct the research. The poll is bad news for Cruz, who enjoyed a commanding lead with 20 percent in the June Texas Politics Project poll. Its also more bad news for former Texas Gov. Rick Perry, who was second at 12 percent in the previous poll. Perry dropped to 4 percent in the latest Texas poll, at the back of the pack with Scott Walker and Mike Huckabee. In third place after Cruz in the new poll is Ben Carson, at 12 percent. Jeb Bush follows at 9 percent, a troubling fourth place finish for an establishment favorite and scion of the Bush family in Texas. Carly Fiorina and Marco Rubio tied at 5 percent, and Rand Paul, another native son of Texas, didnt rate a mention at all.]", "Date": "20150820", "Author": "[Kevin Diaz]", "Link": "http://www.chron.com/news/politics/article/Trump-pushes-Cruz-out-of-lead-in-Texas-poll-6455215.php", "Title": "[Trump pushes Cruz out of lead in Texas poll]"}