{"Content": "[Caption, Close, President George H.W. Bush, left, and Will Farish hunt quail December 28, 1989  on the Lazy F Ranch near Beeville, Texas.PHOTOS: See more Texas hunting and fishing through the years ... Author Fred Gipson (center L) showing off trophies, 1960. An angler stands next to his catch, a 7 foot long tarpon caught near Palacios, Texas on September 3, 1923. Archie Underwwod (R) cotton man, Marvin Hall (L) state fire insurance commisioner; fishing at Lake Undy near Underwoods home, 1942. The game warden inspecting the hunters gun, 1946. Mrs. Parker giving a bird that her husband shot to another man who claimed it, 1946. A hunter raising his shotgun at a flock of doves, 1946. Author Fred Gipson with his son Mike and another boy looking at sunset before coon hunt, 1949. Fred Gipson and dogs running coon up a tree during hunt, 1949. Fred Gipson with dogs during coon hunt, 1949. Author Fred Gipson with his son Mike who was bitten twice during coon hunt, sniffling as his father looks at his leg, 1949. Exhausted Mike Gipson sleeping in car after 1949 coon hunt. Author Fred Gipson with his son Mike who is running to his mother who is waiting at the gate after coon hunt, 1949. Author Fred Gipson with his son Mike who is hugging his mother after coming home from coon hunt, 1949. Dogs Nettie and Duke greeting Author Fred Gipson and his son Mike before the coon hunt, 1949. Lugging back a deer, after an early morning hunting trip, 1952. A woman stands on a pier next to a 51 pound cobia caught on 30 pound line near Port Isabel, Texas on June 25, 1954. Oil workers fishing trout by light of oil flare at Shamrock Cove in the Gulf of Mexico in 1954. Oil workers fishing trout by light of oil flare at Shamrock Cove in the Gulf of Mexico in 1954. A group of quail hunters riding in a converted truck during a visit on a ranch in 1956. Boy shooting deer, 1960. Cooking fish after catching them at the beach, 1961. Surf fishing with net, 1961. Members of the Thrash and Burns families, and their friends hunt white-winged doves along a muddy, dirt road, Giddings, Texas, 1961. Dove hunt in Texas, 1961. Dove hunt in Texas, 1961. Dove hunt in Texas, 1961. Dove hunt in Texas, 1961. Dove hunt in Texas, 1961. Dove hunter with his kill, 1961. Dove hunt in Texas, 1961. Dove hunt in Texas, 1961. Dove hunt in Texas, 1961. Dove hunters enjoying the days kill, 1961. Child petting dead bird at dove hunt, 1961. Women plucking the killed dove, 1961. A man stands outside a gate from which the carcasses of dead animals hang, Texas, 1968. Dove hunters enjoying the days kill, 1961. Sue Borman hugs her sons Fred and Ed, both of whom wear camouflage jackets and hold shotguns, Houston, Texas, December 1968. The boys father, and Sues husband, is Apollo 8 astronaut Frank Borman. A boy stands holding a fishing rod and a 12 pound 6 ounce largemouth bass he caught on August 19, 1983 in San Augustine County, Texas, A man stands next to a 98 pound flathead catfish caught on June 2, 1986 near Lewisville, Texas and displayed on the back of a pickup truck. US Pres. George Bush dressed in hunting gear w. friend/oil heir William Farish, both sporting shotguns, on quail hunt at Lazy F ranch, 1989. US Pres. George Bush aptly dressed in hunting gear w. rifle in hand hunting quail on the Lazy F ranch in 1989. 103354 27: A child stands on a dead alligator during Gatorfest September 16, 1991 in Anahuac, TX. Hunters in Texas can only kill a certain number of alligators, must report each kill to the Texas Parks and Wildlife Department, and are paid by the foot by buyers for each alligator harvested. (Photo by Paul S. Howell/Liaison), A hunter shoots an alligator caught on a hook with meat during Gatorfest September 16, 1991 in Anahuac. Hunter Randy Riley holds a dead alligator in a marsh area during Gatorfest September 16, 1991 in Anahuac. A hunter shoots an alligator caught on a hook with meat during Gatorfest September 16, 1991 in Anahuac. The winning gator in the Great Texas Alligator Roundup is on display during Gatorfest September 16, 1991 in Anahuac. Workers process a dead alligator during Gatorfest September 16, 1991 in Anahuac. 8-yr-old Kemper Cowden with father, Lynn, during first deer hunt & male initiation, near the Pecos Bend ranch in 1991. Texas Governor George W. Bush takes a shot on the first day of Dove hunting season in Hockley, Texas, September 1, 1994. Texas Governor George W. Bush looks up at the sky for an opportunity on the first day of Dove hunting season in Hockley, Texas, September 1, 1994. Texas Governor George W. Bush looks for an opportunity on the first day of Dove hunting season in Hockley, Texas, September 1, 1994. Texas duck hunting, 1947. NASCAR Busch series driver and track announcer Wally Dallenbach, George Privett during the filming his outdoor show at Greystone Castle hunting lodge in Mingus, Texas in 2005. Ricky Stuart during the filming outdoor show at Greystone Castle hunting lodge in Mingus, Texas in 2005. NASCAR Busch series driver and track announcer Wally Dallenbach, hunting dogs during the filming his outdoor show at Greystone Castle hunting lodge in Mingus, Texas in 2005. NASCAR Busch series driver and track announcer Wally Dallenbach, hunting dogs, George Privett during the filming his outdoor show at Greystone Castle hunting lodge in Mingus, Texas in 2005. Hunting dogs during the filming outdoor show at Greystone Castle hunting lodge in Mingus, Texas, in 2005. Hunting dogs during the filming outdoor show at Greystone Castle hunting lodge in Mingus, Texas in 2005. Spring turkey hunters can enjoy the thrill of the hunt as well as the colors of the season. Many Texas turkey hunters employ a decoy or two to help draw a gobbler to within shotgun range. Spring turkey hunting provides memories but few are as visceral as encounters with rattlesnakes. A white bass is hooked with a lure on the Sabine River.plastic lure; bait, While any white bass weighing 2 pounds or more is a big specimen, this Sabine River beast weighs right at 3 pounds. Largemouth bass, some weighing as much as 8 pounds, lurk in the San Saba Rivers deeper, still-water stretches. This 10.4-pound largemouth tried unsuccessfully to swallow a 1.5-pound white bass and ended up floundering on the surface of a Texas reservoir. Guadalupe bass, such as this one taken from the Sabinal River by Mike Furtman, evolved in flowing, rocky shallow Texas rivers. Mature largemouths are efficient feeders with mouths built to take down big prey. Small jigs - 1/16- or 1/8-ounce - fished in swamp sloughs, bayous and backwaters can produce a variety of fish, including largemouth bass. Angler Ricky Culverhouse landed this 13.87-pound largemouth bass Sunday from Lake Waco. The spring season for Rio Grande turkeys in the South Zone opened Saturday and runs through May 2. The North Zone for Rio Grande turkeys opens April 3 and extends through May 9. The spring season for eastern turkeys runs April 12-25 in 42 East Texas Counties. Prospects generally are good, based on favorable habitat in prime areas and three consecutive years of good hatches. OUTDOORS / TALKING TURKEY. Republican Rep. Trent Ashby of Lufkin has authored a bill that would make the \"right to hunt\" a constitutional right in the state of Texas. The bill, introduced as HJR 61 on Wednesday, has already been lauded by the Dallas Safari Club in a posting on its official website. The amendment to Texas state constitution, they say, would protect the hunting and fishing way of life in the state. A portion of the text of the proposed joint resolution reads as follows:, The people have the right to hunt, fish, and harvest wildlife, including by the use of traditional methods, subject to laws or regulations to conserve and manage wildlife and preserve the future of hunting and fishing. Hunting and fishing are preferred methods of managing and controlling wildlife. Ashby proposes this constitutional amendment should be submitted to Texas voters at an election to be held next November for them to vote for or against. Ashby said Thursday via email that this amendment is needed to protect an important part of Texas heritage. \"The right to hunt and fish has recently come into question by several national anti-hunting and animal welfare organizations. Efforts to limit methods, seasons, and bag limits are constantly being pushed by these type advocacy groups,\" Ashby wrote. \"This measure, I feel, is the next prudent step to ensure future generations of Texans continue to have access to what I believe is a fundamental right,\" Ashby continued. Ashby says that 18 states across the country have added language in their respective state constitutions to guarantee the right of their residents to hunt and fish in a responsible manner.\"Nowhere more so than in Texas do we take greater pride in our rich sporting traditions, outdoor heritage, and effective fish and wildlife conservation efforts,\" Ashby added. In Texas, a state where deer and dove season are high holy events and salt water is life, this proposed constitutional amendment should make the top brass at Bass Pro Shops and Cabelas sleep easier at night.]", "Date": "20141218", "Author": "[Craig Hlavaty]", "Link": "http://www.chron.com/hunting-fishing/article/Texas-lawmaker-proposes-constitutional-amendment-5966220.php", "Title": "[Lawmaker wants 'Right to Hunt' in Texas constitution]"}