{"Content": "[Caption, Close, Pearland, Texas, players celebrate after winning the third-place baseball game against Mexico at the Little League World Series tournament, Sunday, Aug. 30, 2015, in South Williamsport, Pa. (AP Photo/Matt Slocum), HERO, Regarding \"HERO backers rebut restroom issue in ad\" (Page B2, Saturday), I have always been proud of Houstons wide diversity of citizens of all colors, all countries and all beliefs, until several months ago, when I received a petition that highlights a perceived danger that would result in womens rest rooms should the ordinance stand. The continuation of hate and fear of others who are different from us is very disturbing. Those who for \"religious\" reasons feel that this is a \"lifestyle choice\" perhaps should ask themselves what would Jesus think about this!, All humans are not born same. Some have single sex organs, some might have both male and female organs, some have strong feelings about not belonging to the sex they were assigned at birth. Ones gender is not a \"lifestyle\" choice, as some citizens insist. I have witnessed the suffering of prejudice, ridicule, hate, discrimination, physical battery and harassment toward others who are different from us. If you think that transitioning from male to female is easy, then you do not know the struggle of a transgender who might be risking his or her life every day when just going about his/her normal daily routine. HERO is about treating others as you would want to be treated. Debra Goode, Houston, , Brackish waters, Regarding \"Water pollution a likely danger to athletes health at Rio\" (Page C6, July 31), what was the International Olympic Committee thinking when it awarded the 2016 Olympics to Rio de Janeiro just because Brazil said it would clean up the water? I think that the health and safety of the athletes should be the IOCs paramount priority. Bruce Bender, Houston, , Just waiting, Regarding \"Echoes of Perot in Trump campaign\" (Page B12, Sunday), I want to thank Donald Trump for doing what few other Republican presidential candidates have been able to do in may years: Inspire the American people to gear up to get out and vote, whether at the booth, absentee or by mail. At the end, Ill say whats said to a fraternal or Masonic brother who has departed: \"Farewell my brother, farewell.\" , Ronald G. Mock, Houston, , Think differently, Regarding \"Mallet delivers strong effort in dress rehearsal\" (Page C4, Monday), since all three Texans quarterbacks, - Ryan Mallett, Brian Hoyer and Tom Savage- have been fairly successful in these pre-season games, why not let all three play every game?, They would still be very competitive since they are playing every game and working for their money. Wouldnt mixing it up throw the opponents off since the rhythm would be different with different quarterbacks throughout the game? Keep them guessing!, Peggy Lara, Houston, , Hip, hip hooray, Regarding \"Pearland rebounds by beating Mexico to claim third place\" (Page C5, Monday), as usual, the team from Pearland won the respect of everyone who watched them play. They, their coaches and parents always show a love of the game, win or lose. Thanks for another exciting season. Lucille Gallman, posted on HoustonChronicle.com]", "Date": "20150831", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/letters/article/Tuesday-letters-HERO-2016-Olympics-Texans-6476833.php", "Title": "[Tuesday letters: HERO, 2016 Olympics, Texans]"}