{"Content": "[Caption, Close, People participate in a protest in response to the grand jurys decision in the Eric Garner case in Times Square in New York, Wednesday, Dec. 3, 2014. The grand jury cleared the white New York City police officer Wednesday in the videotaped chokehold death of Garner, an unarmed black man, who had been stopped on suspicion of selling loose, untaxed cigarettes, a lawyer for the victims family said. (AP Photo/Seth Wenig), FILE - In this July 7, 2015, file photo, Gwen Carr holds a picture of her son Eric Garner during a news conference in New York with relatives of New Yorkers killed by police. New York City reached a settlement Monday, July 13 with the family of Garner for about $5.9 million, almost a year after the 43-year-old died in police custody. FILE - In this Aug. 23, 2014, file photo, demonstrators march to protest the death of 43-year-old Eric Garner in the Staten Island borough of New York. Nearly a year has passed since Garner had the encounter with New York City police that led to his death. Since then, his family has become national advocates for police reform and the department is changing how it relates to the public it serves. The Rev. Al Sharpton, center, is joined by Eric Garners mother Gwen Carr, left, daughter Erica Garner, second from left, son Eric Garner, third from left, daughter Emerald Snipes, second from right, and wife Esaw Snipes, as he speaks during a news conference, Tuesday, July 14, 2015, in New York. The family of Garner, a black man who died after being placed in a white police officers chokehold, discussed the $5.9 million settlement it reached with the city days before the anniversary of his death. Eric Garners mother Gwen Carr, center, is joined by his daughter Emerald Snipes, left, and wife Esaw Snipes, as she speaks during a news conference, Tuesday, July 14, 2015, in New York. The family of Garner, a black man who died after being placed in a white police officers chokehold, discussed the $5.9 million settlement it reached with the city days before the anniversary of his death. Eric Garners daughter Erica Garner, center is joined by his mother Gwen Carr, left,  second from left, daughter Emerald Snipes, second from right, and wife Esaw Snipes, as she speaks during a news conference, Tuesday, July 14, 2015, in New York. The family of Garner, a black man who died after being placed in a white police officers chokehold, discussed the $5.9 million settlement it reached with the city days before the anniversary of his death. New York City Mayor Bill de Blasio pauses as he speaks during a memorial service for Eric Garner at the Mount Sinai United Christian Church in the Staten Island borough of New York Tuesday, July 14, 2015, just short of a year after Garner died while being taken into custody by New York City police officers. A $5.9 million settlement in Garners death, a black man who died after being placed in a white police officers chokehold, was reached with the city this week, days before the anniversary of his death. NYPD Staten Island Borough Commander Edward Delatorre, left, stands during a vigil with Esaw Snipes, right, wife of Eric Garner, and  second from right, Gwen Carr, mother of Garner, during a memorial service for Eric Garner at the Mount Sinai United Christian Church in the Staten Island borough of New York Tuesday, July 14, 2015, just short of a year after Garner died while being taken into custody by New York City police officers. A $5.9 million settlement in  Garners death, a black man who died after being placed in a white police officers chokehold, was reached with the city this week, days before the anniversary of his death. Benjamin Carr, stepfather of Eric Garner, is embraced by Cardinal Timothy Dolan during a memorial service for Eric Garner at the Mount Sinai United Christian Church in the Staten Island borough of New York Tuesday, July 14, 2015, just short of a year after Garner died while being taken into custody by New York City police officers. A $5.9 million settlement in  Garners death, a black man who died after being placed in a white police officers chokehold, was reached with the city this week, days before the anniversary of his death. Right is Rev. Al Sharpton and in background upper right is New York City mayor Bill de Blasio. NEW YORK (AP)  The relatives of an unarmed black man who died after being put in a white police officers chokehold said Tuesday that the nearly $6 million settlement they reached with the city wasnt a victory as they continued pressing for federal civil rights charges. \"The victory will come when we get justice,\" Eric Garners mother, Gwen Carr, said a day after the $5.9 million settlement was announced. \"Justice,\" added one of Garners children, Emerald Snipes, \"is when somebody is held accountable for what they do.\", The settlement came nearly a year after the 43-year-old Garner died, having repeatedly pleaded \"I cant breathe!\" as Officer Daniel Pantaleo took him to the ground with an arm around his neck. Garner lost consciousness and was pronounced dead later at a hospital. Garner, who was heavyset and had asthma, had refused to be handcuffed after being stopped on suspicion of selling loose, untaxed cigarettes on a Staten Island street. The encounter, caught on an onlookers video, spurred protests about police treatment of black men. Coupled with police killings of unarmed black men elsewhere in recent months, Garners death became a flashpoint in a national debate about relations between police and minority communities. The Rev. Al Sharpton said at a news conference Tuesday with Garners relatives that \"I cant breathe spurred the national movement\" and it wont end \"until we change how policing goes.\", The city medical examiner found the police chokehold contributed to Garners death. But Pantaleos lawyer said the officer had used a permissible takedown maneuver known as a seatbelt, not a chokehold, banned under New York Police Department policy. A grand jury declined to indict Pantaleo. The U.S. Department of Justice and the U.S. attorneys office in Brooklyn are investigating whether theres evidence to warrant charges that the officer deliberately violated Garners civil rights. Such cases are rare after grand jury inaction or acquittal at state level. Police Commissioner William Bratton declined to comment Tuesday on the Garner case. The settlement came before any lawsuit was filed, though the family had filed notice of its intention to sue. The city did not admit any liability. Mayor Bill de Blasio, speaking Tuesday night at a church prayer service in honor of Garner, said Garner had not died in vain and his death could be an agent of change in the relationship between the police and communities. \"This is a new chapter in our relationship between the police and our communities,\" de Blasio said. \"That will make us a better people. That will make us a more just city. That will make us a safer city.\", De Blasio, who is white and is married to a black woman, spoke at the church the night of the grand jury decision not to indict the police officer. At that time, he connected personally to Garners death, speaking of how he talked to his biracial son about being careful in his dealings with police. Those comments sparked outrage from police unions, who accused de Blasio of fostering an anti-police sentiment. When two officers were killed by a gunman in December, some officers turned their backs on the mayor at their funerals. De Blasio made sure to be inclusive in his remarks on Tuesday. \"All lives matter,\" he said, before explicitly saying that while it should be self-evident, it must still be said that \"Black lives matter\" and, after he praised the police, \"Blue lives matter.\", ", "Date": "20150717", "Author": "[Colleen Long and Jonathan Lemire, Associated Press]", "Link": "http://www.chron.com/news/us/article/Family-to-discuss-5-9-million-settlement-in-6382988.php", "Title": "[Family: Settlement isn't victory in NY police chokehold case]"}