{"Content": "[The right to vote is one of democracys most precious gifts. And protecting that right - by ensuring the integrity of the voter rolls - is one of our public officials highest responsibilities. Thats why the voters of Texas need to know that our voter-registration process works. And it does work. Look at Harris County. Voter registration in Harris County is at its highest level ever. As of December 2014, there were 2,058,981 registered voters in Harris County. This is a result of an extraordinary outreach program, a growing population and the hard work of the countys nearly 3,000 well-trained volunteer deputy voter registrars.  , The Voter Registrars office conducted outreach and training sessions for volunteers throughout Harris County to reach out to every corner of the county. County officials work closely with area high schools and community organizations to increase voter registration awareness. Officials work hard to listen to the voters and address their concerns. State Rep. Celia Israel, D-Austin, recently filed a bill (House Bill 76) to change state law to allow applicants to complete a voter registration application via the Internet. The bill further would require the Secretary of State to develop rules on how to implement the program. Israels bill does not define the procedure. The public has little idea how the new system would work, and no way to assess its integrity. Proponents of online voter registration point out 20 states currently have such systems in place. But that means that 30 states do not. They also point out cost savings with online registration but cannot accurately identify what those would be in Texas. There is an assumption that online voter registration would require fewer temporary employees. But county officials work year-round to maintain the voter roll, handling changes of address, name changes, deaths and voluntary cancellations. The office of Voter Registrar handles a high volume of telephone calls and includes personnel who speak four different languages. Which of these employees does Rep. Israel hope to let go?, The current voter registration system in Texas works and works well. Virtually no case has come to light of someone wanting to register within the applicable deadlines and being unable to do so. Those who wish to register can exercise several options. Eligible citizens may register at the Texas Department of Public Safety, many social service organizations, local libraries, post offices and any of the 16 Harris County Tax Assessor-Collectors branch offices. Potential voters also may print an application from many websites to be completed, signed and mailed. The Voter Registrars experienced and nonpartisan professionals cross check data to ensure accuracy of each application. Officials code voters for the proper voting precinct, verify the data submitted and mail out a voter certificate. This both protects the registration process and provides new voters with relevant information, including the voters eligible jurisdictions. During the most recent federal election, the states election management system temporarily shut down on Election Day, almost crippling local voter activity. The Secretary of States office is scheduled to undergo a major software upgrade this year. This is long overdue but full of unknowns. It would be very risky to implement a new system for online voter registration with this pending upgrade, especially leading into a presidential election. Our highest priority is to maintain the integrity of the voter roll. The current system works. Lets stick with it. Sullivan is the tax assessor-collector and voter registrar of Harris County.]", "Date": "20150507", "Author": "[Mike Sullivan]", "Link": "http://www.chron.com/opinion/outlook/article/Sullivan-Current-voter-registration-methods-6249420.php", "Title": "[Sullivan: Current voter registration methods working well]"}