{"Content": "[Caption, Close, President Barack Obama speaks at the Greater Boston Labor Council Labor Day Breakfast, Monday, Sept. 7, 2015, in Boson. Obama will sign an Executive Order requiring federal contractors to offer their employees up to seven days of paid sick leave per year. President Barack Obama speaks at the Greater Boston Labor Council Labor Day Breakfast, Monday, Sept. 7, 2015, in Boson. Obama will sign an Executive Order requiring federal contractors to offer their employees up to seven days of paid sick leave per year. President Barack Obama is greeted by Massachusetts Gov. Charlie Baker, left, as he arrives at Boston Logan International Airport in Boson, Monday, Sept. 7, 2015, to speak at the Greater Boston Labor Council Labor Day Breakfast in Boston. Obama will sign an Executive Order requiring federal contractors to offer their employees up to seven days of paid sick leave per year. Sen. Elizabeth Warren, D-Mass. applauds as President Barack Obama speaks at the Greater Boston Labor Council Labor Day Breakfast, Monday, Sept. 7, 2015, in Boson. Obama will sign an Executive Order requiring federal contractors to offer their employees up to seven days of paid sick leave per year. President Barack Obama is greeted by Boston Mayor Marty Walsh, left, Massachusetts Gov. Charlie Baker, right, and his wife Lauren Baker, center, as he arrives at Boston Logan International Airport in Boson, Monday, Sept. 7, 2015, to speak at the Greater Boston Labor Council Labor Day Breakfast in Boston. Obama will sign an Executive Order requiring federal contractors to offer their employees up to seven days of paid sick leave per year. President Barack Obama waves as he walks from the White House and to board Marine One helicopter, Monday, Sept. 7, 2015, in Washington, for the short trip to Andrews Air Force Base and onto Boston where he will speak at the Greater Boston Labor Council Labor Day Breakfast. President Barack Obama greets members of the crowd after speaking at the Greater Boston Labor Council Labor Day Breakfast, Monday, Sept. 7, 2015, in Boson. Obama will sign an Executive Order requiring federal contractors to offer their employees up to seven days of paid sick leave per year. President Barack Obama speaks at the Greater Boston Labor Council Labor Day Breakfast, Monday, Sept. 7, 2015, in Boson. Obama will sign an Executive Order requiring federal contractors to offer their employees up to seven days of paid sick leave per year. President Barack Obama speaks at the Greater Boston Labor Council Labor Day Breakfast, Monday, Sept. 7, 2015, in Boson. Obama will sign an Executive Order requiring federal contractors to offer their employees up to seven days of paid sick leave per year. BOSTON (AP)  Courting unions on Labor Day, President Barack Obama denounced Republicans for a \"constant attack on working Americans\" and said he was using his executive power to force federal contractors to give paid sick leave to their employees. Obama was met with resounding applause at a major union rally and breakfast in Boston on Monday when he said he had signed the executive order aboard Air Force One as he flew in to mark Labor Day. He said Republicans who claim the mantle of middle-class protectors are talking big, but they \"have to walk the walk.\", Obama said opponents of his economic policies \"wont let facts or evidence get in their way.\", \"You just wait, you look up at the sky and prosperity will come raining down on us from the top of whatever high-rise in New York City,\" he said sarcastically. \"But thats not how the economy works.\" He added that the GOPs mindset has been \"wrecking the economy for a long, long time.\", The Labor Day gesture to workers groups came as Obama works to smooth over tensions with the labor movement over his trade agenda. Major unions are opposing Obamas push for sweeping new trade deals with Asia and Europe, with some threatening to work against Democrats who voted to support those talks in Congress. Unions have warned that the deals could lead to the widespread job elimination. Obama has signed a law providing money to retrain workers if their jobs get shipped overseas. Under the executive order, employees working on federal contracts gain the right to a minimum of one hour of paid leave for every 30 hours they work. Stretched out over 12 months, thats up to seven days per year. The order will allow employees to use the leave to care for sick relatives as well, and will affect contracts starting in 2017 - just as Obama leaves office. Business groups said Obamas order would make it harder for small businesses to retain federal contractors and could hinder economic growth. \"Once again President Obama is using the federal procurement system to do something it was never been designed to do: usurp the legislative authority of Congress to determine appropriate workplace policies,\" said Randy Johnson, senior vice president of the U.S. Chamber of Commerce. The White House wouldnt specify the cost to federal contractors to implement the executive order. The Labor Department said any costs would be offset by savings that contractors would see as a result of lower attrition rates and increased worker loyalty, but produced nothing to back that up. Vice President Joe Biden echoed Obamas theme in a march with an influential labor leader, AFL-CIO President Richard Trumka, who introduced Biden in Pittsburgh as a \"brother\" and \"a champion of working men and working women.\" A few along the parade route chanted \"run, Biden, run,\" in a reference to Bidens ongoing deliberations about whether to run for president in 2016. In Boston, Obama was flanked by prominent Democrats such as Sen. Elizabeth Warren and a giant banner reading \"Workers and Community\" in red, white and blue. Labor leaders Randi Weingarten and Mary Kay Henry joined Obama for the flight on Air Force One. In the corridors of the hotel hosting the breakfast, boxes of campaign signs could be spotted bearing the name of Democratic presidential candidate Bernie Sanders, who opposes the trade deals. Obama chose Labor Day to announce the executive order as he works to enact what workplace policies he can before his presidency ends despite resistance in Congress to laws hes proposed. The push has reverberated on the 2016 campaign trail, with Democrats seeking a distinction with Republicans on whos most supportive of the middle class. The president didnt mention any of the 2016 candidates by name, but invoked a number of their policies to challenge claims that they care about workers. In a reference to Wisconsin Gov. Scott Walker, he remarked incredulously that one GOP candidate had \"said busting unions prepared him to fight ISIL,\" an acronym for the Islamic State group. Obama chose Massachusetts as the backdrop for his Labor Day message because voters in the state approved a similar paid leave policy state-wide. The law took effect July 1 and is expected to affect 900,000 workers who previously received no paid leave, the White House said. Roughly 44 million American private sector workers dont get paid sick leave, the administration said. The White House said it couldnt estimate how many federal contractors dont offer paid leave. ", "Date": "20150910", "Author": "[Josh Lederman, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Obama-observes-Labor-Day-extends-contractors-6488929.php", "Title": "[Courting unions on Labor Day, Obama pushes paid sick leave]"}