{"Content": "[Caption, Close, Vice President Joe Biden waves after speaking in Detroit, Thursday, Sept. 17, 2015. Biden spoke on how federal investments are helping Detroits economic revitalization efforts. Vice President Joe Biden speaks in Detroit, Thursday, Sept. 17, 2015. Biden spoke on how federal investments are helping Detroits economic revitalization efforts. Vice President Joe Biden exits after touring a new bus in Detroit, Thursday, Sept. 17, 2015. Biden spoke on how federal investments are helping Detroits economic revitalization efforts. Vice President Joe Biden tours a new bus with Detroit Department of Transportation driver Brian Miller in Detroit, Thursday, Sept. 17, 2015. Biden spoke on how federal investments are helping Detroits economic revitalization efforts. Vice President Joe Biden speaks with Detroit Detroit Department of Transportation driver Brian Miller in Detroit, Thursday, Sept. 17, 2015. Biden spoke on how federal investments are helping Detroits economic revitalization efforts. COLUMBUS, Ohio (AP)  In any other year, a pair of speeches by Vice President Joe Biden on transportation and sexual assault would raise few eyebrows in the political world. This isnt any other year. Bidens visits to Ohio and Michigan on Thursday were closely watched for signs hes gauging his support in two states that typically play a key role in electing the next president. As he considers making a late entrance into the 2016 presidential race, his usual vice presidential appearances have taken on the air of campaign stops, with supporters cheering for him to run. The vice president didnt tip his hand at either stop, eschewing talk of the presidential race for wonkier discourse about infrastructure upgrades and economic development. The closest to a reminder of the political speculation swirling around him came, ironically, at an event in Columbus on the scourge of sexual violence on American college campuses. At Ohio State University  where President Barack Obama kicked off his victorious re-election campaign three years ago  more than a thousand students packed into a gymnasium and chanted \"Joe, Joe, Joe\" as they waited for Biden to take the stage. When he did, he was met with thunderous cheers as he saluted students and showed off his scarlet tie evoking the schools official colors. He got a bit of celebrity boost, too, from \"Hunger Games\" star Josh Hutcherson, who flew from Los Angeles with Biden aboard Air Force Two to attend the rally. \"Every single woman on the plane all of a sudden had no interest in talking to me,\" the vice president quipped. The sprawling public university of more than 60,000 students announced new steps to prevent sexual violence, including mandatory awareness training for all freshmen starting next year. The school plans to dedicate a team to investigating allegations of sexual misconduct and to partner with a local sexual assault hotline. Biden told the students it was never appropriate to ask a domestic violence victim what she said or did that led to being victimized. \"The question we as a nation have we to ask is what made him think he had a right to raise his hand,\" Biden said, his voice rising to a roar. Its a theme resonating in this years Democratic presidential primary. Earlier this week in Iowa, Hillary Rodham Clinton put forth her plan to try to end sexual assault on campuses. Like the rally at Ohio State, Bidens visit to Detroit tapped into an issue that has long been central to Bidens identity as a political leader  and could play an equally important role in his message to voters should he choose to run for president. Detroit Mayor Mike Duggan joined Biden at the citys transportation headquarters, where the vice president got behind the wheel of one of the citys new hybrid and clean diesel buses, purchased with help from federal grants. Standing in front of the extra-long bus with a city driver, Biden said hed once been a school bus driver  but wasnt sure he could handle one like this. \"This is cool, man,\" said the vice president. Ohio and Michigan are among a handful of states that are competitive for Democrats and Republicans, although Michigan has trended Democratic in recent presidential elections. Obama won both in 2008 and 2012. The vice president has been deeply immersed in deliberations with his family and advisers about whether to enter the 2016 race. In recent days, Biden has described his lingering doubts about whether he has the emotional strength to mount a viable campaign just months after his sons death. Hes also started to speak out more directly against the Republican candidates he would face if he won the nomination. After denouncing front-runner Donald Trump on Tuesday for promoting a \"sick\" anti-immigrant message, Biden mocked Republicans who question global warming during a visit to California. \"I think if you pushed them, theyd probably deny gravity as well,\" he said. ", "Date": "20150917", "Author": "[Josh Lederman, Associated Press]", "Link": "http://www.chron.com/news/politics/article/For-Biden-no-respite-from-the-2016-spotlight-6510533.php", "Title": "[In key 2016 states, Biden hears chants of 'Joe, Joe, Joe']"}