{"Content": "[Caption, Close, Texas A&M Aggies Yell leaders try to get the Aggie fans into the spirit in the first quarter of a college football game at Bryant-Denny Stadium, Saturday, Oct. 18, 2014, in Tuscaloosa. Aggies lost the game 59-0.   ( Karen Warren / Houston Chronicle  )PHOTOS: Famous former Texas A&M Aggies ... Everyone knows about Johnny Manziel, but check out who else the 12th Man is proud to call its own. Four-time Grammy winner Lyle Lovett was a member of the Texas A&M Class of 1979. Thats Texas Gov. Rick Perry as a Texas A&M Yell Leader with the most famous Aggie of them all, Reveille. Martha Madison starred in the soap opera Days of Our Lives. Kandace Krueger was crowned both Miss Texas USA and Miss USA in 2001. President George H.W. Bush  seen here with another Aggie alumni, Texas Gov. Rick Perry  is the namesake to the Bush School of Government and Public Service at Texas A&M University. His presidential library also is housed at the university. Henry Cisneros, former San Antonio mayor and former federal HUD secretary. Actor Rip Torn was a cadet at Texas A&M. Robert Earl Keen is a big name in Texas country. Roger Creager is one of the biggest stars in Texas country. Christian singer Chris Tomlin attended Texas A&M in the early 1990s. Chuck Knoblauch was a clutch MLB player, especially with the New York Yankees. Cleveland Browns quarterback Johnny Manziel may be the most famous former Aggie football player  at least for the moment. , Former Houston Texans head coach Gary Kubiak greets another ex-Aggie, Miami Dolphins quarterback Ryan Tannehill. Former Houston Texans head coach Gary Kubiak greets another... Ray Childress was an ex-Houston Oiler. Jason Castro performs during the finale of 2008s \"American Idol\" season. CNN correspondent and talk-show host Roland Martin is a Houstonian, too. The late Bum Bright once owned the Dallas Cowboys. Khris Middleton now hoops it up for the Detroit Pistons. Olymic shot putter Randy Matson with the gold medal he won at the Olympics in 1968. Director Tim McCanlies attends the screening of When Angels Sing during the 2013 SXSW Music, Film + Interactive Festival  at the Paramount Theatre on March 10, 2013 in Austin. At least seven Texas A&M alumni have earned a Medal of Honor. An attempt by Texas A&M University student government to keep election runoffs from turning nasty may have been implemented only on paper, leaving many votes uncounted, observers say. The issue has come to light in recent days with an appeal to the Student Government Association over this years senior yell leader election. The association conducts annual elections to pick two juniors and three seniors to the roster of traditionally male cheerleaders, known at A&M as yell leaders. Among the most famous former yell leaders is former Texas Gov. Rick Perry. On Wednesday, the associations court held an appeal hearing over whether to accept the 2015 senior yell leader election results or to conduct a recount, according to the Bryan-College Station newspaper The Eagle. A decision was expected within 48 hours of the hearing, the paper said. In 2013, the A&M Student Senate opted to institute an instant runoff system, rather than the more widely used delayed runoff, to help prevent inevitable political shenanigans, said Scott Bowen, a 2013 A&M graduate who was speaker of the student senate his senior year. The change was geared more to the election for student body president than yell leaders, said Bowen, now a Houston engineer who acknowledged that he has not been involved with university elections since he graduated. Under the instant runoff system, voters rank their choices but only their No. 1 choice is counted, Bowen said. \"Whoever has the least votes would be eliminated,\" he said by phone Friday. \"Whoever voted for that person as their first-place choice would have that vote reassigned to their second place.\", The process would continue until one candidate had a full majority. \"By doing that, you could be sure that between the two candidates left (at the end), the one who ended up with a majority was the one most favored by the most peopole,\" Bowen said. Apparently, however, the instant runoff system was implemented in 2013 without the universitys Information Technology staff agreeing that votes could be tabulated that way, The Eagle reported. As a result, voters No. 2 and No. 3 choices for senior yell leader were not counted. The problem did not come to light sooner because no one questioned the results, according to The Eagle. A request for comment from the Student Government Association was not immediately returned Friday. , rm designed to prevent]", "Date": "20150227", "Author": "[Carol Christian]", "Link": "http://www.chron.com/news/houston-texas/texas/article/Possible-recount-pending-over-missing-votes-in-6105788.php", "Title": "[Possible recount pending over 'missing votes' in A&M senior yell leader election]"}