{"Content": "[AUSTIN - Several Texas politicians, including Gov. Greg Abbott and GOP presidential hopeful U.S. Sen. Ted Cruz, announced Monday that they would return or redirect donations from the head of a white supremacist group that apparently helped inspire the man accused of killing nine black churchgoers in Charleston, S.C. Abbott said he would donate $1,000 from Earl Holt III of the Council of Conservative Citizens to the Salvation Army in Austin. Cruz, R-Texas, initially said he would return Holts contributions. His office later put out a statement saying the senator had reconsidered and would use the $11,000 to help support the families of the Charleston shooting victims. A Texas Supreme Court justice and at least two state lawmakers also said they would donate or return contributions from Holt, whose group became a lightning rod after an apparent online manifesto attributed to the accused killer, Dylann Roof, mentioned the Missouri-based Council of Conservative Citizens. Holt, who said his group cannot be held responsible Roofs actions, has given $65,000 to Republican candidates over the years, according to Federal Election Commission reports. Among the recipients were a number of White House hopefuls, including Cruz, U.S. Sen. Rand Paul of Kentucky and former Pennsylvania Sen. Rick Santorum. Like Cruz, Paul and Santorum said they plan to give Holts donations to a fund created by Charleston Mayor Joe Riley to help the victims families. Roof is charged with nine counts of murder in last weeks shooting at the Emanuel African Methodist Episcopal Church in Charleston. All nine of the victims were black, and authorities said the killings were being investigated as a hate crime. Mix the races, The young man is credited with an online diatribe written before the shootings saying that he has \"never been the same\" since he did a Google search for crimes by black people against white people. The manifesto said the search turned up the Council of Conservative Citizens website with \"pages upon pages\" of purported such murders. Holt, whose contributions list him as having a Longview address, said his group does not advocate illegal activities. The council \"is hardly responsible for the actions of this deranged individual merely because he gleaned accurate information from our website,\" said Holt, its president. The Missouri-based group opposes \"all efforts to mix the races of mankind.\", Holt variously describes himself as a retiree and a \"slumlord\" in his FEC filings. He also has given money to a host of Republican candidates and organizations, from U.S. Rep. Louie Gohmert of Tyler to the Senate Conservatives Fund. The politicians rush to distance themselves from the Holt cash demonstrates the difficulty faced by campaigns, which may vet those who raise large sums but remain unfamiliar with smaller donors. Abbott, for example, has received tens of millions of dollars in donations over a number of years that eclipse the two $500 donations from Holt in 2013 and 2014. When controversy arises, the candidates have little choice but to cut their losses, political consultants said. \"You need to return it,\" said Republican consultant Matt Mackowiak. \"There is little to no incentive to keeping contributions from someone like that, in that kind of situation. Id be surprised if anyone would keep the contribution.\", Mackowiak said he previously had not heard of Holt or his group. \"I dont think anyone would argue that because you receive a check from someone that you are sort of giving some type of seal of approval to their beliefs or their background,\" he said. \"I dont really fault anyone for the situation. I think the only thing you can do is respond to it quickly.\", Other contributions, Others who said they would return money or make charitable donations included state Sen. Konni Burton, R-Colleyville; state Rep. David Simpson, R- Longview; and Texas Supreme Court Justice Jeff Brown. Simpson said he would return money from Holt, whose contribution lists Longview as his address. He gave Simpson some $1,250, including $500 in 2013. In addition, Simpson said he personally would make a donation to help the South Carolina church and affected families. Unknown donor, \"I dont know the man that well. He has supported me. I just dont agree with, at least, the comments Ive read,\" said Simpson, who is planning to run for state Senate. \"I believe we are all made in Gods image. ... I dont want to have anything to do with running down other people, other races.\", Burton said in a statement, \"I will be personally donating $750 to a charity or local Charleston church to provide assistance to the families affected by this horrific violent act.\", Justin Dudley, Browns consultant, said his campaign is donating last years $250 donation from Holt to the Wounded Warrior Project. The donation came in response to a large direct-mail appeal, Dudley said. The Austin American-Statesman reported Monday that state Rep. Matt Schaefer, R-Tyler, said he did not know who Holt was but would donate $250 from his campaign to Texas Right to Life. Reporter Bobby Cervantes and the Associated Press contributed to this story.]", "Date": "20150622", "Author": "[Peggy Fikac and Kevin Diaz]", "Link": "http://www.chron.com/news/politics/texas/article/Pols-say-they-will-give-to-charity-after-donor-6342844.php", "Title": "[Politicians say they will give to charity after donor linked to SC gunman]"}