{"Content": "[ African-Americans and Latinos are losing economic ground when compared with whites in the areas of employment and income as the United States pulls itself out of the Great Recession, the latest State of Black America report from the National Urban League says. The annual report, called One Nation Underemployed: Jobs Rebuild America, noted that the underemployment rate for African-American workers was 20.5 percent, compared with 18.4 percent for Hispanic workers and 11.8 percent for white workers. Underemployment is defined as those who are jobless or working part-time jobs but desiring full-time work. The report also said African-Americans are twice as likely as whites to be unemployed. The unemployment rate for blacks was 12 percent in February, compared with 5.8 percent for whites. Many Americans are being left behind, and that includes African-Americans and Latinos who are being disproportionately left behind by the job creation that we see, National Urban League President Marc Morial said. Despite the dismal numbers, an analysis by The Associated Press-NORC Center for Public Affairs Research found African-Americans significantly more optimistic about their future standard of living than whites, regardless of income level, education or partisanship. Overall, 71 percent of blacks surveyed in the 2012 General Social Survey agreed that they have a good chance of improving their standard of living, outpacing the share among whites by 25 percentage points. The survey found high optimism even among blacks who say racism is a cause for economic inequality. Such findings illustrate a level of optimism in the African-American community and its important to lift that up, said La June Montgomery Tabron, president and CEO of the W.K. Kellogg Foundation, which released similar findings this week in separate research. The National Urban League is pushing for several economic measures, including an increase in the minimum wage, an issue being debated in Congress.  Democrats backed by President Barack Obama want to force election-year votes on gradually increasing todays minimum to $10.10 by 2016, an effort that seems likely to fail in Congress. Republicans generally oppose the proposal, saying it would cost too many jobs. More must be done in post-recession America to try to help people and help communities close these gaps, Morial said. The National Urban League derives its numbers from an equality index that is based on nationally collected data from federal agencies including the Census Bureau, the Bureau of Labor Statistics, the National Center for Education Statistics and the Centers for Disease Control and Prevention. With full equality with whites in economics, health, education, social justice and civic engagement set at 100 percent, the National Urban League said this years equality index for blacks stands at 71.2 percent, a slight improvement over last years index of 71.0 percent. However, the economic portion of the index dropped from 56.3 percent to 55.5 percent. The equality index for Hispanics improved to 75.8 percent, compared with 74.6 percent last year, while the Hispanic economics index declined from 60.8 percent to 60.6 percent. The report for the first time ranked large American cities from most equal to least equal when it comes to income equality and unemployment equality. Memphis, Tenn. ranked the most equal for Hispanics when it came to unemployment equality, because in that city the Latino unemployment rate was only 3.8 percent, compared with a 6.5 percent unemployment rate for whites. For blacks, the Augusta-Richmond County, Ga. metropolitan area was most equal, with a 13.3 percent unemployment rate for blacks and an 8.5 percent unemployment rate for whites. When it came to income, the most equal city for blacks was Riverside-San Bernardino-Ontario, Calif. where the median black household income was $44,572, while the median white household brought in $57,252. For Hispanics, Lakeland-Winter Haven, Fla. was most equal, with median Hispanic income of $39,434 and median white income of $44,014. ", "Date": "20140403", "Author": "[JESSE J. HOLLAND]", "Link": "http://www.seattletimes.com/business/report-says-blacks-latinos-losing-economic-ground/", "Title": "[Report says blacks, Latinos losing economic ground]"}