{"Content": "[ Maybe, conservatives are done with dog-whistle politics. After all, National Rifle Association chief Wayne LaPierre traded his dog whistle for an air horn at a recent gathering of the gun faithful in Washington, D.C. I have to tell you, he said, eight years of one demographically symbolic president is enough. Subtle, it was not. Still, as insults go, it was a rather neatly crafted twofer. On the one hand, it demeaned the nations first African-American president and welcomed the day the White House is, well  de-Negro-fied. On the other hand, it also demeaned the candidate seeking to become the nations first female-American president and promised to save the White House from, well  woman-ification. Evidently, LaPierre wants America to get back to normal, normal being defined as when the president is white and male. So out come the air horns, blatting Woman! Woman! Woman! seeking to reduce a former senator and secretary of state to the sum of her chromosomes. Now the race is apparently on to see who will be first to tag the former law professor, senator and secretary of state with which crude, sexist epithet. Oh, the suspense. The blazing irony is that conservatives have at least two demographically symbolic candidates vying for their favor: Marco Rubio, a Cuban-American senator from Florida, and Ted Cruz (does no one else see Joe McCarthy staring back when they look at this guy?), a senator from Texas whose father was born in Cuba. So the normal LaPierre seeks is threatened, regardless. Not that he is the only one tripped up by Clintons woman-ness. Consider, a recent piece from Time magazine, which argued that Clinton is the perfect age to be president because, at 67, she is postmenopausal. Granted, the essay, by a doctor named Julie Holland, flatters Clinton and women of her age, assuring us that, having been freed from the cyclical forces that dominated the first half of her life, she emerges with the experience and self-assurance to be president. Still, could you not have happily gone the rest of your days without contemplating Hillary Clintons cyclical forces? More to the point, can you imagine such an essay being written about a male candidate? Marco Rubio is 43, which means hes probably already had his first digital prostate exam. Will anyone analyze how that factors into his readiness for the presidency? Rick Perry is 65. If he jumps in, will anyone speculate on how possible issues of erectile dysfunction might inform his foreign policy?, Heres the thing about demographically symbolic presidents and candidates: They tend to function like Rorschach inkblots. Meaning that what we see in them reveals more about us than them. Where Barack Obama is concerned, the right-wing panic over birth certificates and fist bumps and the left-wing tendency to idealize and canonize his every exhalation revealed the rank bigotry and messy irresolution beneath our post-racial happy talk. Where Clinton is concerned, these very early indications suggest her woman-ness will likewise be a minefield for friend, foe and media  even more, perhaps, than in 2008. And thats not to mention Cruz and Rubio. Who do you think will be the first to wear a sombrero to a Cruz rally in misguided solidarity or to tell the Miami-born Rubio to go back where he came from?, Point being that in America, markers of identity  gender, race, ethnicity  have a way of becoming identity itself, of blinding us to the singular, individual one in front of us. And campaigns tend to magnify that failing. To put that another way: Strap in. Its going to be a very long 19 months until the 2016 election. Even so, one thing is already clear, and it should please the rest of us, if not Wayne LaPierre. Normal is gone for good.]", "Date": "20150419", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/would-someone-tell-the-nra-normal-is-gone-for-good/", "Title": "[Would someone tell the NRA normal is gone for good?]"}