{"Content": "[ WASHINGTON  In recent months, Harold Ickes, a longtime ally of Hillary Rodham Clinton, has helped organize private meetings around the country with union leaders, Clinton backers and Democratic strategists. The pressing topic: Who will step up to be the Democrats megadonors in the 2016 presidential race?, Republican contenders already have hundreds of millions of dollars in commitments from a stable of billionaires, including a Wall Street hedge-fund executive, a Las Vegas casino magnate, a Florida auto dealer, a Wyoming investor and, of course, Kansas-born billionaires David and Charles Koch. But none of the biggest Democratic donors from past elections  for example, Chicago investor Fred Eychaner, climate-change activist Tom Steyer and entertainment mogul Jeffrey Katzenberg  have committed to supporting Clinton on nearly the same scale. No one has stepped forward as the savior, said Matt Bennett, a longtime Democratic consultant. The leading super PAC backing Clinton, Priorities USA Action, has won commitments of only about $15million, Democrats involved with the group said. And while the lack of a competitive race for the Democratic nomination gives Clinton time to catch up with GOP rivals, her allies plan to push the partys wealthiest donors for more money than most have ever given. In planning sessions and one-on-one meetings with donors, Ickes, who is a Priorities USA board member, and other Clinton supporters are discussing how to raise up to $300million for Democratic outside groups. That is almost twice as much as Democratic super PACs and other outside groups spent to help re-elect President Obama in 2012, when conservative super PACs far outspent liberal ones. This ambitious goal will require the emergence of a new class of at least 20 Democratic donors who can give $5million or even $10million each. Ickes said recruiting them would not be easy. Our side isnt used to being asked for that kind of money, Ickes said. If you asked them to put up $100million for a hospital wing, theyd be the first in line. The hurdles begin with the candidate. While Clinton has committed to meeting with potential super PAC donors, people close to her say she has not dealt with the kind of big-donor courting that has framed the early months of the Republican race. She is also navigating the rules on what a candidate may do to help super PACs, which, since the Supreme Courts Citizens United decision in 2010, can raise unlimited funds from individuals and corporations but may not coordinate with candidates. Fearful of violating the rules, Clinton plans to limit her direct appeals to donors. Those appeals also threaten to undercut her message on the corrupting influence of unchecked money in politics. She has called for repealing Citizens United and has said that changing the countrys campaign-finance system to get unaccountable money out of it once and for all would be among her top priorities as president. Clinton also faces a perception that neither she nor her husband, former President Bill Clinton, is lacking cash. Together, they earned at least $30million in the past 16 months. And Bill Clintons aggressive courting of donors, in the White House and now as head of the Bill, Hillary & Chelsea Clinton Foundation, has been an enduring source of controversy. A bigger problem, Democratic fundraisers and super PAC officials acknowledge, is that they are out of practice. The peak for donations to Democratic outside groups was 2004, when hedge-fund billionaire George Soros and insurance executive Peter Lewis poured close to $40million into groups opposing President George W. Bush. The groups collected almost $200million. There will definitely be some sticker shock, said Michael Vachon, a political adviser to Soros. Ted Cruzs super PAC raised $30million in a few weeks, Vachon added, and he has no more chance of being president than I have. The conservative network overseen by the Kochs, composed largely of nonprofit groups that do not reveal their donors, is planning to raise $889million for its political and philanthropic efforts through 2016. Sheldon Adelson, the Las Vegas casino developer who spent $93million in 2012 to support GOP candidates, is likely to invest a similar sum this time. Robert Mercer, a hedge-fund executive, has helped bankroll super PACs supporting Cruz, a Texas senator. Norman Braman, a billionaire Miami auto dealer, plans to spend $10million or more to support Sen. Marco Rubio of Florida. Foster Friess, a mutual-fund investor in Wyoming who spent more than $2million in 2012 on Rick Santorums White House bid, is supporting him again this time.]", "Date": "20150530", "Author": "[ERIC LICHTBLAUand NICHOLAS CONFESSORE]", "Link": "http://www.seattletimes.com/nation-world/democrats-need-richer-donor-list-to-keep-up-with-gop/", "Title": "[Democrats need richer donor list to keep up with GOP]"}