{"Content": "[ Update: 11:52 a.m. It now appears Rubios Bellevue event has been postponed. A posting on a Facebook page of local Rubio supporters said the Florida senator must remain in Washington D.C. for a scheduled U.S. Senate vote related toIrans nuclear program. A Rubio spokesperson confirmed the cancellationin an email. No new date for the event has been announced. Original post:, Republican 2016 presidential candidate Marco Rubio will raise campaign cash Thursday in Bellevue. Rubio, a U.S. Senator from Florida, plans to attend a 3:30 p.m. round-table discussion that will cost donors $2,700 per person or $5,400 per couple  followed by a reception at $1,000 per person. The events are to be held at Steelhead Partners, a Bellevue investment firm, according to a copy of the invitation. Hosts include the firms co-founder, Brian Klein, former state GOP chair Diane Tebelius, and local venture capitalist Matt McIlwain. No public events have been announced and organizers did not immediately respond to requests for more details. Rubios visit follows a similar low-key, money-raising stopover by a man who was his political mentor, former Florida Gov. Jeb Bush, who also is traveling the country to raise money for 2016 presidential run  even though he has not declared as a candidate. Bush held a $12,500 per person fundraiser for his Right to Rise super PAC in Seattle last month. Rubio, 43, entered the 2016 race last month, repeatedly calling fora New American Century in an effort to contrast himself with the dynasties represented by 2016 rivals, including Bush and Democrat Hillary Clinton. Bush and Rubio topped a crowd of declared or likely GOP presidential contenders in a recentNBC News / Wall Street Journal poll of Republican primary voters. While hes not well known in Washington state, a Rubio presidency could spell trouble for the states legalized marijuana system, if his recent comments are any indication. In an interview last month with conservative talk show host Hugh Hewitt, Rubio was asked about Washington and Colorados legalized marijuana systems. Hewitt asked whether Rubio would enforce the federal drug laws and shut down the marijuana trade?, According to a transcript of the interview, Rubio responded: Yes. Yes, I think, well, I think we need to enforce our federal laws. Now do states have a right to do what they want? They dont agree with it, but they have their rights. But they dont have a right to write federal policy as well. It is, I dont believe we should be in the business of legalizing additional intoxicants in this country for the primary reason that when you legalize something, what youre sending a message to young people is it cant be that bad, because if it was that bad, it wouldnt be legal.]", "Date": "20150505", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/marco-rubio-to-raise-cash-in-bellevue-thursday-politics-nw-now/", "Title": "[Marco Rubio postpones Thursday fundraiser in Bellevue]"}