{"Content": "[ This is a look for the blue Puget Sound region at the economics of the commanding Republican majority in Congress after this past Tuesdays election. I hope red-leaning voters will tag along and see if I do a fair job. The first thing to remember is that this is not the Republican Party of old. President Nixon funded the Great Society, established the Environmental Protection Agency, experimented with price controls and said, Were all Keynesians now. Even President Reagan worked with Democratic House Speaker Tip ONeill and repeatedly raised taxes. Todays Republicans are deeply committed to an agenda of economic freedom. Fear them or love them, they are deeply principled. I am also skeptical of pundits that say gridlock will continue so Republicans can gain an advantage for 2016, or that the election was largely meaningless. As political blogger Andrew Sullivan put it: This is a victory in favor of more governing paralysis. The energetic Republican base and the most influential Republicans in Congress want action. It just wont necessarily be what the mainstream consider important. The biggest example is immigration reform. Republicans consider any such policy as amnesty. They want 12 million illegal immigrants deported or to go home on their own. Whether policies to make that happen could overcome an Obama veto is another matter. But we wont see reform. And millions of Americans already competing for too few jobs may see that as a good thing. Energy and climate change will be profoundly affected. Approval of the long-delayed Keystone XL pipeline, running 1,660 miles from Alberta to Texas, is now virtually guaranteed. Democrats will be unlikely to duplicate the discipline shown by Republicans in the Senate minority. So some Democrats can be peeled off to join the GOP on this vote and probably others. Also, the Senate can bypass filibusters on reconciliation of budget laws with a simple 51-vote majority. The Obama administration has hardly been hostile to the oil industry, as seen with the increased production from fracking. But Congress will push to open more areas to drilling. It also has a host of tools, including funding, to defeat the Environmental Protection Agencys plans to limit carbon emissions. The probable chairman of the Senate Committee on Environment and Public Works is Sen. James Inhofe of Oklahoma. He says climate change is a hoax. Any efforts to limit greenhouse-gas emissions or switch subsidies from fossil fuels to clean energy are dead. The Export-Import Bank, the government credit agency that is a great help to Boeing, faces the biggest hurdle in its 80-year history. Many Republicans, especially in the House, want to close it as unnecessary government meddling and industrial policy. We will see if Boeings enhanced workforces in such red states as South Carolina can change minds. The new Congress is also a big win for Wall Street, even though many tea-party Republicans claim to hate the financial titans. But with Utah Sen. Orrin Hatch likely to take over leadership of the financial-services committee, look for changes to the Dodd-Frank law and other post-meltdown laws and rules. Two likely targets are the Volcker Rule on derivatives and the Consumer Financial Protection Agency. Republicans have been highly critical of both. If you see a pattern, Iowa Sen.-elect Joni Ernst summed it up, calling for an agenda that supports rolling back Washington-created job-killing regulations that are crushing small business. Big business, too  even though it is booking record profits. Thus the REINS Act, championed by Sen. Rand Paul, would require every rule set by the executive branch with an economic impact of $100 million or more to be approved by lawmakers. The new Congress may ease up on the so-called sequester, which demands across-the-board spending cuts. A big reason: The majority will want more military spending. This could be good news for the areas military installations. Critics say sequester has done the most damage to military readiness and modernization. But dont expect a Reagan-like increase in general spending to boost the economy. Todays Republicans are united in stopping what they see as overspending and over-borrowing. The unprecedented austerity of recent years, which has held back demand, will continue or become even more severe. The Puget Sound regions cities are in for difficult days. The red-blue divide is more rural, exurbs and some suburbs vs. urban areas than between states. As a result, programs to help cities will suffer. Expect a serious effort to kill Amtrak, a longtime passion of Sen. John McCain. While I say every form of transportation is subsidized and Amtrak has never been more popular and needed, Republicans see it differently. That Amtrak cant pay its own way and should be eliminated, the profitable Northeast Corridor sold to the private sector. The Federal Reserve can expect much tougher scrutiny. Paul and many tea-party Republicans want the Fed audited and subject to tighter political control. Expect new moves to lower taxes. If inequality exists, Republicans argue that it is a result of intrusive government holding back business. The influential Heritage Foundation, the conservative think tank, wants a flat tax. It could happen. Blue trade supporters can take some comfort. The new Senate will be more likely to approve fast-track authority for the president on the Trans-Pacific Partnership. I think most of these policies will be disastrous. But, as the late Mo Udall said, The voters have spoken  the bastards. You may reach Jon Talton at jtalton@seattletimes.com]", "Date": "20141108", "Author": "[NULL]", "Link": "http://www.seattletimes.com/business/what-we-might-see-from-a-gop-led-congress/", "Title": "[What we might see from a GOP-led Congress]"}