{"Content": "[ WASHINGTON  As debt jumped over the past decade, economists warned that retiring baby boomers might soon overwhelm retirement programs, swamp the federal budget and keep the debt unusually high as far as the eye can see. That day has come and the answer now apparently is get used to it. After years of debt that normally amounted to about a third of the nations total economy, it has spiked to more than 70 percent with no relief in sight. The nonpartisan Congressional Budget Office bases its estimate on current law, and it sees the debt levels approaching 80 percent in 2025. President Obamas proposed fiscal 2016 budget envisions the nations debt at 74 percent of the size of the U.S. economy in 10 years. But thats if he gets all the changes he wants, including large tax increases. Thats highly unlikely. Just eight years ago, this number was about 35 percent, about the historical average. The latest forecasts suggest Washington now expects debt held by the public to remain at levels twice the historical average for the foreseeable future. Dont lay all the blame on boomers for the U.S. debt, White House Budget Director Shaun Donovan voiced in early February what other politicians might well have thought. He likened the wave of retiring baby boomers  Americans born between 1946 and 1964  to the proverbial pig in a python that bulges inside the reptile as it is swallowed, digested and passed through. This demographic shift through the middle 2030s is a huge fiscal challenge to get through, and so what is sort of acceptable in the next 20 years is different from what might be acceptable long term, Donovan said. Got that?, It means they think high debt now is OK. The federal government will continue running deficits to pay for Medicare, Social Security and other programs that will be strained even more by the boomers retirement. The most immediate consequence is paying more interest, a lot more. In 10 years, the United States will pay about $827 billion in interest on the swelling debt. Thats almost four times what the government pays now. And by 2025, it will eclipse the $711 billion in projected spending for defense, as well as the $689 billion projected for all nondefense spending outside the entitlements such as Social Security. Under President George W. Bush, the debt rose from $3.4 trillion in 2000 to $5.8 trillion in 2008, fighting two wars without raising taxes to pay for either and actually lowering taxes. Bush began emergency spending to deal with the Great Recession, and that continued under Obama. Debt went from $7.5 trillion in 2009 to $12.6 trillion in 2014. And all this spending happened right before the first boomers began hitting official retirement age in 2008. We were entering into a fiscally challenging time, and the Great Recession added to it and made it more difficult, said Robert Bixby, head of the budget watchdog group Concord Coalition. If you go back to 2007, nobody would have been talking about (debt equal to) 74 percent of GDP as the new norm. Nobel Prize-winning economist Paul Krugman is among the few unconcerned. In a Feb. 2 New York Times column, he said the economy was too weak to fix long-term imbalances and applauded Obamas proposals to boost spending. In todays economic and political environment, long-termism is a cop-out, a dodge, a way to avoid sticking your neck out, Krugman charged. And its refreshing to see signs that Mr. Obama is willing to break with the long-termers and focus on the here and now. That irked Alice Rivlin, a former vice chair of the Federal Reserve and the first director of the Congressional Budget Office, in 1975. She noted recently that the debt as a share of the economy has tripled since 1975, when it was 24 percent. I dont care what Paul Krugman says, that disturbs me, Rivlin said. Aside from crowding out government and military spending, high debt leaves the nation vulnerable if theres a future natural disaster, terror attack or financial crisis. Theres less room to issue more government bonds without buyers demanding a higher rate of return to offset default risk. That in turn would make it even more costly to borrow to pay off past bills. You have another big shock, and it just ratchets up again, Bixby said. The trend line is for it to go up on autopilot because of the structural deficit we have in our fiscal policy. As a liberal think-tank economist, Jason Furman criticized the mounting debt and deficits of the Bush administration. Now Obamas head of the White House Council of Economic Advisers, he argues against focusing on the debt number. What we had set from the very beginning of this administration as our fiscal goal was getting the deficit under 3 percent of GDP. That wasnt picked as some arbitrary number, Furman said. That was picked because thats where you need to be in order to have your debt falling as a share of the economy. We look more at the trajectory and ask ourselves is it sustainable for the economy. The difference between what the government spends and what it takes in  the deficit  fell by about 70 percent in Obamas first six years, and was equal to 2.8 percent of the size of the overall economy in the fiscal year that ended Sept. 30. The CBO sees it returning to 3 percent in 2019 and 4 percent in 2025, the White House 2.5 percent in 2025. The number that I would focus on is where we are relative to the historical average on the deficit, insisted Furman, noting its now the 40-year average. Either way, this will be a challenge in the 2016 elections, especially anyone repeating the White House pig in a python to explain away the elevated debt. Said Bixby: I think that would be a tough message on the campaign trail  We have higher debt, live with it. ]", "Date": "20150308", "Author": "[Kevin G. Hall]", "Link": "http://www.seattletimes.com/nation-world/crush-of-retired-baby-boomers-to-keep-us-debt-high-for-years/", "Title": "[Crush of retired baby boomers to keep U.S. debt high for years]"}