{"Content": "[ LIMA, Peru  President Ollanta Humala, in an effort to avoid controversy, has kept public appearances to a minimum during his first two months in office. Other members of his highly eccentric family, however, do not share the presidents low-key style. His father, Isaac Humala, is the outspoken founder of ethnocacerism, which argues that Andean natives like him and his children are superior to descendants of the whites who colonized Peru and still dominate its politics and economy. Natives, he asserts, should run the country. Brother Antauro Humala is serving a 19-year prison sentence for leading an attempt to overthrow the government in 2005, when an attack on a police post in the highlands city of Andahuaylas claimed the lives of four police officers and two attackers. He laments that the president abandoned the militant socialist ideals they once shared in order to get elected. The government is every day more beholden to the right, he said. Plenty of world leaders have relatives who embarrass them, but few extended first families compare with the Humalas. Other relatives creating discomfort for the president include Ollantas oldest brother, Ulisses, who urged people ahead of the election not to vote for Ollanta, saying hed be disastrous for the country. And younger brother Alexis traveled to Russia just before inauguration day July 28 to talk to heavyweights in that countrys fishing and natural-gas industries. The president-elect said the trip took him completely by surprise, and it still hasnt been explained. Ever since Ollanta Humala appeared on the political scene in Peru, he has had this kind of shadow of familial accompaniment, political analyst Nelson Manrique said. The Humala familys peculiarities played prominently in the 2006 presidential race, when his parents described homosexuals as immoral and spooked Perus upper class with talk of a class war. Humala narrowly lost to Alan Garcia in a runoff. Humalas relations largely stayed out of the public eye during the latest campaign. But after the election, brother Antauro gave of jailhouse interviews in which he insulted leading members of his brothers government. He called Prime Minister Salomon Lerner, of Jewish origin, a foreigner, and suggested Lerner was really running the government. Antauro Humala also called the president of Congress inept. Meanwhile, the presidents father, Isaac, said: Im sorry that the presidents advisers and ministers are sabotaging him. Lerners response: It must be painful for the president, more than an annoyance, to have this kind of disquiet in his family. Ollanta and Antauro Humala became public figures in 2000 when they declared disobedience to then-President Alberto Fujimori as his government was collapsing and marched in a bloodless mutiny into the mountains from their base in Locumba. Their relationship changed five years after the bloody Andahuaylas revolt, which Antauro claims had his brothers full backing. He said Ollanta hasnt visited him since he was imprisoned. But that hasnt stopped the 48-year-old former army major from taking partial credit for his brothers victory. It would have been impossible for Ollanta Humala to rise to power if we hadnt rebelled in Locumba and if we didnt rebel in Andahuaylas, he said. It was a necessary sacrifice. The president, 49, clearly is uncomfortable with such statements. I love my brother but dont share his ideas, he told CNN last month. Isaac Humala, who fathered seven children in his marriage to Elena Tasso and three outside it, sought to instill in all his offspring his doctrine of ethnocacerism, which asserts the superiority of the copper-hued race that descends from the Incas. He made his children read leftist thinkers such as Jose Carlos Mariategui and the poet Cesar Vallejo, turning dinner-table discussions into colloquia. The 81-year-old lawyer reared them for greatness, particularly the brothers who figured third and fourth in birth order and whom he persuaded to opt for military careers. A few years ago, he described for a TV interviewer his ambitions for the two sons who would become soldiers. A military career is a direct route to power, he said, because with 60 armed men you can seize the [presidential] palace. Ollanta Humala would rise to lieutenant colonel and military attach in South Korea before being retired, just before the Andahuaylas uprising, over his perceived disloyalty to then-President Alejandro Toledo. In Isaac Humalas eyes, Andahuaylas made his son Antauro a hero. The role that Antauro plays in a society of tragedy is of martyrology, he said. Isaac Humala acted as his sons lawyer in a bid to overturn the murder conviction. The Supreme Court last month reduced the sentence from 25 years to 19 years but rejected a request for a retrial on reduced charges of sedition. Antauro claims he never fired a shot. Although he receives spotty reviews from family members, President Humala wins high marks from the public for his low-key, no-nonsense approach to governing. He enjoys a 65 percent approval rating among Peruvians, according to a September Ipsos Apoyo poll. Peruvians are pleased he is making good on promises to create programs that benefit the poor without abandoning free-market-friendly policies. A whopping 88 percent of respondents said the president should not pardon his brother Antauro. But that doesnt seem to deter Antauro, who says his Ethnocacerist Party will field a candidate in 2016 presidential elections, when Ollanta Humala is constitutionally barred from running for re-election. In addition to having native Andeans run the government, the party platform argues for putting people convicted of corruption before firing squads. Ollanta Humala may be in the presidency but hes less free than I who am imprisoned, he said. In a way, in prison I am freer than Ollanta in the government palace. Associated Press reporter Frank Bajak contributed to this report.]", "Date": "20111013", "Author": "[FRANKLIN BRICENO, Carla Salazar]", "Link": "http://www.seattletimes.com/nation-world/contentious-relatives-a-handful-for-humala-perus-new-president/", "Title": "[Contentious relatives a handful for Humala, Perus new president]"}