{"Content": "[ President Obama may have done a big favor for a Seattle startup last week. Inadvertently. By weighing in on the net-neutrality debate, the president made the geeky subject a dinner-table topic for America as we head toward the 2016 election. Well now spend a year or more debating whether and how to regulate broadband, preserve the equal-access character of the Internet and limit the control telecom companies have over their networks. As we hash this out, a little outfit in Pioneer Square called Syntonic may be part of the conversation.  , Quietly started two years ago by veterans of RealNetworks, Syntonic is now emerging  and getting national media attention  with technology that adds a new dimension and complexity to the net-neutrality discussion. The 15-person Pioneer Square company is building tools that content providers, nonprofits and corporations can use to provide free access to mobile broadband networks. These tools enable new business models to cover the cost of data delivery. A movie studio, for instance, could use Syntonic to cover the data costs when people view its trailers on a mobile device. A newspaper or magazine could offer a service bundle with free access: pay an extra dollar per month, and downloads wont count against monthly data limits. Phone companies have just started dabbling with this approach, called sponsored data or zero rating  as in pay zero rates to access certain content. AT&T announced in January that it was working with Syntonic and a few other startups in the space. T-Mobile US took it further last summer when it announced a music promotion that enabled customers to stream an unlimited amount of music to their devices without having it count against their monthly data allowance. Net-neutrality advocates see this as a violation of the principle that all online content and data be treated equally. Making some content free in effect creates preferential treatment and could be moving toward pay to play content delivery, they say. People often may see this as a more acceptable breach of net neutrality; its still a breach of net neutrality, said Jeremy Malcolm, senior global-policy analyst at the Electronic Frontier Foundation. Yet even net-neutrality advocates like EFF are hard-pressed to oppose all applications of sponsored data. Wikipedia is working with phone companies to cover the cost of data charges when visiting its site, to ensure universal access to its repository of knowledge; its starting with developing countries where data costs can be prohibitive. Facebook is doing something similar in Africa and covering the cost of data access for wireless-phone customers in several countries. But imagine the reaction if, say, the GOP paid to provide free access to Fox News  but not CNN or MSNBC  on AT&T phones and tablets. Subsidizing the cost of mobile-data access may not seem like a big deal in prosperous cities like Seattle, where even kids may have iPhones with generous data plans. But 25 to 30 percent of the population is quite sensitive to data costs and the prospect of paying for overages, according to Chetan Sharma, an Issaquah-based wireless analyst. They could be motivated to try new services that provide free access to apps and services.  Syntonic Chief Executive Gary Greenbaum said hes trying not to take sides in the net-neutrality debate but he argues  vociferously  that consumers benefit from the service his company is building. I think what were doing is without a doubt beneficial to consumers, he said. Were enabling new business models, new modes of access, for consumers that might not have had access. Syntonic also has a philanthropic example. Its working with the Highline School District on a program providing laptops to upper-grade students. The laptops have wireless broadband so students can use education apps at home, where they might not have Internet access. The district is using Syntonic to manage and track which websites students can access. Basically, the district is sponsored access to certain types of content, via Syntonic software plugged into the carriers network. Greenbaum, who most recently worked on networking at Microsoft, after working at RealNetworks in its heyday, called Syntonics product connectivity as a service. Our connected services platform is something thats in the network and its cloud-managed, he said. That is the core technology, coupling of access with content and enforcement. Last week another application of its service was announced at a Samsung event in San Francisco. On newer Samsung devices that can toggle between work and personal modes, Syntonic can be used to divvy up wireless bills, so the company pays for work data usage and the user pays for personal data usage. Called segmented billing, it splits the data bill several ways. Then the monthly bill lists who paid for what data. Thats more transparent than approaches like television ads or contextual online ads that cover the cost to deliver content online or over the air. To me it seems inevitable that phone companies, employers and content providers will find new ways to handle data-distribution costs, with or without Syntonic. Im not sure that using these tools to provide free channels on your mobile device is as obnoxious as Comcast or AT&T selling Internet fast lanes to preferred customers. But I do know that net-neutrality advocates, from President Obama on down, will lose the crusade if they overreach and try to block startups, carriers and other companies from experimenting with new ways to cover the cost of mobile data access. Brier Dudleys column appears Mondays. Reach him at 206-515-5687 or bdudley@seattletimes.com]", "Date": "20141116", "Author": "[NULL]", "Link": "http://www.seattletimes.com/business/syntonicrsquos-lsquosponsored-datarsquo-stirs-net-neutrality-debate/", "Title": "[Syntonics sponsored data stirs net-neutrality debate]"}