{"Content": "[ NEW YORK (AP)  Nike Chairman Phil Knight, who turned a business selling shoes out of the back of his car into the worlds most valuable sports brand, has announced plans to step down as company chairman. Knight, 77, was a middle distance runner in college who began the company in a handshake deal with Oregon coach Bill Bowerman in 1964, with each putting up $500. With shrewd marketing campaigns built around celebrity endorsers like Michael Jordan and Tiger Woods, he made the swoosh one of the most recognizable logos around the globe. That phenomenal growth also landed Knight on Forbes magazines list of 50 richest people in the world, with a net worth estimated at $24 billion. For me, Nike has always been more than just a company  it has been my lifes passion, Knight said in a statement. Knight said he wants Nike President and CEO Mark Parker, who has held those positions since 2006, to succeed him. No specific date was set for Knights departure, though he said he plans to stay involved in the business. Nike Inc. said it expects to name a new chairman in 2016. Knight sold his first pairs of shoes out of an old Plymouth Valiant while traveling the same Pacific Northwest track circuit on which he once competed. The company was originally named Blue Ribbon Sports, but changed in 1978 to Nike  the winged goddess of victory in Greek mythology  on the advice of a friend. Knight said at the time, I dont love it, but it will grow on me. By 1969, Knight was making enough selling shoes to quit his full-time job as an accountant and devote himself to the footwear company. Two years later, he paid $35 to Carolyn Davidson for the original swoosh logo design now plastered across the uniforms and shoes of athletes from the World Cup to little leagues. Building the brand through shrewd advertising campaigns and top-flight celebrity athlete endorsers like Jordan and Woods, he turned the company into what Forbes called the most valuable sports brand in the world. Knight also says he will transfer most of his Nike stock to a limited liability company called Swoosh LLC. The directors of the company will be Knight himself, Parker, and Nike directors Alan Graf and John Donahoe. On Tuesday, Knight said he had transferred 128.5 million shares, or about 15 percent of Nikes total outstanding shares, to Swoosh. Because Knight owns a large amount of Nikes Class A shares, which arent publicly traded, Swoosh now has the power to elect three-quarters of Nikes board. Knight says the move will help keep Nikes corporate governance strong. As of a year ago, Knight owned about 75 percent of Nikes Class A shares and a fraction of a percent of its Class B shares. The Class B shares are currently trading around all-time highs and closed at $108.02 on Tuesday. On Thursday, Nike said its annual profit grew 22 percent to $3.27 billion and its revenue rose 10 percent to $30.6 billion. The Beaverton, Oregon-based company also named Knights son Travis to a spot on the board Tuesday. Travis Knight, 41, is the CEO of animation studio Laika LLC and was producer and lead animator on the movies ParaNorman and The Boxtrolls, ", "Date": "20150630", "Author": "[NULL]", "Link": "http://www.seattletimes.com/business/nike-co-founder-knight-will-step-down-as-chairman/", "Title": "[Nike co-founder Knight will step down as chairman]"}