{"Content": "[ Democrats are laying the groundwork for an ambitious reorganization of their struggling network of super PACs that would exploit the loopholes and legal gray areas Republicans have used to raise hundreds of millions of dollars for the 2016 campaign through such groups. The plans, laid out by the partys top election lawyers in an emergency request filed with the Federal Election Commission (FEC) on Friday, would pave the way for the creation of a host of new super PACs tailored to individual House and Senate candidates.  But the filing also suggests that Democrats would, if allowed, seek to use tactics pioneered by Republican presidential candidates this cycle, helping prospective candidates establish and raise money for super PACs before they officially declare their intent to run. Most strikingly, the lawyers are asking the FEC to clarify how declared candidates, their campaign staff, and their volunteers can help court donors for independent super PACs. The commissions answer could have profound ramifications for the 2016 campaign. In seeking the commissions guidance, Democrats contend that most of the activities their request describes  like having a candidate pretend to test the waters of a candidacy while raising money  appear to violate the law. But if federal regulators determine such practices are legal, the lawyers wrote, Democratic candidates up and down the ballot are prepared to adopt these tactics. The legal questions at hand, according to the emergency request, are highly significant and time-sensitive. Democratic groups, the lawyers wrote, cannot cede strategic advantage to their political competitors. The lawyers signing the request work at Perkins Coie, the marquee Democratic election firm, which also represents the partys congressional campaign committees, the presidential campaign of Hillary Rodham Clinton and a Democratic super PAC supporting her. The FEC has not yet acted on an array of legal challenges and complaints filed by watchdog groups over the activities of presidential campaigns and their super PACs. And while independent groups are an ever-growing portion of election spending, the commission has been unable to agree on comprehensive new rules for the groups, which arose after the Supreme Courts Citizens United decision in 2010. Democrats have generally called for tighter restrictions on super PACs, seeking new rules legislatively and even going to court to force the commission to act. But the new request takes a different tack: In effect, the lawyers are arguing, the commissions inaction threatens to put Democrats at a competitive disadvantage. If the commissioners agree, they could issue an advisory opinion within 30 days. While such opinions are tailored to the candidate or group requesting them and do not carry the force of regulation, they often act as legal guideposts. If the commission bans some or all of the activities, much of the Republican presidential field could face legal risk. Approval, on the other hand, could lead to an expansion of super PACs in the Democratic Party. Im somewhat skeptical of the Democratic Partys motives, said Lawrence Noble, a senior counsel of the Campaign Legal Center, which has sought FEC sanctions against a group of 2016 candidates for alleged campaign violations.  Theyre probably trying a combination  to embarrass the Republicans and also to have an excuse for doing it themselves, he said. Should the commission deadlock on the request by refusing to act on it or splitting in a 3-3 vote, Noble said, most of the aggressive lawyers will say it gives them a green light to engage in similar tactics. Republican super PACs have raised or committed hundreds of millions of dollars in the 2016 election cycle, in part by tightening their relationships with candidates, whose personal ties to donors can pave the way for rapid fundraising by the groups. All told, they have raised many times more money than Democratic groups, though Republicans are also likely to burn through more super PAC cash during the nominating battles ahead.]", "Date": "20150914", "Author": "[NICHOLAS CONFESSORE]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/democrats-seek-to-expand-super-pac-use/", "Title": "[Democrats seek to expand super PAC use]"}