{"Content": "[ In a former colonial mansion in Jamaica, politicians huddle to discuss trying to ease marijuana laws in the land of the late reggae musician and cannabis evangelist Bob Marley. In Morocco, one of the worlds top producers of the concentrated pot known as hashish, two leading political parties want to legalize its cultivation, at least for medical and industrial use. And in Mexico City, the vast metropolis of a country ravaged by horrific cartel bloodshed, lawmakers have proposed a new plan to let stores sell the drug. From the Americas to Europe to North Africa and beyond, the marijuana-legalization movement is gaining unprecedented traction  a nod to successful efforts in Colorado, Washington state and the small South American nation of Uruguay, which in December became the first country to approve nationwide pot legalization. Leaders long weary of the drug wars violence and futility have been emboldened by changes in U.S. policy, even in the face of opposition from their own conservative populations. Some are eager to try an approach that focuses on public health instead of prohibition, and some see a potentially lucrative industry in cannabis regulation. A number of countries are saying, Weve been curious about this, but we didnt think we could go this route, said Sam Kamin, a University of Denver law professor who helped write Colorados marijuana regulations. Its harder for the U.S. to look at other countries and say, You cant legalize, you cant decriminalize, because its going on here. Thats largely because the White House is more open to drug-war alternatives.  President Obama recently told The New Yorker magazine that he considers marijuana less dangerous to consumers than alcohol, and he said its important that the legalization experiments in Washington and Colorado go forward, especially because blacks are arrested for the drug at a greater rate than whites, despite similar levels of use. His administration also has criticized U.S. drug-war-driven incarceration rates and announced that it will let banks do business with licensed marijuana operations, which have largely been cash-only because federal law forbids financial institutions from processing pot-related transactions. Such actions underscore how the official U.S. position has changed in recent years. In 2009, the U.S. Department of Justice announced it wouldnt target medical-marijuana patients. In August, the agency said it wouldnt interfere with the laws in Colorado and Washington, which regulate the growth and sale of taxed pot for recreational use. Anxiety over U.S. reprisals has previously doused reform efforts in Jamaica, including a 2001 attempt to approve private use of marijuana by adults. Given Americas evolution, the discussion has changed, said Delano Seiveright, director of Ganja Law Reform Coalition-Jamaica. Last summer eight lawmakers, evenly split between the ruling Peoples National Party and the opposition Jamaica Labor Party, met with  Ethan Nadelmann, head of the nonprofit Drug Policy Alliance, a pro-legalization group based in New York, and local cannabis crusaders at a luxury hotel in Kingstons financial district and discussed the next steps, including trying to decriminalize pot possession. Officials are concerned about the roughly 300 young men each week who get criminal records for possessing small amounts of ganja. Others in the debt-shackled nation worry about losing out on tourism dollars: For many, weed is synonymous with Marleys home country, where it has long been used as a medicinal herb by families, including as a cold remedy, and as a spiritual sacrament by Rastafarians. Influential politicians are increasingly taking up the idea of loosening pot restrictions. Jamaicas health minister recently said he was fully on board with medical marijuana. The cooperation on this issue far outweighs what Ive seen before, Seiveright said., In Morocco, lawmakers have been inspired by laws in Washington, Colorado and Uruguay to push forward their longstanding desire to allow cannabis to be grown for medical and industrial uses. They say such a law would help small farmers who survive on the crop but live at the mercy of drug lords and police attempts to eradicate it. Security policies arent solving the problem because its an economic and social issue, said Mehdi Bensaid, a legislator with the Party of Authenticity and Modernity, a political party closely allied with the countrys king. We think this crop can become an important economic resource for Morocco and the citizens of this region. In October, lawmakers from Uruguay, Mexico and Canada converged on Colorado for a firsthand look at how that states law is being implemented. They toured a medical-marijuana dispensary and sniffed bar-coded marijuana plants as the dispensarys owner gave  a tour. Mexico has outlets like that, but guarded by armed men, Mexican Congressman Ren Fujiwara Montelongo said afterward. Theres no general push to legalize marijuana in Mexico, where tens of thousands have died in cartel violence in recent years. But in liberal Mexico City, legislators on Thursday introduced a measure to let stores sell up to 5grams of pot. Its supported by the mayor but could set up a fight with the conservative federal government. Rather than continue fighting a war that makes no sense, now we are joining a cutting-edge process, said Jorge Castaneda, a former Mexican foreign minister. Opponents to legalization worry that pot could become heavily commercialized or that increased access will increase youth use. They say the other sides political victories have reawakened their cause. Theres been a real hunger from people abroad to find out how we got ourselves into this mess in the first place and how to avoid it, said Kevin Sabet of Project Smart Approaches to Marijuana. A number of U.S. states are considering whether to try for recreational laws. Voters in Alaska will have their say on a legalization measure this summer. Oregon voters could also weigh in this year, and in California, drug-reform groups are deciding whether to push a ballot measure in 2014 or wait until 2016s presidential election. Abroad, activists are pushing the issue before a United Nations summit in 2016. While some European countries, including Spain, Belgium and the Czech Republic, have taken steps over the years to liberalize pot laws in the face of international treaties that limit drug production to medical and research purposes, the Netherlands, famous for its pot coffee shops, has started to pull back, calling on cities to close shops near schools and ban sales to tourists. There is, however, an effort afoot to legitimize the growing of cannabis sold in the coffee shops. While its been legal to sell pot, its not to grow it, so shops must turn to the black market for their supply, which may wind up seized in a raid. In Latin America and the Caribbean, where some countries have decriminalized possession of small amounts of drugs, from cocaine to marijuana, there is significant public opposition to further legalization. But it is, nevertheless, on the table. Current or former presidents in Colombia, Mexico, Guatemala and Brazil have called for a re-evaluation of or end to the drug war, a chorus echoed by Argentinas drug czar, Juan Carlos Molina, a Roman Catholic priest who has long served in the nations drug-wasted slums. Molina said hes following orders from President Cristina Fernandez to change the governments focus from enforcing drug laws against young people to getting them into treatment., The pace of change has put U.S. legalization activists in heavy demand at conferences in countries weighing their drug laws, including Chile, Poland and the Netherlands. The advocates, including those who worked on the efforts in Washington and Colorado, have advised foreign lawmakers and activists on how to build campaigns. Clara Musto, a spokeswoman for the Uruguayan campaign, said meeting with the Americans helped her group see that it would need to promote arguments beyond ensuring the liberty of cannabis users if it wanted to increase public support. They knew so much about how to lead, she said.]", "Date": "20140216", "Author": "[GENE JOHNSON]", "Link": "http://www.seattletimes.com/nation-world/us-drug-policies-fueling-global-push-to-legalize-marijuana/", "Title": "[U.S. drug policies fueling global push to legalize marijuana]"}