{"Content": "[ NEW YORK (AP)  Donald Trump always boasted about his ratings for Celebrity Apprentice. Now he can say the same thing about his first presidential debate, even if he didnt like the show very much. Thursdays prime-time GOP candidates forum on Fox News Channel reached a stunning 24 million viewers, by far the largest audience ever for that network and any cable news event. The closest was the 1992 Larry King Live debate between Al Gore and Ross Perot on CNN, which was seen by 16.8 million people, the Nielsen company said. In fact, it stands as the most-watched television program of the summer so far, beating the last game of the NBA Finals and the womens World Cup soccer finals, Nielsen said. The debate left front-runner Trump singed by the aggressive questioning of Foxs moderator team of Bret Baier, Megyn Kelly and Chris Wallace. Trump tweeted out criticism of the moderators as not very good or professional and retweeted a message from a supporter who called Kelly a bimbo. Fox News Chairman Roger Ailes called his moderators the best political team ever put on television. Trump became the focus of Thursdays forum right away, when Baier asked the 10 candidates onstage in Cleveland which of them would not pledge to support the eventual GOP nominee or run a third-party candidacy. Trump was the only one to raise his hand, leading opponent Rand Paul to criticize him. Kellys sharp first question noted that Trump had called women he didnt like fat pigs, dogs, slobs and disgusting animals. When Trump suggested he had only insulted Rosie ODonnell, Kelly corrected him and asked whether this represented the proper temperament for a president and left him vulnerable to charges that he is part of a war on women. Trump pointed to his lack of political correctness. Ive been very nice to you although I could probably not be based on the way youve treated me, Trump told Kelly. But I wouldnt do that. Wallace asked Trump two tough questions and, in a quick-moving format that allowed little time for followups, both times came back at Trump for not answering them. Wallace asked Trump to provide proof for his earlier statement that the Mexican government is sending criminals to the United States, and later questioned him on how he could be trusted to run the nations economy when his companies have declared bankruptcy four times. Baier asked Trump to reconcile his past support of single-payer health care with his opposition to President Obamas health plan, and what he felt he received in return for past political donations to Hillary Clinton and Nancy Pelosi. Kelly also pointed out Trumps past support for Democrats and asked, when did you become a Republican?, I dont think they like me very much, Trump said. Later, Trump wrote on Twitter: I really enjoyed the debate tonight even though the @foxnews trio, especially @megynkelly, was not very good or professional. In another message, he wrote that Kelly really bombed. He retweeted several messages from others who criticized Fox, including one who wrote that Fox viewers give low marks to bimbo @MegynKelly. On Fox after the debate, Kelly noted that it creates an awkward dynamic to have Trump attack her after she has asked a tough question about what he has said and done to women. Im extremely proud of all of the moderators  they asked tough, important questions and did their job as journalists, Ailes told Politico. I think that was the best political debate team ever put on television. Their performance was outstanding. Fox had attracted attention prior to the debate for deciding to include 10 of the 17 declared candidates in the prime-time debate. The other candidates competed in a forum that began at 5 p.m. ET to an audience of one-quarter the size. Still, even the earlier forum attracted a larger audience than all but five of 18 Republican debates televised during the 2012 election cycle. The most-watched GOP primary debate for the 2012 election, on ABC in December 2011, had 7.6 million people, Nielsen said. Fox attracted just under 12 million viewers for its 2012 Election Night coverage, its previous standard for biggest audience.]", "Date": "20150807", "Author": "[DAVID BAUDER]", "Link": "http://www.seattletimes.com/nation-world/debate-shatters-fox-news-ratings-record-trump-feels-heat/", "Title": "[Debate shatters Fox News ratings record, Trump feels heat]"}