{"Content": "[ Ive admired the Clintons foundation for years for its fine work on AIDS and global poverty, and Ive moderated many panels at the annual Clinton Global Initiative. Yet with each revelation of failed disclosures or the appearance of a conflict of interest from speaking fees of $500,000 for the former president, I have wondered: What were they thinking?, But the problem is not precisely the Clintons. Its our entire disgraceful money-based political system. Look around:,  Gov. Chris Christie of New Jersey accepted flights and playoff tickets from Dallas Cowboys owner Jerry Jones, who has business interests Christie can affect.  U.S. Sen. Marco Rubio of Florida has received financial assistance from a billionaire, Norman Braman, and has channeled public money to Bramans causes.  Jeb Bush likely has delayed his formal candidacy because then he would have to stop coordinating with his super PAC and raising money for it. He is breaching at least the spirit of the law. When problems are this widespread, the problem is not crooked individuals but perverse incentives from a rotten structure. There is a systemic corruption here, says Sheila Krumholz of the Center for Responsive Politics, which tracks campaign money. Its kind of baked in. Most politicians are good people. Then they discover that money is the only fuel that makes the system work and sometimes step into the bog themselves. Money isnt a new problem, of course. John F. Kennedy was accused of using his fathers wealth to buy elections. In response, he joked that he had received the following telegram from his dad: Dont buy another vote. I wont pay for a landslide!, Yet Robert Reich, Bill Clintons labor secretary and now chairman of the national governing board of Common Cause, a nonpartisan watchdog group, notes that inequality has hugely exacerbated the problem. Billionaires adopt presidential candidates as if they were prize racehorses. Yet for them, its only a hobby expense. For example, Sheldon and Miriam Adelson donated $92 million to super PACs in the 2012 election cycle; as a share of their net worth, that was equivalent to $300 from the median American family. So a multibillionaire can influence a national election for the same sacrifice an average family bears in, say, a weekend driving getaway. Money doesnt always succeed, of course, and billionaires often end up wasting money on campaigns. According to the San Jose Mercury News, Meg Whitman spent $43 per vote in her failed campaign for governor of California in 2010, mostly from her own pocket. But Michael Bloomberg won his 2009 re-election campaign for mayor of New York City after, according to the New York Daily News, spending $185 of his own money per vote. The real bargain is lobbying  and thats why corporations spend 13 times as much lobbying as they do contributing to campaigns, by the calculations of Lee Drutman, author of a recent book on lobbying. The health care industry hires about five times as many lobbyists as there are members of Congress. Thats a shrewd investment. Drug company lobbyists have prevented Medicare from getting bulk discounts, amounting to perhaps $50 billion a year in extra profits for the sector. Likewise, lobbying has carved out the egregious carried interest tax loophole, allowing many financiers to pay vastly reduced tax rates. In that respect, money in politics both reflects inequality and amplifies it. Lobbyists exert influence because they bring a potent combination of expertise and money to the game. They gain access, offer a well-informed take on obscure issues  and, for a member of Congress, you think twice before biting the hand that feeds you. The Supreme Court is partly to blame for the present money game, for its misguided rulings that struck down limits in campaign spending by corporations and unions and the overall political donation cap for individuals. Still, President Barack Obama could take one step that would help: an executive order requiring federal contractors to disclose all political contributions. President Obama could bring the dark money into the sunlight in time for the 2016 election, notes Michael Waldman of the Brennan Center for Justice at the New York University School of Law. Its the single most tangible thing anyone could do to expose the dark money that is now polluting politics. Ive covered corrupt regimes all over the world, and I find it ineffably sad to come home and behold institutionalized sleaze in the United States. Reich told me that for meaningful change to arrive, voters need to reach a point of revulsion. Hey, folks, that time has come.]", "Date": "20150530", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/2016-election-is-filled-with-polluted-political-games/", "Title": "[2016 election is filled with polluted political games]"}