{"Content": "[ BURLINGTON, Vt. (AP)  Challenging Hillary Rodham Clinton from the left, Vermont Sen. Bernie Sanders kicked off his presidential bid Tuesday with a pitch to liberals to join him in a political revolution to transform the nations economy and politics. Sanders, who entered the Democratic race in late April, formally opened his White House campaign in Burlington, where he was first elected mayor by defeating a longtime Democratic incumbent by 10 votes. Three decades later, Sanders is the underdog again, vowing to campaign on an agenda to elevate issues like income inequality, campaign finance and climate change. With your support and the support of millions of people throughout this country, we begin a political revolution to transform our country economically, politically, socially and environmentally, Sanders declared to about 5,000 supporters along the shore of Lake Champlain. Now is not the time for thinking small, he said. Now is not the time for the same old-same old establishment politics and stale inside-the-Beltway ideas. A self-described democratic socialist, the 73-year-old Sanders has a following among liberals that could push Clinton to the left. In a lengthy address, the white-haired senator said there is something profoundly wrong when so much of the nations income goes to the top 1 percent of all earners. This grotesque level of inequality is immoral, he said. It is bad economics. It is unsustainable. His campaign kickoff in Burlingtons Waterfront Park, built on industrial land reclaimed during Sanders stint as mayor, offered a quintessential Vermont backdrop: a sun-splashed Lake Champlain, where boaters took in the scene from sailboats and motorboats. The senator was praised by a lineup of supporters, including the founders of Vermonts popular ice cream company, Ben & Jerrys, and environmental activist Bill McKibben, who predicted the campaign might someday lead to a mountaintop named Mount Sanders. Several leading Vermont Democrats were notably absent, including Sen. Patrick Leahy, Gov. Peter Shumlin and former Gov. Howard Dean, all of whom are supporting Clinton. Liberals, some of whom are wary of Clinton, have unsuccessfully sought to draw Massachusetts Sen. Elizabeth Warren into the race. But in Warrens absence, Sanders hopes to fill the void as he proposes ways to rein in Wall Street banks, tackle mounting college debt and create a government-financed jobs program. Clinton is in a commanding position by any measure, far in front of both Sanders and former Maryland Gov. Martin OMalley, who is expected to get into the race Saturday. The Democratic field could also grow to include former Virginia Sen. Jim Webb and former Rhode Island Gov. Lincoln Chafee. But it remains to be seen if liberals will coalesce around a challenger to the former secretary of state or if that slice of the anti-Clinton electorate will splinter among several candidates. Sanders, an independent in the Senate who often votes with the Democrats, has raised more than $4 million since announcing his campaign in late April and suggested in an interview with The Associated Press last week that raising $50 million for the primaries was a possibility. In his address, Sanders made clear he would seek to be on the forefront of liberal causes. He described the economic system as rigged against middle-class families and vowed to raise taxes on the wealthy and corporations and to oppose trade deals that would ship jobs overseas. To counter big money in politics, he said he would push for the public financing of elections. To build upon President Barack Obamas health care law, Sanders supports a single-payer health care system. Instead of cutting Social Security, he said, the nation should expand Social Security benefits. To address climate change, he said, Congress should pass a carbon tax to help transition off fossil fuels. He noted that he voted against the invasion of Iraq in 2003  Clinton has disavowed her vote in support of it  and said the U.S. should be part of an international coalition to defeat the Islamic State group. Sanders has introduced legislation to make tuition free at public colleges and universities, a major piece of Warrens agenda. Clintons campaign has signaled that she intends to make debt-free college a major piece of her campaign, too. Richard Robinson, a Burlington retiree who attended the rally, said it was important for Sanders to be in the race, just to get the power in the party to listen to him  particularly Hillary. ", "Date": "20150526", "Author": "[DAVE GRAM, KEN THOMAS]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/vermonts-sanders-to-kick-off-2016-bid-from-clintons-left/", "Title": "[Vermonts Sanders kicks off 2016 bid from Clintons left]"}