{"Content": "[ WASHINGTON (AP)  John Bolton, the former U.S. ambassador to the U.N. and one of the Republican Partys most prominent national security hawks, has confirmed that he will not run for president. In a media conference call and separate video to supporters, Bolton said he would work through his political action committees and PACs to influence the 2016 elections by pushing candidates to promote aggressive foreign and military policies. I believe I can make the strongest contribution to our future by continuing as a clear and consistent advocate for a strong, Reaganite foreign policy that values peace through strength, Bolton said in the video. But, he told reporters, his own campaign was not feasible, saying that an established political class in this country makes it harder for lesser-known candidates to compete seriously for the presidency. Im not complaining, he said, adding, Im a realist. A leading foreign policy voice in the George W. Bush White House, Bolton spent recent months testing his muscular foreign policy message in early voting states. He often lashed out at Democratic presidential candidate Hillary Rodham Clinton, as well as Republican rivals  Kentucky Sen. Rand Paul in particular  who favor a reduced U.S. military presence in the world. He blasted Clinton again Thursday, calling her tenure as President Barack Obamas first secretary of state a failure. Republicans need to make sure they dont allow her to skip away with using national security as an issue that works in her favor, he said. Bolton said he has no immediate plans to endorse any Republican. Boltons decision not to run is somewhat surprising in an election season in which more than a dozen ambitious Republicans may pursue a run for the nomination. Declared candidates include Paul, Florida Sen. Marco Rubio, Texas Sen. Ted Cruz, former technology executive Carly Fiorina and retired neurosurgeon Dr. Ben Carson. A slew of current and former governors, including Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker and New Jersey Gov. Chris Christie, are expected to announce their plans in the coming weeks. Despite saying a campaign wasnt feasible, Bolton insisted that funding would have been there in an adequate amount. He noted that his political organizations spent about $7.5 million on House and Senate races in the 2014 midterm elections. ", "Date": "20150514", "Author": "[STEVE PEOPLES, BILL BARROW]", "Link": "http://www.seattletimes.com/seattle-news/politics/former-u-n-ambassador-john-bolton-wont-run-for-president/", "Title": "[Former UN Ambassador John Bolton wont run for president]"}