{"Content": "[ Plans for building Seattles waterfront seawall  overwhelmingly approved by voters last week  call for seven years of construction, with a shutdown from Memorial Day through Labor Day each year to protect the peak summer tourist season for visitors and waterfront businesses. Alaskan Ways four lanes will narrow to two, pedestrian access could be blocked as the work progresses along the waterfront, and the area will be noisy and dusty as the city undertakes what leaders say is the most intensive and complex such project in its history. Knowing that, some business owners are complaining that a three-month construction shutdown isnt adequate. They want work on the seawall to be stopped through September, which they say is just as busy as June. And they say the city has told them over the past few years that a four-month shutdown would be honored as work on the Elliott Bay seawall gets under way next fall. Waterfront businesses are livid, said Bob Donegan, president of Ivars, whose flagship restaurant is at Pier 54 on the downtown waterfront. The weather is still good in September, the cruise ships are still sailing. The Mariners, the Huskies, Sounders and Seahawks are all playing. Its a busy month for us, Donegan said. He said that based on data from the past two years, waterfront businesses do about 54 percent of their annual sales between June and September, with some doing as much as 80 percent in that period. City officials say theyre trying to balance the costs to the public of extending the construction project beyond the scheduled seven years with maintaining a vibrant and viable waterfront economy. The city has a tight timeline for completing the seawall. Phase One, from South Washington Street to Virginia Street, must be finished by 2016, in time for the planned removal of the viaduct and the replacement of Alaskan Way. A tunnel will replace the viaduct. We have significant deadlines that are really not flexible, said City Councilmember Tom Rasmussen, chairman of the Transportation Committee. Were trying to strike a balance between meeting the needs of businesses and getting the project done. In addition to the summer construction stoppage, the city also faces state and federal restrictions to protect migrating salmon. Work cant be done in the water between Feb. 15 and Aug. 1. We have seven species that are threatened or endangered. Were already facing limitations about when we can schedule work, said Jennifer Wieland, seawall project manager for the Seattle Department of Transportation. Wieland said the city is willing to talk with waterfront businesses about extending the summer shutdown for another month, but is currently committed only to June through August. Kevin Clark, president and CEO of Argosy Cruises, said September and October account for 20 percent of his companys annual income and that Argosy loses money January through April, when few people want to be on the water. Weve been emphatic that the city needs to push the work out until after September. Their assumption is that after Labor Day, the waterfront goes dark, Clark said. Voters approved a $290 million, 30-year bond measure to rebuild the seawall in the Nov. 6 general election with 77 percent of the vote. The city Tuesday released the Draft Environmental Impact Statement on the entire seawall project. Waterfront businesses were briefed on the draft last week. The draft environmental review specifies a shutdown from Memorial Day through Labor Day and notes that disruptions to transportation and business during construction will be substantial. Wieland said mitigation measures will be detailed in the final report in March. Donegan, of Ivars, said the city doesnt have flexibility in scheduling now because of delays in planning the project over the past few years. He said the city changed design contractors, changed city staff on the project and chose to pursue funding from the U.S. Army Corps of Engineers, rather than going forward with what the city could finance itself. They want the biggest supporters of the project to now pay for their delays. Thats not what they promised us. Thats not what we agreed to, Donegan said. The city says it has worked steadily on planning the project since 2010, when Mayor Mike McGinn identified the seawall as a critical piece of infrastructure that wasnt built to modern seismic standards and needed replacing. Preliminary design work wasnt completed until March. Until then, Wieland said, the City Council believed it didnt have enough certainty about the project and design costs to place a bond measure before voters. The suggestion that changing design teams and working with the Army Corps has led to years of schedule delays is not accurate, she said. The city is still hoping for federal funding for Phase 2 of the project, which will extend north to Broad Street. City Council President Sally Clark said the citys goal is to complete the seawall as quickly as possible without damaging either salmon or waterfront businesses. Maybe we can trade June for September, but can we talk about extending the length of time were down there without increasing the costs? I dont think its possible to do this project without impacts, she said. Lynn Thompson: 206-464-8305 or lthompson@seattletimes.com. On Twitter @lthompsontimes.]", "Date": "20121113", "Author": "[Lynn Thompson]", "Link": "http://www.seattletimes.com/seattle-news/seattle-waterfront-merchants-livid-over-seawall-construction-plan/", "Title": "[Seattle waterfront merchants livid over seawall construction plan]"}