{"Content": "[ The big story of Election 2014, other than Republicans taking the U.S. Senate, was that gun control finally got its breakthrough. In a big way. Gun-control measures have never done well at the ballot box, including in our liberal state. But the gun-control groups smashed that barrier for the first time Tuesday. Gun background checks passed overwhelmingly  by about a 20-point margin. Thats a watershed vote. I dont know if it was the Marysville shootings in the last weeks of the election or that the public has endured too many shootings in general. But gun controls moment has arrived. Its another example of the voters being ahead of the politicians. These same background checks died in last years Legislative session  killed off, as usual, by National Rifle Association lobbying of cowed legislators. So how did it finally happen? Background checks are popular, period. Plus, the campaign spent about $10 million, outgunning the big bad NRA almost 20 to 1. Even though the campaign was pushed by elite gajillionaires like Bill Gates and Nick Hanauer, the campaign also reported more than 9,000 citizen contributors. It was a bigger, more broadly based campaign than it was given credit for, and it clicked in our increasingly liberal state. Expect this win to be the first word on gun control, not the last  legislators are going to introduce at minimum a bill holding parents liable for crimes committed by youth who get access to an unsecured gun. What happened is the stale politics around this issue was just blown apart. Locally, there was no bigger winner of the election than Seattle Mayor Ed Murray and his progressive dreams. The new mayor has now run the tax table in this town, getting voters to back new levies for a parks district, for buses and for universal preschool. Add the $15 minimum wage and thats a heady series of wins for the mayor. Hes been in office only 10 months!, Expect Seattle to roll out a slew of new tax measures in the year ahead, on roads, police, publicly funded elections, you name it. Why not? The city keeps saying yes. The big fight over Metro Transits buses ended with Seattle voters agreeing to fund our own bus routes ourselves. City leaders had made a hash of the issue  saying it was to stop devastating bus cuts, but switching messages midstream when the cuts were canceled. Anyone who tries to move around the city can see why it passed anyway: We need more transit. So transit won. It always wins in Seattle (except for the monorail  by 80 percent we said were done with that quixotic idea, hopefully for good.), On a state level, candidates and outside interest groups made these the most expensive state legislative races ever. The Senate contest in Redmonds 45th District was the priciest legislative race in state history. All that money changed  nothing. It looks like the GOP will retain control in the state Senate, but by the exact margin as before. Thats a lot of money for both sides to waste to end with the status quo. So now what? Expect more gun legislationand a donnybrook of a Legislative session, with a huge fight over education spending. The election resolved nothing on that front. Nationally, expect Republicans, now in control of the House and Senate, to open more investigations into President Obama. Dont expect Obamacare to be repealed, but theyll try. And expect more war. Im not sure about that last one, but thats what Im most worried about. Danny Westneats column appears Wednesday and Sunday. Reach him at 206-464-2086 or dwestneat@seattletimes.com]", "Date": "20141104", "Author": "[NULL]", "Link": "http://www.seattletimes.com/seattle-news/big-winners-gun-control-and-mayor-ed-murray/", "Title": "[Big winners: gun control and Mayor Ed Murray]"}