{"Content": "[ If Hillary Rodham Clintons new apology for her private email server fails to reassure jittery supporters, it could amplify the chatter among some Democrats who have been casting about for a potential white knight to rescue the party from a beleaguered Clinton candidacy. Vice President Joe Biden, Secretary of State John Kerry, Sen. Elizabeth Warren of Massachusetts, former Vice President Al Gore: Each has been discussed among party officials in recent weeks as an alternative to Clinton if she does not regain her once-dominant standing in the 2016 presidential field and, instead, remains mired in the long-running email controversy, with its attendant investigations. On Monday, Biden, who has spoken publicly of pondering a run, looked very much like a candidate at a Pittsburgh union gathering and Labor Day parade. And some Democrats were intrigued by word that Kerry, the 2004 Democratic nominee, had met recently in Nantucket, Mass. with David Rubenstein, a billionaire co-founder of the Carlyle Group  and the sort of Washington wise man Kerry might consult if he were mulling another run. (Friends say he isnt.), It is not just Clintons weakness in the polls that has generated talk of other alternatives, but also the strength of Sen. Bernie Sanders of Vermont, who is routinely drawing huge crowds at campaign events. That has been disconcerting to Democratic officials who believe Sanders, a socialist, is so liberal that his presence at the top of the partys ticket in 2016 would be disastrous. If party leaders see a scenario next winter where Bernie Sanders has a real chance at the Democratic nomination, I think theres no question that leaders will reach out to Vice President Biden or Secretary of State Kerry or even Gore about entering the primaries, said Garnet Coleman, a Texas state lawmaker and Democratic national committeeman. Even if none of those Democrats were to announce candidacies this fall, some party officials and strategists suggested Biden could be laying the groundwork for an eleventh-hour rescue mission during the winter primaries if Clintons campaign began to implode. Similarly, Kerrys friends say they believe he would hear out party leaders if Sanders appeared likely to capture the nomination and they implored Kerry, who would have to resign as secretary of state, to try to block him. The interest in senior statesmen and stateswomen is partly a reflection of the thin Democratic bench after widespread losses in races for governor, Senate and other offices in 2010 and 2014, which has left the party with relatively few experienced, credible presidential contenders  let alone ones willing to take on Clinton. (The paucity of fresh faces even gave rise to a joking Twitter hashtag: #Dukakis2016, offering up the partys 1988 nominee, former Massachusetts Gov. Michael S. Dukakis.), Still, Biden, Kerry and Gore have lost presidential bids before and are hardly guaranteed party saviors  or more popular than Clinton among important demographic groups like women, African Americans and Hispanics. Indeed, for all of the talk about 2016 fallback plans, Clinton remains the front-runner for the nomination, and her comments Tuesday in an interview with ABC News and in a follow-up message to supporters  saying Im sorry for relying on private email for government business as secretary of state and calling that practice a mistake  may help assuage concerns among some Democrats about her candidacy. But the chatter could continue if Clinton does not quickly regain her footing. You have Democrats beginning to panic about the one thing that a lot of them never worried about, which was Clintons electability in the general election, said Robert Shrum, a veteran strategist who was a senior adviser to Gore and Kerry during their presidential runs. You still have to think of her as the odds-on favorite for the Democratic nomination. But the challenge she faces in the general election is both the trust problem and the likability problem. Shrum recalled how Gores likability suffered in the 2000 campaign, most memorably when he was ridiculed for supposedly having claimed he invented the Internet  but not his fundamental trustworthiness, because theres an assumption that all politicians exaggerate. Several Democrats said Biden and Kerry were especially well-positioned to enter the race late, given their experience, party support, fundraising networks and name recognition. Biden and Kerry are the kind of highly respected, well-known figures that, if he were to jump in the race during the primaries in an emergency kind of way, they could attract a lot of voters very quickly, said Jaime Harrison, chairman of the South Carolina Democratic Party. Democrats close to Kerry said he would not consider the white-knight scenario unless drafted  and, indeed, add that he would probably laugh at it. In 2003, they recalled, when Kerry was struggling in the polls, there was chatter that Gen. Wesley Clark would to ride to the rescue so former Vermont Gov. Howard Dean would not capture the nomination. (Clark never became a strong contender.), By all accounts, Kerry loves his current job and is focused on the Iran nuclear agreement now before Congress, which his admirers suggest could make him a candidate for the Nobel Peace Prize next month. But his State Department tenure could also make him a strong presidential candidate, if it came to that, they say. He has strengths: He knows the country. He has world stature. He has handled the job of secretary of state extremely well. He beat George Bush in three debates. He prepared Obama for three debates, said John Sasso, a longtime Democratic operative and friend of Kerrys who was a senior adviser to his 2004 campaign. I have no indication Secretary Kerry would ever run again, but I dont think anyone else has more experience in preparing and running for the presidency than Kerry. (Kerry has said recently that he has no plans to run for president, but he also said in February that nobody ever says never.) , Tad Devine, a senior adviser to Sanders, said he believed Democratic restiveness would subside as people learned more about Sanders through campaign events and the televised Democratic debates this fall and winter. As Democratic Party officials see Bernie Sanders mounting strength with voters, I think they will begin to better understand that he will not only be a strong nominee who can help Democrats all across the country win elections, but he actually will be the white knight if they need one, said Devine, who was a past adviser to Kerry and Gore. (A spokeswoman for Gore declined to comment, but Democrats close to him said he was devoted to fighting climate change. Warren, the Massachusetts senator, has said repeatedly that she is not running.) , Several supporters of Clinton said they were confident that her hard work on the campaign trail would ultimately unite the party behind her. The media notwithstanding, I think Hillary is in very strong shape. Shes going to win Iowa and then the nomination and the presidency, said Jerry Crawford, an influential Iowa Democrat who worked on behalf of Kerry in 2004 and is now backing Clinton. Democrats who are ornery and cantankerous as a rule are inclined to say they are for Sanders right now. But when it comes time for them to decide who can win the general election, they will vote for Hillary.]", "Date": "20150909", "Author": "[Patrick Healy]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/if-clinton-falters-who-would-be-democrats-white-knight/", "Title": "[If Clinton falters, who would be Democrats white knight?]"}