{"Content": "[ This summer, as Washington bakes in a West Coast drought, a flock of petition-toting activists has fanned out to parks, festivals and street corners, trying to force the sort of sweeping action on global warming that has eluded state lawmakers. Theyre wrangling signatures for Initiative 732, which would put a new tax on carbon burned in gasoline, natural gas and other fossil fuels  while cutting other taxes by an equal amount. By raising the price of dirty energy, I-732 aims to cut greenhouse-gas emissions and encourage development of cleaner alternatives. Thats a goal shared by Gov. Jay Inslee, environmentalists, labor and other Democratic Party allies, who backed carbon-pricing legislation that was stymied this year in the Legislature. So you might think theyd get behind the scrappy, grass-roots I-732 campaign, known as Carbon Washington. Nope. Instead, a powerful coalition that includes the states major green and labor groups is trying to squash the effort. Leaders of the Alliance for Jobs and Clean Energy have sought to discredit I-732 in recent weeks. Theyve circulated poll results that suggest it would be rejected by voters. And theyve argued the initiative is insensitive to communities of color. Alliance members say theyre working on their own climate-initiative proposal for 2016, one that would divvy up tax dollars differently, include input from a more diverse crowd, and, most important, have a better chance to pass. So, while they appreciate I-732s goals and enthusiasm, theyd prefer it please step aside. I think the best thing for the climate movement is for all of us to come together and combine our strength, said Lisa MacLean, a Democratic political consultant and director of the alliance. I-732 backers say theyve waited long enough for action from the political establishment and are pushing ahead. They say that there might be another measure. I feel like some of those folks have been saying that for years, said Yoram Bauman, co-founder of Carbon Washington. Both sides say this is a disagreement among friends. They all want the state to take serious action on climate. They just disagree on the best approach. The I-732 crowd is more of an upstart, eclectic bunch, led by Bauman, a Ph.D. economist who also performs as a comedian. He bills himself as the worlds first-and-only stand-up economist. But hes dead serious about climate policy. And he says a carbon tax is both the most transparent and politically feasible idea to cut emissions. He points to British Columbia, which has had a similar carbon tax in place since 2008. The I-732 campaign has grown from a volunteer operation to one with several paid staff, a headquarters near Gas Works Park and more than 20 chapters across the state. The campaign has raised $250,000. Still, there is no guarantee theyll make the ballot. Organizers expect to reach about 100,000 signatures by the end of July. As an initiative to the Legislature they need 246,732 valid signatures from registered voters by the end of the year. That would force lawmakers to either pass the measure or send it to a public vote. The effort may face rough shoals ahead, with the politically connected alliance leadership discouraging support. As with many political disputes, this one is largely about money. As a revenue-neutral plan, I-732 would not fill state government coffers with cash. While the carbon tax would raise an estimated $1.7 billion a year  and cost the average family an estimated $300 a year in higher gas and energy prices  it would give away an equivalent amount back to consumers, mostly through a full percentage point cut in the state sales tax. That differs from cap-and-trade legislation offered up by Inslee and backed by the alliance in this years legislative session. That plan would have raised more than $1billion a year from fees on carbon and directed the proceeds to the state education budget, transportation projects, affordable housing and other programs. While the alliances 2016 initiative has not been revealed, its clear that backers dont agree with I-732s revenue-neutral approach. Michael Mann, a member of the alliance steering committee, stressed that he respects Baumans effort. The proposal hes put together is a strong economic model for carbon reduction. The issue for me is, its got to be politically feasible, said Mann, an environmental consultant and lobbyist. Thats the holy grail that the alliance is looking to develop. Mann and other alliance supporters suggest that spending carbon-tax revenues on clean-energy investments, schools and other community programs could prove more popular than tax cuts. Meanwhile, polling results circulated by the alliance claim I-732 starts at just 39 percent support when voters are read the ballot title. While arguments for the measure boosted support in the poll, MacLean said its numbers are too weak to withstand likely assaults from the fossil-fuel industry. She declined to release the full poll results. I-732 supporters disagree. They say a youthful electorate that will turn out in 2016s presidential election gives their proposal more than a fighting chance. And they argue a carbon tax is simpler to grasp for voters than alternatives like a cap-and-trade plan, which relies on auctioned pollution permits bought and sold in a stock-exchangelike system. Hendrik Wolff, an assistant professor of economics at the University of Washington, whose research includes climate policy, said both cap-and-trade and carbon taxes are viable paths to the same goal. The advantage (of a carbon tax) is that it is easier administratively to implement, said Wolff, who supports the initiative. Other I-732 backers say it would be foolish to run a climate initiative that also seeks to grow government spending. With its revenue-neutral approach, I-732 can draw support from across the political spectrum, supporters argue. The difference between Carbon Washington and the Alliance is that Carbon Washington is building a bipartisan coalition, and the Alliance is building a coalition of the left, said Joe Ryan, a board member of Carbon Washington and former president of the Washington Environmental Council (which is part of the alliance). Todd Myers, environmental director for the Washington Policy Center, a free-market think tank, has backed I-732s British Columbia-style carbon-tax approach. However, its a stretch to believe many Republicans would support the carbon tax. Rejecting the international scientific consensus on climate change, the state Republican Party platform contends warming from human generated greenhouse gases has yet to be proven. Most of the I-732 endorsers hail from the more liberal side of politics, including Seattle City Councilman Nick Licata, former Seattle Mayor Mike McGinn and former King County Executive Ron Sims. But the alliance boasts a much longer list of supporters, including groups closely associated with the Democratic Partys political base, from the state Labor Council to green business and transit activists. It also includes groups representing African-American, Latino and other minority communities. And some leaders of those groups are criticizing the I-732 campaign, which they say has failed to be so inclusive. Climate change will disproportionately affect poor and minority communities, they note, so any climate initiative ought to place racial equity front and center. We believe that is what it will take to fight and win against the fossil-fuel industry, said Aiko Schaefer, a coordinator of Communities of Color for Climate Justice. Peter Bloch-Garcia, executive director of the Latino Community Fund of Washington, said an adequate climate proposal must fund targeted investments in underresourced and underinvested communities. Bauman countered that I-732 will help the poor and minority communities  by fighting climate change, cutting the regressive sales tax, and by funding the Working Families Tax Credit, which would offer a tax rebate of up to $1,500 a year for 400,000 low-income working families. Notwithstanding their current disagreements, both sides continue to talk. McGinn, who endorsed I-732, said he was drawn to the grass roots and volunteer energy. He criticized the lackluster leadership of larger environmental groups that have been overly deferential to politicians who havent delivered. But McGinn said hes largely agnostic on whether a carbon tax or some other alternative is the best approach. He predicted I-732 supporters and the alliance may wind up under the same tent by 2016. There is plenty of time for everyone to make peace, he said.]", "Date": "20150725", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/carbon-tax-initiative-divides-environmentalists/", "Title": "[Carbon-tax initiative divides environmentalists]"}