{"Content": "[ CLEVELAND  Republicans started face-to-face debates Thursday for their partys 2016 presidential nomination. A quick look. When Fox News moderator Megyn Kelly asked Donald Trump about calling women such things as fat pigs, dogs, slobs and disgusting animals, he dismissed it with a joke, saying: Only Rosie ODonnell. While the audience laughed, Kelly did not. Trump brushed it aside as political correctness, and turned on Kelly. I dont frankly have time for total political correctness. And to be honest with you, this country doesnt have time, either. Jeb Bush. He came with a concise argument aimed at those who think hes too liberal, noting he cut taxes every year as governor of Florida, increased reserves and won a AAA bond rating. I governed as a conservative and I govern effectively, he said. We left the state better off because I applied conservative principles in a purple state the right way, and people rose up. Ben Carson. With his low-key approach, he all but disappeared on a stage with forceful personalities. Asked at the outset about mistakes hes made on foreign policy, he punted with a nonanswer. I could take issue. But we dont have time. He did, but didnt use it. Chris Christie. Christie came through when he challenged Rand Paul over criticisms of National Security Agency spying. The governor of New Jersey noted that he alone in the field was a federal prosecutor, and in New Jersey the 2001 terrorist attacks were a personal issue. I will make no apologies ever, he said. Ted Cruz. The senator from Texas showed his skills as a debater, though he didnt get many opportunities to engage with rivals on the crowded stage. He asserted his main claim, that hes an outsider even in Washington, and eager to challenge even his own partys leaders. Mike Huckabee. The former governor of Arkansas made a strong appeal to Christian conservatives with a clearly worded pitch to invoke the Fifth and 14th amendments to protect unborn children from abortions. John Kasich. The Ohio governor engaged Trump, saying hed touched a nerve among frustrated voters but that people like himself had other solutions. Dry at times, he still showed compassion, particularly explaining why taking more federal Medicaid money had been immense help to the working poor. Rand Paul. The senator from Kentucky jumped in at times to challenge Trump, calling him out for refusing to vow support for the GOP nominee and rule out a third-party run himself. He showed outrage when Christie challenged him on government use of citizens records. Marco Rubio.The senator from Florida offered a different take on immigration, notably about the value of a fence (criminals could dig a tunnel) and about just whos coming into this country (not just Mexicans). Donald Trump. He lived up to his billing as the unapologetic center of attention. Got big cheers, big boos, particularly when he tried to joke his way out of the charge that hes routinely insulted women  and when he refused to rule out an independent presidential bid. Scott Walker. The governor of Wisconsin stuck to a lot of standard talking points on his record of taking on unions and winning three elections. He seemed content to stay out of the fray.]", "Date": "20150806", "Author": "[Steven Thomma, David Lightman]", "Link": "http://www.seattletimes.com/nation-world/gop-rock-n-rolls-in-cleveland/", "Title": "[The GOP debate report card]"}