{"Content": "[ With the shocking truth in hand, we can all finally move on. The details behind the Seahawks Failed Percy Harvin Experiment of 2014  which ranks right up there with similarly monumental historic events such as the Great Seattle Fire of 1889 and the Great Charlie Chong West Seattle Snow Plow Revolt of 1995  finally can be known. The former Seahawks receiver, for whom the team shelled out $19 million for 27 receptions, revealed this week to the crack Tiger Beat news team on ESPN / TMZ that he simply never felt accepted by Seattles other receivers. Heartbreaking, really. Harvin said he got little love from the other boys even after he told them: Hey, guys, Im here to ball with you, to take us to the next level. One can only imagine the trauma associated with being inserted into a peer group of obscenely compensated Alpha males who unanimously refuse an open invitation to ball with you. Especially when the same guys were whispering things to local media that Harvin was rubbed wrong by. Who among us wouldnt feel the need to wail on some of them?, Yet another hapless victim of the Seattle Freeze. More drama-queen-coronation news:, Next Week at Seahawks Drama Camp: Cyclo-Cross champion Michael Bennett, the human mood ring, is rubbed wrong by Pete Carrolls exhaustingly grating gum-chomping; Russell Wilson lists five ways he spent the offseason finally getting black enough (remember that?). Speaking of Circuses: After last weeks primary election, quite the shake-up looms for the Ringling Bros. and Barnum & Bailey Seattle City Council, which, thanks to elections by district, finally will meet the public demand for intractable malaise by replacing starry-eyed, quasi-socialist idealists with petulant social-engineering wonks. First Lions Head No Longer Free:Reacting to justifiable public disgust over big-man-trophy-hunting losers like that Minnesota dentist, Americas top airlines last week announced bans on the transporting of hunting trophies back to the U.S. Special note to big-game hunters: Its unclear whether the banapplies to trophy wives. Speaking of Which: The above action was a notably bold stance by American Airlines, which doesnt fly to Africa, and United Airlines, which has a single flight there. Its sort of like stepping up to ban the importation of unicorns. This Just In: In spite of the encouragement of others, Starbucks CEO Howard Schultz says he does not intend to run for president in 2016. Keep in mind that others means two or more people  and Mr. Wrap was one. Thank You Expedia, May We Have Another? After it moves from Bellevue into that Interbay Amgen campus, Expedia plans to add just what Seattle needs most  another million square feet of office space and private parking for an additional 2,000 cars. Should work out fine, assuming no one ever tries to move one. And Finally: Props to Boeing, formerly of Seattle, for matching a recent generous gift of $15 million from the family of the late Bill Boeing Jr. to science, technology, engineering and math (STEM) education programs at Seattles Museum of Flight. Keeping the regions aerospace heritage  or any heritage, for that matter  alive is a good thing.]", "Date": "20150807", "Author": "[NULL]", "Link": "http://www.seattletimes.com/seattle-news/percy-harvin-bombshell-players-wouldnt-ball-with-him/", "Title": "[Percy Harvin bombshell: Players wouldnt ball with him]"}