{"Content": "[ Seattle is not known as a hotbed of support for conservative Republican presidential candidate Ted Cruz. But local supporters of the Texas senator say hes planning a brief fundraising stop in the liberal city on Tuesday. Cruz will attend a $2,000-per-person fundraiser at the Washington Athletic Club in downtown Seattle, according to invitations circulated online in recent weeks. Virginia Schloredt, a local Cruz supporter organizing the fundraiser, said the Seattle event will run from 5 to 7 p.m. Tuesday, but declined to confirm the location, saying it is a private event. Steve Beren, spokesman for the Washington State Republican Party, said he heard the event was taking place downtown but had no additional information. The Cruz campaign did not confirm his visit or respond to multiple requests for comment. The Seattle stop was not listed on his campaigns public calendar, which shows him being in Wyoming on Wednesday. But Schloredt said she and other local Cruzers are thrilled to speak with the senator they view as a standout defender of liberty in the GOP field. About 70 people are expected to attend Tuesdays event. This will be the first chance I get to meet the man I adore like I do Ronald Reagan, said Schloredt, of Stanwood. Cruz wouldnt be the first presidential candidate to slip into the Seattle area to raise money quietly while avoiding public appearances. Democrat Hillary Rodham Clinton and Republicans Jeb Bush and Marco Rubio each have made recent visits accessible only to big donors. Democratic candidate Bernie Sanders took a different approach for his Seattle stopover this month, appearing at two big public rallies  one of which was disrupted by Black Lives Matter protesters. In Cruzs case, he may have extra reason for keeping a low profile. Hes spent much of his time in recent weeks touring Cruz Country  mostly Southern states. Seattle isnt the most friendly town to us tea-party, change-the-world people, said Schloredt.]", "Date": "20150817", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/supporters-say-ted-cruz-planning-seattle-fundraiser/", "Title": "[Supporters say Ted Cruz planning Seattle fundraiser]"}