{"Content": "[ WASHINGTON (AP)  John Catsimatidis, a Manhattan grocery chain owner, gave as much money as allowed to Hillary Rodham Clintons Democratic primary campaign. Two months later, he gave the same amount, $2,700, to Jeb Bush, her would-be Republican challenger. Ive been friends with both of their families for many, many years, he said. They both love America, and Id be happy if either of them won. The billionaire is one of at least 60 donors hedging their bets heading into 2016 by giving to presidential campaigns of both parties, an Associated Press review of federal campaign finance records found. While those contributions totaled only about $300,000, they are an odd wrinkle of presidential politics in a race expected to see 22 candidates vying for billions of dollars in contributions. Even more people  at least 350  gave to multiple candidates within the same party, the data show, reflecting a sense of uncertainty among the donor class eying a crowded Republican primary with no clear front-runner but an array of strong candidates, governors, senators and business leaders among them. The reports Wednesday to the Federal Election Commission represent the first detailed look into how hundreds of thousands of Americans have opened their wallets with the general election still a year and a half away. The campaign contribution reports so far cover the first three months of the presidential race. But they dont yet detail the expected hundreds of millions of dollars flowing into separate super PACs not directly controlled by the candidates. This election, donors can give a maximum of $2,700 to each candidates campaign, but they face no limits when it comes to writing checks for the super PACs specially tailored to boost candidates election chances. The 2016 presidential election has barely begun, and already donors have poured some $400 million into it, according to an Associated Press tally of FEC records and fundraising totals provided by just some of the groups that havent yet reported. The heavy giving will continue  and some of it will be strategically spread between both parties in hopes of building alliances with the eventual winner. A ruling last year by the Supreme Court means the bet-hedgers like Catsimatidis dont need to make up their minds anytime soon. Until then, contributors had to carefully choose which candidates and party committees they wanted to support because they were limited to giving a total of $123,000 apiece for each two-year election cycle. Thats no longer the case, providing a clearer path for people like Catsimatidis to spread their largess. I write so many checks, I forget who I write them to, Catsimatidis said. Campaign records show that he also gave to South Carolina Sen. Lindsey Graham and Texas Sen. Ted Cruz, both Republican presidential hopefuls. And he thinks he has forked over money to groups helping ex-Texas Gov. Rick Perry and Wisconsin Gov. Scott Walkers presidential ambitions, too, he says. Explaining why he favors many, rather than one, he said, My money gives them the ability to be heard by others. Candidate shopping, if money is any guide, sometimes means party-hopping. Thats how Shawn Seipler, founder of Clean the World, a Florida-based nonprofit company that recycles soap, found himself at fundraisers for Clinton  and, days later, Bush. He paid $500 to attend Clintons and $2,700 for Bushs. Theyre two of the leading candidates, and theyve both got some great messages and great agendas, said Seipler, a registered Republican who said he likes ideas in both parties and said he jumped at the chance to hear directly from them. If either of them became president, he said, Im happy. Hes also interested in a third contender: Florida Sen. Marco Rubio, a Republican whom hes met with the senators father. Kenneth Abramowitz, a New York investor who has given $1,500 or more to four different GOP candidates, said his donations are all tied to events. I want to meet them and hear them out, and I cant do that unless I pay to go, he said. He said he is not committed to any one of the primary contenders. Overall, the financial backers of both Clinton and Bush have given more than $176 million so far to their campaigns and the super PACs specially designed to boost them. Mega donations are made possible thanks to a series of federal court rulings, including the landmark Citizens United case, which struck down previous restrictions on campaign finance laws.]", "Date": "20150716", "Author": "[JACK GILLUM, Julie Bykowicz]", "Link": "http://www.seattletimes.com/nation-world/hedging-bets-in-2016-some-donors-give-to-bush-and-clinton/", "Title": "[Hedging bets in 2016: Some donors give to Bush and Clinton]"}