{"Content": "[ On May 23, 2003, I attended the Baghdad news conference at which the U.S. viceroy, Paul Bremer, announced he was dissolving the Iraqi army. I thought of that day when I read of Wednesdays confrontation between 19-year-old student Ivy Dietrich and Jeb Bush, who had been blaming President Obama for the rise of the jihadis. She told the former Florida governor, Your brother created ISIS. Dietrichs claim was blunt but still right on the money. It should serve as a warning to 2016 presidential contenders: Using the Iraq war as a political club against the opposition can boomerang. Obama, too, has erred on Iraq, but the origins of ISIS go back to before he took office, and stem from mistakes made at the beginning of the war. Twelve years ago, Bremer axed tens of thousands of military officers with guns who were let go without pensions or severance. His order propelled the birth of an armed Sunni resistance among ex-Iraqi officers, which morphed into al-Qaeda in Iraq and now ISIS. Bremers decision reflected the Bush administrations lack of coherent planning about what to do after the U.S. invasion. Before the war, the U.S. military had recognized the danger of disbanding Iraqs armed forces, at a time of high unemployment and great social upheaval; it had planned to dissolve the units closest to Saddam Hussein, while vetting the rest and creating a smaller force to help rebuild the country. But Bremer changed the plan, apparently without consulting top U.S. military or State Department officials. After his announcement, I rushed to knock on doors in a Baghdad neighborhood populated by senior Sunni army brass, and heard the same message: We laid down our arms, as you asked in leaflets dropped from your planes, and this is how you reward us. We will fight you. I was reminded of that warning last month on a trip to Iraq, where U.S. military officers who have already served multiple tours in the country are trying, again, to rebuild the Iraqi army  so it can help drive ISIS out of Iraq. U.S. officers say there is a feeling of dj vu. The U.S. military worked hard to rebuild Iraqs security forces in the 2000s, but they collapsed during the ISIS invasion last summer. The Shiite-led government of the previous prime minister, Nouri al-Maliki, had packed the corps with officials chosen on the basis of Shiite sect or bribes to political officials, including Shiite militiamen who lived and trained in Tehran. Professional military men were mostly kicked out under Maliki. The (current) Iraqi army was not formed on any real structure, and lacks a common understanding of leadership, said Raad al-Hamdani, a former general in Husseins army. This is an army without discipline or good morale. The recent capture of the key Iraqi city of Ramadi by the Islamic State, after Iraqi security forces fled, further underscores the accuracy of the generals words. Hamdani, a respected military professional cleared of any political crimes, now lives in Amman, Jordan. Thats because former Sunni army officers became targets for assassination by Shiite militias. Many of these officers have valuable expertise that would be helpful in defeating ISIS, but because they are Sunnis (and former Baath party members) few if any will be called on to help. Under such conditions, many ex-officers grew beards and morphed into jihadis in the last decade and became the backbone of al-Qaeda in Iraq. Others played key roles in ISIS, which helps explain why the organization has been fairly successful militarily. Bremers and George W. Bushs Iraq errors of omission and commission continue to resonate. None of this absolves Obama from responsibility for his role in ISISs emergence. Most glaring was the strong U.S. support for Maliki after he lost a close election in 2010. U.S. officials should have tried harder to help the winner, Iyad Allawi, form a government. As a secular Shiite, Allawi was far more skeptical of Iran and he might have allayed the Sunni resentments that helped fuel ISIS. But to blame the rise of ISIS only on Obama requires a blatant rewriting of history. The seeds of ISIS were planted when Bushs policies disempowered Sunnis and empowered Shiite religious parties and militias. Bush opened the door to massive Iranian influence in Iraq as the ayatollahs rushed to support fellow Shiites, which scared some Sunnis into supporting the jihadis. So, yes, Ivy Dietrich, a careless Iraq war sowed the seeds for ISIS, although Obamas lack of interest helped facilitate ISISs expansion. Instead of using the Iraq case as a political football, candidates of both parties would benefit from greater introspection. Its time for more serious thinking about how to help clean up the mess that America helped create in Iraq.]", "Date": "20150518", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/blame-for-islamic-state-rise-shared-by-two-presidents/", "Title": "[Blame for Islamic State rise shared by two presidents]"}