{"Content": "[ WASHINGTON (AP)  Prime Minister Shinzo Abe offered condolences Wednesday for Americans killed in World War II in the first address by a Japanese leader to a joint meeting of Congress, but stopped short of apologizing for wartime atrocities. Abe came to Capitol Hill after a morning visit to a Washington memorial to more than 400,000 American service members who died in the conflict. His remarks to a packed chamber a day after meeting President Barack Obama were warmly received by lawmakers. My dear friends, on behalf of Japan and the Japanese people, I offer with profound respect my eternal condolences to the souls of all American people that were lost during World War II, he said, prompting his audience to rise in applause. But he skirted another issue that some U.S. lawmakers had also been urging him to address in what is the 70th anniversary year of the end of war  the sexual slavery of tens of thousands of Asian women by Japans military, which remains a sore point with another staunch U.S. ally, South Korea. One of the few dozen surviving Korean victims, Yong Soo-lee, 87, was in the gallery to watch Abes address, seated in a wheelchair. Instead, the Japanese prime minister expressed feelings of deep remorse over the war. He acknowledged that our actions brought suffering to the peoples in Asian countries, we must not avert our eyes from that. That wont satisfy his critics, who want Abe to do more than uphold the apologies for wartime abuses made by his predecessors. Democratic Rep. Mike Honda, who invited Yong to attend, said it was shocking and shameful that Abe was evading his governments responsibility over atrocities committed by the Imperial Army against so-called comfort women. Since winning election in December 2012, Abe has been strong advocate of closer ties with the U.S. a message he hammered home Wednesday. He vowed to enact legislation by this summer to facilitate closer cooperation with the U.S. military, in support of new U.S.-Japan defense guidelines endorsed by the two leaders on Tuesday. Abe said the U.S. and Japan must take the lead in completing a 12-nation trans-Pacific trade pact. That got a lukewarm response from Democrats but warm applause from Republicans  reflecting the division in Congress on the issue. Abe has arrived amid a bruising battle in Washington over legislation that would give Obama the authority to negotiate the Trans-Pacific Partnership, or TPP, a cornerstone of his second-term agenda. In a reversal of politics-as-usual, its Obamas own Democratic base that opposes him, and Republicans who support the deal. The TPP goes far beyond just economic benefits. It is also about our security. Long-term, its strategic value is awesome. We should never forget that, Abe said. The Japanese leader is a firm supporter of a stronger U.S. presence in the region, both militarily and economically, as China, which in recent years has eclipsed Japan as the worlds second-largest economy, asserts itself as a global power. Hes taken some political hits at home for pushing the trade pact and for loosening the restrictions of Japans pacifist constitution to open the way for Japans military to take a more active supporting role to the United States, which has nearly 50,000 troops based there. Dozens of Japanese leaders have visited the U.S. since the war, but Abes invitation to speak to Congress sets him apart from his predecessors. While past Japanese prime ministers  including Abes own grandfather, Nobusuke Kishi, in 1957  have addressed the House, it was the first time for a leader of the East Asian nation to speak to both chambers. Republican Sen. John McCain said the speech was a historic recognition of two peoples reconciled with their shared history. He expressed gratitude for Abes recognition of American sacrifices in World War II. But Jan Thompson, president of the American Defenders of Bataan & Corregidor Memorial Society, which represents U.S. veterans who fought in the Philippines and were forced into slave labor in Japan, expressed disappointment. She said it was deeply disturbing that Abe had offered sympathy to victims of a war that Japan started, but did not acknowledge responsibility. Noting that Abe told lawmakers that history is harsh, she said she agreed, but added: history is ultimately harsher on those that deny it. ", "Date": "20150429", "Author": "[MATTHEW PENNINGTON]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/japan-pm-to-make-historic-address-to-congress-talk-trade/", "Title": "[Japan PM offers condolences for WWII dead in historic speech]"}