{"Content": "[ AUSTIN, Texas (AP)  Rick Perry has raised so little money for his second-chance presidential bid that hes stopped paying his campaign staffers, the kind of cash crisis that could normally sink a candidate. But the former Texas governor has well-funded super PACs that say theyre ready to step in and keep his message afloat at least through the Feb. 1 caucuses in Iowa, where Perry has spent more time than any other White House hopeful. Its the latest sign of how influential outside groups  armed with small cadres of million-dollar donors  are reshaping presidential politics. Perry raised only about $1 million in his first month of campaigning, a sum that isnt enough to cover his payroll. A pair of pro-Perry outside groups, each with Opportunity and Freedom in its name, amassed almost $17 million over the same period. Those groups, both super political action committees, are barred by federal rules from talking directly to the candidate they support. But it became apparent recently to Austin Barbour, the Republican operative who leads them, how important their role would have to become. The groups began spending money not just on advertisements, but also on employees who can fill roles normally left to the traditional campaign. They hired an Iowa director and deputy director, who now are putting together a super PAC-run ground game in the state that weighs in first in the presidential nominating season. Barbour said hes prepared to hire staff in other early primary states, if necessary. We saw in the campaign finance reports that they didnt raise as much as anyone would have liked, and we knew what that meant  that they were going to have to go lean and mean while we would need to diversify what we were doing to help the governor, Barbour said. Were building Perrys Iowa team. Theres nothing in the playbook that says we cant do that as a super PAC. Even with so much outside help, money problems plaguing Perrys campaign this early could leave future donors  as well as potential primary voters  wondering whether he can survive for the long haul in the crowded a GOP field. Another potential fundraising blow came last week when Perrys low national polling numbers kept him off the prime-time debate stage, which reached 24 million Fox News viewers. Its the deterioration of the campaign, and theres no pretty face, no makeup you can put on it, said Bill Miller, a Texas-based GOP strategist. Its like a NASCAR race. He doesnt have the pole position, and now he doesnt even have a full tank of gas. Yet reports on Tuesday of Perrys money troubles prompted a longtime friend of the former governor to give the super PACs $100,000, Barbour said, declining to name the contributor. Perrys official campaign is continuing as best it can, said Jeff Miller, his campaign manager. All but one staff member has agreed to continue working without pay, and Perry will be in South Carolina later this week before returning to Iowa next week, Miller said. Are we raising as much money as wed like to? No. Are we still going to continue the governors regular visits every week to early states? Yes, Miller said. The Perry campaigns Iowa state chairman, Sam Clovis, said Tuesday he would continue working as a volunteer. I know everything there is to know about running a campaign with very little money, Clovis said. Perrys not alone in relying heavily on super PACs. Louisiana Gov. Bobby Jindal and former technology executive Carly Fiorina are leaning on outside groups to build their name recognition. Former Pennsylvania Sen. Rick Santorums ex-campaign manager and two other staff members recently left his financially troubled campaign to form a super PAC supporting him. And former Florida Gov. Jeb Bush has a massive super PAC ready to help him with voter outreach. In 2012, the support of a super PAC helped former House Speaker Newt Gingrich win South Carolinas primary and continue competing for the presidency after traditional campaign money dried up. Donors can give $2,700 maximum per election to campaigns, but there are no limits on what they can give to super PACs. Dallas businessmen Kelcy Warren and Darwin Deason gave a total of $11 million to the super PACs backing Perry, even though Warren also serves as the finance chairman for Perrys official campaign. The super PACs would have to wait 120 days to bring aboard anyone currently with the Perry campaign. Barbour said the groups have hired different people, while refusing to say how many are now on the payroll. Opportunity and Freedom has spent more than $2 million so far on pro-Perry ads and will continue to provide such messaging. ", "Date": "20150811", "Author": "[WILL WEISSERT, Julie Bykowicz]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/perrys-cash-strapped-2016-campaign-stops-paying-staffers/", "Title": "[Can super PAC support save cash-strapped Perry bid?]"}