{"Content": "[ WASHINGTON (AP)  When Jeb Bush said he wasnt sure the country needs to spend a half billion dollars for womens health issues, many viewed the remark as a gaffe and the Republican candidate for president rushed to clean it up. A week later, its all but forgotten  thanks to Donald Trump. The billionaire businessman cracked a joke during last weeks GOP debate when asked about calling some women fat pigs and disgusting animals, later said he couldnt remember using such words, and then attacked the popular female Fox News host who questioned his history of making such insults. Next to Trump, the other Republican candidates look like Gloria Steinem, said Penny Young Nance, president of the conservative Concerned Women for America. Amid a concern the Trump tsunami may be hurting the GOPs standing with women, there is also a worry for Democrats who initially viewed his rhetoric as a net positive for their party. Some now fear his bluster has made others in the GOP field appear moderate by comparison and could affect the partys ability to maintain a hold on a voting bloc thats probably critical to winning the White House. Democratic presidential candidate Hillary Rodham Clintons team has tried to emphasize the records of other Republican candidates in recent days, highlighting their opposition to abortion rights and their calls to defund womens health services offered by Planned Parenthood. It hasnt been easy. At a Monday news conference in New Hampshire, Clinton fielded seven questions about Trump, trying again and again to refocus the conversation on the anti-abortion platforms of other Republicans. What a lot of the men on that stage in that debate said was offensive. And I want people to understand, if you just focus on maybe the biggest showman on the stage, you lose the thread here, Clinton said. Well let the Republicans go back and forth with each other, but I want to point out, theres really not that much difference in the policies they are proposing when it comes to women, she added. Republican leaders acknowledged the need to improve the GOPs standing among women, who constituted 53 percent of the national electorate in 2012 and have favored Democrats in every presidential election in the last quarter century. Successful Republican candidates have won only by limiting Democrats advantage with women. President Barack Obama, for example, won women by 11 percentage points over Republican Mitt Romney in 2012, according to exit polls. The GOPs last successful candidate, President George W. Bush, lost women by just 3 percentage points in 2004. While some people are excited by fat jokes and stupid jokes, I think there are a lot of people in the general election, independents as well as probably many of the women voters, who arent really that entertained by this, said GOP presidential candidate Rand Paul, also a Kentucky senator. Trump may have garnered the most attention, but several Republicans candidates have emphasized priorities that could alienate women in recent weeks, including escalating attacks on Planned Parenthood. Republicans have seized on videos secretly recorded by anti-abortion rights activists that show Planned Parenthood officials clinically describing how they sometimes provide fetal tissue to medical researchers. The organization has said its staff has not engaged in any wrongdoing or agreed to violate any legal or medical standards. While such criticism is popular among conservative primary voters who are adamantly opposed to abortion, its unclear how the argument will resonate in 2016 with independents and moderates, many women among them, who are likely to decide the general election. In last weeks debate, Rubio said he had never advocated for bans on abortion that include exceptions for pregnancies resulting from rape or incest. Polls suggest Rubios position is out of line with the overwhelming majority of voters. This is really good, Clinton campaign manager Robby Mook said after watching Rubios response. Heading into 2016, GOP officials hoped to feature women in prominent positions, in line with recommendations from a post-election report compiled by the Republican National Committee after Romneys loss to Obama. Yet the GOPs only female presidential candidate, former technology executive Carly Fiorina, did not qualify for the partys prime-time debate last week. Democrats, of course, feature Clinton, who aims to be the first nations first female president. Our party has some work to do, said Katie Packer Gage, a former Romney aide who leads a political firm that helps Republicans connect with women. On Trump, she said, most people do see him as a bit of a sexist and misogynist but that most of the Republican candidates are trying to figure it out relative to connecting with women. Trump tried to turn the tables during a Tuesday interview on CNN, charging that hed address womens health issues better than his Republican rivals. While he opposes abortion rights, Trump favors exceptions for rape, incest and the life of the mother. He added that Bush should apologize to women for last weeks criticism of the cost of womens health care. Bush said shortly after the comment that he misspoke. I will be so good to women, Trump said. I cherish women. ", "Date": "20150811", "Author": "[STEVE PEOPLES, Lisa Lerer]", "Link": "http://www.seattletimes.com/nation-world/trump-bombast-overshadows-gop-challenges-with-women/", "Title": "[Trump bombast overshadows GOP challenges with women]"}