{"Content": "[ WASHINGTON  In a stairway just off the floor of the U.S. House of Representatives, Rep. Ami Bera walks past a portrait nearly every day of the late Rep. Dalip Singh Saund, a Democrat from California elected in 1956 and the first Indian American  in fact, the first Asian American  to serve in Congress. While their ranks in Congress have not swollen, Indian Americans have been making political inroads, from city councils to state capitols. One is even flirting with running for president. We certainly are looking at how to get Indian Americans more engaged in politics, said Bera, a Sacramento County physician and the sole Indian American in Congress. They should think about running for office. Seattle City Councilmember Kshama Sawant, the Indian-born former computer engineer and community-college instructor who knocked off incumbent Richard Conlin in 2013 under the banner of the Socialist Alternative Party, has rapidly become one of the councils most influential members. Sawant, 42, grew up middle class in Mumbai with a civil-engineer father and a schoolteacher mother, and later earned a Ph.D. in economics from North Carolina State University. Meanwhile, Indian-American activist Pramila Jayapal became the first Indian immigrant elected to the Washington Legislature in November. Asian Americans, which include Indian Americans, are the fastest-growing demographic group in the United States, according to the Pew Research Center. Nearly 600,000 of the countrys 3.1 million Indian Americans live in California, including a number of notable elected officials. Besides Bera, who was born in Los Angeles to immigrant parents, they include California Attorney General Kamala Harris, who could become the first Indian American elected to the U.S. Senate. Ash Kalra, a member of the San Jose City Council, is running to become the first Indian American elected to the California legislature. The longer the Indian-American community has been in this country, the more it has matured, Kalra said. And part of that maturity is becoming more politically active. Bera, who has endorsed Harris to succeed retiring Democrat Barbara Boxer, could be joined in the House next year by Kumar Barve, former majority leader of the Maryland House of Delegates. Barve is running for the House seat of Rep. Chris Van Hollen, a Maryland Democrat who is a candidate for the Senate seat of another retiring Democrat, Barbara Mikulski. Barve said he won his first election with hardly any Indian-American votes. Even today, Asian Americans account for only 8 percent of the population of the congressional district he seeks to represent. We have to prove ourselves to a very diverse electorate, which I think makes stronger elected officials, he said. Though Americans of Indian descent account for only 0.1 percent of the U.S. population, they are the most affluent and best educated of any immigrant group in the country, according to Pew. They lean strongly toward Democrats, yet two Republican governors, Bobby Jindal of Louisiana and Nikki Haley of South Carolina, are of Indian descent. They include doctors, engineers, tech entrepreneurs and educators, and form a rich donor base. However, Indian Americans are more spread out than other ethnic groups, and Indian-American candidates in expensive races often have to go out of state to raise money. Harris will have to seek contributions to run in California, which has some of the costliest media markets in the country. Asian Americans could be crucial to her campaign. When it comes to political contributions, that aspect of her identity will become important, said Karthick Ramakrishnan, associate dean of the School of Public Policy at the University of California, Riverside. Having a large concentration of Indian Americans in your state or district doesnt always translate to victory, nor does a lack of Indian or Asian-American voters mean defeat. Technology lawyer Ro Khanna, a Democrat who was born in Philadelphia, ran last year in Californias 17th Congressional District. It is home to about 100,000 Indian Americans, more than any other House district in the country. It encompasses much of Silicon Valley, and Khanna leveraged the deep pockets of the tech sector. Though he outspent incumbent Democrat Mike Honda, he lost a close race. Indian Americans are only 2.4 percent of the population in Californias 7th Congressional District, where Bera has won twice, though narrowly. He did so last year in challenging political terrain: a district whose party registration is evenly divided, a midterm election with low turnout and against a Republican, Doug Ose, who had been elected to Congress before. James Lai, director of the ethnic studies program at Santa Clara University, said Beras success involved focusing on issues important to the district, including jobs and the economy, health care and education. Harris will likely run on her accomplishments as state attorney general. Any successful candidate of Asian descent will have to run as kind of a mainstream candidate, Lai said. You always have to go to your constituency. A Pew Research Center report last year found that 65percent of Indian Americans identified as Democrats or leaned toward the party, the highest level of affiliation among Asian-American groups. Asian Americans generally have trended away from the Republican Party in the past two decades, and that trend includes Vietnamese Americans, a group once reliably Republican. The partys stance on immigration is a major factor, political observers say, as well as security policies enacted after 9/11 that increased racial profiling. The Republican Party has a long way to go with Asian Americans, Lai said. Republicans Haley and Jindal succeeded by aligning themselves with their states largely white, conservative electorates. Both have twice been elected governor of their states. Jindal, who previously served in Congress, is considering running for president in 2016. Last year, former U.S. Treasury Department official Neel Kashkari, a Republican who worked for President George W. Bush, defeated a tea-party favorite in Californias Republican primary for governor. Still, in a year that favored Republicans almost everywhere else in the country, he lost by a wide margin to three-term Gov. Jerry Brown. It could be a very different outcome for Harris, the twice-elected state attorney general widely considered the front-runner in the California Senate race. Harris, whose mother is Indian American and whose father is Jamaican American, would be the first Asian or black American elected to the Senate from California. She is running in a presidential-election year, which means higher voter turnout overall and more Democrats coming to the polls. Her candidacy showcases the diversity in the Asian-American community and has generated a lot of excitement, said UC Riversides Ramakrishnan, whos extensively studied Asian-American voters and candidates. Shes a formidable candidate who has a lot of support in many communities, not just Asian Americans, he said.]", "Date": "20150405", "Author": "[Curtis Tate]", "Link": "http://www.seattletimes.com/nation-world/indian-americans-on-rise-in-local-national-politics/", "Title": "[Indian Americans on rise in local, national politics]"}