{"Content": "[ Like a lot of people who pay attention to such things, I had assumed that Democrats had a huge advantage going into next years presidential race. Democrats do really well among the growing demographic groups, like Hispanics, single people and the young. Republicans, meanwhile, are doing sensationally well with just about every shrinking group. If 67-year-old rural white men were the future of the electorate, the GOP would be rolling. But theres a growing body of evidence to suggest that, in fact, Democrats do not enter this election with an advantage. There are a series of trends that may cancel out the Democratic gains with immigrants, singles and the like. We first began to notice these counterforces in the high-immigrant red states that were supposed to start turning purple by now  places like Texas, Arizona and Georgia. New types of voters have, indeed, flooded into these places, but as Ronald Brownstein points out in The National Journal, since 1992, Democratic presidential nominees have averaged only 44.5 percent of the vote in Georgia, 43.7 percent of the vote in Arizona and a pathetic 40.4 percent of the vote in Texas. Instead of turning pink or purple, these states have become more thoroughly Republican  from school board elections on up. Nationally, three big things are happening to at least temporarily hold off the Democratic realignment. First, the aging of the electorate is partially canceling out the diversifying of the electorate. People tend to get more Republican as they get older, and they vote at higher rates. And older people are moving to crucial states. In Arizona, Barack Obama won 63 percent of the young adults, but only 29 percent of the oldsters. This aging effect could have a big impact in the swing states of the Midwest, like Wisconsin, Ohio, Iowa, Michigan and Pennsylvania. These states have generally gone Democratic in presidential years, but its hard to miss the growing Republican strength at every other level. As Brownstein notes, Republicans have a 42-to-18 advantage in U.S. House seats in these states. They control the governorships in all but Pennsylvania. They control both statehouses in all these states save the Iowa Senate. Second, Democrats continue to lose support among the white working class. In 2008, Obama carried 40 percent of white voters with a high school degree. By 2012, that was down to 36 percent. As John B. Judis points out in a National Journal piece called The Emerging Republican Advantage, the tilt of the white working class to the GOP has been even more pronounced in other races. In 2006, Democrats got 44 percent of the white-working-class vote in U.S. House races. By 2014, they got only 34 percent. In 2009, Republicans had a 20-seat advantage in House districts that were majority white working class. Today, they have a 125-seat advantage. Most surprising, Democrats are now doing worse among college-educated voters. Obama won white college graduates in 2008, but he lost them to Mitt Romney in 2012. In Colorado, for example, Obama lost 8 points in his support from college-educated voters from 2008 to 2012. White college grads are drifting away from Democrats down-ballot, too. And, most significant, there are signs that Hispanic voters, at least in Sun Belt states, are getting more Republican as they move up the educational ladder. Surveys and interviews give us some sense of whats going on. Voters have a lot of economic anxieties. But they also have a template in their heads for what economic dynamism looks like. That template does not include a big role for government. Polls show that faith in government is near all-time lows. In a Gallup survey, voters listed dysfunctional government as the nations No. 1 problem. In fact, American voters traditional distrust has morphed and hardened. They used to think it was bloated and ineffective. Now they think it is bloated and ineffective and rigged to help those who need it least. When many of these voters think of economic dynamism, they think of places like Texas, the top job producer in the nation over the past decade, and, especially, places like Houston, a low-regulation, low-cost-of-living place. In places like Wisconsin, voters in the middle-class private sector support candidates who cut state pensions and pass right-to-work laws, so that economic governance can be more Texas-style. In short, economic philosophy is mitigating the effect of demographic change, at least for a little while longer. Political guru Charlie Cook asks: Will this be a Time for a Change election or will this be a Changing American Demographics election? I suspect it will be a Time for a Change election. The crucial swing voters will be white and Hispanic college graduates in suburban office parks. They are not into redistribution or that Sen. Ted Cruz opened his campaign at Liberty University. The 2016 campaign is starting on level ground.]", "Date": "20150329", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/the-2016-campaign-field-is-flat/", "Title": "[The 2016 campaign field is flat]"}