{"Content": "[ President Obamas plan to bypass Congress in shielding millions of immigrants from deportation is not the best way to do immigration reform. But if confrontation is what it takes to get House Republicans off their rear ends and deal with the problem, so be it. They dont even have to work too hard. The Senate has already written a good bill and passed it with votes from both parties. Its a comprehensive approach offering a path to citizenship for most of the estimated 11 million people who came here illegally and beefing up enforcement of the law. The measure could have passed the House on a bipartisan basis, but Republican House Speaker John Boehner didnt want to offend a conservative base opposed to any kind of amnesty. Thus, he refused to take up the bill. So what we now have is an immigration system without the beefed-up enforcement. We have the status quo. Obama tried  oh, he tried  to build confidence that these proposed immigration reforms would not fail as past ones had. He deported over 2 million immigrants at considerable political risk to Democrats. This and the lack of action on normalizing the status of those whove grown deep roots in this country may have cost the party key Hispanic support in the recent election. And what did Obama get in return from the House GOP? Zip. Now its hardball, and the ball is hurtling onto the Republican court. Fortunately, the Republican freshmen seem a more pragmatic bunch. They could dilute the power of a hard right for whom stopping Obama is the only creed  and it doesnt matter over what. Obamas executive action most likely will offer several million immigrants a reprieve against deportation. This is not a path to citizenship or permanent-resident green card. Its simply an assurance that for the time being, undocumented immigrants need not fear being removed. New arrivals will still be deported, as will those involved in criminal activity. If congressional Republicans dont like what Obamas doing, they have a remedy. They can write and pass an immigration law. We assume they havent forgotten how to do that over the past six years. Meanwhile, the tantrums have got to stop. Some on the right are already threatening to shut down the government, an antic sure to enrage the public. Boehner is talking tough  more to calm the fringe, we assume, than a reflection of his own views. Hes suggested a triple play: fighting the president tooth and nail, suing him and shutting down the government. Surely, Republicans dont want an ugly row over this issue. They dont want the likes of Rep. Steve King, R-Iowa, issuing ethnic slurs, and that will happen if they let this fester. Hispanic voters will be out in greater force come the 2016 presidential election. And though polls show Latinos more nuanced on immigration matters than the political stereotypes would have it, no one likes being demonized. Lets be clear on this: Our immigration laws, though generous, must be respected. We cant ignore the plight of low-skilled American workers suffering depressed wages and high unemployment in part because of competition from immigrants who came here illegally. America needs a new page on immigration, and that page cant be turned until we deal with the millions in this country illegally. Deporting many, many millions is not going to happen; its unthinkable. The great majority of unauthorized immigrants are fine people and hard workers. That said, future immigrants must have papers. Republican leaders should stop wasting time and get the job done  for the good of the country, as well as themselves. The immigration reform game must end. Froma Harrop is on Twitter @FromaHarrop. Her email address is fharrop@gmail.com.]", "Date": "20141117", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/end-the-game-on-immigration-reform/", "Title": "[End the game on immigration reform]"}