{"Content": "[ A young woman berated Jeb Bush in Reno, Nevada, on Wednesday for his brothers bungled war in Iraq, saying it had spawned the group calling itself the Islamic State. Your brother created ISIS, she declared. Bush said he respectfully disagreed. A middle-aged man pressed Bush to answer whether he would have supported the 2003 Iraqi invasion given the intelligence known today. Bush acknowledged mistakes but sprinkled in praise. I give him credit, he said of his brother, for the 2007 troop surge. By the mornings end, when a wary-sounding Bush told reporters, If I run, it will be 2016, not 2000, it almost came across as wishful thinking. Bush began exploring a presidential run by declaring that he would be his own man. But he is struggling to navigate his relationship with George W. Bush and his legacy. He has fumbled the most basic, predictable questions about the Iraq War  while behind the scenes, he has assured skeptical conservatives that he draws wisdom and important counsel from the former president. The uneasiness stems in part from the two mens awkward relationship, which was never close and was often competitive. But it also reflects Bushs challenge in trying to deal with a fractured electorate in which some conservatives cling to the former president, but he remains a focus of anger across much of the rest of the political spectrum. As he strains to win over Republican activists, particularly in crucial early-voting states like Iowa and South Carolina, Bush is being confronted with a distressing realization: He may now need to lean on his brother to survive the Republican primary, despite the damage that could do to Bush in a general election. In private conversations, Bushs allies have often taken note that his brothers approval ratings among likely primary and caucus voters are sky high. A Quinnipiac University survey this month showed George W. Bushs favorability at 81 percent among likely Republican caucusgoers in Iowa. People familiar with Republican polling in South Carolina say the former presidents numbers are similarly strong among primary voters there. I think in a Republican primary, especially, his brother is a tremendous asset, said Ari Fleischer, who was a White House press secretary during George W. Bushs tenure. In both states, conservative Christians, who were among the most devoted members of George W. Bushs coalition in 2000, are major factors. Jeb Bush, whose positions on immigration reform, education standards and other issues have cost him, could benefit from his brothers reflected glow with evangelicals. At the same time, Bush has sought to inherit his brothers support among neoconservatives. But his difficulty in measuring up to his brother in the eyes of those opinion-makers and donors was much in evidence over the past six weeks: In late March, his allies fielded angry calls from Sheldon Adelson, the casino billionaire who is a staunch supporter of Israel and gave tens of millions of dollars to super PACs in 2012, over a speech given by one of Bushs foreign policy advisers, James A. Baker III. But Adelson gave the former president a lavish reception when he delivered the keynote address in late April to a gathering of the Republican Jewish Coalition, for which Adelson is a major benefactor. Matthew Dowd, a strategist who worked on George W. Bushs 2004 campaign, warned that Bushs strong approval ratings do not translate into voters wanting to see his third term in office. And I think thats the quandary that Jebs now got himself in. Its more incumbent on him to say, Hes my brother, I love my brother, but this is how my presidency would look differently, and show that. Bush seemed to be approaching his brothers foreign policy record delicately from the first: In a major speech in Chicago in February, he articulated a recognizably muscular approach to global affairs but still declared himself my own man. Yet in recent weeks, as he strove to soothe supporters of Israel who questioned his commitment in closed-door meetings, Bush used his brothers record on Israel as evidence of his own reliability  and went on to describe his brother as the person he listens to the most on Mideast issues. It was a surprise to several of those who heard Bush say it  and to a number of people close to George W. Bush who learned of Bushs remarks after the fact. While the former president is said to be in touch with Jeb Bushs campaign from time to time, the two brothers do not speak frequently, according to people close to both men. Yet even as Bush seeks to present a forward-looking vision, he can count on having to answer questions about  if not answer for  his brothers two terms in office. If he is successful in winning the Republican nomination, Bush would probably be pressed on the issue of same-sex marriage  which his brother used as a wedge issue to boost conservative voter turnout in his 2004 re-election campaign. He could also face revived complaints about how his brothers administration responded to Hurricane Katrina in 2005. But first Bush must win over Republicans, whose economic views have grown increasingly populist since George W. Bushs last year in office. Anger over the bank bailouts of 2008 and the former presidents approach to government spending were important ingredients in the rise of the Tea Party movement, which has made the Republican Party vastly less hospitable to candidates seen to represent the partys establishment. But no issue is as fraught for Bush as the Iraq War. During a television interview this week, Bush suggested that he still supported invading Iraq even with hindsight knowledge about intelligence failures. He later said he had misunderstood an interviewers question, but refused to answer it, saying it was a hypothetical. On Wednesday, he said such hypotheticals were insensitive to the families of fallen soldiers in the war. Some of Bushs allies complain that he is in a no-win situation: Just as he will be faulted for embracing his brother, if he distanced himself from the former president he could be called disingenuous. At the town hall in Reno on Wednesday, where one attendee showed up clutching an article, cut out from the local paper, about Bushs latest remarks on the Iraq War, Mitch Brust, 72, and his wife, Pam, said they admired Bushs loyalty to his brother, no matter what private differences they may harbor. If they were not supportive of each other, Id be concerned, Mitch Brust said. That would fly in the face of their family values. Pam Brust, who said she had read George W. Bushs book about his time in office, Decision Points, nodded in agreement. Addressing a sizable crowd in a community centers gymnasium, Bush began by saying, First and foremost, I am proud to be George W.s brother. He added, I cant deny the fact that I love my family.]", "Date": "20150513", "Author": "[Maggie Haberman, Michael Barbaro]", "Link": "http://www.seattletimes.com/nation-world/college-student-to-jeb-bush-your-brother-created-isis/", "Title": "[College student to Jeb Bush: Your brother created ISIS]"}