{"Content": "[ WASHINGTON (AP)  Hillary Rodham Clinton has a message for the countrys wealthiest Democrats: I need you, unfortunately. Were going to have to do what we can in this election to make sure that were not swamped by money on the other side, the front-runner for the Democratic presidential nomination said Thursday. But when asked how she feels about encouraging large contributions to a group supporting her candidacy, she replied: Do I wish that we didnt have to be doing this? Yeah, I do. Clintons paradox when it comes to fundraising explain why, six months into the 2016 race for president, Democrats are barely in the conversation when it comes to the groups known as super PACs. The groups, which unlike formal campaigns can accept contributions of any size, will formally report their fundraising totals Friday to federal regulators. But most of those aligned with specific presidential candidates have already said how much they raised between January and the end of June. So far, they account for roughly $2 of every $3 given in the 2016 presidential race, with the vast majority of those donations aimed at helping Republicans win back the White House. Less than 9 percent of the money given to candidate-specific super PACs so far will benefit Clinton and her rivals for the Democratic nomination, according to an Associated Press analysis. The AP compared money raised by formal presidential campaigns with what the super PACs say they plan to report having raised on Friday. The main pro-Clinton group, Priorities USA Action, raised $15.6 million in the first half of this year. That puts it behind super PACs pledged to support five contenders for the Republican nomination, including one whose polling numbers are so weak that he may not even qualify to take part in next weeks GOP debate. We all have to get real about the clown car of Republican candidates that could very well be the limousine the next president is riding around in, said Damian ODoherty, who heads up the super PAC helping Democratic candidate Martin OMalley. Clinton would appear to be a candidate readily able to land million-dollar donors to a super PAC backing her candidacy. She has more than two-dozen years in the presidential spotlight, dating to her husbands first run for the White House, and strong ties to big-money power bases on Wall Street, in Hollywood and among organized labor. And some of the top donors in Democratic politics have given massive checks to Priorities, including entertainment executive Haim Saban, whose $2 million gift makes him the largest donor to the super PAC so far, and hedge fund billionaire George Soros at $1 million. But while Priorities collected from about 30 donors in the first six months of the year, the super PAC helping Republican candidate Jeb Bush persuaded 9,900 contributors to give a record haul of $103 million. Bushs super PAC also has more than a dozen contributors who have given at least $1 million, with the top donor, Miami health care investor Miguel Mike Fernandez, giving $3 million. The bottom lines for super PACs backing four other GOP contenders: $38 million for Texas Sen. Ted Cruz, $26 million for Wisconsin Gov. Scott Walker, $16 million for Florida Sen. Marco Rubio and $16.8 million for former Texas Gov. Rick Perry  who may not have the poll numbers needed to make the top 10 cutoff for the first GOP debate. Priorities, at least, can measure its donations in the millions. Generation Forward, the super PAC organized to help OMalley, raised just $289,000 since the former Maryland governor announced his candidacy at the end of May. The three other contenders dont appear to have any outside help, while Vermont Sen. Bernie Sanders has bluntly said, I will not have a super PAC. The difference is driven in part by that attitude. Democrats have largely condemned the 2010 decision of the Supreme Court in the case known as Citizens United that, along with subsequent court and regulatory actions, created the super PAC and the era of unlimited donations. Clinton, for example, said at the outset of her campaign that opposition to the Supreme Court ruling would be a litmus test for her nominees to the high court. As Mitt Romney and other Republicans began raising hundreds of millions of dollars through super PACs in 2012, President Barack Obama reluctantly blessed Priorities, which some of his former aides created. Yet he appeared as a featured speaker at only one of its donor gatherings. The Obama campaign treated Priorities like an unwanted stepchild, said Steven Law, president of American Crossroads, one of the best-funded super PACs dedicated to helping Republicans. That on-again, off-again relationship affects donor behavior. But ODoherty, the head of the pro-OMalley super PAC, predicted that as the stakes become clear, Democratic donors will begin opening their wallets to super PACs, even if theyre still a little bit contemptuous of these organizations. Clintons allies have set lofty goals for fundraising: Priorities hopes to at least triple the $80 million it raised for Obama. The group, which began a fundraising push when the former secretary of states aides came aboard in May, secured $14.5 million in new commitments in July, said a person familiar with the groups fundraising, speaking on condition of anonymity to discuss details that wont be made public for another six months. Bill Burton, one of the former Obama aides who started Priorities and isnt involved with the group this time, said would-be Democratic super PAC donors are probably waiting to feel like their money could make a difference. Priorities biggest fundraising boon came the day after the first 2012 general election debate, Burton said, when Obamas performance was widely panned. Nothing inspires donors like sheer panic, he said. __, Associated Press writer Lisa Lerer contributed to this report. ", "Date": "20150731", "Author": "[Julie Bykowicz]", "Link": "http://www.seattletimes.com/seattle-news/politics/democrats-far-behind-gop-in-raising-money-for-16-super-pacs/", "Title": "[Democrats far behind GOP in raising money for 16 super PACs]"}