{"Content": "[ After claiming victory in SeaTac, backers of a $15-an-hour minimum wage are turning their attention to Seattle. Labor activists who backed the measure that raises wages for airport-related workers in SeaTac said Wednesday that the push is on to raise Seattles wage floor to $15 for all workers. There is going to be a debate about a $15 minimum wage in Seattle, and it will be led by our new mayor, said David Rolf, president of the Service Employees International Unions (SEIU) Seattle-based Healthcare 775 NW local., There are citizens who are perfectly ready to move an initiative to ballot next year if an agreement cant be reached at City Hall between labor and business, he said. But Im hopeful that we can engage in a reasonable dialogue about how to get to $15. SeaTac Proposition 1 creates an hourly minimum wage of $15 for hospitality and transportation workers in and around the Seattle-Tacoma International Airport. With 3,942 votes counted as of Wednesday, Proposition 1 led 53 percent to 47 percent  a difference of 236 votes out of a total of 12,100   registered voters citywide. Proposition 1 supporters said they registered nearly 1,000 new SeaTac voters in the run-up to the election, and new voters tend to cast last-minute ballots. Washingtons mail-in voting system means ballots could be postmarked as late as Tuesday, so vote counting will continue through Friday. The measures opponents said they remain cautiously optimistic., There still are so many more votes to be counted, said Scott Ostrander, general manager of Cedarbrook Lodge in SeaTac and co-chair of a business-backed political committee opposed to the measure. But Heather Weiner, spokeswoman for Yes! for SeaTac, a union-backed political committee that supports Proposition 1, said, We expect the lead to hold or widen over the next couple of days.  Rolf, who is also an    SEIU vice president, said hes confident Proposition 1 will pass and build momentum for a minimum-wage increase beyond SeaTac and even Seattle. I had an elected official from Lynnwood come up to me Tuesday night and say, You should think about this in Lynnwood, Rolf said. It is a signal from the future. Its telling us that voters and the public are sick of waiting for politicians and CEOs to do the right thing. The push for a $15 minimum wage comes amid widespread concern about income inequality and a lack of jobs that provide middle-class pay and benefits. Seattles mayor-elect, Ed Murray, seized on the issue last summer as fast-food workers nationwide called for a $15-an-hour living wage.  Murray pledged to raise Seattles hourly wage floor to $15, and incumbent Mike McGinn vowed to go even higher if the City Council agreed.  Murray has said he backs a phased-in approach, starting with city workers and then extending it to employees of national fast-food chains and retailers. Wednesday, Murray told reporters hell bring both business and labor to the bargaining table. I think there is interest from both sides to do this collaboratively  dare I use the word  versus ending up with a ballot measure, Murray said. Although he did not offer a precise timeline, Murray said he would work on the issue   early in his administration and hoped to have a $15 minimum wage by the end of his first term, with protections for small businesses and others. Maud Daudon, president and CEO of Seattle Metropolitan Chamber of Commerce, said shes encouraged that Murray wants a robust discussion. The chamber opposed SeaTac Proposition 1, but has not yet declared its position on a $15 minimum wage in Seattle, Daudon said. Our fervent hope is that we can bring the problem-solving, solutions-based approach of business to this issue, she said. Supporters of a minimum-wage increase say it would lift low-wage workers out of poverty and strengthen the economy. Opponents say it would force businesses to cut staff and raise prices. The idea of giving low-wage workers a pay raise is gaining momentum. Also Tuesday, voters in New Jersey overwhelmingly approved a measure to raise the states minimum wage by a dollar to $8.25 an hour and to peg it to inflation. That makes New Jersey the 11th state, including Washington, to require annual inflation adjustments. Nationally, the federal minimum wage has been at $7.25 an hour since 2009. On Jan. 1, Washingtons minimum wage will increase by 13 cents to $9.32, the highest of any state. Congressional Democrats are calling for a hike in the federal minimum wage to $10.10. But with Congress in gridlock, local policymakers are taking matters into their own hands, said Paul Sonn, of the National Employment Law Project. Were going to see more cities call for higher minimum wages, Sonn said. More and more college graduates are working in jobs like retail or restaurants. These jobs are becoming a bigger part of our economy, and cities and states are struggling with that. Four major California airports already require their tenants to pay minimum wages well above the statewide standard. At Los Angeles International Airport, workers are guaranteed an hourly minimum of $10.91, or $15.67 without health benefits., California lawmakers in September committed to boost the states hourly minimum standard from $8 to $10 by 2016. In Albuquerque, N.M. and San Jose, Calif. voters last November raised local wage floors. And in New York City, Mayor-elect Bill de Blasio, who tapped voter frustration with rising income inequality, supports a separate minimum wage above the statewide rate. If you pay workers a living wage, thats good for everybody, said Seattle venture capitalist Nick Hanauer, who along with his wife, Leslie, gave $25,000 to support Proposition 1. Its good for businesses. Its good for the workers. And its good for taxpayers because now they dont have to pick up the tab for government-funded poverty programs. Hanauer said the SeaTac measure will have ramifications nationwide. President Obama, in his State of the Union speech, called for a $9-an-hour minimum wage, Hanauer said. We saw his 9 and raised him 6. Seattle Times staff reporter Jim Brunner contributed to this report. Amy Martinez: 206-464-2923 or amartinez@seattletimes.com. On Twitter: @amyemartinez]", "Date": "20131106", "Author": "[Amy Martinez]", "Link": "http://www.seattletimes.com/seattle-news/backers-of-seatacrsquos-15-wage-floor-eye-seattle/", "Title": "[Backers of SeaTacs $15 wage floor eye Seattle]"}