{"Content": "[ ASHLAND, Ky. (AP)  A federal judge has delayed a decision on whether a local official in Kentucky can use her religious beliefs to justify not issuing marriage licenses to same-sex couples. Rowan County Clerk Kim Davis stopped issuing marriage licenses after the U.S. Supreme Court legalized same-sex marriage nationwide last month, prompting a flood of both protests and support in this tiny Kentucky county that is home to Morehead State University. The lawsuit is the first of its kind in the country and could serve as a harbinger for dozens of other local officials across the country seeking to test the limits of the Supreme Courts historic ruling. But U.S. District Judge David Bunning suspended the hearing until next Monday at the earliest, because attorneys from the American Civil Liberties Union have still not formally notified Davis of the lawsuit against her. The ACLU  arent really concerned in the marriages of their clients. The plaintiffs can get married in at least 117 if not 118 counties in the state of Kentucky if they want to, said Roger Gannam, Davis attorney and the senior litigation counsel for Liberty Counsel, a group that defends religious freedom. This case was about targeting a person of faith to make a point that everyone must comply with the agenda to impose same-sex marriage on all of America. American Civil Liberties Union attorney Dan Cannon said his clients are not targeting anyone; they simply want to get a marriage license in the county where they live and pay taxes. April Miller, who lives in Morehead, said when she heard Davis was refusing to issue marriage licenses because of her religious beliefs, she and her partner of 11 years went to the courthouse to see if it was true. They were denied a license by both Davis and the county judge executive, who said state law only allows him to issue marriage licenses if the clerk is absent. The couple have not tried to get a license from another county. It would be degrading to have to go somewhere else to get our license because of this, Miller said. Another gay couple, David Ermold and David Moore, made news last week when they were denied a marriage license in Rowan County and posted a video of their attempt online that has been viewed more than 1.7 million times on YouTube. The couple filed a separate lawsuit against Davis on Friday, court records show. But Jonathan Christman, an attorney for Davis, said Kentucky law does not require couples to get a marriage license in Rowan County and that other options are available, including going to a neighboring county or asking the judge executive. He argued that the county clerks religious beliefs essentially rendered her absent, thus giving the judge executive authority to issue a license. Meanwhile, forcing Davis to issue the marriage would mean requiring her to sign her name in four different places to bless or approve the marriage, Christman said. When you take office, you dont suddenly shed your constitutional liberties at the door of the courthouse, Christman said. Bunning said that isnt necessarily true. He said that he sees a conflict between the First Amendment, which guarantees freedom of religion, and the 14th Amendment, which guarantees equal protection for everyone under the law. He noted that U.S. Supreme Court Justice Clarence Thomas pointed this out in his dissent to the courts ruling legalizing same-sex marriage. Thomas may very well be a prophet, he said. Bunning questioned attorney Bill Sharp on why the couples wouldnt be satisfied with one of Davis deputies issuing the marriage license or going to a nearby county where the clerk does not have a religious objection. Sharp replied that it would be offensive for couples to accommodate the beliefs of one county clerk. She does not get to impose her religious views on others, he said. Davis, elected last November as a Democrat, took over the office from her mother, Jean Bailey, who served as county clerk for 37 years, according to the Morehead News. Davis worked under her mother as a deputy clerk for 26 years. Her actions, and those of a few other clerks, continue to make same-sex marriage a political issue in Kentucky, which has a high-profile governors election this fall and is home to Republican presidential candidate Rand Paul. Paul said Monday that he is not a legal expert and is not sure if clerks have a legitimate objection based on their religious beliefs. ", "Date": "20150713", "Author": "[ADAM BEAM]", "Link": "http://www.seattletimes.com/nation-world/same-sex-marriage-back-in-court-in-kentucky/", "Title": "[Decision delayed in Kentucky clerks same-sex marriage case]"}