{"Content": "[ MILAN (AP)  An Argentine businessman who was indicted by U.S. authorities in connection to the FIFA corruption case turned himself in to Italian police on Tuesday. Bolzano police official Giuseppe Tricarico told The Associated Press that Alejandro Burzaco arrived at the local police station Tuesday morning with an Italian lawyer and also a Spanish-speaking lawyer. Police spokesman Francesco Bianco later told the AP that Burzaco, who is accused of being involved in a $110 million bribe, was placed under house arrest after a hearing in the northern Italian city. The 50-year-old Burzaco, who has dual Argentine-Italian nationality, has rented a house in Bolzano. Burzaco was one of 14 people indicted by U.S. authorities on May 27 on bribery, vote-rigging and other corruption charges. Seven of the indicted men were arrested during dawn raids on a luxury Zurich hotel. FIFA President Sepp Blatter, who has not been officially implicated in the investigation, won re-election to a fifth, four-term on May 29. But four days later, as the scandal intensified, the 79-year-old Blatter said he would resign and start the process of looking for a successor. In a separate Swiss investigation, authorities seized documents at FIFA headquarters in their probe into the bidding contests for the 2018 and 2022 World Cup tournaments. Burzaco was named on Interpols most wanted list last Wednesday, along with five other men with ties to FIFA. Burzaco and Hugo and Mariano Jinkis, also from Argentina, were named in the U.S. indictment saying they bribed soccer officials in exchange for the media and commercial rights to international tournaments. Argentine Secretary of Security Sergio Berni said Tuesday that the whereabouts of the Jinkis was still unknown. Berni told Radio del Plata that authorities were trying to find them. Burzaco, who is the president of sports marketing company Torneos y Competencias, and the Jinkis merged their companies to form part of Datisa, which obtained the exclusive worldwide rights to the 2015, 2019 and 2023 Copa America tournaments as well as the 2016 centenary edition of the South American championship. The indictment states that Datisa agreed to pay $110 million in bribes to Jeffrey Webb, Eugenio Figueredo, Rafael Esquivel, Jose Maria Marin, Nicolas Leoz and several other soccer officials for the rights. Leoz, a former FIFA executive committee member who is under house arrest in Paraguay, was also named on the Interpol list, as was FIFA vice president Jack Warner and Jose Margulies, a Brazilian broadcast executive. Warner was arrested in Trinidad but has been released on bail. ", "Date": "20150609", "Author": "[DANIELLA MATAR]", "Link": "http://www.seattletimes.com/nation-world/fifa-suspect-burzaco-turns-himself-in-to-italian-police/", "Title": "[FIFA suspect Burzaco turns himself in to Italian police]"}