{"Content": "[ April is an odd month, some say cruel. But even aside from the weather, strange things are happening. Our job as dutiful citizens is to figure them out. Some are puzzled why former Florida Gov. Jeb Bush, a front-runner for the GOP presidential nomination, checked the box denoting Hispanic when he applied to vote in 2009. Bush was born in Texas, but his family is from New England and beyond that English royalty. Was he confused because he speaks fluent Spanish and governed a state with a large Hispanic population? Was he already planning to run for president in 2016, an impressive display of foresight knowing hed need Hispanic votes?, No, it was because he is committed to his marriage to Columba, who was born in Mexico. You know how some stereotypical grandparents look exactly alike? White hair and matching running suits, and from behind its hard to tell which one is which? Or, in Best of Show, remember how beloved pets and smitten owners looked identical?, After 41 years of marriage, Jeb and Columba have melded. Mi casa es su casa. Mi heritage es su heritage. We like Jebs insouciance after being apprised of Box Gate: My mistake! Dont think Ive fooled anyone!, Moving on to the Democrats, some are cackling that Hillary Clinton, the front  and only  runner for the Democratic nomination, has hired a charm guru. To what end, you ask. We recall Barack Obama in 2008 saying politely (certainly not snidely), Youre likable enough, Hillary, after the debate moderator asked Clinton if she had enough personal appeal to win over Obama. (Actually, it was a low point in his campaign.), To be on her 2016 communications team, Hillary has hired Kristina Schake, who has been working for Michelle Obama. Reports say Schakes job is to make Hillary  lawyer, former first lady, former senator and former secretary of state  appear softer and more accessible. Schake reportedly told Michelle to shop at Target and taught her mom dancing, which was enormously appealing on The Jimmy Fallon Show. We are promptly reminded of Al Gores Macarena moment, slapping his shoulders and his sides and we have to pause. Lets think through the current dance moves before we get too excited about this. At any rate, we will have to see what Schake comes up with, but since Hillary is on the move to the nomination, we wont have to wait too long. Meanwhile, how about those FBI agents? It turns out that the FBI has not had a physical fitness requirement for 16 years. Who knew? Thousands of us would have applied!, But now they do. In a memo publicized by The New York Times, FBI director James B. Comey told agents: The lives of your colleagues and those you protect may well depend upon your ability to run, fight and shoot, no matter what job you hold. He said agents symbolize to Americans what is right and good and added, I want you to look like the squared-away object of that reverence. I want the American people to be able to take one glance at you and think, THERE is a special agent of the Federal Bureau of Investigation. And we thought we could tell an agent when he talked into his wrist. Avid TV viewers deduce this new dictum arrived when the FBI learned last year the CBS show Battle Creek was in preparation. It features a squared-away, straight-arrow, buttoned-down, always prepared, somewhat pompous FBI agent with amazing tech toys. Since the agent is played by well-put-together movie star Josh Duhamel, theres a lot of reverence there already, at least in Hollywood. In the Washington, D.C. Union Station subway stop, there are giant illuminated showcases featuring comic book characters, a reference to dark money and an appeal for the appearance of Mary Jo White, a missing superhero. Tourists pouring into the nations capital for the cherry blossoms are befuddled. The missing MJW is head of the Securities Exchange Commission. The advertisements and the Twitter #whereisMJW campaign are sponsored by Greenpeace, Avaaz and the Corporate Reform Coalition. They pursue the menace of anonymous corporate money in American elections. May, with its own possibilities, is just around the corner.]", "Date": "20150410", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/jeb-bush-hillary-clinton-and-fbi-agents-on-the-move/", "Title": "[Jeb Bush, Hillary Clinton and FBI agents on the move]"}