{"Content": "[ Waving signs and chanting count the votes, several hundred faculty members and students walked out of Seattle University on Wednesday as part of a national day of action to call attention to the working conditions of adjunct professors and instructors. Seattle University officials pushed back, saying they have already significantly increased adjunct compensation and are working on resolving other issues, including the shortage of office space. Nationwide, nontenured faculty make up the fastest-growing segment of teachers at all colleges and universities. As the economy improves, they have stepped up demands for improved job security and better pay and benefits. The issue is particularly timely at Seattle University because its adjuncts  who work on annual contracts and are not on track to earn tenure  cast their votes last summer on whether to form a union. The university appealed the election to the National Labor Relations Board (NLRB), arguing it should be exempt from NLRB jurisdiction because it is a religious institution.  The ballots were impounded and have never been counted. Adjuncts are awaiting a decision from the local NLRB office. A similar case involving Pacific Lutheran University was found in favor of the adjuncts. However, so many of the ballots were called into question that the adjunct faculty  known at that institution as contingents  withdrew their petition to form a union. The PLU group plans to hold another vote later this year. On Wednesday, Seattle University adjuncts  who make up more than 50 percent of the faculty  called for the administration to drop its legal action and allow the votes from the election to be counted. Those who protested say that forming a union would help improve pay and working conditions, and lead to greater job stability. And they argued that the administrations attempt to squelch union-organizing efforts runs counter to the social-justice mission of the Catholic, Jesuit-led university. I know a little about Jesuit theology and mission, and I know were not living up to it now, said Dan Peterson, an adjunct humanities instructor who specializes in theology. Peterson began teaching at Seattle University in 2009, when he was offered a full-time contract for $21,000 a year. His salary has gone up since then, but he said he still must work an extra job to make ends meet. An ordained Lutheran pastor, he preaches and teaches church classes in addition to teaching at Seattle Universitys Matteo Ricci College, an interdisciplinary humanities college. We want our vote to be heard and counted, he said. Seattle City Councilmember Kshama Sawant, who attended the rally and has worked as an adjunct at both Seattle Central College and Seattle University, said the public community college paid her better. She believes thats because the union that represents adjuncts at Seattle Central  the American Federation of Teachers  has made sure adjuncts arent shortchanged. In a statement, Seattle University officials said adjunct pay has increased significantly in just a few short years. For example, full-time contingent faculty members who three years ago made as little as $24,600 now make a minimum of $42,000 a year, and those salaries will increase to $46,000 by 2016. Larry Cushnie, an adjunct political-science instructor, said he believes a union will help adjuncts establish longer-term contracts with the university. He said hes been offered a contract a week before classes started  and he knows other adjuncts whose contracts were canceled with that little notice, too. While having a skilled workforce available at a moments notice might be good for the university, it plays havoc with professors lives, he said. Seattle University administrators say they have done a better job of offering work well in advance of the start of classes, and that full-time adjuncts are now being offered contracts in April, months before the fall quarter begins. Students also participated in Wednesdays walkout, marching around campus with their professors. Olivia Engle, a senior, said some of her best professors have been adjuncts, yet they often share cramped office spaces or must meet students off campus in coffeehouses to discuss grades and assignments. And, she said, they are paid only for the classes they teach  not for the time they spend mentoring students. It has a huge effect on our education, she said. Seattle Universitys walkout was part of a larger nationwide event, the National Adjunct Walkout Day. Along with the walkout at Seattle University, faculty members participated in informational picketing at Green River Community College, Pierce College and Seattle Colleges, according to the American Federation of Teachers. Cushnie ended the class he teaches on Wednesday early so he could participate in the walkout. Coincidentally, the class he teaches is called Activism, protest and the law. A few of his students joined him on the protest line. While Cushnie doesnt teach the adjunct movement as part of his class, I think my students see the clear connection, he said.]", "Date": "20150225", "Author": "[Katherine Long]", "Link": "http://www.seattletimes.com/seattle-news/nontenured-instructors-stage-walkout-over-demands-at-su/", "Title": "[Nontenured instructors stage walkout over demands at SU]"}