{"Content": "[ OXON HILL, Md.  Scott Walker has momentum with conservatives. Ted Cruz and Rand Paul have the passion. And Jeb Bush still faces widespread skepticism thats not going away. Those were some of the conclusions as thousands of conservatives ended a three-day conference Saturday with fresh takes on potential candidates for the 2016 Republican presidential nomination, impressions that will help shape the early stages of the wide-open race. Thirteen potential candidates each got 20 minutes before the Conservative Political Action Conference (CPAC). Walker, the Wisconsin governor, got the loudest applause, with Paul, a U.S. senator from Kentucky, and Cruz, a senator from Texas, close behind. Retired neurosurgeon Ben Carson was the grass-roots champion, as his T-shirted army seemed to be everywhere. Louisiana Gov. Bobby Jindal stoked considerable curiosity with his detailed prescription for derailing the Common Core educational standards. And former business executive Carly Fiorina got buzz for her lively zingers aimed at likely Democratic candidate Hillary Rodham Clinton. None emerged as the clear rising star. Walker came closest. Hes stoked interest because hes a new face, a 47-year-old just-re-elected governor from a nominally Democratic state who took on labor unions and won. In one sign of his potential appeal, Walker came in a strong second in a straw poll of activists at the conference. Pollsters said just over 3,000 CPAC attendees voted, and nearly half identified as between the ages of 18 and 25. Respondents said economic issues, such as jobs and taxes, were most important to them in deciding whom to support as the Republican nominee for president in 2016. Paul, with 26 percent, won it for the third year in a row, followed closely by newcomer Walker, with 21 percent; then Cruz, with 11.5 percent; Carson, with 11.4 percent, and Bush, with 8.3 percent. His appearance at the meeting was tarnished a bit, though, when he appeared to liken union protesters in Wisconsin to terrorists. If I can take on 100,000 protesters, he said, I can do the same across the world. Walker nonetheless remained an attractive option to a bloc of activists frustrated that the past two Republican presidential nominees, John McCain and Mitt Romney, werent conservative enough and seemed too tied to the mainstream political establishment. Barbara Decker, a San Diego retiree, liked Walker and Cruz, explaining: Im tired of establishment figures. That was Bushs burden, and will be for some time. Hes not only the candidate piling up big-donor money and tapping a network of well-known insiders, hes also the son and brother of presidents. That bothered a lot of people at the conference. Im not a fan of imperial presidencies, said Travis Murray, a Coast Guard officer from Shorewood, Ill. The Founding Fathers never intended to have a hierarchy handing down the presidency to future generations. The Bush name also remains a source of conservative wariness. Theres a lot of Bush fatigue, said David Keene, former American Conservative Union chairman, and neither his brother or father was seen by many conservatives as conservative enough. They disliked President George H.W. Bush for agreeing to a tax increase after pledging no new taxes. They criticized President George W. Bush for presiding over huge federal deficits in his second term. Jeb Bushs supporters said he did what he needed to do at this conference. He flooded the convention hall with supporters when he spoke Friday, making sure cheers drowned out booing for his immigration and education rsum. Those issues will continue to dog Bush. He maintained that the Common Core educational standards, which he supports, do not constitute a federal overreach into a local function, a view not widely shared at the meeting. While the standards were developed by governors and education officials, the Obama administration has tied some federal funding to acceptance of the standards. Bush also repeated his support for a path to legalization for many immigrants in this country illegally. To supporters, thats the kind of stance that will help him if hes the nominee and needs to attract a wider audience. He explained himself very well, said Ed Cowling, a Phoenix public-relations executive. The crowd really seemed to quiet down as he spoke. Not in the halls. No, a thousand times no, said Nedra Babcock, a Tulsa prison-reform advocate, of Bush. Why not? Common Core. The next test for these potential candidates will be pulling away from the pack. Some made progress. It was hard to walk down a hall without someone trying to slap a Run Ben Run sticker somewhere or offer a Stand with Rand button. Walker got positive comments everywhere, notably for fighting the unions. Sen. Marco Rubio of Florida got some mention for his explanations of his views, notably how hes learned a lesson from his initial stand on immigration, which was protested by conservatives. Others were all but forgotten in the Saturday hall chatter. Few were talking about potentials such as New Jersey Gov. Chris Christie, former Pennsylvania Sen. Rick Santorum, former Texas Gov. Rick Perry or Donald Trump. Most will appear again next Saturday at the Iowa Ag Forum, where theyll address rural issues. Theyre also quietly competing in the money primary. Bush is expected to be the leader in fundraising. The true gauge of whos up and down will be more subtle and difficult to measure. Activists headed home Saturday with new thoughts and feelings about these candidates, ready to share them with like-minded friends and associates. Impressions forged here will matter, and thats why Walker emerged with a slight edge. He seems real, Babcock said.]", "Date": "20150228", "Author": "[David Lightman]", "Link": "http://www.seattletimes.com/news/wisconsin-governor-in-lead-at-conservative-conference/", "Title": "[Wisconsins Gov. Scott Walker gets close to stardom at CPAC]"}