{"Content": "[ The Washington Supreme Courts late-Friday decision striking down the states charter-school law has sparked a national fundraising campaign to keep existing schools afloat  at least for the school year. The state Charter Schools Association announced Tuesday that it is confident it can raise enough money to keep the states nine charters and their 1,200 students operating through June. If for any reason the public funding becomes unavailable, were going to do whatever is necessary to ensure that these schools can keep the promise that theyve made to families and keep the doors open through the end of the year, said Tom Franta, the associations CEO. Guest column:Why charter schools are worth saving, Franta also said his organization, a private group created to support charter schools in Washington, intends to file a motion asking the court to reconsider its ruling. The court said the states charter-school law is unconstitutional because charters are overseen by appointed rather than elected boards. That means the schools cant receive state taxpayer dollars. The parties have 20 days to file motions asking the court to reconsider. Charters are a type of public school that receive tax dollars but are operated privately. Franta estimated it will take about $14 million to make up for lost public funding if the courts decision holds. His organization didnt have the full amount in hand Tuesday. It was still contacting potential donors, which Franta said are likely to include those who contributed to the 2012 campaign, when voters narrowly approved the ballot measure that made Washington one of the last of the 42 states in the nation to allow charter schools. Some of the biggest donors then included Microsoft co-founders Bill Gates and Paul Allen and Wal-Mart heiress Alice Walton. Were working on a broad network of supporters across the country, Franta said. I hope that those individuals who played a role in the initiative will also play a role in ensuring the continuity of these schools, assuming its necessary to do so. Franta said his association is working under the assumption that if the ruling becomes final, charter schools will lose access to federal funding, as well. Public schools receive federal money to provide school lunches and academic help for low-income students, and for special-education programs for children with disabilities. The court heard arguments in the case last October and issued the long-anticipated ruling after some charter schools had been in session for a few weeks. First Place Scholars charter school opens in Seattle on Wednesday for its second year of operation, after a turbulent first year marked by personnel and financial trouble. It received its first state payment for the coming school year in August. The other eight schools werent due to receive their first public money until the end of September. Along with the charter associations pledge, some of the schools also promised to keep going despite that they may not get the tax dollars they expected. This decision does not close our school, Adel Sefrioui, founder and executive director of Excel Public Charter School in Kent, told worried parents at a morning meeting Tuesday. Sefrioui said his school has raised enough money over the past 18 months to operate through June without state or federal funding. But he encouraged parents to lobby politicians to convene a special legislative session to find a solution. The school plans to bus parents and students to Seattle for a rally Thursday, which is scheduled at Summit Sierra charter school in the Chinatown International District. Deanne Hilburn, the mother of a sixth-grade boy at Excel, said at the parents meeting that she wanted her son at the school, which is beginning its fourth week, because he had been having a rough time in the Kent School District. He was angry. He was frustrated. He came home sick to his stomach almost every day, she said. In these three short weeks, he has become this young man that I always knew was there. Sefrioui estimates it will take about $2 million to operate his school this year, which started with 160 sixth- and seventh-graders. Charter-school supporters worked through the Labor Day weekend figuring out how to respond to the high courts 6-3 ruling. The Washington State Charter School Commission called an emergency meeting for Wednesday morning to respond to the ruling. Although the high courts in Georgia and Florida have struck down laws creating state commissions to approve charter schools, the Washington ruling is the first to render an entire charter-school law unconstitutional, according to the National Association of Charter School Authorizers. The decision and its timing have generated national headlines and quick opinions, but policymakers are still sorting out what the ruling means. House Majority Leader Pat Sullivan, D-Covington, said legislators in his caucus are still going through the court opinion, trying to figure it out. Legal staff are preparing options for lawmakers, ranging from a constitutional amendment to making changes to the budget, although Sullivan said he doesnt believe the latter would resolve the issue. I would guess by the end of this week wed have some options to consider, he said. A constitutional amendment would require a two-thirds majority vote in both the state House and Senate to put it on the general election ballot for a simple majority of voters to approve. While a special session is a possibility, Sullivan said, there wouldnt be as much pressure for lawmakers to convene one to propose a constitutional amendment. Lawmakers could vote on such an amendment during their regular session early next year and still get it on the November 2016 ballot. Sen. Steve Litzow, R-Mercer Island, said he doesnt think lawmakers will return before January. Weve been calling for [a special session] the last couple days, said Litzow, who chairs the Senate Early Learning & K-12 Education Committee. There doesnt seem to be a lot of momentum for that with the governors office or with the House Democrats. Lawmakers, according to Litzow, are trying to understand the decisions impact on legislative funding and the issue of elected boards. ]", "Date": "20150908", "Author": "[John Higgins, Joseph O'Sullivan]", "Link": "http://www.seattletimes.com/seattle-news/education/two-charters-say-they-will-stay-open-this-year-despite-supreme-court-ruling/", "Title": "[Survival lesson throws parents, charter schools into fundraising, politics]"}