{"Content": "[ Magnolia activist Elizabeth Campbell is trying to resurrect a Ballard-to-West Seattle monorail plan. But just about any semblance of broad public support is gone. Citizen Petition No. 1 was organized by Campbell and a few advisers, working as the Century Transportation Authority (CenTran),   some nine years after the collapse of a stronger agency, the Seattle Monorail Project (SMP). The measure would impose a $5 license-tab fee on used vehicles inside Seattle, raising $2 million a year to plan a monorail. But its   questionable whether CenTran is capable of carrying out its mission. Some of the people listed as board members or technical advisers are uninvolved or, in at least two cases, opposed to the measure. Theres only one campaign donor beyond Campbell. Business leaders, school-board members and financiers declined her invitation to lend support, she said. Even second-tier types, who serve in neighborhood councils, have shied away, she said.  The measure is even opposed by some leaders in earlier monorail campaigns. The campaign budget of less than $5,000 means some voters may first learn of the measure when they open their ballots. This thing has come out of the woodwork, in comparison, to tell the truth, to how well organized the other one (SMP) was, observes Jud Marquardt, partner in LMN Architects and former member of Citizens Against the Monorail, which organized to fight the SMP. Campbell has previously run for mayor, led a petition drive that gathered 27,000 signatures against the Highway 99 tunnel, and served for years on Magnolia neighborhood groups. She said shes accustomed to holding strong opinions, and to being isolated.   , I am actually about doing something, and a lot of the people, theyre not brave enough to do something, to go for broke, said Campbell, whose careers before politics included owning a bakery and developing elder-care campuses. She believes theres an underlying population in Seattle thats dissatisfied with transportation in the city.   , If this passed, Id have people lining up to say, Im interested in this, she said. Makeshift campaign, CenTran proposes a 16-mile line along the Seattle waterfront from Ballard to West Seattle. A smaller circulator loop would carry people between Alaskan Way and downtown jobs. Its path to the ballot required only 1 percent of Seattle voters, or 4,582 valid signatures, under a leftover 2002 state law written to aid SMP. CenTran submitted twice that count to King County Elections and easily qualified. The sole funder for the signature drive was Lee Rabie, a retired businessman, who gave $21,342. (Rabie previously gave $61,815 to another Campbell campaign, Seattle Citizens Against the Tunnel.)    Two-thirds of that went to compensate Campbell and her signature collectors. For the fall campaign, CenTran reports $4,529 raised. All of that came from Campbell, except $1,000 from the Washington State Association of Electrical Workers. The $1,000 level is more of a support gesture, whereas $5,000 would indicate real support, said Lee Newgent, executive secretary for the Seattle Building & Construction Trades Council. Other developments illustrate the makeshift nature of the campaign:,  CenTran missed King County Elections deadline to file a for statement in the Nov. 4 voters guide, so that area is blank.  Campbell infuriated The Stranger by not attending the weekly papers   endorsement interview. William Popp, a longtime Bellevue traffic engineer, showed up to represent CenTran, but says he wasnt interviewed.  Campaign manager Libby Carr, whose op-ed covered the Westside Weeklys front page Sept. 26, is gone.  Asked to endorse the measure, West Seattle Transportation Coalition board members voted 10-1 to decline an endorsement. Nobody wanted to slam the door in their face, basically, because the consensus was, it wasnt going to pass, said co-founder Joe Szilagyi, explaining why they didnt endorse a harsher no position.  Two of six listed board members are out. One of them, Yusuf Cabdi, an advocate for African immigrants and a former Seattle Housing Authority board member, said he spoke with Campbell long ago, but is unfamiliar with the monorail. Anything that will take money from the taxpayers, Im not aligned with that, he said. Another,     Al Runte, historian and author of books about railroads and national parks, said hes too busy writing and speaking to serve with CenTran, but supports monorail as a better option than forcing passenger trains into tunnels, as designed by Sound Transit. CenTrans website also lists as special adviser Paul Toliver, former King County transportation director and SMP board member. But he has moved east to become deputy director of the Detroit Department of Transportation. Those remaining include Jake Solomon, a Bellevue sales representative, who agreed to join the CenTran board solely to promote small personal rapid-transit vehicles, as launched this year in Korea, as a loop between a waterfront route and downtown. He vouched for Campbells skills. I believe she has a lot of smarts. She knows the system, she knows the politics, he said. Aim: tackling gridlock, Popp, the Bellevue traffic engineer, says hes donating his work on alignment ideas  for instance, a monorail station where the Alaskan Way Viaduct now exits into downtown. He points to a gridlock disaster: Some drivers will avoid the tolled Highway 99 tunnel, and theres no sign city arterial streets will gain capacity. The buses arent going to work that well, even RapidRide, Popp said. You cant give every bus its own green light and have any kind of arterial traffic. It [monorail] can be built so fast, it has a significant leg up on the alternatives. On the other hand, CenTrans proposal to use the waterfront assumes the city and state would give up newly created right of way, after the tunnel replaces the Viaduct. That land has been designated for parks or bike lanes. Campbell argues that former monorail-engineering studies can be dusted off and put to work quickly. Thats debatable. Unlike this proposal, SMPs Green Line went through Seattle Center, down Second Avenue instead of the waterfront, and on the high West Seattle Bridge deck. Even where the routes match, new property would be needed, because old station sites were sold and redeveloped. As a transportation authority, CenTran could issue taxpayer-funded debt, with no sunset date. The petition calls for four staffers, board member pay of $1,000 a month, grants of up to $5,000 for citizens to do monorail research, and a governance structure that prescribes 34 ruling and advisory positions. A plan for the process to plan, says Dick Falkenbury, who helped lead Seattles grass-roots monorail campaigns in the 90s and 00s, but opposed the Campbell plan, in a Crosscut essay. Campbell replies it would allow new people to participate, by avoiding the usual government channels. The CenTran board itself would decide when to retire the $5 fee by giving up on the monorail, or by pushing ahead with a larger tax measure to build the system. The petition requires a monorail headquarters be outside downtown, with ample parking, something Campbell said brings a populist streak. Meanwhile, Sound Transit is building its downtown-to-Northgate tunnels, and   drawing concepts for Ballard and West Seattle light-rail lines, potentially to be featured in a 2016 Sound Transit 3 tax measure. These might cost $3 billion for Ballard and $4 billion for West Seattle  figures daunting enough to keep the pro-monorail argument alive.  Kim Pedersen, president of The Monorail Society, says the CenTran measure is biting off too much. He suggests expanding the Seattle Center Monorail to the sports stadiums, then proceeding one segment at a time. Cleve Stockmeyer, who was formerly an elected SMP board member, is listed as a CenTran adviser but says, Im not voting for it; you can vote for it if you want to. Campbell said she should have removed Stockmeyers name. And in some other cases, she listed as technical advisers people who have answered her questions in the past. Seattle doesnt need another transit-planning agency, Stockmeyer says. On the other hand, he says officialdom has yet to offer something better than SMPs unbuilt $2.1 billion, 14-mile Green Line. The real issue is, how many generations is it going to take for us to get multiple lines converging downtown? he said. So if monorail rumblings make politicians focus on moving high-capacity transit faster, fine with him. Mike Lindblom: 206-515-5631 or mlindblom@seattletimes.com. On Twitter@Mikelindblom]", "Date": "20141021", "Author": "[Mike Lindblom]", "Link": "http://www.seattletimes.com/seattle-news/monorail-campaign-stalling-even-named-backers-not-along-for-ride/", "Title": "[Monorail campaign stalling? Even named backers not along for ride]"}