{"Content": "[ WASHINGTON  As presidential candidates find new ways to exploit secret donations from tax-exempt groups, hobbled IRS regulators appear certain to delay trying to curb widespread abuses at nonprofits until after the 2016 election. In a shift from past elections, at least eight Republican presidential candidates, including leading contenders like Jeb Bush and Sen. Marco Rubio of Florida, have aligned with nonprofit groups set up to raise hundreds of millions of dollars. Hillary Rodham Clintons supporters are considering a similar tactic. Some of these groups are already planning political initiatives, including a $1 million advertising campaign about Iran by a tax-exempt group supporting Rubio. The groups are able to carry out many of the same political activities as candidates and their affiliated super PACs, but do not have to disclose where they get their money, allowing total anonymity for donors. While the nonprofit groups are supposed to limit their political activity, the IRS appears powerless to stop the onslaught of money coursing through them. The tax agency remains deeply wounded by the scandal that began two years ago over its scrutiny of nonprofits tied to the tea party and other political causes, both conservative and liberal. Its anything goes for the next couple of years, said Paul Streckfus, a former nonprofit specialist at the IRS who now edits a newsletter on tax-exempt groups. The whole system has really collapsed. Under an exemption established more than a century ago, the nonprofit groups  known as 501(c)(4) organizations for the section of the tax code that created them  are supposed to be devoted to social welfare, with an aim to further the common good and general welfare of the people of the community. But there is disagreement over just how much politicking they can do. IRS officials concede that the rules are vague and difficult to enforce. Audits for excessive campaign work are extremely rare, even for groups spending huge chunks of their budgets to support candidates. Complaints about abuses can languish for years, records show. With scant enforcement, some nonprofits have become huge political operations. Groups tied to the Republican strategist Karl Rove and the industrialist brothers Charles and David Koch have emerged as major political forces.]", "Date": "20150705", "Author": "[ERIC LICHTBLAU]", "Link": "http://www.seattletimes.com/nation-world/irs-unlikely-to-hit-nonprofit-donor-abuses-in-2016/", "Title": "[IRS unlikely to hit nonprofit-donor abuses in 2016]"}