{"Content": "[ Mississippi has long been one of the sickest and poorest states in America, with some of the highest rates of obesity, diabetes and heart disease and more than 1 in 7 residents without insurance. And so you might think Mississippi would jump at the prospect of billions of federal dollars to expand Medicaid. Youd be wrong. Leaders of the deeply conservative state say that even if Mississippi receives boatloads of cash under President Barack Obamas health care law, it cant afford the corresponding share of state money it will have to put up to add hundreds of thousands of people to the government health insurance program for the poor. While some people say Obamacare will come as an economic boost with `free money, the reality is simple: No money is free, said Republican Gov. Phil Bryant. Since when did the federal government ever give free money without asking for something in return?, GOP Govs. Rick Scott of Florida, Bobby Jindal of Louisiana, Nathan Deal of Georgia, Nikki Haley of South Carolina and Rick Perry of Texas have said they, too, will reject a Medicaid expansion, calling it too expensive. While many states are wrestling with the issue, perhaps nowhere but Mississippi are the health issues and the politics so stark. Some advocates suspect the governors stand is not about the money at all, but about politics, saying the Republicans are using the Medicaid issue to attack the Obama administration. They point out that the share the states must contribute is relatively small for the amount of federal funding they would receive, and that politicians from those states have eagerly taken big money from Washington for highways, disaster recovery and other projects that required a contribution of state dollars. I think some of this might be posturing before the presidential election, said Michael Doonan, a Brandeis University expert on health care policy and a former aide to Sen. John Kerry, D-Mass. Supporters of the expansion say turning down the money for doctors visits, prescriptions and other care would itself be foolish fiscal policy, not only hurting the poor but jeopardizing the jobs of thousands of people at hospitals and other institutions that rely on Medicaid money. The governor and GOP leaders in the Republican-controlled Legislature have argued that the expansion will foster a culture of dependency on government, that its impossible to predict how much revenue Mississippi might collect several years from now, and that there is no guarantee future administrations in Washington will follow through on funding promises. In addition to requiring most Americans to buy insurance, the Obama health care law would expand the number of people on Medicaid by raising the income ceiling for eligibility. A divided Supreme Court this year upheld the law but said the Medicaid expansion would be optional, not mandatory. Some Republican governors are digging in, hoping Mitt Romney will get elected and roll back the law. Under the law, Washington would pay 100 percent of the costs of expanding Medicaid from 2014 to 2016. Between 2017 and 2020, the federal share would decrease to 90 percent and the states contribution would rise in stages to 10 percent, and thats where it would stay. Mississippis governor said that even in the years when Washington is supposed to cover 100 percent, states would still have to pay millions in administrative expenses. The nonpartisan Kaiser Family Foundation has projected that between 2014 and 2019, Mississippi would receive nearly $9.9 billion in federal money for Medicaid expansion, while the state would pay $429 million. Thats $1 from the state for every $23 from Uncle Sam. By some estimates, the expansion would add 400,000 people to the states Medicaid rolls, increasing enrollment from the current 1 in 5 Mississippi residents to about 1 in 3. Mississippi is spending nearly $822 million of its own money on Medicaid in the current fiscal year, or almost 15 percent of the state-funded portion of the overall state budget. Among the estimated 476,000 uninsured Mississippians who could be added to Medicaid is Wilna Alexander, 54, of Jackson. She said she earned $12,000 to $13,000 last year as a part-time cook. She said was on Medicaid but lost coverage more than two years ago when she began working. She said she has never had a regular doctor. Most of the time, when I go to the hospital, I have to be real sick, Alexander said. She said that during one visit to University of Mississippi Medical Center in Jackson, she was found to have strep throat. She had to borrow money to buy antibiotics. The hospital gave her a list of free clinics, but Alexander found that one near her house demanded $80 to see her. Democratic state Sen. Hob Bryan said turning down the money would be wrong. It will mean thousands of jobs for the state and it will mean additional revenue for the state general fund and it will mean hundreds of thousands of people will get better health care, he said. But House Appropriations chairman Rep. Herb Frierson, a Republican, said federal money doesnt fall from the sky: It comes out of somebodys pocket. Ultimately, pressure from politically powerful health care groups might make it difficult for Mississippi leaders to reject the money. Hospital administrators worry that without a Medicaid expansion, they could be saddled with rising costs from treating uninsured patients. I would at least like to see that our state Legislature has examined how it would work instead of saying, `No, its not working for us and we dont even want to try, said Alvin Hoover, CEO of Kings Daughters Medical Center in the small town of Brookhaven. , Associated Press writer Jeff Amy contributed to this report. , Follow Emily Wagster Pettus on Twitter: http://twitter.com/EWagsterPettus]", "Date": "20121019", "Author": "[EMILY WAGSTER PETTUS]", "Link": "http://www.seattletimes.com/nation-world/miss-says-no-thanks-to-medicaid-expansion-dollars/", "Title": "[Miss. says no thanks to Medicaid expansion dollars]"}