{"Content": "[ NASHVILLE, Tenn. (AP)  The prospect of Hillary Rodham Clintons imminent presidential campaign dropped like a gift from the heavens at the National Rifle Associations annual convention Friday. A succession of potential Republican presidential rivals slung criticism and cracked jokes about the Democratic candidate-to-be, and NRA leader Wayne LaPierre, never given to understatement, predicted doom for the nation if she should win. Hillary Rodham Clinton will bring a permanent darkness of deceit and despair forced upon the American people to endure, LaPierre said. The NRA executive vice president and CEO vowed that the powerful gun lobby would stand shoulder to shoulder to prevent her from becoming the next president. Clinton plans to announce her candidacy for the Democratic nomination on Sunday. Many speakers at the NRA convention took the opportunity to say something about it. Is this the ready-for-Hillary gathering? joked Sen. Ted Cruz of Texas. Many in the capacity crowd at the 4,000-seat ballroom shouted back, No!, Former Florida Gov. Jeb Bush decried the liberal, progressive worldview of Barack Obama and Hillary Clinton and Eric Holder, and all of the other people who want to take the guns out of the hands of the good guys. Wisconsin Gov. Scott Walker added Clintons name to his criticism of the president. People like Hillary Clinton seem to think you measure success in government by how many people are dependent on the government, he said. I think we measure success by just the opposite: by how many people are no longer dependent on the government. And Louisiana Gov. Bobby Jindal drew laughter when he said he expects Clintons campaign slogan wont be four more years. The reality is the 2016 campaign is going to be between elitism and populism, Jindal said. Hillary Clinton has already made it clear shell be on the side of elitism. Needling her comment years ago that a vast right-wing conspiracy was making trouble for her husband, President Bill Clinton, Jindal called her leader of the vast left-wing conspiracy. Former Texas Gov. Rick Perry didnt name the former secretary of state but criticized our failed foreign policy. Among the other 2016 GOP prospects addressing the convention were Sen. Marco Rubio of Florida, Sen. Lindsey Graham of South Carolina, former Arkansas Gov. Mike Huckabee and neurosurgeon Ben Carson. Most of the speakers criticized Obama for failing to recognize the dangers of what they called radical Islamic terrorism, the presidents nuclear negotiations with Iran and his administrations gun-control efforts. The president has wielded human tragedy in an attempt to subvert our rights, said Rubio, who told the crowd he would announce his decision on a presidential bid in Miami on Monday. The sins of the evil do not justify restricting the rights of the good. Among those not attending: New Jersey Gov. Chris Christie, whos had a checkered relationship with the gun-rights lobby and received a C rating when he ran for re-election in 2013. None of the speakers at Fridays event had ratings worse than A-minus. Former vice presidential candidate Sarah Palin and Indiana Gov. Mike Pence canceled appearances. Kentucky Sen. Rand Paul, who launched his presidential campaign Tuesday, has a top rating from the NRA, but was campaigning in Iowa on Friday. Bush touted a 2005 law he signed as Florida governor allowing people to use deadly force when threatened in public places. The law received attention after the shooting death of Trayvon Martin in Sanford, Florida, in 2012. You shouldnt have to choose between being attacked or going to jail, Bush said. The only thing you should be worried about is keeping yourself and your loved ones safe. Opposing groups plan a rally near the NRA event Saturday to press for more gun safety laws. ", "Date": "20150410", "Author": "[ERIK SCHELZIG]", "Link": "http://www.seattletimes.com/nation-world/parade-of-likely-gop-presidential-candidates-to-speak-to-nra/", "Title": "[GOP hopefuls give NRA event an earful on Hillary Clinton]"}