{"Content": "[ George W. Bush shed a sentimental tear. Barack Obama mused about the burdens of the office. Bill Clinton dished out wisecracks. Jimmy Carter and George H.W. Bush chimed in, too, on a rare day of harmony at the dedication of the younger Bushs presidential library that glossed over the hard edges and partisan divides of five presidencies spanning more than three tumultuous decades. To know the man is to like the man, Obama declared of his Republican predecessor, speaking Thursday before a crowd of 10,000 at an event that had the feel of a class reunion for the partisans who had powered the Bush administration from 2001 to 2009. Dick Cheney was there in a white cowboy hat. Condoleezza Rice gave shout-outs to visiting dignitaries. Colin Powell and Karl Rove were prominent faces in the crowd. On this day, there was no mention of Iraq or Afghanistan, the wars that dominated Bushs presidency and so divided the nation. There were only gentle references to the aftermath of Hurricane Katrina. And praise aplenty for the resolve that Bush showed in responding to the 9/11 terror attacks. Clinton joked that the dedication of the George W. Bush Presidential Center was the latest, grandest example of the eternal struggle of former presidents to rewrite history. But he also praised Bush for including interactive exhibits at the center that invite visitors to make their own choices on major decisions that he faced. Bush, 66, made indirect reference to the polarizing decision points of his presidency, drawing a knowing laugh as he told the crowd: One of the benefits of freedom is that people can disagree. Its fair to say I created plenty of opportunities to exercise that right. He said he was guided throughout his presidency by a determination to expand the reach of freedom. It wasnt always easy, and it certainly wasnt always popular. It was a day for family and sentimentality, Bush choking up with emotion at the conclusion of his remarks. The 43rd president singled out his 88-year-old father, another ex-president, to tell him: 41, it is awesome that you are here today. The elder Bush, wearing jaunty pink socks, spoke for less than a minute from his wheelchair, then turned to his son and quipped, Too long? He has a form of Parkinsons disease and has been hospitalized recently for bronchitis. Just as the public tends to view presidents more kindly once theyve left office, ex-presidents, too, tend to soften their judgments  or at least their public comments  with time. Obama once excoriated Bush for his failed policies and disastrous handling of the economy, for expanding budget deficits, and for drawing the nation into war in Iraq. On Thursday, he took a detour around those matters and instead praised Bush for his strength after  9/11, compassion in fighting HIV/AIDS in Africa, bipartisanship in pursuing education reforms and restarting an important conversation by speaking with the American people about our history as a nation of laws and a nation of immigrants. If the country is eventually able to enact immigration changes this year, Obama added, it will be, in large part, thanks to the hard work of President George W. Bush. Obama said the living presidents make up an exclusive club  but its more like a support group for the men who have held the position. No matter how much you may think you are ready to assume the office of the presidency, its impossible to truly understand the nature of the job until its yours, Obama said. And thats why every president gains a greater appreciation for all of those who served before them. The other presidents struck a similar tone. Clinton praised Bush for his efforts to combat AIDS in Africa, his work on global health and even for the paintings hes doing in retirement. And he said hed gotten so close to the Bush family that there were jokes that I had become the black sheep son. Carter praised Bush for his role in helping secure peace between North and South Sudan in 2005 and the great contributions youve made to the most needy people on earth. Bush has kept a decidedly low profile since leaving office four years ago with an approval rating of just 33 percent. That figure has been gradually climbing and now is at 47 percent  about equal to Obamas own approval rating, according to a Washington Post-ABC News poll released ahead of the library opening. If politics was absent from the podium on Thursday, it was still a prominent subtext. Those in attendance included a number of potential candidates for president in 2016  another Clinton (Hillary) and Bush (Jeb) among them. George W. Bush in recent days played up the idea of his younger brother, the former governor of Florida, seeking the White House, telling C-SPAN, My first advice is: Run. Their mother, former first lady Barbara Bush, did the opposite. Weve had enough Bushes, she said Thursday on NBCs Today show. The presidential center at Southern Methodist University includes a library, museum and policy institute. It contains more than 70 million pages of paper records, 200 million emails, 4 million digital photos and 43,000 artifacts. Bushs library will feature the largest digital holdings of any of the 13 presidential libraries under the auspices of the National Archives and Records Administration. A full-scale replica of the Oval Office as it looked during Bushs tenure sits on the campus, as does a piece of steel from the World Trade Center and the bullhorn that Bush used to punctuate the chaos at ground zero three days after 9/11. In the museum, visitors can gaze at a container of chads  the remnants of the famous Florida punch card ballots that played a pivotal role in the contested 2000 election that sent Bush to Washington. Laura Bush led the librarys design committee, officials said, with a keen eye toward ensuring that the familys Texas roots were conspicuously reflected. Architects used local materials, including Texas Cordova cream limestone and trees from the central part of the state, in its construction. , Follow Josh Lederman on Twitter: http://twitter.com/joshledermanAP. , Associated Press writer Nancy Benac contributed from Washington.]", "Date": "20130425", "Author": "[JAMIE STENGLE, JOSH LEDERMAN]", "Link": "http://www.seattletimes.com/seattle-news/politics/politics-on-hold-at-the-dedication-of-bush-library/", "Title": "[Politics on hold at the dedication of Bush library]"}