{"Content": "[ I knew the housing situation in Seattle was bad. But I realized we hit a new low when friends visiting from New York City expressed shock at how high our rents are. Seattle is one of the fastest growing cities in the country. Add to that an intensifying rent-control debate, concerns over discrimination in housing and mounting Amazon Angst, and you  like me  may be feeling a little panicked about Seattles future. If our city is becoming too expensive in the eyes of New Yorkers, how do low-income and diverse communities stand a chance? What will this city  beloved for its open-mindedness, welcoming creativity and raw Northwestern feel  look like in 10 years?, Overwhelmed by conversations offering more complaints than solutions, I went looking for a model of low-income housing that might work. What I found, rising in the heart of Beacon Hill, felt like a light in a cityscape where newly minted, high-priced condos cast long, dark shadows. [There will be] poetry, music, people are going to get married [here]  says Estela Ortega, executive director of El Centro de la Raza as her hands pass over a series of architectural drawings. Pointing at a large screen in the public plaza shes describing, she adds, [The community] wanted outdoor movies in the evenings during summer. Ortegas not describing amenities at the newest downtown yuppie complex. These are the plans for Plaza Roberto Maestas, a low-income housing development the community organization is building. The Plaza, named after Ortegas late husband, Roberto Maestas, one of the co-founders of El Centro, slated to have 112 rental units and be completed by next summer. It will house 300 to 350 people designated as low-income (defined as earning roughly between $24,000-$49,000 a year per family). Housing will be constructed on either side of the historic Beacon Hill School where El Centro has been housed since its founding (through occupation of the then-abandoned building) in 1972. The Plaza was inspired by El Centros homeless-service program, which increasingly had to place its clients outside Seattle city limits due to high housing costs. El Centro wanted to do something that would help retain Beacon Hills diversity. Building a project like this is critical to the health of a community, says El Centros Stephen Deal, who has helped run a capital campaign for the $42 million project that includes public and private funding, You want that diversity, you want that economic diversity, you want that ethnic and racial diversity. That sense of community service is at the heart of The Plaza project and can be felt throughout the process of its development. Ortega says El Centro met with the community more than 30 times to seek input for the design. That feedback has resulted in a commissary kitchen (for commercial food production  especially convenient for food-truck owners), kiosks for small vendors, and a public plaza. In addition, Plaza Roberto Maestas will have commercial space (already all rented) and classrooms for El Centros early-childhood development programs. Its also adjacent to the Beacon Hill light-rail station. Ortega and Deal say El Centro is the only community organization working on a low-income housing project of this scale in Washington, but it hopes to serve as a model for others  especially since revenue from the project will help sustain and grow El Centros services. Ortega says she would have never thought, as a 22-year-old political activist helping to occupy a dim and crowded old building, that 40 years later El Centro would be at the helm of a project of this size. But she believes the spirit of the old days is still present. She recalls how  when the media asked Maestas how the old school building would be used once commandeered  he responded, There is going to be an explosion of creativity. And that is whats happening with [The Plaza Roberto Maestas], says Ortega as bulldozers rumble behind her at the construction site. That explosion of creativity is really happening. Its a memory of Seattles past and  perhaps  a vision for our future.]", "Date": "20150806", "Author": "[NULL]", "Link": "http://www.seattletimes.com/seattle-news/el-centro-constructs-an-answer-for-affordable-housing/", "Title": "[El Centro constructs an answer for affordable housing]"}