{"Content": "[ The hulking, wounded elephant in the room of American politics is the disgraceful, scandalous performance of the two political parties over the past 50 years. Elephants are truths that are obvious but too big, too established or too awkward to talk about. Its easy to ignore them. We follow the parties like sports  sometimes frantically, sometimes with disgust, but most voters dont have a favorite team; we follow the players, elections and the fights in Washington. We dont view the two parties through a wider lens. We dont think about if they serve their proper function. We dont really take them seriously as institutions. Why? Mostly because we have no expectations that parties are anything but, well, political  in the worst sense of word. Congress passes laws. The president signs them and is commander in chief. The Supreme Court judges laws. Parties dont belong to that great chain of governing  they are just the two teams that supply the players and trash talk. Unfortunately, we assume the two-party system permanent and unalterable. But the term two-party system is a misnomer. Nothing in the Constitution sanctions a two-party system. The two-party duopoly is an accident of history, not the work of the framers. My list of complaints is long: The parties have created a primary system so prolonged that elected officials are usually in campaign mode; they ceded the power to select and finance candidates and so have little power over their caucuses in Congress; they dont recruit and promote the best and brightest; they have lost the trust and loyalty of voters. But my chief gripe is that they have made it nearly impossible for a third party or an independent presidential candidate to have a fighting chance. They literally have committed a crime of antitrust by conspiring to secure a two-party monopoly on political power. This is their great and legal scandal. This duopoly creates a Catch-22: The rational way to attempt repairing public trust in government and hyperpartisan gridlock in Washington, D.C. is with major changes in how elections are held. Only those who hold political power can do that, but thats against the self-interests of the parties. The only hope for civic improvement can come from outside the duopoly. I believe the only vaguely plausible scenario for that is a well-funded, reform-based, disruptive third party. I hate the word, but name a business that hasnt been disrupted in the past 50 years? I can think of one: the parties. Lusting after a third party is considered politically immature, totally unrealistic and goofy by the grizzled wise. It is like a fan thinking his team can trade a couple draft picks for Aaron Rodgers. That is a shame because the country needs something to stir the pot (besides legalizing pot) and to shoot the elephant in the room. A successful third party is feasible. Rarely has there been a better opportunity. In most recent elections, there has been some third-party spasm, however quixotic: John Anderson, Ross Perot, Unity 08 and Americans Elect in 2012. It is weird that nothing is cooking this round. Why is 2016 ripe? Thanks to the Justice John Roberts Supreme Court, the economics of American elections have been deregulated. It would be easy to finance a third-party campaign. It might be unsavory and against the spirit of reform, but it would be easy. A couple hundred million dollars would fund a competitive campaign. Is there any doubt, for example, that the Koch network could manufacture a credible third-party ticket in 2016? None. It would have a clear libertarian ideology, a ready-made platform, a grass-roots network and the best polling, data mining, marketing and dirty tricks money could buy. Remember, David Koch was the Libertarian vice president candidate in 1980. Here is the other reason: There have never been more voters who call themselves independents. Flipping it, there have never been fewer Democrats and Republicans. The average favorability rating of the two parties combined has been declining on the same steep line as evening news ratings and typewriter sales. This may seem odd because the political arguments we eavesdrop on in social media, online comment boards, cable TV, blogs, political ads and congressional debates are so rabidly partisan, obnoxious and uncompromising. But true believers are a minority of a minority. They just yell the loudest, donate a lot and vote in primaries. So political hacks suck up to them. Polls about trust in the institutions of government  Congress, the presidency, the Supreme Court, political parties  have been hitting new lows for years, essentially since 1968. This is no passing phase. It is the new normal. Black is the new black. A third party is the logical response. Next week, well look at how we might be able to trade for Aaron Rodgers in 2016. (Go Bears!)]", "Date": "20150808", "Author": "[Dick Meyer]", "Link": "http://www.seattletimes.com/opinion/its-time-to-turn-the-two-party-system-into-a-three-party-system/", "Title": "[Its time to turn the two-party system into a three-party system]"}