{"Content": "[ No sir. This is not going to be a column about New Years resolutions for Congress. We all know that the paper they would be written on, or the digital energy, would be wasted. This is about resolutions for the rest of us, we the people, regarding our civic duties. This is going to be an important election year. (This of course implies that some elections are not important, a thought you will never hear on Fox News or MSNBC.) In November, all the members of the U.S. House and one-third of the U.S. Senate must stand for re-election. That could determine many of the issues we have been debating for years. We should resolve not to throw all the bums out. We need some for institutional memory and parliamentary know-how. Otherwise, smart-alecky staffs would run everything. But we should consider unelecting those who thwart the will of the majority, and those who hate government and seek to undermine it and worry about the presidents birth certificate. Let them become stockbrokers or motivational speakers. We should try to resist pouring vituperation on Obamacare until it is implemented and we find out if it works. It is exhausting having to hate something so intensely all the time. Imagine if Republicans had another issue to get all hot and bothered about! Just think of 40 consecutive votes on climate change!, We really should not start the 2016 presidential election until 2015 at the earliest. Perhaps it would be refreshing to refrain from focusing laserlike attention on Hillary Rodham Clinton and New Jersey Gov. Chris Christie for a few months. Otherwise we would lapse into terminal boredom, although it is fascinating to watch Clintons ever-changing hairstyles and listen to Christies wisecracks. This is a longshot, but think how different our lives would be if we didnt have to get so upset about politics every day that we have to take anti-nausea medicine and avoid certain people who think differently (wrongly) from us. Wow! Imagine a country in which we could have civil discourse about such issues as immigration and the environment and taxes. Well, maybe not taxes. Perhaps we could resolve to find out more about the issues and uncover facts, read more newspapers (yes, this is a commercial) and online news. How cool if everyone could agree on the basics, such as how a bill becomes a law or the true nature of filibusters. And we could demand that our children take mandatory classes in civics and history again. It seems that many foreign children know more about U.S. history than many of our children do. Every child should know, for example, that the Fourth of July should actually be celebrated on July 2. We should always remember that we have thousands of men and women in uniform who make daily sacrifices for the rest of us. We should never forget that thousands have been killed and maimed. We should resolve to do all that we can to make life better for the survivors and their families and we should honor the families of those who gave up their lives. We should resolve to make it easier, not harder, for our citizens to vote. We should expand voting hours, not restrict them. We should organize carpools to get people to the polls. We should not make senior citizens who have been voting for decades spend time and effort to retrieve long-lost birth certificates in order to vote. We should rejoice that people of all shapes, sizes and colors want to vote. As exemplary citizens, we should all lose weight, exercise, eat more fruit and vegetables and get plenty of rest. Finally, we should resolve not to keep alive all those poinsettias we collected over the holidays. By mid-January, we are saddened by those spindly stalks and shedding, dessicated leaves. Besides, who knows what exotic colors next years poinsettias will sprout.  , McClatchy-Tribune News Service, Ann McFeatters has covered the White House and national politics since 1986. Her email address is amcfeatters@nationalpress.com.]", "Date": "20131230", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/how-to-be-a-better-lsquowe-the-peoplersquo/", "Title": "[How to be a better we the people]"}