{"Content": "[ During the depths of the economic crises that consumed his first term, President Barack Obama helped pluck a Harvard professor named Elizabeth Warren out of relative obscurity and made her the face of his campaign to curtail Wall Street banks. Now Warren, who parlayed that platform into a Senate seat from Massachusetts, is showing a willingness to take a stand against Obama, magnifying rifts in the Democratic Party and sparking speculation about her own presidential ambitions. Despite their shared history, Warren and the White House have a political incentive in using each other as a foil. For Obama, creating distance with Warren may be seen as a tack to the center that clears the way for striking deals with Republicans, which is likely to be the only way he can rack up legislative achievements during his final two years in office. Next month, the GOP will hold a commanding majority in the House and a comfortable edge in the Senate. For Warren, splitting with the president, particularly on economic issues, helps solidify her as a populist champion and perhaps opens a lane for challenging expected Democratic presidential candidate Hillary Rodham Clinton. We are in a moment on economic inequality and that is the defining fight of Elizabeth Warrens life, said Anna Galland, executive director of the progressive group MoveOn.org, which has launched a $1 million effort to draft Warren for the 2016 campaign. Warren has repeatedly shot down speculation of a White House run. In an interview with NPR that aired Monday, she said, I am not running for president  but pointedly avoided answering whether she was also ruling out running for president in the future. The draft Warren campaign has picked up momentum following her high-profile split with Obama last week over a $1.1 trillion spending bill to keep the government funded through Sept. 30. Warren balked at a provision that weakened regulations on complex financial instruments known as derivatives that were included in the 2010 Dodd-Frank financial reform legislation. Warren blasted the measure as a deal negotiated behind closed doors that slips in a provision that would let derivatives traders on Wall Street gamble with taxpayer money and get bailed out by the government when their risky bets threaten to blow up our financial system. Despite her opposition, the legislation passed the House and Senate. Sen. Dick Durbin of Illinois, the Democrats second-ranking Senate leader, said the White House retains trust in Warren, and he doesnt worry about her fracturing the party. A party has to have a soul, Durbin said in an interview Monday. And I think what she is speaking to are the progressive issues. And I happen to agree with her thinking. A senior White House official described the split with Warren as more of a tactical disagreement than an ideological divide. Obama also opposed rolling back the bank regulation, but calculated that protecting the measure wasnt worth risking a government shutdown. Warren spent most of her career in academia, studying bankruptcy and middle class financial issues. Shortly after Obamas election in 2008, Senate Majority Leader Harry Reid appointed her to chair a congressional panel created to oversee the massive bank bailout known as TARP. As Obama pressed Congress to pass financial reform legislation, he fought to include the creation of a consumer financial protection agency, a concept Warren is considered the architect of. After the Dodd-Frank bill passed, Obama brought Warren into his administration to help set up the consumer agency. Obama had hoped to nominate Warren as the agencys first director, but changed plans after it became clear Republicans would block her confirmation. Warren handily won a Senate seat in Massachusetts in 2012 and has at times been candid in calling out the White House. When asked about the president in an interview this fall with Salon, she said that when the going got tough, his economic team picked Wall Street. She also opposes Obamas pick of banker Antonio Weiss to fill the top Treasury job, saying the revolving door between Wall Street and Washington must stop. Warren has calibrated her criticisms of the Obama administration, avoiding personal attacks. Still, she makes her points in spirited speeches, such as one she made from the Senate floor late Friday. The American people are disgusted by Wall Street bailouts, she said. Republican Sen. Lindsey Graham of South Carolina spoke next, and warned Democrats that Warren would lead them down a treacherous path. Blocking the compromise spending bill, Graham said, would prove as unpopular now as the GOP-driven government shutdown was in 2013. Dont follow her lead, Graham said. Shes the problem. It may be tempting to go down the road of least resistance, but you will regret it. It hurt my party. It will hurt yours. ", "Date": "20141216", "Author": "[JULIE PACE, CHARLES BABINGTON]", "Link": "http://www.seattletimes.com/seattle-news/politics/obama-warren-emerge-as-potential-political-foils/", "Title": "[Obama, Warren emerge as potential political foils]"}