{"Content": "[ Gov. Chris Christie of New Jersey announced Monday that he would drop his legal challenge to same-sex marriage, hours after same-sex couples started exchanging vows in midnight ceremonies across the state. Christies withdrawal of his appeal to the court decision that allowed the marriages came on the heels of a ruling by the states Supreme Court on Friday that rejected his attempt to block the marriages until the appeal was resolved. His decision effectively removed the last hurdle to making same-sex marriage legal in New Jersey. Although the governor strongly disagrees with the court substituting its judgment for the constitutional process of the elected branches or a vote of the people, the court has now spoken clearly as to their view of the New Jersey Constitution and, therefore, same-sex marriage is the law, a spokesman for Christie said in a note to reporters Monday morning. The governor will do his constitutional duty and ensure his administration enforces the law as dictated by the New Jersey Supreme Court. At 12:01 a.m. New Jersey joined 13 other states and the District of Columbia in allowing gay couples to marry. As images of joyous wedding celebrations from Jersey City to Asbury Park filled the airwaves, Christie sent a letter overnight to the lawyers fighting on behalf of the gay couples in the court case, and to the Supreme Court, announcing that he would drop any further opposition. Christie, a Republican widely considered a leading contender for his partys presidential nomination in 2016, has long tried to walk a fine line on same-sex marriage, which polls show is popular in his home state but opposed by conservative voters in key primary states. Last year, he vetoed legislation allowing same-sex marriage, arguing that voters should decide the issue in a referendum instead. As recently as last week, he repeated his position that he believed marriage to be between a man and a woman. But the court was unanimous in its decision to deny the administrations request for a stay on marriages, and the justices said in their decision that they believed the administrations appeal had no reasonable probability of success. The governor, in consultation with his attorney general and chief counsel, concluded it would be what one aide called a fools errand to continue in the face of almost certain failure. Christies advisers said they did not believe it would hurt him politically; the governor has long branded himself as the kind of politician that voters like because they know where he stands, even if they do not agree with him. In this case, he can argue that he did not reverse his position; he still opposes same-sex marriage, but his back was to the wall. In the short term  he stands for re-election in two weeks  he may win some votes in New Jersey. Among conservative voters in 2016, he can blame activist judges  an argument that also resonates among Republican primary voters. He looks realistic, while sticking to his principles  and people are happy, one adviser said. Lawrence Lustberg, who argued the case for the gay and lesbian couples before the state Supreme Court, said that as he attended the overnight wedding celebrations, he was anticipating the governors decision, which then was confirmed by the letter he received Monday morning. I think the handwriting was on the wall as clearly as it could possibly be, he said. The governor had always said he would fight this all the way up to the Supreme Court, but he didnt say he was going to fight it to the Supreme Court twice. As a matter of reasonable lawyering on the one hand, and a clear perception of what the courts position was on the other, this was inevitable. The legal landscape has changed significantly since Christie vetoed legislation in 2012 that would have made gay marriage legal in the state. In June, the Supreme Court struck down the federal Defense of Marriage Act and declared that the federal government must provide the same benefits to gay married couples as it does to heterosexual married couples. Using that ruling as the legal underpinning for a decision issued last month, Judge Mary Jacobson of state Superior Court in Mercer County found that the states not allowing same-sex couples to get married deprived them of getting federal benefits and is currently harming same-sex couples in New Jersey in a wide range of contexts. Christie immediately said he would appeal the decision and sought a stay to prevent the marriages from taking place starting on Oct. 21, as the court ordered. The petition was denied, and the first couples across the state were married just after midnight Monday. In denying the bid to halt the marriages, Chief Justice Stuart Rabner of the states Supreme Court indicated that the Christie administration was likely to lose its appeal. The state has advanced a number of arguments, but none of them overcome this reality: Same-sex couples who cannot marry are not treated equally under the law today, he wrote. The harm to them is real, not abstract or speculative. Christie acknowledged that the legal fight was most likely a lost cause. Chief Justice Rabner left no ambiguity about the unanimous courts view on the ultimate decision in this matter, a spokesman said. Some groups opposed to same-sex marriage were critical of both activist judges in New Jersey, as well as Christie. The mark of a leader is to walk a principled walk no matter the difficulty of the path, said Brian Brown, president of the nonprofit National Organization for Marriage. Chris Christie has failed the test, abandoning both voters and the core institution of society  marriage as the union of one man and one woman. Advocates of same-sex marriage viewed Christies withdrawal from the legal battle as the victory they have long sought. This is the day weve been waiting for. This is the day weve been fighting for. This is the day we won, said Troy Stevenson, executive director of Garden State Equality, the states most prominent gay-rights group. Marriage equality is the law of the land in New Jersey at last.]", "Date": "20131021", "Author": "[KATE ZERNIKE, MARC SANTORA]", "Link": "http://www.seattletimes.com/nation-world/christie-drops-appeal-of-same-sex-marriage-in-new-jersey/", "Title": "[Christie drops appeal of same-sex marriage in New Jersey]"}