{"Content": "[ FRANKFORT, Ky. (AP)  James Comer conceded, Matt Bevin accepted and Kentuckys race for governor finally got underway Friday following a tumultuous primary that left Democrats giddy and Republicans focused on uniting their scattered base. Comer, the state agriculture commissioner, conceded a day after a review of election results confirmed he lost to Bevin by 83 votes in one of the closest statewide elections in history. In a news release, he enthusiastically endorsed Bevin and promised to do everything he can to help him win in November. The race now pivots to November, where a pair of failed U.S. Senate candidates will face each other in a rare off-year election for an open governors seat. Its happening in one of the few states that still has a thriving two-party system, making it an indicator of sorts for the 2016 presidential election. Democratic nominee Jack Conway is the state attorney general who lost to U.S. Sen. Rand Paul by 11 percentage points in 2010. Bevin is an investment banker who has never held public office but famously lost badly to U.S. Sen. Mitch McConnell in the 2014 Republican Senate primary. Democratic Gov. Steve Beshear, known for his enthusiastic embrace of the federal Affordable Care Act, cannot seek re-election because of term limits . Republicans quickly closed ranks Friday, holding a news conference at the state party headquarters in Frankfort with chairman Steve Robertson declaring Republicans support Bevin with every fiber of our being. Just one year ago, Bevin was a flailing candidate for Senate who was shut out from most GOP events and complained loudly about a party that would not give him a chance. He was once prevented from even approaching McConnell during a Republican dinner in Fayette County. McConnell quickly endorsed Bevin by name Friday in a one-sentence news release. But Democrats were quick to pounce on their fractured relationship, unveiling a website devoted to highlighting comments from McConnells 2014 Senate campaign that called Bevin a pathological liar and an East Coast con man. Bevin dismissed those attacks, referring to Conways campaign staff as a bunch of 14-year-olds that are talking about gibberish. If the best that youre going to hear from them is jobs, jobs and more jobs and were for the working class people, were going to run away with this. Theyve got nothing, Bevin said. What they are going to do is they are basically going to fire up all of the 14-year-olds that work for their campaign and they are going to dust off all their best snark, and if thats the best they have, giddy up. Really and truly, Im not too concerned about it. Conway seemed to welcome Bevin , and his comments, into the race, saying in a news release that Im the only candidate with a proven record of putting people over politics, and thats a commitment I promise to keep. A Bevin-Conway matchup Nov. 3 promises to be full of contrasts. Bevin has vowed to repeal Kentuckys expanded Medicaid program under the federal Affordable Care Act, a decision by Beshear that brought health insurance to more than 400,000 people across the state. Beshear cannot seek re-election because of term limits, but Conway has vowed to defend the program. Bevin has said he opposes same-sex marriage, while Conway as the state attorney general refused to defend the states gay marriage ban when a federal judge ruled it unconstitutional. Bevin said he would make Kentucky a right-to-work state, meaning people could work for Kentuckys GM plant and not be required to join a labor union. Conway has fought against counties that have tried to pass similar local ordinances, arguing labor unions lead to better pay and more benefits for working families. And Bevin has questioned the states participation in federal preschool programs, citing a federal study showing the benefits were inconsequential once a child got beyond third grade. Conway has based his campaign around expanding the states preschool programs. The difference between what we will be espousing on the Republican side and what will be coming on the Democrat side will be night and day, Bevin said.]", "Date": "20150529", "Author": "[ADAM BEAM]", "Link": "http://www.seattletimes.com/nation-world/after-close-primary-kentucky-governors-race-gets-underway/", "Title": "[After close primary, Kentucky governors race gets underway]"}