{"Content": "[ The machinery of the worlds finest democracy was on display the other night in downtown Seattle. On display, that is, if you paid $12,500  more than four times what is supposed to be the federal legal limit for a campaign donation  to get into a luxury penthouse to see it. The occasion was that Jeb Bush was in town raising money for his presidential bid. In the old days, before the U.S. Supreme Court blew up the campaign-finance laws, this would have been accomplished painstakingly, coaxing a grand or two at a time from thousands of potential backers. But this is the new gilded age of the super PAC. And somehow, though super PACs are supposed to exist only if they operate independently of any candidate, Bush has his own, called the Right To Rise super PAC. On Monday it was soliciting donations of $25,000 per couple, minimum, to hear a short roundtable with special guest Governor Jeb Bush  as if hed been quite the get for his own political action committee. Its a complete end-run around the law, says Paul Ryan, senior counsel for the Campaign Legal Center, one of those groups still out there screaming into the wind about big money pouring into politics. Its a sham what theyre doing. Its starting out the entire campaign with a lie. Ryan wrote a paper on the topic titled Testing the Waters and the Big Lie. Its about how most of the presidential candidates this year, not just Jeb Bush, have been raising unlimited amounts of money by insincerely pretending they arent running for president. This is why the fine print of Mondays fundraiser specified that it was not authorized by any candidate or candidates committee (not even the one standing right there). Its also why the super PACs website makes no reference to its entire reason for being, which is Jeb Bush, and has no photo of him. Its ridiculous, but the legal premise is that with no candidate, then the super PAC can raise and spend unlimited amounts of money, Ryan said. Once Bush officially announces, all that money will still be there and can be spent on his behalf  though independently, by others, of course. Bush also has a Right to Rise policy group that can raise unlimited amounts, but in secret. (It doesnt have to report the donors, making it so-called dark money.), Similarly, Hillary Clinton, Marco Rubio, Scott Walker and the other big-name candidates all have unlimited-donation super PACS, typically operated for them by supporters. Its only a matter of time before they do their own Northwest cash dashes, also avoiding much interaction with the public or the press to get straight at the rich people. (Bush did do an interview on the Michael Medved radio show, which I was glad to hear.), Whats jaw-dropping is that even the millionaires who went to that Seattle penthouse to fete Bush are rapidly getting priced out of this new political market. Just two brothers, the Kochs, have pledged to pour nearly $900 million into crowning the next president. It wont be long before the entire pre-primary campaign occurs only in private suites wooing not the rich, but the uber-rich. When the Supreme Court poured gas on all this in its Citizens United ruling five years ago, the courts premise was reasonable-sounding, if naive. It was that groups like super PACs cant corrupt because they have to act independently of the politicians. The appearance of influence or access will not cause the electorate to lose faith in our democracy, Justice Anthony Kennedy wrote. By definition, an independent expenditure is political speech presented to the electorate that is not coordinated with a candidate. I wonder, if the justice had been at the Seattle penthouse the other night, if hed have felt his words were being mocked.]", "Date": "20150421", "Author": "[NULL]", "Link": "http://www.seattletimes.com/seattle-news/super-pacs-rack-up-dollars-democracy-rings-hollow/", "Title": "[Super PACs rack up dollars, democracy rings hollow]"}