{"Content": "[ WASHINGTON (AP)  Presidential candidates are a common sight in Iowa as the 2016 campaign intensifies. But on Monday, the White House hopefuls will have some competition from the man theyre running to succeed. President Barack Obama will spend the afternoon in Des Moines, the capital of the kickoff caucus state that will be instrumental in winnowing down the 2016 primary field and ultimately picking a president in the general election. Officially, Obama will be in Iowa to join Education Secretary Arne Duncan for a back-to-school bus tour and to announce a change to the college financial aid system that will allow students to apply for assistance three months earlier. But the visit also allows Obama to make an imprint on the 2016 race, arguing for Democratic priorities and drawing a contrast with the many Republican candidates blanketing the state. The White House has been coy about Obamas choice of location for Mondays event. Spokesman Josh Earnest quipped to reporters that they may have some pre-deployed assets that could be used to cover the presidents trip to Des Moines  a reference to the bevy of national media that has descended on Iowa to cover the pre-caucus campaigning. But if Obama wanted to stay away from the campaign fray, he had plenty of other options for joining Duncans bus tour. Iowa is just one of seven states the secretary is visiting this week. Iowa is steeped with nostalgia for Obama. In 2008, he pulled off an upset win over challenger Hillary Rodham Clinton in the states kick-off caucus. On the eve of the 2012 election, he returned to Iowa for his final rally as a candidate, an emotional event held just steps from the site of his original campaign office in Des Moines. Clinton, who is again seeking the Democratic nomination, will be a few hours away from Des Moines Monday, holding campaign events in Cedar Falls and Decorah. The president and his former secretary of state are not expected to cross paths. Obama hasnt endorsed Clinton, though hes said she would be an excellent president. His spokesman has said the same of Vice President Joe Biden, who is contemplating a late entry into the Democratic race. The president has been less restrained in weighing in on the Republican contenders, calling them an interesting bunch and comparing them to a wacky uncle who joins the family at Thanksgiving. You still love him, hes still a member of your family, right? Obama said in July. But youve got to correct him, you dont want to put him in charge of stuff. Thats all Im saying. The president and his education secretary will hold a town hall at a Des Moines high school Monday. As part of the event, the president will unveil a change to the federal financial aid system that allows students to apply in October instead of January. The White House said requiring applicants to wait until January slows down the aid process and makes it harder for prospective students to determine whether they can afford to go to college. ", "Date": "20150914", "Author": "[JULIE PACE]", "Link": "http://www.seattletimes.com/nation-world/in-iowa-obama-looks-to-leave-his-imprint-on-2016-race/", "Title": "[In Iowa, Obama looks to leave his imprint on 2016 race]"}