{"Content": "[ There arent many people who think Vice President Joe Biden could be elected the next president. But he is said to be thinking about running because Hillary Clinton is conducting a terrible campaign and Bidens beloved son Beau urged his father to run shortly before he heartbreakingly died of brain cancer. If Biden has the stomach for it, he should run because he would make the Democratic race more interesting  much more interesting  and he would make Clinton a better candidate. With the Republican race currently Trumpified, the American people are getting short shrift. Too few candidates are talking seriously about issues that really matter, including Clinton. She refuses to give her views on such vital matters as the pending trade deal and Keystone XL pipeline on grounds that this is up to the Obama administration. How infuriating! She parrots the phrase, Black lives matter, which is the same as saying, Honesty is the best policy. Well, duh. Of course! But were still waiting for a bold vision from her on anything. So far she has offered no new initiatives other than dusting off a proposal to raise capital-gains taxes for short-term investors. She cant say how she would get anything passed by a divided Congress that basically ignores Obama. Obama has done some good things for this country, but has not been able to convince people of that. Biden, unbridled from being a loyal backbencher, could much more forcefully defend the administration he has been a part of for eight years and express his thoughts on what it has failed to do. This election should be a referendum on the last eight years as well as a national discussion on where we want to be headed and what kind of people we want to be. That the independent senator from Vermont, Bernie Sanders, has a cult following among progressives should not be a surprise. People are desperate for passion, candor and fire in the belly. His campaign is a quixotic and refreshing throwback to the Eugene McCarthy era, but Sanders cannot be elected president. It is clear that Clinton does not take him seriously and that she has no intention of moving to the left, which would be a disaster for her in 2016. Marylands former Gov. Martin OMalley, former Gov. and Sen. Lincoln Chafee of Rhode Island and former Sen. Jim Webb of Virginia are all nice-guy Democrats, but have no traction and will be asterisks in the race. Biden as sitting vice president has more clout. The latest NBC/Wall Street Journal poll indicates that Americans are scared and worried about their economic future in a global economy that is leaving the middle class behind. We need to hear Bidens unvarnished views on why 65 percent of those surveyed insist the country is on the wrong track. That is slightly worse than similar sentiment during the peak years of dissatisfaction with George W. Bushs presidency. Former Gov. Jeb Bush of Florida, whose father and brother were presidents, is slipping fast in the polls. Its still looking like another Bush-Clinton slugfest in November 2016, but you can hear the national sigh of disappointment. Most worrisome to Democrats should be the lackluster and flawed campaign Clinton is running. She cant seem to get past questions about her familys foundation and the poor judgment she showed with keeping a private email server while serving as secretary of state. Americans want a candidate of optimism, not one mired in past scandals and unanswered questions  nor one who cant seem to shake a cloak of arrogance. Biden may lack the magic of charisma but he has been heavily involved in the mechanics of government for decades and should be able to answer any questions we put to him. He is well-liked by his peers and respected as a straight shooter. This may well be an anti-establishment, anti-Washington election. But for now we say, bring it on, Joe. Lets talk.]", "Date": "20150808", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/run-joe-biden-run-hillary-clintons-campaign-is-lackluster/", "Title": "[Run, Joe Biden, run! Hillary Clintons campaign is lackluster]"}