{"Content": "[ WASHINGTON  President Obama isnt expected to get the federal minimum-wage increase hes wanted anytime soon, but advocates hope that public support for the issue gets a boost from an unusual set of states this Election Day. Alaska, Arkansas, Nebraska and South Dakota  four solid-red states whose voters often oppose the presidents agenda  might be next to raise the wage floor of Americas lowest-paid hourly workers. On Nov. 4, they will vote on ballot measures to increase their minimum wages. Some advocates hope that victories on the ballot, especially in four Republican strongholds, will change the national narrative of the economic debate. It becomes a lot harder for members of Congress who might not support these kinds of things to continually say no when it comes up in Washington (D.C.), said Josh Levin, a vice president at the left-leaning Ballot Initiative Strategy Center, which supports activists on state ballot measures. States have already been busy on the minimum wage this year. Ten state legislatures and the District of Columbia have raised their minimum wages in 2014, according to the bipartisan National Conference of State Legislatures. However, the legislation mostly passed in blue states such as Vermont, Massachusetts and Hawaii. Only one of those 10 states, West Virginia, voted for Republican Mitt Romney in the 2012 presidential election. The issue has gained a lot of attention this year. Earlier this month, fast-food workers across the country participated in a strike in favor of a $15-per-hour livable wage, more than double the current federal floor of $7.25. The Seattle City Council passed a $15 hourly rate in June, which will be phased in, and some activists are pushing that figure elsewhere in Washington state. The ballot measures in Alaska, Arkansas, Nebraska and South Dakota would bring about much smaller increases. But that doesnt bother Steve Copley, chairman of the Give Arkansas a Raise Now coalition. Every penny that somebody who is working hard can get helps, Copley said. Activists must be realistic about what increases they push for at the polls, said Peggy Shorey, the director of state government relations at the AFL-CIO, whose state federations support the ballot initiatives. Arkansas is not the same as Seattle, she said. The current $6.25-per-hour state minimum wage makes Arkansas one of three states lower than the federal floor for hourly wages. Only Georgia and Wyoming are lower, according to the U.S. Department of Labor. (When state minimum wages differ from the federal rate, the higher rate is adhered to in that particular state, as employers dont want to violate federal law.), Last year, about 91,000 workers earned the federal minimum wage or below  employees who earn tips, for example  in the four states with November ballot proposals, according to the Labor Departments Bureau of Labor Statistics. However, thousands more would be affected as the state wage floors rose gradually. While all four initiatives would begin wage increases Jan. 1, the approaches are split on their long-term considerations of how to link the minimum wage to cost-of-living increases. Under Alaskas ballot proposal, the minimum wage would be tied to increases in the Anchorage Consumer Price Index caused by inflation starting in 2017. South Dakotas initiative would raise the minimum wage based on changes to a national CPI metric starting in 2016. Tying annual increases to CPI fluctuations is controversial. Opponents in South Dakota say its one of their biggest concerns of the ballot proposal there. The economies in Florida, California and New Jersey are going to dictate how employers in our state are going to have to do (wage) increases every year, said Shawn Lyons, the executive director of the South Dakota Retailers Association, a wage-hike opponent. Ten states, including Florida and Washington, have minimum wages legally tied to CPI metrics, according to the Department of Labor. New Jersey will join them in January, with the District of Columbia, Minnesota and Michigan scheduled to follow suit in upcoming years. Copley said such a measure in Arkansas would have been a nonstarter at the polls. We didnt feel like we could get it passed, he said. Instead, the minimum hourly rates would top off at $8.50 per hour in 2017 in Arkansas and $9 per hour in 2016 in Nebraska under their ballot proposals. Illinois, considered a left-leaning state, is holding a vote in November on raising its $8.25 minimum hourly wage to $10, but the advisory referendum is nonbinding and doesnt carry the weight of law. Republican state Sen. Kyle McCarter sees that as election-year political maneuvering. The Dems are loading the ballot with referendums that mean nothing, just so they can get their traditional supporters out to the polls to vote for them, he told the Belleville News-Democrat in May. Former Alaska labor commissioner Ed Flanagan, whos a wage-hike advocate, said the Alaska campaign had benefited from a grass-roots union presence. At 23.1 percent of the states wage and salary workers, Alaskas union membership rate is more than double the national rate, according to BLS data. Some minimum-wage-hike opponents think the getting-out-the-vote effect of the ballot proposals is a one-way street. Nebraska Taxpayers for Freedom President Doug Kagan said the minimum-wage ballot proposal was unlikely to excite voters on his side of the debate. The minimum-wage issue is more important to the Democratic voters than to the Republican voters in Nebraska, said Kagan, whose conservative group opposes raising the state minimum wage. Our polls would indicate we have a lot of work to do to educate people on some of our concerns, said Michael Held, a lobbyist with the South Dakota Farm Bureau, which opposes that states proposal. In August, 58 percent of surveyed potential Alaska voters supported the state initiative there, according to Public Policy Polling, a Democratic polling firm. A poll by the Arkansas publication Talk Business and Hendrix College found in April that 79 percent of surveyed Arkansas voters supported their states ballot initiative. Five Southern states  South Carolina, Georgia, Tennessee, Mississippi and Alabama  have no state minimum wage at all, deferring to the federal rate.]", "Date": "20140924", "Author": "[Daniel Salazar]", "Link": "http://www.seattletimes.com/nation-world/labor-activists-look-for-wage-hike-support-from-red-states/", "Title": "[Labor activists look for wage-hike support from red states]"}