{"Content": "[ The Washington Supreme Court has refused to block a public vote on Tim Eymans latest anti-tax initiative. The court Friday rejected an appeal by opponents of Initiative 1366, who argued the measure should be removed from the November ballot because it blatantly exceeds the scope of citizen-initiative powers allowed by the state constitution. In a unanimous decision, the court said opponents of the measure had not met the high legal threshold to block a vote on a citizen initiative already certified for the ballot. I-1366 seeks to pressure state lawmakers into sending a constitutional amendment to the 2016 ballot that would restore a two-thirds vote requirement for any tax increases enacted by the Legislature. The supermajority rule would not apply to taxes sent to voters for approval. If legislators refuse to put that amendment to a public vote, the initiative would cut the states 6.5-cent sales tax by a penny  reducing state revenues by more than $1.4billion a year. The two-thirds rule for legislative-tax votes had been approved in previous initiative votes but was struck down as unconstitutional in 2013. Tim Eymans use of initiative money is investigated, The state constitution cannot be amended directly by a citizen initiative. The Legislature, with a two-thirds vote of the House and Senate, can place proposed amendments on the ballot, which then require a majority public vote to be enacted. Opponents of I-1366 argue it amounts to an illegal effort to sidestep that process by strong-arming legislators into launching an amendment process. Lawyers representing Eyman and Secretary of State Kim Wyman had argued that voters deserve a chance to debate the measure and urged the court to keep it on the November ballot. Wymans office had asked for a Supreme Court ruling by this week so that county elections offices could start printing ballots and voters guides for the November election. In a statement, Wyman applauded the court decision as a win for Washington voters and our states initiative process. Eyman blasted the efforts to halt a public vote on I-1366, saying opponents dont trust the voters and believe the people arent smart enough to understand our measure. Opponents vowed to defeat the initiative  whether at the ballot box or through another legal challenge. I-1366 would lock in place our states upside-down tax system and make it nearly impossible to close tax loopholes or fully fund education, said Collin Jergens, a spokesman for Fuse Washington, a liberal advocacy group backing the legal challenge. The lawsuit to block the initiative vote was filed by a group that included Democratic state legislators, parents of public-schools children and social-services advocates. King County Superior Court Judge Dean Lum ruled last month the initiative appeared to violate the state constitution  and likely would be invalidated at some point if it were passed  but he declined a request by plaintiffs to halt a vote on the measure. The decision Friday by the Supreme Court upheld Lums decision. The court issued only a brief ruling, saying a more detailed opinion explaining its reasoning would be forthcoming.]", "Date": "20150904", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/supreme-court-wont-block-eyman-initiative-vote/", "Title": "[State Supreme Court wont block Eyman anti-tax initiative vote]"}