{"Content": "[ NASHUA, N.H.  The 2016 presidential race is shaping up as an epic struggle between generations. On one side are the baby boomers who came of age in the 1960s and whose generation now is heading toward retirement  Democrat Hillary Rodham Clinton, who would be 69 on Election Day and the second-oldest president ever, and Republican Jeb Bush, who would turn 64 soon after becoming president. On the other is a wave of younger faces who came of age in the 1980s, including Republicans Marco Rubio, 43; Ted Cruz, 44; Scott Walker, 47; and Chris Christie and Rand Paul, each 52. Its not just the candidates who make this a generational battle. Its voters. Younger people see the world differently. Theyre far more willing to embrace such social changes as gay marriage and to communicate electronically. Older voters, though, are hardly fading away. They remain determined to see secure Social Security and Medicare systems, a more efficient health-care operation and more direct aid to help struggling workers. Rubio, who would be the third-youngest person to be sworn in as president, suggested a need to hand the baton to his generation when he kicked off his campaign by telling a Miami audience that the generation before him put us at a disadvantage by taxing, borrowing and regulating like its 1999. As he spoke to New Hampshire activists Friday, supporters passed out signs reading, Marco Rubio A New American Century. Clintons announcement video and tours of Iowa and New Hampshire in recent days tried to assure younger people, particularly the racial minorities who make up an important part of the Democratic Partys base, that with governments help they could lead fulfilling middle-class lives while their parents are assured of being comfortable. But her appeal was far less targeted to that generation. Republicans are going out on riskier limbs. Christie last week offered a detailed plan to revamp Social Security and Medicare, including raising the eligibility ages and phasing out Social Security benefits for those earning more than $80,000 from other sources. Few serious presidential candidates would have dared to tinker with those programs even a few years ago. Today, such blueprints are a potentially effective strategy for mobilizing a new wave of voters, those born during and after the Reagan administration. Those younger voters tend to be more conservative and less loyal to any specific political party, said Kei Kawashima-Ginsberg, director of Massachusetts-based CIRCLE, which studies young voter trends. Young people would like to be interactive with government, said Kawashima-Ginsberg. They want to see politicians being responsive. Older voters also want responsiveness, but of a different sort. The elderly population is expected to more than double by 2050, with most growth between now and 2030, according to the Census Bureau. We are facing an unprecedented age dependency, people who will rely on Social Security and Medicare, said William Frey, a senior fellow and demographics expert at Washingtons Brookings Institution. Older people tend to vote in bigger numbers and have shown themselves more inclined to support Clinton or Bush. The younger voters are a growing counterforce. Frey noted that the most important element of our demographic transformation is the one occurring at younger ages. Hispanics, blacks and others will replace their aging white counterparts, he said. Frey estimated that in a dozen years, more than half the young adult labor force will be racial minorities. In 2012, voters over 65 were about 16 percent of the electorate, while those under 30 made up about one-fifth. That was a switch from 2004, when about one-fourth of voters were over 65 and 17 percent were under 30. Younger voters go to the polls when motivated, and when they do, they prefer inspirational, nontraditional candidates such as Barack Obama. When not motivated, they stay home. CIRCLE estimated that in 2012, the under-30 vote was decisive in helping Obama win swing states Florida, Ohio, Pennsylvania and Virginia. Should they be credited with electing the new president, governing could take on a new hue. They have a more complicated way of looking at government, said Matthew Hale, associate professor of political science at Seton Hall University in New Jersey. Theyve grown up in a country where government is largely regarded as bloated, debt-ridden and inefficient. They dont expect to see much help from government programs as they age. They do want government to work in targeted ways, notably by providing educational opportunities and vigorous civil-rights protections for gays, Hispanics, African-Americans and other minorities. And theyre willing to back changes in Social Security and Medicare.]", "Date": "20150421", "Author": "[David Lightman]", "Link": "http://www.seattletimes.com/nation-world/generational-divide-a-story-line-for-2016-presidential-race/", "Title": "[Generational divide a story line for 2016 presidential race]"}