{"Content": "[ OSHKOSH, Wis. (AP)  Republican Wisconsin Gov. Scott Walker, one week after launching his bid for the 2016 presidential nomination, signed a bill Monday that outlaws non-emergency abortions at or beyond 20 weeks of pregnancy. Abortion is a core issue for the conservative Republican base whose support Walker will seek as he tries to stand out in a crowded presidential field that also includes former Florida Gov. Jeb Bush, Florida Sen. Marco Rubio and billionaire Donald Trump. While Walker has a long history of opposing abortions, its an issue where he could be targeted by rivals: Just nine months ago he ran a television ad during his gubernatorial re-election campaign where he expressed support for a bill that would leave abortion decisions between a woman and her doctor. Walkers record includes defunding Planned Parenthood; requiring abortion doctors to have admitting privileges at nearby hospitals, a law currently blocked by a federal court judge; and requiring women to have ultrasounds and be shown images of the fetus before having an abortion. Walker last year, during his re-election campaign, refused to say last year whether he would support a 20-week abortion ban. But in the face of questions from anti-abortion conservatives over his commitment to the issue in the light of the campaign ad, Walker in March came out in support of the 20-week abortion ban. The truth is that Scott Walker lied to Wisconsin voters when he was elected governor after saying that abortion is between a woman and her doctor, said Sasha Bruce with NARAL Pro-Choice America, a leading abortion rights advocacy group. Now, in an effort to win the votes of the extreme base of the Republican Party, Walker has traded the health and well-being of women and families to score cheap political points. The governors signature makes Wisconsin the 15th state to pass similar bans. There is no exception for pregnancies resulting from rape or incest. The new law  which cleared the Legislature without any Democratic support  is expected to be challenged in court. Walker, speaking with reporters after the bill signing, said he was confident it would survive any legal challenge, calling the five-month ban a reasonable standard. For people, regardless of where they might stand, when an unborn child can feel pain I think most people feel its appropriate to protect that child, Walker said. But Kaylie Hanson, speaking for the Democratic National Committee, said the new law was nothing more than a timely favor for the Republican base days after Walker joined the presidential race. The harsh reality is that this law will hurt women, as it puts up barriers to care for rape and incest survivors  no exceptions  and threatens the health of the mother, Hanson said in a statement. This law doesnt only undermine the most basic womens health services. Its radical, dangerous, and lacks respect for half the population of Wisconsin. Bans on abortion after 20 weeks are popular, at least on the surface. A Quinnipiac University poll conducted in November of 2014 found that 6 in 10 Americans support banning abortions after 20 weeks of pregnancy, except in cases of rape or incest. On the other hand, a 2012 CNN/ORC poll found the vast majority of Americans  more than 8 in 10  said abortion should be legal in cases of rape or incest. An Associated Press-GfK poll conducted in January and February found that 51 percent of Americans think abortion should be legal in all or most cases, while 45 percent think it should be illegal in most or all cases. Under the new Wisconsin law, doctors who perform an abortion at or after 20 weeks in non-emergency situations could be charged with a felony punishable by up to $10,000 in fines and 3 years in prison. Doctors could also be sued for damages. Doctors would be allowed to perform abortions beyond 20 weeks only if the mother is likely to die or suffer irreversible injuries within 24 hours. The laws supporters say fetuses can feel pain after 20 weeks. They say the ban will spare those unborn children an excruciatingly painful death. The American Congress of Obstetricians and Gynecologists, however, says fetuses cant feel pain until the third trimester starts at 27 weeks. Minority Democrats have complained that Republicans should leave women alone and let them decide how to handle their own bodies. Abortions after 20 weeks are rare in Wisconsin. According to the most recent state Department of Health Services information, 89 of nearly 6,500 abortions performed in Wisconsin in 2013, or roughly 1 percent, occurred after the 20-week mark. The U.S. Supreme Courts 1973 Roe v. Wade decision established a nationwide right to abortion but allowed states to restrict the procedures after the fetus reaches viability, the point where it could survive outside the womb. The ruling offered no legal definition of viability but said it could range from the 24th to 28th week of pregnancy. Courts have blocked bans in Georgia, Idaho and Arizona. Litigation in other states is ongoing. A federal appellate court in May struck down Arkansas ban on abortions after the 12th week of pregnancy if a doctor can detect a fetal heartbeat, finding that prohibition unconstitutionally burdens women. ", "Date": "20150720", "Author": "[SCOTT BAUER, TODD RICHMOND]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/gop-presidential-hopeful-walker-signs-abortion-ban-bill/", "Title": "[GOP presidential hopeful Walker signs abortion ban bill]"}