{"Content": "[ Sen. Ted Cruz, seemingly eyeing a presidential run in 2016, calls his renunciation of Canadian citizenship no big deal, even though questions about candidates birthplaces have flared in recent elections. Controversy still dogs President Barack Obama from some quarters despite proof he was born in Hawaii. Cruz, a Texas Republican and tea party favorite, was born in Canada, to a Cuban father and U.S.-born mother. His mothers status has allowed him to be a citizen of both the United States and Canada, but he said Tuesday in Houston, I believe it makes sense for me to be only an American. Previous foreign-born Americans  notably Republicans John McCain and George Romney  have run for president with some mention but no serious challenges of their eligibility. The chief upshot of Cruzs announcement that he will renounce his Canadian citizenship is to suggest hes seriously eyeing a presidential bid in 2016, and would like to settle that side issue now. Cruz is among Obamas sharpest critics, and is vying for early national attention with another tea party-backed Senate freshman, Rand Paul of Kentucky. Cruz is helping lead an effort to shut down the government if thats what it takes to stop implementation of Obamas landmark health care overhaul. While some birthers still challenge Obamas citizenship  and therefore his right to be president -his situation is different from Cruzs. The son of a Kenyan father and American mother, Obama was born in Hawaii, according to his birth certificate. Though birthers reject that evidence, many establishment Republicans saw that controversy as an unwelcome distraction in Obamas two elections, and the movement never expanded much beyond the partys fringes. At tea party events, Cruz has declined to be drawn into debates about Obamas birthplace, though he says the president has pushed relentlessly for European-style socialism in America. Cruz acknowledges being born in Calgary, Alberta, on Dec. 22, 1970. He says that after moving to Texas as a child, he never made an affirmative claim to dual citizenship, and hes now promising to drop his Canadian citizenship if in fact he holds it, The U.S. Constitution says only a natural born Citizen may be president. Legal scholars generally agree the description covers foreign-born children of U.S. parents. McCain, the 2008 Republican nominee, was born on a U.S. military base in the Panama Canal Zone. George Romney, a former Michigan governor who ran for president in 1968, was born in Mexico. His son, Mitt Romney, was the 2012 GOP nominee. Asked in a 2012 interview with The Associated Press whether he holds dual U.S. and Canadian citizenship, Cruz wouldnt answer directly, saying only: I am a U.S. citizen. Speaking Tuesday in Houston, Cruz said of questions about his birthplace and citizenship, This may be the silly season in politics. He said reporters recently suggested he holds dual citizenship and asked if he would renounce any Canadian citizenship. I say, sure, of course I would, Cruz said. Why? Because Im an American citizen by birth, and as a U.S. senator, I believe it makes sense for me to be only an American. In an earlier statement this week, Cruz said, When I was a kid, my mom told me that I could choose to claim Canadian citizenship if I wanted. I got my U.S. passport in high school. Having lived in the United States since age 4, Cruz said, and because I have never taken affirmative steps to claim Canadian citizenship, I assumed that was the end of the matter. , Will Weissert reported from Austin, Texas.]", "Date": "20130821", "Author": "[CHARLES BABINGTON, WILL WEISSERT]", "Link": "http://www.seattletimes.com/seattle-news/politics/sen-cruz-shrugs-off-canadian-citizenship/", "Title": "[Sen. Cruz shrugs off Canadian citizenship]"}