{"Content": "[ AMES, Iowa (AP)  Rick Perry is attacking Donald Trumps credibility and branding the billionaire businessman a cancer on conservatism. Rick Santorum, a conservative stalwart, popped up on a TV program popular with liberals. Lindsey Graham set his cellphone on fire. With the first debate of the Republican presidential campaign approaching, the White House hopefuls are trying everything they can to improve their polling position. A candidate needs to place in the top 10 in an average of national polls to meet the criteria Fox News Channel has set to take the stage Aug. 6 in Cleveland. Those kept out risk being overlooked by voters and financial backers heading into the critical fall stretch before the nominating contests start early in 2016. If youre not on the stage youre irrelevant, you dont matter, said Republican pollster Frank Luntz. Unless you have some serious ad dollars, its not a glass ceiling. Its a concrete ceiling. At of this past week, former Hewlett Packard CEO Carly Fiorina, Louisiana Gov. Bobby Jindal, former New York Gov. George Pataki, ex-Pennsylvania Sen. Santorum and South Carolina Sen. Graham were outside the top 10. Others close to the edge including Ohio Gov. John Kasich, New Jersey Gov. Chris Christie and ex-Texas Gov. Perry. That would relegate them to a second-tier debate, only an hourlong airing before the prime-time event. In your heart of hearts, you want to see me debate Hillary Clinton, Fiorina, the only woman in the Republican contest, said with a grin, drawing applause from more than 100 people at an Ames country club Thursday. I would of course love to be on the debate stage, but were going to keep going with or without it, she told reporters afterward. The boys are going to fight, and Im going to keep doing what Im doing. One guaranteed participant is Trump, despite incendiary comments about Mexican immigrants and Arizona Sen. John McCains war record. Trumps remarks have drawn a backlash in a party trying to expand its Latino voting bloc and where national security is an influential constituency. Boring in on Trump is one approach some rivals hope will help them to break through as the debate nears. Perry unloaded on Wednesday when he called Trumps campaign a barking carnival act and toxic mix of demagoguery, mean-spiritedness and nonsense. Perry pollster Greg Strimple said the goal of the speech was part of a long-standing effort to raise his profile, not to get him in the debate. We had long-planned a speech defending conservatism, Strimple said. When Donald Trump made his negative comments, it provided us the perfect comparison. Perrys supporters are buying national cable ads that could boost his numbers ahead of the debate. On Friday, backers of Christie announced a new ad to air on Fox News. Graham, even further behind in polling, called Trump a jackass after the real estate executive said McCain was not a war hero. McCain served as a Navy pilot during the Vietnam War, who was captured after his plane was shot down and held for more than five years as a prisoner of war. Graham then starred in a video produced by a conservative website demonstrating how to destroy a cellphone after Trump publicly disclosed Grahams number during a campaign appearance in South Carolina. Curt Anderson, a strategist advising Jindals campaign, wrote in Thursdays Wall Street Journal that the Republican Party was sabotaging itself by controlling the debates too much, after concluding that marginal candidates dragged 2012 nominee Mitt Romney too far to the right. They have come out to limit the number of debates we can have, they dictated who can have it, where you have it and who will moderate it, Anderson said in an interview, adding that his complaints were unconnected to Jindals campaign. The only thing left is to dictate what can be said in it. As with Perry, an outside group supporting the Louisiana governor is buying ads on national cable just in time for the debate. Santorum spokesman Matt Benyon said Santorums TV appearances, including on MSNBCs The Rachel Maddow Show, were timed to take advantage of the candidates time in New York this past week, not to boost his poll numbers. Would it be great to be in the debate? Absolutely, Benyon said. But to change your campaign strategy to focus on one date in August is a pretty shortsighted idea. Republican consultant Reed Galen said candidates may have a better chance to introduce themselves to voters in the less-crowded second-tier debate than competing with Trump and the other contenders in the main debate. Still, he understood the drive for prime time. You get more licks in AAA-ball, Galen said. But the majors are the big show.]", "Date": "20150726", "Author": "[THOMAS BEAUMONT, NICHOLAS RICCARDI]", "Link": "http://www.seattletimes.com/seattle-news/politics/2016-republicans-use-trump-tv-to-make-debate-cut/", "Title": "[2016 Republicans use Trump, TV to make debate cut]"}