{"Content": "[ Along with celebrating food, music and culture during National Hispanic Heritage Month, a new tradition should take hold this year: registering to vote. In the past few months, the rise of Donald Trump as offender-in-chief infuriated many in the Latino community. Soon after Trump made disparaging remarks about Mexican immigrants while declaring his bid for the U.S. presidency, actress America Ferrera personally thanked Trump in a piece on the Huffington Posts website for sparking more political participation. There are a whole lot of Americans who are Latino and have the right to vote. And, were not going anywhere, Ferrera wrote. Your negativity and your poorly thought out speech ignited a fire in our community. Thank you, Mr. Trump! , The truth is, Latinos need a not-so-gentle nudge to get voting. According to the Pew Hispanic Center, of the roughly 25 million Latinos eligible to vote, at least 12.2 million are not registered, and only 48 percent of eligible voters turned out for the last presidential election in 2012. Washington ranks 11th among states for the most Latino voters. In 2014, about 300,000 Latinos in Washington were eligible to vote  about 6 percent of all voters. The first step is registering, which groups like Voto Latino have spent years advocating for and facilitating. For this years Hispanic Heritage Month, which runs from Sept. 15 to Oct. 15, the organization is sponsoring the Hispanic Heritage Month of Action campaign (hhmaction.com) to get more Latino citizens registered through word-of-mouth in person and online. The fury directed at Trump and other politicians who ignore Latino issues should be funneled into voting  not just in presidential elections, but also state and local elections. Here are some suggestions to increase Latino votes: , After cheering on children to break Trump-shaped piatas, Latinos should pass around voter registration cards at birthday parties or a tablet for online registrations. Instead of just sharing clever memes on social media (Im Cuban and I cant keep calm), you can share some provided by the Hispanic Heritage Month of Action campaign. Next November, after posting all your Dia de los Muertos selfies, remember to post one captioned, I voted. Consider the 2015 election a warm up for 2016. Voting in local elections often influences peoples lives more tangibly than national elections. Hispanic voters in Yakima are already showing more engagement in local politics after the city was mandated by federal court order to establish district elections, according to the Yakima Herald-Republic. In the August primary, more Latino voters cast ballots and five Latino candidates advanced to the general election. When Latinos do turn out to vote, their votes make a difference both locally and nationally, said Jessica Reeves, vice president of partnerships for Voto Latino. Meanwhile, voter apathy remains a problem across America, with some elections being decided by small fractions of the electorate. By the way, National Voter Registration Day is coming up Tuesday. Political observers have referred collectively to Latino voters as a sleeping giant, a problematic comparison suggesting that Hispanics are some sort of silent, passive and massive force that needs to wake up. Hispanics are not asleep culturally or politically. Nor do we vote as a monolithic bloc. Still, Americans who identify as Latino or Hispanic comprise a community, one that wants to advocate for its needs and exert influence like any other demographic. Both Democrats and Republicans recognize they need Latino votes to secure the White House. In 2012, President Obama swept 71 percent of Latino votes while challenger Mitt Romney took 27 percent. Back in 2004, Republican George W. Bush won the presidency with 40 percent of the Latino vote. I agree with Ferrera that Trumps anti-immigrant remarks should serve as a catalyst, not just a source of ire and an endless butt of jokes. The validation will come when millions more Latinos cast ballots every time the polls are open.]", "Date": "20150917", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/one-way-for-latinos-to-shut-up-donald-trump-register-to-vote/", "Title": "[One way for Latinos to shut up Donald Trump: register to vote]"}