{"Content": "[ WASHINGTON  Hillary Rodham Clinton opened her 2016 presidential campaign with a road trip to Iowa as Republican hopefuls, vying to be the one to face her if she wins the Democratic nomination, got an early and aggressive start taking her on. A van nicknamed Scooby and driven by the Secret Service was crossing a 1,000-mile swath of the country Monday from Clintons home in the New York City suburbs, setting the stage for a community college appearance the next morning and more campaign events in a state where she ran third in the 2008 caucuses. Clinton announced her bid for the Democratic nomination in a video Sunday, then hit the road. Already the GOP is treating her as the Democratic nominee. Announcing his own 2016 campaign to top donors Monday, Florida GOP Sen. Marco Rubio branded the former first lady, senator and secretary of state as a leader from yesterday who wants to take us back to yesterday. Kentucky Sen. Rand Paul, another declared candidate, put Clinton at the center of his first TV ad, titled Liberty, not Hillary. Prospective candidates piled on, too. Wisconsin Gov. Scott Walker criticized Clintons Washington-knows-best mentality in tweets. Former Florida Gov. Jeb Bush derided the Obama-Clinton foreign policy in a video message. While there are serious policy differences among the dozen or so major Republicans considering a run for president, they appear to have all concluded theres little downside in starting early on Clinton. Even former Massachusetts Gov. Mitt Romney, the partys 2012 nominee, couldnt resist, saying on Fox News Sunday that shes a creature of Washington and just not trustworthy. The road trip was Clintons idea, aides said. Longtime adviser Huma Abedin, in a conference call with Clinton alumni, said Clintons van stopped at a gas station in Pennsylvania, where she met a family from Michigan. She was expected to reach Iowa later in the day. Rubios team was initially concerned that Clintons announcement and activities would overshadow his splashy rally Monday evening thats expected to kick off his 2016 campaign. But they concluded the almost overlapping events would draw a contrast between Rubio, the 43-year-old senator, and Clinton, who is almost 25 years his senior. Its a calculus that didnt occur, or didnt matter, to Clinton. Her video, shared hundreds of thousands of times in the first hour after being posted online, said nothing about anyone else in the 2016 race. An old Clinton rival from Arkansas who is also considering a run for president, former Gov. Mike Huckabee, predicted her silence wont last. Anyone who thinks that shes going to get into this halfheartedly, well, theyve never ever encountered the will, the spirit, the heart and the determination of the Clinton political machinery, he said on ABCs This Week. Bush tapped supporters with a fundraising appeal to help him stop Clintons liberal agenda. Paul started selling Hillarys Hard Drive on his website, a not-so-subtle reference to Clintons use of a personal email account and server while serving as secretary of state. The Republican National Committee and conservative groups are in the anti-Clinton fray, too. At least 10 political organizations list defeating Clinton as their primary mission in their filings with the Federal Election Commission, and Democrats say theyre preparing to face much as $500 million worth of attack ads during the 2016 election. On Monday, the Republican National Committee said its Stop Hillary ad was shown repeatedly on all the major networks. Its campaign will continue this week with plans to distribute #StopHillary beer Koozies at the Washington Nationals baseball game. Ninety-eight percent of our focus has been on Hillary for the last year, said Sean Spicer, chief strategist and communications director of the committee. ", "Date": "20150413", "Author": "[Lisa Lerer]", "Link": "http://www.seattletimes.com/nation-world/clinton-already-uniting-prospective-gop-presidential-field/", "Title": "[Hillary Clinton already uniting prospective GOP presidential field]"}