{"Content": "[ WASHINGTON , Prime Minister Benjamin Netanyahus victory in this weeks Israeli elections has reverberated through U.S. politics, reinforcing Republican faith in the political wisdom of a hawkish foreign policy, worsening his already bad relationship with President Obama and energizing liberal critics of Israels government. But mostly it has complicated the life of Hillary Rodham Clinton. As she moves closer to making her campaign for president official, Clinton now faces a deepening polarization among Jewish Democrats over Netanyahu and how the United States should deal with his government. Clinton, the former secretary of state who has long advocated a two-state solution and once took credit for starting what were then secret talks for an Iran nuclear deal that Netanyahu vehemently opposes, is now likely to be under increased pressure from her own party to speak up against a government that is openly hostile to Obama.  But if she criticizes Israel, she risks prompting an influential segment of more conservative Jewish Democrats to withhold their support from her presidential campaign, or even to defect to a Republican candidate in 2016. Everyone is now going to have to pick a side, said Jeremy Ben-Ami, the president of J Street, a liberal Jewish lobby that has for years been advocating Obamas positions on Israel and which is hosting its annual conference this weekend. That included the woman at the forefront of the Democratic Party, he said, who would undergo more and more pressure. In contrast to the praise heaped on Netanyahu by virtually the entire field of prospective Republican candidates, Clinton has declined to comment on the Israeli election. Up until this point, Clinton has essentially shrugged off the criticism of liberals over Israels government, and ignored the emboldened fringe of progressive Jews who have advocated boycotting Israel to protest its settlement growth and wars in Gaza. Last summer she made light of her time as Obamas designated yeller at the State Department, a title she earned, in part, because of her upbraiding of Netanyahu in 2010 after he announced new settlements during a visit by Vice President Joe Biden. She then articulated a vigorous defense of Israel during last summers war in Gaza and since then has generally avoided public displays of empathy for the Palestinian losses that upset her liberal Jewish supporters. If I were the prime minister of Israel, youre damn right I would expect to have control over security on the West Bank, she told The Atlantic in August. Such muscular remarks about the defense of Israel are standard procedure for a Democratic presidential candidate. The overwhelming percentage of Jewish voters, and donors, are liberal and will never vote for a Republican. The progressives who are bothered by Israels right-wing government care a lot more about other issues, such as the economy and social issues. Support for Israels conservative government is strong among what people close to her estimate to be about a 10 percent sliver of wealthy and influential moderate Democratic Jews for whom Israel is a priority, and could be a reason to withhold their financial backing, if not support a Republican candidate. But the anger generated by Netanyahus appearance before Congress and the other events that led up to his re-election will probably mean that more Democrats will be less willing to bite their tongue when it comes to criticizing his government. A statement Thursday by the Conservative movements Rabbinical Assembly, which is traditionally a reliable defender of the Israeli government, condemned the prime ministers campaign rhetoric. That suggests an expanded space, and perhaps tolerance, for criticism of Israel and another consideration for Clinton as she formulates her response. This isnt going away, acknowledged one person close to Clinton. Not everyone subscribed to the notion that Jewish Democrats were being torn asunder by Netanyahu. Josh Block, president of the Israel Project, a pro-Israeli education group in Washington, blamed the Obama administration for manufacturing the tension to distract from the nuclear negotiations and progressive partisans for trying to exploit and exaggerate the tensions for their own political gains. Still, Jewish elected officials in the Democratic Party describe a nightmare scenario in which traditional supporters of Israel will receive primary challenges from candidates now openly critical of the Israeli government. Polls show that Israel is increasingly unpopular with African-American, Latino and young voters  a key portion of the Democratic base. Officials fear that an erosion of support for Israel in the party could cause insecurity among Jewish voters, forcing them to seek comfort in the eager embrace of the Republican Party. For now, Jewish voters are overwhelmingly Democratic and liberal. But for Republicans, and especially the partys neoconservatives, Netanyahus victory was a good omen. It will strengthen the hawkish types in the Republican Party, said Bill Kristol, the editor of the Weekly Standard, who said that Netanyahu would win the Republican nomination, if he could run, because Republican primary voters are at least as hawkish as the Israeli public.  And would-be candidates responded accordingly. In a statement released after Netanyahus victory, Gov. Scott Walker of Wisconsin congratulated the prime minister on a victory that was especially remarkable in light of the Obama administrations attempts to undermine him. Former Gov. Jeb Bush and Sen. Marco Rubio of Florida paid lip service to the two-state solution, only to argue that its pursuit should be put off. The conditions dont exist right now for that solution to truly take hold, Rubio said in an interview. Potential candidates appealing more to right-wing Jewish Republican mega donors like Sheldon Adelson or a base of conservative evangelicals, many of whom believe Israel has a biblically rooted right to the occupied territories, did not mention the two-state solution. Sen. Ted Cruz of Texas, for example, praised Netanyahu for defeating the full force of the Obama political team. And he happily exploited the bind in which Netanyahus rejection of the two-state solution and apparent race-baiting on the campaign trail had put Clinton. When it comes to Israel, the time for her to stand up is now, he said, adding that if Clinton disagreed with Obamas Iran nuclear negotiations, she needs to state so clearly and unequivocally right now.]", "Date": "20150319", "Author": "[JASON HOROWITZ]", "Link": "http://www.seattletimes.com/news/u-s-jews-rift-over-netanyahu-is-a-headache-for-clinton/", "Title": "[U. S. Jews rift over Netanyahu is a headache for Clinton]"}