{"Content": "[ President Barack Obama laid claim to a peace dividend that doesnt exist when he told the nation he wants to use money saved by ending wars to build highways, schools and bridges. The wars were largely financed by borrowing, so there is no ready pile of cash to be diverted to anything else. The claim was one of several by Obama in his acceptance speech Thursday at the Democratic National Convention in Charlotte, N.C. and by Vice President Joe Biden in earlier remarks that did not match the facts. A look at some of their assertions:, OBAMA: Ill use the money were no longer spending on war to pay down our debt and put more people back to work  rebuilding roads and bridges, schools and runways. After two wars that have cost us thousands of lives and over a trillion dollars, its time to do some nation-building right here at home. THE FACTS: The idea of taking war savings to pay for other programs is budgetary sleight of hand, given that the wars were paid for with increased debt. Obama can essentially pay down our debt, as he said, by borrowing less now that war is ending. But he still must borrow to do the extra nation-building he envisions. He made a similar statement in his State of the Union address, and it is no less misleading now than in January. And the savings appear to be based at least in part on inflated war spending estimates for future years. , OBAMA: We will reform and strengthen Medicare for the long haul, but well do it by reducing the cost of health care, not by asking seniors to pay thousands of dollars more. THE FACTS: Some of the proposals the Obama administration has floated in budget negotiations with Congress would ask Medicare beneficiaries to pay more. Among them: revamping co-payments and deductibles in ways that could raise costs for retirees and increasing premiums for certain beneficiaries. Obama even indicated a willingness to consider raising the eligibility age, currently 65, to 67. As word of some of the proposals leaked out, the president faced a backlash from fellow Democrats. He has since said he would not accept Medicare cuts as a part of a deficit reduction deal, unless it also includes higher taxes on the wealthy. Still, some level of increased costs for middle-class and upper-income Medicare recipients is likely to be part of any future deficit reduction deal. , OBAMA:  We can help big factories and small businesses double their exports, and if we choose this path, we can create a million new manufacturing jobs in the next four years. THE FACTS: Obama has claimed an increase of some 500,000 manufacturing jobs over the past 29 months. But this is cherry picking by the president. From the beginning of Obamas term 3 1/2 years ago, manufacturing jobs have declined by more than 500,000, according to the Labor Departments Bureau of Labor Statistics. Manufacturing jobs have been on a steady decline for nearly two decades. Even though there has been a modest uptick in manufacturing jobs this year, unless there is a major turnaround, it seems unlikely that Obamas goal of 1 million new manufacturing jobs can be reached by his target date of 2016. , OBAMA: And now you have a choice: We can give more tax breaks to corporations that ship jobs overseas or we can start rewarding companies that open new plants and train new workers and create new jobs here in the United States of America. BIDEN:  Gov. Romney believes that in the global economy, it doesnt much matter where American companies put their money or where they create jobs. As a matter of fact, he has a new tax proposal  the territorial tax  that experts say will create 800,000 jobs, all of them overseas. THE FACTS: Republican presidential candidate Mitt Romneys proposal is actually aimed at encouraging investment in the U.S. not overseas. The U.S. currently has a global tax system that is filled with credits, exemptions and deductions that enable many companies to avoid U.S. taxes and provides an incentive for corporations to keep their profits in other countries. Whether Romneys plan would spur investment in the U.S. is debatable, but its not a plan aimed at dispersing profits abroad. Experts differ on the impact of a territorial system on employment in the U.S. But Bidens implication that Romneys plan sends jobs abroad is not supported by the expert opinion he cites. Kimberly Clausing, an economics professor at Reed College in Portland, Ore. said a pure territorial tax system could increase employment in low-tax countries by 800,000. But that did not mean U.S. jobs moving overseas. Clausing later wrote: My analysis does not speak to the effects on jobs in the United States. , OBAMA: You can choose a future where we reduce our deficit without wrecking our middle class. Independent analysis shows that my plan would cut our deficits by $4 trillion. THE FACTS: Three years ago, Obama pledged to cut in half the deficit we inherited by the end of his first term, a mark hes set to miss by a wide margin. The deficit when he took office was $1.2 trillion, and the $800 billion stimulus bill Obama signed soon afterward increased the shortfall to over $1.4 trillion. The White House predicts this years federal budget deficit will end up at $1.2 trillion, marking the fourth consecutive year of trillion dollar-plus red ink. Obamas new $4 trillion target over 10 years resets the goalposts with some fancy budget footwork. For one thing, it includes $1 trillion in cuts already signed into law. And it assumes that Congress will pass the administrations plan to raise the capital gains tax, boost taxes on households earning over $250,000 a year and impose a minimum 30 percent tax on incomes above $1 million. It also assumes a reduction in the amount of interest the government must pay on its debt. , BIDEN: After the worst job loss since the Great Depression, weve created 4.5 million private sector jobs in the past 29 months. THE FACTS: This seems to be a favorite statistic, because many speakers at the convention cited it. But its misleading  a figure that counts jobs from when the recession reached its trough and employment began to grow again. It excludes jobs lost earlier in Obamas term, and masks the fact that joblessness overall has risen over Obamas term so far. As well, in the same 29 months that private sector jobs grew by 4.5 million, jobs in the public sector declined by about 500,000, making the net gain in that period about 4 million. Overall, some 7.5 million jobs were lost during the recession that began in December 2007 in President George W. Bushs term and ended officially in June 2009 with Obama as president. Never since World War II has the economy been so slow to recover all the jobs lost in a downturn. , OBAMA: Millions of students are paying less for college today because we finally took on a system that wasted billions of taxpayer dollars on banks and lenders. THE FACTS: Technically it is true, said Bryan Cook, director of the Center for Policy Analysis at the American Council on Education. How much of a savings is not clear. Large increases in federal Pell Grants, GI Bill benefits and the 2009 American Opportunity Tax Credit led to a significant increase in the amount of aid provided to students who qualify for these benefits. The current per year maximum Pell Grant is $5,550  $900 higher than it was in 2008 for a program that serves more than 9 million students. Under the Obama administration, Congress passed legislation requiring all federal loans be issued through the Education Department; previously, they were also issued by private lenders. This will also probably mean students pay less in the long term. , OBAMA: In 2014, our longest war will be over. THE FACTS: Although most U.S. troops will leave Afghanistan by the end of 2014, thousands are likely to stay and continue a U.S. presence for years. There is no telling what fighting they might be drawn into, despite the decision to end the U.S. combat role. Military leaders and administration officials have not yet said how many will stay, asserting that such decisions are far from being made. But analysts say the U.S. envisions a post-2014 force of as many as 20,000 American troops to continue training the Afghan forces, hunt terrorists and keep watch on Iran and other nations in the region. , BIDEN: What they didnt tell you is that the plan theyve put down on paper would immediately cut benefits to more than 30 million seniors already on Medicare. What they didnt tell you is the plan theyre proposing would cause Medicare to go bankrupt by 2016. THE FACTS: Biden wasnt referring to any Medicare plan of Romney or running mate Paul Ryan, but to the consequences of fully repealing Obamas health care law, which is unpopular with seniors even though it has sweetened Medicare in certain ways. A Medicare plan put forward by Ryan in Congress would have no immediate effect because it would apply only to future retirees. Obamas health care law improved Medicare benefits, adding better coverage for beneficiaries with high prescription costs as well as removing co-pays for a set of preventive benefits. If the law is repealed, those benefits would be lost unless Congress decides otherwise. Similarly, Romneys promise to restore Obamas $716 billion in Medicare cuts could have unintended consequences for the program. The cuts dont affect seniors directly, instead falling on hospitals, insurers and other service providers. Restoring the higher payments to providers would accelerate the depletion of Medicares trust fund for inpatient care, from 2024 currently to 2016, unless Congress acts to stave that off. , Associated Press writers Ricardo Alonso-Zaldivar, Stephen Ohlemacher, Christine Armario and Paul Wiseman contributed to this report.]", "Date": "20120910", "Author": "[CALVIN WOODWARD, TOM RAUM]", "Link": "http://www.seattletimes.com/nation-world/fact-check-obama-and-the-phantom-peace-dividend/", "Title": "[Fact check: Obama and the phantom peace dividend]"}