{"Content": "[ Minnesota Rep. Michele Bachmann announced Wednesday that her fourth term in Congress will be her last, choosing to leave on her own terms after a dismal 18 months in which her presidential bid collapsed and she barely managed to retain her House seat. Bachmann, a leading figure in the tea party movement, discussed the decision in a Web video sent to supporters by email. She said her departure was unrelated to ethics inquiries stemming from the failed presidential run and was not influenced by any concerns about my being re-elected. After eight years in Washington, Bachmann left the door open to other political options, though she didnt say what those might be. She was traveling in Russia as part of a congressional delegation and was not available for interviews. It was a sudden turn for Bachmann, the foster-parent-turned-conservative politician whose climb to prominence roughly coincided with the rise of the tea party. She swiftly became a face of the movement and helped found the tea party caucus in the House. But she was also at risk of being left behind as the movement matured. Her departure is part of a larger shift in tea party personalities such as former Alaska Gov. Sarah Palin, former Rep. Allen West of Florida and former South Carolina Sen. Jim DeMint, who have moved over into conservative organizations and commentary roles. Theyve slowly been replaced by a new round of tea party-backed lawmakers such as Sens. Ted Cruz of Texas and Mike Lee of Utah and Rep. Raul Labrador of Idaho. The movement had moved past her to a new round of leaders in Congress and the states around the country, said Dick Wadhams, a Colorado-based Republican strategist. In a short period of time, a new generation has stepped forward since the last election. Ron Carey, a former chief of staff to Bachmann, said he suspects she was anticipating a tough battle ahead and seemed to be stuck in place in Congress. This is a great chance to exit stage right rather than have a knockdown, drag-out re-election fight, said Carey, also an former state GOP chairman. The reality also set in that she is not a favorite of Republican leadership, so she is not going to be rising up to a committee chair or rising up in leadership. In the nine-minute video, Bachmann said her decision was not impacted in any way by the inquiries into her presidential campaign last year. In January, a former Bachmann aide filed a complaint with the Federal Election Commission, claiming Bachmann made improper payments to an Iowa state senator who was the state chairman of her 2012 presidential run. The aide, Peter Waldron, also accused Bachmann of other FEC violations. Bachmann appeared to be gearing up for a rematch of last falls race against Jim Graves, a hotelier and upstart Democrat who nearly beat her in his first political race. She was raising money as hard as ever and had already launched an ad on Twin Cities television touting her role in opposing President Barack Obamas health care overhaul. Without the polarizing Bachmann on the ticket, Republicans could have an easier time holding a district that leans more heavily in the GOP direction than any other in Minnesota. A parade of hopefuls was expected. Graves said he would press ahead. This is an important moment, but our work is not done, Graves said in a fundraising solicitation. Surely, Representative Bachmanns allies  and their resources  arent going anywhere. Their goal remains the same. Andy Aplikowski, a Republican activist in the district, said he understood her decision. Its a grueling thing to be Michele Bachmann in Congress, he said. Every move you make is criticized and put under a microscope. Bachmanns strongly conservative views propelled her into politics, and once there, she never backed down. She was a suburban mother of five in 1999 when she ran for a Minnesota school board seat because she thought state standards were designed to teach students values and beliefs. She lost that race, but won a state Senate seat a year later. Once in St. Paul, she seized on gay marriage as an issue and led a charge to legally define marriage in Minnesota as between one man and one woman. That failed, but Bachmann had laid the foundation with social conservatives to help send her into Congress in 2006. In Washington, she turned to fiscal issues, attacking Democrats and Obama for government bailouts and health care. Even in her early years in Congress, Bachmann frequently took those views to right-leaning cable talk programs, cultivating her national image and building a formidable fundraising base with like-minded viewers outside Minnesota. But her penchant for provocative rhetoric sometimes backfired. She was hammered in 2008 for saying Obama might have anti-American views, a statement that prompted a rare retreat by Bachmann and made her race that year closer than it would have been. She was also criticized by fellow Republicans last July for making unsubstantiated allegations that an aide to Secretary of State Hillary Rodham Clinton had family ties to Egypts Muslim Brotherhood. Her White House bid got off to a promising start, with a win in an Iowa GOP test vote. But Bachmann quickly faded and finished last when the real voting started in Iowas leadoff caucuses, a result that caused her to drop out. Saddled with debt, Bachmann opted to campaign again for her Minnesota seat and squeaked through. But the presidential campaign continued to dog her. Allegations of improper payments prompted ethics inquiries. Bachmann also faced a lawsuit from a former aide who alleged someone on the congresswomans team stole a private email list of home-school supporters for use in the campaign. That case is pending. Bachmanns success in the talk media world has led industry analysts in the past to say she could easily move into a gig as a host. But Amy Kremer, chairman of the Tea Party Express, suggested the congresswoman could seek elected office in the future, perhaps a challenge to Democratic Sen. Al Franken of Minnesota next year or another White House campaign in 2016. I dont think weve seen the last of Congresswoman Bachmann, Kremer said. What she stands for and what the tea party movement stands for  thats not something that just goes away. Pat Klaras, a Republican from suburban Lino Lakes who said she had voted for Bachmann in all her past races, said she was disappointed by Bachmanns decision. She represents my same views, how I feel, how I think, Klaras said. I dont think we have much of that right now. , Thomas reported from Washington. Associated Press Writer Lou Kesten contributed.]", "Date": "20130529", "Author": "[KEN THOMAS, BRIAN BAKST]", "Link": "http://www.seattletimes.com/seattle-news/politics/michele-bachmann-to-leave-house-after-fourth-term/", "Title": "[Michele Bachmann to leave House after fourth term]"}