{"Content": "[ OLYMPIA  As state Sen. Andy Hill stuck to his message over months of budget negotiations  new taxes only as a last resort  he watched the Democrats revenue proposals melt away. First went Gov. Jay Inslees proposed carbon-emissions tax, never adopted in a legislative budget proposal. House Democratic proposals for a business-and-occupation tax hike and a new capital-gains tax also evaporated. In the end, even several tax exemptions closed in the new $38.2 billion state operating budget  a compromise made with Democrats to raise some revenue  were chosen by Republicans. A 53-year-old, soccer-loving Harvard MBA and former Microsoft group manager from Redmond, Hill played the public face of the GOP message during the grueling, extended legislative season that ended Friday. Reality was simple, argued the chief Republican budget writer: New revenue from existing taxes should be enough to cover the cost of government. He repeated it over and over, in news conferences and interviews, like a looped recording. Whether it was political acumen or just the luck of pushing the same hold-the-line message as revenue reports brought the money in  Hill and his Republican colleagues emerged crowing about a budget that cut college tuition, put more money toward education and raised little new revenue. We think that when we started in January, we had a set of priorities, Hill said the day the budget compromise was released. And we believe we delivered on all of them. Now Hill, first elected in 2010, is getting what comes with a successful GOP run in Olympia: chatter that he could be the partys best hope for challenging Inslee in 2016, and Democratic criticism that Republicans remain too conservative for many. Back in January, the budget that came to be didnt necessarily seem plausible. Lawmakers began work under an unprecedented series of obligations. They were being held in contempt for not doing enough to fully plan to fund K-12 education under the state Supreme Courts McCleary decision. Other court orders were forcing legislators to better fund mental-health and foster-care programs. Legislators also wanted to give government workers and school employees their first cost-of-living raises in years. There were questions over how to repair the social-safety net and make college more affordable  two areas that had taken a hit during the Great Recession. During the prolonged stalemate over the budget, the ground shifted. Two economic forecasts and newfound federal money brought projections of more than $750 million through 2017. Buoyed by timing and luck, the GOP stood vindicated. That windfall helped build a budget that some are calling historic for its investments in early learning and K-12 education funding, and mental-health and social-service improvements. The budget, signed by Inslee shortly before midnight on June 30, included the cost-of-living pay raises and also boosted funding for state parks. It also bought a unique policy, sought by Republicans  a tuition cut for state colleges and universities. While that proposal had been pushed earlier by others in the GOP, Senate Majority Leader Mark Schoesler, R-Ritzville, said Hill helped make it possible. When Andy Hill showed us the savings and resources we could use to write a budget with, said Schoesler, he showed us we could afford a tuition cut. The narrative about this years session, however, is more complex than the headlines. Democrats panned Hills budget proposals as full of gimmicks that moved money between accounts and underfunded services such as mental-health programs and the states health-care insurance exchange. The budget that eventually got written could not have been done without $500 million to $700 million worth of positive economic news, said Rep. Ross Hunter of Medina, the chief Democratic budget writer. Democrats said they had to fight up until the end of negotiations to make sure the GOPs tuition cut was properly funded, as were needed mental-health improvements, according to Hunter. But former state Republican party chairman Chris Vance praised Hill and Senate Republicans for fighting to cut tuition at state universities  a move he said reversed years of declining state support under Democratic administrations while also appealing to middle-class voters needed by the GOP to win statewide. It is in some ways one of the quintessential cul-de-sac suburban issues, Vance said. Republicans have to do better in the suburbs to make up for what they lose in Seattle. Could Hill succeed where moderate Republican gubernatorial hopefuls like Rob McKenna and Dino Rossi fell short?, Hill hasnt signaled what hell do. Im still getting over the budget hangover, he said. Sitting outside a Bellevue Starbucks one afternoon, Hill heaps praise on Schoesler and Sen. John Braun, R-Centralia, for their roles in budget talks. And he coolly assesses the Democrats political situation during the session. I think this was one of the problems the Democrats had, is that the expectations were so high, Hill said. That we would get all these taxes and we would do all this spending, I just think they were unrealistic in any scenario. But again, we werent fighting over making draconian cuts, he added. We were fighting over how much to expand government and where to spend extra money. Hills job of selling the Republican argument started even before the session. He served as point man to push back against the budget customarily proposed by the governor in December. Tax increases should be the last resort, not the first response, Hill said in a statement responding to Inslees proposal to raise $1.4 billion in new revenue. Once the session began in January, Hill explained to the public every new GOP proposal and hit back against every Democratic plan. And in April, as the regular 105-day session drew to a close, Hill called on House Democrats to take floor votes on the $1.5 billion in taxes they sought. If Democrats couldnt muster that support, budget negotiators would just be talking about phantom money, Hill said at the time, adding: Its all about setting the bargaining points. The move delayed budget talks and resulted in a special session in May that essentially became a 30-day stalemate. Democrats never took votes on the House floor for proposed hikes in parts of the business-and-occupation tax and new capital-gains tax. Even as Republicans insisted that any government shutdown  which would happen if the state didnt have a new budget by July 1  should be considered the fault of Democrats, they werent shy about going right up to the line. The constituents I talk to, theyd much rather us hold the line on $1.5 billion in new taxes and bear the expense of a few extra days in special session, Braun said in a news conference in late May. Hill added, around that time, We want to make sure we get things done right. Democrats and Republicans finally reached a deal with only days to spare. Inslee signed the new budget at about 11:40 p.m. June 30  20 minutes before a shutdown would have occurred. Hill ascended to the powerful position of Senate Ways and Means chairman in 2013 because of his educational background  and because more experienced Republicans were busy with other roles, according to Schoesler. Hes an amazingly fast study, said Schoesler. Budget writers can live or die by a lot of small decisions, and youve got a ton of those to go through. Former Senate Majority Leader Rodney Tom describes Hill as quiet smart. Hes pretty practical and hes solutions-driven, said Tom, who in 2012 was one of two Democrats who crossed the aisle to work with Republicans. People may not know that a budget writer isnt just some guy in a room whos doing what he wants, said Tom. Hill has to negotiate with Democrats while simultaneously keeping his fellow members and Schoesler comfortable with changes in policy. Andy has to keep Mark happy, and Mark has to keep the caucus happy, said Tom. For a party that spans from the rock-ribbed conservative eastern half of the state to a more moderate segment west of the Cascades, Republicans arent always in agreement. Hill has to work with more conservative senators, like a trio who after one revenue forecast proposed using some of the extra money to cut business taxes rather than firm up the budget. Andy has a lot of members where, even if it makes sense, they dont want to spend the money, said Tom. Theres a contingent of the Republican Party thats Jeffersonian, they really want smaller government. As Hill gets mentioned as a possible Inslee challenger next year, so do state Sen. Steve Litzow, R-Mercer Island, who chairs the Senate Education Committee, and U.S. Rep. Dave Reichert, R-Auburn. Port of Seattle Commissioner Bill Bryant has a head start  he declared his candidacy in May. Whether or not Hill runs, Vance called his record as budget writer the kind of model that can win in Washington state. But Democratic political consultant Christian Sinderman hits back against Hills image as a suburban moderate, calling him an ideological conservative cloaked in suburban soccer-dad apparel. Environmentalists accuse Hill and the Senate Republican majority of siding with fossil-fuel interests and opposing legislation aimed at fighting climate change, including Inslees proposed cap-and-trade plan to limit carbon emissions through charges on big polluters. The Senate also refused to close a tax loophole benefiting oil refineries. There was a chance for real bipartisan progress this session. He chose to serve the interests of Big Oil, rather than the interests of Washingtonians, said Shannon Murphy, president of Washington Conservation Voters, which spent big to try to defeat Hills re-election bid. Hill has been among the biggest recipients of oil- and gas-industry campaign contributions among Washington legislators since 2012, according to the National Institute on Money in State Politics. California billionaire and Inslee ally Tom Steyer unsuccessfully took aim at Hill as one of a handful of Republican senators to unseat in order to bring about a Legislature more friendly to climate change. Hill, who drives a BMW electric car, said the Legislature didnt act on climate change this year because lawmakers had too much else to do. In conversation, Hill is reluctant to take shots at Inslee. But, I do think we need new leadership, he said. To win a statewide election, Hill repeats the wisdom that a Republican candidate needs to draw enough votes in suburban King County to offset the large urban blocks that vote Democratic. Just like his constituents in Duvall, Woodinville, and parts of Kirkland and Redmond. Generally, the suburban voters  their view is Educate my kids, be smart with my money and leave everybody else alone,  he said. In a lot of ways it is a socially moderate and a fiscally conservative viewpoint. And I kind of fit that, Hill adds later. That fits my district well.]", "Date": "20150711", "Author": "[Joseph OSullivan]", "Link": "http://www.seattletimes.com/seattle-news/politics/sen-andy-hill-a-star-emerges-in-session-dominated-by-gop/", "Title": "[Sen. Andy Hill: A star emerges in session dominated by GOP]"}