{"Content": "[ President Barack Obama is crossing his fingers that Republicans wont come close to capturing the six Senate seats they need to seize the majority in next weeks election. But for Vice President Joe Biden, theres a silver lining if Republicans fall just short. A GOP gain of five seats would effectively split the 100-member Senate between the two parties, instantly elevating the vice presidents role as the 101st senator. That would raise Bidens own profile heading into 2016, when the former Delaware senator has said he may run for president again. It makes Joe Biden suddenly a hugely relevant Washington figure, said Douglas Brinkley, a presidential historian at Rice University. It shows hes a power player. On the other hand, it could make Biden the face of messy political fights on Capitol Hill, potentially alienating some voters along the way. Biden spent nearly four decades steeped in the chambers tradition and camaraderie, and a high-profile return would allow him to show former colleagues hes still in the game. Some questions and answers about what happens if the Senate splits in November:, HAS IT EVER HAPPENED BEFORE?, Yes, but only a handful of times. The first was under President James Garfield in 1881, when a special session expected to last just 11 days stretched into 11 weeks as the Senate deadlocked, according to the Senate Historical Office. A split Senate didnt occur again until 1953, when Republican Majority Leader Robert Taft died and was replaced by a Democrat, leaving Vice President Richard Nixon as the would-be tiebreaker until other deaths gave Democrats the majority. The Senate was split 50-50 following the 2000 elections, giving Democrats majority control for 17 days beginning Jan. 3, 2001, because Al Gore was still vice president. Republicans gained power Jan. 20 when Dick Cheney was sworn in as George W. Bushs vice president. As president of the Senate, the vice president gets to cast the tie-breaking vote regardless of which party controls the Senate. But 50-50 ties are much more likely when the Senates membership is evenly split. There have been nearly 250 tie-breaking votes cast by vice presidents in U.S. history, but none by Biden. The most recent came in 2008, when Cheney cast the 51st vote for a budget amendment on the alternative minimum tax. ", "Date": "20141029", "Author": "[JOSH LEDERMAN]", "Link": "http://www.seattletimes.com/nation-world/for-biden-silver-lining-if-senate-fight-is-a-draw/", "Title": "[For Biden, silver lining if Senate fight is a draw]"}