{"Content": "[ BOISE  Same-sex marriage is now legal in all 50 states, but nestled in the Idaho Constitution remains a provision that defines marriage as only between a man and a woman. The Supreme Court struck down all gay-marriage bans nationwide last week, making Idahos constitutional marriage definition unenforceable. However, removing the language will likely be an uphill battle. Amending the Idaho Constitution first requires approval from the Republican-dominated Legislature. The proposal must then win a simple majority in a voter referendum  a tough task for even lesser politically charged initiatives. Idaho is one of 30 states that amended their constitutions to ban gay marriage that have not yet take steps to repeal their amendments, even though they have been rendered unenforceable by the Supreme Courts gay-marriage decision. It might be difficult to remove the language, but its the right thing to do, said Leo Morales, acting executive director of the American Civil Liberties Union of Idaho. Lawmakers have sworn an oath to uphold the law. It makes sense to clean up the books. Idahos ban has been enshrined in the state constitution since 2006 after winning 63 percent of the vote. Gay-rights supporters argue removal is the natural next step to comply with the Supreme Courts ruling. But Republican lawmakers and gay-marriage opponents counter that there is no legal need to change the constitution. Idaho should not remove that language, said Julie Lynde, executive director of Cornerstone Family Council. There is no reason to obliterate traditional marriage. Its a symbolic and historic piece of language. Furthermore, when Idaho lawmakers gather in Boise at the beginning of 2016, theyll be kicking off the legislative session in an election year. Republican lawmakers will be less likely to cast a vote that could be used against them by an opponent. My opinion is that no legislative action is required, said Senate Majority Leader Bart Davis of Idaho Falls. Whether the Legislature chooses to do something or not, thats still up in the air. But right now, (the ban) is unenforceable as required by law. The Idaho Constitution is subject to the Supreme Court, meaning the state must defer to the courts decision even if its own laws differ. But having conflicting state and federal laws can cause confusion, Morales said. For example, in 2013, a sheriff in Kootenai County declared that the Boy Scouts of America promoted a lifestyle that violated the states sodomy law. Morales said the sheriff incorrectly interpreted an unenforceable state law because it was still on the books, even though the Supreme Court banned laws that attempted to regulate or criminalize sexual activity among consenting adults in 2003. Idahos history of removing obsolete provisions from its constitution began with the original document in 1890. At the time, Idaho disenfranchised anyone who practiced polygamy, encouraged polygamy or supported organizations encouraging polygamy as a way to strip Mormons of their right to vote, holding office or serving on juries. The Church of Jesus Christ of Latter-day Saints disavowed the practice of plural marriage that same year. Today, the Legislature is prominently led by Mormons in both chambers, but the state didnt remove the anti-Mormon language until 1982. More than 100,000 people  a third of voters  voted to keep the ban.]", "Date": "20150705", "Author": "[KIMBERLEE KRUESI]", "Link": "http://www.seattletimes.com/seattle-news/idaho-constitution-still-has-gay-marriage-ban/", "Title": "[Idaho constitution still has gay-marriage ban]"}