{"Content": "[ Americas blacks voted at a higher rate than other minority groups in 2012 and by most measures surpassed the white turnout for the first time, reflecting a deeply polarized presidential election in which blacks strongly supported Barack Obama while many whites stayed home. Had people voted last November at the same rates they did in 2004, when black turnout was below its current historic levels, Republican Mitt Romney would have won narrowly, according to an analysis conducted for The Associated Press. Census data and exit polling show that whites and blacks will remain the two largest racial groups of eligible voters for the next decade. Last years heavy black turnout came despite concerns about the effect of new voter-identification laws on minority voting, outweighed by the desire to re-elect the first black president. William H. Frey, a demographer at the Brookings Institution, analyzed the 2012 elections for the AP using census data on eligible voters and turnout, along with Novembers exit polling. He estimated total votes for Obama and Romney under a scenario where 2012 turnout rates for all racial groups matched those in 2004. Overall, 2012 voter turnout was roughly 58 percent, down from 62 percent in 2008 and 60 percent in 2004. The analysis also used population projections to estimate the shares of eligible voters by race group through 2030. The numbers are supplemented with material from the Pew Research Center and George Mason University associate professor Michael McDonald, a leader in the field of voter turnout who separately reviewed aggregate turnout levels across states, as well as AP interviews with the Census Bureau and other experts. The bureau is scheduled to release data on voter turnout in May. Overall, the findings represent a tipping point for blacks, who for much of Americas history were disenfranchised and then effectively barred from voting until passage of the Voting Rights Act in 1965. But the numbers also offer a cautionary note to both Democrats and Republicans after Obama won in November with a historically low percentage of white supporters. While Latinos are now the biggest driver of U.S. population growth, they still trail whites and blacks in turnout and electoral share, because many of the Hispanics in the country are children or noncitizens. In recent weeks, Republican leaders have urged a year-round effort to engage black and other minority voters, describing a grim future if their party does not expand its core support beyond white males. The 2012 data suggest Romney was a particularly weak GOP candidate, unable to motivate white voters let alone attract significant black or Latino support. Obamas personal appeal and the slowly improving economy helped overcome doubts and spur record levels of minority voters in a way that may not be easily replicated for Democrats soon. Romney would have erased Obamas nearly 5 million-vote victory margin and narrowly won the popular vote if voters had turned out as they did in 2004, according to Freys analysis. Then, white turnout was slightly higher and black voting lower. More significantly, the battleground states of Ohio, Pennsylvania, Virginia, Florida and Colorado would have tipped in favor of Romney, handing him the presidency if the outcome of other states remained the same. The 2012 turnout is a milestone for blacks and a huge potential turning point, said Andra Gillespie, a political science professor at Emory University who has written extensively on black politicians. What it suggests is that there is an `Obama effect where people were motivated to support Barack Obama. But it also means that black turnout may not always be higher, if future races arent as salient. Whit Ayres, a GOP consultant who is advising GOP Sen. Marco Rubio of Florida, a possible 2016 presidential contender, says the last election reaffirmed that the Republican Party needs a new message, a new messenger and a new tone. Change within the party need not be lock, stock and barrel, Ayres said, but policy shifts such as GOP support for broad immigration legislation will be important to woo minority voters over the longer term. It remains to be seen how successful Democrats are if you dont have Barack Obama at the top of the ticket, he said. , In Ohio, a battleground state where the share of eligible black voters is more than triple that of other minorities, 27-year-old Lauren Howie of Cleveland didnt start out thrilled with Obama in 2012. She felt he didnt deliver on promises to help students reduce college debt, promote womens rights and address climate change, she said. But she became determined to support Obama as she compared him with Romney. I got the feeling Mitt Romney couldnt care less about me and my fellow African-Americans, said Howie, an administrative assistant at Case Western Reserve Universitys medical school who is paying off college debt. Howie said she saw some Romney comments as insensitive to the needs of the poor. A white Mormon swimming in money with offshore accounts buying up companies and laying off their employees just doesnt quite fit my idea of a president, she said. Bottom line, Romney was not someone I was willing to trust with my future. The numbers show how population growth will translate into changes in who votes over the coming decade:, -The gap between non-Hispanic white and non-Hispanic black turnout in 2008 was the smallest on record, with voter turnout at 66.1 percent and 65.2 percent, respectively; turnout for Latinos and non-Hispanic Asians trailed at 50 percent and 47 percent. Rough calculations suggest that in 2012, 2 million to 5 million fewer whites voted compared with 2008, even though the pool of eligible white voters had increased. -Unlike other minority groups, the rise in voting for the slow-growing black population is due to higher turnout. While blacks make up 12 percent of the share of eligible voters, they represented 13 percent of total 2012 votes cast, according to exit polling. That was a repeat of 2008, when blacks outperformed their eligible voter share for the first time on record. -White voters also outperformed their eligible vote share, but not at the levels seen in years past. In 2012, whites represented 72 percent of total votes cast, compared to their 71.1 percent eligible vote share. As recently as 2004, whites typically outperformed their eligible vote share by at least 2 percentage points. McDonald notes that in 2012, states with significant black populations did not experience as much of a turnout decline as other states. That would indicate a lower turnout for whites last November since overall voter turnout declined. -Latinos now make up 17 percent of the population but 11 percent of eligible voters, due to a younger median age and lower rates of citizenship and voter registration. Because of lower turnout, they represented just 10 percent of total 2012 votes cast. Despite their fast growth, Latinos arent projected to surpass the share of eligible black voters until 2024, when each group will be roughly 13 percent. By then, 1 in 3 eligible voters will be nonwhite. -In 2026, the total Latino share of voters could jump to as high as 16 percent, if nearly 11 million immigrants here illegally become eligible for U.S. citizenship. Under a proposed bill in the Senate, those immigrants would have a 13-year path to citizenship. The share of eligible white voters could shrink to less than 64 percent in that scenario. An estimated 80 percent of immigrants here illegally, or 8.8 million, are Latino, although not all will meet the additional requirements to become citizens. The 2008 election was the first year when the minority vote was important to electing a U.S. president. By 2024, their vote will be essential to victory, Frey said. Democrats will be looking at a landslide going into 2028 if the new Hispanic voters continue to favor Democrats. , Even with demographics seeming to favor Democrats in the long term, its unclear whether Obamas coalition will hold if blacks or younger voters become less motivated to vote or decide to switch parties. Minority turnout tends to drop in midterm congressional elections, contributing to larger GOP victories as happened in 2010, when House control flipped to Republicans. The economy and policy matter. Exit polling shows that even with Obamas re-election, voter support for a government that does more to solve problems declined from 51 percent in 2008 to 43 percent last year, bolstering the view among Republicans that their core principles of reducing government are sound. The partys Growth and Opportunity Project report released last month by national leaders suggests that Latinos and Asians could become more receptive to GOP policies once comprehensive immigration legislation is passed. Whether the economy continues its slow recovery also will shape voter opinion, including among blacks, who have the highest rate of unemployment. Since the election, optimism among nonwhites about the direction of the country and the economy has waned, although support for Obama has held steady. In an October AP-GfK poll, 63 percent of nonwhites said the nation was heading in the right direction; thats dropped to 52 percent in a new AP-GfK poll. Among non-Hispanic whites, however, the numbers are about the same as in October, at 28 percent. Democrats in Congress merit far lower approval ratings among nonwhites than does the president, with 49 percent approving of congressional Democrats and 74 percent approving of Obama. William Galston, a former policy adviser to President Bill Clinton, says that in previous elections where an enduring majority of voters came to support one party, the president winning re-election  William McKinley in 1900, Franklin D. Roosevelt in 1936 and Ronald Reagan in 1984  attracted a larger turnout over his original election and also received a higher vote total and a higher share of the popular vote. None of those occurred for Obama in 2012. Only once in the last 60 years has a political party been successful in holding the presidency more than eight years  Republicans from 1980-1992. This doesnt prove that Obamas presidency wont turn out to be the harbinger of a new political order, Galston says. But it does warrant some analytical caution. Early polling suggests that Democrat Hillary Rodham Clinton could come close in 2016 to generating the level of support among nonwhites as Obama did in November, when he won 80 percent of their vote. In a Fox News poll in February, 75 percent of nonwhites said they thought Clinton would make a good president, outpacing the 58 percent who said that about Vice President Joe Biden. Benjamin Todd Jealous, president of the NAACP, predicts closely fought elections in the near term and worries that GOP-controlled state legislatures will step up efforts to pass voter ID and other restrictions to deter blacks and other minorities from voting. In 2012, courts blocked or delayed several of those voter ID laws and African-Americans were able to turn out in large numbers only after a very determined get-out-the-vote effort by the Obama campaign and black groups, he said. Jealous says the 2014 midterm election will be the real bellwether for black turnout. Black turnout set records this year despite record attempts to suppress the black vote, he said. , AP Director of Polling Jennifer Agiesta and News Survey Specialist Dennis Junius contributed to this report.]", "Date": "20130428", "Author": "[HOPE YEN]", "Link": "http://www.seattletimes.com/seattle-news/politics/in-a-first-black-voter-turnout-rate-passes-whites/", "Title": "[In a first, black voter turnout rate passes whites]"}