{"Content": "[ New Jersey Gov. Chris Christie plans to spend the next year leading efforts to rebuild his home state after Superstorm Sandy  and running for re-election. Christie announced his intention to seek a second term Monday, after telling his campaign treasurer to file papers so he can begin hiring campaign staff, selecting a headquarters and raising money toward his re-election. A formal announcement is expected in January. It would be wrong for me to leave now. I dont want to leave now, Christie, 50, said Monday. We have a job to do. That job wont be finished by next year. The public needs to know that Im in this for the long haul, that the person who has helped to lead them through the initial crisis wants to help lead them through the rebuilding and restoration of our state, he said at a news briefing at a fire house in Middletown, where he had come to thank first responders and volunteers. The gubernatorial election is a year from now. The governor said he talked it over with his wife and four children, ages 9 to 19, over the weekend, and the decision that he should run was unanimous. So far, no one has stepped forward to challenge him as governor. Several Democrats, most prominently Newark Mayor Cory Booker, have been thinking aloud about running for their partys nomination. Christie said he hadnt spoken with Booker other than by text in about 10 days and he didnt know the mayors political intentions. One recent public opinion poll ranked Booker as the Democrat who could come closest to beating the Republican governor. But a new poll released Tuesday shows six out of 10 registered voters now support a second term for Christie, up 15 points since September. The Rutgers-Eagleton poll also found the number of voters opposed to Christies re-election declined from nearly half in September to about a third now. Christie wins every hypothetical head-to-head matchup measured in the poll, including against Booker, who the poll has losing 34-53 percent with 13 percent choosing neither. Christie carried the Democratic-leaning state by 86,000 votes in 2009, an upset win over Democratic incumbent Jon Corzine. Christie, who has become a national figure during his first term, is riding an unprecedented wave of popularity because of how he handled the storm, which he said Friday had caused more than $29 billion in damage in New Jersey. Even Democrats have applauded his hands-on response. He appeared on Saturday Night Live in his trademark fleece pullover this month to lampoon his own nationally televised storm briefings. About the only criticism directed his way since Superstorm Sandy attacked the coast in late October has come from fellow Republicans who have lambasted him for embracing President Barack Obama as the two toured New Jerseys ravaged coastline six days before the presidential election. Some even blame Christie for tipping a close election to the president. Christie was the first governor to endorse Mitt Romney; he raised $18.2 million for the GOP nominee and crisscrossed the country as an in-demand surrogate for Republican candidates. Some are still questioning his party loyalty, however, as they did after Christie delivered the keynote address at the partys nominating convention in Tampa. Critics saw that August speech as too much about Christie and not enough about Romney. The prospect of Christie seeking a second term became likely after he spurned overtures by Republican bigwigs to enter the 2012 presidential contest and more so when he later ruled himself out as vice presidential material with a resounding I love the job I have now. Buzz over a Christie 2016 run has become muted since the governor boarded Marine One with Obama. Christies reputation for bluntness and penchant for confrontation have made him a YouTube sensation and sometimes obscured policy changes he has championed. With the help of Democrats who control both houses of the state Legislature, Christie took on public worker unions, enacting sweeping pension and health benefits changes that cost workers more and are designed to shore up the underfunded public worker retirement and health care systems long term. He also enacted a 2 percent property tax cap with few loopholes to try to slow the annual growth rate of property taxes, already the highest in the nation at an average of $7,519 when adjusted for rebates. Christies education reforms have been slower to accomplish, and Democrats have refused to budge on his signature issue for this year, a phased-in 10 percent tax cut. With tax collections underperforming the administrations projections and storm rebuilding threatening to eat further into revenues, Democrats are unlikely to waver on their position that the state cant afford the cut. Christies handling of the states struggling economy, a potential Achilles heel, has taken a back seat to the storm recovery. But unemployment remains a stubborn 9.7 percent, or 1.6 percent above the national jobless rate, and its too early to tell whether tax collections will rebound to match administration projections for the fiscal year that began in July.]", "Date": "20121127", "Author": "[Angela Delli Santi]", "Link": "http://www.seattletimes.com/seattle-news/politics/nj-gov-christies-focus-rebuilding-re-election/", "Title": "[NJ Gov. Christies focus: Rebuilding, re-election]"}