{"Content": "[ NEW YORK (AP)  Caving to intense Republican lobbying, presidential candidate Donald Trump ruled out the prospect of a third-party White House bid on Thursday and vowed to support whoever wins the partys nomination  a U-turn made easier by his position at the front of the field. The decision follows weeks of behind-the-scenes efforts by GOP leaders, whove been trying to avert the possibility of an independent campaign by Trump ever since last months opening debate, when he refused to promise to back the partys eventual nominee. A third-party bid by Trump, or any prominent conservative, could doom Republican efforts in 2016. I will be totally pledging my allegiance to the Republican Party and the conservative principles for which it stands, Trump said in a news conference at Trump Tower, the gold-hued skyscraper in midtown Manhattan where he launched his surging campaign for president. The 69-year-old billionaire, who announced his decision after meeting with Republican National Committee Chairman Reince Priebus, insisted he got absolutely nothing for pledging his loyalty other than the assurance that Ill be treated fairly. In a statement Thursday night, Priebus didnt mention Trump by name but declared his pride in having all major GOP candidates pledging to support the eventual nominee and then took a swipe at the Democratic front-runner. We have the largest, most diverse field in the history of either party, he said. Any candidate would be a better president than Hillary Clinton and offer the new direction Americans want. To the dismay of GOP leaders, Trump has emerged as the overwhelming leader in a crowded field, despite repeatedly insulting key constituencies and offering few details about his policies. The reality television star has described Mexican immigrants as rapists, questioned Sen. John McCains war hero status and insulted a popular Fox News host. His refusal during the partys first debate to pledge his support for the primary campaign winner further roiled the GOP. The document Trump signed Thursday is a pledge, not a contract. Even if it were legally binding, Trumps history in contract law is suspect. When lender Boston Safe Deposit & Trust refused to extend the mortgage on his Palm Beach resort, Mar-a-Lago, he ceased making loan payments until the bank capitulated in 1992. In his book, The Art of the Comeback, Trump proudly recounts forcing his unpaid lenders to choose between fighting him in bankruptcy court or cutting him an additional $65 million check. Afraid of losing their jobs, the bankers folded, Trump says. On Thursday, Trump insisted he would make good on his commitment to Republicans. I see no circumstances under which I would tear up that pledge, he said. If not for Trump, the need for a loyalty oath probably wouldnt exist. There were no doubts about the intentions of the GOPs other major presidential contenders headed into last months debate, and they quickly lined up Thursday to sign the document issued a day earlier by the Republican National Committee. Doug Watts, a spokesman for retired surgeon Ben Carson, another GOP candidate, said the committee felt it had to box Trump into a decision. We just sort of shrugged our shoulders, and thats the end of that, Watts said. Despite Trumps reversal, he succeeded yet again on Thursday in what he has done consistently throughout the race: make the story about him. Even tea party leaders, whove been skeptical of the one-time Democrat, commended him on his political skill. Trump has once again outmaneuvered the GOP, his fellow candidates and the media, said Mark Meckler, a co-founder of the tea party movement. The news is all Donald, all the time. The document signed by Trump asked candidates to promise to endorse the 2016 Republican presidential nominee regardless of who it is. Further, it demanded that each pledge that I will not seek to run as an independent or write-in candidate, nor will I seek or accept the nomination for president of any other party. Kentucky Sen. Rand Paul, who angrily challenged Trump at the debate over the pledge, took credit for what he termed Trumps capitulation. I spent the last few weeks making sure people knew it was not acceptable to potentially throw the next election to Hillary, Paul wrote on Twitter, referring to Democratic front-runner Hillary Rodham Clinton. ", "Date": "20150903", "Author": "[STEVE PEOPLES]", "Link": "http://www.seattletimes.com/nation-world/targeting-trump-gop-seeks-loyalty-pledge-from-2016-hopefuls/", "Title": "[Trump vows no third-party bid, will back GOP primary winner]"}