{"Content": "[ Some voters may have forgotten, but theres a primary election happening Tuesday with a number of races hotter than the record temperatures baking the Puget Sound region. All nine Seattle City Council seats are up for grabs in the Emerald Citys first year of voting by geographic district, and nearly 50 candidates are seeking one of those jobs. Two of five Port of Seattle Commission positions have drawn 12 candidates, with nine of them competing for the spot to be vacated by Bill Bryant, whos leaving to run for governor in 2016. Two Seattle School Board races will see candidates eliminated as a result of the primary election, and across Lake Washington, six candidates are vying for two Bellevue City Council seats. Up north, Snohomish County Executive John Lovick has four challengers. On the ballot: City Council races in Seattle, Bellevue and Bothell, Seattle Public Schools board races, Port of Seattle commissioner races, the Snohomish County executive race, among others. Voting deadline: The election is mail-only. Ballots must be either postmarked by Tuesday or put in a drop box, van drop or returned in person to your county elections department by 8 p.m. Be sure to sign the ballot envelope. Not registered? You missed the deadline for this election. You have eight days before an election to register in person, or 29 days to mail in a registration form. Get a ballot: If you lost your ballot or never received one, in King County call 206-296-8683. In Snohomish County call 425-388-3444. Drop boxes: Ballots placed in drop boxes or drop-off vans do not require postage. For the list of locations in King County: www.kingcounty.gov/elections/voting/ballotdropboxes.aspx, Locations in Snohomish County: http://snohomishcountywa.gov/225/Ballot-Drop-Boxes, Voting centers: For disabled voters unable to vote by mail, accessible voting centers are available at King County Elections in Renton, Bellevue City Hall and Union Station in Seattle. Hours: Call 206-296-8683 or see www.kingcounty.gov/elections/voting/accessible.aspx, In Snohomish County, accessible centers are at the Auditors Office in Everett and the Lynnwood Sno-Isle Library. For more information: http://snohomishcountywa.gov/1986/Accessible-Voting-Information, Voters will see their choices narrowed for the Nov. 3 general election, and in some cases an incumbent might not make it through, meaning a change would be ahead in local government. Thanks to a 2013 ballot measure, seven of nine Seattle City Council members will be elected this year by geographic district. Two will be elected citywide. Two of the councils current members arent running for re-election, and a third left for another job earlier this year, so two district seats and a citywide position are wide open and have attracted 23 candidates among them. Five races feature current council members  Bruce Harrell, Sally Bagshaw, Jean Godden, Kshama Sawant and Mike OBrien  trying to fend off challengers in newly drawn districts. Current Council President Tim Burgess is attempting to hold on to a citywide seat. The move to district voting is, according to some, responsible for a primary-election ballot with a larger, more diverse crop of candidates than usual, including many younger hopefuls, women and people of color. Though candidates have been campaigning for months, money raised from business groups and labor unions by independent-expenditure committees only just began pouring into the races. The committees have spent more than $275,000 already. Seattles housing-affordability challenges and debate over increased housing density in the city have recently assumed center stage in the contests. The top two candidates in each race will advance to the general election. Courtney Gregoire, seeking re-election to Position 2 on the Port of Seattle Commission, has two opponents  perennial candidate Goodspaceguy and John Naubert, a socialist electrical-wire assembler who also ran in 2013 and 2011. Nine candidates are fighting over the seat Bryant is vacating, including the former president of the company that operates the Victoria Clipper, a former Delta Air Lines board member, a railroad-union leader, a marine environmental consultant and a former Normandy Park City Council member. Campaign matters include creating family-wage jobs, expanding Seattle-Tacoma International Airport, forming a seaport alliance with the Port of Tacoma, and Terminal 5 serving as a home for Shell Oils Arctic drilling fleet. In the Seattle School Boards District 3, which includes parts of Northeast Seattle and downtown, a field of four will be winnowed down to two. The candidates are Jill Geary, Lauren McGuire, Stephen Clayton and David Blomstrom, and easing crowding in school buildings has been a point of focus. Harium Martin-Morris, who currently represents District 3, isnt running again. In District 6, incumbent Marty McLaren is taking on two challengers, Leslie Harris and Nick Esparza. Two other seats have only two candidates, each of whom will automatically proceed to the general election. Managing growth and the coming light-rail line have been the hot topics in two Bellevue City Council races. Three candidates want to replace Mayor Claudia Balducci, whos leaving her District 5 seat in Bellevue to run for Metropolitan King County Council. Balducci has endorsed two of the hopefuls  journalist and community volunteer Sherry Grindeland and biotechnology professional Vandana Slatter. The third candidate is Michelle Hilhorst, an IT operations manager with the races best rating from the Municipal League of King County. Position 7 incumbent Jennifer Robertson, a land-use attorney, is defending her seat against bicycling and neighborhood advocate Lyndon Heywood and anti-light-rail candidate Bill Hirt. The League rated Hirt not qualified. Two candidates for Position 3, including incumbent John Chelminiak, will advance to the general election, and incumbent John Stokes is running unopposed for Position 1. Snohomish County Executive John Lovick, whom the Snohomish County Council appointed to replace Aaron Reardon in 2013 after a scandal, is up against County Council Chairman Dave Somers and three others. Lovick and Somers, who have sparred openly over the past year about county finances and management, are both Democrats. Somers has called Lovick a terrible manager responsible for ballooning cost estimates on a planned new courthouse and other issues. Lovick has said the county is growing and prospering under his leadership, citing an unemployment rate of 4 percent. Two Republicans, retired biochemist Robert Sutherland and Marysville farmer Norm Nunnally, also are running, along with Lynnwood attorney James Robert Deal, who states no party preference. Two candidates will advance, regardless of party affiliation.]", "Date": "20150801", "Author": "[Daniel Beekman]", "Link": "http://www.seattletimes.com/seattle-news/politics/primary-vote-tuesday-to-cull-sizzling-summer-of-local-races/", "Title": "[Primary vote Tuesday to cull sizzling summer of local races]"}