{"Content": "[ WASHINGTON (AP)  Sen. Ron Johnson was elected to Congress in 2010 as an adamant foe of President Barack Obamas health care overhaul. Yet facing a Supreme Court decision that could disrupt how that law functions, the Wisconsin Republican is among many in the GOP who want Congress to react with caution. If the plaintiffs prevail in the Republican-supported case, the justices could annul federal subsidies helping around 7.7 million people afford coverage in more than 30 states. Republicans broadly agree that Congress should respond by temporarily replacing that aid, aware that abruptly ending it would anger millions of voters before next years presidential and congressional elections. Neither politically nor practically can we end those subsidies, said Johnson, who faces a potentially tough re-election next year. So lets just recognize those realities. Lets set up the 2016 election as the contest, the discussion, the debate over repealing the law. And while Republicans say they are dedicated to repealing the law, they remain divided over how to respond once the court rules. Johnsons is among five GOP proposals  and counting  suggested so far, and none have won a consensus. I think it needs to be part of the presidential campaign, and then the winner will be able to point to that as part of their mandate, No. 2 Senate GOP leader John Cornyn of Texas said of replacing the health care law. Meanwhile, he said, what we all need to do is unite around one approach, if thats at all possible, and thats been a challenge because there are competing good ideas out there. The divisions underscore the challenge Republicans face between satisfying conservative supporters who want the law dismantled and providing help should millions lose their ability to afford coverage. But the sheer existence of the GOP proposals could help in court because it might suggest to the justices that despite Democrats claims that eliminating the subsidies would spark health insurance chaos, Congress is already working on ways to avoid that. Johnsons plan would extend the current subsidies until August 2017 but also eliminate the coverage requirements for individuals and employers, which Obama considers key parts of the law and would be unlikely to accept. His proposal has attracted 31 co-sponsors including the Senates top GOP leaders. Sen. John Barrasso, R-Wyo. is helping to craft a plan he says would temporarily protect people who lose subsidies and eliminate the laws requirements that individuals buy coverage and that companies cover their workers. Conservative freshman Sen. Ben Sasse, R-Neb. has introduced narrower legislation replacing the current subsidies with a new tax credit that would be phased out over 18 months as Congress worked on a broader response. Some conservatives prefer to focus on repeal. One large group of House conservatives led by Rep. Bill Flores, R-Texas, is writing a plan expected to revoke the entire law and instead provide new health care tax deductions for families. What did we tell the voters last November? We told them were committed to getting rid of this law, said Rep. Jim Jordan, R-Ohio, a leading House conservative. Put it on the presidents desk, actually make him veto it. Republicans will be able to use special budget rules this year shielding legislation addressing the health law from Senate filibusters, which take 60 votes  a difficult hurdle  to end. Rep. Paul Ryan, R-Wis. says that once the court has ruled, GOP leaders will decide whether to use that process to send Obama legislation repealing the health care overhaul or addressing the justices ruling. Ryan, chairman of the House Ways and Means Committee, is working on one replacement bill with other lawmakers. I dont think the guy named Obama will sign a law repealing Obamacare, said Ryan, using a nickname for the law. He said if the court annuls the subsidies, what happens? And thats where its open-ended. The House voted in February to repeal the health care law, as it has dozens of times since 2011. The Senate hasnt voted on repeal yet. Such a vote could be difficult for the half-dozen GOP senators facing competitive re-election fights in closely divided or Democratic-leaning states in 2016, when Senate control will be at stake. The court should rule by late June. Plaintiffs say the Obama administration is unlawfully providing subsidies to people buying health coverage in the 37 states using healthcare.gov, the federally run insurance marketplace. They say the laws language limits those subsidies to people purchasing policies on the 13 state-run insurance exchanges. Of the 11.7 million Americans enrolling for health coverage through government-established marketplaces for 2015, nearly 9 million bought it in states using federally run exchanges, according to the Department of Health and Human Services. Of those 9 million, around 7.7 million qualified for subsidies, which they receive as tax credits. Supporters say the law was intended to provide subsidies in all states. They say eliminating the payments would make many people drop coverage, driving up premiums for everyone else because only the sickest and most expensive recipients would retain their policies.]", "Date": "20150430", "Author": "[ALAN FRAM]", "Link": "http://www.seattletimes.com/seattle-news/health/gop-divided-as-supreme-court-ruling-on-health-care-law-nears/", "Title": "[GOP divided as Supreme Court ruling on health care law nears]"}