{"Content": "[ If you think the U.S. education system is doing its job, heres a statistic to contemplate: Forty-six percent of Americans believe that humans were created just 6,000 years ago. In other words, the overwhelming scientific evidence in favor of evolution is flat wrong. This alarming, depressing figure comes from a Gallup poll and hasnt changed much over the years. In 1982, 44 percent of Americans believed that God created humans in their current form. The number of Republicans who believe in creationism and discount evolution has increased since 2009 from 47 percent to 56 percent. In other words, no monkeys involved. The Bible is literally true. Noahs Ark was real and saved 7,000 species from drowning. Perhaps you heard about the debate the other night between Bill Nye, TVs Science Guy, and Ken Ham, who founded the Creation Museum in Petersburg, Ky. The museum coins huge amounts of money from tourists eager to see dioramas of human beings and dinosaurs living side by side in perfect harmony. The human being has modern hair and is fully clothed and belted, of course, and is smiling toothily. I think the dinosaur, which looks eerily like the evil velociraptors in Jurassic Park, is also smiling. The Nye-Ham encounter wasnt really a debate because, as Ham said, neither was going to win by changing viewpoints. Ham certainly isnt open to evolution. I know that Gods word is true. Nothing he (Nye) says will cast doubt on that, Ham intoned. Nye reposted that Hams no-evolution theory cant possibly explain why there are now millions of species of flora and fauna. He wondered for example, how two kangaroos from a boat that ended up in Turkey could have hopped over oceans to land in Australia, leaving no fossils behind. The encounter is of little historic note except that school boards all over the country are in real debate over whether creationism should be taught to children. During one of the interminable GOP debates before the 2008 presidential election, the 10 candidates on stage were asked if they believe in evolution. Three raised their hands indicating they did not: Tom Tancredo, Kansas Gov. Sam Brownback and former Arkansas governor Mike Huckabee. Huckabee, a televangelist who has his own political show on the Fox network, later said the question was utterly silly. None of the candidates, he said, was running to be eighth-grade science teacher. Huckabee has suddenly emerged as one of the leading GOP presidential candidates for 2016 since New Jersey Gov. Chris Christie self-destructed. He says the earth may be more than 6,000 years old and may even be billions of years old. But we dont know. He insists he does know that one God created it all. President Obama says he is against teaching creationism as an alternative to evolution to children because it is religion-based. He calls science the never-ending search for knowledge and truth. He says science holds the key to our planets survival (climate change). And he says it is time to put science at the top of our agenda. Huckabee and many millions like him do not agree. They want belief at the top of the agenda, or rather, they want their form of belief. Their belief that America can do no wrong. Belief that their God loves this country more than others. Their belief that scientific findings can be cherry picked and denied. Their belief that parents may decide what truths their children are taught and which are inconvenient. Forty-six percent of Americans refuse to accept that human life evolved from lesser animals in a process that took billions of years. According to the Yale Project on Climate Change Communication, only 63 percent of Americans believe that climate change is happening although 97 percent of climate experts are convinced climate change is real and human activity is the cause, according to The Consensus Project. And, yes, folks, there is still a Flat Earth Society.  , McClatchy-Tribune News Service, Ann McFeatters has covered the White House and national politics since 1986. Her email address is amcfeatters@nationalpress.com.]", "Date": "20140214", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/in-american-politics-itrsquos-still-science-vs-religion/", "Title": "[In American politics, its still science vs. religion]"}