{"Content": "[ Former state Republican Party chair Chris Vance will announce his candidacy Tuesday for the U.S. Senate, launching an underdog campaign against four-term Democratic incumbent Sen. Patty Murray. Vance plans to challenge Murray as part of a Congress mired in gridlock and unable to make the hard choices he says are needed to bring down the $18 trillion national debt. The dysfunction in Washington, D.C. is nothing short of a national disgrace, Vance said in an interview. It would be wrong to blame all of this on Patty Murray. But I think it would be equally wrong to say she is not a big part of the problem. Vance, 53, will make his announcement in an online video and news release followed by a round of media interviews. A former state representative and Metropolitan King County Council member from Auburn, Vance served as chairman of the state GOP from 2001 to 2006. For the past several years hes worked as a lobbyist, consultant and political commentator. Vance said hell advocate centrist, bipartisan policies on issues from immigration reform to health care. He pointed to his time on the County Council, where he worked across the aisle with Democrats to pass budget agreements and growth management laws. Murray announced last year shed seek a fifth term in 2016. A spokesman for her re-election campaign declined to comment before Vances announcement. But other Democrats were giddy at the chance to throw Vances past statements back at him and tie him to a national Republican Party that has been unpopular in this state. As GOP chair during the George W. Bush administration, Vance praised Bush in 2004 as right on the issues that matter to Washington state, the state Democratic Party noted in a news release. In contrast to his central campaign criticism, Vance also has at times complimented Murray as a skilled lawmaker and negotiator, comparing her to legendary Washington Sen. Warren Magnuson in a 2010 McClatchy newspaper profile. Jamal Raad, spokesman for the state Democrats, said he looked forward to exposing Vances record of poisonous partisanship, extremism, and George Bush idolatry. Vance said he knows Democrats will paint him with a partisan brush and said his job as state GOP chair necessarily included promoting Bush. But he vowed to show voters hes a different kind of Republican. He said hell roll out a series of papers showing voters his positions on taxes, trade, immigration and other issues. His top priority will be enacting a deficit-reduction plan along the lines of one proposed by the bipartisan Simpson-Bowles commission appointed by President Obama in 2010. That plan would include tax increases on wealthy Americans and a higher federal gas tax. It also would make broad cuts to federal spending and changes to benefit programs, an increase in the Social Security retirement age. Vances campaign announcement is unlikely to shake the consensus among national election observers that Murray is a safe bet for re-election. This race is not a priority for national Republicans, who primarily will be playing defense this cycle, said Kyle Kondik, managing editor for Sabatos Crystal Ball at the University of Virginias Center for Politics. Kondik noted Republicans have identified only two Senate seats held by Democrats as possible pickups in 2016  in Nevada and Colorado. He predicted the Washington Senate race would become competitive only if national conditions take a dramatic turn against Democrats. Vance said hes spoken with the National Republican Senatorial Committee and does not expect the organization to come to his aid. Wed certainly welcome it, he said. He plans to run a lean campaign with virtually no overhead and knows he cant expect to match Murray in fundraising. Her re-election campaign already has raised $6.7 million and had $3.8 million in the bank as of July. But with years of experience in politics, Vance said he knows how to run a campaign that will raise enough money to get its message across. I think the public wants people to look them in the eye and treat them like grown-ups and tell them the truth, he said.]", "Date": "20150907", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/former-gop-chair-chris-vance-to-challenge-sen-patty-murray/", "Title": "[Former GOP chair Chris Vance to challenge Sen. Patty Murray]"}