{"Content": "[ LAS VEGAS (AP)  The Iran nuclear deal was only a few hours old when Republican White House hopefuls began vowing to overturn it. The stance may help them score points among the conservatives who dominate the Republican presidential primary electorate, where hostility toward President Barack Obamas foreign policy is a prerequisite. But with few easy alternatives, Tuesdays unanimous opposition among the Republican Partys most ambitious could be far less effective among general election voters in the fall of 2016. The contrast was clear with Democratic presidential candidate Hillary Rodham Clinton, who quickly embraced the deal publicly and privately in a series of meetings with Democratic lawmakers on Capitol Hill. In a statement issued Tuesday night, she said the briefings she had received and a review of the documents led her to support the agreement. , , It can help us prevent Iran from getting a nuclear weapon, she said. With vigorous enforcement, unyielding verification and swift consequences for any violations, this agreement can make the United States, Israel and our Arab partners safer. At roughly the same time Clinton was on Capitol Hill, Wisconsin Gov. Scott Walker was predicting that the agreement will be remembered as one of Americas worst diplomatic failures. Florida Sen. Marco Rubio, who, like Walker, has vowed to rescind the agreement should he be elected president, charged that this deal undermines our national security. The partisan divide reflects voters ambivalence over how to counter Irans nuclear ambitions, experts said. The cognitive dissonance of the American public on this issue  longstanding distrust of Iran balanced by dislike of new Middle Eastern entanglements  means we are not likely to see a lot of candidates gaining traction on Iran, said Suzanne Maloney, a former State Department staffer and senior fellow at the Brookings Institute in Washington. The Republicans who seem to be eager to use this as a campaign issue are going to have difficulty persuading people there is an alternative that is more viable and has a credible outcome. No polls have been conducted since the deal was reached Tuesday, but a new AP-GfK poll suggests that Democrats may struggle to earn the publics trust on the issue. Before the agreement was announced, 6 in 10 Americans disapproved of Obamas handling of the U.S. relationship with Iran, while just over a third approved. At the same time a slim majority of Americans (51 percent) said the United States should have a diplomatic relationship with Iran, the AP-GfK poll found, slightly more than the 45 percent who said it should not. And an April AP-GFK poll found 54 percent approved of the framework of the then-unfinished Iran deal. Republicans are far more likely to oppose the bargain, which was evident as 2016 hopefuls lined up to blast it. A group supporting Rubio released a television ad touting his opposition in an effort to burnish his conservative credentials. Campaigning in Iowa, former Florida Gov. Jeb Bush called Obamas actions naive and wrong. Weve created, legitimized, Iran being a nuclear threshold country, and that in and of itself creates huge instability in the region, Bush said. Kentucky Sen. Rand Paul, who has been skeptical of U.S. intervention in the Middle East, said the deal was unacceptable and that hed vote against it. Better to keep the interim agreement in place instead of accepting a bad deal, Paul wrote on Twitter. The political reasons for Republicans to condemn the bargain were evident in a Las Vegas Harley-Davidson dealership on Tuesday, where Walker made his first appearance after formally launching his White House bid the night before. Robert Fulton, a 68-year-old Vietnam veteran in a dark muscle shirt emblazoned with a skull, vented at the deal. They were talking about fixing a chicken coop and they gave them the whole damn farm, Fulton said, holding a can of energy drink. Iran, he added incredulously, is the largest exporter of terrorism in the world. Walker took the stage and noted that a childhood friend, Kevin Hermening, the youngest of the 52 Americans taken hostage in Iran in 1979, had been a guest at his announcement speech. We need a president who will terminate that bad deal with Iran on day one, Walker said. I will put in place crippling economic sanctions on Iran and I will convince our allies to do the same. Neither Walker nor any of his Republican rivals offered clear alternatives to the Iran deal. Yet by condemning the pact, Republicans continue to link Clinton, the former secretary of state, to Obama in an effort to motivate their base and capitalize on voter fatigue after eight years of Democratic occupancy of the White House. Should the Iran deal pass Congress and no surprises occur, said George Perkovich of the Carnegie Endowment for Peace, it may well become a political wash because the two sides can argue to a stalemate. The Republican is going to say, We cant trust the ayatollahs, Obamas a terrible negotiator, Perkovich predicted. The Democrat is going to say, Then your choice is another war in the Middle East, only with a country three times the size of Iraq., ", "Date": "20150715", "Author": "[NICHOLAS RICCARDI]", "Link": "http://www.seattletimes.com/nation-world/gop-candidates-slam-iran-deal-but-will-it-play-in-2016/", "Title": "[GOP candidates slam Iran deal, but will it play in 2016?]"}