{"Content": "[ LAHAINA, Hawaii  Trade negotiators from the United States and 11 other Pacific nations were headed toward failure Friday, with difficult talks on the largest regional trade agreement ever breaking down over protections for pharmaceutical companies and access to agriculture markets on both sides of the Pacific. Negotiators will return to their home countries to obtain high-level signoffs for a small number of final sticking points on the agreement, the Trans-Pacific Partnership (TPP), with bilateral talks reconvening soon. But the breakdown is a setback for the Obama administration, which had promoted the Hawaii talks as the final round before an accord that would bind 40 percent of the worlds economy under a new set of rules for commerce. President Obamas trade push had been buoyed by Congresss narrow passage in June of fast-track trade negotiating powers, and U.S. negotiators had hoped other countries could come together once Congress had given up the right to amend any final agreement. In the end, a deal filled with 21st-century policies on Internet access, advanced pharmaceuticals and clean energy foundered on issues that have bedeviled international trade for decades: access to dairy markets in Canada, sugar markets in the United States and rice markets in Japan. Australia, Chile and New Zealand also continue to resist the U.S. push to protect the intellectual property of major pharmaceutical companies for up to 12 years, shielding them from generic competition as they recoup the cost of developing next-generation biologic medicines. The trade ministers who gathered at the luxury hotels of Maui this week for talks that went deep into the night did have some successes. They reached agreement on broad environmental protections for some of the most sensitive, diverse and threatened ecosystems on Earth, closing one of the most contentious chapters of the Pacific accord. They also reached agreement on how to label exports with distinct geographic indications, such as whether sparkling wine can be called Champagne. And they agreed on a code of conduct and rules against conflicts of interest for arbitrators who would serve on tribunals to hear complaints from companies about whether their investments were unfairly damaged by government actions. But the failure to complete the deal  eight years in the making  means the next round of negotiations will push the U.S. ratification fight into 2016, a presidential election year. Most Republican candidates are likely to back it, but a final agreement would force Democratic front-runner Hillary Rodham Clinton to declare her position, which she has avoided. This week, she said: I did not work on TPP as secretary of state, although she gave a 2012 speech in Australia declaring the accord the gold standard in trade agreements. The push for the Pacific deal has split most Democrats from their president. Further delay raises the prospect that a deal sealed by Obama might have to be ratified by his successor, just as George H.W. Bushs North American Free Trade Agreement was secured by Bill Clinton. The failure of the Maui talks pointed to the extreme difficulty of reaching agreement with so many countries, each with its political dynamics. Vietnam, Malaysia and New Zealand were willing to make significant concessions to gain access to U.S. markets. But with Canadas prime minister, Stephen Harper, fighting for his political life before national elections in October, Canada would not budge on opening its poultry and dairy markets. Chile, with a new, left-of-center government and existing free-trade agreements with each of the countries in the Pacific deal, including the United States, saw no reason to compromise, especially on its demand for a short window of protection for U.S. pharmaceutical giants. Australias delegation insisted pharmaceutical-market protections beyond five years would never get through Parliament, and the U.S. team was demanding 12. The bright spot might have been the environmental negotiations. The completed environmental chapter would cover illegal wildlife trafficking, forestry management, overfishing and marine protection, and it could set a floor for future multilateral accords. Under the agreement, the 12 countries  from Peru and its rain forest to Vietnam and the diverse Mekong Delta  must commit to obeying existing wildlife-trafficking treaties and their own environmental laws. Environmentally destructive subsidies, such as cheap fuel to power illegal fishing vessels, would be banned. The impact of the Pacific accords environmental chapter could be broad. The 12 participating countries account for more than a quarter of the global seafood trade and about a quarter of the worlds timber and pulp production. Five of the countries rank among the worlds most biologically diverse countries.]", "Date": "20150731", "Author": "[Jonathan Weisman]", "Link": "http://www.seattletimes.com/nation-world/pacific-trade-deal-talks-falterover-disputes-in-2-key-areas/", "Title": "[Pacific trade-deal talks falter over disputes in 2 key areas]"}