{"Content": "[ BARRINGTON, N.H. (AP)  Unlimited political cash would give rank-and-file conservative activists greater sway in picking their representatives, including the president, White House hopeful Ted Cruz told New Hampshire voters on Sunday. Cruz, a first-term senator who represents Texas, said deep-pocketed donors should have the same rights to write giant campaign checks as voters have to put signs in their front yards. Both, Cruz said, were an example of political speech, and he added that money absolutely can be speech. I believe everyone here has a right to speak out on politics as effectively as possible, Cruz told a voter who asked him about the role of the super-rich in politics. Cruz, making his first trip to New Hampshire this year, was using a two-day visit to this early voting state to lay the groundwork for an expected presidential campaign. Three of the seven questions he took during a town hall-style meeting were statements encouraging him to run for president. Cruz steadfastly insisted he was not yet a presidential candidate and said he was merely considering it. I am looking at it very seriously, he said a day after making a campaign-style trip to South Carolina, another early nominating state. After the session, one activist gave Cruz a blank check and told him to write it for whatever amount he needed. Cruz, mindful that accepting the check would trigger his official entrance to the Republican primary, declined but told an aide to follow up with the man after a campaign is official. Stay tuned, he said. But Cruz also told voters his daughter, Caroline, had given him permission to join the presidential race in the hopes that the family puppy would get to play on the White House lawn instead of near their Houston high-rise condo. If you win, that means Snowflake will finally get a backyard to pee in, Cruz said his daughter told him. Cruz, a tea-party favorite, is expecting to formally join a crowded field of presidential hopefuls in the coming weeks. In the meantime, he has been courting party activists and donors to help him counter deep-pocketed rivals such as former Florida Gov. Jeb Bush, Sen. Marco Rubio of Florida and Wisconsin Gov. Scott Walker. Asked about the outsized role of money in politics at his first event in New Hampshire this year, Cruz said he understands voters frustration but that cannot trump the constitutional rights to free speech. Right now, the system is crazy, Cruz said of the campaign finance rules. At a later appearance at a GOP fundraiser in New Hampshires rural Grafton County, Cruz said Democrats were working to limit activists rights through a proposed constitutional amendment to restrict campaign spending. The Democrat-backed proposal last year was more an election year posturing than a viable plan to change the Constitution. Is there not one lion of the Left who will stand for free speech? Cruz said in Lincoln. In the Senate, Cruz has proposed lifting all campaign contribution limits in exchange for immediate disclosure. The answer is not to muzzle citizens. It is to empower citizens, Cruz said. Yet Cruz acknowledged that heavy spending had been a headache during his 2012 campaign for Senate. In the Senate race, I had $35 million in nasty attack ads against me, Cruz said. And you know what? It was their Constitutional right to do so. ", "Date": "20150316", "Author": "[PHILIP ELLIOTT]", "Link": "http://www.seattletimes.com/seattle-news/politics/texas-cruz-lift-all-contribution-limits-on-campaign-cash/", "Title": "[Cruz: Lift all contribution limits on campaign cash]"}