{"Content": "[ Already the polling for the presidential race is feverish, with new findings daily. Which Republican is leading in New Hampshire? How do voters feel, at any evanescent moment, about Hillary Clinton?, But theres a climate in the country thats larger than any contender, strangely resistant to the sorts of ups and downs that a campaign endures and as crucial to the outcome of the election as the clash of personalities that commands the lions share of our attention. Its a mood of overarching uncertainty and profound anxiety. And its so ingrained at this point that we tend to overlook it. For a stunningly long period now, American voters have been pessimistic about the countrys future  and their own. They sense that both at home and abroad, we have lost ground and keep losing more. And the presidency may well be determined not by any candidates fine-tuned calibration on hot-button issues or by cunning electoral arithmetic. It may hinge on eloquence, boldness and a bigger picture. If one of the aspirants can give credible voice to Americans insecurity and trace a believable path out of it, he or she will almost certainly be victorious. In a column a year ago, I noted that for a solid decade, the percentage of Americans who said that the United States was on the wrong track had exceeded the percentage who said that it was on the right track, according to polling by NBC News and The Wall Street Journal. I wondered about a change in the very psychology and identity of a country once famous for its sunniness about tomorrows. Since then the NBC News/Wall Street Journal poll has asked the right track/wrong track question another 10 times, and wrong track has continued to prevail without interruption and by substantial margins. The split as of two weeks ago was 62 percent to 28 percent. Other polls have yielded similar findings even as unemployment dropped and the recession faded ever further from view. Some projections validate voters gloom. In The Washington Post recently, Robert Samuelson observed that while the U.S. economy expanded at an average annual rate of 4 percent from 1950 to 1973, its predicted to grow just 2.1 percent annually over the next decade. The 6 percent increases that werent uncommon in the 1990s are apparently long gone. We cant do much about this, Samuelson wrote, citing the retirement of baby boomers and the spread of new technologies that could sideline workers. The latter dynamic is the focus of a new book, Rise of the Robots, thats about as scary as the title suggests. Its not science fiction, but rather a vision (almost) of economic Armageddon. Its author, Martin Ford, invokes robots as a metaphor for the technological innovations, including better software and sophisticated algorithms, that have or will put machines in jobs once held by people. Computers, he notes, can now perform legal, pharmaceutical and medical work. They can produce journalism. In a conversation Tuesday, he told me: If you automate all of these jobs, and technology drives down wages, then consumers have less purchasing power, which can lead to a downward economic spiral. Lead to? Weve known ample spiraling already, and the context for Americans apprehensions is a flourishing debate about whether the American moment is over. The title of a gathering of professors, politicians and writers at the Wilson Center in Washington, D.C. later this week asks: Is the United States at a Crossroads? Specific panels will mull related questions: Americas Decline: Myth or Reality? and Is the United States Still the Indispensable Nation?, In The Times last month, Jonathan Weisman interviewed officials involved in the spring meetings of the International Monetary Fund and the World Bank and noted that concern is rising in many quarters that the United States is retreating from global economic leadership. The economist Edwin Truman, who worked in the Obama administration, told Weisman: Were withdrawing from the central place we held on the international stage. This sense of American drift, of American sputtering, informs President Barack Obamas current push for a sweeping trade agreement and his support for energy exploration, including drilling in the Atlantic and the Arctic. Hes after some economic juice. It will inform the 2016 presidential election, too. Politicians and voters will wrangle in the foreground over taxes, the minimum wage, student debt, immigration. But in the background looms a crisis of confidence that threatens to become the new American way. Lets hope for a candidate with the vision and courage to tackle that.]", "Date": "20150513", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/the-bitter-backdrop-to-2016/", "Title": "[The bitter backdrop to 2016]"}