{"Content": "[ BANGKOK, Thailand  Leena Jang is surrounded by soap. Every box  and there are thousands of them  bears her face and name. They cover almost every surface in her small TV studio, stacked precariously on equipment and packed into cardboard boxes beneath overflowing shelves. Jang, a fiery 56-year-old with heavy makeup and purple-streaked hair, is a trained lawyer, a beauty-product entrepreneur and a well-known media pundit, like a Thai cross between Rush Limbaugh and YouTube cosmetics star Michelle Phan. Between infomercials, she delivers antigovernment screeds vitriolic enough to make the hardiest dissidents blanch  or laugh uncomfortably. On air, she has called Thailands constitution backwards, its government crap, and a former prime minister dumb as a buffalo. The diminutive critics outspokenness has made powerful enemies for her. The Thai military, which took power in a coup last year, has threatened her with exile, arrest and physical violence. It shut down her satellite TV show, HotTV, and blocked her YouTube channel. She now posts her videos on Facebook. But without her much larger television audience, she says, the inventory has been collecting dust. It is a constant reminder of her frustration. Other channels just bow to the military, she says. They have a lot to lose  their advertisers might pull out. I really have nothing. I have no husband, no son, no daughter. I have my back against the wall. All I really have is my heart. Since the military toppled a democratically elected government on May 22, 2014, ending months of street protests, experts say that Thailand  once widely considered a beacon of liberal democracy in Southeast Asia  has been sliding toward dictatorship, replete with tightened restrictions on freedom of expression, assembly and the press. The government  called the National Council for Peace and Order  has criminalized protests involving more than five people and threatened to shut down dissenting media.  Although Bangkok has remained largely calm in recent months, a bomb exploded Monday night at the Erawan Shrine, a popular tourist attraction in the central city, killing at least 18 people and injuring more than 100. The explosion occurred near the Rajprasong intersection, the site of the protests last year that compelled the junta to take power. No one immediately claimed responsibility. We are not sure if it is politically motivated, but they aim to harm our economy and we will hunt them down, Deputy Prime Minister Prawit Wongsuwon told reporters, according to The Associated Press. The prime minister, former army chief Gen. Prayut Chan-o-cha, has burnished a reputation as an eccentric strongman. In September, Prayut told an audience that he once covered himself from head to toe in holy water to ward off curses from opponents. In December, he threw a banana peel at a cameraman. He has demanded that journalists kneel before him. In March, when asked what hed do with reporters who didnt tell the truth, he joked, Well probably just execute them. Under Prayut, 61, the junta has detained activists for the slightest acts of dissent, including raising three-fingered Hunger Games salutes, reading out loud from the anti-authoritarian novel 1984, and in the case of one lunchtime gathering, eating sandwiches with political intent. The country is so desperate, said Sunai Phasuk, a Bangkok-based senior researcher at Human Rights Watch. He said that Prayuts restrictions on freedom of expression and assembly have muted most moderate criticism, creating an environment where only the most radical voices remain. Hes mercurial  he himself is a ranter, Sunai said. He wants Thailand to be rebuilt in his image.  You can end up in jail for disagreeing with him. In April, Prayut replaced martial law with a sweeping security decree granting the junta extralegal power to crack down on acts deemed harmful to national peace and stability. Local media have called the rule, Article 44 of an interim constitution, the dictator law. Chuwit Kamolvisit, a Bangkok politician and former massage-parlor tycoon known for disclosing endemic bribery within the citys police department, said that the junta has repeatedly warned him not to criticize Prayut in interviews with local journalists. We cannot argue against someone who controls both the law and the gun, he said. Prayut has repeatedly said that he has no intention of clinging to power. Yet critics say he has taken steps to solidify his rule, such as prosecuting political opponents and appointing a military-heavy Cabinet and parliament, which declared him prime minister a year ago. He has repeatedly delayed general elections, most recently to 2016. All of this is playing out against the backdrop of extraordinarily sensitive royal succession: The countrys widely revered 87-year-old King Bhumibhol Adulyadej is reportedly ill. Prayut is known as a staunch monarchist, analysts say, and may not step down until the succession issues are resolved. Thailand has experienced 12 coups  and seven attempted coups  since it became a constitutional democracy in 1932. The country has been deeply divided for years, primarily along economic lines, and despite a facade of normality in the capital, tension simmers. Society has become so divided, said Nuttakarn Sumon, 37, the director of a modeling agency in Bangkok. If youre upper middle class, and youre not a farmer or a taxi driver, part of you might feel really against the governments detractors, she said. Some of them prefer the dictatorship; they think its better than having protests. This dictatorship is going to stick around for longer than most people think, said Aim Sinpeng, an expert on Thai politics. She said that Prayuts initiatives have a broad cultural bent. He has pushed to install 12 core values of the Thai people in the primary-school curricula, including love for the nation, respect for the law and elders, and concern for the public good over self-interest. The junta has issued orders requiring that schoolchildren recite them in class. The regime feels that part of the problem why Thailand is in such a mess  why its had protests for the past 10 years  is that weve forgotten what its like to be Thais, Aim said. ]", "Date": "20150817", "Author": "[Jonathan Kaiman]", "Link": "http://www.seattletimes.com/nation-world/bangkok-bomb-blast-comes-amid-dictatorship-fears/", "Title": "[Bangkok bomb blast comes amid dictatorship fears]"}