{"Content": "[ DAVENPORT, Iowa (AP)  Former Maryland Gov. Martin OMalley entered the Democratic presidential race on Saturday in a longshot challenge to Hillary Rodham Clinton for the 2016 nomination, casting himself as a new generation leader who would rebuild the economy and reform Wall Street. Im running for you, he told a crowd of about 1,000 people in a populist message at Federal Hill Park in Baltimore, where he served as mayor before two terms as governor. OMalley said was drawn into the campaign to rebuild the truth of the American dream for all Americans. Following his announcement, OMalley promptly headed to Iowa, where he is seeking to become the primary alternative to Clinton in the leadoff caucus state. Before more than fifty people at a union hall in Davenport, he touted his executive experience and called for economic reforms, drawing enthusiastic applause. We are still in just as grave a danger of having Wall Street excesses wreck our economy again and theres not a need for it. When wealth concentrates as it has, it also concentrates and collects power and we have to retake control of our own government, said OMalley, who has made frequent visits to Iowa in recent months. OMalley, who will appear in New Hampshire Sunday, remains largely unknown in a field dominated by Clinton. Already in the race is Vermont Sen. Bernie Sanders, who could be OMalleys main rival for the support of the Democratic left. An ally of former President Bill Clinton, OMalley was the second governor to endorse Hillary Clintons presidential campaign in 2007. But he made clear that he thinks Democrats deserve a choice in the 2016 primary. The presidency is not a crown to be passed back and forth  between two royal families, OMalley said. It is a sacred trust to be earned from the people of the United States, and exercised on behalf of the people of the United States. He pointed to recent news reports that Goldman Sachs CEO Lloyd Blankfein would be fine with either Clinton or former Florida Gov. Jeb Bush, a leading Republican contender and the son and brother of presidents, in the White House. It was a forceful message that OMalley will focus on overhauling the financial system, a priority for liberals opposed to the bailouts of Wall Street banks. Tell me how it is, that not a single Wall Street CEO was convicted of a crime related to the 2008 economic meltdown? Not a single one, OMalley said. Tell me how it is, that you can get pulled over for a broken tail light, but if you wreck the nations economy you are untouchable?, Aides said OMalley called Hillary Clinton on Friday to tell her he was running. By Saturday afternoon, Clinton had tweeted, Welcome to the race, Gov. OMalley. Looking forward to discussing strong families and communities. The 52-year-old OMalley has spoken often about the economic challenges facing the nation and said he would bring new leadership, progressive values and the ability to accomplish things. We are allowing our land of opportunity to be turned into a land of inequality, he told the crowd. OMalley has presented himself to voters as a next-generation figure in the party, pointing to his record as governor on issues such as gay marriage, immigration, economic issues and the death penalty. His tenure was marked by financial challenges posed by the recession, but OMalley pushed through an increase in the states minimum wage while keeping record amounts of money flowing into the states education system. He backed a bill to allow same-sex marriage, which lawmakers passed and voters approved in 2012. He oversaw a sweeping gun-control measure and a repeal of the death penalty. He also raised taxes on multiple occasions  on higher earners, sales of goods, vehicle titles, gasoline, cigarettes, sewer services and more. Republican critics branded him as a tax-and-spend liberal and the GOP defeated OMalleys hand-picked successor in 2014. But his record on criminal justice has been scrutinized in recent weeks after riots in Baltimore broke out following the death of Freddie Gray, an African-American man who died in police custody following his arrest last month. OMalley was known for his tough-on-crime, zero tolerance policies that led to large numbers of arrests for minor offenses. Critics say it sowed distrust between police and the black community. Supporters note the overall decrease in violent crime during his tenure. OMalley has defended his work to curb crime, saying he helped address rampant violence and drug abuse. A few demonstrators gathered near the park to protest OMalleys criminal justice policies as mayor, an office he held from 1999 until his election as governor in 2006. During OMalleys speech, there was sporadic shouting from protesters, including one who blew a whistle. OMalley called the unrest heartbreaking but said there is something to be learned from that night, and there is something to be offered to our country from those flames. For what took place here was not only about race, not only about policing in America. Its about everything it is supposed to mean to be an American. Megan Kenny, 38, of Baltimore, who held a sign that said stop killer cops and yelled black lives matter, said she thought OMalleys decision to run was a strange choice, especially because of the recent rioting. She attributed the unrest to his ineffective zero-tolerance policy. OMalley could soon be joined in the Democratic field by former Rhode Island Gov. Lincoln Chafee, who plans to make an announcement next week, and former Virginia Sen. Jim Webb, who is exploring a potential campaign. Sanders has raised more than $4 million since opening his campaign in late April and sought to build support among liberals in the party who are disillusioned with Clinton. In a sign of his daunting task, Maryland Sen. Barbara Mikulski, his former boss and mentor, is supporting Clinton. She said in a statement that OMalley should follow his dreams. And while Ive already announced my support for Hillary Clinton, I know that competition is good for democracy. In Iowa, 55-year-old Democratic activist Sara Riley, of Cedar Rapids, said she would support OMalley if Vice President Joe Biden does not run. He can win Iowa, she said of OMalley, noting the state provides opportunities for underdog candidates. Still, she said: Im not going to pretend its easy. ", "Date": "20150530", "Author": "[KEN THOMAS, CATHERINE LUCEY]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/former-md-gov-omalley-jumps-into-2016-democratic-race/", "Title": "[Former Md. Gov. OMalley jumps into 2016 Democratic race]"}