{"Content": "[ NEWARK, N.J. (AP)  Federal prosecutors brought charges Friday against three former allies of Gov. Chris Christie  but not Christie himself  in the George Washington Bridge traffic scandal, apparently easing the legal threat that has hung over his 2016 White House ambitions for more than a year. One of those charged, David Wildstein, a former high-ranking official at the transportation agency that operates the bridge, pleaded guilty in a deal with prosecutors, saying he and the other defendants engineered huge traffic jams to get even with a local politician. Christie was not implicated in court or in the indictments. Based on the evidence currently available to us, were not going to charge anyone else in this scheme, U.S. Attorney Paul Fishman said at a news conference. The Republican governor claimed vindication. Todays charges make clear that what Ive said from day one is true  I had no knowledge or involvement in the planning or execution of this act, Christie said in a statement. While Christie may be out of any immediate legal danger, politically it could be more complicated. The furor has already damaged his standing in the polls, and the charges put the scandal back in the news just as the presidential cycle is getting underway and candidates are jumping into the race. Wildstein, a former official at the Port Authority of New York and New Jersey, pleaded guilty to conspiracy, saying he and the other Christie loyalists closed lanes and created gridlock in September 2013 as political payback against a Democratic mayor. He said the three of them also concocted a cover story: It was a traffic study. The two people he implicated  former Christie deputy chief of staff Bridget Kelly and Bill Baroni, who was the governors top appointee at the Port Authority  were charged with fraud, conspiracy and other offenses in an indictment unsealed later in the day. Wildstein, 53, has been cooperating with prosecutors for months. He could face about two years in prison at sentencing Aug. 6. The charges against Kelly and Baroni carry much heavier penalties if they are convicted. Essentially, the three defendants were accused of misusing public resources for political gain. They callously victimized people who were just trying to get to school or go to work, Fishman said. Wildstein gave no indication in court that Christie had any role in the scheme. But after the hearing, his lawyer, Alan Zegas, reiterated a claim he made last year that theres evidence that Christie knew about it as it happened. He did not go into detail. Brigid Harrison, a political science professor at New Jerseys Montclair State University, said the charges are bad news for Christie. I would go so far as to say that this really signals a death knell to his presidential aspirations, she said. You have key staffers who have been indicted, and one of the things that primary voters look to is: How would a prospective president manage their staff?, But Fergus Cullen, former chairman of the New Hampshire Republican Party, said he does not expect a major effect: People have already made up their minds as to whether they think its a deal or not. Some Christie foes have suggested that even if he had no direct role in the plot, his bruising political style created a culture that led members of his administration to think they could get away with such tactics. Asked about that, Fishman said: I wont comment on culture. State Assemblyman John Wisniewski, a Democrat who is co-chairman of a committee investigating the scandal, said that with Wildsteins guilty plea, the people of New Jersey have more reason to be skeptical of Gov. Christies leadership style built upon bullying and retaliation. Baronis lawyer, Michael Baldassare, said that Baroni will be fully exonerated and that Wildstein is a habitual liar. Kelly emphatically denied any wrongdoing and said she will work relentlessly to clear her name. I never ordered or conspired with David Wildstein to close or realign lanes of the bridge for any reason, much less for retribution, she said. She also said that she texted and emailed things that she meant to be funny  but now sees that they were not. The scandal broke wide open more than a year ago when an email from Kelly to Wildstein was revealed. It read, Time for some traffic problems in Fort Lee. Wildsteins reply: Got it. That exchange was key in the indictment. The closing of two of three access lanes caused monumental, bumper-to-bumper tie-ups at the George Washington Bridge, which links New Jersey to New York City and is the busiest span in the world. School buses and emergency vehicles were held up, and commuters were stuck in traffic for hours over four mornings. Wildstein said they orchestrated the lane closings to start on the first day of school to punish Fort Lee Mayor Mark Sokolich for not endorsing Christies re-election bid. Fort Lee sits at the foot of the bridge. Christie has called the scheme stupid and ridiculed the notion that he was even interested in an endorsement from Sokolich. The governor coasted to re-election in the fall of 2013. On Friday, Sokolich said the allegations that he was the target of political retribution were a true punch in the gut. I didnt sign up for this, he said. I signed up to open up Little League fields and lower taxes. As the scandal unfolded more than a year ago, Wildstein and Baroni resigned, and the governor fired Kelly and cut ties with Bill Stepien, his two-time campaign manager. Stepien was not indicted. ", "Date": "20150501", "Author": "[DAVID PORTER, JILL COLVIN]", "Link": "http://www.seattletimes.com/nation-world/nation/court-hearing-set-in-bridge-scandal-looming-over-christie/", "Title": "[3 former Christie allies charged in bridge scandal]"}