{"Content": "[ Gov. Chris Christies decision to stop fighting gay marriage in New Jersey was pragmatic  same sex weddings had already begun and a court warned that the state would have little chance of overturning them. But the move also reflects Christies bid to cast himself as leader of a welcoming GOP as he seeks re-election and ponders a White House bid. Friends and foes describe the move simply as Christie being Christie. The tell-it-like-it-is governor is signaling that he wont be intimidated by a vocal conservative minority that usually wields great influence in Republican presidential politics. And with political divisions deepening in the Republican Party, Christie is betting his political future that the GOP and the nation ultimately would embrace an unapologetic compromiser capable of attracting a broad coalition of voters  as hes expected to do in gubernatorial voting in two weeks. There are clear risks. While national public opinion is evolving, Republicans who oppose gay marriage traditionally dominate GOP politics in early-voting states on the presidential calendar such as Iowa and South Carolina. Abandoning foundational principles that go beyond politics is not the way to get positive attention in South Carolina, said Bob McAlister, a veteran South Carolina-based Republican strategist, adding that Christies latest move is absolutely going to hurt him. Christie remains personally opposed to gay marriage. He vetoed a bill approved by the legislature last year to legalize the practice. When a trial-level judge ruled last month that the state must allow same-sex couples to wed, Christie appealed that ruling to the state Supreme Court. The high court agreed to take up the case but unanimously refused to delay the start of gay weddings in the meantime, saying the state had little chance of prevailing in its appeal. And just hours after gay couples began exchanging vows on Monday, Christie announced that he was withdrawing his appeal. The decision makes New Jersey the 14th state to legalize gay marriage. Advisers to the governor said that in dropping the appeal, Christie stayed true to his principles. Although the governor strongly disagrees with the court substituting its judgment for the constitutional process of the elected branches or a vote of the people, the court has now spoken clearly as to their view of the New Jersey Constitution and, therefore, same-sex marriage is the law, Christie spokesman Michael Drewniak said in a statement. Some Republicans wanted Christie to fight harder. Hes in much the same situation as 2012 Republican presidential nominee Mitt Romney, who was governor when the Massachusetts Supreme Court legalized same-sex marriage almost a decade ago. Romney, too, said he was forced to comply with the rule of law once it was settled by the courts. But that wasnt enough to win over many skeptical conservatives. Their skepticism helped force a long and expensive primary fight against former Pennsylvania Sen. Rick Santorum, whose underdog campaign was largely fueled by his opposition to gay marriage and abortion. Rudy Giuliani, the former Republican presidential contender and New York City mayor, also struggled to gain traction in 2008 after embracing abortion rights and legal benefits for same-sex couples. That same year, former Arkansas Gov. Mike Huckabee, an ordained Southern Baptist minister, won the Iowa caucuses riding an aggressive social conservative agenda. He later fizzled in states like New Hampshire, where moderate Republicans and independents hold more sway. Republicans across the political spectrum concede that public opinion on same-sex marriage in 2016 is likely to be dramatically different than 2008 or even 2012. A CNN-ORC poll found in June that 34 percent of Republicans supported legal recognition of same sex marriage, a number that had jumped more than 10 points from a year earlier. The poll found strong majorities of independents and Democrats in favor as well. While conservative leaders in early voting states lashed out at Christies decision, there are signs even in social conservative strongholds that Christies bet is a smart one. Susan Geddes, an Iowa Republican activist and devout social conservative, says voters, including Republicans, care far less about opposing gay marriage than even 10 years ago. You have to explain to people, people like me, that the rest of the world doesnt think the way we do, said Geddes, who served as a top campaign consultant to strict conservative Republican candidates for the past several years. Thats upsetting for people. But if we want to have our party be effective, we have to accept opinions like that. Indeed, Iowa mainstream Republicans, led by Gov. Terry Branstad, are trying to swell the ranks of more economically minded conservatives, in hopes of increasing attendance at the Iowa GOP caucuses in 2016. The caucuses have been flooded by social conservatives who disproportionately oppose gay rights and abortion rights. David Kochel, who served as Romneys top Iowa strategist, came out in favor of gay marriage earlier in the year. Opposing the freedom to marry is a loser for our party and serves to drive away a growing number of voters who have turned the page, he said Monday. A number of New Hampshire Republicans, former Rep. Charlie Bass among them, also have come out in favor of gay marriage, backed by Republican leaders elsewhere such as Ohio Sen. Rob Portman and former Vice President Dick Cheney. In New Hampshire, where independent voters are allowed to vote in GOP primaries, there is a sense that Christies move could actually help him in a prospective presidential bid. Ultimately, some strategists said its unlikely that Christies decision on gay marriage will be a make-or-break issue. Many critics of his gay marriage policy didnt like him to begin with, particularly since his embrace of President Barack Obama weeks before the last election after Superstorm Sandy ravaged much of the East Coast. He has fallen out of favor with social conservatives around Iowa. But it probably doesnt change anything, said Darryl Kearney, GOP treasurer in Polk County and a devout social conservative. A big win in his re-election bid will help him make him a strong national candidate, which will have a strong appeal in Iowa, but not with social conservatives. ", "Date": "20131023", "Author": "[STEVE PEOPLES, THOMAS BEAUMONT]", "Link": "http://www.seattletimes.com/seattle-news/politics/nj-gov-chris-christies-gay-marriage-decision-looms-over-his-political-future/", "Title": "[NJ Gov. Chris Christies gay marriage decision looms over his political future]"}