{"Content": "[ Generals have marked their operations by putting pins on wall maps of the world. I could do the same for friends and neighbors who have just gotten back from some place and are about to leave for another. They often move in battalions meeting friends or family  who themselves have traveled great distances  in some center of cultural/culinary/scenic excellence. A few appear to spend fewer nights in their gracious homes than in airport hotels, preparing for a pre-dawn flight out. There may be no place like home, but elsewhere always seems preferable. Are we to believe that their travels are as fabulous as their Facebook posts suggest? Note the pictures showing them in some sublime Croatian village, never at overcrowded Gate 42B. The dreaded FOMO  fear of missing out  may contribute to this perpetual need to venture far. Oxford Dictionaries defines FOMO as anxiety that an exciting or interesting event may currently be happening elsewhere, often aroused by posts seen on a social media website. The mania for making bucket lists further inflames this angst. The book 1,000 Places to See Before You Die is the mother of them all. When someone asks the author, Patricia Schultz, to cite her favorite trip, she responds, My next one. Given her mile-long list of destinations, one can well believe Schultzs contention, It is rare that I return to a place where I have already been. How about the quality of time spent traveling? Youve seen those 36 Hours in Madrid travel pieces listing four hot restaurants/bars, three markets and two museums in addition to the Prado. The reality is you and a million other tourists racing around the plazas to witness the relaxed Iberian culture enjoyed by old Spaniards who themselves never go anywhere. As for Italy, Schultz raves about the Piazza del Duomo in Parma, adding that one might want to visit the city during the Festival del Prosciutto. That would knock off two items in one day. These checklists often seem a commodification of cultural experience, Rebecca Mead wrote in The New Yorker. And how deep is the experience? Some of the great sites go almost unseen by tourists using them mainly as picturesque backgrounds for their selfies. I, too, have fallen into the FOMO trap at times, gulping rather than savoring travel. Why must the most valuable trips involve being far from home and spending a lot of money? Im trying to fight back, though. Ive made peace with the fact that I will never skydive in New Zealand, heli-ski in Zermatt or bungee jump in the Vanuatu archipelago. I wouldnt mind seeing Indias Golden Temple of Amritsar or Victoria Falls in Zambia/Zimbabwe. But if I die before that happens, then I guess I wont see them. Leisure and vacation used to be more or less used interchangeably. Now theyre very different. Nonworking days are often devoted to the labor of earning more badges to place on the ledger of life. Promoting frenetic travel has become a way to profit off Americans sense of inadequacy. Note how few lists include simple, free things, such as observing a years worth of full moons  or identifying the trees on your street. About dying. The greatest regrets of dying people, according to a famous list, focus on personal ties  for example, neglecting old friends. One, importantly, is wishing they hadnt lived the life others expected of them. As far as we know, none of the interviewees cited not having rafted the Mangoky River in Madagascar or missing out on the fire dance festival in Bhutans Bumthang District. Not that they might not have been interesting.]", "Date": "20150905", "Author": "[NULL]", "Link": "http://www.seattletimes.com/opinion/why-dont-we-try-staying-home/", "Title": "[Why dont we try staying home?]"}