{"Content": "[ WASHINGTON  , Social Security turns 80 on Friday, and the massive retirement and disability program is showing its age. Social Securitys disability fund is projected to run dry next year. The retirement fund has enough money to pay full benefits until 2035. But once the fund is depleted, the shortfalls are projected to be enormous. The stakes are huge: Nearly 60million retirees, disabled workers, spouses and children get monthly Social Security payments, and that number is projected to grow to 90 million over the next two decades. And the timing is bad: Social Security faces these problems as fewer employers are offering traditional pensions, forcing older workers to think hard about how they will afford retirement. This is a program thats been immensely popular since it began, said Nancy LeaMond, executive vice president of AARP. Increasingly, people recognize that saving for retirement is becoming harder and harder, and Social Security is becoming even more important. President Franklin Delano Roosevelt signed the Social Security Act on Aug. 14, 1935. Here are things to know about the federal governments largest program on its 80th birthday:, Social Securitys long-term financial problems are largely a result of demographic changes. Every day, about 10,000 people in the U.S. turn 65. These are the baby boomers. Typical boomers, however, didnt have as many children as their parents did. As a result, relatively fewer workers are left to pay the payroll taxes that support Social Security. In 1960, there were more than five workers for every person receiving Social Security. Today there are fewer than three. In 20 years, there will be about two workers for every person getting benefits. Americans are also living longer. In 1940, someone who was 65 could be expected to live about 14 more years, on average. Today, they can expect to live an additional 20 years, on average. Last year, Social Security paid benefits of nearly $850 billion  about a quarter of all federal spending. The average monthly payment is $1,221. That comes to about $14,700 a year. For most retirees, Social Security accounts for most of their income, according to the Social Security Administration. The trust fund that supports Social Securitys disability program is projected to run dry in late 2016  right in the middle of the presidential election. If Congress allows that to happen, it will trigger an automatic 19 percent cut in benefits to the 11 million people who receive Social Security disability. Lawmakers could redirect tax revenue from Social Securitys much bigger retirement program, as they have done in the past. If the tax revenue were redirected, the retirement fund would lose one year of solvency, so both the retirement program and the disability program would have enough money to pay full benefits until 2034. At that point, Social Security would collect enough in taxes to pay 79 percent of benefits. Republicans are balking at the fix. They see the funding crisis as an opportunity to improve a disability program that they believe is plagued by waste and abuse. Social Security retirement funds have been raided far too many times for far too many years, said Rep. Tom Reed, R-N.Y. Social Security uses a 75-year window to forecast its finances, so the projections cover the life expectancy of every worker paying into the system. Over the next 75 years, Social Security is projected to pay out $159 trillion more in benefits than it will collect in taxes, according to agency data. Thats not a typo. Adjusted for inflation, the shortfall comes to $35.3 trillion in 2015 dollars. Thats nearly twice the national debt, which took the entire federal government 239 years to accumulate. Yes. For much of the past three decades, Social Security produced big surpluses, collecting more in taxes than it paid in benefits. Social Security invested those surpluses in special U.S. Treasury bonds, which are backed by the full faith and credit of the U.S. government. They are now valued at $2.8trillion. But as Social Security was generating surpluses, the rest of the federal government was running deficits, for all but a few years around the turn of the century. To finance deficit spending, the Treasury borrowed from the public and from other federal programs, including Social Security. Yes. Social Security was on the brink of insolvency in the early 1980s when Congress and President Reagan agreed to gradually increase payroll taxes and to reduce benefits, in part by gradually raising the retirement age. Those changes didnt permanently fix Social Security, but they provided enough revenue to pay full benefits for about 50 years. In todays political climate, another feat like that would be historic.]", "Date": "20150813", "Author": "[STEPHEN OHLEMACHER]", "Link": "http://www.seattletimes.com/nation-world/time-for-an-overhaul-social-security-shows-its-age-at-80/", "Title": "[Time for an overhaul? Social Security shows its age at 80]"}