{"Content": "[ Port of Seattle Commissioner Bill Bryant launched a bid for governor Thursday, becoming the first significant Republican challenger to Democratic Gov. Jay Inslee in 2016. Bryant made his announcement in a video on his campaign website, saying hes running to improve education, create solid family-wage jobs and avoid putting any more tax burden on middle-class families. His ambitions for higher office come amid a major controversy at his current job  the legal and political fight over Shell oil rigs docking along Seattles waterfront in preparation for drilling off Alaskas North Slope. This week, Bryant was the only port commissioner to vote against asking Shell to delay the arrival of its vessels. Even as Bryants campaign went live, the Polar Pioneer, the first of those oil rigs, arrived in Elliott Bay on Thursday afternoon, greeted by protesters in kayaks. Despite approval by the Obama administration of the Arctic drilling, environmentalists argue Seattle should not be complicit in oil extraction that will worsen global climate change. They have hotly opposed the ports Terminal lease with Foss Maritime, Shells contractor. Bryant avoided the controversy in his announcement video, which featured him standing in a green field in Lewis County. Over soothing music and scenes of pristine landscapes, Bryant recalled growing up near Hood Canal, and said it is on my bucket list to make sure that when I go, Puget Sound is healthier than when I was born. But Bryants support of the Shell deal has angered environmental groups, including Washington Conservation Voters (WCV), which endorsed his 2011 re-election campaign. Shannon Murphy, WCVs president, slammed the ironic timing of Bryants announcement, and mocked his talk of caring for Puget Sound. His actions today show thats just rhetoric for him, she said. WCV is a major ally of the Democratic Party and spent heavily to elect Inslee in 2012. Alex Hays, a spokesman for the Bryant campaign, called the Shell fight entirely symbolic and defended the ports environmental record. We reject this false choice between the environment and jobs, he said. A port commissioner since 2008, Bryant is also chairman of Bryant Christie, a firm he founded in 1992 that helps companies market and sell products overseas. On his website, he boasted of working to cut port carbon emissions and on the recently announced alliance between the ports of Seattle and Tacoma. Bryant, 54, who lives in Seattle, did not make himself available for interviews Thursday. He has been mulling a bid for higher office for years and has been traveling the state extensively to raise his profile. More than two dozen state House Republican lawmakers signed a letter this week urging Bryant to run. The letter criticized Inslee for a hyperpartisan, divisive style and said Bryant would bring unifying, pragmatic leadership to the state capitol. As a relatively obscure elected official, Bryants first obstacle will be introducing himself to potential supporters. Hes positioning himself as a political moderate, citing former President Theodore Roosevelt, famously a conservationist, as his hero. In a statement, Jamal Raad, spokesman for the state Democratic Party, criticized Bryants past donations to deeply conservative Republicans including former President George W. Bush. Working Washington, a labor-backed group, also hit Bryant for opposing its efforts to raise pay for workers at Seattle-Tacoma International Airport. Other Republicans are likely to join the 2016 fray in the coming months. GOP insiders have pointed to state Sens. Andy Hill, R-Redmond, and Steve Litzow, R-Mercer Island, as potential contenders, along with Republican Congressman Dave Reichert. Along with Bryant, those potential rivals are scheduled to speak this weekend at the annual conference of the Mainstream Republicans of Washington in Leavenworth, Chelan County. But the path to winning back the governors mansion will be tough for any Republican. With populous King County growing into a solidly Democratic stronghold, the GOP has lost eight straight gubernatorial races going back to 1984  the longest such losing streak in the nation for the party. Bryants announcement downplayed his Republican affiliation, which was listed only as small-type R at the bottom of his campaign website. In his video, he said the campaign shouldnt be about Republicans versus Democrats. My agenda isnt ideological. Its not partisan, Bryant said.]", "Date": "20150514", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/port-commissioner-bill-bryant-announces-run-for-governor/", "Title": "[Port Commissioner Bill Bryant announces run for governor]"}