{"Content": "[ WASHINGTON (AP)  It took Ted Cruz three months to raise $10 million for his campaign for president, a springtime sprint of $1,000-per-plate dinners, hundreds of handshakes and a stream of emails asking supporters to chip in a few bucks. One check, from one donor, topped those results. New York hedge fund magnate Robert Mercers $11 million gift to a group backing the Texas Republicans White House bid put him atop a tiny group of millionaires and billionaires whose contributions already dwarf those made by the tens of thousands of people who have given to their favorite presidential candidate. An Associated Press analysis of fundraising reports filed with federal regulators through Friday found that nearly 60 donations of a million dollars or more accounted for about a third of the more than $380 million brought in so far for the 2016 presidential election. Donors who gave at least $100,000 account for about half of all donations so far to candidates presidential committees and the super PACs that support them. The review covered contributions to outside groups that can accept checks of any size, known as super PACs, and to the formal campaigns, which are limited to accepting no more than $2,700 per donor. The tally includes donations from individuals, corporations and other organizations reflected in data filed with the Federal Election Commission as of Friday, the deadline for super PACs to report for the first six months of the year. That concentration of money from a small group of wealthy donors builds on a trend that began in 2012, the first presidential contest after a series of court rulings and regulatory steps that created the super PAC. They can openly support candidates but may not directly coordinate their actions with their campaigns. We have never seen an election like this, in which the wealthiest people in America are dominating the financing of the presidential election and as a consequence are creating enormous debts and obligations from the candidates who are receiving this financial support, said Fred Wertheimer, president of Democracy 21, a Washington-based group that wants to limit money in politics. Others see an upside to the rainmakers. Big money gives us more competitive elections by helping many more candidates spread their message, said David Keating, director of the Center for Competitive Politics, which advocates for fewer campaign finance limits. For any number of reasons, these donors are willing to give so generously. Some may have a business that stands to gain from an executive branch that changes how an industry is regulated, while others hope for plum administration assignments, such as a diplomatic post overseas or a cabinet position. Many say their contributions, which the U.S. Supreme Court has recognized as equivalent to free speech, merely reflect their intense belief in a particular candidate  and in the political system in general. Id think that the fact that Im willing to spend money in the public square rather than buying myself a toy would be considered a good thing, said Scott Banister, a Silicon Valley investor who gave $1.2 million to a super PAC helping Kentucky Sen. Rand Paul in the Republican presidential race. The voters still, at the end of the day, make the decision, he said. You can spend $1 billion trying to tell the voters to vote for a set of ideas they dont like, and they will still vote against the candidate. For Florida developer Al Hoffman, financial support of the states former governor, Jeb Bush, is personal. A longtime friend and political contributor to the Bush family, he gave $1 million to Bushs super PAC, contributing to its record-setting haul of $103 million in the first six months of the year. Hoffman was ambassador to Portugal during former President George W. Bushs second term. He said he sometimes offered Bush advice during his time as Floridas governor, but doesnt expect to influence a Jeb Bush administration. Id just like to see one, he said. While the existence of high-dollar donors is more pronounced on the Republican side, theyre also among those giving to the super PAC backing Democratic front-runner Hillary Rodham Clinton. Seven donors of at least a million dollars accounted for almost half of the total collected by Priorities USA Action. Entertainment mogul Haim Saban and his wife, Cheryl, led with a $2 million gift, and hedge-fund billionaire George Soros, historically one of the Democratic Partys biggest givers, donated $1 million. But no one has capitalized on the new era of big money like Bush. After announcing plans to explore a presidential run in December, Bush embarked on a nearly seven-day-a-week travel schedule to raise money for his Right to Rise super PAC. Bush navigated limits on how candidates can raise money for super PACs by playing coy about his intentions. Now that he is officially a candidate, he has left Right to Rise in the hands of his trusted strategist and friend, Mike Murphy. Hes not alone in the use of super PACs to fuel a presidential run. New Jersey Gov. Chris Christie and Wisconsin Gov. Scott Walker are too new to the presidential contest, announcing only weeks ago, to have filed any reports about their campaigns finances. Yet super PACs that sprang up months ago to support them show their efforts will be financially viable: A group backing Christie raised $11 million, while two supporting Walker brought in $26 million. Such totals put them well ahead of Paul, former technology executive Carly Fiorina, former Arkansas Gov. Mike Huckabee and former Sen. Rick Santorum  who all began their presidential campaigns in the spring. Cruzs super PACs, meanwhile, didnt just get the $11 million from Mercer. They also received a $10 million donation from Toby Neugebauer, an energy investor in Texas, while the Texas-based Wilks family pooled together a $15 million gift. Super PACs will spend as campaigns do, investing in polling and data sets, hiring employees in key states and buying pricey television and digital advertising, direct mailings and phone calls to voters. Their money will be important in early primary states, but also would allow those with deep-pocket backers to campaign beyond Iowa and New Hampshire. There are a handful of billionaires that are making viable individuals whose campaigns never would have gotten off the ground, said Paul S. Ryan, senior counsel at the Campaign Legal Center, which wants to tighten limits on money in politics. Some of these candidates will go much deeper into the primaries than they otherwise could, thanks only to this kind of money. ", "Date": "20150803", "Author": "[Julie Bykowicz, JACK GILLUM]", "Link": "http://www.seattletimes.com/nation-world/nearly-60-donors-give-one-third-of-all-2016-campaign-cash/", "Title": "[Nearly 60 donors give one-third of all 2016 campaign cash]"}