{"Content": "[ Lingering resentment over big Boeing tax breaks led to a snub for Gov. Jay Inslee from a key Democratic Party ally this week, as union leaders canceled the governors scheduled speech at a major labor gathering. Inslee had been set to headline the Washington State Labor Councils annual convention Thursday in SeaTac. But the governors name vanished from the schedule late last week amid discord over his planned appearance. Jeffrey Johnson, president of the Labor Council, said he disinvited Inslee after discussions among Labor Council members. I have enormous respect for the governor and the things hes trying to do, Johnson said Monday. He praised Inslees work on transportation, climate change and support of public employees and the common good. But, Johnson said, tensions persist over Inslees role in securing Boeings record-setting $8.7 billion tax break and his pressure on the Machinists union to vote on a contract that ended workers defined-benefit pension plan.  Feelings are pretty raw with a lot of our members, a lot of our unions, Johnson said. The resentment goes beyond just Boeing-affiliated unions, he added. Adding to the pique is Inslees refusal to endorse a push by unions to tie continuation of the Boeing tax breaks to wage and jobs targets. David Postman, an Inslee spokesman, said in an email the governor has a lot of respect for the Labor Council and works with them on many issues. There is disagreement on this one. But there is also a mutual commitment to keep talking about it, and we welcome that conversation, Postman said. Larry Brown, legislative director for Aerospace Machinists 751, said hed been unaware that Inslee was invited to speak at the convention until the governor showed up on the schedule. There then was a discussion on how the speech would be greeted, he said. But Brown said his union didnt seek to have the speech canceled. Representatives of Boeings white-collar union, the Society of Professional Engineering Employees in Aerospace (SPEEA), declined to comment, as did Boeing. While governors dont speak every year at the Labor Council convention, the cancellation of a sitting Democratic governors planned appearance is unusual. The snub comes despite Inslee coming through on some big labor priorities during the recently concluded legislative session, including funding for the first cost-of-living increases for state employees and teachers since 2008. Unions backed Inslee heavily during his run for governor in 2012 against Republican Rob McKenna. They donated more than $5.2 million that year to Inslees campaign, the state Democratic Party and a political-action committee backing Inslee, according to the state Public Disclosure Commission and the National Institute on Money in State Politics. But Inslee faced a crisis not long after taking office, with Boeing pitting the state against others in a competition to manufacture the new 777X. During a 2013 special session, lawmakers approved $8.7 billion in aerospace tax breaks over 16 years  the largest state tax break ever awarded. That helped secure the airplane work for Everett. Machinist union leaders backed the tax breaks and jobs theyd bring. But they soured on Inslee after he urged Machinists to vote in 2014 on a new contract that ended their traditional pensions.  And theyve been frustrated at Boeings continuing to move engineering and other jobs out of state, while some aerospace-industry jobs that remain here dont pay well. Some Democrats have sought to tie continuation of the aerospace tax breaks to guaranteed job and pay targets. But two bills to make those changes  opposed by the aerospace industry  failed to gain traction in the Legislature this year. Inslee has declined to endorse those efforts.  Were still not satisfied with his position, Johnson said. We would like him to be more clear about supporting accountability in these tax measures. Postman said Inslee shares frustrations of those upset that Boeing has transferred jobs out of state after the 777X tax-break package. But the governor doesnt want to jeopardize the growth were already seeing with the 777X program. Notwithstanding Inslees absence, the Labor Council convention, which runs Thursday to Saturday, will include talks by other prominent Democrats, including Attorney General Bob Ferguson and King County Executive Dow Constantine. Seattles socialist Seattle City Councilmember Kshama Sawant also is slated to speak. AFL-CIO Executive Vice President Tefere Gebre also is speaking at the convention, which is themed Fighting Inequality and will feature panel discussions on taxes, the environment and immigration reform. Johnson said the events this week dont mean Inslee wont be welcomed at future union conventions. For example, in May, the Labor Council will meet to talk about endorsements for the 2016 elections. He wont be speaking at this (convention), but were going to continue our discussion to put a little more accountability into these tax incentives, Johnson said. Its time to revisit the issue.]", "Date": "20150720", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/labor-group-disinvites-inslee-over-boeing-tensions/", "Title": "[Labor group disinvites Inslee over Boeing tensions]"}