{"Content": "[ This falls election will bring at least one new face to the Port of Seattle commission, with Bill Bryant stepping down after eight years on the commission to run for governor in 2016. And Tuesdays initial primary-election returns show a close contest for Bryants Position 5 seat, which drew nine candidates. Marine environmental consultant Fred Felleman came in with 22 percent and former Normandy Park City Council member Marion Yoshino drew 19 percent. Perennial candidate Richard Pope is in a close third with 16 percent. Darrell Bryan  10.8 %, Ken Rogers  12 %, Herb Krohn  8.1 %, Fred Felleman  21.7 %, Norman Sigler  7 %, Marion Yoshino  18.8 %, Mark Hennon  2.9 %, Daniel Reandeau  2.1 %, Richard Pope  16.3 %, , Courtney Gregoire  82.2 %, Goodspaceguy  9.3 %, John Naubert  7.9 %, Former airline pilot Ken Rogers and former Clipper Navigation CEO Darrell Bryan, who led the field in fundraising with $103,000 in contributions, polled 12 and 11 percent, respectively. As expected, Commissioner Courtney Gregoire will advance to the November ballot for Position 2, receiving 82 percent in first-day returns. She will face either perennial candidate Goodspaceguy, with 9 percent, or John Naubert, with 8 percent. It has been six years since an open seat was up for grabs at the Port of Seattle and in the last few elections, incumbents have had few challengers. After the year the Port has had, it is no wonder this years primaries drew so many candidates for just one seat. The Seaport Alliance with the Port of Tacoma was first announced in October and finalized Tuesday; labor negotiations between the International Longshore and Warehouse Union and its employers hit a snag during a prime shipping season for Washington agriculture, and in January the Port announced Terminal5 would be the new home port for Shells Arctic drilling fleet, which drew criticism from the mayor and the environmental community. The Port of Seattle, governed by five commissioners, operates one of the states busiest seaports, Seattle-Tacoma International Airport, two cruise terminals, and marinas, including Fishermens Terminal. As part of its primary mission, the Port serves as an economic-development agency, generating family-wage jobs and economic growth in King County. As of Tuesday, Felleman has raised about $38,500 and received the endorsement of The Stranger because he is the only candidate with good, specific ideas on how to clean up Port pollution, as well as from Seattle City Councilmember Mike OBrien. Felleman has worked with the Port in the past and ran on a campaign of bringing transparency, accountability and ecological integrity to the agency. Both Felleman and Yoshino, who raised only $10,000, have been critical of the lack of transparency behind the Ports lease with Foss Maritime to host Shells Arctic drilling fleet. Click here to see the latest vote counts from all King County races, As a former Normandy Park City Council member and economic-development manager for Des Moines, Yoshino said she is dedicated to bolstering the economy.]", "Date": "20150804", "Author": "[Coral Garnick]", "Link": "http://www.seattletimes.com/seattle-news/politics/port-of-seattle-commission-election-results-2015/", "Title": "[Its a tight race for top 2 candidates for Port Commissions Position 5]"}