{"Content": "[ WASHINGTON (AP)  Republicans lost Mondays Senate showdown over halting federal aid to Planned Parenthood. Yet the political offensive by abortion foes has just started, prompted by a batch of unsettling videos that has focused attention on the groups little-noticed practice of providing fetal tissue to researchers. Conservatives have long targeted Planned Parenthood, which provides health services, family planning and abortions in clinics across the country. The furtively recorded videos, with hair-raising close-ups of aborted fetal organs and Planned Parenthood officials dispassionately describing how Im not going to crush that part, have forced the group and its Democratic champions into a defensive crouch. Five things to know:, THE BATTLEGROUND, Citing statements in the videos by Planned Parenthood officials, opponents including the Center for Medical Progress, which recorded the videos, accuse the group of profiting from selling fetal organs. That would violate a federal criminal statute that lets providers recover only their expenses. They also say Planned Parenthood is altering abortion procedures to better recover usable tissue. Conservatives view the videos as a huge political opportunity to galvanize support for banning abortions and, some hope, prohibiting fetal tissue research. But the issue is cutting both ways, with both sides using it for fundraising solicitations. Planned Parenthood has apologized for comments in the video but says it has broken no laws. It accuses opponents of using selectively edited videos for their latest assault on abortion and womens health choices. The group also says it is among many organizations assisting fetal tissue research, a decades-old field scientists use to study Alzheimers and other diseases. ", "Date": "20150803", "Author": "[ALAN FRAM]", "Link": "http://www.seattletimes.com/nation-world/5-things-to-know-about-the-fight-over-planned-parenthood/", "Title": "[5 things to know about the fight over Planned Parenthood]"}