{"Content": "[ TAIPEI, Taiwan (AP)  Taiwanese President Ma Ying-jeou proposed a plan Tuesday to ease tensions in a vast, resource-rich Asian ocean where China has chafed against its neighbors by using landfill to expand islets to solidify its claims in the region. Mas plan calls for setting aside sovereignty disputes over the South China Sea and jointly exploring for resources. Taiwan has not been a high-profile player in the disputes in the South China Sea, although it uses roughly the same historical basis for its claim as China, and Mas initiative appeared aimed at shoring up foreign policy credentials at home. We emphasize that whereas sovereignty cant be divided, resources can be shared, Ma said in a speech Tuesday at an Asia-Pacific research forum in Taipei. Chinese Foreign Ministry spokeswoman Hua Chunying said Beijing has noted Mas proposal, but offered no opinion as to its feasibility. We believe that Chinese people across the strait are obliged to together maintain Chinas territorial integrity and maritime rights, and the peace and stability in the South China Sea, Hua told a regular briefing. Taiwan, China, Brunei, Malaysia, Vietnam and the Philippines claim all or parts of the 3.5 million-square kilometer (1.4 million-square mile) South China Sea. The ocean ranges from Taiwans southern tip southwest to Singapore. In recent months China has made other claimants and their common ally the United States bristle by using landfill to form new islands, a way to extend its reach. The tropical sea is rich in oil, natural gas and fisheries and is crossed by major shipping routes. In a sign of recent tensions, Beijing filed a formal complaint with the United States this week after an American military plane flew over one islet, and Japan pledged to help Vietnam and the Philippines with defense as Chinas presence grows. Taiwans initiative calls on all parties concerned to uphold the freedom and safety of navigation and overflight and avoid unilateral action that would escalate tension, according to a statement from the foreign ministry. It also suggests regional cooperation in developing the regions resources. Other South China Sea claimants are unlikely to react openly to Taiwans initiative as they lack diplomatic relations with Mas government. China claims sovereignty over Taiwan and uses its economic clout to bar other nations from exchanges that cast Taiwan as a nation. Ma did not discuss Tuesday the basis for Taiwans maritime claim or that of other governments. The United States wants the sea to remain open to shipping and flights, while Beijing has said Washington wants to keep a presence there to contain Chinese maritime expansion. Taiwan is eager to get along with the United States as its staunchest informal ally. Mas initiative is not enough for China and its not enough for the United States, so you just end up not meeting everyones expectations, said Lai I-chung, vice president of Taiwan Think Tank. The peace plan may also be calculated to bolster Taiwans ruling Nationalist Party ahead of a January 2016 presidential election as the chief opposition candidate develops a competing plan for the South China Sea, said Joanna Lei, chief executive officer of the Chunghua 21st Century Think Tank in Taiwan. Ma has been criticized at home for lack of foreign policy achievements. In 2012, Ma proposed a peace initiative for settling disputes in the East China Sea, parts of which are claimed by his government as well as China and Japan.]", "Date": "20150526", "Author": "[RALPH JENNINGS]", "Link": "http://www.seattletimes.com/nation-world/taiwan-proposes-plan-to-ease-south-china-sea-tensions/", "Title": "[Taiwan proposes plan to ease South China Sea tensions]"}