{"Content": "[ In a possible preview of a 2016 presidential race, former Florida governor Jeb Bush took a swipe at Hillary Clinton on Wednesday evening as he stumped for Republican candidates in the vital swing state of Colorado. Bush was in Colorado one day after former President Bill Clinton departed the state and a little more than a week after Hillary Clinton was last there  an indication of both the intensity of the states top race pitting Democratic Sen Mark Udall against his Republican challenger, Rep. Cory Gardner, as well as Colorados oversized role in recent presidential elections. During a rally for the Republican ticket at a county fairground in this conservative Denver suburb, Bush, without mentioning her name, alluded to comments Hillary Clinton made while stumping for Democrats on Friday. This last week I saw something that was breathtaking, a candidate  a former secretary of state who was campaigning in Massachusetts  where she said that dont let them tell you that businesses create jobs. Bush paused as the audience booed. Well the problem in America today is that not enough jobs are being created, (but) they are created by business, Bush continued. Clinton said the statement was a slip of the tongue, but Republicans eager to tarnish her image before a 2016 campaign have used it to mock her all week. Bush, a former Florida governor and a brother of former President George W. Bush, is one of many Republicans mulling a 2016 run. Another expected 2016 Republican contender, New Jersey Gov. Chris Christie, will campaign with Gardner and the GOPs gubernatorial candidate in Colorado, former Rep. Bob Beauprez, on Thursday. Bush is fluent in Spanish and seen by many Republicans as his partys best candidate to reach out to the fast-growing Hispanic population, which is trending Democratic. Earlier Wednesday, he appeared with Gardner and Beauprez at Denvers Hispanic Chamber of Commerce, where he took questions from Spanish-language media about immigration. The former Florida governor warned against President Barack Obamas expected executive action to limit deportations, promised for some time shortly after the election. Instead, Bush said Congress needs to pass a bill and that a newly Republican Congress would solve the nations immigration woes  although the Republican-controlled House refused to vote on a major immigration bill this year. The constitution requires Congress to pass laws, not the president, Bush said in Spanish, contrasting that with some Latin American strongmens ability to implement laws by fiat. If Obama acts unilaterally on immigration, Bush warned, it will be harder to do it the appropriate way.]", "Date": "20141030", "Author": "[NICHOLAS RICCARDI]", "Link": "http://www.seattletimes.com/nation-world/jeb-bush-swipes-at-hillary-clinton-in-colorado/", "Title": "[Jeb Bush swipes at Hillary Clinton in Colorado]"}