{"Content": "[ Republicans called it a win for religious freedom. The decision of the Supreme Court, they said, is further evidence the countrys new health care law is deeply flawed. The claims of victory arrived almost immediately after the high court ruled Monday that some companies need not provide contraception to women as required by President Barack Obamas signature domestic policy achievement. Yet theres a risk for the GOP in crowing too loudly. Republicans for years have tried to make inroads with two groups that tend to favor Democrats: women and younger voters. And as popular as the courts decision will be with the Republican base, its likely to be just as unpopular this year and into 2016 with those who depend on insurance to pay for birth control  a group that includes women and younger voters. The thought of your boss telling you what kind of birth control you can and cant get is offensive and it certainly is motivating to women to vote, said Cecile Richards, president of Planned Parenthood Action Fund, which plans to spend several million dollars this year to campaign for Senate candidates. The Supreme Court ruled 5-4 that some companies can hold religious objections allowing them to opt out of health laws birth control coverage requirement. While the ruling does not address the heart of the Affordable Care Act, its a setback for Democrats and amplifies a longstanding argument from conservatives that the law they call Obamacare intrudes on religious liberties as part of a larger government overreach. This is a clear and decisive defeat against Obamacare and a victory for the rights of all Americans, Republican National Committee Chairman Reince Priebus said in a fundraising appeal distributed less than three hours after the Supreme Court ruling. But Republican leaders such as Priebus were careful to avoid mentioning the impact on women and their reproductive rights, underscoring the delicate balance the GOP must strike as it works to improve its image among women. The party is still recovering from a series of insensitive comments made by GOP candidates in the 2012 election, including Missouri U.S. Senate candidate Todd Akin, whose campaign crumbled after he said womens bodies were able to avoid pregnancy in cases of legitimate rape. Republicans have to be careful about not appearing as though theyre anti-contraception. This is a constitutional issue, said Katie Packer Gage, a GOP strategist whose firm advises Republicans on navigating womens issues. We have to be very, very cautious as a party. Polls suggest that most people  and a larger majority of women  think for-profit companies should be required to cover the cost of birth control. A Gallup survey conducted in May found that 90 percent of Americans, including 88 percent of Republicans, see the use of birth control as morally acceptable. Democrats said the ruling would shine a spotlight on access to birth control and dovetail with a strategy by the party to mobilize female voters on issues such as raising the minimum wage and supporting pay equity for women. In Colorado, for example, Democratic Sen. Mark Udalls first TV ad noted Republican Rep. Cory Gardners past sponsorship of a bill to outlaw abortions in cases of rape and incest and support for an effort to grant an embryo the same legal rights as a person, which could have outlawed some types of birth control and all abortions. Gardner now says he opposes the personhood measure. In Iowa, Democrats have signaled plans to highlight Republican Joni Ernsts support of a personhood amendment to the states constitution. In Michigan, Democrats backing Senate candidate Gary Peters have sought to tarnish Republican Terri Lynn Lands record on reproductive rights, prompting her to air her own ad in April declaring, As a woman, I might know a little bit more about women than Gary Peters. It wont be clear until November whether women will respond to such appeals. Fewer young women typically vote in midterm elections compared with presidential years. And they are particularly disengaged from this years races: 63 percent of women under age 30 in an AP-GfK poll conducted before the ruling reported they dont care very much which party wins control of Congress. Just 21 percent said they were certain to vote in November. Writing for the courts conservative majority, Justice Samuel Alito suggested the White House could resolve the issue by broadening a birth control compromise it created earlier for religion-oriented nonprofits. In those cases a third party  usually an insurer  can cover contraceptives at no charge to the affected employees, and the government absorbs the cost. But White House spokesman Josh Earnest signaled the administration may not take that route. Instead, he challenged Congress to pass legislation to address the coverage gap for women. That could put some Republicans in a difficult spot politically, but not right away. For now, theyre enjoying what many viewed as a win. When Obamacare and its impact on people is front and center in the political debate, its just not good news for Democrats, Republican strategist Kevin Madden said. ", "Date": "20140701", "Author": "[KEN THOMAS, STEVE PEOPLES]", "Link": "http://www.seattletimes.com/nation-world/birth-control-ruling-sparks-political-clash/", "Title": "[Birth control ruling sparks political clash]"}