{"Content": "[ WASHINGTON (AP)  President Barack Obama says his executive actions blocking the deportation of millions living illegally in the U.S. go as far as the law allows. But Hillary Rodham Clinton says that if she becomes president, she would go even further. Clintons aggressive stance reinvigorates the debate over the scope of presidential powers, which has become a flashpoint in Washingtons politically fraught immigration fight. It also raises questions about the legality of Clintons proposals and sets up a potential conflict between the Democratic front-runner and the Obama White House. The president unveiled executive measures last fall that spare up to 5 million people, mostly parents and the young, from deportation. The administration also set new enforcement priorities that could make it easier for many more people in the U.S. illegally to stay in the country. Weve expanded my authorities under executive action and prosecutorial discretion as far as we can legally under the existing statute, the existing law, Obama said earlier this year. The presidents actions are largely on hold amid a court challenge filed by Texas and 25 other states. The states say Obamas action would force local governments to invest more in law enforcement, health care and education. Clinton, speaking to young immigrants in Nevada on Tuesday, vowed to protect Obamas actions, which could also be voided by future presidents. In a surprise to many supporters, Clinton added that she would move unilaterally to let even more people stay in the country if Congress didnt act on broad legislation. I would do everything possible under the law to go even further, Clinton said. She specifically raised the prospect of stemming deportations for parents of dreamers  those who were brought to the country illegally as children. They were not covered under Obamas executive actions. Obamas measures marked the most sweeping changes to the nations immigration system in nearly three decades and followed a fruitless six-year bid to get Congress to act on sweeping legislation. The status of the nations fractured immigration laws has become a top issue in recent presidential campaigns, in part because of the growing power of Hispanic voters. More than 70 percent of Hispanic voters backed Obama in the 2012 election. Clintons focus on immigration early in her campaign underscores her desire to maintain that advantage over Republican rivals, all of whom oppose Obamas use of presidential powers to block deportations. By supporting Barack Obamas lawless executive action, Hillary Clinton once again believes shes above the law, Wisconsin Gov. Scott Walker said on Twitter. In 2012, Obama took unilateral action to allow some young people who were brought to the U.S. illegally as children to stay in the country. He lifted some restrictions on that provision as part of last years executive actions. The new measures also allowed immigrants who have been in the U.S. illegally for more than five years but whose children are citizens or lawful permanent residents to stay in the country and get work permits after passing background checks and paying fees. White House and Homeland Security officials did consider extending those same protections to the parents of dreamers, the group Clinton cited in Nevada. However, officials said they determined Obama did not have the authority to take that step. On Wednesday, White House spokesman Josh Earnest said the president stands by his assertion that he has taken all action within his legal authority. Asked whether that meant Clinton was veering into questionable legal territory, Earnest said, That would be something for future presidents and future courts to decide. However, Clinton campaign officials say there is a way to expand deportation protections to the parents of dreamers under current law. Officials say that rather than broadly making parents eligible for deportation protections, Clinton  or any other possible president  could strengthen the system for individuals applying for deferrals and provide more specific guidelines for who should be allowed to stay. The officials insisted on anonymity because they were not authorized to discuss details of the policy proposal publicly by name. Its unclear whether Obama ever considered the action Clinton is proposing. Administration officials noted that parents of dreamers can currently seek deportation deferrals on an ad hoc basis. Marshall Fitz, vice president for immigration policy at the Center for American Progress, said Clintons proposals would give the individual deferral process a lot more transparency and availability to the broader undocumented population. Fitz, whose organization has close ties to both Obama and Clinton, said reforming the system could also increase the likelihood that same-sex partners of citizens and small-business owners with employees could be spared deportation. ", "Date": "20150507", "Author": "[JULIE PACE]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/clinton-wades-into-debate-over-obamas-immigration-actions/", "Title": "[Clinton wades into debate over Obamas immigration actions]"}