{"Content": "[ Incoming Senate Majority Leader Mitch McConnell is promising the new Republican majority will quickly resurrect Keystone XL pipeline legislation killed by Democrats, potentially setting up an early 2015 veto confrontation with President Barack Obama. I look forward to the new Republican majority taking up and passing the Keystone jobs bill early in the new year, the Kentucky Republican said Tuesday, shortly after the bill fell one vote short of the 60 votes needed to advance. He was joined by incoming Senate Energy Committee Chairwoman Lisa Murkowski, R-Alaska, who said the fight wasnt over. The vote was a blow to Sen. Mary Landrieu, D-La. who had forced the issue onto the Senate agenda, and who faces difficult odds in a Dec. 6 runoff election against Republican Rep. Bill Cassidy. Im going to fight for the people of my state until the day that I leave, and I hope that will not be soon, she said. Republicans are likely to have enough votes to assure the bills passage in January, when they will have at least 53 seats  54 if Cassidy wins the Louisiana runoff. If you look at new Congress, you can count four more (GOP seats) right away, and there may be others, Sen. John Hoeven of North Dakota, the lead sponsor of the bill, said after the 59-41 vote Tuesday. You can see were well over 60. Hoeven acknowledged that Republicans would need 67 votes to override a veto, but said one possibility is to include Keystone in a larger energy package that may not prompt a veto threat. The vote was one of the last acts of this Senate controlled by the Democrats. It is expected to complete its work by mid-December. Cassidy, Landrieus Republican opponent, said Louisiana families need better jobs, better wages and better benefits, and the pipeline would provide them. Democratic divisions were on vivid display in a bill that pitted environmentalists against energy advocates. While Obama opposes the measure, likely 2016 presidential candidate Hillary Rodham Clinton has repeatedly refused to take a position. Most recently, her spokesman did not respond to two requests over the weekend to do so. The project would move oil from Canada into the United States and eventually to the Texas Gulf Coast. Supporters say it would create jobs and ease American dependence on Middle East oil. A government environmental impact statement also predicts that a pipeline would result in less damage to the climate than moving the same oil by rail. Critics argue that the drilling itself is environmentally harmful, and said much of the Canadian crude would be exported with little or no impact on Americas drive for energy stability. At the White House, press secretary Josh Earnest said the measure is something the president doesnt support because the president believes that this is something that should be determined through the State Department and the regular process that is in place to evaluate projects like this. After the vote, five people were handcuffed and led off by Capitol police outside the Senate chamber after breaking into loud yowls. One was wearing what appeared to be Native American beads and feathers in his hair. ", "Date": "20141119", "Author": "[DINA CAPPIELLO]", "Link": "http://www.seattletimes.com/nation-world/republicans-keystone-pipeline-down-but-not-out/", "Title": "[Republicans: Keystone pipeline down, but not out]"}