{"Content": "[ Our presidents are good at praising Americas magnificent national park system, but theyre lousy at maintaining it. Bill Clinton-the-candidate, for example, spoke of how lucky he was to have Hot Springs National Park as a childhood playground. Yet Clinton-the-president sat idle as that parks natural wonders and facilities deteriorated  and as the National Park Services maintenance backlog soared to $5 billion. Likewise, in his 2000 campaign, a khaki-clad George W. Bush posed in the majestic Cascade Range. He wailed that parks were at the breaking point and vowed to eliminate Clintons backlog. Instead, he slashed the Park Service budget (including a 40 percent cut in needed repair funds for the Cascade parklands hed used as a political prop). The maintenance backlog ballooned to nearly $9 billion under his presidency. Ranger George did make one fix, however  a PR fix. Bush operatives instructed park superintendents to make budget cuts in areas that wont cause public or political controversy. When discussing park deterioration, they were to avoid the phrase budget cutbacks and say instead that parks were undergoing service level adjustments. Under President Obama, who speaks movingly of a childhood Greyhound bus trip with his family to see some of our parks, another 12 percent has been chopped from the Park Service budget  bumping the deferred-maintenance bill to a staggering $11.5 billion. To his credit, Obama has proposed a 2016 Centennial Budget for the Park Service, mitigating years of destructive underfunding and calling for $1 billion to address the backlog. Good for him. But that still leaves a $10 billion shortfall, and the sour duo of Sen. Mitch McConnell and Speaker John Boehner will oppose even that increase for the maintenance of these invaluable public assets. Hidebound by their twisted corporate ideology, they dismiss public parks as government intrusion into the private realms of Disneyland and SeaWorld. So, while we Americans celebrate the 100th anniversary of our National Park Service, Washington, D.C. is literally stripping service out of the National Park Service. And, by refusing to fund essential upkeep year after year, Americas so-called leaders are guaranteeing that this invaluable national asset  deemed Americas best idea by novelist and historian Wallace Stegner  will fall into acute disrepair. The only solution, they say, is to commercialize, industrialize and privatize our parks, converting these jewels of the common good into just another corporate cash cow. The corporatization process started with co-branding agreements, rationalized by Park Service officials as aligning the economic and historical legacies of parks with advertisers. In other words, theyre selling the Park Services proud public brand  as well as its soul. First in line was Coca-Cola. In 2007, the multibillion-dollar colossus became a proud partner with the Park Service by donating a mere $2.5 million (tax-deductible, meaning we taxpayers subsidized the deal) to the Park Service fundraising arm. In return, not only did Coke get exclusive rights to use park logos in its ads, but it was allowed to veto a Park Service plan to ban sales of bottled water in the Grand Canyon National Park. Disposable plastic bottles are that parks biggest source of trash, but Coke owns Dasani, the top-selling water, so bye-bye ban. Public outrage forced officials to reverse this crass move, but the Park Services integrity has yet to recover. Then this April, the Park Service abandoned its longstanding policy of disallowing any links to alcohol or tobacco products when it entered a partnership with Anheuser-Busch after the company donated a $2.5 million tax-deductible gift. In turn, its Budweiser brand was given the Statue of Liberty. Not literally, but symbolically  Bud now has the right to plaster Lady Liberty, the iconic symbol of the United States, on its cans. Never mind that Anheuser-Busch is now Belgian-owned. The real hypocrisy is the claim that such co-branding is a philanthropic service to the commons. Creeping commercialization of our public parks no longer creeps; its running rampant, with brands such as Disney, L.L. Bean and Subaru buying their pieces of Park Service integrity. And get a whiff of this: Air Wick has also paid to become a Park Service partner, so its now marketing a new fragrance collection thats advertised as being uniquely inspired by Americas national parks.]", "Date": "20150731", "Author": "[Jim Hightower]", "Link": "http://www.seattletimes.com/opinion/sold-national-parks-go-to-the-highest-corporate-bidder/", "Title": "[Sold: National parks go to the highest corporate bidder]"}