{"Content": "[ After U.S. Sen. Marco Rubio of Florida insisted at the Republican presidential debate that rape and incest victims should carry pregnancies to term, aides to Hillary Rodham Clinton rushed to say that his unyielding stance would hurt Rubio with female voters. When Donald Trump chose Friday to stand by his slights against women during the debate, saying Fox News journalist Megyn Kelly behaved very badly as a moderator  and then promoting a Twitter message calling her a bimbo  the chairwoman of the New Hampshire Republican Party accused Trump of chauvinism. And in response to multiple male candidates saying they would shut down the federal government over financing for Planned Parenthood, the Democratic National Committee (DNC) emailed talking points to allies, saying that among the losers at the debate were American women, who were attacked at every turn. Republican Party leaders, whose presidential nominees have not won a majority of female voters since 1988, are setting their sights on making electoral gains among women in the 2016 presidential race and trying to close the gender gap in swing states such as Florida and Colorado. But the remarks and tone about women at Thursdays debate  and the sight of 10 male candidates owning the main stage debate  may have damaged the partys standing among female voters in the 2016 general election, according to pollsters and some Republican leaders. So much of the debate was all about appealing to male voters and other parts of the Republican base, rather than doing anything to help the partys general-election goal of trying to be more inclusive, said Lee Miringoff, director of the Marist College Institute for Public Opinion. In the short term, the political peril for the Republican candidates may not be so grave. They are largely focused now on winning over likely Republican voters who will decide the partys nomination, an electorate that tends to skew male and older in many key states. Recent polls of Republican voters indicate Trump is performing strongly among men and to a slightly lesser extent among women, though sizable numbers of women also say they would not support him. It remains an open question whether Trump offended his supporters, or many other likely primary voters, by refusing to renounce his past descriptions of women as fat pigs during the debate; indeed, pollsters say he may have struck a chord with some voters by saying he doesnt have time for political correctness when he was asked about his remarks. With the possibility that a woman could be the nominee of a major political party for the first time, Republicans are facing the likelihood of an even more complicated environment than they have had in recent presidential elections. Gallup polls show that female voters have been favoring the Democratic presidential nominees since the 1990s, often by increasingly large numbers. Several prominent Republican women said they were worried the candidates would only hurt themselves, and the party, if they did not change the substance and style of their remarks at future debates, which will be held monthly this fall and winter. Thursdays debate attracted an enormous audience of 24 million viewers; the next debate will be Sept.16, broadcast on CNN. Not one candidate attempted to persuade women voters, said Margaret Hoover, a Republican consultant and author. The GOP needs to fight for women votes because it believes our policies are better for women. On abortion, Rubio, former Florida Gov. Jeb Bush and Wisconsin Gov. Scott Walker gave no ground, unlike the remarks by some Republicans on other social issues such as same-sex marriage. Carly Fiorina, the only female Republican in the presidential race, who was relegated to an earlier debate Thursday because of her low poll numbers, was circumspect about whether she would have challenged Trump had she been onstage with him. When asked if she would have denounced his comments, she insisted that she had, but then proceeded to do so only in generic, gender-agnostic terms about civility in politics. As for Trump, as he made the rounds to the morning talk shows, he seemed to show some signs of, if not quite contrition, at least regret that people could be left with the impression that he said something offensive to women. I dont recognize those words, he said on the MSNBC program Morning Joe. Not that Im an angel, by the way. But I dont recognize those words. Any regret was fleeting. He also insisted his fat pigs disparagement of Rosie ODonnell was the biggest event in terms of sound, and in terms of combustion in the room. It was the biggest event of the evening.]", "Date": "20150807", "Author": "[Patrick Healy, JEREMY W. PETERS]", "Link": "http://www.seattletimes.com/nation-world/treatment-of-women-a-topic-after-gop-presidential-debate/", "Title": "[Treatment of women a topic after GOP presidential debate]"}