{"Content": "[ In a vast banquet room at a DoubleTree Suites in Tukwila, former Somali Prime Minister Abdiweli Sheikh Ahmed Mohamed made his way down the aisle. The crowd of several hundred  men in dark jackets on one side, women in brightly colored headscarves on the other  had been waiting for hours. As their ancestral national anthem began to play, they leapt to their feet, singing along, clapping and waving little Somali flags bearing a white star on a background of sky blue. In the crowd was Abdulkadir Jangeli Aden Mohamud, who had greeted the former prime minister at the airport and had him to his Renton home the next morning for breakfast. They had nothing less than the future of Somalia to discuss, and Mohamud, once head of Somalias development bank and more recently the owner of a local MaidPro janitorial franchise, was poised to help the former leader carry out his agenda. Now, the former prime minister, ousted in December amid a standoff with the president, took the stage, raised his fist and urged the crowd to be part of history. In 2016, Somalia is supposed to hold its first democratic election in more than 40 years. There are obstacles, to be sure, among them attempted disruption by the extremist Islamic terrorist group al-Shabaab. But if it comes off, the election could bring a measure of stability and order to one of the most chaotic, corrupt and violent countries in the world. Washington state could play a vital role. Its Somali community is thought to be the third largest in the U.S. after Minnesota and Ohio, and to number anywhere from roughly 13,000 (according to the latest Census figures, which tend to underreport immigrant populations) to 30,000 (as estimated by community leaders). Mohamed, among others, believes Seattle-area Somalis  indeed all of the countrys emigrants around the world  should get a vote. And he wants them to pressure the Somali parliament, as well as influential U.S. officials, to make that happen. Some have taken up his call. Meeting in living rooms and suburban malls, teleconferencing with their compatriots around the globe, they are brainstorming about people to talk to and petitions they might start. You wouldnt necessarily know it from their current occupations, but back in their homeland, many had impressive, even exalted, pedigrees. Its a shattered country,  said Mohamud, the former banker and amateur painter who came to the U.S. in 1989, as his country was on the brink of civil war. We need to stitch every piece together and make reconciliation. For that to happen, he and other Somalis say, the diaspora must become involved. That was the message of former Prime Minister Mohamed, who spent a decade in Canada before returning to Africa. Particularly in the West, he said in a Seattle Times interview, Somali refugees have come to know the benefits of democracy, peace and stability. With as many as 20 percent of native Somalis spread around the world, support for the candidates of their liking  financial and electoral  is crucial. If they are allowed to vote, they would be more inclined to open up their wallets, said David Shinn, a lecturer in African affairs at George Washington University and a former ambassador to Ethiopia. That would make Seattlean important campaign stop for Somali politicians. Mohamed, who isnt making his personal political aspirations known, isnt the first to come here. Fadumo Dayib, a Harvard University fellow who is braving death threats and challenging cultural mores as she seeks to become Somalias first female president, made a stop in Seattle in April. Just in case youre wondering whos going to be the future prime minister, youre talking to him, Dualeh Hersi said during the May event at the Tukwila DoubleTree. Hersi, 46, related that he is a nephew of Siad Barre, the former president and military dictator who ruled Somalia for decades before being ousted by a civil war in 1991. As rebels encroached upon Barres villa, Hersis family made a split-second decision to join a convoy headed for Kenya. He was 22 and a recent graduate of Somali National University. Eventually making his way to the U.S. he took computer classes while supporting himself with a series of menial jobs. He now works as a program manager for Amazon. I cry in my heart when I see the way Somali people are treated around the world, he said, explaining why he might give up a comfortable life here to go back to a place he calls a black hole. While the elite hide in fancy hotels and houses surrounded by tall walls, he said, hundreds of thousands are still crammed into refugee camps. He said that will likely only change with the help of Somalis who have benefited from opportunities abroad. Its in my blood, he added. The Barre connection would have been a liability at one point, but Hersi believes that has changed after all this time, especially as he and others once connected to the regime are voicing support for democracy. When Hersi might go back is uncertain. Yet, he has already tested the waters. In December, he traveled to Mogadishu to make a pitch for a new cabinet position that would improve the countrys shoddy telecommunications. The government wasnt interested, he said, and he returned to Seattle. This back and forth to Somalia isnt unique to Hersi. The diaspora and the population inside the country are so interconnected, said Matt Bryden, speaking by phone from Nairobi, where he heads Sahan, a think tank focusing on the Horn of Africa. Inside a little storefront in SeaTac or a nonprofit in Seattle, you might find a recent Somali member of parliament, an entrepreneur with investments in Mogadishu or a behind-the-scenes player with deep political ties to his African compatriots. Talking in his Renton home, with the curtains drawn  African-style, against the afternoon sun  Mohamud recounted his departure from Somalia in 1989, as a civil war was beginning to brew. You couldnt just quit a job in the Barre administration, related the former official, dressed on this day in a navy suit with a green handkerchief tucked neatly into the breast pocket. You had to leave the country. He landed in the Washington, D.C. area, where he lived for 16 years. When several of his five children made their way to the Seattle area, he moved here. Despite dealing with kidney failure and dialysis, he remains active in Somali affairs. When he and Mohamed met for breakfast, Mohamud recalled, the former prime minister asked for his support. A considerable amount of tact was involved. He said, You are not joining us. We are joining you,  Mohamud recalled. The former prime minister was alluding to a political party Mohamud had helped form in 2011. The purpose, he said, was to create a culture of parties that would supplant the culture of corruption and clan-based rivalries that reigned in Somalia. Called Hiil Qaran and composed of Somalis around the world, it has no ideology, he said; Somali politics havent reached that point. Instead, he called its mission patriotic the building of a democratic republic. Mohamud now chairs Hiil Qaran, which has maybe 300 members. Thats not a lot, but apparently it carries enough clout to be courted by a prominent politician. Or perhaps it is Mohamud who has the clout. Asked if he has political aspirations himself, the former banker demurred. But I may be a kingmaker, he said. He later thought better of the boast and said he was joking. Yet, he noted his influence as a commentator on websites and radio shows targeting the international Somali community. His wife, Hamdi Abdulle, is also a force to be reckoned with. She serves as executive director of the Somali Youth and Family Club, a Renton-based nonprofit. She said she was pleased by the talk of reconciliation during the former prime ministers visit, and gave a speech supporting womens rights at the DoubleTree event. But she did not sit on stage. They were, she said pointedly, all men, including my husband. She also said there was an expectation that women would sit apart from men. Abdulle, wearing a vivid black and red headscarf as she talked with a reporter, observes some traditional customs. Still, she said, I dont want anybody to dictate to me where to sit. You might think she would be susceptible to a womans bid for president, but she was critical of Dayibs Seattle appearance, which took place at an Eritrean community center  a foreign venue for local Somalis, according to Abdulle. That may be why only about 30 people turned out. Nourah Yonous, a 28-year-old Somali woman, invited Dayib here. A recent transplant to Seattle, she grew up in Tanzania and went to college in California, where she studied feminist theory. Moving here for a job at a local nonprofit immersed her for the first time in a big Somali community. Over lunch at a Chinese restaurant near her work in Rainier Valley, she confessed she finds it tricky to navigate the communitys mores. Still, Yonous, whose very appearance raises eyebrows  her mass of curly hair falls to her shoulders uncovered  declared her intention to support Dayib as much as she can. For the first time in our history we have a Somali woman candidate, she said. And the incredulous reaction by some merely underscores for her the need to press on. It also suggests the diaspora, if allowed to vote, will have an unpredictable influence. There are many diasporas, observed Nairobis Bryden, citing one in the West, one in Asia and one in Somalias neighboring countries. The diaspora in the West might be more inclined toward a secular, multiparty system, he speculated. Yet, he added: Even in the West, theres a lot of division  Some of the most rabid, pro-clan propaganda comes from outside Somalia because they dont have to suffer the consequences. (A smattering of al-Shabaab recruits have also come from the West, including at least a couple from Seattle, although the terrorist groups pull abroad has diminished, according to Somali observers.), Whatever way they lean, Somali emigrants wont get a chance to weigh in unless they win the vote in Somalia. Thats something that Abdulhakim Hashi is working on. The 54-year-old, who jokes that his eight children have given him a clan of his own, left Somalia in the 1980s to study at the University of Amsterdam. With a mother-in-law in the Seattle area, he came here in 1998 and now runs a nationwide business  wiring money to Africa, selling insurance and preparing tax returns  out of an odd little SeaTac building in the shadow of a mall featuring a cavernous Somali grocery and restaurant. In 2000, when a peace conference in Djibouti established a transitional government, Hashi said, he went back to serve in parliament. But warlordism and chaos continued to reign. He returned to Seattle. He still visits Somalia, in part to work on a bank he and other investors are trying to get off the ground. On one such trip in February, he said, he attended the founding meeting of Mohameds Forum of Unity and Democracy. The memory is tinged with sadness for Hashi. A few days later, he lost a good friend in an al-Shabaab hotel bombing that killed about 25 people. Mohameds visit to Seattle in May roused Hashi to action. He became part of a local task force that is discussing ways to get the voices of the diaspora heard, including a possible petition drive among Somali immigrants, asking the U.S. State Department to intervene. Donald Teitelbaum, the State Departments deputy assistant secretary for East African Affairs, does not sound so inclined. I think the decisions on the specifics of the voting is something for the Somalis to decide. With President Obamas trip over the weekend to neighboring Ethiopia and Kenya, the fate of Somalia is likely on his mind, but he may be more focused on ending al-Shabaab violence than shaping the next election. Amid furious political maneuvering now going on in Mogadishu, President Hassan Sheikh Mohamud has said he thinks security concerns will make a one-person one-vote election difficult. Local Somalis are watching all this carefully. Whatever their differences, they seem to agree on this sentiment, as expressed by Hashi: We need Somalia to join the rank of civilized nations.]", "Date": "20150726", "Author": "[Nina Shapiro]", "Link": "http://www.seattletimes.com/seattle-news/seattle-area-somalis-seek-to-shape-politics-back-home/", "Title": "[Seattle-area Somalis seek to shape politics back home]"}