{"Content": "[ A report by Congress nonpartisan budget analysts seems to have thrown Democrats onto the defensive after it concluded that the partys drive to boost the federal minimum wage could cost a half-million jobs by 2016. A Congressional Budget Office report released Tuesday concluded that a gradual increase to $10.10 hourly by that year  which is what President Barack Obama and congressional Democrats are seeking  would increase pay for more than 16.5 million people, mostly those earning low wages. It also would lift 900,000 people over the federal poverty threshold, the study said. Democrats hailed those findings. But in a congressional election year in which the slow-recovering economy remains a paramount issue, Democrats from the White House to Capitol Hill contested another of the reports conclusions: that the increase would reduce jobs in 2016 by roughly 500,000, or 0.3 percent. That figure was the midpoint of a range of job losses the budget office estimated at somewhere from negligible to 1 million eliminated positions. And it was an unpleasant number for Democrats, who plan to make their long-shot effort to raise the minimum wage this campaign year a centerpiece of their focus on correcting income inequity between haves and have-nots. Jason Furman, chairman of the White Houses Council of Economic Advisers, and council member Betsey Stevenson referred in a blog post to a statement by more than 600 economists who cited recent academic findings that increases in the minimum wage have had little or no negative effect on the employment of minimum-wage workers, even during times of weakness in the labor market. Theres some respectful disagreement on the emphasis and certainty around that magnitude of employment loss, Furman told reporters of the CBO estimates. He added, Zero is a perfectly reasonable estimate of the impact of the minimum wage on employment based on research by other economists. Among those echoing Furman were Sen. Tom Harkin, D-Iowa, author of the minimum wage bill the Senate plans to debate next month. His measure would boost todays $7.25 standard in three steps to $10.10 by 2016, with annual increases reflecting inflation after that. Citing the newest economic research using the most sophisticated methodologies, Harkin said, since the first minimum wage was enacted more than 75 years ago, opponents have argued that a wage floor would cause job loss. But this is a myth. Republicans, who long have solidly opposed a minimum wage boost as a job killer, wasted no time in using the budget office report to buttress their case. Todays CBO report shows that raising the minimum wage could destroy as many as 1 million jobs, a devastating blow to the very people that need help most in this economy, Senate Minority Leader Mitch McConnell, R-Ky. said. With unemployment Americans top concern, our focus should be creating  not destroying  jobs for those who need them most, said Brendan Buck, spokesman for House Speaker John Boehner, R-Ohio. The study also examined the impact of boosting the minimum wage to just $9 hourly by 2016, similar to what Obama embraced a year ago, and leaving it at that level afterward. That lesser increase would have smaller effects  about 100,000 fewer jobs, higher wages for 7.6 million workers and 300,000 people lifted out of poverty. Without any changes in the minimum wage, about 45 million Americans are expected to live below the poverty line in 2016. The budget office estimates that the poverty level that year would be $24,100 for a family of four, less for smaller families. The report said an increase to $10.10 would add $31 billion to the earnings of low-wage workers. But it noted that only 19 percent of that increase would go to families earning less than the poverty threshold, while 29 percent would go to families earning more than triple the poverty level. That is because many low-wage earners are not in low-wage families. In addition, income would decrease by $17 billion for families earning at least six times the poverty level because that group would be affected most by lost business income and price increases. The report said that besides boosting wages for people earning less than $10.10 hourly, a minimum wage boost to $10.10 would help some people making more than that amount as bosses adjust their pay scales upward. A minimum wage boost can cost jobs because employers can compensate for their higher wage costs by raising prices. That can prompt consumers to purchase fewer goods and services and, in turn, encourage companies to hire fewer workers, the report said. A minimum wage increase also encourages some businesses to trim the number of low-paid workers. But the study said the effect can be mixed. It noted that some companies would react by getting higher productivity from their workers, and some would see savings because increased wages could reduce turnover. Other companies could benefit as increased overall spending on goods and services by low-wage workers boosts demand for their products. Some workers incomes would grow as their earnings increase, causing them to pay more taxes. But for others, income would fall  reducing their tax burden  and still others would begin collecting unemployment insurance. As a result, the budget office said a higher minimum wage would have a negligible impact on federal budget deficits. ", "Date": "20140219", "Author": "[ALAN FRAM]", "Link": "http://www.seattletimes.com/seattle-news/politics/minimum-wage-report-puts-democrats-on-defensive-1/", "Title": "[Minimum wage report puts Democrats on defensive]"}