{"Content": "[ In whats becoming a seasonal tradition nearly as predictable as the pumpkin-spice latte, the name of Starbucks CEO Howard Schultz has again been floated as a potential presidential candidate. Starbucks is staying officially mum, but state Democratic operatives said theyre skeptical, and theres been no sign that the politically engaged coffee titan is planning to stir the 2016 presidential pot. Update: Howard Schultz says he has no intention to run for president, The latest cup of chatter was brewed up in the Sunday New York Times, where columnist Maureen Dowd wrote that potent friends of Americas lord of latte have been pressing him to join the Democratic primary. The buzz spread on the Internet, with conservative news aggregator Drudge Report playing up the potential challenge to front-runner Hillary Rodham Clinton. Starbucks wouldnt comment and did not make Schultz available for an interview this week. Schultz has repeatedly batted down such rumors, which also arose before the 2012 election. In February, he told Time magazine he was not interested and lacked the correct temperament to run for office. I dont think that is a solution. I dont think it ends well, he told the magazine. Jaxon Ravens, chair of the Washington State Democratic Party, said he has not heard any buzz about Schultz considering a presidential bid. Its not hitting the radar, he said. Since reclaiming the helm of a struggling Starbucks in 2008, Schultz has increasingly thrown the heft of the coffee giant behind social and policy issues dear to his heart, from gridlock in Washington, D.C. to the plight of returning veterans, even as he turned the company around. Its been a rare departure from the typical corporate script for the CEO of a publicly traded company, and analysts say that investors go along with it because Starbucks results have been spectacular. Some of its well-publicized moves  such as an initiative to subsidize college for legions of U.S. baristas, cast against the backdrop of rising inequality and mounting college costs  have helped make Starbucks more attractive as an employer. More recently, the company launched a campaign to employ and train disadvantaged youth. It hasnt always gone well: A bid in March to encourage baristas to talk about race relations in the empires coffee shops was widely panned. Schultz is not known for being particularly involved in politics in Washington state. He has donated periodically to Democratic candidates. He hosted a fundraiser at his home for John Edwards 2008 presidential campaign. After Edwards flamed out in an infidelity scandal, Schultz donated to Clinton and Barack Obamas 2008 campaigns. Its not clear the coffee magnate would even have a firm Washington state constituency. He is reviled by some local sports fans for selling the Seattle SuperSonics to a group of Oklahoma businessmen in 2006. The team moved to Oklahoma City two years later. He would have a hard time carrying Washington because a lot of people think he is the one who lost the Sonics, said Paul Berendt, a former state Democratic Party chairman and Clinton supporter. Ravens called Schultz smart and accomplished but said, Weve got some great people running already and the clock is ticking. Many Democratic activists in the state already are lining up behind Clinton or Vermont Sen. Bernie Sanders, who is visiting Seattle for a pair of political rallies Saturday. Ravens said hes heard no hue and cry among Democrats for a billionaire business executive to lead their partys ticket. Nobody has come to me and said Jaxon Ravens, I wish we had a corporate CEO running as a Democrat for president, he said.]", "Date": "20150804", "Author": "[Jim Brunner, gel Gonzlez]", "Link": "http://www.seattletimes.com/seattle-news/politics/its-election-time-will-howard-schultz-run-for-president/", "Title": "[Its election time. Will Howard Schultz run for president?]"}