{"Content": "[ With a debate performance that was steely, self-assured and, at times, personal, Carly Fiorina appears to have improved her standing in the race to be the Republican nominee. But even if she ultimately falls short, she took a big stride toward filling a role her party needs: A powerful and credible antidote to the gender gap and the Democrats claims of a Republican war on women. The question, as many Republicans see it, is whether they can seize on the opening. A series of coming events threatens to feed into efforts by the Democrats to paint the Republican Party as tone-deaf on womens issues. Republicans in Congress are threatening a government shutdown in a dispute over funding Planned Parenthood. The governments spending authority expires in less than two weeks, and many conservatives have threatened to vote against a new budget if it includes any money for the organization. In a separate move, Senate Republicans are moving quickly to schedule a vote on legislation that would impose a federal ban on abortion at 20 weeks of pregnancy. It would be the most restrictive abortion bill to reach the Senate floor in a decade. Similar laws across the country are facing legal challenges from womens groups that argue they are unconstitutional. But with Hillary Rodham Clintons popularity falling among women as questions about her honesty and integrity continue to follow her, many Republicans are beginning to see Fiorina as someone who, if she is not the presidential nominee, is a much more serious contender for the vice-presidential nomination or a large leadership role within the party. If shes not on the ticket, they would be foolish not to offer her a key role in the next administration, said Penny Nance, president of Concerned Women for America, a conservative organization. The Republican Party, she said, has begun to correct its past mistakes of neglecting its female talent. I think theyre learning their lesson. At the debate at the Reagan library Wednesday, Fiorina spoke directly to the women watching in a way that none of the 10 men with her on stage could. Describing how she lost her stepdaughter to drug abuse, she revealed a painful episode that many people watching were unaware of: My husband, Frank, and I buried a child to drug addiction. She said she knew how disgusted women must have felt when Trump said  and then later denied saying  that she was too ugly to be president. I think women all over this country heard very clearly what Mr. Trump said, she responded. And as some of the men struggled to name a woman who wasnt an immediate family member to put on the $10 bill, Fiorina dismissed the whole exercise as empty symbolism. I think, honestly, its a gesture. I dont think it helps to change our history, she said. We ought to recognize that women are not a special-interest group. Her answer on the $10 bill question, said Kristen Soltis Anderson, a Republican pollster and author, was instructive in how it revealed Fiorinas discomfort with being seen as someone trying to capitalize on her gender. She resists that, Anderson said, noting that her research has shown younger women do not find it as important to vote for the first female president as older women do. The largest gender gap was recorded in the 2012 presidential election: 20 percentage points, according to Gallup. Mitt Romney won among men by 8 percentage points while President Obama won women by 12 percentage points overall. But among white women, Obama lost, with 42 percent to Romneys 56 percent. To win the White House in 2016, Republicans would almost certainly need to win more than 56 percent of the white female vote. Many see Fiorina as a way to help them do that, either as the nominee or in some other role. Many Republicans will see her, even if shes not the nominee, as that magic key that can unlock the gender gap, said Bruce Haynes, president of Purple Strategies, a Republican consulting firm. Thats a challenge that many have feared has been set in concrete over time. Building a credible campaign, Haynes added, is far more difficult than having a strong debate performance. And keeping that credibility intact could get much harder in a government shutdown. You dont control the agenda, and you have to react to the agenda of others  such as congressional Republicans who want to back everybody up against a wall as usual, he said. For her part, Fiorina is siding with the hard-liners in her party who want to see a veto showdown with Obama, who has said he will reject any attempt to take away Planned Parenthoods funding. This is about the character of our nation, she said at the debate, receiving some of the most vigorous applause of the night. And if we will not stand up and force President Obama to veto this bill, shame on us. Democrats said voters should not be confused about what Fiorina is really saying. You do that and the government shuts down. Plain and simple, said Rep. Debbie Wasserman Schultz of Florida, chairwoman of the Democratic National Committee. She is indistinguishable, other than her gender, from her counterparts on that stage. Democrats also exposed a flaw in Fiorinas debate comments about the undercover videos of Planned Parenthood that have led to the calls to eliminate its funding. She dared the president and Clinton to watch the tapes, saying, Watch a fully formed fetus on the table, its heart beating, its legs kicking while someone says we have to keep it alive to harvest its brain. The video that Fiorina seems to be referring to does show a still image of a fetus being held outside the womb. But it is not seen squirming as Fiorina describes, nor is there any indication that it is about to have its brain removed. With her social and fiscal conservatism, Fiorina would seem to be a good fit for a Republican nominating contest. A general election, however, is something some Democrats said they would welcome. She was Mitt Romney before Mitt Romney was Mitt Romney, said Mark Mellman, the Democratic pollster who worked on the 2010 Senate race in which Sen. Barbara Boxer defeated Fiorina by 10 percentage points, in large part, by highlighting how as chief executive of Hewlett-Packard she had cut 30,000 jobs. Fiorina not only lost that race 52 to 42 percent, she lost women too, getting only 39 percent of their votes, according to exit polls.]", "Date": "20150917", "Author": "[JEREMY W. PETERS]", "Link": "http://www.seattletimes.com/nation-world/is-fiorina-gops-magic-key-to-womens-vote/", "Title": "[Is Fiorina GOPs magic key to womens vote?]"}