{"Content": "[ Ellen OShea, an organic farmer from Chimacum, Jefferson County, had planned to share a car and ferry ride with a couple friends to see Democratic presidential candidate Bernie Sanders on Saturday in Seattle. But so many Olympic Peninsula neighbors were fired up to see the independent Vermont senator, they chartered what theyre dubbing the Freedom Bus for as many as 60 to get into the city. With a socialist City Council member, $15 minimum wage and a statue of Lenin, Seattle is friendly territory for a candidate like Sanders  and organizers expect thousands from across the state will pack two events: a 1 p.m. Social Security event at Westlake Park and a 6 p.m. campaign rally at Edmundson Pavilion. As the first 2016 contender to publicly campaign in Washington, Sanders visit contrasts with recent secretive stopovers by other candidates. Democrat Hillary Rodham Clinton and Republican Jeb Bush each slipped into the Seattle area this year to mingle at penthouses and mansions with donors who paid thousands of dollars to attend. Sanders only scheduled fundraiser is a small, $200-a-person meet-and-greet at Capitol Hills Comet Tavern. An avowed socialist whod be the oldest president ever elected in the U.S. Sanders faces steep obstacles to winning the Democratic nomination compared to Clinton, who has led in polls and fundraising. But Sanders fiery, anti-corporate rhetoric, tinged with the Brooklyn accent of his youth, has attracted progressive Democrats dissatisfied with their partys presumed front-runner. I think there is growing unhappiness with establishment politics, with politics that just nibbles around the edges of issues, Sanders said Thursday during a conference call with local reporters when asked what distinguishes him from Clinton. There will not be any significant change to the middle class of this country unless we have a mass political movement taking on the billionaire class, he added. He also pointed to his clear opposition to free-trade deals like the Trans-Pacific Partnership, and to his support for a national $15 minimum wage like the one in Seattle. A former mayor of Burlington, Vt. Sanders was elected as an independent to the U.S. Senate in 2006 after serving 16 years as the states sole U.S. House representative. If he were to win, Sanders, 73, would be the oldest U.S. president ever inaugurated. To many local supporters, the long track record is a comfort. No matter how far back you go, hes always said the same thing, said Mario Brown, of Edmonds, one of the organizers of Washington For Bernie Sanders, an unofficial volunteer group. Several Sanders supporters said theyd jumped early in 2008 onto the candidacy of the charismatic but little known Sen. Barack Obama. They helped him to outorganize and beat Clinton  only to be disappointed when they felt his presidency failed to live up to the lofty campaign speeches and transformative image. I am feeling burned by him, OShea said. She doesnt think that would happen with Sanders, whom she first encountered during an anti-war organizing meeting in the 1970s. Just to be sure hes reliable, OShea said, shes talked with friends in Vermont. After Obama, I dont want to be projecting to anybody that this is a person we can trust without verifying that, OShea said. Sanders rallies in Seattle, which organizers said could draw 10,000 or more, will be followed by events in Portland on Sunday and Los Angeles on Monday. The Portland event was shifted to a bigger venue due to overwhelming demand, his campaign said. A big part of Sanders appeal is his refusal to accept corporate donations, said Joe Rogerson, who plans to drive with a carful of supporters from Bellingham to Seattle Saturday. He said Obama sold out to corporate America and the military-industrial complex but that Sanders seems more trustworthy than any other politician. Sanders said Thursday hed apply a litmus test for any Supreme Court nominees  they must favor overturning the 2010 Citizens United ruling that opened new floodgates for big money in politics. Some pundits and political insiders have questioned Sanders viability as a serious national contender, noting his long identification as a socialist, as well as Clintons massive advantage in fundraising and professional organization. Paul Berendt, former chairman of the state Democratic Party, said Sanders honest voice appeals to many who feel disenfranchised by politics. But Berendt, a Clinton supporter, said he believes the Vermont senators appeal is limited to a subset of mostly white progressives and that he falls flat with a wider electorate, including minority groups that are a big part of the Democratic Partys constituency. Hes going to have a very hard time breaking out of that, Berendt said. Sanders backers here say they dont buy the mainstream narrative that he cannot win. Local organizers point to 200 house parties organized last month that drew thousands of supporters to start planning for how to win Washingtons Democratic caucuses on March 26. David Spring, a Democratic activist from North Bend, said he was involved in Obamas 2008 campaign early, before anyone could even pronounce his name. The support for Bernie Sanders goes much wider than the support for Obama did, Spring said.]", "Date": "20150806", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/presidential-candidate-sanders-expected-to-draw-crowds-in-seattle-visit/", "Title": "[Presidential candidate Sanders to find friendly territory in Seattle visit]"}