{"Content": "[ MANILA, Philippines (AP)  A popular Philippine senator and daughter of one of the countrys most famous movie couples announced Wednesday her candidacy in next years presidential election, promising to defend disputed territories in the South China Sea and speed up Internet connections. Grace Poe has topped recent popularity surveys and is likely to be among at least three main contenders to succeed President Benigno Aquino III, whose six-year term ends in June in one of Asias most rambunctious democracies. Former Interior Secretary Mar Roxas, who has been endorsed by Aquino, and current Vice President Jejomar Binay have made public their presidential ambitions. Binay, however, has not formally declared his candidacy. Aquino and Roxas had tried to convince Poe to run as Roxas vice presidential candidate. Roxas wished her good luck Wednesday following her announcement. Standing on a stage at the state-run University of the Philippines, Poe, 47, promised to continue Aquinos battle against corruption and address many concerns of ordinary Filipinos: poverty, crime, huge traffic jams, high power and income tax rates, the plight of overseas workers and even slow Internet speeds. We will hold accountable the crooked, whether friend or foe, Poe said. It is only right to continue the fight against corruption. She said she would open peace negotiations with all insurgent groups and pledged to strengthen the countrys ill-equipped coast guard and military to be able to defend territories in the South China Sea. The West Philippine Sea is ours, Poe said, using the name the government employs for the disputed region. We must protect it and not let it slip from our grasp by exhausting all peaceful and legal means. The U.S.-educated former preschool teacher, who lived and worked for years in America, has faced questions about her citizenship and whether she meets residency requirements for presidential candidates. She insists she is qualified to run and is ready to provide evidence. Poe entered politics in 2013 and won her Senate seat by a wide margin. She is running as an independent without the backing of a formidable political partys machinery. She, however, has something to compensate: a famous family name. She is the adopted daughter of Susan Roces and the late Fernando Poe Jr. who were immensely popular in the local movie industry in the past and remain widely known. Her father ran for president in 2004 but lost to Gloria Macapagal Arroyo amid allegations of widespread cheating, which Arroyo has denied. Poes life story  her mother says she was found abandoned in a Catholic church shortly after birth, her umbilical cord still attached, and was later adopted by the Poes  can be an advantage in a country where many voters are swayed more by personality than issues. The legacy of her father, who often portrayed champions of the poor and the oppressed, featured prominently in Poes speech. She also touched on her beginnings and twist of fate. Who wouldve thought that a foundling would ever lay foot in the Senate? Poe asked. I thank you for giving me that opportunity.]", "Date": "20150916", "Author": "[JIM GOMEZ]", "Link": "http://www.seattletimes.com/nation-world/popular-philippine-senator-announces-bid-for-presidency/", "Title": "[Popular Philippine senator announces bid for presidency]"}