{"Content": "[ The results from the Aug. 4 primary election wont be officially certified until next week, but with very few ballots still left to count, most races are safe to call. The top two vote-getters in each race will move ahead to the Nov. 3 general election. All nine of the nonpartisan Seattle City Council seats are up for grabs this year, with seven of them attached to geographic voting districts for the first time in modern history. The candidates bound for the November ballot are, in order of how theyll finish:, In District 1 (West Seattle, Delridge, South Park), Lisa Herbold and Shannon Braddock. In District 2 (Southeast Seattle), Bruce Harrell and Tammy Morales. In District 3 (Capitol Hill, Central District), Kshama Sawant and Pamela Banks. In District 4 (Northeast Seattle, Eastlake), Rob Johnson and Michael Maddux. In District 5 (North Seattle), Debora Juarez and Sandy Brown. In District 6 (Fremont, Ballard, Phinney Ridge), Mike OBrien and Catherine Weatbrook. In District 7 (Magnolia, Queen Anne, downtown), Sally Bagshaw and Deborah Zech-Artis. In citywide Position 8, Tim Burgess and Jon Grant. In citywide Position 9, Lorena Gonzlez and Bill Bradburd. Harrell, Sawant, OBrien, Bagshaw and Burgess are current council members. A sixth current council member, Jean Godden, conceded in the District 4 race last week after results showed her falling far behind Johnson and Maddux. Council members Tom Rasmussen and Nick Licata arent running for re-election. Neither is Councilmember John Okamoto, who was appointed as a temporary replacement for former Councilmember Sally Clark after she resigned earlier this year. The closest primary race is in District 1, where Herbolds lead on Braddock was only about 400 votes Tuesday, a week after primary day. Officials have counted 17,685 ballots in District 1, or about 29 percent of the number of registered voters there. There were about 400 additional District 1 ballots as of Tuesday that had been returned but not yet verified. Phillip Tavel is running third in District 1, about 1,700 votes behind Braddock. Officials have counted 125,573 ballots in the citywide races, or about 30 percent of the number of registered voters in Seattle. The final turnout-percentage on Aug. 18 will be slightly higher. The race with the best turnout will almost certainly be District 3, where officials have counted 22,578 ballots, or about 36 percent of the number of registered voters. In the race for Bellevue City Council Position 7, bicycle and neighborhood activist Lyndon Heywood maintained a slight lead over anti-light-rail candidate Bill Hirt. Heywood had 1,913 votes to Hirts 1,802 after Tuesdays update. The winner will face incumbent Jennifer Robertson, a land-use attorney, who overwhelmed her two opponents with 12,872 votes, or 77percent of the total. In the nine-candidate race for Port of Seattle Commission Position 5, Fred Felleman, who received 25 percent of the vote, will face Marion Yoshino, who received 18 percent. Felleman said he thinks receiving a quarter of the votes is a clear indication that King County voters agree with him that in order for the Port to grow responsibly in the face of climate change, the commission must work to advance clean energy jobs that will support our families, workers and unions now and into the future. Running against Port of Seattle Commissioner Courtney Gregoire for Position 2 will be Goodspaceguy, who received 9 percent of the votes compared with Gregoires 83 percent.]", "Date": "20150811", "Author": "[Daniel Beekman]", "Link": "http://www.seattletimes.com/seattle-news/politics/nearly-official-primary-leaders-expected-to-advance-to-nov-ballot/", "Title": "[Nearly official: Primary leaders expected to advance to Nov. ballot]"}