{"Content": "[ MADISON, Wis. (AP)  Gov. Scott Walker backed a surprise move Friday by Republican legislators to quickly vote on making Wisconsin a right-to-work state, an action the likely 2016 presidential candidate initially said should be delayed to avoid re-igniting massive pro-union protests. Walker had expressed concerns to leaders in the GOP-controlled Legislature that rushing the divisive proposal could distract from his agenda, and in September  during the heat of his re-election campaign  he said he wouldnt support it this session. But after a series of private meetings with lawmakers, followed by an announcement that the bill would be voted on next week, Walkers spokeswoman said he would sign it. Governor Walker continues to focus on budget priorities to grow our economy and to streamline state government, his spokeswoman Laurel Patrick said in an email. With that said, Governor Walker co-sponsored right-to-work legislation as a lawmaker and supports the policy. Walker walked past reporters, declining to answer questions, at a National Governors Association meeting Friday in Washington. Under right to work, unions are prohibited from reaching labor deals with businesses that require private-sector workers to pay fees to the union. Twenty-four other states already have the laws in place. Walker rose to prominence in 2011, when he pushed through a law known as Act 10 that effectively ended collective bargaining for most public workers. That led to protests involving as many as 100,000 people at the state Capitol and a 2012 recall election that Walker won. Unlike Act 10, which Walker proposed, the right-to-work push is coming from Republicans who control the Legislature. I think we can do this next week without it getting really ugly, said Republican Senate Majority Leader Scott Fitzgerald on WTMJ radio in Milwaukee. Well see next week whether the Capitol blows up. I dont know. Unions were quick to criticize but were silent about whether they planned to organize massive rallies like those that went on for weeks in 2011. Right to work is a false promise for Wisconsin, said Phil Neuenfeldt, president of the Wisconsin AFL-CIO, in a prepared statement. Right to Work will not create jobs and will lower wages for all workers,, Dan Bukiewicz, president of the Milwaukee Building-Construction Trades Council, which represents union construction workers in the Milwaukee area, called right-to-work an unneeded distraction. I havent heard anybody come out from a business standpoint saying this is what they want, he said. The residual results of this will hurt the citizens of Wisconsin. There will inevitably be legal challenges to the law, but they are unlikely to succeed based on previous federal and state court rulings in Indiana and Michigan, said Paul Secunda, labor law professor and program coordinator for Marquette Law Schools Labor and Employment Law Program in Milwaukee. Proponents of right-to-work argue it will make Wisconsin more competitive and that workers should have the freedom to decide whether to pay and join a union, rather than having dues automatically withdrawn. Passing right-to-work is a priority for Wisconsin Manufacturers and Commerce, the statewide chamber of commerce that represents 3,800 large and small manufacturers and companies, local chambers of commerce and specialized trade associations. Opponents argue the law is an intrusion on the private operations of businesses and results in lower earnings, weaker benefits and higher health insurance premiums. Critics also say right-to-work would jeopardize a successful business model under which workers receive privately funded training to prepare them for work. The bill has no exemptions and Fitzgerald said at a Capitol news conference that it would not disrupt current contracts. Also, those agreements could be extended between now and when the bill is signed into law, he said. Under the bill introduced late Friday afternoon, violating the law would be a misdemeanor punishable by up to nine months in jail and a $10,000 fine. Union membership is declining in Wisconsin. Last year, 11.7 percent of workers belonged to unions, based on figures from the U.S. Bureau of Labor Statistics. Thats down from 12.3 percent in 2013 and 14.2 percent in 2010, the year before the public union changes. Fitzgerald said there would be a public hearing on Tuesday followed by debate starting Wednesday. The Assembly wont take up the bill until the week of March 2, he said. Fitzgerald defended the fast track, saying the issue has been around long enough for people to know where they stand before the Senate votes next week. Fitzgerald said he wanted to move quickly because he had secured the 17 votes necessary to get it passed and he worried that if unions started television ads targeting senators, support may dwindle. I lay awake at night losing sleep over that all the time, he said. ", "Date": "20150220", "Author": "[SCOTT BAUER]", "Link": "http://www.seattletimes.com/nation-world/gov-walker-backs-push-to-make-wisconsin-right-to-work-state/", "Title": "[Gov. Walker backs push to make Wisconsin right-to-work state]"}