{"Content": "[ Like he did 82 times before, Sheldon Whitehouse stood on the Senate floor and preached the dangers of climate change. In his last speech before Congress adjourned, the senator warned that 2014 is on track to be the hottest year on record. It was a familiar sight: Whitehouse has given a speech about climate change each of the last 83 weeks Congress has been in session. He never has to give the same speech twice, he says  there are plenty of new angles to take on such a big problem. The Rhode Island Democrats ever-changing, ever-present floor speeches  warnings over rising sea levels, warmer oceans, eroding coastlines and more  make him the Senates loudest, most persistent voice on the dangers of climate change. Whitehouse is still haunted by what he saw after Superstorm Sandy: oceanfront houses in Rhode Island teetering into the sea. He fears future storms will be more catastrophic as sea level rises. Were not a very big state so we dont have a lot of land to give away to the sea, he said. He noted that Rhode Island finds itself on the receiving end of the climate change problem because it doesnt have coal mines or oil drilling. Whitehouse, now in his second term, is a former federal prosecutor and Rhode Island attorney general. His wife, Sandra Thornton Whitehouse, is a marine scientist who helped him see the importance of the oceans in everyones lives, he said. On a personal level, I have a deep fear of being ashamed, he said. I dont want, 20 years from now, when this is way past our current discussion, to be ashamed that I didnt do my best when we still had a chance to fix this problem. Whitehouse co-chairs the Senate Oceans Caucus and a congressional climate change task force. The caucus is working to get bipartisan legislation passed on fishing issues, ocean data monitoring and marine debris. As the Senate switches to a Republican majority, however, Whitehouse faces significant hurdles in getting meaningful climate change legislation passed. The oil and gas industry spent $53 million on the 2014 elections and nearly $75 million in 2012, with close to 90 percent of the contributions going to Republicans, according to the political money-tracking website OpenSecrets.org. Incoming Senate Majority Leader Mitch McConnell has said his top priority will be to rein in the Environmental Protection Agency, which is trying to reduce carbon emissions from coal-fired power plants. He has said their overreaching efforts are strangling the economy. New environmental regulations have hampered U.S. job growth and caused a depression in eastern Kentucky coalfields, according to McConnell. But Whitehouse is hopeful. In his speeches, he has candidly described how climate change will affect individual states  particularly ones with Republican leaders who he thinks might support new environmental policies. And Whitehouse thinks Republicans will have to take more responsibility for solving problems when theyre in charge, and it will become a colossal liability for them to continue denying climate change as the 2016 elections near, he said. Whitehouse thinks theres a chance his latest proposal, to impose a carbon fee on industries that emit carbon pollution into the atmosphere, can gain some traction. Prominent Republicans outside of government have endorsed a revenue-neutral fee on carbon, including Ronald Reagans secretary of state George Shultz, Reagans economic adviser Arthur Laffer and former Republican U.S. Rep. Bob Inglis. To make it palatable to conservatives, Laffer and Inglis say the fee should be offset by a cut to the income tax. What conservative wouldnt jump at the opportunity to reduce the tax on income and put a tax on anything else? said Inglis, a former South Carolina congressman. Shultz, now a distinguished fellow at Stanford University, said the party is more concerned about climate change than it appears. Todays highly partisan atmosphere, he said, causes people to get on opposite sides of everything. Theyre sensible people and given the chance, theyll do sensible things, Shultz said. Im sure of it. Whitehouse has formed an unlikely energy alliance with U.S. Sen. Joe Manchin, a conservative Democrat from West Virginia. Manchin visited Rhode Island in October to see the effect of climate change firsthand and Whitehouse toured coal and energy resources in West Virginia. They plan to work on crafting legislation to invest in technology for cleaner fossil fuel energy. In the new Congress, Whitehouse said, hell keep making speeches about climate change until there is serious action to address it. Another environmental advocate, U.S. Sen. Richard Blumenthal, said Whitehouses climate change speeches present a compelling, absolutely riveting case for action. I consider myself vocal, but nobody is more vocal than Sheldon Whitehouse, the Connecticut Democrat said. Hes in a league of his own.]", "Date": "20141229", "Author": "[JENNIFER McDERMOTT]", "Link": "http://www.seattletimes.com/seattle-news/politics/in-83-speeches-senator-pushes-for-climate-change/", "Title": "[In 83 speeches, senator pushes for climate change]"}