{"Content": "[ WASHINGTON (AP)  Senate Minority Leader Harry Reid, a pugnacious and glamour-averse tactician who united Democrats to help deliver tough victories for President Barack Obama, said Friday hes retiring next year. He immediately endorsed brash New York Sen. Chuck Schumer to succeed him as leader of a party desperate to regain the Senate majority. Reid, 75, rose from hardscrabble beginnings in Nevada, and brought his amateur boxers tenacity to the pinnacle of congressional politics. Friends said his doggedness and indifference to popularity helped rebuff Republicans who fiercely oppose Obama on health care, spending, immigration and other issues. But critics say Reid added to Washingtons poisonous partisanship, particularly by changing Senate filibuster rules in 2013 to enable Obama to appoint more judges. On Friday, Schumer seized the inside track to succeed Reid as the Democratic Senate leader after next years elections. Potential rival Dick Durbin of Illinois said he would back Schumer. Durbin is currently Reids No. 2; Schumer is No. 3. Stylistically, Reid and Schumer are miles apart. Schumer is voluble, outgoing, eager to talk campaign strategy, on TV or anywhere else. He sometimes works with Republicans, including an ultimately unsuccessful effort to overhaul immigration laws in 2013. But Schumer, 64, is a partisan fighter too, hailed by colleagues as a top fundraiser and strategist. He headed the partys Senate campaign operations in 2006 and 2008, when Democrats made sizable gains. Colleagues gratitude helped him surpass Durbin as Reids likely successor. Schumer, who spent much of Friday phoning fellow Democratic senators, said in a statement he was humbled to have the support of so many of my colleagues. Durbin said he hopes to retain the second-ranking leadership post, known as party whip. Allies of Sen. Patty Murray of Washington said she might also seek that job. Reid, who came to Congress in 1982, lost his role as Senate majority leader when last falls elections swept Republicans into power. He suffered serious eye and facial injuries on New Years Day while exercising at his Nevada home. He typically has won Nevada elections by narrow margins, and Republicans were heavily targeting him in 2016. Both parties now plan all-out bids for his open seat. In a video statement Friday, Reid said Democrats must retake the Senate majority and it is inappropriate for me to soak up all those resources while remaining the caucus leader. Obama called Reid a fighter who pushed for jobs, better health care and a safer environment. He also called the senator a friend, but the two arent exactly cozy. Obama has circumvented Reid to negotiate some tough budget deals with Republicans. In a break with protocol, Reids chief of staff publicly suggested Obamas low popularity hurt Democrats in the 2014 elections. Reid, however, saves his sharpest barbs for Republicans. After calling then-President George W. Bush a liar and a loser, Reid apologized for the loser comment but not the liar. He once told Bush, Your dog is fat. Reid grew up in the tiny town of Searchlight, Nevada. His mother sometimes took in laundry for pay. His father, a miner, committed suicide when Reid was 32. Seemingly best-suited for black-and-white photos, Reid rarely appears at Washington dinners or on TV talk shows. His voice is so mumbling and low that reporters strain to hear him. Fellow Democrats chose him as their leader for his institutional knowledge, listening skills and tenacity. Briefly holding a 60-seat, filibuster-proof majority after the 2008 elections, congressional Democrats  led by Rep. Nancy Pelosi in the House, and Reid in the Senate  muscled Obamas Affordable Care Act to enactment, without a single Republican vote. Other times, however, Obama and Pelosi worked around Reid. That was largely the case in resolving the 2013 fiscal cliff dilemma. When negotiations ground to a halt, raising the possibility of tax hikes on nearly all working Americans, Vice President Joe Biden and Senate Republican leader Mitch McConnell of Kentucky crafted a compromise with minimal input from Reid. While never wildly popular with voters, Reid is a canny campaign strategist. Facing a potentially potent GOP opponent in 2000, Reid helped a less experienced tea party-affiliated Republican win the nomination. Then he comfortably beat her in the general election. On Friday, Reid endorsed former Nevada attorney general Catherine Cortez Masto to run for his seat next year. Democratic Rep. Dina Titus said she also is weighing a bid. Unworried about picking favorites, Reid told KNPR radio, Ive never been a shrinking violet. Many Nevada Republicans would like to see Gov. Brian Sandoval run for the Senate seat, but he gave little encouragement Friday. Other GOP possibilities are Rep. Joe Heck and former Lt. Gov. Brian Krolicki. Most tributes to Reid on Friday, regardless of political party, used words like fighter to describe him. Harry Reid has always been a tough advocate for the people of Nevada, and I have always appreciated the candid and straightforward nature of our relationship, said House Speaker John Boehner, R-Ohio. Reids brusqueness has hit many targets over the years. Acquaintances say he often ends phone calls without goodbye. In 2013 he clashed with his leadership predecessor  Tom Daschle of South Dakota  over an open Senate seat in that state. Reid wanted a former congresswoman to run, while Daschle wanted a former aide. Daschles choice prevailed but lost the general election last November to Republican Mike Rounds in a strongly pro-GOP year. Despite the tension, Daschle praised Reid on Friday. He had a very, very difficult job, Daschle said in an interview. This is a challenging time for anyone in political leadership. Daschle said Reid was justified in changing the filibuster rules in 2013, calling it probably inevitable. ", "Date": "20150327", "Author": "[CHARLES BABINGTON, ERICA WERNER]", "Link": "http://www.seattletimes.com/nation-world/nation/senates-harry-reid-announces-he-wont-seek-re-election/", "Title": "[Pugnacious Reid retiring, wants Schumer as Senate Dem leader]"}