{"Content": "[ ADDIS ABABA, Ethiopia (AP)  President Barack Obama unleashed a blistering and belittling rebuke of Republican White House hopefuls Monday, calling their attack on his landmark nuclear deal with Iran ridiculous if it werent so sad. Standing before television cameras during a trip to Africa, Obama suggested the bellicose rhetoric from some GOP candidates was an attempt to divert attention from Donald Trump, the wealthy businessman-turned presidential contender whose popularity is confounding the Republican field. Maybe it gets attention and maybe this is just an effort to push Mr. Trump out of the headlines, but its not the kind of leadership that is needed for America right now, Obama said during a news conference in Ethiopia. Huckabee criticizes Iran deal as being similar to Holocaust, GOPs Walker hits Obama on Iran, strikes combative tone, New polls: Trump strong in N.H. Iowa, In stunning attack, Cruz accuses leader McConnell of lying, Hispanics love me, Trump declares at Mexican border, Trump on John McCain: I like people who werent captured, , Obamas comments marked his most direct engagement in the race to succeed him. Until now, hes largely limited his commentary to policy differences with Republicans, often sidestepping the names of specific candidates. But the presidents unsparing criticism Monday  targeting candidates Mike Huckabee and Ted Cruz, as well as Trump  underscored his sensitivity to efforts to scuttle the Iran accord, which he hopes will be his signature foreign policy initiative. It also raised the prospect of an aggressive role for Obama in the 2016 presidential campaign. In 18 months, Im turning over the keys, Obama said. I want to make sure Im turning over the keys to somebody who is serious about the serious problems that the country faces and the world faces. The president was asked specifically about Huckabees assertion that Obama had agreed to a nuclear deal that would take the Israelis and basically march them to the door of the oven, a reference to crematoria in Nazi concentration camps during the Holocaust. The Israeli government staunchly opposes the agreement and views an Iranian nuclear program as a threat to its existence. Obama said the comments from Huckabee, a former Arkansas governor, were part of a broader pattern from Republicans. He also singled out Cruz, the Texas senator, for saying the nuclear deal makes Obama  not Iran  the leading state sponsor of terrorism. These are leaders in the Republican Party, Obama said, seeming incredulous. He suggested the GOP was breaking longstanding American tradition of not playing fast and loose with facts during serious foreign policy debates. Cruz, appearing Monday night on Fox News Channels Hannity, responded, It speaks volume that hes halfway across the globe and he feels the need to attack me. Hillary Rodham Clinton, the front-runner for the Democratic nomination, said she was offended personally by Huckabees comments. His remarks should be repudiated by every person of good faith, she said during a campaign stop in Iowa Monday. Huckabee dismissed the criticism, arguing that what was ridiculous and sad was that Obama wasnt taking Irans threats to destroy Israel seriously. I will stand with our ally Israel to prevent the terrorists in Tehran from achieving their own stated goal of another Holocaust, Huckabee said in a statement. While Huckabees comments were aimed at Obama, some members of the GOP field  Trump most notably  havent held back in their criticism of each other as next weeks initial Republican debate draws near. Former Florida Gov. Jeb Bush called on his colleagues Tuesday to tone it down. We have to campaign with joy in our hearts  not anger, Bush said during an event outside Orlando. We shouldnt say outrageous things that turn people off to the conservative message. Our message is the one of hope and opportunity for everyone. The White House is the midst of an intense lobbying campaign to prevent Congress from blocking implementation of the Iran deal. Lawmakers have until mid-September to review the accord, which aims to curb Irans nuclear program in exchange for relief from international economic sanctions. The Republican candidates are united in their opposition to the deal, saying Obama has left Iran on the brink of building a bomb and done nothing to address Tehrans support for terrorism. Some, including Wisconsin Gov. Scott Walker and Florida Sen. Marco Rubio, have vowed to immediately scrap the agreement if elected. Obamas unprompted analysis of Trumps effect on the Republican field marks a shift for the president. Hes largely steered clear of opportunities to weigh in on controversial statements Trump has made in recent weeks about Mexican immigrants and the war record of Sen. John McCain, R-Ariz. who was taken prisoner in Vietnam. Obama brought up on his own Trumps suggestion that McCain wasnt a war hero because he was captured. Praising McCains heroism, the president said Trumps remarks grew out of a political culture where those types of comments are tolerated. When outrageous statements are made about me, a lot of people outraged about McCain were pretty quiet, he said. Obama has a long history with Trump, who was a driver of the birther movement that claimed the president wasnt born in the U.S. Trumps claims pushed Obama to release a copy of his birth certificate in 2011. Asked on Foxs Hannity to respond to Obama, Trump called the president very divisive and said he should have devoted more time to working on a good nuclear deal with Iran instead of what hes doing. For years, Trump has been a sought-after surrogate and fundraiser for GOP candidates. As a candidate himself, hes unexpectedly emerged this summer as a leading contender for the GOP nomination, tapping into voters discontent with Washington. While some GOP candidates stepped up their criticism of Trump after his comments on McCain  South Carolina Sen. Lindsey Graham called him a jackass  the businessmans standing with voters does not appear to have been significantly damaged. He is still expected to be among the 10 candidates who qualify for the first Republican debate on Aug. 6 based on their standing in national polls. ", "Date": "20150727", "Author": "[JULIE PACE]", "Link": "http://www.seattletimes.com/nation-world/obama-chides-2016-candidates-for-ridiculous-sad-remarks/", "Title": "[Obama calls GOP criticism of Iran deal ridiculous, sad]"}