{"Content": "[ CENTRAL, S.C. (AP)  South Carolina Sen. Lindsey Graham opened his campaign for the Republican presidential nomination Monday with a grim accounting of radical Islam running wild in a world imperiled also by Irans nuclear ambitions. He dedicated himself to defeating U.S. adversaries  a commitment that would place thousands of troops back in Iraq, essentially re-engaging in a war launched in 2003. Ive got one simple message, he told supporters in the small town where he grew up. I have more experience with our national security than any other candidate in this race. That includes you, Hillary. In that fashion, he took on Democratic candidate Hillary Rodham Clinton  the former secretary of state  as well as non-interventionists in his own party and rivals with little to no foreign policy experience. Graham, 59, becomes the first candidate in either party to hail from one of the first four states that cast presidential primary ballots. Iowa and New Hampshire lead the process, followed by South Carolina and Nevada. Having won his third term in November, Graham is a prominent Senate voice in seeking a more muscular foreign policy and one who casts the threats facing the United States in particularly dark terms. Simply put, radical Islam is running wild, he said. They have more safe havens, more money, more weapons and more capability to strike our homeland than any time since 9/11. They are large, they are rich, and theyre entrenched. He said as president, hed make them small, poor and on the run. Im afraid some Americans have grown tired of fighting them, he said. I have bad news to share with you  the radical Islamists are not tired of fighting you. Despite his focus on Islamic State militants with footholds in those two nations, Graham said Iran poses the gravest threat. If the U.S. does not head off a nuclear capability in Iran, Graham said, Iran will trigger a nuclear arms race in the least stable region on Earth, and make it more likely that people who aspire to genocide will have the most effective means to commit it. He said recently there is no avoiding the reality that more Americans will have to fight and die to defend the country. His approach contrasts with that of fellow senator and presidential candidate, Kentuckys Rand Paul, who favors less military intervention. And his blunt talk about more troops and casualties stands out even among other Republican contenders who promise to quash Islamic State militants, but sidestep details. Polls suggest a majority of American adults support military action against the group commonly called ISIS. But support drops when respondents are asked specifically about a ground war. Graham came to Congress an outspoken member of the conservative freshman class that brought Republicans a majority in 1994. Yet hes since joined with Democrats on some contentious votes. He backed a 2012 immigration overhaul and voted to end a 2013 partial government shutdown, for example. He also backed President Barack Obamas two Supreme Court nominees. That earned Graham enmity among some Republicans, but he said Monday his willingness to work with anybody is necessary. Graham said wealthier members of his generation will have to take fewer Social Security and Medicare benefits, while younger workers may have to work longer and pay more. We have to fix entitlement programs to make sure people who need the benefits the most receive them, he said. Thats going to require determined presidential leadership. That statement impressed Daniel Nichols, 35, of Central. You know, I think he may be right on Social Security, Nichols said. I wonder if hes being a little too truthful when he says that, though. Graham leaned heavily on his personal story Monday, delivering his speech in front of the building where he grew up and his parents ran a pool hall, bar and restaurant. Grahams parents died when he was in college, leaving him as guardian to his then 13-year-old sister, Darline. We depended on Social Security benefits to survive, Graham said. As president, Ill gladly do what it takes to save a program that once saved my family. Graham planned appearances this week in New Hampshire and Iowa if the Senate schedule lets him go. __, Associated Press reporters Alex Sanz and Meg Kinnard contributed to this report. ", "Date": "20150601", "Author": "[BILL BARROW]", "Link": "http://www.seattletimes.com/nation-world/starting-his-2016-campaign-graham-is-blunt-on-middle-east/", "Title": "[Lindsey Graham, who sees a world of peril, opens 2016 bid]"}