{"Content": "[ To begin: This is not a story about Ron Paul. Not exactly, anyway. And yet to get where we want to go we will start at OPA!, a Greek restaurant on the edge of town where Clark County Republicans and tea party conservatives gathered on Nevada primary night for what looked undeniably like a Ron Paul rally. In one corner was Cindy Lake, the acting chair of the Clark County Republican Party and a delegate to this summers Republican National Convention. A self-described libertarian Republican constitutional conservative, Lake became a Paul convert in 2007 after she heard him advocate for something she passionately supports: the freedom to buy raw milk. Nearby stood Megan Heryet, celebrating her GOP primary victory in a state Assembly race. Heryet, a real estate agent, substitute teacher and mom, is hardly a Paul fanatic. But she did back him in Nevadas caucuses earlier this year, primarily because she is a big proponent of being free to make decisions such as choosing to give birth to her second child at home instead of a hospital. Its about being left alone, she said. And there were the Bunce brothers, Richard and Carl, who marshaled a four-year Paulist takeover of the Nevada Republican Party. The tax system is their biggest irritation. This is the land of the free, said Carl. How free are we when weve got a government that can choose how much money we keep in our paycheck?, But we promised this wouldnt be about Ron Paul and, in fact, it really isnt. Rather its about unpasteurized milk and home births and taxes and, yes, freedom. Somethings going on in America this election year: a renaissance of an ideal as old as the nation itself  that live-and-let-live, get-out-of-my-business, individualism vs. paternalism dogma that is the hallmark of libertarianism. Paul, the Texas congressman and GOP presidential hopeful who champions small government and individual liberty, is one manifestation of it. We saw that with his rising popularity during the Republican presidential primary season and, now, the recent takeovers of political conventions in Nevada, Minnesota, Maine, Louisiana and elsewhere that will result in a sizable faction of Paul delegates at the GOP convention come August. There are questions of how all of that might affect the choice of a GOP vice presidential candidate and the Republican Party platform. But what looms are far larger questions about whether an America fed up with government bans and government bailouts  with government, period  is seeing a return to its libertarian roots. And, if so, what that might mean in a potentially close presidential race and long after election 2012 is a mere memory. Theres this kind of growing distrust of the institutions of government, and so it leads folks to step back and say, `Well if theyre not working, then we ought to have less of them in our lives, said Wayne Lesperance, director of the Center for Civic Engagement at New England College in the Live Free or Die state of New Hampshire. Pauls libertarian message joins people who probably under any other circumstances would not see the world the same way and gets them politically involved, Lesperance said. It is a challenge for the Republicans to wrap their arms around this and harness this in a way that gets them an electoral victory. This will all be hotly debated this coming week as thousands converge on the Las Vegas Strip for a libertarian fete called FreedomFest. U.S. Sen. Rand Paul  Rons son and the future hope of many limited-government enthusiasts  will speak, along with a slew of libertarian-leaning politicians, scholars, economists and entrepreneurs, from Whole Foods CEO John Mackey and publisher Steve Forbes to Gary Johnson, the Libertarian Partys nominee for president. When the festival first began in 2002, some 850 people attended. Last year, there were 2,400. Festival founder and economist Mark Skousen will tell you this is a sign, albeit a small one, that libertarianism  or something an awful lot like it  is surging. It is a rebirth, said Skousen, and a reaction to a feeling shared by many that America has moved too far afield from its founding principles. This country was established for the very thing that were fighting right now: excessive government control of our lives. In todays world everything is either prohibited or mandated.  You have to have medical insurance. You have to wear a seat belt.  They have to pat you down (at the airport). Skousen has a simple analogy for all of this: If you restrict a teenager, they rebel. I think thats what people are feeling. Libertarian at its essence means an advocate of the doctrine of free will and individual liberty. Or, as the Libertarian Party states on the banner of its website: Minimum Government, Maximum Freedom. Just how many Americans actually endorse the philosophy has never been easy to measure. The Libertarian Party claims some 250,000 registered voters among the more than 235 million voting-age Americans. While there are few capital L Libertarians, many others clearly have libertarian-like views that favor a fiscally conservative, socially tolerant way of governing. The philosophy  religious freedom, self-governance, a representative democracy that responds to the will of the people instead of ruling over the people  has been a part of the fabric of America since the 13 colonies waged a war for political independence from Britain. The American political culture from the beginning, and certainly at the time of the Constitution and the Declaration of Independence, was what would be called libertarian, said John Samples, director of the Center for Representative Government at the libertarian think-tank Cato Institute. That is: It was concerned about limiting government; it was concerned about individual liberty. The American West, and Nevada especially, has long embodied those tenets  whether in the independent spirit that pervaded the frontier or, later, in the tenacious fights with the federal government over property rights and land that became known as the Sagebrush Rebellion. The Libertarian Party itself was formed in Colorado in 1971 by a small group of citizens fed up with the two major political parties. They were compelled not only by their opposition to the Vietnam War but also President Richard Nixons imposition of a wage and price freeze on Americas free-market economy as a way to combat inflation. In its annual governance survey conducted last fall, Gallup found that a record-high 81 percent of Americans were dissatisfied with the way the country was being governed. There were increases, too, in the responses to questions that gauge a more libertarian-view of governance: A record 49 percent said they believed government posed an immediate threat to the rights and freedoms of ordinary citizens; 57 percent believed the federal government had too much power; and 56 percent said they would be willing to pay less in taxes and accept fewer services (a position advocated during the campaign by Paul). But do we really need numbers to confirm the strong libertarian-like streak running through the nation of late? Instead, just look to the rise of the tea party with its smaller-government, back-off mantra. Or take in some of the signs posted along U.S. roads these days, like this one outside of Wickenburg, Ariz.: Choose Freedom. Stop Obamacare. Or consider the backlash after New York City Mayor Michael Bloomberg proposed banning large servings of sugary sodas. The libertarian message is especially attractive to younger Americans who are war-weary, socially liberal and skeptical of government interference in their lives. Theyve grown up paying into Medicare and Social Security but hearing  endlessly  that theyre unlikely to receive the benefits of those programs. They see many government initiatives as unnecessary evils, and believe social issues such as abortion and gay marriage are matters of personal choice not political debate. Many pondered why Ron Paul, at 76 years old, attracted throngs of 20-somethings to his rallies and, according to exit polls, consistently won the 18-29 age bracket early in primary season in states such as New Hampshire and Iowa. Twenty-six-year-old Alexander McCobin has a response for that: This is the most libertarian generation thats ever existed, and its because libertarianism is just correct. Four years ago, McCobin co-founded the group Students For Liberty, which now has some 780 affiliates. He was first turned on to the philosophy in ninth grade when his father gave him a copy of the Ayn Rand novel Atlas Shrugged, the story of a fictionalized United States on the brink of collapse amid economic depression brought on by increasing government interference and regulations. At 18, McCobin registered with the Libertarian Party. He plans to vote for Johnson come November, though he believes the outcome of any single presidential race is far less important than spreading the message of libertarianism. Ever since the original Bush bailouts and then Obamas program and everything being done by both the Republicans and Democrats to grow government, its starting to open a lot of eyes, said McCobin, a doctorate student in philosophy at Georgetown. Theyre looking for an alternative narrative for whats going on in the world and realizing that libertarianism provides an explanation for whats happening  and a solution to it. Certainly none of this means that Americans are rushing en masse to change their party affiliation. But it does make for some interesting questions about how this mindset might exhibit itself in the presidential election, especially if the race between President Barack Obama and Republican Mitt Romney is a squeaker. In a 2010 paper, Cato concluded that libertarians are increasingly a swing vote  a bigger share of the electorate than the much discussed `soccer moms of the 1990s or `NASCAR dads of the early 2000s, and bigger than many of the micro-targeted groups pursued by political strategists in the 2004 and 2008 elections. Many of these voters would describe themselves as independents, a group that both candidates desperately need in order to win, said Samples. The libertarian view of limited government and free market economics usually pushes these voters toward Republican candidates, even if their social views are more in line with the Democratic Party. But as the Cato study pointed out, such voters are not firmly committed to either of the two major parties. It noted that during the George W. Bush years, libertarian-minded individuals moved away from the GOP in response to ongoing wars, government spending and social conservatism, but they returned in 2008 because they believed Obama was a big-government liberal. Samples thinks the 2012 election will look much like 2008. The unknown, of course, is Johnson, who is working to ensure his name is also on the ballot in all 50 states. Paul supporters may very well desert the GOP for Johnson, especially in Western states where the former two-term New Mexico governor is better known. A June poll in the swing state of Colorado showed Johnson garnering 7 percent support, mostly coming from potential Romney backers. Brian Doherty, a senior editor at the libertarian magazine Reason and author of a new book about Ron Paul, predicts that most Paul supporters wont vote at all for a presidential candidate, which doesnt mean theyre disengaging but that they wont give their support to someone they dont believe in 100 percent. He and others take the position of McCobin  that the election itself is far less important than effecting lasting philosophical change over policy and politics. Big L Libertarians hope their party will be the vehicle for that, and activists such as Wayne Root  the partys 2008 vice presidential nominee  are looking to bring more people into the fold by emphasizing fiscal policy over more controversial libertarian issues such as decriminalization of marijuana. Root writes a libertarian blog from his home outside of Las Vegas and calls himself a commonsense suburban Libertarian who supports home-schooling, low taxes and personal freedom (a la legalized online gambling). He is looking to make his own run for president in 2016 or 2020. A longtime Vegas oddsmaker, Roots prediction is the American public will be ready for a viable third-party candidate sooner rather than later. Whats that old saying? First they mock you, then they imitate you and then they become you, he said. And thats how I feel about libertarianism. For others  all of those Ron Paul backers, in particular  the means to an end is working within the Republican Party to fundamentally transform it, quieting cultural conservatives and emphasizing instead a message of fiscal responsibility and social tolerance that could attract new blood. In Nevada, that translated into so-called Paulists winning seats first to several county GOP committees, then to the state Republican committee. Now both of the states representatives to the Republican National Committee are libertarian-leaning, as are 22 of the 28 delegates heading to the GOP convention in Tampa. Places like Maine, Minnesota and Iowa have followed that model. Ron Paul supporters are now a near-controlling majority of the Maine Republican Party, said Brent Tweed, 33, a nuclear engineer and self-described libertarian conservative who was elected a GOP convention delegate. Tweed started researching libertarianism in 2004 after growing disillusioned with the size of government under President Bush. He sees the movement growing in Maine and beyond. We will only get bigger and, eventually, we will win. Do I think its going to happen in five years or 10 years? No. But I think its inevitable, he said. People will be drawn to the freedom message. In Nevada, the Bunce brothers liken their efforts to training a farm team. Their goal is to get libertarian-minded politicians elected to county and state office, then to Congress and perhaps, one day, the White House. Not unlike the man they revere, they know that not so long ago they were considered on the fringe of politics in their state. Now they are inside players, controlling the infrastructure of the Republican Party at both the state level and in places like Clark County, Nevadas largest. To any remaining naysayers, they warn that this is neither a passing fad nor a Ron Paul phenomenon that will fade once hes gone from the scene. They see hope in other up-and-coming libertarian-leaning Republicans: Justin Amash, a Michigan congressman seeking re-election whom Reason magazine christened the next Ron Paul; Kurt Bills, a Minnesota state representative who is running for U.S. Senate; and, of course, Rand Paul. Everything weve done up to this point is based on ideas.  It carries on well past Congressman Paul, said Carl Bunce. Hopefully well start to bring more voters to bear into the Republican Party  all those apathetic voters that were like myself. When that happens, he said, our ideas of liberty and freedom will persist. , Pauline Arrillaga, a Phoenix-based national writer for The Associated Press, can be reached at features(at)ap.org. .]", "Date": "20120707", "Author": "[Pauline Arrillaga]", "Link": "http://www.seattletimes.com/seattle-news/politics/with-freedom-in-fashion-is-libertarianism-back/", "Title": "[With freedom in fashion, is libertarianism back?]"}