{"Content": "[ OLYMPIA  Many people would be thrilled to get an 11 percent pay raise over two years. But if youre a Washington state lawmaker, stuck in a special session over budget disagreements and likely to hand out far smaller pay hikes to teachers and state workers, its kind of awkward. Regardless, legislators are on tap to get an 11.2 percent pay raise, courtesy of the states independent citizen salary commission. Horrific timing, said Rep. Chris Reykdal, D-Tumwater. Its just an incredibly awkward situation, said Rep. Matt Manweller, R-Ellensburg. The Washington Citizens Commission on Salaries for Elected Officials  which has sole authority to set pay for lawmakers and statewide elected officials  approved a series of pay increases on Wednesday that also included the governor and judges. The commission, a nonpartisan group of citizens from the states 10 congressional districts, as well as other experts, approved the increase for legislators on a 10-5 vote. We thought there was some catching up to do, board member Melissa Albert said. We dont want to have a Legislature made up of only people who are independently wealthy. The initial pay bumps would go into effect Sept. 1, unless the decision is challenged by a citizens referendum. The raise  the first since 2008 and fleshed out over months of study and discussion  came after two proposals for smaller increases for state lawmakers failed. The new pay schedule comes as legislators are halfway through a special session to negotiate a two-year state operating budget that is expected to include raises for state workers and teachers far short of 11 percent. Negotiated or arbitrated contracts, which must be approved by lawmakers, would raise most state worker pay by about 5 percent over two years. Reykdal said lawmaker salaries shouldnt be set until after the Legislature decides on those contracts and teacher pay increases. Manweller said there were good intentions behind setting up the independent salary commission to depoliticize lawmaker pay, but, I dont know if its worked. This is a situation where I did not ask for it (a raise), I have no control over it, he said. And yet I am going to get beat up for it, regardless. The new pay schedule increases the pay of a legislator to $46,839 a year by September 2016. They currently make $42,106. The four legislators in leadership earn $4,000 to $8,000 annually more. In arriving at pay, the commission looks at a wealth of data, including compensation for lawmakers in other states and cost-of-living studies. Gregory Dallaire, a salary- commission member, said it would be a different matter to give such a large pay hike if all lawmakers were making $50,000 or $60,000 a year. But, the salarys low already, Dallaire said. In 2014, Washington state lawmakers ranked 14th nationally in annual pay, according to a report by The Pew Charitable Trusts. Comparing states is tricky: Some states have full-time legislators while others are in session less than Washington state. Washingtons is considered a part-time Legislature. This years regular, budget-writing session lasted 105 days, and lawmakers are now in the middle of a 30-day special session trying to finish the job. Legislators in California earn the most: $90,526 a year. In New Mexico, lawmakers draw no salary and get $159 a day for expenses while in session, known as a per diem. Many states offer a per diem in addition to salaries; in Washington, lawmakers can claim $120 a day for expenses. You can judge the sentiment among some people over the pay raises by the number of capitalized words found in the written public comments collected by the salary commission. They can have the same percentage those cheapskates are going to give the REAL state workers, wrote one commenter. Wrote another: CANNOT FUND education programs to reduce class sizes  BUT there is money in the coffers for an 11.2% raise. Wow. Government is NOT about the people anymore, is it. While not advocating for any particular proposal, Senate Democratic Minority Leader Sharon Nelson, of Maury Island, told the commission in January that competitive pay helps retain lawmakers and the expertise they develop to work on complicated issues. Without that expertise, Nelson said, special-interest lobbyists gain greater influence in Olympia. Its a check and balance that comes into play daily, she said. The commission also approved raises for all nine statewide elected officials, as well as state Supreme Court justices and Superior Court, District Court and Court of Appeals judges. Gov. Jay Inslee will receive a 4 percent increase over two years, to $173,617 from the current salary of $166,891. The new salary schedule will likely be delivered to the state Secretary of States Office sometime in late May, according to David Ammons, spokesman for the office. At that point, members of the public wishing to challenge the decision have a 90-day window to file a referendum and collect 124,000 signatures to put the issue on the November general-election ballot.]", "Date": "20150513", "Author": "[Joseph OSullivan]", "Link": "http://www.seattletimes.com/seattle-news/politics/commission-approves-11-pay-hike-for-state-lawmakers/", "Title": "[Horrific timing: 11.2% pay raise for Washington lawmakers]"}