{"Content": "[ Fresh off a widely praised performance in the first Republican presidential debate, Florida Sen. Marco Rubio is set to make a campaign swing to Washington state next week. But dont expect to see or hear from him. The first-term U.S. senator is scheduled to attend a fundraiser at the Bellevue investment firm Steelhead Partners on Monday evening. Florida Sen. Marco Rubio, No public events have been announced, and Rubios campaign-communications director, Alex Conant, said there are no plans for media interviews during the stopover. The fundraising reception will cost donors $1,000 a person. Those who want access to a more exclusive roundtable talk must fork over $2,700 each, according to a copy of the invitation. Rubio will be welcomed by several veteran Republican activists and donors, including some who gave big to GOP nominee Mitt Romneys campaign in 2012. The hosts include Matt McIlwain, managing director of Madrona Venture Group; Diane Tebelius, an attorney and former congressional candidate; Wayne Perry, an investor who co-founded McCaw Cellular; and Bruce Chapman, co-founder of the Discovery Institute, a Seattle-based conservative think tank. Chapman, a former Washington secretary of state and Reagan administration aide, said hes impressed with Rubios rsum and called him a fresh face for politics who could lead the kind of turnover in Washington, D.C. that Ronald Reagan did. I want to see somebody nominated who can be a good president and who can win, said Chapman, stressing that he was not speaking on behalf of the Discovery Institute. A son of Cuban immigrants, Rubio, 44, rose quickly in the Florida Legislature and received national attention in 2010 when he defeated former Florida Gov. Charlie Crist to win a seat in the U.S. Senate. Some in the GOP see the youthful senator as a terrific matchup against presumed Democratic nominee Hillary Rodham Clinton. However, Rubio has faced scrutiny for personal financial struggles. And during Thursdays debate, he took a hard line against abortion, even in cases of rape or incest  a play for religious conservative voters which Democrats are sure to use against him if he advances to the general election. Mondays fundraiser is a do-over for Rubio, who canceled a scheduled event at the same investment firm in May, citing Senate business.]", "Date": "20150807", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/rubio-plans-fundraising-swing-into-bellevue-on-monday/", "Title": "[Presidential candidate Marco Rubio plans fundraising swing into Bellevue on Monday]"}