{"Content": "[ Its suddenly become crystal clear that Jeb Bush has his eye on the presidency. With just a few words, the former Florida governor stepped further into the 2016 Republican presidential contest than potential rivals, declaring via Facebook on Tuesday that he will actively explore the possibility of running. Some of those rivals, as well as veterans of presidential politics generally, saw his statement as a de facto announcement that ends months of speculation about his intentions. The son and brother of presidents, Bush is the early favorite of the Republican establishment wing, and his move puts immediate pressure on other establishment-minded GOP contenders to start competing with him for donors, campaign staff and national attention in a crowded field of potential contenders. I didnt expect to see this happen this quickly, said Gov. Terry Branstad of Iowa, where the first votes will be cast in January 2016 caucuses. For months, while other GOP prospects were in motion around the country, Bush largely avoided prominent political gatherings, instead pitching his education ideas to policy audiences and showing a little self-restraint about his ambitions. That began to change recently, and is destined to change more now. His announcement increases the chance of a dynastic presidential contest pitting him against Democrat Hillary Rodham Clinton, though a long and unpredictable Republican contest looms. The former first lady will be her partys overwhelming front-runner should she decide to run. Assessing the Bush family legacy, another likely candidate, Kentucky Sen. Rand Paul, said, The question is whether people will tire of having one family in charge of things. On a day when Bush riveted the attention of the political class, two more Republicans said they might run too. They are Sen. Lindsey Graham of South Carolina, a conservative with a maverick streak, and former New York Gov. George Pataki, a moderate. Both would be longshots. Conservative Sen. Tom Coburn, R-Okla. for one, questioned Bushs chances because of the lingering unpopularity of his brother, former President George W. Bush. I just dont see it, Coburn, who is leaving Congress, told reporters. Theres still hard feelings about George W. So you start out with a negative, because youve got the wrong last name. If he didnt have that last name, hed be a pretty good candidate. Bush has long been a favorite of establishment Republicans who care less about conservative ideology than reclaiming the White House. In a race likely to include fiery conservatives such as Sen. Ted Cruz of Texas and former neurosurgeon Ben Carson, Bush will occupy the middle ground despite his overwhelmingly conservative record as Floridas chief executive from 1999 to 2007. He also gives his party a powerful tool for courting the nations surging Hispanic population. Bush is married to a Mexican-American, speaks Spanish and has been among the GOPs most outspoken advocates for an immigration overhaul, including a pathway to citizenship for immigrants who are living in the country illegally. I think that Jeb has strong potential appeal to that sweet spot in the New Hampshire primary electorate, said former New Hampshire Republican Party Chairman Fergus Cullen. Let Rick Perry and Ted Cruz and six other candidates fight among themselves for the far right  it leaves a huge opening for someone to go right up the middle of the Republican Party. His road to the nomination may not be easy, however. Within hours of Bushs announcement, the head of the Conservative Action Fund launched a petition against him. Together, we can stop a Jeb Bush run and give America a real chance to elect a true conservative president, wrote Shaun McCutcheon. He said his organization would do everything possible to get the right candidate for the White House in 2016  and Jeb Bush isnt it. Julie Summa, an Iowa social conservative Republican, said Bush must explain in detail his positions on immigration and education to be a contender. We Iowans are an open minded, well-informed, forgiving bunch, Summa said. So If Jeb Bush can make a compelling case for why he believes the way he does, he could be a contender. ", "Date": "20141217", "Author": "[STEVE PEOPLES]", "Link": "http://www.seattletimes.com/nation-world/no-doubt-now-jeb-bush-eyeing-2016-race/", "Title": "[No doubt now: Jeb Bush eyeing 2016 race]"}