{"Content": "[ SAN FRANCISCO (AP)  It wasnt quite hipster Jeb Bush who arrived at a San Francisco startup via ride-share service Uber but the Republican presidential contender did his best Thursday to show hes not part of what he called the ho-hum stagnation of Washington. Bush told a town-hall event that as president, he would embrace the kind of bottoms-up thinking common in startup culture to shake up schools, health care and business culture. His message? Get Washington out of the way. He addressed about 75 employees of Thumbtack, a company that links customers to service providers such as house painters and photographers. The government today in Washington looks more like General Motors in 1975, he said. The government of the future needs to look more like Thumbtack. The former Florida governors fundraising swing through the Bay Area is meant to highlight differences with Democratic contender Hillary Rodham Clinton, especially in the realms of technology and business. Uber, for example, connects travelers with various cars through its smartphone app. It has come under fire for classifying its drivers as independent contractors, not employees, so they arent eligible for overtime pay, unemployment insurance or workers compensation. Clinton has promised to crack down on companies that wrongly classify workers as contractors. She has praised the so-called gig economy for creating exciting opportunities, but said it is raising hard questions about workplace protections. Bush said if companies such as Uber are violating laws and exploiting workers, there are ways to address it. The fact is, this is disrupting the old order. In taking questions from the audience, he also said he would repeal President Barack Obamas health care law in favor of a model that lets consumers select their own coverage, such as high-deductible, low-premium plans free of mandates. He called the Federal Communications Commissions latest efforts to regulate Internet broadband providers a stupid idea. Major Silicon Valley content providers such as Netflix support regulating the companies that provide Internet access. The audience was enthusiastic and polite, asking about firearms background checks, wages for women and discrimination against gays and lesbians. Bush said employers should not discriminate based on sexual orientation, but he would leave such laws up to states. Thumbtack co-founder and CEO Marco Zappacosta, who declined to say who would get his vote for president, said he does not know how many Republicans he has on staff. He was surprised when Bushs team called about a visit. I think the staff was excited that somebody wanted to come engage with us and that we would have a forum for asking them questions, he said. Bushs visit comes as a new Associated Press-GfK poll finds that negative views of the GOP candidate, the younger brother of former President George W. Bush, have ticked up. Forty-four percent say they have an unfavorable view, up from 36 percent in April. Among Republicans, 53 percent have a favorable view of Bush and 27 percent have an unfavorable view. After the visit, Bush took Uber again, to a fundraising luncheon in Silicon Valley. Eric Walker, a spokesman for the Democratic National Committee, pointed out that Ubers CEO has said the health care law has been critical to the success of the sharing or gig economies. Zero stars for Jeb Bush, he said.]", "Date": "20150716", "Author": "[Janie Har]", "Link": "http://www.seattletimes.com/nation-world/jeb-bush-takes-uber-to-san-francisco-startup/", "Title": "[Jeb Bush takes Uber to San Francisco startup]"}