{"Content": "[ WASHINGTON  In 2012, Antonio Weiss took his 15-year-old son, Nico, from the gilded aerie of their Manhattan apartment on Central Park West to Cleveland to canvass for President Obamas re-election. Weiss, 48, was also the co-author of a white paper calling for higher taxes on the rich and has donated hundreds of thousands of dollars to the Democratic Party. Yet in his Wall Street provenance, Weiss, Obamas nominee to be undersecretary of the Treasury for domestic finance, has given the left an unlikely rallying cry to press for a more aggressively liberal economic policy agenda. It is not Weiss politics that are in question. It is his rsum. I have voted for people who have extensive Wall Street experience, said Sen. Elizabeth Warren, D-Mass. She is rallying the opposition to Weiss, head of investment banking at Lazard, a storied but relatively small firm. But, she said, the Antonio Weiss nomination is a mistake, and thats why Im fighting back. The formal confirmation process, while not likely to get under way until after the new Congress convenes next year, has become an unexpected proxy war between the liberal and moderate wings of the Democratic Party. Its outcome will say a lot about the partys direction as it regroups for the 2016 presidential campaign, in which Hillary Rodham Clinton will be under pressure to discard some of her ties to Wall Street. At Lazard, Weiss was involved in a number of international megamergers, including a deal that allowed Burger King to acquire the Canadian chain Tim Hortons in a maneuver that gave the combined company a lower tax liability in the United States. And in doing so, he made a lot of money. Weiss assets are worth between $54 million and $203 million, according to his financial disclosure. In addition to his Manhattan apartment, he owns a 200-year-old, eight-bedroom farmhouse in Connecticut and property in the Dominican Republic valued at up to $1 million. To Warren and her allies, Weiss nomination was proof that their anti-Wall Street views are still getting no respect within the Obama administration. While they managed to derail Obamas moves to nominate Lawrence Summers, his former Treasury secretary and economic adviser, as chairman of the Federal Reserve, they say Weiss confirmation by the Senate would send the wrong signal about whether Democrats can advance the economic prospects of the struggling middle class. The American people are profoundly disappointed with the fraud they read about every day coming from Wall Street, said Sen. Bernie Sanders, I-Vt. who is considering running for president as a Democrat to encourage the party to move to the left. They are disgusted that instead of investing in the American economy, they are busy trying to avoid paying their fair share of taxes, and the American people want people in the Treasury Department who are prepared to hold Wall Street accountable. Supporters of Weiss, both inside and outside the Obama administration, see the brewing fight as no less consequential. Wall Street executives lend the Treasury Department real-world expertise to understand how policy proposals might be gamed by the banks and investment houses they are aimed at.  Weiss defenders say he is being caricatured as a rapacious banker when he is more Daddy Warbucks than Gordon Gekko. He combines financial expertise with a liberal outlook and an intellectual panache that led to his becoming publisher of The Paris Review. Neera Tanden, president of the Center for American Progress, a Democratic research and advocacy group, recalled Weiss working on an economic policy paper for her organization that called for sharply higher taxes on the wealthy, an overhaul of the corporate tax code that would raise revenue for deficit reduction and changes to the individual tax code to make it more progressive. Weiss declined to comment for this article, citing his pending confirmation hearings. The particulars of Weiss background and policy views appear to matter far less than the optics. Weiss spent years in Paris as vice chairman of European investment banking at Lazard, then rose to global head of mergers and acquisitions. His deal making has included this years merger of tobacco giants Reynolds American and Lorillard, Berkshire Hathaways swallowing of H.J. Heinz last year, Googles 2011 takeover of Motorola Mobility and InBevs takeover of Anheuser-Busch in 2008. No deal is causing more trouble than Burger Kings inversion merger with Tim Hortons, which came just as the Treasury was proposing new rules to stop U.S. companies from reincorporating as foreign entities not subject to U.S. taxes. Lazard itself gave up its U.S. citizenship in 2005 to reincorporate in Bermuda, using a loophole the Bush administration later closed to deter copycats. Beyond Lazard, there is Weiss himself. To defenders like Tanden, his years in Europe made him acutely aware of the perils of wage stagnation and the obstacles to upward mobility. He grew up in New York, in a distinctly middle-class family. Both of his parents were teachers. He attended Yale and Harvard Business School, while also apprenticing under George Plimpton, the editor of The Paris Review. Where supporters see brio, detractors see a fat cat. Last week, the AFL-CIO president, Richard Trumka, sent a letter to Lazards compensation committee chairman, Philip Laskawy, via the companys Bermuda affiliate, questioning his decision to speed the vesting of equity income to ease Weisss transition to public service. If he is confirmed as the undersecretary, Weiss will receive $6 million to $30 million in stock that would normally accrue to him in 2017 and $3 million in interest income, according to the Project on Government Oversight. But beyond that is the Warren wings belief that Democrats must realign their economic policies with the interests of working-class voters, particularly white men without college degrees, who have flocked to the Republican Party in recent years. ]", "Date": "20141207", "Author": "[Jonathan Weisman]", "Link": "http://www.seattletimes.com/business/left-wing-war-over-wall-street-nominee-to-treasury-post/", "Title": "[Left-wing war over Wall Street nominee to Treasury post]"}