{"Content": "[ NEW YORK (AP)  Hillary Rodham Clinton formally kicked off her presidential campaign on Saturday with an enthusiastic embrace of her potential to become the first woman to win the White House, asking supporters gathered at an outdoor rally to join her in building an America where we dont leave anyone out, or anyone behind. With the downtown New York skyline and new World Trade Center over her shoulder, Clinton offered herself as a fierce advocate for those still struggling from the Great Recession. She promised to carry on the liberal legacies of President Barack Obama, and former Presidents Franklin D. Roosevelt and Bill Clinton, her husband, saying real and lasting prosperity must be built by all and shared by all. While Clinton ended her first campaign for president in 2008 by conceding she and her backers werent able to shatter that highest, hardest glass ceiling, she vowed Saturday to push ahead toward an America where a father can tell his daughter: Yes, you can be anything you want to be  even president of the United States. I think you know by now that Ive been called many things by many people, Clinton said to cheers and laughter from the crowd of roughly 5,500 gathering on Roosevelt Island in the East River. Quitter is not one of them. The 67-year-old former secretary of state, first lady and Democratic senator from New York did not make her gender a core element in 2008, but it provided the cap to the first major speech of her 2016 bid. I will be the youngest woman president in the history of the United States. And the first grandmother as well, she said. Two months after starting her campaign with a simple video that showed her only briefly, Clinton outlined a broad vision intended to attract the coalition of young and minority voters that propelled Obama to two victories. In her roughly 45 minute speech, Clinton laid out a wish list of Democratic policies: universal pre-K education, increased regulation of the financial industry, paid sick leave and equal pay for women, a path to citizenship for immigrants living in the country illegally, campaign finance overhaul and a ban on discrimination against gay people and their families. In doing so, Clinton tried to cast the 2016 election as a choice about the economic future of the middle class, saying the Republican field is singing the same old song. The GOPs candidates, she said, want to give Wall Street banks free reign, take away health insurance, turn their backs on gay people and ignore the science of climate change. Fundamentally, they reject what it takes to build an inclusive economy, Clinton said. It takes an inclusive society. What I once called a village that has a place for everyone. Republicans jumped on Clintons decision to cite her ties to Obama and were trying to raise money off the speech almost as soon as it ended. In an email appeal asking for donations, former Texas Gov. Rick Perry wrote, We want to look toward a brighter future, not backward at the failed policies of the Obama-Clinton years. As part of an effort to reintroduce herself to the public, Clinton stressed her career of advocacy  a calling she said was inspired by her mothers difficult upbringing. After the rally, she traveled to Iowa for a house party event Saturday night, where she urged supporters to sign up to help her campaign. The event was streamed online to more than 600 launch parties around the country, part of a tour of early-voting states this week. There, she will focus on her relationship with her mother and her fathers background as a veteran and small businessman. Clinton is the dominant front-runner for the nomination in a race that also includes Sen. Bernie Sanders of Vermont, former Maryland Gov. Martin OMalley and former Rhode Island Gov. Lincoln Chafee. Clintons aides said she plans to give a policy address almost every week during the summer and fall. New York has one of the highest rates of income inequality in the country, so Clintons remarks here could foreshadow a campaign that will draw contrasts with rivals over who best can provide de for the countrys economic security. Prosperity cant be just for CEOs and hedge fund managers, Clinton said. You brought our country back, now its time your time to secure the gains and move ahead. Yet the Clinton familys financial history makes some in her party skeptical of her populist credentials. Both Clintons have earned millions in speaking fees, including some from Wall Street banks, and daughter Chelsea and her husband have worked at hedge funds. Clinton spoke about foreign policy for the first time in any significant detail since returning to presidential politics. As Obamas first secretary of state, Clinton said she stood up to Russian leader Vladimir Putin and was in the White House Situation Room the night Osama bin Laden was killed. Here, too, Clinton tried to set herself apart from the more than dozen Republicans who plan to run and have focused, early in the campaign, on the threats the nation faces overseas. There are a lot of trouble spots in the world, but theres a lot of good news out there, too, Clinton said. Clinton remained silent on some issues of critical importance to the Democratic base, most notably a Pacific Rim trade pact backed by Obama but opposed by organized labor, liberals and others who say it will cost the U.S. jobs. The omission didnt go unnoticed in Iowa and New Hampshire, where Sanders and OMalley were campaigning. Both are against the trade deal, and Sanders again hammered Clinton for refusing to say where she stood while touting his support from organized labor. I want to say this: The president is dead wrong on this issue, but he has come out for it, Sanders said. Most Democrats in the Congress are against it. But I dont understand how you dont have a position on this issue. ", "Date": "20150613", "Author": "[Lisa Lerer]", "Link": "http://www.seattletimes.com/nation-world/hillary-clinton-urges-new-era-of-shared-american-prosperity/", "Title": "[Clinton kicks off 2016 bid, embracing chance to make history]"}