{"Content": "[ Washington Republicans leaders have decided to boost the stakes for next years May presidential primary by awarding the states 41 Republican National Convention delegates based on the primarys results. GOP officials made the decision to heed the results of the May 24 primary at a meeting in Pasco over the weekend, according to party spokesman Steve Beren. The move breaks with some previous election cycles in which the GOP allocated some or all delegates based on precinct caucuses, which typically draw far lower voter participation. Its also a contrast with the state Democratic Party, which intends to continue a tradition of ignoring primary results and awarding its presidential delegates based on its March 26 caucuses. Democrats have objected to the state spending $11.5 million on the primary, arguing there are better uses for that money. The states presidential primary was canceled in 2012 due to budget concerns. Democrats blocked a request by Secretary of State Kim Wyman, a Republican, to move up the date of the primary to March. Republicans had argued the primary would be more likely to draw presidential candidates to the state if it were held earlier. Republicans will still hold precinct caucuses Feb. 20 to elect precinct-level delegates, who will be winnowed down at subsequent county and state conventions. The national delegates will be bound by the primary results on a first ballot at the 2016 GOP convention, Beren said. The 2016 Republican convention, which will formally nominate the partys presidential and vice-presidential candidates, is July 18-21 in Cleveland. Washingtons 41 national GOP delegates will be awarded proportionally to presidential candidates who fare best in the May 24 primary. Eleven will be awarded based on statewide results. Three delegates will be awarded in each of the states 10 congressional districts, based on results in each district. In addition to the 41 up-for-grabs delegates, three top GOP leaders will go to the convention as automatic delegates.]", "Date": "20150913", "Author": "[Jim Brunner]", "Link": "http://www.seattletimes.com/seattle-news/politics/gop-presidential-primary-to-determine-states-delegates/", "Title": "[GOP presidential primary to determine states delegates]"}