{"Content": "[Caption, Close, Denton County Judge James DePiazza now requires couples seeking his services in marriage to sign a form acknowledging he does not support same-sex marriage. Dick CheneyPresident George W. Bushs no. 2 man was initially opposed to gays in the military, but changed his tune nearly a decade later. \"With the respect to the question of relationships, my general view is freedom means freedom for everyone,\" he told the Associated Press. His lesbian daughter almost certainly played a role in evolving his views. Hes still one of the few prominent Republicans to support extending gay marriage rights. Al GoreFor a good length of time, the former vice president supported the concept of same-sex unions but not same-sex marriages. \"Im for domestic partnerships having legal protections, but not the same sacrament, not the same name, because I favor protecting the institution of marriage as it has been understood between a man and a woman,\" he said during a debate at Dartmouth College in 1999. But in 2008, Gore switched his tune when he outright said \"gay men and women ought to have the same rights as heterosexual men and women ... to join together in marriage, and I dont understand why it is considered by some people to be a threat to heterosexual marriage.\", Sen. Patrick Leahy, D-Vt.In 1996, Leahy voted YES on the Defense of Marriage Act, prohibiting same-sex marriage. Leahy later expressed regret on his decision, saying \"When I voted for DOMA in 1996, I believed that it was a way to allow states to maintain their independence and define marriage as each state saw fit.\" , Laura BushThe former First Ladys stance on same-sex marriage and abortion was a bit different than her husbands, according to her memoir \"Spoken from the Heart.\" In an interview with CNNs Larry King in 2010, Bush said, \"There are a lot of people who have trouble coming to terms with that because they see marriage as traditionally between a man and a woman. But I also know that, you know, when couples are committed to each other and love each other, that they ought to have, I think, the same sort of rights that everyone has.\", Sen. Patty Murray, D-Wash.Like so many other senators, Murray voted YES on the 1996 Defense of Marriage Act, prohibiting same-sex marriage. Murray later changed her stance, and in 2011 stated that she was planning to repeal the act entirely. It was noted that Murray never offered an explanation on why she voted for DOMA in the first place. John KerryStrangely, Kerry voted NO on the 1996 Defense of Marriage Act, but would later say states should be able to decide if they would allow same-sex marriages during his presidential campaign. In 2004, he went on record saying that while he supported same-sex unions, he believed marriage was between a man and a women. In 2011, Kerry quietly came out in support of same-sex marriage to the Boston Globe in an editorial. Bill ClintonThe former Arkansas governor and U.S. president unceremoniously signed the Defense of Marriage Act into law in 1996 despite calling it \"gay-baiting.\" Years later, he said the law should be overturned, though some in the LGBT community are still upset that he signed into being in the first place, the New York Times reported. Jimmy CarterAfter long supporting same-sex marriage, the former U.S. president confused many following an interview with Dallas WFAA-TV. In that interview, Carter flip-flopped on the issue, saying states, rather than the nation as a whole, should decide on legalizing same-sex marriage. \"I dont think that the government ought to ever tell the church to marry people, if the church doesnt want to ... Im kind of inclined to let the states decide individually.\", Vice President Joe BidenPrior to angering President Barack Obamas campaign staff in 2012 by openly supporting same-sex marriage, Biden issued support for same-sex civil unions but not marriage during a debate with Sarah Palin in 2008. In 2013, he repeated his support for same-sex marriage in an interview with Rolling Stone Magazine, saying \"Remember, I got criticized for saying I support gay marriage. I just decided I couldnt be quiet about it anymore, and everybody was stunned that thats where the public is. And Im not stunned; its where the publics been for a while. Talk to any of your kids, for Gods sake.\", President Barack ObamaIn 2006, Obama expressed opposition to same-sex marriage, but supported the concept of civil unions, saying churches and faith groups should be able to decide whether to call them marriages or not. In 2013, he regretted his distinction between unions and marriages. \"Ive always believed that gay and lesbian Americans should be treated fairly and equally. I was reluctant to use the term marriage because of the very powerful traditions it evokes. And I thought civil union laws that conferred legal rights upon gay and lesbian couples were a solution ... What Ive come to realize is that for loving, same-sex couples, the denial of marriage equality means that, in their eyes and the eyes of their children, they are still considered less than full citizens.\", Sen. Harry Reid, D-Nev.In 1996, Reid voted YES on the Defense of Marriage Act, prohibiting same-sex marriage. His views must have evolved since then because in 2013, following the Supreme Courts ruling to strike down DOMA, he called it a \"great, historic day for equality in America.\"Source: Politico, Jon Huntsman, Jr.Just prior to the 2012 presidential election, Huntsman supported the concept of same-sex unions. A year later, he wrote in an editorial for the American Conservative that he was for same-sex marriage and encouraged others to do so as well. \"While serving as governor of Utah, I pushed for civil unions and expanded reciprocal benefits for gay citizens. I did so not because of political pressure--indeed, at the time 70% of Utahns were opposed--but because as governor my role was to work for everybody, even those who didnt have access to a powerful lobby ... That was 4 years ago. Today we have an opportunity to do more: conservatives should start to lead again and push their states to join the nine others that allow all their citizens to marry.\", Hillary ClintonThe former First Lady expressed support for the Defense of Marriage Act in 1996, but supported same-sex civil unions and benefits for same-sex partnerships. In 2014, she claimed to have since evolved her views in support of same-sex marriage. \"I think youre reading it very wrong,\" she told CBS News. \"Just because youre a politician doesnt mean youre not a thinking human being. You gather information, you think through positions, youre not 100 percent set, thank goodness, youre constantly re-evaluating where you stand. That is true for me. One of my big problems right now is that too many people believe they have a direct line to the divine and they never want to change their mind about anything.\", Denton County Judge James DePiazza was on vacation when the U.S. Supreme Court ruled his office had to provide marriage licenses to same sex couples. That made DePiazza uncomfortable. He didnt believe it was right to marry same sex couples, and his first thought was to stop doing weddings outright to avoid discrimination. But he scrapped that plan and opted to publish a document, signed by brides- and grooms-to-be, acknowledging his opposition gay marriage. \"Judge DePiazza prefers to NOT conduct same-sex ceremonies, but will not decline anyone who chooses to schedule with him,\" says the form, which bears two blank lines for the couple to sign. \"While we may not necessarily agree with, we acknowledge Judge DePiazzas position that he prefers not to conduct same-sex marriages and agree not to address the topic of same-sex marriages with Judge DePiazza before, during or after the ceremony.\", RELATED:45 gay couples marry in mass Houston wedding, \"During the ceremony the topic is really not up for discussion,\" the judge said in an interview. DePiazza has been a judge in Precinct 2 of Denton County since 2007. A Catholic and a graduate of San Antonios Wayland Baptist University (as well as the University of North Texas), he said condoning same-sex marriage violated his religious beliefs. But he steered clear of the route briefly advocated by Texas Attorney General Ken Paxton, who said in the days after the court ruling that Texas state employees could claim religious freedom to deny marriage licenses to same-sex couples. Instead, DePiazza issued the document to make sure everyone knows how he feels about the marriage before he officiates it. \"Its to let them know where I stand. I would want to know that if I was getting married,\" he said. \"There are some couples of the same sex who dont want to be married by someone who doesnt believe in same sex marriage.\", The document also has couples acknowledge that their ceremony will be \"a brief formal declaration of civil marriage,\" not the traditional marriage. It also prohibits photography of the ceremony, instead saying couples can use the courtroom to take pictures after their ceremony. \"I decided that for my own privacy,\" DePiazza said. \"Because people take pictures and can doctor them or take little snippets out of video to warp what happened.\", RELATED:Pastor Protection Act seen as posturing for likely legalization of same-sex marriage by SCOTUS, The move has landed DePiazza in some hot water. The Dallas Observer consulted Katherine Franke, director of private rights at Colombia Universitys law school, and reported that the new document probably wouldnt stand up in court, because same sex couples are fully-qualified to receive public benefits of marriage. DePiazzas Facebook page has also attracted some internet rage. \"You are not fit for public office if you choose to discriminate by making my friend sign a document stating you are performing his marriage even though it is against your personal beliefs. Its your job, and has nothing to do with your personal beliefs,\" wrote one user on DePiazzas profile. \"Its not your marriage and doesnt affect you whatsoever.\", But the judge said he created the document \"out of respect\" for the people he would marry.]", "Date": "20150713", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/houston-texas/texas/article/Texas-judge-asks-same-sex-couples-to-sign-form-6381862.php", "Title": "[Texas judge asks same sex-couples to sign form acknowledging he disapproves of same-sex marriage]"}