{"Content": "[Caption, Close, Citing a stunted stance on equality for Texans, more than 2,300 people have signed an online petition to get Gov. Greg Abbott replaced as keynote speaker at next months spring commencement at the University of North Texas.See what Abbott calls his top priorities for Texas in the year ahead ... In the State of the State speech before a joint session of the Legislature, his first major policy speech, Texas new governor Greg Abbott outlined his priorities, including early childhood education. See his priorities for Texas. Beefed-up early education programs to ensure that children get a good start at life, along with changes to give parents more choice in where their kids attend school. Although he made no mention of vouchers, he spoke about successful open enrollment programs in several districts. Doubling the amount of state spending on border security, including 500 more troopers and more Texas Rangers to curb criminal activity, along with keeping National Guard troops along the border with Mexico until state police can ramp up their forces to take the soldiers place. Allowing school districts to opt out of some state education rules, to give local school districts more control over educating children. Adding an additional $500 million for higher-education research initiatives to strengthen Texas place in the future economy by attracting top programs and researchers to state universities. Putting an additional $4 billion in transportation funding to untangle gridlocked highways, ending diversion of highway funds to other budget purposes and dedicating half of the motor-vehicle sales tax to road projects. Reforming state ethics laws to require more public disclosure about the financial holdings of public officials, and more disclosure of campaign contributions. Calling for the costs of state government to be reduced, Abbott said he is cutting his own budget by 3 percent and called for most state agencies to do the same, with the exception of key public safety functions. Citing a stunted stance on equality for Texans, more than 2,300 people have signed an online petition to get Gov. Greg Abbott replaced as keynote speaker at next months spring commencement at the University of North Texas. \"Governor Abbott is an advocate for immigration reform, border patrol, and anti-equal marriage laws. This does not align the spirit of the University of North Texas which prides itself in providing equal opportunities for their students,\" the Change.org petition reads. So far, the university is not budging. \"Hes a new governor, hes supportive of higher education,\" University President Neal Smatresk told the Fort Worth Star-Telegram. \"Why wouldnt we want to celebrate the success of our institution in its 125th year with him?\", Abbott garnered 65 percent of votes in Denton County, home to the University of North Texas, during the 2014 general election, bettering the 59 percent he earned statewide. However, the countys strong Republican base doesnt mean locals always are in lock-step with Republican stances. On the same night voters in Denton County helped sweep Abbott into office for his first term as Texas governor, voters in the City of Denton were voting to ban hydraulic fracturing within the city limits, a controversial vote that limits production from traditionally GOP-friendly petroleum companies within the city. The vote divided the city and has led to a steady stream of challenges since. Full petition text:, \"The University of North Texas student body is made up of students from all walks of life. Therefore, it is pivotal that our keynote speaker be someone who reflects not only our student population but our views on equality and representation. Governor Abbott is an advocate for immigration reform, border patrol, and anti-equal marriage laws. This does not align the spirit of the University of North Texas which prides itself in providing equal opportunities for their students. While Governor Abbotts story is inspirational, his views on inequality cannot be overshadowed by this.  Our Mean Green Pride comes from being heard and respected.  Which is why we ask University President Neal Smatresk to find a new keynote speaker for graduation.\",  Change.org]", "Date": "20150409", "Author": "[John Boyd]", "Link": "http://www.chron.com/news/politics/texas/article/North-Texas-students-say-no-to-Greg-Abbott-6189372.php", "Title": "[North Texas students say 'no' to Greg Abbott commencement speech]"}