{"Content": "[Caption, Close, Republican presidential candidate, former Florida Gov. Jeb Bush talks to reporters at The Varsity restaurant during a campaign stop Tuesday, Aug. 18, 2015, in Atlanta. Republican presidential candidate, former Florida Gov. Jeb Bush, right, looks up at photos of celebrities who have visited The Varsity as he arrives at the restaurant for a campaign stop Tuesday, Aug. 18, 2015, in Atlanta. WASHINGTON (AP)  Jeb Bushs fundraising network is two generations in the making, and it shows. About half of the roughly $120 million raised to help him win the Republican presidential nomination comes from donors who previously gave to his brother or father, both former presidents, according to a new analysis of Federal Election Commission records by Crowdpac.com, a nonpartisan political research company. The finding puts a numerical exclamation point on the advantage Bushs presidential family gives him when it comes to fundraising. In Crowdpacs review of named contributors to three political committees helping Bush, $59.2 million came from first-time Bush donors, while $60.3 million came from returning donors to the earlier campaigns of President George W. Bush, President George H.W. Bush or both. There are more than 1,800 men and women who have given to all three Bushes over the years, Crowdpac found. These loyalists are spread across the country, with a heavy concentration in Texas, where the two presidents began their political careers, and in Florida, where Jeb Bush served as governor. One such Bush family stalwart is Dirk Van Dongen, president of the Washington-based National Association of Wholesaler-Distributors. Van Dongen said he is one of a \"huge\" network of volunteer fundraisers  called \"bundlers\" because they gather checks from friends and associates to turn over to campaigns  who sprang to action when Jeb Bush said at the beginning of the year that he was thinking about running. \"It is a vast network built over decades and it has grown even larger since Gov. Bush announced his candidacy,\" he said. \"No other Republican candidate comes close to matching it.\", Indeed, the money raised in the first six months of the year by Bushs campaign, leadership political action committee and super PAC is more than double that of anyone else in the 17-person Republican primary race. Fundraising materials for Jeb Bush show clear echoes of techniques his brother mastered. George W. Bushs 2004 re-election had a sales-force quality. Top George W. Bush money-raisers called \"Rangers,\" Pioneers\" and \"Mavericks\" were rewarded with perks like trips to meet with the president. Jeb Bushs top fundraisers fall into NASA-themed categories called \"Apollo,\" Endeavor\" and \"Voyager.\", Bush invited donors who raised at least $27,000 in the first two weeks of his campaign to a retreat last month at his familys property in Kennebunkport, Maine. About 300 of those donors mingled with the candidate and his top strategists in what attendees said had the feel of a family reunion, complete with Jeb Bushs parents as special guests. Jeb Bushs fundraising leadership team blends family stalwarts with newer names. Jack Oliver, one of the best-known fundraisers for George W. Bush, has the title of finance co-chairman. Woody Johnson, the New York Jets owner who began raising presidential money for John McCain in 2008, is his national finance chairman. Both the campaign and super PAC emphasize their success with new donors. A spokesman for the super PAC Right to Rise, Paul Lindsay, said it has a \"depth of support and diversity among our donors that spans many regions and backgrounds.\", \"The response you hear from donors, including those who have given to previous GOP presidential candidates, is that they want to back a winner and they believe Jeb is the best candidate in the field,\" Lindsay said. Right to Rise can accept contributions of any size from individuals, companies and unions. The campaign is limited to contributions of $2,700 per individual donor. Crowdpac, a year-old start-up based in Menlo Park, California, built a database that includes FEC and state-level campaign finance records. The federal contribution data it includes dates to 1980. Typically, federal donors are identified if they have contributed at least $200 per election cycle. Contributor information at the state level varies. The company also examined two other 2016 candidates with presidential campaign trailblazers in their families. Democratic front-runner Hillary Rodham Clinton and groups supporting her bid raised about $9 million, or 16 percent of their total receipts, from people who also donated to President Bill Clinton. Republican contender Rand Paul is receiving candidacy-sustaining financial firepower from his fathers donors: More than half the $8.9 million in pro-Rand Paul money that Crowdpac analyzed came from people whod given to former Rep. Ron Paul, R-Texas, who most recently ran for president in 2012. __, Follow Julie Bykowicz on Twitter at: http://twitter.com/bykowicz]", "Date": "20150822", "Author": "[Julie Bykowicz, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Legacy-Bush-donors-account-for-half-of-Jeb-Bush-s-6452255.php", "Title": "[Bush family donors gave half of Jeb Bush's presidential cash]"}