{"Content": "[Caption, Close, Republican presidential candidate, former Florida Gov. Jeb Bush, left, is interviewed by Dr. Russell Moore at the Send North America Conference, Tuesday, Aug. 4, 2015, in Nashville, Tenn. NASHVILLE, Tennessee (AP)  Republican presidential candidate Jeb Bush vowed Tuesday to cut off federal funding for Planned Parenthood if elected to the White House, but drew immediate fire from Democrats for adding, \"Im not sure we need half a billion dollars for womens health issues.\", Democratic frontrunner Hillary Rodham Clinton replied on Twitter, \"@JebBush: You are absolutely, unequivocally wrong.\", And Planned Parenthood issued a statement saying Bush \"told the rest of America what Florida women have known for years, which is that he doesnt believe womens health is worth much.\", Bush leapt at the chance Tuesday to prove his anti-abortion bona fides before a group of largely conservative Christian voters at a meeting of the Southern Baptist Convention. The former Florida governor was asked during an onstage interview, \"Shouldnt we ... say not one more red cent for Planned Parenthood?\", His response  \"The next president should veto Planned Parenthood\"  drew a loud ovation at the packed Bridgestone Arena. But his comments about money for womens health left Bush and his campaign cleaning up his remarks just hours later. He issued a statement saying he \"misspoke\" when speaking about womens health funding and was referring only to the \"hard-to-fathom $500 million in federal funding\" for Planned Parenthood. \"There are countless community health centers, rural clinics and other womens health organizations that need to be fully funded,\" Bush said. \"They provide critical services to all, but particularly low-income women who dont have the access they need.\", An earlier statement sent to reporters lacked Bushs assertion that he had misspoken. The campaign said the first version was a draft. But the latter statement, too, wasnt quite right. Planned Parenthood says of its $1.3 billion in revenue last year, $528 million came from taxpayers, but not all of it was federal money  some came from state funds that help finance Medicaid. Bushs campaign also included a statement from Rhonda Medows, the secretary of Floridas Health Care Administration agency during his tenure as governor. \"I watched his dedication to womens health issues and services first hand,\" Medows said. \"He was intent on improving the quality of care offered to women under our state health programs, and he enhanced access to vital services to women through new access points.\", And Bush shot back at Clinton on Twitter, too, writing, \"whats absolutely, unequivocally wrong is giving taxpayer $ to an org whose practices show no regard for lives of unborn.\", At an organizing event later in Denver, Clinton added, \"Now hes got no problem giving away billions of dollars to super-powerful and wealthy corporations, but I guess womens health just isnt a priority for him.\", Vermont Sen. Bernie Sanders, whos challenging Clinton for the Democratic presidential nomination, slammed Bush in a fundraising email Tuesday and said, \"We need to be spending a lot more money on womens health care.\", The question of Planned Parenthoods funding leapt into the 2016 presidential contest this week amid an ongoing row into the release of graphic videos, secretly recorded by anti-abortion activists, that show officials of the group describing how they sometimes provide fetal tissue to medical researchers. Planned Parenthood provides health services, family planning and abortions in clinics nationwide and is a longtime target of conservatives. While federal money is barred from paying for abortions, except for cases of rape, incest or when a womans life is in peril, Republicans would like to cut off tax dollars for the group entirely. The Senate on Monday voted 53-46 to advance a GOP-backed bill terminating Planned Parenthoods federal funding, seven short of the 60 votes needed to keep the measure moving toward passage. Florida Sen. Marco Rubio, who spoke in a pre-recorded interview to the conference, said the \"erroneous\" 1973 Supreme Court decision in Roe v. Wade that legalized abortion must be overturned. \"Until that decision is reversed there will be abortion in America,\" he said. Abortion opponents say the recordings caught Planned Parenthood illegally selling the organs for profit, while Planned Parenthood officials  while apologizing for their workers businesslike words  say theyve abided by laws that let them recoup the procedures costs. \"What those videos revealed more than anything else is that abortion in America has become a money-making industry,\" Rubio said. ", "Date": "20150809", "Author": "[Sergio Bustos and Erik Schelzig, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Bush-Rubio-to-speak-before-Southern-Baptist-6423098.php", "Title": "[Dems hit Bush after comments on funding for women's health]"}