{"Content": "[Caption, Close, Senator Barbara Boxer, D-CA, speaks during a press conference calling for the creation of an independent military justice system for deal with sexual harassment and assault in the military,on Capitol Hill in Washington, DC on February 6, 2014. AFP PHOTO/Mandel NGANMANDEL NGAN/AFP/Getty Images, In this March 13, 2014, file photo, Sen. Dianne Feinstein, D-Calif. chair of the Senate Intelligence Committee speaks on Capitol Hill in Washington. The CIAs insistence that it did not spy on its Senate overseers collapsed July 31 with the release of a stark report by the agencys internal watchdog documenting improper computer surveillance and obstructionist behavior by CIA officers. Feinstein said in a statement: \"The investigation confirmed what I said on the Senate floor in March  CIA personnel inappropriately searched Senate intelligence committee computers in violation of an agreement we had reached, and I believe in violation of the constitutional separation of powers.\" (AP Photo/J. Scott Applewhite, File), The outcome of a handful of too-close-to-call Senate races in November  including one where the Democratic Party isnt even fielding a candidate  will determine whether Dianne Feinstein and Barbara Boxer are still shaping the national debate on terrorism and climate change next year. After more than two decades in office, Californias veteran Democratic senators have reached the top rungs of the seniority ladder, and with that the leadership of powerful committees  positions they would lose if Republicans win control of Congress upper chamber. Boxer, a key backer of the administrations controversial plan to cut carbon emissions from power plants, would cede the helm of the Environment and Public Works Committee to climate-change denier Sen. James Inhofe of Oklahoma. Feinstein would lose the chairmanship of the Intelligence Committee, where she has spearheaded a multiyear fight against the CIA to expose torture practices during the George W. Bush administration  a campaign that Republicans have boycotted. Feinstein, who long has played a central role in Californias water fights, would also cede the chairmanship of the energy and water panel of the Appropriations Committee, which has given her outsize clout on water issues. The panel controls spending on every water project in the country. Boxer speculation, The possibility that Republicans will gain control of the Senate has fueled speculation that Boxer, 73, wont run for re-election in 2016. Boxer has said only that shell decide next year. I have served half the time in the majority and half the time in the minority, said Boxer, who was first elected to the Senate in 1992. I really like the majority much better. Much, much better. Feinstein, who like Boxer was first elected in 1992, is 81 and isnt due to run for re-election until 2018. Its hard to believe at the end of your career you want to go back into opposition again, said Stanford University political scientist Bruce Cain, especially for someone like Dianne Feinstein, who has such a critical role in security matters and has been at center of debates about national security and surveillance. President Obamas unpopularity is causing problems for Democrats nationwide, troubles that are compounded by a Senate election map that tilts sharply toward Republicans. Democrats are defending 21 seats in November, almost half of them in states that GOP presidential candidate Mitt Romney carried in 2012. Republicans are defending just 15 seats, all but one of them in states Romney won. Democrats now have a 55-seat working majority, with two independents, Sens. Angus King of Maine and Bernie Sanders of Vermont, allied with them. Political handicappers are predicting a GOP gain of between five and eight seats. With a five-seat loss, Democrats could retain Senate control with Vice President Joe Biden, the titular Senate president, able to cast a tie-breaking vote. That would also allow Feinstein and Boxer to keep their committee leadership posts. Things were looking grim for Democrats until, paradoxically, their Senate candidate in Kansas dropped out  leaving 78-year-old GOP Sen. Pat Roberts, a 33-year veteran, facing an independent centrist in what has become the most fascinating contest in the country. After making a hard-right swing to fend off a Tea Party primary challenge, Roberts now faces Greg Orman, a wealthy self-made businessman who is leading by six to 10 points in the latest polls. Roberts has summoned Kansas legend Bob Dole, a former GOP presidential nominee and Senate majority leader who is now 91 and in a wheelchair, to reinforce his flagging campaign. North Carolina Dem leading, In red-leaning North Carolina, which Obama won in 2008 but lost in the last election, Democratic incumbent freshman Sen. Kay Hagan is holding a surprisingly strong lead. Boxer cites the race in estimating that the Democrats have a 55 percent chance of keeping their majority. Iowa has been in a dead heat but is now trending Republican. Contests in Georgia, Alaska, Arkansas and Colorado are very close. Republicans look set to pick up open seats in West Virginia, Montana and South Dakota, where Democrats retired, and Democratic Sen. Mary Landrieu is in a tough re-election fight in deep-red Louisiana. Potential runoffs in Louisiana and Georgia, and a question about which party Orman would caucus with should he win in Kansas, could leave the question of Senate control hanging until December. As far as legislation goes, however, party control has less meaning than it used to before filibusters became routine, requiring a 60-vote supermajority on most bills. If they return to the minority, Democrats could use the filibuster to block Republican legislation. But if the Democrats hang on, its doubtful theyll be able to push through more than they can now on such Obama priorities as climate-change reforms. Its fair to say that whoever takes control in the next few years, Congress is not going to be passing landmark, controversial environmental legislation, said Jack Pitney, a political science professor at Claremont McKenna College. Even in the minority, Boxer and Feinstein would still have big voices. Theres no question when you lose control of the House, it sucks completely, Cain said. At least in the Senate, youve got the talk shows, youre one of a smaller number of people, you can get more media attention, youve got longer terms of office, so you dont have to raise money every single cycle. The main change from committee control would be to give Republicans the power to make trouble for the Obama administration. Instead of Boxers frequent hearings calling attention to the threat of climate change, for example, Republicans could be expected to attack the administrations new rule to require power plants to reduce carbon emissions. Its not like Democrats are able right now to promote an active legislative agenda, said UC Berkeley political scientist Eric Schickler. Its more in terms of steering the public agenda and the public conversation, and deciding what gets investigated and what doesnt. GOPs focus on presidency, Republicans are widely expected to use a new Senate majority, should they get it, to focus on the 2016 presidential race rather than any lawmaking. That will be especially true on Boxers Environment and Public Works Committee, said Jim Manley, a former top aide to Senate Majority Leader Harry Reid, D-Nev. given that climate change is among the areas of starkest differences between the parties. Republicans are going to have the megaphone, the platform, the ability to call witnesses, to set the legislative agenda, Manley said. Theyll be looking, on that committee in particular, try to do what they can to protect their presidential nominees as we move toward 2016. Carolyn Lochhead is The San Francisco Chronicles Washington correspondent. E-mail: clochhead@sfchronicle.com]", "Date": "20140929", "Author": "[Carolyn Lochhead]", "Link": "http://www.chron.com/politics/article/Power-of-Feinstein-Boxer-hinges-on-red-leaning-5789298.php", "Title": "[Power of Feinstein, Boxer hinges on red-leaning Senate races]"}