{"Content": "[Caption, Close, If Texas ever regained its independence, see what it would look like. Texas billionaires: 51, Texas area:268,820 sq. miles, Texas population: 26.45 million, Texas GDP: $1.414 trillion , , Texas oil production: 2 million barrels per day in 2012, Texas life expectancy: 78.5 (U.S. average: 79 After secession, Texas would have ... the 41st highest life expectancy in the wor Comparable to: Barbados, Cuba, Kuwait and the United Arab Emirates. , Bloody villains, 1836 - Houston, Santa Anna, and Cos: A political cartoon published shortly after the Battle of San Jacinto shows Mexican commander Santa Anna and his brother-in-law General Martin Perfecto de Cos bowing before Texas leader Samuel Houston. Santa Anna offers his sword to Houston, saying, \"I consent to remain your prisoner, most excellent sir!! Me no Alamo!!\" His subordinate follows suit. Houston, clad in buckskins and holding a musket, says, \"You are two bloody villains, and to treat you as you deserve, I ought to have you shot as an example! Remember the Alamo and Fannin!\" The print reflects the intensity of anti-Mexican feeling in the United States after Santa Annas massacre of American defenders at the Alamo mission in February 1836 and the slaughter at Goliad, Texas, a month later of American colonel James Fannin and his surrendered troops. Bloody villains, 1836 - Houston, Santa Anna, and Cos: A political... An inspiration to Lincoln, 1836 - Then just a fledgling general store owner and aspiring local politician, a young Abraham Lincoln is inspired to sit down and rewrite the the Treaty between Texas and Mexico by hand. An inspiration to Lincoln, 1836 - Then just a fledgling general store... The Flag of Texas, 1836 - \"The Flag of Texas, a national song\": This song was composed \"in honour of the Glorious Victory on the 21 of April 1836, and respectfully dedicated to General Saml Houston\" by A. F. Winnemore shortly after Texas won its independence. The Flag of Texas, 1836 - \"The Flag of Texas, a national song\":... A new row to hoe, a long and rough one, 1836 - \"Col. Crocketts exploits and adventures in Texas:\" Writes Crockett at the start of his trip, \"As my country no longer requires my services, I have made up my mind to go to Texas. My life has been one of danger, toil, and privation, but these difficulties I had to encounter at a time when I considered it nothing more than right good sport to surmount them ; but now I start anew upon my own hook, and God only grant that t may be strong enough to support the weight that may be hung upon it. I have a new row to hoe, a long and a rough one, but come what will Ill go ahead.\", A new row to hoe, a long and rough one, 1836 - \"Col. Crocketts... Texas, as it was, This 1837 map of the Republic of Texas was one of the first produced showing the new nation and its foreign ally, the United States. Texas, as it was, This 1837 map of the Republic of Texas was one of... Texas notes, 183841 - Texas notes: $1, $20, $50 and $100 notes from the Republic of Texas Treasury Department. Texas notes, 183841 - Texas notes: $1, $20, $50 and $100 notes... Anti-Texas Sentiments, 1838 - Anti-Texas Meeting notice: This was one of dozens - if not hundreds - of notices for anti-Texas annexation meetings that took place around the United States after Texas won its independence from Mexico. Most of those who opposed Texas joining the union did so based on Texas pro-slavery status. Anti-Texas Sentiments, 1838 - Anti-Texas Meeting notice: This was one... A corrupt fountain, 1838 - Universal Pill: This medicine promised to cure the inhabitants of the vast Texas landscape of whatever they might encounter in their new republic. The directions for use advised \"to keep up large evacuations\" of the bowels ... \"well knowing that a corrupt fountain cannot send forth pure waters.\", A corrupt fountain, 1838 - Universal Pill: This medicine promised... Texas Quick Step, 1842 - \"Texas Quick Step:\" A partial forefather of the Texas Two-Step. Texas Quick Step, 1842 - \"Texas Quick Step:\" A partial... The globe and cloak, 1843 - Henry Clay: Henry Clay was another American politician who saw his career sink for opposing Texas annexation. Here, his official Whig Party presidential candidate portrait depicts a cloak draping the globe, believed by some to be a reference to his isolationist and anti-Texas views. The globe and cloak, 1843 - Henry Clay: Henry Clay was another... We shant find Texas here, 1844 - Sale of Dogs: Seeking a middle course between the issues of the annexation of Texas on one hand and abolitionism on the other, Van Buren lost the support of southern Democrats, including elderly statesman Andrew Jackson. Here the artist portrays Van Buren as a dog with a foxs bushy tail, leading his master (Jackson) astray. Jackson says, \"Matty! Matty! it strikes me that you are leading me wrong--By the eternal! we shant find Texas here.\" Van Buren insists, \"We must take a middle course, boos. Salt river is on one side, and abolitionism is on the other.\" To their left is a man wearing striped pants and holding by their tails two dogs with the heads of James Polk and George Dallas. We shant find Texas here, 1844 - Sale of Dogs: Seeking a middle... How it happened, 1844 - \"Adventures in Texas,\" from Campbells Foreign Semi-Monthly Magazine: The essay begins \"Reader ! Were you ever in a Texan prairie? Probably not. I have been; and this was how it happened.\", How it happened, 1844 - \"Adventures in Texas,\" from Campbells... The Texas Rangers, 1844 - Samuel H. Walker: Walker joined the Texas Rangers in 1844 and would become captain shortly thereafter. The Texas Rangers, 1844 - Samuel H. Walker: Walker joined the Texas... A Friend of Man, 1844 - Protest of Some Free Men, States and Presses Against the Texas Rebellion Against the Laws of Nature and of Nations - This 1844 anti- Texas annexation book began with a list of notable names, publications and even nations who opposed Texas joining the United States. Most opposed based on Texas pro-slavery status. Essayists within the book included former president John Quincy Adams, Mexican general Antonio Lopez de Santa Anna and something called \"Friend of Man.\", A Friend of Man, 1844 - Protest of Some Free Men, States and... Sam Houston, 1844 - Samuel Houston: After leading the Texas Army to victory of the Mexicans and becoming the first president of Texas, Houston became a tireless advocate for annexation by the United States. Sam Houston, 1844 - Samuel Houston: After leading the Texas Army to... The ugly hag, 1844 - Matty Meeting the Texas Question: The opposition of Texas statehood by Martin \"Matty\" Van Buren was a large reason he failed to win re-election in 1844, many believe. This cartoon was a satire on the Democrats approach to the delicate question of annexation. The artist here presents Texas as the ugly hag War or Chaos, brandishing a dagger, pistols, whips, and manacles. She embodies the threat of war with Mexico, feared by American opponents of annexation. The whips and manacles in her left hand may also allude to slavery, whose expansion into the new territory was desired by southern annexationists. The ugly hag, 1844 - Matty Meeting the Texas Question: The opposition... A forgotten forefather, 1844 - Memucan Hunt: Memucan Hunt was the first Minister of Texas to the United States, making him a primary liason between the two countries. A forgotten forefather, 1844 - Memucan Hunt: Memucan Hunt was the... Texas Coming In, 1844 - Texas Coming In: Apro-Democrat cartoon forecasting the collapse of Whig opposition to the annexation of Texas. James K. Polk, the expansionist candidate, stands at right near a bridge spanning \"Salt River.\" He holds an American flag and hails Texans Stephen Austin (left) and Samuel Houston aboard a wheeled steamboat-like vessel \"Texas.\" Austin, waving the flag of the Lone Star Republic, cries, \"All hail to James K. Polk, the frined [sic] of our Country!\", Texas Coming In, 1844 - Texas Coming In: Apro-Democrat cartoon... Houston: The Capital of Texas, 1845 - Houston: The Capital of Texas. (Things have changed a tad over the years.), Houston: The Capital of Texas, 1845 - Houston: The Capital of Texas.... It seemed like a typical congressional meeting for the Republic of Texas. Senators and the president gathered in the center of a Bryan, Texas, meeting hall, surrounded by public onlookers, to debate issues of the national currency, develop international relations and celebrate the birthday of one of their oldest members. But this wasnt 1836, and this would be no ordinary legislative conference. Minutes into the meeting a man among the onlookers stood and moved to open the hall door, letting in an armed and armored force of the Bryan Police Department, the Brazos County Sheriffs Office, the Kerr County Sheriffs Office, Agents of the Texas District Attorney, the Texas Rangers and the FBI. In the end, at least 20 officers corralled, searched and fingerprinted all 60 meeting attendees, before seizing all cellphones and recording equipment in a Valentines Day 2015 raid on the Texas separatist group. RELATED: \"Republic of Texas wants its day in court\", \"We had no idea what was going on,\" said John Jarnecke, president of the Republic of Texas. \"We knew of nothing that would warrant such an action.\", The raid was a response to legal summons sent by Republic of Texas members to a Kerr County judge and bank employee, demanding they appear in the Republics court at the Veterans and Foreign Wars building in Bryan the day the officers stormed in. Jarneckes group, the subject of a half-hour YouTube documentary, maintains a small working government, including official currency, congress and courts. \"You cant just let people go around filing false documents to judges trying to make them appear in front of courts that arent even real courts,\" said Kerr County sheriff Rusty Hierholzer, who led the operation. He acknowledged he used a \"show of force,\" grouping officers from city, county state and federal law enforcement to serve a search warrant for suspicions of a misdemeanor crime. He said he had worries that some extremists in the group could become violent, citing a 1997 incident when 300 state troopers surrounded an armed Republic leader for a weeklong standoff. RELATED: \"Today in Texas History: Long live Republic of Texas! Separatist group standoff in mountains begins\", \"Weve had years of bad press, but were not those people,\" said Jarnecke of the 97 incident. \"But yes, we are still making every attempt to get independence for Texas and were doing it in a lawful international manner.\", The Republic has a lengthy list of qualms with the federal government, among them that Texas was illegally annexed in 1845. But most of their complaints have to do with the behavior of the American legislature and executive. Robert Wilson, a senator in the Republic, equated politicians in Washington D.C. to the \"kings and emperors\" of the past, and sees Texas independence as part of a worldwide movement for local control. \"This is the century for colonialist ambitions to be reversed,\" the 78-year-old pastor said. \"Ive watched a lot of things happen, and the people of the world are fed up. The spirit of the world right now is: make things smaller, move governments closer to home, take back self-rule.\", RELATED: \"Texas Nationalist group rallies for secession in Austin\", Jarnecke said he was being taxed by a foreign government that he feels doesnt represent him, and protested having to fund bank bailouts and foreign wars. \"According to the U.S. Constitution, the only place any army should be is guarding our own borders, not invading and trying to impose their will on every other country of the world,\" Jarnecke said. Still, he and Wilson said their group would not resort to violence, but is working through world courts to get international recognition of an independent Texas. They said their methods are legal, but Sheriff Hierholzer contests that. \"Weve had a lot of dealings with Republic of Texas members in the past here, too, flooding the court with simulated documents,\" he said. \"I dont have any problem with them going back to the Republic of Texas but they need to do it through the proper legal channels.\", The judge and banker summoned to the Republics court had been involved in the foreclosure of a members Kerr County house. The invalid court summon was signed by Susan Cammak, the Kerr County homeowner, and David Kroupa, a Republic of Texas judge from Harris County. A search warrant, photographed and emailed by a Republic of Texas member before her phone was confiscated, accuses the two of \"simulating legal process.\" It also authorizes the seizure of all computers, media storage, software, cell phones and paper documents. Hierholzer said the seized devices will be downloaded and reviewed to determine if others conspired in the creation and issuance of false court documents. Police searched and fingerprinted each person at the meeting, but they did not perform cheek-swab DNA testing as the warrant allowed. No arrests were made in the raid, but the case is still under investigation, Hierholzer said. The FBI and Texas Rangers would not comment. Jarnecke acknowledged that legislation and court summons issues by the Republic have no real effect, but said the group was close to taking their case to an international courtthey havent yet selected which. He hopes that will be the first step in rallying for Texas independence. RELATED: \"Texas separatist still thinks cause will succeed\", \"Im positive we will get out independence back at some point in time,\" he said. \"Now were just trying to nip things in the bud ahead of time to make sure the people are the ones that have the power when it happens, not the government.\"]", "Date": "20150223", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/houston-texas/article/Feds-raid-Texas-secessionist-meeting-6096637.php", "Title": "[Feds raid Texas secessionist meeting]"}