{"Content": "[Caption, Close, Florida Gov. Jeb Bush and his wife Columba Bush listen to remarks made by first lady Laura Bush during a summit held to promote reading, Tuesday afternoon, Oct. 1, 2002, in Tampa, Fla. (AP Photo/Steve Nesius), Florida Gov. Jeb Bush and his wife Columba arrive at the Fourth Annual Statewide Drug Summit, Tuesday, April 30, 2002, in Tallahassee, Fla. Bush cried briefly as he thanked attendees for their prayers and support following his daughters arrest on drug charges. Bush, addressing drug treatment and prevention professionals as well as law enforcement officers, talked about the states goal of reducing drug use to 4 percent. (AP Photo/Phil Coale), Florida Gov. Jeb Bush, second right, his wife Columba, and vice foreign minister Gabriel Aguilera, right, smile after Bushs arrival in Guatemala City, Tuesday, Jan. 13, 2004.  Governor Bush will attend the inauguration of Guatemalan President-elect Oscar Berger on Wednesday. At back left is U.S. Ambassador to Guatemala, John Hamilton. (AP Photo/Moises Castillo), Florida Gov.-elect Jeb Bush waves to the crowd as he and his wife Columba wait for the swearing in ceremony Tuesday, Jan 5, 1999 outside the Old Capitol in Tallahassee, Fla. (AP Photo/Wilfredo Lee), FILE--In this 1957 family portrait, Columba Bush, 4, left, sits on the lap of her mother, Josefina Garnica, at their home in Leon, Mexico. At right is her son Francisco Garnica, 8, and sitting on the lap of her father, Jose Maria, is their daughter Lucila, 6. More than 27 years ago, Columba Garnica, told her father she was going to the post office. He hasnt seen her since - except on television beside her husband, Florida Gov. Jeb Bush. (AP Photo/Victor R. Caivano) (AP Photo), George P. Bush poses for a photo with unidentified women following a campaign event for his uncle, Republican presidential candidate Texas Gov. George W. Bush, in Los Angeles, Wednesday, June 21, 2000. Bush is the 23-year-old son of Florida Gov. Jeb Bush, and is a key part of the campaigns plan to reach out to voters who are young and Hispanic. Come August, hell be youth chairman at the Republican National Convention in Philadelphia.   (AP Photo/Eric Draper), Florida Gov. Jeb Bush, right, laughs with first lady of Florida Columba Bush, after Columba was presented with a birthday cake for her upcoming birthday during a reception for the Sister-State Youth Art Exchange Program, Thursday, Aug. 14, 200,3 at Epcot Center at Walt Dsiney World in Lake Buena Vista, Fla. The reception was held to welcome Gov. Yoshiki Kimura  and his wife from Japan, along with two students from Wakayama Prefecture who are participating in a cultural exchange program between a state in Japan and Florida. At left, is a person dressed as the Disney character Minnie Mouse. (AP Photo/Scott Audette)  HOUCHRON CAPTION  (08/15/2003):  Florida Gov. Jeb Bush and his wife, Columba, are joined by Disney character Minnie Mouse after the first lady is given a birthday cake Thursday at a reception to welcome participants of an exchange program between Florida and Japan. The event was held at Walt Disney Worlds Epcot Center in Lake Buena Vista, Fla. George P. Bush, the son of Florida Gov. Jeb Bush and his Mexican-American wife Columba, is seen in this image from a television ad for the Bush for President campaign. The ad is one of two new television ads previewed by the campaign that feature George P. Bush and target Hispanic voters.  The ads are in both Spanish and English and are scheduled to be aired the weekend of June 10, 2000 in the New York City media market.  I am a young Latino and very proud of my bloodline, said the nephew of the GOP presidential hopeful. The text in the image reads Its a New Day. (AP Photo/HO), In this Monday, Sept. 24, 2012, file photo George P. Bush, right, stands with his uncle former President George W. Bush, left, during the Bush Center Warrior Open in Irving, Texas. George P. Bush, the 36-year-old attorney from Fort Worth and son of former Florida Gov. Jeb Bush has taken steps toward seeking elected office in Texas, and his father has said his son is considering a run for the states land commissioner.  (AP Photo/LM Otero, File), Jeb Bush, right, Chairman of the Board and President of the Foundation for Excellence in Education and former Governor of Florida, speaks during a forum on Latino College Completion, held at Miami Dade College on Sept. 30, 2011 in Miami, Fla. Listening is Gaston Caperton, left, President, College Board. (Marice Cohn Band/Miami Herald/TNS), Jeb Bush used the term \"anchor babies\" on Wednesday to describe the children born to undocumented immigrants, and doesnt regret using the controversial term. He doesnt want the automatic birthright citizenship to go away, but he is calling for stronger enforcement for people who abuse it. \"If theres abuse, if people are bringing  pregnant women are coming in to have babies simply because they can do it, then there ought to be greater enforcement,\" Bush said on Bill Bennetts conservative radio show \"Morning in America\" Wednesday. \"Thats (the) legitimate side of this. Better enforcement so that you dont have these, you know, anchor babies, as they are described, coming into the country.\", RELATED: Man gets a Jeb 4 Prez tattoo, On Thursday, when asked by reporters if he regrets using the term, Bush quickly responses with, \"No I dont. I dont regret it ... No, do you have a better term?\", Reporters asked if the Republican presidential hopeful thought it was a bombastic term to use and Bush stood by his original phrase. Congresswoman Linda Sanchez, chairwoman of the Congressional Hispanic Caucus, said she was incredibly offended and described the \"term anchor baby so vile we dont even have an equivalent for it in Spanish,\" according to reports from Facticists. The 14th Amendment allows children born in the United States to become citizens, regardless of their parents legal status, and Bush has been a supporter of this. He criticizes Donald Trumps proposal to remove the amendment. RELATED: Trumps immigration comments are said to inspire a beating in Boston, \"Its a long process, and I think it would take too long. Id much rather find out whether or not anchor babies are citizens because a lot of people dont think they are,\" he said.]", "Date": "20150820", "Author": "[Heather Leighton]", "Link": "http://www.chron.com/politics/election/national/article/Jeb-Bush-doesn-t-regret-using-the-term-anchor-6456742.php", "Title": "[Jeb Bush doesn't regret using the term 'anchor babies']"}