{"Content": "[Caption, Close, WIth guns in hand, a group of more than 20 people with the pro-gun organization, Come and Take it Houston, assembled at City Hall before walking through downtown carrying their guns as part of a rally Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer  Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns. We want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), Jr. Velez, 21, puts his arm around his little brother while walking with his A5 rifle down Bagby, as they joined a group of more than 20 people with the pro-gun organization, Come and Take it Houston, as part of a rally to educate people about local gun laws Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer  Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns. We want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), Jr. Velez, 21, puts his arm around his little brother while walking with his A5 rifle down Bagby, as they joined a group of more than 20 people with the pro-gun organization, Come and Take it Houston, as part of a rally to educate people about local gun laws Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns. We want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), A man named Houston waits for his bus as a group of more than 20 people with the pro-gun organization, Come and Take it Houston, walk down Bagby Street during a rally to educate people about local gun laws Thursday, July 4, 2013, in Houston. \"To be honest with you I personally dont promote gun violence or guns period. If youve got weapons use your hands,\" Houston said. \"Use sticks and stones if you have to . Bullets take too many lives, for no reason.\" \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer  Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns. We want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), A man waits for his bus as a group of more than 20 people with the pro-gun organization, Come and Take it Houston, walk down Travis Street during a rally to educate people about local gun laws Thursday, July 4, 2013, in Houston.  \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer  Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns. We want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), Bibin Thomas, 27, of Missouri City holds up his A5 rifle as he joined a group of about 25 people with the pro-gun rights organization, Come and Take it Houston, as they assembled at City Hall and walked through downtown carrying their guns as part of a rally Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), After walking with their guns through downtown as part of a pro-gun rally, the group of about 25 people with the organization, Come and Take it Houston, ate lunch at Tonys BBQ & Steak House, which they said was a gun-friendly establishment Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-orginizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), After walking with their guns through downtown as part of a pro-gun rally, the group of about 25 people with the organization, Come and Take it Houston, ate lunch at Tonys BBQ & Steak House, which they said was a gun-friendly establishment Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-orginizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), After walking with their guns through downtown as part of a pro-gun rally, the group of about 25 people with the organization, Come and Take it Houston, ate lunch at Tonys BBQ & Steak House, which they said was a gun-friendly establishment Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-orginizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), After walking with their guns through downtown as part of a pro-gun rally, the group of about 25 people with the organization, Come and Take it Houston, ate lunch at Tonys BBQ & Steak House, which they said was a gun-friendly establishment Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-orginizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), After walking with their guns through downtown as part of a pro-gun rally, Bibin Thomis, 27,  left, of Missouri City and a group of about 25 people with the organization, Come and Take it Houston, ate lunch at Tonys BBQ & Steak House, which they said was a gun-friendly establishment Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-orginizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), Oscar Garza, 29, of Houston waits holding his A5  rifle as he joined a group of more than 20 people with the pro-gun organization, Come and Take it Houston, assembled at City Hall before walking through downtown carrying their guns as part of their rally Thursday, July 4, 2013, in Houston. \"The idea is to show people their rights and its a way to educate them,\" Garza said. \"The best gun safety is education.\"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns. We want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), Jennifer Kroll, 26, of Houston, wears her 20-gauge shotgun as she joined a group of about 25 people with the pro-gun rights organization, Come and Take it Houston, assembled at City Hall and walked through downtown carrying their guns as part of a rally Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), A plastic straw is inserted into the chamber of Ed Aldredges A5 rifle to note there are no rounds in the chamber, as he joined a group of about 25 people with the pro-gun rights organization, Come and Take it Houston, assembled at City Hall and walked through downtown carrying their guns as part of a rally Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer  Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), Neil Darlington from Chester, England watched with his 11-month-old daughter Chrystal, as a group of about 25 people with the organization pro-gun rights organization, Come and Take it Houston, walked through downtown carrying their guns as part of a rally to educate people about gun laws Thursday, July 4, 2013, in Houston. To walk the streets and see people with shotguns and ammo is a bit different, Darlington said. Its a completely different culture. We are use to seeing police with guns, but not that.\"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer  Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), Cyclist watch a group of more than 20 people with the pro-gun organization, Come and Take it Houston, walk down Bagby Street during a rally to educate people about local gun laws Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer  Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns. We want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), David Wakat, 23, from LaPorte, gets a photograph of the Come and Take it Houston, a pro-gun rights organization, in front of HPD headquarters as they walked down Travis Street during their rally to educate the public about gun laws Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), After walking through downtown as part of a pro-gun rally, Ed Aldredge, and a group of about 25 people with the organization, Come and Take it Houston, ate lunch at Tonys BBQ & Steak House, which they said was a gun-friendly establishment Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-orginizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open cary of long arms like rifles and shotguns and we want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\"( Johnny Hanson / Houston Chronicle ), Kory Watkins, coordinator for Open Carry Tarrant County poses for a portrait holding his Romanian AK 47, Thursday, May 29, 2014, in Haltom City, Texas.  North Texas gun rights advocates are suing the city of Arlington for amending an ordinance that they claim is discriminatory and infringes upon free speech rights, in the latest sign of growing tensions among gun activists and government forces in Texas. (AP Photo/Tony Gutierrez), Kory Watkins, coordinator for Open Carry Tarrant County carries his Romanian AK47 over his back as he talks with passerbys at a busy road intersection during a group demonstration, Thursday, May 29, 2014, in Haltom City, Texas.  North Texas gun rights advocates are suing the city of Arlington for amending an ordinance that they claim is discriminatory and infringes upon free speech rights, in the latest sign of growing tensions among gun activists and government forces in Texas. (AP Photo/Tony Gutierrez), John Moltzer, of Robinson, waits for the \"Come and Take It\" rally to begin at the Alamo on Saturday, Oct. 19, 2013. Members of the pro-gun organization Come and Take it Houston walk down Travis Street armed with their guns as part of a rally to educate people about local gun laws Thursday, July 4, 2013, in Houston. \"This is a Come and Take it Houston walk to help inform citizens about the gun laws here in Texas,\" co-organizer Kenneth Lindbloom said. \"In Texas there are no restrictions on the open carry of long arms like rifles and shotguns. We want people to realize that in the hands of good people, guns are not dangerous and they dont kill people. When good people have guns it serves as a deterrent to stop crime.\" (AP Photo/Houston Chronicle, Johnny Hanson), Ed Aldredge of Sugar Land, Texas, checks to make sure he doesnt have a round in the chamber of his A5 rifle, next to his son, Austin, 11, who was holding his .22 caliber rifle as they join a group of about 25 people with the gun rights organization Come and Take it Houston for a rally at City Hall in Houston Thursday, July 4, 2013(AP Photo/Houston Chronicle, Johnny Hanson), Members of the gun rights group Come and Take it Houston get lunch at Tonys BBQ & Steak House, which they say is a gun-friendly establishment, after walking with their guns through downtown Houston as part of a pro-gun rally on Thursday, July 4, 2013. (AP Photo/Houston Chronicle, Johnny Hanson), Gun rights advocates meet for an Open Carry walk, Saturday, Feb. 15, 2014, in the parking lot of the Academy Sports & Outdoors in Conroe, Texas. The group walked to the North Loop 336 West overpass with long guns and a few signs to show support for legalizing open carry of a handgun for law-abiding throughout Texas.  (AP Photo/Conroe Courier, Ana Ramirez), Flags fly at the Come And Take It San Antonio pro-gun rally on Saturday, Oct. 19, 2013. Several hundred pro-gun owners displayed their rifles and long arms at a rally on the grounds of the Alamo. The group later marched to Travis Park where the event concluded. (Kin Man Hui/San Antonio Express-News), A gun owner and his wife leave a rally at Travis Park as part of the Come And Take It San Antonio pro-gun rally on Saturday, Oct. 19, 2013. Several hundred pro-gun owners displayed their rifles and long arms at a rally on the grounds of the Alamo. The group later marched to Travis Park where the event concluded. (Kin Man Hui/San Antonio Express-News), Gun owners march toward Travis Park as part of the Come And Take It San Antonio pro-gun rally on Saturday, Oct. 19, 2013. Several hundred pro-gun owners displayed their rifles and long arms at a rally on the grounds of the Alamo. The group later marched to Travis Park where the event concluded. (Kin Man Hui/San Antonio Express-News), AUSTIN  Texas is a hairs breadth away from legalizing the licensed open carry of handguns after the state Senate late Friday approved the legislation following hours spent arguing over a controversial amendment that would limit cops ability to detain gun owners. The Senate approved House Bill 910, which would allow properly licensed gun owners to openly carry their handguns in shoulder or hip holsters. The bill passed by a final vote of 12 and now heads back to the House, where that chambers members will have to agree with the Senates changes. Debate was prolonged late into the evening after Dallas Republican Don Huffines proposed an amendment that would bar police from stopping someone solely for openly carrying a handgun in public.The amendment was adopted and passed as part of final bill. The emotional, heated and often personal debate was an unusual turn of events in the Senate, in which debate is normally highly scripted. An unusual coalition of Democrats and some Republicans banded together to oppose the amendment, saying it would tie the hands of law enforcement and put the public in danger. \"Im not sitting down until I have made my point that this is a mistake,\" said Houston Republican Joan Huffman, a former prosecutor and judge. \"With certain rights come responsibilities, and there has to be some social order.\", John Whitmire, a Houston Democrat and longest-serving state senator, said he thought the amendment essentially would legalize unlicensed open carry of handguns, which advocates call \"constitutional carry.\", \"This is nothing but a backhanded way to accomplish constitutional carry,\" said Whitmire. \"We are really, really playing with a dangerous matter. Its not something that we can afford to be wrong about.\", Sen. Rodney Ellis, D-Houston, has consistently voted against expanding gun rights in Texas and said he has worn his low National Rifle Association score as \"a badge of honor for the past 25 years.\" But he supported Huffines amendment Friday to discourage racial profiling for African-American Texans who decide to open carry under the new law. \"If I could kill my distinguished colleagues bill, I would do that,\" Ellis said. \"If somebody is going to be profiled over walking around the streets of Houston or Austin with a gun, in my mind, I think somebody who looks like me is more apt to get stopped than somebody who looks like you.\", Many law enforcement groups, including the Combines Law Enforcement Association of Texas, the states largest police organization, are staunchly opposed to Huffines amendment. In a statement, Lt. Gov. Dan Patrick applauded the bills passage, saying: \"With time running out on this legislative session, the Senate has once again stood up for the Second Amendment to ensure law-abiding licensed Texans have the right to open carry.\", Patrick said House Speaker Joe Strauss has assured the Senate that the House will approve a campus carry bill before time runs out on the legislative session. Leadership in both chambers on Friday confirmed the House will allow debate on so-called \"campus carry\" legislation. If passed, it would allow properly licensed firearms owners to carry concealed handguns into college and university buildings. Similar campus carry legislation passed in 2013 but contained a provision that would allow campuses to opt out. House Democrats promised to fight the bill when it reaches the floor. \"Nothing changes for me. I will continue fighting against campus carry and will lead that fight with my use of the rules and effective floor strategy,\" said Trey Martinez Fischer, D-San Antonio. \"This fight is far from over.\"]", "Date": "20150523", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/article/Texas-Senate-OKS-open-carry-legislation-6282299.php", "Title": "[Texas Senate OKs open-carry legislation]"}