{"Content": "[Caption, Close, Arizona Republican Sen. John McCain speaks to employees during a town hall meeting Monday, Aug. 31, 2015, in Phoenix. PHOENIX (AP)  U.S. Sen. John McCain will point to his success in bringing important projects to Arizona and his new influence as chairman of the Senate Armed Services Committee as key reasons why voters should return him to Congress for a sixth term. Arizonas senior senator said in a wide-ranging interview with The Associated Press Tuesday that hes not taking a primary challenge from Republican state Sen. Kelli Ward and other potential GOP challengers for granted and plans an aggressive primary campaign. Democratic Rep. Ann Kirkpatrick is seeking the Democratic nomination and could mount a strong general election challenge as well. \"I take any campaign, both primary and general, with the utmost seriousness,\" McCain said. \"And anybody who in this day and age does (not) do so is just foolish.\", McCain pointed to his efforts to reopen a fish hatchery in Mohave County, pushing a highway bypass in Pima County and a land swap that opened the way for a new copper mine near Superior as successes. He also touted his work to bring more work to Tucson-based Raytheon Missile Systems, keep the Air Force from retiring the 0 attack jet and bringing squadrons of new F-35 attack jets to Luke Air Force Base and Yumas Marine Corps Air Station. \"The message is, Im proud of my record of service to the state of Arizona,\" said McCain, who was the Republican nominee for president in 2008 and will be 80 by next Novembers general election. \"Theres a large number of Arizona-specific work that Ive done.\", McCain said his leadership on national security issues is particularly needed amid growing threats from the Islamic State, Russia and China. He said he will be able to shape the U.S. debate on how to address the challenges. \"I guess it sounds like bragging  but who is the foremost spokesperson on national security in the United States Senate?\" McCain said. \"You can ask any journalist or expert in America  its me. And in a most dangerous world my knowledge and expertise and leadership will play a key role, particularly with the next administration.\", McCain faced a primary challenge in 2010 from former Rep. J.D. Hayworth, and trounced him after promising to boost border security. The campaign featured a well-known television ad where McCain walked along the U.S.-Mexico border and promised to \"complete the danged fence.\", That full fence remains unbuilt, but McCain said the comprehensive immigration plan he pushed through the Senate in 2013 would have fulfilled that promise. The legislation stalled in the House, leaving border security and what to do with an estimated 11 million people in the U.S. illegally an outstanding political issue. \"I know that the border is a very, very important issue to many citizens of Arizona,\" McCain said. \"Thats why I was the one who passed legislation through the Senate that requires 90 percent effective control of the border, 100 percent situational awareness, 6 billion dollars, 20,000 additional Border Patrol. Im proud of that legislation.\", The reform bill also contained expanded farmworker and professional visa provisions, and a provision that required employers to check work authorization though the federal e-verify system. \"When I said we were going to build the danged fence, thats what that legislation does,\" McCain said. \"If they have a better idea of how to have a comprehensive approach to immigration reform, first and foremost being border security, then Ill be glad to hear their proposal.\"]", "Date": "20150902", "Author": "[Bob Christie, Associated Press]", "Link": "http://www.chron.com/news/article/McCain-ready-for-2016-re-election-effort-6479677.php", "Title": "[McCain ready for 2016 re-election effort]"}