{"Content": "[BOSTON (AP)  U.S. Sen. Elizabeth Warren said Vice President Joe Biden called her twice to set up a lunch with him last month as he weighs a White House run. Warren said the two had what she described as \"a good long rambly policy conversation\" over salad at the Naval Observatory, his Washington residence. \"We talked about policy. We talked about whats happening to Americas middle class. We talked about the direction that this country has been going in. We talked about the capture of this country by those whove got money and power,\" Warren said Wednesday. The Massachusetts Democrat declined to directly say whether Biden raised the possibility of her running for vice president with him as part of a ticket. Asked if there was talk of a vice presidential run during the lunch, Warren would only say, \"it was a long conversation.\", Warren also declined to directly pledge to serve out the rest of her six-year term, although she said she loves her work as a senator. Warren faces re-election in 2018. \"I love my job. I truly love this job and its all Im thinking of and you just cant put a different thought in my head,\" she said. Reminded of a 2013 pledge to serve out her term, she added, \"theres nothing that has changed in my thinking.\", Warren made the comments at an event sponsored by the Boston Globe and Suffolk University. Warrens statements came a day after she said that the possibility she would run as a vice presidential candidate in the 2016 election is \"something Im not talking about.\" Warren also said Tuesday that Biden faces a tough decision. \"Hes been through an awful lot, and thats something he will have to decide himself, and its going to be with his family and quietly in his own home,\" Warren said. Warren met privately with Hillary Clinton earlier this year and she said shes also talked with Democratic presidential hopefuls Bernie Sanders and Martin OMalley. She said Wednesday that she imagines she might end up endorsing a candidate before the Democratic primary. On Tuesday, she said it was still too early and shell have to see how the race unfolds. Warren has also declined to say whether shell seek a second term. She remains a powerhouse among the more liberal wing of the party, and her endorsement is coveted by those hoping to win the presidential nomination. She also has fundraising muscle. More than $41 million flooded into her account during the 2012 election, when she successfully ousted Republican incumbent Sen. Scott Brown.]", "Date": "20150903", "Author": "[Steve Leblanc, Associated Press]", "Link": "http://www.chron.com/news/article/US-Sen-Warren-I-had-long-policy-conversation-6483118.php", "Title": "[US Sen. Warren: I had long policy conversation with Biden]"}