{"Content": "[Caption, Close Governor Rick Perry, Governor Rick Perry, Governor-elect Greg Abbott, Governor-elect Greg Abbott, , Senator John Cornyn, , Rep. Lamar Smith, R-San Antonio, , State Senator Sylvia Garca, D-District 6, State Rep. Jessica Farrar, D-District 148, The highly controversial executive order issued by President Obama caused a backlash from many in the GOP. See how the order, which has been blocked by a judge, would impact the nation if its eventually enforced. 1. Parents, 2. Children, 3. Prioritizing deportations, 4. Law enforcement, 5. Border security, 6. Salaries, 7. Business programs, 8. Green cards, AUSTIN  Gov. Rick Perry, already jockeying amid a crowded field of potential Republican 2016 presidential hopefuls, issued an executive order Wednesday for state agencies to start using a federal electronic system designed to weed out undocumented workers. Perry made the announcement just hours before Attorney General Greg Abbott, the Republican governor elect, is expected to roll out a lawsuit against President Barack Obama over his executive action on immigration. Speaking at a Capitol press conference, Perry said all state agencies under the control of his office would now be required to use E-Verify to check employment status of current and perspective employees. \"The E-Verify system has been improved, its been streamlined and is currently the most accurate and efficient way to check a persons\" legal work status, he said. The program is designed to prevent the hiring of undocumented workers by providing an online tool to compare government records against a prospective employees name and Social Security number. In 2010, Perry was chided by then-U.S. Sen. Kay Bailey Hutchinson, who was running for Texas governor, for not using the online system to check job applicants. At the time, Perry responded by saying E-Verify \"would not make a hill of beans difference when it comes to whats happening in America today. You secure the border first, then you can talk about how to identify individuals in an immigration situation.\", Perry on Wednesday said the program has been improved \"in a number of ways\" since 2010 to effectively prevent undocumented people from entering the workforce. \"It now is a program that we think works,\" he said. E-Verify is mandatory for certain federal contractors and is in use in some states. In Texas, Perry said 17 agencies already use E-Verify, but details about which agencies employ the program were not immediately available from his office. Perrys executive order only notes that E-Verify is currently used by the \"Office of the Governor, major state agencies and universities.\", \"This means anyone who is seeking a contract with these agencies must also use E-Verify to determine the work eligibility of not only of their employees but of their subcontractors,\" he said. It was not immediately clear how many other agencies would fall under Perrys executive order. Agencies outside of the direction of the governor were \"encouraged\" in the executive order to start using E-Verify.]", "Date": "20141203", "Author": "[David Saleh Rauf]", "Link": "http://www.chron.com/news/politics/texas/article/Perry-calls-on-state-agencies-to-use-E-Verify-to-5932624.php", "Title": "[Perry calls on state agencies to use E-Verify to screen for undocumented workers]"}