{"Content": "[WASHINGTON (AP)  The wallets of Americas middle class and poorest arent seeing any extra money, the U.S. Census reported Wednesday, a financial stagnation experts say may be fueling political dissent this campaign season. The Census Bureau, in its annual look at poverty and income in the United States, said both the countrys median income and poverty rate were statistically unchanged in 2014 from the previous year. Median income   the point where half of the households have income below it and half have income above it   showed no statistically significant change, despite the small drop to $53,700 in 2014 from 2013s $54,500. Median income is a broad measure of the economic health of the middle class. The poverty rate also showed no statistically significant change. In 2014, the poverty rate in the United States was 14.8 percent, which was the same as in 2013. The poverty rate had dropped in 2013 from 15 percent in 2012, the first such drop since 2006. There were 46.7 million people in poverty, which is also a statistically similar number from the previous four years. In 2014, a family with two adults and two children was categorized as in poverty if their income was less than $24,008. Census officials said they werent surprised by the flat numbers. \"Its not unusual for it not to go down two years in a row,\" said Trudi J. Renwick, chief of the Poverty Statistics Branch in the bureaus Housing and Household Economic Statistics Division. The White House focused on the fact that some of the numbers increased, though census officials noted the change was not significant. \"Real median income for family households rose $408 in 2014, while real median income for non-family households also rose but overall median household income declined,\" administration officials said in a news release. Republicans argued that the stagnating numbers reveal a need for change to the countrys welfare programs. \"Our current approach to fighting poverty, though well-intended, is failing too many Americans,\" said House Ways and Means Committee Chairman Paul Ryan, a Wisconsin Republican. \"This disappointing data, five years into an economic recovery, underscores the need for a new effort to modernize our countrys safety net programs.\", The latest numbers will feed into the 2016 political debate, with both parties trying to position themselves as advocates for the middle class. The numbers may explain some of the political furor going on in the country, said Lawrence Mishel, president and CEO of the liberal Economic Policy Institute. \"Anyone wondering why people in this country are feeling so ornery need look no further than this report,\" Mishel said. \"Wages have been broadly stagnant for a dozen years and median household income peaked in 1999.\", The Census report also showed that the number of uninsured Americans dropped in 2014, as the big coverage expansion in President Barack Obamas law took effect. The share of the population uninsured the whole year was 10.4 percent, or 33 million people. When compared to 2013, nearly 9 million people gained coverage. A recent government survey that includes data from the first three months of this year shows that the uninsured rate continued to fall in 2015. The report also said:,  Asian households had the highest median income in the United States at $74,300 in 2014. The median income for non-Hispanic white households was $60,300, for black households $35,400 and Hispanic households $42,500. The median income for white households decreased by 1.7 percent between 2013 and 2014, while there was no statistically significant change for black, Asian, and Hispanic households.  The 2014 median earning of men was $50,400, while the median earning for women was $39,600. Neither number was statistically different from 2013.  The median income of households maintained by the foreign-born increased 4.3 percent while the median income of households maintained by a native-born person declined 2.3 percent. The income of naturalized citizens and noncitizens were not statistically different from the year before.  The number of men and women working full-time, year-round jobs increased by 1.2 million and 1.6 million, respectively, between 2013 and 2014. Census officials said the change suggested a shift from part-time, part-year work status to full-time, year-round employment.]", "Date": "20150916", "Author": "[Jesse J. Holland, Associated Press]", "Link": "http://www.chron.com/business/article/Census-Poverty-numbers-stay-just-about-the-same-6508373.php", "Title": "[Census: Income, poverty numbers stay just about the same]"}