{"Content": "[Caption, Close, Vin Testa waves a rainbow flag outside of U.S. Supreme Court following the announcement of the ruling on the same-sex marriage case, in Washington, June 26, 2015. In a long-sought victory for the gay rights movement, the Supreme Court ruled Friday that the Constitution guarantees a nationwide right to same-sex marriage.  (Zach Gibson/The New York Times), Judge Dennise Garcia, left front, watches as George Harris, center left, 82, and Jack Evans, center right, 85, kiss after being married by Judge Garcia Friday, June 26, 2015, in Dallas. Gay and lesbian Americans have the same right to marry as any other couples, the Supreme Court declared Friday in a historic ruling deciding one of the nations most contentious and emotional legal questions. Celebrations and joyful weddings quickly followed in states where they had been forbidden. People celebrate outside the Supreme Court in Washington, DC on June 26, 2015 after its historic decision on gay marriage. The US Supreme Court ruled Friday that gay marriage is a nationwide right, a landmark decision in one of the most keenly awaited announcements in decades and sparking scenes of jubilation. A man takes a photo of a large rainbow flag hanging at City Hall in San Francisco, Friday, June 26, 2015, following a ruling by the U.S. Supreme Court  that  same-sex couples have the right to marry nationwide. Jaque Roberts,  left, and her partner of 31 years, Carmelita Cabello, right, arrive to apply for  marriage license at the Travis County building after the U.S. Supreme Court ruled that  same-sex couples have the right to marry nationwide, Friday, June 26, 2015, in Austin, Texas. The courts 5-4 ruling means the remaining 14 states, in the South and Midwest, will have to stop enforcing their bans on same-sex marriage. Ann Sorrell, 78, left, and Marge Eide, 77, of Ann Arbor, a couple for 43 years, embrace after exchanging vows in Ann Arbor, Mich. following a ruling by the US Supreme Court that struck down bans on same sex marriage nation wide Friday, June 26, 2015. Elaine Cleary, of Chicago, who goes to college in Ohio, reacts as she hears the news outside of the Supreme Court in Washington, Friday June 26, 2015, that the court declared that same-sex couples have a right to marry anywhere in the US. PFLAG members Betty Lynch, left, Carmel, Ind. and Annette Gross of Indianapolis, hug during a press conference in the Indiana Statehouse Rotunda in Indianapolis, Friday, June 26, 2015, after the Supreme Court declared that same-sex couples have a right to marry anywhere in the US. The crowd celebrates outside of the Supreme Court in Washington, Friday June 26, 2015, after the court declared that same-sex couples have a right to marry anywhere in the US. President Barack Obama pauses while speaking in the Rose Garden of the White House in Washington, Friday, June 26, 2015, after the Supreme Court declared that same-sex couples have the right to marry anywhere in the US. Gregory Bourke, left, and his husband, Michael DeLeon, right, plantiffs in one of the U.S. Supreme Courts same-sex marriage cases, outside the court following the the ruling in their case, in Washington, June 26, 2015. In a long-sought victory for the gay rights movement, the Supreme Court ruled Friday that the Constitution guarantees a nationwide right to same-sex marriage. Lupe Garcia, left, hugs her partner Cindy Stocking, right,  at the Travis County building after hearing the Supreme Court ruling that grants same-sex couples the right to marry nationwide, Friday, June 26, 2015, in Austin, Texas. Carlos McKnight of Washington, waves a flag in support of gay marriage outside of the Supreme Court in Washington, Friday June 26, 2015. A major opinion on gay marriage is among the remaining to be released before the term ends at the end of June. Demonstrator  Michael Abney holds a miniature rainbow American Civil Liberties Union (ACLU) flag outside the U.S. Supreme Court in Washington, D.C. U.S. on Friday, June 26, 2015. Supporters of same-sex marriage Pooja Mandagere, left, and Natalie Thompson kiss outside  the U.S. Supreme Court following the announcement of the ruling on the same-sex marriage case, in Washington, June 26, 2015. In a long-sought victory for the gay rights movement, the Supreme Court ruled Friday that the Constitution guarantees a nationwide right to same-sex marriage. Demonstrators in support of same-sex marriage embrace after the U.S. Supreme Court ruling in San Francisco, California, U.S. on Friday, June 26, 2015. Same-sex couples have a constitutional right to marry nationwide, the U.S. Supreme Court said in a historic ruling that caps the biggest civil rights transformation in a half-century. Balloons spell out the word \"love\" over the Supreme Court in Washington, Friday June 26, 2015, after the court declared that same-sex couples have a right to marry anywhere in the US. Justin Kattler and Tim Loecker from Dallas, Texas celebrate outside the Stonewall Tavern in the West Village in New York on June 26, 2015. The US Supreme Court ruled Friday that gay marriage is a nationwide right, a landmark decision in one of the most keenly awaited announcements in decades and sparking scenes of jubilation. The chimes of liberty rang in harmony with wedding bells Friday, when the U.S. Supreme Court announced in a 5-4 ruling that states must recognize same-sex marriage. It is a striking shift from little more than a decade ago, during the 2004 presidential election, when President George W. Bush was advocating for a constitutional amendment to ban same-sex marriage. Now, according to the Boston Globe, the former president recently offered to officiate a lesbian wedding. Thats a change in attitude thats swept the entire nation. Over the past decade, public opinion has shifted from majority opposed to same-sex marriage to majority support. President Barack Obama himself evolved on the issue after declining to endorse marriage for same-sex couples in 2008. Even the dissenters are changing their tone. Moral apocalypticism and the \"homosexual agenda\" were the key themes in Supreme Court Justice Antonin Scalias opinion in the 2003 case Lawrence v. Texas, which held that anti-sodomy laws were unconstitutional. Now, in his dissent to todays Obergefell v. Hodges decision, Scalia merely remarks that gay marriage \"is not of immense personal importance to me.\", A few more years at this rate and Scalia will be joining his colleagues in officiating same-sex weddings. The politics of love is winning out over the politics of hate. Here in Houston, however, we still have to deal with the politics of obstinance. People have known for months that this decision was coming down the Supreme Court pipeline, and the legalistic tea leaves were showing signs that same-sex marriage would be the end result. Yet Harris County Clerk Stan Stanart spent his days dilly-dallying, refusing to update his office for this predictable scenario.  His actions left Harris County tarnished as one of the sole major population centers that was not prepared to immediately issue licenses upon the Supreme Courts decision, despite an opinion from Harris County Attorney Vince Ryans office instructing otherwise. If Stanart cannot follow the Supreme Courts decision, then he should feel free to resign. While Harris County was issuing marriage licenses by the afternoon, the Gov. Greg Abbott continues to stand in the doorway. Our governor issued a memo Friday claiming that state employees could ignore the law if it was their sincerely held religious belief. He also set out on Twitter to remark that \"Marriage was defined by God. No man can redefine it. We will defend our religious liberties.\", Ignoring the fact that man has constantly redefined marriage (how many decades ago were wives considered a husbands property?) this attitude glibly ignores the many religious institutions that do recognize same-sex marriage, including many Presbyterian and Lutheran churches, and Reform and Conservative synagogues. The First Amendment well protects those religions that dont want to take part in same-sex weddings, but until todays decision, there was little to protect those that do. Despite todays victory, the struggle for equality isnt over. For decades, representatives in Washington have proposed the Employment Non-Discrimination Act, which would prohibit employment discrimination on the basis of sexual identity - similar to Houstons own equal rights ordinance. \"Now that marriage is a done deal, thats going to be the next shift,\" Houston GLBT caucus President Maverick Welsh told the Chronicle editorial board. The words of angry politicians, and the actions of stubborn ones, cannot stop the march of equality. From coast to coast, the bedrock institution of marriage has been opened to consenting couples of all kinds, strengthening the American society and adding new ranks to the next generation of stable, two-parent households. The highest ideals of love, fidelity, devotion, sacrifice and family have new allies.And the chimes of liberty will continue to ring. ]", "Date": "20150626", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Chimes-of-liberty-6351719.php", "Title": "[Chimes of liberty]"}