{"Content": "[Caption, Close, Texas Governor Rick Perry gives his gubernatorial re-election supporters a double thumbs up as President George W. Bush takes the podium to fully support his former lt. governor in Houston Friday evening, June 14, 2002. Texas Gov. Rick Perry gives a thumbs-up to supporters before speaking at the Des Moines Registers Political Soapbox at the Iowa State Fair, Tuesday, Aug. 12, 2014, in Des Moines, Iowa. The fair runs through Aug. 17th. (AP Photo/Charlie Neibergall), Texas Gov. Rick Perry gives a thumbs-up to supporters before... Ariadne Frolich, 11, a student from New Orleans gets a thumbs up from Texas Gov. Rick Perry during her sixth grade class at Pin Oak Middle School Friday, September 16, 2005. Perry along with U.S. Secretary of Education, Margaret Spellings(not pictured) and Texas Commissioner of Education Shirley Neeley (not pictured) visited classrooms at Pin Oak Middle School and held a press conference afterward where Spellings confirmed that Houstons education will receive federal funding for taking in evacuated children from Louisiana, as well special funding will be given to those children who have been displaced. Johnny Hanson Chronicle, Governor Rick Perry gives a thumbs up as introductions of  directors of other agencies are made during media conference at The Source for Women, 6009 Richmond Avenue,  Tuesday, Dec. 11, 2012, in Houston. Cynthia Wenz, CEO of The Source for Women shown left. Texas Governor Rick Perry gives a thumbs up as he announces that he is suspending his campaign as a Republican presidential candidate, January 19, 2012, in Charleston, South Carolina, in advance of this weekends January 21, 2012 Republican presidential primary. Republican presidential candidate, Texas Gov. Rick Perry gives a thumbs up as his wife Anita -looks on at Hyatt Place January 19, 2012 in North Charleston, South Carolina. Perry, who placed fifth in Iowa and New Hampshire, announced his withdrawal from the presidential race and endorsed former Speaker of the House Newt Gingrich. Republican presidential candidate Governor Rick Perry gives a thumbs up to Chase Frazier, 4, with his father, Mike Frazier, as he arrives for a meet and greet at The Gigglin Goat in Boone, IA on Saturday, Dec. 31, 2011. Republican presidential candidate Governor Rick Perry gives a... Republican presidential candidate Governor Rick Perry gives a thumbs up as he reaches the podium area during a meet and greet at The Fainting Goat in Waverly, IA on Friday, Dec. 30, 2011. At left, are brothers Robert Loewen, 21, and Matthew Loewen, 18, who drove four hours from Minneapolis, MN to see Perry. Texas Governor and Republican candidate for president Rick Perry gives the thumbs-up to supporters during a campaign stop at the Main Street Cafe on December 27, 2011 in Council Bluffs, Iowa.  With one week to go before the Iowa caucuses, Rick Perry continues his bus tour through the state. Texas Governor and Republican candidate for president Rick Perry gives the thumbs-up as he enters a town hall style campaign event at the Glenn Miller Birthplace Museum on December 27, 2011 in Clarinda, Iowa.  With one week to go before the Iowa caucuses, Perry continues his bus tour through the state. Republican presidential hopeful Texas Gov. Rick Perry gives the thumbs up before addressing the Family Research Councils Values Voter Summit in Washington,DC on October 7, 2011. Texas Govenor and Presidential hopeful Rick Perry, gives a \"thumbs up\" sign to supporters as he leaves  a town hall meeting hosted by Rep. Tim Scott, R-S.C. at Horry-Georgetown Technical College on Monday Sept. 5, 2011 in Conway, S.C. Gov. Rick Perry, with wife, Anita, gives a thumbs up to supporters Saturday at Tommys Ham House in Greenville, S.C. Gov. Rick Perry, with wife, Anita, gives a thumbs up to supporters... In this Aug. 6, 2011, file photo Texas Gov. Rick Perry gives a thumbs up as he takes the stage at The Response, a call to prayer for a nation in crisis in Houston. The GOP electorate has made clear in polls that it wants more choices, perhaps a conservative who is strong both on economic and social issues, leading Perry to consider a White House bid. A nationally televised debate, a test vote in Iowa and a candidacy by Perry, should he decide to seek the GOP nomination, could shake up the Republican presidential race in the coming days. Texas Governor Rick Perry gives a thumbs up to work of Doug Stringer as his gives acknowledgments during his closing remark at The Response: A Call To Prayer for a Nation in Crisis event at Reliant Stadium Saturday, Aug. 6, 2011, in Houston. The seven hour program of prayer and fasting in Reliant Stadium was initiated by Texas Governor Rick Perry and funded by the American Family Association. Texas Gov. Rick Perry, right, and Rabbi Yossi Lazaroff flash the \"Gig em, Aggies\" thumbs-up signal following a symbolic menorah lighting ceremony at the Governors Mansion in Austin, Texas on Thursday, Dec. 2, 2010. Gov. Perry is a Texas A&M University alum, and Lazaroff is the director of the Universitys Jewish Center. Texas Gov. Rick Perry signals thumbs up as he prepares to sign House Bill 2978 at the Texas Tech University Health Sciences Center auditorium Tuesday, June 12, 2007, in El Paso, Texas. The event was a ceremonial signing for higher education legislation and a celebration of the passage of the bill by Texas lawmakers that will provide $48 million in startup funds for the full four-year Texas Tech-El Paso School of Medicine. The passage of the bill will enable the El Paso School of Medicine to hire faculty and proceed with the accreditation process to seat the first four-year medical school class in 2009. The Texas Tech chancellor said Texas is proud to become home to the first four-year medical school on the U.S.-Mexico border. House bill 2978 establishes a one-week engineering scholarship program for high school graduates who graduated in the top 20 percent of their class with at least a 3.5 GPA in math and science. Surrounded by friends and family, Texas Gov. Rick Perry gives a thumbs up after taking the oath of office during his inauguration in Austin, Texas, Tuesday, Jan. 16, 2007. Gov. Rick Perry gives a thumbs up after a news conference at a Dallas home on Monday. State leaders looking toward the next budget face a tight money situation driven by the need to fund the new school finance package, including a cut in property tax rates. Texas Gov. Rick Perry gives a thumbs-up to supporters during a celebration of his victory in the Republican gubernatorial primary Tuesday, March 7, 2006, in Austin, Texas. Texas Govenor Rick Perry gives the thumbs-up to the crowd as his wife and  House Speaker Tom Craddick watch during the 2003 Inauguration of Govoner, January 21, 2003 in Austin.   CHRISTOBAL PEREZ/HOUSTON CHRONICLE, Texas Lt. Governor-elect Rick Perry gives a thumb-up to the crowd as he arrives on the platform for his swearing-in ceremony Tuesday, Jan. 19, 1999 in Austin, Texas. State Sen. Teel Bivins, R-Amarillo, stands to the right. If there are two things that Rick Perry clearly loves, its running for president and giving thumbs up. A quick search of images from the former governor and arguably the most famous living Aggieslong tenure and presidential run turns up numerous examples of Perrys signature hand sign, although its not clear if he is telling someone good job, or just responding to a question about Texas A&M. Perry announced that he will announce his second White House bid in Dallas on June 4, and there will undoubtably be more Gig ems from the campaign trail. See some of his best thumbs ups above.]", "Date": "20150515", "Author": "[Compiled by Brian Reynolds]", "Link": "http://www.chron.com/news/politics/article/Who-has-two-thumbs-and-is-running-for-president-6265922.php", "Title": "[Who has two thumbs and is running for president? Rick Perry]"}