{"Content": "[Caption, Close, U.S. Rep. David Brat (R-Virginia) told conservative talk radio host Rusty Humphries \"In our country it looks like we have an ISIS center in Texas now, thats been reported last week.\", Every few years, Texas airwaves, websites and newspapers are flooded with political advertisements, but not all of the statements check out. See which pieces of campaign rhetoric earned the notorious \"Pants on Fire\" rating from PolitiFact. \"Prayer rugs have recently been found on the Texas side of the border in the brush.\", \"In 2013,\" Dan Patrick voted \"against funding to test the backlog of rape kits, allowing rapists to walk free.\"   , John Cornyn \"voted twice in 2013 to back Obamas amnesty plan.\", \"At least 10 ISIS fighters have been caught coming across the Mexican border in Texas\" and there are \"dozens more that did not get caught by the Border Patrol.\", A national lawmaker sounded the alarm that invasion of Texas is well underway. And no, not the invasion by federal troops under the auspices of President Obama and Operation Jade Helm. U.S. Rep. David Brat (R-Virginia) told conservative talk radio host Rusty Humphries that a Middle Eastern militia had already raised its black flag in the Lone Star State. \"In our country it looks like we have an ISIS center in Texas now, thats been reported last week,\" he said. \"You cant make up what a terrible problem this is.\", RELATED:Ted Cruz, GOP weigh in on Jade Helm  but are they playing to the alarmists?, Texas Department of Public Safety spokesman Tom Vinger said, \"There is absolutely nothing to substantiate such a claim.\", ISIS, or the Islamic State group, is a Syria-based militia, tens of thousands strong, that has raped, pillaged and sacked cities across the Fertile Crescent. They are well-armed with captured American tanks and helicopters, andvow revenge for U.S. wars in the Middle East. Brat is a first-term representative who won an upset victory over House Majority Leader Eric Cantor in the 2014 Virginia election. A spokesman for his office, Brian Gottstein, said Brat had misspoken, and was referring to a March 2015 report by conservative groupJudicial Watch that ISIS had a base camp in Mexico. RELATED:Jon Stewart, Chuck Norris weigh in on Jade Helm, That report cited unnamed Mexican military and police sources and claimed \"the exact location where the terrorist group has established its base is around eight miles from the U.S. border.\" When that report broke, we sought to verify with Judicial Watch director and reporter Tom Fitton. He wouldnt specify who the sources were, how they identified the camp as ISIS, whether they had seen the camp themselves or by what means of communication they reached out to Judicial Watch. He said the camp was identified as operated by ISIS because \"thats how [the sources] described it to us.\", The FBI, Texas Department of Public Safety and Customs and Border Protection all said they had no information to corroborate the report. Judicial Watch alleged they were lying, and published an article claiming the FBI was meeting Mexican authorities to formulate a strategy to conceal the ISIS camps from the media, again citing unnamed sources. \"Brat mentioned the issue in that one interview, but after hearing that the reports are being disputed, he is waiting for further confirmation from U.S. officials,\" Gottstein said. Unfounded rumors of ISIS in Texas have been making media rounds since the brutal militants stormed into international attention last summer. In August 2014, then-Governor Rick Perry warned that ISIS militants may have slipped over the Texas border. In September, U.S. Rep. Trent Franks (R-Arizona) said in a radio interview \"it is true we know that ISIS is present in Ciudad Juarez,\" but other media were unable to find any evidence supporting his claim. Days later, Lt. Gov. David Dewhurst said in a Washington, D.C. speech about terrorism that \"prayer rugs have recently been found on the Texas side of the border,\" apparently implying that any of the worlds 1.5 billion Muslims who would attempt an unsanctioned immigration into America were a threat. PolitiFact Texas, a fact-checking project at the Austin American-Statesman, spoke with Dewhursts sources, border newspapers and state and federal authorities, but found no credible reports of prayer rugs. And in October, U.S. Rep. Duncan Hunter (R-California) advanced the growing narrative, telling Fox News \"at least 10 ISIS fighters have been caught coming across the Mexican border to Texas.\" PolitiFact found that claim \"incorrect and ridiculous.\" Expert sources and state and federal agencies unanimously denied the claim, pointing out a total lack of evidence. Many of the ISIS-in-Texas-related claims seem to stem from an August 2014 report by Judicial Watch based on unnamed source, PolitiFact reports. That article has since been removed from the groups website. ISIS has claimed credit for a shooting at an anti-Islam event in Texas on Sunday, however the shooting suspect had been under FBI surveilance for years and does not appear to have made any contact with the militant group.]", "Date": "20150508", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/houston-texas/texas/article/U-S-Rep-says-ISIS-operates-Texas-base-6243149.php", "Title": "[U.S Rep. says ISIS operates Texas base]"}