{"Content": "[Caption, Close, Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Using this soundboard, you can respond to candidates with gems from Donald Trump while watching the GOP debate on Thursday. Weve compiled a list of Trumps most insane and controversial sayings over the years. \"The concept of global warming was created by and for the Chinese in order to make U.S. manufacturing non-competitive.\"Source: Twitter, \"I could have one man say, Were gonna tax you 25 percent, and I could say another, \"Listen you motherf******, were gonna tax you 25 percent. Now you said the same exact thing, but its a different messenger.\"Source: YouTube, \"Our country is in serious trouble. We dont have victories anymore. We used to have victories, but we dont have them. When was the last time anybody saw us beating, lets say, China in a trade deal? They kill us. I beat China all the time. All the time.\"Source: Washington Post, \"The U.S. will invite El Chapo, the Mexican drug lord who just escaped prison, to become a U.S. citizen because our leaders cant say no!\"Source: Twitter, \"I would build a great wall, and nobody builds walls better than me. Believe me. And Ill build it very inexpensively. Ill build a great, great wall on our southern border and I will have Mexico pay for that wall. Mark my words.\"Source: Fox News, \"Thank you. Its true, and these are the best and the finest. When Mexico sends its people, theyre not sending their best. Theyre not sending you. Theyre not sending you. Theyre sending people that have lots of problems, and theyre bringing those problems with us. Theyre bringing drugs. Theyre bringing crime. Theyre rapists. And some, I assume, are good people.\"Source: Washington Post, \"They will pay for the wall, and the wall will go up. And Mexico will start behaving. Mexico is not our friend.\"Source: The Daily Pennsylvanian, \"Our great African American President hasnt exactly had a positive impact on the thugs who are so happily and openly destroying Baltimore!\"Source: Twitter, \"If I were running The View, Id fire Rosie [ODonnell]. I mean, Id look her right in that fat, ugly face of hers, Id say, Rosie, youre fired.\"Source: E! Online, \"Rosie ODonnells disgusting both inside and out. You take a look at her, shes a slob. She talks like a truck driver, she doesnt have her facts, shell say anything that comes to her mind.\"Source: E! Online, \"Arianna Huffington is unattractive both inside and out. I fully understand why her former husband left her for a man- he made a good decision.\"Source: Twitter, \"Hillary Clinton was the worst secretary of state in the history of the United States. Hillary was the worst in the history of the United States, theres never been a secretary of state so bad as Hillary. The world blew up around us. We lost everything, including all relationships. There wasnt one good thing that came out of that administration or her being secretary of state. I have great relationships.\", \"If you cant get rich dealing with politicians, theres something wrong with you.\"Source: Mother Jones, We build a school, we build a road, they blow up the school, we build another school, we build another road, they blow them up, we build again. In the meantime we cant get a f***ing school in Brookl Source: National Review, \"Hes not a war hero. Hes a war hero because he was captured. I like people that werent captured, OK, I hate to tell you.\"Source: Associated Press, Yeah, we know presidential debates can be boring ... with the tangents and the circular answers. But heres one way to make Thursdays GOP event on FOX News a little more entertaining for you and your watch party. A soundboard created a while back by Realmofdarkness.netis loaded with short gems of wisdom from Donald Trumps work on NBCs \"The Apprentice.\" Gems like \"Meatloaf!\" and \"Youre a loser.\", RELATED: Listen to what Donald Trump says about immigration, Now when Jeb Bush asks Trump to clarify his stance on immigration during the stage debate, you and your friends can choose a response like, \"Are you the boss?\" or \"Youre saying you have no idea?\", Tune into the debate 9 p.m. EST Thursday on Fox News and try it out. Republican presidential candidates Trump, Bush, Rand Paul,Ted Cruz,Marco Rubio,Mike Huckabee,Chris Christie,Ben Carson,Scott Walker and John Kasich will be featured during the event.]", "Date": "20150805", "Author": "[Jessica Hamilton]", "Link": "http://www.chron.com/news/politics/election/article/This-Donald-Trump-soundboard-will-make-watching-6426088.php", "Title": "[This Donald Trump soundboard will make watching Thursday's debate more interesting]"}