{"Content": "[Sarah Palin, the former governor of Alaska and 2008 Republican vice presidential nominee, indicated she might run for president in a conversation with an ABC News reporter at a soup kitchen on Thursday. \"Yeah, I mean, of course, when you have a servants heart, when you know that there is opportunity to do all you can to put yourself forward in the name of offering service, anybody would be interested,\" Palin said. According to ABC, Palin was \"serving wild boar chili to the homeless\" at the Salvation Army in Las Vegas when she discussed her presidential ambitions. She was in the city for the annualShooting, Hunting and Outdoor Trade Show. When she was pressed on whether she would \"possibly\" launch a campaign, Palin expressed a desire to see a female president. \"We definitely had enough of seeing that  America has had enough of seeing that  sign on the Oval Office door saying, No Girls Allowed. I know that,\" Palin said, later adding, \"It doesnt necessarily have to be me, though, but no, America is definitely ready for real change.\", Palin went on to note she would be \"happy to drive that competition.\", \"Competition will make everyone better and produce more and be more candid regarding their solutions they will offer this country. I am very interested in that competitive process and, again, not necessarily me,\" said Palin. ABC also asked Palin about the fact Mitt Romney, who was the GOPs presidential nominee in 2012, and former Florida Gov. Jeb Bush (R) have also expressed interest in running. Palin said she hoped to see \"new energy\" to take on Hillary Clinton, who is widely seen as the frontrunner for the Democratic nomination. \"That competition in the GOP ... will surface that candidate who can take on Hillary, be ready for Hillary and show the nation what it is going to take to get the country back on the right track,\" Palin said. \"Because we cant afford status quo, because status quo lately has been Latin for, We are getting screwed, and status quo has got to go.\", Palin is scheduled to attend theIowa Freedom Summit. The annual conservative event in the influential early primary state is hosted by Rep. Steve King (R-Iowa). In addition to Palin, the summit is set to feature appearances from other potential GOP candidates; New Jersey Gov. Chris Christie (R), Wisconsin Gov. Scott Walker (R), Sen. Ted Cruz (R-Texas), former Texas Gov. Rick Perry, erstwhile Pennsylvania Senator Rick Santorum, and the neurosurgeon and conservative activist Ben Carson. Join the conversation about this story , See Also:]", "Date": "20150123", "Author": "[Hunter Walker, provided by]", "Link": "http://www.chron.com/default/article/Sarah-Palin-Is-Interested-In-Running-For-6036745.php", "Title": "[Sarah Palin Is 'Interested' In Running For President In 2016]"}