{"Content": "[Caption, Close, This handout photo provided by Collin County, Texas shows Texas Attorney General Kenneth Paxton, who was booked into the county jail Monday, Aug. 3, 2015, in McKinney, Texas. A grand jury last week indicted Paxton on felony securities fraud charges. (AP Photo/Collin County via AP), AUSTIN - Ken Paxtons first-degree felony indictments were dismissed and then re-issued Tuesday so prosecutors could clarify the accusations against the first-term attorney general. A Collin County grand jury indicted Paxton last month on two first-degree felonies and one third-degree felony for allegedly violating state securities laws. The original indictments accuse Paxton of engaging in fraud \"in connection with the offer for sale and sale\" of at least $100,000 worth of stock in McKinney-based tech company Servergy to Byron Cook,a Corsicana Republican who chairs the House State Affairs Committee, and Joel Hochberg, a south Florida businessman. They also alleged Paxton failed to disclose to Cook and Hochberg that the state legislator had not personally invested in Servergy and had received 100,000 shares of stock from the company as compensation. The re-indictmentsmake the same claims but clarify the accusations, alleging that Paxton \"unlawfully and intentionally\" offered to sell at least $100,000 worth of Servergy stock to both men whilefailing to disclose, also intentionally, that he \"had not, and was not\" investing his own funds. The re-indictments also clarifies that Paxton allegedly received the free shares in exchange for selling the stock. Read the Cook re-indictment document here. Read the Hochberg re-indictment document here. The two first-degree felony charges carry a sentence of five to 99 years in prison, and a fine of no more than $10,000. The third-degree charge stems from Paxtons failure to properly register with the state as an investment adviser representative, which carries a sentence of two to 10 years in prison, as well as a $10,000 fine. The complainants in this indictment were named as James and Freddie Henry, clients of Paxton friend and business associate Frederick \"Fritz\" Mowery. In the indictments, the Henrys allege Paxton acted as an investment advisor representative without being properly registered with the Texas State Securities Board. In April 2014, Paxton admitted to repeatedly soliciting clients for Mowery without being registered. He paid and $1,000 fine and was reprimanded by the securities board. The board ismulling whether to revoke Mowerys state registration for other alleged instances of fraud and deceit. Paxtons attorney on Tuesday used the Tuesday re-indictment to criticize the work of special prosecutors Brian Wice and Kent Schaffer, two Houston-based criminal defense attorneys assigned to the case after Collin County District Attorney Greg Willis recused himself because of his personal and business ties to Paxton. \"This confirms that there have been troubling issues with the grand jury process from the beginning,\" said Paxton attorney Joe Kendall. \"They had months to investigate and then rushed to indict.  Now, the special prosecutors are back to clean up the botched indictments.  It should make every fair-minded person question the process in this case.\", Wice and Schaffer shot back later Tuesday, telling the Chronicle, \"Contrary to the assertion of Mr. Paxtons criminal defense lawyer that the indictments charging his client with two counts of first-degree felony securities fraud were botched, we obtained re-indictments to defuse the boilerplate arguments predictably advanced by the defense that the original indictments lacked specificity or were otherwise ambiguous.\", \"It is not unusual in any felony case, particularly fraud cases, for prosecutors to ask the grand jury to re-indict so as to provide sufficient notice to the accused as to the nature of the criminal conduct he must defend against,\" they added. \"At the end of the day, the fair-minded people whom Mr. Paxtons criminal lawyer believes should question the process in this case will recognize that the serious allegations against his client remain unchanged.\", Paxtons third-degree indictment was handed up on July 7, just days before the statute of limitations would have run out. Paxtons two first-degree indictments were issued July 28 and unsealed on Aug. 3. The parties have said Judge George Gallagher of Tarrant, who will preside over any jury trial that might take place, has asked them not speak about the details of the case. Gallaghers clerk said last week, however, that \"there is no gag order at this time.\"]", "Date": "20150818", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/ken-paxton/article/Paxton-reindicted-6451657.php", "Title": "[Paxton re-indicted to clarify language]"}