{"Content": "[Caption, Close, Gov. Jerry Brown, with Anne Gust Brown, walks to speak to the media after being reelected to a fourth term in front of the Governors Mansion in Sacramento, California, November 4, 2014. SACRAMENTO  Fresh off winning a historic fourth term as governor, Jerry Brown plans to push ahead with a pair of projects that could transform the California landscape: high-speed rail and delta water tunnels. The ventures have strong critics. But having soared into office with 59 percent of the vote and no concern about winning another term, Brown is in a unique position to solidify the legacy hes seeking: as a fiscal steward who built historic projects for the state. I do come from a long line of people who have achieved something, and I feel I have a lot to live up to. And Im going to make sure during these next four years I maximize that opportunity, Brown said Wednesday. His father, Edmund Pat Brown, was governor in the 1960s and built his legacy around the projects he ushered in  including the states water delivery system and its Master Plan for Higher Education. Criminal justice , Brown said he also wants to reform criminal justice policies and address problems that arose after he shifted low-level offenders from overcrowded prisons to unprepared jails in 2011. He said he wants to continue to invest in schools, which received budget flexibility under a law he signed last year. And he plans to push policies that reduce carbon pollution and enlist other states and countries to help address climate change. Jessica Levinson, a law professor who teaches political ethics at Loyola University in Los Angeles, said Tuesdays passage of Browns signature ballot measures, Props. 1 and 2  a $7.5 billion water bond and a rainy-day fund  give Brown added credibility as he seeks to cement his legacy on infrastructure and budget issues. Both of those are forward-looking, long-term changes to the California Constitution meant to put us on a strong footing going forward, Levinson said. Those big-picture priorities are as important as his desire to leave the state in strong fiscal shape, Brown said, adding that his next term will be defined by his efforts to strike the right balance between saving and investing. Going forward, its a challenge to be fiscally responsible and, on the other hand, to keep faith with the aspirations and hopes of the Democratic Party and those who are looking for more and more government spending in investment, he said. If you abandon that, you become really incoherent as a Democratic leader. If you totally give into it, you fall prey to budget deficits and chaos and public dissatisfaction. Brown has faced mounting criticism over the $68 billion high-speed rail project, which was a popular idea when voters approved $8.6 billion in bonds to launch the endeavor in 2008. Since then, the project has been stalled by lawsuits, and some public opinion polls show voters no longer support it. Bond win, Last year, before construction could begin on the first 130 miles, a Sacramento County judge blocked the sale of the bond, saying the project didnt have environmental clearance and didnt properly identify sources of funding for the rest of the rail line. The states Third District Court of Appeal reversed that ruling in July, allowing the bond sale to proceed. Opponents  including Kings and Kern counties, Union Pacific Railroad and some Central Valley landowners  turned to the state Supreme Court, which refused to hear the appeal last month. That was a major boost for supporters like Brown and environmental groups, who say the rail will reduce car pollution and create jobs across the state. Another project that has faced immense criticism, particularly from environmental groups, is the states $25 billion plan to dig two 40-foot-wide tunnels to carry water from one end of the Sacramento-San Joaquin River to the other. State officials say the tunnels are needed to restore the delta ecosystem and stabilize the water supply for 25 million Californians and 3 million acres of farmland from San Jose to San Diego. The state Department of Water Resources is revising a draft environmental impact report that will be released for public comment early next year. But political observers say there are other issues they hope Brown will address in his fourth term. Political consultant Joel Fox, president of the Small Business Action Committee, said many in the business community want the governor to loosen restrictions in the California Environmental Quality Act  known as CEQA  which they say impedes business and job development in the state. Fox said additional efforts to reduce public pension liabilities, which Brown has also promised, remains a key concern. But Fox said the wild card will be whether Brown agrees to change the states tax codes to temper the feast-or-famine result of relying heavily on high-income earners. Taxes are going to be a big part of the discussion over the next two years, and part of the ballot on 2016, said Fox, a Republican. Under pressure, Fox predicted that Democrats will pressure Brown, also a Democrat, to extend the temporary taxes mandated by Prop. 30 that are set to gradually expire starting in 2016. Fox said he expects that Democrats will also push Brown for changes to Prop. 13, the landmark law from 1978 limiting property taxes. Some Democrats have sought a split roll, which would exempt commercial properties from Prop. 13. Some of the folks who want to enhance revenue might go to the business community and say, If you dont stand as a roadblock to the extension of Prop. 30, we wont go for a split roll,  Fox said. Brown said Wednesday that he has no plans to make any tax-code changes, especially on Prop. 30. To me, Prop. 30 was temporary, he said. Thats what I said, and I meant it. Levinson of Loyola University said that Democrats who may try to take Brown off track or pressure him for big spending items have already gotten the signal that he will keep them in line, and hes very comfortable flexing his political muscle, she said. Jon Fleischman, publisher of the popular GOP website FlashReport.org, said Brown is on track to be a status quo governor who will continue with his major initiatives  but with a political challenge hes never faced. The day he got re-elected, he became a lame-duck governor who will not be able to get through any agenda that is contrary to the public employees unions, Fleischman said. Which is why Fleischman speculates that Brown will now look for a shiny new object. His legacy in the next four years all depends on whether he wants to finish his career as a governor or a U.S. senator. Serious contender, With Sen. Barbara Boxer expected to retire in 2016, Brown would be a serious contender, if interested. Browns lengthy political resume includes statewide posts as attorney general and secretary of state, as well as mayor of Oakland and chairman of the state Democratic Party. He sought the Democratic nomination for U.S. president three times. Hell be an octogenarian when he finishes his term as governor in 2018, but Brown hasnt ruled out yet another title after that. A day after winning re-election last week, he quipped to reporters that when he leaves office, hell be free to seek the position of termed-out Tom Torlakson  the superintendent of public instruction. Brown said he prefers not to think about whether his latest campaign was his last. I dont like to think about my last campaign, he said. I find it a depressing thought. So, Im not. Melody Gutierrez and Carla Marinucci are San Francisco Chronicle staff writers. E-mail: mgutierrez@sfchronicle.com, cmarinnuci@sfchronicle.com Twitter: @MelodyGutierrez, @cmarinucci ]", "Date": "20141110", "Author": "[Melody Gutierrez and Carla Marinucci]", "Link": "http://www.chron.com/politics/article/Jerry-Brown-looks-to-solidify-legacy-with-big-5882165.php", "Title": "[Jerry Brown looks to solidify legacy with big state projects]"}