{"Content": "[Caption, Close, , Ted Nugent has apologized for referring to President Barack Obama as a \"subhuman mongrel\" last month. He did not, however, offer contrition to Obama. \"I do apologize  not necessarily to the President  but on behalf of much better men than myself,\" he said to radio host Ben Ferguson, according to CNN. Furthermore, he called that word grouping \"street-fighter terminology\" and said he wished he used \"more understandable language,\" such as \"violator of his oath to the Constitution.\", A Pocket Guide to Republican Rockers, Last month, in an interview with Guns.com, Nugent fielded a question about the 2016 presidential race. As he bloviated about conservative ideas, it led him to this statement: \"I have obviously failed to galvanize and prod, if not shame, enough Americans to be ever vigilant, but not to let a Chicago communist-raised, communist-educated, communist-nurtured subhuman mongrel like the ACORN community organizer gangster Barack Hussein Obama to weasel his way into the top office of authority in the United States of America. I am heartbroken but I am not giving up.\" He also called for Democrats to be put in jail. \"I apologize for using the term,\" he said in his radio interview. \"I will try to elevate my vernacular to the level of those great men that Im learning from in the world of politics.\", This apology may have been referring to how his words may be seen as representing other Republicans from his state, such as Governor Rick Perry and Senator Ted Cruz. The latter previously told CNNthat he did not support Nugents opinions. \"Those sentiments there, of course, I dont agree with them,\" he said. \"Youve never heard me say such a thing and nor would I.\", Neither Cruz nor Perry have ruled out campaigning with Nugent in the future. The rocker lately has been campaigning with Texas Attorney General Greg Abbott in his gubernatorial bid against Texas State Senator Wendy Davis. This article originally appeared on Rollingstone.com: Ted Nugent Apologizes for Calling Obama a Subhuman Mongrel]", "Date": "20140221", "Author": "[Kory Grow, provided by]", "Link": "http://www.chron.com/default/article/Ted-Nugent-Apologizes-for-Calling-Obama-a-5256729.php", "Title": "[Ted Nugent Apologizes for Calling Obama a 'Subhuman Mongrel']"}