{"Content": "[Caption, Close, , Throw those $200 headphones over thise Rand Paul beanie to complete the look. Its kind of \"so 2007,\" but Rand is offering up this \"Dont Drone Me, Bro!\" shirt. It comes, appropriately in Gadsen-yellow. Aint no party like a Rand Paul party cuz Rand Paul party dont stop. Keep your beer cold with this. Now that you have you sixer cold, you are going to need a Rand Paul cornhole set. And please bros, dont forget the Ran Paul flip flops, they will really set off your Rand Paul beer and cornhole backyard rager. Do you \"Stand with Rand\" and the Constitution and have an iPhone 6? This is for you. Keep yourself invisible from spies with this $15 piece of tape. At a thousand bucks, this is for the serious Rand fans. Rand Paul just stood up and told the nation that he will \"do all it takes to defend America from these haters of mankind.\", It was a mic-drop kind of moment, but it would totally have better if he was actually wearing these Rand Paul-branded Beats By Dre headphones. If you \"Stand With Rand,\" these bad boys are a must-have item that literally label you as a proud conservative while giving you a deep, rich low-end respsonse (headphones not included). But dont stop there, are you about to throw a politically-themed backyard rager? Youre going to need at least one six-pack of beer koozies ($25) and an official Rand Paul cornhole set ($100) to really kick things off. Now that the senator is officially all-in for the 2016 presidential election, supporters can grab all this gear (and more) over at randpaul.com. Im sure its no accident that Rands offerings contrast Hillary Clintons more bougie alcohol-related items like branded champagneand rocks glasses. Ted Cruz fans, you dont need to feel left out, here are 22 crazy Ted Cruz items you can buy online.]", "Date": "20150407", "Author": "[Chris Preovolos]", "Link": "http://www.chron.com/news/article/Rand-Paul-Beats-By-Dre-skins-and-other-amazing-6184036.php", "Title": "[Rand Paul 'Beats By Dre' skins and other amazing Rand Paul swag]"}