{"Content": "[Caption, Close, Rep. Myra Crownover, R-Denton, left, talks with Lt. Gov. David Dewhurst in the Texas Senate. Julia Rathgeber, center, is Dewhursts director of public policy. AUSTIN -- Longtime state representative Myra Crownover said Monday she will not run for re-election in 2016, a move that will create another opening atop a powerful state House committee. The 15-year lawmaker, who has chaired the House Public Health Committee since February, said in an interview that she was proud of her legislative work and eager to explore opportunities outside of elected office. \"I couldnt have had a better session this year,\" said the Denton Republican, pointing to the passage of longtime priorities such as expanded health savings accounts for state workers and tuition revenue bonds for universities. \"I want to go out on top.\", Crownover said she would remain in office through her current term. She promised to work in the interim on combating medical fraud and the increasing cost of health care, among other issues. As a chairwoman, Crownover was most known for two bills that passed in her committee -- one allowing epilepsy patients to use a treatment oil derived from a marijuana-related plant, and one that banned the sale of e-cigarettes to minors. She also sponsored the controversial House Bill 40, which essentially overturned a ban on fracking that was approved by voters in her home city. Crownover became the 13th lawmaker to say they would not be returning for the next Legislature, and the fourth House committee chair. Republicans John Otto (Appropriations), Jimmie Don Aycock (Public Education) and Jim Keffer (Natural Resources) have all announced retirements. Democrat Sylvester Turner, the vice chair of Appropriations, has also said he would step down; he is running for Houston mayor. The latest retirement creates an opportunity for Read King, a fellow Republican who unsuccessfully challenged Crownover from the right last year, and has announced plans to run for the seat again.]", "Date": "20150803", "Author": "[Brian M. Rosenthal]", "Link": "http://www.chron.com/news/politics/texas/article/Crownover-says-she-will-not-seek-re-election-6421859.php", "Title": "[Crownover says she will not seek re-election]"}