{"Content": "[Caption, Close, , Texas Attorney General Ken Paxton was indicted on three felony fraud charges stemming from an alleged investment scheme into the McKinney-based technology company Servergy, as well as his failure to register as an investment advisor representative with the state. Texas Attorney General Ken Paxton was indicted on three felony... A black SUV carrying Texas Attorney General Ken Paxton and others departs the Collin County jail Monday, Aug. 3, 2015, in Plano, Texas. (AP Photo/Tony Gutierrez), Protesters against Texas Attorney General Ken Paxton hold signs as they stand outside the Collin County Courthouse, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), A black SUV carrying Texas Attorney General Ken Paxton and others departs the Collin County jail Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), A black SUV carrying Texas Attorney General Ken Paxton and others departs the Collin County jail Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), Protesters call for the resignation of Texas Attorney General Ken Paxton as they stand on the Collin County Courthouse steps, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), Protesters calling for Texas Attorney General Ken Paxton to resign hold signs as they stand outside the Collin County Courthouse, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), Protesters against Texas Attorney General Ken Paxton hold signs as they stand outside the Collin County Courthouse, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), A photograph of a copy of one of the indictments against Texas Attorney General Ken Paxton, is shown, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), The specific details of the indictment will not be revealed until Tuesday, but a special prosecutors said earlier this month they would seek first-degree felony charges against Paxton for violating state securities laws. 1,300 - The percent increase in Paxtons business interests since he was first elected to the state House in 2003. At that time, he had investments in just two businesses; by 2014, this had expanded to 28. He had said he is trying to divest or dial down many of these investments after critics have raised conflict of interest concerns. 3 - The number of times Paxton admitted to soliciting clients for his friend Frederick \"Fritz\" Mowery without being properly registered with state authorities. He was fined $1,000 and reprimanded in April 2014. Texans for Public Justice, an Austin-based group, later filed a criminal complaint with Travis County prosecutors, saying the violation amounted to a third-degree felony. 20 - The percent by which Paxton defeated Sam Houston, his Democratic opponent in the 2014 race for attorney general. Houston, and Paxtons Republican rivals in the GOP primary, lost even after continuing to highlight Paxtons admitted securities violations. 10 - The number of months between the time when Paxton admitted to breaking the law and Travis County prosecutors referred the case to Collin County, where any violations likely took place. The case was put on hold because of an internal policy aimed at preventing politically motivated investigations in campaign season. 4 - The number of businesses Paxton and Collin County District Attorney Greg Willis have invested in together. Willis, a long-time friend and political ally of Paxton, recused himself after it became clear months had passed without him taking up the case referred to him by Travis County prosecutors. 2 -The number of special prosecutors assigned to the case in April after Willis recusal. A month later, a local judge agreed to grant the prosecutors request to expand the case to include any and all possible securities act violations. $100,000+ - The amount of money involved in evidence the special prosecutors plan to present to a Collin County grand jury this month. Schaffer has said they have \"substantial evidence\" to secure a first-degree felony indictment against Paxton. $26 million - The total stock sale for Servergy, Inc. a McKinney-based company over the last five years. The U.S. Securities and Exchange Commission confirmed it began investigating Servergy in 2013 for allegedly defrauding its investors. Paxton was an early investor in the company, his name and email was found in the SEC subpoena of Servergy principals. $2.5 million - The amount of money Paxton currently holds in his campaign coffers, a comfortable cushion to mitigate against future expenses. McKINNEY - Texas Attorney General Ken Paxton will plead not guilty to three felony charges related to alleged securities fraud, his attorney said late Monday afternoon. Paxton was booked this morning at the Collin County jail on felony charges unsealed at noon accusing him of encouraging people, including current and former members of the Legislature, to invest more than $600,000 in a McKinney-based technology company called Servergy without telling them he was making a commission. He also misrepresented himself as an investor in the company, which as recently as December 2014 was being investigated for allegedly defrauding its stockholders by the U.S. Securities and Exchange Commission, the indictment documents added. These first-degree felony charges carry a minimum sentence of five to 99 years in prison. Paxtons defense attorney, Joe Kendall, issued the following statement: \"Attorney General Ken Paxton will plead not guilty to these accusations and he will demand a trial by jury. He is looking forward to the opportunity to tell his side of the story in the courtroom of Tarrant County Judge George Gallagher, who was appointed to the case after Judge Chris Oldners recusal on July 29. Judge Gallagher has given instructions to make no further public comments or publicly speculate on events. Attorney General Paxton and I intend to comply with Judge Gallaghers instructions. In the meantime, the Attorney General is returning to Austin to focus on his work on behalf of the citizens of Texas.\", In keeping with his long-time pattern of avoiding the media, Paxton entered the Collin County jail through an entrance inaccessible to the press and public, and did not make a statement after his booking at the county courthouse. Dozens of reporters waited for Paxton, who did not appear. A handful of members of the public, mostly representing the Texas Democratic Party, held a small press conference calling for Paxtons resignation. The scene marked a stark departure from Gov. Rick Perrys post-indictment booking last year, when Perry made a lengthy statement in front of the Travis County courthouse in front of throngs of supporters. Just one pro-Paxton supporter was spotted in McKinney on Monday, a middle aged woman standing on the sidelines and toting a Bible. Paxton is the first sitting Texas attorney general indicted while in office since Jim Mattox was charged in 1983 with commercial bribery. He did not resign and was later acquitted. Rep. Byron Cook, R-Corsicana, chair of the House State Affairs Committee, and south Florida businessman Joel Hochberg were the two complainants in the first-degree felony cases against Paxton. Terry Jacobson, Cook and Hochbergs attorney, declined comment on the indictments. According to the documents, Cook alleges that beginning in mid-2011, the then-state senator representing McKinney received free stock from Servergy in exchange for convincing Cook to invest at least $100,000 in the company. Paxton failed to disclose that he had not personally invested any of his own money and that he was being compensated for attracting other investors, the indictments added. The Hochberg indictment document makes the same claims, also stating he invested at least $100,000 in the company without knowing Paxton was allegedly benefitting from his investment without having made one himself. The third-degree charge stems from his failure to properly register with the state as an investment adviser representative, which carries a sentence of two to 10 years in prison, as well as a $10,000 fine. The complainants in this indictment were named as James and Freddie Henry. Paxton was released from the jail Monday on a total of $35,000 in personal recognizance bonds, and he was allowed to wear a suit and tie in his mugshot instead of draping his shoulders in a white towel, which is usually required for all people booked in Collin County. Paxton does not need to resign due to the indictment, and may retain his job through the legal process. Tarrant County Judge George Gallagher has been assigned to the case, which is expected to go to trial. The states two top Republican leaders on Monday broke their silence on Paxtons indictment, both urging against a rush to judgment as the states top lawyer faces court. \"Everyone is entitled to due process under the law. As a former judge, I recognize this is the first step in a lengthy process and will respect that process as it moves forward,\" Abbott said hours after the indictment was made public in Collin County, in his first remarks on the case. In a separate statement almost as brief as Abbotts, Lt. Gov. Dan Patrick echoed the sentiment. \"It is important to recognize that an indictment is not a conviction. Under our Constitution, every person is innocent until proven guilty,\" Patrick said. \"I am confident our judicial system will weigh all the facts and applicable law with a blind eye for justice and Ken Paxton, like anyone else, will be afforded his day in court.\", Both statements were far less forceful in their defense of Paxton than was the response from state officials after then-Gov. Rick Perry was indicted almost a year ago on felony charges for allegedly trying to force Travis County District Attorney Rosemary Lehmberg to resign, after she pleaded guilty to drunken driving and served jail time, by threatening to veto state funding for her public corruption unit. She refused, and Perry vetoed the funding. ]", "Date": "20150803", "Author": "[Lauren McGaughy and Mike Ward]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Attorney-general-may-surrender-today-on-fraud-6421373.php", "Title": "[Texas attorney general Ken Paxton to plead not guilty on fraud charges]"}