{"Content": "[Caption, Close, Protestors hold up signs containing slogans and the names of 11 people detained in a demonstration days earlier, as they march to call for the return of 43 missing students and the liberation of the detained, in Mexico City, Tuesday, Nov. 25, 2014. Nearly two months after the students disappeared following an attack by police, protests only continue to multiply, as citizens demand that the government find the missing students alive. (AP Photo/Rebecca Blackwell), These are dark days in Mexico. While Americans the past few days have been captivated by events in Ferguson, Mo. Mexicans in huge numbers have been marching, protesting and demanding answers regarding 43 students who are missing and presumed dead in the state of Guerrero in southwestern Mexico. Their mass disappearance nine weeks ago may not represent a \"breaking point,\" as some have suggested, for a country that has endured more than its share of brutal drug violence. But it could be a breaking point for the government of President Enrique Pea Nieto, and that could have major implications for the United States. Since his election in 2012 with 38 percent of the vote, the president has tried to shift the focus from pervasive drug violence to ambitious economic reform, and hes had some success. Until now. His governments sluggish response to the students disappearance, along with a scandal involving a $7 million mansion for his wife, has refocused the harsh spotlight on the countrys endemic corruption and security problems. As Brookings Institution fellow Diana Villiers Negroponte has pointed out, the distinction between the six years of violence against drug cartels under President Felipe Caldern and the current wave of violence - the 43 students and others - is that Mexicos armed forces and its municipal and state police are implicated. The Mexican people, she notes, dont know who to fear the most: the cartels or state officials. The students in Guerrero were traveling to the rural town of Iguala on Sept. 26 to protest education reforms when they were stopped by police and gunmen thought to belong to a local cartel. Authorities believe the police turned the students over to the cartel, Guerreros Unidos. The mayor of the town and his wife have been arrested and charged with ordering the police to capture the students out of fear they would disrupt a speech the wife was going to make. Three of the gang members have confessed to murdering the students, burning them and throwing the remains in plastic bags in a nearby river and garbage dump. This horrific incident could not have come at a worse time for the Pea Nieto government. The president and his supporters have been anxious to assure foreign investors that a new PRI government has transformed Mexico into a safe, reliable and increasingly prosperous business partner. But the incidents of lawlessness and corruption suggest that little if anything has changed. An increasingly skeptical nation seems fed up with blanket government assurances, and investors, in this country and elsewhere, must surely be apprehensive about the long-term success of the structural and institutional reforms the president has been advocating.  , Revelations of shady dealings surrounding the mansion Pea Nietos wife was building, while not as significant as the students disappearance, also have tarnished the presidents well-crafted image. The house scandal may have led to the cancellation of a $4 billion bullet-train project awarded to a Chinese-led consortium that included a Pea Nieto crony and other firms with ties to Pea Nietos political party. Mexican officials and business executives insist that the cancellation proves that Mexican bidding processes are clean and fair, but its not hard to imagine international investors - Houston energy companies, for example - reconsidering their involvement in Mexico. Pea Nieto must somehow convince the Mexican people that he will do whatever is within his power to assure a complete and transparent investigation into the disappearance of the students. He also needs to pay as much attention to reforming criminal justice procedures as he has to his bold economic reforms. The endemic corruption in many of Mexicos 2,400 municipalities means that extortion, kidnappings and retail drug trade continue to flourish unimpeded. Pea Nieto seems to understand that his nation stands at a crossroads. Either Mexico can continue its efforts to become a stronger democracy with a burgeoning middle class and a commitment to the rule of law, or it can allow its immense challenges - violence, illegality, corruption - to overwhelm the advances it has made in recent years. Mexicos success matters a great deal to its northern neighbor. Its Mexicos task, of course, but given our ties of commerce, culture and community, the U.S. has opportunities to help. Whether its countering the drug trade in this country, working cooperatively with Mexico on immigration or working together to upgrade border infrastructure, we have can assist our neighbor on its long march toward a secure, peaceful and prosperous future and help ourselves in the process.]", "Date": "20141129", "Author": "[Copyright 2014: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Mexico-s-dark-days-5923444.php", "Title": "[Editorial: Mexico's dark days]"}