{"Content": "[Caption, Close, The highly controversial executive order issued by President Obama caused a backlash from many in the GOP. See how the order, which has been blocked by a judge, would impact the nation if its eventually enforced. 1. Parents, 2. Children, 3. Prioritizing deportations, 4. Law enforcement, 5. Border security, 6. Salaries, 7. Business programs, 8. Green cards, The U.S. Department of Homeland Security recently released a memorandum regarding the detaining and removal of undocumented immigrants in the country. Specifically, it details who is at the top of the priority list and who isnt. Weve ranked them all from the least to most likely to be deported.Source: Department of Homeland Security Memo, Per the DHS: \"Aliens described in this priority, who are also not described in Priority 1, represent the second-highest priority for apprehension and removal ... These aliens should be removed unless they qualify for asylum or another form of relief under our laws or, unless, in the judgment of an ICE Field Office Director, CBP Sector Chief, CBP Director of Field Operations, USCIS District Director, or users Service Center Director, there are factors indicating the alien is not a threat to national security, border security, or public safety, and should not therefore be an enforcement priority.\"Source: Department of Homeland Security Memo, At risk: Undocumented immigrants whove violated their visa or the terms of their visa waiverPer the DHS: \"Aliens who, in the judgment of an ICE Field Office Director, USCIS District Director, or USCIS Service Center director, have significantly abused the visa or visa waiver programs.\"Source: Department of Homeland Security Memo, At risk: Undocumented immigrants caught entering the U.S. or anyone who cant convince an immigration officer theyve been here since Jan. 1, 2014.Per the DHS: \"Aliens apprehended anywhere in the United States after unlawfully entering or re-entering the United States and who cannot establish to the satisfaction of an immigration officer that they have been physically present in the United States continuously since Jan. 1, 2014.\"Source: Department of Homeland Security Memo, At risk: Undocumented immigrants whove committed more serious crimes like domestic violence or sexual abuse.Per the DHS: \"Aliens convicted of a significant misdemeanor, which for these purposes is an offense of domestic violence; 1 sexual abuse or exploitation; burglary; unlawful possession or use of a firearm; drug distribution or trafficking; or driving under the influence; or if not an offense listed above, one for which the individual was sentenced to time in custody of 90 days or more (the sentence must involve time to be served in custody, and does not include a suspended sentence).\"Source: Department of Homeland Security Memo, At risk: Undocumented immigrants whove hit three strikes on crimes other than minor traffic stops or any crime that specifically involves their immigration status.Per the DHS: \"Aliens convicted of three or more misdemeanor offenses, other than minor traffic offenses or state or local offenses for which an essential element was the aliens immigration status, provided the offenses arise out three separate incidents.\"Source: Department of Homeland Security Memo, Per the DHS: \"The removal of these aliens must be prioritized unless they qualify for asylum another form of relief under our laws, or unless, in the judgment of an ICE Field Off Director, CBP Sector Chief or CBP Director of Field Operations, there are compell and exceptional factors that clearly indicate the alien is not a threat to national securi border security, or public safety and should not therefore be an enforcement priority.\"Source: Department of Homeland Security Memo, At risk: Undocumented immigrants whove committed violent or federal felonies, like murder or drug trafficking.Per the DHS: \"Aliens convicted of an \"aggravated felony,\" as that term is defined in section 101(a)(43) of the Immigration and Nationality Act at the time of the conviction.\"Source: Department of Homeland Security Memo, At risk: Undocumented immigrants convicted of a felony.Per the DHS: \"Aliens convicted of an offense classified as a felony in the convicting jurisdiction, other than a state or local offense for which an essential element was the aliens immigration status.\"Source: Department of Homeland Security Memo, At risk: Convicted gang membersPer the DHS: \"Aliens convicted of an offense for which an element was act participation in a criminal street gang, as defined in 18 U.S.C.  52 l(a), aliens not younger than 16 years of age who intentionally participated an organized criminal gang to further the illegal activity of the gang.\"Source: Department of Homeland Security Memo, At risk: Undocumented immigrants caught trying to get into the U.S.Per the DHS: \"Aliens apprehended at the border or ports of entry while attempting to unlawfully enter the United States.\"Source: Department of Homeland Security Memo, At risk: Known or suspected spies and terrorists (Pictured here: Anna Chapman, a former Russian spy kicked out of the U.S. in 2010)Per the DHS: \"Aliens engaged in or suspected of terrorism or espionage, or  otherwise pose a danger to national security.\"Source: Department of Homeland Security Memo, AUSTIN --Gov.-elect Greg Abbott on Wednesday sued the Obama administration over the executive actions on immigration, saying the president overstepped his power by attempting to rewrite immigration laws. \"The president is abdicating his responsibility to faithfully enforce laws that were fully enacted by Congress,\" Abbott said in a statement before announcing the lawsuit at a press conference. Last month, Obama issued an executive action designed to spare from deportation nearly 5 million people living illegally in the United States. Seventeen states signed on to the lawsuit, which marks the 31st time Abbott has sued the federal government since 2009.]", "Date": "20141203", "Author": "[David Saleh Rauf]", "Link": "http://www.chron.com/news/politics/texas/article/Abbott-expected-to-sue-Obama-over-immigration-5932353.php", "Title": "[Abbott sues Obama over immigration action]"}