{"Content": "[ATLANTA (AP)  Donald Trumps bombast continued to roil the Republican presidential race Saturday as several rivals criticized his treatment of a Fox News debate moderator. The organizer of a conservative political convention rescinded the businessmans prime-time speaking slot, angering those eager to hear from the businessman. The real estate mogul and reality television star remained unbowed, refusing to apologize for saying on CNN that Megyn Kelly, who aggressively questioned him during Thursdays GOP primary debate, had \"blood coming out of her eyes, blood coming out of her wherever\" when she asked him about his incendiary comments toward women. At the least, the latest flare-up underscored the potential challenges Trump poses for his rivals as they struggle to react to him without deviating from their own message or alienating the conservatives who are enamored with his insurgent, unconventional bid. Jeb Bush said Trump threatens the GOPs 2016 prospects with female voters, who already favor Democrats in presidential elections. \"Do we want to win? Do we want to insult 53 percent of our voters?\" the former Florida governor told the RedState Gathering in Atlanta, where Trump had been the headliner for an evening reception at the College Football Hall of Fame. The events organizer, radio host Erick Erickson, offered similar sentiments when he booted Trump after his statements on CNN. \"I just dont want someone on stage who gets a hostile question from a lady and his first inclination is to imply it was hormonal,\" Erickson wrote on his website, even as he acknowledged that Trump \"resonates with a lot of people with his bluntness.\", In a statement, Trump maintained that \"only a deviant\" would interpret his comments that way. He called Erickson \"a total loser\" with \"a history of supporting establishment losers in failed campaigns.\", Former tech executive Carly Fiorina, the only woman among the GOP contenders, took to Twitter: \"Mr. Trump. There. Is. No. Excuse.\" She added, \"I stand with @megynkelly.\", Rick Perry, the former Texas governor, said Trumps behavior shows \"a serious lack of character and basic decency\" that should disqualify him from the race. Even before Trumps latest Kelly comments, New Jersey Gov. Chris Christie told CBN News that Trump has \"got a lot of skills, but I just dont think for this.\", Mike Huckabee, who also had a RedState speaking slot, just seemed exasperated by it all, asking reporters for a \"non-Donald Trump question.\" When he got another, the former Arkansas governor quipped: \"Im running for president. Im not running for social media critic of somebody else whos running for president.\", Yet Trump remains a towering presence in the 17-candidate field, and his supporters at the RedState event  along with several other uncommitted attendees  said the latest flap simply reaffirms why his uncompromising approach appeals to voters who are disgusted with conventional politicians, including those in the GOP. \"It sounds like Republicans want to cherry-pick someone as the nominee and they want everyone to fall in line,\" said Jane Sacco of New Port Richey, Florida, saying she was angry at Ericksons decision. Another Trump fan, Louise Tashjian of Atlanta, added: \"This is about political correctness. We dont like it when Democrats do it.\", Dulcy Forte of Austin, Texas, countered that Trumps bigger sin was his refusal in the debate to pledge support to the eventual GOP nominee if its not him. \"I was always thought Donald Trump was a little crude, but, more importantly, hes not a good Republican,\" Forte said. Still more attendees said they are not necessarily Trump supporters but want other candidates and party leaders to take heed of his rise. Connie Thomas of Atlanta, executive of a health care consultancy, said Trump went \"too far\" in the CNN interview but is serving a \"good purpose\" in the race: \"Hes forcing the rest of this field to speak more forcefully, more clearly against the establishment.\", Jack Staver, a business consultant from Woodstock, Georgia, said Trumps rivals could benefit from emulating his style, even if it gets him into trouble. \"Quit being who everybody wants you to be, and be who you are,\" Staver said. \"I havent seen a lot of that in this campaign.\", Some other candidates have at least tacitly acknowledged the tightrope they must walk with Trumps supporters. Bush was the only one of a half-dozen candidates at the RedState gathering who mentioned Trump during his remarks on the podium. And in recent weeks, Bush has on several occasions differentiated Trump from his backers, whom he calls \"good people.\", Huckabee, even in his frustration Saturday, said Trump has \"tapped into an anger\" among the electorate. \"Im angry, too,\" he said. Meanwhile, the flap has reached into Trumps campaign operation. His campaign announced Saturday afternoon that he had fired one of his top advisers, Roger Stone. However, Stone maintained that he quit Saturday morning after seeing Trumps CNN comments from Friday night. According to an email obtained by the Associated Press, Stone wrote to Trump, \"The current controversies involving personalities and provocative media fights have reached such a high volume that it has distracted attention from your platform and overwhelmed your core message.\", Trumps campaign manager said he never received the email. __, Associated Press writer Jill Colvin in Washington contributed to this report. Follow the reporters on Twitter at https://twitter.com/BillBarrowAP and https://twitter.com/sbustosAP .]", "Date": "20150810", "Author": "[Bill Barrow and Sergio Bustos, Associated Press]", "Link": "http://www.chron.com/news/politics/article/GOP-candidates-ride-debate-momentum-to-RedState-6432481.php", "Title": "[Trump's rivals criticize comment about female moderator]"}