{"Content": "[Sen. Ted Cruz (R-Texas) is framing his presidential campaign as part of a conservative crusade against the \"mushy middle\" of Republican politics. But his more immediate foes are on the right. While former Florida Gov. Jeb Bush (R) has increasingly been dubbed the front-runner in the race, hes not Cruzs main concern in the GOP primary. While Bush and another top GOP contender, New Jersey Gov. Chris Christie, are clearly appealing to relatively moderate Republicans, Cruz is hoping to grab staunchly conservative voters who may be inclined to back a hardline candidate as an alternative. However, Cruz isnt the only top-tier candidate aiming at becoming the Bush alternative to this segment of the electorate in the Republican primary. Another likely hopeful, Florida Sen. Marco Rubio (R), is also moving to run to the right of Bush and New Jersey Gov Chris Christie (R). But Rubios voting record is still to the left of some of the candidates who will really be fighting for the most conservative voters in the primary, including Cruz, Sen. Rand Paul (R-Kentucky), and Wisconsin Gov. Scott Walker (R). With Cruz likely in most direct competition with Paul and Walker, some have interpreted the timing of his presidential campaign announcement as a shot across Pauls bow. The Daily Beast argued that Cruz was trying to upstage Paul, who is expected to launch his bid in April. \"[T]heres a sense of mischievousness to Cruzs timing: Advisers close to Paul leaked a presidential campaign launch date in the first week of April. By announcing Monday, Cruz becomes the first Republican candidate formally running for his partys presidential nominationallowing him a couple weeks of peerless press and fundraising. It is hard to imagine this as an accident,\" The Daily Beasts Tim Mak wrote. The New York Times reported Cruzs announcement was \"particularly\" aimed at taking public attention away from Walker (R), who has surged to become another leading White House contender in recent polling. Walker is popular among Republican activists, partially thanks to his high-profile battles against his states public-sector unions. \"In multiple meetings since January, Mr. Cruzs advisers discussed Mr. Walkers effort to win support from both the center-right and more conservative wings of the party,\" The Times Jonathan Martin and Maggie Haberman wrote. \"Witnessing Mr. Walkers early boomlet, along with some of the Wisconsin governors initial stumbles, prompted Mr. Cruz to announce early, ahead of the other hopefuls in both parties, the Republicans briefed on his strategy said.\", Additionally, the venue of Cruzs announcement is a sign that the senator will be making a serious play for the religious right and socially conservative voters wary of Pauls libertarian positions. Cruz made his candidacy official at Liberty University, which bills itself as \"the largest Christian university in the world\" and was founded by the late evangelical pastor Jerry Fallwell. Evangelical Christian voters have an outsize influence in Iowa and other states that play a crucial early role in the presidential primary race. Cruzs speech at Liberty was heavy on references to religion. He began by detailing his familys history and how his parents did not have a \"personal relationship with Jesus\" and were \"drinking far too much\" and \"living a fast life\" in his early childhood. Cruz said this culminated in his father leaving him and his mother only to return after becoming a Christian. \"There are people who wonder if faith is real,\" he said at one point. \"I can tell you, in my family there is not a second of doubt. Because were it not for the transformative love of Jesus Christ, I would have been  raised by a single mom without my father in the house.\", Cruz went on to say he is focused on helping people experience the \"promise of America.\", \"For so many Americans, the promise of America seems more and more distant,\" Cruz said. \"What is the promise of America? The idea that  the revolutionary idea that this country was founded upon, which is that our rights they dont come from man. They come from god almighty.\", Cruz then detailed a series of policies that he said would help achieve this goal. They were all red meat for the conservative base and religious voters including repealing Obamacare, securing the borders, upholding \"the sacrament of marriage,\" fighting gun control, fighting for \"the sanctity of human life,\" and pushing to make \"school choice the civil rights issue of the next generation.\", He concluded by making it very clear he believes his support will come from staunch conservatives  whom he called \"a grassroots army.\", \"I believe god isnt done with America yet,\" Cruz said, adding, \"I believe in the power of millions of courageous conservatives rising up to reignite the promise of America. And that is why today I am announcing that I am running for president of the United States.\", Join the conversation about this story , NOW WATCH: How To Know If Someone Is Lying To You, See Also:, SEE ALSO:Twitter mocked Ted Cruzs imagine speech with John Lennon jokes]", "Date": "20150323", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/Here-s-whom-Ted-Cruz-is-really-running-against-in-6153485.php", "Title": "[Ted Cruz wants you to think he's extremely conservative]"}