{"Content": "[Caption, Close, , AUSTIN - The shadowy group that says it has been secretly videotaping state lawmakers for months has handed over more than 800 hours of footage to conservative website Breitbart Texas. Brandon Darby, managing director for Breitbart Texas, on Monday confirmed his organization has received a copy of the secret footage. The story was first reported Sunday by the Texas Tribune. The Chronicle last week first broke the news that an organization called the American Phoenix Foundation had amassed hundreds of hours of secret video and audiotape of Texas lawmakers this session to use against them ahead of the next election. Foundation representatives on Monday did not immediately return requests for comment on the release of the videos to Breitbart. The groups members have a history of collaborating with the conservative website and its founder Andrew Breitbart. Adam Sharp, one of American Phoenix Foundations videographers in Texas, has blogged for Breitbart under the name \"Sharp Elbows\" and provided the site videos in the past, such as his confrontation with Don Giljum. An adjunct lecturer of labor studies classes at the University of Missouri - St. Louis, Giljum was let go after Breitbart published heavily edited videos purporting to show the professor advocating for the use or threat of violence during labor-management negotiations. Giljum and university officials said the videos were selectively edited. Breitbart said neither he nor any of his staff edited the videos, but that the videos were posted as a \"highlight video of clips from 31 hours of classroom instruction.\", \"Neither Andrew Breitbart nor anyone employed by Breitbart.com edited the videos,\" the site stated in early 2012. Sharp last blogged for Breitbart in May 2011. He has not returned Chronicle requests for comment in the last week. ]", "Date": "20150511", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Secret-lawmaker-videos-handed-over-to-Breitbart-6255612.php", "Title": "[Secret lawmaker videos handed over to Breitbart Texas]"}