{"Content": "[Caption, Close, An indigenous protester from the highlands stands at a burning roadblock along the Panamerican Highway during a general strike in the Chasqui area of Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. Protesters from the highlands block the Panamerican Highway during a general strike in the Chasqui area of Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. Indigenous walk on the Pan-American Highway, as they make their way to Quito to take part in a national strike protesting the policies of President Rafael Correa, outside of Quito, Ecuador, Thursday, Aug. 13, 2015. Indigenous groups have joined the trade unions and other social groups for the nationwide strike demanding Correa rethink some of his policy proposals including the taxes on inheritance and capital gains, new labor regulations, and an amendment that would allow Correa to seek reelection. Security forces stand behind a burning road block set up by indigenous protesters from the highlands along the Panamerican Highway during a general strike in the Chasqui area of Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. An indigenous woman walks on the Pan-American Highway, on her way to Quito to take part in a national strike protesting the policies of President Rafael Correa, outside of Quito, Ecuador, Thursday, Aug. 13, 2015. Indigenous groups have joined the trade unions and other social groups for the nationwide strike demanding Correa rethink some of his policy proposals including the taxes on inheritance and capital gains, new labor regulations, and an amendment that would allow Correa to seek reelection. An indigenous protester from the highlands walks by a burning roadblock along the Panamerican Highway during a general strike in the Chasqui area of Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. Indigenous walk on the Pan-American Highway on their way to Quito to take part in a national strike protesting the policies of President Rafael Correa, outside of Quito, Ecuador, Thursday, Aug. 13, 2015.  Indigenous groups have joined the trade unions and other social groups for the nationwide strike demanding Correa rethink some of his policy proposals including the inheritance and capital gains taxes, new labor regulations, and an amendment that would allow Correa to seek reelection. A masked indigenous protester stands by burning tires and trees blocking the Panamericana Highway during a general strike in El Chasqui, Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. Behind is the Cotopaxi volcano. Indigenous protesters run from teargas fired by security forces during a general strike in El Chasqui, Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. Indigenous protesters confront security forces during a general strike in El Chasqui, Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. Security forces stand behind a burning road block set up by indigenous protesters from the highlands along the Panamerican Highway during a general strike in El Chasqui, Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. Police fire teargas at indigenous protesters during a general strike in El Chasqui, Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. Indigenous protesters clash with security forces on the Panamerican highway during a general strike in El Chasqui, Ecuador, Thursday, Aug. 13, 2015. A strike by a broad coalition upset with President Rafael Correa virtually paralyzed the capital, provincial cities and stretches of the Panamerican highway. The protesters are indigenous activists, unionists, environmentalists and members of the traditional political opposition. QUITO, Ecuador (AP)  A general strike against President Rafael Correa virtually paralyzed Ecuadors capital, provincial cities and major highways Thursday and violent clashes broke out between protesters and police in several cities. A diverse coalition mobilized thousands of indigenous activists, unionists and environmentalists who blocked roads with tree trunks, rocks and burning tires, and public transport was scarce in Quito, the capital. At midday, police fired tear gas at one point in a vain attempt to dislodge indigenous protesters on the Pan-American near the Cotopaxi volcano. Later, riot police turned back some 10,000 protesters who tried to reach Quitos central San Francisco Plaza. Some protesters hurled sticks and rocks at police. At least a dozen officers and a similar number of protesters were injured. Indigenous leaders reported several arrests. The government did not release figures on arrests or injuries. Facing the first national strike against him in eight years in office, Correa blamed the far right, his usual nemesis. In remarks to a youth group, the leftist economist called on supporters to clear the streets. \"These things must be rejected, not by the security forces but by the citizenry,\" he said of the barricades. \"A small group is trying to impose its policies on us.\", Ecuadors growing anti-Correa movement has become more diverse, however. It is united chiefly by a rejection of pending legislation that would permit Correas indefinite re-election when his third term ends in 2017. The presidents popularity owes to generous government spending on social welfare and infrastructure including highways, but his support level in opinion polls is now at its lowest ever  45 percent. Indigenous groups are upset by Correas refusal to consult them on mining and oil exploration on traditional lands. Union activists are angry at a new labor code that they see as stripping them of freedom of association and protest. Business people are upset by new taxes, including import tariffs and a 75 percent tax on real estate sales and inheritances that Correa announced but then suspended after a public outcry. Ecuador is heavily dependent on oil revenues and Correa has faced mounting protests since this years plunge in crude prices forced him to impose cost-cutting measures. Correas abrasive, sometimes impetuous style and scant tolerance for dissent have drawn steady complaints from international human rights groups, who accuse him of stifling of free speech and an independent judiciary. Indigenous protest leader Carlos Perez said the strike would not end until Correa takes heed to citizens complaints. \"If we dont get answers were prepared to continue the protest for two days, or 15 days  whatever it takes to open the deaf ears of President Correa.\", ", "Date": "20150813", "Author": "[Gonzalo Solano, Associated Press]", "Link": "http://www.chron.com/business/energy/article/General-strike-nearly-paralyzes-Ecuador-s-capital-6442586.php", "Title": "[General strike nearly paralyzes much of Ecuador]"}