{"Content": "[Caption, Close, People who are in jail simply because they cant afford a bond become commodities for these prisons, which lobby long and hard to make sure that their beds are filled with publicly-funded bodies. Meanwhile, people waiting for trial lose their jobs, government budgets swell and society suffers. ( Johnny Hanson / Houston Chronicle ), Want to know the best way to stay out of Harris County Jail? Dont be poor. Our criminal justice system is supposed to presume that people are innocent until proven guilty, yet being free of a criminal conviction wont keep you out of Harris County Jail. About 6,600 people, or 75 percent of inmates, in that fetid tower of cold concrete are merely biding time before trial. The problem isnt that theyre criminals, the problem is that cant afford a bail bond. So rather than going home to their families and jobs, folks accused of crimes have to sit behind bars until their day in court. This system doesnt make anyone safer, but it does cost a pretty penny. As Chronicle reporter Brian Rogers wrote last week, each one of those inmates costs taxpayers about $45 a day. It is a problem practically unique to Harris County. Courthouses throughout Texas and across the nation routinely grant personal recognizance bonds for folks accused of nonviolent crimes. These so-called signature bonds allow people to go about their normal lives while they wait for their trial date. The courthouses Pretrial Services already has the ability to determine which people wont be flight risks - folks with regular employment or community ties, for example. In fact, according to University of Houston law professor Sandra Guerra Thompson, we could reduce the jail population by 67 percent overnight simply by implementing this well-tested personal recognizance policy. Criminal court judges have the ability to implement this change today, but they likely wont. Why?, \"I can only assume they are receiving pressure from bond companies,\" state Sen. John Whitmire, chair of the Senate Criminal Justice Committee, told the Chronicle editorial board. Bail bondsmen are some of the few interested parties who have a direct stake in judicial elections, and the notoriously low turnout for those bottom of the ballot races makes them easy to influence. More bail bonds means more business for these criminal justice profiteers, and elections provide plenty of opportunities to reward friendly judges. So while they rake it in, taxpayers get the bill. Now, due to jail overcrowding, taxpayers also have to fund profiteers of another kind - a private jail in Beaumont (\"Sheriff shipping inmates from jail,\" Page A1, Wednesday). It is a mystery why recently appointed Sheriff Ron Hickman chose to put inmates on a bus heading east instead of working with the Harris County Criminal Justice Coordinating Committee to find available beds in the public system. Hickman blamed the lack of space on recent floods, but it looks to us more like a management problem. Rather than focusing on the underlying problems that cause jail overcrowding, our new sheriff seems content going back to the bad, old days, when we routinely sent inmates and money into the private prison industry. People who are in jail simply because they cant afford a bond become commodities for these prisons, which lobby long and hard to make sure that their beds are filled with publicly-funded bodies. Meanwhile, people waiting for trial lose their jobs, government budgets swell and society suffers. It is the job of our courts to distinguish the guilty from the innocent, but right now were doing a better job of separating the wealthy from the poor.]", "Date": "20150703", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Jailing-the-poor-6364295.php", "Title": "[Editorial: Jailing the poor]"}