{"Content": "[Hillary Clinton seems to have a very clear path to the White House in 2016. A slew of polls have shown her leading all her likely Democratic primary rivals. While that kind of prime positioning obviously has its advantages, being the front-runner hasnt worked for four Democrats in recent races  including Clinton in 2008. In a recent piece, the New Yorkers Ryan Lizza spoke to experts who warned Clinton could fall into this \"inevitability trap\" once again in the next election. On Friday, top Clinton supporters gathered in New York City for a meeting of the finance council of \"Ready For Hillary,\" a super PAC dedicated to backing her potential candidacy. Many of them shot down the notion Clinton has the White House locked up. Ready For Hillary Executive Director Adam Parkhomenko devoted much of his sitdown with reporters at the event to batting down the idea Clinton is inevitable. \"In terms of inevitability, I wouldnt have been doing this since Jan. 2013 if I thought she was inevitable,\"Parkhomenko said at the event, which was held at the Sheraton Times Square hotel. Political consultant James Carville, a veteran Clinton ally, put things in even more blunt terms. \"Its stupid. Its a stupid perception. Theres no such thing as inevitability in politics,\" Carville told Business Insider. \"I just think its coming from inexperienced people that dont know what theyre talking about.\", Lanny Davis, another longtime Clinton loyalist, concurred with Carville and blamed the media for creating a false sense of Clintons inevitability. \"This is only a problem when the press is interviewing the press. Its a media non-story that the media creates into a story,\" Davis told Business Insider. \"I think she has to work hard and earn the nomination. This is a media invention when they have nothing to write about. Blaming a candidate for being inevitable is like blaming the sun for rising in the east.\", Stephanie Schriock, the president of EMILYs List, a group dedicated to supporting pro-choice Democratic women, argued those who see Clinton as inevitable are ignoring the fact voters have desire for change after eight years of President Barack Obama. \"I think the biggest challenge we have is that history says that Americans dont really like to go with the same party for three terms. So weve got our work cut out for us under the best of circumstances,\"Schriock said at a briefing with reporters. \"This is not going to be an easy election. ... Shes going to have to make the case if she decides to run.\", Schriock is rumored to be one of the leading candidates to manage Clintons White House bid. However, she declined to discuss whether she could play a role on Clintons campaign. \"Im not going to talk about any conversations I may or may not be having with any candidate who may or may not be running,\" she said. For his part, Parkhomenko pointed to the fact history making nature of a potential Clinton candidacy as evidence she should not be seen as a lock. \"Shes not inevitable,\" he repeated. \"Its not going to be easy. A womans never won the Iowa caucuses. A womans never won a major party nomination. A woman has never become president.\", Parkhomenko also pointed out she hasnt officially entered the race. \"Hillary Clinton hasnt made up her mind,\" he said. Parkhomenko also reminded reporters at the event of Clintons loss in 2008, when she was widely seen as inevitable before being upset by Obama. \"Its important to note that, if you go back and you look at a lot of the stories that some of the folks in this room wrote at this time in the 2008 cycle,it was Hillary Clinton vs. Rudolph Giuliani  and we know how that turned out,\" he said. Join the conversation about this story , See Also:]", "Date": "20141121", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/Hillary-Clinton-s-Top-Supporters-Insist-She-Could-5910157.php", "Title": "[Hillary Clinton's Top Supporters Insist She Could Lose In 2016]"}