{"Content": "[Caption, Close, , Bastrop, 30 miles east of Austin, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Big Spring, 40 miles northeast of Midland, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Caddo Lake, 166 miles east of Dallas, is among more than a dozen Texas locations scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Caldwell, 74 miles east of Austin, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Christoval, 20 miles south of San Angelo, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. College Station is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Dell City, 86 miles east of El Paso, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Eldorado, 44 miles south of San Angelo, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Goliad, 91 miles southeast of San Antonio, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Junction, 120 miles northwest of San Antonio, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Leakey, 100 miles west of San Antonio, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Menard, 66 miles southeast of San Angelo, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Mountain Home, 95 miles northwest of San Antonio, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. San Angelo is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. San Antonio is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Smithville, 42 miles, east of Austin,  is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Victoria, 120 miles southwest of Houston, is among more than a dozen Texas cities scheduled to take part in Operation Jade Helm, a covert military exercise intended, in part, to test citizens ability to spot suspicious activity in their town. Sinister plots and secretive actions arent just reserved f governments (sort of). Here are 23 of the quirkiest and most prevalent. PlutoThere are a number of conspiracy theori surrounding the July 2015 flyover of Planet, but the most startling o has its roots from much earlier. According to some people, Pluto simp does not exist. Their reasoning is that if you cannot see it from  Earth-based observatory, it does not exist. , , Vaccines and autism, , 9/11 Truthers, Clinton assassinations      Plans for a 17-city Army Special Operations exercise in Texas stirred some ultra-right-wing fears of a government takeover in the Lone Star State, but local law enforcement say theyve long been aware of the drill. Operation Jade Helm will bring a coalition of forces, including the Green Berets, SEALS, and special operations commands from the Air Force and Marines to Texas for two months of \"realistic military training\" in a simulated \"hostile\" territory between July and September this summer. Army Special Operation Command spokesman Mark Lastoria said soldiers would practice \"emerging concepts in special operations warfare\" in Texas. \"Training exercise Jade Helm is going to assist our Special Operations Soldiers in refining the skills needed against an ever changing foreign threat,\" he said. Among the planned exercises, soldiers will try to operate undetected amongst civilian populations in some towns and cities where residents will be advised to report any suspicious activity they notice as a means of testing the militarys effectiveness, said county law enforcement officials who had been briefed by the Army. \"Theyre going to set up cells of people and test how well theyre able to move around without getting too noticed in the community,\" said Roy Boyd, chief deputy with the Victoria County Sheriffs Office. \"Theyre testing their abilities to basically blend in with the local environment and not stand out and blow their cover.\", But the plans caused a ruckus amongst a far-right fringe movement, characteristically distrustful of the government, who dubbed the exercise a rehearsal for military rule in Texas. Austin-based TV and radio commentator Alex Jones, who has been warning of a government takeover for decades, reported the operation under the headline \"feds preparing to invade Texas\" after obtaining an unclassified Army document describing Jade Helm. \"Weve got huge news ladies and gentlemen,\" said Jones on his Sunday TV show. \"Theyre having Delta Force, Navy SEALS with the Army trained to basically take over.\", His biggest concern was Texas designation as a \"hostile\" territory on a map included in the Army document. \"Texas is listed as a hostile sector, and of course, we are,\" he said. \"Were here defending the republic.\", A swarm of followers picked up Jones reports of the impending invasion, but the exercise had actually been reported months before by local newspapers in Victoria and Goliad.  News of the drills first broke when Army representatives met with government and law enforcement officials across the state to explain planned exercises and solicit permission for use of public and private lands. Jim Stewart, chief deputy with the Brazos County Sheriffs Office, said its not the first time the Army has conducted special operations training off-base in Texas. He met Army officials for a February briefing on the exercises. \"Special ops for years have trained off-post for years, where they go out and have folks that are role players out on the economy,\" said Stewart, who worked 31 years in Army intelligence. \"Theyll have a scenario theyll be following and theyll interact with these roll players as if theyre in another country.\", He said the designation of Texas as a hostile territory was probably a role-playing exercise, where soldiers act as if behind enemy lines. Lastoria called the designation \"a misinterpretation of the exercise design.\", Regardless, a large handful of niche news websites raised alarm following Jones report of the impending takeover. Ultra-libertarian website Freedom Outpost wrote \"Operation Jade Helmmilitary trains for martial law in American South-west.\", Sleuth Journal, a news website along a similar vein, wrote \"this drill is about the brutal martial subjugation of the people of Texas, Utah and Southern California who have risen up against unspecified tyranny.\", Lastoria said the Army has been receiving phone calls about the planned exercise \"from concerned citizens who were provided information taken out of context.\", \"The concerns expressed center around misinterpretations,\" he said. \"Unofficial sources providing inaccurate information on Jade Helm want people to believe that its it something other than a training exercise.\", Sheriffs deputies said they would make sure local populations are aware of planned exercises, which will involve participants in civilian dress and civilian vehicles, military aircraft, low-altitude airdrops of personnel and weapons with blank rounds, to avert fearful reactions. A 2013 urban warfare exercise terrified South Houston residents as helicopters and camouflaged men with assault rifles took over Carnegie Vanguard School. Locals said they had not been warned of a scheduled drill, so they ran for shelter, assuming the worst. RELATED: U.S. Army drills in Texas City, La Marque, Texas cities scheduled to host military exercises this summer are:  Bastrop/Smithville, Big Spring, Caddo Lake, Caldwell, Christoval, College Station, Dell City, Eldorado, Goliad, Junction, Leakey, Menard, Mountain Home, San Angelo, San Antonio and Victoria. Citizens can inquire with sheriffs departments for specific plans. An Army document explaining the exercise said Texas was selected \"because Texans are historically supportive of efforts to prepare our soldiers, airmen, marines and sailors to fight enemis of the United States.\", It also said the Army plans \"to work with civilians to gain their trust and an unerstanding of the issues.\", Jade Helm will also be conducted simoltaneously across five other southwestern states.]", "Date": "20150325", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/article/Covert-warfare-comming-to-Texas-6157685.php", "Title": "[Covert warfare coming to Texas sparks some fears of federal takeover]"}