{"Content": "[Then what?, Regarding \"Sue the president? Try winning an election first\" (Page B16, Sunday), Bill King makes what is arguably perhaps, a compelling case that House Speaker John Boehners suit against President Obama is likely to fail. Such an outcome, if it happens, raises the question: \"Then what?\", The most virulent of Obama-haters among grass-roots conservatives are not going to be satisfied with anything less than impeachment proceedings. Indeed, some of their most visible members like Sarah Palin, have already called the Speaker out for failing to take that extraordinary step now. But what would be the basis for seeking that most extreme of remedies?, Unlike Presidents Reagan (Grenada) and G.W. Bush (Iraq), Obama has not started any wars without a formal declaration of same from Congress. The number of executive orders that Obama has issued falls well below that of each of his aforementioned predecessors. What is more, the current presidents unilateral decision to delay for a year the implementation of the employer mandate within Obamacare is not fundamentally different from G.W. Bushs side-stepping Congress to modify the timetable for seniors enrollment in Medicare Part-D. Simply put, there is nothing in the Obama record that hasnt already been matched and even exceeded by previous presidents. Marty Adams, Houston, , U.S. Constitution, Bill King seems considerably weaker than House Speaker John Boehner on U.S. Constitutional law. Boehner stated on June 25: \" the Constitution makes it clear a presidents job is to faithfully execute the laws. In my view, the president has not faithfully executed the laws. We have a system of government outlined in our Constitution with the Executive Branch, Legislative Branch and the Judicial Branch.\", The presidential oath Obama has now taken twice isnt only about faithfully executing laws.  Obama has disregarded the underlined portion of his oath: \"I do solemnly swear (or affirm) that I will faithfully execute the office of President of the United States, and will to the best of my ability, preserve, protect and defend the Constitution of the United States.\", Obama violated his oath during his first term when he usurped the power of Congress to enact legislation by issuing an executive order instituting the Dream Act  after Congress specifically declined to enact it. Now, Obama seeks to expand his imperial presidency with executive orders as a mandate of his re-election. Sorry, but winning two presidential elections doesnt allow a president to ignore the Constitution. As for Kings cavalier attitude toward the Supreme Court enforcing a ruling that the president usurped the Legislative Branch, its instructive to consult Article I, Section 8 of the Constitution: \"The Congress shall have Power To lay and collect Taxes, Duties, Imposts and Excises, to pay the Debts and provide for the common Defence and general Welfare of the United States.\", Neil Stovall, Houston]", "Date": "20140715", "Author": "[Copyright 2014: Houston Chronicle]", "Link": "http://www.chron.com/opinion/article/Wednesday-letters-Suing-the-president-5623947.php", "Title": "[Wednesday letters: Suing the president]"}