{"Content": "[Rep. Jerry Nadler (D-New York) issued a statement on Friday expressing his fear President Barack Obama will \"violate the Constitution\" by expanding military operations against the jihadist group Islamic State (also known as ISIS or ISIL) in Syria and Iraq without asking Congress for authorization. In an interview with Business Insider, Nadler said he understood the need to take on ISIS, but does not believe the group is poses enough of an \"imminent threat\" on American soil that there is no time for the president to seek congressional authorization for the use of military force. \"Theres nothing so urgent that Congress cant take a day, or two, or three to debate it. ... Its not an obvious, imminent threat,\" Nadler said. \"The degree or how much of a threat it is and how immediate a threat it is, thats for Congress to debate, decide what to do about it.\", Nadler stressed he is not dismissing ISIS as a \"real threat\" and does not necessarily oppose the plan Obama laid out to fight the group last week. However, Nadler thinks the Constitution requires the president to seek authorization for military force or to ask Congress to declare war. \"I dont have any great objection to what the president is proposing to do,\" said Nadler. \"In fact, I think hes right, but Congress has to authorize it. Thats my concern.\", Nadler had similar concerns about U.S. military operations in Libya in 2011, which were conducted with congressional authorization. He said he doesnt know what the Obama administration plans to do this time, but wanted to raise the issue to generate discussion among his fellow members of Congress. \"Theres a lot of discussion about our voting on something next week, I dont know what thats going to be or if its going to be. I dont know,\" said Nadler. Obama has suggested he could have the authority to mount a war with ISIS without congressional authorization, but the legality of that strategy has been called into question. The president also has indicated he might ask Congress for funding for some aspects of his strategy against ISIS. Nadler said requesting funding from Congress does not replace getting authorization. \"We may be asked to fund, but that is not the same thing. ... It may have a similar practical thing, but thats not what we should do,\" Nadler explained. \"We should do what were supposed to do, which is vote for a declaration of war or authorize use of military force, which is the functional equivalent. Why not?\", Reportedly, some members of Congress are reluctant to vote for military operations against ISIS as it could become politically controversial or a liability, particularly in an election year. Nadler said he understands and even shares that concern, but does not think what he described as the \"political thing\" overrides the importance of having potential military operations approved through the proper congressional channels. \"There clearly are a number of members who dont want to vote and I understand the politics. Im not sure I want to vote for my political thing, but I dont think we can deal with it like that,\" said Nadler. \"Its a matter of protecting the interests of the country. We have to vote.\", Join the conversation about this story , See Also:]", "Date": "20140914", "Author": "[Hunter Walker, provided by]", "Link": "http://www.chron.com/default/article/WE-HAVE-TO-VOTE-Dem-Congressman-Worried-5755110.php", "Title": "['WE HAVE TO VOTE' -- Dem Congressman Worried Obama Will 'Violate The Constitution' To Fight ISIS]"}