{"Content": "[Caption, Close, Ted Cruz campaign website is pictured. Ted Cruz campaign logo is pictured. Sen. Ted Cruz, R-Texas, has announced his run for the White House, but how well do you really know this naturalized Houstonian? Click through to learn some well-known to not-well-known facts about our possible future president. 1. Hates avocadosCruz cant stand this native Mexican fruit, and went on record with his displeasure of the alligator pear. \"I despise avocado. Its the only food I dislike, and I dislike  passionately. Which is ironic, because Im Cuban, and  dad grew up with avocado trees in his backyard. My whole family ea avocados like crazy, but I cant stand them.Source: Houston Chronicle, 2. Made filibuster history, 3. Loves the Princess Bride? Inconceivable!Cruz, a self-described \"movie buff,\" says this movie is his favorite. When he confirmed it during an interview, it spawned a flood of jokes on social media.Source: Houston Chronicle, 4. The man behind the government shutdownSome held Cruz, in part, responsible for the 2013 federal government shutdown that lasted 16 days, the third-longest of its kind. His earlier filibuster and later refusal to approve the Appropriations Continuing Resolution were seen as key moments leading to the event. 5. One thing he has in common with Obama: Loves basketballIn a parallel universe where Cruz was not a junior senator from Texas, he said he would love to be a starting point guard for the Houston Rockets. \"Im confident that there is no universe in which that will ever come to pass,\" he said.Source: Houston Chronicle, 6. Smoked pot as a teen and once received an alcohol possession charg  1987, Texas authorities ticketed a then-younger Cruz for an alcoh possession charge. Apparently, he was driving with an unopened case  beer in his vehicle. \"Teenagers often make foolish mistakes, and th certainly applied to me as well,\" Cruz said in a statement provided  BuzzFeed News.Source: Houston Chronicle, 7. He gave up his Canadian citizenshipIn 1970, Cruz was born in Calgary, Alberta, Canada. Four years later, his parents moved to Houston. Legal experts say his Canadian birthplace doesnt bar him from a presidential run. Nevertheless, Cruz renounced his Canadian citizenship last summer.Source: Houston Chronicle, 8. Il ne parle pas franais (He doesnt speak French).In an interview with the Dallas Morning News, Cruz revealed French was his nemesis during his teen years.Source: Dallas Morning News, 9. Doesnt care much for Vladimir PutinCruz hasnt taken a liking to the sitting Russian president, even calling him a \"KGB thug.\" During the Ukraine civil war, Cruz called for oil and gas exports to the embattled country while also bolstering the missile defense system in the Czech Republic and Poland.Source: Houston Chronicle, 10. Disagrees with climate change scienceCruz has been fairly consistent in his opposition of anthropogenic global warming, even warning NASA to shift its focus from earth sciences to space-related ones.Source: Houston Chronicle, 11. Loves cheese, 12. Has made several Republican enemies, 13. His his own coloring bookFollowing Cruzs infamous filibuster in 2014, a St. Louis-based publisher came out with this little activity book for children. It sold quite a few copies, according to Breitbart, and spawned some hilarious reviews on Amazon, including this gem:  Apart from the fact that it only provided me with a white crayon, I didnt get to finish it, because as soon as I started to work, the Republicans came in and filibustered me before I could finish. Now my book is shut down, and theyre blaming me for political maneuvers.Source: Breitbart, 14. Not a fan of CubaCruzs father once supported Fidel Castros revolution against then-dictator Fulgencio Batista, but later fled the country when Castro began enacting harsh communist policies in the country. Following President Barack Obamas announcement he would reopen talks between the two nations, Cruz said it would be a \"tragic mistake.\"Source: National Review, 15. Wears a good luck charmIn an interview with the Dallas Morning News, Cruz said during his time as solicitor general, he would wear the same pair of black ostrich boots during oral arguments. The logo Sen. Ted Cruz (R-Texas) selected for his 2016 presidential campaign has left some graphic designers baffled. Cruz unveiled the symbol on Monday when he announced his White House bid and immediately social media lit up with posts comparing the image to either a tear or an upside down burning flag. Others pointed out the similarity of Cruzs logo to the symbols for the Al Jazeera news service, the satiric Onion newspaper, and the flame representing the Tinder dating app. Artist Milton Glaser, the celebrated designer behind the \"I  NY\" logo, expressed confusion at Cruzs messaging. \"This looks like another example of flag burning to me. Is Mr. Cruz certain that is what he wants to say?\" Glaser told Business Insider. Ted Cruzs campaign logo looks so familiar. pic.twitter.com/XsWYau105R, Debbie Millman, chair of theMasters in Branding program at the School of Visual Arts in New York,agreed that the optics were puzzling. \"SO MUCH needs to be said about this,\" she told Business Insider about the Cruz logo. \"I think the logo is terrible, for two reasons. First: Really? Hes running for President and this is the absolute best he can come up with? Its so ho-hum, it is so predictable and boring, that the immediate impression it projects is YAWN. Second: So the flame includes a burning flag? Isnt that illegal?\", But not all the feedback was negative. Scott Stowell, the founder of the New York design studio Open, gave Cruz points for trying to use a \"refreshing\" symbol. He credited the Texas Senator for taking inspiration from the iconic \"O\" employed by President Barack Obama in his 2008 campaign. \"Since Ted Cruz is another first-time Presidential candidate running with only two years of Senate experience, its interesting (if coincidental) to note the similarities between his logo and President Obamas.Both use old symbols in new shapes to express their messages. Sol Senders logo for then-Senator Obama connected a rising sun to the idea of hope; Cruzs logo uses a flame to talk about \"reigniting\" something,\" Stowell told Business Insider. \"I dont support Cruzs politics and I dont love this identity. But its still refreshing to see a campaign using nice typography and meaningful images. I guess thats one more change we can thank Barack Obama for,\" he added. Cruzs team didnt respond to a request for comment about the logo. Join the conversation about this story , NOW WATCH: This 40-year-old Indonesian is Obamas doppelgnger, See Also:]", "Date": "20150324", "Author": "[Leslie Larson, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/Graphic-designers-say-Ted-Cruz-s-logo-looks-like-6156493.php", "Title": "[Graphic designers say Ted Cruz's logo looks like a burning flag]"}