{"Content": "[COLUMBIA, S.C. (AP)  Opponents of raising the states gas tax to fund roadwork are stepping up their efforts while the Legislatures not in session in an attempt to shift the debate from funding to reform. Debate on the issue lawmakers called their top priority for 2015  fixing South Carolinas deteriorating roads  will resume in January. A bill providing roughly $800 million additional yearly to the Department of Transportation through taxes and fees has special debate status in the Senate when legislators return. Anti-tax activists are working the phones to secure GOP senators opposition in 2016, when every legislator is up for re-election. \"Before we talk about dollars, weve got to reform the system,\" said Dave Schwartz, state director of Americans for Prosperity. Its joined with the Coastal Conservation League, the South Carolina Policy Council and the Campaign for Liberty in pushing the reform-first mantra. The groups applaud Sen. Tom Davis, R-Beaufort, who filibustered to prevent a vote this year. Davis said his mission over the next five months is to educate voters on his arguments. He believes no tax hike is needed. \"Yeah, weve got a horrible road and bridge problem, but it wont be solved by putting more money in a system thats broken,\" he said. But other legislators and business leaders say thats just political spin that wont fix the problem. They contend more money will be needed regardless of any reforms. \"Any state agency could always use reform. We support reform, but trying to say we cant talk about funding at the same time, we think, is a mistake,\" said Ted Pitts, president of the state Chamber of Commerce and a former House member. \"Its really just a delay game.\", The arguments are a repeat of 2007, he said. That was the last time the Legislature passed a law reforming the Department of Transportation. It put the agency in the governors Cabinet and required the DOT to fund road projects based on need. \"When you dont want to fix something, you say, Well reform it. We reformed it in 2007 but never funded it,\" said Sen. Ray Cleary, R-Murrells Inlet, who led Senate Finances road-funding panel. The DOT has said it needs an additional $1.5 billion annually over the next 25 years to bring all state-maintained roadways to good condition. The states highway system consists of 41,400 miles of roads, making it the nations fourth-largest. Its funded largely by the nations third-lowest gas tax and the federal matches that 16.75 cents per gallon brings. The reform-first groups say DOTs revenue needs cant be discerned until reforms are enacted. They argue those reforms must include abolishing both the legislatively appointed DOT commission and the State Infrastructure Bank, noting two legislative leaders appoint most of its board. The bank, which loans money for large road projects, is exempt from the 2007 laws priority-funding requirements. Policy Council President Ashley Landess says money diverted to the bank subtracts from DOTs maintenance of existing miles. According to the DOT, it will transfer about $110 million to the bank this year. That includes $27 million through its 1-cent-per-gallon share of the gas tax, $31 million for debt payments, and $50 million as required by a 2013 law that sends half of vehicle sales taxes to the bank. Rep. Chip Limehouse, who sponsored the bill creating the bank in 1997, said it works exactly as designed. \"Wed be 20 years backward if the SIB hadnt come along,\" said Limehouse, R-Mount Pleasant, a board member. Its \"designed to get large projects up and moving to areas with growth and business development. Thats all a red herring to divert the debate from the core issue that the DOT is severely underfunded.\"]", "Date": "20150808", "Author": "[Seanna Adcox, Associated Press]", "Link": "http://www.chron.com/business/energy/article/SC-anti-tax-groups-step-up-opposition-to-6432632.php", "Title": "[SC anti-tax groups step up opposition to road-funding bill]"}