{"Content": "[Caption, Close, , A popular graffiti mural is seen Sunday, Aug. 9, 2015, in Houston. The mural read \"Be Someone,\" until someone vandalized it earlier this week. It has since been restored. A popular graffiti mural is seen Sunday, Aug. 9, 2015, in Houston.... A popular graffiti mural is seen Sunday, Aug. 9, 2015, in Houston. The mural read \"Be Someone,\" until someone vandalized it earlier this week. It has since been restored. A popular graffiti mural over I-45 near downtown that previously read \"BE SOMEONE\" is seen Friday, Aug. 7, 2015, in Houston. The mural was defaced and now reads, \"BE ONE.\", A popular graffiti mural over I-45 near downtown that previously read \"BE SOMEONE\" is seen Friday, Aug. 7, 2015, in Houston. The mural was defaced and now reads, \"BE ONE.\", A popular graffiti mural over I-45 near downtown that previously read \"BE SOMEONE\" is seen Friday, Aug. 7, 2015, in Houston. The mural was defaced and now reads, \"BE ONE.\", , Be Someone grafitti, Houston, TX, Grace Rodriguez / Flickr-CC, Be Someone grafitti, Houston, TX, Grace Rodriguez / Flickr-CC, , Five gorilla-inspired murals are going up. Heres an artists digital rendering of what one might look like, just for scale. Check out the next slide for places and times where you can find each painter at work. The mural \"The Rebirth of Our Nationality\" along Canal Street spans the length of the old Continental Can Company warehouse. The mural will be restored as part of a county project later this year. The now-chipped painting by famed muralist Leo Tanguma depicts the Chicano Movement and has been an icon in the East End since its completion in 1973. \"Preservons la Creation\" at 2800 San Jacinto, Altharetta Yeargin Art Museum, Numbers Nightclub, \"Navigation\"at 3130 Navigation Blvd. University of Houston, The Bahai Center, The Bahai Center, 1621 Milam.  The office building was built in 1927 as a car dealership.Suzanne E. Sellers painted on theside and back windows it was missing.Clever trompe loeil. 2420 Washington Ave. \"Sam Houston did not come to Houston to rent!\" declares this wall. Texas Land and Real Estate commissioned the Museum of Cultural Arts, Houston to render the stylized Sam and cityscape. Lawndale Art and Performance Center, 4912 MainLocal artist Michael C. Rodriguez puts the finishing touches on his mural entitled \"This Afternoons Malady\" outside the Lawndale Art Center on Thursday, Aug. 23, 201 The side of the building currently hosts a zippy high-low collaboration: Aaron Parazette, a fine-art painter known for crisp abstraction, painted a precise, geometric explosion. Anguilus vining, glowing forms seem to have grown on top of it. Lawndale Art Center, Lawndale Art Center, Lawndale Art Center, 3710 Travis. This building, which once served as Houstons Barack Obama election headquarters, has hosted a series of striking Obama murals. Vandals keep defacing them. Artist Reginald Adams keeps replacing them. 3710 TravisGregory Garner walks past a mural painted in honor of President Barack Obama after it was vandalized Monday, Jan. 28, 2013, in Houston. \"I just dont know what to say when people do that,\" said Garner. \"Its just terrible.\", Another vandalized mural at 3710 Travis. Here is the latest mural at 3710 Travis. The Mullet, 10902 Kingspoint. The complex hosts the single largest collection of murals in Houston. Its a frequent backdrop for rap videos and attracts top painters, both from Houston and out of town. Kingspoint Mullet, Kingspoint Mullet, Kingspoint Mullet, MLK BoulevardLocal artist Acie Washington talks to friends during unveiling ceremony for a new mural he helped make featuring Dr. Martin Luther King and the Obama family, Saturday, Jan. 19, 2013, at the Belfort and Martin Luther King Boulevard intersection in Houston. The mural, commissioned by Darrel and Rena Menard, was done by Reginald Adams John Foreman and Acie Washington. Washington says the concept of the tree and the tunnel is to show people there is opportunity at the end of the tunnel. Rena Menard says it was a chance to participate in the clean up of the area by community  groups. Treebeards, 315 Travis. On behalf of the Greater Houston Convention and Visitors Bureau, Gonzo247 proclaims our citys virtues in electric colors and swirling psychedelia. Treebeards, 315 Travis, Crawford and ElginDaniel Anguilu, a graffiti muralist, walks past a new painting at the corner of Crawford and Elgin streets, Sunday, Jan. 5, 2014, in Houston. Crawford and El The top art is the work of Daniel Anguilu, a graffiti muralist, on a building with other graffiti artists at the corner of Crawford and Elgin streets. Crawford and ElginAngel Quesada touches up his artwork painted on a building at the corner of Crawford and Elgin streets. Holman StreetElly Waty walks with her son Joshua Waty in front of a mural along Holman Street, Thursday, Jan. 9, in Houston. Dodson Elementary, 1808 Sampson. How big are the little kids at play in Anat Ronens realistic mural? So big that its easy to spot them from Interstate 45. Houston Club Building, corner Milam and Capitol. The tall, skinny mural by Suzanne E. Sellers depicts buildings from Houstons history. Days after one of the citys most beloved pieces of vandalism was vandalized  itself, Interstate 45s \"Be Someone\" sign is back. The sign first appeared overnight on a train bridge near downtown in 2012. Then overnight earlier this week, the sign was defaced, with the \"SOME\" in \"SOMEONE\" being painted over in red to make the sign now read \"BE ONE.\", The alteration caused a mix of disappointed, anger and \"dont care\" from the thousands of downtown commuters who see the sign each day. On Sunday, however, the \"BE SOMEONE\" sign had been restored to its former self.]", "Date": "20150809", "Author": "[John Boyd]", "Link": "http://www.chron.com/news/houston-texas/article/Be-Someone-mural-is-back-6433687.php", "Title": "['Be Someone' mural is back]"}