{"Content": "[Caption, Close, Members of the Black Womens Rountable hold a forum on the power of African American women at the polls at the Congressional Black Caucus Foundations Annual Legislative Conference on Wednesday, Sept. 16, 2015 in Washington. The Black Lives Matter network will not make a presidential endorsement but will keep up its political activism by confronting candidates about the treatment of African-Americans in the United States. Renda Writer, a white muralist from Miami is expressing his support for the \"Black Lives Matter\" movement one word at a time on a Detroit art gallery exterior wall, Friday, Sept. 18, 2015, in Detroit. Writer tells The Associated Press that when the commissioned project is completed the phrase will have been written thousands of times. Writer started Monday behind the NNamdi Center for Contemporary Art and says he is using art \"to raise awareness to the disproportionate numbers of blacks being killed by police.\", \"Black Lives Matter\" is painted repeatedly on the exterior wall behind the NNamdi Center for Contemporary Art, Friday, Sept. 18, 2015. in Detroit. Renda Writer, a white muralist from Miami, is expressing his support for the \"Black Lives Matter\" movement one word at a time on the art gallery wall. WASHINGTON (AP)  The Black Lives Matter network will skip a presidential endorsement but keep up its political activism by confronting candidates about the treatment of African-Americans in the United States, one of the groups founders says. In an Associated Press interview, Alicia Garza discussed the organizations refusal to settle on a preferred candidate in the 2016 race to succeed President Barack Obama and pledged to press ahead with protests and interruptions during the campaign. \"Sometimes you have to put a wrench in the gears to get people to listen,\" said Garza, who spoke at the 7th Annual Black Womens Roundtable Policy Forum last week. The Black Lives Matter movement traces its roots to the fatal shooting of 17-year-old Trayvon Martin in Florida in 2012, and gained national ground after 18-year-old Michael Brown was shot and killed by a white police officer in Ferguson, Missouri, last summer. Since then, deaths of other unarmed black males at the hands of law enforcement officers have inspired protests under the \"Black Lives Matter\" moniker. Some are affiliated with the original network founded by Opal Tometi, Patrisse Cullors, Garza and their allies. Some are not, although they use the slogan. Black Lives Matter activists grabbed headlines when they disrupted a Seattle rally last month right before Vermont Sen. Bernie Sanders, a Democratic presidential candidate, was about to speak. Others claiming to represent Black Lives Matter have met with Democratic presidential candidate Hillary Rodham Clinton and Republican presidential hopeful Jeb Bush. The Congressional Black Caucus, a group of African-American lawmakers in the House and Senate, also was focusing on criminal justice and police reforms during its annual legislative conference this weekend. The Democratic National Committee acknowledged the Black Lives Matter movement at its Aug. 1 meeting in Minneapolis with a resolution saying it \"joins with Americans across the country in affirming Black lives matter and the say her name efforts to make visible the pain of our fellow and sister Americans as they condemn extrajudicial killings of unarmed African-American men, women and children.\", The network said the resolution would not get its endorsement, and Garza reaffirmed that the official Black Lives Matter organization will not endorse any political party or candidate this election cycle. \"Black Lives Matter as a network will not, does not, has not, aint going to endorse any candidates,\" Garza said. \"Now if there are activists within the movement that want to do that independently, they should feel free and if thats what makes sense for their local conditions, thats fantastic. But as a network, thats not work were engaged in yet.\", In the future, the organization may become more involved with candidates and parties, and even run candidates, she said, but added that \"were not there yet.\", \"Its too early in the development of the network and its too early in the genesis of the movement to rally around anyone in particular who hasnt demonstrated that they feel accountable to the Black Lives Matter movement or network,\" said Garza, who also works with the National Domestic Worker Alliance. \"What weve seen is an attempt by mainstream politics and politicians to co-opt movements that galvanize people in order for them to move closer to their own goals and objectives,\" she said. \"We dont think that playing a corrupt game is going to bring change and make black lives matter.\", ", "Date": "20150920", "Author": "[Jesse J. Holland, Associated Press]", "Link": "http://www.chron.com/news/politics/article/AP-Interview-Black-Lives-Matter-skipping-2016-6515669.php", "Title": "[AP Interview: Black Lives Matter skipping 2016 endorsement]"}