{"Content": "[Caption, Close, In this photo taken Wednesday, Sept. 16, 2015, Republican presidential candidates, from left, Ben Carson, Donald Trump, and former Florida Gov. Jeb Bush chat during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum in Simi Valley, Calif.   Donald Trumps rivals emerged from the second Republican debate newly confident that the brash billionaire will fade if the primary takes a more substantive turn and that they can play a role in taking him down without hurting their own White House ambitions. Yet in a race that has so far defied standard political logic, that may be little more than wishful thinking. Republican presidential candidate, former Florida Gov. Jeb Bush arrives in Mackinac Island, Mich. for the 2016 Mackinac Republican Leadership Conference, Friday, Sept. 18, 2015. Republican presidential candidates, former Florida Gov. Jeb Bush, right, and Donald Trump both speak during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidate former Florida Gov. Jeb Bush speaks at a presidential forum sponsored by Heritage Action at the Bon Secours Wellness Arena, Friday, Sept. 18, 2015, in Greenville, S.C. WASHINGTON (AP)  Donald Trumps rivals emerged from the second Republican debate newly confident that the brash billionaire will fade if the nomination fight takes a more substantive turn, and that they can play a role in taking him down without hurting their own White House ambitions. Yet that may be little more than wishful thinking in a race that so far has defied standard political logic. \"I keep looking for the speed bump that knocks Donald Trump off track,\" said tea party co-founder Mark Meckler. \"I havent seen it. Were in uncharted territory.\", Trump may have had a lackluster performance in Wednesdays debate, but hes proved every prediction of his campaigns demise to be premature. Often, hes emerged from such moments with stronger support. Even if Trump does falter in the coming weeks, several dozen Republicans interviewed by The Associated Press after the latest debate said no candidate is positioned to seize control if theres a void atop the unruly Republican field. Jeb Bush cannot escape stubborn and strong skepticism from conservatives. On Friday night, the former Florida governor stuck by his support for the Common Core education standards, and drew boos from a crowd of thousands in South Carolina. Scott Walker has been knocked from his top-tier status. For the Wisconsin governor, the campaign focus is squarely on Iowa. \"Maybe not enough sizzle,\" said Daniel McCabe, a 65-year-old Republican from Stamford, Connecticut. Former technology executive Carly Fiorina is emerging after a strong debate performance. But for now, she lacks the money and organization for the lengthy campaign most expect. \"I think that theres interest in hearing new ideas because the old havent been working,\" said Gwen Ecklund, the GOP head in Iowas Crawford County. \"People are really still all over the board.\", Trumps rivals say the debate, before a television audience of 23 million, did little to reshuffle the 16-candidate field. But they contend it was pivotal in exposing Trumps vulnerabilities, most notably his glaringly undeveloped policy positions. \"I have big problems with his lack of interest in learning about the job of being president of the United States,\" Bush told Fox News. \"This is a big, serious job and you have to have the skills necessary to lead.\", Steve Munisteri, an adviser to Kentucky Sen. Rand Pauls campaign, likened Trumps debate performance to a long-running television show on the brink of cancellation. \"He never really gives any specifics, so most of his appeal is kind of reality talk show entertainment,\" Munisteri said. \"Its the same old shtick every time.\", On Friday, Trump released just his second policy paper, posting to his website a statement outlining his support for expansive gun rights. Thats a stand on which there is almost no disagreement in the Republican Party. With four more debates before the Iowa caucuses Feb. 1, the party establishment wing is banking on Trumps policy gaps becoming more troublesome as the first voting nears. For Robert Morse, a 67-year-old Republican who attended a Trump town hall meeting Thursday in New Hampshire, the candidates vague prescriptions for addressing the nations problems are cause for concern. \"Well, he hasnt been real definite about that, has he?\" Morse said. \"If hes going to really be in the running, hes got to start putting down real facts that people want to hear about.\", Trumps rivals were also heartened by signs that the businessman known for his sharp barbs sometimes flinched when criticism came his way. For some, it validated their decision to engage Trump in the second debate rather than continue with the hands-off approach most took throughout the summer. In post-debate calls with donors and other supporters, Bush advisers singled out his defense of his brother, former President George W. Bush, when Trump challenged his record. \"You know what? As it relates to my brother, theres one thing I know for sure: he kept us safe,\" Bush said to cheers from the audience at the Ronald Reagan Presidential Library in California on Wednesday night. After that exchange, Bushs team noted, Trump went silent for 37 straight minutes. The most blistering onstage rebuke of Trump came from Fiorina, the former CEO at Hewlett-Packard. Asked about Trumps attempt to explain away his insults about her looks, Fiorina said simply, \"I think women all over this country heard very clearly what Mr. Trump said.\", That Fiorina was even on the stage was a triumph of an establishment eager to showcase the only woman in the GOP race. With the implicit backing of GOP officials, Fiorinas campaign lobbied debate host CNN to change the participation criteria to allow her to participate despite her low poll numbers. While many question her ultimate viability, the businesswoman is viewed as a powerful political weapon in the GOPs push to court women, particularly in a 2016 contest that features Democrat Hillary Rodham Clinton. Fiorina, Bush and several other candidates followed the debate with appearances at Republican gatherings in South Carolina and Michigan. Trump was scheduled to attend the South Carolina event, but pulled out Friday, citing a \"significant business transaction.\", It was the second eyebrow-raising moment for Trump on the heels of the debate. Thursday in New Hampshire, he declined to correct a questioner who wrongly said President Barack Obama is a Muslim and asked what Trump planned to do about terrorist training camps on U.S. soil. Two days later, Trump tweeted that didnt think he was \"morally obligated to defend the president every time somebody says something bad or controversial about him.\", Assessing the full impact of Trumps uneven debate performance will take time. Polling is notoriously unreliable at this stage of a campaign and heavily influenced by name recognition. Because Trump is largely financing his own campaign, the whims of wealthy donors offer little insight into his standing with voters. On Friday, Trump told The New York Times he was prepared to spend $100 million of his own money to win the nomination. For other candidates, fundraising will consume much of their valuable time. They want to collect as much money as possible  a sign of political viability  before the latest reporting period ends Sept. 30. Donors and fundraisers for most candidates are predicting a paltry showing, given that the reporting period covers the traditionally slow summer months  a time they say was further exacerbated by the puzzle of Trumps enduring prominence. Its one at least some voters are ready for Republicans to solve. \"Republican primary voters are looking for somebody who will lower the size, scope, and cost of government and promote freedom, liberty and opportunity,\" said Mark Weyermuller, a 55-year-old Republican from Wilmette, Illinois. \"Hair is not an issue.\", ", "Date": "20150921", "Author": "[Julie Pace and Steve Peoples, Associated Press]", "Link": "http://www.chron.com/news/politics/article/GOP-state-of-play-Rivals-still-waiting-for-Trump-6518402.php", "Title": "[GOP state of play: Rivals still waiting for Trump to fade]"}