{"Content": "[Caption, Close, Traffic crosses the Spring Creek bridge on Kuykendahl Road between Montgomery and Harris counties. Montgomery County officials must now decide whether to retool a controversial road bond measure that voters in The Woodlands rallied against in record numbers Saturday after raising concerns that construction would increase traffic in their affluent suburb, among other issues. The $350-million bond measure to improve and expand roadways served as a lightning rod in and around The Woodlands, where residents opposed an extension of the Woodlands Parkway west to State Route 249 that was planned to as an east-west corridor in the growing county. After its failure, how and when the county will address several traffic and infrastructure concerns remain open questions. \"Traffic in The Woodlands has become so heavy that the quality of life is beginning to be negatively affected,\" said Jon Bauman, vice president of the Texas Patriots PAC, an influential tea party group based in The Woodlands that organized against the bond measure. \"Most people feel like one more car is too many.\", The referendums rejection slows the countys ability to tackle road projects critical to alleviating traffic in the area, which is largely believed to be the number one problem facing Montgomery County residents. Other projects in the measure included $60 million for the widening of Rayford Road east of I-45, $23.5 million for widening State Route 105 east through Cut and Shoot and a $10 million for work on a Magnolia bypass. Bauman and other opponents of the bond have called on the county to hold another election in November. \"It is time for us to demand a better bond package for November,\" said Gordy Bunch, a director of The Woodlands township who was against the bond referendum, in a statement Sunday. \"A road bond without extending Woodlands Parkway, no maintenance projects, and one that addresses our near-term, immediate needs.\", Rice political science professor Bob Stein said there wasnt a clear direction for the county going forward. He said it should do an analysis of the voting results precinct-by-precinct to see where opposition was greatest on election day. Stein said a November election could bring out more voters in general - maybe beyond just The Woodlands. But the biggest school district in Montgomery County, the Conroe Independent School District, is planning a bond referendum for November, and Bruce Tough, who chairs The Woodlands Township, said voters in The Woodlands and elsewhere in the county might be reluctant to vote in favor of multiple measures. Tough supported the bond this time around. \"In hindsight and probably in foresight, I would have deferred The Woodlands parkway expansion,\" he said. \"Youre jeopardizing a $350-million bond thats affecting all of the county.\", While many thought the election would be close, the road bonds defeat Saturday was handy, with nearly 60 percent of voters rejecting the measure. Most of the damage was done in early voting when more than 16,000 voters turned out - almost 60 percent of all the votes cast - with nearly 7,500 of those coming from The Woodlands. Montgomery County hasnt approved a road bond in about a decade, despite the countys population having mushroomed. The last attempt to pass a $200-million road bond package three years ago was rejected by voters. And the countys population of around a half-million is projected to increase in five years by 108,000 - the equivalent of adding a community the size of The Woodlands - and then double to more than 1 million residents by 2035. \"Theyre very, very important, very critical to the countys mobility,\" said former county judge Alan Sadler of the road bonds projects. \"And I dont think anyone on either side would disagree with that.\", Montgomery County Commissioners voted to put this years referendum on the ballot in February, and bond supporters were confident that they would be successful. But opposition began building as bond opponents called in inclusion of the parkway extension a \"poison pill\" that would bring thousands of drivers through The Woodlands each day. Proponents said traffic pressures would increase irregardless of the parkways extension. Opposition was also fortified as opponents questioned some $70 million in funding for what they called \"road maintenance,\" projects they said should be funded by the countys general fund and not bonds. Stein, who followed the election, said the referendums defeat likely occurred because turnout in The Woodlands - those who felt they would be most affected by the parkway extension - was relatively high and proponents did not wage a robust enough campaign. \"You had this collective good for everybody, and a very concentrated bad at least in the minds of some people,\" Stein said. ]", "Date": "20150510", "Author": "[Mihir Zaveri]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Montgomery-County-heads-back-to-the-drawing-board-6254672.php", "Title": "[Montgomery County heads back to the drawing board on road bond]"}