{"Content": "[Caption, Close, Macedonian special police forces fire stun grenades towards migrants near the border train station of Idomeni, northern Greece, as they wait to be allowed by the Macedonian police to cross the border from Greece to Macedonia, Friday, Aug. 21, 2015. Macedonian  fired the stun grenades to disperse thousands of migrants stuck on a no-mans land with Greece, a day after Macedonia declared a state of emergency on its  borders to deal with a massive influx of migrants heading north to Europe. U.S. Army Army 1st Lt. Shaye Haver, right,  speaks with reporters, Thursday, Aug. 20, 2015, at Fort Benning, Ga. where she was scheduled to graduate Friday from the Armys elite Ranger School. Haver and Army Capt. Kristen Griest are the first two women to complete the notoriously grueling Ranger course, which the Army opened to women this spring as it studies whether to open more combat jobs to female soldiers. FILE- In this May 22, 2015 file photo, artist Meg Saligman shows knots tied to a mock-up of an art installation at her studio in Philadelphia. The installation is planned to be in the shape of a latticed grotto and will greet Pope Francis and millions of others when they travel to Philadelphia this fall. Visitors will be invited to leave their own problems behind in the form of knots affixed to its walls, or help others by loosening and removing a knot already in place. Your daily look at late-breaking news, upcoming events and the stories that will be talked about today:, 1. KIM BEATS WAR DRUM AFTER SOUTH KOREAN SHELLING, North Koreas leader orders troops to prepare for battle a day after South Korea fires dozens of artillery rounds in response to what the South says were several rounds of North Korean artillery fire. 2. GREECE BETS ON EARLY POLLS TO BOOST REFORM MANDATE, Greeces president will ask opposition leaders to form a new government, after a party rebellion over a bailout deal forces the prime minister to call early elections next month. 3. FEMALE ARMY RANGER GRADUATES EARN ELITE TAB, The first female soldiers to complete the Armys rigorous Ranger School are graduating, spurring debate over opening all combat roles to women. 4. MACEDONIAN TROOPS FIRE STUN GRENADES AT MIGRANTS, The action was designed to disperse thousands of people stuck on a no-mans land with Greece, a day after Macedonia declared a state of emergency. 5. AP: FEDS COMPLICIT IN CHEATING WEBSITE SCANDAL, U.S. government employees with jobs in national security or law enforcement are among hundreds found to be using federal networks to access and pay membership fees to Ashley Madison. 6. KATRINAS IMPACT, A DECADE LATER, New Orleans rebounds better than expected since the hurricane, but some neighborhoods are still struggling to rebuild  and the city is still dogged by crime and racial inequality. 7. WHAT LAWMAKERS ARE URGING HILLARY CLINTON TO DO, Congressional Democrats implore the presidential hopeful to offer a better explanation of her use of a private email account while serving as secretary of state. 8. WHY TUNNEL CLOG MAY GO ON, No one seems willing to finance another tube that would alleviate the bottleneck rail commuters experience every day from New Jersey to New York City. 9. POLL DEBUNKS BELIEF BLACKS DISADVANTAGED TECHNOLOGICALLY, An AP-NORC Center poll finds African-American millennials are just as engaged in getting news online as their white counterparts. 10. WHO PHILLY ORGANIZERS ARE HOPING PAYS A VISIT, Artists collect more than 30,000 knots representing peoples everyday struggles and will soon house them near the cathedral where Pope Francis is celebrating Mass next month.]", "Date": "20150824", "Author": "[The Associated Press]", "Link": "http://www.chron.com/news/us/article/10-Things-to-Know-for-Today-6457179.php", "Title": "[10 Things to Know for Today]"}