{"Content": "[According to his campaign team, two top lawyers definitively settled the question of whether Sen. Ted Cruz (R-Texas) is eligible to run for US president with an article published in the Harvard Law Review earlier this month. In an email to Business Insider last week, Cruzs senior adviser Catherine Frazier said the campaign is pointing any reporters who ask about Cruzs eligibility to the March 11 article by Neal Katyal and Paul Clement. \"Any coverage on this issue should include the Harvard Law Review article by Katyal and Clement,\" Frazier wrote. Questions have been raised about Cruzs eligibility as he was born in Canada to an American mother and a Cuban-born father. Most experts agree his mothers American citizenship makes him a \"natural born citizen,\" which is one of the constitutional requirements for presidential eligibility. But in an analysis of the issue published by Politifact in 2013, they concluded there is the \"tiniest sliver of uncertainty\" about whether Cruz is legally eligible to be president, because the phrase \"natural born citizen\" has never been explicitly defined by a Constitutional amendment or Supreme Court ruling. In their article, Katyal and Clement argue that there is no uncertainty whatsoever about whether children of American citizens who were born abroad are \"natural born citizens.\", Both Katyal and Clement have served as the acting solicitor general of the US. Katyal held the post in the administration of President Barack Obama while Clement served under President George W. Bush. They began their article by noting that they may have different political views but are in complete agreement about the definition of a \"natural born citizen.\", \"We have both had the privilege of heading the Office of the Solicitor General during different administrations,\" they wrote. \"We may have different ideas about the ideal candidate in the next presidential election, but we agree on one important principle: voters should be able to choose from all constitutionally eligible candidates, free from spurious arguments that a U.S. citizen at birth is somehow not constitutionally eligible to serve as President simply because he was delivered at a hospital abroad.\", In their article, Katyal and Clement claimed \"the phrase natural born Citizen has a specific meaning: namely, someone who was a US citizen at birth with no need to go through a naturalization proceeding at some later time.\" They argued \"all the sources routinely used to interpret the Constitution\" are clear on this definition. Specifically, Katyal and Clement cited British common law, which they said \"recognized that children born outside of the British Empire to subjects of the Crown were subjects themselves and explicitly used natural born to encompass such children\" in the 18th Century. They also argued the First Congress in the US and the Naturalization Act of 1790 similarly explicitly defined children born to Americans in foreign countries as \"natural born citizens.\", In their conclusion, Katyal and Clement said theres \"no question\" about Cruzs eligibility to run for president. \"Despite the happenstance of a birth across the border, there is no question that Senator Cruz has been a citizen from birth and is thus a natural born Citizen within the meaning of the Constitution,\" they wrote. Katyal declined to comment when Business Insider asked if he had been in communication with Cruzs campaign and was aware they were citing his article. Clement did not respond to a similar request for comment. ", "Date": "20150405", "Author": "[Hunter Walker, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/Ted-Cruz-s-team-says-this-is-the-proof-that-he-6168334.php", "Title": "[Ted Cruz's team says this is the proof that he can run for US president despite his Canadian roots]"}