{"Content": "[Caption, Close, A number of politicians and influential people have stepped forward and placed their names in the running for the next president of the U.S. But theyre not alone. See the spouses of these contenders. Melania TrumpMelania, a former model, married business mogul Donald Trump in 2005. She gave birth to their first child, Barron William, a year later. This was Donald Trumps third marriage. Supriya JindalSupriya married Louisiana Gov. Bobby Jindal in 1997. In 2012, it was reported that she was working toward her PhD in marketing at Louisiana State University. The couple have three children. Kelley Ashby PaulThe political consultant and writer married Sen. Rand Paul, R-Ky. in October 1990. The couple have three sons. Jeanette RubioThe former Miami Dolphins cheerleader married Sen. Marco Rubio, R-Fla. in 1998. They have four children. Katie OMalleyThe Baltimore City district judge married former Maryland governor and Baltimore mayor Martin OMalley in 1990. The couple have four children. Heidi CruzShe previously held a management position with Goldman, Sachs & Co. and married Sen. Ted Cruz, R-Texas, in 2001. The couple have two children. Hong Le WebbThe lawyer married former Sen. Jim Webb, D-Va. in 2005. Jim Webb was married twice before. The couple have one child together. Karen SantorumThe former neo-natal nurse married former Pennsylvania Sen. Rick Santorum in 1990. The couple have eight children, one of whom died just two hours after being born. Mary Pat ChristieA former investment banker, she married New Jersey Gov. Chris Christie in 1986. She now works as a director at a Wall Street investment firm. The couple have four children. Jane OMeara SandersThe former president of Burlington College married Sen. Bernie Sanders, D-Vt. in 1988. Bernie Sanders was married once before and has a son from a previous relationship. Columba BushColumba married former Florida Gov. Jeb Bush in February 1974. The couple have three children. Tonette WalkerShe worked with the American Lung Association and married Wisconsin Gov. Scott Walker in 1993. She married him several years after her first husband died. The couple have two sons. Janet HuckabeeShe married former Arkansas Gov. Mike Huckabee in May 1974. The couple have three children and a few grandchildren. Candy CarsonShe married former John Hopkins neurosurgeon Ben Carson in 1975. The couple have three children. Anita PerryThe former nurse married former Texas Gov. Rick Perry in 1982. They have two children. Stephanie ChafeeStephanie married former Rhode Island Gov. Lincoln Chafee in January 1990. The couple have three children. Libby PatakiThe marketing consultant married former New York Gov. George Pataki in 1973. The couple have four children. Bill ClintonThe former U.S. president and governor of Arkansas married former New York senator and secretary of state Hillary Rodham in October 1975. The couple have one child. Frank FiorinaThe AT&T executive married the former Hewlett-Packard CEO in 1985. He had previously married in 1977. They have no children. Maybe no one notices, but the better halves and significant others of presidential candidates do their fair share of work making sure the road to the White House goes as smoothly as possible. RELATED: How rich (or poor) are 2015s presidential candidates?, Whether it be pressing the flesh, smiling for that next photo opportunity or holding the kids, wives and husbands humanize potential candidates. This election may even usher a first: a first gentleman. Should Hillary Clinton or Carly Fiorina win the Oval Office, their husbands will make history, too. RELATED: Politicians who flip-flopped on same-sex marriage, While it is notable that Sen. Lindsey Graham, R-S.C. is not married, he wouldnt be the first single president. James Buchanan, the 15th president, remained a bachelor until his death in 1853. Check out the better halves of presidential candidates in the gallery above.]", "Date": "20150716", "Author": "[John-Henry Perera]", "Link": "http://www.chron.com/news/politics/article/Take-a-look-at-the-spouses-of-2015-presidential-6389640.php", "Title": "[Take a look at the spouses of 2015 presidential candidates]"}