{"Content": "[Caption, Close, Republican presidential candidate Donald Trump speaks as Wisconsin Gov. Scott Walker listens during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate Donald Trump, left, speaks as Jeb Bush listens during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidates from left, Marco Rubio, Jeb Bush and Ben Carson talk during a break during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate and Sen. Ted Cruz, R-Texas, speaks during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate and Ohio Gov. John Kasich speaks during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate and Wisconsin Gov. Scott Walker speaks during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate and former Arkansas Gov. Mike Huckabee speaks during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. WASHINGTON (AP)  Republicans seeking their partys 2016 presidential nomination have the challenging task of trying to stand out among the 17 candidates in the race, and Thursdays televised debate was the first opportunity for the party to start whittling down its choices. So its no surprise that the candidates had a vested interest in puffing up their own records as governors, senators and public figures. And some of them just got the facts wrong. Some of the claims in the Cleveland debate and how they compare with the facts:, DONALD TRUMP:  \"If it werent for me, you wouldnt even be talking about illegal immigration.\", THE FACTS: Republicans have been talking about immigration for at least 30 years, including former President George W. Bush and the Republican field in the 2008 and 2012 presidential elections. In 2013, an immigration overhaul seeking to address illegal immigration passed the Senate with strong Republican support, although the House never took it up. And Republican debate about immigration has only intensified in the wake of President Barack Obamas sweeping executive action shielding from deportation millions of immigrants in the U.S. illegally. ", "Date": "20150807", "Author": "[Josh Lederman, Associated Press]", "Link": "http://www.chron.com/news/texas/article/FACT-CHECK-GOP-candidates-veer-from-the-truth-in-6430529.php", "Title": "[FACT CHECK: GOP candidates veer from the truth in 1st debate]"}