{"Content": "[\"You expect to set a record in a presidential election year,\" said Harris County Tax Assessor-Collector Paul Bettencourt, who added that it is \"relatively significant for a nonbattleground state.\", He said another 15,000 registration cards are being processed, which could increase the number by the time early voting starts on Monday. Early voting will last through Oct. 29. Bob Stein, a political science professor at Rice University, said he expects higher than average voter turnout this year based on the record registration and party mobilization. \"And thats even in a state where the conclusion is foregone,\" Stein said. \"Nationally, this is a close race.\", President Bush is expected to defeat Democratic nominee Sen. John Kerry easily in Texas this year, so both candidates are focusing their quest for electoral votes in states where the race is closer. Slightly more than half the nations voting-age population participated in the last presidential election in 2000; the Harris County total was similar. Locally, the evidence shows that the registration rate has been equal in Republican and Democratic areas, Stein said. Among people registered in Harris County, nearly 14 percent have Hispanic surnames, yet another record for the area. The League of Women Voters of the Houston Area registered 5,000 people in the past few months, five times more than normal, according to its president, Judy Hollinger. \"I think voter turnout is going to be at least 60 percent, maybe even 70, because there is such heightened interest this year,\" she said. \"People (who) havent voted in years seem to be saying they will vote.\", Both Hollinger and Stein said they anticipate that some of that interest will resonate in local and congressional races. Although election officials in battleground states, such as Florida and Ohio, continue to face questions about potential voter disenfranchisement, Bettencourt says he does not anticipate those problems here. \"Voter roll integrity will be the best its ever been,\" said Bettencourt, whose duties include voter registration. \"The premise is, if the voter roll is known this far in advance, there is no voter disenfranchisement.\", kristen.mack@chron.com]", "Date": "20041016", "Author": "[KRISTEN MACK, Copyright 2004 Houston Chronicle]", "Link": "http://www.chron.com/news/politics/article/Record-number-of-voters-on-Harris-County-rol665494.php", "Title": "[Record number of voters on Harris County roll]"}