{"Content": "[Sen. Ted Cruz (R-Texas) announced on Monday that he would run for US president in 2016, but the firebrand senator may still face questions about whether hes legally eligible to enter the White House. Cruz was born in Alberta, Canada, to an American mother and Cuban-born father. This meant he acquired both US and Canadian citizenship at birth. After his meteoric rise to national fame when he was elected to the Senate in 2012, he has been dogged by claims he is ineligible to become commander-in-chief since the Constitution states \"no person except a natural born citizen\" is eligible to assume the office of president. Given the publicity over \"the birthers\"  the movement that alleged President Barack Obama was actually born abroad and claims he forged his birth certificate to list Hawaii as his birthplace  Cruz is likely to be a target of similar claims. However, in 2013, constitutional experts told PolitiFact that the term \"natural born citizen\" isnt explicitly defined by the constitution and the Supreme Court has never ruled on the issue to clarify. Since his mother was an American citizen, the experts said they expected Cruz would be deemed an American citizen at birth and thus pass the eligibility test, even though there is what Politifact described as \"the tiniest sliver of uncertainty\" his birthplace could derail his White House dreams. This little bit of doubt is due to the fact the term \"natural born citizen\" is vaguely defined. \"Unfortunately, we cannot say for sure without either a definitive Supreme Court ruling, or an amendment to clarify the Constitution,\" a citizenship expert and law professor at Catholic University professor Sarah H. Duggin said. Cruzs team did not respond to request about for comment on the issue. However, in a preemptive move in May 2014, he renounced his Canadian citizenship. At the time, his press secretary tweeted out the renunciation announcement with the message \"Its official yall.\", Heres Cruzs letter from renouncing his Canadian citizenship:, , Join the conversation about this story , NOW WATCH: Heres how President Obama starts every morning, See Also:]", "Date": "20150323", "Author": "[Leslie Larson, provided by]", "Link": "http://www.chron.com/default/article/There-s-the-tiniest-sliver-of-uncertainty-about-6153764.php", "Title": "[There's 'the tiniest sliver of uncertainty' about whether Ted Cruz is eligible to be president]"}