{"Content": "[Caption, Close, Civil War re-enactors from Hoods Texas Brigade launch an evening attack as part of a three-day Battle of Gettysburg re-enactment on June 29, 2013 in Gettysburg, Pennsylvania.Rep. Donna Howard, D-Austin, has filed a bill to eliminate Confederate Heroes Day, the 42-year-old holiday that honors Jefferson Davis, Robert E. Lee and other Confederate figures. See some of the other interesting and wacky bills introduced this session. Texas lawmakers are set to vote on dozens of bills, many of them might be a bit surprising. Others are hot-button issues that remain controversial whichever way it goes. Here are just a few of them. HB 92  Would allow Texans to carry Bowie knives, which are an illegal weapon, HB 161  Allows counties to house jail inmates in tents , HB 150 - Ending Daylight Savings Time in Texas, HB 207  Makes voyeurism a crime, HB 138  Schools boards may not prohibit the Ten Commandments, HB 164  Allows open-carry of handguns (one of several bills), HB 41  Raising the minimum wage, HB 48  Establishing the Timothy Cole Exoneration Review Commiss , HB 76  Allowing for online voter registration for the first time, HB 80  Prohibit texting while driving, HB 97  Eliminates the statute of limitations on sexual assault and aggravated sexual assault, HB 201  Makes cargo theft a criminal offense, HB 113  Bans sex-selective abortions, HB 124  Requires school districts to offer pre-kindergarten programs for children 4 years and older, optional for 3-year-o , HB 130 --  Legalizes same-sex marriage in Texas (one of several bills), HB 198  Lets school board members and officials carry concealed weapons at board meetings, HJR 34  Repeals the constitutional ban on gay marriage, SB 82  Allows for community supervision for many low-level drug crimes, SB 93  Repeals the Driver Responsibility Program that levies additional traffic fines. SB 135  Changes the key-man system of empaneling grand juries in Texas, Jan. 19 may have been the last official Confederate Heroes Day to be celebrated in Texas. Rep. Donna Howard, D-Austin, has filed a bill to eliminate the 42-year-old holiday that honors Jefferson Davis, Robert E. Lee and other Confederate figures. The bill would establish a new holiday, to be celebrated in May, called Civil War Remembrance Day, which would honor all men and women who fought during the Civil War. Confederate Heroes Day was born in 1973, after the Texas Legislature opted to combine the celebrations of Lee and Davis birthdays, both of which previously wereofficial state holidays. It was decided that the day would honor all soldiers who had served in the South during the Civil War. This year, the celebration of the confederacy fell uncomfortably on the same day as Martin Luther King Jr. Day, which is the third Monday of January each year.]", "Date": "20150210", "Author": "[Madlin Mekelburg]", "Link": "http://www.chron.com/news/politics/texas/article/Lawmaker-seeks-to-eliminate-Confederate-Heroes-Day-6072954.php", "Title": "[Lawmaker seeks to eliminate Confederate holiday]"}