{"Content": "[HONOLULU (AP)  A lawsuit filed Thursday is challenging an election solely for Native Hawaiians, saying its unconstitutional to restrict voting to those who have Native Hawaiian ancestry. The lawsuit filed in federal court wants to stop a vote planned for November to elect delegates for a convention to determine self-governance for Native Hawaiians. There are a wide range of opinions and options for Hawaiian self-determination, and next years convention will allow Native Hawaiians to participate in that process, according to Nai Aupuni, the organization guiding the election, convention and ratification process. The Native Hawaiian Roll Commission was launched in 2012 as part of a state law recognizing Native Hawaiians as the only indigenous people of the islands. The roll is a list of Native Hawaiians interested in participating in their own government. The state shouldnt be involved in a race-based election, the lawsuit said: \"Voting is a fundamental right subject to equal protection guarantees under the 14th Amendment.\", The state attorney generals office is reviewing the lawsuit, a spokesman said. The plaintiffs include two non-Hawaiians who arent eligible for the roll, two Native Hawaiians who say their names appear on the roll without their consent and two Native Hawaiians who dont agree with a declaration to \"affirm the un-relinquished sovereignty of the Native Hawaiian people, and my intent to participate in the process of self-determination.\", Thousands of people on the roll were listed without their consent when their names were transferred from other lists containing Native Hawaiians, the lawsuit said. Kelii Akina, president of public policy think-tank Grassroot Institute of Hawaii, is one of the plaintiffs who is Native Hawaiian but is prevented from registering as a voter because of he wont affirm the declaration requirement. The requirement \"amounts to viewpoint discrimination,\" the lawsuit said. Requiring roll registrants to agree with the statement \"will stack the electoral deck, guaranteeing that roll registrants will support the outcome favored by defendants in any subsequent vote,\" the lawsuit said. The lawsuit was filed with help from conservative group Judicial Watch in Washington, D.C. ", "Date": "20150813", "Author": "[Jennifer Sinco Kelleher, Associated Press]", "Link": "http://www.chron.com/news/us/article/Lawsuit-Native-Hawaiian-election-would-be-6443331.php", "Title": "[Lawsuit: Native Hawaiian election would be unconstitutional]"}