{"Content": "[Caption, Close, , Gov. Greg Abbott meets with Mexicos Secretary of Foreign Affairs Jose Antonio Meade Kuribrena on Thursday in Austin. Gov. Greg Abbott meets with Mexicos Secretary of Foreign Affairs... AUSTIN  Gov. Greg Abbott huddled with a delegation of top Mexican officials on Thursday and he quickly snagged an invitation for a visit to Texas southern neighbor in coming months. In brief remarks shortly after the Mexican delegation arrived for a formal dinner at the Governors Mansion, Abbott announced he had received and immediately accepted the invitation. No date has been set, but aides said the trip to Mexico City could come before the end of the year to discuss issues such as bilateral trade, energy and infrastructure  which along with border security were on the agenda for discussion during the dinner with Mexicos Secretary of Foreign Affairs Jose Antonio Meade Kuribrena. \"The Texas-Mexico relationship is the most valuable and unique among the border states,\" Abbott said. \"I look forward to engaging with Mexican officials in the future to deepen our longstanding partnership, improve bilateral relations and ultimately yield a more productive and positive relationship.\", Meade Kuribrena echoed the sentiments, insisting Thursdays meeting with Abbott was aimed at strengthening Mexicos historic relationship with Texas. Noting that Texas and Mexico share close \"family ties, a bond of friendship and the common goal of economic prosperity,\" the governor said the economies of the long-time trading partners \"are closely intertwined., \"I look forward to finding new and innovative ways to collaborate and improve the Mexico-Texas relationship,\" he said. As the meeting began, the historic symbolism of those ties was evident just steps away in the mansion. In the main hallway just outside the dining room, a huge painting depicted the fall of the Alamo, a battle that Mexico won in Texas war for independence. In a nearby parlor hangs an early print of Gen. Winfield Scott, the storied U.S. Army general who captured Mexico City during the Mexican-American War in the 1840s. Thursdays meeting marked the latest gesture between Texas and Mexico aimed at warming trade and diplomatic relations between the governments in Austin and Mexico City that have occasionally been strained in the past decade over border drug violence, immigration and executions of Mexican citizens in Texas prison system. Abbott and Meade Kuribrena met briefly with reporters before their dinner, and gave no details about the specifics of their agenda or if there were issues that either side hoped to resolve during the 1 1/2-hour meeting. In recent years, previous Texas governors have hosted a variety of Mexican dignitaries in Austin, including then-President Vicente Fox, and have undertaken initiatives to increase trade and bilateral relations much like Abbott is doing. But after a fall election where conservative Republicans, many of whom were elected, pushed to ramp up border security and used illegal immigration from Mexico as an issue to attract votes  the current diplomatic initiatives by Abbott are expected to be seen as an opportunity for new collaboration. mike.ward@chron.comTwitter.com/ChronicleMike]", "Date": "20150709", "Author": "[Mike Ward]", "Link": "http://www.chron.com/news/politics/article/Abbott-meets-with-Mexican-officials-gets-invite-6376637.php", "Title": "[Abbott meets with Mexican officials, gets invite]"}