{"Content": "[Former Gov. Rick Perry on Friday pitched himself to conservative activists as the potential 2016 presidential candidate with the long executive record needed to confront a perilous world and economic anxiety at home. In a speech at the Conservative Political Action Conference outside Washington, D.C. Perry sought to leverage his 14-year gubernatorial experience as an above-all presidential qualification, especially in contrast to an incumbent whose foreign policy he described in alarming terms. \"Our allies doubt us and our adversaries are all too willing to test us,\" Perry said, stressing that never has the \"future been more uncertain and the world more dangerous than it is today.\", Perry reserved his most emphatic language for the Islamic State terrorist group, calling its goals apocalyptic and classifying it as the worst threat to freedom since communism. Perry linked his views on foreign policy  which consumed the first six minutes of his speech  with his efforts to secure the Texas-Mexico border, saying drug cartels in the region are a clear and present danger to the health and safety of all Americans. On the economy, Perry hailed Texas as a model of how to make sure growth lifts up all members of society, not just the privileged few. He used a sometimes-ridiculed theory to drive home the point. Im just going to say this quite plainly: The unemployment rate is sham, Perry said. It leaves millions of American workers uncounted. And if the Republican Party doesnt take a stand for these uncounted Americans, who will?, While most of Perrys speech took aim at Obama-era policies, he prodded his party to offer a compelling alternative, keeping with a tough-love theme he kicked into high gear following the GOPs sweep of the midterm elections last year. The conservative movement must be a great agent of reform, Perry said. To lead this country, we must offer a vision of change. In a Q-and-A following the speech, Perry was asked to expand on how he would handle illegal immigration as president. He took a swipe at Congress for failing to act on the issue while \"people literally die,\" but hedged on offering a specific plan, saying there are \"a lot of interesting ideas out there\" but the border first has to be secure.]", "Date": "20150227", "Author": "[Patrick Svitek]", "Link": "http://www.chron.com/news/politics/us/article/At-CPAC-Rick-Perry-touts-long-executive-resume-6105408.php", "Title": "[At CPAC, Rick Perry touts long executive resume]"}