{"Content": "[Caption, Close, Students from around the country celebrate in front of the Supreme Court in Washington after the justices upheld a key provision of the Affordable Care Act. (Bill OLeary / Washington Post), Dont let the angry press releases fool you. Republicans have plenty to celebrate now that the U.S. Supreme Court upheld a challenge to the Affordable Care Act. Not only will candidates be able to continue using the law as a political whipping-boy for the 2016 election, but the party also wont have to come up with any viable alternative. Perhaps theyll even start calling it SCOTUScare. At least thats what Justice Antonin Scalia recommended in his dissent. The issue raised by the case, King v. Burwell, wasnt a question of whether the law itself is constitutional - the court settled that question three years ago when it held that the individual mandate to buy insurance was enforceable as a tax. In this case the court was asked to address whether the law prohibited policyholders who purchased their insurance through federal exchanges from receiving the subsidies that make insurance affordable. In Texas, more than 832,000 people receive these subsidies to help purchase health insurance through the federal exchange. The problem rests with four words out of a 900-page document, which states that those subsidies are for people who purchased their plans through exchanges \"established by the state.\", On their own, those words seem like a death knell - to use the words of Gov. Greg Abbott - for Obamacare insurance plans in the 34 states that refused to establish their own exchanges, such as Texas. But those four words dont exist in a vacuum, and it isnt the job of the Supreme Court to presume that Congress would write a law that fails to accomplish what it was created to do. Looking at those words in context, as Chief Justice John Roberts did in his majority opinion, it is implausible to think that Congress would write a law that effectively self-destructs. This is the smart decision of a justice who refuses to play politics. Yet while the court has settled these legal questions, the Obamacare fight continues. Texas Republicans wasted no time in releasing the usual harangues against the healthcare law. Lt. Gov. Dan Patrick called the Affordable Care Act \"broken and a burden.\" U.S. Sen. Ted Cruz called it a \"disaster.\", Theres no denying problems with the rollout of Obamacare, but as time passes the laws actual impact is growing clearer. Health care costs are rising slower, the uninsured rate has hit a record low at 12.9 percent and the law itself saves taxpayers $353 billion over 10 years. Hospitals are also in a better financial position because of these new ranks of insured patients, according to Ted Shaw, president of the Texas Hospital Association. Overall, the law helps people take responsibility for their own health insurance. If there is a disaster, we dont see it. But that hasnt stopped Abbott from calling for a \"President who will repeal Obamacare and enact real healthcare reforms.\", What exactly \"real healthcare reform\" means is a mystery. It isnt as if Obamacare sprung spontaneously from the presidents forehead in 2009. As the Supreme Court documents in the King decision, the United States has a long history of failed health insurance reform, and the Affordable Care Act serves as a national adaptation of the one successful state plan - Massachusetts 2006 health care reform, which was proposed, signed and implemented by then-Gov. Mitt Romney, the Republican candidate for president in 2012. At this point, fights over Obamacare smack more of politics than policy, and the poorest Texans are getting caught in the crossfire. Texas political leaders have refused to accept $100 billion in federal funds that would expand Medicaid under the Affordable Care Act. Those dollars would cover 90 percent of the programs cost and provide health insurance for the 1.4 million Texans who are too poor to receive subsidies on the federal health care exchange. Without insurance, those Texans rely either on charity or county taxpayers to cover their bills. For the time being, Texans will have to pay twice for public health care, with federal and local taxes, while the people who need help the most get left behind. Expanding Medicaid would help everyone, but were not optimistic. After all, it is hard to send out an angry press release when people are happy.]", "Date": "20150625", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Obamacare-stands-6350038.php", "Title": "[Editorial: Obamacare stands]"}