{"Content": "[Caption, Close, Republican presidential candidate Donald Trump takes a photo with a supporter after speaking at a campaign event in Dallas, Monday, Sept. 14, 2015. WASHINGTON (AP)  Republican presidential candidates not named Donald Trump have raised hundreds of millions of dollars for their campaigns and allied groups. Yet none of that money is being targeted against the celebrity real estate mogul, the partys front-runner through the summer. Now the first well-funded anti-Trump volley is coming, though not from another candidate. Its from the Club for Growth, a Washington-based tax-cutting advocacy group that just months ago asked Trump for a contribution. The group said Tuesday it will spend $1 million assailing Trump on TV in the early caucus state of Iowa. Its 30-second commercials, which begin Thursday, call him \"the worst kind of politician,\" highlight some of his most liberal positions and say hes playing voters \"for chumps.\", Trump would seem a ripe target for any conservative organization: Hes said in the past that he identifies \"more as a Democrat.\", For now, though, Club for Growth is going it alone. Some of the largest pro-Republican political groups  including the Koch brothers-led Americans for Prosperity, GOP strategist Karl Roves Crossroads groups and the U.S. Chamber of Commerce  say they have no immediate plans to swat at him. Fred Malek, a longtime Republican presidential fundraiser who isnt aligned with a specific candidate, said the approach of many has been to \"let Trump beat Trump.\", \"Im not aware of any organized effort to attack Trump,\" Malek said. \"Rather, the best-informed Republicans feel the American people are smart enough to figure this out and wont nominate Trump.\", Similarly, the candidates themselves, and the super PACs trying to help them win, havent put any money into a Trump-defeating effort on television. Instead, their strategy appears to be to wait for the star of the political summer to fade on his own. Former Texas Gov. Rick Perry, who last week became the first candidate to leave the 2016 race, was one of the feistiest Trump combatants, but his super PACs never paid for any ads to amplify that message. \"Our plan, which I think is where a lot of folks are, was to wait as long as possible to do contrast ads or attacks on Trump,\" said Austin Barbour, leader of a trio of super PACs that supported Perry. \"Theres a feeling that his poll numbers are vastly inflated and will start coming down on their own, so no one wants to spend valuable resources doing what may just happen naturally.\", Club for Growth, which is paying for the ads through its super PAC, is no longer willing to wait. The clubs resident, David McIntosh, said he at first assumed that Trump wasnt a credible candidate but the candidates continued rise in the polls showed otherwise. \"Weve realized weve got to take Donald Trump seriously and really show what his record is,\" McIntosh said. Club for Growth may not seem the perfect Trump-slayer; it unsuccessfully solicited a $1 million contribution from him in June. Indeed, Trump wrote Tuesday on Twitter that the club is \"little respected\" and, having been spurned by him, is \"spending lobbyist and special interest money on ads\" against him. With the second GOP debate this week and voting in the earliest primary states less than five months away, the candidates and groups helping them are beginning to spend money on TV ads. Through the end of June, donors backing Trumps Republican opponents had given about $300 million, Federal Election Commission reports show. So far that money is helping the candidates define themselves rather than tear down Trump. Right to Rise, a super PAC created to help former Florida Gov. Jeb Bush, is on the air beginning $24 million worth of ads casting the former Florida governor as a \"proven conservative\" with \"real results.\" The ads are in Iowa and New Hampshire and spread South Carolina next week. Trumps meteoric rise has come not after a slew of pricey, well-crafted advertisements, but with the benefit of intense media coverage, which costs him nothing. The Trump phenomenon \"in a weird way is showing the diminishing importance of money in politics,\" said John Jordan, a California winery owner and major Republican donor. \"And because of that, I think the flow of money is slowing to a trickle.\", Through the end of June, Trump had mostly paid his own way, lending his campaign nearly all of the $1.9 million it reported raising. The billionaire candidate has pledged to spend whatever it takes to win the GOP nomination, meaning that even the best-funded opponents or Republican groups could find themselves financially overmatched. ", "Date": "20150915", "Author": "[Julie Bykowicz, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Club-for-Growth-to-spenM-on-TV-ads-going-6505541.php", "Title": "[Club for Growth to spend $1M on TV ads going after Trump]"}