{"Content": "[Caption, Close, , Perry sends National Guard troops to the border. Perry refuses federal \"Race to the Top\" funding for schools. Perry rejects federal unemployment funds. Perry takes a break from attacking the federal government and turns his attention to a potential primary opponent. Texas balances its budget with the help of fderal stimulus funds, but wont accept federal stimulus funding for the unemployed. Executed convict Cameron Todd Willinghams ghost wont stop haunting Rick Perry, , Perry leads a prayer rally for nation in crisis at the Houston Astrodome. Stimulus-hating Gov. Perry uses stimulus funds to balance Texas budget, Perry is more outraged by a cartoon in the Sacramento Bee than he is about the results of lax regulation. Texas leads the nation in the rate of uninsured. Perry enters the GOP presidential primary. Wildfires force a change in Perrys anti-federal government attitude. , Perry pauses his campaign attacks on the federal government just long enough to request federal disaster aid for wildfires. Perrys appointee on the UT board is gunning for President Bill Powers. , The Texas drought prompts Perry to suggest that prayer might end the drought. , Perry tries to force the Travis County DA out of office when she is arrested for driving under the influence. , Perry cant remember the third federal agency he would shut down during a presidential primary debate. Oops.  Shrugging off the news that his presidential campaign has run out of money, former Texas Gov. Rick Perry announced Thursday that he will look for support at the Iowa State Fair next week. Perry will be holding six events in five of the early-voting states cities between next Monday and Wednesday, according to his campaign, but the focus will be the fair in Des Moines. The Republican will be participating in the \"Celebrity Griller\" event Tuesday afternoon and the \"Des Moines Register Soapbox\" Wednesday morning. The soapbox is a tradition that gives candidates 20 minutes to speak to the crowd and take questions. Other candidates to speak include Democratic U.S. Sen. Bernie Sanders of Vermont and Republicans Marco Rubio, a U.S. senator from Florida; Lindsey Graham, a U.S. senator from South Carolina; Rick Santorum, a former U.S. Sen. from Pennsylvania; neurosurgeon Ben Carson, Louisiana Gov. Bobby Jindal, and Mark Everson, a former IRS commissioner. Perry famously drew attention for his visit to the Iowa State Fair in 2011. During that trip, a photographer captured an image of Perry -- then a frontrunner for the 2012 GOP nomination -- eating a corn dog. The photo went around the Internet and soon found its way into Democratic jokes.]", "Date": "20150813", "Author": "[Brian M. Rosenthal]", "Link": "http://www.chron.com/news/politics/us/article/Fresh-off-news-of-money-troubles-Rick-Perry-6443475.php", "Title": "[Fresh off news of money troubles, Rick Perry heads to Iowa State Fair]"}