{"Content": "[Caption, Close, State senate candidate CJ Grisham on his farm in Bell County. Grisham, a U.S. Army veteran, heads the advocacy group Open Carry Texas. [Photo by Grisham Campaign], State senate candidate CJ Grisham with his wife Emily and three children. Grisham, a U.S. Army veteran, heads the advocacy group Open Carry Texas. [Photo by Grisham Campaign], State senate candidate CJ Grisham looks out onto his farm in Bell County. Grisham, a U.S. Army veteran, heads the advocacy group Open Carry Texas. [Photo by Grisham Campaign], Open Carry Texas CJ Grisham speaks at a rally in front of the state Capitol in 2015. Henry Vichique (center), with his wife Danielle Vichique (left) and CJ Grisham (right), president of Open Carry Texas at a rally in support of Vichique, Sunday, April 6, 2014, at the San Antonio Police Department West Substation. The 19 year-old Vichique was tased and arrested on March 31, 2014 while walking home with a loaded rifle. AUSTIN - Open carry activist CJ Grisham on Wednesday formally announced he is running to represent Senate District 24,which stretches from just north of San Antonio through west Austin, Killeen and up to Abilene. Grisham,a U.S. Army veteran and head of the advocacy group Open Carry Texas, first said he was mulling the run nearly a month ago. He told the Chronicle at that time his advocacy during the last few legislative sessions helped spur him to run after Horseshoe Bay Republican Troy Fraser announced earlier this summer he would not seek re-election. \"I am a soldier, a rancher, a husband and father.  I am not a professional politician,\" Grisham said in a statement announcing his run Wednesday.  \"I will be a true citizen legislator.  My goal will be to stand up to the status quo and fight to make the tough decisions that career politicians wont make.\", Grisham will continue to advocate for more permissive gun laws in Texas and traditional values and against \"federal overreach,\" according to his new campaign website. He also believes in drug tests for welfare recipients, the death penalty, tough-on-crime legislation and bolstering Texas agriculture. He is opposed to Obamacare and said he \"will support good pay for teachers, appropriate local funding of schools, high standards and less red tape.\", One of the most prominent activists at the Capitol this year, Grisham threw his support behind the push to end Texas 125-year ban on the open carry of handguns. The Legislature did vote to lift the ban, but only for those Texans with concealed handgun licenses. Grisham, who lost his Texas CHL after a 2013 arrest but continues to carry concealed using another states permit, was not happy with the legislative compromise, advocating for so-called unlicensed, or \"constitutional,\" carry. But Grisham, a law-and-order Republican, disagreed with the tactics of fellow open carry activist Kory Watkins and his group, who are notorious among police officers in north Texas for shadowing law enforcement during their shifts. \"Kory is not the face of open carry. He is the ass,\" Grisham told the Chronicle in February. In March 2013, Grisham was arrested while carrying a rifle on a hike with his son, which is legal under Texas law. A dashcam video showing the two being stopped by a police officer went viral. Grisham was convicted of interfering with official police duties and fined $2,000, which he paid in nickels as a slight to Bell County District Attorney Jim Nichols. \"I figured if he was going to run me on a bogus charge, he was going to be paid in nickels,\" said Grisham, who has turned around and sued the officer for violating his 2nd and 4th Amendment rights, unlawful arrest, assault and battery and abuse of authority. In June, Fraser announced he would not be seeking reelection, ending a nearly 30-year stint in the state Legislature. Multiple other people have announced or also are thinking about a run for the seat, including former San Antonio City Councilman Reed Williams, state Rep. Susan King, R-Abilene and Austin ophthalmologist Dawn Buckingham, according to the Texas Tribune. Grisham has enlisted Charles Byrn, who ran unsuccessfully for theAbilene Independent School District Board of Trustees in 2012, as his campaign director.]", "Date": "20150812", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Open-carry-activist-announces-run-for-Austin-San-6440523.php", "Title": "[Open carry activist announces run for state senate]"}