{"Content": "[Caption, Close, Hillary Clinton and Donald Trump are about even in a poll of registered voters, but she is significantly ahead in a poll of all American adults. Around breakfast tables and office coffee pots this weekend, people are handicapping the presidential candidates chances based on Thursday nights Republican debate. While no clear winners or losers emerged from the pack of candidates, there were winners and losers in any case. The winners included all the millions of viewers who tuned in to see how the candidates handled themselves under pressure and thought on their feet, skills we all want our next president to have. Among the losers were those viewers who formed public policy opinions based on the sound-bite answers compelled by the debate time line. The debate format requires people to compete for the most memorable phrase and discourages any discussion of solutions to complex problems. It allowed the candidates to audition for who could make statements like \"life begins at conception\" with the most passion but left citizens wondering about issues such as how each candidate would go about balancing the federal budget. Viewers should not get their facts from debates. Perhaps the most glaring example of this need to gloss over complexities occurred in the area of foreign policy. A viewer taking the candidates bluster at face-value would think that a U.S. president could face other nations and renegade groups and simply bend them to their will. History has proven otherwise. Among the winners was Fox News. While no primary debate commands a Super Bowl-sized audience, Republican activists and political junkies throughout the nation and the world were glued to their TV screens and computers last night for what was clearly the starting gun in the race for president 15 months from now. Democrats who tuned in to observe any \"Whoops!\" moment might believe that the spotlight on Republican infighting made their party the winner. But Democrats who exult should realize that the debate gave 10 citizens a shot to bash the Obama presidency and the Democratic frontrunner before a national television audience.  , The 6 million Facebook users who viewed Foxs debate videos and the 40,000 people who submitted questions using social media were winners with their thoughtful questions and their participation. The city of Houston took a hit. One-minute answers put a premium on imagery rather than substance. Houston might have been used as an example of how people from different backgrounds and different political ideologies can form a vibrant community and lead the nation in job growth. Instead, Kentucky Sen. Rand Paul highlighted the ill-conceived subpoena of pastors in the litigation concerning the HERO ordinance. So our vibrant city was reduced to a single, misguided action by a public official. Winners on style points may have included \"television personality,\" Arkansas Gov. Mike Huckabee. This candidates polished approach stood in sharp contrast to candidates such as Ohio Gov. Tim Kasich,  who has spent decades as an accomplished work-a-day government official. Speaking of winners and losers, Donald Trump divides the world into them, and made the claim that the worlds greatest nation is losing and that our nation will only be great again if we elect him as president. But Trump showed himself as a loser when he tried to deflect his misogynist attitude as a rejection of political correctness. While political campaigns are often compared to a horse race, effective governance is more than a game. Debates are one tool to test a few skills necessary for a president to effectively govern. Our nation will be the winner if viewers understand the pitfalls and virtues of debates and vote on substance over style in 2016.]", "Date": "20150807", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Substance-over-style-6431867.php", "Title": "[Substance over style]"}