{"Content": "[CHARLESTON, W.Va. (AP)  Former President Bill Clinton is returning to West Virginia to headline the biggest annual dinner for the states Democrats. The West Virginia Democratic Party announced Friday that Clinton will headline the Jefferson-Jackson Dinner at the Charleston Civic Center, his third appearance at the event. A popular figure in West Virginia, Clinton was the last Democrat to win West Virginia in a presidential race in 1996. He received 51.5 percent of the general election vote. Clinton served as the 42nd president from 1993 to 2001 after leading Arkansas as governor from 1983 to 1992. \"President Clinton has a great relationship with the people of West Virginia and we are more than excited that he will be joining us this year,\" said Belinda Biafore, state party chairwoman. Clintons wife, Hillary Clinton, is making a second Democratic bid at president in 2016. She carried West Virginia in the 2008 Democratic primary, but ultimately lost to President Barack Obama. Clinton last spoke at the Jefferson-Jackson Dinner in West Virginia in 2007 during his wifes first run at the Democratic presidential nomination. He also was the top speaker at the 1988 dinner while still governor of Arkansas. In a state that historically sided with their party, West Virginia Democrats lost a lot of ground in the 2014 election. This year, they yielded control of the state Legislature to Republicans for the first time in more than eight decades. Sen. Joe Manchin remains the lone Democrat in Congress from West Virginia. In the upcoming presidential election year, six partisan statewide offices will be on West Virginias ballot: governor, secretary of state, treasurer, auditor, agriculture commissioner and attorney general. Democrats currently fill all of those seats, except for Republican Attorney General Patrick Morrisey.  Charleston Democratic attorney David Higgins is challenging him. Senate President Bill Cole is the GOPs lead candidate in a high-profile, open governors race. Billionaire Jim Justice and Senate Minority Leader Jeff Kessler are running on the Democratic side. Democratic Gov. Earl Ray Tomblin is reaching his limit of two consecutive terms. Republicans continue to roll out opponents for statewide Democratic incumbents.]", "Date": "20150918", "Author": "[Jonathan Mattise, Associated Press]", "Link": "http://www.chron.com/news/article/Bill-Clinton-to-headline-annual-West-Virginia-6513774.php", "Title": "[Bill Clinton to headline annual West Virginia Dems dinner]"}