{"Content": "[Caption, Close, Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX.  , , Marty McVey:A businessman, McVey has no prior political experience, Oliver Pennington: The Republican city councilman, pictured on the right, began his campaign earlier than all other candidates, sending mailers to potential supporters in July. The race to succeed Mayor Annise Parker is on track to be the most expensive in the citys recent history. See people looking to replace Annise Parker in City Hall. Former Harris County Sheriff Adrian Garcia closed out the first half of the year with more than $1.3 million in the bank, eclipsing City Councilman Stephen Costello by a mere $7,423. According to their campaign finance reports, Garcia raised $1.5 million and spent just over $122,000, while Costello raised about $30,000 less in contributions, was loaned $90,000 and spent $496,000. State Rep. Sylvester Turner and former mayor of Kemah Bill King trailed in cash on hand, reporting $1.1 million and $544,000, respectively. As of Wednesday afternoon, campaign finance reports for the remainder of the mayoral field still were trickling in. Last week, the Chronicle reported that Houstons mayoral field took in more than $7 million in the first half of the year, putting this years race on track to be the most expensivein recent city history. The campaign finance reports due Wednesday promise a glimpse into these fundraising operations, detailing where that money came from, how the candidates have spent it and what will be left over for the four months leading up to election day in November. Costellos campaign previously said his funds include a $250,000 personal contribution and a $262,000 transfer from his council account. Among those with reports already in, King spent the most in the first half of the year, coughing up more than $680,000. He raised more than $755,000 and lent himself an additional $500,000. Turners expenditures came in just under Kings, at $601,000, according to his report. However, his campaign noted that $125,000 of those expenditures were related to his state office, not his mayoral campaign. After starting the race with about $900,000 in the bank from his legislative account, Turner raised an additional $763,000 in the nine days between when his state fundraising blackout period ended and the close of the reporting period. So far, mayoral fundraising has far overshadowed that for Houstons second-highest political post, city controller. Deputy controller Chris Brown reported raising $270,000 and spending $22,000, leaving him with more than $222,000 in cash on hand. Meanwhile, Bill Frazer, runner-up in the 2013 controllers race, raised $129,000, received $32,000 in loans, spent $120,000 and closed out the first half of the year with more than $53,000 in the bank. Former Metro board member Dwight Jefferson lagged behind with $11,000 raised $1,800 loaned and $9,000 spent. It was unclear how much cash he had on hand. On the campaign side, Wednesday promises to be more of a scramble than usual, as the citys filing database is currently down pending updates to comply with new Texas Ethics Commission requirements. Parker informed campaigns last Thursday that they would have to submit hard copies. The combination of a new format and late notice means it is likely many campaigns will be turning in their reports at the last minute.]", "Date": "20150715", "Author": "[Rebecca Elliott]", "Link": "http://www.chron.com/politics/election/national/article/Houston-Jul5-fundraising-reports-6386099.php", "Title": "[Costello, Garcia sitting on $1.3M warchests]"}