{"Content": "[Caption, Close, FILE- In this July 29, 2015, file photo, Republican presidential candidate, Sen. Ted Cruz, R-Texas, questions Internal Revenue Service (IRS) Commissioner John Koskinen on Capitol Hill in Washington. A super PAC aiming to help Cruz win the Republican presidential nomination raised from a single donor nearly as much as the candidates formal campaign raised in three months. FILE - In this April 3, 2015, file photo, Ready for Hillary apparel and accessories are packed up at the Ready for Hillary super PAC store in Arlington, Va. Democrats running for presidents super PAC filings account for less than 9 percent of the total super PAC haul so far, according to an Associated Press analysis that compared money raised by formal presidential campaigns with what the super PACs say they plan to report having raised on Friday, July 31, 2015. WASHINGTON (AP)  Nearly all of the contenders for president are encouraging their deep-pocketed donors to give not just to their campaigns, but to groups known as super PACs as well. Unlike campaigns, these outside groups arent limited in how much money they can accept from individual donors. While they cant directly take orders from the candidates theyre spending money to help elect, they still account for about $2 of every $3 raised so far in the 2016 race for president. Many super PACs must file their first fundraising reports with federal regulators by midnight Friday. The super PAC filings will detail how money was raised and spent from January to the end of June and include the names of donors. Two weeks ago, many of the candidates filed their first campaign fundraising reports. Together, the reports from the super PACs and the candidates will produce the first major accounting of who is paying for the campaign for president. Here is a guide to whats already known about the presidential super PACs, based on information provided by the groups and their official filings with the Federal Election Commission. ", "Date": "20150805", "Author": "[Julie Bykowicz, Associated Press]", "Link": "http://www.chron.com/news/texas/article/News-Guide-Super-PACs-land-wealthy-donors-to-6416756.php", "Title": "[News Guide: Super PAC backing Cruz gets $10 million donation]"}