{"Content": "[Caption, Close, In this Aug. 17, 2015 photo, Republican presidential candidate Sen. Rand Paul, R-Ky. speaks during an interview before participating in a cataract surgery clinic in Cap-Haitien, Haiti. An ophthalmologist by training, Paul left Haiti on Wednesday afternoon after spending four days on a humanitarian mission to the island nation. In this Aug. 17, 2015 photo, Republican presidential candidate Sen. Rand Paul, R-Ky. gets ready to perform cataract surgery in Cap-Haitien, Haiti, as part of a humanitarian mission to the island nation. Paul participated in a similar mission with the same group last summer in Guatemala.( AP Photo/Dieu Nalio Chery), In this Aug. 18, 2015 photo, Republican presidential candidate Sen. Rand Paul, R-Ky. examines the eyes of Natanaelle Jean Louis, 9, during a cataract surgery clinic in Cap-Haitien, Haiti. While the trip was not technically part of Pauls presidential campaign, he invited a small number of political journalists and at least one prominent donor to join him this week. In this Aug. 17, 2015 photo, Claudio Jacques Joseph, 85, is reflected in a mirror as he waits with other patients for cataract surgery in Cap-Haitien, Haiti, at which Republican presidential contender Rand Paul is volunteering. The clinic was organized by the University of Utahs Moran Eye Center, an institution that organizes regular missions to combat curable blindness in developing nations around the world. In this Aug. 17, 2015 photo, Republican presidential candidate Sen. Rand Paul, R-Ky. right, walks outside the clinic where hes performing cataract surgeries in Cap-Haitien, Haiti. Paul joined six eye surgeons who restored vision to dozens of impoverished Haitians, many living for years in blindness because of ailments such as cataracts that are easily treated in the United States. CAP-HAITIEN, Haiti (AP)  Even while fighting blindness in the poorest nation in the Western Hemisphere this week, Republican presidential contender Rand Paul intensified political attacks against rivals in both parties, vowing to continue pressing billionaire businessman Donald Trump in particular as the Kentucky senator embraces the role as the GOPs leading pit bull. An ophthalmologist by training, Paul left Haiti on Wednesday afternoon after spending four days here on a humanitarian mission. From a small urban clinic guarded by a team of armed police, Paul joined six eye surgeons who restored vision to dozens of impoverished Haitians, many living for years in blindness because of ailments such as cataracts that are easily treated in the United States. The trip offered the tea party firebrand a brief respite from a presidential campaign in which his standing has slipped substantially in recent weeks. Yet the 2016 election  especially Trump  was a regular topic of conversation when Paul wasnt in the operating room. \"His candidacy is an insult to the intellectual movement that has called for small government for decades,\" said Paul, wearing operating room scrubs, in an interview with The Associated Press shortly before returning to surgery Tuesday morning. He described the reality TV stars candidacy as \"buffoonery\" and promised to continue leading the anti-Trump charge \"until he fades away.\", This weeks Haiti trip was organized by the University of Utahs Moran Eye Center, an institution that organizes regular missions to combat \"curable blindness\" in developing nations around the world. Paul participated in a similar mission with the same group last summer in Guatemala. While the trip was not technically part of Pauls presidential campaign, he invited a small number of political journalists and at least one prominent donor to join him. Due to security concerns, his team asked that reporting of the trip be restricted until Paul left the country. His team helped raise at least $70,000 for the eye center before the trip. One of the benefactors was Trump himself, who donated $10,000 to the university at Pauls request roughly two months ago. That was shortly before Paul began aggressively challenging Trumps conservative credentials. \"No one is pure evil,\" Paul said of Trump when asked about his contribution. \"He has some redeeming qualities.\", Paul arrived in Haiti on Sunday aboard the private jet of Republican donor Gary Heavin, the Texas-based founder of the Curves fitness center franchise. He and his wife were at Pauls side for much of the week. Heavin, who has been active in Haitian charity work since a 2010 earthquake devastated the capital city, said hes yet to decide whether to support Paul formally, but hes already ruled out the other candidates. \"If I support anyone in the Republican Party, its him,\" Heavin said in an interview on a bustling street outside the eye clinic. He said he has the capacity to donate more than $10 million and would back Paul if Heavin is \"confident in his ability to influence the process.\", Paul, meanwhile, is betting that he can influence the process best by being aggressive. He condemned Democratic presidential candidate Hillary Rodham Clinton, whose family foundation has raised more than $30 million for Haiti since the 2010 earthquake. \"To me the most disgusting thing about the Clinton foundation is almost none of their money went to charity,\" Paul said, suggesting that only 6 percent of the Clinton Global Initiatives revenue went to charitable grants. A spokesman for the organization didnt respond to a request for comment. The group previously said grants make up only a small fraction of its charitable work, which is largely handled by staff. Asked about Wisconsin Gov. Scott Walkers recent criticism of Washington-based Republicans, Paul charged, \"Part of problem we have is career politicians like Scott Walker.\", \"Has he ever had a job outside of politics?\" Paul went on. \"He was running for office when he was in college. Im not going to be lectured by a career politician, thats for sure.\", And on Chris Christie, Paul said that the New Jersey governor exaggerated his role in the response to the 9/11 terrorist attacks during the recent GOP debate. \"People wrap themselves in tragedy so they dont have to argue the point,\" Paul said. Paul said he had little choice but to go on the attack to stand out in the crowded race. \"Right now, people are choosing theatrics over substance,\" he said. \"And so, you just have to compete in the arena the way the arena is arranged.\"]", "Date": "20150823", "Author": "[Steve Peoples, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Rand-Paul-a-humanitarian-in-Haiti-a-pit-bull-in-6454659.php", "Title": "[Rand Paul: a humanitarian in Haiti, a pit bull in 2016 race]"}