{"Content": "[Caption, Close, Republican presidential candidates from left, Chris Christie, Marco Rubio, Ben Carson, Scott Walker, Donald Trump, Jeb Bush, Mike Huckabee, Ted Cruz, Rand Paul, and John Kasich take the stage for the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Walker, Trump and Jeb Bush, Wisconsin Gov. Scott Walker and Donald Trump, Republican presidential candidate New Jersey Gov. Chris Christie, Republican presidential candidate former Florida Gov. Jeb Bush, Republican presidential candidate Ohio Gov. John Kasich, Republican presidential candidate Ben Carson, Republican presidential candidate Wisconsin Gov. Scott Walker speaks as Donald Trump listens. Republican presidential candidate Sen. Ted Cruz, Republican presidential candidate New Jersey Gov. Chris Christie, Republican presidential candidate Donald Trump answers a question. Arkansas Gov. Mike Huckabee, left, and Ted Cruz, Republican presidential candidate Sen. Rand Paul, Walker, Trump and Bush take the stage. Republican presidential candidates take the stage. Walker and Trump, Trump, Kasich, center, says hello to the daughters of Sen. Ted Cruz, R-Texas, right, Catherine, 4, second from right, and Caroline, 7. Republican presidential candidates, from left, Marco Rubio, Jeb Bush and Ben Carson talk during a break. Republican presidential candidates Louisiana Gov. Bobby Jindal, left, and former Texas Gov. Rick Perry speak on stage during a commercial break during a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015,  in Cleveland. Republican presidential candidate businesswoman Carly Fiorina stands on stage for a pre-debate forum. Republican presidential candidate Lindsey Graham speaks during a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015, in Cleveland. Seven of the candidates have not qualified for the primetime debate. Audience members watch Republican presidential candidates Jim Gilmore, Lindsey Graham, Bobby Jindal, Rick Perry, Rick Santorum, Carly Fiorina, and George Pataki as they participate in a FOX News Channel pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015,  in Cleveland. Seven of the candidates have not qualified for the primetime debate. CLEVELAND, OH - AUGUST 06:  Republican presidential candidates Rick Santorum (L) and Carly Fiorina talk during a commercial break during a presidential pre-debate forum hosted by FOX News and Facebook at the Quicken Loans Arena August 6, 2015 in Cleveland, Ohio. Fiorina and six other GOP candidates were selected to participate in the forum based on their rank in an average of the five most recent national political polls.  (Photo by Chip Somodevilla/Getty Images), CLEVELAND, OH - AUGUST 06:  Rebulican presidential candidate Louisiana Gov. Bobby Jindal fields a question during a presidential forum hosted by FOX News and Facebook at the Quicken Loans Arena August 6, 2015 in Cleveland, OH. Seven GOP candidates were selected to participate in the forum based on their rank in an average of the five most recent national political polls. The top ten polling Republican candidates will participate in a debate following the forum.  (Photo by Scott Olson/Getty Images), CLEVELAND, OH - AUGUST 06:  Rebulican presidential candidate Rick Perry fields a question during a presidential forum hosted by FOX News and Facebook at the Quicken Loans Arena August 6, 2015 in Cleveland, OH. Seven GOP candidates were selected to participate in the forum based on their rank in an average of the five most recent national political polls. The top ten polling Republican candidates will participate in a debate following the forum.  (Photo by Scott Olson/Getty Images), Supporters of Liberal leader Justin Trudeau shout slogans as other leaders arrive for the first federal leaders debate of the 2015 Canadian election campaign  on August 6, 2015 in Toronto, Canada. The federal election is set for October 19, 2015.  AFP/ GEOFF ROBINSGEOFF ROBINS/AFP/Getty Images, Bob Kunst of Miami Beach, Fla. wears a Hillary Rodham Clinton mask and holds an anti-Hillary poster outside the Quicken Loans Arena in Cleveland, Wednesday, Aug. 5, 2015, before Thursdays first Republican presidential debate being held at the arena. GOP presidential candidate Rand Paul brought the fight over Houstons equal rights ordinance to the national stage on Thursday night. At the first Republican debate, in Cleveland, the senator from Kentucky called out Mayor Annise Parker, though not by name. RELATED: Rick Perry refers to Reagan as \"Ronald Raven\", Last year, the city tried to subpoena sermons from local pastors fighting the embattled measure. At the debate, Paul, stealing a past Ted Cruz talking point, brought up Houston and the controversial move by city attorneys. The ordinance bans discrimination based not just on sexual orientation and gender identity  the flash points for opponents  but also, as federal laws do, sex, race, color, ethnicity, national origin, age, religion, disability, pregnancy and genetic information, as well as family, marital or military status. READ MORE: City subpoenas pastors sermons in equal rights ordinance case, \"... One of the things that really got to me was the thing in Houston where you had the government, the mayor actually, trying to get the sermons of ministers. When the government tries to invade the church to enforce its own opinion on marriage, thats when its time to resist.\", On Monday, HERO opponents announced they sued the mayor over the sermon subpoenas and unspecified legal fees. The Texas Supreme Court ruled told the Houston City Council that the ordinance must be repealed or placed on the November ballot. The council agreed to put the HERO on the ballot earlier this week. ]", "Date": "20150807", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Rand-Paul-calls-out-City-of-Houston-over-HERO-act-6430326.php", "Title": "[Rand Paul calls out Houston Mayor Annise Parker over HERO controversy]"}