{"Content": "[Wisconsin Gov. Scott Walker (R) just took a major step towards a presidential bid by launching a new fundraising committee. According to The Washington Post, Walker filed paperwork to create \"Our American Revival,\" the committee, and will be setting up a campaign website Tuesday. \"Our American Revival encompasses the shared values that make our country great; limiting the powers of the federal government to those defined in the Constitution while creating a leaner, more efficient, more effective and more accountable government to the American people,\" Walker said in a statement announcing the committee. The new leadership committee will allow Walker to raise his own profile in advance of a potential White House bid. Notably it will by let him raise funds for national travel, staff members, and contributions to influential candidates in key primary states like Iowa and New Hampshire.Several other top 2016 contenders, including former Florida Gov. Jeb Bush (R) and New Jersey Gov. Chris Christie (R), have launched similar organizations in recent weeks. The news of Walkers committee comes just days after he had a \"breakthrough moment\"in a widely heralded speech before Iowa conservatives. In the speech, Walker recalled his high-profile battles with public sector unions and managed to stand out despite the large number of speeches from other potential GOP presidential candidates. However, Walker could face uphill odds should he pull the trigger and launch a presidential campaign. Several other potential hopefuls, like Bush and 2012 nominee Mitt Romney, have far greater name recognition. Others like Sens. Rand Paul (R-Kentucky) and Ted Cruz (R-Texas) have particularly passionate fan bases. Join the conversation about this story , See Also:]", "Date": "20150127", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/Wisconsin-s-Governor-Is-Joining-The-2016-Fray-6043714.php", "Title": "[Wisconsin's Governor Is Joining The 2016 Fray]"}