{"Content": "[LITTLE ROCK, Ark. (AP)  Former federal prosecutor Conner Eldridge said Monday hes considering challenging Republican U.S. Sen. John Boozman in Arkansas next year and plans to make a decision in the coming weeks. Eldridge, who left office Friday as the U.S. attorney for western Arkansas, didnt offer a specific date by when hed decide whether to seek the Democratic Senate nomination against Boozman, a first-term senator elected in 2010. \"I do know that I always want to be a part of making a difference for Arkansas,\" Eldridge said in a prepared statement. \"I intend to take some time to figure out how I can best continue to serve the state and that includes looking at running for the United States Senate in 2016.\", Eldridge, 37, declined to comment beyond the prepared statement. His announcement earlier this month that he was resigning as U.S. attorney came amid speculation about the Senate race  but until Monday he repeatedly declined to say whether he was considering it. The one-week filing period for state and federal office in Arkansas begins Nov. 2. If he runs, Eldridge faces a difficult fight. Republicans have swept statewide and federal offices in recent Arkansas elections by tying Democrats to President Barack Obama, who remains deeply unpopular in the state. Boozman defeated two-term Democratic U.S. Sen. Blanche Lincoln in 2010, and announced last year that he planned to run for re-election. He reported having more than $872,000 in the bank for his re-election bid last month. Boozman spokesman Patrick Creamer declined to comment, pointing to a statement the campaign made earlier this month that the senator was focused on his job and not speculation about a potential challenger. The only Democrat who had been in Arkansas congressional delegation, Mark Pryor, was defeated in his Senate re-election bid in November by Republican Tom Cotton in a race that drew millions of dollars in campaign ads to the state. Eldridge was nominated by Obama to be the districts U.S. attorney in September 2010 and confirmed later that year. He was an aide to Lincoln and former U.S. Rep. Marion Berry, and clerked for U.S. District Judge Thomas Eisele. He is the former chief executive for Summit Bank. ", "Date": "20150824", "Author": "[Andrew Demillo, Associated Press]", "Link": "http://www.chron.com/news/article/Eldridge-says-he-s-looking-at-US-Senate-race-in-6462522.php", "Title": "[Eldridge says he's looking at US Senate race in Arkansas]"}