{"Content": "[Texas Gov. Rick Perry (R) believes the jihadist group the Islamic State of Iraq and Syria (ISIS or ISIL) may have already sent militants across the U.S.-Mexican border. Perry was directly asked about this prospect Thursday afternoon after he gave a border-security speech at the Heritage Foundation, a conservative think tank. Perry, a potential 2016 presidential candidate who spent much of the speech castigating ISIS after the group brutallyexecuted an American journalist earlier this week, said there was \"a very real\" risk they were already inside the U.S. \"Theres the obvious great concern that because of the condition of the border from the standpoint of it not being secure and us not knowing who is penetrating across, that individuals from ISIS or other terrorist states could be [crossing the border]  and I think there is a very real possibility that they may have already used that,\" he said. One reason it wouldnt be surprising for ISIS to use the U.S. border as an entry point, Perry said, was the \"historic\" level of individuals crossing the border from \"from countries with terrorist ties.\" He cited migrants from Ukraine  which, as PolitiFact has previously noted, \"is not a country with strong terrorist ties\"  to make his point. \"There is I think great concern that the border between the United States and Mexico is insecure. And we dont know whos using that. What I will share with you [is] that weve seen historic high levels of individuals from countries with terrorist ties over the course of the last months. Ill give you one anecdotal picture of whats happening: Three Ukrainian individuals were apprehended in a ranch in far west Texas within the last 60 days,\" Perry said. Perry noted, however, there is no \"clear\" evidence yet that ISIS, which is based in Syria and Iraq, has actually crossed the U.S. border. \"We have no clear evidence of that but your common sense tells you when weve seen the number of criminal activities that have occurred  and Im talking about the assaults, the rapes, the murders  by individuals who have come into this country illegally over the last five years, the idea that they would not be looking at [the border] ... is not a good place to be,\" he said. Perry was indicted last Friday on charges of abusing his office, and the Heritage event represents just the latest public act hes taken to continue building his national profile despite the allegations, Join the conversation about this story , See Also:]", "Date": "20140821", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/RICK-PERRY-There-Is-A-Very-Real-Possibility-5703777.php", "Title": "[RICK PERRY: There Is 'A Very Real Possibility' ISIS Forces Have Crossed US-Mexican Border]"}