{"Content": "[Caption, Close, Republican presidential candidate former Florida Gov. Jeb Bush a speaks to employees at Foss Manufacturing during campaign stop Thursday, Sept. 3, 2015, in Hampton. N.H. Republican presidential candidate former Florida Gov. Jeb Bush arrives to speak with workers at Foss Manufacturing during a campaign stop Thursday, Sept. 3, 2015, in Hampton, N.H. Republican presidential candidate former Florida Gov. Jeb Bush a speaks to employees at Foss Manufacturing during campaign stop Thursday, Sept. 3, 2015, in Hampton, N.H, Bush says Donald Trump is \"too pessimistic,\" and that picking the businessman as the Republican presidential nominee would lead the party to defeat on Election Day. Republican presidential candidate former Florida Gov. Jeb Bush a meets with employees at Foss Manufacturing during a campaign stop Thursday, Sept. 3, 2015, in Hampton, N.H, Bush says Donald Trump is \"too pessimistic,\" and that picking the businessman as the Republican presidential nominee would lead the party to defeat on Election Day. Republican presidential candidate former Florida Gov. Jeb Bush a speaks to employees at Foss Manufacturing during campaign stop Thursday, Sept. 3, 2015, in Hampton, N.H, Bush says Donald Trump is \"too pessimistic,\" and that picking the businessman as the Republican presidential nominee would lead the party to defeat on Election Day. HAMPTON, N.H. (AP)  Republican presidential contender Jeb Bush says rival Donald Trump is \"too pessimistic\" to lead the country and that Republicans will lose the 2016 election if they make the billionaire their candidate for the White House. Campaigning in New Hampshire on Thursday, Bush acknowledged that Trump has tapped into anger among voters, especially Republicans. \"Im frustrated,\" Bush told more than 100 employees at a factory on the states seacoast.  \"Were on the verge of the greatest time to be alive, and there is one candidate in the Republican Party who is preying on peoples angst and fears.\", Bush said: \"Donald Trumps view is the end is near.\", The two have been intensifying their fight over the direction of the Republican Party, and making it personal. After being ridiculed by Trump as dull, low energy and beholden to his vast network of donors, Bush turned on him this week. His campaign released an online video showing statements Trump has made over the years endorsing higher taxes, a single-payer health care system such as Canadas, abortion rights and more. And Bush has sharpened his own rhetoric against Trump. \"What youll find is this guy is not a conservative,\" Bush said later in Laconia, where he spoke to more than 200 at the local VFW. Messages left seeking comment from Trumps campaign were not returned. Earlier Thursday, Bush told ABCs \"Good Morning America\" that Trump was trying to \"insult his way\" to the presidency. That was in response to Trumps remark that Bush should stick to English when hes in the U.S. The bilingual Bush often drops Spanish into his campaign speeches. He did so again in New Hampshire when he urged Republicans to campaign with \"brazos abiertos,\" or open arms. Bush filmed an advertisement at the plant before heading to Laconia.]", "Date": "20150905", "Author": "[Thomas Beaumont, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Bush-Trump-too-pessimistic-will-lead-GOP-to-6483254.php", "Title": "[Bush: Trump 'too pessimistic,' will lead GOP to defeat]"}