{"Content": "[Caption, Close, Northwestern football player Matt Alvita throws during practice at the University of Wisconsin-Parkside campus on Monday, Aug. 17, 2015, in Kenosha, Wi. The National Labor Relations Board on Monday overturned a historic ruling that gave Northwestern University football players the go-ahead to form the nations first college athletes union, saying the prospect of union and non-union teams could throw off the competitive balance in college football. FILE - In this April 25, 2014, file photo, former Northwestern University football player Michael Odom talks to reporters as his former teammates vote on the student athlete union question in Evanston, Ill. The National Labor Relations Board has dismissed a historic ruling that Northwestern University football players are school employees who are entitled to form what would be the nations first union of college athletes. The NLRB released its decision Monday, Aug. 17, 2015. The losing side does not have an option to appeal. FILE - In this April 6, 2014, file photo, NCAA President Mark Emmert answers a question at a news conference in Arlington, Texas. The National Labor Relations Board has dismissed a historic ruling that Northwestern University football players are school employees who are entitled to form what would be the nations first union of college athletes. The NLRB released its decision Monday, Aug. 17, 2015. The losing side does not have an option to appeal. Northwestern football players gather during practice at the University of Wisconsin-Parkside campus on Monday, Aug. 17, 2015, in Kenosha, Wi. The National Labor Relations Board on Monday, Aug. 17, 2015, overturned a historic ruling that gave Northwestern University football players the go-ahead to form the nations first college athletes union, saying the prospect of union and non-union teams could throw off the competitive balance in college football. Northwestern football players are reflected in a helmet during drills at practice at the University of Wisconsin-Parkside campus on Monday, Aug. 17, 2015, in Kenosha, Wi. The National Labor Relations Board on Monday, Aug. 17, 2015, overturned a historic ruling that gave Northwestern University football players the go-ahead to form the nations first college athletes union, saying the prospect of union and non-union teams could throw off the competitive balance in college football. SOUTH BEND, Ind. (AP)  With or without a union, more rights and benefits are coming for college athletes. Whether the NCAA schools that compete in big-time athletics can provide enough to keep at bay more ominous threats to college sports remains to be seen. Even the failed attempt to unionize the Northwestern University football players could be viewed as progress for those still pushing reform. \"I certainly dont think this is the end of this type of discussion,\" said David Ridpath, a professor of sports administration at Ohio University and president-elect of the Drake Group, a watchdog group for college sports. \"And certainly regardless of what happens, this has energized the athletes rights movement for years to come.\", The National Labor Relations Board on Monday blocked a historic bid by Northwestern football players to form the nations first college athletes union. In a unanimous decision, the board said the prospect of union and nonunion teams in college could lead to different standards at schools  from how much money players receive to how much time they practice  and create competitive imbalances on the field. The new ruling annuls a 2014 decision by a regional NLRB director in Chicago who said scholarship football players are employees under U.S. law and thus entitled to organize. But Mondays decision did not directly address the question of whether the players are employees, which allowed the organizers of the movement to claim it was only a setback and not a total defeat. \"The doors not closed,\" said Ramogi Huma, a former UCLA football player and executive director of the advocacy group, the National College Players Association. In explaining its ruling, the board said the biggest factor was the NLRBs jurisdiction, which extends only to private schools such as Northwestern and Notre Dame. The board repeatedly cited the need for standardized rules and policies in sports. Collective bargaining rights for one team would disrupt that uniformity. Public universities are subject to state labor laws. Huma and former Northwestern quarterback Kain Colter, who became the face of the union movement, said the bid to unionize helped advance NCAA reforms such as extended long-term health coverage for athletes, guaranteed four-year scholarships and the removal of restrictions on meals for athletes. Starting this school year, universities can begin paying stipends worth several thousands of dollars to college athletes to cover cost-of-attendance expenses beyond tuition, books and room and board. Many in college sports have been pushing these reforms for years. \"Some of the changes that have been adopted were items that were on the Southeastern Conference agenda before the unionization effort was identified,\" SEC Commissioner Greg Sankey told The Associated Press by phone. \"But certainly as weve dealt with the external issues, the litigation and this, its increased awareness to the extent there is an interest or desire in sharing credit. OK, but were going to continue to focus on how we improve the support for our student-athletes. \"Thats really been our focus from the beginning of the conversation, probably going back to 2010 or so.\", Conference leaders have said they would like to decrease the time demands on athletes, give them more flexibility when making the decision to turn professional and provide more continuing education and health care. Some administrators have suggested that compensating athletes for the use of their names, images and likenesses would be reasonable. Notre Dame athletic director Jack Swarbrick told the AP he never felt unionization was a serious threat to college sports, especially compared to the legal challenges facing the NCAA and its member schools. \"Well never know, but I would have thought it likely that if the ballots were ever opened we would have found out the unionization effort probably failed,\" he said. Last years ruling against the NCAA in the Ed OBannon case, which would allow schools to pay athletes thousands of dollars for the use of their likenesses, is in the process of being appealed. Another case working its way through the court system challenges the rights of schools to cap compensation at the cost of a scholarship. The NCAA and individual member schools are facing numerous lawsuits by former college athletes over treatment of concussions. There is also the possibility of congressional intervention in college sports. Oklahoma offensive lineman Ty Darlington, who was part of a new student delegation that voted on NCAA legislation at the last convention, said he doesnt believe the majority of athletes want to unionize  but that wont stop reform. \"I feel like we need to work within the system that we have to get the changes accomplished that we need to get accomplished,\" he said. ", "Date": "20150819", "Author": "[Ralph D. Russo, Ap College Football Writer]", "Link": "http://www.chron.com/news/article/Failed-union-bid-won-t-stop-reforms-in-college-6449988.php", "Title": "[Failed union bid won't stop reforms in college athletics]"}