{"Content": "[Caption, Close, Republican presidential candidate, Sen. Rand Paul, R-Ky. addresses the 2016 Mackinac Republican Leadership Conference, Saturday, Sept. 19, 2015, in Mackinac Island, Mich. Republican presidential candidate, Sen. Ted Cruz, R-Texas, arrives at the Iowa Faith & Freedom Coalitions annual fall dinner, Saturday, Sept. 19, 2015, in Des Moines, Iowa. Republican presidential candidate, businessman Donald Trump speaks during a rally at Urbandale High School, Saturday, Sept. 19, 2015, in Urbandale, Iowa. Republican presidential candidate, businesswoman Carly Fiorina addresses the 2016 Mackinac Republican Leadership Conference, Saturday, Sept. 19, 2015, in Mackinac Island, Mich. Republican presidential candidate, businessman Donald Trump holds up a photo of his confirmation class as he speaks during the Iowa Faith & Freedom Coalitions annual fall dinner, Saturday, Sept. 19, 2015, in Des Moines, Iowa. Republican presidential candidate, former Pennsylvania Sen. Rick Santorum speaks during the Iowa Faith & Freedom Coalitions annual fall dinner, Saturday, Sept. 19, 2015, in Des Moines, Iowa. Republican presidential candidate and former Florida Gov. Jeb Bush speaks to a crowd of football fans during a tailgate party before an NCAA college game between Georgia and South Carolina on Saturday, Sept. 19, 2015, in Athens, Ga. Republican presidential candidate, Ohio Gov. John Kasich greets supporters during a reception at the 2016 Mackinac Republican Leadership Conference, Saturday, Sept. 19, 2015, in Mackinac Island, Mich. Supporters cheer as Democratic presidential candidate Sen. Bernie Sanders, I-Vt, speaks during the states annual Democratic convention Saturday, Sept. 19, 2015, in Manchester, N.H. Republican presidential candidate, Ohio Gov. John Kasich addresses supporters during a reception at the 2016 Mackinac Republican Leadership Conference, Saturday, Sept. 19, 2015, in Mackinac Island, Mich. Supporters cheer as Democratic presidential candidate Hillary Rodham Clinton speaks during the states annual Democratic convention Saturday, Sept. 19, 2015, in Manchester, N.H. Republican presidential candidate Wisconsin Gov. Scott Walker speaks at a presidential forum sponsored by Heritage Action at the Bon Secours Wellness Arena, Friday, Sept. 18, 2015, in Greenville, S.C. Republican presidential candidate Donald Trump speaks at a town hall event Thursday, Sept. 17, 2015, in Rochester, N.H. Audience members raise their hands during a question and answer session with Republican presidential candidate Donald Trump at a town hall event Thursday, Sept. 17, 2015, in Rochester, N.H. Democratic presidential candidate Hillary Rodham Clinton is greeted by supporters after speaking at the states annual Democratic convention Saturday, Sept. 19, 2015, in Manchester, N.H. The latest on the 2016 presidential campaign from Iowa, Michigan, New York, New Hampshire and Georgia (all times local). 11 p.m. Kentucky Sen. Rand Paul is the favored presidential candidate among Republicans attending a major political event in Michigan. Paul got the biggest percentage of votes cast, 22 percent, in the unscientific straw poll released Saturday night at the Mackinac Republican Leadership Conference. The survey was conducted by The Detroit News and MIRSnews.com. It is done mostly for fun and could be a weak predictor of candidate success in the March primary election. Of the 2,200 conference registrants, 785, or about one-third, participated in the straw poll. Former tech executive Carly Fiorina took 15 percent of votes cast, followed by Ohio Gov. John Kasich at nearly 14 percent, Texas Sen. Ted Cruz with 13 percent and former Florida Gov. Jeb Bush at nearly 10 percent. The top five vote-getters among the 16 candidates on the ballot are the five who attended the conference on picturesque Mackinac Island in northern Michigan. 9:30 p.m. Sen. Ted Cruz is drawing an enthusiastic response from the Christian conservative crowd in Iowa as he criticizes Republican congressional leaders. The Texas senator says the GOP leaders are not doing enough to defund Planned Parenthood and accuses them of \"trying to pound all of us into submission.\", Cruz says that if conservatives unite, the GOP primary will be over and that the Washington establishment wants to divide conservatives. Speaking about the crowded field of candidates, Cruz says voters should look for differences. He says theres a difference between campaign conservatives who talk a good game but havent walked the walk, and consistent conservatives who are the same yesterday and today. Cruz tells Iowans that, \"with me, you know what youre going to get.\", 8:30 p.m. Donald Trump says he would \"absolutely\" consider appointing a Muslim-American to his Cabinet if hes elected president. Trump is in Iowa taking questions from students at an appearance ahead of Urbandale High Schools homecoming dance after speaking at an Iowa Faith and Freedom Coalition presidential forum. The billionaire businessman is continuing to face scrutiny after he failed to correct a town hall questioner who incorrectly stated that President Barack Obama is Muslim. An audience member in Iowa tells Trump she considers Muslim-Americans to be an important asset for the country and asks whether he would consider appointing any to his Cabinet. He says, \"Absolutely. No problem.\", 8:10 p.m. Presidential candidate Carly Fiorina has taken a subtle dig at rival Donald Trump while explaining leadership to Michigan Republicans. She says that leadership isnt defined by position, title or the size of someones helicopter or \"ego.\" Shes delivered the line before. Republicans gathered on Mackinac Island were excited to hear from the lesser-known but buzzed-about Fiorina days after a strong debate performance. She says a leader \"challenges the status quo\" and \"we have been managing the decline of this great nation for far too long.\", Fiorina says as more people learn who she is, her support will grow. Other candidates at the Michigan conference include Jeb Bush, Ted Cruz, John Kasich and Rand Paul. 6:30 p.m. Republican presidential front-runner Donald Trump is continuing to defend his decision not to correct a questioner at a recent town hall event who incorrectly stated that President Barack Obama is Muslim  and argues that Sen. John McCains behavior was \"harsh\" in a similar situation. Speaking to more than 1,000 conservative Republicans at an event sponsored by the Iowa Faith and Freedom Coalition, Trump says that he is not obligated to defend the president and read a series of tweets he has written to defend his position. Trump argues that he would have faced criticism if he had jumped in. He recalls an incident during the 2008 campaign when Republican nominee John McCain took the microphone away from a woman who said she didnt trust Obama because he was an \"Arab.\", Trump says that McCain \"just ripped that microphone out of the womans hand\" and describes that as \"a little bit harsh.\", 6 p.m. Rick Santorum is asking Iowa Republicans to pledge their support once again for his presidential bid, casting himself as an outsider candidate with the \"skills of an insider\" to get things done in Washington. The former Pennsylvania senator spoke at the Iowa Faith and Freedom Coalition presidential forum, reminding audience members how they gave him a victory in the 2012 Iowa caucuses when he was at just 2 percent in the national polls. Santorum says that while in Congress he fought the tough issues on behalf of conservatives involving \"life, marriage, faith and religious freedom\" and wont hesitate to \"shake things up\" if elected to put \"this country back on the right track.\", 5:15 p.m. South Carolina Sen. Lindsey Graham says people are responding to his message about more drinking in the White House. The 2016 Republican presidential candidate has been mingling at an Iowa event for evangelical voters. He says that hes gotten positive feedback for his crack during the Wednesday undercard debate that if he becomes president, \"were going to drink more.\", Graham was noting that President Ronald Reagan and House Speaker Tip ONeill would share a drink in spite of their differences. Graham says that hes benefiting from showing a sense of humor on stage. He points out that Regan had a good sense of humor and that \"sometimes you can make your points better with humor that you can anything else.\", Asked about what he thinks of being seen as the funny candidate in the race, Graham quips, \"The bar is low.\", 4:40 p.m. Jeb Bush hopes to do well in the Republican primaries in both Georgia and South Carolina, so hes not about to offend football fans in either state. Bush spoke briefly and posed for hundreds of selfies on the University of Georgia campus before the Bulldogs hosted a Southeastern Conference game against the University of South Carolina. Asked who he was rooting for in the game, the former Florida governor declares that hes \"kind of neutral on the subject.\", The politically correct answer. But Bush predicted Georgia would win the SEC East and Louisiana State University would take the SECs Western Division. Bush says hes even \"got money on it. Five bucks I think.\",  Paul Newberry reporting from Athens, Georgia, 2:10 p.m. Ohio Gov. John Kasich says Latino workers are \"completely involved\" in all aspects of the U.S economy and not limited to certain segments. The presidential contender has come under criticism from Democrat Hillary Rodham Clinton for generalizing about Latinos after telling a story about a note left for him by a hotel maid that said she valued his stay. He told reporters Saturday at a Republican leadership conference on Mackinac (MAK-ih-naw) Island, Michigan, he was just trying to \"slow down and honor people who sometimes we run past very quickly.\", Kasich says hes a strong advocate \"for how Hispanics in this country can add so much in every profession.\", During remarks Thursday in California, Kasich talked about a Latina hotel maid and said \"a lot of them do jobs that theyre willing to do, and thats why in the hotel you leave a little tip.\" The president of the U.S. Hispanic Chamber of Commerce says he didnt find the comments offensive. 2:01 p.m. Vermont Sen. Bernie Sanders is energizing New Hampshire Democrats by calling for a \"political revolution\" and slamming the GOP field on climate change, gay marriage and foreign policy. Sanders is calling for an end to corporate greed and a need to take on the \"billionaire class,\" saying \"No president can do it alone unless we have a political revolution.\", He says Democrats lost the 2014 midterm elections because they failed to turn out voters. Sanders continues to surge in the early voting state, where he now leads Hillary Rodham Clinton in some polls. His speech during the state Democratic Partys annual convention in Manchester is drawing chants and raucous applause. Many of Clintons supporters who dotted the stands earlier in the day left before Sanders took the stage. 12:02 p.m. Hillary Rodham Clinton is taking aim at the Republican presidential field, saying the GOP debate this week featured not \"a single fighter for the middle class.\", Clinton has called viewers of the three-hour event \"gluttons for punishment\" and says Republicans are focusing on problems the country faces rather than solutions. Clinton says voters who want a leader to tell them \"everything thats wrong with America\" have \"plenty of other choices.\", She saved her toughest critique for front-runner Donald Trump. Clinton says Trump is \"trafficking in prejudice and paranoia\" and doesnt respect women. Those views, she says, are shared by the rest of the 15 person field. Clinton is addressing a convention of New Hampshire Democrats at the end of a three-day swing through the early primary state. 10:20 a.m. New Hampshire Democrats have a message for the Democratic National Committee: Bring on more debates. Activists chanting \"We want more debates!\" drowned out DNC Chairwoman Debbie Wasserman-Schultzs speech several times at the New Hampshire Democratic Partys convention in Manchester on Saturday morning. Wasserman-Schultz became noticeably frustrated on several occasions. She asked \"Whats more important? Drawing a contrast with Republicans or arguing about debates?\", In response, the chants continued. Finally, she said, \"Enough is enough.\", The DNC has sanctioned six debates, but supporters of Martin OMalley and Bernie Sanders are demanding more. They say the limited number of events is an effort to coronate a nominee. Front-runner Hillary Rodham Clintons campaign has said shes open to more debates, but has not called for more. 9:28 a.m. Republican presidential candidate Scott Walker is skipping a prestigious Michigan Republican conference this weekend, as he downshifts his campaign to focus on Iowa. Wisconsins governor was to address more than 1,000 people during breakfast Saturday morning at the Mackinac (MAK-ih-naw) Republican Leadership Conference on the picturesque island in northern Michigan. But Walkers campaign called at 5:45 a.m. Saturday to say he would be unable to attend. His campaign spokeswoman, AshLee Strong, said in an email that inclement weather in Chicago grounded Walkers flight. The Wisconsin governor was originally scheduled to kick off the event with former Florida Gov. Jeb Bush Friday evening. But he cancelled last week, saying he couldnt get from a Republican forum in South Carolina late Friday. Bush attended the same South Carolina forum and headlined the Mackinac Island dinner solo. Michigan holds its primary in March. Republicans view the state as in play for the general election. 7:45 a.m. Republican presidential front-runner Donald Trump is defending his decision not to correct a questioner at a recent town hall event who erroneously stated that President Barack Obama is Muslim. Obama is Christian. In a series of tweets from New York City Saturday morning, Trump said he didnt think he was \"morally obligated to defend the president every time somebody says something bad or controversial about him.\", The billionaire businessman then tweeted \"No chance!\" that the president would \"come to my rescue\" if someone made a nasty statement about Trump. The billionaire businessman had been silent on the Thursday night exchange other than a statement from his campaign that raised concerns about the treatment of Christians in the U.S. He tweeted Saturday that for the first time in his life he has \"caused controversy by NOT saying something.\"]", "Date": "20150920", "Author": "[The Associated Press]", "Link": "http://www.chron.com/news/politics/article/The-Latest-on-the-2016-campaign-Trump-on-6515878.php", "Title": "[The Latest on the 2016 campaign: Rand Paul wins straw poll]"}