{"Content": "[Caption, Close, Ben Carson: \"Promotes academic intelligence more than athletic ability.\", Ted Cruz:\"Has formidable auditory skills.\", Hillary Clinton:\"Working with diet guru Dr. Mark Hyman.\", Jeb Bush:\"Plays golf every Sunday. Adopted the Paleo Diet, a diet that emphasizes heavy consumption of meat, fruits, and certain vegetables while avoiding grains, dairy, and foods high in sugar and other processed carbohydrates.\", Chris Christie:\"Had lap band surgery in 2013 and has dropped 85 pounds. Weighed about 350 pounds before surgery. Says he is not a vegetable fan and only eats green beans, lettuce, and cucumbers. Usually doesnt eat breakfast or drink coffee. He instead has a mug full of milk in the morning.\", Carly Fiorina:\"Board member for Revolution Health Group, a U.S.-based corporation dedicated to giving the people the tools they need to monitor their health and fitness.\", Lindsey Graham:\"Attempting to stay on a low-carb diet while facing the exercise deficient life on the campaign trail. Rick Perry:\"Used to be an avid jogger but because of back pain he has changed to a stationary bike. Says he does a 4-mile jog or 30 minutes on bike with weight training. He has ran in countless fun runs and marathon across the state of Texas during his tenure as governor. He claims that when he does not exercise regularly he develops sleep apnea, but with his healthy lifestyle he avoids this problem.\", Mike Huckabee:\"Wrote a book on weight loss and nutrition called Quit Digging Your Grave With a Knife and Fork.\" Weight loss inspired him to focus more attention to health care reform during his governorship. Has declared himself a recovering foodaholic. Bobby Jindal:\"Claims that he forgets to eat sometimes because he is so busy. Also says he has a high metabolism which makes it hard to gain weight. Martin OMalley:\"Does P90X\", George Pataki:\"Wants to tackle climate change and reduce pollution.\", Donald Trump: \"\"Says golfing keeps him in shape, as after playing several rounds of golf, Trump claims to notice a change in weight. Avoids all drugs, including alcohol and marijuana, and has avoided them his whole life.\", Bernie Sanders:\"Supports universal health-care\", Rand Paul:\"Participated in high school sports and hes been on the congressional baseball team. Scott Walker:\"Walkers wife Tonette Walker works for the American Lung Association.\", Marco Rubio:\"Advocates for the expansion of mental health facilities, universal childhood vaccinations- with the exception of those with medical issues.\", Rick Santorum:\"Hunts and bowls regularly. Starts the day with 50 push-ups. However, he has horrible eating habits and especially likes ice cream. Says he is hooked. A Houston-based fitness advisor recently ranked the perceived fitness of each of the current 16 Republican presidential hopefuls. CEO Samir Becic with ReSync Enterprises says that his study has actually done some good for at least one candidate he knows of. After we did the first report and tweeted it to Jeb Bush, he lost over 40 pounds over the next few months, says Becic. I just met Bill Clinton in Europe and he was aware of our lists because of how unique they are. Were thinking the stress of campaigning for president probably had a little bit to do with Bushs weight loss too. He says that since Hillary Clinton announced her candidacy it appears shes slimmed down as well. There is a direct correlation between political agendas and healthy lifestyles, Becic says. Becic is of the mind that our future president will have much more competition than the previous presidents because of where the modern world is heading. If he was the fitness expert for a presidential candidate on the campaign trail he would definitely have the politician change their daily habits. I would recommend they pick hotels with equipped fitness gyms and spas. When eating out, they should be very selective and eat lean protein, complex carbohydrates, lots of vegetables, and hydrate plenty with water, Becic says. That means that stopping at every rib joint in Middle America might be tricky, but at least breakfast would be fun. They should make sure that breakfast is the largest meal of the day and eat low-sugar fruits, such as berries that are packed with anti-oxidants as snacks, he adds. It is important that their digestive system be rested because it will promote quality sleep, which is crucial while campaigning. Light stretching and cardio would be key, along with push-ups, crunches, dips, squats, and planks would be on the exercise menu. The campaign trail is very stressful and their cortisol levels will be high, promoting weight gain, so it is crucial that they get plenty of exercise-induced endorphins, Becic says. In the very little free time that they will have, I recommend that they do things they really enjoy so that their endorphin levels will remain high and curb the effects of the cortisol in their bodies. Who is the least physically fit candidate by his estimation? Hint: this candidate recently used an A5 to cook bacon. The least fit and least improved candidate is Ted Cruz. Right behind him is Mike Huckabee, who got in good shape for previous elections, but has since gained all the weight back, Becic says. When it comes to the candidates who are the most fit who is on Becics list?, The most-fit candidates that are currently running are Rand Paul and Martin OMalley. However, if Joe Biden -- considering his age -- or Paul Ryan ever decide to run they would definitely be the fittest, Becic says. Whos been the most most-fit president of all-time? That would be Theodore Roosevelt, according to Becic. He was an extremely fit, avid sportsman who even set up a boxing ring in the White House, Becic says. The least fit would be William Howard Taft who weighed 370 pounds and would get stuck in the White House bathtub. ]", "Date": "20150812", "Author": "[Craig Hlavaty]", "Link": "http://www.chron.com/life/healthzone/article/A-Houston-fitness-advisor-ranks-the-fitness-of-6438481.php", "Title": "[A Houston fitness advisor ranks the fitness of presidential candidates]"}