{"Content": "[AUSTIN, Texas (AP)  A federal appeals court ruled Wednesday that Texas voter ID law has a \"discriminatory\" effect on minorities in a victory for President Barack Obama, whose administration took the unusual step of bringing the weight of the U.S. Justice Department to fight a wave of new ballot-box restrictions passed in conservative statehouses. The 5th U.S. Circuit Court of Appeals ruled that the 2011 Texas law runs afoul of parts of the federal Voting Rights Act  handing down the decision on the eve of the 50th anniversary of the landmark civil rights law. Texas was allowed to use the voter ID law during the 2014 elections, thereby requiring an estimated 13.6 million registered Texas voters to have a photo ID to cast a ballot. The ruling was a victory, albeit not a sweeping one, for Democrats and minority rights groups. Whereas a Texas federal judge last year called the voter ID law the equivalent of a poll tax, a three-judge panel of the New Orleans court disagreed. It instead sent the law back to the lower court to consider how to fix the discriminatory effects. Until then, Republican Texas Attorney General Ken Paxton said the law will remain in effect, though he did not acknowledge the issues raised by courts mixed ruling. \"Im particularly pleased the panel saw through and rejected the plaintiffs claim that our law constituted a poll tax. The intent of this law is to protect the voting process in Texas, and we will continue to defend this important safeguard for all Texas voters,\" Paxton said. Other Republican-controlled states, including Wisconsin and North Carolina, have passed similar voter ID measures in recent years, but the Texas law signed by then-Gov. Rick Perry is widely viewed as one of the nations toughest. It requires one of seven forms of approved identification, but unlike other states with voter ID restrictions, Texas doesnt recognize university IDs from college students. It does, however, accept concealed handgun licenses as proof of identity. Free voting IDs are available from the state, but opponents have said getting those cards still put underlying financial costs on voters, such as paying for birth certificate copies and travel. \"We believe in a secure ballot, but this law doesnt get us there. Now we have an opportunity to improve on the legislation and make sure the interests of the minority community are not ignored in this process,\" said Jose Garza, attorney for the Mexican American Legislative Caucus, one of the groups that sued over the voter ID law. Texas Republican Gov. Greg Abbott called it \"imperative\" that Texas has a voter ID law, and said the state will continue fighting for the measure. Democrats and minority rights advocates had early success in blocking the law. However, after the U.S. Supreme Court struck down the heart of the Voting Rights Act in 2013, the path was cleared for Texas to enforce the new restrictions that supporters say prevent voter fraud. Section 5, one of the parts of the act that was struck down, had forced certain state and local governments  including Texas  to get pre-clearance from the federal government before changing voting laws to ensure they were free of discrimination. Without that provision to rely on, opponents of the voter ID law had to meet the higher threshold under Section 2 of the Voting Rights Act of proving the law discriminated against minority voters. The New Orleans panel sustained the lower courts ruling that the law interacts with \"social and historical conditions in Texas to cause an inequality in the electoral opportunities enjoyed by African-Americans and Hispanic voters.\", The Justice Department had argued that the Texas law would prevent as many as 600,000 voters from casting a ballot. While there have been anecdotal reports of confusion, there were not widespread issues with voters being unable to cast ballots because they lacked proper identification. Garza said there is no way to measure the number of voters disenfranchised but said that, anecdotally, he knew of \"a lot\" of ballots in rural counties that had been rejected. \"We are pleased that the Court of Appeals agreed unanimously with the district court that the Texas statute violates Section 2 of the Voting Rights Act and we are studying the opinion in light of the future proceedings the Court of Appeals has ordered,\" U.S. Attorney General Loretta Lynch said in a statement Wednesday. Even though the lower court in Corpus Christi, Texas, found the law unconstitutional in 2014, it was allowed to remain in effect because the ruling had come so close to the election. ", "Date": "20150805", "Author": "[Paul J. Weber, Associated Press]", "Link": "http://www.chron.com/news/texas/article/Federal-court-strikes-down-discriminatory-Texas-6426737.php", "Title": "[Federal court says Texas voter ID violates Voting Rights Act]"}