{"Content": "[Caption, Close, In this March 10, 2015, photo, Sen. Ted Cruz, R-Texas, speaks at the International Association of Firefighters (IAFF) Legislative Conference and Presidential Forum in Washington. A pair of lawyers who have represented presidents from both parties at the Supreme Court says Cruz is legally eligible to run for president. Solicitor General Paul Clement and former Obama acting Solicitor General Neal Katyal are writing in the Harvard Law Review that the Canadian-born Cruz meets the constitutional standard to be a presidential contender. The bipartisan duos commentary comes as Cruz moves toward an expected White House run. Whos the front-runner for the 2016 GOP presidential nomination?, Jeb BushFormer Governor of FloridaOdds:5/2Source: Ladbrokes, Marco RubioU.S. Senator, FloridaOdds: 3/1Source: Ladbrokes, Scott WalkerGovernor of WisconsinOdds:3/1Source: Ladbrokes, Rand PaulU.S. Senator, KentuckyOdds:8/1Source: Ladbrokes, Chris ChristieGovernor of New JerseyOdds:10/1Source: Ladbrokes, Ted CruzU.S. Senator, TexasOdds: 12/1Source: Ladbrokes, , Mike Huckabee, , Paul RyanU.S. Representative, WisconsinOdds: 25/1Source: Ladbrokes, Bobby JindalGovernor of Louisiana, , Susana MartinezGovernor of New MexicoOdds: 25/1Source: Ladbrokes, , Rob PortmanU.S. Senator, OhioOdds: 25/1Source: Ladbrokes, Carly Fiorina, Condoleeza RiceFormer Secretary of StateOdds:33/1Source: Ladbrokes, Nikki HaleyGovernor of South CarolinaOdds: 33/1Source: Ladbrokes, John HuntsmanFormer Governor of UtahOdds: 33/1Source: Ladbrokes, Mike PenceGovernor of IndianaOdds: 40/1Source: Ladbrokes, Eric CantorFormer U.S. Representative, VirginiaOdds: 50/1Source: Ladbrokes, Sarah PalinFormer Governor of AlaskaOdds: 50/1Source: Ladbrokes, Ron PaulFormer U.S. Representative, TexasOdds: 50/1Source: Ladbrokes, Donald TrumpBusinessman and investorOdds: 50/1Source: Ladbrokes, John BoltonFormer U.S. Ambassador to the U.N.Odds: 50/1Source: Ladbrokes, John McCainU.S. Senator, ArizonaOdds: 50/1Source: Ladbrokes, , David PetraeusFormer CIA directorOdds: 66/1Source: Ladbrokes, David Brat U.S. Representative, VirginiaOdds: 200/1, HUDSON, N.H. (AP)  Canadian-born Ted Cruz is getting some bipartisan help to shut down a potential \"birther\" problem before his expected presidential campaign. Two lawyers who have represented presidents from both parties at the Supreme Court say they think the Republican senator from Texas is legally eligible to run for president. Some have questioned whether Cruz is constitutionally eligible to run for the White House because he was born in a Canadian hospital to an American mother. But Paul Clement, a solicitor general in the Bush administration; and Neal Katyal, former acting solicitor general in the Obama administration, write in the Harvard Law Review that Cruz meets the constitutional standard to run, in their opinion. Their article comes as a crowded field of Republican presidential hopefuls is taking shape. Cruz is making a weekend trip to this early nominating state. The lawyers write: \"We may have different ideas about the ideal candidate in the next presidential election, but we agree on one important principle: voters should be able to choose from all constitutionally eligible candidates, free from spurious arguments that a U.S. citizen at birth is somehow not constitutionally eligible to serve as president simply because he was delivered at a hospital abroad.\", Cruz has renounced his Canadian citizenship; he possessed joint citizenship before. \"Despite the happenstance of a birth across the border, there is no question that Senator Cruz has been a citizen from birth and is thus a natural born citizen within the meaning of the Constitution,\" the attorneys wrote. Their opinion, published at Cruzs law school alma mater, may prove helpful as Cruz prepares formal steps to open a 2016 presidential campaign in coming weeks. Cruz would not be the first presidential hopeful to face questions about his birth. The GOPs 2008 nominee, Sen. John McCain, was born in the Panama Canal Zone to American parents. Former Michigan Gov. George Romney was born in Mexico to American parents. In neither case was the country of birth a driving factor in the campaigns, and leaders from both parties cleared the way for the candidacies. As well, some \"birthers\" contended President Barack Obama was born in Kenya and have clung to that assertion despite proof offered by Obama in 2008 and 2012 that he was born in the U.S.]", "Date": "20150313", "Author": "[Phlip Elliott, The Associated Press]", "Link": "http://www.chron.com/news/politics/article/Harvard-Law-Review-article-Cruz-eligible-to-seek-6132613.php", "Title": "[Despite Canadian birth, legal duo says Cruz eligible to seek presidency]"}