{"Content": "[Caption, Close, , Participation in bowhunting as exploded in Texas over the past two decades. When Texas 2013 archery-only white-tailed deer hunting season opens Saturday, Sept. 28, as many as 160,000  bowhunters  - a quarter of all Texas deer hunters - will greet the dawn of the season in which only archery gear can be used. Photo courtesy of Casey Morris, Participation in bowhunting as exploded in Texas over the past two... Deer are just one of several species of wildlife that can become players in spring turkey hunts, often outing hunters and ruining their chances at taking a gobbler. Timely rains boosted body condition and antler development of many of Texas 4 million white-tailed deer, creating good prospects for the states hunters heading afield for Saturdays opening of the general white-tailed deer hunting season. Watch for white-tailed kite as they hunt for prey. With white-tailed deer season now in full swing, the debate over deer-ranching practices is erupting and promises to greet state lawmakers when they arrive in Austin next month. With white-tailed deer season now in full swing, the debate over... This undated photo provided by the Texas Parks and Wildlife Department shows a white-tailed buck. The Associated Press obtained preliminary data from the Texas Parks and Wildlife Department that comes from statewide wildlife surveys the agency performs annually of deer, prong-horned antelope, quail, turkey and other animals. The data has not yet been compiled into a statewide overview, but so far confirms scientists suspicions that the drought has hampered wildlife reproduction.(AP Photo/Texas Parks & Wildlife Department, Earl Nottingham), AUSTIN  Texas voters in November will decide whether to make hunting and fishing a right enshrined in the state constitution. The state House on Wednesday passed a resolution that supports adding an amendment to the state Constitution to protect the right of Texans to hunt and fish. To become law, the resolution will need to win the approval of a majority of voters casting ballots in the November election. The full language of the resolution is as follows:\"The people have the right to hunt, fish, andharvest wildlife, including by the use of traditional methods,subject to laws or regulations to conserve and manage wildlife andpreserve the future of hunting and fishing.Hunting and fishing are preferred methods of managingand controlling wildlife.This section does not affect any provision of lawrelating to trespass, property rights, or eminent domain.This section does not affect the power of thelegislature to authorize a municipality to regulate the dischargeof a weapon in a populated area in the interest of public safety.\", The debate Wednesday was short but heated. Rep. Roland Gutierrez, D-San Antonio, urged his fellow members who support hunting and fishing - but opposed changing the constitution - to be \"present but not voting.\", \"At the end of the day, what we put in our constitution is important and our constitution isnt a toy. Its not an item or a document to be taken lightly and if we are asking to put things in our constitution that say this constitutional right to fish and hunt, how about our constitutional right to watch Sunday night football or our constitutional right to love the San Antonio Spurs?\" Rep. Roland Gutierrez, D-San Antonio, said during debate Wednesday. \"When we do these things to our constitution and make voters go out and vote for these things, it demeans the document and it demeans us,\" he added, urging his colleagues to vote \"present but not voting.\", The resolution received bipartisan support in the Senate, with just three Democrats voting against. In the House, it passed 111 to 1 with 25 members, mostly Democrats, present but not voting.]", "Date": "20150520", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Should-hunting-and-fishing-be-enshrined-in-Texas-6276398.php", "Title": "[Should Texas constitution include a right to hunt and fish?]"}