{"Content": "[Caption, Close, A passerby photographs the spray painted message of Black Lives Matter that was painted on a monument to former Confederate President Jefferson Davis on Monument Avenue in Richmond, Va. Thursday, June 25, 2015.  The vandalism comes after a mass shooting in Charleston South Carolina has sparked a nationwide debate on the public display of Confederate imagery. (AP Photo/Steve Helber)  , , Confederate Heroes Day, , Protesters defaced another Confederate monument in Texas early Monday morning. The message was clear: This is racist was spray-painted in a deep red over a memorial in Denton to Confederate soldiers. Later that day, a 69-year-old Denton man named William Hudspeth went to the statue with cardboard signs that read \"Please move the statute to a confederate museum,\" the North Texas Daily reported. Another resident met him there armed with an assault rifle. Oklahoma State student and Denton local Stephen Passariello brandished the loaded A5 while entering into a verbal altercation with Hudspeth. Denton resident Willie Hudspeth, 69, protests under vandalized statue and argues with gun-toting onlooker. @ntdaily pic.twitter.com/ubYK4QRTjk, Passariello asked Hudspeth why he wasnt protesting the monument months ago. Hudspeth responded that hes demonstrated at the statue some 50 times since 2000. He told the newspaper reminds him of what the Confederacy \"did to my fathers father.\", Hudspeth called the Denton County Police on Passariello. Authorities told him he could open carry the weapon, but preferred he put a sling on it so that it was secure to his body. The gun-toting student left the area soon after, the newspaper wrote. A string of Confederate monuments in Texas  there are quite a few  have been vandalized in recent weeks and months. The messages represent a part of the public fed up with state institutions honoring soldiers who fought to preserve slavery during the Civil War. Monuments have been targeted in at least a half-dozen states. RELATED: UT Confederate statues vandalized as push for removal grows, The most recent act occurred outside the Denton County Courthouse. A camera placed in the area in recent weeks, in response to mounting reports of vandalism, captured two people at about 4:30 a.m. Monday run up to the statue, with what look like large stencils, the Dallas Morning News reported. They climbed the statue to paint the message and then fled. Vandal sprays This is racist on Denton memorial to Confederate soldiers http://t.co/mojnjh0ct4 pic.twitter.com/tJhHzSvvZk, The Daughters of the Confederacy erected the monument in 1918, according to the Denton County Historical Commission. Activists have been working to rid the city of Confederate icons, in light of South Carolina removing the Confederate battle flag at the state capitol. Vandals continue to leave their mark as well. A statue of General Robert E. Lee in Dallas was sprayed with SHAME earlier in July. READ MORE: Vandals target Confederate monuments in half-dozen states, Confederate statues at the University of Texas at Austin were vandalized a couple of times in past months. One of Confederate leader Jefferson Davis had the message Black Lives Matter and Bump all the chumps written across it. Red still visible this morning where someone wrote \"This is Racist\" on a Confederate monument in Denton. @NBCDFW pic.twitter.com/oIGbO9QpiC, See a list of Confederate monuments throughout the state in the gallery above]", "Date": "20150721", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/houston-texas/article/Confederate-monument-in-North-Texas-spray-painted-6396975.php", "Title": "[Protester faces off against man with A5 under defaced Confederate memorial in North Texas]"}