{"Content": "[Caption, Close, President Barack Obama traveled to Puerto Rico in 2011, marking the first visit to the country by a sitting U.S. president since John F. Kennedy. In his sixth State of the Union address, President Barack Obama rightly touted his decision to do what other administrations have been unwilling or too afraid to do: end the U.S. embargo on Cuba. Now that the U.S. is closing the books on some historical anachronisms in the Caribbean, its time to address another one: Americas political relationship with Puerto Rico. The three countries histories became intertwined after the Spanish-American War of 1898, when America dismantled the remains of Spains overseas empire, asserted the right to intervene in Cuba whenever it saw fit, and claimed Puerto Rico and the Philippines for itself. Cuba has since remained independent, and the Philippines gained its own independence after World War II. But it may surprise some to learn that 116 years after the \"splendid little war,\" Puerto Rico remains a U.S. colony. Some may quibble with the term  \"colony,\" but the label fits. Although Puerto Ricans elect a governor and legislature, have their own Supreme Court and even a constitution, the island remains an \"unincorporated territory\" of the U.S. The U.S. controls Puerto Ricos defense, monetary system, commercial shipping, air space, territorial waters, national parks, immigration, international relations - the list goes on and on. Puerto Rico is a self-governing territory, but a territory all the same. If you support independence for Puerto Rico, the drawbacks of this colonial relationship are clear enough. But those who favor closer ties to the U.S. also find this relationship intolerable. Statehood supporters routinely decry the islands lack of voting representatives in Congress - despite having a larger population than 22 states. Puerto Ricans are U.S. citizens by birth yet cannot vote for president while living on the island. But they can cast that vote if they move to, say, Florida or Texas, as many do. Under the status quo, Puerto Ricans neither fully govern themselves nor fully participate in American democracy. Puerto Ricans dont agree on much when it comes to politics - as someone who grew up there, I dare anyone who wants to see real polarization to spend an election season on the island - but they agree about the need to dump the status quo. In a 2012 Election Day referendum, 54 percent of voters rejected the current \"commonwealth\" political status. (Nearly two-thirds favored statehood in a second question, but commonwealth supporters argue that low turnout and the lack of a valid alternative to statehood and independence on the ballot invalidate the results.) , A majority coalition composed of supporters of statehood, independence (a small but influential minority), and a sizable portion of commonwealth supporters now favors decolonization. The question is: What relationship is America willing to have with its 4 million Caribbean citizens in the future? Is it willing to accept Puerto Rico as the 51st state, and if so, whats the price of admission? Under what conditions would it grant independence? What kind of noncolonial, intermediate status would it be willing to negotiate with Puerto Rico? Individual decision makers have expressed preferences, but its time for the U.S. government to speak with one voice. The toxic U.S.-Cuban relationship has left its mark on Puerto Rico. For much of the Cold War, America portrayed Puerto Rico as a successful, democratic-capitalist alternative to Cubas socialist dictatorship, while Cuba loudly denounced Puerto Ricos persistent colonial status and called for full independence. The island also became a battleground between Cuban and American intelligence forces, with Cubans fomenting opposition and violent acts against the U.S. government while American intelligence and law enforcement persecuted independence supporters with real or imagined ties to Cuba. The battleground has cleared since the collapse of the Soviet Union, but Puerto Ricos fate remains unresolved. Before Obamas announcement, the Cuban embargo and Puerto Ricos status were twin historical relics. America is finally disposing of one of those relics, but it needs to do away with both for good. Hestres is an assistant professor of communication at the University of Texas at San Antonio. He was born and raised in Puerto Rico.]", "Date": "20150124", "Author": "[Luis E. Hestres]", "Link": "http://www.chron.com/opinion/outlook/article/Hestres-With-U-S-Cuba-ties-warming-what-to-do-6037774.php", "Title": "[Hestres: With U.S.-Cuba ties warming, what to do about Puerto Rico?]"}