{"Content": "[Houston Community College trustee and longtime anti-gay activist Dave Wilson has submitted a city charter amendment petition seeking a November vote to bar men \"who perceive or express themselves as women\" from entering womens restrooms, but it appears he misread state law and submitted about 300 fewer signatures than he needs to qualify for the ballot. Wilson delivered 19,707 signatures to City Hall on Tuesday morning, but state law requires those seeking a city charter change to submit 20,000 signatures or signatures from 5 percent of qualified voters, whichever is smaller. Mayoral spokeswoman Janice Evans said the city wasnt sure yet about the law surrounding Wilsons petition but would offer an opinion this afternoon. Wilson, standing beside his white pickup containing six boxes full of signatures, said he needs only 17,269 signatures -- 10 percent of the votes cast in the last mayoral election, and the threshold for repealing an ordinance, not a charter change. Wilsons proposed charter revision is a pointed challenge to the citys legally embattled equal rights ordinance, passed last May, that opponents perceive as allowing men dressed in drag to enter a womens restroom. \"My whole point is, do you want your mother to be in a womans restroom and a man walk in on that?\" Wilson said. \"I dont think so. Thats totally out of the question.\", Before City Council passed the ordinance 11-6 last May, largely conservative Christian foes dubbed it the \"Sexual Predators Act.\" A petition seeking to repeal the ordinance has already been submitted and is currently at the center of litigation against the city. The law bans discrimination based not just on sexual orientation and gender identity but also, as federal laws do, sex, race, color, ethnicity, national origin, age, religion, disability, pregnancy and genetic information, as well as family, marital or military status. The ordinance applies to businesses that serve the public, private employers, housing, city employment and city contracting. Religious institutions are exempt. The specific language of Wilsons charter amendment seeks to define gender identity \"as an individuals innate identification, as either male or female, which is assigned at birth.\" It would require businesses to adopt the same definition. Wilson was joined by Steve Hotze, another local anti-gay activist, as he unloaded the boxes of signatures. \"Youre talking about a bunch of perverts that are going to womens bathrooms,\" Hotze said. \"Thats wrong, guys.\", Mayor Annise Parker, nearing the end of her final term, has vowed to fight any anti-HERO legislation that might end up on the November ballot. \"The voters who have elected me nine times consecutively dont believe in discrimination,\" Parker said last week. \"And since Im not on the ballot this November if it were to suddenly end up there I would devote all my time and energy to defending it.\", But its also unclear if the petition will pass muster with the citys legal department. Then-City Attorney David Feldman raised questions last May about whether Wilsons proposed charter revision might too closely resemble the equal rights ordinance repeal petition. Those seeking to repeal an ordinance once it has gone into effect must submit their petition within 30 days. The equal rights ordinance repeal referendum petition met that requirement, though the city later rejected it for not having enough valid signatures. But Wilsons petition would be about nine months late by that logic. Wilson objected to that interpretation, calling it a \"flimsy\" legal argument. He said he is seeking a charter change because it is more substantive than simply repealing the ordinance, not to circumvent the daunting 30-day turnaround to collect signatures. If the city rejects his petition on the grounds that it was subject to the 30-day time frame, Wilson said he plans to go to the courts. That means the city would potentially be fighting two equal rights ordinance-related legal battles at once. The challenge over the repeal referendum petition appears to be at least one week away from a formal ruling, but even then its likely bound for the appellate courts.]", "Date": "20150407", "Author": "[Katherine Driessen]", "Link": "http://www.chron.com/news/politics/houston/article/Anti-HERO-charter-petition-arrives-at-City-Hall-6183974.php", "Title": "[Anti-HERO charter petition arrives at City Hall]"}