{"Content": "[Caption, Close, Former Florida Gov. Jeb Bush waves while being introduced before speaking at the National Automobile Dealers Association convention in San Francisco, Friday, Jan. 23, 2015. Bush will bring his likely presidential campaign to Houston Thursday evening to raise money for his political action committee. Many campaign watchers consider Bush and Mitt Romney to be the front runners in the race. Take a look at how the two stack up. , , Jeb Bush: Personal Life, Mitt Romney: Finance, Jeb Bush: Finances, Mitt Romney: Family Legacy, Jeb Bush: Family Legacy, Mitt Romney: Accomplishments, Jeb Bush: Accomplishments, Mitt Romney: Stumbling Blocks, , Jeb Bush: Stumbling Blocks, Jeb Bush will bring his likely presidential campaign to Houston Thursday evening to raise money for his political action committee. The former Florida governor will host donors at an evening reception at the St. Regis Hotel in River Oaks. Bush, who grew up in the city and had deep ties to its donor class, launched a leadership PAC called Right to Rise last month that is hosting events across the country to raise money ahead of a presidential bid that could feature three other Texans. Those Texans will likely appear early and often in a city referred to as the Republican ATM. U.S. Senator Ted Cruz is eyeing a presidential headquarters in the city and has increased his outreach to the business community in recent months. Like Bush, former Gov. Rick Perry also has built relationships with the citys business donors. And Kentucky Senator Rand Paul, raised in Brazoria County, is showering attention on the state, appearing at two Republican dinners this weekend. Jacob Monty, an immigration attorney who pledged to raise $100,000 for Bush, said he sensed some \"Bush magic\" among Houstons business community. \"There are people who havent given money to any of my endeavors in five or six years, that said, Yes, Im in,\" Monty said. \"Raising money for Bushes is different, especially in Houston.\"]", "Date": "20150128", "Author": "[Theodore Schleifer]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Jeb-Bush-plans-Houston-fundraising-stop-6046135.php", "Title": "[Jeb Bush plans Houston fundraising stop]"}