{"Content": "[TRENTON, N.J. (AP)  Would-be boaters in the market for a tricked-out 28-footer with high-end electronics, radar, underwater lighting and an engine with joystick piloting would have gotten a tax break under a bill the Democrat-led Legislature sent Gov. Chris Christie, but the Republican countered with his own proposal: slashing the sales tax on even the most modest of dinghies. Christie put forward the idea of cutting the 7 percent tax on boats in half in a conditional veto last week of legislation that would have capped sales tax at $20,000. Now Democratic state senator and bill sponsor Jeff Van Drew says he expects Christies revisions to be considered by lawmakers as soon as September. Senate President Steve Sweeney said he is considering the legislation and the state Senate will most likely adopt it, though he added he wants a review completed of the cost to the state before signing off on the measure. Lawmakers say they proposed the legislation because marinas and other boat retailers along the states coast were suffering because of Superstorm Sandy and competition from other states with lower taxes. The bill that went to Christies desk would have affected boats that cost roughly $286,000, which translates into 70 to 140 vessels, the Office of Legislative Services estimated. But a broader cut would affect many more  such high-priced boats are only a fraction of the $160 million in new boat sales the National Marine Manufacturers Association said were made in the state last year. Marina operators and boat retailers are hopeful the lower rate would go into effect. Skip Harrison, general manager of Baywood Marina in Brick, says the benefit of a $20,000 cap alone probably would not boost business as much as a sales tax decrease. The most popular boat he sells goes for about $40,000, well below the price at which the cap would take effect. \"The difference is selling a boat or not selling a boat,\" he said. Ernie Utsch of Utschs Marina in Cape May also backs Christies proposal. He called the states tax collection system \"onerous\" and said he sees state officials checking out-of-state registration at his marina aiming to collect the 7 percent use tax from nonresidents, which would also be cut under Christies proposal. \"This is how it works, and this is one of the problems,\" he said. \"So by Gov. Christie doing what hes doing  not only for the big boaters  it covers a whole gamut of boaters, which is your middle class.\", The tax break under the vetoed legislation could have cost the state between $3 million and $4 million, according to legislative estimates. Estimates for Christies proposal are not yet available, but Sweeney indicated its likely to cost more than the vetoed provision. The issue comes to the foreground as Christie spends time outside New Jersey seeking the Republican nomination for president. Its impossible to look at a potential tax cut without applying the filter of the presidential race, said Seton Hall associate political science professor Matthew Hale. \"I think Gov. Christie has as real problem in that a lot of Republican primary voters and caucus goers think that hes too liberal,\" Hale said. \"This is an example of him saying to these right-wing voters, I really am a fiscal conservative.\", Christie, though, cast the issue as a boost to the states struggling economy. \"Lowering taxes on New Jersey residents and supporting the continued economic growth of our shore communities following the impact of Superstorm Sandy are laudable goals,\" Christie said in a statement. The Legislatures bill also included a grace period against the use tax for boats used in the state for fewer than 90 days per year. Christie proposed changing the period to 30 days. The change is needed, Christie wrote, to make sure the use tax is enforceable.]", "Date": "20150816", "Author": "[Michael Catalini, Associated Press]", "Link": "http://www.chron.com/news/article/Christie-proposal-to-cut-yacht-sales-tax-could-6447221.php", "Title": "[Christie proposal to cut yacht sales tax could see vote]"}