{"Content": "[Caption, Close, Sen. Ted Cruz, Sen. Ted Cruzs new book A Time for Truth offers some new insight into the mind of the GOP presidential candidate. It also has angered some of the Texas senators rivals. Ted Cruzs mother, a mathematician and compu  programmer, once held a job that involved calculating the orbit  Russias Sputnik satellite.Source: Dallas Morning News, Ted Cruzs original first name was Rafael but because his fathers name was also Rafael, he was Rafael Jr. or Rafaelito.\"Now the problem with that is that it rhymes with every major corn chip on the market  Doritos, Tostitos, burritos, Cheetos, which sadly, young children were fond of pointing out. And my mother  I remember  my mom and I are very close. I remember my mom suggesting to me when I was, I think, 11 or 12, that if I wanted, I could change my name.\"Source: NPR, Former U.S. President George W. Bush has a penchant for nicknames. During his time as a domestic policy adviser for the 2000 presidential campaign, Ted Cruz received the nickname \"Theodore\" because he was apparently \"super serious\" all the time.Source: Dallas Morning News, In his younger days, Rafael Cruz joined Fidel Castros revolution against Fulgencio Batista, the former dictator of Cuba. Prior to his capture and torture, Rafael reportedly led a squad of insurgents and firebombed vacant buildings.\"My dad asked if he could join Castro in the mountains and keep fighting. But he was told there was no way to get to the rebels.\"Source: Associated Press, During his time in Cuba, Ted Cruzs father, Rafael joined Fidel Castros resistance movement and was later captured by Batistas forces. The description of the beatings he endured are graphic.Men with clubs beat him. His captors broke his nose when they kicked him in the head with their army boots. They bashed in his front teeth until they dangled from his mouth.Source: The Daily Beast, Ted Cruz recounts a moment in his childhood when his mother spanked him. Why? He refused to stop playing the kazoo at a grocery store.Source: Dallas Morning News, We already knew Ted Cruz smoked marijuana in his younger years, but he offered a few more details in his book.I was suspended from school for several days for going to a party, drinking, and smoking pot (something I experimented with as a teenager before wising up).Source: Dallas Morning News, Cruz is a Princeton man, but he could have been a Brown University man. Unfortunately, he made a mistake the night before by partying with Dartmouth students.\"I had to ask (the admissions counselor)to please lower her voice because, I told her, I was really hungover. That probably did not leave the best of impressions.\"Source: Washington Post, Cruz is a known Rockets fan and was spotted courtside during the 2015 finals, but he missed one of the biggest games of all in 1995. Instead of watching the Rockets sweep the Orlando Magic in the NBA Finals, he opted for a last-minute interview with then Chief Justice William Rehnquist.Source: Dallas Morning News, In his book, Cruz claims not to be a fan of the New York Times or PolitiFact, calling the Times the \"praetorian guard of the Obama presidency.Source: Dallas Morning News, Following the Sandy Hook massacre and the failed vote in the Senate to tighten gun control laws, Cruz says Biden put his arm on his shoulder and told Sen. Joe Manchin, D-W. Va. \"Joe, theres nothing more dangerous than a smart Republican.\"Source: Dallas Morning News, Cruz says his first meeting with Democratic Senate Leader Harry Reid did not go too well. After promising Reid he would never lie to him to his face or cast aspersions on his asparagus, Cruz said Reid looked at him like he were a rube.Source: Dallas Morning News, Cruz bought a .357 Magnum for his wife Heidi for her protection.Source: Dallas Morning News, Many of Cruzs relatives, particularly on his mothers side, live in Delaware. Vice President Joe Biden commented on this fact at Cruzs swearing in, saying they all probably voted for him.Source: Dallas Morning News, Cruz met his wife Heidi during the 2000 presidential campaign, and later moved with him to Texas when he became the states solicitor general. The move pushed her into a period of depression. Unmentioned in the book was her encounter with the Austin Police Department. A representative for Cruzs team commented:About a decade ago, when Mrs. Cruz returned from D.C. to Texas and faced a significant professional transition, she experienced a brief bout of depression. Like millions of Americans, she came through that struggle with prayer, Christian counseling, and the love and support of her husband and family.Source: BuzzFeed, Washington Post, While mulling his run for Texas attorney general (which never materialized), he wanted to ask H.W. for advice. When he arrived, Bush invited him onto his boat but requested he change out of his suit into something more casual: a pair of jeans, a shirt and a belt with a buckle that read \"President of the United States.\"Source: Washington Post, At one point, Cruz found himself standing behind then Supreme Court Justices William Rehnquist and Sandra Day OConnor and a large computer screen with hardcore pornography on display. The justices were discussing a case involving online pornography.\"A slew of hard-core, explicit images showed up onscreen. As we watched these graphic pictures fill our screens, wide-eyed, no one said a word. Except for Justice OConnor, who lowered her head, squinted slightly, and muttered, Oh, my.\"Source: Washington Post, During the 2000 presidential campaign, Cruzs then boss Josh Bolten had been dating actress and model Bo Derek. One night, Bolten took the team out for bowling.\"At the bowling alley, she bowled barefoot, with two hands, in a white pantsuit. Every man on the policy team was mesmerized.\"Source: Washington Post, One of Cruzs half-siblings, Miriam, died at the age of 49 following a long battle with addiction.I sometimes found it hard to reconcile the bright, fun and charismatic sister I adored with the person who would lie to me without hesitation and who stole money from her teenage brother to feed her various addictions.Source: Politico, Karl Rove, a Republican strategist and the architect of George W. Bushs presidential campaigns, is engaged in a war of words with Cruz over what was said about George H.W. in Cruzs new book, calling Cruz a liar.\"He suggested that the elder Bush was too old to have good judgment anymore. I was offended by that characterization and knew from my visit with 41 that it wasnt remotely true.Source: Business Insider, Updated:Almost all the cash raised by a group of Super PACs supporting presidential hopeful Ted Cruz comes from six individuals, according to campaign finance reports filed Friday. Toby Neugebauer, son of Republican U.S. Rep. Randy Neugebauer of Lubbock, donated $10 million to \"Keep the Promise II,\" one of four PACs by the same name that back Cruz. Another PAC, \"Keep the Promise III,\" received $15 million from a single family made up of energy executives Farris and Daniel Wilks and their wives. \"Keep the Promise I\" received $11 million from hedge fund investor Robert Mercer. Between them, the six wealthy donors accounted for $36 million of the $37 million raised by PACs supporting Cruz in the last six months. The sum stands in contrast to Cruzs campaign, which raised $14.3 million through 175,000 contributions, averaging $81 a piece. Neugebauer is the co-founder of Quantum Energy Partners, a Houston-based private equity firm in the energy industry. According to Bloomberg News, the firm has managed more than $7 billion in contracts since 1998. Neugebauer is heavily involved in the energy industry, serving as an investment banker or director for a number of companies including Meritage Energy Partners, LLC, QR Energy and Texoil, Inc. He has been referred to in the past by Cruz as a \"key moneyman in the super PACs.\" Cruz is not the first GOP candidate Neugebauer has supported. According to Texans for Public Justice, he donated $110,000 to Rick Perry sometime between 2001 and 2010. The Wilks brothers, from Cisco, Texas, are co-founders of Frac Tech. The hydraulic fracturing company started in 2002 and was then sold by the brothers in 2011 for $3.5 billion. Worth about $1.35 billion each, the brothers started as masons in 1995 but switched to the energy business during the fracking boom. Now they are in the process of buying ranches, including the 62,000-acre N Bar Ranch in Montana for $45 million, according to Forbes. Farris Wilks, a pastor in Cisco, told CNN in a statement last week that Ted Cruz is a strong conservative leader. \"Unless we elect a principled conservative leader ready to stand up for our values, well look back on what once was the land of opportunity and pass on a less prosperous nation to our children and grandchildren,\" Farris Wilks said. \"Thats why we need Ted Cruz.\", Outside of Texas, New York resident Mercer started at IBM as a programmer, and then worked at Renaissance Technologies, an investment management company. He became rich by using computer patterns to \"outsmart the stock market,\" according to the New York Times. He has been a longtime supporter of Republican candidates, funding attack ads against Democratic candidates. Last year, Neugebauer moved to Puerto Rico, which according to public reports drew some questions as the U.S. territory requires minimal taxes for American citizens. Neugebauer said the move was for the benefit of his sons education. \"I wouldnt have moved for the taxes, but it is an interesting proposition,\" he told Bloomberg in 2014.]", "Date": "20150731", "Author": "[Jennifer Reiley, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/article/Houston-investor-donates-almost-a-third-of-Cruz-6417505.php", "Title": "[A few wealthy donors boost PACs backing Cruz]"}