{"Content": "[Caption, Close, Republican presidential candidate, Sen. Ted Cruz, R-Texas, speaks to reporters in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, greets supporters in Little Rock, Ark. Wednesday, Aug. 12, 2015. A woman wearing a Cruz for President tee shirt holds a flag as Republican presidential candidate, Sen. Ted Cruz, R-Texas, speaks while wearing his cowboy boots in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, campaigns in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate Sen. Ted Cruz, R-Texas, poses for a photo with Shannon Hanks of Cabot, Ark. while campaigning in Little Rock, Ark. Wednesday, Aug. 12, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, greets supporters in Oklahoma City, Thursday, Aug. 13, 2015. Cruz is on the final day of a seven-day bus tour through seven southern states. Standing in the back of a pick-up truck, Republican presidential candidate, Sen. Ted Cruz, R-Texas, speaks to supporters in Oklahoma City, Thursday, Aug. 13, 2015. Cruz is on the final day of a seven-day bus tour through seven southern states. LITTLE ROCK, Arkansas (AP)  Ted Cruz sees his way to the White House, and it runs between the hedges, through waters patrolled by the \"Volunteer Navy\" and a spot on the Mississippi River nicknamed Death Valley. Confused? Not if youre one of the voters the Texas senator is counting on to carry him to the Republican presidential nomination. Theyll know thats all part of college football lore in the Southeastern Conference, whose make-up roughly matches the states that will hold primaries next March  right after the kickoff contests in the four early voting states. \"The role of Arkansas and the other states throughout the SEC is to make sure the next Republican nominee for president is a real and genuine conservative,\" Cruz told backers this week in Little Rock. Cruz assures his supporters he is \"all in\" on the early states, which include South Carolina  an SEC state thats accustomed to its prominent role in picking the president. But the \"SEC primary\" is a new phenomenon, with Alabama, Tennessee, Arkansas and others moving up their contests to join Georgia for a Southern-tinged Super Tuesday on March 1. Louisiana and Mississippi host primaries the following week. The tight turnaround, Cruz said in an interview this week, will make it impossible for second-tier candidates to focus exclusively on Iowa or New Hampshire with hopes that an \"unexpected victory\" can translate into national momentum. \"Theres so little time ... to raise money, no time to build infrastructure ... no time to energize the grassroots,\" he said. \"Thats why our strategy is very deliberately playing the long game.\", The Southern stretch is unlikely to put any candidate over the top, since the Republican Party requires that delegates selected in contests held before March 15 be split proportionally among leading vote-getters. Only afterward can a state party opt to award all of its delegates to the top vote-getter. Cruz certainly has competition. Mike Huckabee and Rick Santorum won Southern primaries in their previous White House bids, and retired neurosurgeon Ben Carson and businessman Donald Trump boast notable followings. And Louisiana Gov. Bobby Jindal is from Baton Rouge  the home of Louisiana State. But Cruz and his aides argue the early March primaries will cull the field ahead of the winner-take-all states, and a strong performance there could pit Cruz as conservative standard-bearer against one or two establishment favorites  defined by the Cruz camp as Jeb Bush, Marco Rubio and Scott Walker. And so Cruz spent his week following the first GOP debate making that pitch at more than a dozen stops on a multi-state bus tour through the South, where he quoted scripture, asked supporters to pray for him and delighted big crowds with his usual broadsides against President Barack Obama, Democratic 2016 favorite Hillary Rodham Clinton and the federal government in general. \"Theres no doubt its a total package,\" said Arkansas state Rep. Bob Ballinger, a Cruz supporter. \"Hes also a fiscal conservative. He also just understands the people and is willing to vote and work for the people, which is what excites me about him.\", Cruz started his tour in South Carolina and concluded Thursday in Oklahoma, talking college football and tailoring his rallies to local culture: \"Sweet Tea with Sen. Cruz\" in Memphis and a \"Boots and BBQ\" lunch in Oklahoma City. \"Hes down-the-line everything we stand for, and hes passionate about it,\" said 84-year-old Mary Lou McCoy of Jacksonville, Arkansas. Her husband, 87-year-old Lowell McCoy, stood by in a T-shirt that read: \"liberalism: moochers electing leeches to steal from producers.\", The first-term senator, who built his national profile as a tea party favorite in his 2012 election and subsequent role in partially shuttering the federal government the following year, fills his rallies with humorous takedowns of Obama and Clinton and even GOP leaders. He takes aim at 2012 Republican nominee Mitt Romney, who publicly chided Cruz for hammering Obama as a \"state-sponsor of radical Islamic terrorism\" because of the administrations nuclear deal with Iran. \"If we nominate Democrat-lite, we will lose again,\" Cruz said, a line that drew approval from voters at every stop. ", "Date": "20150813", "Author": "[Bill Barrow, Associated Press]", "Link": "http://www.chron.com/news/texas/article/Ted-Cruz-sees-path-to-White-House-running-through-6442995.php", "Title": "[Ted Cruz sees path to White House running through the South]"}