{"Content": "[Over the past decade, Brazil was poised to rid itself of the moniker, \"country of the future.\" Former President Luiz Incio \"Lula\" da Silva found creative ways to encourage parents to keep their kids in school and get their inoculations. He used the military to break up armed gangs in the notorious favelas. The giant national oil company, Petrobras, used its proprietary technology to unlock the vast \"pre-salt\" oil reserves in the deep water offshore. (Traditional seismic processes could not identify reservoirs because the salt broke up signals.), But on a recent weekend, hundreds of thousands of Brazilians took to the streets to protest corruption, a declining economy and high inflation and demand the ouster of President Dilma Rousseff. Earlier this month, Moodys downgraded Petrobras shares two steps to junk status. I have followed Petrobras since I was a young banker at Texas Commerce Bank in the late 1970s, when we supported our Texas-based clients operating in Brazil. Twenty years later, as director of international government relations at Royal Dutch Shell, I witnessed a period of openness when international companies were welcomed back to Brazil and could elect to operate independently or with Petrobras as partner. Times have changed. Rousseff recently replaced the president of Petrobras in response to a corruption scandal. Billions of dollars reportedly were kicked back to politicians in her coalition government through inflated contracts between contractors and Petrobras. Although she has not been accused personally of corruption, Rousseff was chair of the Petrobras board from 2003-2010, when the scheme mushroomed. Critics question why Petrobras paid nearly $1 billion for the Pasadena  refinery it purchased part of in 2006 - even though it had been sold two years earlier for less than $43 million. Nationalist politicians became increasingly skeptical of Petrobras after it issued a limited percentage of its shares in global capital markets to fund development. They feared that demands of investors would interfere with government goals. So the government created an unwieldy hybrid. A new bureaucracy, Agncia Nacional do Petrleo (ANP), was superimposed to represent the states interests and make key decisions. Petrobras would be the operator for all pre-salt development. Multinational oil companies like ExxonMobil and Chevron would have to accept Petrobras as operator, even though complex offshore operations are their own key strength. This structure is dysfunctional. It breeds organizational confusion, enables corruption and places too heavy a burden on Petrobras, while minimizing the contribution that international companies can make. In October 2013, only one bid was presented at the auction for offshore licenses - it was at the minimum price and minimum local content. There was no licensing round in 2014, and there is talk of deferring a planned auction in the first half of 2015. Foreign investors must use local companies for the bulk of their equipment and service purchases, so-called local-content requirements. While not unusual in the energy industry, Brazils are among the steepest in the world. For the 12th licensing round, the average local content commitment was 70 percent for exploration and 85 percent for development phases. Brazilian engineering and construction firms had a lock on the process, with limited competition from outside the country. It probably wasnt difficult for some executives at Petrobras, the construction companies and politicians to find a mechanism to inflate contracts and privately share the excess. Brazil, saddled with massive amounts of debt, inflation, deferred oil production and endemic corruption, faces current low oil prices from a position of weakness. Rousseff needs to undertake fundamental reforms. Here are four suggestions:, Adopt the model of a country like Colombia that successfully restructured its energy system and the role of its national oil company. A single agency sets policy, negotiates competitive contracts and monitors operations, but doesnt make operational decisions. Establish a transparent system in which qualified local and international companies compete with Petrobras for contracts and operatorship on an equal footing. Change the local content laws to get the best products and services through international competitive bidding. Reconsider a host of other regulatory and legal deterrents, such as labor laws, to see if they really serve to develop human resources in Brazil, or actually prevent workers from becoming internationally competitive. Rousseffs \"Workers Party\" owes it to them. Brazil can regain its momentum and fund its serious social and infrastructure challenges. It doesnt always have to be \"the country of the future.\", , Arnold is a professor in the practice of energy management at Rice Universitys Jones Graduate School of Business. He is a former longtime director of international government relations for Royal Dutch Shell, and also served as senior vice president of the Export-Import Bank in the 1980s.]", "Date": "20150401", "Author": "[William Arnold]", "Link": "http://www.chron.com/opinion/outlook/article/Arnold-6173328.php", "Title": "[Arnold: Oil industry reforms vital to Brazil]"}