{"Content": "[Caption, Close, From left, Democratic candidate Jack Conway, Independent candidate Drew Curtis, and Republican candidate Matt Bevin take the stage for the Kentucky Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sept. 15, 2015. Kentucky Independent gubernatorial candidate Drew Curtis responds to a question during the Kentucky Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sept. 15, 2015. Kentucky Republican gubernatorial candidate Matt Bevin responds to a question during the Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sept. 15, 2015. Kentucky Independent gubernatorial candidate Drew Curtis, right, looks at Democratic candidate Jack Conway as he responds to a question during the Kentucky Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sept. 15, 2015. Kentucky Democratic gubernatorial candidate Jack Conway responds to a question during the Kentucky Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sept. 15, 2015. Kentucky Republican gubernatorial candidate Matt Bevin, right, looks at Independent candidate Drew Curtis, center, and Democratic candidate Jack Conway during the Kentucky Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sept. 15, 2015. Kentucky Republican gubernatorial candidate Matt Bevin responds to a question during the Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sept. 15, 2015. Kentucky Democratic gubernatorial candidate Jack Conway responds to a question during the Kentucky Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sep. 15, 2015. Kentucky Independent gubernatorial candidate Drew Curtis, center, replies to a question as Democratic candidate Jack Conway, left, and Republican candidate Matt Bevin look on during the Kentucky Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sept. 15, 2015. Kentucky Independent gubernatorial candidate Drew Curtis listens to a candidates reply to a question during the Kentucky Bluegrass Poll Gubernatorial Debate at Bellarmine University in Louisville, Ky. Tuesday, Sep. 15, 2015. LOUISVILLE, Ky. (AP)  The person most talked about during Kentuckys first televised gubernatorial debate wasnt even in the building. Rowan County Clerk Kim Davis, whose refusal to issue marriage licenses to same-sex couples landed her in jail and ignited passions across the country, basically hit the reset button on the high-stakes race. During an hour-long debate at Bellarmine University that was broadcast live in the states two biggest media markets, the candidates faced a question about whether Davis decision could hurt the states business recruitment efforts. Democrat Jack Conway answered a question from Republican rival Matt Bevin on why he did not defend the states same-sex marriage ban last year. And a viewer from Davis county asked why she had not been charged with official misconduct. \"My intention has always been to execute this race on financial issues, on economic issues,\" Bevin told reporters after the debate, which was sponsored by The Bluegrass Poll partners. \"In the last several weeks, 85 percent of what people talk about are these social issues. ... I think the issue has redefined this race whether any of us candidates want that to be the case or not.\", Conway, the two-term Democratic attorney general, tried to focus on economic issues, questioning Bevins handling of his personal and corporate taxes and his lack of support for public-private partnerships that Conway says will be crucial to creating job opportunities for Kentuckians in the next decade. But he spent a lot of time defending his decision to not appeal a federal judges decision to overturn Kentuckys same-sex marriage ban last year and his criticism of Davis for refusing to obey a federal judges order to issue marriage licenses. \"The states highest court has said my duty is to tell the state when things are unconstitutional. Thats what I did. I did that to save us money,\" Conway told Bevin during one of the debates more heated exchanges. \"And that is very different, Mr. Bevin, that is very different than ignoring a federal judges court order. We are a nation of laws.\", Kentucky is one of the few states that elects governors in odd-numbered years, making it the only heavily contested political race in the country and a precursor to the 2016 presidential election. Until now, the race has mostly focused on health care  specifically Democratic Gov. Steve Beshears decision to expand the states Medicaid eligibility under the provisions of the federal Affordable Care Act. The expansion has brought health insurance to more than 400,000 people, many for the first time. But it costs taxpayers more money to pay for all of those people, and Republicans have questioned whether the state can afford it given Kentuckys skyrocketing public pension debt. Medicaid is a complex issue, making it difficult for the candidates to build their campaigns around it. But Davis refusal to issue marriage licenses for same-sex couples ignited the passions of religious conservatives in an already conservative state and gave them a cause to rally around. University of Kentucky political science professor Stephen Voss said a race focusing on social and cultural issues will be \"bad for Conway.\", \"He needs to get people thinking about their pocketbooks to improve odds about a Democratic victory,\" Voss said. Conway tried to do that on Tuesday, focusing his attacks on Bevin for his past statements questioning the effectiveness of early childhood education and for refusing to release his personal tax returns. \"Mr. Bevin is fond of going around saying, Who do you trust? I dont think you trust someone who has had his own problem with tax issues and wont release his tax returns,\" Conway said.]", "Date": "20150915", "Author": "[Adam Beam, Associated Press]", "Link": "http://www.chron.com/news/article/Bevin-hopes-to-redefine-governor-s-race-on-6507325.php", "Title": "[Bevin hopes to redefine governor's race on marriage issue]"}