{"Content": "[Caption, Close, Protesters gather outside City Hall after a proposed compromise was announced on May 13 in the Houston Equal Rights Ordinance. Jared Woodfill, left, David Welch, right, and others with a group seeking to repeal Houstons equal rights ordinance delivered boxes of signatures to the office of the Houston city secretary on July 3. Flanked by clergy, Mayor Annise Parker announces that the city will withdraw subpoenas issued in a lawsuit over Houstons equal rights law. Former City Council member Jolanda Jones speaks on the equal rights measure in August. In 2014, Rev. Dave Welch, executive director of the Texas Pastor Council, addresses the media after Mayor Annise Parker, City Attorney David Feldman and Council Member Ellen Cohen announced that the petition to repeal the Houston equal rights ordinance adopted by the City Council in May has fallen short of the number of signatures required due to errors in the signature collection process, With a ruling expected next week in the protracted legal battle surrounding Houstons equal rights ordinance, city attorneys entered a motion for judgment late Friday afternoon that says opponents of the law are 650 signatures shy of triggering a repeal referendum. District Judge Robert Schaffer will hold a formal hearing Monday morning. The citys latest count puts conservative opponents of the law closer to triggering a vote than ever before, but still short of the needed 17,269 valid signatures. \"Under the jurys verdict, and under any honest application of the courts rulings, plaintiffs lose, the city wins, and civil rights are safe in Houston, Texas,\" said Geoffrey Harrison, lead attorney for the city. The plaintiffs have yet to submit their updated tally but say theyre well over the threshold.At issue in the case is not the law itself, but whether opponents submitted a repeal referendum petition last summer with enough valid signatures. The city says the petition was riddled with forgery and errors, and rejected it on those grounds. Opponents, largely conservative activists, sued the city, saying it sought and falsely found problems with the petition. Approved last May by the City Council, the ordinance bans discrimination among businesses that serve the public, private employers, in housing and in city employment and city contracting. The ordinance itself remains on hold while the courts sort out the repeal referendum petition issue. Critics largely take issue with the protections the law extends to gay and transgender residents.After a lengthy jury trial earlier this year, attorneys were still parsing issues such as penmanship and legibility as they filed dueling tallies to comply with the jurys findings. Weeks later, Schaffer issued a series of instructions that upheld some of those findings and did away with others and led to yet more counting. At a hearing in late March, the city said the plaintiffs were still about 3,000 signatures short. But after receiving new instructions from Schaffer, the city credited the plaintiffs with about 2,500 more signatures that they had previously deemed illegible. Andy Taylor, attorney for the plaintiffs, said he was not fazed by the citys filing Friday and would submit his own count Monday proving opponents have a valid petition. \"Im excited to report that our number exceeds the minimum number required so were going to get to have an election for the city of Houston,\" Taylor said.]", "Date": "20150410", "Author": "[Katherine Driessen]", "Link": "http://www.chron.com/news/politics/houston/article/Margin-in-HERO-cases-narrows-as-ruling-nears-6192495.php", "Title": "[Ruling nears in Houston equal rights case]"}