{"Content": "[Caption, Close, Rep. Ken Paxton, R-McKinney, addresses  the opening session of the 82nd Texas Legislature, Tuesday, Jan. 11, 2011, in Austin, Texas.  (AP Photo/Eric Gay), AUSTIN - Texans for Public Justice on Monday re-filed its criminal complaint against Attorney General Ken Paxton with local prosecutors in Dallas and Collin Counties, arguing the latter should recuse himself because of conflict of interest concerns. \"Mr. Paxtons conduct demands a thorough and independent investigation,\" Craig McDonald, executive director of Texans for Public Justice, wrote to Collin County District Attorney Greg Willis. \"We further believe that as a friend and business associate of Mr. Paxton that you should recuse yourself from this matter. To ensure independent and impartial judgment, you should forward our complaint to the proper judicial authority to appoint an independent special prosecutor to investigate Mr. Paxtons conduct.\", Read TPJs complaint letter to Collin County District Attorney Greg Willis, Read TPJs complaint letter to Dallas County District Attorney Susan Hawk, Last April, Paxton admitted to and was fined $1,000 for repeatedly violating state securities laws in 2004, 2005 and 2012 by soliciting clients for his friend and business associate Frederick \"Fritz\" Mowery without being properly registered with the state. Soon after, Texans for Public Justice filed a criminal complaint with the Public Integrity Unit of the Travis County District Attorneys office, pointing out the securities law violations that Paxton had admitted to committing were third-degree felonies. Travis County District Attorney Rosemary Lehmberg put the investigation on hold until after the November election, but announced in late January that Travis County was not the appropriate venue. It sent letters referring the case to both those counties district attorneys. Dallas County District Attorney Susan Hawk soon after said she did not believe her office had venue over any alleged crimes, leaving Willis the sole remaining prosecutor to consider Paxtons case. A first assistant district attorney in Willis office, however, said March 27 that it had taken no action on the case because \"we are not an investigative agency.\", McDonald has accused Collin County of \"stonewalling\" his groups efforts because of Willis long-time friendship and business relationship with the new attorney general. The two men have known each other for more than 30 years and have invested in at least four different ventures together. The conflict of interest problems McDonald cites in his letter also have concerned lawmakers considering a proposal to move the Public Integrity Unit outside of Travis County. Sen. Kel Seliger, R-Amarillo, on Friday also called for Willis to recuse himself, and said the concerns the Paxton case raises illustrate the pitfalls of handing public corruption cases to hometown prosecutors who inevitably have deep ties with local politicians.]", "Date": "20150406", "Author": "[Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Watchdog-group-to-Collin-County-DA-Recuse-6181378.php", "Title": "[Watchdog group to Collin County DA: 'Recuse yourself' from Paxton case]"}