{"Content": "[Caption, Close, Texas Attorney General and Gov.-elect Greg Abbott speaks against President Barack Obamas executive order on immigration at the Price Daniel Building in Austin, Texas, on Monday, Nov. 24, 2014. Abbott is again vowing to sue the Obama administration for lifting the threat of deportation from millions of immigrants living illegally in the United States. (AP Photo/Austin American-Statesman, Jay Janner), Heading into what could be another consequential week for Barack Obamas immigration policy, Gov. Greg Abbott continued to voice confidence Sunday that Texas would ultimately prevail in its high-profile legal challenge to the presidents executive action. In two interviews broadcast from the nations capital, the former attorney general reiterated his belief Texas will fight Obamas move all the way to the U.S. Supreme Court, where the state \"should win unanimously.\" Abbott also predicted the odds are \"close to zero\" of the Obama administration securing a stay of a federal judges order last week to halt the implementation of the action, which would shield up to 5 million illegal immigrants from deportation. \"It shows how dangerous this president is to the Constitution. He feels like there are no guardrails to his limits,\" Abbott said during an interview on Fox News, hours before he was due at the White House to have dinner with Obama and other governors. The federal governments response to the ruling further came into focus Sunday as Jeh Johnson, secretary of the U.S. Department of Homeland Security, said it would likely appeal the decision Monday. The White House said Friday it expected to seek a stay of the ruling \"by Monday at the latest,\" effectively asking for the program to proceed while the lawsuit plays out. \"We will appeal and we will seek a stay so that we can go back to implementation of our efforts to build accountability in the non-documented community,\" Johnson said on CNNs \"State of the Union.\", Carl Tobias, a law professor at the University of Richmond, said he expects the courts involved to act quickly, potentially providing the Supreme Court the opportunity to rule on the request for a stay by the end of the week. U.S. District Judge Andrew Hanen of Brownsville, who issued the temporary injunction that put the action on hold Monday, will probably reject the White Houses arguments for a stay, sending the decision to the federal appeals court in New Orleans, Tobias said. Abbott was spending the weekend in Washington to attend meetings for the National Governors Association and Republican Governors Association. As part of the NGA activities, Abbott was scheduled to join other governors for a dinner at the White House with Obama, first lady Michelle Obama, Vice President Joe Biden and second lady Jill Biden. \"Within this room, were not going to agree on everything, but I am committed to working with each and every one of you over the next two years to keep making progress,\" : Obama told the governors Sunday evening in the State Dining Room, according to a transcript of his remarks provided by the White House. Abbott, who sued the federal government more than 30 times as attorney general, took note of the \"irony\" of the situation in a tweet sent after the dinner. He attached a photo of rock band Hall & Oates performing at the White House. Abbotts last lawsuit  the one challenging the executive action  has cemented him as a national political figure in the months following his landslide victory over Democratic opponent Wendy Davis. In an appearance on CBSs \"Face the Nation,\" Abbott flirted with his potential role as a kingmaker in the 2016 presidential race, which could feature as many as five Republicans with ties to Texas. \"The odds favor that the next president, at least the Republican nominee, is going to have a Texas connection,\" Abbott told host Bob Schieffer before repeatedly declining to say whether he favors any potential candidate. Abbott did, however, lay out his prescription for the GOP nominee: \"Well, what Im looking for is to ensure, for one, that we have a nominee that is committed to what I am most committed to. And that is someone who is going to follow the Constitution and apply the Constitution, second, someone who is going to step up and do what the American people are demanding, and that is to secure our border.\", In December, Abbott was more tight-lipped on the topic, telling the host of another Sunday show  Chuck Todd of NBCs \"Meet the Press\"  that he would be \"staying out of the primary.\"]", "Date": "20150222", "Author": "[Patrick Svitek]", "Link": "http://www.chron.com/news/politics/texas/article/Greg-Abbott-confident-as-White-House-prepares-6095230.php", "Title": "[Greg Abbott confident as White House prepares response to immigration ruling]"}