{"Content": "[Islamic State extremists captured the ancient Syrian town of Palmyra after government defense lines there collapsed Wednesday, a stunning triumph for the group only days after it captured the strategic city of Ramadi in Iraq. It was unclear by nightfall how close to Palmyras famed archaeological site the militants had advanced, activists said, adding that Syrian soldiers were seen fleeing the area. The ruins at Palmyra are one of the worlds most renowned historic sites and there were fears the extremists would destroy them as they did major archaeological sites in Iraq. The UNESCO world heritage site is famous for its 2,000-year-old towering Roman-era colonnades and other ruins and priceless artifacts. Before the war, thousands of tourists a year visited the remote desert outpost, a cherished landmark referred to by Syrians as the \"Bride of the Desert.\", Smoke rises after a Syrian rocket launcher shell on enemy positions in the ancient city of Palmyra on May 19, 2015. Smoke rises after a Syrian rocket launcher shell on enemy positions in the ancient city of Palmyra on May 19, 2015. The fall of the town to the Islamic State group after a week of fighting was an enormous loss to the government, not only because of its cultural significance, but because it opens the way for the extremists to advance to key government-held areas, including Damascus and the Syrian coast to the south and southwest, as well as the contested eastern city of Deir el-Zour to the east. Next to it are also important gas and oil fields in the countrys central region. It was not immediately clear how close the militants were to the ruins, which are just southwest of the town. \"I am terrified,\" said Maamoun Abdulkarim, Syrias director-general of antiquities and museums. \"This is a PR battle for Daesh, and they will insist on scoring victory against civilization by destroying\" the ancient ruins, he said, using the Arabic acronym for the group. The fall of Palmyra just days after Islamic State fighters seized the strategic Iraqi city of Ramadi showed the extremists ability to advance on multiple fronts at opposite ends of a sprawling battlefield that spans the two countries and erased any sense that recent IS losses in Tikrit and elsewhere had dealt a major blow to the militants. The Syrian Observatory for human rights reported that government forces collapsed in the face of IS attacks and withdrew from the town late Wednesday. Beibares Tellawi, an activist in Homs province, also confirmed IS was in control of the town. He said the militants had reached the notorious Tadmur prison, where thousands of Syrian dissidents have been imprisoned and tortured over the years. The fate of the prisoners, believed to number around 1,000, was not immediately known. Syrian state TV acknowledged that pro-government forces had withdrawn from Palmyra, and the IS-affiliated Aaamaq News Agency reported the town was \"under the complete control of the Islamic State fighters.\" IS fighters had also seized control of the Jazl oil field in the Homs countryside, the Aaamaq report said. Earlier Wednesday, Homs governor Talal Barazzi said Islamic State militants had infiltrated overnight into some districts in the northern part of Palmyra and were engaged in fierce gun battles with government forces as snipers roamed the streets. He said at least 19 people had died by early Wednesday, including seven civilians and 12 from the pro-government militia known as the National Defense Forces. It was not immediately known how many people died as fighting continued throughout the day. Abdulkarim said workers were able to save hundreds of statues and masterpieces from Palmyra that were transported to safe houses in Damascus. \"But how do you save colonnades that weigh a ton? How do you save temples and cemeteries and, and, and?\" he asked. He appealed to the international community to declare \"a red line\" around Palmyra and called on the U.S.-led coalition to \"at least prevent IS convoys from reaching it.\", Until now, U.S.-led airstrikes in Syria have focused on areas outside Syrian government control so as not to appear to be aiding President Bashar Assad. Syrian antiquities expert and opposition figure Amr Al-Azm noted the irony of anti-Assad activists having to call on the U.S.-led coalition to support Assads forces in the city against the Islamic State militants. \"We are trapped in a sickening paradox where, to save the world heritage site of Palmyra we are forced to call on the international community and the coalition to attack ISIS forces in support of the Syrian regime, which is defending the city,\" he wrote in a Facebook posting this week. The majority of the ruins are located in Palmyras south, and the militants entered Wednesday from the north after seizing the state security building from government forces. But their presence has sparked concerns they would destroy the ruins as they have done with major archaeological sites in neighboring Iraq. The Islamic State groups advance in Syria followed a major military victory in neighboring Iraq, where the militants captured the strategic city of Ramadi, capital of the countrys largest Sunni province, over the weekend. Thousands of displaced people fleeing the violence in Ramadi and western Anbar province poured into Baghdad on Wednesday after the central government waived restrictions and granted them conditional entry. The exodus is the latest in the aftermath of the fall of Ramadi. The Shiite-led government in Baghdad is struggling to come up with a plan to reverse the astonishing loss, pledging a counter-offensive and relying on Iranian-backed Shiite militiamen to join the battle. Athal al-Fahdawi, an Anbar councilman, said that thousands of civilians from Ramadi who were stranded on open land for days, are now being allowed to cross a bridge spanning the Euphrates River and enter Baghdad province. On Tuesday, Anbar officials said five of the displaced residents had died from exhaustion in the Bzebiz region, where the displaced had been forced to stay while they were kept away from Baghdad. According to the International Organization for Migration, more than 40,000 people have been displaced from Anbar since Friday when the militants began their final push for Ramadi. In the past, people fleeing the Sunni province have been prevented from entering Baghdad due to fears that militants might mingle in with the crowds and sneak into the Iraqi capital. Residents still left in Ramadi told The Associated Press by telephone Wednesday that Islamic State militants were urging them over loudspeakers not to be afraid and to stay in the city. However, they were not preventing those wanting to leave the city to go, the residents said, speaking on condition of anonymity for fear for their safety. It is still unknown when the Iraqi governments expected wide-scale operation to recapture Ramadi and other cities will start. Baghdad officials and leaders of the so-called Popular Mobilization Units, Shiite militias who are fighting on the side of the Iraqi military and security forces, have repeatedly said they need time for a military buildup and reconnaissance. Associated Press]", "Date": "20150520", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-islamic-state-20150520-story.html", "Title": "[Islamic State seizes ancient town of Palmyra in Syria]"}