{"Content": "[Opponents of the Iran deal arent expecting the congressional vote next month to go their way, but they are already planning for the day after their loss. Republicans in Congress are preparing several bills to sanction Iran. Even if those never reach a vote, the proposals could be problematic for Democrats well into 2016. The White House has compared the Iran deal to Obamacare in terms of its historical impact. Republicans agree. \"The analogy to the Affordable Care Act is ringing in my ears,\" said Representative Mike Pompeo, one of several Iran deal critics developing new sanctions proposals. \"The American people get who the Iranian regime is. The American people will reward elected officials who do the right thing.\", All the proposals seek to capitalize on the administrations promise to keep up pressure on Iran for its non-nuclear mischief, including over its support for regional terrorism and its human rights record. And Pompeo says new sanctions have a chance of passing, even if Congress cant block Obamas deal. \"Weve seen 400 votes plus for significant sanctions. This wouldnt be terribly different from that in substance,\" said Pompeo. \"The arguments would be the same.\", In the House, Foreign Affairs Committee Chairman Ed Royce already has a new sanctions bill that could be resurrected in the fall. That bill was similar to legislation put forth during the nuclear negotiations, by Sens. Mark Kirk and Robert Menendez, a Republican and a Democrat. In the Senate, Kirk is now working with Marco Rubio to explore new legislation, several Senate aides said. Menendez is working separately with Lindsey Graham. Kirk and Menendez also have a bill to reauthorize the Iran Sanctions Act, set to expire at the end of 2016, for 10 more years. Top Obama administration officials including Secretary of State John Kerry and Treasury Secretary Jack Lew warned lawmakers in testimony last month against putting new sanctions on Iran, even if they focus on non-nuclear issues. Lew said Congress \"cannot just reimpose the nuclear sanctions with a new label.\", The Iranians are worried about new sanctions bills as well. The Iranian representative to the United Nations wrote to the president of the UN Security Council last month to warn that Iran \"may reconsider its commitments\" under the deal if there were \"new sanctions with a nature and scope identical or similar to those that were in place prior to the implementation date, irrespective of whether such new sanctions are introduced on nuclear related or other grounds.\", Spokesmen for both McConnell and House Speaker John Boehner told me those leaders have not taken a stance for or against voting on sanctions after the Iran deal is in effect. But nuclear experts said the bills could have an effect even if they did not reach the floor of either chamber. Mark Dubowitz, the executive director of the Foundation for the Defense of Democracies and a leading critic of the deal, said that a debate over new sanctions legislation would send a signal to banks and companies all over the world. \"The new bills are going to seek to basically raise the risk of premature commercial and financial engagement with Iran,\" he said. That could give the next president more flexibility to unwind the deal, as most Republican candidates have promised to do. Many of the bills will target the Iran Revolutionary Guard Corps, which is responsible for Irans foreign violence and controls key sectors of the Iranian economy such as energy, mining, shipping and automobiles. If the House or the Senate does vote on the new sanctions bills, he said, Democrats will be forced to go on the record opposing or supporting a bid to pressure one of Irans worst actors. If the administration opposes sanctions over human rights and terrorism, Dubowitz said, it is essentially saying \"there would be no way to impose meaningful pressure on Iran.\", Supporters of the deal point out that even after the deal is implemented and some sanctions are lifted, there will still be a host of U.S. sanctions in place, over Irans terrorism and human rights abuses. The Republicans behind these proposals are not trying to make serious policy, said Joel Rubin, former State Department official who now heads the Washington Strategy Group. \"Its redundant and unnecessary,\" he said. \"This smells like an attempt to create a political argument that survives the failure to block the deal. If they want to make this an electoral issue in 2016, this is the way to do it.\", The Iran deal is unpopular with voters, especially in key 2016 presidential election swing states. Hillary Clinton has cautiously supported the Iran deal, but has also focused on the need to confront Irans other behavior. This effort could put her in a difficult position. There is little chance any of the new Iran bills will become law, but Republicans dont need the measures to pass, or even be voted on. Just debating the idea of new sanctions could hurt Democrats - just as Obamacare did in 2010. *****, , Josh Rogin is a Bloomberg View columnist who writes about national security and foreign affairs. For more columns from Bloomberg View, visit http://www.bloomberg.com/view]", "Date": "20150825", "Author": "[Josh Rogin, Bloomberg View]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-declassified25-20150825-story.html", "Title": "[Republicans plan new sanctions on Iran, despite deal]"}