{"Content": "[A few years after Jimmy Carter left the White House, I went to interview him at his cabin on Turniptown Creek in the mountains of north Georgia. I found him standing alone on the wooden porch, a thin, white-haired man, smaller than Id expected. He was smiling. And he was barefoot. I couldnt help myself. I stared. At his feet. This was Jimmy Carter. President Jimmy Carter. Even if we were there to talk about his new fly-fishing book, didnt he want to look like a man of power, which generally requires shoes?, He patted the wet socks on the porch railing to see if they were dry nope then settled into a rocking chair to talk, not as a man of power but as a man at peace. That afternoon on the porch, I was struck by Carters ease, and not only with his bare feet. One sentence, in particular, stayed with me. \"I have an easy way of accommodating the vicissitudes of life,\" he said. On Thursday, at the age of 90, Carter displayed that ease when he met the media to say that cancer had spread to his brain. He sat alone at a long table in the same way hed sat on his cabin porch, without fidgeting, smiling, happy to talk. For almost 40 minutes, he answered reporters questions as if he had no one better to talk to, nowhere else to go, when, in reality, he was headed for radiation treatment. \"Im perfectly at ease with whatever comes,\" he said, a statement that within a couple of hours had become a popular Internet meme. Mellow people dont get elected president, so it would be wrong to cast Carter as mellow. But over and over, decade after decade, culminating in Thursdays press conference, he has shown himself to possess characteristics we wish for in our leaders and too seldom see. Jimmy Carter was the 39th president of the United States, from 1977 to 1981. He was awarded the 2002 Nobel Peace Prizefor his work with the Carter Center. Generosity. Conviction tempered by humility. A humility that doesnt negate pride. An understanding that people with power have an obligation to help people without it. A clarity of vision that translates as ease. You might call it goodness. We could argue over whether Carter was a good president, but one thing is hard to dispute: He is a good man. Not perfect. Good. Its goodness built not on words but on action. He has used his name and influence all over the world, to build houses for the poor, to create fair elections, to stand up for the rights of women. His great last wish?, \"Id like for the last Guinea worm to die before I do,\" he said Thursday, becoming no doubt the first politician ever to announce that his dying wish is the eradication of a parasitic disease. In his long public life, Carter has been both ridiculed and revered, but as he gets closer to the end, the reverence grows. He has become like a national grandfather, the elder whose waning makes us take stock of where weve been, where were headed, what well lose when the old man goes. What well lose is the rare politician who has so fully lived the ideals he preached. A couple of years after I talked to Carter on his porch, I went to Plains, Ga. to do a story on how his tiny hometown, after a brief stint as a huge tourist attraction, had resumed its sleepy life. In the window of his cousin Hugh Carters antiques store full of dusty Jimmy Carter postcards and old Jimmy Carter fly swatters was a small sign: \"Pres. Jimmy Carter will teach the Sunday school lesson this week at Maranatha Baptist Church. You are invited. 10 a.m.\", I went to the little church that Sunday and sat on one of the folding chairs with about 60 other people. \"How many of you have heard me teach before?\" Carter asked. Only a dozen or so hands went up. \"Thats the problem,\" he said. \"People hear me teach once and they dont come back.\", He grinned. They laughed. For the next hour, he talked about religious pluralism, eternal life and the importance of contributing to the public good. More than any living president, Jimmy Carter summons us to contribute to the larger good. He helps us see the best in who we are as a country and who we might be. He helps us feel a little easier about ourselves and a little uneasier too. He reminds us theres so much more to do. May he have some ease in the coming vicissitudes. mschmich@tribpub.com, Twitter @MarySchmich]", "Date": "20150820", "Author": "[Mary Schmich]", "Link": "http://www.chicagotribune.com/news/columnists/schmich/ct-jimmy-carter-mary-schmich-0821-met-20150820-column.html", "Title": "[Jimmy Carter's ease amid cancer struggle a lesson in grace]"}