{"Content": "[In Illinois, the current legislative maps were drawn by Democrats to elect Democrats. In Texas, they were drawn by Republicans to elect Republicans. Wherever politicians control the process of redistricting, the goal is to make sure some votes count more than others. The U.S. Supreme Court has been asked many times to overrule outrageously gerrymandered maps, but the justices have never been sufficiently outraged. Redistricting is inherently political, theyve said, and no lawsuit has offered a \"workable yardstick\" to determine whether politicians have gone too far. This week, the justices agreed to consider a case alleging that Texas maps violate the constitutional principle of one person, one vote. But the suit isnt complaining about gerrymandering. Plaintiff Sue Evenwel, a county chairwoman for the Texas Republican Party, says the maps are flawed because theyre based on the U.S. census numbers, which count citizens and noncitizens alike. Though the districts are roughly equal in population, some of them have large numbers of Latino immigrants who arent eligible to vote. That creates \"gross disparities\" among districts, the suit says. Evenwel lives in a rural district with a high concentration of eligible voters; some urban districts have far fewer residents who are qualified to vote. That means Evenwels vote carries less weight, she says. The suit filed by a group called the Project on Fair Representation, which has challenged portions of the federal Voting Rights Act argues that the maps should be based on the population of eligible voters, not the overall head count. Where those figures would come from is a good question, speaking of workable yardsticks. The suit offers five metrics that produced widely varied counts. The Supreme Court took the case after a panel of three federal judges said states are free to decide what population figures to use. If the citizens of Texas or, ahem, Illinois are worried about the one person, one vote principle, a better solution is to take redistricting out of the hands of the politicians. Those misshapen districts are crafted to undermine the democratic process, not to facilitate it. Take Texas 35th Congressional District, for example. Nicknamed the \"upside-down elephant,\" its long, skinny \"trunk\" connects parts of Austin and San Antonio. The Washington Post called it one of the 10 worst gerrymanders in America. (See for yourself.)It was drawn to corral as many liberal voters as possible in a single district. A study by Silicon Valley Data Science says the Texas Republicans who drew the congressional map helped themselves to two extra seats in the U.S. House. Sound familiar? Thats how Illinois House Speaker Mike Madigan and Senate President John Cullerton roll too. After Democrats lost four congressional seats in the 2010 midterm elections, they adjusted the map to oust four Republicans in 2012. They owe their domination of the legislature to their diabolical mapmaking too. For example: In House races in November, Democrats received 50.6 percent of the vote statewide and Republicans received 49.4 percent, according to a State Board of Elections analysis done for Tribune columnist Eric Zorn. But Democrats won 71 of 118 seats, or 60 percent. In more than half the districts, the maps are so rigged that only one candidate bothered to run. So much for choosing your representatives. Last week, Republicans in Springfield proposed constitutional amendments to impose term limits and create an independent commission to draw legislative maps. But theres no chance Democratic leaders will let those amendments come to a vote. If this is going to happen, citizens will have to bypass the people who have a stranglehold on the legislature. Want to make your ballot meaningful again? Get behind the Independent Map Amendment. A statewide coalition is circulating petitions in support of the measure, which would assign the redistricting process to an 11-member commission. Anyone could apply for a spot on the panel. A review panel would select a racially and geographically diverse pool of 100 applicants after screening for conflicts of interest. Seven would be selected from the pool at random, with no more than two from the same political party. Legislative leaders would pick the last four, also from the pool. The commission would seek public input and draw the maps in the open. To avoid busting communities, the maps would respect racial and geographic boundaries. Voting history and the addresses of incumbents would not be considered. Supporters need 300,000 valid signatures maybe double that, to cushion against legal challenges to put the measure on the November 2016 ballot. So watch for the canvassers with the clipboards. Or visit the websiteand download a petition and instructions for submitting it. Politicians have hijacked the redistricting process to keep themselves in power. By manipulating the maps, they ensure that some votes count more than others. Some dont count at all. Take back the ballot. Take back your state.]", "Date": "20150527", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-remap-texas-illinois-supreme-court-edit-20150527-story.html", "Title": "[Make your vote count. Sign the remap petition]"}