{"Content": "[These are tough times for patriotism. In March, a Georgia man who described himself as a \"patriot\" was charged with planting a bomb in the hope that Muslims would be blamed. And what NFL team has the worst reputation for cheating? The Patriots. As we mark Independence Day, lets wave the flag for some little-known facts about patriots:, 1. Two Illinois women named Mary made an enormous impact on the medical treatment of Union soldiers wounded during the Civil War. Mary Livermore, of Chicago, was a top official of the U.S. Sanitary Commission and was in charge of cleaning and supplying hospitals along the Mississippi River. Mary Ann Bickerdyke, of Galesburg, served on 19 battlefields and fought filthy hospital conditions, often clashing with the men running the facilities. When one official complained to Gen. William Sherman about her, he responded: \"She outranks me.\", 2. The controversial 2001 law passed in the wake of the Sept. 11 attacks is known as the Patriot Act, but its actually the USA PATRIOT Act, an acronym for Uniting and Strengthening America by Providing Appropriate Tools Required to Intercept and Obstruct Terrorism. 3. Next time you curse a jury summons, remember the story of George F. Porter. The Texas community college president had twice been summoned to jury service in Dallas and summarily sent home because he was black. When he was called a third time, in September 1938, he decided enough was enough. After refusing to leave, Porter was thrown down the courthouse steps by two thugs. He picked himself up, pushed his way through a crowd of angry white men and sprinted to the courtroom. He never did get to sit on that jury, but his story made national news, and a young NAACP lawyer took notice. His name was Thurgood Marshall. Just a few weeks after Marshall visited, the offending judge impaneled a black juror. 4.Abigail Adams was so adamant about womens rights that she threatened to revolt against the American revolutionaries. \"Remember all men would be tyrants if they could,\" she wrote her husband, John Adams, in 1776. \"If particular care and attention is not paid to the ladies, we are determined to foment a rebellion, and will not hold ourselves bound by any laws in which we have no voice or representation.\" Even so, full voting rights for women wouldnt come for nearly a century and a half. Common was the view of Thomas Jefferson, who wrote that \"the tender breasts of ladies were not formed for political convulsion.\", Abigail Adams, shown here in this 1776 Benjamin Blythe painting from the Massachusetts Historical Society, may have been a revolutionary era feminist according to some historians. In March 1776 she told her husband, John, second president of the U.S. \"Remember the ladies.\", Abigail Adams, shown here in this 1776 Benjamin Blythe painting from the Massachusetts Historical Society, may have been a revolutionary era feminist according to some historians. In March 1776 she told her husband, John, second president of the U.S. \"Remember the ladies.\", 5. The Patriot Movement in the United States is often vehemently anti-government and enjoying renewed popularity. According to the Southern Poverty Law Center, in 2013 there were 1,096 such groups, of which 240 were militias, a big jump from 2008, when there were just 43 militias among 131 groups. The movement, which emerged in the 1990s after the Ruby Ridge and Waco incidents, birthed Timothy McVeigh and Terry Nichols, who were responsible for the worst domestic terrorism attack in U.S. history: the Oklahoma City bombing in April 1995. 6. Louis Post was a paper pusher, but he also was a patriot. During the Red Scare in 1919, U.S. Attorney General A. Mitchell Palmer and his aide J. Edgar Hoover ordered widespread arrests and deportations of suspected radicals, and the paperwork fell to Assistant Labor Secretary Post. The bureaucrat determined that many of the actions were illegal, and he refused to endorse them. That courageous stand inspired calls for Posts firing, but it also blunted the so-called Palmer Raids, remembered today as one of the worst violations of civil rights in the nations history. 7. U.S. history has sometimes overlooked blacks military contributions, so its worth noting that you may have an African-American named Jacob Peterson to thank for your three-day holiday weekend. In 1780, Peterson and another militiaman raised the alarm after spotting the British sloop Vulture in New Yorks Hudson River, and their comrades cannon fire forced the ship downriver. That left British spy John Andre without a ride back to New York City after his secret meeting with Gen. Benedict Arnold, and Andres capture unraveled Arnolds plot to surrender West Point. Had Arnold succeeded, the War of Independence might have ended quite differently. 8. Americans arent the only people who are patriots. Russians refer to their victorious struggle against Nazi Germany as the Great Patriotic War. Ukraine, attempting to distance itself from Russia, decided last year to stop referring to the Great Patriotic War in its textbooks and simply consider it part of World War II. Last month, Russian leader Vladimir Putin opened a theme park called Patriot Park, featuring heavy weapons for kids to climb on and army rations for lunch. 9. One of the darkest days in U.S. history was March 16, 1968, when U.S. soldiers murdered as many as 500 unarmed Vietnamese civilians, including women and children, in the My Lai massacre. One American serviceman, though, tried to stop the killing. Warrant Officer Hugh Thompson, a helicopter pilot, witnessed the bloodbath in progress and landed his chopper to protect villagers from fellow soldiers, ordering his crew to train their guns on a group of GIs until he led the civilians to safety. For his trouble and for testifying against his fellow soldiers, Thompson was vilified and ostracized by his brothers in uniform, the American public and officials who questioned his motives and his integrity. It wasnt until 1998 that Thompson was awarded the Soldiers Medal, for heroism not involving conflict with an enemy. Later he said, \"Dont do the right thing looking for a reward, because it might not come.\", 10. Historians generally agree that only a minority of the colonists actively supported the American Revolution. Most people in the colonies either avoided staking out a position or were loyalists. And since our Founding Fathers were officially British subjects, they were considered by many to be traitors, not patriots. Obviously, they got the last word. Mark Jacob is the Tribunes associate managing editor for metro news; Stephan Benzkofer is the Tribunes weekend editor. mjacob@tribpub.com, sbenzkofer@tribpub.com, SOURCES: \"Herstory: A Womans View of American History\" by June Sochen; \"American Patriots: The Story of Blacks in the Military From the Revolution to Desert Storm\" by Gail Buckley; \"Peekskills African American History\" by John J. Curran; \"The Deportations Delirium of Nineteen-Twenty\" by Louis F. Post; \"Thurgood Marshall: American Revolutionary\" by Juan Williams; \"The My Lai Massacre in American History and Memory\" by Kendrick Oliver; \"My Lai: An American Atrocity in the Vietnam War\" by William Thomas Allison; Southern Poverty Law Center; New York Times; euromaidanpress.com; theguardian.com; masshist.org.]", "Date": "20150703", "Author": "[Mark Jacob, Stephan Benzkofer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-american-revolution-patriots-abigal-adams-timothy-mcveigh-perspec-0705-jm-20150703-story.html", "Title": "[10 things you might not know about patriots]"}