{"Content": "[Republican presidential candidate Donald Trump wants to deny citizenship to the babies of immigrants living in the U.S. illegally as part of an immigration plan that emphasizes border security and deportation for millions. He would also rescind Obama administration executive orders on immigration. Trump described his expanded vision of how to secure American borders during a wide-ranging interview Sunday on NBCs \"Meet the Press,\" saying that he would push to end the constitutionally protected citizenship rights of children of any family living illegally inside the U.S. Mark Halperin and John Heilemann discuss Donald Trumps trip to the Iowa State Fair and the release of his immigration plan on With All Due Respect. Aug. 17, 2015. (Bloomberg), Mark Halperin and John Heilemann discuss Donald Trumps trip to the Iowa State Fair and the release of his immigration plan on With All Due Respect. Aug. 17, 2015. (Bloomberg), \"They have to go,\" Trump said, adding: \"What theyre doing, theyre having a baby. And then all of a sudden, nobody knows ... the babys here.\", Native-born children of immigrants even those living illegally in the U.S. have been automatically considered American citizens since the adoption of the 14th Amendment of the Constitution in 1868. The odds of repealing the amendments citizenship clause would be steep, requiring the votes of two-thirds of both houses of Congress and support from three-fourths of the nations state legislatures. Republicans in Congress have repeatedly failed since 2011 to pass bills aimed at ending \"birthright citizenship.\" Some conservatives believe that the granting of citizenship in such cases could be changed without amending the Constitution. \"Theyre illegal,\" Trump said, describing native-born children of people living illegally in the US. \"You either have a country or not.\", Trumps remarks came as his campaign website posted his program for \"immigration reform.\" Among its details: Making Mexico pay for a permanent border wall. Mandatory deportation of all \"criminal aliens.\" Tripling the force of immigration officers by eliminating tax credit payments to immigrant families residing illegally in the U.S. Trump said a tough deportation policy was needed because \"theres definitely evidence\" of crimes linked to immigrants living in the country illegally. He repeated comments hes made previously, noting that: \"The good people can come back.\", The New York businessman also said he would waste little time rescinding President Barack Obamas executive actions aimed at allowing as many as 3.7 million immigrants living illegally in the U.S. to remain in the country because of their U.S.-born relatives. Obamas November 2014 actions were halted by temporary injunctions ordered by several federal courts in rulings challenging his executive powers to alter immigration policies without congressional approval. The cases could lead to the Supreme Court. \"We have to make a whole new set of standards,\" Trump said. \"And when people come in, they have to come in legally.\", Trumps plan was endorsed by Sen. Jeff Sessions, R-Ala. who chairs a Senate subcommittee on immigration. \"This is exactly the plan America needs,\" Sessions said in a statement. \"Crucially, this plan includes an emphasis on lifting struggling minority communities, including our immigrant communities, out of poverty, by preventing corporations from bringing in new workers from overseas to replace them and drive down wages.\", Most other GOP candidates also back completing the border wall but differ over how to treat immigrant families already living in the U.S. Former Florida Gov. Jeb Bush recently released his own immigration plan, which calls for the use of forward bases and drones to guard the border, but also backing an eventual plan to legalize the status of immigrant families. On Sunday, Ohio Gov. John Kasich said he would \"finish the wall\" but would then work to legalize 11 million immigrants now estimated to live in the U.S. illegally. He spoke on CBS \"Face the Nation.\", Florida Sen. Marco Rubio worked with senators from both parties to develop a comprehensive plan in 2013 that would have legalized the status of many immigrant families. But Congress balked at the idea as tea party Republicans opposed the deal and Rubio has since backed away from his support. Associated Press]", "Date": "20150817", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-donald-trump-gop-20150816-story.html", "Title": "[Trump: Deport children of immigrants living illegally in U.S.]"}