{"Content": "[Nobody is more passionate about the need for campaign finance reform than a presidential candidate about to campaign using unreformed finances. Democratic candidate Hillary Clinton said recently, between mouthfuls of money, that we need to \"fix our dysfunctional political system and get unaccountable money out of it once and for all even if it takes a constitutional amendment.\", I suppose that constitutional amendment will be her first order of business as president, following a campaign that will reportedly raise up to $2.5 billion and accept donations from lobbyists and political action committees. On the GOP side, New Jersey Gov. Chris Christie was in New Hampshire over the weekend with other potential and declared presidential candidates. According to the Washington Post, Christie said: \"There has to be an absolute rule that 24 hours later you will reveal those contributions on the Internet, publicly available, so members of the public can scroll down on their computer.\", And that absolute rule should absolutely happen right after Christie becomes president using a vault full of campaign money from sources-to-be-named-never. Face it, our system for financing presidential campaigns is akin to our system for Girl Scout cookie sales. A bunch of Scouts from one troop go out and try to sell cookies. One Girl Scout happens to have a benefactor (mom or dad) who is a high-ranking manager, and that benefactor quietly takes the cookie order form to work and tells people theres \"no pressure\" to buy cookies. Every employee then buys at least 27 boxes, 40 if theyre in line for a promotion, and the managers daughter is honored for selling the most cookies in her troop. (More details on this can be found in my best-selling book, \"The Thin-Minting of American Politics.\"), Im guessing the only way candidates will start rejecting the gobs of money thrown at them is if that money is needed to address an existential threat facing the nation. Fortunately, I have found that threat: Iowans in driverless Volvos. According to a startling report in The Gazette newspaper in Cedar Rapids, \"Iowa is well equipped to become the first state in the nation with a roadway certified for driverless cars\" automated vehicles that use GPS, lasers and other sensors to navigate while passengers kick back and enjoy the ride. This summer, researchers from the University of Iowa will drive \"a semi-automated 2016 Volvo XC90\" around Iowa City for so-called scientific purposes. The newspaper quoted Trent Victor, senior technical leader of crash avoidance for Volvo Cars: \"We see there is a need to be able to do something else while youre driving. So were giving people the ability to relax or do something else.\", Do you have any idea what this means?, For starters, allowing Iowa to be the first place in the country to have driverless cars completely throws off the regional stereotypes upon which this country was founded. Driverless cars should first come to Los Angeles and New York City. The LA folks would fall in love with the cars and fill their highways with so many that nobody could ever get anywhere. New Yorkers would be far too neurotic to ever set foot in one, a fact that would lead to no fewer than five New York Times \"think pieces\" on the dehumanizing effects of technology. A year or so later, after people on the East and West coasts had grown bored with them, automated vehicles would finally arrive in the Midwest, and everyone would think theyre really neat. Thats how it goes in this country. The last thing we need is Iowas rising Volvo conspiracy to throw off the natural order of things. More importantly, however, is the fact that a Swedish car company is attempting to put all of our Iowans into driverless vehicles and send them off to God knows where. I cant speak for the Democrats and Republicans running or considering running for president, but I can tell you this: I dont want to imagine an America in which, at any moment, I could be run over by a rogue, Volvo-encapsulated Iowan. Thats why Im calling on Clinton, Christie and others to pledge all current and future presidential campaign money to the eradication of this Swedish menace. It may take billions of dollars, but it will be worth it to send a forceful message: America will never allow a foreign country to hurl Iowans about in stylish but sensibly designed automatons. Besides, spending a few billion dollars to keep driverless Volvos out of Iowa doesnt sound any more ridiculous than spending that much to elect a president. rhuppke@tribpub.com]", "Date": "20150420", "Author": "[Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-talk-huppke-campaign-finance-iowa-20150420-story.html", "Title": "[Presidential candidates talk campaign finance reform]"}