{"Content": "[On the same day President Barack Obama said Wisconsin Gov. Scott Walker should bone up on foreign policy, the soon-to-be Republican presidential candidate was in a full day of national security briefings, part of his intensive behind-the-scenes preparation to run for commander in chief. Each morning, Walker gets what his staff calls the Governors Daily Briefing, his version of the Presidential Daily Brief that Obama receives from his top intelligence advisers. Mike Gallagher, a former Middle East staffer for Senate Foreign Relations Committee Chairman Bob Corker, R-Tenn. leads the sessions. He is joined by Walkers two new full-time foreign policy aides: Dan Vajdich, Corkers former top committee staffer on Russia and Europe, and Reagan Thompson, an Asia specialist who came from the office of Sen. Kelly Ayotte, R-N.H. Gov.Scott Walker slams Obama foreign policy at CPAC, comparing Madison protests against the federal efforts against ISIS. Gov.Scott Walker slams Obama foreign policy at CPAC, comparing Madison protests against the federal efforts against ISIS. Meanwhile, former Sen. Jim Talent, who was part of Mitt Romneys 2012 foreign policy inner circle, has taken the lead in building a small advisory council of outside foreign policy experts and former officials who will round out Walkers national security brain trust. According to his staff, Walker has also met with leaders and luminaries such as British Prime Minister David Cameron, Estonian President Toomas Hendrik Ilves, former Secretaries of State George Shultz and Henry Kissinger, Gen. Michael Hayden, Gen. James Mattis, Chinese President Xi Jinping and the Dalai Lama. Obama took a shot at Walkers foreign policy chops when he called Walkers promise to scuttle any nuclear deal with Iran, if he is elected president, foolish. Yet Walkers response last week on Fox News showed that he welcomes Obamas criticism, because it fits well into his strategy of running against the Obama-Clinton foreign policy record. This is a guy who in the last year called ISIS the JV squad, who called Yemen just last fall and his administration continues to call them a success story, who had a secretary of state under Hillary Clinton that gave Russia a reset button, Walker said. This is a guy who has the audacity to be talking about schooling anyone on foreign policy. In an interview, Talent told me to expect Walker to focus more on Obama and Clinton than on his Republican rivals when it comes to talking about foreign policy and national security. And dont expect Walker to be shy about the issues, regardless of what some critics call his lack of foreign policy experience and knowledge. The fact that you have had experience isnt a plus if that experience is a negative. Its not an argument for a promotion if you failed at your previous job, Talent said, referring to Clintons tenure as secretary of state. And experience has gone through Barack Obama without stopping. Just look at the Middle East. Walker has already had a couple of foreign policy gaffes. He has struck a jarring note when trying to tie domestic policy to national security, such as when he said that President Ronald Reagans firing of the air traffic controllers marked the beginning of the end of the Cold War and claimed that Soviet documents backed that up. In February, Walker was mocked for saying at the Conservative Political Action Conference that his experience dealing with union workers in Wisconsin prepared him for dealing with Islamic State. And last month he compared U.S. policy in the Middle East with the 1983 movie Trading Places: You know, with Dan Aykroyd and Eddie Murphy, its like Iran and Israel are trading places in the sequel. In a February trip to London, Walker was criticized for refusing to answer questions on foreign policy. Per being old-fashioned and having respect for the president, I just dont think you talk about foreign policy when being a guest on foreign soil, Walker said. Aides to Walker said the governor will continue to be careful when speaking in other countries as he ramps up his foreign travel. This weekend Walker heads to Germany, France and Spain on another trade mission, and he will visit Israel early next month. Walker wont be giving any speeches or doing many interviews on these trips, in part because he is not yet an official candidate. But when he is stateside, Walker will be speaking out more on national security issues. He penned an op-ed about Israel last month in National Review, he gave a long interview about foreign policy to Hugh Hewitt and he has issued statements on breaking national security news events such as the fall of the government in Yemen. Because of the importance and visibility of these issues, hes going to say a lot and pretty early if he runs, Talent said. The American people know we are not safe. They can read the headlines. Walkers foreign policy persona is not complicated. He will be for increases in defense spending, enthusiastic about support for allies, skeptical of U.S. interactions with competitors, careful about committing to the use of the military and generally more hawkish than Barack Obama and Hillary Clinton. He will tout his governing experience as evidence of his leadership abilities and criticize the state of world affairs after eight years of Democratic leadership. That puts him roughly in line with almost all the other Republican 2016 contenders, with the notable exception of Kentucky Sen. Rand Paul. Talent told me that the Walker strategy is to keep his foreign policy team small and close, to avoid the kind of infighting that occurs when campaigns build huge multilayered teams of experts who all disagree with each other. We want to have a lot of good and frequent interaction with these people, and you cant do that with 100 people. I learned that with the Romney campaign, Talent said. By contrast, Jeb Bush announced in February a long list of foreign policy advisers who often disagree with each other on major issues, including Paul Wolfowitz, James Baker and Robert Zoellick. The emerging Bush campaign has already had to rebut criticism about his surrogates actions, such as when Baker criticized Israeli Prime Minister Benjamin Netanyahu in a speech to the liberal pro-Israel, pro-peace group J Street. Walker doesnt consider himself a member of any single school of foreign policy thought, such as the neoconservatives or the realists, Talent said. Like many Republicans, he takes his cues from Ronald Reagan supporting a robust national defense, negotiating from a position of strength and picking his battles when it comes to using American force. Reagan borrowed from different foreign policy camps as he thought appropriate, and Walker does too, said Talent. Reagan picked his shots and he was choosy about how he used American military strength, and Gov. Walker admires that. Experience in foreign policy is not an indicator of success for presidents. Reagan, Bill Clinton and Obama came into office without foreign policy credentials, and each had different levels of proficiency. The question is not whether Walker can prove himself to be the most qualified candidate on national security. Walkers challenge is simply to pass whats called the commander in chief test and reassure most voters that he and the people who surround him can be trusted to run foreign policy. Hes working hard on that now. Bloomberg, Josh Rogin is a Bloomberg View columnist who writes about national security and foreign affairs.]", "Date": "20150413", "Author": "[Josh Rogin]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-scott-walker-foreign-policy-20150410-story.html", "Title": "[Scott Walker gets schooled on foreign policy]"}