{"Content": "[Republican presidential candidate Scott Walker campaigned in the GOP stronghold of DuPage County on Thursday, offering himself as an experienced alternative to front-running Donald Trump and others surging because they express voter anger at Washington. Speaking for 20 minutes at the county GOPs summer reception at a Downers Grove restaurant, Walker also pledged to challenge the Republican establishment overseeing Congress. \"There is a real concern across America. There is a real frustration across America, not just amongst Americans but amongst Republicans. Theyre saying, Hey, wait. Weve got a Republican House. Weve got a Republican Senate. When are we going to get something done? And for people who have that concern, Ive got the answer,\" he said. Wisconsin Gov. Scott Walker, a 2016 Republican presidential candidate, greets supporters after giving the keynote speech at the DuPage County GOP summer reception on Aug. 13, 2015, in Downers Grove. Wisconsin Gov. Scott Walker, a 2016 Republican presidential candidate, greets supporters after giving the keynote speech at the DuPage County GOP summer reception on Aug. 13, 2015, in Downers Grove. \"We took on the establishment in our own party (in Wisconsin), the defenders of the status quo in the Republican Party,\" he said. Recent polling shows Walkers support slipping somewhat in Iowa, the nations first presidential caucus state. A CNN survey showed him third at 9 percent, trailing Trump at 22 percent and retired neurosurgeon Ben Carson at 14 percent. \"A number of the candidates that are moving up are people whove not held political office. Why? Because thats a direct frustration with the fact that they feel that even in Washington, Republicans havent been able to get the job done, and so theyre willing to express their frustration in these polls,\" Walker told reporters afterward. \"I think in the end, voters like that will come home to us between now and when the first votes are cast because they want someone who does more than just get angry about it. They want someone who can fight and win and get results and do it without compromising. Theres no one else in the race who has the track record we do,\" he said. Walker said he thinks \"the race will be just in the thick of action\" when Illinois later presidential primary is held March 15. During his remarks, Walker repeatedly criticized Democratic front-runner Hillary Rodham Clinton for advocating what he described as a big-government view, calling her his \"real opponent. Its not the other Republicans.\", \"Clinton thinks you grow the economy by growing Washington\" said Walker, who criticized the \"(President Barack) Obama-Clinton doctrine\" on foreign policy as \"the failure of leading from behind.\", Walker urged the Obama administration to lift restrictions on U.S. troops currently in Iraq serving as advisers in battling Islamic State and called radical Islamic terrorism \"the greatest threat to future generations.\", \"On behalf of your children and mine, Id rather take the fight to them instead of waiting for them to bring the fight to us,\" Walker said of Islamic State. \"Our goal should be peace. Peace through strength. But there will be times when America must fight. And if we must, Americans fight to win. The rest of the world must know that there is no greater friend and no worse enemy than the United States of America,\" he said. Before the speech, Walker held a fundraiser event in Lake Forest and was scheduled to finish the day speaking at a downtown Chicago hotel fundraiser for Illinois House Republican leader Jim Durkin of Western Springs. Durkin has endorsed Walkers presidential bid. rap30@aol.com, Twitter @rap30]", "Date": "20150813", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-scott-walker-dupage-county-republicans-met-0714-20150813-story.html", "Title": "[Walker offers self as alternative to Trump to suburban GOP]"}