{"Content": "[The embattled head of the governments personnel office abruptly stepped down Friday, bowing to mounting demands following the unprecedented breach of private information her agency was entrusted to protect. Katherine Archuleta had served as director of the federal Office of Personnel Management since November 2013. The former national political director for President Barack Obamas 2012 re-election campaign, Archuleta came under scathing criticism amid revelations this year that hackers widely believed to be Chinas government had infiltrated her agencys databases as well as background-check records for millions who applied for U.S. security clearances. On Thursday, Archuleta had rebuffed demands that she resign, declaring she was \"committed to the work that I am doing.\" But her continued tenure at the agency grew untenable as calls from lawmakers including members of Obamas own party mushroomed. On Friday morning, she came to the White House to personally submit her resignation to Obama, who accepted it and named the agencys deputy director, Beth Cobert, to step in as acting director. \"Its quite clear that new leadership, with a set of skills and experiences that are unique to the urgent challenges that OPM faces, are badly needed,\" said White House spokesman Josh Earnest. Archuletas resignation came one day after the administration disclosed that the number of people affected by the federal data breach was far greater than previously known. In addition to 4.2 million people whose records were stolen in an initial hack first revealed earlier this year, more than 21.5 million had their Social Security numbers and other sensitive information stolen in a second hack, believed to be the biggest in U.S. history. Office of Personnel Management Director Katherine Archuleta testifies on Capitol Hill in Washington onJune 25, 2015. Office of Personnel Management Director Katherine Archuleta testifies on Capitol Hill in Washington onJune 25, 2015. Archuleta offered her resignation \"of her own volition\" and wasnt forced out, Earnest said. At the same time, he conceded that Americans affected by the breach are still \"due additional information\" from the agency about what happened and how to protect themselves. Republican lawmakers who had fueled the growing calls for her resignation said it was too little, too late. Sen. Ben Sasse of Nebraska responded to the news with a two-word statement: \"Not enough.\", \"Its a Band-Aid, but its not going to stop the bleeding,\" said Rep. Jason Chaffetz of Utah, chairman of the House Oversight and Government Reform Committee. He said in an interview that OPM still lacks a functional system to protect private data held by what is effectively the largest human resources department in the world. \"Its time to bring in the nerds,\" he added. But J. David Cox Sr. president of the American Federation of Government Employees, put part of the blame on Congress for failing to adequately fund OPM. \"Firing one individual solves nothing,\" he said. Archuleta joins a small but notable group of top Obama administration officials who have resigned under pressure from Congress and the public. Veterans Affairs Secretary Eric Shinseki stepped down last year amid a growing scandal over VA health care, and Secret Service Director Julia Pierson was pushed aside in 2014 following breaches to Obamas security. Obama forced acting Internal Revenue Service Commissioner Steven Miller to resign in 2013 after revelations came to light about an IRS offices treatment of tea party applications for tax-exempt status. In the OPM case, the data stolen by hackers included criminal, financial, health, employment and residency histories, as well as information about families and acquaintances. The second, larger attack affected not only applicants for security clearances but also nearly 2 million of their spouses, housemates and others. Numerous U.S. lawmakers who have been briefed by federal investigators have said emphatically that China was responsible, and even National Intelligence Director James Clapper has said publicly that China is the \"leading suspect.\", Yet even as Archuleta stepped down, the White House declined to point the finger at Beijing, reflecting the diplomatic sensitivities involved in such an accusation against a global economic superpower. Obamas cybersecurity coordinator, Michael Daniel, said cryptically, \"Just because were not doing public attribution does not mean that were not taking steps to deal with the matter.\", U.S. officials have said the hackers do not appear to have used the data since the theft. The White House said it has stepped up cybersecurity efforts, and in early June government employees received notice that OPM would offer credit-monitoring services and identity-theft insurance to those affected. Cobert, the agencys chief performance officer, has been confirmed by the Senate once before, which could make her an attractive candidate to be Archuletas permanent replacement. Yet lawmakers may be reluctant to support her again given her role as the No. 2 at the agency during the data breach. Prior to joining OPM, Cobert worked for nearly three decades as a consultant for McKinsey & Company. Associated Press]", "Date": "20150710", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-personnel-chief-katherine-archuleta-resigns-20150710-story.html", "Title": "[U.S. personnel chief resigns in wake of massive data breach ]"}