{"Content": "[What Democratic House Speaker Michael Madigan previously had labeled a \"diversion\" to resolving the states budget impasse became a priority issue Tuesday when the House voted to repeal an automatic 2 percent pay hike following weeks of criticism from Republican Gov. Bruce Rauner. The 101-1 vote is an indication of how powerful political optics have become as Rauner and Madigan continue to blame each other as the state enters its fifth week without a complete budget. Asked about the pay hike issue less than two weeks ago, Madigan declined to go into detail. \"I said I dont plan to speak to it further, thank you very much,\" he said. But on Tuesday, after Rauner repeatedly used his bully pulpit to try to tie the raises to Madigans long tenure in Springfield, the speaker quickly pushed the pay hike rollback through the House. Still, the effort did not come in time to stop lawmakers from receiving a small bump in their next paychecks, which are scheduled to go out Friday. Madigan said lawmakers could reimburse the state. Legislators receive a base salary of $67,836 a year, but most earn thousands more for serving on committees or in leadership roles. Their pay goes out automatically, even without a budget agreement. In recent years, the General Assembly voted to reject the salary increase in a nod to the states ongoing financial troubles. But lawmakers did not take that vote during the spring session. Rauner sought to eliminate the pay raises on his own, using his amendatory veto powers to eliminate the hike from a series of budget bills lawmakers sent him. But legislators did not take up the governors changes before the legislation expired, meaning the pay bump stood. Rauner argues lawmakers shouldnt get a raise while funding for social services, universities and other programs remain in jeopardy. \"Its just more indication that what Speaker Madigan is about is about his cronies and his political power, the political class, of protecting them in Illinois, and not working for the people of this state,\" Rauner said of the pay issue on WDWS-AM in Champaign prior to the House vote. During debate, Democrats tried to turn the tables on Rauner, questioning the high salaries hes given members of his administration and contending the estimated $240,000 that would be saved by rolling back the pay increase would do little to help the states bottom line. Madigan, meanwhile, painted the effort as an attempt to \"meet the governor halfway\" as Rauner pushes a broader agenda to cut costs for businesses and weaken labor unions that Madigan argues is holding the budget hostage. \"We are involved in what will be viewed as a historic struggle between two branches of government,\" Madigan said of the impasse, noting Rauner wont consider a tax hike to offset the need for budget cuts without winning approval of his political agenda, which would curb union rights and make it harder for injured workers to get compensated. The measure now goes across the Capitol, where Senate President John Cullerton has raised concerns about the constitutionality. He cites a previous Cook County court ruling that found it would violate the state constitution for legislative salaries to be changed in the middle of a term. That court decision followed an effort in 2013 by then-Democratic Gov. Pat Quinn to hold up lawmaker pay as he tried to get them to send him a cost-cutting pension bill. Despite \"strong reservations,\" Cullerton plans to \"give lawmakers the opportunity to vote\" on the proposal, said spokeswoman Rikeesha Phelon. Legal concerns did not stop lawmakers from rejecting their cost-of-living hikes before, including in 2014 an election year. While the measure could bring a court challenge, itd be politically unpopular for a lawmaker to do so. For his part, Madigan largely brushed aside questions about the constitutionality of the proposal. \"As we know following the courts, sometimes they change their mind,\" Madigan told reporters. The action unfolded as House lawmakers made their weekly pilgrimage to Springfield after two months of overtime sessions. The House continued to hold a series of hearings on the impact of a lack of a full budget, including a reduction in services for those with epilepsy. Both the House and Senate are scheduled to return next week. mcgarcia@tribpub.com, Twitter @moniquegarcia]", "Date": "20150729", "Author": "[Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rauner-madigan-pay-raise-met-0729-20150728-story.html", "Title": "[Madigan changes mind, tries to blunt Rauner criticism of lawmaker raises]"}