{"Content": "[U.S. Sen. Rand Paul opened a Niles campaign stop Saturday with a call to cut taxes and shrink government. \"Why are businesses relocating overseas? Because our taxes are too damn high,\" said Paul, speaking at a rally and book signing at the Royal Kitchen and Bath Cabinets warehouse. He said hed scrap the current tax code for a single-rate system while eliminating the payroll tax entirely. The libertarian-leaning senator from Kentucky vowing his campaigns long-term goal \"is not just the primary, our long-term goal is Hillary Clinton\" said Republicans will need to court African-American voters to win the general election. Part of his plan, he said, is a tax-cutting program for businesses in low-income areas that are growing and creating jobs, which he pitched during a May campaign stop on Chicagos South Side. \"What I want to do is not take your money and send it back, but leave it in the community and never take it to begin with,\" he said. His call for smaller government included cuts to spending, a less powerful presidency and limits on government surveillance. \"Lets collect more records of terrorists and less records of innocent Americans,\" he said. Paul also called for reductions in prison sentences, particularly for those convicted of nonviolent drug crimes. Pauls appearance in the north suburb, which drew a crowd of roughly 300, was organized by the Republicans of Maine Township, said Committeeman Char Foss-Eggemann. The group has invited all Republican presidential hopefuls to meet with local voters, and Paul is the first and so far only candidate to take the group up on the offer, Foss-Eggemann said. Paul is polling well enough that he is expected to be included in Thursdays Republican candidate debate, to be hosted by Fox News. The Ohio debate is limited to the 10 candidates leading in the polls. Paul said he thinks the crowded field will boost his campaign. \"Its easy for me to be a different kind of Republican,\" Paul said. Jan Bach, 58, of Park Ridge, said shes a longtime Paul supporter who liked what he had to say about limiting the power of government. \"Im excited he came to Niles, I just wish there had been more people there,\" she said. Others, like Phil Oenning, 65, of Park Ridge, said theyre still undecided and just wanted to get a closer look at one of the contenders. \"No ones really said anything yet,\" Oenning said of the slate of Republican candidates. \"It will be interesting to see what happens (at the debate).\", lzumbach@tribpub.com]", "Date": "20150801", "Author": "[Lauren Zumbach]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-rand-paul-niles-rally-met-20150801-story.html", "Title": "[Paul pushes 'economic freedom zones' at campaign stop in Niles]"}