{"Content": "[About 50 people gathered Wednesday in a banquet room at a Flossmoor restaurant to launch a \"\"political revolution.\", Its a grass roots movement for U.S. Sen. Bernie Sanders, a Democratic presidential candidate who embraces single-payer national health insurance, tuition-free public universities for all, increasing the minimum wage to $15 an hour and taking control of the federal government away from billionaires and corporations and returning it to the people. Mention to these folks that the Vermont senator has been called a socialist, and instead of protests, youre likely to bring a smile to their faces. \"If that means someone who stands up for the middle class, the working people and the less fortunate, than he is certainly for social reform,\" said Barbara Murphy, a Park Forest resident and founder of Chicago Southland for Bernie Sanders. \"He supports health care for everyone. Education. Dignity in retirement. Bernie Sanders is a man of integrity, the most consistent candidate in the presidential race, a principled man who isnt being bought by the corporations but is relying on average Americans to turn this country around.\", The gathering at the Flossmoor Station Restaurant was one of 3,500 across the country on Wednesday, according to the Sanders for President campaign. It said more than 100,000 people were brought together to hear Sanders speak during a webcast and eventually encouraged to reach out to their friends, neighbors and co-workers to sign up millions of others to make Sanders the Democratic nominee in 2016. Darlene Obejda, 67, the hostess of the event, called Sanders a \"democratic socialist because he believe in democracy for the people, not for capitalism and corporations.\" A retired social worker, Obejda said she has worked for Green Party candidates in the past but has never been as involved in a campaign as she is this time around. \"I feel the country is going horribly down the wrong track,\" she said. \"I heard him (Sanders) on the radio and just found I agreed with everything he says. I think more people would feel that way if they knew what he stands for, but the problem is that half the country hasnt heard of him. But I believe that half of the others, those who know him, agree with the things he stands for.\", A handout distributed to people at the rally listed \"12 initiatives to move America forward.\" Among them were rebuilding the nations roads, bridges, water systems, wastewater plants, airports, railroads and schools in a program that sounded like something out of President Franklin Roosevelts Works Progress Administration, which put millions of people to work during the Great Depression on public works projects. Sanders places \"reversing climate change\" second on his priority list by moving energy systems away from fossil fuels. He wants to create \"worker co-ops\" to develop new economic models to support workers instead of giving tax breaks to corporations \"which ship jobs to low-wage countries overseas.\", He wants to make it easier for workers to join unions and bargain for higher wages and benefits; break up big banks; expand Social Security, Medicare and Medicaid and reform trade policies \"that have shuttered more than 60,000 factories and cost more than 4.9 million decent-paying manufacturing jobs.\", Calling Sanders a long shot would be an understatement. Former U.S. Secretary of State Hillary Clinton has raised more than twice as much money, has far greater name recognition and an extensive professional campaign organization in every state. Her advantage over Sanders in public opinion polls would make Republican candidate Donald Trump envious. Yet, Sanders appeal to the partys left and a strong showing in an Iowa straw poll (he garnered 208 votes to her 252) has forced Clinton to embrace Sanders call for a $15 minimum \"living wage.\", Several people at the Sanders gathering told me they dont like or trust Clinton but would likely vote for her over \"any Republican\" if she became the Democratic Partys nominee. I decided to attend the event just to see the sort of people who would be there and found myself leaving with a renewed admiration for the optimism of ordinary people who believe they can still make a difference in this country despite a massive amount of evidence to the contrary. After all, it was just seven years ago that Barack Obama promised hundreds of millions of admirers that he would bring change to America. Today, according to Rasmussen Reports, 47 percent of likely U.S. voters approve of President Obamas job performance and 51 percent disapprove. While he did pass the Affordable Care Act, the U.S. economy has been slower to rebound than many expected, and Obamas initial promise to create a less-hostile political environment in Washington, D.C. has been a dismal failure, although his supporters would likely claim thats largely due to unending opposition by Republicans,, On the other side of the political spectrum are Tea Party activists, a movement that began in 2009, a year after Obamas election. Its faithful members have called for balanced national budgets, lower taxes, a reduction in the national debt and have generally criticized \"Obamacare.\", Some political analysts claim that the Tea Party members have forced Republican candidates to take conservative positions out of the mainstream to win primary elections but that reduces the likelihood of winning a presidential race. The \"political revolution\" that Sanders is talking about, and he mentioned those words repeatedly during his speech Wednesday, could create the same sort of problems for Democratic candidates. \"When we stand together, there is nothing, nothing, nothing we cant accomplish,\" Sander told his audience. \"That is what this political revolution is all about.\", The people at Flossmoor Station seemed almost giddy at the prospect of changing the direction of the Democratic Party and unconcerned about the failures of any past political movements to achieve their stated goals. They still believe that ordinary people, by banding together in their communities, can overcome the influence of big business, big money, and, as they mentioned more than once, \"the traditional news media., That people on the far left and far right still blame the news media, whose influence has been declining for decades, for their perceived lack of political success made me smile. I suppose there are still people who think Jerry Lewis is a cutting-edge comedian. Rodney Gelenbeck, 49, a union electrician who lives in Orland Park, said hes backing Sanders because \"hes the only candidate that addresses the issues that really matter to people. Income equity. Preserving Social Security for generations to come. Single-payer health insurance.\", Leslie Fusinato, of Chicago Heights, who is studying political science at Purdue University Calumet in Hammond, said this is her first time participating in a grass roots political effort. \"Im tired of billionaires running this country,\" she said. When I asked her what she would say to Republicans who view Sanders as a wacky socialist, Fusinato replied, \"I would say that people at the other end of the political spectrum should take a close look at their candidates first before calling other people names.\", Steve Desavouret, a retired railroad freight care inspector from Palos Hills, said Sanders is the \"most pro-worker candidate in the last 40 years.\", \"Hes the only candidate who is 100 percent pro-union,\" Desavouret, a union member, said. \"Hes absolutely for the rights of unions to organize and wants to give union benefits to everyone in this country.\", Sanders, among other things, advocates that every worker get two weeks of paid vacation and that cancer patients be given 50 days paid leave while they undergo cancer treatment. The faithful in attendance signed forms provided by the Sanders campaign on the Internet and pledged to hold more and bigger rallies in the community and spread the word about Sanders platform and what he represents. Some purchased campaign buttons, window signs and bumper stickers. Some people may shake their heads at the naivete of such people or be horrified by Sanders attacks on corporate America, but I couldnt help thinking campaigns such as this one is what America is supposed to be about. Folks still believe they can make a difference just by getting out the vote. Its sort of wonderfully irrational like believing you can do some good as a member of the \"traditional news media.\", pkadner@tribpub.com]", "Date": "20150730", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-bernie-sanders-st-0731-20150730-story.html", "Title": "[Southland group's goal: Sanders as president]"}