{"Content": "[MANILA, Philippines Its more what the Philippines doesnt have than what it does have thats making the country Southeast Asias safe haven amid an emerging-market rout. Relatively low levels of foreign investment in its bonds and stocks are shielding the Philippines from an intensifying selloff, while a comparative lack of raw materials means its less vulnerable than Indonesia or Malaysia to sliding commodities prices. Stability under President Benigno Aquino stands in contrast to Thailand, ruled by the military since May 2014, and Malaysia, where the prime minister is facing calls to resign amid a political scandal. Philippine local-currency sovereign bonds returned 2.9 percent over the last three months, the most in Southeast Asia. The peso has held up better than its peers, losing 4.5 percent, compared with drops of 8 percent in Thailands baht, 12 percent in Indonesias rupiah and 18 percent in Malaysias ringgit. The benchmark Manila stocks index has also declined the least in the region over the period. \"Its definitely the regional star,\" said Edwin Gutierrez, who helps oversee $13 billion as the head of emerging-market sovereign debt at Aberdeen Asset Management in London. \"In a world starved of growth, Philippine growth -- albeit slowing -- is holding up relatively well,\" he said, adding that a relative lack of foreign participation had protected the country from capital flight. The economy expanded 5.7 percent last quarter from a year earlier, according to a Bloomberg survey before data due Aug. 27. That would be an improvement from 5.2 percent expansion in the first three months, although slower than 6.1 percent in 2014. Indonesian and Malaysian growth slowed to 4.67 percent and 4.9 percent, respectively, last quarter, while Thai gross domestic product increased 2.8 percent. A burgeoning business-process outsourcing industry is aiding the Philippine economy. Revenue from BPO, which includes customer call centers as well as the farming out of accounting tasks, will rise to $21.2 billion this year and $25 billion in 2016 from $18 billion in 2014, according to the IT and Business Process Association of the Philippines. Money sent home by Filipinos living abroad, which makes up about 10 percent of GDP, increased 5.6 percent to $12.1 billion in the first half from a year earlier. A net oil importer, the Philippines has also benefited from falling crude prices. The country ran a $3.3 billion current-account surplus in the first quarter, compared with $1.5 billion in the same period of 2014, according to central bank data. The Philippines consumption-based economy and steady dollar inflows mean its insulated from Chinas yuan devaluation and U.S. interest-rate increases, according to Jay Peiris, the International Monetary Funds representative in Manila. \"Its very hard to think of a country thats less vulnerable,\" he said in an Aug. 20 interview. Peso sovereign notes are the best performers in Asia after Taiwanese securities in the last three months, according to Bloomberg indexes. Thai debt returned 1.6 percent, while Malaysian and Indonesian paper declined 1.1 percent and 3.1 percent, respectively. Around 10 percent of Philippine bonds are foreign-owned, according to BPI Asset Management and Trust Group, part of the countrys second-largest lender. That compares with 39 percent in Indonesia, 31 percent in Malaysia, and 17 percent in Thailand at end-March, Asian Development Bank figures show. \"Philippine fixed-income assets stand out versus their Asian peers largely due to the dominance of domestic investors,\" said Mario Miranda, senior vice president at BPI Asset in Manila. Outflows from Philippine stocks have also been more modest than for regional peers. Some $332 million has been pulled from the countrys shares this quarter, compared with $587 million from Indonesia and $1.6 billion from Thailand. The Philippine benchmark share gauge is down 13 percent in three months, trailing drops of 13.8 percent in Thailand, 14.3 percent in Malaysia and 21 percent in Indonesia. Saturna, the Malaysian unit of Saturna Capital, is overweight Philippine shares in its Asean portfolio as the country is a regional bright spot and less dependent on foreign funds, said Monem Salam, Saturnas president in Kuala Lumpur. There are pockets of concern in the Philippine economy including companies with high levels of foreign-currency debt and property developers that engage in shadow banking, said the IMFs Peiris. The Philippine Exporters Confederation warned last month that the pesos resilience was a potential threat to shipments. The currency is 20 percent overvalued, said Claudio Piron, co-head of Asia FX and rates strategy at Bank of America Merrill Lynch in Singapore. Filipinos go to the polls next year to elect a new president, with Aquino prohibited from running for another six- year term. Since 2010, his administration has pursued tax evaders and corrupt officials, allowing it to collect more revenue to build roads and schools and boost cash handouts to the poor, while shrinking budget deficits. Standard & Poors has upgraded the Philippines credit rating four times during Aquinos tenure and all of the three big ratings companies assess it as investment grade. Strong growth fundamentals, a large English-speaking population, fiscal and monetary prudence, and political stability support the positive outlook on the economy, said Andrew Wood, the Singapore-based head of Asia Country Risk Research at BMI Research, part of Fitch Group. \"The Philippines large and growing labor force, along with increased policy-making credibility, should continue to draw investors interest over the medium term,\" he said. \"We believe the Philippines can continue to outperform the region.\", , _ Contributors: Clarissa Batino, Siegfrid Alegado and Ian Sayson in Manila and Lilian Karunungan in Singapore.]", "Date": "20150824", "Author": "[Ditas Lopez, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-philippines24-20150824-story.html", "Title": "[Philippines becomes regional star as gloom descends around Asia]"}