{"Content": "[Many people are wondering how Donald Trump, for all his excesses and eccentricities, could be doing so well in the presidential primary polls. The answer to that mystery may be found right here in Illinois, where voters elected a low-rent Trump doppelganger as governor not once but twice. The parallels between Rod Blagojevich and Trump are striking. Theres the goofy hair, the mad-as-hell-and-Im-not-going-to-take-it-anymore swagger, the knee-jerk name-calling, the craving for attention no matter how foolish it may seem. Their paths even crossed on the 2010 season of Trumps \"Celebrity Apprentice\" TV show where Blagojevich, facing corruption charges and already fired in an impeachment proceeding by Illinois lawmakers, got fired once more by Boss Donald. Sure, Trump is worth $9 billion or $10 billion or whatever figure he chooses to throw out in the moment, while Blagojevich is broke and broken. As Trump continued to suck the oxygen out of the GOP presidential field, Blagojevich, who once dreamed of running for president, got the bad news from a federal appeals court the other day that his already yearslong stint in prison will likely last years longer. Still, even Blagojevichs legal woes serve as a reminder of just how much he, like Trump, drew energy from celebrity. Day in and day out at Blagojevichs criminal trials, prosecutors piled on the evidence and testimony that left the former governor looking craven, insincere and foolish. He plotted to profit from his power to fill a U.S. Senate seat, hoping to parlay it into money, jobs or maybe a cabinet post or ambassadorship. He hid in the bathroom to avoid discussing state finances with his budget director. He was captured on a government wiretap complaining of ingrate voters who failed to appreciate that he had given \"your grandmother a free (expletive) ride on a bus\" and \"your (expletive) baby a chance to have health care.\", Republican presidential candidate Donald Trump says he expects to win the presidential nomination and run against Democratic candidate Hillary Clinton. (AP), Republican presidential candidate Donald Trump says he expects to win the presidential nomination and run against Democratic candidate Hillary Clinton. (AP), To jurors, Blagojevichs own lawyer described the former governor as \"insecure,\" \"silly\" and not \"the sharpest knife in the drawer.\", Yet, after taking such well publicized hammerings day in and day out, Blagojevich could always count on a greeting worthy of a walk down a Hollywood red carpet when he departed the Dirksen U.S. Courthouse. Well-wishers who had seen him on TV, in particular on Trumps show, lined up by the dozens to shake his hand, cheer him on and ask for an autograph. Political theatrics in Illinois hardly ended with Blagojevichs demise. The current budget stalemate is Springfield seems driven less by an argument over finances than a monumental clash of egos worthy of one of those cheesy Japanese monster movies from decades ago where Godzilla and Megalon fight for territorial dominance. In the process, half of Tokyo gets destroyed. But back to Trumpojevich. Jaws have been dropping, but not necessarily popularity points among Republicans, over Trumps penchant for scattershot name-calling as he launched potshots at Mexican immigrants, Mexico in general, and ex-POW and Arizona Sen. John McCain. As he questioned McCains heroism, Trump explained his own disqualification from military service came because of a bone spur in a foot, though he couldnt recall which one. Blagojevich, in his day, exhibited a flair for similar gems. He ripped into the State Board of Education as a \"Soviet style bureaucracy\" and ridiculed a Downstate lawmaker as a \"wallflower.\" On Trumps show, he proclaimed that his impeachment had unfairly deprived the people of Illinois of his services (\"They stole me away from the people who hired me.\"), Then there was the time the Illinois House shot down a key Blagojevich tax plan by a vote of 107 to 0. His reaction? \"Today was basically an up. I feel good about it.\", Trump, then, is something of a rich mans Blagojevich, adhering to the \"just spell my name right\" theory of politics. With an electorate so fractured and polarized, what you say increasingly is less important than how loudly you say it. To be sure, its probably much easier for voters to get the spelling of Trumps name right than it was Blagojevichs. And for anyone who still has difficulty, Trump has helpfully plastered a garish cheat sheet on the side of his downtown skyscraper on the banks of the Chicago River. The letters spelling out Trumps name may not be quite big enough for Blagojevich to spot them from his prison cell in suburban Denver. But almost. bsecter@tribpub.com]", "Date": "20150724", "Author": "[Bob Secter]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-trump-blagojevich-secter-column-20150724-story.html", "Title": "[Trump, Blago joined at the (shoot-from-the) hip]"}