{"Content": "[The Illinois Constitution is clear that a vacancy in the state comptrollers office is filled by an appointment made by the governor. But the timing of Comptroller Judy Baar Topinkas death on Wednesday, so close to the Jan. 12 inauguration of statewide officials to new four-year terms, has raised a host of legal questions that have never been tested regarding Illinois succession provisions. At issue are how the replacement process is supposed to work and for how long a successor appointed by a governor would hold the office. Democratic Gov. Pat Quinn can fill the vacancy created by Topinkas death. But Quinn leaves office in a month, and Republican Bruce Rauner will take over as governor. The question: Would a Quinn appointee serve as comptroller only until Jan. 12, when a new term begins and Rauner would get to choose a comptroller, or would Quinns selection get to serve the new term as well?, The state constitution speaks to the succession for comptroller in a couple of places. The succession clause states that the appointee shall hold office until the elected officer qualifies or until a successor is elected and qualified. But another section limits the terms of statewide officeholders to four years until their successors are qualified. On Wednesday, Quinn said he believed the legal discussion should be postponed for later on. The constitution and the constitutional debates, the state law and, I think, any court cases will guide anything I do with respect to the vacancy, Quinn said. Democratic Senate President John Cullerton said he believes that two vacancies exist the one Quinn can fill through Jan. 12, and another that begins the same day with the new term that Topinka won last month. That second appointment would last four years. But Cullerton spokeswoman Rikeesha Phelon also said the Senate president recognizes the unprecedented nature of a four-year appointment to a constitutional office without voter approval. Phelon said Cullerton wonders whether having an unelected officeholder serve for four years is appropriate. If legislative leaders and Quinn conclude a change is needed, then the only way to do it is via special session, Phelon said. That would have to take place in early January. Such a move could set up efforts to enact a special election, potentially to take place during the next statewide balloting in 2016 a presidential campaign year traditionally more favorable to Democrats in Illinois. Steve Brown, spokesman for House Speaker Michael Madigan, the states Democratic chairman, said he has not heard a special election or special session being discussed. Rauner said he believes Quinn has the power to fill the vacancy only until Inauguration Day, and suggested the Democrat appoint Topinkas chief of staff, Nancy Kimme, for the short term. Kimme also is a top deputy on Rauners transition team. My own view is that Nancy Kimme is (Topinkas) senior person who knows the system, she should step in and serve right now, and then when things are clearer and settled we can talk about a permanent person to serve out Judys four years. Ann Lousin, an expert on the state constitution at Chicagos John Marshall Law School, said neither the charter nor state law lays out a clear contingency for replacing Topinka so close to the start of her next term. The scenario that would be the least likely to lead to litigation would be for Quinn to appoint someone to serve just to Jan. 12, or even just let Topinkas deputy fill the post until then, and then let Rauner appoint somebody for four years on Jan. 12, Lousin said. Quinn is not compelled to act before that on the treasurer vacancy, Lousin added. Officials in the comptrollers office said they have been advised that state paychecks and other payments already in process, which the comptroller must authorize, are valid to be sent out in the short term. They said they are awaiting further counsel from Attorney General Lisa Madigans office on future checks and payments.]", "Date": "20141210", "Author": "[Rick Pearson, Bob Secter, Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-quinn-appoints-topinka-successor-but-for-how-long-20141210-story.html", "Title": "[State constitution murky on appointing successor to Comptroller Topinka]"}