{"Content": "[Senate Republicans celebrated on Tuesday after passing the first joint budget resolution in more than five years, but that success is just the start of the much more difficult task of funding the government. Republicans said the next step will be for the Appropriations Committee to start drafting spending bills that meet the newly-approved framework, which means cutting $496 billion in non-defense spending over the next decade. The budget adheres to domestic spending caps included in the 2011 Budget Control Act, also known as the sequester and uses nearly $40 billion in off-budget funds to boost defense spending to over $563 billion. Republican Senators touted the fiscal 2016 budget resolution ahead of a vote May 5, 2015. (RollCall), Republican Senators touted the fiscal 2016 budget resolution ahead of a vote May 5, 2015. (RollCall), No Democrats voted for the budget resolution. President Barack Obama has vowed to veto any funding bills that fall within the framework. And even as the budget passed, most Republicans acknowledged that it will be impossible to meet their own standards. But Republican leaders insisted that they would try anyway. \"Our only tool is the funding process, and were going to try to do that,\" Senate Majority Leader Mitch McConnell said in an interview. \"It will be challenging, but were going to try to delay, rein in, restrict various bureaucratic overreach through the appropriation bills that spend the money.\", McConnell acknowledged that the process will start fights and would likely be difficult to pass but his plan is to proceed with the process of trying to advance deep-cutting spending bills. A spokesman for Appropriations Committee Chairman Sen. Thad Cochran, R-Miss. said he plans to start considering a dozen funding bills in a matter of weeks. Republicans may be able to get through the committee process but the chances of advancing legislation that closely adheres to their budget blueprint is nearly impossible. Unlike in the House, where Republicans have enough votes to easily advance spending bills without the help of Democrats, the Senate will need the backing of at least six senators to bring their bills up for a vote. Democrats vowed to block deep funding cuts for medical research, food stamps, housing programs for low-income workers and cuts to the federal Pell grant program for students. Instead they are calling on Republicans to help craft a plan to lift the spending caps for both domestic and military spending. \"Were not going to sign on to a bill that goes to the sequester levels,\" said Minority Whip Richard Durbin, D-Ill. \"There is no reason for us to support these funding levels on the domestic side.\", Republicans said Tuesday that they will not waiver, leaving the sides at an impasse. \"Were not going to waive the white flag on the day that we passed a budget agreement,\" said Sen. Roger Wicker, R-Miss. \"I think a more positive can-do attitude is a good place to start.\", Despite Wickers positive attitude, Sen. Charles Schumer, D-N.Y. said he doesnt expect the deepest-cutting funding bills to even make it out of committee. Schumer said he expects Republicans to balk and refuse to vote in favor of cuts to programs that benefit their constituents. \"It wouldnt get to the floor,\" he said. \"[Republicans] wouldnt vote for it and Democrats wouldnt vote for it.\", Democrats in Congress and the White House have said that they want to see a dollar-for-dollar match in increased funding for domestic programs and the military before theyll agree to any funding bills. House Speaker John Boehner said last month that he would be open to a conversation about lifting the spending caps in a deal similar to an agreement reached by former budget committee chairs Sen. Patty Murray, D-Wash. and Rep. Paul Ryan, R-Wis. in 2011. To date, neither side has stepped forward to open negotiations. The White House has said they are waiting for Republicans to take the first steps. \"We welcome Speaker Boehners comments in support of a budget deal and look forward to seeing some more concrete steps from the Speaker and his Republicans colleagues on reversing sequestration for both defense and non-defense programs,\" White House budget spokeswoman Melanie Roussell said in a statement last month. The concern for some Democrats is that if Republicans go forward with their plan to advance spending bills ahead of a broader negotiation it could make the funding process even more complicated. \"It complicates this immensely,\" said Sen. Jack Reed, D-R.I. a member of the Appropriations Committee. \"In the first few bills you can move things around but there are vital functions that they would want to see funded and the arithmetic doesnt work.\", - - - -, Washington Post staff writer Paul Kane contributed to this report.]", "Date": "20150505", "Author": "[Kelly Snell]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-senate-gop-budget-obamacare-20150505-story.html", "Title": "[Senate adopts GOP budget targeting 'Obamacare']"}