{"Content": "[Any day now, Chicago Mayor Rahm Emanuel should be receiving a mysterious package wrapped in brown paper. Dont worry, Rahm. Its not that dead fish you sent your political enemies in the days before you became Nice and Cuddly Rahm. There are no dead fish involved. The gift comes from me. It is a Spring Cleaning gift. A broom. Thats what Rahm Emanuel needs, a good honest broom with stiff bristles to help him sweep out the Chicago Board of Education. Its failed him, at least politically. And as a political matter, those board members to go. Sweep them up, mayor, sweep quick, sweep clean. The mayoral political broom should come with hard bristles and a long handle. Then he could sweep out the entire Board of Education, flick the members into the dustpan and start fresh. And Im almost certain hes considering replacements, perhaps neighborhood people, parents, perhaps even a teacher, so the board resembles the neighborhoods of Chicago. Why? Disaster is coming. And one critical but misunderstood art of politics is spreading disaster thin so others may eat it. \"Thats how its done, you know,\" said a guy who liked the broom idea. \"You give the mayor a broom and tell him to sweep under the bed, make sure he gets into the corners, and sweeps it all out.\", He pondered a bit. \"But is that all? What about the sidewalk?\", Of course. It is what you do in Chicago for spring cleaning. You clean house. Then you bleach the sidewalk. That too is the Chicago Way. The city needs it. The schools need it. And Rahm needs it, especially with schools chief Barbara Byrd-Bennett forced to step aside and federal corruption investigators crawling all over the way the school board hands out multimillion-dollar no-bid contracts. With warm, humid weather due in mere days, it is politically incumbent upon the mayor to make a clean sweep of his Chicago Board of Education. If he doesnt, you know what will happen. It will all get ripe. And that will bring flies and worse, those aggressive, meat-eating yellow jacket wasps. Once they start buzzing around, stinging the mayor, youre finished. I know what some of you are thinking. Youre thinking, \"Why are you being such a nice guy and sending a broom to Rahm?\", Others of you must figure this is some kind of Kassian trick to get the mayor to stand outside City Hall with a broom, bleaching and scrubbing the sidewalks and wearing a babushka on his head like some old Lithuanian lady. Come to think of it, if only the mayor would wear a babushka on his head while cleaning the sidewalk out in front of City Hall the way the neighborhood women swept the sidewalks in front of their bungalows when I was a boy Id be overjoyed. Because back then, the schools actually educated students and the system wasnt completely bankrupt. So why does he need a broom for the Board of Education?, Youre no chumbolone. You know exactly why:, A federal grand jury is looking into a multimillion-dollar no-bid contract to a company connected to recently exiled CPS boss Byrd-Bennett. The public posture is that she has taken a leave of absence. But shes gone. Shes been replaced by Board of Education member Jesse Ruiz, a Chicago lawyer and solid school policy expert who knows the legislators in Springfield, where a solution to school finances will be found. Im giving Rahm a broom but Im also suggesting Ruiz might want to stay on to provide some measure of continuity. Because with the feds and the embarrassment and the politics and the subpoenas, theres a little matter of a billion dollars owed. Thats $1.1 billion with a \"b,\" and the schools owe the money and there are no clear answers on how the schools will come up with the money. It could mean bankruptcy. I told you years ago in this column that $1 billion would come due and that school bankruptcy was a possibility and that someday, youd hear others publicly speculating about what would happen. Well, someday is here. Bankruptcy could mean a catastrophe for wealthy bondholders and institutional investors. It could also mean a catastrophe for the school unions, particularly the Chicago Teachers Union. A bankruptcy might very well allow a complete restructuring of school finances, something that probably should have happened decades ago and didnt. All that is serious stuff. And more red ink and debt is circling City Hall on other fronts, and Mayor Emanuel shouldnt have to be running around putting out fires at the schools. Clearly, the Chicago Board of Education failed. It failed the city. It failed the kids. And it failed the mayor. And he needs a broom to sweep out the board and start fresh. The other day Rahms board suspended payment on whats left of the contract. Emanuel wouldnt defend Byrd-Bennett, his hand-picked schools chief. And he ripped the lousy deal. \"Type of action wont be tolerated,\" said the mayor. \"Were going to turn the page, and everybody needs to be laser-focused on our kids and their education.\", What makes this all quite socially awkward is that Rahms school board the people who ripped Byrd-Bennett for supporting the contract approved the very same contract. And now theyre acting as if theyre innocent bystanders. So take that broom Rahm, and push it. Push it real good. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150423", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-rahm-emanuel-cps-kass-met-0424-20150423-column.html", "Title": "[Grab a broom, Rahm, for spring cleaning]"}