{"Content": "[President Barack Obama got a first-hand look at the nations criminal justice system Thursday, touring a federal prison and meeting with incarcerated men. After peering into a sterile prison cell, he said the nation needs to reconsider the way crime is controlled and prisoners are rehabilitated. Obama, who has vowed to make criminal justice reform a centerpiece of his closing months in office, said he also felt a kinship with some of the young inmates. \"When they describe their youth and their childhood, these are young people who made mistakes that arent that different than the mistakes I made,\" Obama said following his private meeting at the El Reno Federal Correctional Institution, a medium-security prison for male offenders near Oklahoma City. The president said there must be a distinction between young people \"doing stupid things\" and violent criminals. Young people who make mistakes, he said, could be thriving if they had access to resources and support structures \"that would allow them to survive those mistakes.\", Among the changes Obama is seeking is the reduction or outright elimination of severe mandatory minimum sentences for non-violent offenders. Earlier this week, he used his presidential powers to shorten the prison sentences of 46 people convicted on charges involving drugs. The president has also called for restoring voting rights to felons who have served their sentences, and said employers should \"ban the box\" that asks job applicants about their criminal histories. The White House said Obama was the first sitting president to visit a federal prison. The presidential motorcade rolled past fences topped with multiple layers of razor wire as it entered the sprawling prison complex. President Obama, speaking after touring the El Reno Federal Correctional Institution, says the criminal justice system needs to distinguish between young people who make mistakes and those who are truly dangerous. (AP), President Obama, speaking after touring the El Reno Federal Correctional Institution, says the criminal justice system needs to distinguish between young people who make mistakes and those who are truly dangerous. (AP), After his meeting with inmates, Obama walked past rows of empty cells secured by large gray doors. Prison officials opened cell no. 123 for the president, who gazed at its sparse trappings: a bunk bed and third bed along the wall, a toilet and sink, along with a small bookcase and three lockers. \"Three full-grown men in a 9-by-10 cell,\" he said. Obama has expressed hope that Congress will send him legislation to address the issue before he leaves office in 18 months, given the level of interest in the issue among Republican lawmakers and presidential candidates. Presidential security was no small part of Thursdays intriguing Obama outing. The goal of incarceration usually is to keep people with criminal histories far from a president, not to put a president in their midst. But, as much as it may defy logic, the controlled environment of a prison is better than many of the public venues where presidents appear, said Danny Spriggs, a former deputy director of the U.S. Secret Service, which provides the presidents security. Who comes and goes from a prison is strictly limited and everyones background is known. \"Its better that he goes there than out in the general public,\" said Spriggs, now vice president of global security for The Associated Press. White House press secretary Josh Earnest said \"unique steps\" were to be taken to protect Obama during the visit. He did not elaborate. Secret Service spokesman Brian Leary said \"comprehensive security screening\" was to be conducted, calling it standard practice. Spriggs, who said he is familiar with El Reno, said Obamas prison tour likely will be limited to critical areas, and those areas will be roped off so that access is given only to the warden and immediate staff so they can explain what happens there daily. \"Those hallways will be clear,\" Spriggs said in advance of the presidents visit. Obama also was to be interviewed at El Reno for an upcoming Vice News documentary on the criminal justice system. From shortening the prison sentences of nearly four dozen nonviolent drug offenders to advocating the reduction, or outright elimination, of severe mandatory minimum sentences to visiting a federal prison, Obama has argued forcefully this week for an alternative to the continued lengthy incarceration of people convicted of crimes he said did not fit the punishment. Overly harsh prison sentences, particularly for nonviolent drug crimes, are to blame for doubling the prison population in the past two decades, Obama said earlier this week. Half a million people were behind bars in 1980, a figure that has quadrupled to its current total of more than 2.2 million inmates. Sen. Rand Paul, R-Ky. a 2016 presidential contender, is pushing to restore voting rights to nonviolent felons who have served their sentences. Another GOP candidate, New Jersey Gov. Chris Christie, was giving a speech Thursday calling for changes that in part would give nonviolent drug offenders a better chance at rebuilding their lives. Spriggs, meanwhile, drew a distinction between violent and nonviolent crimes and said not everyone with a criminal past is kept away from the president. \"The idea that you keep the president away from all who have criminal records is ... simply not true,\" he said. Associated Press]", "Date": "20150716", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-obama-prison-visit-20150716-story.html", "Title": "[Obama visits prison to call for a fairer justice system]"}