{"Content": "[Because so many Republicans want to be president or at least pretend they do debate organizers have decided to eliminate the least popular from the stage based on how they rank in the latest national polls. Fox News, which is hosting the first televised debate Aug. 6, and CNN, host of the second on Sept. 16, have come up with a way to limit the field. Basically, its the popularity contest presidential elections have always been, only this time theres no attempt to masquerade it as something loftier. Fox will limit the number of contestants to the Top 10. Everybody else may as well head to their favorite resort, work on their backstroke, and embrace the not-unpleasant reality that someone else is going to look 20 years older in four more years. At least CNN will allow the \"losers\" those polling outside the Top 10 to debate separately in a second part. The bench warmers get to play each other, in other words. This may sound dull, but when youre not winning, you may as well be honest. Who knows what nuggets might tumble from the tongues of the rejected and the desperate?, But seriously. Imagine running for president of the United States, which requires a full tank of narcissistic propulsion and near-pathological ambition and knowing at the starting gate that not only are you not going to be president but youre not even going to be allowed to play with the big dogs. What becomes of the indignant rage born of such insult? How does one channel such humiliation and injury?, Good morning. Is Roger Ailes in, please?, Understandably, the field has to be winnowed somehow. It would be challenging to fit 18 people on a stage, the effect of which would be to make everyone look ridiculous. Not all candidates are equal, we neednt be reminded, and giving them equal space to insult and denigrate the likely nominee is so much blood for a mere moment of glory. Leaving the partys candidate wounded and financially bruised, as Republican also-rans did to Mitt Romney in 2012, helped no one so much as Barack Obama by providing him all the opposition research he needed. Still, the approach to eliminating weaker candidates feels a bit un-American, doesnt it? Anyone can grow up to become president, we say; P.S. You just cant debate your opponents. Everyone has a voice in the public debate we call politics, we aver. That is, except for a few of you who arent yet on peoples radar. But you can talk to each other!, This sidelining of certain candidates, even if practical, seems bad for business and especially for leadership, which sometimes reveals itself during debates. Many candidates soar or perish under the hot lights \"Oops!\" And the stigma of being designated an \"also-ran\" before the race even begins likely would crush anyones chances of being recognized later as a hidden jewel. Relegating the unpopular to the margins is also tricky for Republicans when one of them is likely to be the only Republican woman running Carly Fiorina. But based on the average of polls found today on RealClearPolitics the Bible Belt for the religiously political you also wouldnt hear from South Carolina Sen. Lindsey Graham, Louisiana Gov. Bobby Jindal, Ohio Gov. John Kasich or former Pennsylvania Sen. Rick Santorum during the first debate. But be brave: Donald Trump is in. Which is to say, we may as well call it a day. Rather than waste time and money polling Iowans and talking grits n gravy with South Carolinians, why not just select our senior superlatives the way we did in high school? Who is something-est the tallest, handsomest, smartest, wittiest, friendliest, cutest, nicest, toughest, most likely to succeed and, not least, most likely to attract about 40 percent of the Hispanic vote?, Oh, and who can beat Hillary Clinton? Lest I be a spoiler, Ill let you fill in the blanks. Id be willing to bet that the superlatives selected will be the 10 contestants I mean, candidates appearing on the big stage come August. Hints: Jeb Bush is 6-feet-3; Marco Rubio and Bush speak Spanish fluently; Ted Cruz speaks Spanglish; and Mike Huckabee is pretty funny. Politics isnt really science after all, but is a schoolyard brawl or a survivor reality game, depending on ones preference where human nature calls the shots. Washington Post Writers Group, Kathleen Parker is a syndicated columnist. kathleenparker@washpost.com.]", "Date": "20150525", "Author": "[Kathleen Parker]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-republicans-weak-candidates-fox-news-perspec-0526-20150524-story.html", "Title": "[Who's the studliest Republican of them all?]"}