{"Content": "[As Palos Park resident Sean Morrison was being handed a seat on the Cook County Board by his fellow GOP township committeemen Wednesday night, one woman objected, claiming over and over that Republicans \"are supposed to be the party of good government.\", The voice shouting into the wind was that of Charlene Foss-Eggemann, an attorney and the Republican committeewoman of Maine Township, which is part of the County Boards 17th District, which Morrison now represents. The district includes Bremen, Elk Grove, Lemont, Leyden, Lyons, Maine, Orland, Palos, Proviso, Riverside and Worth townships. I dont know why Foss-Eggemann became a Republican committeewoman (she claimed during her campaign that the previous officeholder was actually a Democrat), but most people who become party committeemen in Cook County live for moments like the one Wednesday night in a back room at Hackneys restaurant, 9550 W. 95th St. By that I mean theres no way for voters to interfere in the electoral process, newspaper editorials can sway no one, and the only people who count are those in charge of their townships political organizations. Actually, Republicans have had little to say about anything when it comes to politics in Cook County. Its the Democratic committeemen, usually the guys from Chicago, who have done most of the big backroom deals in the past, such as picking Todd Stroger, the son of Cook County Board President John Stroger, to replace his father. That didnt work out so well when Stroger placed his close friends and relatives on the county payroll (no big deal in Cook County) and then raised the county sales tax, resulting in a citizen revolt. Stroger was ousted from office, replaced by reformer Toni Preckwinkle, who last week succeeded in her campaign to restore the higher sales tax. Things change in Cook County, but not so much. The purpose of Wednesday nights meeting was to select a replacement on the County Board for Elizabeth Doody Gorman, whos also the Orland township Republican committeewoman. As the crowd gathered for the vote of the 17th District GOP committeemen, someone proudly pointed out that Morrison was nobodys son or daughter meaning hes not a Daley, Madigan, Cullerton, Lipinski or related to any of the other prominent Democratic clans who seemingly inherit the right to public office. But Morrison, the Palos Township GOP committeeman, was the hand-picked replacement of Gorman, who announced last week that she was resigning from the County Board to take a government relations job with a Fortune 100 company she declined to identify. Morrison, 47, owns a security firm he started, Morrison Security Corp. grew up in the Mount Greenwood community on Chicagos Southwest Side, graduated from Brother Rice High School and attended Moraine Valley Community College without getting a degree. The new Republican member of the County Board admits to being a registered Democrat for most of his life because, well, if you grew up in the 19th Ward of Chicago there usually werent any Republicans worth voting for and few who had any chance of victory in a general election in city and county races, Morrison explained. Morrison had twice run for a seat on the Cook County Board of (Tax) Review, which hears property tax appeals, and lost to fellow Republican Dan Patlak both times, in 2010 and 2012. My recollection is that when he took over as Palos Township committeemen he sounded like a radical Tea Party conservative, but Ive talked to him several times in recent years and he seems to have softened his rhetoric, if not his philosophy. In the spring of 2014, he and Gorman were among the first Republican committeemen to jump on the Bruce Rauner bandwagon, and they persuaded the Cook County Republican Party to endorse Rauner for governor the first time in decades that the organization had endorsed in a primary race for governor. Given their close work together, it was no shock when Gorman said she wanted Morrison to replace her on the County Board. And that endorsement meant everything. Thats because Gorman, as Orland Township committeewoman, controlled more than half the weighted vote needed to name her successor. Morrison, by voting for himself, made the outcome of the GOP gathering rather anticlimactic. That set up the dramatic declaration by Foss-Eggemann before any of the votes were cast that she had something she wanted to say. She said that since Republicans were claiming the title of the \"good government party\" of Illinois, it didnt seem right to spend only a week deliberating Gormans replacement. The nominating process should be opened up to residents in all 11 townships of the 17th District to select the most qualified person and bring transparency to the process, she said. No one laughed. I didnt see any of the other committeemen visibly gulp, either. And there were no shouts of outrage at the obvious insult to Gorman and Morrison. But I thought I did see some committeemens eyes bulge, and a few forehead veins seemed about to pop. Gorman immediately tried to repair the damage to the coronation of Morrison by pointing out that notices of the GOP committeemens meeting had been posted on the Internet, that the news media had been invited to the event (as well as the public) and it wasnt necessary, by law, to allow any riffraff into the meeting room for the sacred selection process involving party bosses. Foss-Eggemann made it clear that she had nothing against Morrison personally but felt that with three years remaining on Gormans term, the committeemen owed it to their constituents to conduct a lengthy evaluation process to find the best person to represent the district. I had to admit wondering at that moment if the woman had grown up in New Mexico or Vermont, where people believe in space aliens or elect socialists to the U.S. Senate. Sure, elected officials in Illinois talk about representative government all the time, but thats campaign rhetoric for the boobs, not the stuff party committeemen take seriously in their back rooms. Gorman noted that the Cook County Board meets next week to begin budget deliberations, so there was no time to lose in filling her seat. She then called for a vote. Morrison received the support of all the township bosses with the exception of Foss-Eggemann. Morrison would later tell me that he would not have supported restoring the 1-percentage-point sales tax increase in Cook County and would support an amendment, if presented next week, to earmark every penny collected via the higher tax to pay down pension debt (which was Preckwinkles justification for the tax hike). Other than that, Morrison said hes coming into office with no other agenda, emphasizing that hes a fiscal conservative. I suspect some people may have overlooked the fact that Morrison did not label himself a social conservative (the sort who makes issues such as abortion, welfare and immigration their priorities). Such GOP officials have tended to undermine the appeal of Illinois Republicans to independent voters. Morrison noticed how Rauner smartly stepped around those minefields during his successful campaign. Gorman steered a similar political course during her years on the board, which resulted in laudatory comments from both Democratic and Republican board members when she announced her resignation. Even the chairman of the County Boards powerful Finance Committee, John Daley, the son of one mayor and brother of another, praised Gormans ability to learn on the job. There are some who have always claimed that Gorman, whos close friends with former Chicago Ald. Eddie Vrdolyak, has always been a closet Democrat. Orland Park Mayor Dan McLaughlin, the Democratic committeemen of Orland Township, told me it will be hard to find a candidate to run against Morrison in 2018 \"because that district was designed for a Republican.\", I suppose Foss-Eggemann could end up running in a primary election against Morrison. Or maybe, by that time, she will understand why the words party committeemen and good government are never used in the same sentence. pkadner@trib.com]", "Date": "20150723", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-morrison-st-0724-20150723-story.html", "Title": "[Trying to tell party bosses about good government]"}