{"Content": "[On the grounds of St. Sabina Catholic Church on Chicagos South Side, there is an enormous wooden board, the sort that might normally display parish notices or invitations to block parties. Instead, this one bears row upon row of portraits, largely of teenagers and young adults. Some of them smiled for the camera at college graduation ceremonies; others posed in high school sports uniforms. Sometime later, all were shot dead. \"You are not forgotten,\" a notice reads. Two members of the congregation scarcely need the reminder. Pam Bosley and Annette Nance-Holt lost teenage sons to gun violence on the streets near the church. Almost a decade later, Bosley still screams when she visits the cemetery, and Nance-Holt still cannot bear to move anything in her sons bedroom. Chicago violence is a civil rights issue, according to the Rev.Michael Pflegar and activists who filed a lawsuit July 7, 2015, against three suburbs. The suitclaims Riverdale, Lyons and Lincolnwood supply an overwhelming amount of guns to the citys streets. (WGN-TV), Chicago violence is a civil rights issue, according to the Rev.Michael Pflegar and activists who filed a lawsuit July 7, 2015, against three suburbs. The suitclaims Riverdale, Lyons and Lincolnwood supply an overwhelming amount of guns to the citys streets. (WGN-TV), Now they have hit upon a novel approach to try to stem the violence plaguing this neighborhood. In an unusual lawsuit filed July 7, Bosley and Nance-Holt claim their civil rights have been violated by three suburban governments that they say do not adequately regulate gun shops near the Chicago border. The suit argues that weapons sold at these stores are responsible for too much of the violence that disproportionately afflicts this poor, black corner of Chicago. Critics say the two mothers are stretching the definition of civil rights too far, and are urging the court to dismiss the case. Either way, the suit is timely: Although Chicago recorded the fewest killings in nearly 50 years in 2013, the homicide rate has since been on the rise, darting up 20 percent in the first half of this year. More people are getting shot in other cities, as well. Police departments in New York, Washington and Milwaukee, among others, are dealing with more killings this year than last. Criminologists caution against a national explanation, especially because homicide rates have decreased in some cities, including Los Angeles. They say local factors, such as shifting gang dynamics and changes in police stop-and-frisk tactics, probably are a factor. Still, these spikes along with high-profile mass shootings in Chattanooga, Tenn. and Lafayette, La. are pushing the gun debate higher on the national agenda. Chicago has long been at the center of this debate. It is the countrys murder capital in absolute terms, although it is lower down in the rankings when population is considered. The city attracts even more attention because it is President Obamas hometown, and because Democrat Rahm Emanuel, Obamas former chief of staff, serves as mayor. So, although Garry McCarthy, the citys superintendent of police, does not know the full details of the lawsuit, he welcomes its intent. \"If we were to get gun dealers to be much more stringent in their sales, it would help us enormously,\" he said, adding that \"short-term fluctuations\" in the homicide rate are inevitable until the number of guns coming into the city decreases. \"More guns, more shootings,\" he said. McCarthy would prefer that Illinois lawmakers impose stricter gun controls and stiffer sentences for possessing illegal firearms, a solution that could take years. Bosley and Nance-Holt are not prepared to wait for that. Their wait has been long enough. After her 18-year-old son, Terrell, was killed in 2006, Bosley gave up her job as a bank administrator and twice tried to commit suicide. Then she met Nance-Holt, a battalion chief in the fire department, whose 16-year-old son, Blair, was killed in 2007, and both decided to fight. Together, they blame the three villages, Lyons, Lincolnwood and Riverdale, for what they call a \"flood\" of guns into the city. On average, police have recovered a gun sold at Chucks Gun Shop in Riverdale every day for the past 10 years, McCarthy said. Gun shops in the three villages together with another store in Indiana supplied almost a fifth of all firearms found at Chicago crime scenes from 2009 to 2013, according to a report published last year by the mayors office. The villages must clamp down on their shops, the mothers say, by insisting on security cameras, conducting employee background checks and training staff members to detect people buying guns for third parties. Central to their case is the claim that the weapons these stores sell wreak more havoc in black communities than in white ones. Tom Geoghegan, their attorney, cites a national study published last year by academics at Columbia University and Jacobi Medical Center in New York concluding that African-Americans were more than twice as likely to die in shootings as white people in the decade before 2010. Bindu Kalesan, an adjunct professor of epidemiology at Columbia and lead author of the study, said almost all evidence points toward \"structural racial disparities\" that influence how likely someone is to become a shooting victim. Another of her studies, which is being peer-reviewed, concludes that black children are four times as likely as their white counterparts to be hospitalized for firearm injuries, and that the disparity persists in both low- and high-income neighborhoods. \"Im glad that its being taken up as a civil rights issue,\" she said. At least two of the villages are challenging that argument. Steven Elrod, an attorney for Lincolnwood, said the case has \"very little legal merit.\", \"Unique is an understatement as a characterization of this complaint,\" Elrod said. By demanding that the court ask the villages to impose additional regulations, he argues, the suit crosses \"the line of separation of powers\" between the judicial and legislative branches of government. Ray Hanania, a spokesman for Lyons, released a statement arguing that Chicago was passing on \"the blame\" for its own \"shortcomings.\" A spokeswoman for Riverdale did not respond to requests for comment. The stores have remained silent, either declining or not responding to requests for comment. The National Rifle Association calls the suit \"an abuse of the legal system.\" An article on the organizations website says, \"Its a remarkable theory, to say the least, that residents of (the) city have a civil right to force other localities to adopt their citys version of gun control.\", Nance-Holt, 57, is unmoved by such protests. When she asked students at Blairs high school how many teenagers they knew who had a gun, she says almost everybodys hand went up. \"We have so many guns in the African-American community, its unbelievable,\" she said. The Rev. Michael Pfleger, pastor at St. Sabina, is joining the mothers in their suit and stands by the civil rights claim. Pfleger said the same level of violence \"wouldnt be tolerated\" if it were directed against middle-class white people. Indeed, the atmosphere on the streets around St. Sabina is markedly different from the relaxed mood on North Avenue Beach 14 miles north, where locals play volleyball or take in the downtown vistas. Here, signs in the church office implore residents to \"put the guns down.\" In the adjoining neighborhood of West Englewood, more than 100 people have been shot this year, according to figures compiled by the Chicago Tribune. Residents live in a state of constant stress, Pfleger said, with police tape and impromptu shrines as common a sight on the sidewalks as discarded soda cans. There is \"nowhere to run,\" said Nance-Holt, no guarantee that teenagers will escape shootings even if they stay out of gangs. Even walking to a Walgreens pharmacy a block away can be treacherous, Bosley said. Consider their sons: Blair Holt was shot shielding a friend on a bus home from school. Terrell Bosley was struck while unloading musical instruments outside a church. According to Harold Pollack, co-director of the University of Chicagos Crime Lab, about a fifth of teenage victims in the city are not the intended target. Instead, they get caught in the crossfire, are killed in a crowd or are hit by a stray bullet. Fifteen miles away, on the citys West Side, residents also live under the specter of violence. Angela Parchman, 26, who is African-American and lives in Austin, the citys deadliest neighborhood, has had enough. This fall, she plans to leave for good with her 4-year-old daughter, McKenzie. She is now too frightened to walk her daughter to the nearby park. \"A 4-year-old should not know how to drop when somebodys shooting,\" she said. If their suit is successful, Bosley and Nance-Holt concede that it would not solve all the citys problems. They consider it a small step in a long battle. If fewer guns fell into the wrong hands, they say, more of their neighbors would sit out on their porches, walk to the corner store and play in the local park. Bosleys personal battle is continuing. She was a choir director here before her sons death. Nine years on, she has not taken up her robes again, and believes she never will. Whoever shot her son took the music from her life. \"I have no desire to sing anymore,\" she said. \"My new life is trying to change this world and save other mothers.\"]", "Date": "20150805", "Author": "[Tom Rowley]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-mothers-suburbs-lawsuit-guns-20150804-story.html", "Title": "[Why 2 Chicago moms are suing suburbs over their murdered sons]"}