{"Content": "[I appreciate political correctness. Im not ashamed to say it. But I have to distinguish between the kind that runs afoul of good common sense and the kind that sets the stage for common decency. Theyre two distinctly different things and in the most perfect of worlds, the latter is what keeps people like Donald Trump from running off at the mouth. The political correctness most of us dont like often comes from the world of academia. Its the type that recently got the University of New Hampshire in hot water for decrying the words \"American,\" \"mothering,\" and \"fathering,\" as problematic. The university wound up deletingits \"Bias-Free Language Guide\" after an onslaught of public criticism. Over the years, other universities have engaged in all manner of loony-ness such as quibbling over the word \"freshman,\" believing \"first-year student\" was more appropriate or more \"gender-inclusive.\" Or, protesting speakers because they have a deeply (or even mildly) objectionable point of view. Professors also have had to tiptoe around sometimes benign issues fearing that a student might file a grievance accusing them of, say, sexual harassment or racial insensitivity. This type of political correctness can be extreme and nonsensical and often doesnt succeed at much beyond absurdity. Inscribed on the wall of the Tribune Tower lobby is the Voltaire-inspired quote, \"I do not agree with a word that you say, but I will defend to the death your right to say it.\" (Apparently Voltaire didnt really write it; his biographer did.), Although the quote is profound, the massacre earlier this year at the French magazine Charlie Hebdo is a painful reminder of what happens when free speech (even the most vile ) clashes with the radical ideology of hate-filled terrorists. Donald Trump was furious over Megyn Kellys questions in the debate and said in a CNN interview: \"You could see there was blood coming out of her eyes, blood coming out of her whatever.\" With the backlash, Trump is doing damage control. Aug.10, 2015. (Inside Edition), Donald Trump was furious over Megyn Kellys questions in the debate and said in a CNN interview: \"You could see there was blood coming out of her eyes, blood coming out of her whatever.\" With the backlash, Trump is doing damage control. Aug.10, 2015. (Inside Edition), The political correctness I appreciate tends not to impede free speech. What it does best is impede diarrhea of the mouth. And that brings me back to Trump. During the GOP debate last week, Trump said, \"I think the big problem this country has is being politically correct. Ive been challenged by so many people and I dont, frankly, have time for total political correctness. And to be honest with you, this country doesnt have time, either.\", Well, Mr. Trump, what the country really doesnt have time for are comments that are reckless and ill-informed. Trump has spent the last several weeks insulting Mexicans, John McCain and, most recently, Megyn Kelly and her menstrual cycle. Hes reminiscent of the crazy uncle (and we all have at least one) who says outlandish stuff most people would ignore if he didnt spew it around the impressionable relatives aka the low-information voters. And while we might expect said uncle to rely on anecdotes for research, or just pull information out of his hindside, we certainly should demand more from someone seeking the presidency. The political correctness I appreciate instills in folks a sort of checks and balances; it helps recalibrate their brain so that what comes up doesnt just come out. It allows for and heres the most crucial thing purposeful discourse, where people can speak openly and honestly as we confront issues that are critical to the well-being of our democracy. Issues of education, race, poverty, immigration, criminal justice, reproductive rights, health care, national security, voting rights and on and on. We cant hear one another when were engaged in a yelling match, or when the opening salvo to a discussion is pure lunacy. We cant get down to business. Yes, most of us dig authenticity and straight shooters, especially in the realm of politics, where they are indeed a rare breed. But I wholeheartedly reject the idea that common sense and common decency cant coexist. And that nuance is the enemy, and bombast (masquerading as frankness) should rule the day or the election season. dmturner@tribpub.com]", "Date": "20150812", "Author": "[Dawn M. Turner]", "Link": "http://www.chicagotribune.com/news/columnists/ct-dawn-turner-column-political-correctness-20150812-column.html", "Title": "[An appreciation for political correctness]"}