{"Content": "[President Barack Obama has selected the University of Chicago to host his library and museum, sources have told the Chicago Tribune. Despite a flurry of reports Thursday that Chicago had won the library, there was no official confirmation by the Obama administration, City Hall or the Obama Foundation, which is leading the site selection process. Martin Nesbitt, the foundations president and a close friend of the presidents, declined to comment Thursday night. Last Friday, Obama called Mayor Rahm Emanuels office to thank the mayor and the two Democratic leaders of the Illinois legislature, House Speaker Michael Madigan and Senate President John Cullerton, for fast-tracking state legislation that would authorize the use of parkland for a presidential library, said a source familiar with the conversation who was not authorized to speak publicly about it. Obama did not go further to indicate the library would be located in Chicago, the source said. Sources said it remained unclear whether a decision had been made on which South Side park to build the library Washington Park or Jackson Park. According to one source, the official announcement could come in the next few weeks. The president and the Barack Obama Foundation also have considered a plan, according to sources, to place the presidents offices and the foundation in New York. It would be an arrangement similar to former President Bill Clinton, who built his library, museum and institute in Little Rock but operates his foundation, from which global projects are launched, in Harlem. Sources said Obamas offices could be built in West Harlem, on land offered by Columbia University, the U. of C.s chief competitor for the library. However, it was unclear whether the president had made a final decision. That announcement is expected to come later. It comes as no surprise to Chicagoans that the presidential library will be built near the University of Chicago campus as both President Barack Obamaand his wife, Michelle,worked at University of Chicago prior to living in Washington,D.C. (WGN TV), It comes as no surprise to Chicagoans that the presidential library will be built near the University of Chicago campus as both President Barack Obamaand his wife, Michelle,worked at University of Chicago prior to living in Washington,D.C. (WGN TV), Officials in Hawaii already have been told that they would not get the library instead would instead be allowed to build a project that represents the states ties with the president, sources said. Hawaii has proposed a presidential center that includes a museum-type visitors center, as well as education and research facilities. The details of the foundation-sanctioned project were still being worked out. The University of Illinois at Chicago is the only one of the four finalists that could walk away empty-handed. The reports about the library decision came on a night the Emanuel administration was already receiving national publicity as Chicago hosts the NFL draft downtown. Rep. Mike Quigley, D-Ill. who was at a meeting with Obama at the White House on Thursday to discuss a pending trade deal, said he hadnt been told \"definitively\" that Chicago would be chosen for the library site. But \"I had people tell me that Ill be happy with the decision,\" Quigley said, adding that the message has been communicated to him \"weekly for the last month.\", \"Im going to be cautiously optimistic,\" he said. \"After we got the NFL draft, everything else is anticlimactic.\", The selection caps a yearlong competition that began with 13 bids that eventually were narrowed down to four finalists. The U. of C. where Obama taught constitutional law for a dozen years and first lady Michelle Obama formerly worked as a hospital administrator, had long been considered the front-runner. The South Side also is where Obama launched his political career as a state senator in 1996 and where the first lady was born. Obamas sister, Maya Soetoro-Ng, who serves on the Barack Obama Foundation board, and her husband, Konrad Ng, led the site selection process, working closely with the president and first lady to figure out what would go where, sources said. Soetoro-Ng and her husband live in Honolulu. The plan to award the project to the U. of C. has been in place since late March, but the announcement was delayed after Emanuel failed to win his re-election bid in February and ended up in a runoff. The White House decided to wait until after the April 7 runoff election to announce the plan, sources said. The reason for delaying an announcement until after the Chicago runoff, sources said, was that the president wanted to know who would be in the mayors seat as the estimated $500 million project is carried out over the next several years. Earlier this month, Obama was quoted in a Chicago Tribune editorial saying he hoped his library ended up in Chicago but acknowleding that there were \"some entanglements.\", In recent months, Emanuel has taken a public leadership role in securing the library for Chicago. After the foundation made its concerns known in December that the U. of C. was offering to build the library on public land that it did not own, Emanuel stepped in and shepherded a controversial plan to transfer parkland to the citys control. Under the plan submitted by the U. of C. the library and museum would be placed either on 20 acres in Jackson Park or 21 acres in Washington Park for $1. The university also has offered 6 acres that it owns in the Washington Park neighborhood and another 5 acres owned by the city and the Chicago Transit Authority. State lawmakers attempted to head off further legal wrangling over whether the library could be built on public land last week, when legislation aimed at providing legal protections for the library was quickly passed. Friends of the Parks, which already has filed a federal lawsuit challenging plans for a proposed Lucas Museum of Narrative Art on parkland, has been the chief opposition to building the Obama library on parkland. The bill went to Republican Gov. Bruce Rauner, whose office wouldnt say whether he would sign it. Rauner spokesman Lance Trover repeated Thursday that the administration had \"no comment\" on the legislation. Michael A. Memoli of the Tribune Washington Bureau contributed. dglanton@tribpub.com, rap30@aol.com]", "Date": "20150501", "Author": "[Dahleen Glanton, Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-obama-library-chicago-met-20150430-story.html", "Title": "[Obama's library to be built in Chicago, sources say]"}