{"Content": "[CHICAGO, IL. -June 3, 2015-Brooke M. Wiseman, a nationally recognized not-for profit organization executive, has been elected President of the Union League Club of Chicago, a 136-year-old non-partisan civic, cultural and philanthropic organization. Wiseman, a Woodridge, Illinois resident, is the National CEO of Blessings in a Backpack, a non-profit organization recognized by People as its Charity of the Year in 2012, for its work of feeding 77,000 hungry children in 46 states on weekends by sending home a backpack full of food. The Union League Club of Chicago traces its roots to 1862 when Chicago Tribune editor Joseph Medill and other Midwest civic leaders launched a movement in support of a somewhat fragile federal union under the banner, \"Union League of America.\" In 1879, the Chicago Club of the Union League of America was incorporated and in 1882 changed its name to the Union League Club of Chicago. Today, the Clubs members are men and women who are active proponents of the Clubs commitment to community, country and culture through a broad range of public, civic, cultural and philanthropic activities that impact the Chicago metropolitan area, the state of Illinois, surrounding states and the nation. The Club also is recognized as owning the oldest and most important collection of American fine art, more than 800 pieces, held by a private organization in the Midwest. Earlier in her career, Wiseman was the Chief Development and Marketing Officer of the YWCA of Metropolitan Chicago and as CEO of the Girl Scouts of Chicago for 16 years. Wiseman served six years as the national President of the Association of Girl Scout Executive staff and chaired the Girl Scouts National Certified CEO Commission. She was named one of the \"100 Women Making a Difference\" by Todays Chicago Woman in 2000 and the following year received the Human Relations award from the Chicago Commission on Human Relations. Wiseman has served on the board of directors for Leadership of Greater Chicago Fellows Association, Chicago State University Foundation and the Junior League of Chicago Community Advisory Board. She is a member of The Chicago Network, Executives Club of Chicago and the Economic Club of Chicago. A member of the Union League Club of Chicago since 2000, Wiseman has served on the Clubs communications, house, admissions, and library and membership committees. Previously, she served on the Clubs board of directors where she chaired the member events and membership committees, led the organizations first Diversity Task Force. Most recently, she served as the Clubs First Vice President. Wiseman earned a bachelors degree in social work and psychology from Ball State University and a masters degree in communications from Michigan State University. She also holds a certificate in non-profit management from Case Western University and has taught at the Kellogg School of Management, the Center for Non-Profit Management at Northwestern University and the University of Notre Dames Non-Profit Executive Education program. About the Union League Club of Chicago, Club Leaders Forum, an independent national survey of 7,000 club managers, presidents, directors and owners, has named the Union League Club of Chicago the number one private city club in the U.S. In 1879, the Clubs founders, members of Chicagos business, civic, cultural and political leadership, were motivated by the legacy of the Union Leagues of America, patriotic organizations that formed during the Civil War to raise funds for the Union Army. Following the end of the war, these individuals established a private club dedicated to upholding democracy, instilling patriotism in future generations, and providing ongoing support for Americas military. The Club has focused attention on critical public policy issues and stimulated action on important non-partisan initiatives. Members of the Union League Club of Chicago have been credited with playing important roles in establishing many of the citys leading cultural organizations including: The Art Institute of Chicago, Orchestra Hall, the Auditorium Theater and the Field Museum. Early leaders of the Union League Club, including architects Daniel Burnham and John Wellborn Root; merchant Harlow Higginbotham, a partner of Marshall Field; and Club president, Frederick Peck, were instrumental in creating the Worlds Columbian Exposition of 1893. The Fair drew 27 million people from the United States and abroad, demonstrated dramatic recovery from the Great Chicago Fire of 1871 and positioned Chicago as a world- class city. Since its inception, the Union League Club of Chicago has supported the men and women of the U.S military and their families through numerous initiatives. The Club is headquarters for the Armed Forces Council of Chicago, a non-profit organization that works closely with the City of Chicago and regional military commands in support of public celebrations involving the Armed Forces, including Memorial Day, Independence Day, Veterans Day and Armed Forces Week. Two civilian military support groups operate within the Union League Club under the aegis of the Armed Forces Council: the \"Chicago 502 Club,\" a unit that assists the soldiers and families of the elite 502nd Regiment of the 101st Airborne Division of the U.S. Army and the\" 721 Club,\" a unit that aids the crew and families of the U.S. Navys USS Chicago 721, a nuclear submarine. Members of the Club are taking a leadership role in the Commissioning Committee of SSN 786, USS Illinois, the U.S. Navys newest nuclear powered submarine currently under construction at Groton, Connecticut where it is scheduled to be christened later this year and commissioned early in 2016. In cooperation with the Medal of Honor Society and the Pritzker Military Library, the Club has been privileged to host Medal of Honor recipients. Since its founding, the Union League Club of Chicago is the only private club in the United States with a full-time public affairs staff who help Club members focus attention on critical public policy issues and stimulate action on important non-partisan initiatives. Early in its history, the Union League Club protected the City of Chicagos municipal personnel code and urged adoption of what became the 17th Amendment to the U.S. Constitution that mandated election of U.S. Senators by popular vote instead of state legislators. Recognized for its work in promoting election and judicial reforms, the Union League Club is credited with launching the Chicago Crime Commission and helping to shape a new Illinois state Constitution in 1970. More recently, the Union League Clubs Public Affairs Committee led the charge to establish Chicagos Harold Washington Library, the largest public library building in the world, and also advocated a moratorium on executions in Illinois. To help reduce recidivism rates of the mentally ill in the Cook County Jail, the Club worked with other civic groups to successfully amend Illinois Medicaid law to suspend rather than terminate Medicaid eligibility of mentally ill persons who are detained, so that critical medical and counseling services they depend upon can be more readily re-instated following their release. Among the Clubs current initiatives are the improvement of regional transportation, literacy programs and education funding in Illinois. It also invites candidates for major public offices to participate in non-partisan public forums. The Union League Club of Chicago sponsors three independent philanthropic foundations: Union League Boys and Girls Clubs which serve more than 12,000 youth in seven Clubs in the City of Chicago and a residential summer camp in southern Wisconsin; Luminarts Cultural Foundation that provides scholarships and grants in art, music, writing, performance, civic and academics for hundreds of young people; and the Chicago Engineers Foundation, that grants incentive awards to engineering students. # # # , This item was posted by a community contributor. To read more about community contributors, click here.]", "Date": "20150603", "Author": "[Community Contributor richard barry]", "Link": "http://www.chicagotribune.com/business/promotions/chi-ugc-article-brooke-wiseman-non-profit-organization-execu-2015-06-05-story.html", "Title": "[BROOKE WISEMAN, NON-PROFIT ORGANIZATION EXECUTIVE, ELECTED 126TH PRESIDENT OF UNION LEAGUE CLUB OF CHICAGO]"}