{"Content": "[The latest financial report of ex- Rep. Aaron Schocks political action committee shows payments to upscale restaurants and hotels, as well as refunds to some contributors. Nearly 50 people contributed to Schocks Generation Y Fund in the first six months of the year, according to a report filed with the Federal Election Commission. Among those reimbursed were three Illinois businessmen, who each got $5,000: Craig Duchossois, of Chicago, CEO of The Duchossois Group, a privately held family business; William Kunkler, of Chicago, executive vice president of CC Industries, a private equity firm; and David MacNeil, of Bolingbrook, president of MacNeil Automotive Products. The fund made a payment of more than $22,000 to The Little Nell, a five-star hotel in Aspen, Colo. for the rental of an event facility, the report shows. The PAC reported more than $5,400 in spending this year at Joes Seafood, Prime Steak & Stone Crab, an upscale restaurant in Washington. The money includes a $1,700 payment in April after Schock left Congress. Schocks PAC had a balance of nearly $75,000 on June 30. During the first half of the year, it took in nearly $115,000 and disbursed more than $76,000. Schock, 34, is under federal investigation following questions about how he was spending campaign and taxpayer money.The PAC received nearly $82,000 from the Schock Victory Committee, a joint fundraising committee, last March 7, which was 10 days before Schock announced he was quitting Congress. In May the PAC gave more than $22,000 to Schock for Congress, his principal campaign committee and one that has bankrolled more than a million dollars in legal bills this year. Rep. Aaron Schocks resignation after six weeks of intense scrutiny over spending, travel and real estate deals marked a stunning fall for a politician once seen as a rising young voice in Congress. Details about Schocks own wealth emerges in another recently disclosed report. His personal financial disclosure shows investment assets worth $1.4 million to $2.7 million and liabilities in the range of $750,000 to $1.5 million. The report asks for assets and liabilities in broad ranges, so he was not required to give exact figures. Most of Schocks wealth appears to lie in rental property held by three entities: Menards Peoria LLC, Aurelia Properties LLC and the Old Orchard Land Trust. Schock also reported taking two foreign trips paid for by outsiders last year. He said he went to Brazil from May 10-18, 2014, and its government paid unspecified costs. He said he went to India from Aug. 24-29, 2014, and The Global Poverty Project in New York City picked up the tab. The India trip cost $6,214, other documents show. Last week, Schock appeared in federal court in Springfield for a two-day hearing to determine whether he should be held in civil contempt for failing to comply with a judges order to produce campaign and congressional records. Schock is making a constitutional argument to bar the release of some of the records that federal prosecutors are seeking. There are indications that prosecutors and defense lawyers have reached a tentative agreement regarding subpoenaed documents. kskiba@tribpub.com, Twitter @KatherineSkiba]", "Date": "20150803", "Author": "[Katherine Skiba]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-schock-pac-fec-report-met-20150803-story.html", "Title": "[ Aaron Schock's PAC refunded money to 3 Illinois businessmen]"}