{"Content": "[President Barack Obama conceded Wednesday that the U.S. government had let down the families of Americans held hostage by terrorists and promised they would not face criminal prosecution for paying ransoms to their loved ones captors. \"These families have already suffered enough and they should never feel ignored or victimized by their own government,\" Obama said as he detailed the results of a six-month review of U.S. hostage policy. The president said for the first time that U.S. government officials can communicate directly with terrorists and help families negotiate for the release of hostages. More than 30 Americans are being held hostage abroad, White House officials said. The review was sparked by sharp criticism of the Obama administration from families of Americans kidnapped by the Islamic State, al-Qaida and other groups. Families have complained about receiving confusing and contradictory information from the government and bristled at threats of prosecution for considering paying terrorists to secure the release of hostages. By clearing the way for payment of ransom without fear of criminal charges, Obama is essentially allowing families to take actions the U.S. government has long said put Americans at risk. While the government will continue to abide by prohibitions on paying ransoms or making other concessions to terrorists, the Justice Department indicated it would ignore the law in situations involving families. European governments routinely pay ransom to win the release of hostages. However, Obama and his predecessors have argued that policy provides terrorists with funds to fuel dangerous activities and puts Americans at greater risk of kidnapping. Critics of the White House review argue that allowing families to do what the government will not could lead to those same troubling consequences. \"We have had a policy in the United States for over 200 years of not paying ransom and not negotiating with terrorists,\" said House Speaker John Boehner, R-Ohio. \"The concern that I have is that by lifting that long-held principle you could be endangering more Americans here and overseas.\", Sen. John McCain, R-Ariz. said he, too, worries that paying ransom could encourage terrorism. But McCain, who met Wednesday with the family of Kayla Mueller, an Arizona woman killed after being kidnapped by the Islamic State, added that \"to tell a family member as this administration did that they could go to jail is unconscionable.\", White House officials drew a distinction between the concessions private individuals could make to terrorists, which are largely financial, and the more wide-ranging deals the U.S. government could strike, including military activity and other foreign policy priorities. Still, officials acknowledged that allowing some concessions and banning others could be perceived as a contradictory policy. \"Theres no doubt that the payment of ransoms fuels the very activity that we are trying to stop,\" said Lisa Monaco, the presidents top counterterrorism adviser. \"At the same time weve got a responsibility to stand with families as they make the most difficult decisions we could ever imagine.\", Ahead of his public comments, Obama held an emotional private meeting with former hostages, as well as families of Americans currently being held and those who have been freed or killed in captivity. \"I acknowledged to them in private what I want to say publicly, that it is true that there have been times where our government, regardless of good intentions, has let them down,\" he said. \"I promised them that we can do better.\", Despite the ban on the U.S. government making concessions to terrorists, the Obama administration did negotiate with the Taliban last year to win the release of Army Sgt. Bowe Bergdahl, who was captured after walking away from this post in Afghanistan. Five Guantanamo Bay detainees were exchanged as a condition of his release. White House officials say those negotiations were permissible because Obama sees a special responsibility to leave no American service member behind on the battlefield. Four other Americans have been killed by the Islamic State since last summer: journalists James Foley and Steven Sotloff and aid workers Peter Kassig and Mueller. After the release of gruesome videos showing the beheadings of some hostages, Obama approved an airstrike campaign against IS in Iraq and Syria. Luke Somers, an American journalist kidnapped in Yemen, was also killed during a failed U.S. rescue attempt. Warren Weinstein, an American held by al-Qaida, was accidentally killed by a U.S. drone strike against a terrorist compound in Pakistan. The families of some of these hostages have been among the most vocal in pushing for changes in U.S. government policy. In a statement Tuesday, Weinsteins wife, Elaine, said she hoped her family would be the last \"that fails to receive the level of coordinated government support that those who serve abroad deserve when trouble finds them.\", The Mueller, Kassig and Sotloff families issued a joint statement saying they \"have faith that the changes announced today will lead to increased success in bringing our citizens home.\", \"The changes are a step in the right direction; were hopeful they will make a difference for families and their friends and loved ones facing this horror currently and in the future,\" they said. Foleys parents released a statement Wednesday night saying: \"We want to commend the hostage review team for their in-depth evaluation of the American hostage issue. We applaud their willingness to examine the previously inadequate response to the kidnapping of American citizens abroad.\", In a step aimed at streamlining communications with families, Obama also announced the creation of a \"Hostage Recovery Fusion Cell\" that will coordinate recovery efforts among various government agencies. Some families had pushed for the new office to be based at the White House, but it will be at the FBI. The president said it was \"totally unacceptable\" that hostages families had felt lost in the bureaucracy and he said the fusion cell would be an important step in rectifying that problem. Associated Press]", "Date": "20150625", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-obama-hostage-ransom-20150624-story.html", "Title": "[ Obama: U.S. government has let down hostages' families ]"}