{"Content": "[As Mayor Rahm Emanuel toured the soon-to-open Chinatown branch of the Chicago Public Library on Thursday, his intense brown eyes gazed up to a circular skylight, then settled on a curving wall of glass with a drop-dead view of the downtown skyline. \"Just look at this window the size of that. You dont see that at some of the other libraries,\" the mayor observed, referring to the brick walls of the citys boxy, cookie-cutter branch libraries. \"Its a unique piece of architecture.\", \"Its pretty simple,\" interjected the librarys architect, Brian Lee of Skidmore, Owings & Merrill, which typically turns out mega-skyscrapers like Willis Tower. \"We didnt do a lot of bells and whistles in terms of odd angles or other things.\", The mayor responded, \"Simple for you, big for the city.\", In a turn few would have predicted and some might criticize as frivolous in light of Chicagos perilous finances the fiercely competitive, frequently wise-cracking mayor is publicly promoting architecture, the art that is to Chicago what music is to Salzburg: Its not just a cultural touchstone, but a magnet that lures tourists by the boatload. Last week, in two interviews with the Tribune, the mayor discoursed on subjects from his favorite buildings (the green office building at 333 W. Wacker Drive tops the list) to the \"north stars\" that guided the creation of such popular public spaces as the 606 trail and the newly extended downtown Riverwalk. Those principles \"open, accessible and green\" will be adhered to, Emanuel insists, in the soon-to-be-unveiled, revised design for the controversial Lucas Museum on the lakefront. Friends of the Parks, which is battling the museum plan in federal court, is sure to disagree. The mayor touched, too, on the highly anticipated opening of the first Chicago Architecture Biennial, a sprawling exhibition of cutting-edge architecture that will bring designers from around the world to the city from Oct. 3 to Jan. 3. Besides boosting tourism and economic growth, the biennials purpose is \"to brand the city as the place, as it has always been, of modern architecture,\" Emanuel said Tuesday at his City Hall office. \"People are coming back to the cities,\" the mayor added, citing a reversal of the flight to suburbs in the 1950s and 1960s. \"How do you maintain quality of life? ... I think that conference is going to be an important part of that conversation and I want Chicago dead center in the middle of it.\", This is not the same Emanuel who ruffled feathers in Chicagos close-knit architecture community after his first election to the mayors office in 2011. Emanuels predecessor, Richard M. Daley, was deeply engaged in big projects like Millennium Park and even the occasional building detail; he once ordered Donald Trump to put a spire atop Trumps Chicago tower. But Daley had the luxury of governing in boom times. When Emanuel took over, the citys books were splattered with red ink. By choice or inclination, he turned his attention elsewhere, arousing fear that Daleys drive to make good design a key part of governing was endangered. Now, some sense a change. On Tuesday night, for example, the mayor attended a reception at the Gold Coast home of Chicago zoning lawyer Jack Guthman, the biennials vice chair. Architects like Stanley Tigerman and Dirk Lohan were there, Guthman said. Emanuel \"is totally behind this,\" Guthman said. He wants \"to have Chicago again on the international stage as not just a center where great buildings are built, but also as a place where architectural ideas are being considered.\", \"I think the biennial has helped him put on a pair of glasses about architecture and design,\" said Lynn Osmond, president of the Chicago Architecture Foundation. Now in his fifth year in office, the mayor emerges as a figure who has picked up Daleys baton and run with it. Hes used his skill at prying money from Washington to realize such initiatives as turning the once-industrial, still-polluted Chicago River into the citys second showcase waterfront. But Emanuel also is charting his own course on such things as the biennial and a move away from the cookie-cutter \"prototype\" structures erected by the Public Building Commission of Chicago. Daley, in his role as the commissions chair, backed the prototypes on the grounds that they would save money. Yet the prototypes have a numbing sameness and lack architectural flair. In contrast, the two-story Chinatown library at 2100 S. Wentworth Ave. is a rounded triangle, sheathed in glass and metal fins, that will act as beacons at night, especially when seen from the nearby CTA rapid-transit station. Opening Aug. 29, it cost $19.1 million a slight markup from a comparable prototype library, according to the Public Building Commission. \"Its an invitation for us to think outside the box,\" Emanuel said. \"You cant say (the prototype program) is over, but thank God, were shaking up its foundation.\", Anyone who doubts Emanuels passion for the difference that design makes has not heard him wax romantic about the new stretch of Riverwalk that lines the south bank of the Chicago River between State and LaSalle streets. A short walk from City Hall, the public space is drawing big crowds with a wine bar and its views of the corncob-shaped towers of Marina City and other architectural gems. Powerboats tie up there, adding to the maritime atmosphere. \"I love it,\" the mayor said, adding that he sometimes drops by for lunch. \"Its open. Youre next to water. And you see people from all walks of life. Its just got a relaxation to it.\", Answering those who argue that the financially strapped city should forgo such projects, the mayor asserts that developers have committed to investing $8 billion on riverfront construction since 2011 when he promised to turn the river into the citys next recreational frontier. That may be a politicians exaggeration; some of the new buildings might have gone up anyway. But the construction cranes along the river, symbols of growth and Chicagos capacity to reinvent itself, speak for themselves. \"If you want to solve the fiscal issue, you grow the economy,\" Emanuel said. \"What grows the economy? $8 billion of private investment. Thats job growth.\" New revenue generated by the Riverwalk, he predicted, will help Chicago pay back the nearly $99 million federal loan that backed the project. Eager to counter the narrative that Chicago is a modern-day version of Charles Dickens novel, \"A Tale of Two Cities,\" with its polished downtown co-existing with chaotic areas where shootings are commonplace the mayor was at pains to lay out his neighborhood-development bona fides. Pointing to the new Chinatown library, a boathouse in Ping Tom Memorial Park and other public works upgrades in Chinatown, he laid out his \"essential building blocks\" for thriving neighborhoods a good public school, public safety, a park, a playground, a library and access to transportation. He explained why he wants art in every CTA rapid-transit station and why Chicago artist Theaster Gates has designed art for the under-construction 95th/Dan Ryan Red Line station: \"Because the train station is more than catching the train to work. It is a public space.\", Hammering home his art-for-all theme, the mayor recalled how he was riding his bike along Lake Michigan one Saturday and was dismayed to see no public sculpture south of Soldier Field. \"I called Mike Kelly (the general superintendent of the Chicago Park District) and I said, Mike, I love the sculpture.He goes Yeah? and I go, But Mike, it ends at Soldier Field. He goes What do you mean? I go: Is there something about 35th Street (that) you dont want to put sculpture? I want sculpture the whole distance of Lake Shore Drive, not part.\", The mayor also touted upcoming nature preserves, from the Southeast Sides Big Marsh bike park to the soon-to-open southern end of Northerly Island on the Museum Campus. Daley made the latter possible when he bulldozed the small lakefront airport, Meigs Field, in 2003. The nature preserves are true to Chicagos \"City in a Garden\" motto, Emanuel said, and having one in the downtown area is \"really unique.\" At Northerly Island, people will be able to climb hills and enjoy a lagoon within sight of the skyline. \"So, on that level, you could never have gotten there without the bold action of my predecessor,\" he said of Daley. \"Doing his shock and awe he got something done that if he hadnt done, probably given our litigious society, I think wed still be litigating.\", Previewing the soon-to-be-released, revised plans for the museum that \"Star Wars\" creator George Lucas wants to build, Emanuel made a point of saying that the plan will include parkland designed by Chicago architect Jeanne Gang and that it will be consistent with his north stars of \"open, accessible and green.\" The museum would rise on what is now a surface parking lot between Soldier Field and McCormick Places east building. \"Today, its open, its not green and its not very accessible,\" the mayor said. Asked if he likes the museum design, which in the first version was a mountain-like structure that some compared to a pile of road salt, Emanuel said: \"It is bold. Its a statement. And I think its a dramatic and marked improvement over the parking lot.\", Faint praise?, To be sure, some residents complain their neighborhoods arent as clean as they were under Daley. Some drivers chafe because the mayors bike lanes give them less room to maneuver. And Emanuel is often accused of continuing Daleys dictatorial ways. \"You are not the king of this city,\" challenger Jesus \"Chuy\" Garcia told him during last springs election campaign. Still, this much is clear: In Emanuels vision for Chicago an outgrowth of Daleys in many ways, a departure from it in others good design is a key instrument in the mayoral toolbox. And it has symbolic power. Picking up a tiny orange chair in the childrens reading area of the Chinatown library, the mayor joked: \"So if you vote against the budget, this is the chair we give you.\", bkamin@tribpub.com, Twitter @BlairKamin]", "Date": "20150823", "Author": "[Blair Kamin]", "Link": "http://www.chicagotribune.com/news/columnists/ct-emanuel-on-design-kamin-met-0823-20150823-column.html", "Title": "[Mayor Emanuel burnishes Chicago's architectural stature and maybe his own]"}