{"Content": "[Fulfilling ambitions to raise a historic amount of money in pursuit of the White House, Republican presidential candidate Jeb Bush and his allies took full advantage of the nations evolving campaign finance laws to collect more than $114 million in the first six months of the year. No candidate for president has benefited from so much money so early in a campaign. While the total is sure to widely eclipse the fundraising hauls of Bushs 16 major competitors for the GOP nomination, the ambitious $100 million goal and Bushs success at reaching it on schedule has yet to scare any challenger from the race. The total announced Thursday includes $103 million raised by Right to Rise, a super PAC that will support Bush in the crowded GOP contest. The rest came into Bushs formal campaign. \"More than the symbolism of surpassing $100 million, the totals demonstrate Bushs success charting new territory,\" said Bush donor Mark Jacobs, a former Texas energy executive who now lives in Iowa. \"Its that Right to Rise has raised more and been more successful than any political organization ever.\", The former governor of Florida is taking a unique approach to a presidential bid by delegating many operations to Right to Rise, which as a super PAC is free of the limits placed on how much money a traditional campaign can raise from individual donors. Designed with longtime aides Sally Bradshaw, Mike Murphy and others, its a strategy untested in modern politics, the outgrowth of court decisions in 2010 that led to the creation of the super PAC. Based in Los Angeles, Right to Rise will handle a huge part of the costly work of running for president, including buying TV, online and radio commercials, conducting polling and even doing some organizing tasks such as voter outreach in early primary states. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. By law, it cant take direction from Bushs Miami-based campaign, and the two operations have limits on how they can communicate. Bushs official campaign and its markedly smaller bank account will pay for his travel and employee salaries, and give him a pot of money from which to craft messages exactly as he sees fit. Right to Rise already is advertising on Bushs behalf. It has spent $47,000 so far on digital media, according to documents filed this week with the Federal Election Commission. The group has also inquired with broadcast and cable stations in the early primary states about booking TV ad time. Bush isnt alone in counting on significant support from a super PAC. Texas Sen. Ted Cruz has raised $14.2 million for his campaign, while supporters have given his affiliated super PACs an additional $38 million. The campaign of former technology executive Carly Fiorina has raised $1.4 million, but much of her day-to-day political messaging is coming through a super PAC that has pulled in more than twice as much. Thursdays announcement proved Bushs strategy will set fundraising records. Right to Rises haul of $103 million in six months exceeds the $79 million Priorities USA Action raised during the two-year 2012 election cycle to support the re-election of President Barack Obama, and is two-thirds of the $154 million raised by the super PAC backing Republican Mitt Romney in those years. The son and brother of presidents, Bush said in December he planned to explore a campaign and then immediately set out to tap his and his familys deep roster of experienced fundraisers and likely donors. With their help, he traveled the country raising money at events at which the suggested donation was often as much as $100,000 a person. At one point in the fundraising spree, Bush limited contributions to Right to Rise to no more than $1 million. But Bill Kunkler, a Chicago private equity executive and Bush donor, said that while the Bush name may have opened some doors, its Jeb Bush who closed the deal. \"People have been willing to take a look, and hes overcome the people who have said, Not another Bush,\" Kunkler said Thursday. \"People are looking at him as a guy who did it on his own, and who stands on his own.\", In announcing its fundraising Thursday, Right to Rise said it had about 9,400 donors who had given $25,000 or less, and about 500 whod given more. Several major donors to Romney began turning toward Bush in January, and some would later raise $1 million at an event in Chicago that lasted just an hour. And in February, those same donors put together an event that brought in $4 million for the super PAC. Bushs formal campaign operates in far more restrictive territory. Individual donors cant give more than $2,700 to the primary elections and, if Bush wins the GOP nomination, $2,700 he can spend in the general election. After making his candidacy official on June 15, Bushs campaign super-charged fundraising with a contest called \"27 in Fifteen,\" in which top supporters were encouraged to gather $27,000 worth of donations in the first 15 days of the campaign. Those who succeeded were being rewarded with a retreat this weekend at the Bush family compound in Kennebunkport, Maine. The private gathering features an \"evening picnic\" with Bush and his parents, former President George H.W. Bush and Barbara Bush, and a morning \"political and campaign briefing\" with senior campaign officials. In all, Bushs campaign raised $11.4 million or an average of $710,000 per day through the end of June. They touted that daily average as more than the average of $562,000 per day raised by Democratic front-runner Hillary Rodham Clinton since she launched her campaign April 12. Clintons haul in that time totaled $45 million. Associated Press]", "Date": "20150709", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-jeb-bush-campaign-funds-20150709-story.html", "Title": "[Jeb Bush, super PAC raise more than $114 million for 2016 race]"}