{"Content": "[The United States and Turkey are finalizing plans for a military campaign to push the Islamic State group out of a strip of Syrian territory along the Turkish border, a move that would further embroil Turkey in Syrias civil war and set up a potential conflict with U.S.-backed Kurdish forces. A U.S. official said Monday that the creation of an \"Islamic State-free zone\" would ensure greater security and stability in the Turkish-Syrian border region. However, the official said any joint military efforts with Turkey would not include the imposition of a no-fly zone. The official insisted on anonymity because this person was not authorized to publicly discuss the talks with Turkey. The U.S. has long rejected Turkish and other requests for a no-fly zone to halt Syrian government air raids, fearing it would draw U.S. forces further into the civil war. The discussions come amid a major tactical shift in Turkeys approach to the Islamic State. After months of reluctance, Turkish warplanes started striking militant targets in Syria last week, following a long-awaited agreement allowing the U.S. to launch its own strikes from Turkeys strategically located Incirlik Air Base. On Sunday, Turkey called a meeting of its NATO allies for Tuesday to discuss threats to its security, as well as its airstrikes. A Turkish-driven military campaign to push IS out of territory along the Turkish border is likely to complicate matters on the ground. Kurdish fighters in Syria control most of the 910 kilometers (565 miles) boundary with Turkey, and have warned Ankara against any military intervention in northern Syria. In a series of cross border strikes since Friday, Turkey has not only targeted the IS group but also Kurdish fighters affiliated with forces battling the extremists in Syria and Iraq. The Syrian Kurds are among the most effective ground forces battling the IS group and have been aided by U.S.-led airstrikes, but Turkey fears they could revive an insurgency against Ankara in pursuit of an independent state. Kurdish fighters closed in on the Islamic State-controlled border town of Tal Abyad in northern Syria, cutting roads and supply lines that lead to the extremists de facto capital in the Syrian city of Raqqa. Syrias main Kurdish militia the YPG or the Peoples Protection Units is affiliated with the Kurdistan Workers Party, or PKK, which has waged a decades-long insurgency in Turkey and maintains bases in remote parts of northern Iraq. It was not immediately clear how an IS-free zone would be established along the Turkish-Syrian border. In comments published Monday, Turkish Prime Minister Ahmet Davutoglu said Turkey and the United States had no plans to send ground troops into Syria but wanted to see Syrias moderate opposition forces replace IS near the Turkish border. In a reflection of the complexities involved, Turkish Foreign Minister Mevlut Cavusoglu on Monday refused to draw a distinction between the Islamic State group and the PKK. \"There is no difference between PKK and Daesh. You cant say that PKK is better because it is fighting Daesh,\" Cavusoglu said. The PKK is fighting the IS group \"for power, not for peace, not for security.\", Cavusoglu, who spoke to reporters during an official visit to Lisbon, Portugal, said he would inform Turkeys NATO partners about the security threats his country is facing at the Brussels meeting Tuesday. \"We expect solidarity and support from our NATO allies,\" he said, without elaborating. A Turkish official said Turkey and the US were discussing \"the formation of a de-facto safe zone\" which would facilitate the return of Syrian refugees from Turkey. He said Turkey, was prepared to provide all necessary assistance to the zone, including \"air support.\", He would not elaborate or say where the zone would be located, citing operational concerns. He requested anonymity because he was not authorized to speak publicly on the issue. In other developments Monday, the Syrian Kurdish YPG militia and Syrian rebels captured the town of Sareen in northern Syria, which had been held by the Islamic State group, according to The Britain-based Syrian Observatory for Human Rights and the Aleppo Media Center in Syria, two activist groups that track the civil war. Also, the YPG and an activist group said Turkish troops had shelled a Syrian village near the border, targeting Kurdish fighters. They said the Sunday night shelling on the border village of Til Findire targeted one of their vehicles. Til Findire is east of the border town of Kobani, where the Kurds handed a major defeat to the Islamic State group earlier this year. But Turkish officials dismissed the claims, insisting their forces were only targeting the IS group in Syria, and the PKK in neighboring Iraq. An Ankara official said Turkey returned fire after Turkish soldiers at the border were fired upon, in line with Turkeys rules of engagement. \"The Syrian Kurds are not a target of the operations. Our operations only target IS in Syria and PKK in Iraq,\" he said. He said earlier that authorities were \"investigating claims that the Turkish military engaged positions held by forces other than ISIS.\" The official spoke on condition of anonymity because of rules that bar officials from speaking to journalists without authorization. The YPG did not say whether there were casualties in the shelling. The YPG said Turkey first shelled Til Findire on Friday, wounding four fighters of the rebel Free Syrian Army and several local villagers. It urged Turkey to \"halt this aggression and to follow international guidelines.\", But the Britain-based Syrian Observatory for Human Rights said four fighters were wounded in the village of Zor Maghar, which is also close to the Turkish border. Conflicting reports are common in the aftermath of violent incidents. Earlier this month, Syrias main Kurdish party, the Democratic Union Party, or PYD, warned Turkey that any military intervention would threaten international peace and said its armed wing, the YPG, would respond to any \"aggression.\", Turkish police meanwhile raided homes in a neighborhood in the capital on Monday, detaining at least 15 people suspected of links to the Islamic State group, the Turkish state-run news agency said. The Anadolu Agency said those detained in Ankaras Haci Bayram neighborhood include a number of foreign nationals, without naming their home countries. Turkey has arrested hundreds of people with suspected links to violent extremists. Davutoglu, the Turkish prime minister, said Turkey and the United States had no plans to send ground troops into Syria but said they had agreed to provide air cover to moderate Syrian fighters. \"If we are not going to send land units to the ground and we will not then those forces acting as ground forces cooperating with us should be protected,\" Davutoglu told a group of senior journalists over the weekend. His comments were published in Hurriyet newspaper. Davutoglu also said Turkey wanted to clear its border of IS extremists. \"We dont want to see Daesh at our border,\" Hurriyet quoted him as saying, using the Arabic acronym of the group. \"We want to see the moderate opposition take its place.\", The Turkish leader also said Turkeys action against the IS has \"changed the regional game.\", Despite the U.S. and Turkeys shared interests in fighting the Islamic State, the Turks have also prioritized defeating Syrian President Bashar Assad. While the U.S. says Assad has lost legitimacy, it has not taken direct military action to try to remove him from office. Associated Press]", "Date": "20150727", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-turkey-nato-syria-islamic-state-20150727-story.html", "Title": "[U.S., Turkey seek to establish Islamic State-free zone in northern Syria]"}