{"Content": "[Standing on stage during last weeks announcement that the Obama presidential center will be on Chicagos South Side, I felt that a long journey was returning to its source. We will all define what this center means to Chicago and the world. For me, at 96, even after spending the better part of my adult years educating and motivating young people, it is the chance of a lifetime. A presidential library should make history visible, and I have always viewed history as a means of inspiration. Helping young people understand their place in our long story can show them that they, too, have a future. Imagine what that will mean for men and women from all backgrounds who will come here to learn the story of our first African-American president the impossible barriers that he confronted and overcame, starting with the support of our community. They will feel a sense of identity and thrill. And that will help them believe in the future. I know this kind of inspiration is possible because Ive experienced it. In 1926 I stood with my father, a black nationalist, at the YMCA on Wabash Avenue when Carter G. Woodson announced the creation of Negro History Week, which later became Black History Month. At the age of seven, I was already imagining new possibilities. Like Woodson, I went on to earn my masters degree in history from the University of Chicago and taught black history or more accurately, I corrected American history to give African-Americans our rightful place. My parents had impressed on me and my siblings that our generation had a responsibility to make a change. Going off to World War II inspired me in other ways I saw the inhumanity of the concentration camps, and was reminded daily that I could not eat with the white soldiers who served with me. Yet I defended my country to any who criticized it. Thats because I knew we would return to America with a new passion to make this nation live up to its ideals. And we did. We then had an obligation to transfer to others, and to the younger generation particularly, the knowledge that their future depends on helping others to have a better life. The Obama presidential center will provide an easy way to teach this message of hope to our children and the children of the world. Who would have believed even 15 years ago that an African-American would become president of the United States? How could he have believed it? Especially when it would have been so easy to believe the voices that said, \"Youre not going to be anything, man.\", Obamas success is proof that anything is possible. But his legacy is about much more than one man its a lesson from the South Side that has power across the globe. The lesson for young people is that you have to keep faith even when it seems that all the doors are closed. Because one day, a door is going to open for you. I cant tell you when. But you have to be ready to walk in that door. So get that education, get ready for the change that is going to come. Thats a truth for people of all races, for men and women alike. Its for the young men on Chicagos South Side who believe they have no tomorrow, and the young women in France, Nigeria, Guatemala or China who think the same thing. The message is also for their governments, which control the resources that can create opportunities and open more doors. The Obama library and museum will open doors. It will help stabilize and reinvigorate the community that created this legacy. One of my great hopes is that as the world comes to the South Side in greater numbers, our community will develop even more diversity of all kinds social, economic, racial and religious. It can be an example for other communities of how to build unity and pride. This may seem like a lot to hope for. But history teaches us hope. They say this presidential center will open in five or six years. When it does, it will carry on for generations the hopes that have shaped my life and our community. Im optimistic that Ill be there to see it. Timuel Black is an educator, historian, civil rights activist and decorated veteran of World War II. He is the author of a forthcoming autobiography and the two-part \"Bridges of Memory,\" a history of black migration to Chicago.]", "Date": "20150519", "Author": "[Timuel Black]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-obama-library-timuel-black-perspec-05204-20150519-story.html", "Title": "[Obama library will be the jewel of the South Side]"}