{"Content": "[In a rare ground attack deep into Syria, U.S. Army commandos killed a man described as the Islamic States head of oil operations, captured his wife and rescued a woman whom American officials said was enslaved. A team of Delta Force commandos slipped across the border from Iraq under cover of darkness Saturday aboard Black Hawk helicopters and V-22 Osprey aircraft, according to a U.S. defense official knowledgeable about details of the raid. The official was not authorized to discuss the operation publicly and spoke on condition of anonymity. The Americans intended to capture a militant identified by U.S. officials as Abu Sayyaf. When they arrived at his location, a multi-story building, they met stiff resistance, the U.S. official said, and a firefight ensued, resulting in bullet-hole damage to the U.S. aircraft. Abu Sayyaf was killed, along with an estimated dozen IS fighters, U.S. officials said. No American was killed or wounded. Before the sun had risen, the commandos flew back to Iraq where Abu Sayyafs wife, Umm Sayyaf, was being questioned in U.S. custody, officials said. The goal was to gain intelligence about IS operations and any information about hostages, including American citizens, who were held by the group, according to Bernadette Meehan, spokeswoman for the U.S. National Security Council. Abu Sayyaf was described by one official as the IS \"emir of oil and gas,\" although he also was targeted for his known association with the groups leader, Abu Bakr al-Baghdadi. U.S. officials said it was likely, given Abu Sayyafs position, that he knew about more than just the financial side of the groups operations. Despite the U.S. claims, much about the IS figure was in question. The name Abu Sayyaf has rarely been mentioned in Western reports about the extremist group and he is not known to be among terrorists for whom the U.S. has offered a bounty. The name was not known to counterterrorism officials who study IS and does not appear in reports compiled by think tanks and others examining the groups hierarchy. The U.S. official said Abu Sayyafs death probably has temporarily halted IS oil-revenue operations, critical to the groups ability to carry out military operations in Syria and Iraq and to govern the population centers it controls. But U.S. Rep. Adam Schiff, the top Democrat on the House Intelligence Committee, cautioned against exaggerating the long-term gain from killing Abu Sayyaf. He said IS, like al-Qaida, \"has proven adept at replacing its commanders and we will need to keep up the pressure on its leadership and financing.\", A U.S. Treasury official told Congress in October that IS militants were earning about $1 million a day from black market oil sales alone, and getting several million dollars a month from wealthy donors, extortion rackets and other criminal activities, such as robbing banks. Kidnappings were another large source of cash. U.S. airstrikes in Syria since September have frequently targeted IS oil-collection facilities in an effort to undermine the groups finances. IS controls much of northern and eastern Syria as well as northern and western Iraq, despite months of U.S. and coalition airstrikes and efforts by the U.S.-backed Iraqi army to retake territory. IS holds most of the oil fields in Syria and has declared a caliphate governed by a harsh version of Islamic law. Also Saturday, activists said IS fighters pushed into the Syrian town of Palmyra, home to famed 2,000-year-old ruins. The U.S. Army raid occurred one day after the U.S.-led campaign to roll back IS gains in Iraq suffered a significant setback in Ramadi, the capital of Anbar province. IS fighters are reported to have captured a key government building in Ramadi and have established control over a substantial portion of the city, officials have said. U.S. House Speaker John Boehner, in a written statement Saturday praising the raid into Syria, said he was \"gravely concerned\" by the IS assault on Ramadi and that it threatened the stability and sovereignty of Iraq. IS has made major inroads at Iraqs Beiji oil refinery complex in recent days. Reports vary, but U.S. officials have said IS is largely in control of the refinery, as well as the nearby town of Beiji. Its on the main route from Baghdad to Mosul, the main IS stronghold in northern Iraq. U.S. Defense Secretary Ash Carter in Washington announced the raid, followed soon after by word from the White House. Meehan, the NSC spokeswoman, said in a statement that the woman who was freed, a Yazidi, \"appears to have been held as a slave\" by Abu Sayyaf and his wife. She said the U.S. intends to return her to her family. IS militants captured hundreds of members of the Yazidi religious minority in northern Iraq during their rampage across the country last summer. A senior Obama administration official said Umm Sayyaf was being debriefed at an undisclosed location in Iraq to obtain intelligence about IS operations. The official was not authorized to discuss details of the operation by name and spoke on condition of anonymity. The raid was the first known U.S. ground operation targeting IS militants in Syria. A U.S.-led coalition has been striking the extremists from the air for months, but the only previous time American troops set foot on the ground in Syria was in an unsuccessful commando mission to recover hostages last summer. Syrian state TV earlier reported that Syrian government forces killed at least 40 IS fighters, including a senior commander in charge of oil fields, in an attack Saturday on the Omar field where the U.S. raid was said to have taken place. The Syrian report, which appeared as an urgent news bar on state TV, was not repeated by the state news agency. State TV didnt repeat the urgent news or elaborate on it. U.S. officials said they had no knowledge of a Syrian raid and that the U.S. did not coordinate its operation with the Syrian government. Meehan said the Syrian government was not informed in advance of the raid. The U.S. has said it is not cooperating with President Bashar Assads government in the battle against IS. \"We have warned the Assad regime not to interfere with our ongoing efforts against ISIL inside of Syria,\" Meehan said, using another acronym for IS. \"As we have said before, the Assad regime is not and cannot be a partner in the fight against ISIL. In fact, the brutal actions of the regime have aided and abetted the rise of ISIL and other extremists in Syria.\", An NSC statement said President Barack Obama authorized the raid upon the \"unanimous recommendation\" of his national security team. The administration clearly is concerned by the resilience of IS even as officials publicly express confidence that the extremists cannot sustain their territorial gains and ultimately will be defeated. Saturdays raid came as IS fighters have advanced in central and northeastern Syria. Activists said IS fighters pushed into Palmyra, home to famed 2,000-year-old ruins, after seizing an oil field and taking control of the water company on the outskirts. IS said fighters took full control of Saker Island in the Euphrates River near Deir el-Zour, a provincial capital in eastern Syria split between IS and government forces. Associated Press]", "Date": "20150517", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-abu-sayyaf-dead-20150516-story.html", "Title": "[U.S. commandos kill senior Islamic State leader, capture wife ]"}