{"Content": "[When is it outrageous to amend the Constitution?, Donald Trump, the front runner in the race for the Republican nomination, wants to overturn the constitutional guarantee of birthright citizenship. Whether out of panic or sincerity, a number of other Republican candidates have joined the bandwagon. This is probably good politics for the GOP nomination and almost certainly bad politics for the general election. I am inclined against the idea as a matter of public policy, because the costs would outweigh the benefits. But I am far from convinced it is something to be outraged about. Its funny: On countless public policy issues, liberals are obsessed with comparing America to European countries. U.S. Sen. Bernie Sanders, I-Vt. routinely points out that Europeans have far more lavish welfare policies, including various forms of government-provided health care. President Barack Obama loves to point to the gun-control policies of other industrialized nations. Why cant we just be more like (insert more left-wing European country)? is the standard-issue rhetorical gimmick for cosmopolitan and sophisticated liberal policy wonks. Except when its not. No European country grants automatic citizenship to any person born on its soil. And yet we are told that undoing this right would be a barbaric and retrograde reversal. Its pretty gross, and underlying are deeply seeded, basically racist intentions, Melissa Keaney of the National Immigration Law Center told Business Insider. Are Sweden and France gross now too?, But lets get back to the Constitution. Whenever Republicans favor amending the Constitution or overruling a Supreme Court interpretation of it Democrats unleash a tsunami of mortified rhetoric. We should not mess with the Constitution. We should not tamper with the Constitution, U.S. Sen. Chuck Schumer, D-N.Y. declared in 2000 when Republicans suggested a victims rights amendment. I respect the wisdom of the founders to uphold the Constitution, which has served this nation so well for the last 223 years, U.S. Sen. Patrick Leahy, D-Vt. thundered in response to a proposed balanced-budget amendment in 2011. U.S. Rep. Ral Grijalva, D-Ariz. shrieked in protest over the potential repeal of birthright citizenship: I think its horribly dangerous to open up the Constitution, to tamper with the Constitution. Now bear in mind, all of these Democrats oppose justices who believe the Constitution should be read narrowly, according to the original intent or plain meaning of the text. They like justices who worship at the altar of the living Constitution you know, the mythical document that magically provides rights never imagined by the Founding Fathers. Meanwhile, the front runner for the Democratic nomination, Hillary Clinton, announced that one of her four central goals is to change the First Amendment. She wants to do this on the grounds that we must do anything we can to get rid of unaccountable money in our political system. Never mind that this is a funny position for a woman who plans on raising a reported $2 billion to win the presidency and whose foundation which is neatly aligned with her political ambitions is awash in foreign money. If only she hadnt scrubbed her illicit private email server, Im sure she could allay any fears that she is tainted by unaccountable money. And yet, where is the outrage?, It isnt coming from activist groups like People for the American Way, an organization founded to uphold the First Amendment. It has denounced the Republican effort to tinker with the 14th Amendment as an affront to human decency, but it applauds Clintons desire to tamper with the First Amendment as proof of her commitment to democracy. Some Republicans disagree with the Supreme Courts decision in United States v. Wong Kim Ark (1898), which applied the 14th Amendment to immigrants born here. Some Democrats disagree with the courts decision in Citizens United v. FEC, which says the First Amendment applies to groups of citizens acting in concert. Both, or neither, may be right, but only Republicans are forbidden from acting on their conviction. Whenever a Republican is asked about potential court appointments, he must swear that he will offer no litmus tests, specifically on abortion. But Democrats routinely vow that they will only appoint living constitutionalists who see a right to abortion on demand lurking between the lines of the Bill of Rights. Clinton recently added a new litmus test. Shes told donors accountable ones, no doubt that she would only appoint justices who would overturn the Citizens United decision. Dont strain yourself trying to hear the outrage. Outrage is saved for Republicans. Tribune Content Agency, Jonah Goldberg is a fellow at the American Enterprise Institute and a senior editor of National Review. goldbergcolumn@gmail.com, Twitter @JonahNRO]", "Date": "20150826", "Author": "[Jonah Goldberg]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-birthright-citizenship-constitution-20150826-column.html", "Title": "[Liberal hypocrisy and constitutional tinkering]"}