{"Content": "[On Friday, news organizations reported that Mitt Romney is considering another presidential run in 2016. Meanwhile, word got out that respected Republican operative Rick Wiley is helping Wisconsin Gov. Scott Walker staff up for a 2016 primary campaign. And to top it off, Mike Huckabee left his job at Fox News to explore another presidential run. Which development is most important? In my informal survey of about 15 GOP insiders, some with other candidates and some unaffiliated, I did not find a single person convinced Romney was actually running. As for Huckabee, his decision to enter the race was met with a surprising degree of skepticism. However, when I mentioned Walker, virtually everyone was intrigued. From our standpoint, Walker is the real wild card and potentially the most formidable of the three in the primary and in the general election against Hillary Clinton. Consider how hed match up against Clinton. If he gets to the general election, hell have slayed the best field of GOP contenders in memory; shes likely to have had a cake walk. Hes 47; shes 20 years older. The media and country already seem bored with her; they hardly know him. Hes won three contests (including a recall effort) in a purple state; she lost to Barack Obama in the primaries. She left behind a trail of foreign policy messes; his domestic reform agenda has been popular and successful. Shes the favorite of Wall Street and Washington insiders; Walker is a scrappy guy without a collelge degree (although he attended Marquette University). Walker would put the GOP back in the hunt for ower- and middle-class voters. Within the GOP primary, Walker has obvious question marks, ranging from his speaking ability to his credibility as a potential commander in chief to his money-raising potential. However, setting out to find a band of quality advisers suggests he is serious about policy. And when he has been asked about foreign policy, his initial answers indicate he is in the mainstream of tough-on-defense conservatism. Walkers biggest asset may be his pugnaciousness. The base wants a fighter. The party wants a proven winner. He is both. If he can bring a compelling agenda and some gravitas to the race, he could easily make it into the top tier of candidates. Whether hes successful or not, the potential addition of Walker to the race is a plus for the GOP and a sign that the party has a new generation of stars ready for the national stage.]", "Date": "20150113", "Author": "[Jennifer Rubin]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/sns-wp-washpost-bc-walker-comment12-20150112-story.html", "Title": "[Scott Walker, 2016's wild card]"}