{"Content": "[Republican U.S. Sen. Mark Kirk on Thursday slammed President Barack Obamas announcement of a framework nuclear agreement with Iran, contending it will lead to a \"total meltdown\" in U.S. relations with Middle Eastern allies. Kirk, who is seeking election to a second term next year, also told more than 300 people at the City Club of Chicago that he would vote for Obama nominee Loretta Lynch for attorney general, a key vote for a nomination that has been stalled in the Senate. Kirk, a former Navy Reserve intelligence officer, is among the strongest supporters of using economic sanctions against Iran in an effort to force the country to divest any efforts to gain access to nuclear weapons. Under the conditions of the framework reached between the U.S. five other world powers and Iran, United Nations sanctions that have threatened Irans economy would be lifted. \"It looks like they did a total cave from what I saw. A complete lifting of sanctions will return Iran to a position where its economy is actually growing faster than the American economy,\" Kirk told reporters after his City Club address. \"There is a perception right now in the Persian Gulf that the United States is allied to Iran. That is undermining our ability to work with Arab countries in that area. I would say that in the wreckage of this cave, theres going to be a lot of work to be done to overcome the perception that the U.S. is allied with Iran,\" he said. Kirk said the U.S. \"should proceed unilaterally with a new round of sanctions\" against Iran but acknowledged Western allies would not be supportive in light of the framework agreement. \"Right now, I would say were probably going to be in a total meltdown of ability of the United States to work with Arab countries in that area,\" the first-term Republican senator said. Sen. Mark Kirk speaks April 2, 2015, at the City Club of Chicago. Sen. Mark Kirk speaks April 2, 2015, at the City Club of Chicago. In the past, Kirk has joined with Democrats, including New Jersey Sen. Bob Menendez, to sponsor Iran sanction legislation, which won unanimous support. Menendez was indicted this week by a federal grand jury on alleged corruption charges that could threaten the role he played with Kirk over Iran. On Obamas choice of Lynch to be attorney general, Kirk said the key to winning his support came when the two recently discussed his efforts for the federal government to use $20 million in Chicago to combat \"gangs of national significance.\", \"I was hoping in talking to Loretta to get significant leverage with her to work with us to wipe up the gang problem of Chicagoland,\" Kirk said. \"I want us to recover our spirit that we had in 1929 when we came together and crushed the (Al) Capone organization. That was the key to unlocking Chicagos 20th century economy.\", Kirk becomes only the fifth Republican senator to publicly support Lynch and could be the 51st vote for her nomination if all 44 Democrats and two independents also vote for her. The senators remarks came in his first public appearance since Democratic Rep. Tammy Duckworth of Hoffman Estates on Monday announced her bid for her partys U.S. Senate nomination for the Republicans seat. Kirk said if Duckworth won the nomination, he believed the two could \"very much so\" have a civil contest. But he cautioned reporters that Duckworth hadnt won the nomination to challenge him. Kirk, who has faced opposition from more social conservative factions in the GOP, said he does \"not expect to be primaried on my side.\", rap30@aol.com, Twitter @rap30]", "Date": "20150402", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-mark-kirk-city-club-met-0403-20150402-story.html", "Title": "[ U.S. Sen. Kirk rips Obama's Iran framework]"}