{"Content": "[House Democrats on Thursday stood united in advancing a temporary, one-month budget to keep core services of government operating amid the threat of a partial government shutdown, but the move was largely symbolic as Republican Gov. Bruce Rauner already warned he would not sign the measure. The action at the Capitol came amid a pair of contradictory court rulings on whether state workers could be paid next week that left the issue a murky legal mess. A Downstate judge ordered Comptroller Leslie Munger to pay workers in full, and she said she would start processing payroll. That ruling came shortly after an appellate court in Chicago, considering a separate case, told Munger to hold off on sending out the checks. The developments Thursday are the latest amid an ongoing stalemate that has left state government without full spending authority since July 1. The impasse is the result of the deep partisan divide. On one side is Rauner, who is pushing a broader agenda to help businesses and curb union power, and on the other are Democrats pushing back against the plans they say will hurt the working class. Under the partial budget plan House Democrats approved on a 71-19 vote, money would be directed to sensitive areas such as health care for the poor, meals for the elderly, addiction treatment and monitoring nuclear facilities. But most other things would go unfunded, including programs that would serve those with autism as well as breast and cervical cancer screenings. The political gamesmanship thats marked the six-week overtime session was on full display Thursday as House Democrats amended the stopgap measure to also include 30 days of pay for state workers. Rauner had promised employees they would continue to receive paychecks during the impasse but was dealt a blow earlier this week when a Cook County judge ruled the state did not have the authority to spend the money without a budget in place. Madigan addresses the press regarding the Illinois budget crisis on July 9, 2015. I feel we have to have a balanced approach, said Madigan. (WGN TV), Madigan addresses the press regarding the Illinois budget crisis on July 9, 2015. I feel we have to have a balanced approach, said Madigan. (WGN TV), Adding the paycheck provision Thursday was an attempt to pressure Rauner into signing the bill, but the measure still needs Senate approval, and senators dont return to Springfield until next week. Rauner could use his veto powers to strip everything from the bill but the portion that would restore worker pay, but Democrats could use their veto-proof supermajorities to override those changes. All of it is a continuation of the blame game, as both sides try to paint the other as the reason for the states dysfunction. Democrats argue Rauner is at fault for workers not getting paid after he vetoed the spending plan they sent him. Rauner contends the budget Democrats sent him was $4 billion out of balance and designed to force a tax increase. The governor has said he wont consider raising taxes without first winning portions of his economic agenda, which Democrats dismiss as \"nonbudgetary\" items designed to hold the budget process hostage. \"It leaves the governor with a choice, a very difficult choice,\" said Rep. Frank Mautino, D-Spring Valley. \"Do you let the institutions of the state of Illinois fail in pursuit of something that may be important but not the fundamental responsibility of this body, which is to ensure state operations for the neediest continue?\", Republicans balked, labeling the temporary budget as a \"faux\" plan the governor would not approve. \"Were seeing the song and dance over there right now,\" said Rep. C.D. Davidsmeyer, R-Jacksonville. \"You are voting for a bill the governor will veto and state employee pay will be in limbo.\", But House Speaker Michael Madigan countered that the governor could change his mind, saying \"if you follow the governors actions day by day, theres a lot of U-turns.\", As the House moved ahead on the short-term budget, courts in Chicago and Downstate delivered competing rulings on whether state worker paychecks should go out Wednesday. St. Clair County Judge Robert LeChien ruled Thursday that employees should be paid in full while the budget impasse plays out. Munger, the comptroller, said that allows her to start processing payroll. But that ruling contradicted a Tuesday decision in Cook County, where a judge ordered the state to pay workers only the $7.25-an-hour federal minimum wage absent a budget. Mungers office argued that was impossible to do because of the complexity of the states antiquated payroll systems, and appealed the decision. On Thursday, an appellate court in Chicago said the comptroller should hold off on issuing any paychecks while it considers the case. Illinois Attorney General Lisa Madigans office said it would review whether to appeal the St. Clair judges ruling after its attorneys had argued that paying state workers in full would violate the Illinois Constitution, which leaves it to the legislature and governor to decide how state money should be spent. \"What is clear at this point is that this is going to continue to play itself out in court, which makes it absolutely imperative that the governor and legislature do their jobs and enact a budget,\" said Natalie Bauer, a spokeswoman for Lisa Madigans office. Even without a full budget, state government is fumbling along. Rauner removed some of the immediate pressure to strike a deal by signing the portion of the budget that would funnel money to schools so they open on time. State law also requires that some payments go out even if a budget isnt in place, including dollars to pay employee pension costs and paychecks for lawmakers. A federal judge this week also ordered the state to continue to fund the states child welfare agency. But the heat is on for those who rely on government services, and the pain is expected to be particularly acute at agencies that care for the states elderly, disabled and addicted. Those nonprofits rely largely on state money and have seen funding repeatedly slashed in recent years, a situation they argue makes it more difficult for them to stay afloat during the impasse. In his attempt to win approval of his agenda, Rauner has tried to go around Madigan. On Wednesday, Rauner sought to demonstrate he is working with other Democrats, including Senate President John Cullerton and Mayor Rahm Emanuel, by unveiling a sweeping public employee pension overhaul that includes some of their ideas. But Democrats so far have presented a unified front against what Madigan labeled as Rauners \"divide and conquer\" effort. \"We dont always agree on everything, but we are basically a united group,\" Madigan said Thursday. \"And I would say to the governor that I dont think his strategy is going to work.\", Chicago Tribunes Bill Ruthhart contributed. Geiger and Ruthhart reported from Chicago. mcgarcia@tribpub.com, kgeiger@tribpub.com]", "Date": "20150709", "Author": "[Monique Garcia, Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rauner-madigan-one-month-budget-met-0710-20150709-story.html", "Title": "[Madigan: Rauner's 'divide and conquer' strategy won't work]"}