{"Content": "[The Rev. Willie T. Barrow, the longtime civil rights leader known as \"The Little Warrior\" who marched with the Rev. Martin Luther King Jr. at Selma and helped found the organization that became the Rainbow/PUSH Coalition, died early Thursday following a long illness. Barrow, who was 90, died at her home about 2:30 a.m. according to John Mitchell, chief of staff at Rainbow/PUSH. He did not have a cause of death, but Barrow had been in declining health for some time and had been hospitalized at the end of February for a blood clot. The Rev. Jesse Jackson said in a statement that Barrow was \"a woman of unusual courage and character\" and a \"freedom fighter.\", \"She fought in the tradition of Rosa Parks. ... She was fearless,\" Jackson said, adding that \"death can have her frail body but not her good works and not our memories of her. We love you. Rest in peace. We will never forget you.\", President Barack Obama issued a statement calling Barrow a Chicago institution and a personal friend. \"Nowhere was Rev. Barrows impact felt more than in our hometown of Chicago\" Obama said. \"To Michelle and me, she was a constant inspiration, a lifelong mentor and a very dear friend. I was proud to count myself among the more than 100 men and women she called her Godchildren, and worked hard to live up to her example. I still do.\", Obama said he and first lady Michelle Obama were saddened by Barrows death, \"but we take comfort in the knowledge that our world is a far better place because she was a part of it.\", Mayor Rahm Emanuel on Thursday ordered all flags at city facilities lowered in Barrows honor. \"Rev. Barrow spent her life on the front lines in the fight for justice,\" Emanuel said in a statement. \"... Her voice was powerful, and contributed immeasurably to the cause of fairness, justice and opportunity in our community and the nation.\", Emanuels challenger in the mayoral race, Cook County Commissioner Jesus \"Chuy\" Garcia, noted Barrows many accomplishments and said the city had lost a leader. \"If ever the term Renaissance Woman was a suitable title, it certainly applies to Rev. Barrow,\" he said. Barrow got her start fighting for racial equality long before she arrived in Chicago. She was just 12 years old and living in Burton, Texas, when she led her first demonstration to stand up for what she saw as unequal treatment. It was 1936, when public schools were still segregated, and Barrow and her African-American classmates were forced to walk to school while white students were allowed to ride the bus. Rather than accept what was, at the time, the norm, Barrow organized her fellow students and confronted the bus driver and school officials, she said. \"You got plenty room,\" Barrow said she told the bus driver and school officials during a recent video-recorded interview. \"Why you want me to get off? Because Im black? We got to change that.\", From that moment on, Barrow devoted her life to organizing and fighting for social justice and civil rights, she later said. Barrow grew up on a farm with six siblings and learned to pick cotton and grow produce. When she was 16 she moved to Portland, Ore. to study to become a minister. There she organized one of the first African-American Churches of God. \"Her father was a minister and she grew up in a church household,\" said the Rev. Calvin Morris, the retired executive director of the Community Renewal Society, who knew Barrow for nearly 50 years. \"She traveled with her father in his wagon to his speaking engagements. \"She felt a strong calling to ministry,\" he added. Barrow had the spunk and charisma to persuade people to follow her lead, Morris said. When she gathered a group of black residents in Portland to start a church there, they obliged. She also worked as a welder in a shipyard in Portland. It was there where she met her husband, Clyde Barrow. After they married, the couple moved to Chicago in 1943 and she studied at Moody Bible Institute. She played the piano and, as a member of Emerald Avenue Church of God, organized a youth choir made up of children from all over the South Side. When her minister noticed her leadership ability and how much energy she had, he tapped her to help with civil rights demonstrations. By 1950 Barrow was a field organizer, helping to put together marches and pickets for civil rights all over the United States. In 1965 she traveled to Selma, Ala. to demonstrate with King, and she was one of several organizers who asked King to come to Chicago, according to Morris. \"She was unable to run from any battle,\" Morris said. \"She was unafraid of any challenge and she would not be intimidated.\", It was her small stature and feisty demeanor that led other activists to affectionately call her \"The Little Warrior.\" Barrow didnt just speak for racial equality, she fought for womens rights and was on the front lines for labor rights, too. In later years, she also pushed for gay rights. \"Rev. Barrow was really an icon of the civil rights era,\" said Andrea Zopp, president of the Chicago Urban League. \"She was in the trenches. She has lived her mission and her passion her whole life. She was a leader at a time when women were often not recognized for their roles.\", Barrow helped Jackson found Operation Breadbasket on the South Side in the mid-1960s, taking what had earlier started in Atlanta as a boycott of white-owned businesses to boost the economic power of blacks and transplanting it to Chicago. When that organization evolved into Rainbow/PUSH, Barrow was executive director of Operation PUSH for five years, the first woman to lead the organization. She also was chair of the Rainbow/PUSH board for a decade. At PUSH she led campaigns to serve the poor and the most vulnerable communities in Chicago. She was often seen at Jacksons side helping to make key decisions. She also was a leader in Jacksons unsuccessful presidential campaigns in 1984 and 1988. Even in later years, Barrow continued to work for social justice. Each Saturday she led demonstrations, and she had an energetic presence at Rainbow/PUSHs weekly services. Privately, she helped dozens of local students make it through college by getting them scholarships or writing personal checks to cover tuition, according to Martin King, the current chairman of the Rainbow/PUSH coalition. \"The city of Chicago lost a global leader when it came to civil rights and fighting for those who were in despair and those that needed help,\" King said. \"Were grateful for the life of service she led here.\", She mentored more than 100 young people, helping groom them to lead the next stage of the movement. She never retired and was often visible in the community as a guest speaker, attending social events and working at PUSH headquarters. Among her many accolades, she was honored in 2012 by the Chicago Urban League for her lifelong dedication to equal rights. In addition to her activism, Barrow was co-pastor of the Vernon Park Church of God and helped raise money to create an assisted living development in the south suburbs and fund after-school programs. She was preceded in death by her husband and her son, Keith Barrow. There are no immediate survivors. lbowean@tribpub.com]", "Date": "20150312", "Author": "[Lolly Bowean]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-willie-barrow-obit-met-0305-20150312-story.html", "Title": "[Rev. Willie T. Barrow, activist and civil rights icon, dies at 90]"}