{"Content": "[My experience as defense secretary during the Iran hostage crisis more than three decades ago tells me that Iran will probably try to circumvent the nuclear deal. My participation in nuclear weapons negotiations with the Soviet Union from 1958 through SALT II in the 1970s during very hot points in the Cold War reinforces my caution. Yet the United States can only accept or reject the deal, so let me discuss bottom-line pros and cons. Irans nuclear program, its advance suspended during the negotiations, is but two years from a nuclear weapon. Thats an urgent problem demanding immediate attention. Iranian possession of nuclear arms would give other regional powers an irresistible urge to obtain them. The Middle East and Persian Gulf conflicts would escalate. That consideration surely motivated the unicorn-level rarity of a common position among the United States, Britain, France, Germany, the European Union, Russia and China. Defenders of the deal point out that there are provisions to adequately monitor Irans compliance. Opponents note other concerns, including Irans ballistic missile program; its misbehavior in Iraq, Syria and elsewhere; its support of terrorists; and its threats and verbal attacks on Israels right to exist. These observations, although correct, are irrelevant to the more urgent task of trying to prevent Iran from having nuclear weapons by 2017. Either the United States adheres to the agreement already approved by all participants (except the United States and Iran) or Congress denies U.S. adherence to the deal. If the United States and Iran join the others, Iran must dilute or export its existing enriched uranium so that it does not have enough for a nuclear weapon. The deal also would roll back, for 10 to 15 years, Irans capability to enrich enough uranium to be able to produce a nuclear weapon. Iran would have to convert its under-construction nuclear reactor to a form that would not fuel a plutonium-based nuclear weapon. Even if it decided to break out of the agreement this would push Iran, now probably only a few months away from having enough highly enriched uranium for a nuclear weapon, to a year away. It would take another year to produce the weapon. How verifiable are these limits? As a physicist and former nuclear lab director, and later as a U.S. government official, I participated in other arms-control negotiations. Compared with past agreements with the then-more threatening adversary the Soviet Union, the provisions for oversight are remarkably more intrusive and capable. The chances of detecting Iranian violations that would substantially shrink that one-year estimate are very good. Whats more, this deal has automatic snap-back provisions for economic sanctions that Western signatories could re-impose if Iran violates the agreement. Hard-nosed inspections and resolute cooperation with the International Atomic Energy Agency will be vital. The United States retains its sanctions related to terrorism. Does the agreement decrease pressure on Iran by giving it access to its frozen billions in assets? Yes, but its the nature of a deal that adversaries must give up some objectives. We could have devised a more favorable deal, but there would be no chance of an Iranian signature on the document. A better deal without an Iranian signature is worthless. If congressional action prevents U.S. adherence to the deal, Iran would likely go full bore on its nuclear weapons program. The most informed opinions suggest that Iran could then have nuclear weapons in two years. Opponents of the deal warn that in 10 to 15 years time, the deal allows Iran to be only a couple of years away from a nuclear weapon. Why does accepting that danger now seem to bother opponents less than coping with a danger that might be 10 years away?, Is there another way to delay the time until Iran is capable of making a nuclear weapon? Not even those itching for war suggest an invasion. And a Special Operations forces attack, as I have learned better than most, is chancy, especially given the dispersed Iranian facilities. A pre-emptive air attack on nuclear facilities is an option, but a poor and probably disastrous one. Few if any Western allies would join us. Some Sunni Muslim governments would privately applaud, but not join us, and their respective publics would rage at the United States, however much they dislike the Shiite Iran. At best, a successful strike would probably set the Iranian nuclear program back by only two years, and Iran would rebuild at a site indestructible by conventional military force. Iran would be left with nuclear weapons and a thirst for revenge. Failure of U.S. adherence to the deal would not slow but would hasten an Iranian nuclear weapon. The Russians and Chinese would certainly not sustain economic sanctions. Sanctions by the other countries would erode as well. With all of this in mind, approving the agreement is a no-brainer. Washington Post, Harold Brown was secretary of defense during the Carter administration. He previously led the Lawrence Livermore National Laboratory and development of the Polaris missile warhead. He also served as U.S. director of Defense Research and Engineering and as secretary of the Air Force.]", "Date": "20150816", "Author": "[Harold Brown]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-nuclear-deal-enriched-uranium-20150816-story.html", "Title": "[Why accepting the Iran deal is a no-brainer]"}