{"Content": "[If the American people had a vote in picking a woman to put on the redesigned $10 bill, they would choose EleanorRoosevelt, the nations longest-serving first lady who pushed for greater rights for women, blacks and Asians. Nearly one in three registered voters chose Roosevelt, who has been called one of the most admired people of the 20th century, over a host of other women who played significant roles in United States history, according to a new McClatchy-Marist poll. Abolitionist Harriet Tubman was second with 20 percent of voters, followed by Native American guide Sacagawea, pilot Amelia Earhart and suffragette Susan B. Anthony, who each received 11 percent. Just 4 percent chose Sandra Day OConnor, the first female justice of the Supreme Court. They had a lot to do with building this country, as much as the men did. And still do, said David Tedder, 62, of Douglasville, Ga. The Obama administration announced in June that a woman will appear on the new $10 bill, marking the first time in more than a century that a female face will grace paper currency in the United States. Former first lady Martha Washington and Native American Pocahontas both had a place on bills in the 1800s, while Anthony and Sacagawea briefly adorned the $1 coin. Genevieve Payne, 62, a retiree who lives in Springfield, Mo. said she doesnt see the need to change the money. It costs millions and millions of dollars, she said. I dont see the need to spend the money. The economy is in such a bad position. Its so trivial. The Treasury Department launched a public campaign to seek suggestions with a requirement that the woman be deceased. Treasury Secretary Jack Lew is expected to make a decision later this year. The redesigned bill will be unveiled in 2020 to celebrate the 100th anniversary of womens right to vote. Fifteen percent of those polled did not like the six choices provided, preferred another woman or were unsure who they would pick. Lee Miringoff, director of the Marist Institute for Public Opinion in New York, which conducts the poll, said men are more undecided than women on the issue. Fourteen percent of male respondents are unsure of whose image should appear, while only 9 percent of women are. Men were less decided, suggesting there is an interest and knowledge gap, he said. The decision to add a woman to the $10 bill came after a campaign, Women on 20s, called for overhauling the $20 bill by replacing former President Andrew Jackson with a female face. Tubman came out on top of a list of 15 women after more than 600,000 people voted in an online poll. The $20 bill is not being changed. Rodney Fox, 31, a postal carrier in Boise, Idaho, thinks Tubman or another black woman should be the $10, but he thinks that is unlikely to happen anytime soon. Some $10 bills still may show the current face of Alexander Hamilton, the nations first secretary of the treasury, who pushed for a national currency. Others may have a combination of two images. Roosevelt came out on top of the McClatchy-Marist poll with men and women, all but one age group and people in all regions of the country. African-Americans, though, preferred Tubman by wide margins. Tom Laney, 63, a retired teacher from Odessa, Texas, attributed the decision to put a woman on the bill to political correctness. He suggests putting the face of the Statue of Liberty on money instead. We could just totally be done with that debate if we just put the personification of liberty on our money, he said. I think it would unite us and end some of these petty squabbles. ", "Date": "20150805", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-eleanor-roosevelt-10-dollar-bill-20150805-story.html", "Title": "[ People's choice: Eleanor Roosevelt for the $10 bill ]"}