{"Content": "[Prime Minister Shinzo Abe acknowledged Friday that Japan inflicted \"immeasurable damage and suffering\" on innocent people in World War II, but stopped short of offering his own apology and said future generations of Japanese should not have to make them either. In a widely anticipated statement marking the 70th anniversary of his countrys surrender, he said instead that Japans repeated past \"heartfelt apologies\" would remain unshakeable in the future. \"On the 70th anniversary of the end of the war, I bow my head deeply before the souls of all those who perished both at home and abroad,\" Abe said in a 25-minute address delivered live on national television. \"I express my feelings of profound grief and my eternal, sincere condolences.\", The statement was closely watched by Japans neighbors, especially South Korea and China, and it was unclear whether it would satisfy them. Chinas official Xinhua News Agency called Japans statement a diluted apology at best, and \"a crippled start to build trust among its neighbors.\", \"Abe trod a fine line with linguistic tricks, attempting to please his right-wing base on the one hand and avoid further damage in Japans ties with its neighbors on the other,\" it said. Resentment over invasion, occupation and atrocities by the Japanese Imperial Army before and during the war still bedevils relations between Japan and the East Asian countries seven decades after Tokyos surrender on Aug. 15, 1945. The statement got a cool reaction from U.N. Secretary-General Ban Ki-moon, who is South Korean. \"The secretary-general has taken note of the message ... and is studying it,\" U.N. spokesman Stephane Dujarric said. \"As the secretary-general has said previously, he hopes that based on reflection and understanding of history the countries concerned can achieve a genuine reconciliation and build peace and prosperity collectively in the region.\", Japanese Prime Minister Shinzo Abe, accompanied by his wife Akie, prays at his ancestors grave in Nagato, western Japan on August 14, 2015. Later in the day Abe expressed \"profound grief\" for all who perished in World War II in a statement marking the 70th anniversary of the countrys surrender. Japanese Prime Minister Shinzo Abe, accompanied by his wife Akie, prays at his ancestors grave in Nagato, western Japan on August 14, 2015. Later in the day Abe expressed \"profound grief\" for all who perished in World War II in a statement marking the 70th anniversary of the countrys surrender. Abe noted that more than 80 percent of the countrys population was born after the war, and echoed growing though not universal sentiment in Japan that the country has apologized enough. \"We must not let our children, grandchildren and even further generations to come, who have nothing to do with that war, be predestined to apologize,\" he said. But he said Japan took the wrong course in going to war and that, across generations, Japanese must squarely face their countrys past. \"We have engraved in our hearts the histories of suffering of the people in Asia as our neighbors: those in Southeast Asian countries such as Indonesia and the Philippines, and Taiwan, the Republic of Korea and China, among others,\" he said. While pledging that Japan would remain peaceful, he used the speech to make veiled criticism of Chinas activities in disputed waters in the region. China has been reclaiming land and erecting structures on South China Sea atolls that are claimed by the Philippines and other countries. In the East China Sea, Japan objects to Chinese aerial and marine patrols around islands that both countries claim. Noting Japans constitutional pledge not to resort to force to settle international disputes, Abe said that any disputes must be settled diplomatically based on the rule of law. Speaking to reporters after reading the statement, he added that \"any attempt to change the status quo by force should not be tolerated. I believe conveying our lessons learned from our history 70 years ago would be useful not only to Japan but also for the rest of the world.\", In the statement, he also made an apparent reference to foreign wartime prostitutes for the Japanese army, though he avoided the question of whether the so-called \"comfort women\" were forced into the work, a hotly disputed issue with South Korea. \"We must never forget that there were women behind the battlefields whose honor and dignity were severely injured,\" he said. The comment failed to satisfy an activist in Taiwan speaking at an event marking an international memorial day for comfort women. \"He still refused to recognize that the comfort women system was the persecution of womens human rights,\" said Huang Shu-ling, president of the Taiwan Womens Rescue Foundation. The United States responded positively to Abes statement despite the uncertainties over whether it would quell the acrimony over historical issues between Japan and South Korea Americas key allies in Asia. \"We welcome Prime Minister Abes expression of deep remorse for the suffering caused by Japan during the World War II era, as well as his commitment to uphold past Japanese government statements on history,\" National Security Council spokesman Ned Price said in a statement. \"For 70 years Japan has demonstrated an abiding commitment to peace, democracy, and the rule of law. This record stands as a model for nations everywhere.\", Abe said that Japan must never again repeat the devastation of war, saying the countless lives of young people lost in countries that fought Japan leaves him speechless and rent with grief. \"History is harsh,\" he said. \"What is done cannot be undone.\", Associated Press]", "Date": "20150814", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-japan-wwii-shinzo-abe-20150814-story.html", "Title": "[Japanese leader expresses 'profound grief' for WWII dead, stops short of apology ]"}