{"Content": "[Trying to clear up any confusion in Iran from a letter sent by Republican U.S. senators, An open letter to the leaders of the Islamic Republic of Iran:, You may be confused by a recent letter from Republican members of the U.S. Senate regarding ongoing nuclear negotiations that warns that when President Barack Obamas term expires, any agreement could be nullified. The letter notes that while the presidents term is limited by the U.S. Constitution, senators can be re-elected indefinitely. This is true. However, you should be aware of a recent Rasmussen Reports opinion poll that found only 16 percent of likely U.S. voters think Congress is doing a good or excellent job. Sixty-seven percent of Americans think congressmen only get re-elected because the rules are rigged to benefit incumbents, and 62 percent believe that members of Congress are willing to sell their vote for either cash or a campaign contribution. You might want to keep that in mind in dealing with the U.S. It could be useful information when it comes to any Senate vote confirming a treaty with your country. But you probably also want to keep in mind that another poll found that 28 percent of people identifying themselves as Republicans in this country said they know for sure that President Obama was born outside its borders and another 38 percent said that could be possible. That means about two out of three voters likely to support GOP candidates for the Senate think Obama lacks a basic qualification to be president. All of this might be troubling to a potential nuclear power, such as yourselves. Let me clear something up for you about our Constitution and how the country is run. \"We the people\" are in charge of things here. We dont have any kings (with the exception of Elvis Presley), religious figures or grand poobahs running the country. And while ordinary Americans disagree on many things, we share a love of this country and a distrust of elected officials, except in time of war. I mention that to you as a reminder that the U.S. was willing to bomb and invade your neighbor, Iraq, due to a suspicion that it was stockpiling weapons of mass destruction. That turned out to be a mistake. But we corrected that by restoring democracy to a country where a vicious dictator had ruled. Of course, it turns out that the Islamic State sort of destroyed that entire plan, but were in the process of targeting those evil people with drones and arming opposition elements on the ground. In other words, with no nuclear threat present in Iraq, we spent billions of dollars, sent tens of thousands of troops in harms way, killed a lot of people and pretty much have no regrets about any of that. The U.S. Congress has spent more time investigating Benghazi, where four people died, than any inquiry into the Persian Gulf War. So you might want to ponder that for a few minutes before refusing any agreement about inspections of your nuclear power plants, etc. On the other hand, I can understand why you might be reluctant to sign any agreement involving our current president. If your email resembles mine, you probably have received correspondence from many patriotic Americans informing you that Obama is actually Barry Soetoro, not Barack Obama. I could see where you might find that disturbing. I suggest you ask for Obamas birth certificate before signing any agreement. That would go a long way to reassuring some of those Republican senators that you are deserving of their trust. Another thing you might want to keep in mind an unofficial survey conducted by me reveals that many Americans think the only difference between Iran and Iraq is the letter \"q.\" Also, one out of three Americans believe in UFOs, with 1 in 10 saying they have personally seen a spaceship. These are people allowed to vote for the president and members of the U.S. Senate under our Constitution. I mention all of this in the interests of peace. Since World War II, we have sent the military to Korea, Vietnam, Grenada, Panama, Kuwait (the first Persian Gulf War), Somalia, Haiti, Bosnia (air strikes), Kosovo (air strikes), Afghanistan and Iraq (Persian Gulf War II). I challenge you to find any nation as committed to peace as the United States. I must say that you havent done a lot to repair your reputation with the American people. There are a few steps you ought to consider beyond signing an agreement for inspections of your nuclear facilities. Forget the ayatollah thing. Your religious leaders can still use that title within your country, but think about calling the top guy a CRO, chief religious officer. Invite U.S. companies to set up operations within your borders while providing really cheap labor. China, once thought to be a great threat to our country, vastly improved relations by undercutting the wages of American working men and women and allowing factories to be built with few environmental restrictions or safety regulations. Today, China launches cyber attacks on our national security systems and high-tech companies, and we dont much care because they are good business partners. That could be you. I hope this letter enriches your knowledge of our constitutional system and promotes mutual understanding and clarity as nuclear negotiations progress. Finally, remember the words of Will Rogers as these negotiations proceed: \"There are three kinds of men. The ones that learn by reading. The few who learn by observation. The rest of them have to pee on the electric fence for themselves.\", pkadner@tribpub.com]", "Date": "20150311", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-senate-iran-st-0312-20150311-column.html", "Title": "[A letter about nukes and U.S. senators]"}