{"Content": "[Wrapping up the Ecuador leg of his South American pilgrimage, Pope Francis was heading Wednesday to Bolivia, where church-state tensions over everything from the environment to the role of the church in society are high on the agenda. Before leaving Ecuadors capital Quito, Francis met with elderly residents of a nursing home and gave an off-the-cuff pep talk to local clergy, telling them to be humble and to never forget their roots. Then he was set to fly to La Paz and meet with Bolivian President Evo Morales,, The stop in La Paz was being kept to four hours to spare the 78-year-old pope from the taxing 4,000-meter (13,120-foot) elevation; the rest of his Bolivian stay will be in Santa Cruz. Bolivian Communications Minister Marienala Paco said Morales decided to cut his speech before the pope to 5 minutes \"considering the popes health,\" state news agency ABI reported. Francis and Morales have met on several occasions, most recently in October when the president, a former coca farmer, participated in a Vatican summit of grassroots groups of indigenous and advocates for the poor who have been championed by Francis. Their shared views on caring for societys poorest, and the need for wealthy countries to drastically change course to address climate change have bumped up against Morales anti-clerical initiatives that have roiled relations with the local church. As soon as Morales took office in 2006, for example, the Bible and cross were removed from the presidential palace. A new constitution in 2009 made the overwhelmingly Catholic nation a secular state and Andean religious rituals replaced Catholic rites at official state ceremonies. \"There are some challenging issues in terms of Evo Morales taking on a quite combative role against the church, which he sees as a challenge to his authority,\" said Clare Dixon, Latin American regional director for CAFOD, the English Catholic aid agency. \"The church is also questioning some decisions made about development in the country.\", Morales, who expelled the U.S. ambassador and Drug Enforcement Administration, came to power championing Bolivias 36 indigenous groups and enshrined their rights in the constitution. But he has alienated lowlands natives by promoting a highway through a nature reserve and authorizing oil and natural gas exploration in wilderness areas. Cheered by environmentalists abroad for his demand that wealthy nations do more to combat climate change, Morales has been under fire at home from critics, including activists in the church, who say he puts extracting petroleum ahead of clean water and forests. Mario Gutierrez, an environmental specialist in Bolivia with the Catholic charity Caritas, said the Morales government is poisoning indigenous communities and deforesting habitats important to them. \"We are, as the church, truly concerned,\" he said. Francis was expected to raise environmental concerns during his Bolivian sojourn, just as he did in Ecuador. And hes likely to delicately insist on the Catholic Churchs right to have a voice in society, given its role in caring for the most marginal in South Americas poorest country. Other highlights of the trip include his visit to the notoriously violent Palmasola prison, where a battle among inmate gangs in 2013 left 30 people dead. As in many Latin American prisons, inmates largely control the inside of Palmasola, which teems with some 3,500 prisoners, more than four in five still awaiting trial. But perhaps the most intriguing element expected Wednesday was the delicate diplomatic dance between Francis and Morales over the tensions with the church. Morales considers the Catholic Church a powerful vestige of the colonial-era servitude from which the indigenous more than 60 percent of Bolivias population are still trying to recover. The government made it obligatory to teach other religions in schools alongside Catholicism, the faith of nearly four in five Bolivians. But it lost a major skirmish when it tried to prohibit obligatory Catholic religious education in the 15 percent of schools run by the church. In the heat of the dispute, Morales accused Cardinal Julio Terrazas, then head of the Bolivian bishops conference, of being aligned with the opposition and stripped him of his diplomatic passport. All official ceremonies in Bolivia are now preceded by rituals venerating the Andean earth goddess Pachamama. That doesnt square with the Bolivian church hierarchy, which in a 2012 pastoral letter called school texts that refer to Pachamama as a divinity \"erroneous and a deviation.\", Morales calls himself a Catholic and says he believes, as many Andean natives do, that theres plenty of room for both Christianity and traditional beliefs. \"I remain convinced that we Bolivians have a double religion, double faith,\" he said in January. \"We are Catholics, but at the same time we have rituals of our own.\", Morales is never one to hide his opinions: When he met in 2010 with Francis predecessor, Benedict XVI, he gave him a letter suggesting the church abolish celibacy and allow women to be priests. \"The church doesnt have to deny a fundamental part of our nature as human beings and should abolish celibacy. That way there will be fewer boys and girls whose fathers dont recognize them,\" he said at the time. Morales attitude toward the church changed radically when Francis became pope. He visited the pontiff twice and invited him to come to Bolivia. Inaugurating a school in the central Chapare region last week, Morales said, \"The truth is he and I coincide enormously in politics, the social and the economic.\", Associated Press]", "Date": "20150708", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-pope-in-ecuador-day2-20150707-story.html", "Title": "[Pope heads to Bolivia amid church-state tensions]"}