{"Content": "[The federal case against Dennis Hastert is one of those that raise more questions than they answer. The two formal charges are pretty dry and arcane: The indictment claims he made bank withdrawals in amounts intended to evade federal reporting requirements and then lied to the FBI about what the money was for. But the rest of the story is very different and much more sordid. The indictment gave only a few facts. It said he needed the cash to pay an unidentified person from Yorkville who has known Hastert for most of that persons life, and it mentioned Hasterts years there as a teacher and coach. It said the former speaker had withdrawn $1.7 million while paying off a promised $3.5 million to \"Individual A\" to \"compensate for and conceal his prior misconduct against Individual A.\", Subsequent leaks indicated that the money was meant to keep a former student from revealing that Hastert had sexually abused him. But the identify of that person, what he says Hastert did to him and how their agreement came about, are still secret. It may seem obvious that the public has a right to know the underlying particulars here. Hastert, after all, was once second in line for the presidency, and the indictment casts a shadow over his long career in office. His motives for doing what he is charged with are also crucial. If Hastert were taking out money to help an orphan in Haiti and preferred to keep his admirable altruism under quiet, the Justice Department might be willing to give him a pass on the first charge. Clearly that was not the case here, though. And anyone who lies to the FBI is probably not doing so for noble reasons. Often all the lurid details come out during legal proceedings. But in this instance, they may not. Its entirely possible that Hastert will enter into a plea bargain that would avoid a trial. Its entirely possible that if a trial takes place, prosecutors can present their case without calling Individual A to testify and that the defense would choose not to do so either. Everything could be resolved without exposing many of the facts that Hasterts former constituents, among others, might like to know. On Friday, federal prosecutors asked for a protective order to seal \"sensitive information, the unrestricted dissemination of which could adversely affect law enforcement interests and the privacy interests of third parties.\" Its a pretty routine motion, which Hasterts lawyers reportedly agreed to. It got noticed mainly because this time, there is a great deal of public curiosity about the back story. Even if the name of Hasterts alleged victim were to come out during a trial, the names of other people who claim he abused them if any might not. The protective order would shield their privacy. Many of the important and illuminating facts about this entire scandal are still shrouded in secrecy. And its just possible they always will be.]", "Date": "20150615", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-dennis-hastert-secrets-edit-0616-20150615-story.html", "Title": "[Secrets of the Hastert case]"}