{"Content": "[Marriage equality is the law of the land. Perhaps the most amazing thing about the Supreme Courts decision Friday in Obergefell v. Hodges, which recognizes marriage as a basic right, is that its not going to be very controversial. Yes, it might be an issue in Republican primaries in 2016. Few candidates will embrace this decision, and there is already a split between some who favor maximum outrage (Rick Santorum, Mike Huckabee) and others who are eager to get beyond the whole issue (Jeb Bush). As early as the general election in 2016, but almost certainly soon afterward, same-sex marriage will be an ordinary part of life in the U.S. Christie Jones, Teresa Moreno and Michelle Gregory react to the Supreme Courts ruling to legalizegay marriage in all 50 states in the Boystown section of Chicagos Lakeview neighborhood, Friday, June 26, 2015. (Antonio Perez, Chicago Tribune), Christie Jones, Teresa Moreno and Michelle Gregory react to the Supreme Courts ruling to legalizegay marriage in all 50 states in the Boystown section of Chicagos Lakeview neighborhood, Friday, June 26, 2015. (Antonio Perez, Chicago Tribune), Oh, bigotry will still be with us, and it will be appalling in some situations. Changing attitudes takes time. And there are still legal and legislative challenges ahead, beginning with the Employment Non-Discrimination Act, which would make it illegal to fire people because theyre gay. Marriage, however, is a done deal. And despite the close 5-4 split in todays Supreme Court decision, including vigorous dissents to Justice Anthony Kennedys majority opinion, this issue will rapidly be tossed into the history books alongside questions of whether women should vote or alcohol should be prohibited. In other words, this is going to be very much like Loving v. Virginia, which recognized the right to marriage regardless of race or ethnicity. How do I know? Because weve seen it in state after state in which marriage equality was enacted. Theres no controversy remaining in Massachusetts; for that matter, theres little or no controversy remaining in Iowa, which had court-imposed marriage equality in 2009. On a related issue, conflict over gays and lesbians serving in the military ended immediately after \"Dont Ask,Dont Tell\" was replaced four years ago. In practice, extending full citizenship and human rights to all regardless of sexual orientation and identity is actually not all that controversial at least not after the fact. TheSupremeCourtdeclared June 26, 2015, that same-sex couples have a right to marry anywhere in the United States. Efforts to generate second-tier issues (the \"rights\" of photographers or florists or whoever to avoid gays and lesbians) will likely fizzle quickly. And if a Republican president is able to nominate conservative Justices to replace, say, two of the five in the Obergefell majority? No, I dont think a newly conservative court is going to revisit this one. Bloomberg, Jonathan Bernstein is a Bloomberg View columnist covering U.S. politics. ]", "Date": "20150626", "Author": "[Jonathan Bernstein]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-gay-marriage-scotus-mike-huckabee-20150626-story.html", "Title": "[Same-sex marriage won't be controversial for long]"}