{"Content": "[Its been a hard time for politicians not named Trump to get any attention, but Mike Huckabee managed it. He did it by comparing Barack Obama to Adolf Hitler. At least thats what I gathered from headlines like this one from Gawker: Mike Huckabee Compares Obama to Hitler. I dont put huge amounts of stock in Gawker headlines (or really any headlines on the Internet), but then I saw that CNNs Wolf Blitzer said Huckabee had essentially likened (Barack Obama) to Adolf Hitler. National Journals Ron Fournier went on a tear on Twitter, insisting that Huckabee apologize for comparing Obama to Hitler. And of course, Hillary Clinton and Obama himself denounced Huckabee for making a Hitler comparison. Clinton even said she was really offended personally, as if her feelings are what really matters. Here is what Huckabee said in full during an interview with Breitbart News:, This presidents foreign policy is the most feckless in American history. It is so naive that he would trust the Iranians. By doing so, he will take the Israelis and march them to the door of the oven. This is the most idiotic thing, this Iran deal. It should be rejected by both Democrats and Republicans in Congress and by the American people. I read the whole deal. We gave away the whole store. Its got to be stopped. Now, Ive never been a big fan of Huckabees style of politics or policy. But a remotely fair reading of the statement strongly suggests that Huckabee was comparing Obama to Neville Chamberlain or some other member of the Hitler is a man we can do business with school. Thats the point of calling Obama naive for trusting the Iranians the Hitler in Huckabees analogy. We can parse more deeply if we must. Hitler didnt march Jews to the doors of the ovens, but into them. The Iranians are the ones with sinister intentions in Huckabees description, not Obama, who, again, is described as naive and feckless, not sinister and evil. Huckabee probably shouldnt have used the word march because it muddies his point. Delivered to or abandoned at would have worked better. I think, as a general rule, one should pretty much always avoid talking about Jews and ovens unless discussing the actual Holocaust. And one could argue that Huckabee, who insists he never compared Obama to Hitler, was cynically hoping to be misconstrued in order to get some media attention which he got. But on the merits, Huckabee isnt saying anything that lots of serious people havent said, albeit more eloquently. In countless speeches, Israeli Prime Benjamin Netanyahu and other Israeli leaders have stressed that the legacy of the Holocaust is such that Israel cannot take a chance on Iran having a nuclear weapon. In his address to Congress in March, Netanyahu movingly singled out Holocaust survivor and Nobel Prize winner Elie Wiesel from the audience. Elie, your life and work inspires to give meaning to the words, Never again, Netanyahu said to bipartisan applause. And I wish I could promise you, Elie, that the lessons of history have been learned. I can only urge the leaders of the world not to repeat the mistakes of the past. What mistakes? Precisely the mistakes Huckabee says Obama is making. Its the same argument. And its not a dumb argument. At least its not a dumb argument if you listen to the Iranians. As my National Review colleague David French recently cataloged, Iranian civil, military and religious leaders have for years vowed to wipe Israel off the map, deliver a new Holocaust (while denying the first one happened), etc. Hassan Nasrallah, the leader of Irans pet terrorist group, Hezbollah, has said, If all the Jews gathered in Israel, it will save us the trouble of going after them worldwide. ... It is an open war until the elimination of Israel and until the death of the last Jew on Earth. Until that time, Hezbollah has had to make do with killing Jews where it finds them. Barack Obama, Hillary Clinton and John Kerry dont take the Iranians at their word when they say they want to kill Jews, no matter how clearly and consistently they say it. But they trust the Iranians to stick to their word on this nuclear agreement (which would be a bad agreement even if Iran could be trusted). George W. Bush was routinely compared to Hitler with a fraction of the outcry Huckabee has received. Perhaps thats because Huckabees real sin has nothing to do with Hitler analogies and everything to do with Iranian reality. Tribune Content Agency, Jonah Goldberg is a fellow at the American Enterprise Institute and a senior editor of National Review. goldbergcolumn@gmail.com, Twitter @JonahNRO]", "Date": "20150731", "Author": "[Jonah Goldberg]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-mike-huckabee-israel-oven-comment-20150731-column.html", "Title": "[Huckabee's 'oven' remark taken out of context]"}