{"Content": "[During the final weekend of campaigning, Mayor Rahm Emanuel went on the attack Saturday against Jesus Chuy Garcia for comments the challenger has made about waiting until after the election to determine how to raise more money for the cash-strapped city. But Emanuel also had to respond to controversial remarks tied to his own campaign as a supporter bashed unions and claimed Chicago would go bankrupt if Garcia were elected mayor. At a rally before about 75 supporters at a South Side community center, Emanuel slammed Garcia for what the mayor portrayed as an unwillingness to level with voters about how he would raise revenue after the election. The mayor pointed to Garicas contention that he would appoint a commission to study revenue ideas, and the challengers remarks during a debate this week that he wasnt at liberty to say some of the union members hed appoint to the panel. Emanuel also zeroed in on a comment Garcia made in a Tribune story published online Saturday. While campaigning last month, Garcia indicated that if he offered up specific tax increases to solve Chicagos pension and budget crises, he would open himself up to Emanuel attack ads that would cause him to lose the election right off the bat.\", Garcia since has said hed get behind an expansion of the state sales tax and a graduated state income tax, but that didnt stop Emanuel from hammering the challenger Saturday. My opponent said, Im not at liberty to tell you whos going to be on that commission. Who are we, chopped liver?\" Emanuel said. And then he says, if I told you what it could do, I wont win (election). Well, if you cant win the election, it aint very good for us after the election. But at a rally Saturday afternoon in North Park, it was Emanuel who had to clean up remarks made by campaign backer Paul Park. Park, president of the Korean-American Democratic Committee of Illinois, introduced Emanuel during a rally before a couple of hundred Asian-American supporters at a senior center. While praising the mayors campaign, Park criticized Garcias union support and said the prospect of a bankruptcy like Detroits was real. If labor unions elect Mr. Garcia, then who is the boss? Many labor unions. They will demand higher wages, higher pension funds, said Park, who ran a failed Democratic 1996 U.S. Senate bid, a race in which he finished fifth with 1 percent of the vote. We should not allow Chicago to go bankrupt. Thats why we cannot allow Mr. Garcia to become mayor, Park said. You remember Detroit went bankrupt. Detroit had very, very many strong labor unions. During his speech to the crowd, Emanuel tried to address the anti-union rhetoric by pointing out that many unions support his campaign. The mayor has support of many trade unions, including plumbers, pipefitters, painters, operating engineers and laborers. Garcia is backed by the Chicago Teachers Union and the Service Employees International Union. Paul, I do, though, want to say I, too, am the recipient of a lot of support from organized labor, because they are trying to achieve for their members the American Dream Emanuel said in his speech. Afterward, Emanuel said he did not agree with Park that if Garcia were elected that Chicago would plummet into bankruptcy, stressing that Chicagos economy is much stronger and more diversified than Detroits. The answer is no, but if you dont do whats necessary, you are going to face serious challenges, because businesses will leave rather than come here and jobs will leave rather than come here, Emanuel warned. Having an ally raise the Chicago-Detroit connection still allows Emanuel to benefit from putting the comparison in voters minds, however. Earlier Saturday, Garcia took aim at a similar comment Emanuel made this week when he suggested Chicago could turn into a horror flick without good leadership. \"The reality is that because of his neglect as it relates to public safety in the neighborhoods, far too many of our families that live in neighborhoods find shootings a daily occurrence, Garcia said during an appearance at a Little Village youth club that he said served as a rallying point to prevent crime in the neighborhood. Theyre living that horror flick every day.\", As Garcia said these words, a driver rolled past the corner, honked and bellowed \"Go Chuy!\" before peeling away while blaring accordion-driven, Mexican pop music. Everyone laughed. \"Always an entertaining and lively neighborhood,\" Garcia grinned. The challenger suggested Emanuel simply wasnt doing enough to address violent crime across the citys neighborhoods. \"On the last whirlwind of an election campaign for the mayors office, we gather here today because we continue to be very concerned about public safety in the city of Chicago,\" Garcia said. \"We continue to find the levels of violence in Chicago extremely disturbing and unacceptable. The shootings, the homicides in our neighborhoods are intolerable.\", In the afternoon, Garcia supporters, including theRev. Jesse Jackson, chanted and marched down part of Madison Street following a high-volume rally at a full church in West Garfield Park. Chicago Teachers Union President Karen Lewis, who says she recruited Garcia to run after her potential bid was upended by a cancer diagnosis, said the county commissioners candidacy was part of a broader movement. \"Let me tell you, one election isnt going to change things. The people that are still in charge are still going to be in charge. Be very clear about that,\" she said. \"However, this is the first of many elections.\", Saturdaysanniversary of the assassination of Martin Luther King Jr.was a frequent theme at the rally, which Garcia used to target Emanuel. \"This past week, Rahm Emanuel made a comment to the effect that you cant protest a problem,\" Garcia said. \"And it really flies in the face of everything that Dr. King stood for, and for the civil rights movement in this country, and the womens rights movement in this country, and the immigrant rights movement in this country, as well as the Fight For 15 movement in this country. \"Its time to fire Rahm Emanuel,\" Garcia said to raucous applause. \"Some people will believe the lies and distortions told through the mayors televised propaganda, but I take comfort in knowing the lies have short legs. They run fast, but they cant run long.\", Also Saturday, early voting came to a close. The Chicago Board of Election Commissioners reported that 142,344 early voting ballots were cast. Thats nearly twice the number four years ago and significantly up from the 89,869 early voting ballots cast before the Feb. 24 election. Garcia and Emanuel are expected to be back out campaigning on Sunday, which is the Easter holiday. Passover also continues.]", "Date": "20150404", "Author": "[Bill Ruthhart, Juan Perez Jr., Cynthia Dizikes]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-rahm-emanuel-chuy-garcia-campaign-across-chicago-in-final-weekend-of-campaign-20150404-story.html", "Title": "[Emanuel, Garcia campaign across Chicago in final weekend before election]"}