{"Content": "[Chicago shoppers could once again be paying one of the highest sales taxes in the nation if the Cook County Board approves a 1-percentage-point increase at a special board meeting Wednesday. Board President Toni Preckwinkle is pushing the tax hike, which would bring the total sales tax rate in Chicago to 10.25 percent including state, city and mass transit portions. Preckwinkle ran and won in 2010 on a successful pledge to roll back what remained of a previous penny-on-the-dollar sales tax hike, but now says the county needs more money to make ends meet. On Tuesday, Preckwinkle continued to lobby commissioners, a sign that a vote of the 17-member board is expected to be close. Opponents, meanwhile, were offering up amendments to complicate or prevent passage of the tax hike. Commissioner Richard Boykin, D-Chicago, wants to change the rules so it takes 12 votes, instead of nine, to approve a sales tax hike. That two-thirds standard already is in place if commissioners want to raise county property taxes greater than the rate of inflation or 5 percent. Boykin also is proposing an amendment that would automatically revoke the sales tax increase, should it pass, if the state enacts Preckwinkles proposed changes to the county worker pension system, which could reduce future costs. Preckwinkle has pledged to consider scaling back the sales tax increase if her pension plan gets approved by the state. But the proposal has been stalled in the General Assembly for more than a year, and its unclear whether it would withstand an inevitable legal challenge. Commissioner Larry Suffredin, D-Evanston, is offering up an amendment that would require every penny collected through the tax hike to be paid into the pension fund. Preckwinkle cites that funds poor financial condition as the primary reason to boost the sales tax. Meanwhile, Commissioner John Fritchey, D-Chicago, wants the sales tax increase to automatically be repealed after one year. Also working to defeat the sales tax were the Chicagoland Chamber of Commerce and Illinois Retail Merchants Association. Tanya Triche of the retailers group said it was premature to consider a tax hike before Preckwinkle proposes her budget later this year. \"To talk about raising revenue before theyve really presented the budget seems to be a case of putting the cart before the horse,\" Triche said. Although raising taxes is always controversial, the sales tax in particular is difficult because of its broad effect and the already high rate. The current county rate is .75 percent, and would rise to 1.75 percent under Preckwinkles plan. The overall sales tax rate in Chicago is 9.25 percent, and would hit 10.25 percent if the county increase is approved. Its even higher on restaurant food and beverages in the citys thriving business districts, where the Metropolitan Pier and Exposition Authority tacks on an extra penny on the dollar. Birmingham and Montgomery in Alabama have sales tax rates of 10 percent, as do some California cities, and were listed as the highest among larger U.S. cities in a nationwide study conducted three years ago. New York Citys rate is 8.875 percent, while San Franciscos is 8.75 percent. After taking office in late 2010, Preckwinkle was able to reduce a 2008 county sales tax increase that was approved in the middle of the night by reducing spending and cutting staff while increasing more targeted taxes. Though Preckwinkle says shell make further spending cuts, she argues the sales tax increase is needed to restore financial health to the countys underfunded pension plan, make payments on debt incurred under predecessor Todd Stroger and stop the diversion of some motor fuel tax revenue to the countys court system. Preckwinkle aides estimate the county would receive an additional $474 million a year through the sales tax increase. hdardick@tribpub.com, Twitter @ReporterHal]", "Date": "20150715", "Author": "[Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cook-county-sales-tax-increase-met-0715-20150714-story.html", "Title": "[Cook County Board to vote on sales tax hike Wednesday]"}