{"Content": "[Neighborhood groups met with police and city officials last week to discuss the future of the citys annual Pride Parade, and while community leaders believe improvements can be made next year, they said the overall tone of the meeting was positive. For a parade with an estimated 1 million attendees, which came right after the historic Supreme Court decision legalizing same-sex marriage nationwide, there were few incidents, according to Jim Ludwig, owner of Roscoes Tavern, a gay bar in Lakeview. That was largely because parade organizers provided 90 additional off-duty police officers, he and other neighborhood leaders said. \"It really went well this year,\" Ludwig said. \"It was very crowded, of course, but we think it does belong in the neighborhood.\", Seventy percent of the people who were surveyed as part of the Triangle Neighborhood Association, which Ludwig helps lead, thought the parade would be better in the neighborhood, he said. People thought the real problems, which occur after the parade, would occur in the neighborhood whether it remained in Lakeview or was moved elsewhere. \"Weve all learned that moving the parade out of the neighborhood doesnt solve anything because most of the difficulties we ran into was after parade time ... into the evening and late into the night,\" Ludwig said. \"Our fear for the neighborhood is that if they move the parade, we would get abandoned by city services.\", Last year, according to Jim Spencer, president of the East Lakeview Neighbors Association, residents thought the parade had grown too big and out of hand for the neighborhood. Residents complained about gridlock, lack of police presence and drunken rowdiness afterward. Spectators react to Chicagos 46th annual Pride Parade and the U.S. Supreme Courts ruling touphold gay marriage on June 28, 2015. (Armando L. Sanchez/Chicago Tribune), Spectators react to Chicagos 46th annual Pride Parade and the U.S. Supreme Courts ruling touphold gay marriage on June 28, 2015. (Armando L. Sanchez/Chicago Tribune), This year, however, roughly eight of 10 members who gave feedback said the parade was handled much better and were in favor of it remaining in the neighborhood, Spencer said. Of the 100 businesses that answered the chambers community survey, 67.4 percent felt they were positively affected by the parade, according to Maureen Martino, executive director of the Lakeview East Chamber of Commerce. Businesses in Lakeview East said they had record-breaking sales this year, Martino said. Even hotels received good business from parade attendees who came into town Friday and stayed through Monday, she said. \"Many of our businesses felt it was much more organized than in the past,\" Martino said. \"There was a lot less public drinking.\", The cleanup, she added, was also much better than last year. Streets and Sanitation began cleaning along the route immediately after the last float, and streets were opened to traffic at 7:42 p.m, according to information sent out by the office of Ald. Tom Tunney, 44th. There were 52 parade-related arrests this year and 115 ambulance runs, according to Tunneys office. The parade lasted four hours and 42 minutes. Suggestions made at the meeting for improvement next year included shortening the parade and moving some police shifts from during the parade to nighttime patrol. \"I think that as long as we can address the issues, I dont see a reason why it could not stay here in Lakeview,\" Martino said. A final decision on where the parade will be held next year has not been made, according to Erin Duffy, spokeswoman for Tunneys office. Discussions will continue over the next few months, she said. \"We met a few times before the Pride Parade and will meet several times after to discuss,\" Duffy said. Christopher Barrett Politan, of the Northalsted Business Alliance, which also provided additional security this year, agreed that the meeting was positive. \"We of course would love the parade to stay in the neighborhood,\" Politan said, \"because it is essential to the fabric of the neighborhood and an important part of the month of pride.\", mmrodriguez@tribpub.com, Twitter @merjourn]", "Date": "20150728", "Author": "[Meredith Rodriguez]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-pride-parade-neighborhood-met-20150728-story.html", "Title": "[Lakeview groups want to keep Pride Parade in neighborhood]"}