{"Content": "[A movement to repeal the College of DuPages May 2013 decision to name its Homeland Security Education Center after outgoing president Robert Breuder is underway and some are suggesting the building be named for a Wheaton Congressional Medal of Honor winner instead. \"I definitely do not want it named after Dr. Breuder,\" College of DuPage Board Vice Chair Kathy Hamilton said by phone Friday, she declined to say who if anyone the building should be named after. With a new board of trustees elected April 7, many feel that Hamilton will be elected chairperson and be able to command a slim majority in voting decisions. State Rep. Stephanie A Kifowit, State Rep. Stephanie A Kifowit, \"Thats a possibility,\" she said. \"Were taking it one step at a time.\", Breuder and the board have come under fire most recently for the approval of a $762,000 severance package that he receives when he retires in May 2016. College spokesperson Randall Sanborn declined comment. Several citizens at recent board meetings have suggested renaming the building after Wheaton native U.S. Army Staff Sgt. Robert Miller, who was posthumously awarded the Congressional Medal of Honor for service in Afghanistan, where he lost his life in combat in 2008. An online petition drive to name the building after Miller has garnered 750 signatures as of Friday afternoon. One newly-elected trustee declined to commit to any specific candidate to replace the embattled presidents name, although she wasnt opposed to the idea. \"Im certainly not eager to see his (Breuders) name go up on that building,\" Deanne Mazzochi said, calling for a thorough discussion of the idea, while noting that the original vote on the issue might be on shaky legal ground. \"Its questionable whether the original vote complied with the Open Meetings Act.\", Hamilton led the opposition to Breuder over issues of poor financial transparency and extravagant spending at the colleges fine dining restaurant. The controversy began in spring 2014 over a leaked email to trustees where Breuder encouraged them to be nice to Gov. Pat Quinn at the schools commencement, the better to obtain $20 million out of the state budget for a new teaching facility. After almost one year of contentious board meetings where public watchdog groups grilled the board over transparency, spending, administration expenses and the continued operation deficit of the colleges Waterleaf Restaurant, trustees Nancy Svoboda and Kim Savage both of whom voted against naming the building after Breuder lost re-election bids to the \"Clean Slate\" ticket including Mazzochi, Charles Bernstein and Frank Napolitano. Bernstein said he wants to wait until the new board takes office at the end of the month to discuss it but said he \"couldnt think of a more appropriate person\" than Miller to replace Breuder as the buildings honoree. Napolitano said \"there are lot better options\" than Breuder and that \"I would probably support,\" Millers name on the building, but added that it wasnt really appropriate to commit to anything without thorough public discussion. He noted that there might also be other people to consider for the honor. One legislator, State Rep. Stephanie Kifowit (D-84th District) of Oswego said she has no problem with renaming the building in honor of Miller. \"He gave his life for his country,\" she said. Kifowit, a former U.S. Marine, said she thought a public building should be named after citizens more connected to the area than Breuder. \"I think that names of public buildings paid for by taxpayers should reflect the entire community,\" she said. While no one has formally alleged that the former board voted to put Breuders name on the building as part of a severance deal, State Sen. Tom Cullerton (D-23rd District) of Villa Park wants to make sure that such a deal doesnt happen in the future. In response to the ongoing controversy at COD, Cullerton introduced SB 2056, legislation that would prohibit institutions of higher learning from naming buildings after anyone as part of a severance package. COD officials contacted by the Sun have denied any connection between the naming of the building and Breuders severance. Cullerton said, \"it certainly seemed to some at that time (to be a connection).\", The bill is currently in committee and Cullerton indicated that there would likely be little immediate movement on bringing it to the full senate in light of a federal investigation of the college in which subpoenas have been issued for records relating to administrative expenses, contracts with the COD Foundation and questionable credits given to some students. \"Were going to take a small pause here to make sure were not interfering with anything theyre doing,\" he said. Hank Beckman is a freelance reporter.]", "Date": "20150424", "Author": "[Hank Beckman]", "Link": "http://www.chicagotribune.com/suburbs/naperville-sun/news/ct-nvs-cod-homeland-building-st-0426-20150424-story.html", "Title": "[Drive is on to reconsider naming COD building for Breuder]"}