{"Content": "[President Barack Obamas critics have never understood the guy from Chicago. And now its probably too late, given that hes promising to change federal immigration policy by bending the Constitution to his most divine will. Some critics call Obama a monarch. Others say he acts more like an emperor. Still others prefer the old-fashioned term king. All these are royal positions and involve flowing purple robes and bejeweled crowns of the sort worn by that creepy Burger King in TV commercials. But for years Obama has gone out of his way to inform supporters and critics alike that under our system of divided government a system developed by our founders to protect the liberty of all Americans the president cant very well use his executive powers to make up laws just because he feels like it. \"Im not the emperor of the United States,\" Obama said on Feb. 14, 2013, explaining why it would be unlawful of him to change immigration policy through executive fiat. \"My job is to execute laws that are passed, and Congress has not changed what I consider to be a broken immigration system.\", And earlier, before the emperor thing got going, he took pains to announce, publicly, that he was not even a king of immigration. \"Well, I think it is important to remind everybody that, as I said I think previously, and Im not a king,\" Obama said on Jan. 31, 2013, in an interview on immigration with Univision. \"Im the head of the executive branch of government. Im required to follow the law.\", Now, of course, he is about to do the complete opposite, a flip-flop of such humongous proportion that even The Washington Post awarded him a dubious \"upside down Pinocchio\" to call attention to his amazing about-face. After all that time insisting he had no intentions or powers to change the law, he now insists he does have those powers. Whats eerie is that Obama says it with such conviction, with the same icy tone that emperors employ in the movies just before they crucify the senators. Now you may call him king, emperor, master of all he surveys, or one of dozens of terms for absolute ruler, like malik (Morocco) or shah (Persia), wang (China), anax (Macedonia), autokrator (Byzantium) and on and on. But in Chicago, we have two names for those who impose their rule by force and power. Boss is one. And Mayor is another. And in this business of imposing will, Obama isnt acting as the president of a republic who looks to the Constitution to reign in the impulses and ambitions of imperfect human leaders. Instead, hes acting like the Mayor of America, or, lest there be any confusion, the Boss of America. Boss Obama? Dig it. \"Everybody agrees that our immigration system is broken,\" the president said in a message Wednesday. \"Unfortunately, Washington has allowed it to fester far too long.\", Early in his administration, with Democratic majorities in both the House and the Senate, Obama could have pushed through changes in immigration law. But he didnt. And now, after a stunning and complete defeat in the November midterm elections, in which his policies were repudiated and Democrats lost control of the Senate and more ground in the House, hes willing to stuff this policy down the nations throat?, This is not the time for brinkmanship, not with Putin on the prowl and Iran moving toward nuclear weapons and ISIS lopping off American heads. I suppose Obama can unleash his biscuit eaters to blame all immigration woes on conservatives. But all the demagoguery cant change this, and all the race cards in all the race card decks in all of American politics cant change it. It is a wrongheaded approach, especially since the president has stated for years that he couldnt act alone. Should immigration be \"fixed,\" as the president now so urgently demands?, Yes. But not by edict of a Boss. It should be hammered out, loudly, vigorously, painfully, but not by executive fiat. If this were so vitally important, why didnt he loudly demand that Democratic candidates stand with him on the issue before the November elections? Because hes no fool. Whats worrisome is this: Imagine some future president, say someone as far to the right as Obama is to the left, who decides our tax laws are broken. And what if that future president someone who wants to shrink government in the name of liberty issues an order not to collect the income tax?, Then what?, As the son of immigrants, I believe in releasing the drive, passion and dynamism of immigrants, especially those who yearn to be American in spirit, and not merely in benefit. My father fought the Italians, then the Germans, then the communists and came over on the boat. His first job here was as a dishwasher. He built a small business and educated his sons, and we heard this president tell small business owners, \"You didnt build that.\", Other immigrant families have similar stories of sacrifice. We all fought hard to get here, some from overseas, some from south of the border. And once here, many of us fought even harder to become Americans, because we didnt want to be ruled by some boss back home. What keeps the bosses at bay isnt the ever-changing whims of politicians. What keeps them at bay is the adherence to the Constitution, which all presidents swear to \"preserve, protect and defend.\", It wasnt written to protect the boss. It was written to protect you. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20141119", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-obama-immigration-boss-kass-met-1120-20141120-column.html", "Title": "[Obama plays Boss of America on immigration]"}