{"Content": "[In a sweeping environmental manifesto aimed at spurring concrete action, Pope Francis called Thursday for a bold cultural revolution to correct what he described as a \"structurally perverse\" economic system where the rich exploit the poor, turning Earth into an \"immense pile of filth.\", Francis framed climate change as an urgent moral issue to address in his eagerly anticipated encyclical, blaming global warming on an unfair, fossil fuel-based industrial model that harms the poor most. Citing Scripture, his predecessors and bishops from around the world, the pope urged people of every faith and even no faith to undergo an awakening to save Gods creation for future generations. The document released Thursday was a stinging indictment of big business and climate doubters alike, aimed at spurring courageous changes at U.N. climate negotiations later this year, in domestic politics and in everyday life. \"It is not enough to balance, in the medium term, the protection of nature with financial gain, or the preservation of the environment with progress,\" he writes. \"Halfway measures simply delay the inevitable disaster. Put simply, it is a matter of redefining our notion of progress.\", Environmental scientists said the first-ever encyclical, or teaching document, on the environment could have a dramatic effect on the climate debate, lending the moral authority of the immensely popular Francis to an issue that has long been cast in purely political, economic or scientific terms. \"This clarion call should guide the world toward a strong and durable universal climate agreement in Paris at the end of this year,\" said Christiana Figueres, the U.N.s top climate official. \"Coupled with the economic imperative, the moral imperative leaves no doubt that we must act on climate change now.\", Copies of Pope Francis encyclical \"Laudato Si,\" (Praise Be) are displayed prior to the start of a press conference, at the Vatican, onJune 18, 2015. Copies of Pope Francis encyclical \"Laudato Si,\" (Praise Be) are displayed prior to the start of a press conference, at the Vatican, onJune 18, 2015. Veerabhadran Ramanathan, a Scripps Institution of Oceanography scientist, said the encyclical is a \"game-changer in making people think about this.\", \"Its not politics anymore,\" he said, adding that science is often difficult to understand but that people respond to arguments framed by morality and ethics. The energy lobby was quick to criticize the encyclicals anti-fossil fuel message. \"The simple reality is that energy is the essential building block of the modern world,\" said Thomas Pyle of the Institute of Energy Research, a conservative free-market group. \"The application of affordable energy makes everything we do food production, manufacturing, health care, transportation, heating and air conditioning better.\", Francis said he hoped his effort would lead ordinary people in their daily lives and decision-makers at the Paris U.N. climate meetings to a wholesale change of mind and heart, saying \"both the cry of the Earth and the cry of the poor\" must now be heard. \"This vision of might is right has engendered immense inequality, injustice and acts of violence against the majority of humanity, since resources end up in the hands of the first comer or the most powerful: the winner takes all,\" he writes. \"Completely at odds with this model are the ideals of harmony, justice, fraternity and peace as proposed by Jesus.\", The encyclical \"Laudato Si,\" (Praise Be) is 191 pages of pure Francis. Its a blunt, readable booklet full of zingers that will make many conservatives and climate doubters squirm, including in the U.S. Congress, where Francis will deliver the first-ever papal address in September. It has already put several U.S. presidential candidates on the hot seat since some Republicans, Catholics among them, doubt the science behind global warming and have said the pope should stay out of the debate. \"I dont think we should politicize our faith,\" U.S. Republican presidential candidate Jeb Bush, a Catholic convert, said on the eve of the encyclicals release. \"I think religion ought to be about making us better as people and less about things that end up getting into the political realm.\", Yet one of Francis core points is that there really is no distinction between human beings, their faith and the environment. \"Everything is related, and we human beings are united as brothers and sisters on a wonderful pilgrimage, woven together by the love God has for each of his creatures and which also unites us in fond affection with brother sun, sister moon, brother river and mother earth,\" he writes. Cardinal Peter Turkson, whose office wrote the first draft of the encyclical, acknowledged that the pope was no expert in science although he did work as a chemist before entering the seminary. But he said Francis was fully justified in speaking out about an important issue and had consulted widely and asked if politicians would refrain from talking about science just because theyre not scientific experts. Francis accepts as fact that the world is getting warmer and that human activity is mostly to blame. \"The earth, our home, is beginning to look more and more like an immense pile of filth,\" he writes. Citing the deforestation of the Amazon, the melting of Arctic glaciers and the deaths of coral reefs, he rebukes \"obstructionist\" climate doubters who \"seem mostly to be concerned with masking the problems or concealing their symptoms.\" And he blames politicians for listening more to oil industry interests than Scripture or common sense. He praises a \"less is more\" lifestyle, one that shuns air conditioners and gated communities in favor of car pools, recycling and being in close touch with the poor and marginalized. He calls for courageous, radical and farsighted policies to transition the worlds energy supply from fossil fuels to renewable sources, saying mitigation schemes like the buying and selling of carbon credits wont solve the problem and are just a \"ploy which permits maintaining the excessive consumption of some countries and sectors.\", What is needed, he says, is a \"bold cultural revolution.\", \"Nobody is suggesting a return to the Stone Age, but we do need to slow down and look at reality in a different way, to appropriate the positive and sustainable progress which has been made, but also to recover the values and the great goals swept away by our unrestrained delusions of grandeur,\" Francis writes. Some have dismissed the Argentine pope as pushing what they call Latin American-style socialism but he answered those critics just this week, saying it was not a sign of communism to care for the poor. Within the church, many conservative Catholics have questioned the popes heavy emphasis on the environment and climate change over other issues such as abortion and marriage. Francis does address abortion and population issues briefly in the encyclical, criticizing those in the environmental movement who show concern for preserving nature but not human lives. The Catholic Church has long been at odds with environmentalists over how much population growth degrades the environment. John Schellnhuber, the scientist credited with coming up with the goal of keeping global warming below 3.6 degrees F, says its a \"myth\" that a growing population is responsible for environmental decay. \"Its not poverty that destroys the environment,\" he told the press conference launching the document. \"Its wealth, consumption and waste. And this is reflected in the encyclical.\", Associated Press]", "Date": "20150618", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-pope-francis-global-warming-20150618-story.html", "Title": "[Pope urges revolution to save Earth, fix 'perverse' economy]"}