{"Content": "[Viewed through the lens of Americas civil rights history, Donald Trumps new call to repeal birthright citizenship chimes with an ominous ring. Spoiler alert: It sounds like racism. It sounds like the Supreme Courts declaration in 1857 that African-Americans were \"so far inferior that they had no rights which the white man was bound to respect.\", That quote comes from the 7-2 decision written by Chief Justice Roger B. Taney in the notorious Dred Scott case. It declared that Scott, a slave, could not be a citizen because he was African-American and, slave or free, had no standing to sue for his freedom in court. Trump: beating of Mexican citizen in Boston \"terrible.\"Condemnation after two Massachusetts brothers, Scott and Steve Leader, beat and urinated on a Mexican citizen, citing Trumps position on undocumented immigrants. Aug. 21, 2015. (Reuters), Trump: beating of Mexican citizen in Boston \"terrible.\"Condemnation after two Massachusetts brothers, Scott and Steve Leader, beat and urinated on a Mexican citizen, citing Trumps position on undocumented immigrants. Aug. 21, 2015. (Reuters), I bring that up because outrage over that awful decision led to the Civil War and the 14th Amendment, with which Trump now wants to tinker. The amendment was passed in 1868 at the urging of Republican lawmakers to overrule the Dred Scott decision in honor of Abraham Lincoln. Now it is Republican Trump, in his first position paper as front-runner for the Grand Old Partys presidential nomination, who wants to water it down. Trumps beef is with the citizenship clause, which states, \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside.\", The elegant simplicity of that clause troubles Trump, who attacks \"birthright citizenship\" as \"the biggest magnet for illegal immigration.\", Actually, the biggest magnets for immigrants continue to be what they always were jobs, freedom and an opportunity to succeed. As jobs in this country declined in recent years, the Department of Immigration and Customs Enforcement reports that illegal immigration also declined. But immigrants and other minorities offer an inviting target for demagogic populists, especially during times of economic hardship and sagging confidence in public institutions like government. We saw that in the backlash against civil rights in the post-Reconstruction period and during the 1960s civil rights revolution. We can see it in the anti-immigrant sentiments of the Know-Nothings before the Civil War and the anti-Chinese sentiment in the late 19th centurys immigration surge. Critics of birthright citizenship argue that the 14th Amendment was intended to protect the rights of slaves, not immigrants. But, as senior political reporter Amanda Terkel recently recountedin The Huffington Post, birthright citizenship came up during the amendments spirited legislative debate too. Yet it passed without exceptions for immigrants. Later the progress/backlash cycle resumed as economic fears led to passage of the Chinese Exclusion Act of 1882, which stopped Chinese immigration and barred Chinese in America from becoming citizens. But in 1898 the Supreme Court affirmed in the case of Wong Kim Ark that immigrants children born in the U.S. are entitled to citizenship. In the mid-1960s, Alabamas Democratic Gov. George Wallace launched a new era of made-for-TV populist backlash politics with presidential campaigns on the heels of President Lyndon B. Johnsons civil rights legislation. Insisting that his gripe was with liberals, not black folks, Wallace rallied millions of mostly white voters in the South and the North to the idea that they, not long-segregated African-Americans, were the real victims of \"permissiveness,\" crime, busing, Godlessness and \"briefcase-toting liberal big government bureaucrats\" with their \"racial quotas.\", Sound familiar? Trump may promote himself as a political outsider who \"speaks the truth\" about a government thats not working, but he didnt invent that role. Wallaces success would inspire others as varied as Ralph Nader on the left, Pat Buchanan on the right and Ross Perot in the fiscally conservative, third-party middle. In fact, Buchanan beat Trump to the idea of a wall on the Mexican border, which Pat my longtime colleague on \"The McLaughlin Group\" called \"the Buchanan fence\" during his 1992 presidential campaign. Outlandish, I thought. Not anymore. The only wall-fence debate left is over whether and how to complete it. Now Trump steps up to battle birthright citizenship. For years a small fringe of activists has been fighting that fight, clinging to their own arcane odd readings of the legally enigmatic \"subject to the jurisdiction thereof\" phrase. Sound outlandish? So do those who share Trumps ridiculous doubts about President Barack Obamas birth certificate. For some folks, reality isnt good enough. Clarence Page, a member of the Chicago Tribune Editorial Board, blogs at chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150821", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-donald-trump-birthright-racism-perspec-0823-jm-20150821-column.html", "Title": "[Clarence Page: Donald, your birthright idea is sounding like racism]"}