{"Content": "[Last week Wisconsin Gov. Scott Walker said he wasnt going to take the medias bait. But his challenge isnt avoiding taking the bait its avoiding becoming the chum. After speaking at the Conservative Political Action Conference, Walker found himself at the center of a feeding frenzy over an answer he gave about what he would do to stop the advance of Islamic State, or ISIS. At the end of a long response to a question about the extremist jihadist group, Walker said, \"If I can take on 100,000 protesters, I can do the same across the world.\" This answer was panned from the Talking Points Memo on the left to National Review on the right. By the next morning, Walkers competitor, former Texas Gov. Rick Perry, said it was \"inappropriate\" for Walker to have compared the Madison, Wis. protesters to ISIS, a terror organization. \"These are Americans,\" said Perry. AFL-CIO President Richard Trumka took umbrage: \"Gov. Walkers statement comparing workers and terrorists is revolting. It is clear that Gov. Walkers judgment is impaired, and that he is not qualified for the presidency.\", Walker didnt compare protesters to terrorists. Heres his full answer:, \"I have two sons. I know all of you as parents feel the same way. I want a commander in chief who will do everything in their power to ensure the threat from radical Islamic terrorists will not wash up on American soil. We will have someone who leads and ultimately will send a message not only that we will protect American soil but do not, do not, take this upon freedom-loving people anywhere else in the world. We need a leader with that kind of confidence. If I can take on 100,000 protesters, I can do the same across the world.\", This is reductionist foreign policy aimed at protecting every free country across the globe is a little trickier than that and its a logical fallacy, but its not a comparison. The logical fallacy is that strength in one category can be transferred to another. (You may know its cousin: If we can put a man on the moon ) Its also a familiar candidate gambit. Walker was arguing that since he had done one hard thing, he could offer the same internal strength to do another hard thing. This is what all candidates do when trying to argue that the skills they have in one context apply in the presidential context. Its why Hillary Clinton thought she was better prepared for a 3 a.m. phone call in the 2008 race, even though shed never actually faced such a crisis. Its why Barack Obama thought his successful campaign made him qualified to be a successful president, even though hed never run anything. Walker said he was taken out of context, and he was. This is a particular gambit of governors who try to create future competency in foreign affairs based on accomplishments that dont have anything to do with foreign affairs. Fighting an extended war against terrorism will require focus and commitment, but the situations are so different that the skills required go well beyond mere demonstrations of strength. But that is often not the view as foreign policy is discussed in the Republican campaign, where strength is prized above all. Donald Trump received roaring applause from the CPAC audience when he offered his version of Walkers claim. What was Trumps policy? Strength. \"Nobody would be tougher than Donald Trump,\" he said, appealing to that portion of the electorate hungry for a candidate who also refers to himself in the third person. \"I would hit them so hard and so fast that they wouldnt know what happened.\", While Walkers words were taken out of context, that doesnt mean there were no questions raised by his remarks. The biggest one that remains is the one that faces all Republican candidates running on the idea of strength: What does that mean in a practical sense in a complicated world?, Walker would be only too happy to get back to that conversation. Right now hes enjoying a willful misreading of his remarks by those who do not have his best interests at heart. It happens all the time in politics, and its not just the press that enjoys this sport. Indeed, Walker has enjoyed it, too. At the start of his CPAC remarks, Walker said that President Obama \"thinks we grow the economy by growing Washington.\" Thats not exactly a complete and fair rendering of the presidents views. Walker has just now gotten a taste of what its like being president. Slate, John Dickerson is Slates chief political correspondent and author of \"On Her Trail.\"]", "Date": "20150303", "Author": "[John Dickerson]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-scott-walker-trump-islmic-state-obama-perspec-0304-jm-20150303-story.html", "Title": "[In defense of Scott Walker]"}