{"Content": "[At a forum in which all eight of Buffalo Groves public office candidates answered identical questions, each runner brought forth specific answers to how the village can emerge from the challenging economic times. All maintained civility, but where the Village Board contestants rarely addressed each other directly, the village president opponents made several pointed remarks. The two candidates for Buffalo Groves top office and the six vying for three trustee positions all attended a question-and-answer session March 19 in a community room filled to capacity at Stevenson High School. The SHS Political Action Club and the Buffalo Grove Lincolnshire Area Chamber of Commerce organized the event, the first of its kind in years in the village a reflection of the first hotly contested races in recent memory. The following is a summary of the questions and responses, in the order of which the candidates spoke. Candidates for Village President, Question: Describe your leadership style, Jeff Braiman, current village president: \"I try to look at all sides.\" He stressed collecting all the facts, from all involved parties. Beverly Sussman, current Village Board member: \"You break everything down into sections.\" She said she would be detail-oriented, and also advocated the importance of inviting responses from the public. Q: How do you envision the Buffalo Grove of 10 years in the future?, Sussman: The Town Center shopping center will be thriving, with shopping coming to it from out of town, and much of the rest of the village will hold a sharp appearance. \"Everything really built up, and looking great.\", In recent weeks, Village Halls staff has stated that Buffalo Groves retail spaces are 89.7 percent occupied; during the forum, Sussman refuted that claim. \"You cannot tell me that we are 89.7 percent full, because I wouldnt believe it.\", Braiman: He referenced the 2013 article in which the magazine \"Money\" listed Buffalo Grove as the 46th-best small community in the nation to live in, citing it as a compliment of his administration and all aspects of life in the village. The 2014 \"Money\" list was almost completely different, and did not include Buffalo Grove. \"Well be in the same financial situation that were in now, if not better. Well still be considered one of the best villages in the country.\", He noted that there a limit to what a municipal government can do with a privately owned property. \"People still dont understand that the village doesnt own Town Center.\", Q: Should Buffalo Grove put more referenda on ballots, giving voters a more direct voice in government actions?, Braiman: A referendums question must be highly specific to be effective. \"A referendum is a very difficult matter.\", He said he wanted to see more Internet-based surveys, through which people could make advisory recommendations from their homes. He noted that a legally binding referendum would put the fate of more that 41,000 residents into the hands of whichever ones chose to go to their polling place. Sussman: She spoke in favor of referendums, specifying the now-defunct idea of selling the Clayton Municipal Campus to a developer as their ideal use. \"We were selling public land for private purposes,\" she said. \"This is one time when a referendum should have been had.\", Braiman, making the first rebuttal of this forum: He clarified that while he and the Village Board investigated proposals from a Deerfield developer from 2012 until December, sales proceedings never began. Q: What is the most important role of local government?, Sussman: \"Local government is here to represent the people,\" and, after that, to provide for its \"health, safety and welfare\" in the form of whatever public services are needed. Braiman: \"Clearly, I believe the same.\" He specified that clean water, streets, emergency protection and such were the central roles. Q: What will you do to develop new revenue sources?, Braiman: He noted that he is meeting with Gov. Bruce Rauner soon to urge the just-elected Republican not to hoard away income-tax revenue that municipalities have depended on for 40 years. \"This issue, with regard to the governor, is very critical.\", Sussman: She brought up what she billed as a three-point plan, beginning with making Buffalo Grove more attractive to new businesses by easing the sign codes, offering tax breaks and incentives and more. The second step, she said, would be to establish a new commission of local business owners. The third would be the development of a Village Hall web site devoted to businesses, including advertising what is here an promoting vacant spaces and unfilled consumer desires to potential newcomers. Braiman (in a rebuttal): He noted that while Sussman had been speaking of business promotion, she had voted against developer Chuck Malks built-from-scratch downtown plan (which he withdrew in December after losing the belief that he would profit from it). Sussman (rebuttal): She said she voted against businesses when she doubted their viability. She brought up the now-open Xtreme Trampolines, which she voted against because of her concerns about safety at its Carol Stream facility. Q: Where would you take a first-time visitor to Buffalo Grove?, Sussman: Village Hall which is where she took her four South African grandchildren when they visited her. \"I was very proud to take them there.\", Braiman: Did not specify a single location, saying he was proud of the entire community. \"All the amenities that we have in the village are so very, very important.\", Q: What types of village services should be outsourced?, Braiman: Non-emergency functions. He specified tree-trimming, refuse removal, information technology, the village prosecutor and several more roles all of these not only cut salaries, but reduce pension obligations. He noted that police and fire should never be outsourced. \"Where its appropriate, I support doing that.\", Sussman: She gave a similar list of possibilities, and added that she would look into what services Buffalo Grove could share with a neighboring municipality. Fire and police response cannot be on those lists, she said. \"We try very hard to make sure that budget is balanced.\", Q: Buffalo Grove now has a fund of money set aside for \"merit pay\" or \"bonuses\" for employees who turn in exceptional work how extensively should that system be used?, Braiman: He said the program is young, and he wanted to watch it more. \"What were trying to do is make sure we get the best out of our people,\" he said. \"I think its worth a shot, to find out if our employees are doing the best they can.\", Sussman: She said she was initially against the idea, but that a meeting with village manager Dane Bragg and finance director Scott Anderson converted her. The focal point now, she said, is to make sure that above-and-beyond efforts are recognized and rewarded. \"Not everyone will automatically get that.\", Q: What is, in your estimation, the proudest moment in Buffalo Groves history?, Braiman: \"Every day, Im proud to live in the village,\" but he specified the 2013 day on which \"Money\" released its best-small-cities list. Sussman: \"I am very proud of many things in Buffalo Grove,\" but she narrowed it down to a day on which her family greeted an armed-forces veteran returning from the Middle East. In his closing comments, Braiman attacked the notion of Sussman and her companions in the Save Buffalo Grove political action committee that change is needed. He said the villages AAA bond rating would turn into a \"junk bond rating,\" and that commendations for a safe cities would become complaints about an \"unsafe\" city. In her response, Sussman attacked Braimans commitment to the office. She pointed out that, only months after his election, the first-term Village President and professional attorney ran for an open Lake County judgeship. The election is April 7. rwacther@pioneerlocal.com]", "Date": "20150320", "Author": "[Ronnie Wachter]", "Link": "http://www.chicagotribune.com/suburbs/buffalo-grove/news/ct-bgc-debate-president-tl-0326-20150320-story.html", "Title": "[Village president candidates discuss economic development, cost cuts]"}