{"Content": "[A lawsuit alleging ethics violations nearly a decade ago has become an issue in a Democratic congresswomans bid to unseat first-term Republican U.S. Sen. Mark Kirk in what is expected to be one of the countrys most competitive 2016 Senate races. The complaint alleging workplace retaliation was filed by two employees of a southern Illinois veterans home against Tammy Duckworth, now a Chicago-area congresswoman who at the time led the Illinois Department of Veterans Affairs. The suit was dismissed by a federal judge in 2008 as a \"garden variety workplace case.\" It was refiled in state court and dismissed again, but then narrowed and brought back a third time. A judge has scheduled a hearing on the complaint for Tuesday, with a trial date tentatively set for next April, a month after the Senate primaries. A lawsuit alleging workplace ethics violations from almost a decade ago has become a thorn in Tammy Duckworths side as she mounts a bid to unseat first-term Republican U.S. Sen. Mark Kirk. (WGN-TV), A lawsuit alleging workplace ethics violations from almost a decade ago has become a thorn in Tammy Duckworths side as she mounts a bid to unseat first-term Republican U.S. Sen. Mark Kirk. (WGN-TV), Illinois Republicans have highlighted the case, seeking to thwart Duckworths bid against Kirk, a moderate in a Democrat-leaning state who is seen as one of the most vulnerable Republican senators next year. Kirk, who hada stroke in 2012 and has been criticized lately for a string of public gaffes, can expect a tough re-election challenge in a presidential year, especially if Illinois-born Hillary Rodham Clinton is also on the ballot. The Republicans have portrayed the lawsuit as a \"whistleblower\" case against Duckworth. The congresswoman denies treating the employees unfairly. Duckworths defense is being handled by the state attorney generals office. Christine Butler, a 21-year state employee, accuses Duckworth in the lawsuit of firing her for insubordination over complaints about her boss, the facilitys acting director. Butlers termination was reversed within days of her meeting with Duckworth. Denise Goins, a human resources secretary, alleges that her complaints about the same supervisor were also ignored and led to an unfavorable performance review that prevented her from receiving a raise. Goins saysDuckworth urged her in a meeting to \"do your job and keep your mouth shut.\", See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. The two state workers are seeking compensatory damages of at least $50,000, as well as other financial penalties. Duckworth, an Iraq War veteran who led the state agency from December 2006 until early 2009 before joining the federal Department of Veterans Affairs, successfully deflected the allegations when she defeated an incumbent Republican for the states 8th Congressional District seat in 2012. But the state Republican Party continues to hammer her on the issue. \"Rep. Duckworth has continuously refused to explain her actions,\" said Kirk campaign manager Kevin Artl. \"It is our hope that the legal system will deliver what she has not --the truth about her actions and justice to the whistleblowers.\", The state Republican Party also points to an email it received under Illinois public records laws in which Duckworth acknowledged that she \"screwed up\" by not first placing the fiscal officer on leave with pay. Leaders of Duckworths campaign declined comment, citing the pending legal dispute. But Matt McGrath, an Illinois Democratic Party spokesman, said Kirks supporters are exaggerating what he termed a workplace disagreement. He called the GOP focus on the suit \"the politics of desperation.\", \"Every time Mark Kirks campaign hits a bump in the road ... he and his Republican allies start talking about this case again,\" he said. Kirks bid to keep Barack Obamas former seat suffered its own hit last week when a top Republican fundraiser briefly suggested that he should abandon his re-election bid because ofrecent public gaffes. The Illinois race is in the national spotlight as Democrats seek to make a net gain of at least four seats to take back the Senate majority won by Republicans in 2014. Should the lawsuit go to trial as scheduled, it would begin just a few weeks after Duckworth faces a March primary challenge from Chicago Urban League CEO Andrea Zopp, a former federal prosecutor. Associated Press]", "Date": "20150804", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-tammy-duckworth-lawsuit-20150803-story.html", "Title": "[State workers' suit against Duckworth spills into Senate bid ]"}