{"Content": "[The lawyer of a Washington Post journalist detained in Iran said Monday that the next hearing in his espionage trial likely will be the last, though shes still uncertain when that will be. Bureau chief Jason Rezaian, 39, has been held almost a year and has faced three other closed-door hearings in its trial in a Revolutionary Court in Tehran, even as Iran recently struck a deal in Vienna with world powers over its contested nuclear program. He faces charges that include espionage and distributing propaganda against the Islamic Republic. U.S. officials, the Post and rights groups have criticized his trial and pressed for his release. Rezaians defense lawyer, Leila Ahsan, told The Associated Press by telephone that the court has informed her the next session \"almost certainly\" will be the last one. \"Still, its not clear how long it will take for the court to issue a verdict on the case after the last session,\" Ahsan said. She declined to comment further. Rezaian is a dual U.S.-Iranian citizen who was born and spent most of his life in the United States. Iran does not recognize other nationalities for its citizens. His wife, Yeganeh Salehi, a journalist for The National newspaper in the United Arab Emirates capital of Abu Dhabi, and two photographers were detained along with Rezaian on July 22, 2014, in Tehran. All except Rezaian were later released. Ahsan previously said Salehi and one of the two unidentified photojournalists also would stand trial. Salehi is barred from traveling abroad. The Post has said Rezaian faces 10 to 20 years in prison if convicted. Officials there could not be immediately reached for comment Monday, though Post executive editor Martin Baron told CNNs \"Reliable Sources\" on Sunday that the newspaper was doing everything it could to free him. \"What we want to say and what we want to reiterate is that its absolutely critical that an innocent individual like Jason Rezaian, who is an accredited journalist in Iran and who did nothing wrong, ... be allowed to reunite with his family, that he be able to regain the freedom to which he was entitled as a human being,\" Baron said. Associated Press]", "Date": "20150720", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-iran-washington-post-reporter-trial-20150720-story.html", "Title": "[Washington Post reporter's trial in Iran likely ending next week: lawyer]"}