{"Content": "[When the University of Missouri at Kansas City was looking for a celebrity speaker to headline its gala luncheon marking the opening of a womens hall of fame, one of the names that came to mind was Hillary Rodham Clinton. But when the former secretary of states representatives quoted a fee of $275,000, officials at the public university balked. \"Yikes!\" one emailed another. So the school booked the next best option: her daughter, Chelsea. The university paid $65,000 for Chelsea Clintons brief appearance Feb. 24, 2014, a demonstration of the celebrity appeal and marketability that the former and possibly second-time first daughter employs on behalf of her mothers presidential campaign and familys global charitable empire. More than 500 pages of emails, contracts and other internal documents obtained by The Washington Post from the university under Missouri public record laws detail the schools long courtship of the Clintons. They also show the meticulous efforts by Chelsea Clintons image-makers to exert tight control over the visit, ranging from close editing of marketing materials and the introductory remarks of a high school student to limits on the amount of time she spent on campus. The schedule she negotiated called for her to speak for 10 minutes, participate in a 20-minute, moderated question-and-answer session and spend a half-hour posing for pictures with VIPs offstage. As with Hillary Clintons paid speeches at universities, Chelsea Clinton made no personal income from the appearance, her spokesman said, and directed her fee to the Bill, Hillary and Chelsea Clinton Foundation. \"Chelsea is grateful to have the opportunity to speak at events like this while also supporting the work of the Clinton Foundation,\" said the spokesman, Kamyl Bazbaz. He said she was happy to \"celebrate the legacy of women in their community.\", The emails show that the university initially inquired about Chelsea Clinton but her speaking agency indicated she was unlikely to do the speech. At that point, a university vice chancellor urged organizers to \"shoot for the moon\" and pursue the former secretary of state, who proved too expensive. So the university turned back to others, eventually choosing Chelsea Clinton when the agency indicated she was willing. Just shy of her 34th birthday, Clinton commanded a higher fee than other prominent women speakers who were considered, including feminist icon Gloria Steinem ($30,000) and journalists Cokie Roberts ($40,000), Tina Brown ($50,000) and Lesley Stahl ($50,000), the records show. Officials with the school appeared to believe Clinton was worth her fee, which university spokesman John Martellaro said was paid using private donations. They exulted to Clintons representatives that the luncheon sold out quickly, with 1,100 tickets selling for $35 each which would equal $38,500. University officials say the event was intended to boost attention for the new hall of fame, not raise money. \"Chelsea was the perfect fit,\" Amy Loughman, an alumni relations official who managed the event, wrote in an e-mail a few days later. \"It created fantastic buzz in the community.\", Chelsea Clinton has become an increasingly public figure in her own right. With her parents stepping back from the foundation, started by former president Bill Clinton in 2002, Chelsea Clinton has assumed a prominent management role there and as an advocate for its work on global health, childhood obesity and other issues. Until last summer, she worked as a special correspondent for NBC News, where Politico first reported she earned an annual salary of $600,000. Clinton is stepping out as an early key surrogate for her mothers campaign, appearing this spring on the cover of Elle magazine and walking at the head of the campaigns marchers at last weekends gay pride parade in New York City. Last week, an all-male a capella group released a playful music video called \"Chelseas Mom,\" which Clinton praised on Twitter. Clinton has delivered nine paid speeches on behalf of the Clinton Foundation in recent years, raising between $370,000 and $800,000 for the nonprofit organization. Overall, the foundation has taken in between $12 million and $26 million in speaking fees, the lions share of that money from 73 speeches delivered by Bill Clinton. In dozens of emails exchanged between University of Missouri officials and Clintons representatives at the Harry Walker Agency, which arranges appearances by all three Clintons, there was no reference to her $65,000 fee going to charity. Nor was there any reference in the five-page contract. The university paid the fee which also covered Clintons travel expenses in two disbursements to the Walker Agency. But Martellaro said, \"We have no knowledge of how funds were disbursed from that point.\", Bazbaz said all of Clintons paid speeches through the Walker Agency are delivered on behalf of the foundation \"to support implementing its life saving work\" and that this was \"always the intention\" with the University of Missouri. He added that neither she nor her hosts receive charitable tax deductions. The contract stipulated that Clinton would have final approval of everything, such as the selection of her introducer (celebrities, journalists and elected officials were prohibited from consideration), the onstage setup (there must be \"room-temperature water\" next to her podium along with \"two comfortable armed-and-backed chairs\" for the question-and-answer session) and the type of microphone provided for her use (both lavaliere and handheld). In emails with university officials, Clintons aides closely edited the texts of press releases, marketing materials and introductory remarks. Clintons representatives instructed that a line about her being the daughter of Bill and Hillary Clinton be deleted from one news release and that her title of vice chair of the Clinton Foundation be added beneath her name on an electronic flier. Other materials mentioned her parents, however. When reviewing the script that a student would read introducing her, a Clinton Foundation aide asked university officials to remove the list of Clintons degrees. A Clinton adviser, who requested anonymity to speak candidly about the event, said \"this was by no means an intention to script a high school students introduction of Chelsea,\" but rather to avoid what otherwise would have been a recitation of all of Clintons achievements. Clintons representatives also instructed university officials to cut a reference to her mother-in-law, former congresswoman Marjorie Margolies-Mezvinsky, from a news release being drafted about the event. Margolies-Mezvinsky was an acquaintance of Martha Jane Phillips Starr, a Kansas City philanthropist and namesake of the hall of fame that Clinton was unveiling. However, a Clinton adviser noted that Margolies-Mezvinsky was mentioned during the event itself. Clintons representatives also closely managed her time on campus. They asked whether she would be free to depart from the event once she finished her remarks, rather than waiting until the luncheon concluded. Martellaro said she stayed until the end. Clinton agreed to pose for photographs backstage with 100 VIPs prior to the speech. But her representatives requested that only 20 to 30 minutes be budgeted for the photo line, rather than 45 minutes the university initially sought. The contract required that the university submit a final list of attendees (including their occupations, titles and affiliations) two weeks prior to the event \"for vetting\" and stipulated that guests must be lined up prior to Clintons arrival and then \"proceed to their seats\" after their photos were taken. The contract also gave Clintons team \"final approval\" of which media outlets were authorized to cover the speech. Some of these requirements are standard for prominent speakers. The documents show that university officials were persistent in pursuing Clinton as a speaker. When they first inquired about her availability, a Walker Agency staffer informed them that Clinton had never before accepted a speaking invitation. Later, a speaking agency staffer told the university that Clinton had decided to \"consider a very select few invitations\" and that the mission of their project made it something she might agree to do. During her remarks, Clinton praised both her parents and highlighted the work of their foundation, talking at length about its efforts to lower drug prices. \"As my mother has observed, equal rights for women and girls remains the unfinished business of the 21st century,\" she said, according to a university account of her remarks. \"We will only complete this business if we are equally committed and we highlight the role models we are already blessed to have.\"]", "Date": "20150630", "Author": "[Philip Rucker and Rosalind S. Helderman]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-hillary-clinton-speaking-fee-20150630-story.html", "Title": "[A college balks at Hillary Clinton's fee, books Chelsea for $65,000 instead]"}