{"Content": "[The states budget impasse has prompted its largest utility to launch a contingency plan to get money to thousands of people struggling to pay their electricity bills in northern Illinois. The social service agencies that have traditionally administered Commonwealth Edisons energy assistance programs have shut down pending the stalemate in Springfield. As a result, ComEd plans to open mobile locations, host energy fairs and hire additional people to process applications for low-income customers, according to an announcement the company made Friday. Val Jensen, ComEds senior vice president of customer operations, said in a release that given the states funding situation, \"we understand this matter may affect some of our customers and their ability to pay their electric bill, and we want to minimize this impact.\", ComEd delivers electricity to about 1.2 million customers in Chicago. Low-income Illinoisans who rely on energy assistance money were already affected this year by Gov. Bruce Rauners decision to withhold a separate pot of state money that is normally used to help pay electric and gas bills. The program, which helped lower energy bills for about 400,000 Illinois households last year, is funded through federal dollars and state fees that are collected from Illinois utility customers. ComEds program is funded through shareholders. As part of the \"smart grid\" law, which was enacted in 2011, the company agreed to dedicate $10 million a year for five years to help customers pay their utility bills. The assistance goes toward military families, veterans and senior citizens, as well as those who may be unemployed, sick or disabled, the company said. Depending on budget developments, the plan could go into effect as soon as Aug. 1. Energy fairs would be held in neighborhoods in Cook, Lake, Kane and DeKalb counties. The plan, which ComEd estimates will cost less than $100,000, would be funded through the $10 million a year that has been dedicated to the program. \"We know that our customers cant go without this assistance to help them pay for their electric service,\" said spokeswoman Krissy Posey. \"Our goal is to help them access the funds that are available to them.\", cdizikes@tribpub.com]", "Date": "20150710", "Author": "[Cynthia Dizikes]", "Link": "http://www.chicagotribune.com/business/ct-comed-assistance-plan-met-20150710-story.html", "Title": "[ComEd announces energy assistance plan in wake of state budget impasse]"}