{"Content": "[North Shore U.S. Rep. Bob Dold said Monday that Congress should have oversight over any nuclear pact with Iran but disagreed with GOP senators who reached out to Iranian leaders to warn about the limits of any deal. Speaking to about 150 people at the City Club of Chicago, the newest Illinois Republican member of the powerful House Ways and Means Committee also suggested that increased federal funding for national and Chicago transportation infrastructure could come from repatriation of investments held by U.S. firms overseas. Dold finds himself in one of the most politically competitive congressional districts in the nation. He was initially elected to the House in 2010, then lost to Democrat Brad Schneider in 2012 but came back to defeat Schneider last year. Schneider is seeking another rematch in the North Shore and northwest suburban 10th District, though Highland Park Mayor Nancy Rotering also has announced her candidacy for the Democratic nomination. Dold has sought to portray himself as following the independent nature of voters in the swing district while touting strong support for Israel. He said he was concerned that in the multinational talks aimed at deterring Irans ability to build a nuclear weapon that the objectives of President Barack Obamas administration had shifted from preventing the Middle East country from ever having a nuclear bomb to an effort toward \"containment.\", \"As we look at the Iran deal, I believe that Iran is probably the greatest threat we have to our own national security today,\" Dold said. \"This is a nation that has said time and again they want to drive Israel into the sea. They want to wipe them off the face of the map. That they are the Little Satan, which naturally begs the question, whos the Big Satan?\" he said. The Senate is expected to take up a measure calling for oversight of any Iranian deal reached after June 30, following an agreement by the multinational parties to follow a framework toward a pact. Dold agreed with the need for an \"up-or-down vote\" by Congress on any pact, something the Obama administration has now agreed to. But there are concerns that potential amendments to the Senate legislation could upend any congressional oversight. Dold said he believed the framework \"still leaves Iran as a threshold nuclear state,\" something that should not be allowed for \"the greatest state sponsor of terror the world has ever seen.\", Still, Dold said he disagreed with a recent letter signed by 47 Senate Republicans including his GOP predecessor from the district, U.S. Sen. Mark Kirk warning Iranian leaders that any deal would not be binding upon a future White House. \"I did not agree with the Senate letter,\" he told reporters after his speech. \"That to me was not the appropriate thing to do.\", More locally, Dold said Washington must find new ways to fund transportation infrastructure as the federal motor fuel tax becomes less adequate as auto mileage increases. He said increasing the fuel tax in light of lower gas prices is being discussed but \"I know that thats not one that is very popular.\", For a short-term fix, Dold noted the Obama administration has proposed requiring companies who have investments overseas to return the money to the U.S. at a lower tax rate to fund infrastructure improvements. \"From a repatriation perspective, to be able to put those directly into our transportation infrastructure system\" would get the federal highway trust fund through the next five to six years, Dold said. rap30@aol.com, Twitter @rap30]", "Date": "20150427", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-robert-dold-iran-letter-met-0428-20150427-story.html", "Title": "[North Shore Rep. Dold wants congressional oversight of Iran deal]"}