{"Content": "[Drought or no drought, Steve Yuhas resents the idea that it is somehow shameful to be a water hog. If you can pay for it, he argues, you should get your water. People \"should not be forced to live on property with brown lawns, golf on brown courses or apologize for wanting their gardens to be beautiful,\" Yuhas fumed recently on social media. \"We pay significant property taxes based on where we live,\" he added in an interview. \"And no, were not all equal when it comes to water.\", Yuhas lives in the ultra-wealthy enclave of Rancho Santa Fe, a bucolic Southern California hamlet of ranches, gated communities and country clubs that guzzles five times more water per capita than the statewide average. In April, after Democratic Gov. Jerry Brown called for a 25 percent reduction in water use, consumption in Rancho Santa Fe went up by 9 percent. But a moment of truth is at hand for Yuhas and his neighbors, and all of California will be watching: On July 1, for the first time in its 92-year history, Rancho Santa Fe will be subject to water rationing. \"Its no longer a You can only water on these days \" situation, said Jessica Parks, spokesperson for the Santa Fe Irrigation District, which provides water service to Rancho Santa Fe and other parts of San Diego County. \"Its now more of a This is the amount of water you get within this billing period. And if you go over that, there will be high penalties. \", - - -, So far, the communitys 3,100 residents have not felt the wrath of the water police. Authorities have issued only three citations for violating a first round of rather mild water restrictions announced last fall. In a place where the median income is $189,000, where PGA legend Phil Mickelson once requested a separate water meter for his chipping greens, where financier Ralph Whitworth last month paid the Rolling Stones $2 million to play a local bar, the fine, at $100, was less than intimidating. All that is about to change, however. Under the new rules, each household will be assigned an essential allotment for basic indoor needs. Any additional usage sprinklers, fountains, swimming pools must be slashed by nearly half for the district to meet state-mandated targets. Residents who exceed their allotment could see their already sky-high water bills triple. And for ultra-wealthy customers undeterred by financial penalties, the district reserves the right to install flow restrictors quarter-size disks that make it difficult to, say, shower and do a load of laundry at the same time. In extreme cases, the district could shut off the tap altogether. The restrictions are among the toughest in the state, and residents of Rancho Santa Fe are feeling aggrieved. \"I think were being overly penalized, and were certainly being overly scrutinized by the world,\" said Gay Butler, an interior designer out for a trail ride on her show horse, Bear. She said her water bill averages around $800 a month. - - -, \"It angers me because people arent looking at the overall picture,\" Butler said. \"What are we supposed to do, just have dirt around our house on four acres?\", Rancho Santa Fe residents are hardly the only Californians facing a water crackdown. On Friday, the state said it would impose sharp cutbacks on senior water rights dating back to the Gold Rush for the first time in four decades, a move that primarily hits farmers. And starting this month, all of Californias 400-plus water districts are under orders to reduce flow by at least 8 percent from 2013 levels. Top water wasters such as Rancho Santa Fe are required to cut consumption by 36 percent. Other areas in the 36-percent crosshairs include much of the Central Valley, a farming region that runs up the middle of the state, and Orange County, a ritzy Republican stronghold between San Diego and Los Angeles. \"I call it the war on suburbia,\" said Brett Barbre, who lives in the Orange County community of Yorba City, another exceptionally wealthy Zip code. Barbre sits on the 37-member board of directors of the Metropolitan Water District of Southern California, a huge water wholesaler serving 17 million customers. He is fond of referring to his watering hose with Charlton Hestons famous quote about guns: \"Theyll have to pry it from my cold, dead hands.\", \"California used to be the land of opportunity and freedom,\" Barbre said. \"Its slowly becoming the land of one group telling everybody else how they think everybody should live their lives.\", Jurgen Gramckow, a sod farmer north of Los Angeles in Ventura County, agrees. He likens the freedom to buy water to the freedom to buy gasoline. \"Some people have a Prius, others have a Suburban,\" Gramckow said. \"Once the water goes through the meter, its yours.\", Yuhas, a gay, disabled Marine veteran who hosts a conservative talk-radio show, abhors the culture of \"drought-shaming\" that has developed here since the drought began four years ago, especially the aerial shots of lavish lawns targeted for derision on the local TV news. \"Im a conservative, so this is strange, but I defend Barbra Streisands right to have a green lawn,\" said Yuhas, who splits his time between Rancho Santa Fe and Los Angeles. \"When we bought, we didnt plan on getting a place that looks like were living in an African savanna.\", - - -, Other are embarrassed by such defiance. Parks of the Sante Fe Irrigation District said she was mortified when the report came out earlier this month showing that Rancho Santa Fe had increased its water use the only community in the region to do so. \"I kind of take it personally,\" she said last week as she toured the community in an SUV bearing the water districts logo. Parks said she doesnt know exactly what happened, but she has heard rumors that some people jacked up their water use in a misguided attempt to increase their baseline before rationing kicks in. With sprinkler restrictions already in place, she said the dynamic between local gardeners and her small team of enforcers is getting interesting. \"Everyone seems now to know what our cars look like,\" she said. In Fairbanks Ranch, a gated community, \"whenever one of our trucks go in, the gardeners all seem to call each other text message each other to let them know that weve arrived. So then all of a sudden we see water kind of draining off the property, but no sprinklers on.\", Because the restrictions that took effect in September didnt register, the district further tightened the screws this month. Sprinkler days were reduced from three a week to two, while car-washing and garden fountains were banned altogether. Holly Manion, a real estate agent who has lived on the Ranch, as its often called, for most of her 62 years, supports the restrictions. While Manion cherishes the landscape of manicured lawns and burbling fountains that have long defined the Ranch, she believes the drought requires a new way of life that emphasizes water conservation. \"Just take a drive around the area. Youll see lakes low, rivers dry and hillsides parched,\" Manion said, adding that she is appalled by people who tolerate leaking sprinklers and the resulting cascades of wasted water. \"There are people, they arent being responsible,\" she said. \"Theyre just thinking of their own lives.\", Ann Boon, president of the Rancho Santa Fe Association, insists that most residents are taking the drought seriously. She said she was shocked by the reported 9 percent increase, arguing that it \"must be some anomaly.\", \"Everybody has been trying to cut back,\" she said. For example, many Rancho Santa Fe residents have enthusiastically embraced drought-tolerant landscaping. Manion took advantage of a rebate to rip out much of the turf on her three-acre property and replace it with succulents and decomposed-granite pathways. She left only a small patch of grass for her two dogs to play on. \"It makes me happy when I look at it, because its thriving,\" she said. Butler said she, too, is replacing grass with drought-friendly native landscaping on her four acres, at a cost of nearly $80,000. (Shell get a rebate for about $12,000.) But she came to the decision grudgingly, she said. And she defends the amount of water she and her neighbors need for their vast estates. \"You could put 20 houses on my property, and theyd have families of at least four. In my house, there is only two of us,\" Butler said. So \"theyd be using a hell of a lot more water than were using.\", Rancho Santa Fe resident Randy Woods was feeling burdened by his lush landscape and opted to downsize. The 60-something chief executive of a biotech company moved a year ago from a two-acre estate replete with two waterfalls, two Jacuzzis, a swimming pool and an orchard to a condo in the tiny core of town known as \"the Village.\", Woods said some of his friends would like to do the same, largely to cut down on their bloated water bills. But they have encountered an unforeseen obstacle, he said: The drought has dampened demand for large estates in San Diego County. Woods said his girlfriend is among those struggling to sell. Her home boasts a yard designed by Kate Sessions, a well-known landscape architect and botanist who died in 1940. But now, the rare palm tree specimens, the secret garden and the turret-shaped hedges are a liability rather than a selling point. Another friend, Woods said, has seen the value of his nine-acre plot plummet from $30 million to $22 million. As for Woods, his monthly water bill has shriveled from $500 to around $50. \"My friends,\" he said, \"are all jealous.\"]", "Date": "20150615", "Author": "[Rob Kuznia]", "Link": "http://www.chicagotribune.com/news/sns-wp-washpost-bc-calif-water13-20150613-story.html", "Title": "[Rich Californians balk at limits: 'We're not all equal when it comes to water']"}