{"Content": "[Wisconsin Gov. Scott Walker says he supported a policytheBoy Scouts of America recently overturned that banned gay leaders for all troops. Im an Eagle Scout. My kids were in Scouts. My mom was a den mother, he told reporters while campaigning for the 2016 presidential election in Las Vegas on Tuesday. I think their previous policy was perfectly fine. The Boy Scouts national committee voted Friday to adopt a resolution that would end the long-standing ban on gay leaders, allowing troops to select leaders without regard to sexual orientation, the organization said in a statement. Walker commented on the policy after an article was posted on IJReview that quoted Walker saying he supported the previous membership policy because it protected children and advanced Scout values. When asked to clarify what Scouts needed protection from, AshLee Strong, spokeswoman for Walkers presidential campaign, said the previous policy protected Scouts from the rancorous political debate over policy issues and culture wars. Scouts should not be used as a political football on issues that can often be heated and divisive. The Boy Scouts National Executive Board will meet July 27 to ratify the resolution. The move comes after Robert Gates, the president of the Boy Scouts of America and former CIA director, has pushed for the organization to re-evaluate its policies toward gay adults. In 2013, the organization began to allow gay Scouts but not leaders. Walker recently drew ire from gay-rights groups by calling the U.S. Supreme Courts ruling to legalize gay marriage nationwide a grave mistake and called for a constitutional amendment to allow states to ban same-sex marriage despite the ruling. T.J. Helmstetter, Midwest press secretary for the Democratic National Committee, called Walkers statement about Boy Scout policy outrageous. His view that children were somehow more protected when the Boy Scouts excluded gay leaders is offensive, outrageous, and out of touch, Helmstetter said in a statement. His comment is not worthy of someone running for president in this country.]", "Date": "20150715", "Author": "[Molly Beck]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-gov-walker-boy-scouts-previous-policy-banning-gay-leaders-was-perfectly-fine-20150715-story.html", "Title": "[Gov. Walker: Boy Scouts' previous policy banning gay leaders was 'perfectly fine']"}