{"Content": "[Just when you thought the saga of lavish spending at College of DuPage couldnt get any richer, it does. The Tribunes Jodi S. Cohen and Stacy St. Clair, who have been reporting on the Glen Ellyn-based college for months, recently discoveredanother pot of money that outgoing President Robert Breuder tapped to satisfy his extravagant tastes. In addition to the college picking up the tab for his expensive bottles of wine and gourmet dinners, the college foundation gave Breuder an allowance. The foundation, which raises money from donors for student scholarships and campus enhancements, paid for at least $57,597 in hunting expenses at a private reserve; a $722 dinner (plus $692 in bar bills); gourmet meals totaling $1,450 during a California trip; along with more than $1,000 for wine and parties. Between July 2010 and June 2014, Breuder charged more than $102,000 in expenses to the foundation. How many students could have been helped with that money?, The money flowed through Breuders allowance, which was for \"leadership cultivation.\" A limo ride, a stuffed pheasant and a rifle for the foundation president were among the items billed as cultivation activities. Lets pause here to reflect on the mission of College of DuPage, the states largest community college: to serve a population of students who cant afford, or dont want, a typical four-year college experience. Donors who write checks to support that mission trusted their donations would be spent judiciously. What a disrespectful use of their money. Foundation officials say Breuders expenses were paid from interest earned on certain gifts to the foundation. In other words, its just free money, folks. Its just interest. Its not actual donations. But that money could have paid for more students to go to school. It could have covered the cost of a program expansion or an additional instructor. It could have been spent prudently. It wasnt. The expenses were on top of the nearly $190,000 Breuder spent in taxpayer money at an on-campus gourmet restaurant. The foundation also spent gobs of money at Waterleaf. What a colossal boondoggle. As a college president, Breuder had responsibilities that included raising money for the foundation. That requires a certain amount of wining and dining. During his tenure, the foundations assets increased to $14.5 million, up from $9.5 million. But that success doesnt justify Breuders unrestrained, unchecked spending sprees. His compensation package as president was worth $484,000 and included housing and vehicle allowances and other perks. His severance package was worth $763,000. The foundation overseen by professionals and volunteers who care deeply about the school should have questioned Breuders vouchers. Period. The fact that they didnt confirms what the Tribunes reporting has shown all along: No one questioned Breuder. He ran the school with an iron fist and spent freely. And everyone around him, including the foundation, enabled him. Foundation officials say they have eliminated the \"leadership cultivation\" allowance. It doesnt exist anymore. Breuder is on paid leave while state and federal investigations into college spending proceed. An interim president is running day-to-day operations. The College of DuPage board of trustees has a new majority that has vowed to be fiscally prudent and to hold the foundation accountable which includes examining questionable contracts between the college and foundation board members. And the Illinois General Assembly passed legislation limiting severance packages and making them public. Gov. Bruce Rauner should sign those bills. Meanwhile, the investigations by law enforcement are ongoing. We hope that theyll reveal, soon, whether any laws were broken. Breuder is not charged with any wrongdoing, and we offer no opinion on that or whether he was merely greedy and the previous board negligent. To the latter question, we already know the answer. Follow theTribune Editorial Boardon Twitter@Trib_ed_boardandFacebook]", "Date": "20150710", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-dupage-college-breuder-foundation-scandal-edit-0713-jm-20150710-story.html", "Title": "[Another College of DuPage outrage: When scholarship donations pay for parties]"}