{"Content": "[WASHINGTON To contain a surge in drug-related deaths in the U.S. state and local governments are pouring money into programs to make an overdose antidote more widely available even as prices rise -- creating a growth opportunity for manufacturers. Naloxone, approved by regulators decades ago, has gone up tenfold in price in recent years, making the drug more lucrative. Thats led police, emergency responders and schools to seek government subsidies to acquire the medication. At least two companies are awaiting approval to enter the market this year with nasal-spray versions, competing with four that already make an injectable drug. A kit to turn one of the most popular versions of the antidote into a nasal spray currently costs about $45 per dose, including $30 for the medicine. About 16,000 Americans die each year after taking too many opioid painkillers, such as OxyContin or Opana, and an additional 8,000 died in 2013 after overdosing on heroin, another opioid -- a fivefold increase from 2001. That has led to a national campaign by advocates of addiction treatment to make naloxone more widely available as an emergency aid. The White House has proposed $12 million in the 2016 budget for state grants to fight opioid overdose-related deaths, including money to buy naloxone and train emergency responders on how to use it. Some states have passed laws to make it easier for private citizens to get naloxone, such as family members of addicts. And manufacturers, envisioning a market where every household keeps an emergency supply of the drug, are advocating for even wider distribution. \"We believe that there is a huge potential if doctors who prescribe pain medication were to write companion scripts for intranasal naloxone,\" Jason Shandell, president of Amphastar Pharmaceuticals Inc. said in an e-mail. \"Although it may never be used, people should keep intranasal naloxone in their medicine cabinet just in case a family member or friend experiences an overdose due to pain medication, etc.\", Naloxone kits were distributed to almost 100,000 drug users, friends or family from 2010 to June 2014, compared with just over 50,000 in the decade and a half before, according to the Centers for Disease Control and Prevention. This resulted in 26,463 overdose reversals between 1996 and June 2014. Local overdose prevention programs in the U.S. provide naloxone kits to private citizens at 600 sites nationwide, as at least 30 states and the District of Columbia have passed laws to increase access to the antidote. The drug works by sending molecules into the body to attach to opioid receptors in cells, preventing them from responding to the drug. When used correctly, the antidote is considered very effective. Massachusetts officials found naloxone was successful in 98 percent of rescue attempts, according to a study published in 2013 in the medical journal BMJ. Amphastar has been one of the biggest beneficiaries of the surge in demand for naloxone. For police departments and addiction treatment groups, the companys injectable version of the drug is the right concentration for retrofitting with an attachable atomizer to create a nasal spray. Naloxone helped boost Amphastars revenue from fully manufactured drugs by 41 percent in the second quarter from a year earlier to $30.6 million, excluding a blood-clot medication whose sales the company discloses separately. A dose of injectable naloxone costs about $30 -- up about 1,000 percent from 15 years ago, according to Daniel Raymond, policy director for the advocacy group Harm Reduction Coalition. Prices have skyrocketed in part because a field with fewer competitors has reduced pressure on companies to keep prices down. The drug has been made at one time or another by as many as a dozen companies since Endo International Plc received FDA approval for the brand-name version, Narcan, in 1971. While the drug has been around for decades and was familiar to doctors, it has gotten more attention from lawmakers as opioid-related deaths began to skyrocket in the past few years, especially in major cities on the East Coast and in Appalachia. Amphastar is developing a ready-made nasal spray, and Shandell, the president, declined to comment on pricing plans. Raymond said he expects the two other companies that are now seeking approval for naloxone nasal sprays, Indivior Plc and Adapt Pharma, to set prices for their products similar to the intranasal kits currently on the market. Still, the arrival of new manufacturers may eventually lead to price competition. And it comes just as governments start pushing for steeper discounts in exchange for buying large quantities of the drug. New York Attorney General Eric Schneiderman cut a deal with Amphastar in January to get a $6 rebate on every naloxone injection purchased. Two U.S. lawmakers -- Sen. Bernie Sanders, an independent from Vermont, and Rep. Elijah Cummings, D-Maryland -- wrote state officials in July and urged them to follow New Yorks lead. The idea is to prevent the deaths of people like Greg Humes, who was found in 2012 in his parked car at a hospital in Pennsylvania, two months shy of his 25th birthday. If only the friends who left him there had had access to naloxone, the young man might still be alive, the detective investigating the case later told his father. Pennsylvania adopted a law a year ago that allows first responders and friends and family of users to carry naloxone. Since November, 27 out of 67 county police departments, along with state police, carry or will soon carry naloxone. Thats led to 289 drug overdose reversals as of the end of August. After his sons death, David Humes became an advocate for wider naloxone access. This year on May 19, the three-year anniversary of his sons death, he sat down to an e-mail from the captain of the New Castle County Police Department in Delaware. The e-mail said: \"I just want to let you know our department just made its first save with naloxone.\"]", "Date": "20150908", "Author": "[Anna Edney, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-naloxone08-20150908-story.html", "Title": "[As overdose deaths climb, so does demand for their antidote, naloxone]"}