{"Content": "[Toppling a dictator can be an exhilarating experience, and millions of soccer fans around the globe are celebrating FIFA President Sepp Blatters resignation announcement. But the departure of a corrupt regimes leader does not, by itself, rehabilitate structures of governance. So as FIFA prepares to replace Blatter via a new election in the coming months, what can be done to reform the governing body of the worlds most popular sport?, The revelation of kickbacks and bribes in the U.S. Justice Departments indictment, though provocative, does not amount to a comprehensive analysis of FIFA. Happily, just such a report does exist; in fact, FIFA commissioned it. In 2012, FIFA appointed former U.S. Attorney Michael Garcia to investigate corruption allegations. But when he produced a book-length report surveying the rot, FIFA quashed it. The first step for a Blatter-free FIFA would be to publish Garcias report. Next, should FIFA be reformed, or would a new institution be more effective?, Models for a replacement organization include the European soccer federation, the United Nations and the International Olympic Committee. But they have their own serious problems, and building an entity from scratch would take enormous resources. As unsavory a task as it will be, fixing soccer should be done by fixing FIFA. After Blatters recent re-election to a fifth term, many criticized FIFAs practice of giving each of its 209 member countries an equal vote. The idea that Montserrat (population less than 5,000) and China (population more than 1.35 billion) have an equal vote is troubling. Blatters ability to sprinkle millions of dollars across tiny islands in the Caribbean and South Pacific contributed to his sustained electoral success, even amid the howling gale of scandal. But FIFAs system of equal representation with its guarantee of pork-barrel politics provides basic fairness. If we jettison it, we would lose what little involvement we have from all corners of world soccer. The sport is already dominated by the domestic leagues of Europe, whose teams collect the worlds best players. At the last World Cup, 563 of 736 participants played club soccer in Europe. If FIFAs voting system were proportioned instead on population, gross domestic product or trophies won, Europes hegemony over the sport would be even greater. But FIFAs presidential rules certainly can be improved. The last three FIFA presidents have served an average of 18 years. So, lets start with term limits to disrupt corruption and complacency. Require open ballots in elections. And publish the presidents salary, so we can all see why an octogenarian kept gorging at the trough. The most troublesome FIFA practices were those highlighted in the attorney generals indictments: the corrupt ways it selected tournament hosts and awarded broadcasting rights. Much of the recent furor arises from allegations that South Africa paid a $10 million bribe to host the 2010 World Cup. Russia, which won the bid for 2018, has been accused of giving Picassos to its supporters. Allowing Qatar to host the 2022 World Cup in 110-degree summer heat was perhaps the most glaring clue that something was rotten at FIFA. Qatars event would be farcical if the deaths of migrant workers building its stadiums werent so tragic. The Russian tournament may be too soon and, perhaps, too political to change now. Certainly the Qatar tournament should be re-bid. If Qatars bid is superlative, it can surely survive a more transparent bidding process. FIFA should adopt open voting and expand the size of the selection committee to make corruption more difficult. Finally, to cleanse the billions of dollars that flow through favored cronies, FIFA should audit its auditor. KPMG conducted FIFAs annual audits but clearly missed a great deal. Rigorous audits might not extinguish corruption, but they will certainly make it harder to hide. FIFA apologists give condescending lectures about how the culture in so much of the world is irredeemably corrupt. Perhaps so, but no organization on Earth has FIFAs power to insist that its business be conducted with the exactitude of a Swiss watch. Abebe is a professor at the University of Chicago Law School. Birdthistle is a professor at IIT Chicago-Kent College of Law. ]", "Date": "20150607", "Author": "[Daniel Abebe, William Birdthistle]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-fifa-soccer-blatterqatar-scandal-corruption-perspec-0608-20150607-story.html", "Title": "[Making the beautiful game beautiful again ]"}