{"Content": "[One of the worlds testier strategic relationships is deteriorating by the day as Afghanistan accuses Pakistan of meddling in its affairs and prolonging a 14-year war by aiding Taliban militants in a cynical quest for influence. Pakistan, which hosts masses of Afghan refugees, denies the charge and says it cannot be expected to monitor the movement of Afghan militants back and forth across border regions barely under the control of Islamabad. This has been a longstanding issue between the two neighbors but a recent uptick in stridency is striking and dangerous at a time when the Taliban seem to grow more militant and NATO has pulled its combat troops from Afghanistan. It also represents a reversal of the relatively optimistic outreach that Afghan President Ashraf Ghani launched when he took office a year ago. The relentless continuation of Taliban attacks and the surge in violence that followed the transfer of security control from NATO to Afghan forces at the end of 2014 seems to have exhausted Ghanis patience. After a series of deadly attacks earlier this month in the Afghan capital, Ghani accused Pakistan on live TV of being the source of the violence in his country. \"The decisions the Pakistani government will be making in the next few weeks will significantly affect bilateral relations for the next decades,\" Ghani said at the time. \"We can no longer tolerate watching our people bleeding in a war exported and imposed on us from outside.\", Amid the rhetoric, the basic facts are not in dispute: leaders of the Taliban have been based in Pakistan in Quetta, Peshawar and Karachi since the U.S.-led invasion in 2001 toppled their regime and forced them to flee. Recent events also have made clear the extent of Pakistans influence over the group. Taliban leaders direct the war from Pakistani soil, and send gunmen and suicide bombers, weapons and money across the border every year for the Taliban summer offensive. This year, the warm-weather offensive has been particularly ferocious, following the NATO drawdown. On Tuesday, Pakistans ambassador to Kabul, Syed Abrar Hussain, was summoned to hear a complaint about border shelling, Afghan Foreign Ministry spokesman Ahmad Shekib Mostaghni confirmed. A day later on Afghan Independence Day Afghan Ambassador Janan Mosazai was summoned by Pakistans foreign ministry, where he heard a protest about a \"recent spate of Afghan governments allegations and media campaign to malign Pakistan,\" a ministry statement said. The \"allegations undercut mutual confidence and affect the environment of bilateral relations that both countries had been working hard to improve,\" said Pakistans foreign secretary, Aizaz Ahmad Chaudry. Earlier, Ghani had told Kabul-based ambassadors that Pakistan \"has three options: freeze, deep freeze or hostility\" if it failed to reign in the Taliban, according to three people who were present at the meeting, including two ambassadors. All spoke on condition of anonymity because they were not authorized to talk to the media. \"We are at freeze,\" said one of the ambassadors. \"Relations could still go down for instance, if there is a new bombing in Kabul.\", The diplomat said that unless the Pakistanis \"deliver what they are saying they are willing to do, to combat terrorism and extremism,\" Afghanistans allies could ask the United States and the world to classify Pakistan as a provider of \"sanctuary to terrorists.\", Such a classification could lead to diplomatic and financial isolation for Pakistan and complicate its relationship with other partners, like China, as well as global lenders and credit rating agencies. Ghanis recent harsh rhetoric appeared to have been sparked by the apparent failure of a high-level delegation sent last week to Islamabad to work out an \"action plan\" for ending the war. The group returned empty-handed. Earlier this year, Ghani sent Pakistani Prime Minister Nawaz Sharif an eight-point proposal, extracts of which have been seen by The Associated Press, in which he said that both countries were engaged in an undeclared war. The letter also called on Islamabad show its commitment to peace by placing Taliban leaders under house arrest, withdrawing rights extended to Taliban figures such as freedom of movement and access for fighters to medical care and curtailing the activities of the Haqqani network, arguably one of the most brutal terror groups in the region. Mostaghni, the Afghan spokesman, said Kabul is still hoping to receive a response to these points \"very soon.\", Pakistani political analyst Mahmood Shah said that Islamabad \"must address the concerns and frustration\" of Ghani and better explain that \"some elements want to disrupt the fledging peace process.\", The tensions come at a particularly volatile time, as leaders of the Afghan Taliban grapple with leadership turmoil that has engulfed the group since last months revelation that the insurgents one-eyed leader Mullah Mohammad Omar has been dead for over two years. The Taliban are under diverse pressures on one hand, they are trying to cement ties to al-Qaida and other militant groups, and on the other, respond to the challenge as some radicals become increasingly seduced by the even more brutal tactics and clear aims of the Islamic State group, which is trying to extend east from its base in Syria and Iraq. In this environment, leaders representing different degrees of Taliban militancy are struggling to emerge supreme and the insurrection inside Afghanistan continues unabated, with almost 5,000 civilian deaths so far this year. Taliban leaders have been meeting in the Pakistani city of Quetta, with some members of the group saying that more than 1,000 loyalists, including battlefield commanders, have gathered to see the dispute resolution through, with expected deadlines being pushed further and further back. This, too, has angered Kabul, which accuses Pakistan of failing to take action against \"those groups holding gatherings in public and declaring war against the Afghan people,\" said Ghanis deputy spokesman Zafar Hashemi. Analysts say Pakistans motivation in harboring insurgents is to influence its strategically located neighbor, and to keep Indian and Iranian interests out. Mullah Akhtar Mansour, named as successor to Mullah Omar, has been endorsed by al-Qaida chief Ayman al-Zawahri, cementing links between the two groups. One of Mansours deputies is Sirajuddin Haqqani, a leader of the Haqqani network, which is also linked to al-Qaida. An Afghan security official, who spoke on condition of anonymity because he is not authorized to talk to reporters on the topic, said agents from the Pakistans Inter-Services Intelligence, the military-backed spy agency, are also in Quetta to ensure that Mansour who does appear to be consolidating power retains the post despite opposition from Mullah Omars family. Pakistan has made no comment on the allegation. Observers say Mansour has been in charge all along, playing a double game entering into a putative and largely unofficial dialogue with Kabul, some believe at the behest of the Pakistanis, while also intensifying the fighting inside Afghanistan. After a first round of official, face-to-face Kabul-Taliban talks were held in Pakistan in early July, the process has been shelved indefinitely following the announcement of Mullah Omars demise. In Islamabad, foreign ministry spokesman Qazi Khalilullah told reporters on Thursday that Pakistan was still committed to supporting and facilitating an Afghan-led and Afghan-owned peace and reconciliation process with the Taliban. \"It it is up to Afghans to decide about further steps in this regard,\" he said. \"In our view, wisdom lies in the continuation of the peace process.\", Associated Press]", "Date": "20150821", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-afghan-pakistan-relationship-20150821-story.html", "Title": "[ Afghan ties with Pakistan sour as Taliban gain strength ]"}