{"Content": "[Hillary Rodham Clinton said Saturday that she remains hopeful the U.S. can reach a \"strong verifiable deal\" to curb Irans nuclear weapons program by next weeks deadline. The Democratic presidential front-runner said during a July Fourth campaign organizing event in northern New Hampshire that she hopes U.S. and its allies can clinch a deal that would halt Irans nuclear ambitions. \"Im hoping its a strong, verifiable deal that will put the lid on Irans nuclear weapons ambitions,\" Clinton said. \"Even if we are successful, however, Irans aggressiveness will not end.\", As President Barack Obamas secretary of state, Clinton helped set in motion the talks that are nearing completion in Vienna. The proposal has been assailed by Republican presidential candidates who say it does not go far enough to prevent Iran from obtaining nuclear weapons, setting up a potential foreign policy clash in the election campaign. Clinton said Iran ramped up its nuclear capabilities during President George W. Bushs two terms, building covert facilities and intimidating its neighbors. \"The Bush administrations response through diplomacy was somewhat half-hearted,\" Clinton said, adding the \"only response\" was leveling punitive sanctions on Iran. Once Obama entered the White House, \"we inherited an Iranian nuclear weapons program and we had to figure out what we were going to do about it,\" Clinton said. An agreement, however, would not be a cure-all, she said. \"Just because we get the nuclear deal, if we can get it done, doesnt mean were going to be able to be breathing a big sigh of relief,\" Clinton said. Clinton also said that China was \"trying to hack into everything that doesnt move in America ... stealing huge amounts of government information all looking for an advantage.\", Clinton later marched in a parade in Gorham, New Hampshire. When one woman asked her about Obamas health care overhaul, Clinton said she would embrace it. \"Im going to not only defend it, Im going to make it even better,\" she said. During the house party in Glen, Clinton also spoke about her ideas to address college debt, her views of the Supreme Courts gay marriage ruling and the future makeup of the court, during an hour-long event with supporters. Clinton offered a preview of the plan she is expected to release to address college affordability. College graduates and those with graduate degrees should get help to refinance their debt and be allowed to pay back their loans as a percentage of their incomes, she said, adding a personal reminiscence about the money she and her husband, former President Bill Clinton, borrowed for higher education. \"We were paying back loans while he was governor of Arkansas,\" Clinton said. Clinton encouraged people to read the Supreme Courts decision extending same-sex marriage rights nationwide, saying the majority opinion written by Justice Anthony Kennedy is \"almost mystical. Its beautiful.\", Asked about the future of the court, Clinton said it was possible the next president could have three to four appointments. If elected, she said she would appoint justices to the high court who would \"bring an open mind and an open heart.\", Associated Press]", "Date": "20150704", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-hillary-clinton-iran-20150704-story.html", "Title": "[Clinton: Hopeful U.S. can reach 'verifiable deal' with Iran ]"}