{"Content": "[Michael J. Stenger will become president and CEO of the Franciscan St. Margaret Health campuses in Dyer and Hammond and Franciscan Healthcare Munster on Wednesday. \"I am excited about this opportunity to lead these institutions with such long and proud histories and greatly appreciate the support of Franciscan Alliance and the Sisters of St. Francis of Perpetual Adoration,\" Stenger said in a statement. \"I am deeply committed to ensuring that both Franciscan St. Margaret and Franciscan Munster thrive in this new health care age so they can continue to provide quality care to those in our care.\", Before accepting his post with Franciscan Alliance, Stenger was a Quorum Health Resources regional vice president in charge of 10 non-profit community hospitals in the Midwest, including in Indiana and Illinois, helping hospital management teams develop and implement strategies to adapt to todays health care reform environment. \"Mr. Stenger brings vast experience with non-profit, for-profit and faith-based health systems and an energetic, focused and results-oriented leadership style to Franciscan St. Margaret and Franciscan Munster,\" said Franciscan Alliance president and CEO Kevin Leahy in a statement. \"His outstanding track record of strategic development, operational expertise and staff and medical staff team building will be a great asset to our campuses in Dyer, Hammond and Munster.\", The Franciscan St. Margaret Health post was previously held by Thomas Gryzbek, who is now a corporate senior vice president charged with overseeing the systems post-acute services, while Barbara Anderson, former president of Franciscan Healthcare-Munster, is now president and CEO of Franciscan St. Anthony Health-Crown Point. Stenger has spent 16 years in key leadership positions with leading Catholic health care systems, including Centura Health in Colorado, Hospital Sisters Health System in Illinois and Wisconsin, and Franciscan Sisters of the Poor in Ohio. He also worked for Humana, now part of Hospital Corporation of America. He is graduate of the University of Notre Dame, with a masters degree in Health Administration from Xavier University. Stenger and his wife Marion have two daughters, Anna and Tess. \"Mr. Stengers previous success in operating a large number of hospitals within Catholic health care ministries will benefit the patients we are privileged to serve, our physicians, and co-workers,\" said Sister Jane Marie Klein, chairwoman of Franciscan Alliance, in a statement.]", "Date": "20150630", "Author": "[Post-Tribune staff report]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-stenger-franciscan-ceo-st-0630-20150630-story.html", "Title": "[New president named for 3 Franciscan hospitals]"}