{"Content": "[Here are the five things Im watching between now and Halloween in the 2016 presidential contest. Boo!, 1. Will any Republicans drop out? Rick Perry, Chris Christie and Bobby Jindal fit the profile of an early-exit candidate (or it could even be a rival who appears to be doing better right now). If that happens, it would be a sign that the natural winnowing of candidates is working the way it has for decades. Though Norm Ornstein speculated on Friday that \"maybe this time really is different,\" its more likely the trailing candidates will follow recent patterns and drop out. 2. Will Republican party actors -- the insiders and others who wield influence -- finally pick a horse, or perhaps two or three? The partys choices are what matters in deciding who eventually wins the nomination, and have been since the mid-1980s. So far, weve seen only a trickle of such commitments. Hillary Clinton has far more congressional and gubernatorial endorsements than all 17 Republicans put together. Sooner or later, leading Republicans will have to choose. It doesnt have to be before the Iowa caucuses, but usually this group is well along in making a decision before voters get involved. After all, leaving it up to the primaries and caucuses without guidance from party opinion leaders is risky to the party. 3. Will any of Clintons supporters defect? If they do in any significant numbers, thats how well know the nomination will be open (the Wall Street Journals James Taranto is correct about this). But just because a lot of people (the press, Republicans, even perhaps rank-and-file voters) are concerned about the continuing scandal over her emails, for example, it doesnt mean Democratic politicians, donors, interest-group leaders and other party actors will be worried enough to jump ship. (A historical parallel: Back in 1987, many believed the Iran-Contra scandal, which knocked 15 points off Ronald Reagans approval ratings, would be the end of George H.W. Bushs hopes. Republicans ignored it and nominated the vice president anyway.), 4 and 5. How is Barack Obama doing, and how is the economy doing? Candidates, campaigns and the issues arent irrelevant to election outcomes. But theyre less important than whether people are looking to throw the bums out or not, and the two most important indicators of this are found in presidential approval ratings and economic statistics. Right now, both point to a fairly close election, perhaps with a small advantage for the Republican ticket. But as todays stock-market turmoil reminds us, its still early. Ill be looking at all the polls, I admit. But I know even the Iowa and New Hampshire voter surveys arent going to tell us anything until around Thanksgiving (and general-election polling isnt predictive until well into 2016). Ill also listen to what the candidates say and watch their debates. Ill follow political advertising and look at patterns in ad buying. Yes, Ill pay attention to Donald Trump. But these factors arent going to be as reliable an indicator of who will win the White House as the answers to the five questions above. *****, , Jonathan Bernstein is a Bloomberg View columnist covering U.S. politics. For more columns from Bloomberg View, visit http://www.bloomberg.com/view ]", "Date": "20150824", "Author": "[Jonathan Bernstein, Bloomberg View]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-campaign-indicators-comment24-20150824-story.html", "Title": "[Five leading indicators for the 2016 race]"}