{"Content": "[A new five-star rating system for home health agencies gives Illinois consumers a chance to see how nearly 700 agencies in the state perform at helping patients regain mobility, stay out of hospitals and meet other goals. The star ratings, created by the Centers for Medicare & Medicaid Services and released Thursday, are meant to bring clarity to a fast-growing but fragmented sector of the medical industry where its often difficult to distinguish good from bad. A new five-star rating system for home health agencies gives Illinois consumers a chance to see how nearly 700 agencies in the state perform at helping patients regain mobility, stay out of hospitals and meet other goals. Adrian Pintea, president and CEO of Chicago-based Aspen Home Health Care, attributed the agencys 4-star rating to the personal and immediate care he and his team give to patients. Nationally, about 3.4 million Medicare beneficiaries received services at home from nurses, aides, and physical and occupational therapists last year. The federal agency requires doctors to approve skilled services and does not cover housekeeping care. The government doled out the highest and lowest ratings sparingly, with nearly half of the 9,000 rated agencies receiving scores of three or 3 stars. In Illinois, 43 percent of the 689 agencies to be rated got three or 3 stars, while 27 percent received 2 stars or fewer and 30 percent received four stars or more. \"I think were like most states,\" said Rebecca Zuber, regulatory consultant for Illinois HomeCare and Hospice Council. \"We have some troubled providers and we have some very, very good providers.\", Chicago agencies that received the fewest stars blamed the low ratings on their willingness to take the sickest patients. Some people are never going to succeed at getting out of bed, moving around or bathing themselves three of the nine categories Medicare used to calculate the star ratings, said Nelson Hodogbey, president and CEO of Chicago-based Medex Home Healthcare, which received 1 stars. The criteria were drawn from 29 individual ratings that Medicare has provided for years, though the data are not always easy to interpret. Stars also reflect measures of how quickly the home health agencies began care, how often agencies made sure patients received annual flu shots and how often patients had to be admitted to a hospital. Mabel Osaghae, director of nursing at Ultimate Home Health Care in Chicago, an agency that received two stars, said some patients have a habit of calling 911 when they fall or experience shortness of breath, contributing to higher hospitalization rates and a lower star rating. \"We are aware of where we are, and we are doing everything to see that we have some improvement,\" Osaghae said. \"Some things just may remain the same, but we are trying.\", Assessing quality of home health agencies can be challenging even for doctors, who often must authorize the visits just as patients are leaving the hospital. Elderly people and their caregivers tend to be less familiar with the reputation of home health agencies than with those of hospitals and other institutions. \"Its not like a nursing home, where you can go and walk around,\" said Dr. Cheryl Phillips, an executive at LeadingAge, an association of nonprofit groups focused on the elderly. \"You can call the agencies and find out a little bit about them and their philosophy of care, but even for an informed consumer like me, youre kind of stuck with whatever your physician has ordered.\", Experts said the ratings could have a substantial financial effect on agencies, even driving some low-rated ones out of business. Hospitals, doctors and nursing homes may be reluctant to refer patients to agencies with fewer than three stars. A total of 2,628 agencies 28 percent of those Medicare evaluated received those ratings. \"Its a very fragmented, competitive market in a lot of metropolitan areas,\" said Lilly Hummel, a manager at Avalere, a health care consulting firm in Washington, D.C. \"It could get difficult for home health agencies that, for whatever reason, arent doing well on the star ratings.\", Medicare intends eventually to pay bonuses and penalties to agencies based on performance, as it does for hospitals. Adrian Pintea, president and CEO of Chicago-based Aspen Home Health Care, attributed the agencys 4-star rating to the personal and immediate care he and his team give to patients. \"We accept referrals and provide answering services around the clock,\" Pintea said. \"Im the director of nursing, and I sleep with the phone on my pillow kind of stressful, but its nice. I enjoy what I am doing.\", Mike Lennon, administrator at Wailai Home Health Services, said he was surprised his company was one of two in Chicago that received the highest possible rating of five stars. He said the companys president, Esther Takang, often visits patients herself, even if they received a home visit hours earlier. \"She has kept so many people out of the hospital, its incredible,\" Lennon said. \"Its pretty demanding work, really.\", For both the government and patients, Medicares home health visits are one of the least expensive ways to provide care. Medicare spends about $18 billion per year on the home health benefit; in Illinois, Medicare spent $1 billion on home health services in 2013. Eleven percent of Medicare beneficiaries in Illinois 179,423 people used home health services that year, federal records show. More than 12,000 home health agencies take Medicare, including local for-profit shops with just a few employees, nonprofit associations of nurses, hospital affiliates and subsidiaries of publicly traded corporations like Kindred Healthcare and Amedisys. Medicare assigned stars to all but 2,902 agencies that did not have enough patients to evaluate, had only started business recently or did not provide enough data. In Illinois, 96 agencies were not rated. Among those Medicare did rate, 46 percent of agencies nationally received three or 3 stars. Medicare gave the top rating of five stars to 239 agencies, while 195 agencies received 1 stars. Only six agencies received a single star. \"What this indicates to us is a large proportion of home health agencies are performing reasonably well,\" said Dr. Kate Goodrich, who directs the quality measurement program at the Centers for Medicare & Medicaid Services. A Kaiser Health News analysis of the ratings found there was a wide variation in scoring among types of providers. Visiting nurse associations and agencies with religious affiliations tended to get the most stars. Home health agencies run out of skilled nursing homes and agencies run or paid for by local governments tended to perform poorly. Some in the home health industry are welcoming the ratings, but there is concern that consumers will interpret the scores differently than Medicare intends. The government considers agencies with three stars to be solid performers, but in rankings for restaurants, hotels and other common services, a three-star rating is often interpreted as mediocre. \"It kind of equates us to a hotel, and its not the same,\" said Carrie Koenig, an executive at MedStar Visiting Nurse Association, which serves people in Maryland, Virginia and Washington and received 3 stars. \"I dont know how confusing that will be for consumers.\", Another concern is that many of the quality results are self-reported by home health agencies. Medicare publishes the results of patient surveys but did not include those in the star ratings. Agencies will be assigned stars for patient satisfaction starting in January. This story was produced in partnership with Kaiser Health News, an editorially independent program of the Kaiser Family Foundation. Venteicher and Rodriguez are Tribune reporters. Rau is a staff reporter for Kaiser Health News. wjventeicher@tribpub.com, mmrodriguez@tribpub.com, Twitter @wesventeicher, Twitter @merjourn]", "Date": "20150717", "Author": "[Wes Venteicher, Meredith Rodriguez]", "Link": "http://www.chicagotribune.com/news/ct-home-health-star-ratings-met-20150716-story.html", "Title": "[Home health agencies get star ratings from Medicare]"}