{"Content": "[More of the unstable rail embankment supporting the CTA Yellow Line needs to replaced than first thought, the Tribune was told Tuesday, as investigators and backhoe operators continued to dig for answers into the cause of the collapse. Service on the entire Yellow Line will remain suspended until October as crews also repair wastewater treatment lines damaged when part of the wall of earth under the tracks broke loose six weeks ago. Officials from the Metropolitan Water Reclamation District of Greater Chicago, which operates the sewage treatment plant in Skokie where the accident occurred, said Tuesday during a Tribune visit to the accident site that the age of the original embankment is at issue, although the breach was triggered by construction. The remediation work entails excavating thousands of yards of dirt that were compressed to create the embankment in the early 1900s, said Joe Kennedy, managing civil engineer for the water district. New materials, including a larger amount of interlocking stones in the soil mixture, are being used \"to make sure everything is secure,\" he said. He said \"soil mechanics,\" although greatly improved over the last 100 years, is still \"not an exact science., \"We are exercising an abundance of caution by taking out more of the old embankment, because the jury is still out on the cause of the collapse, Kennedy said. The new embankment running through the water districts property \"will be better than it was before, he assured, while behind him construction shovels scooped up dirt and lifted it onto waiting dump trucks to cart it away. The district will also reduce the embankments steep slope for about 250 to 300 feet to help keep the newly compacted dirt in place, officials said. Trains have not traveled along the Yellow Line since late May 17, when a CTA rail operator noticed power lines were knocked out of position, officials said. CTA rail inspectors then discovered that a section of the embankment, which is between Howard and Oakton streets and west of McCormick Boulevard, had failed. Initially, some CTA officials predicted that the Yellow Line, which carries 2,900 riders on an average weekday, would likely be closed for only several weeks. Commuters who normally use the Yellow Line, which runs almost 5 miles between the Howard Street terminal in Chicago and Dempster Street in Skokie, are being served by free shuttle buses until October, a trip that adds about 20 minutes each way, riders have complained. Some have asked why getting service restored sooner hasnt been made a top priority. Kennedy said crews are working two 12-hour shifts, six days a week. CTA President Dorval Carter Jr. said he has been \"very aggressive in his discussions with the water district about restoring Yellow Line service at the earliest date possible. \"I do take it as a top priority, Carter said Tuesday. But \"the work they have to do there is a very complicated process., Carter said the CTA is working on a financial agreement with the water district to reimburse the transit agency for the damage to the embankment and tracks and the cost of providing free shuttle bus service. Asked whether the matter could end up in court, Carter said, \"Im not overly concerned about the need to pursue a lawsuit., The CTA has already agreed to a water district decision to connect a disinfection treatment facility under construction to the existing water plant before the Yellow Line rail bed is turned over to the transit agency for track repairs. No work was taking place May 17, a Sunday, when the compromised embankment was discovered, officials said. But the water districts contractor, Walsh Construction Co. and Walsh subcontractors were building the $60 million disinfection facility when the embankment was breached, said water district spokesman Dan Wendt. \"This situation wasnt a natural occurrence. It wasnt caused by some general deterioration of the embankment, Carter said. jhilkevitch@tribpub.com, Twitter @jhilkevitch]", "Date": "20150630", "Author": "[Jon Hilkevitch]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-cta-yellow-line-embankment-collapse-met-0701-20150630-story.html", "Title": "[Yellow Line repairs more complicated than thought, CTA says]"}