{"Content": "[If I am a government official who wants a job for his son and you are a mayor who wants a road project for his city, I can promise you the needed funds in exchange for appointing Junior as public works director of Happy Town knowing I have not committed a criminal act. I say that because a three-judge panel of the U.S. Appeals Court in Chicago made that point clear in its ruling this week in the case of United States of America vs. Rod Blagojevich. Most of the publicity surrounding the 23-page decision surrounded the court dismissing five counts of criminal misconduct against our former governor and upholding 13 others, meaning that Blagojevich will remain in a federal prison. But in their decision, the judges ended up justifying the sort of contemptible, backroom political deals that are commonplace in this state. Maybe they, like our elected leaders, have been infected by the culture of corruption that another convicted former governor, George Ryan, once referred to as infesting Illinois. In my reading of the decision, the judges make it clear that Blagojevichs request for a Cabinet seat in the administration of Barack Obama, if he were to appoint Obamas choice to replace him in the U.S. Senate, violates no law, although Blagojevich stood to financially benefit from the proposed transaction. The appeals court judges (Frank Easter brook, Michael Kana and Liana Diamond Rover) refer to this type of deal as political logrolling, the promise to swap one political act for another official act. \"Representative A agrees with Representative B to vote for milk price supports if B agrees to vote for tighter controls on air pollution,\" the federal judges state. \"A President appoints C as an ambassador, which Senator D asked the President to do, in exchange for DJs promise to vote to confirm E as a member of the National Labor Relations Board. Governance would hardly be possible without these accommodations, which allow each public official to achieve more of his principal objective while surrendering something about which he cares less, but the other person cares more strongly.\", While many of us might find such deals ethically offensive, Im guessing most of us can agree with the logic. The judges said they asked the government during oral arguments in the Blagojevich appeal whether logrolling had been the basis for a criminal conviction in the history of the United States, and prosecutors could come up with no examples. The word \"logrolling,\" by the way, goes back to the time in this country when frontiersmen, in efforts to clear their land, would ask neighbors to help them roll logs off their property. It was easier to perform this chore with the help of a neighbor and, in exchange, you would help a neighbor clear his land. So political logrolling, in its purest sense, would mean elected officials working together to achieve a goal thats mutually beneficial. But the judges a few pages later go into further detail about the types of shady deals that fail to violate any law. The direct payment of money in exchange for a vote would be a bribe, especially if the solicitation for the bribe were made \"corruptly.\", \"Corruptly,\" the judges say, \"refers to the recipients state of mind and indicates that he understands the payments as a bribe or gratuity. However, \"it would not be plausible to describe a political trade of favors as an offer or attempt to bribe the other side,\" they state. They make it clear that seeking a campaign contribution of $1.5 million in exchange for a Senate appointment or a large sum being deposited in a private foundations account to get a lucrative appointment to that foundation would be a bribe. The law on bribery does not apply \"to bona fide salary, wages, fees or other compensation paid, or expenses paid or reimbursed, in the usual course of business,\" according to the ruling. Compensation for a job by someone other than a ghost worker, the judges state, is a \"bona fide salary and, as weve pointed out, the usual course of business in politics includes logrolling.\", The opinion goes on to discuss the case of Earl Warren, who became chief justice of the United States, according to some historians, by promising to deliver the California delegation at the 1952 Republican convention to Dwight Eisenhower, who later became president. While historians have debated whether the story is true and the conduct ethical, the appeals court panel says, \"no one to our knowledge has suggested that it violated the statutes involved in this case.\", The judges go on to explain again that logrolling violates no law, that the exchange of a public job does not meet the definition of a \"quid pro quo\" and that receiving a salary from a public job is not a form of private benefit for the purpose of federal criminal law. And now we get into even murkier territory, in my opinion. \"Put to one side for a moment the fact that position in the Cabinet carries a salary,\" they wrote. \"Suppose that Blagojevich had asked, instead, that Sen. Obama commit himself to supporting a program to build new bridges and highways in Illinois as soon as he became President. Many politicians believe that public works projects promote their re-election. \"If the prosecutor is right that a public job counts as a private benefit, then the benefit to a politician from improved chances of election to a paying job such as Governor or a better prospect of a lucrative career as a lobbyist after leaving office also would be a private benefit, and we would be back to the proposition that logrolling is criminal. \"Even a politician who asked another politician for favors only because he sincerely believed that these favors would assist his constituents\" could be condemned as a felon because grateful constituents make their gratitude known by votes,\" the ruling says. I would be interested to know what the judges would think about the Warren-Eisenhower deal if it had been put in writing. \"I, Dwight Eisenhower, promise Earl Warren that he will become chief justice of the Supreme Court if he delivers the California delegation to me during the Republican convention.\", Of course, Eisenhower never would have done such a thing because had it been revealed, the public outcry would likely have ended his bid to become president. Thats why such deals are always done in dark places where the sun doesnt shine. Corruption isnt inherently criminal. I understand that. But I also know there is no conduct more damaging to society than the immoral and unethical deals done in the name of public interest that damage our confidence in government. The federal courts were created as a protection against the abuse of power by the president and Congress. Their very reason to exist is to provide the people with a weapon to combat those who would subvert the government for personal gain or political power in violation of the Constitution. Yet, here we have federal judges justifying the sort of deals that have enraged generations of Illinois residents and at this very moment threaten the financial solvency of the state. I am no lawyer. I trust the judges were accurate in their interpretation of the law in this case. But when the law justifies public misconduct, when it gives comfort and cover to those who would use their position to benefit politically and financially, something has gone horribly wrong. The good news is that Blagojevich remains in prison. The bad news is that he and Ryan who both claimed during their trials that they did nothing illegal and were only making political deals as has always been done in Illinois now have words written by federal judges that validate many of their claims. I cant help thinking federal judges in another state might have chosen their words more carefully. pkadner@tribpub.com]", "Date": "20150722", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-blagojevich-appeal-st-0723-20150722-story.html", "Title": "[Blago court ruling defends 'political logrolling']"}