{"Content": "[Cook County Board President Toni Preckwinkle, facing an uphill fight to win votes for her proposed sales tax increase, said Tuesday she is open to rolling back the hike as soon as this fall if state lawmakers approve the public pension overhaul she is seeking in Springfield. She also played up the idea of using some of the revenue from the penny-on-the-dollar increase for public works improvements during a speech at the City Club of Chicago. Preckwinkle needs nine votes from the 17 commissioners for the tax hike she plans to introduce at Wednesdays board meeting, and it remains unclear whether she will reach that threshold; the vote will come at a later date. She has portrayed the increase as part of a responsible effort to reform the countys unbalanced workers pension system, but on Tuesday she explained that she might not need the full amount if she gets her way at the statehouse. \"I will make this commitment: If Springfield can pass pension reform, our pension reform bill by the end of the summer, we will re-evaluate our revenue needs and make the appropriate changes to our sales tax levy in our September board meeting,\" she said at the City Club, where the audience included a handful of county commissioners. Asked afterward how much she would reduce the tax if the state legislature and Gov. Bruce Rauner approve her pension plan, Preckwinkle did not give specifics. \"Well see whether anything gets passed (in Springfield) and what gets passed,\" she said. \"We know the financial implications of our own pension reform bill. Theres no guarantee that the matter that we put before the House and the Senate and that will go to the governor will be exactly as we submitted it. So well have to see what emerges.\", The new sales tax increase would take effect Jan. 1 and raise about $473 million a year. Preckwinkle said most of that would go toward increased pension payments to restore the retirement system to financial soundness. But the increased payments to the pension fund would be significantly smaller if lawmakers approve her changes. Acting now on the tax increase could take away state lawmakers concern that approving her pension bill would lead to them being blamed for the higher tax. Preckwinkle also talked about how a portion of the new revenue would go toward construction projects, an issue thats popular with business owners and residents. \"It will allow us to establish a long-term commitment to our infrastructure,\" she said. She pledged to stop diverting motor fuel tax proceeds away from roadwork once the new sales tax money begins coming in. Preckwinkle also promised a \"long-term transportation plan\" coupled with the new financial commitment to infrastructure projects. Commissioner Robert Steele, D-Chicago, said after her speech that the infrastructure component will make the tax a slightly easier sell. \"Theres a benefit to the business community, by doing this,\" said Steele, who described himself as undecided on whether to support the sales tax bump. \"The infrastructure is really something that they have a need for as well. And so it certainly helps them understand that this is going to benefit them directly.\", Preckwinkle also sought Tuesday to differentiate her proposed sales tax hike from the widely derided penny tax increase passed by County Board President Todd Stroger in 2008. She argued \"there is no person in Cook County more hesitant to increase the sales tax than me,\" because she defeated Stroger in part by promising to roll back his 1-cent increase a campaign pledge she kept. But Preckwinkle said her proposed hike is better-thought-out and more financially responsible than her predecessors, pointing to moves she has made to improve efficiency and drive down government costs in recent years. \"What may be personally or politically awkward for me is irrelevant,\" Preckwinkle said. jebyrne@tribpub.com, Twitter @_johnbyrne]", "Date": "20150630", "Author": "[John Byrne]", "Link": "http://www.chicagotribune.com/news/ct-preckwinkle-sales-tax-met-20150630-story.html", "Title": "[Preckwinkle open to reducing sales tax increase after it passes]"}