{"Content": "[Sen. Mark Kirk has $2 million in his war chest as he girds for his 2016 campaign, a race expected to be tough, costly and closely watched around the country. Four Democratic representatives from Illinois are angling for his job, but none has officially announced their candidacy. Already, though, some analysts see Kirks 2016 re-election bid as a toss up. Jennifer Duffy, a senior editor at The Cook Political Report, said the contest \"leans Republican.\" But she expects the race to narrow since the presidency is up for grabs and Illinois has long preferred Democrats for the White House, meaning down-ballot Democrats stand to get a boost. Illinois last favored a Republican presidential nominee in 1988. \"Id be stunned if, in a presidential year, the Democrats dont come up with a pretty good (Senate) candidate\" in Illinois, Duffy said. In 2010, Kirk beat then-state treasurer Alexi Giannoulias, a Democrat, by less than 2 percentage points. Two years later, Kirk, now 55, suffered a massive stroke and underwent almost a year of rehabilitation before returning to the Senate. Duffy thinks the lingering effects of the stroke will factor into the race. Voters will ask, \"Is he up to the job?\" she said. \"Obviously hes been doing the job, but voters dont pay attention to that until an election.\", Kirks spokesman, Danielle Varallo, said the senator looks forward to a \"vigorous campaign\" in 2016. Rep. Tammy Duckworth of Hoffman Estates has been explicit about exploring a run for Kirks seat. More quietly, Rep. Bill Foster of Naperville has been weighing a challenge. \"Hes considering it\" but is focused on representing his congressional district, his spokeswoman Megan Jacobs said. Foster and Duckworth each had more than $1 million in their campaign funds at the beginning of this year, records show. Duckworth, 46, is well known nationally as a double amputee from the Iraq War. Foster, 59, is a wealthy physicist who has dug into his wallet to pay for past campaigns. Rep. Robin Kelly, one of two other House members with a lower profile and less cash also said she is sizing up a run. Kelly is not even two years into her time in Congress, having won a special election in April 2013 to fill the seat of Jesse Jackson Jr. now in federal prison. Kelly, asked if its too soon to try for a bigger job, pointed to another Illinois politician: President Barack Obama, who announced his White House run a little more than two years after entering the Senate. \"Sometimes opportunities come along when they come along,\" Kelly said. A former state representative, Kelly, 58, is the only one of Kirks potential opponents who has run a statewide race, making an unsuccessful bid for treasurer in 2010. Rep. Cheri Bustos of East Moline is another House member elected in 2012, like Duckworth, and arguably would have a steep climb against Kirk since her northwestern Illinois district is far from the populous, vote-rich Chicago area. Bustos, 53, a former hospital public relations executive and newspaper reporter, had $135,000 in her campaign treasury as the year began. In an interview, Bustos noted she first won in 2012 by ousting a tea party Republican, one-term Rep. Bobby Schilling, and defeating him by 10 percentage points in their rematch. The only Democrat from outside the Chicago area in the states congressional delegation, Bustos said she expects things to shake out among prospective Democratic candidates before the summer and that shell be a team player, whoever runs. Duffy noted that Kirk is fairly moderate compared with his Senate GOP colleagues and that will make it \"hard for the Democrats to demonize him.\", Kelly took aim, nonetheless. \"I look at him as not the moderate that hes always proclaimed to be. Id be a better voice for the people of Illinois,\" she said. Kirk, as well as his potential opponents, figure to have a ways to go in terms of fundraising. Candidates who won Senate contests in 2014 spent an average of about $9.65 million each, according to The Campaign Finance Institute in Washington. Kelly, who began 2015 with about $122,000 in her treasury, acknowledged she would need many millions to be viable against Kirk, who served nearly 10 years in the House before moving up to the Senate. She said if she does jump into the race it will signal shes confident she can raise the cash. Already, the race in Illinois is one of the hottest on the horizon, as are the Senate races in Wisconsin and Pennsylvania. Democrats need to pick up five seats nationally to regain their majority; four if they hold the White House since the vice president would be the tie-breaker in 50-50 votes. In Illinois, candidate spending is expected to be dwarfed by what outside groups put in. In 2014, more than $73 million in outside money was spent in the Senate race in North Carolina, nearly $64 million in Colorado and nearly $57 million in Iowa, The Campaign Finance Institute said. The GOP prevailed in each race: Thom Tillis in North Carolina, Cory Gardner in Colorado and Joni Ernst in Iowa. Those sky-high sums include spending by political parties and outside groups. Duffy, reminding that Senate seats dont open up often, said given the expected Democratic tilt in Illinois in 2016, its not a \"fools errand\" for any of the four Democrats to examine whether they could beat Kirk. Unknowns will affect the contest, she said, including who runs for the White House, how Illinois voters regard the new GOP Gov. Bruce Rauner and whether things for Illinoisans are looking up or down as the election grows near. kskiba@tribpub.com, Twitter @KatherineSkiba]", "Date": "20150212", "Author": "[Katherine Skiba]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-senate-race-finances-met-0213-20150212-story.html", "Title": "[4 U.S. House Democrats from Illinois consider a challenge to Sen. Mark Kirk]"}