{"Content": "[In the basement mailroom of the Aurora Public Librarys main building, covered by a ceiling panel above a copy machine, is the bricks-and-mortar legacy of the individual who once was the worlds richest man. Its a wall of what had been the main library, built through the beneficence of Andrew Carnegie, the controversial industrialist and philanthropist who amassed a fortune of around $500 million in the late 1800s, then gave almost all of it away. Part of his philanthropy was spending close to $60 million to establish nearly 1,700 public libraries across the U.S. including Auroras main library downtown on an island in the Fox River. After more than 110 years, that library was set to close Saturday. Like Auroras institution, other Carnegie libraries a national phenomenon that educated and entertained millions are disappearing across the U.S. At the same time, public libraries are trying to find their place in a landscape churning with rapid changes in digital information and technology. It turns out, public libraries are succeeding. The latest figures from the Institute of Museum and Library Services show that visits to public libraries totaled 1.5 billion in 2012, an increase of nearly 21 percent from 10 years earlier. Public libraries circulated 2.2 billion materials that year, a 10-year increase of nearly 30 percent, the institute reports. And public libraries hosted nearly 93 million people at their programs, an increase of nearly 40 percent since 2002. \"I think what were seeing here is an increase in demand for information across the board, in the home, in the library and in the coffee shop,\" said Carlos Manjarrez, director of planning, research and evaluation at the museum and library institute. Libraries have adeptly responded to that demand, Manjarrez said, by redesigning themselves \"to accommodate a more wireless experience.\" In addition, libraries have become places where those without home computers or laptops can connect to the web. Auroras library experience has tracked a similar path. The old library, which underwent a major renovation in 1969 that swallowed the original Carnegie structure, had become too small to accommodate new demands on public libraries, said Eva Luckinbill, the librarys former executive director who is serving as a consultant for the move and was an early driving force for the new building. The main library will be replaced by a sleek, nearly $30 million building more than twice its size. The Richard and Gina Santori Public Library of Aurora, named for the couple who donated a $3 million technology endowment to the new library, occupies about 2 acres and stands less than two blocks from the 110-year-old structure. The new building is scheduled to open June 14, and is funded by a $10.8 million state grant, Luckinbill said. Taxpayers will cover most of the remaining $19 million, she added. For that price tag, the people of Aurora will get the conventional offerings in a much larger space plus high-tech components, including a learning center that will feature 3-D printers, laser cutters, soldering and electronic circuitry kits. Study rooms and a gaming area will be in the Teen Space near a media studio that will allow patrons to create and edit audio and video. Promotional material calls the new library an \"information mall\" that will provide learning to all individuals particularly preschoolers through programs and partnerships. \"Its a place to explore,\" Luckinbill said one morning in the old library. \"Its not just books, but we still have to have our foot in that world too. Weve just morphed over the years.\", It also will be a gathering place, Luckinbill said, noting that the new library will have two large meeting rooms and 12 smaller study and conference rooms. The old library had one large multipurpose room and no smaller study or conference rooms. Those changes reflect how many public libraries are transforming themselves, said American Library Association President Courtney Young. Public libraries have managed to move from being houses of books and periodicals to high-tech hubs where experts librarians can guide patrons in navigating what can be overwhelming amounts of information, she said. \"The 21st-century library is about digital,\" Manjarrez said. \"Its about direct service. Its about connecting with local institutions in ways that just werent physically possible with libraries that were built much earlier.\", Carnegie largely is credited with building the foundation for these new libraries, even as the original versions fade from view. Born in 1835 in Scotland, Carnegie spent much of his childhood in poverty. His family moved to Pittsburgh, where he started work in a textile factory as a boy. From that humble start, and sparked by his self-education in a retired merchants small library, Carnegie ascended to wealth, prominence and controversy in the railroad and steel industries. Among his most notable contradictions was his public expression of support for workers rights while presiding over a steel empire in which employees worked long hours for low wages. When those workers struck in 1892, Carnegie stood by his plant manager who locked out employees and instigated conflicts that led to the deaths of many employees. About the same time, Carnegie started giving grants to build libraries, motivated largely by his boyhood experience in that small, personal library of the man he referred to as Colonel Anderson. \"It was when reveling in the treasures which he opened to us,\" Carnegie stated in a 1924 book,\" The American Public Library and the Diffusion of Knowledge,\" \"that I resolved, if ever wealth came to me, that it should be used to establish free libraries, that other poor boys might receive opportunities similar to those for which we were indebted to that noble man.\", The book also quoted Carnegie saying that he viewed a free library as \"the best gift which can be given to a community.\", Aurora got $50,000 from Carnegie in about 1901 after a local pastor wrote a letter saying the existing library was too small. The Carnegie-funded library opened in August 1904 at 1 E. Benton St. on Stolp Island. The impact of Carnegies effort in Aurora and beyond was powerful and enduring, said Wayne A. Wiegand, a library historian and author. Carnegie essentially created the public library system throughout much of the Midwest, West and Pacific Northwest, particularly in small towns, said Wiegand, author of the forthcoming \"Part of our Lives: A Peoples History of the American Public Library.\", Those libraries became cultural centers and intellectual focal points, Wiegand said. Nothing exactly like them existed in other countries. But their physical presence is eroding. While no formal record of the status of Carnegie libraries exists, Wiegand believes that less than half of the buildings remain in use as libraries. Some were razed or converted to other uses, like a junior college in Huntington, W.Va. or a city hall in Osage, Iowa, Wiegand said. Today none of Auroras Carnegie structure is visible on the exterior or inside. The fate of the old building remains unclear. The city is accepting proposals on uses for the structure, Luckinbill said. A viable plan must be in place by June 2016 or the building will be razed. Despite all the gleam and airy design of the new library, the old building generates a fair amount of loyalty and affection. Luckinbill, the former executive director, said at least two employees will retire rather than move from it. Saturdays closing coincides with the retirement of Childrens Librarian Diane Christian, who started working at the library in 1974 and became head of the childrens department in 1976. She said she has seen kids taste in reading move from books by Judy Blume and Laura Ingalls Wilder to \"Diary of a Wimpy Kid,\" by Jeff Kinney. \"Its going to be sad to leave this building for the last time,\" Christian said during one of her last shifts in the librarys lower level. She said her retirement is unrelated to the old librarys closing. Christian also is excited by the new childrens area that will be three times larger than the existing space. The new building will be \"a showpiece that were hoping will motivate people to come, and hopefully what they will see will inspire them to come back,\" she said. One of the children who fell in love with the library was a young Cesar Ortega, now 20, of Aurora. Seated at a coffeehouse a couple blocks from the library, he said his first visit to the library was with friends in eighth grade who wanted to use the librarys computers. Ortega said he immediately fell in love with the building and obtained a library card the next day. A few weeks later, he joined the teen advisory board. He said the library saved him from \"going down the wrong path\"; that its a place where \"many different types of people can go and just be there,\" from children and teens who want to hang out to adults who go there for an education. The library had a profound impact on Ortega, just as it did for a young Andrew Carnegie. After Ortega graduates from Northern Illinois University, he said, he plans to become a librarian. tgregory@tribpub.com, Twitter @tgregoryreports]", "Date": "20150523", "Author": "[Ted Gregory]", "Link": "http://www.chicagotribune.com/news/ct-aurora-carnegie-library-closing-met-20150523-story.html", "Title": "[Library's closing reveals fading Carnegie legacy, hopeful future]"}