{"Content": "[Chicago Teachers Union President Karen Lewis on Tuesday sounded optimistic about the prospects for reaching agreement with the school board on a new contract. \"We are literally this close to hammering out an agreement for a year,\" she told the Tribune. \"So thats good, right?\", Lewis didnt elaborate. Chicago Public Schools has a policy of not commenting on labor negotiations. But the CTU presidents comments indicate a new contract can be achieved this time around without the rancor of three years ago, when teachers went on strike for seven days. CTU protest outside CPS headquarters on July 22, 2015. (WGN-TV), CTU protest outside CPS headquarters on July 22, 2015. (WGN-TV), \"I think were going to be focusing on trying to get a one-year contract in place, and the people in Springfield have to figure out something else to do,\" Lewis said minutes after the Illinois House scuttled, at least temporarily, a measure to buy CPS an additional six weeks before it must cut a $634 million check to its teachers pension fund. Its not clear what a new labor deal would look like. District observers have said that the terms of whatever pact emerges after weeks of talks will have a significant impact on CPS tenuous budget situation. Last week, CTU Vice President Jesse Sharkey said, \"Our mission right now is to go into this contract and try to secure some guarantees that our schools are not going to be eviscerated.\", CPS some weeks ago declined to offer teachers an additional year under their expiring contract, saying the district could not afford a built-in 3 percent pay hike. A district spokesman had said that raise would have cost CPS an additional $105 million. The union has also told its members that district negotiators sought to save millions by ending a long-standing agreement that limits teacher paycheck deductions for pensions. In May, the union filed an unfair labor practice complaint and accused the Chicago Board of Education of bad-faith bargaining and refusing to engage in mediation toward a new contract. Thousands of CTU members and supporters recently blocked a downtown stretch of LaSalle Street, staging a show of force. The unions current contract expires June 30. Talks were slowed by the runoff election between Mayor Rahm Emanuel and Jesus \"Chuy\" Garcia, Lewis hand-picked candidate. The union used the election to air contract demands that included limits to class sizes, increases in teacher preparation time, a reduction of paperwork mandates and additional school counselors and nurses. CPS officials are set to authorize $200 million of new borrowing to manage a cash crunch through the end of June while also taking out a separate line of credit to borrow nearly $1 billion to get through the coming fiscal year. Those measures, set for a vote Wednesday by the Chicago Board of Education, represent short-term fixes that officials acknowledge wont solve the districts ongoing financial crisis. jjperez@tribpub.com, Twitter @PerezJr]", "Date": "20150623", "Author": "[Juan Perez Jr.]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-karen-lewis-contract-met-20150623-story.html", "Title": "[ Chicago Teachers Union president hints contract agreement 'this close']"}