{"Content": "[If President Barack Obama and his record hurt Democrats in 2014, what effect will they have in 2016?, Just as Arizona Republican Sen. John McCain couldnt escape the shadow of George W. Bush in 2008, the Democratic nominee in 2016 wont be able to separate herself from Obama. So Hillary Clinton (or whoever is the Democratic nominee) would be better off accepting that, and doing what she can to tout Democratic successes, rather than remind everyone of the failures. Right now, Obamas approval rating is about 42 percent, which is where its been for about a year, and right around the low point for his presidency. Thats a little better than where George W. Bush was at this point. Bush tanked in his final two years, ending up south of 30 percent. Obama could follow that path, but it wont happen automatically. It would take events: a new recession, a scandal such as Ronald Reagans Iran-Contra affair or foreign disasters, especially ones involving U.S. troop casualties. Without them, Obamas approval might drift down a bit, but nothing dramatic will happen. Or its possible Obama could rally. As the political scientist Richard Skinner pointed out, Obama is missing the approval surge most presidents get at some point. If the economy finally does well enough to change public perceptions, and if no disasters intervene, reaching approval levels in the 50s is plausible. It isnt a common path for two-term presidents to improve after the last midterm. Then again, most didnt get an opportunity to put in their best economic performance in the final two years of their second terms. One advantage for Obama and the Democrats: Just as voters in 2010 blamed Democrats for hard times that began under Bush, people could have short memories again if good times return. A lot of analysts are diving into the demographic data to figure out exactly how much of an advantage, if any, Democrats have in presidential elections because of the growing diversity of the electorate. My guess? Events over the next two years, and how they change the way people feel about President Obama, will matter a lot more than anything else. Bloomberg View, Jonathan Bernstein is a Bloomberg columnist.]", "Date": "20141114", "Author": "[Jonathan Bernstein]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-obama-effect-2016-perspec-1117-20141114-story.html", "Title": "[Will Obama hobble Clinton in 2016?]"}