{"Content": "[Seventy years ago on Aug. 6, 1945, World War II became a nuclear war when an atomic bomb leveled Hiroshima, Japan, and the world changed forever. Three days later, an atomic bomb destroyed the city of Nagasaki. Perhaps as many as 250,000 people perished as a result of this horrific weapon with its mystifying mushroom clouds of death and devastation. Chicago played a pivotal scientific and engineering role in the birth of the nuclear age. It also produced many of the first protests against unlocking the mystery of the atom. Enrico Fermi and his team at the University of Chicagos Metallurgical Laboratory (Metlab) built the first nuclear reactoron in an underground, doubles squash court under the west stands of Stagg Field. It marks the spot on Dec. 2, 1942, when Chicago Pile 1, the first nuclear reactor with uranium-graphite materials, unleashed the first self-sustaining nuclear chain reaction. It was in Chicago when neutrons, in a controlled experiment, split the nucleus of a uranium 235 atom. This fissioning of atomic nuclei launched the Manhattan Project and the subsequent development of uranium and plutonium core bombs. Under the leadership of James Franck, seven courageous scientists at the Metlab signed the Franck Report on June 11, 1945. The report denounced the planned A-bomb attack without a warning on a nearly defeated Japan. It recommended a virtual shock-and-awe demonstration with Japanese and United Nations eyewitnesses on a \"desert or a barren island.\", Leo Szilard, one of the signatories of the Franck Report, orchestrated additional protest at the Metlab, He obtained scores of signatures on a petition that stated, \"Our use of atomic bombs in this war would carry the world a long way further on this path of ruthlessness.\" It sought a warning to Japan and an opportunity for it to surrender before the atomic destruction of its cities. Ralph Bard went to high school in Chicagos Hyde Park community and ran several businesses in Chicago, including Wahl-Eversharp Pen Co. He was Undersecretary of the Navy in 1945 and wrote one of the more significant documents of the 20th century a memorandum on June 27 to Secretary of War Henry Stimson advocating that the United States warn Japan before dropping an atomic bomb. Bard pleaded that a \"great humanitarian nation\" should seek peace with Japan before using atomic bombs in a sneak attack. His memo also suggested that U.S. officials guarantee that Japans emperor would be preserved as an institution and inform Japan that Russia had agreed at Yalta to enter the Pacific Theater. Japanese officials had pursued an exit strategy with the Russians with whom they were not at war until Aug. 8, 1945 and had met secretly with American officials from the Office of Strategic Services in Switzerland. Japan had no navy by spring 1945 and was vulnerable to a devastating blockade-bombing, siege strategy that pummeled the country night and day. President Harry Truman and defenders of the atomic bomb attacks argued that it saved lives by preventing an invasion of Japan that could have resulted in up to 1 million casualties. The pre-invasion estimates generated during the final months of the war were considerably lower, but any invasion would have resulted in many thousands of American and Japanese casualties. Under the U.S. plan, the invasion would not begin until Nov. 1 on Kyushu. A second and larger offensive on the Tokyo Plain would not begin until March 1, 1946. Why the rush to bomb in August when the invasion was months away?, It seems likely that the combination of the siege strategy, the Russian entrance into the Pacific Theater and a guarantee that the emperor would be preserved would have induced Japan to surrender under the terms of the Potsdam Declaration without using the A-bomb. The United States Strategic Bombing Survey analyzed the impact of the atomic bombings and concluded on June 19, 1946 that \"in all probability prior to 1 November 1945, Japan would have surrendered even if the atomic bombs had not been dropped, even if Russia had not entered the war, and even if no invasion had been planned or contemplated.\", Today, there are about 9,000 strategic and tactical nuclear weapons in the world, according to the Arms Control Association. This is unacceptable. The \"Little Boy\" Hiroshima and \"Fat Man\" Nagasaki bombs contributed to the Cold War and the nuclear arms race. Just four years after the nuclear climax of World War II, the Soviet Union tested an atomic bomb. There are now nine nations that have nuclear weapons United States, Russia, United Kingdom, China, France, Israel, Pakistan, India and North Korea. Iran does not have nuclear weapons, and the Obama administration has entered into an agreement to delay, if not thwart, its capacity to develop them. Yet Article VI of the Nuclear Non-Proliferation Treaty of 1968 obligates nuclear-weapons states to denuclearize and engage in \"nuclear disarmament.\", Global survival requires an agenda beyond non-proliferation that includes striving for a nuclear-free world. Otherwise, absent new thinking, the world might be engulfed in a nuclear conflict that could extirpate civilization. Peter Kirstein is a history professor at Saint Xavier University in Chicago.]", "Date": "20150805", "Author": "[Peter Kirstein]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/opinion/ct-sta-kirstein-bomb-st-0806-20150805-story.html", "Title": "[Was using the atomic bomb necessary to end WW II?]"}