{"Content": "[His campaign is a long shot, but Im happy to see Sen. Bernie Sanders, I-Vt. putting forth a good impersonation of a serious challenge to Hillary Clintons presidential campaign. Like a nearsighted javelin thrower, the self-described democratic socialist may not score many points, but hell keep the crowd alert. The former first lady, senator and secretary of state needs someone to keep her alert. Her avoidance of reporters and any other unscripted public moments sometimes make her appear to be asleep at the wheel. Her slow reaction to widespread suspicions about her private unsecured email server, for example, seemed odd compared with her husbands rapid-response campaign team in 1992. And why encourage an image of aloofness and entitlement at a time when voters are expecting candor and transparency?, One wonders, is she relying on her potential Republican opponents, whose numbers seem to grow by the day, to trip over themselves so much that she can quietly waltz to her partys nomination? Thats not a totally bad bet, considering how the mere mention of Hillary Clintons name was driving right-wingers bananas years before anyone had reason to mention \"Obama derangement disorder.\", At least no one has demanded to see her birth certificate, but just wait. Yet as much as her campaign seems to be leaning on celebrity style more than substance, her initial speeches offer hints of a long-term goal: She aims to rally the same coalition of voters who twice elected President Barack Obama. You can hear it, for example, in her pronouncements on voting rights, immigration, the incarceration explosion and equal pay for women. At Texas Southern University in Houston, she issued a major appeal for every American to be automatically registered to vote when they turn 18 unless they choose not to be. She called for a nationwide standard of at least 20 days of early voting. She called on Congress to strengthen the Voting Rights Act, which a 2013 Supreme Court ruling weakened. She also attacked restrictive voter identification card laws imposed by Republican lawmakers in some states that she said discourage lawful voters from voting. Republican governors from two of those states, New Jerseys Chris Christie and Texas Rick Perry, sharply denied her accusation, even though Perry did sign a controversial requirement that Texans show photo identification before voting. But those responses were politely restrained compared with conservative critics who accused Clinton of \"race baiting\" and \"playing the race card.\", \"She needs black voter turnout in 2016 in order to win,\" said TownHall.com editor Katie Pavlich on anchor Gregg Jarretts Fox News program. \"And the way that shes going to do that is by perpetuating this bogus, race-baiting narrative that somehow voter ID laws disenfranchise minority voters.\", Actually, that narrative is not so bogus. A report released last fall by the Government Accountability Office, Congress investigative arm, on voter ID laws in Kansas and Tennessee found a dip in 2012 election turnout of about 2 percent points in Kansas and 2.2 to 3.2 percent in Tennessee. As the Democratic lawmakers who called for the probe suspected, the GAO found the declines to be greater among younger and African-American voters. Thats not a huge percentage, but certainly big enough to have a significant impact in close elections. Yet the perception of minority voter suppression in itself is believed to have contributed to a surge in the rate of black voter turnout nationwide in 2012 that, for the first time, exceeded the white turnout rate. A big looming question: How much have black voters gotten over hard feelings left over from Clintons long-running primary battle against Obama in 2008? A lot of people have long memories, especially in politics. Another question: Are Obamas core supporters so disenchanted over what he was unable to accomplish against his strong Republican opposition that they wont bother to vote this time?, Thats always possible. But here, too, Clinton has hope. She undoubtedly hopes that that her political adversaries overreact harshly enough to remind her base that things always could be worse. A lot worse. Page, a member of the Tribune Editorial Board, blogs at http://www.chicagotribune.com/pagespage. \"Culture Worrier,\" a collection of his columns, is available in print and at http://www.chicagotribune.com/ebooks. cpage@tribpub.com, Twitter @cptime]", "Date": "20150612", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-hillary-clinton-bernie-sanders-perspec-0615-20150612-column.html", "Title": "[Can Clinton rally Obama's coalition?]"}