{"Content": "[The U.S. and its allies may have a deal with Iran over its rogue nuclear program by the end of the week. Or they may all traipse through yet another self-imposed deadline as discussions go on in Vienna. U.S. Secretary of State John Kerry says the chances for a deal are 50-50. \"We want a good agreement, only a good agreement and were not going to shave anywhere at the margins in order just to get an agreement,\" he said last weekend. So whos sweating? Not the Iranians. A couple of weeks ago, Irans supreme leader Ayatollah Ali Khamenei proclaimed his terms, several of which contradicted the terms reached in April in a tentative deal. Now Irans negotiators are piling on more last-minute demands. They want the United Nations to lift restrictions on Irans trade in missiles and other conventional arms. They act, at least publicly, as though they have all the leverage, that they know their adversary craves a deal more than they do. Where would they get that idea? Probably from the U.S. and its allies, who reportedly have been backpedaling on key points to eke out a deal. Latest case in point: Under the interim accord, Iran was supposed to process some of its nuclear gas stockpile into a form that is harder to use in a bomb. Last month, the International Atomic Energy Agency said Iran didnt fulfill all of its promises. The U.S. response a shrug and a defense of Iran. The Institute for Science and International Security accused the administration of \"making a very narrow interpretation ... that is at odds with its previous positions and common sense. It is also an interpretation that appears to favor Iran and not the United States.\", The unavoidable conclusion is that instead of calling out Iran, the U.S. gave it a pass to keep the talks going. International experts raised the same suspicions last month. A special panel that investigates nuclear sanctions-busting accusations against Iran noted that those complaints had mysteriously all but dried up. The U.S. and its allies should remember what Gerard Araud, the French ambassador to the U.S. tweeted earlier this year: \"We want a deal. They need a deal. The tactics and the result of the negotiation should reflect this asymmetry.\", Irans economy, crippled by U.S. and EU sanctions, is in shambles. Iran stands to reap as much as $150 billion in sanctions relief in a matter of months money that could be used, as is Tehrans wont, to fund terror groups and operations across the globe. Iran is already vowing to double its crude oil exports after sanctions are lifted. \"We are like a pilot on the runway ready to take off,\" Irans deputy oil minister for planning and supervision said in The Wall Street Journal. \"This is how the whole country is right now.\", Iran needs a deal. These talks started 18 months ago. Iran is still feeling the economic pain. The U.S. still holds the option of imposing even more impactful sanctions on Irans key industries and banks. President Barack Obama has said many times that hed walk away from a bad deal. He will not get an effective agreement unless he means that. And he may well have to walk away. Follow theTribune Editorial Boardon Twitter@Trib_ed_boardandFacebook]", "Date": "20150707", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-iran-nuclear-obama-kerry-edit-0708-20150707-story.html", "Title": "[Enough talk with Iran. Get good nuclear deal now or pivot to sanctions ]"}