{"Content": "[Chicago bed-and-breakfast owner Kapra Fleming was baffled and shocked when she heard the news: Her taxes and costs to do business could double or even triple before the years end. That was in April, when she first learned that the Cook County assessor planned to reclassify all bed-and-breakfasts from residential to commercial property potentially adding tens of thousands of dollars to their tax bills. \"The tax is so huge, I was concerned I had to go out of business,\" said Fleming, owner of the House of Two Urns in Wicker Park. \"I could not afford an additional $3,000 to $4,000 a month.\", Cook County Assessor Joe Berrios initially said the change would take effect last January. But after bed-and-breakfast owners complained that they were never notified of the reclassification learning about it only after some properties had been reassessed in February Berrios announced that he would delay the change until next year. If designated commercial properties, bed-and-breakfasts would be assessed at 25 percent of their fair-market value instead of the 10 percent that applies to residential property. Its not clear if bed-and-breakfast operators would also lose the tax-reducing homestead exemption available for owner-occupied homes. But Fleming, who is president of the Chicago Bed and Breakfast Association, said proprietors would also be forced to spend thousands more to meet new requirements, such as filing audited expense reports much like larger hotels and businesses. Berrios brought up the issue of bed-and-breakfast assessments when he first campaigned for the office in 2010. Villa DCitta Bed and Breakfast in Lincoln Park. Villa DCitta Bed and Breakfast in Lincoln Park. A spokesman for his office, Tom Shaer, said officials have been studying the issue and concluded that because the establishments are used to generate income, they should be classified as commercial properties and taxed accordingly. He said other large municipal areas, including New York City, treat bed-and-breakfasts as commercial entities for taxation purposes, but acknowledged that the policy would mark a break from the past in Cook County. Some bed-and-breakfast owners in Cook County believe they were targeted unfairly and without warning. Many, like Fleming, said the change would quickly force them out of business. In one gentrifying area of Bronzeville on Chicagos South Side, where taxes have already been rising, \"there is no way you can function with that kind of increase,\" said Mell Monroe, owner of Welcome Inn Manor. \"You cant pass it to your guests. Its ridiculous.\", Other officials concerned with economic development questioned the proposed change too. \"We think its wrong because the way these things have operated for years, they dont make a lot of money,\" said Marc Gordon, president of the Illinois Hotel & Lodging Association. \"Changing this tax status would mean that literally a lot of them I know would have to close up. I just think it is unfair.\", Most of Cook Countys few dozen bed-and-breakfasts are in Chicago, Oak Park and Evanston. The assessors office said there are about 45 in the county; Fleming said shes aware of about 25. Part of the controversy is in how such establishments are defined. Acknowledging that there is a \"wide variety\" of bed-and-breakfasts out there, the assessors office said it will work, in consultation with the industry, to establish a method for assessing them that takes into account multiple factors, including size, quality, location, amenities and income-generating potential, according to a statement on the assessors website. \"All (bed-and-breakfasts) will not be treated identically, as some are not as economically productive as others,\" Shaer said. Yet some in the more traditional bed-and-breakfast community think another group those who rent out their homes or extra rooms, generally on a more sporadic basis, on sites like Airbnb.com is being unfairly exempted. Some B &B owners question why the Airbnb business has gone largely unregulated, allowing hundreds of rooms to be rented without required licensing and inspections. Critics complain that the hosts who advertise with the service often escape the citys notice by omitting their exact address in listings, using fake names or meeting visitors off-site to exchange keys. Yet the tax men are catching up to the Airbnb hosts too. Earlier this year, the city of Chicago \"closed a loophole\" and began collecting a 4.5 percent hotel tax directly from Airbnb and similar online services such as VRBO, or Vacation Rentals By Owner, said city spokeswoman Elizabeth Langsdorf. Bed-and-breakfasts are exempted from the 4.5 percent tax. But the Chicago Bed and Breakfast Association asserts that the 4.5 percent tax is \"in exchange for silence when it comes to enforcing the licensing of Airbnbs illegally operated guest rooms,\" according to its position statement. \"Technically, anybody doing Airbnb should be paying the state tax, and they are not,\" said Fleming, who has requested a meeting with the mayor. \"We really just want the city to enforce the licensing that they already have.\", Airbnb released a statement underscoring the differences between its clients and bed-and-breakfasts but said the \"community supports paying applicable taxes.\", \"A vast majority of people who share their homes on Airbnb are doing so for a few weeks a year, not as a full-time business,\" the statement said. \"Most of our hosts use Airbnb to help pay the bills, and their guests generate sustainable economic activity that helps the local economy.\", But Fleming noted that B & B operators also pay a 11.9 percent state hotel operators occupancy tax. Michael Reever, vice president of government affairs for the Chicagoland Chamber of Commerce, also questioned why Berrios office can put in place what amounts to a large tax increase without any legislative approval or vote. \"Everyone is hungry for revenue. They are looking for ways to plug the budget hole,\" Reever said. \"But these things keep coming from all sides at all levels for government. Its hard for businesses to (plan for the future) because they are always concerned about the next thing that will nickel-and-dime them.\", Cathy Hartmann, director of Villa DCitta in Chicagos Lincoln Park neighborhood, said that bed-and-breakfasts have traditionally been designated as residential because the owners are required to live on-site. The villa has six suites and began operating as a bed-and-breakfast in 2009. \"The bed-and-breakfast industry seems to have been targeted here,\" she said. Monroe described the decision as \"arbitrary\" and said it would be impossible for him to afford taxes that he estimated would nearly triple to $20,000 in a gentrifying neighborhood. Monroe said that he rents out three rooms, or about one-third of his home, at Welcome Inn Manor and that he believes he is the only African-American bed-and-breakfast owner in Chicago. The commercial classification also would cause complications if an owner wants to sell his or her home, Fleming said. \"They are hitting a population that has limited income,\" said Fleming, adding that the smallest bed-and-breakfasts cant afford to pay a lawyers fee to appeal their taxes. In Oak Park, if the classification change had been enacted in January as originally planned, the Harvey House Bed and Breakfast would have seen its taxes increase to about $88,000 from about $18,000 under the current assessment, said Ali ElSaffar, the Oak Park Township assessor who helps taxpayers handle their appeals. There are several bed-and-breakfasts in his town \"and I heard from all of them\" after they received their property reassessments, he said. \"These are pretty large tax increases that they have proposed,\" said ElSaffar, adding that Oak Park officials are concerned about the impact on tourism. \"There was concern that could wipe out the small industry we have in Oak Park.\", Besides the Harvey House, he is aware of another bed-and-breakfast that will be charged $38,000 in taxes this year but would have seen that bill go up to nearly $90,000 under the new classification. \"I dont think its the Cook County tax assessors intent to put these out of business,\" ElSaffar said. \"There are a lot of reasons they pulled it back and are taking another look.\", Lisa Black is a staff reporter; Lee Gaines is a freelance reporter. lblack@tribpub.com]", "Date": "20150801", "Author": "[Lisa Black]", "Link": "http://www.chicagotribune.com/news/ct-bed-and-breakfast-taxes-met-20150731-story.html", "Title": "[Bed-and-breakfast owners say they have no room for tax increase plan]"}