{"Content": "[Wisconsin Gov. Scott Walker has buzz. He has impressed conservative activists in Des Moines and is the front-runner for likely Republican Iowa caucus-goers, according to a Bloomberg Politics-Des Moines Register poll published this weekend. Supporters say the 47-year-old has more diverse qualifications than the other Republicans: A non-Washington Republican who has won tough contests in a blue state, taken on labor unions and has appeal to the conservative faith community and the business constituency. There is one credential that he doesnt have: a post-high school education. America hasnt elected a president without a college degree since Harry Truman. Privately, some strategists in both parties suspect that this could increasingly become troublesome for voters, a little in the nominating process, more so in a general election, particularly in battleground upscale suburban areas. If this seems illogical -- it does -- try raising the issue at the next coffee klatch or cocktail party; youre likely to be surprised by the responses. Americans celebrate higher education. More than 40 percent of voters have a college degree; only three countries, Canada, Israel and Japan have a more educated electorate. College graduates, on average, make in excess of 50 percentmore in a lifetime in America than non-graduates. All members of the Senate have higher degrees, as do all but 19 members of the House: 15 Republicans and four Democrats. Utahs Gary Herbert and Walker are the only two governors. Walker attended Marquette University for more than three years. He dropped out to take a job. Hes about a year short of a degree and has raised the possibility of completing it while governor. Actually, there is one other major presidential candidate who doesnt have a college degree: Kentucky Sen. Rand Paul. He never completed his undergraduate degree at Baylor University but scored so high on his medical school entrance exams that he was admitted to the prestigious Duke University Medical School, where he completed his training as an ophthalmologist. Some of the great American successes are men and women without college degrees: Microsofts Bill Gates, Steve Jobs of Apple and Oracles Larry Ellison. The same goes for leading entertainers such as Clint Eastwood, Julia Roberts and George Clooney. Add to the list of distinguished non-graduates the late Walter Cronkite and todays leading anchorman, Brian Williams. Ted Turner, who revolutionized broadcast journalism when he started the Cable News Network, revels in telling how he was kicked out of Brown University for hosting a woman in his room. The university had the good sense to give him an honorary degree years later. The question of Walkers missing diploma has arisen occasionally in Wisconsin. Opponents charged that there was something untoward about his dropping out of Marquette. He then authorized the university to release the records as proof there was no hidden story behind his departure. The governor has said that a college education isnt a \"base requirement\" for high office. The Walker camp had no comment for this column. History might help Walker. There have been 12 presidents without college degrees, starting with George Washington and 10 others, including Abraham Lincoln, elected in the 19th century. More than a century ago, a Princeton academic, Woodrow Wilson, who later became president, raised a question about the 16th president: \"Would Lincoln have been a better instrument for the countrys good if he had been put through the processes of one of our modern colleges?\", Historians have resoundingly rejected Wilsons point; Lincoln is widely considered the greatest American president. His predecessor, James Buchanan, had a college degree (rather rare in those days), but is considered one of the worst. Albert R. Hunt is a Bloomberg columnist.]", "Date": "20150202", "Author": "[Albert Hunt]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-scott-walker-president-college-degree-20150202-story.html", "Title": "[Can Scott Walker be president without a college degree?]"}