{"Content": "[Japan was working Monday to coordinate efforts with Jordan and other countries to save a hostage held by the extremist Islamic State group. \"We all have one unchanged goal and we will absolutely not give up until the end. And with that faith, we will try our utmost to reach that goal. Thats how it is,\" said Yasuhide Nakayama, a Japanese deputy foreign minister sent to Amman, Jordan, to work on the crisis. Back in Tokyo, government spokesman Yoshihide Suga told reporters that the government was still analyzing a video posted online that purported to show one of the two hostages, Haruna Yukawa, had been killed. The government has been in crisis mode since the Islamic State group said in an online video on Jan. 20 that it had two Japanese hostages and would kill them within 72 hours unless it paid $200 million. That deadline passed Friday. Asked if the government had concluded the latest video was authentic, Suga said, \"We cannot deny that the likelihood is high.\", Attention was focused on trying to save Kenji Goto, a 47-year-old journalist who was shown in the video, holding the photo of Yukawa. The still picture included a recording of a voice claiming to be Goto, saying his captors were no longer demanding ransom but wanted a prisoner exchange. The Associated Press could not verify the contents of the video message, which differed from earlier videos released by the Islamic State group, which now holds a third of both Syria and Iraq. Japanese were shocked by the video and news of the likely killing of Yukawa, a 42-year-old adventurer, who was captured in Syria last summer. Goto is thought to have been seized in late October after going there to try to rescue him. But some are critical of the two men for taking such risks. Some Japanese also are criticizing Prime Minister Shinzo Abe for pursuing a more assertive foreign policy, saying it may have contributed to the crisis. Toshiko Okada, 68, who used to run an English school in a Tokyo suburb, said she was stunned by the news and praying for the hostages lives. \"I feel Abes misguided shallow acts have triggered this ransom demand,\" she said. \"Maybe he should be attending to problems at home.\", Abe has pushed to expand the role for Japans troops one that has remained strictly confined to self-defense under the pacifist constitution adopted after the nations defeat in World War II. While on a visit to the Middle East earlier this month, Abe announced $200 million in humanitarian aid to the nations fighting the militants. In an earlier video showing both Goto and Yukawa, the Islamic State group addressed Abe, demanding the same amount of money as ransom for the two hostages. The United Nations Security Council issued a statement that \"deplored the apparent murder\" of Yukawa, declaring that the Islamic State group \"must be defeated and that the intolerance, violence and hatred it espouses must be stamped out.\", President Barack Obama condemned what he called \"the brutal murder\" of Yukawa, and called Abe to express condolences. His statement didnt say how the U.S. knew Yukawa was dead. French President Francois Hollande also condemned the killing and praised Japans \"determined engagement in the fight against international terrorism.\", Late Sunday, about 100 protesters, some of them holding placards that read, \"Im Kenji\" and \"Free Goto,\" demonstrated outside the prime ministers residence, demanding Abe save Goto. Demonstrator Kenji Kunitomi, 66, blamed Abe as bringing the hostage crisis on himself. \"This happened when Prime Minister Abe was visiting Israel,\" he said. \"I think theres a side to this, where they may have taken it as a form of provocation, possibly a big one.\", Associated Press]", "Date": "20150125", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-japan-hostages-20150125-story.html", "Title": "[Japan working with Jordan, others to free Islamic State hostage]"}