{"Content": "[We all have tasks we try to get done before the end of the year, and Kim Jong Uns is amping up the crazy. Last December, the North Korean despot approved the execution of his uncle for allegedly plotting against him. This December, his agents hacked Sony Pictures computers over a comedy depicting his assassination. Its enough to make you forget what he does to his real enemies: the people of North Korea. In February, a United Nations task force found his \"crimes against humanity\" to be \"without any parallel in the contemporary world.\", But he did have rivals for that honor in 2014. One of them is the self-proclaimed Islamic State, a radical organization (also known as ISIL and ISIS) that proclaimed a caliphate in territory spanning large swaths of Syria and Iraq. Beheading American journalists was only its most visible atrocity. \"The array of violations and abuses perpetrated by ISIL and associated armed groups is staggering,\" said Zeid Raad Al Hussein, the U.N. high commissioner for human rights. The group managed the nearly impossible feat of worsening the human rights environment in Syria. During the civil war, Human Rights Watch said, dictator Bashar Assad has subjected \"tens of thousands of people to arbitrary arrests, unlawful detentions, enforced disappearances, ill-treatment, and torture.\" He also used poison gas against rebels in 2013 and apparently again this year. Autocracy showed staying power in conspicuous places. Russias Vladimir Putin hosted the Winter Olympics, seized Crimea from Ukraine and launched a crackdown on dissent unparalleled in his country since Soviet days. The World Internet Conference somehow chose to convene in China, whose government blocks thousands of websites. In response to political demonstrations in Hong Kong, Beijing set a record for the number of social media posts it deleted. Religious extremism fared well in many places. In Nigeria, the Islamist group Boko Haram whose name means \"Western education is sinful\" kidnapped more than 200 schoolgirls, who have not been recovered. Pakistans Taliban massacred 145 people, including 132 children, at a school in Peshawar, the countrys worst terrorist attack. Jihadi militias in Libya captured Tripoli, forcing the elected parliament to flee the capital. That was just one reason enemies of the Arab Spring had reasons to cheer. Former Egyptian President Hosni Mubarak was acquitted for his role in the killing of hundreds of protesters before the 2011 revolution. The military regime that overturned that revolution took measures to stamp out protests and shut down independent civic organizations. The lone success in the region was Tunisia, where secularist parties won national elections and Islamists accepted defeat. In Afghanistan, where the U.S. has spent 13 years trying to implant democracy, outside election monitors found \"highly worrying indications of potentially widespread fraud\" in the presidential runoff, such as many polling stations reporting 100 percent of the votes for one candidate. Botswana, the only African nation to have consistently held free elections ever since gaining independence, had another one. Violent demonstrations in Burkina Faso forced the resignation of Blaise Compaore, who took power in a military coup in 1987. He had been in power even longer than 90-year-old Robert Mugabe of Zimbabwe, who carried out a mass purge of his government, apparently to ensure that his wife will someday succeed him. A U.S. Senate committee exposed the CIAs record of subjecting suspected terrorists to waterboarding, sleep deprivation, \"rectal feeding\" and other barbarities. But the Obama administration ignored a treaty signed by Ronald Reagan requiring prosecution of those who engage in torture. The only CIA employee involved in the program who has gone to prison is the one who exposed it. Brazilian President Dilma Rousseff, a former leftist guerrilla who was tortured in prison during the 1970s, wept upon receiving the report of the National Truth Commission about the military junta that was in charge then. Two former Chilean air force officers were sent to prison for the fatal 1974 torture of Alberto Bachelet, whose daughter, Michelle, is now president. Americans and Cubans who thought they would have to wait for the death of Fidel Castro for normal relations and more commerce saw them happen during his lifetime. The day after announcing the change, President Barack Obama imposed sanctions on Cubas closest ally, Venezuela, for human rights violations against protesters, some of whom were killed. Venezuelas was just one of the governments that felt beset by dangers requiring brutal methods of self-defense. But there and in many other places, many of the worst dangers are posed by those in power. Steve Chapman, a member of the Tribune Editorial Board, blogs at chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20141224", "Author": "[Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-putin-kim-mugabe-islamic-state-taliban-assad-perspec-1225-jm-20141224-column.html", "Title": "[In 2014, frightened governments did scary things]"}