{"Content": "[While the investigative journalist Seymour Hersh has been busy clouding the history of Osama bin Ladens years on the lam in Pakistan, the Office of the Director of National Intelligence cleared things up a bit by releasing a list of documents found at the lair in Abbottabad where bin Laden was killed in 2011. Intelligence experts may be most interested in the newly declassified communications between bin Laden and his terrorist underlings, but Im fascinated by a number of general-interest titles and press clippings in \"The bin Laden Bookshelf,\" which may give insight into the mind behind the most brazen terrorist attack of the 21st century. Here is a sampling:, \"The Secrets of the Federal Reserve\" by Eustace Mullins. Mullins, a Library of Congress employee, wrote \"Secrets\" in 1952 at the behest, he said, of the poet and Nazi sympathizer Ezra Pound. The original versions cover included a droopy, hand-doodled image of the Rothschild family crest. In Mullins telling, the Fed was largely a British neo-Colonial plot: \"the shadowy figures behind the operation of the Federal Reserve System were themselves shadows, the American fronts for the unknown figures who became known as the London Connection. I found that notwithstanding our successes in the Wars of Independence of 1812 against England, we remained an economic and financial colony of Great Britain.\" Mullins noted in his preface that \"a writer only has one book within him,\" which in this case seems more a blessing than a curse. \"Christianity and Islam in Spain: A.D. 756-1031\" by C.R. Haines. Bin Laden, who said al-Qaidas 2005 Madrid bombings were part of an effort to reclaim the Moorish kingdom of \"Al Andalus,\" must have been gratified by this pedantic 1889 tome. \"History affords no parallel, whether from a religious or political point of view, to the sudden rise of Mohammedanism and the wonderful conquests which it made,\" writes Haines. \"The electric spark had indeed fallen on what seemed black unnoticeable sand, and lo the sand proved explosive powder and blazed heaven-high from Delhi to Granada!\", \"The 2030 Spike: A Countdown to Global Catastrophe\" by Colin Mason. The author of this 2003 doomsday guide speculates that within a few decades, overpopulation, global warming and mankinds \"building up a vast array of totally unwarrantable wants\" will lead to global famine and chaos. After a 2010 audio broadcast in which bin Laden said that \"all of the industrialized countries, especially the big ones, bear responsibility for the global warming crisis,\" he was widely decried for jumping on the climate-change bandwagon for PR reasons. Was his interest more sincere?, \"The Taking of America, 1-2-3\" by Richard E. Sprague. The author of this 1976 expose posits that a secret \"control group\" has manipulated U.S. politics since the 1960s by assassinating John F. Kennedy, Robert Kennedy, Martin Luther King Jr. and Rep. Hale Boggs; controlling the 15 largest news organizations; forcing Gerald Ford to pardon Richard Nixon; and framing Edward \"Ted\" Kennedy for the death of Mary Jo Kopechne at Chappaquiddick. Only a few Americans, including the comedians Dick Gregory and Mort Sahl, have stood in their way. \"Unveiling Islam: Why does Osama bin Laden invoke the Koran?\" A January 2005 Washingtonian magazine profile of John Esposito, a well-known professor of Islamic studies at Georgetown University who has been criticized from the right for holding that the Islamic State groups motivations stem in part from abuses heaped on the Arab world by Western powers. In an interview, Esposito seemed bemused by his presence on bin Ladens reading list: \"More than likely, he was isolated for so long and he had to fill his day, and he spent a lot of time watching DVDs or watching news or reading, so he probably had people put together a pile. It is a hodgepodge list nobody would have been expecting the diversity and the diversity of opinion he had think tanks from left to right and authors from left to right. They probably saw my title with bin Ladens name on it without reading it.\", \"Unfinished Business: U.S. Overseas Military Presence in the 21st Century\" by Michael OHanlon. A bit of a wild card, as OHanlon, a scholar at the Brookings Institution, has been considered something of a supporter of the \"war on terrorism\" and the invasions of Afghanistan and Iraq. This study, part of the Center for a New American Securitys \"Future of the U.S. Military\" series, calls for increasing U.S. military presence globally to enhance its \"capability in numerous strategically important parts of the world to make a difference in normal day-to-day regional balances of power.\" OHanlon, a friend, emailed me that bin Laden probably \"just wanted to learn about U.S. military bases, perhaps partly to help keep himself alive!\", \"Necessary Illusions: Thought Control in Democratic Societies\" by Noam Chomsky. Hardly a surprise. Chomsky called the Abbottabad raid \"a planned assassination, multiply violating elementary norms of international law\" and questions bin Ladens own claim that he was responsible for the Sept. 11 attacks. This 1989 collection of lectures is a bit of an odd choice, however, as it focuses primarily on press criticism and the \"primitive nature of contemporary Western culture.\" Bin Laden may have skipped ahead to Appendix V, which deals with Washingtons supposed whitewash of Israeli \"obstructionism\" to the peace process and the \"anti-Arab racism\" peddled by the U.S. media. Delta Force Extreme 2 Videogame guide. The DNI office speculates that this was probably for the use of \"other compound residents.\" I really, really hope that assessment is another CIA blunder. The Complete Bush-Cheney conspiracy library: \"Crossing the Rubicon\" by Michael Ruppert; \"New Pearl Harbor: Disturbing Questions About the Bush Administration and 9/11\" by David Ray Griffin; \"Americas War on Terrorism \" by Michel Chossudovsky; \"Rogue State: A Guide to the Worlds Only Superpower\" by William Blum; \"Imperial Hubris\" by Michael Scheuer; undated Newsweek article on \"President Bushs business practices prior to his term as president.\", \"Guinness Book of World Records Childrens Edition 2008.\" Were the bin Laden children home-schooled and forbidden to step outside working on the worlds largest ball of twine?, \"The Secret Teachings of All Ages\" by Manly P. Hall. This self-published 1928 gem has it all: Freemasons, Rosicrucians, Qabbala, tarot cards, the Bembine Table of Isis (the Egyptian goddess, not the Middle Eastern terrorists), alchemy, sorcery and proof that William Shakespeare was a pseudonym of Francis Bacon. \"The Rise and Fall of Great Powers\" by Paul Kennedy. A staple for any student of international relations my dog-eared copy is testament Kennedys 1987 book retells the story of the Wests ascent through an abundance of detail and data on trends such as population increases, urbanization and trade deficits. Kennedy, a Yale history professor, was right about the Soviet decline and Chinas rise, but had little to say about any new Islamic caliphate. Time magazine clipping of an article on a dive of America Onlines stock. Id love to think that bin Laden was short AOL, as the companys shares are up 150 percent since his death. Bloomberg, Tobin Harshaw writes editorials on national security, military affairs and education.]", "Date": "20150521", "Author": "[Tobin Harshaw]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-bin-laden-pakistan-books-bookshelves-perspec-0522-20150521-story.html", "Title": "[Browsing bin Laden's bookshelves]"}