{"Content": "[Each of the attacks in Paris that killed 17 people last week was an atrocity, an affront to freedom and an act of terrorism. On those points, most people agree, and theyre right. Most people also fear this marks the beginning of a rash of extremist violence in the West. On that, theyre probably wrong. If we have learned anything from the experience since 9/11, its that the public and its leaders chronically overestimate the danger posed by Islamic militants. This latest episode fits that pattern. \"In the face of rogue jihadists living in the West and urged to attack their homeland, the threat is the new normal, one U.S. government official explained,\" according to The Daily Beast. \"There are thousands more jihadists living in the West than security forces to keep an eye on them. And with the war in Syria raging, there is the potential for that to grow as fighters return from the front lines, potentially radicalized.\", Former U.S. Sen. Joseph Lieberman, I-Conn. echoes that concern, warning in The Wall Street Journal that \"the enemy is stronger today in more places than it was on 9/11 and is gaining more ground than ever.\" He fears that \"the number and frequency of attacks like those in France will increase.\", But he and others have a history of sounding alarms that are false or greatly overstated. In 2011, Lieberman expected that the killing of Osama bin Laden would prompt someone to \"attempt an attack within the United States in the coming days or weeks.\" It didnt happen. In 2003, notes Ohio State University political scientist John Mueller, U.S. intelligence officials expected a flurry of attacks here after the Iraq invasion. Wrong again. Last summer, Defense Secretary Chuck Hagel called the Islamic State \"an imminent threat.\" Nothing came of it. The biggest terrorist attack on American soil since 9/11 is the 2013 Boston Marathon bombing which the soothsayers missed. Two phenomena are at work. One is our habitual human tendency to worry too much about dramatic, unusual dangers, like terrorism and Ebola, and too little about commonplace ones, like car wrecks and falls, that are far more likely to kill us. When we hear about terrorists shooting innocents, we get cold chills wondering whether well be next. When we hear that someone died of a stroke, we yawn. The other factor is a giant public-private network that has a stake in stoking these fears. The bureaucratic reality is that its safer to issue warnings about dozens of dangers that never pan out than to downplay a single one that later materializes. Government officials need a sense of urgent peril to justify their budgets and their powers. Private contractors have reason to inflate the problems they get paid to address. The resulting system, says Mueller, amounts to \"a self-licking ice-cream cone.\", By now, the worry about terrorism is ingrained in us. In the wake of the Paris attacks, a Pew poll found, nearly 2 out of 3 Americans are \"somewhat\" or \"very\" worried that a terrorist attack will soon happen here. But public fear has been that high for years. When an attack happens, we expect more attacks and when no attack happens, we expect more attacks. A plurality of citizens consistently worry that the government is doing too little to combat terrorism. What is easy to forget is that people in general and Americans in particular enjoy exceptional levels of safety. There was a true threat to our national existence during the Cold War, when nuclear incineration was perpetually half an hour away. There was far more terrorism on U.S. soil in the 1970s, when leftist radicals carried out hundreds of bombings, and even in the 1990s. The chance that extremist violence will touch any of us directly was minuscule before the latest attacks, and it still is. There simply arent that many people with the will, resources and acumen to engage in serious terrorist operations. But dont expect that fact to get much attention. As journalist H.L. Mencken once wrote, \"The whole aim of practical politics is to keep the populace alarmed and hence clamorous to be led to safety by menacing it with an endless series of hobgoblins, all of them imaginary.\", The danger today is not imaginary, but neither is the danger of being struck by lightning. We dont organize our government or lives around avoiding that risk, and we shouldnt do it for terrorism. . Steve Chapman, a member of the Tribune Editorial Board, blogs at chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150115", "Author": "[Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-worry-too-much-terrorism-paris-attacks-perspec-0115-20150114-column.html", "Title": "[We worry too much about terrorism]"}