{"Content": "[The 9th U.S. Circuit Court of Appeals has denied Gov. C. L. \"Butch\" Otters request for a review of the courts ruling last year that overturned Idahos ban on gay marriage. Otter had requested that an 11-judge panel review the October decision by three judges that Idahos same-sex marriage ban was unconstitutional. On Friday, the 9th Circuit rejected Otters request. Three judges dissented from the majority, noting that a 6th Circuit decision upheld similar laws in four states. \"Clearly, the same-sex marriage debate is not over,\" the three said in a 25-page dissent, adding that \"thoughtful, dedicated jurists\" have considered the issue and come up with differing results. The dissenting judges called the issue a \"question of exceptional importance\" that should have been reviewed. Gay couples have been able to marry since shortly after the original appellate court ruling. Four lesbian couples filed the lawsuit challenging the states marriage ban. The National Center for Lesbian Rights praised Fridays decision, saying the original three-judge ruling was consistent with other federal judicial decisions, \"which have rightly concluded that our Constitution cannot tolerate the profound harm that denying same-sex couples the freedom to marry inflicts (on) those couples and their children.\", Last week, Otter and Idahos attorney general filed separate petitions to the U.S. Supreme Court, fighting against gay marriage and arguing that the states case has national consequences. Attorney General Lawrence Wasdens filing stated that the issue is a matter of a states right to define marriage without the federal governments involvement. Otter asked the Supreme Court to review Idahos case alone or in addition to a pending case involving the 6th Circuit, which upheld the right of Kentucky, Michigan, Ohio and Tennessee to decide whether to allow gay marriage. Otters petition maintains that unlike in other states, Idahos public officials have not shied away from defending a broad definition of heterosexual marriage. Associated Press]", "Date": "20150109", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-idaho-gay-marriage-20150109-story.html", "Title": "[Court won't reconsider ruling that overturned Idaho same-sex marriage ban]"}