{"Content": "[In the language of headline writers, he is \"Muslim Man,\" hailed as a hero for hiding hostages during last weeks terrorist attacks by Muslim fanatics in France. When the kosher supermarket where he works in eastern Paris came under siege, Lassana Bathily put his own life at risk to hide a half-dozen terrified customers in a walk-in refrigerator. But when the 24-year-old shop assistant managed to escape through a back exit, police immediately forced him to the ground, handcuffed him and took him into custody. Thats because Bathily, an immigrant from Mali in West Africa, fit the description of Amedy Coulibaly, one of the terrorists young black male with a dark complexion. Police held Bathily in handcuffs for an hour and a half, he later told French TV, before a friend identified him and he was freed to help police plan their assault that freed the surviving hostages. Thats when he became \"Muslim Man,\" a hero in the headlines. Thousands signed an online petition that called on French President Francois Hollande to grant Bathily automatic citizenship for his heroism. He was compared immediately to Ahmed Merabet, the Muslim police officer who was fatally shot while responding to a mass shooting at the French satirical newspaper Charlie Hebdo, by gunmen linked to Coulibaly. But Bathilys experience, judged by the color of his skin before police could learn the content of his character, also symbolizes the prejudices, frustrations and cultural anxieties of immigrants who want to assimilate into the mainstream but run into roadblocks. Paris suburbs, for example, become breeding grounds of multigenerational poverty, crime, resentment that drives too many dispirited youths into the arms of Islamic militants. And that helps to feed a backlash of support for resurgent ultra-right political parties that flirt with neo-Nazism. Mounting frustration with the lukewarm temperature of their melting pots led British Prime Minister David Cameron, German Chancellor Angela Merkel and then-President Nicolas Sarkozy of France to agree in 2011 that \"state multiculturalism,\" as they knew it, was a failure. It was doomed to fail, in my view. Unlike Americas multiculturalism, which aims to help people from diverse backgrounds bridge their differences, European multiculturalism tends to encourage more separatism. \"France does not have a national narrative of multicultural immigration,\" said a longtime friend of mine, Joel Dreyfuss, a Haitian-American journalist of mixed-race background and a veteran of major media in New York and Washington who now lives in Paris. In an email exchange, Dreyfuss listed three major impediments to assimilation in France: a history of hoping immigrants brought in as guest workers from former colonies eventually would go home, a widespread sense that any expression of ethnic or racial identity leads to a pernicious and separatist \"communitarianism,\" and a refusal in French governance to take census tallies by race or religion. \"Colorblindness\" sounds good as a public policy but not when it blinds leaders to the special problems such as discrimination in jobs and housing or the root causes of inequities in income and education faced by low-income communities. Will the terrorist attacks make things worse? Will leaders do more than call for extra security, more surveillance and bigger intelligence budgets?, \"What I worry about is that very few people will be in the mood to address the alienation and the sense of exclusion that drives some of these young people into the arms of the Islamists,\" Dreyfuss said. So do I. As much as some hard-liners complain that immigrants dont really want to leave their enclaves and assimilate into the mainstream, the American experience tells us that assimilation is a two-way street. Newcomers need to feel invested in their new home. Then they and, even more eagerly, their children will feel as though they have a stake in joining and improving their new home. In that spirit, Bathily offers advice that transcends oceans. \"Yes, I helped the Jews,\" he said on French television. \"I didnt know or care if they were Jews or Christians or Muslims. Were all in the same boat.\", Or, as I have heard veterans of Americas civil rights movement say, we may have arrived on different ships, but were in the same boat now. Clarence Page, a member of the Tribune Editorial Board, blogs at chicagotribune.com/pagespage. \"Culture Worrier,\" a collection of his best columns, is available in print and at chicagotribune.com/ebooks. cpage@tribpub.com, Twitter @cptime]", "Date": "20150113", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-charlie-hebdo-multicultural-europe-muslim-bathily-perspec-0114-jm-20150113-column.html", "Title": "[Europe's lukewarm ethnic melting pot]"}