{"Content": "[The onetime head of the Illinois Association of Chiefs of Police was sentenced Friday to more than two years in prison for misusing more than $200,000 in donations and grants for a regional helicopter program he spearheaded. A tearful Timothy J. Swanson, 56, of Bourbonnais, apologized to a federal judge for his actions that derailed a long law enforcement career that included winning a policing award for the helicopter program. His family and friends hugged some holding back tears when they heard his sentence. Yet to be determined is exactly how much in restitution Swanson will have to repay, particularly to his old employer, the city of Countryside, which said it spent six years and more than $450,000 to help uncover the crimes. Swanson pleaded guilty in January to seven charges involving a helicopter program he ran in Countryside, as chief of police there, and, later, Kankakee County. Federal guidelines called for Swanson to be sentenced to roughly three to four years in prison U.S. District Judge James E. Shadid said he lowered the sentence to 27 months to recognize Swansons years of public service, although the judge questioned the extent of Swansons remorse. In the brief apology, Swanson told the judge he regretted not hiring a \"professional\" to ensure he didnt mix money raised for the nonprofit helicopter program he ran with a separate for-profit side business he ran and his personal purchases. But Assistant U.S. Attorney Eugene Miller argued the fraud was far worse. In seeking a sentence of at least 46 months, Miller said Swanson, despite collecting a six-figure salary as chief, knowingly stole $229,128 and used it to build a new sunroom on his home, pay down a personal credit card and prop up his for-profit business, among other things. Miller said part of the scheme included creating a fake invoice, years of lies, and stonewalling and retaliating against those who questioned him. Swanson had gained fame in law enforcement circles in 2005 by starting a regional helicopter program with the stated mission of nabbing criminals and thwarting terrorists. Federal officials lent the program two military surplus helicopters, and Swanson collected government grants and more than $350,000 in donations from area police departments and others on the promise the cash would be used to outfit and operate the helicopters. But a 2012 Tribune investigation found the program was fraught with problems. They included Swanson teaming up with a felon to run the program and start side businesses one of which received grant money controlled by Swanson. The article also documented how Countryside officials accused Swanson of \"extensive wrongdoing\" in a civil case and how Swanson, by then retired from Countryside, invoked his Fifth Amendment right to avoid providing documents, citing a fear that information he provided could be used to prosecute him. By then, even as the helicopter program was going defunct, Swanson had become president of the Illinois Association of Chiefs of Police. He cast himself as a victim of unfair attacks while quitting the chiefs group in a move that stopped it from investigating him. Swanson briefly pursued a lawsuit against Countryside and the Tribune in 2013. He ultimately dropped the lawsuit. But his attorney, Lawrence Beaumont, continued to argue Friday to the judge that the suburbs efforts amounted to a \"vendetta\" against Swanson. Swanson was accused of fraud, money laundering, income tax evasion and filing false tax returns. Prosecutors had originally accused Swanson of misusing more than $250,000 but slightly lowered the amount Friday. In court Friday, Countrysides city administrator, Gail Paul, told the judge that Swanson targeted those who questioned him, leading to one employees dismissal and years of headaches and costly fees to an outside law firm to uncover the misdeeds. The suburb turned over its findings to federal authorities, who obtained Swansons bank and tax records to help uncover the fraud that led to the charges. The judge said the debate over Swansons alleged vindictiveness didnt factor into his sentence, although he questioned Swansons actions. \"Clearly theres evidence that you went on the offensive to accuse those that were accusing you, and ... in many respects, they were right and you werent,\" Shadid said. The judge ordered Swanson to report to prison Aug. 11. Remaining to be determined is how much money, if any, he should be forced to reimburse Countryside for its investigation costs, in addition to the $229,128 authorities said he misused. Swanson also will have a separate hearing, in Countryside, on whether hell lose his Countryside pension based on his conviction. jmahr@tribpub.com]", "Date": "20150529", "Author": "[Joe Mahr]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-countryside-former-chief-sentencing-met-20150528-story.html", "Title": "[Ex-top cop in Countryside gets 27-month prison term for fraud ]"}