{"Content": "[Who yelled \"everybody into the pool?\", After all the candidate announcements, after all the speculation about whod go first and whos yet to jump in, one question remains in this summer BEFORE the election year: Why are so many Republicans running for president?, Surely, the soon-to-be-17 announced GOP candidates dont all think they will become president. But its easy for a politician to get caught up in the hype and yell \"cowabunga!\" in a year when theres no incumbent seeking re-election and no Republican who seems to have an inside track to the nomination. Plus, its easier than ever to make a credible run for president, thanks to the equalizing effects of social media and digital fundraising, and with looser federal rules in place on raising money. The apt question for an ambitious Republican this year seems to be: Well, why not?, With a tweet that \"Im in,\" Wisconsin Gov. Scott Walker added his name to the list on Monday. Ohio Gov. John Kasich and former Virginia Gov. Jim Gilmore are due to follow in coming weeks, bringing the total by summers end to at least 17. \"Every now and then you have an election cycle that is defined by what can be best described as me-too-ism,\" says Mo Elleithee, executive director of Georgetowns Institute of Politics and Public Service and a onetime spokesman for Hillary Rodham Clintons 2008 presidential campaign. With any number of theoretical pathways to the GOP nomination, second-tier candidates may well have surveyed the field and said to themselves, \"Why cant I burst into that top tier?\" says Elleithee. \"Everybody is sitting there with their advisers, slicing and dicing the electorate, and either finding a potential path or deluding themselves into finding a potential path.\", Tony Fratto, a Washington consultant who worked for President George W. Bush, says theres far more than delusions motivating candidates. Beyond the generally easier mechanics of running for office, he says, there are all sorts of incentives to run that have nothing to do with actually being president. \"You have the opportunity to become a personality in a relatively short period of time,\" says Fratto. \"You get on the national stage, your name ID is elevated and that can translate into writing books, giving speeches and getting an opportunity to go on TV.\" Not to mention a potential job as vice president or in the Cabinet. It worked for former Arkansas Gov. Mike Huckabee, whos running again after parlaying his losing candidacy in the 2008 primaries into political celebrity, including TV and radio shows and book deals. The should-I-run equation is different on the Democratic side, where Clinton is dominant, but even there, four other notable candidates have joined the against-the-odds race. A look at some of the reasons so many candidates are running this year:, WAITING FOR A STUMBLE, Some candidates run just in case. If top-tier candidates suddenly falter, these challengers want to make sure theyre positioned to step right up. These types \"genuinely think things can fall apart\" for the top candidates, says Princeton historian Julian Zelizer. He puts New Jersey Gov. Chris Christie and Kasich in that category. In Christies case, says Zelizer, \"I think part of him hopes that people will see how great he is according to him\" if an opening emerges. THE OBAMA EFFECT, The election of a junior Illinois senator with a funny name as president in 2008 has heartened candidates who might not otherwise have thought of themselves as ready to run. \"What Barack Obama proved in 2008 is that you dont need all that much experience,\" says Fratto. \"You can take on a presumed front-runner, and you can raise money and improve your name ID very quickly. That possibility wasnt imaginable in the past.\", Obamas precedent has to hearten Marco Rubio from Florida and Ted Cruz from Texas, both 44-year-old freshman senators, and 52-year-old rookie Sen. Rand Paul of Kentucky. TAKING TURNS, Senior politicians may look at relative newcomers whove gotten into the race, and think, \"Wait, its my turn.\", Elleithee envisions veterans such as Sen. Lindsey Graham of South Carolina and Kasich asking themselves, \"Why should these young up-and-comers be seen as more credible than me?\", IDEA GUYS, Some candidates run to get their ideas in the mix even if their candidacies face long odds. Graham is pushing the Republicans to focus on national security. Vermont Sen. Bernie Sanders is pressing Democrats to do more to address income inequality. BIG MONEY, In the aftermath of the Supreme Courts 2010 ruling that loosened fundraising rules, says Zelizer, \"all you need is a few wealthy people and you can be a presidential candidate.\" Candidates may not have enough money to go the distance, but a supportive billionaire or super PAC can bankroll a candidacy that otherwise might not go far. Casino titan Sheldon Adelsons millions kept Newt Gingrichs 2012 candidacy afloat long after it otherwise would have gone under. Super PACs will file paperwork later this month that will help show whos benefiting from big donors this time around. SMALL DOLLARS, No sugar daddy? No problem. Online fundraising and social media have made it cheaper and easier for candidates to haul in lots of small contributions. Retired neurosurgeon Ben Carson is relying on small contributions to propel his GOP campaign. And on the Democratic side, Sanders upstart challenge to Clinton is pulling in millions mostly through small donors on the Internet. BUILDING THE \"ME\" BRAND, Businessman-showman Donald Trump has to know hes not going to be president. His self-promotional candidacy helps keep him in the news, something hes clearly relishing even if its triggered a backlash thats going to cost him. Companies and organizations are lining up to cut ties to Trump after his much-criticized comments about Mexican immigrants. Associated Press]", "Date": "20150713", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/lifestyles/ct-gop-presidential-candidates-20150713-story.html", "Title": "[Why is the 2016 GOP field so big? ]"}