{"Content": "[\"What makes these 17-year-old kids pick up an AK-47 instead of trying to start a business?\", Its a question State Department spokeswoman Marie Harf asked Monday evening on MSNBCs \"Hardball.\" She was on air to give a preview of this weeks White House summit on \"countering violent extremism.\", And its also a puzzle that has confounded the U.S. government since the Sept. 11 attacks. In order to make a long-term dent in the conflict that used to be known as the war on terror, one has to ask why people join these murderous organizations in the first place. Presidents George W. Bush and Barack Obama have both spoken of such root causes. Harf suggested in her remarks that the West should address economic misery and poor governance to stop young people from joining the violent jihad. But are she correct? Some young people -- particularly those born far away from the conflict in the Middle East and North Africa -- are just bored. No amount of small-business loans, education scholarships or political reform can compete with the toxic temptation of being part of a movement that claims to be changing history. Radical Islam is hardly the first movement to take advantage of bored young people. Think of all the dreamers who flocked to both sides of the Spanish Civil War, or the utopians who volunteered to fight against great odds to create Israel. Then there was the first generation of holy Muslim warriors and foreign fighters who fought against the Soviet occupation of Afghanistan in the 1980s. Today the big historical draw for many bored young people is the promise of the caliphate. Shiraz Maher, a former member of the global radical group Hizb ut-Tahrir and now a researcher at the International Centre for the Study of Radicalisation in London, told me he joined jihad after 9/11 because he wanted to be part of history. Maher comes from a middle-class family in Britain and was not drawn to political Islam out of despair. Following race riots in northern England, he decided at age 20 to join a group that looked like it would be on the winning side. \"My feeling was that there was a sense we were going to create a new history,\" he told me. \"We are going to be part of something new.\", Looking back on his time inside the organization, he thinks the group is relatively tame compared to the Islamic State. \"They are actually achieving a caliphate that we were only philosophizing about,\" he said. His point is an important one. Many of the recent major jihadists had plenty of economic and educational opportunity. Mohammed Atta was studying graduate-level architecture in Hamburg before he took the path to hijacking one of the planes that crashed into the World Trade Center. Ayman al-Zawahiri, the current leader of al-Qaida, studied medicine at the University of Cairo. Osama bin Laden came from a prominent family of Saudi builders. One recent study found that family money and education could be social indicators of inclinations toward terrorism. Released last year by Queen Mary University in London, it found that \"youth, wealth, and being in full-time education were risk factors associated with radicalization.\" Maher said in his four years inside Hizb ut-Tahrir, he found many of the most active members were students or college graduates. This is not always the case. Abu Musab al-Zarqawi, who founded the predecessor organization to the Islamic State, was born into a slum near Amman, Jordan, and became radical in prison. But more often than not, at a certain point the path to radicalization plays on the deep desire of young people to be a someone in a movement that stands for something, no matter their backgrounds. The argument that radical jihadists offer young people a worthy struggle is made persuasively in a new article on Islamic States ideology by the Atlantics Graeme Wood. He concludes that Islamic State recruits \"believe that they are personally involved in struggles beyond their own lives, and that merely to be swept up in the drama, on the side of righteousness, is a privilege and a pleasure -- especially when it is also a burden.\", Unfortunately, the White House conference on counter-radicalization seems to miss this point. The agenda is loaded with academic-style jargon. \"Vectors of radicalization\" will be discussed. Extremism will be countered and positive narratives will be promoted online. It all sounds like an academic seminar on stopping gang violence, not a global summit to stop a death cult. Indeed, Obama conflated the issues explicitly in an interview with Vox earlier this month, in which he compared his job of fighting terrorism to that of a big-city mayor fighting crime. This approach will not do. Instead of downplaying the threat of terrorism, Obama should heighten the contradictions. He should warn young people, particularly young Muslims, about the acute ideological danger coming from the Middle East. And then tell them it is the solemn calling of all those who cherish our open society to join our long war against Islamic Fascism. Instead of pandering, Obama should give the bored youth what they want: struggle. Bloomberg View, Eli Lake is a Bloomberg View columnist who writes about politics and foreign affairs.]", "Date": "20150218", "Author": "[Eli Lake]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-islamic-state-recruiting-youth-20150218-story.html", "Title": "[Islamic State's best recruiting tool is youth boredom]"}