{"Content": "[Chicagoans mentioned in newly released Hillary Clinton emails include the president of CME Group and a Chicago tax lawyer who once worked for her husband. On Sept. 24, 2009, Terrence Duffy, executive chairman and president of the Chicago-based CME, wrote to Clinton, then U.S. secretary of state, telling her that he was being presented an award from American Friends of the Hebrew University. \"I would be honored if you would consider delivering the keynote speech at this event,\" Duffy wrote. \"Youre doing an amazing job,\" added Duffy, who signed the email \"Terry.\", Clinton responded five days later. \"Terry: I often have little control over my schedule these days, but we will look closely at this and let you know,\" she said. A spokeswoman for CME Group said Wednesday that Clinton didnt speak at the event. On Dec. 2, 2009, Duffy again wrote to Clinton. He told her that he had dinner the previous night with \"a mutual friend of ours,\" Sen. Lindsey Graham, R-S.C. \"Lindsey always talks about how much he likes you and said if I were to be in contact with you to say hi from him.\", Both Graham and Clinton are now running for president. Earlier that year, Duffy wrote to Clinton saying that about 150 exchange employees would be in Washington for an annual gathering, including a May 19 dinner at Hay Adams. \"It would be a tremendous honor if you would come by and say a few words,\" Duffy wrote. \"If this doesnt work but you are in town, Id love to stop by for 5 minutes to say hello.\", The CME spokeswoman declined to comment on whether Clinton attended the dinner or whether Duffy stopped by to see her for a brief visit. Emails from Betsy Ebeling, a longtime friend who works for the state of Illinois, were also included in the batch. Ebeling wanted to let Clinton know that Chicago tax lawyer Kevin OKeefe was going to be honored at a Chicago-Kent alumni awards event. From 1993 until 1997, OKeefe served on the White House staff of President Bill Clinton, according to the website of OKeefes law firm. Clinton asked that the news be printed out. An appearance on Oprah was also discussed in 2009 by Clinton and her aides. \"Who will interview me?\" Clinton asked on Aug. 29, 2009. \"Lisa Ling. Shes an Oprah correspondent,\" was the reply. Clinton said she was pressed for time and leaving town. \"Oprah can do Monday in the Hamptons,\" the aide said. byerak@tribpub.com, Twitter @beckyyerak]", "Date": "20150701", "Author": "[Becky Yerak]", "Link": "http://www.chicagotribune.com/business/ct-hillary-clinton-emails-0701-biz-20150701-story.html", "Title": "[Clinton emails mention CME's Terry Duffy, Oprah, local tax lawyer]"}