{"Content": "[New Jersey Gov. Chris Christie offered a vigorous defense of post-Sept. 11 surveillance tactics on Monday, backing existing programs and calling for an expansion of intelligence-gathering capabilities even as Congress seeks ways to rein in the programs. Christie, who spent seven years as the U.S. attorney in New Jersey before he was elected governor, said that he had used provisions of the Patriot Act in pursuing terrorists after the Sept. 11 attacks and argued that the country must not weaken its anti-terror and surveillance laws. \"We need to toughen our anti-terror and surveillance laws to give our services the legal mechanisms to do their job,\" he said in a foreign policy-themed speech. The likely Republican GOP presidential candidate took specific aim at former National Security Agency contractor Edward Snowden, who in 2013 leaked thousands of documents to journalists. Among Snowdens revelations: NSA had for years been secretly collecting data about millions of Americans landline phone calls. \"When Edward Snowden revealed our intelligence secrets to the world in 2013, civil liberties extremists seized that moment to advance their very own narrow agenda,\" he said. \"They want you to think that theres a government agent listening in every time you pick up the phone or Skype with your grandkids. They want you to think our intelligence community are the bad guys straight out of the Bourne Identity or some other Hollywood thriller. They want you to think that if we weakened our capabilities, the rest of the world would somehow love us more.\", \"Lets be clear, all these fears are exaggerated and ridiculous. When it comes to fighting terrorism, our government is not the enemy,\" he said. Last week more than 300 House members voted to end the NSAs bulk phone records collection program and replace it with a system to leave the data with telephone companies and allow the NSA to search the data on a case-by-case basis. The supporters of ending the program include Democrats and Republicans, and even the NSA doesnt object to having private companies store the data. Independent reviews have found that the bulk collection program did not foil a single terrorist attack. But Christie slammed those pushing reforms as \"intellectual purists\" and insisted law-abiding citizens had nothing to fear from the surveillance efforts. \"The vast majority of Americans are not worried about the government listening in on them, because it hasnt happened. They are worried about what happens if we dont catch the bad people who want to harm our country,\" he said. Christie, who has said he will announce his White House plans by the end of June, spoke on the bank of the Piscataqua River, with the Portsmouth Naval Shipyard in the distance behind him. Throughout his speech, he painted himself as an antidote to what he described as President Barack Obamas weak leadership abroad. He argued the case for a more active U.S. presence overseas, bolstered by a larger military and increased defense spending. He also criticized presidents approach to the Islamic State militants and the emerging nuclear deal with Iran, as well as Russias backing of separatists in Ukraine and Chinas encroachment in the South China Sea. \"All these things are happening because American power is in retreat and weve backed away from the principles that made us a source of strength and stability,\" Christie said. \"No one understands any longer whom America stands with or whom we stand against. No one understands exactly what we stand for and what were willing to sacrifice to stand up for it. The speech is the third Christie has delivered in recent weeks in the early-voting state as he lays the groundwork for an expected campaign. His previous speeches focused on overhauling Social Security and lowering taxes on individuals and corporations. Christie has been working to try to re-establish his place in the top tier of likely candidates after the fallout from the George Washington Bridge scandal. Hell hold his fifth town hall event in the state Monday evening. Associated Press]", "Date": "20150518", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-chris-christie-larger-military-20150518-story.html", "Title": "[Christie calls for new government surveillance powers ]"}