{"Content": "[Wisconsin Gov.Scott Walker was a target of a now-closed criminal investigation that included his aides and associates during his time as Milwaukee County executive, according to court papers that became public Wednesday. Walker, now a top-tier Republican presidential candidate, was never charged in the investigation. The inquiry, the first of two so-called John Doe probes into potentially unlawful Walker campaign activity in Wisconsin, led to convictions of six of his aides and associates. The newly released court documents show Walker was at the center of the probe, in contradiction ofhis repeated statements at the time that he wasnt a target. I submit that there is probable cause to believe that Scott Walker ... committed a felony, i.e. Misconduct in Public Office, Robert Stelter, an investigator in the Milwaukee County district attorneys office, wrote in a September 2011 affidavit for a search warrant. Just before Walker faced a recall election in June 2012, he said that the idea that he would become a subject of the probe was just more of the liberal scare tactics out there, desperately trying to get the campaign off target, according to the Milwaukee Journal Sentinel. The new court papers show that nine months earlier, prosecutors thought there was probable cause he had committed a crime. The information released today comes from a case that has been closed for more than two years, Walker campaign spokeswoman AshLee Strong said in a statement. It is another example of the politics involved in this process as people who could not prove things in a court of law are attempting to win in the court of public opinion. The court records became public, on the eve of the first Republican presidential debate, as part of a civil lawsuit brought by former Walker aide Cindy Archer. Shes suing Milwaukee District Attorney John Chisholm, a Democrat, arguing her constitutional rights were violated when investigators searched her home as part of the probe. The second John Doe investigation involving Walker was a state criminal investigation into whether a conservative group improperly coordinated with his 2012 recall campaign. Last month, the Wisconsin Supreme Court essentially ended that investigation after finding no laws had been broken. In Wisconsin, a John Doe investigation is the equivalent of a grand jury probe, only without jurors. Its led by a district attorney or, in the Walker campaign finance case, by a court-appointed special prosecutor. The proceedings are kept secret, with court documents filed under seal, ostensibly to protect the subjects of the investigation from being publicly identified until charges, if any, are brought. Walkers appearance in the court documents was reported earlier by WisPolitics.com.]", "Date": "20150806", "Author": "[John McCormick]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-scott-walker-was-target-in-now-closed-wisconsin-criminal-probe-20150806-story.html", "Title": "[Scott Walker was target in now-closed Wisconsin criminal probe]"}