{"Content": "[About 200 Chicago schoolteachers, wearing the red T-shirts their union has embraced as a symbol of solidarity against Mayor Rahm Emanuel, gathered in a Pilsen union hall recently for a workshop that doubled as a political rally. \"The whole country is watching Chicago,\" said Jesus \"Chuy\" Garcia, the events featured speaker who is hoping to unseat the mayor in the April 7 runoff election. \"Teachers taught Chicago how to fight back. Karen Lewis called (Rahm) out and said, You will not bully me; you will not bully teachers in Chicago. \", There are many dimensions to the unexpected re-election struggle Emanuel has experienced, perhaps none more fundamental than the resentments stirred over his stewardship of the public schools that serve more than 396,000 city youngsters, the vast majority of whom are black or brown and poor. Garcias mayoral candidacy is a direct outgrowth of a pitched battle between Emanuel and the Chicago Teachers Union over a longer school day, a seven-day strike and a record number of school closings. Lewis, the fiery union president, was about to run against Emanuel for mayor until a cancer diagnosis last fall. So instead she recruited Garcia, who has relied on the CTU to boost his ground game and elevate his national profile. He is trying to raise money by casting the race as a proxy for a broader national struggle over the future of schools, pitting unions and political progressives against advocates of school privatization, and increased testing as a gauge of progress. For his part, Emanuel says Chicago Public Schools has chronically shortchanged the children that the district is supposed to serve, and he sees the union forces allied with Garcia as complicit. Brushing aside pushback, Emanuel closed 50 neighborhood schools in one fell swoop, expanded reliance on privately-operated-but-taxpayer-underwritten charter schools and lengthened the school day. \"I made sure that we were going to take on our politics that were holding our kids back,\" Emanuel said at a mayoral debate this month. \"Did I push sometimes too hard when I needed to slow down? Thats on me, and I own that.\", The three Rs, Front and center in the simmering school tensions is a Chicago twist on the three Rs: reform, respect and Rahm. Arithmetic is another key part of the equation, with school finances so shaky that the districts creditworthiness has been downgraded under Emanuels watch to just shy of junk bond status by two major rating agencies. Discussion of property tax hikes is virtual poison these days for any political aspirant, one reason why both mayoral contenders identify the hikes as a last resort to untangling a financial mess at CPS years in the making thats aggravated by a sorely underfunded employee pension system. As it is, more than half of a typical property tax bill in Chicago already is earmarked for school spending. Thats left Garcia non-committal on how to fix the districts financial woes and Emanuel looking to Springfield for help. \"I cant tell you right now how I would solve it, but I do tell you I will have the finances of Chicago Public Schools audited so the citizens know where the money has been going and what kind of risky investments members of the board have engaged in that have put at risk the financial stability of the system,\" Garcia said during the runoff campaigns first debate when asked how hed right CPS financial ship. \"No mayor can tell you that right off the bat.\", Emanuel shot back at Garcia. \"We have a $1 billion problem, and Chuy, we actually do know. This is not after the election, heres a surprise,\" the mayor said. \"Three-quarters of the problem comes from pensions, because we have this crisis, this is actually a chance to actually resolve this. Springfield knows this.\", But beyond asking Republican Gov. Bruce Rauner and state lawmakers to stop making Chicago taxpayers fund both CPS pensions and those of Downstate and suburban districts, Emanuel hasnt offered many more specifics than Garcia on the districts finances. During a Wednesday night forum, Garcia said hed push for a graduated state income tax that would charge high-income earners more to raise money for CPS, a return to an idea Garcia talked about early in the campaign. It, however, would require a change to the Illinois Constitution, a politically difficult task that would take years to accomplish. While the rivals talk around financial issues, they have staked out different visions for improving academic performance. Emanuel ticks off a list of what he says have been accomplishments the last four years, as well as plans for the next term. In the telling, however, the mayor sometimes glosses over the fine print. Garcia borrows from CTUs policy playbook while promising to bring a more collaborative approach to leadership better attuned to the educational needs of Chicago neighborhoods, which he contends Emanuel has all but ignored. Emanuel dismisses that as empty rhetoric and evidence that Garcia lacks substance. The challenger and supporters say children and educators alike have become pawns in a tone-deaf corporate agenda taken up by Emanuel, whose reforms they liken to a bait-and-switch. \"(Emanuel) mandated full-day kindergarten without funding full-day kindergarten,\" said Troy LaRaviere, the principal of Blaine Elementary School in the Lakeview neighborhood, at a recent Garcia fundraising event. \"Which means that we have to increase class sizes so that we can afford the extra teachers. Which means we have to end library programs so we can afford the extra teachers. What happened is that kids get an extra half day of school in their first year and then youre overcrowding classrooms for the next 12.\", A CPS spokesman took issue with that characterization, saying the district funds full-day kindergarten without making schools choose between paying for kindergarten and other programs. Tribune polling underscores why school policy is a potent issue in the mayoral race. A survey in late January found nearly twice as many people disapproved as approved of Emanuels handling of the school system. Even more said they sided with the CTU over Emanuel in their ongoing feud. Still, another Tribune poll conducted this month found voters almost evenly split over which mayoral contender was better equipped to improve the schools 42 percent sided with Emanuel and 39 percent with Garcia. But among those voters with children enrolled in the public schools, Garcia held a strong edge over Emanuel 52 percent to 33 percent. School closings, Illustrating the stakes was the unusual television ad Emanuel used to launch the runoff campaign. Staring squarely into the camera, Emanuel acknowledged \"I can rub people the wrong way\" while insisting his heart was in the right place. The mayor never spelled out what he was sorry for, but few things antagonized voters more than the school closings. The 2013 decision was the largest school shutdown by an urban district in recent history, drawing protests from many African-American and Hispanic parents who feared their children would be subjected to longer and more dangerous walks to school across competing gang territories. During the campaign, Emanuels primary explanation has been that he wanted to move thousands of students out of underperforming schools and into better ones. A recent study by a University of Chicago education think tank concluded that while most schools that took in displaced students were better academically than the ones that closed, they were not substantially better. Emanuels main argument for the closures also has shifted since they were imposed over the strong objections of many parents and educators. Back then, the mayor and his handpicked school board stressed that nearly half of all schools in the city were underused, leaving 100,000 desks empty. But, the Tribune reported, that statistic assumed each classroom ideally should be comprised of 30 students far more crowded than average class sizes in the city and across the state. Garcia frequently points to the closings as an example of Emanuels disregard for community input, but he also isnt rushing to reopen them. \"Ive stated that Id work with community groups in repurposing those schools and that if some great ideas about possibly opening one or two up, that we would look at that,\" Garcia told reporters this month. \"But there is no commitment whatsoever at this point, because it would be fiscally irresponsible.\", Policy differences, The two candidates have very different approaches on addressing school policy. Garcia is often vague about what he would do, instead choosing to attack Emanuel for what hes done. Take last week, when Garcia was asked how hed pay for his call for a $15-an-hour minimum wage at CPS amid a more than $1 billion budget deficit. \"The challenges that CPS is facing are real. Theyre huge. In part, its due to the poor financial stewardship that has been in place over the last four years,\" Garcia said. \"Who appoints a school board? Mayor Emanuel. Who appointed the president of the school board? Mayor Emanuel. ... The situation is worse today than it was four years ago.\", In contrast, Emanuel is awash in specifics. He frequently cites the citys improved high school graduation rate under his watch, mentioning a statistic that projects 80 percent of high school freshmen being on track to graduate. But thats not the same as Chicagos graduation rate, which has improved to 69 percent, up from 58 percent when Emanuel took office, according to CPS numbers. The boost in the citys graduation rate follows trends both national and local the districts rate has been climbing for the past decade except for one year, 2008, when numbers slipped slightly. Emanuels campaign also notes his advocacy of \"universal\" pre-kindergarten, declaring in a social media ad that a vote for Emanuel is a \"vote for universal pre-school.\" But the mayors plan isnt universal theres a family income test that limits benefits to families living within 185 percent of the federal poverty level, which is about $45,000 for a family of four. The mayor has made City Colleges of Chicago a focus of his tenure, often pointing to a program he started that allows CPS high school students who graduate with at least a B average to be eligible for free tuition. When the program launched, City Colleges officials acknowledged it would apply to a limited pool of students, since 85 percent of CPS graduates already qualify to get all their tuition, book and fee costs covered by various state and federal grants. A central theme of Emanuels campaign is the mayors willingness to sacrifice political gain for the sake of making difficult but necessary decisions when it comes to the betterment of schools. The CTU has blistered Emanuel, especially Lewis, who has called the mayor a \"bully\" who is \"murdering schools.\", Nothing may illustrate that better than a tangle with Lewis and her union over the length of the school day, which Emanuel argued was unreasonably short and deprived children of a well-rounded education. Teachers complained the mayor laid out no plans to use the extra time constructively, while also saying they should be compensated for it. The debate opened a chasm of distrust between the union and Emanuel from the moment he took office in May 2011. The two sides eventually reached a compromise, even as they fought over other issues, and more than an hour was added to daily school schedules. That deal was struck in summer 2012, weeks before teachers walked off the job in a separate contract dispute that eventually secured modest pay hikes. Double-edged sword, Garcias close connection with the CTU presents him with a big political upside but also a dilemma. Its members have frequent contact with parents, and many teachers can be expected to serve as a ready-made get-out-the-vote street army on Election Day, which by coincidence comes during a week when school staffers are on spring break. The challenger has relied heavily on teachers unions to fill his campaign bank account theyve accounted for $1.7 million of the $4.5 million hes raised. The challenge for Garcia has been to explain how, if elected, he could reconcile his embrace by the union with the demands of a financial crisis likely requiring sacrifice from district employees. His answer, short on specifics, amounts to a variation on the old idiom about being able to catch more flies with honey than vinegar. Garcia frames his respectful relations with the CTU as a plus thats better than Emanuels in-your-face style. The CTU also has long pushed for switching to an elected school board, an idea Garcia now champions though he initially was on the fence. Emanuel also has close ties to political benefactors who have stood to gain financially from CPS. The mayors re-election campaign has received $250,000 in donations from a company tied to NBA legend Earvin \"Magic\" Johnson and a wealthy business partner. Days before Februarys initial round of voting, the businessmen appeared alongside Emanuel as he announced they were making a $10 million donation to a summer jobs program for city youth. The Tribune recently reported how those campaign donations followed a 2014 decision by CPS to award an $80 million contract to another one of Johnsons companies to provide custodial and facilities management services. A school principals group has complained that schools have been left filthy by subpar janitorial work from Johnsons company and another private contractor. Whoever wins next month, theyll have to negotiate a new contract with the union, which issued a series of contract demands last week. Teachers rallied outside the Thompson Center late Thursday afternoon, wrapping Garcias candidacy around a broader list of grievances with Emanuel. \"Whose schools? Our schools,\" the crowd of a couple of hundred chanted. jjperez@tribpub.com, bsecter@tribpub.com, bruthhart@tribpub.com]", "Date": "20150328", "Author": "[Juan Perez Jr., Bob Secter, Bill Ruthhart]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-chicago-mayor-race-education-met-0319-20150328-story.html", "Title": "[Differences over Chicago schools stir mayor's race for Emanuel, Garcia]"}