{"Content": "[President Barack Obama may have finally shed his summer curse just in time for a daunting fall. After a string of sunny seasons gripped by controversy, crises and plummeting popularity, the summer of 2015 has been among the most productive stretches of Obamas presidency. Late June victories in the Supreme Court on health care and gay marriage, along with a win for his trade agenda on Capitol Hill, were followed by the landmark Iran nuclear deal in July and the raising of the U.S. flag over a new embassy in Cuba in August. Instead of being overshadowed by the 2016 presidential campaign, Obamas agenda has often been driving the debate among the candidates running to replace him. And yet to the president, one of his summers biggest successes may simply be making it through his annual vacation on the tony Massachusetts island of Marthas Vineyard largely uninterrupted. While his summer troubles have often trailed him on previous vacations, hes poised to close out this years trip Sunday without any statements to the press or public appearances, beyond a few glimpses of him on the golf course and biking with his family. \"The president has absolutely appreciated the opportunity to take these two weeks outside of the hustle and bustle of Washington and spend some time with family and friends,\" White House spokesman Eric Schultz said. \"Once we return to Washington, our agenda is packed, so the president is grateful for some rest and relaxation in advance of what will be a very busy fall.\", Indeed, the president returns to Washington with a full schedule and confrontations with Congress that will help determine whether his summer momentum is sustained or sputters. Atop the presidents priorities is preventing Congress from blocking the Iran deal, which curbs Tehrans nuclear program in exchange for billions of dollars in sanctions relief. Obama will likely have to veto a resolution of disapproval by lawmakers, blemishing his signature foreign policy initiative, but he appears on track to garner enough from support from Democrats to hold off Republican override efforts. Obama is also hoping to avoid the second government shutdown of his presidency. Some conservative Republicans have threatened to hold up funding bills to keep the government open after Oct. 1 unless federal money for Planned Parenthood is cut. Senate Majority Leader Mitch McConnell, R-Ky. has dismissed the prospect of a shutdown, saying \"Weve been down this path before.\" Still, the issue has spilled into the 2016 presidential campaign, which will likely intensify the debate over linking government funding to the womens health organization. Seeking to bolster his legacy abroad, Obama will also be pushing for a global climate treaty and finalization of a free trade agreement with Asia-Pacific nations. His string of summer successes began with Congress agreeing to a fast-track approval process for the trade pact when negotiations are complete. September also holds a White House meeting with Pope Francis, a state visit for Chinese President Xi Jinping, where Beijings high-profile hacking will be on the agenda, and the presidents annual trip to New York for the United Nations General Assembly. For Obama, now deep in his second term, a busy, high-stakes agenda sure beats the alternative. His presidency appeared to be quickly slipping into lame-duck territory last year, but began to rebound after Democrats defeats in the midterm election and picked up momentum this summer. Summer has previously been Obamas cruelest season: the hostile health care town halls in 2009, the debt ceiling crisis in 2011, the presidents waffling on Syrias chemical weapons use in 2013. Last summer was consumed by the swift rise of the Islamic State and the groups gruesome beheading of Americans, as well as tensions in Ferguson, Missouri, after a white police officer fatally shot an 18-year-old black man. Free this year from an all-consuming crisis, the president spent most of the two-week summer vacation on the golf course, at the beach and dining out with his family. He also attended a party on the island thrown by Democratic power broker Vernon Jordan, who also hosted an even last year where Obama was spotted on the dance floor. But there were no images of Obama dancing this year. Perhaps in a sign that even a president riding high in his second term has a short shelf life, the band instead posted a video of a dancing Hillary Rodham Clinton, the top contender to be the next Democratic president. Associated Press]", "Date": "20150823", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-president-obama-fall-challenges-20150823-story.html", "Title": "[President Obama sheds summer curse, just in time for daunting fall ]"}