{"Content": "[Former Obama White House political strategist David Axelrod said Friday that Vermont Sen. Bernie Sanders could do well in the first two Democratic presidential contests in Iowa and New Hampshire, but it wont keep Hillary Rodham Clinton from winning the nomination. On the Republican side, Axelrod said he believes center-right voters will ultimately look to Florida Sen. Marco Rubio, Ohio Gov. John Kasich and former Florida Gov. Jeb Bush, while Texas Sen. Ted Cruz could inherit voters now backing businessman Donald Trump and Dr. Ben Carson. Speaking to more than 100 people about the 2016 race at an event hosted by the Illinois Campaign for Political Reform at the downtown University Club of Chicago, Axelrod stressed the importance of authenticity from candidates in both parties, noting that it was a key to the success of President Barack Obama and his predecessor George W. Bush. Clintons stock, Axelrod said, is \"highly undervalued and for a good reason: I think shes had a very bad summer.\" He noted Clintons controversies over the use of a private email server while secretary of state and her struggle to show voters authenticity. \"The challenge for her is to show who she is and to untether herself from the talking points, the teleprompters and to have the confidence to be herself,\" said Axelrod, senior political commentator for CNN and director of the Institute of Politics at the University of Chicago. \"People desperately want authenticity and they want an advocate. They want this race to be about them and the country and not just about her and she needs to make that happen,\" he said. Sanders, Axelrod said, \"is a thoroughly authentic guy.\" But he said someone who is a \"74-year-old socialist with a Brooklyn accent\" is, as an opponent for Clinton, \"as good as you get.\", \"I think he could do very well in Iowa. He could do well in New Hampshire. These states are entirely white. The events skew to the left. Its tailor-made for Bernie,\" Axelrod said. But, he added, \"I think it becomes a lot more difficult for (Sanders) after that when hell be in states that are much more diverse.\", He said voters believe Vice President Joe Biden has authenticity. But noting how Biden is struggling over whether to run for president in the wake of son Beau Bidens death, Axelrod said, \"until he says otherwise, Im just listening to him and assuming hes not going to run.\", Among Republicans, Axelrod said Trumps early success is a reflection of the candidates marketing skills and the ability to tap into some voters concerns over stagnant middle-class wages and controversy. \"Its easy for many of us to sort of be dismissive of him as kind of a carnival barker. But I think hes very astute. Hes found some fault line for Republican politics and American politics and it runs through all of our politics,\" Axelrod said of Trump. \"How do you make work pay again? How do you honor the kind of work that we all say we believe in and that we think is integral to who we are as a country?\" Axelrod said. He said Trump has picked \"very, very ripe targets immigrants, trade and Wall Street and there is a constituency there that is very responsive.\", Still, Axelrod said he expects the \"summer romance\" with Trump and Carson to fade moving closer to the start of the election when voters are looking for \"long, reliable, durable relationships.\", While he said he eventually could see Rubio, Kasich and Bush on one side of establishment Republicans and Cruz on the other side, Axelrod said he believes the GOP still faces difficult prospects given voting demographics. He said he expects minorities will represent 30 percent of presidential votes cast in the 2016 general election as Republicans struggle over the issue of immigration. At the same time, Axelrod said historically it is difficult for a party, such as Democrats now, to win a third consecutive term. rap30@aol.com]", "Date": "20150918", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-david-axelrod-2016-met-0919-20150918-story.html", "Title": "[Axelrod: Sanders could do well at start but Clinton will get nod]"}