{"Content": "[New Jersey Gov. Chris Christie is entering the 2016 Republican presidential nomination contest and will announce that Tuesday at his old high school, several people familiar with his plans told The Associated Press. Christie, however, insisted the reports were premature, telling listeners on his monthly \"Ask the Governor\" radio show Thursday evening, \"Theres been absolutely no final decision made by me.\", Still, Christie stopped short of denying that an announcement was planned for next week at Livingston High School, which he graduated from in 1980. \"I cant deny that because I havent made a decision. Once I make a decision, then Ill decide how I want to do it,\" he said, adding, \"Lets everybody remain calm.\", The people familiar with Christies plans spoke to the AP on Thursday on the condition of anonymity because they were not authorized to pre-empt Christies announcement. His plans were first reported by WNYC radio in New York. The Republican leader of a Democratic stronghold has been laying the groundwork for a White House run for months, traveling to early-voting states, delivering policy speeches, and raising money for two political action committees. In 2012, he decided against seeking the GOP nomination to challenge President Barack Obama, despite the urging of many prominent Republicans, saying he didnt think he was ready. This time, Christie, battered and bruised following a political scandal at home, will not be a potential front-runner when he joins a field of more than a dozen major GOP candidates. Instead, he is trying to emerge from a pack of senators, governors, businesspeople and others, with more people expected to join in coming weeks. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. \"I think its great timing,\" said Leighton Lord, a friend of Christie since college who has been serving as his informal liaison in the early-voting state of South Carolina. \"The field is still very unsettled and I think a lot of people are still looking for someone they want to support.\", Christie plans to make his announcement in the gymnasium of Livingston High School in the leafy suburban town where he grew up, about 30 miles west of New York City. He served as class president at the school for three years, and began his yearbook graduation message with the quote, \"Great Hopes make Great Men.\" Christie often talks about how his upbringing shaped his rough-and-tumble persona. After the announcement, Christie is scheduled to head to New Hampshire, where he will hold a town hall meeting in Sandown on Tuesday evening. He plans to remain in the state through July 4, according to a person with direct knowledge of the plan. The person lacked authorization to release details of Christies rollout and spoke on condition of anonymity. The decision underscores the importance for Christie of doing well in New Hampshire, which holds the partys first primary and has historically welcomed moderate candidates who visit often. The governor has already spent significant time in the state in recent weeks, holding a series of well-received town hall meetings and delivering policy speeches. But he remains a tough sell for many conservatives nationally. Ever confident in his skills as a campaigner, Christie has played up his brash persona during the weeks leading up to the launch. At the same time, Christie has stressed his ability to work with Democrats, making the case that he can expand his partys support by appealing to the female and minority voters Republicans may need in greater numbers to win the White House. Christies reputation, however, was badly damaged by the actions of several top former aides charged by federal prosecutors with closing access to a busy bridge connecting New Jersey and New York to punish a Democratic mayor who didnt endorse Christies re-election in 2013. From the outset, Christie has denied any knowledge of his aides actions and no evidence has emerged contradicting him. But the trial of the indicted aides could take months, an unwelcome distraction as Christie campaigns. Christie is likely to be one of four governors in the 2016 race, joining Louisianas Bobby Jindal, who announced his candidacy this week, and expected candidates Scott Walker of Wisconsin and John Kasich of Ohio. Speaking during the radio show, Christie said the large Republican field was good for the party, but took a shot at one of his soon-to-be rivals, former Florida Gov. Jeb Bush, who appeared to outmaneuver Christie last year by announcing he was thinking of running far earlier than expected and quickly locking up donors and advisers who may otherwise have backed him. \"I think part of the large number of candidates is a testimony to the fact that Jeb Bushs strategy failed,\" said Christie. \"I mean, Jebs strategy, as it appears to me at least was to get in in December of 2014 and to intimidate people out of the race, right? ... Well that hasnt happened. In fact, quite the opposite.\", Christie has been saying for weeks that he intended to make a decision by the end of the month but wanted to wait until the state budget had been completed. Hes expected to mark the occasion at a statehouse news conference Friday morning after using his line-item veto to slash spending from a budget passed by the Democratic state legislature Thursday evening. Associated Press, ]", "Date": "20150625", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-chris-christie-20150625-story.html", "Title": "[Sources say Christie set to enter 2016 race; not so fast, N.J. governor says]"}