{"Content": "[With his hand-picked school board rocked by a federal investigation into a no-bid contract it gave out and beset by a $1 billion-plus budget deficit, Mayor Rahm Emanuel has selected four new members to replace those whose terms are about to end. Joining the board will be Mark Furlong, retired CEO of BMO Harris Bank and the former CEO of Marshall & Ilsley Bank; the Rev. Michael Garanzini, retiring president of Loyola University Chicago; Dominique Jordan Turner, president and CEO of the Chicago Scholars Foundation, which provides college scholarships to underprivileged students; and Gail Ward, who worked for 35 years in the Chicago Public Schools system and was the first principal of Walter Payton College Preparatory High School. They will replace three school board members who voted in 2013 in favor of a $20.5 million no-bid contract for north suburban-based SUPES Academy a onetime employer of former CPS chief Barbara Byrd-Bennett. Federal authorities have opened an investigation into that contract. Byrd-Bennett resigned effective Monday as a result of the investigation. Those leaving the board are Andrea Zopp, who is challenging U.S. Rep. Tammy Duckworth in the Democratic primary for the U.S. Senate seat now held by Republican Mark Kirk; Deborah Quazzo, an education venture capitalist; and Henry Bienen, former president of Northwestern University. Also leaving will be Carlos Azcoitia, who was absent when the board approved the SUPES contract. Furlong, the recently retired chief executive of BMO Harris, was until last week board chairman of the Leap Innovations, an education technology firm that in August won a one-year CPS contract worth up to $250,000. The Chicago Public Education Fund, an elite nonprofit philanthropy group that had connections to SUPES, said last year that it would invest $750,000 with the company to expand resources and tools available to district teachers. CPS chief Barbara Byrd-Bennett has resigned, with board member Jesse Ruiz taking over to serve as interim CEO. (WGN-TV), CPS chief Barbara Byrd-Bennett has resigned, with board member Jesse Ruiz taking over to serve as interim CEO. (WGN-TV), Furlong resigned his post May 29, according to a Leap spokeswoman. Requests to interview Furlong that were sent to BMO Harris were forwarded to the mayors office. Turner is president and CEO of the Chicago Scholars Foundation and once served as a director of the Posse Foundation and the KIPP Foundation charter school organization. Garanzini announced in March that he would step down as Loyolas president to serve in an advisory role as chancellor starting at the end of the month. In 2006, Ward left her principal job at Payton College Prep to work in the school districts human resources office as an officer of its principal development sector. The new board members are expected to be installed before the Board of Education meeting in July and will be appointed to four-year terms. jebyrne@tribpub.com, jjperez@tribpub.com]", "Date": "20150602", "Author": "[John Byrne, Juan Perez Jr.]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-emanuel-new-cps-board-members-met-20150602-story.html", "Title": "[Emanuel names new CPS board members]"}