{"Content": "[Republican Gov. Bruce Rauner and the largest state employee union agreed Wednesday to keep workers on the job for another two months, even as the governor vetoed a union-led effort to go around him in their ongoing contract dispute. The short-term contract extension, which prevents both sides from initiating a strike or lockout before Sept. 30, comes as a previous one-month contract extension was set to run out Friday. The Rauner administration and the union have been haggling over wages, benefits and other employment terms. Unions, led by the American Federation of State, County and Municipal Employees Council 31, want pay raises and better health benefits. Rauner wants to keep wages flat while reducing overtime and slashing the states contribution to employee health care plans. If no deal is reached by October and another extension isnt signed Rauner could try to impose his own terms for a contract. That could force unions to choose between going along with the governors demands or going on strike. AFSCME had tried to remove that possibility by pushing a bill through the General Assembly that would let either side refer the dispute to arbitration. Rauner vetoed the bill Wednesday, saying it \"allows unelected arbitrators to impose billions of dollars of new costs on our taxpayers.\", \"This legislation is undemocratic, it is bad for our budget, and it is unconstitutional,\" Rauner said. AFSCME Executive Director Roberta Lynch said Rauners veto \"sends a disturbing message about his commitment to reaching fair contract terms with the unions representing public service workers in state government. His veto also denies the people of Illinois the assurance that the public services they rely on will continue without disruption.\", The veto sets up a likely attempt by AFSCME to garner enough support in the General Assembly to override Rauner. The contract extension, however, allows Rauner, who has aggressively sought to weaken union influence, to make the case that his administration is working toward a compromise. Democratic lawmakers said they arent convinced that more time for talks would lead to a deal. \"I suspect its much like the budget,\" said Sen. Don Harmon, D-Oak Park. \"The parties are far apart and nobody seems to be talking about the issues that would bring them together.\", A spokeswoman for Senate President John Cullerton, D-Chicago, said the chamber will consider trying to override the veto when lawmakers return to Springfield next week. \"For our caucus, its important to put the unions and the executive branch in the position of being able to negotiate without threats that are going to have a negative impact on state operations,\" Cullerton spokeswoman Rikeesha Phelon said. Democrats have supermajorities in both chambers, but the party has trouble keeping its ranks together in the House, where it would take only one defector to prevent an override. Its unclear if any House Republicans would be willing to join Democrats in bucking the governor. A spokesman for House Speaker Michael Madigan said his office will consider whether to override. \"It looks like the governor somehow believes arbitration would cost the state billions of dollars. That seems illogical, but we will take a look at it,\" Madigan spokesman Steve Brown said. \"The whole thing was designed to avoid a disruption, I wonder if this tips the Rauner hand a little bit.\", Democratic Rep. Mike Smiddy, who sponsored the arbitration bill, said the measure is needed to ensure that state employees show up to work if contract talks reach an impasse at the end of the September deadline. \"From the past 12 months of negotiations its very clear that the governor has not been willing to come off of some of their original demands of lower pay and higher premiums, it does not seem as if the governor was bargaining in good faith,\" said Smiddy, of Downstate Hillsdale. Rauner contends that he has moved to compromise with the unions and has taken a number of his demands off the table. Among those is his attempt to use the contract negotiations to coerce workers into voluntarily moving to a lesser-benefit pension plan. That idea is widely considered unconstitutional. Disagreements remain over pay Rauner wants to freeze wages while AFSCME wants an 11.5 percent raise over four years as well as health benefits and a host of other terms. AFSCME, for example, wants a health care plan that offers orthodontics for adults, while Rauner wants to reduce the states contribution to the health care plans. Monique Garcia reported from Springfield. kgeiger@tribpub.com, mcgarcia@tribpub.com]", "Date": "20150729", "Author": "[Kim Geiger, Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rauner-state-workers-contract-extension-met-0730-20150729-story.html", "Title": "[Rauner vetoes union end run on contract talks amid 2-month extension ]"}