{"Content": "[Before ramping up the number of bus lanes running through its high-rise canyons, Brazilian business hub Sao Paulo studied how such systems work in Paris, London, New York and Buenos Aires. The city of 11 million people, South Americas largest, did the same kind of international fact-finding when it launched a controversial jobs-and-housing program for crack addicts and a public-private venture to modernize street lights. \"For almost everything we are doing that is new, we try to look outside,\" said Leonardo Barchini Rosa, who heads the citys international affairs department an operation whose scale and reach is cited by urban scholars as a model for any city aspiring to forge a bigger global profile. Its one example of an outward-looking strategy that has been labeled \"foreign policy for cities,\" \"city diplomacy\" and by some academics, \"paradiplomacy.\" Sao Paulo, London, Hong Kong, New York and other megacities are swapping information and forging powerful alliances with far-flung counterparts in new and strategic ways. The efforts go beyond traditional business attraction moves, branching into collaboration in the arts, education and urban issues, from pollution to poverty. If done well, a city can gain a reputation as a hotbed of innovation, a team player on pressing urban problems and a prime location for foreign investment, business partnerships and tourism. Sao Paulo, for instance, recently was ranked No. 1 \"Latin American City of the Future\" by fDi Intelligence, a research arm of The Financial Times Ltd. Sao Paulo attracted more than 500 projects between 2010 and 2014, the report noted. \"In a world where national governments are negotiating more and more trade agreements that make national borders much less relevant, it is essential for cities to have a strategy for international relations,\" said former Toronto Mayor David Miller. Otherwise, he said, \"they risk becoming insular and isolated.\", The need for cities to establish their own foreign policies will be a major theme at the first Chicago Forum on Global Cities, a three-day symposium hosted by the Chicago Council on Global Affairs and The Financial Times. It opens May 27. Former U.S. Secretary of State Madeleine Albright will speak on the subject as part of a panel that will include the mayor of The Hague, Jozias van Aartsen, and urban affairs author Benjamin Barber. Other panels will focus on a range of topics, from economics and the environment to innovation, infrastructure, poverty, health care and security. The event is expected to attract nearly 600 participants, including business leaders, municipal officials and urban strategists from 25 countries. Most events are private, though opening, closing and ancillary sessions will be open to the public, which could bring overall attendance to 2,500. Barber contends that cities are better positioned than nations to tackle a wide range of global problems. \"Independent nation-states dont play well in the sandbox they have reacted to problems by waging war for a long time,\" said Barber, author of \"If Mayors Ruled the World: Dysfunctional Nations, Rising Cities,\" a book that builds a case for a global parliament of mayors to tackle urban problems. Cities, he argues, are less hamstrung by global tensions as well as by national-level partisan politics. While Chicago often ranks among the top global cities, in recent years it has seen anemic growth in exports and in foreign investment in new projects here. Chicago also \"has been a little more insulated than coastal cities from a sense of the larger world outside,\" Barber said. \"Chicago is just a little bit behind the curve.\", Following the forum, the Chicago Council on Global Affairs will develop a \"more effective\" international strategy for Chicago by year-end, said Ivo Daalder, president of the council, a nonprofit think tank. World Business Chicago, the not-for-profit that acts as the citys business attraction arm, will work with the council, said Andrew Spinelli, director of global strategic initiatives for WBC. Mayor Rahm Emanuels administration has tried to heighten the citys global visibility by hosting such events as the NATO Summit and the World Summit of Nobel Peace Laureates, both in 2012, and the U.S.-China Joint Commission on Commerce and Trade meeting last year. The city also signed cooperation pacts with Mexico City and eight cities in China. Now city officials are touting Beijing-based Wanda Groups recently announced plans for a nearly $1 billion riverfront hotel and condo tower as a sign that the city is gaining currency among foreign investors. Still, convincing Chicago and other North American cities to devise and aggressively pursue a far-reaching foreign policy can be a tough sell, observers say. Trips abroad can be viewed as wasteful junkets. And financial resources often are scarce, as is true in Chicago, which faces overwhelming pension debt and severe budget deficits at City Hall and the public school system. Daalder suggests aligning the efforts of Chicagos internationally focused organizations, from corporations and universities to cultural institutions and civic alliances. The city could make better use of alumni networks, for instance, \"to identify economic opportunities for companies and for the city, in a more coherent way.\", Efforts to link universities international efforts with their home cities economic development aims are under way in a number of cities that want to draw talent from across the globe. The University of Toronto, for instance, has an ongoing partnership with the University of Sao Paulo, which has led to an influx of Brazilian students. \"We have close to 1,000 Brazilian students ... and we were delighted by such a large number,\" said Meric Gertler, university president. \"Many love it here and want to stay ... it enriches the labor force because there are a lot of entrepreneurs, risk-takers.\", Meanwhile, he is fascinated by a British initiative, called \"Study London,\" in which overseas families can find information on that citys 47 universities and colleges on a single website. \"Ive said to fellow university presidents here ... We should take a leaf out of Londons book and do something here. \", Another city drawing kudos for its foreign strategy is Hong Kong, whose trade development council operates 44 offices around the world, including in Chicago. It holds international conferences to promote the idea that the city can serve as a gateway to Asia and is bringing its meeting to Chicago for the first time next month. \"Its a big deal,\" said Spinelli, noting the conference is expected to draw more than 1,000 top-level corporate executives and government leaders. \"This will let us highlight the city and help our companies make more connections.\", Sao Paulos international relations team is part of a department that also acts as a liaison with Brazils state and national governments. The department doesnt operate foreign offices, but it devotes about 20 staffers to foreign affairs. It participates in 16 issue-oriented networks of cities, with a strong presence in six of them, and partners with 10 international organizations. The goals, Barchini Rosa said, are to brainstorm with others on environmentally sound development strategies, to draw lessons from other cities and to work with Sao Paulos separate business attraction agency on ways to improve the city. \"We can create commercial flows, we can create new contacts, we can bring attention to the city from foreign people,\" he said. In addition, collaborating with cities abroad plays a critical role in a citys foreign policy strategy. Rohit Aggarwala, who was special adviser to former New York Mayor Michael Bloomberg when he served as chairman of the C40 Cities Climate Leadership Group in 2010-13, said Bloomberg clicked with former London Mayor Ken Livingstone, the groups founder. That led to an in-depth sharing of strategies on issues ranging from dealing with traffic gridlock to fighting terrorism. \"Sure, you can meet someone at an event and develop a relationship, but it can end up being superficial,\" Aggarwala said. \"When you work on content with somebody, thats when you develop a real relationship.\", kbergen@tribpub.com , Twitter @kathy_bergen]", "Date": "20150526", "Author": "[Kathy Bergen]", "Link": "http://www.chicagotribune.com/news/globalcity/ct-foreign-policy-cities-20150526-story.html", "Title": "[As borders blur, cities mull 'foreign policies']"}