{"Content": "[Debating Donald Trump is like boxing with smoke. You may have the facts on your side, but for this Republican presidential candidate, facts are mostly beside the point. Take, for example, his recent slap at President Barack Obamas legacy. Americans wont elect another black president for a long time, Trump said in an interview Sunday with Jonathan Karl of ABC News, because of Obamas \"poor standard.\", \"I think that he has set a very poor standard,\" Trump said. \"I think that he has set a very low bar, and I think its a shame for the African-American people.\", On income levels and unemployment, Obama \"has done nothing for African-Americans,\" he continued. \"They are worse now than just about ever.\", Well, it didnt take PolitiFact long to shoot down Trumps assertions as \"false.\" Black unemployment, for example, \"improved significantly\" from 12.7 percent when Obama entered office to 9.5 percent this past June. Just imagine, Obamas supporters would say, what he could have done with a cooperative Congress. Yet the TV interview question came from a gloomy assertion Trump made on Twitter last November. \"Sadly because President Obama has done such a poor job as President,\" Trump tweeted, \"you wont see another black president for generations!\", Oh? Does Trump really think Americas voters who, by the way, elected Obama twice with more than 50 percent of the popular vote would be that racist? Probably not. But to his support base, theres no need to let a shortage of facts get in the way of a sharp poke at Obama. Yet, Trump expects strong support from the very voters of color the Republican establishment fears Trump will push away. \"I think that I will win the African-American vote,\" he said, \"and I think I will win the Hispanic vote.\", That makes one of us, Don. A new NBC News/Wall Street Journal poll released Sunday, for example, found 75 percent of Hispanics polled in Nevada viewed Trump negatively and 61 percent said their view of him was \"very negative.\", Some 55 percent thought his references to immigrants as rapists and criminals was \"insulting and racist.\", Yet even in that poll of Hispanic voters, 14 percent said Trump showed \"guts to say exactly what was on his mind about an important problem (illegal immigration) we need to deal with.\", Now were getting to the true significance of Trumps surge to holding the largest minority of votes in a field of candidates that is as crowded as a public school classroom in a low-income neighborhood. What excites voters at this stage is not that Trump has much of a chance to win the nomination. It is that he serves as a public megaphone for a segment of the electorate that wants its frustrations to be heard. Thats why details dont matter when the Donald is \"Trumpsplaining.\" Thats my term for his relentless tendency to jump without a hint of self-doubt right into explaining things that obviously are completely outside his personal experience. \"Trumpsplaining\" is like \"mansplaining,\" a term that some feminist bloggers apply to the act of explaining something to someone, typically a man to a woman, without any thought to whether the person hearing the explanation already knows more about the topic than the explainer does. \"Trumpsplaining\" is Trumps mansplaining and, like everything else in Trumps hype-inflated galaxy, is the biggest (\"Huge! Huge!\"), boldest and most condescending tone-deaf mansplaining that any narcissistic ego ever produced. Trumpsplaining describes how Trump came to Chicago in June and preached to the Tribune Editorial Board which knows a thing or two about Chicago about how \"Crime in Chicago is out of control, and I will tell you, outside of Chicago, its a huge negative and a huge talking point, a huge negative for Chicago.\" Huge, huge! Gee, thanks, Don. Well get right on that. Ultimately, I dont expect Trump to see the inside of the White House unless its with a tour group. But for now, he expresses the frustration of voters who think the system has failed, that the \"change\" promised by Obama isnt the change they want and, who cares whether he has the facts right? Hes saying what they feel. Clarence Page, a member of the Chicago Tribune Editorial Board, blogs at chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150804", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-donald-trump-clarence-page-crime-immigration-perspec-0805-jm-20150804-column.html", "Title": "['Trumpsplaining' speaks to frustrated voters]"}