{"Content": "[As verbal manure filled a school auditorium, I expected men in hazmat suits to rush into the building. But while veracity was asphyxiated early in the evening, the only other casualty was Lincoln-Way North High School, given a year to live. School board members in Lincoln-Way High School District 210, which ought to be one of the wealthiest school districts in the Southland, told a crowd of more than 1,000 gathered Thursday at Lincoln-Way Central High School in New Lenox Township that their public schools were running out of money, had been placed on an Illinois State Board of Education financial watch list, and that at least one, possibly two, of the four high schools in the district would have to close. Just 10 years ago these very same residents had been told that two new high schools were needed, and they voted to approve a $225 million bond issue to build them. That was not a close vote. Sixty percent of the people said \"yes\" to the question. How the school district (which includes New Lenox, Frankfort, Mokena, Manhattan and parts of Orland Park and Tinley Park) ended up in crisis remains a mystery to many, but several school board members stated over and over again that in their estimation it was clear the state was at fault. The Illinois legislature, to their amazement, had refused to increase the amount of money flowing into the school district. Now for some background and history. Illinois relies heavily on local property taxes to fund public schools. This system of school financing was created for two reasons in Illinois: It helped the city of Chicago (which generated billions of dollars via commercial development) and wealthy suburbs, creating a synergy between Democrats from the big city and Republicans who traditionally dominated the collar counties. If small Downstate communities and poor Cook County suburbs suffered, well, thats just the way the cookie crumbled. The average home value in Frankfort, according to the U.S. Census Bureau, is $357,000, and the average household income is $113,000. In Mokena, the median value of a single-family home is $290,000, and household incomes averages $99,000. In New Lenox, the average home is listed at $280,000, and household incomes average $93,600. The average household income in Illinois, according to U.S. Census figures, is about $56,700. The reliance on property taxes was created to benefit communities just like these, luring people with financial mobility who were willing to pay more money and higher taxes to provide a top-notch education for their children. And Lincoln-Way is one of the top performing school districts in Illinois, with students producing higher-than-average scores on standardized tests. So when parents across the state organized a march on Springfield calling for an income tax hike to provide more money for education and reduce the burden on property owners, it was understandable that Lincoln-Way school officials and parents opted out. They didnt want any change in a system which was perfectly suited to their needs and gave their children a huge advantage over those living in more impoverished areas of Illinois. School board member Arvid Johnson, who presided as board president during Lincoln-Ways financial collapse, told the audience that the real problem was that over and over again the school district had expected the state to increase school funding over the years and \"each time, the state of Illinois did not meet its obligation,\" actually reducing the amount of money Lincoln-Way received. He expressed astonishment, apparently having discovered this was the case in recent years, although it has been a growing problem for nearly three decades. Sitting next to Johnson was fellow board member Christopher Kosel, the son of former state Rep. Renee Kosel, a Republican legislator who represented the Lincoln-Way area for 18 years before retiring. Renee Kosel was consistently opposed to raising the state income tax to fund public education and told me more than once that she felt schools had to do a better job of spending within their limits, just like Lincoln-Way had done. She was popular in her district, representing her constituents, who would not have been happy had the state changed its school funding system, reducing the overreliance on property taxes to shift funds to impoverished districts. And thats likely what would happen if the state ever shifted away from property taxes to state funding for the schools. Lincoln-Way school board members have to know that, but on Thursday night, several of them repeatedly implied that if the state would only fulfill its obligations, Lincoln-Way would have been deluged with money. While such a thing would have been comparable to a miracle, the school board members suggested they actually expected that to happen at some point. School Board President Kevin Molloy blamed the Great Recession for the problems of the district. When Lincoln-Way decided to build two new high schools, he noted, a population and building boom were projected that would have skyrocketed enrollment to a total of 9,000 or 10,000 students. Will County was one of the fastest-growing regions in the United States in 2005, after all. Instead, student enrollment is only about 7,000 and declining. For every 1,000 students, Molloy said, the district gets about $6 million in state aid each year. So if the district had 2,000 more students, it would have received $12 million a year more from the state and would not be facing the financial crisis its in. Of course, the school district should have known as far back as 2010 that its building boom had gone bust, but Molloy didnt spend any time discussing that. No one on the board seemed keen on accepting responsibility for the calamity that had occurred. So back to the state legislature they went to find a scapegoat, noting that the government is currently considering a property tax freeze which could force Lincoln-Way to close another high school in a couple of years. Or the state could change the school aid formula, reducing the amount of money Lincoln-Way receives, causing the school district to shut a second high school. And a third measure that has been discussed could shift the obligation for paying teacher pensions from the state to local school districts, and, yes, that too would result in a second high school closing. All of the talk about potential disaster if the legislature does any of the above was to set up a defense of keeping 60-year-old Lincoln-Way Central open, since it had the largest potential capacity if there is a need to close a second high school in a year or two. Parents who send their children to Lincoln-Way North in Frankfort Township, a state-of-the-art school built by that 2005 referendum, had predicted for months the school board would take that approach. And the final vote, 5-2, to close their school next year proved they were right. The second that would likely close in the future is Lincoln-Way West, the other new school constructed after voters approved the referendum. \"Call your legislators,\" a school board member urged the residents as the meeting ended as if after 30 years of marches, protests and bogus campaign promises, Lincoln-Way parents could have an impact. \"Hope for the best, plan for the worst,\" Lincoln-Way board members repeatedly said. \"Lincoln-Way, ever true, let us pledge our hearts to you,\" a board member recited from some school district pledge. Did I mention that residents opposed the sale of vacant school district property at 191st Street and Harlem Avenue in Tinley Park for construction of a Sams Club and Wal-Mart stores? Tinley Park officials said at the time they were willing to buy the property from the school district for about $7 million, figuring they could easily make that up in future sales tax revenue from the two stores. That would have brought in enough money to at least keep Lincoln-Way North open another year. Some people call the Lincoln-Way financial crisis a perfect storm. That may be. But it was a man-made disaster. pkadner@tribpub.com]", "Date": "20150814", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-lincoln-way-st-0816-20150814-story.html", "Title": "[Kadner: Lincoln-Way blames state for its own financial mess]"}