{"Content": "[What are we to make of the two biggest political pseudo-surprises of this midsummer: the spectacular crowds drawn by Donald Trump and Bernie Sanders. I say pseudo-surprises because, in some ways, we should have expected both men to do well in polls. Trump has higher name recognition than any of the other 15-and-counting major Republican contenders, except perhaps the Grand Old Partys current front-runner in the polls, Jeb Bush. And I say \"perhaps\" because, despite having two other Bushes precede in him in the White House, Jeb doesnt have a network TV show or skyscrapers blasting his name on urban skylines. Love Trump or hate him and many find it possible to do both at the same time just about everybody knows him. And Sanders has the advantage of challenging front-runner Hillary Clinton, whose front-porch-style campaign has left the news cycles largely to Sanders, who can be more clever than Trump, coming from the left, and not nearly as obnoxious except to the right. With that, I believe we see the secret behind the campaigns popularity in their respective parties: Both are speaking to voters in ways that tap into the core anger, aspirations and frustrations of each party. Generally speaking, Sanders speaks to the lefts affection for government programs and policies that its partisans hope will improve society. Trump, by contrast, speaks to a core conservative belief that the best government programs and policies are those that leave society alone. It doesnt even matter, or maybe his supporters dont care, that Trump was a bona fide liberal only a few years ago. You can see examples on YouTube. He used to contribute to the Clintons foundation. Now he calls Hillary Clinton \"the worst secretary of state in U.S. history.\", Presidential candidate Donald Trump in discussion with the Tribune editorial board states why hes running and hoe to cut off the money supply to ISIS. Presidential candidate Donald Trump in discussion with the Tribune editorial board states why hes running and hoe to cut off the money supply to ISIS. And, yes, he used to be a registered Democrat who called for a huge huge! one-time 14.25 percent tax on the wealthy, which should make even Sanders blush. But, ah, details, details. Trump, who seems quite willing to say anything that will draw a crowd, hit political pay dirt by turning to a time-honored target for demagogues: immigrants. And unlike his earlier obsessions with President Barack Obamas birth certificate, this time Trump actually stumbled into an important issue, much to the chagrin of his fellow Republicans. Hes right that our immigration system is broken. Both parties have been complaining about it for years. But efforts to gain comprehensive reform securing the border and finding a pathway to legalization for the estimated 11 million immigrants already unlawfully in the country have divided Republicans too deeply for even fellow presidential hopefuls to touch it until Trump brought it up. And remarkably, that inaction seems to be just fine with a large body of conservatives who condemn any reform supported by Democrats as \"amnesty.\", Leave all those details like what to do with the 11 million already here to people who like nitty-gritty policy details (like Democrats). Attention to such details is what political scientists like Matt Grossmann of Michigan State University and David Hopkins of Boston College say distinguish the parties in their recent academic paper, \"Ideological Republicans and Group Interest Democrats: The Asymmetry of American Party Politics.\", Boiled down to everyday folks language, the paper, which was published recently in the journal Perspectives on Politics, is all about what makes liberals and conservatives different in American politics. Democrats succeed \"not when they defend government in the abstract,\" Grossmann said in a Salon interview, \"but when they focus on particular goals that can be solved with specific policy solutions.\", Republicans, by contrast, do better with their own supporters and the broader public \"when they talk in broad principled terms about the size and scope of government, and respect for traditional values, and Americas unique role in the world,\" Grossmann said. The dilemma for the Republican establishment is obvious. Trumps insulting language about immigrants turns off voters of color whom the GOP is trying to attract. He also has pushed to the front burner an issue that GOP leaders were hoping to sweep out of sight. Now they wish they could sweep Trump out of sight although not his voters. Meanwhile, the GOPs march to the right leaves enough room for Hillary Clinton to criticize Wall Street without moving far to the left. She should thank her former friend the Donald for that. Clarence Page, a member of the Tribune Editorial Board, blogs at http://www.chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150714", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-bernie-sanders-donald-trump-hillary-clinton-jeb-bush-perspec-0715-jm-20150714-column.html", "Title": "[The summer of Bernie Sanders and Donald Trump]"}