{"Content": "[Declaring its make or break time, Gov. Bruce Rauner used his first State of the State speech Wednesday to lay out a comprehensive conservative agenda aimed at repairing the state by helping businesses while putting the brakes on the power of organized labor. The rookie Republican governor called on lawmakers to approve his to-do list in total rather than piecemeal, but some members of the overwhelmingly Democratic House and Senate contended such rhetoric was more politically divisive posturing than proactive governing. In office less than a month, Rauner hearkened back to themes he sounded in his successful campaign against Democrat Pat Quinn. Rauner sought to weaken the political influence of public employee unions. He proposed a two-year freeze on local property taxes. And he promised more money for education without revealing how he would accomplish it in a cash-strapped state. And while he urged lawmakers to make choices about whats best for the next generation, not the next election, Rauner also unveiled a series of proposed constitutional amendments, including several he wants voters to consider in 2018 his re-election year rather than the next statewide election in 2016. The time is now for all of us, Republicans and Democrats, to do big things the right things for the people of our great state, Rauner said. Now is the time for bold and decisive action. It is make or break time for the Land of Lincoln. Just how much of Rauners broad agenda will become reality is questionable, particularly the efforts to curtail unions. The legislature is controlled by large Democratic majorities, and organized labor has been a traditional Democratic ally. Senate President John Cullerton, D-Chicago, acknowledged the people of this state elected a divided government, but warned the governor will soon learn that it doesnt mean that he needs to be divisive. House Speaker Michael Madigan, the Southwest Side Democrat who controls much of the legislative agenda, called Rauner after the speech to offer congratulations. In a measured political response, Madigan said he wouldnt consider anything Rauner proposed a nonstarter. He has a lot of strong views on public issues. He enunciated those views in his speech today, which he should do, Madigan said. Now those views, those issues will be before the legislature, and theyll be disposed of by the legislature. Some favorably, and some not favorably. Thats the American democratic process. For Rauner, who won election despite revealing few specifics to voters, Wednesdays speech and underlying documents provided the most specifics yet on how hell govern. During the campaign, he assailed government union bosses and politicians for creating a corrupt system in which unions gave campaign donations to those who oversee their contracts. In his speech, he proposed banning campaign donations from public employee unions and allowing employees to decide not to join a union. Rauner, who faces difficult contract negotiations with state public employee unions this summer, proposed further steps to restrict public unions, including giving taxpayers at the local level a say over municipal collective bargaining and benefits. In addition, the governor expanded his complaints about organized labor to private sector unions by calling for the creation of what he called empowerment zones in which businesses can operate free from union requirements. Union critics call such areas right-to-work zones. Moreover, Rauner proposed an end to project labor agreements and prevailing union wages being paid on state and municipal construction projects. He described the two union requirements as uncompetitive bidding and said the state could save billions of dollars that could be plowed back into a needed public works program. Such proposals pit Rauner against powerful construction trade unions, making the fate of those concepts murky. As expected, union leaders in Illinois were inflamed, while business leaders were buoyed. Instead of seeking solutions that empower all the working families of Illinois to fuel the economy, his proposals will destabilize middle-class economic security by cutting compensation for injured workers, defunding unemployment insurance reserves, demonizing public employees and suppressing wages, said Michael Carrigan, AFL-CIO state president. Greg Baise, president and CEO of the Illinois Manufacturers Association, said Rauner outlined a clear path to prosperity. Job creators see a glimmer of hope because Gov. Rauner recognizes that Illinois can no longer afford to kick the can down the road and must make the bold and decisive choices in order to create a booming economy, Baise said. Rauner declared the states top priority must be making Illinois competitive again. He called for an overhaul to the workers compensation system to curb costs associated with employees hurt on the job. He also suggested changes to prevent civil attorneys from shopping around lawsuits to find favorable judges for injured clients. The governor said those business-friendly reforms should be made in conjunction with an increase in the states minimum wage, proposing the $8.25 hourly rate be increased to $10 at a rate of 25 cents a year for the next seven years. Rauner got applause for calling for a minimum wage hike, but drew gasps and laughter from some Democratic lawmakers when he outlined it would be phased in through 2022. Hours earlier, Senate Democrats advanced a bill to raise the rate to $11 an hour by 2019. The full Senate could vote on the measure Thursday, though support remains questionable in the House. Rauner also revisited his pledge on the campaign trail to overhaul the states tax code, which he labeled as antiquated. He suggested a two-year freeze in local property taxes he said were crushing middle-class families and said its time to modernize the sales tax by expanding it to apply to services. He also embraced one key tax idea backed by his Democratic predecessor, saying the Earned Income Tax Credit should be increased to return more dollars to low-income families. The governor, however, avoided talk about the states personal income tax rate, which dropped from 5 percent to 3.75 percent Jan. 1 and left him with an immediate budget hole of about $1.4 billion. Its led to agencies running out of money just halfway through the spending year, threatening to shut down child care centers and other programs. Rauner provided no hints on how hed address that problem, even as Madigan said finding ways to solve the shortfall would be his chambers top priority in the weeks ahead. Madigan said he will keep an open mind when it comes to Rauners tax ideas and suggested the governor do the same. Madigan noted many Democrats would support increasing the income tax rate an idea the speaker said he raised with the governor but Rauner rejected. A Rauner spokesman later said the governor believes we need to work within the framework of a 3.75 (percent income-tax rate) budget. Failing any more money, Madigan said he will work with Rauner to plug the budget hole using a combination of techniques that could include giving the governor more authority to cut spending, or dipping into roughly $600 million in specially designated funds. We have budget deficits, theres no dispute about that. They cant be eliminated simply by cutting, Madigan said. I think there has to be a balance in reduction in spending and (new) revenue. Rauner vowed additional money for everything from early childhood programs to vocational and technical training in high schools. Once again, he didnt put a price tag on the pledge but suggested savings could come from cuts to administrative offices. Rauner proposed eliminating the limit on the number of charter schools allowed to operate. He also suggested an overhaul in the way students are tested, saying students and teachers shouldnt be overwhelmed by so many exams they get in the way of high-quality instruction. Dan Montgomery, president of the Illinois Federation of Teachers, said the call for more school funding is always welcome but questioned if it would come at the expense of teachers given the governors other attempts to weaken union rights. We want to hold him true on his statement that he wants to increase (elementary and high school) funding, but teachers and people who work in schools dont have to lose for our kids to win, Montgomery said. So this anti-union attack on teachers and other labor, frankly, is not productive. Rauner, a private equity investor who spent $27.6 million of his own money and relied on wealthy allies for an additional $40 million to win, proposed all organizations with a state collective bargaining agreement be banned from making campaign contributions. Thats effectively a shot at public employee unions that donated millions of dollars to candidates in an effort to defeat Rauner. The governor contended such donations represent a conflict of interest and in documents sought to link public employee union donations made to Quinn and disgraced and imprisoned former Gov. Rod Blagojevich to pay increases and improved benefits. Rauner also called for a ban on political contributions from state hospitals and other organizations that receive state Medicaid funds. Rauner asked lawmakers to approve several proposed state constitutional amendments for ratification by Illinois voters, including an eight-year limit on the service of statewide elected officials and lawmakers. Rauners bid to put a term-limit amendment on last years ballot through citizen petition was rejected by the courts. For 2018, Rauners re-election year, he proposed amendments on the ballot that would create a system for appointed rather than elected judges, a limit on lawsuit damage awards and a ban on carrying over state bills from one year to the next. Pearson reported from Chicago. rap30@aol.com, mcgarcia@tribpub.com]", "Date": "20150204", "Author": "[Rick Pearson, Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rauner-state-of-the-state-preview-met-0204-20150203-story.html", "Title": "[ Gov. Bruce Rauner urges lawmakers to do 'right things' for Illinois]"}