{"Content": "[It may not seem like it, but this week has seen the most significant development yet in the immigration debates role in the 2016 election. Id go even farther its possible that the entire presidential election just got decided. Is that an overstatement? Maybe. But hear me out. For months, people like me have been pointing to the fundamental challenge Republican presidential candidates face on immigration: they need to talk tough to appeal to their base in the primaries, but doing so risks alienating the Hispanic voters theyll need in the general election. This was always going to be a difficult line to walk, but a bunch of their candidates just leaped off to one side. After Donald Trump released his immigration plan, which includes an end to birthright citizenship stating that if you were born in the United States but your parents were undocumented, you dont get to be a citizen some of his competitors jumped up to say that they agreed. NBC News asked Scott Walker the question directly, and he seemed to reply that he does favor an end to birthright citizenship, though his campaign qualified the statement later. Bobby Jindal tweeted, \"We need to end birthright citizenship for illegal immigrants.\" Then reporters began looking over others past statements to see where they stood on this issue, and found that this isnt an uncommon position among the GOP field. Remember all the agonizing Republicans did about how they had to reach out to Hispanic voters? They never figured out how to do it, and now theyre running in the opposite direction. Here is the list of Republican candidates who have at least suggested openness to ending birthright citizenship, which would mean repealing the 14th Amendment to the Constitution: Donald Trump, Scott Walker, Bobby Jindal, John Kasich, Rand Paul, Chris Christie, Lindsey Graham, and Rick Santorum. Thats nearly half the GOP field, and more may be added to the list. The 14th Amendment states in part: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.\" It was passed after the Civil War to ensure that former slaves had all the legal rights of other citizens. You cant end birthright citizenship without repealing it. That means that no matter who gets elected in 2016, birthright citizenship is not going to be eliminated. The bar is so high for amending the Constitution that its impossible to imagine any amendment this controversial getting ratified, which is as it should be. But the political impact is going to be very real, whether or not the idea goes anywhere in practical terms. The simple fact is that if Republicans dont improve their performance among Hispanic voters, they cannot win the White House. Period. This discussion about birthright citizenship sends an incredibly clear message to Hispanic voters, a message of naked hostility to them and people like them. Its possible to argue that youre \"pro-immigrant\" while simultaneously saying we should build more walls and double the size of the Border Patrol. Indeed, many Republicans do, and while their argument may not be particularly persuasive, its not completely crazy. But you cant say youre pro-immigrant and advocate ending birthright citizenship. You just cant. I promise you that next fall, there are going to be ads like this running all over the country, and especially on Spanish-language media:, \"My name is Lisa Hernandez. I was born in California, grew up there. I was valedictorian of my high school class, graduated from Yale, and now Im in medical school; Im going to be a pediatrician. But now Scott Walker and the Republicans say that because my mom is undocumented, that Im not a real American and I shouldnt be a citizen. Im living the American Dream, but they want to take it away from me and people like me. Well Ive got a message for you, Governor Walker. Im every bit as American as your children. This country isnt about who your parents were, its about everybody having a chance to work hard, achieve, and contribute to our future. It seems like some people forgot that.\", When a hundred ads like that one are blanketing the airwaves, the Republicans can say, \"Wait, I support legal immigration!\" all they want, but it wont matter. Hispanic voters will have heard once again and louder than ever before that the GOP doesnt like them and doesnt want them. Will it be different if they nominate one of the candidates who doesnt want to repeal birthright citizenship, like Jeb Bush or Marco Rubio? Somewhat, but the damage among Hispanic voters could already be too great even for them to overcome. Now lets look at the magnitude of the challenge the Republicans face. A number of analysts have all come to the same conclusion: given that Hispanics are rapidly increasing their share of the population and whites share is declining, Republicans need to improve their performance among Hispanics to prevail. And they may have to improve dramatically. For instance, in this analysis by Latino Decisions, under even the most absurdly optimistic scenario for Republicans \"that white voters consolidate behind the Republican Party at levels that were observed in 2014; that black participation and Democratic support returns to pre-Obama levels; and the expected growth in the Latino vote does not fully materialize\" the Republican candidate would need 42 percent of the Hispanic vote to win. As a point of comparison, according to exit polls Mitt Romney got 27 percent of Hispanic votes in 2012, while John McCain got 31 percent in 2008. Under a more likely scenario, with an electorate that votes something like in 2012 but with African-American turnout reduced, the Republican would need 47 percent of the Hispanic vote. In their worst-case scenario for Republicans an electorate that votes identically to the way it did in 2012, but adjusted for changes in population the Republican would need a stunning 52 percent of Hispanic votes. So to sum up: even in the best possible situation when it comes to turnout and the vote choices of the rest of the electorate, the Republican presidential candidate in 2016 is going to have to pull off an absolutely heroic performance among Hispanic voters if hes going to win. That seemed awfully unlikely a week ago. How likely does it seem today?, Washington Post, Paul Waldmanis a contributor to The Washington Posts Plum Line blog, and a senior writer at The American Prospect.]", "Date": "20150819", "Author": "[Paul Waldman]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-immigration-birthright-citizenship-20150819-story.html", "Title": "[Did Republicans just give away the 2016 election?]"}