{"Content": "[As a young executive at an up-and-coming red light camera company a decade ago, Karen Finley placed a small help-wanted ad in a Chicago newspaper that quietly made a record of what would become one of the biggest bribery scandals in the citys notorious history. The May 2003 advertisement sought an account manager for Redflex Traffic Systems Inc.s burgeoning Chicago red light camera program. But the ad failed to note that the position wasnt really open to applicants. And it left out the one true duty of the job: bagman. On Thursday, Finley stood in a Chicago courtroom and admitted her role in orchestrating a $2 million scheme to bribe a top city transportation official to steer tens of millions of dollars in city business to the Arizona-based firm. At the center of the scandal first disclosed by the Tribune in 2012 was the man Finley had agreed to hire years ago, Martin OMalley, who had been told to look for the ad placed by Finley. OMalley has admitted that he greased his longtime friend, John Bills, former managing deputy commissioner of transportation, with hundreds of thousands of dollars in cash, vacation trips and personal gifts. \"Guilty, your honor,\" Finley, 55, who resigned as CEO amid the widening scandal in May 2013, said in a firm voice when U.S. District Judge Virginia Kendall asked for her plea to one count of bribery conspiracy. Finleys 21-page plea agreement with prosecutors disclosed for the first time that she is cooperating in the continuing federal investigation and could be called to testify at Bills trial in January. The Tribune first revealed the questionable relationship between Bills and Redflex in fall 2012 after obtaining a 2-year-old internal whistleblower memo written by an ousted Redflex vice president. The reporting prompted Mayor Rahm Emanuel to fire Redflex and overhaul the citys red light camera program, which has raked in more than $500 million in traffic fines and remains the largest in the nation. The Tribune investigation also sparked a federal probe that led to Thursdays guilty plea. The judge postponed Finleys sentencing hearing until after Bills trial. The bribery conspiracy charge carries a maximum of five years in prison, but Finley also faces sentencing in a separate bribery scheme in Ohio in which Redflex made campaign contributions to elected officials in return for keeping red light camera contracts, court records show. Whatever sentence imposed on Finley in Chicago would run concurrent to the term handed down in the Ohio case. Finley, who is free on bond, left the Dirksen U.S. Courthouse without comment. The guilty plea marked the second conviction in a scandal that by size alone ranks among the largest in Chicagos long history of corruption. OMalley, 73, of suburban Worth, pleaded guilty in December to a single count of conspiracy to bribe a public official and is also cooperating with authorities. Finley was the vice president of operations at Redflex when she and five other company executives flew to Chicago in February 2003 for a key gathering at City Hall to discuss the citys fledgling red light camera program. The night before, Finley and the others had met secretly at the swanky Signature Lounge atop the John Hancock Center, where Bills coached them on what to say to impress city officials, the Tribune has previously reported. Former Redflex software engineer Michael Schmidt, who testified about the meeting to a federal grand jury, has told the Tribune that Bills warned the group to \"pretend like we never met\" the next day at City Hall so everything appeared to be on the up-and-up. \"I remember glancing over at Karen, and she just put her finger to her mouth quietly as if to say, Ssshh. \" Schmidt said. \"There was a deal under the table to get that contract before we even went to the Hancock that night.\", After Redflex was awarded the first Chicago contract in May 2003, Finley and the companys then-CEO, identified in court records only as Individual B, agreed that they should hire OMalley as an independent contractor to keep Bills happy. Finley and Individual B drew up OMalleys contract to provide a $60,000 base salary as well as hundreds of thousands of dollars in commissions and bonuses as more red light cameras were added in Chicago, court records show. Finley admitted that she knew the contract contained unusually lucrative payouts, especially since OMalley was a \"customer liaison\" and was not actually selling cameras to the city. Bruce Higgins, who served as Redflexs CEO during that time period, could not be reached Thursday for comment. He has not been charged with wrongdoing. Meanwhile, Finley was aware that Redflex was paying Bills personal expenses. In one case in December 2003, Finley approved reimbursement for airline tickets to Phoenix, car rental, meals and golf outings that OMalley had purchased for a five-day trip to Arizona for himself, Bills and Bills friend, her plea agreement said. After Finley became CEO in 2007 and OMalleys commissions increased again, Redflex employees began to question the contract and suggested renegotiating the terms. But Finley avoided the issue \"to keep Bills happy and to ensure that Bills would assist Redflex in the awarding of new red light camera contracts,\" according to the plea. Bills helped Redflex win one contract by giving Finley the opportunity to draft documents that would give the company an advantage in its bid. In an email exchange, Finley admonished another top Redflex executive previously identified by authorities as Aaron Rosenberg for communicating with OMalley about the drafts in writing, saying she was deleting her emails, the plea agreement said. Rosenberg is cooperating with authorities under an immunity agreement and has not been charged. In addition to the perks provided by Redflex, Finley also suspected that OMalley was passing much of his income on to Bills as further bribes but \"willfully avoided learning the truth,\" her plea agreement said. Even after the whistleblower memo written in October 2010 accused OMalley of paying Bills, resulting in an internal investigation at the company, Finley admitted she never asked either of them about the allegations. In fact, when the board chairman at Redflexs parent company noted OMalleys salary was quite high, Finley defended the compensation \"despite her suspicions\" that much of the money was being passed to Bills, the plea deal said. OMalley has admitted paying Bills a total of $570,000 in cash from 2004 to 2012, in addition to paying for some of Bills personal debts and even buying a Gilbert, Ariz. condominium for Bills use. He also wrote checks to cover Bills retirement party from the city as well as to an undisclosed \"political organization,\" according to his plea agreement. OMalley then included those costs on his expense reports, which Redflex reimbursed. To conceal the scheme, OMalley had Redflex send his commission checks to a post office box he had set up at a shipping store in the Morgan Park neighborhood. When he received a check, OMalley would arrange to meet Bills for lunch at Chicago-area restaurants. Bills often arrived in his city-issued vehicle. In 2011, when Bills was planning to retire from his city position, Finley and other Redflex executives discussed the need to find him a job in return for all his assistance with the Chicago contracts, according to the plea agreement. Bills eventually landed a new position with a nonprofit corporation with Redflexs help. Finleys plea agreement does not identify the company, but the Tribune has previously reported it was the Traffic Safety Coalition, which is run by a Chicago political consultant with strong ties to Emanuel and former Mayor Richard Daley. jmeisner@tribpub.com, dkidwell@tribpub.com, Twitter @jmetr22b, Twitter @dkidwell1]", "Date": "20150820", "Author": "[Jason Meisner, David Kidwell]", "Link": "http://www.chicagotribune.com/news/watchdog/redlight/ct-red-light-cameras-ceo-guilty-met-20150819-story.html", "Title": "[Ex-Redflex exec pleads guilty to helping orchestrate $2M bribery scheme]"}