{"Content": "[Try as she might to focus on the policies she wants to enact if elected president, Hillary Rodham Clinton just cant dig out of her inbox. Clintons email problems are getting worse. She agreed to turn over her private server to the Justice Department this week on the same day Congress got word that at least two emails that traversed the device while she was secretary of state contained information that warranted one of the governments highest levels of classification. The developments suggest the investigation into the security of Clintons email setup could run deep into 2016, as she is trying to win the Democratic nomination for president and, potentially, the general election. Trump and Sanders lead the polls on August 12, 2015. Bernie Sanders, a Vermont senator, has attracted thousands of supporters, which comes at the expense of Hillary Clinton. (WGN-TV), Trump and Sanders lead the polls on August 12, 2015. Bernie Sanders, a Vermont senator, has attracted thousands of supporters, which comes at the expense of Hillary Clinton. (WGN-TV), Clinton campaign aides argue theres nothing for investigators to find, and the State Department says its not yet clear if the material at issue ought to be considered classified at all. What worries Clintons team is the lingering whiff of political scandal in a tightening primary race, and they pushed back hard on Wednesday, trying their best to dismiss the matter as nothing more than politics. \"Look, this kind of nonsense comes with the territory of running for president. We know it, Hillary knows it, and we expect it to continue from now until Election Day,\" campaign communications director Jennifer Palmieri wrote in an email to campaign supporters. While her Democratic rivals have yet to seize on the issue, it has become a major part of the GOP case against Clinton. \"I think its about time that she dealt with the consequences of this,\" said GOP candidate and Wisconsin Gov. Scott Walker. \"This is something that isnt just a matter of her not being able to tell the truth; this is something that has put national security at risk and highly questions her ability to be the commander in chief of the United States.\", Clintons campaign said she would turn over the server just hours after she wrapped up two days of campaigning in New Hampshire, where she outlined a plan to address college affordability and student loan debt a centerpiece proposal of her policy platform. The announcement about her email server, which got much more attention than her college affordability plan, marked a retreat for Clinton. She had previously refused the request of a House committee investigating the 2012 attacks in Benghazi, Libya, that the server be turned over to a third-party arbiter. Clintons attorney said then the server had been wiped clean and no emails remained on the device. The reversal comes as her chief Democratic rival, Vermont Sen. Bernie Sanders, is drawing some of the largest crowds of the presidential primaries. A self-described \"democratic socialist,\" Sanders has avoided addressing Clintons email saga, keeping focused on policy disagreements over the economy, trade and the Keystone XL pipeline. \"From our perspective, we want to keep this about Bernie and his message,\" said Sanders campaign strategist Tad Devine. He added, \"If you look at the polling, people are coming to the view that this is not an inevitable nomination anymore.\", Recent polls have shown a tighter race between Clinton and Sanders in the early contests of Iowa and New Hampshire than many expected, and Vice President Joe Biden vacationing this week in South Carolina has indicated that he will make a decision on whether to get into the race next month. The email controversy, aides and supporters argue, wont change existing views of a candidate who has spent decades in the political spotlight. \"I dont think it really hurts her one way or another,\" said Jan Bauer, the Democratic chair in Story County, Iowa, who is backing Clinton. And Terry Shumaker, a longtime supporter in New Hampshire, said the issue didnt come up during Clintons campaigning in the state this week. \"People were free to ask about anything, and nobody asked about emails,\" he said. Clinton said in March she had exchanged about 60,000 emails during her four years in the Obama administration, about half of which were personal and deleted. She turned over the others to the State Department, which is reviewing and releasing them on a monthly basis. The next batch, on Aug. 31, will come two days after Clinton and her primary challengers are scheduled to address members of the Democratic National Committee in Minneapolis. The final installment, on Jan. 29, 2016, will arrive three days before the Iowa caucuses on Feb. 1. Each will give Republicans another opportunity to remind voters of the issue, as Rep. Darrell Issa did Wednesday, saying Clinton should be investigated criminally. \"If any other American had shown the same disregard for securing classified information that Hillary Clinton showed, the United States government would move quickly and decisively to hold them responsible,\" he said in a statement. A referral from the inspector general of the intelligence community to the Justice Department that led to the current investigation did not allege any criminal wrongdoing, and Clintons attorney has said federal authorities simply want assurances that the emails continue to be properly stored. Even so, the rules covering the release of classified material are subject to interpretation and nuance. The Justice Department has been criticized by defense lawyers and secrecy experts alike for an approach they say is inconsistent. Some of those same concerns are likely to be resurrected as Clintons server is inspected. \"I think people assume that the classification system is a rigorous and perfectly logical set of rules, but its not. It is a fuzzy subjective system that lends itself to conflicting interpretations\" said Steven Aftergood, a government secrecy expert at the Federation of American Scientists. Associated Press]", "Date": "20150812", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-hillary-clinton-classified-emails-20150811-story.html", "Title": "[Email troubles persisting, Hillary Clinton's camp reassures backers ]"}