{"Content": "[The two highest-profile Democratic U.S. Senate candidates failed Wednesday to persuade a majority of Cook County party leaders to endorse them. As a result, Democratic committeemen from the city and suburbs voted in favor of an \"open primary\" in the March 2016 contest being eyed by U.S. Rep. Tammy Duckworth, former Chicago Urban League CEO Andrea Zopp and at least three other potential candidates. Also making pitches at the slate-making session were freshman Cook County Commissioner Richard Boykin of Oak Park, who has yet to decide if he will run, southwest suburban state Sen. Napoleon Harris and immigrant rights activist Susana Sandoval. See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. The battle for the allegiances of Democratic committeeman, who can help get out the vote come Election Day, was between Duckworth and Zopp, both of whom painted themselves as the best candidate to take on Republican Sen. Mark Kirk in the November 2016 general election. Kirk, who suffered a debilitating stroke and returned to the Senate after a year of recovery, has been targeted for defeat by the Democratic Senatorial Campaign Committee. Duckworth, who has the endorsement of the resource-rich DSCC, was an Army helicopter pilot who lost both legs in a crash during service in Iraq. She said her military record and recovery would nullify any effort by Kirk, a former Naval Reserve officer, to play up his military service and medical recovery. \"I take a lot of his positives off the table and focus on the issues,\" Duckworth told committeemen. \"I just think in this election against this guy, I am the right one to go up against him.\", Zopp, a former federal prosecutor and Exelon executive, said she has a wide set of skills to bring to the contest. \"Im running for the U.S. Senate because no one else in this race has that breadth of experience,\" she said. \"I am the strongest candidate against Mark Kirk.\", In the primary for Illinois comptroller, Chicago City Clerk Susana Mendoza had so many votes locked up going into the slating session that state Sen. Daniel Biss, D-Evanston, did not even ask for the partys endorsement, which Mendoza received. Both presented themselves as the best option for checking the power of Gov. Bruce Rauner, who appointed Republican Leslie Munger as comptroller after Judy Baar Topinka died after her re-election last November. \"We need to be able to push back against the Rauner agenda that is hurting families and decimating Democrats across the state of Illinois,\" said Mendoza, who played up her experience as a former state representative and city clerk. Biss said the Democratic Partys principles were \"under attack\" by Rauner. \"That creates an obligation, I believe, for us to find every lever at our disposal inside the state government to fight back,\" said Biss, who touted his reputation for mastery of fiscal issues. \"The comptrollers office is uniquely suited to play a role in that effort.\", Committeemen also voted in favor of an open primary in the states attorneys race after hearing pitches Tuesday from Anita Alvarez, who plans to seek a third term, Kimberly Foxx, the former chief of staff to Cook County Board President Toni Preckwinkle, Donna More, a former county and federal prosecutor and state regulator now in private practice, and County Commissioner John Fritchey, D-Chicago, a former assistant attorney general. And committeemen upheld a Tuesday recommendation to endorse Circuit Court Clerk Dorothy Brown in her bid for a fifth term after a failed move by 33rd Ward Committeeman Dick Mell to declare it an open primary. Mell is backing lawyer Jacob Meister for that post, which controls hundreds of jobs. In a switch, committeemen decided to back sustainability advocate Tom Greenhaw to fill out the remaining two years of a term on the Metropolitan Water Reclamation District after Patrick Daley Thompson gave up the post when he was elected to the City Council. In doing so, they declined to endorse former Cook County Board President Todd Stroger. hdardick@tribpub.com, Twitter @ReporterHal]", "Date": "20150819", "Author": "[Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cook-democrats-slating-met-0820-20150819-story.html", "Title": "[Duckworth, Zopp fail to score Cook County backing for U.S. Senate]"}