{"Content": "[Showing solidarity with workers on Labor Day, President BarackObamawill sign an executive order Monday requiring paid sick leave for employees of federal contractors, including 300,000 who currently receive none. The White House wouldnt specify the cost to federal contractors to implement the executive order, whichObamawas to address at a major union rally and breakfast in Boston. The Labor Department said any costs would be offset by savings that contractors would see as a result of lower attrition rates and increased worker loyalty, but produced nothing to back that up. Under the executive order, employees working on federal contracts gain the right to a minimum of one hour of paid leave for every 30 hours they work. Stretched out over 12 months, thats up to seven days per year. The order will allow employees to use the leave to care for sick relatives as well, and will affect contracts starting in 2017 just asObamaleaves office. TheObamaadministration has been working on the executive order for months, and chose Labor Day to announce it asObamaworks to enact what policies he can before his presidency ends despite resistance in Congress to laws hes proposed to improve workplace conditions. That push has reverberated in the 2016 campaign, where Democratic candidates are seeking to draw a distinction with Republicans on whos most supportive of the middle class. \"There are certain Republicans that said we cant afford to do this,\" said Labor Secretary Thomas Perez. He lamented how paid leave is seen as a partisan issue in the U.S. despite broad support in Europe. \"The Republican Party is out of step with similar conservative governments around the world,\" he said. Roughly 44 million private sector workers dont get paid sick leave about 40 percent of the private-sector workforce, the White House said. In his speech to the Greater Boston Labor Councils breakfast,Obamawas also to renew his call for Congress to expand the requirement beyond contract workers to all but the smallest U.S. businesses, an idea that has gained little traction on Capitol Hill. The Labor Day gathering in Boston was attracting other well-known politicians, Sen. Elizabeth Warren, D-Mass. and Boston Mayor Marty Walsh among them. Vice President Joe Biden, who is considering entering the Democratic presidential primary, was to echo the labor rights theme in a march with AFL-CIO President Richard Trumka on Monday at a Labor Day parade in Pittsburgh. Unable to push much of his agenda through a Republican-controlled Congress,Obamahas in recent years used executive orders with frequency to apply policies to federal contractors that he lacks the authority to enact nationwide. His aim is to lay the groundwork for those policies to be expanded to all Americans. Earlier executive orders have barred federal contractors from discriminating against workers based on their sexual orientation or gender identity, raised the minimum wage for contractors and expanded the number of contract workers eligible for overtime. Although labor groups have hailed those moves, they remain deeply skeptical ofObamaspush to secure sweeping new trade deals with the Asia-Pacific region and with Europe. Many unions have warned that the deals could lead to the widespread elimination of certain types of U.S. jobs. The White House said it couldnt estimate how many federal contractors dont offer paid leave now, citing a maze of state and local laws that make crunching the numbers difficult. Officials also declined to put a dollar figure on how much contractors would face in added compensation costs. Cecilia Muniz, director of the White Houses Domestic Policy Council, said the administration has an obligation to get the most out of every federal tax dollar. AssociatedPress]", "Date": "20150907", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-obama-contractors-paid-leave-20150906-story.html", "Title": "[Obama observes Labor Day, extends contractors' paid leave ]"}