{"Content": "[Former Arkansas governor and presidential hopeful Mike Huckabee has denounced the following:, 1. Dancing, in general. \"Christian teens stay away.\" (1973), 2. Twerking, by Miley Cyrus. \"Shameless and tasteless display of...quite ordinary private parts.\" (2015), 3. Same-sex marriage. 4. The Supreme Court decision that legalized same-sex marriage nationwide. \"Unconstitutional.\" (Friday). 5. President Barack Obamas health-care law. 6. The Supreme Court decision that saved Obamas health-care law. \"Ignore[d] the Constitution.\" (Thursday). 7. The Supreme Court, in general. \"They must be committed to . . . applying the original meaning of the Constitution.\" (Friday), 8. The Constitution, which allows Supreme Court justices to serve for life.\"I will fight for term limits.\"(Friday), 9. Pop music, in general. \"A knuckle-dragging sub-pidgin of grunts and snarls.\" (1998), 10. Pop music, by Beyonce. \"Mental poison.\" (2015), 11. Obama, for letting his daughters listen to Beyonce. (2015), 12. Republicans who criticize Obama constantly. \"Its hypocritical...to question every motive of Barack Obama.\" (2009), 13. Obama, for bowing too low when he met the Emperor of Japan. \"That deep bow, to the waist . . . was offensive to me.\" (2009, spoken roughly 50 seconds after #12). 14. People who are constantly taking offense. \"Being offended is a full-time job for many. Its a tedious task, for it requires enormous amounts of imagination and creativity, [and] relentless pursuit of an audience willing to swallow the notion of the offense.\" (2015), Former Arkansas Governor Mike Huckabee, a Republican candidate for president, is not a fan of pop music or dancing. Former Arkansas Governor Mike Huckabee, a Republican candidate for president, is not a fan of pop music or dancing. 15. Biscuits and gravy. \"My mortal enemy.\" (2007, after Huckabees major weight loss), 16. Restaurants that dont serve biscuits and gravy. \"How can an eating place that fancies itself fancy . . . not have biscuits and gravy?\" (2015, in his book \"God, Guns, Grits and Gravy.\"). 17. This list, which is an annotated and abridged catalog of things and people that over the last four decades Huckabee has denounced as unwise, unhealthy, un-conservative, un-Biblical or un-American. It runs to 81 items. That is not the full list. But its enough to show the risks of a life spent passing moral judgments for political gain. \"Governor is hard at work on the campaign trail today, talking to the people of Iowa about issues that are important to them. . . If you have a question about that, please let me know.\" (2015, from a spokeswoman for Huckabees 2016 presidential campaign, who said Huckabee would not talk about the list.), 18. The actress Jamie Lynn Spears, for being pregnant and unmarried. \"A tragedy.\" (2007). 19. The media, for criticizing Bristol Palin after she became pregnant while unmarried. \"The most shameful thing Ive ever seen in my life. . . Everyone understands that the basis of being a Christian is that everyone has fallen short of Gods ideal.\" (2008), 20.) The actress Natalie Portman, for being pregnant and unmarried. \"It gives a distorted image...most single moms are very poor, uneducated, cant get a job.\" (2011). 21. Democrats, for intruding into the sex lives of American women. \"If the Democrats want to insult the women of America by making them believe that they arehelpless without Uncle Sugar coming in and providing for them a prescription each month for birth control, because they cannot control their libido.\" (2014), 22. Bristol Palin. \"Fair game.\" (2012, after she failed to show up for an appearance on Huckabees radio show), 23. Profanity, in general. \"The forcible expression of a feeble mind.\" (2015). 24. People who write profanity on bathroom stalls. (1974, while he was a teenaged advice columnist for a Baptist newspaper in Arkansas). 25. People who write \"Jesus Saves\" on bathroom stalls. \"I just cant picture Jesus going into a restroom with a magic marker and writing his name all over the walls.\" (1974). 26) Profanity used by schoolchildren. \"What happened in America between Good Morning, Mrs. Jones, and Shut up, b---h!? And who is going to do something about it?\" (1998), 27. Profanity used by men in the presence of women. (2015), 28. New York women, who use profanity in front of men. \"In New York, not only do the men [curse] but the women do it.\" (2015), 29. Megyn Kelly, Fox News host and New York woman. Kelly: \"I do have news for you . . . we are not only swearing. Were drinking, were smoking, were having premarital sex with birth control before we go to work and sometimes [we] boss around a bunch of men.\" Huckabee (laughing, mock-offended): \"I just dont want to hear that.\" (2015), 30. Crude sexual innuendos. \"Most comics just use them to get a cheap, easy, laugh because creating witty, original humor is hard.\" (2015, in Huckabees book \"God, Guns, Grits and Gravy\"), 31. Overbearing security at airports. \"Bend over and take it like a prisoner!\" (2015, in the same book.), 32. Profanity, as a root cause of mass shootings in America. \"Mass profanity has always been a harbinger of mass violence.\" (1998, in Huckabees book \"Kids Who Kill.\"), 33. Abortion, as a root cause of mass shootings in America. \"Desensitizing.\" (1998, same book), 34. Violence on TV, as a root cause of mass shootings in America. \"The average American child watches 8,000 made-for-television murders.\" (1998, same book). 35. Problems at the U.S.-Mexico border. \"My plan to secure the border? Two words: Chuck. Norris.\" (2007. Huckabee made that joke as he was being endorsed by action-movie legend Chuck Norris, who has killed at least 102 people onscreen). 36. Lack of religion in schools, as a root cause of mass shootings in America. \"Should we be so surprised that schools would become a place of carnage.\" (2012), 37. Obama, for saying that U.S. gun laws were a root cause of this months mass shooting in Charleston, South Carolina. \"It was disappointing to hear the president . . . immediately begin to say, All right, this is a great opportunity for me to grandstand. \" (2015), 38. Very low-cut dresses on women at Huckabees Baptist college. (1974), 39. Halter tops on women at his Baptist college (1974), 40. \"Bra-less looks\" on women at his Baptist college (1974). 41. Men at his Baptist college, for watching the women so closely. \"They couldnt help but look, but . . . they didnt have much respect for the girl who left little to the imagination.\" (1974), 42. A mesh dress that singer Rihanna once wore on the red carpet. \"Ive seen dusty pick-up windshields that were less see-through.\" (2015). 43. The outfit Miley Cyrus wore when she twerked. \"Barely clad, barely legal-age.\" (2015). 44. The outfit Miley Cyrus wore in the video for \"Wrecking Ball.\" \"She was completely naked.\" (2015), 45. Celebrity women who are \"filling the Internet with topless photos of themselves.\" (2015), 46. Men who go shirtless on the street, because it encourages women to go topless. \"Put on a darn shirt!\" (2015), 47. Allowing transgendered people to choose which bathroom they use. \"In high school...I could have felt like a woman when it came time to take showers in P.E.\" (2015), 48.Dogs wearing clothes. \"Most dogs hate wearing anything other than the fur God gave them.\" (2012), 49. \"The Exorcist.\" (1973), 50. \"Monty Pythons Life of Brian\"(1979). 51. The phrase \"act of God.\" \"[It] would be violating my own conscience [to describe] a destructive and deadly force as being an act of God.\" (1997, when Huckabee was governor of Arkansas. He refused to sign a bill that described natural disasters as \"acts of God,\" until it was changed it to\"natural causes.\"), 52. \"Beavis and Butt-head\" (2007), 53. \"Two Broke Girls\" (2015), 54. The Arkansas Symphony Orchestra, for serving champagne during intermission. \"Somehow, I fail to see the connection between symphony music and champagne.\" (1975), 55. Climate change. \"Its real.\" (2007). 56. People who insist that climate change is real. \"One who questions the politically driven agenda of global warming is called anti-science.\" (2015), 57. People who criticize the \"Common Core\" education program. (2013). 58. The \"Common Core\" education program. \"Let me cut right to the chase: I dont support what Common Core has become.\" (2013, six months after #57). 59. The trade embargo against Cuba. \"Has certainly not helped the people of Cuba.\" (2002, while governor, trying to get the embargo lifted so Arkansas farmers could sell rice in Cuba.), 60. The idea of lifting the trade embargo against Cuba. \"I . . . would veto any legislation that would lift the embargo.\" (2007, while campaigning among anti-Castro Cuban Americans in Florida). 61. Mitt Romney, for flip-flopping. \"Heres a man who didnt hit political puberty...until 60 years old.\" (2008, while running against Romney for the GOP nomination.), 62. An attack ad produced by Huckabees own campaign, because it called Romney \"dishonest.\" \"This is not how we run our campaign in this state. Weve gotten here by being positive.\" (2007. Huckabee said this at a press conference just before the Iowa primary, saying that he had decided not to buy air time for his own negative ad.), 63. Romney. \"Dishonest.\" (2008. Just after denouncing the ad, Huckabee showed it to reporters and news cameras, thereby getting it on TV free.), 64. The idea that there is a \"secret\" to losing weight and beating diabetes. \"There isnt one, [just diet and exercise].\" (2005, in a book about how he lost weight). 65. Doctors who wont admit theres a \"secret\" to losing weight and beating diabetes. \"In a moment a free presentation is coming up...so you can discover all the natural secrets that are backed by real science that really work.\" (circa 2015, in a paid appearance to advertise a cinnamon-based diabetes treatment.) \", 66. People who criticize rock n roller Ted Nugent. \"The lyrics that are in some of the more explicit Ted Nugent songs are not explicit. Theyre suggestive, highly suggestive.\" (2015), 67. \"Cat Scratch Fever,\" medical condition described by Nugent. [Huckabee played bass guitar on television while Nugent sang] \"Well, the first time that I got it I was just ten years old/I got it from some kitty next door. . .\" (2011). 68. Homosexuality, in general. \"a SIN.\" (1974, as a Baptist newspaper advice columnist). 69. Allowing AIDS patients to live in the general population. \"It is the first time in the history of civilization in which the carriers of a genuine plague have not been isolated.\" (1992, as part of a Senate campaign.), 70. Homosexuality, in general. (2008). Ive had people who are gay that worked on my staff. Its not like Im some homophobe. If you ask me is it the normal pathway? I dont think so.\" (2008). 71. Gay parents. (2011) \"The children . . . really cannot, get critical early-life lessons in how a heterosexual family functions successfully.\" (2011), 72. Same-sex couples in TV shows. \"Of the seventy-three sex scenes shown that week . . . two involved male homosexual couples.\" (1998), 73. Same-sex couples in TV commercials. \"Every fear that people had has, in fact, come true. . . . Were now even seeing television commercials portraying same-sex couples.\" (2013). 74. States allowing heterosexual couples an easy path to divorce. \"It actually became easier to get out of a marriage than to get out of a contract for the purchase of a used car!\" (2007), 75. Allowing same-sex couples to marry, after the Supreme Court said they could. \"We must resist and reject judicial tyranny, not retreat.\" (2015), 76. \"Dont Ask, Dont Tell.\"\"Absurd . . . allows for the recruitment of homosexual soldiers.\" (2011), 77. Repealing \"Dont Ask, Dont Tell.\" \"Using our servicemen and servicewomen as pawns in shoring up [Obamas] political base.\" (2011, in the same book as #67). 78. The Secretary of Defense, for holding a gay pride event for gay servicemembers inside the Pentagon after \"Dont Ask, Dont Tell\" was repealed. \"Enough is enough.\" (2015), 79. Liberals, for demanding greater and greater acceptance for same-sex marriage. \"It wont stop until there are no more churches.\" (2015), 80. People who wring their hands over the state of the country. \"Far too many people are guilty of hand-wringing, worry and despair over the future of America. Thats not my theme.\" (2011), 81. Obama and Hillary Rodham Clinton, for changing their minds and embracing same-sex marriage. \"Do you want a president who follows? Or do you want a president who leads?\" (Tuesday).]", "Date": "20150701", "Author": "[David A. Fahrenthold]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-things-mike-huckabee-has-denounced-20150701-story.html", "Title": "[Shirtless men, dogs in clothes among many things Mike Huckabee has denounced]"}