{"Content": "[An iconic Texas restaurant chain will not allow the open carrying of guns on its properties, and industry experts say other restaurants will likely take the same stand against a new state law legalizing the practice in many public places. Whataburger with some 780 locations in 10 states has drawn a mix of praise and rebuke since making the announcement this month, including a prediction of boycotts from one of the states leading advocates for gun rights. In an open letter on the companys website, Whataburger president and CEO Preston Atkinson said many employees and customers are \"uncomfortable being around someone with a visible firearm.\" He described himself as an avid hunter with a concealed-carry license and noted that patrons licensed to carry concealed handguns will still be able to do so in Whataburger. Atkinsons letter comes one month after Texas Gov. Greg Abbott signed a bill that made it legal to carry handguns openly on the streets of the nations second most-populous state, ending a prohibition dating back to the post-Civil War era that disarmed former Confederate soldiers and freed slaves. The law, which gives private property owners the right to prohibit open carry, was hailed as a victory for gun rights advocates who have staged high-profile rallies at the Alamo and Texas Capitol over the past couple of years. Some even brought military-style assault rifles into businesses as part of their demonstrations, prompting the Chipotle restaurant chain to discourage firearms on their premises. Whataburgers decision is expected to pave the way for other restaurants to enact similar policies that will further limit where gun owners can openly carry their firearms when the law takes effect in January. Texas Restaurant Association CEO Richie Jackson said he wasnt surprised by Whataburgers advance announcement, noting that \"gun rights do not trump property rights\" under the new law. \"It cant be kept a secret,\" he said. \"Given the number of units that they have in Texas, they just wanted to make it very clear as to where they were going to be, and I would expect to see a number of restaurants follow.\", But Open Carry Texas founder C.J. Grisham said Whataburgers policy was \"premature and irresponsible,\" and that the restaurant caved to \"fear mongering.\", \"I think most gun owners that know this policy are simply not going to go to Whataburger, like me,\" he said. The group Moms Demand Action For Gun Sense in America put out a statement applauding Whataburgers actions. The organization has successfully petitioned other chains, including Sonic and Chilis Grill & Bar, to adopt similar policies. Stephanie Lundy, spokeswoman for the organizations Texas chapter, said she has spoken to mothers who have teenage children working in the companys restaurants late at night. \"They do not feel that part of their job description should involve assessing the intention of armed folks,\" she said. She described Atkinsons announcement as \"good old Texas common sense.\", \"Texans are bold and brave,\" she said. \"And that is what you are seeing from this CEO who is a gun owner.\", Patrons have reacted in different ways. Outside a Whataburger in San Antonio, Charlie Hair said he would feel safer if the chain allowed customers to openly carry firearms. \"I prefer an armed society to an unarmed one,\" he said as he exited with his 8-year-old son. But Mary Jones, who was with her 15-year-old grandson, said she was happy that Whataburger took a stand against open carry. \"Why do you need to bring a gun into a store where there are kids?\" she asked. \"We are not in the Wild, Wild West.\", Associated Press]", "Date": "20150712", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/business/ct-whataburger-open-carry-law-20150712-story.html", "Title": "[Whataburger takes stand against Texas' new open carry law ]"}