{"Content": "[After more than a half-century of hostility, the United States andCubadeclared Wednesday they will reopen embassies in each others capitals this month, marking a historic full restoration of diplomatic relations between the Cold War foes. For President Barack Obama, the opening of the U.S. Embassy in the heart of Havana is one of the most tangible demonstrations of his long-standing pledge to engage directly with U.S. adversaries. Heralding the embassy agreement, Obama declared: \"This is what change looks like.\", Cuban television broadcast Obamas statement live, underscoring the new spirit. In a letter to Obama, Cuban President Raul Castro praised the embassy announcement as a way to \"develop respectful relations and cooperation between our peoples and governments.\", Despite the historic step, the U.S. andCubaare still grappling with deep divisions and mistrust. The U.S. is particularly concerned aboutCubasreputed human rights violations.Cubais demanding an end to the U.S. economic embargo, the return of the U.S. military base at Guantanamo Bay and a halt to U.S. radio and TV broadcasts aimed at the island. Obama wants Congress to lift the embargo, but staunch Republican opposition makes that unlikely in the near future. Republicans, as well as a handful of Democrats, say Obama is prematurely rewarding an oppressive government that jails dissidents and silences political opponents. \"The Obama administration is handing the Castros a lifetime dream of legitimacy without getting a thing for the Cuban people being oppressed by this brutal communist dictatorship,\" said House Speaker John Boehner, R-Ohio. Republican presidential contenders had their say, too. Sen. Marco Rubio, son of a Cuban immigrant, said Obama was making concessions to an \"odious regime;\" former Florida Gov. Jeb Bush said the plan was \"legitimizing the brutal Castro regime,\" and Texas Sen. Ted Cruz said it was a \"slap in the face of a close ally\" to put an embassy in Havana before Jerusalem. Indeed, the historic thaw in U.S.-Cuba relations is seen by the White House as a central part of the presidents foreign policy legacy. Obama has long argued that the U.S. policy of isolatingCuba, a country just 90 miles south of Florida, has been ineffective in forcing the kind of change opponents demand. \"We dont have to be imprisoned by the past,\" Obama said.. The U.S. cut off diplomatic relations withCubain 1961 after Fidel Castros revolution. The U.S. spent decades trying to either overthrow the Cuban government or isolate the island, including toughening the embargo first imposed by President Dwight D. Eisenhower. But after months of secret talks aided by the Vatican, the U.S. andCubaannounced in December that they were moving to end Cold War hostilities. Since then, officials have been locked in negotiations over terms for opening embassies. While details of those terms remained vague, Obama administration officials said they were satisfied with the level of access Cubans will have to the U.S. Embassy and the level of restrictions placed on U.S. diplomats in Havana. While Americans wont have unfettered freedom of movement, officials said they would now only notify the Cuban government of travel outside of Havana, not seek permission. The embassy restrictions are similar to those in countries run by authoritarian governments including China, Russia, Myanmar, Zimbabwe and Belarus. Full diplomatic relations with be restored on July 20. Secretary of State John Kerry will travel toCubathis summer to raise the U.S. flag over the embassy, the first trip to the island by the top American diplomat since 1945. Obama did not nominate an ambassador Wednesday and there was no indication that he planned to do so quickly. White House officials acknowledged that an eventual nominee would likely face opposition from critics of the presidents broaderCubapolicy. \"It would be our strong preference that once an ambassador has been nominated, for that individual to be treated fairly by the United States Senate and confirmed in bipartisan fashion,\" Obama said. Since the late 1970s, the United States andCubahave operated diplomatic missions called interests sections in each others capitals. The missions are technically under the protection of Switzerland, and do not enjoy the same status as embassies. With diplomatic infrastructure already in place, administration officials said any efforts by Congress to block funding for an embassy would be unsuccessful in preventing an upgrade to the American post in Havana. The Republican-led House Appropriations Committee voted last month to curb Obama administration efforts to work on an embassy inCubaunless the White House certifies that Havana is meeting the terms of a 1996 law aimed at pushing the island nations government toward democracy. That laws conditions includeCubasextradition of people who are accused of crimes in the U.S. In its budget request last February, the Obama administration asked Congress for $6 million in 2016 for the U.S. mission in Havana to \"expand its presence and transition to embassy status to handle more extensive operations.\", Even without specific congressional approval, the State Department could well be able to access the money it requested because agencies are permitted to shift relatively small amounts of money among budget accounts, according to congressional aides. Associated Press]", "Date": "20150701", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-cuba-embassy-20150701-story.html", "Title": "[President Obama: U.S. embassy in Havana marks 'new chapter' in Cuba ties ]"}