{"Content": "[\"Reagan has accelerated the moral disarmament of the West by elevating wishful thinking to the status of political philosophy.\", George F. Will, 1987, on the United States nuclear weapons negotiations with the Soviet Union. Amid all the criticism of President Barack Obamas proposed agreement with Iran on its nuclear facilities, its worth keeping in mind that some people just cant stomach the idea of arms control. They see it as a trap, a delusion, a form of appeasement and a slow-motion surrender to evil. They do not hope for good agreements. They hope for no agreements. Considering their opinions on this deal is like asking vegans to review a steak house: A negative response is predetermined. Ronald Reagan began as one of those people. When Jimmy Carter signed the second Strategic Arms Limitation Treaty with the Soviets, Reagan used his daily radio commentaries to highlight its alleged defects. During his 1980 campaign, he vowed to scrap the treaty. SALT II wasnt ratified under Carter. When he came into office, Reagan did something unexpected: He didnt push for ratification of the accord, but he did scrupulously abide by it. The critic became the custodian. What he apparently discovered upon taking office and hearing from experts in the government is that the treaty was a net benefit for the United States. Once he was personally responsible for the security of the American people and our European allies, Reagan changed his mind. So he abided by SALT because he had an interest in persuading the Soviets to do likewise. By the time it expired in 1985, he was working with Soviet leader Mikhail Gorbachev to achieve additional curbs on nuclear weapons. Reagan evolved on the issue, but most conservatives did not. When he signed the Intermediate-Range Nuclear Forces Treaty in 1987, Free Congress Foundation founder Paul Weyrich said he told the president that \"nothing that he was saying made any sense.\" William F. Buckleys National Review called the accord \"catastrophic.\" The treaty was approved anyway and the West somehow went on to win the Cold War. If conservatives vilified an arms-control agreement approved by Reagan, whom they revere, its not astonishing to find them vilifying one approved by Obama, whom they despise. But the charges leveled against Obamas deal with Tehran are no more convincing than the ones made against Reagans deal with Moscow. U.S. Sen. Bob Corker, R-Tenn. objected because of Irans \"long history of covert nuclear weapons-related activities, support of terrorism and its current role in destabilizing the region.\" Sneered U.S. Sen. Mark Kirk, R-Ill. \"Neville Chamberlain got a better deal from Adolf Hitler.\", If the best analogy you can find is 77 years old, maybe its time to read up on events that have transpired since then. The reason Kirk and others ignore more recent history, like the 1980s, is that it provides no support for what they insist on believing. One complaint is that the accord fails to solve problems it was not designed to solve. Iran does many things we dont like much as the Soviet Union did in 1987. Gorbachev was still making war in Afghanistan and maintaining totalitarian regimes throughout Eastern Europe. But getting a troublemaking enemy to take steps that make it less fearsome is something to welcome, not abhor. There is one big difference between Reagans arms agreements and this one. The Soviets were allowed to have thousands of nuclear weapons. The Iranians are allowed to have zero. So Iran supports terrorism, aids Syrias Bashar Assad, trains Shiite militias in Iraq and meddles in Yemen? Well, better it should undertake such mischief without nukes than with them. If Iran were a model of responsible behavior, we wouldnt be so worried about its potential to acquire the bomb. Its precisely because we find the Tehran government untrustworthy and destabilizing that we want to deny it an atomic arsenal. The question is not whether the agreement works miracles to soften the hearts of the Iranian rulers. Its whether it curtails their ability to harm us and our allies through specific requirements we can verify and enforce. If so, it will greatly enhance the credibility of arms control. The critics are haunted by two nightmare scenarios. The first is that Obama has made a bad deal with Iran. The second is that hes made a good one. Steve Chapman, a member of the Tribune Editorial Board, blogs at chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150403", "Author": "[Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-iran-nuclear-arms-reagan-obama-perspec-0405-20150403-column.html", "Title": "[No Iran deal could convert Republicans]"}