{"Content": "[About 2,000 United Steelworker members, family and supporters marched Friday in downtown Gary in a call for a fair contract from U.S. Steel. With the current labor contract set to expire Sept. 1, the union is calling for a contract that doesnt slash retiree benefits and pay or reduce union input in safety. The rally, one of several being held at US Steel and ArcelorMittal locations across the country this week, is a show of solidarity for the USW bargaining team, which has been meeting in Pittsburgh with officials from the two steel companies trying to hammer out a new three-year contract. A spokeswoman for U.S Steel did not respond to a request for comment. \"We are a fighting union. We will always be a fighting union and will continue to fight for working men and women,\" said Bill McCall, president of USW Local 1066, as the crowd cheered. He said the company wants to cut worker pay, while its chief executive officer, Mario Longhi, received more than $13 million in total compensation in 2014. \"Thats $1,507 an hour, $25 a minute and 33 times the median income for a U.S. household,\" McCall said. Many of the union leaders and others joining the march spoke on the need to help the retirees. According to the USW, both U.S. Steel and ArcelorMittal want to do away with retiree health care benefits and have them shop the insurance market on their own. A similar number of Local 1010 and 1011 USW members staged a picket Wednesday at Arcelor Mittal in East Chicago. \"Our retirees bled for us. Its time for us to bleed for them,\" said Mike Young, president of USW Local 6103. Kenny Yatsko, vice president of U.S. Steelworkers Organization of Active Retirees Chapter 7-1, said he worked for U.S. Steel for 37 years. \"We gave up wages to get these benefits. Now they want to take our benefits away,\" he said. Greg Mikolajczak, a 20-year employee with U.S. Steel, said the company misrepresents how much the steelworkers earn when it says they make about $97,000 a year. \"We make about $54,000 a year without overtime. We make that money working 60 to 70 hours a week, a lot of it mandatory,\" he said. The steelworkers received support from three mayors at the rally, Gary Mayor Karen Freeman-Wilson, Portage Mayor James Snyder and Hobart Mayor Brian Snedecor. \"While we know this company created this city, we know it didnt do it in the board room. It did it on the backs of its workers,\" Freeman-Wilson said. She said U.S. Steel needs to play fair, by providing good health care, fair wages and safe working conditions. The group also paused for a moment of silence upon learning that a fellow steelworker died Friday on the job at the ArcelorMittal mill in Burns Harbor. The employee, whose name was not released, was a member of USW Local 6787 and worked at the BOF, union officials said. Porter County Coroner Chuck Harris said Friday evening that the 61-year-old ArcelorMittal steelworker fell to his death and that an autopsy has been scheduled for Monday. In a separate matter involving negotiations, the USW said Friday it presented \"a complete and comprehensive contract\" to ArcelorMittal management that meets the needs of its members and retirees while saving the company millions in short-term expenses and long-term liabilities. The USW said ArcelorMittal hasnt responded to its proposal. Karen Caffarini is a freelance reporter for the Post-Tribune. Carrie Napoleon contributed.]", "Date": "20150821", "Author": "[Karen Caffarini]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-steel-rally-gary-st-0822-20150821-story.html", "Title": "[USW marchers rally in Gary for fair contract ]"}