{"Content": "[The farther the left and right wings in politics move toward extremes, an old saying goes, the more they resemble each other. You can see this vigorously at work these days in the Republican campaign of billionaire Donald Trump and the Democratic campaign of Vermont Sen. Bernie Sanders. Both are drawing huge crowds and surprisingly high poll numbers for their seemingly candid and courageous disregard for the usual political etiquette. With their politically opposite appeals, each has stirred up a segment of society that longs for candid speech, clear solutions, strong leaders and, at least, a chance to \"shake things up\" in a gridlocked political establishment. Whether they lean right or left, the ranks of these moody masses gave us the tea party at one political extreme and the Occupy Wall Street and Black Lives Matter movements at the other. In recent days we have seen how both Trump, now a seasoned reality TV star, and Sanders, a self-described Democratic socialist, have faced sharp criticism within their separate political tribes for omitting or offending key constituencies. And it is here that we see key differences in the ways that the two of them handle the criticism, differences that tell us a lot about how each side can expand its appeal or not. In the days after the Republican presidential debate, Trump appeared to have polarized his own party over remarks that, at best, remind me of why the now-defunct Spy magazine in 1988 tagged the flamboyant real estate mogul as a \"short-fingered vulgarian.\", As if Trump cared. \"I dont frankly have time for total political correctness,\" he said, sparking thunderous applause from the Republican crowd at the debate. \"And to be honest with you, this country doesnt have time either.\", The Los Angeles Memorial Sports Arena was filled with Democratic hopeful Bernie Sanders supporters on Monday night. During the rally, Sanders pledged to end institutional racism if he is elected president. August 11, 2015. (AP), The Los Angeles Memorial Sports Arena was filled with Democratic hopeful Bernie Sanders supporters on Monday night. During the rally, Sanders pledged to end institutional racism if he is elected president. August 11, 2015. (AP), This was his response to Fox News Megyn Kelly after she listed some of his descriptions of women he doesnt like (\"fat pigs, dogs, slobs and disgusting animals\") and asked, \"Does that sound to you like the temperament of a man we should elect as president? And how will you answer the charge from Hillary Clinton, who is likely to be the Democratic nominee, that you are part of the war on women?\", Many, including many fellow conservatives, were shocked although they should not have been surprised by Trumps casual dismissal of what I think most people still would call common decency. Yet Trump, unbowed, emerged from the evening, still dominating the national political conversation (its August, which makes that easier) and with no apparent damage to his first-place standing in polls. In short, there was nothing in those numbers to encourage Trump to be a nicer guy, whether on the campaign trail to women or to anybody else. But heres where we see the differences between Trump and Sanders. While Trump makes a rallying cry of his defiance to \"total political correctness,\" Sanders has been stalked by it. In particular, the Black Lives Matter movement, which grew out of protests over shootings of unarmed black men by white police officers, has interrupted two major Sanders events, including one in Seattle last weekend. Demanding that Sanders, who has focused mainly on income inequality, address more directly issues related to institutional racism in housing, education and criminal justice, the group ultimately forced the senator to leave the stage without speaking. Frankly, I find the silencing of a valuable ally to be a foolishly self-defeating way to call for more dialogue, even when youre right. Yet Sanders seems to have gotten the message. He has released a comprehensive \"racial justice platform\" that has won praise from some of the movements leaders, and he has hired a young African-American activist, Symone Sanders (no relation to the senator), to serve as his campaigns press secretary. Smart move, for starters. The junior senator has been an activist in civil rights and other causes since his student days at the University of Chicago in the early 1960s. But his impressively huge crowds have been even less diverse than his 95-percent-white home state of Vermont. As Republican Mitt Romneys demographically driven defeat revealed in 2012, both parties need to reach beyond their traditional base to win national elections. Republicans say they got that message. They have yet to show it. Clarence Page, a member of the Chicago Tribune Editorial Board, blogs at chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150811", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-bernie-sanders-donald-trump-megyn-kelly-perspec-0812-20150811-column.html", "Title": "[What Bernie Sanders knows and Donald Trump doesn't]"}