{"Content": "[Mayor Rahm Emanuels administration said it will appeal a Cook County judges decision Friday that ruled unconstitutional a state law reducing municipal worker pension benefits in exchange for a city guarantee to fix their underfunded retirement systems. The 35-page ruling by Judge Rita Novak, slapping down the citys arguments point by point, could have wide-ranging effects if upheld by the Illinois Supreme Court. Her decision appeared to also discredit efforts at the state and Cook County levels to try to curb pension benefits to rein in growing costs that threaten funding for government services. The issue of underfunded pensions, and how to restore their financial health, is crucial for the city and its taxpayers. The city workers and laborers funds at issue in Fridays ruling are more than $8 billion short of whats needed to meet obligations and are at risk of going broke within 13 years after many years of low investment returns fueled by recession and inadequate funding. Without reducing benefits paid to retired workers, or requiring current workers to pay more, taxpayers could eventually be on the hook for hundreds of millions of dollars more in annual payments to those city funds before the even worse-funded police and fire retirement accounts are factored into the taxing equation. Fridays ruling also could further harm the citys rapidly diminishing credit rating. Even before the decision, Moodys Investors Service had downgraded the citys debt rating to junk status based on pension concerns. And after Novaks ruling, Standard & Poors Ratings Service warned that it would lower the rating on city debt within the next six months without a fix. Novaks ruling was not unexpected because of a decision in May by the Illinois Supreme Court on a similar pension case. The states high court unanimously struck down a law changing state pensions, saying the Illinois Constitutions protection against \"diminished or impaired\" pension benefits for public workers and current retirees was absolute. City officials had argued that an agreement reached with 28 of 31 labor unions to alter retirement benefits out of the municipal and laborers pension funds two of the citys four pension plans was different from the plan struck down by the Supreme Court. The city argued that it was providing a \"net benefit\" by coupling the end of annual compounded cost-of-living increases and higher employee contributions with a guarantee of full pension funding over time. \"We continue to strongly believe that the citys pension reform legislation, unlike the state legislation held unconstitutional this past spring, does not diminish or impair pension benefits but rather preserves and protects them,\" Stephen Patton, the citys corporation counsel, said in announcing a Supreme Court appeal of Novaks ruling. But in her ruling, Novak said such a trade-off isnt legal. Pension benefits are guaranteed by the state constitution, she said, but any funding scheme to stabilize the pension funds ability to pay out benefits is not constitutionally guaranteed and could be changed by politicians at any time. \"No net benefit can result where the loss of guaranteed rights are exchanged for legislative funding choices,\" Novak wrote. While disappointed by Novaks ruling, the Emanuel administration has always known \"that this matter ultimately will be resolved by the Illinois Supreme Court,\" Patton said. But officials for the American Federation of State, County and Municipal Employees Council 31 said the city should forgo a costly appeal and pay the promised pension benefits. \"We would urge the city not to waste further time and taxpayer dollars on an appeal,\" said Anders Lindall, a spokesman for AFSCME, one of the unions that challenged the law. \"The problem with pensions is a funding problem, its not a benefit problem,\" Lindall said, adding that the average annual pension payment for a city worker is $32,000. \"City employees have always paid their share.\", One expert on the Illinois Constitution characterized the citys chances of winning on appeal as futile, given the previous Supreme Court opinion on state pensions. Ann Lousin, a professor at John Marshall Law School who teaches a course on the state constitution, said she viewed the citys chances of success at \"somewhere between zero and a snowballs chance in hell.\", As for the city arguments, Lousin said, \"Theres an old saying among lawyers: creative but not convincing.\", In ruling against the city, Novak also appeared to reject a concept being pushed by Springfield politicians as well as Cook County Board President Toni Preckwinkle to try to find ways to reduce pension benefits for current workers in exchange for additional \"consideration.\", In its May ruling, the Supreme Court noted that benefits may be added in exchange for additional employee contributions or other consideration. Novak said the high court was only reiterating previous findings that benefits could be increased through \"consideration,\" not decreased. The judge said unions that backed the pension changes sought by the Emanuel administration did so outside of the collective bargaining process. Such a move \"does not account for the personal nature of the rights guaranteed by the pension protection clause,\" she wrote. \"An individual is entitled to challenge statutes that result in a reduction of benefits as a violation of the pension protection clause when applied to his or her own pension,\" Novak wrote. In essence, the judge found that any pension fund member could challenge an agreement to change pension benefits, even if backed by a union agreement. At the same time, her ruling would make it all but impossible to reduce benefits since every member of the fund would have to individually comply. Charles Lomanto, 60, a retired Streets and Sanitation Department employee from Avondale, heralded the ruling. Lomanto said that under Emanuel, his city health care subsidy is being phased out, his annual benefit cost-of-living increases were being reduced and property taxes were increasing. \"Were getting a triple whammy,\" he said. \"Weve lived here. Weve dedicated our lives to the city. Were willing to sit down and talk. Rahm never came to the retirees.\", rap30@aol.com, hdardick@tribpub.com, Twitter @rap30, Twitter @ReporterHal]", "Date": "20150724", "Author": "[Rick Pearson, Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-chicago-pension-ruling-met-20150724-story.html", "Title": "[ Judge finds city's changes to pension funds unconstitutional]"}