{"Content": "[Taking a firm stand against Obamacares controversial contraception mandate, Wheaton College on Friday will stop providing any health insurance for students. The decision, announced to students July 10, will halt health care coverage for about a quarter of the colleges 3,000 undergraduate and graduate students, forcing them to shop for other plans just weeks before their coverage ends. Health care insurance for faculty and staff is not affected. One of the most hotly debated elements of the Affordable Care Act has been the requirement for insurance plans to include base coverage for birth control. Wheaton College was among dozens of Christian nonprofits, as well as businesses such as Hobby Lobby, that argued the mandate was an assault on religious freedom. The college appears to be one of the first to move its protracted legal battle from the courtroom to campus. Wheaton College in suburban Chicago says it will stop offering health insurance plans to students to avoid providing birth control coverage mandated by the Affordable Care Act. (WGN-TV), Wheaton College in suburban Chicago says it will stop offering health insurance plans to students to avoid providing birth control coverage mandated by the Affordable Care Act. (WGN-TV), During an information session for students last week that was streamed live online, Paul Chelsen, Wheatons vice president of student development, said he regretted the last-minute decision and the hardship it brings. \"What has brought us here is about student health insurance, but its bigger than student health insurance,\" Chelsen said, according to a recording of the session obtained by the Tribune. \"What really breaks my heart is that there are real people that are affected by our decision. But if we dont win this case, the implications down the road in terms of what the government will tell us what we can and cannot do will be potentially more significant. \"I acknowledge that students have been hurt by this decision and I regret that,\" he added. Officials at the west suburban evangelical school said a compromise provision that would require them to notify the government of their religious objections would prompt the schools insurance carrier to provide the coverage directly to students. Pulling the trigger on that action, and providing the health care plan in the first place, would force Wheaton to violate its religious beliefs, officials said. \"When you order somebody to provide something for the beneficiaries of my plan, you are using my plan,\" said Mark Rienzi, a lawyer for the Becket Fund for Religious Liberty, a Washington-based law firm representing Wheaton. \"For the government to do that is to effectively change the terms of the plan.\", Rienzi said it was not enough that the carrier would provide the emergency contraception and that it would be made clear that Wheaton did not condone the services. \"Thats moral analysis, and Wheaton College doesnt feel that way,\" he said. \"Its very reasonable not to feel that way. The government insists its not creating new insurance policies. Its riding on existing insurance policies.\", While the Roman Catholic Church objects to all forms of contraception, many Protestant institutions do not mind covering several forms of birth control, including pills and sterilization procedures. But methods such as intrauterine devices and FDA-approved morning-after pills that prevent a fertilized egg from attaching to the uterus would violate Wheatons religious principles because some evangelical Christians equate those processes to abortion. Some religious groups and schools have accepted the governments compromise plan. Wheaton filed a federal lawsuit in 2012. Since then, it has postponed complying with the order, most recently with a temporary stay granted by the U.S. Supreme Court. Chelsen said the college was on the verge of canceling insurance last year before the high courts ruling July 3, 2014. The injunction came the day after justices ruled in Hobby Lobbys favor that a family-owned corporation could not be forced to offer contraception coverage for its employees. When the 7th U.S. Circuit Court of Appeals denied Wheatons request earlier this month for a preliminary injunction while its lawsuit is pending, it hastened the colleges decision to drop the students health care coverage. \"When Wheaton College tells us that it is being forced to allow use of its health plans to cover emergency contraceptives, it is wrong,\" Judge Richard Posner wrote in the opinion. Posner wrote that he didnt see any reason why Wheaton couldnt abide by the compromise plan while the case moved through the court system. \"This is hardly a burdensome requirement,\" Posner wrote. In the presentation to students, Chelsen explained that the college must be consistent and that the students hardship serves a greater purpose. \"We are attempting to protect the larger lawsuit the college has against the Department of Health and Human Services,\" Chelsen said. \"The reason protecting that case is so important is because basically what has happened is the government is telling us we have to offer something that we find morally objectionable.\", Student health insurance is a relatively recent addition to Wheatons enrollment package. Even though the federal government does not require higher education institutions to provide health insurance, Wheaton added a requirement in 2010 that students enroll or provide proof of comparable insurance every year. Before 2010, students enrolled only in accidental or illness coverage that could protect them in emergencies. Most college students are covered under their parents health plans. The minimum annual cost for last years package was $2,700; this years plan would have been similar. But the college already had notified students that it would no longer cover spouses and dependents. Chelsen said some families believed the burden of proof was a headache. \"Some of our families are actually saying, Thank you because they did not like the current system we had in place,\" Chelsen said. But some students and alumni object to the colleges decision. Rising senior Chris Prescher, 22, said he is unaffected by the change. He understands the moral objection, but disagrees with the colleges action. \"I fear the administration is putting petty politics above caring for students.\", The Rev. Katherine Kallis, 74, who graduated in 1962, also disagrees. \"I just feel it is a very sad thing. Nobody is forcing anybody to go against their religious convictions. ... Wheaton is really overstepping its bounds.\", Meanwhile, the college is trying to ease the burden for those who took advantage of the student insurance, especially international students. Chelsen said the college will set aside money to help students who might struggle to pay for an increase in the cost of insurance. A page on the Wheaton College website walks students through the process of finding a private health insurance plan or one on the federal public health insurance exchange, HealthCare.gov. Though as of 1 p.m. Wednesday, the colleges website had been down for hours. Chelsen said the insurance decision doesnt affect access to the campus health clinic. It also doesnt affect Chelsen or other faculty and staff. The Affordable Care Act requires that businesses with more than 50 employees provide insurance. A spokeswoman for the college said its \"committed to doing everything it can to provide high-quality health care in accordance with its religious convictions\" to employees, but declined to provide further details. , Chelsen said the college is investigating the possibility of a self-insured plan for students in the future. \"I understand this is a tumultuous, unexpected decision, but were hoping its not long term,\" Chelsen told students last week. \"I cant make any promises. I dont want to raise expectations for something we cant provide. But were going to give it our best shot.\", mbrachear@tribpub.com , Twitter @TribSeeker]", "Date": "20150729", "Author": "[Manya Brachear Pashman]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-wheaton-college-ends-student-insurance-met-20150728-story.html", "Title": "[ Wheaton College ends coverage amid fight against birth control mandate ]"}