{"Content": "[Ive been following the Obama administrations selling of the Iran nuclear deal through the eyes of a small boy watching his father buy a used car. A salesman himself, and proud of his negotiating skills, my father always took me along when trading in the familys old car for a slightly newer one. Afterward, hed annotate the game he and the dealer had played, considering it a useful paradigm for much of life. So I recognized the administrations pre-deal pitch as a standard opening move. But its follow-up was puzzling. It should have completed the classic bait-and-switch gambit. The bait was certainly there. During the negotiations, the deal was advertised as putting an end, once and for all, to Irans quest for an atom bomb. Should Iran try any funny stuff, international inspectors would be Johnny on the spot searching for nuclear violations anywhere at any time. But the deal gives Iran a 24-day notice of a proposed inspection, plus paperwork and an appeals process that could further keep watchful eyes at bay. That kind of deal wouldnt faze an old-school car salesman. It would get his creative juices flowing. Bait-and-switch depends upon convincing the customer he doesnt really want the deal that lured him into the auto showroom. That takes a bit of finesse. A salesman cant just deny the existence of the low-mileage car the little old lady drove only to church. The customer saw it in an ad. Yet thats just what Secretary of State John Kerry attempted. Asked on a recent Sunday morning talk show about anywhere, anytime inspections, he replied: \"This is a term that, honestly, I never heard in the four years that we were negotiating.\", Unfortunately, Ben Rhodes, the deputy national security adviser for strategic communication for President Barack Obama, had previously told CNN that \"under this deal, you will have anywhere, anytime 24/7 access as it relates to the nuclear facilities that Iran has.\", Kerry would have been better advised to try a subtler strategy used on my wife and myself when we last bought a car. We were studying the price sticker on one when a salesman approached, waving his hand as if to say: \"Im not going to insult your intelligence by pretending those numbers are real.\", How could we not buy a car from him? Hed complimented us as being superior to the unwashed masses unable to recognize when something is too good to be true. I have no idea if we got a bargain or were taken. As we signed the sales agreement, I was otherwise preoccupied, enjoying a fringe benefit of the deal: having my ego massaged. Now there is a well-established alternative to that salesmans approach. Instead of being good buddies with a customer, he can treat him like an opponent and chip away at his sales resistance. Telephone solicitors favor this method. Say \"no thanks\" to their offer, and they ask: What dont you like about the product? Its for our research only, they assure you. Answer that, and a follow-up question is sure to come your way. You are made to feel guilty for not wanting to buy something. Some people hang up; others, too punch-drunk to fight back, throw in the towel and buy something,, Obama administration spokespeople have taken that hardball approach. They have warned that if Congress rejects the Iran deal, we could start down the road to yet another war in the Middle East. A spurned Iran could set the throttle of its atomic program to full steam ahead. Perhaps trying to counter the intensive lobbying of Israels supporters, Kerry predicted that the Jewish state would be blamed for a failed deal. Yet the harder the administration pushes that doomsday scenario, the less it resonates with the public. Polls show a greater percentage of Americans oppose the Iran deal than support it. But there is a tried-and-true way to keep a deal from going down the tubes. I was trained in it during a brief career as a salesman at a schlocky furniture store. Sometimes you would have a customer whose fancy was taken by, say, a dining room set. Yet you just couldnt get him to put his John Hancock on a sales agreement. Perhaps youd rubbed him the wrong way. Maybe youd aroused his suspicion by coming on too strong about the great deal you were offering. Whatever the cause, when an impasse appeared evident, I would bring in another salesman, introducing him as, say, \"Mr. Otto, our stores furniture buyer.\" Mr. Otto would win back the customers confidence by conceding the deals shortcomings. The set hadnt sold in the numbers hed hoped for. \"But you folks like it,\" hed say, \"so lets sit down and cut a deal that works for both of us.\", The used car dealers version is to tout a cars nicks and dents as a benefit: \"Sure its got a few scratches, but think of the dollars each one of them is saving you.\", Likewise, the Iran deal shows a few nicks and dents. Instead of delivering a knockout punch, it puts Irans nuclear program on hold a lengthy one, but of limited duration. The text also contains a curious provision by which we are to share our knowledge of how to secure an atomic facility against sabotage. Perhaps it was a necessary sweetener to get Iran to sign on, but it cries out for explanation which hasnt been forthcoming by officials playing hardball salesmen. That is not to say that the Iran deal can only be rammed down the publics throat. But the president presumably wants the nuclear agreement to be his legacy, not an albatross. So as he huddles with his advisers before addressing the nation, perhaps he should say: \"Oh, Mr. Otto, could you join us for a moment?\", Ron Grossman is a Chicago Tribune writer and former history professor. rgrossman@tribpub.com, Twitter @quondamprof]", "Date": "20150804", "Author": "[Ron Grossman]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-nuclear-iran-perspec-0804-20150804-story.html", "Title": "[Iran deal is like selling a used car, dents and all]"}