{"Content": "[Youll soon be able to download an electronic version of your Social Security statement, but chances are it wont enhance your retirement one bit. Thats because you probably wont change your claiming date based on what you find, according to academic studies that have looked at claiming behavior. Few workers made changes to their benefit start date as a result of the Social Security Administration issuing paper benefit statements beginning in 1995, according to the Center for Retirement Research at Boston College. (The statements were largely discontinued in 2011 as the agency tried to move everyone to the website version, but after some public outcry the paper statements were reinstated on a limited basis.), Recipients can begin getting reduced benefits at age 62, four years before the full retirement age for those born between 1943 and 1954. For people in that age group, claiming at age 62 would mean a 25 percent reduction in benefits compared to the benefit at full retirement age, 66. The reduction is an actuarial calculation designed to make the benefit roughly equal regardless of the claiming age if the recipient lives to his exact life expectancy. People who delay claiming beyond full retirement age can boost their monthly benefit by 8 percent per year up to age 70. Thats a 32 percent cumulative raise. Reviewing various studies of claiming behavior, the Center for Retirement Research concluded in a recent brief that while the earnings history data available at www.ssa.gov/myaccount/ and in paper statements is useful and informative, the statements themselves so far havent persuaded future beneficiaries to delay claiming in order to boost their monthly benefits. And the research centers Steven Sass, author of the brief, doesnt expect much difference with the new downloadable file, which was expected to be available by the end of July. \"I doubt it moves the needle,\" said Sass, program director for the Center for Retirement Researchs Financial Security Project. The file allows users to transfer their earnings data into a third-party software program so it can project future benefits without having to manually input many years of wages. Using the detailed wage data allows for a more accurate benefit forecast and lets users indicate whether they intend to keep working at their current salary until retirement age, which is the assumption built into SSAs annual benefit estimate. So heres a double-dog-dare challenge: Sign up for an online Social Security statement account about 20 million users have done so thus far. Once you have an account, youll have access to your downloadable file as soon as they are available. (They were expected to be online by the end of July, according to SSA officials.) Then actually use the data to create an optimal claiming strategy that reflects your financial resources and retirement goals. The key data on the file is the earnings record the lifetime earnings history that determines your eventual monthly benefits. Youll be able to take that data and plug it into a third-party calculator say from a firm like www.financialengines.com or www.socialsecuritysolutions.com or from your financial adviser, assuming the adviser has the proper technical capabilities to work with the data file. From there, you can blend your estimated monthly benefits with those of a spouse, for example, to determine the optimal claiming strategy. You might also be able to model how different claiming strategies would work with the rest of your portfolio. \"Often, delaying a claim is going to maximize someones benefits, but a lot of people feel they cant afford to wait,\" said Kelly ODonnell, executive vice president at Financial Engines, a 401(k) adviser that also offers free tools on its website for retail investors. \"So this will show them, using their actual financial data, how to draw down an IRA or 401(k) to fund the gap years while they wait to file for benefits.\", Share your journey to or through retirement or pose a question at journey@janetkiddstewart.com.]", "Date": "20150727", "Author": "[Janet Kidd Stewart]", "Link": "http://www.chicagotribune.com/business/yourmoney/sc-cons-0730-journey-20150727-column.html", "Title": "[Come up with a strategy to get the most of your Social Security]"}