{"Content": "[Its not what Bostonians want to hear: The Farmers Almanac says another rough winter is in your stars. A year after Boston was pummeled with the snowiest winter on record, editors of the Maine-based publication have dubbed their latest forecast a \"winter deja vu,\" hearkening to last winters misery across the Northeast. Using a formula built on sunspots, moon phases and tidal action, the 199-year-old almanac that hits newsstands this week predicts cold and snowy weather from Maine to Montana. \"Say it isnt snow!\" quipped Editor Peter Geiger. The editors arent afraid to go out on a limb. Among their long-term projections in the 2016 edition: Fabulous weather from coast to coast for Election Day, something that could boost the presidential election turnout, Geiger said. Also, the unseasonably cold temperatures are supposed to dip down as far as Kentucky this winter, the almanac says. Editors predict milder weather out West, and chilly and wet weather for the South. The publication, not to be confused with the New Hampshire-based Old Farmers Almanac, uses a prediction method largely unchanged since the first almanac was published in 1818. Modern scientists consider such methodology to be tomfoolery. But long-term forecasts can be vexing even for conventional scientists. Mike Halpert, deputy director of the Climate Prediction Center, likened long-term forecasts to finding a \"small signal embedded in a lot of noise.\" The centers forecast for the past mild winter was largely correct, except for frozen New England. The \"polar vortex\" provided another surprise for the federal forecasters during the previous winter. Last winter, the almanacs prediction of \"shivery and shovelry\" came true in New England, where Boston recorded more than 100 inches of snow nearly 65 inches in February alone and set a new snowfall record. But the almanac didnt nail it everywhere: out West, it was unusually warm while the almanac projected cool temperatures. The almanac is a time-honored tradition with gardening tips, weather, astrology and life hacks. Those topics are resonating with younger readers, not just old-timers. The almanac distributes 1 million retail copies and 2.5 million promotional versions. But it also has 350,000 subscribers to a weekly email blast, 850,000 Facebook followers, nearly 25,000 Twitter followers and more than 13,000 Instagram followers. Theres also an app for smartphones and tablets. \"Its not your grandparents almanac, anymore,\" Geiger said. As for the weather, the editors will let the criticism roll off if their forecast misses the mark. \"All of us can take a lesson from the weather,\" said managing editor Sandi Duncan. \"It pays no attention to criticism.\", Associated Press, ]", "Date": "20150823", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-farmers-almanac-winter-20150823-story.html", "Title": "[Farmers' Almanac predicts another nasty winter for Northeast ]"}