{"Content": "[The National Rifle Association has been instructing Indianas National Guard members on how to use concealed weapons after Republican Gov. Mike Pence directed the states military bases and training centers to beef up security in response to recent attacks in Tennessee. According to a survey by The Associated Press, Indiana is the only state to enlist the NRAs help in the training, which the gun-rights group says it will conduct free of charge for any guardsman who wants to carry a concealed handgun. Although National Guard members traditionally have not been allowed to carry weapons while conducting most stateside duties, Pence is one of 14 governors who decided to arm them in the wake of a gunmans attacks last month on two U.S. military sites in Chattanooga that left four Marines dead. Gun control advocates argue its inappropriate for a state to involve a political lobbying organization in training members of the military, and even some National Guard officials from states that allow guardsmen to carry weapons question why a civilian organization is needed. \"This is a military problem to deal with, so were going to deal with it with the military,\" said Lt. Col. Joel Lynch, a spokesman for the Arkansas National Guard, which is handling the training of its Guard members itself. As governor, Pence has wide-ranging powers over the Indiana National Guard and appoints the adjutant general who oversees operations. Pence spokeswoman Kara Brooks declined to comment and directed inquiries to the Indiana National Guard. Guard spokeswoman Lt. Col. Cathy Van Bree said guard instructors have previously offered handgun instruction themselves but that Pences executive order last month allowing guardsmen to be armed requires a \"deeper level of training.\" She did not elaborate. In order to be armed, a guardsman must have a valid conceal-carry permit and undergo training. Van Bree declined to say how many members have been approved to be armed. Guy Relford, an NRA instructor who recently trained about 65 Indiana guardsmen at an armory in Franklin, said his \"basic pistol\" course delves into safety scenarios on when and when not to shoot. Without training, the National Guard has \"dramatically increased the possibility that someone could hurt themselves or others with a gun,\" Relford said. The AP survey of the 14 states that have armed their National Guards shows that most states had members of the military or law enforcement conduct the training. Only Indiana, Arkansas, Florida, Kentucky and Oklahoma said they allow guardsmen to carry concealed weapons. At least seven others including the largest state of California allow Guard members to carry weapons in plain sight. Officials in Alabama declined to release information about their firearms rules for guardsmen, while the Texas National Guard wouldnt say if concealed handguns were allowed. \"The fact is, our folks are very comfortable in using weapons and using discernment in when they use those weapons, so having an outside agency involved is a little bit of a surprise,\" Capt. Will Martin, a spokesman for the California National Guard, said of Indianas policy. Eric Dietz, a professor at Purdue University who studies homeland security issues, said his research suggests causalities in some active shooter situations could be reduced if someone, such as a guardsman, has a concealed handgun. Although more known for its role as an advocacy group, the NRA also frequently conducts handgun training programs for civilians. Relford says most Guard members dont get pistol training from the military, and those who do are taught using the standard 9mm. Pences policy applies to a vast array of firearms ranging from a .22-caliber up to a .357 Magnum. There are also legal and philosophical considerations because the militarys overarching focus is on threats abroad, not at home, which is the traditional role of law enforcement. Allowing different states to adopt different training methods also goes against the grain of military orthodoxy. \"You dont want to have the Indiana National Guardsmen trained a certain way that may be different from Illinois or Kentucky. There does have to be a standard across the board,\" said David Harris, a former adjutant general of the Illinois National Guard and now a Republican legislator, who supports the idea of arming guardsmen. The Brady Campaign to Prevent Gun Violence criticized Pence for recruiting the NRA, suggesting the organization is \"first and foremost\" a \"lobbying organization.\", \"There is no institution better equipped to train our servicemen and women than the US military itself,\" Dan Gross, the Brady Campaigns president said. \"This is not a job for lobbyists.\", Robert Dion a professor of political science at the University of Evansville, said Pence could reap political benefits in his upcoming re-election campaign by reaching out to the NRA in pro-gun Indiana. \"Any sort of association with the NRA helps his reputation more than it hurts it,\" Dion said. \"You can burnish your social conservative credentials by cozying up to the NRA and you can claim being fiscally responsible because you are not costing tax payers anything.\", Associated Press]", "Date": "20150821", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/ct-indiana-nra-firearms-training-20150821-story.html", "Title": "[Indiana enlists NRA to train National Guard on firearms]"}