{"Content": "[Andrea Zopp, head of the Chicago Urban League and a member of the embattled board of the citys public schools, said Friday she will seek the Democratic nomination for the U.S. Senate, setting up a primary fight next year with U.S. Rep. Tammy Duckworth. \"Im in. I am in,\" Zopp said, adding she expected a formal announcement of her candidacy for the seat held by Republican U.S. Sen. Mark Kirk at the end of this month or early next month. She said she was putting together a campaign staff and finance committee. Zopp, an African American with a background in corporate governance, was being urged to challenge Duckworth, a two-term congresswoman, by some Democrats, including former White House chief of staff Bill Daley, who have questioned the potential absence of a black candidate running statewide on the partys 2016 ticket in a presidential year when home-state President Barack Obama will not be running. Duckworth, of Hoffman Estates, announced her entry into the race late last month. Her campaign had no comment on Zopps candidacy. U.S. Rep. Robin Kelly of Matteson, first elected in 2013, also is still exploring a bid for the nomination. Zopp, a former Cook County prosecutor, was named president and CEO of the Urban League in 2010 and was previously executive vice president and general counsel at Exelon Corp. Prior to joining Exelon, she was a senior vice president, general counsel and corporate secretary of Sears Holdings Corp. In 2011, Zopp was named a member of the board of the Chicago Public Schools by Mayor Rahm Emanuel. CPS closed dozens of schools, faces a severe deficit and a credit downgrade, tough negotiations on a new contract with the Chicago Teachers Union and is undergoing a federal probe into circumstances surrounding a $20 million no-bid contract the school board approved for a contractor who once employed Barbara Byrd-Bennett, the school systems CEO. Zopps decision to get into the race comes as Kirk began airing the first television campaign ads of the 2016 race, a general election contest expected to become one of the most expensive and contentious in the country, given Illinois tradition of favoring Democrats in presidential years. Kirk, a former North Shore congressman who suffered a stroke in 2012, acknowledged as much Friday in explaining why he opted to run campaign ads unusually early, particularly after Chicago-area TV viewers have seen an almost unending run of political ads ranging from the 2014 race for governor to this years contest for Chicago mayor. \"It just reflects an understanding of the state and its partisan predilections that in the case of the Kirk campaign, were not going to be too overconfident. Were going to understand that we have to earn each vote,\" the senator said after speaking to the Chicago Council on Global Affairs. \"Every one of my races for Congress or for Senate has been quite a donnybrook. I would expect that to come. By going so early, thats recognition on my part of just how Democratic this state is and how much is going to be thrown at me by national Democrats,\" he said. rap30@aol.com, Twitter @rap30]", "Date": "20150515", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-us-senate-zopp-met-20150515-story.html", "Title": "[Zopp vs. Duckworth in Senate Democratic primary]"}