{"Content": "[We are confronted every week by stories of the most barbaric crimes committed by Muslim terrorists. We want to do everything we can to protect ourselves and catch and punish these evil people. In these circumstances, Arkansas Sen. Tom Cottons recent statement that every last prisoner detained in Guantanamo Bay, Cuba, should \"rot in hell\" seems to make perfect sense if, as he says, every last prisoner in Guantanamo is in fact a \"hardened terrorist.\", But that assumption, by any measure, is both false and dishonest. It is certainly what we were told in early 2002 when the U.S. military opened the Guantanamo prison camp: that these people were the \"worst of the worst,\" all hardened terrorists who would \"chew through a hydraulics cable\" to bring down an airplane. It soon became clear, however, that the facts were very different. We now know that, in spring 2002, after months of intensive and \"enhanced\" interrogations had failed to produce any useful intelligence, the CIA sent its top Arabic specialist to the island prison. He interviewed dozens of the detainees and discovered why we werent getting actionable intelligence: We had the wrong guys. He reported that most simply \"didnt belong there.\" His report was buried. By summer 2004, however, it had become generally acknowledged that none of the detainees then at Guantanamo was a significant player. Most had been picked up soon after 9/11 in and around Afghanistan and sold into captivity by local tribes people for bounties. They were not the leaders who were known to have escaped, but at most low-level foot soldiers, as well as a lot of innocent people swept up by mistake. As a June 21, 2004, New York Times article reported: \"In interviews, dozens of high-level military, intelligence and law enforcement officials in the United States, Europe and the Middle East said that, contrary to the repeated assertions of senior administration officials, none of the detainees at the United States Naval Base at Guantanamo Bay ranked as leaders or senior operatives of al-Qaida.\" After that, beginning in September 2004, the Bush administration transferred 29 allegedly \"more significant\" detainees to Guantanamo, including 16 so-called high-value detainees. Now, more than 10 years later, 122 detainees remain at Guantanamo. Only 10Khalid Sheikh Mohammedand nine other high-value detainees have been referred for criminal prosecution. Of the others, 56 have been cleared for transfer after careful screening by a multi-agency task force made up of the top security and law enforcement experts. They have determined unanimously that transferring these detainees from Guantanamo will not threaten U.S. security. Most of these men were cleared for release more than four years ago; some even earlier during the Bush administration. Has Cotton reviewed their files? Does he know something about them that all those security experts dont?, Fifty-six others are in a never-never land, neither cleared nor charged. The government has labeled them as people \"too dangerous to transfer but not feasible for prosecution.\" The label creates the impression that the government knows for sure that these men are hardened criminals but cant prosecute them because of some legal technicality. Unfortunately, few look behind the label at the actual evidence, even though most of it is now publicly available on Wikileaks. Far from definitively establishing their guilt, the evidence at most creates only suspicions about them. There is no credible evidence that they ever did wrong or intend to do harm in the future; what there is consists almost entirely of allegations by other detainees, many of whom have since recanted and are known to have made false allegations against others. Why would one detainee falsely accuse another? As one released detainee told us: \"I regret it but, after a while, I just told my interrogators whatever they wanted to hear.\", So what do we do with this group? We have no hard evidence against them but some basis for suspicion. Under our system, suspicion alone has never before been a basis for depriving people of their liberty. Should we change that principle now in the face of the terrorist threat? If we make that decision, shouldnt we do so honestly on the basis of the actual facts rather than by mischaracterizing these men as something they are not. Too often since 9/11 we have made decisions based on assumptions. We invaded Iraq based on the \"slam-dunk\" assumption that it had weapons of mass destruction. Would we have invaded Iraq had we known the truth? Would we, and the Middle East, and the world, be better off if we had acted on the basis of the real facts rather than false assumptions? We created the Guantanamo prison after 9/11 on the assumption that it was the right way to deal with the threat of further terrorist activity. Would we have done so if we had known that Guantanamo would become a moral and legal stain on our justice system and a major recruiting tool for ISIS, al-Qaida and terrorists around the world? Now that we know those things, why do we keep it open, at a cost of almost $400 million a year?, Today, we make decisions about Guantanamo based on false assumptions. Assuming that all the detainees are \"hardened terrorists,\" congressmen say none should be released and all should \"rot in hell.\" Professors construct elaborate theories on how we should incarcerate this new category of men whom we assume are \"too dangerous to release\" but cannot be charged because of some legal technicality. But we cannot continue to make decisions about the men still incarcerated at Guantanamo based on false assumptions. The fight against terrorism requires us to make difficult decisions. If we want to get it right, we must make those decisions based on facts, not myths. Thomas Wilner was counsel of record to Guantanamo detainees in the U.S. court decisions establishing their right to habeas corpus and to be represented by counsel. Andy Worthington is a British historian, investigative journalist and film director who is the author of \"The Guantanamo Files.\"]", "Date": "20150325", "Author": "[Thomas Wilner, Andy Worthington]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-guantanamo-bay-cia-detainees-perspec-0326-20150325-story.html", "Title": "[Dispelling the myths of Guantanamo Bay]"}