{"Content": "[Louisiana Gov. Bobby Jindal, R, who presides over a state with a high rate of gun violence and a low quality of gun laws, is shocked. \"We never wouldve imagined it wouldve happened in Louisiana or Lafayette,\" he said after last weeks movie theater shooting in Lafayette, La. Jindal responded with a kind of gunner jujitsu, calling for other states to emulate the sloppy standards of Louisiana, which has loose gun laws and has largely failed to supply mental health records to the criminal background check system, although a law signed by Jindal now requires it. Louisiana has the nations second-highest rate of death by firearm. Gov. Jindal sparks controversy over Westboro Baptist Church comments. July 28, 2015. (KSLA - Shreveport), Gov. Jindal sparks controversy over Westboro Baptist Church comments. July 28, 2015. (KSLA - Shreveport), \"How could this have happened?\" is perhaps the most dishonest question in all of gun land. American gun culture is impressively pervasive, remarkably influential and reliably deadly. Give the gun lobby its due: It gets results. It also gives the angry, paranoid and armed a collective voice. John Russell Houser, the cantankerous 59-year-old who opened fire at a showing of \"Trainwreck\" in Lafayette, seems to have dabbled in Hitler love. But his online complaints also echo the decline-and-fall narrative of National Rifle Association leader Wayne LaPierre. \"You must realize the power of the lone wolf, is the power that come forth in ALL situations,\" Houser reportedly wrote in an online forum, before heroically testing his theory on people in a movie theater. LaPierre, too, understands the call of the wild. \"Do you trust this government really to protect you and your family?\" he asked in a 2014 speech at the NRAs annual convention. \"Were on our own,\" LaPierre told his pack. \"Thats a certainty.\", LaPierres gunslinger, abandoned by government, fighting off the apocalypse, is under attack from every conceivable side. No place is safe from \"terrorists, home invaders, drug cartels, car jackers, knock-out gamers, rapers, haters, campus killers, airport killers, shopping mall killers and killers who scheme to destroy our country with massive storms of violence against our power grids or vicious waves of chemicals or disease that could collapse a society that sustains us all,\" LaPierre said in that same 2014 speech. Anyone can paint a picture of dystopia. LaPierre and the NRA work to realize it. When government tries to erect barriers between the homicidal and the rest of us, the NRA steps in to resist. California law empowers authorities to remove guns from the homes of felons and others who are legally barred from purchasing them. An NRA representative, speaking on an NRA News show, described that measure as a \"campaign of shame against gun owners.\", A recent proposal in Washington (\"trial balloon\" may be a more apt description) calls for screening Social Security recipients some of whom are officially deemed not competent to manage their own affairs. It would add the names of the mentally incompetent to the federal background-check database, an idea that generated a ferocious response from the NRA, which called it \"the largest gun grab in American history.\", From the NRA website:, \"Are you a prohibited person? A new, unconstitutional Social Security Administration program will add over 4 million Americans to the prohibited persons list without due process. Contact your lawmakers today. Ask if youre one of the 4 million.\", Notice how a vague proposal of uncertain prospects has been transformed, through the magic of dishonesty, into an unconstitutional fait accompli. The NRA likewise fights to the death to retain loopholes that allow criminals and others to avoid background checks on gun purchases. Dylann Roof, the avowed racist who allegedly killed nine in a South Carolina church in June, exploited a loophole to obtain a firearm when his federal background check for a gun purchase was not rendered in the legally required three days. The sale should have been prohibited because of Roofs previous admission of drug possession, but a clerical error and a law that values convenient shopping over inhibiting violence enabled him to walk away armed and dangerous. On its website, the NRA calls the loophole \"necessary,\" in part because \"it preserves a critical aspect of Americas constitutional system, the due process principle that the government cannot arbitrarily deprive a person of his or her rights without making its case against that person.\" (The headline of the NRA post cites Michael Bloomberg the founder and majority owner of Bloomberg LP, the parent of Bloomberg News who supports an organization that works to combat gun violence.) Of course, Roof also had the option to visit an online marketplace or gun show where, due to the exertions of the NRA and its allies, no background check is required. Yet despite all its success, the NRA cannot keep the monsters away. \"For nearly seven years now, the president has forced his transformation down Americas throat, and our nation is choking on it. As he prepares to leave office, and leave his final legacy, theres no telling how far President Obama will go to dismantle our freedoms and reshape America into an America that you and I will not even recognize.\", Paranoia and rage must be nurtured and stoked, and ex-presidents make poor bogeymen. Which is why LaPierre has gotten a jump on his presidential transition. \"Hillary Rodham Clinton will bring a permanent darkness of deceit,\" LaPierre warned at this years NRA convention. For Houser, darkness had already descended. \"They are now in control of spending and the printing of money,\" he is reported to have written online, in a paragraph citing welfare benefits and affirmative action. America had become a \"filth farm,\" he declared. When a man has his finger on the trigger of an apocalypse, somebodys bound to get shot. Bloomberg, Francis Wilkinson writes on politics and domestic policy for Bloomberg View.]", "Date": "20150728", "Author": "[Francis Wilkinson]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-lafayette-movie-theater-shooting-nra-20150728-story.html", "Title": "[NRA's Wayne LaPierre promises apocalypse now]"}