{"Content": "[Urged on by anguished testimony from the father of a murder victim, Congress plunged into a heated debate over immigration on Tuesday as GOP lawmakers vowed to shut down funding for so-called sanctuary cities like San Francisco that shield immigrants from deportation by federal authorities. Immigrant advocates denounced the approach, accusing Republicans of following presidential candidate Donald Trump in demonizing Latinos. But after 32-year-old Kathryn Steinle was shot this month, allegedly by an immigrant with a criminal record and without legal status, even some Democrats were calling for action to address the ineffective tangle of federal and local laws and policies that left the man on the street. \"We feel strongly that some legislation should be discussed, enacted or changed to take these undocumented immigrant felons off our streets for good,\" said Kathryn Steinles father, Jim Steinle, who was with his daughter when she was killed while strolling in daylight along a popular San Francisco pier. \"We feel if Kates law saves one daughter, one son, a mother, a father, Kates death wont be in vain.\", Testifying before a somber Senate Judiciary Committee, Jim Steinle described his daughter as friendly, happy, adventurous and full of laughter and love. Shot at random before his eyes as they walked arm in arm, she had time only to utter the words \"Help me, Dad.\", \"Those are the last words I will ever hear from my daughter,\" Steinle said. \"Wed be proud to see Kates name associated with some of this new legislation.\", The alleged murderer, Juan Francisco Lopez Sanchez, had multiple felony convictions and had been deported five times, but San Francisco authorities released him, rejecting a request from federal immigration authorities to hold him until they could take him into custody. San Francisco is among hundreds of jurisdictions nationally that decline to honor federal immigration requests, or \"detainers,\" which have been successfully challenged in court and which advocates say can unfairly target immigrants whove done nothing wrong or committed only minor crimes. The House will vote on legislation by Rep. Duncan Hunter, R-Calif. this week that would shut down two different types of local law enforcement grants to cities that dont cooperate with federal immigration authorities, and cut off their reimbursements for the costs of jailing immigrants in the country illegally who commit crimes. Senate Judiciary Committee Chairman Charles Grassley, R-Iowa, announced Tuesday that he too was offering a bill to cut off certain federal funding to sanctuary cities, as well as require a mandatory minimum five-year prison sentence for immigrants who illegally re-enter this country after having been deported. The latter provision has been championed by Fox News host Bill OReilly, whos dubbed it \"Kates Law,\" and has been embraced by a number of conservative lawmakers. \"Enforcing the immigration laws of the United States is not a voluntary or trivial matter. Real lives are at stake. Things cannot continue this way,\" Grassley said. \"No more people should die at the hands of those who break our laws just by being here.\", But the GOP proposals infuriated advocates who accused Republicans of targeting immigrant communities after repeatedly blocking comprehensive immigration overhaul legislation on Capitol Hill. The debate also comes as Trump has inflamed Latinos by describing Mexican immigrants as \"criminals\" and \"rapists.\", \"Republicans, rather than look at the problem, which in essence is a need to revamp our entire immigration system, take a tragedy like this, which is a horrible tragedy, and politicize it,\" said David Leopold, past president of the American Immigration Lawyers Association. \"Its no different than what Donald Trump has been running around the country doing and thats demonizing immigrants.\", Congressional Democrats also sought to connect Trump to the debate on Capitol Hill, issuing a press release on Hunters bill declaring, \"House Republicans are rushing the Donald Trump Act to the floor this week a wildly partisan, misguided bill.\" Democrats noted that a number of law enforcement groups support allowing local jurisdictions flexibility on immigration matters. Hunters bill was also encountering some opposition from the right. NumbersUSA, a group that advocates lower immigration levels, announced its opposition. The group said the bill was too weak because it does nothing to address the federal governments release of tens of thousands of immigrants annually whove committed crimes. But the Houses leading immigration hardliner, Rep. Steve King, R-Iowa, announced in an email to fellow Republicans that he had told House Majority Leader Kevin McCarthy he would support Hunters bill, even though it doesnt do enough. King also said hed gotten a verbal commitment from McCarthy to bring additional immigration enforcement legislation to the House floor following Congress August recess. Associated Press]", "Date": "20150721", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-califonia-pier-shooting-immigration-20150721-story.html", "Title": "[Kathryn Steinle's family urges immigration changes to Congress]"}