{"Content": "[Sen. John McCain said Monday Republican presidential candidate Donald Trump doesnt need to apologize to him for remarks about his long captivity in Vietnam, but should tell veterans and their families that hes sorry. Trump, meanwhile, leveled new criticism against the Arizona Republican and 2008 GOP presidential nominee, saying McCain had made America \"less safe\" through his votes in Congress. The continuing rhetoric came as Trumps fellow Republican presidential hopefuls criticized his remarks last week, in which the flamboyant businessman dismissed McCains reputation as a war hero because he was captured in Vietnam and \"I like people who werent captured.\", John McCain, a Navy pilot during the Vietnam War, was captured after his plane was shot down over Hanoi in 1967. He was held for more than five years as a prisoner of war. \"When Mr. Trump says he prefers to be with people who are not captured, the great honor of my life was to be in the company of heroes,\" McCain said Monday on MCNBCs \"Morning Joe.\" But the occasionally fiery McCain had a calm demeanor, saying simply: \"I am not a hero.\", At another point in his interview on MSNBCs \"Morning Joe,\" he said, \"Im in the (political) arena,\" suggesting hes fair game for criticism as a U.S. senator. White House Press Secretary Josh Earnest said McCain had handled the matter just right. \"Hes right when he says that our veterans are the ones who are entitled to an apology,\" Earnest said. \"I agree with what Senator McCain had to say.\", Earnest noted that even in the midst of the 2008 campaign, Obama had expressed his \"admiration and deep respect\" for McCains military service. And while the two still have their political differences, \"those debates have not reduced his appreciation for Senator McCains remarkable service to his country.\", In an opinion piece published Monday in USA Today, Trump said McCain had abandoned the nations veterans and made America less secure through his votes in Congress. The real estate executive also lashed out at fellow GOP presidential aspirants who have criticized his remarks, calling them \"failed politicians.\" Trump said he did not need \"to be lectured by any of them.\", \"The reality is that John McCain the politician has made America less safe, sent our brave soldiers into wrong-headed foreign adventures, covered up for President (Barack) Obama with the VA scandal and has spent most of his time in the Senate pushing amnesty,\" Trump wrote. \"He would rather protect the Iraqi border than Arizonas.\", In a contentious interview on the NBCs \"Today\" Show Monday, Trump took issue with the medias reporting on his comments about McCains war record, made at a conservative forum in Iowa. He insisted in a telephone interview with anchor Matt Lauer that he had said \"four times\" that he respected those captured in war. In his appearance, McCain said he believed it was \"totally inappropriate for Mr. Trump to say he doesnt like to be with people who are captured.\", \"I think the point here is that there are so many men and women who served and sacrificed and happened to be held prisoner and to denigrate in any way that service, I think, is offensive to veterans.\", \"The best thing to do is put it behind us and move forward,\" McCain said, Trump has refused to apologize for disparaging comments he made about McCains military service. Hes also sought to use the furor over his remarks to remind supporters, especially those frustrated with Washington, that hes not a typical politician. \"You know the Republican Party of course I was one of their darlings when I was a contributor,\" Trump said in an interview with The Associated Press. \"I went from a darling to somebody that theyre not happy with because Im not a politician.\", His rivals spent much of the weekend condemning his comments and suggesting he was unfit to serve as commander-in-chief. \"Its not just absurd,\" said Florida Sen. Marco Rubio. \"Its offensive. Its ridiculous. And I do think it is a disqualifier as commander-in-chief.\", Numerous other GOP candidates, including Jeb Bush, Rick Perry and Scott Walker, were similarly critical of Trump. The Republican National Committee also put its thumb on the scale, issuing a statement saying \"there is no place in our party or our country for comments that disparage those who have served honorably.\", Until now, Republicans have been largely cautious in their handling of Trump and his provocations. While officials privately fretted about the damage he could do to the party, they are also worried about alienating voters drawn to his celebrity, brashness and willingness to take on establishment Republicans. Hes emerged as one of the favorites early in a race that is bound to see shifts in the standing of many of the candidates. Trump has made other eyebrow-raising comments since declaring his candidacy, most notably his assertion that Mexican immigrants are rapists and drug dealers. Many GOP candidates were slow and halting in their response to those comments, underscoring a continuing struggle to hit the right notes on immigration when they want to appeal to Hispanics without alienating traditional GOP voters. Associated Press]", "Date": "20150720", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-donald-trump-john-mccain-20150720-story.html", "Title": "[John McCain: Donald Trump owes apology to veterans, not to me]"}