{"Content": "[Saudi Arabia began airstrikes Wednesday against Houthi rebel positions inYemen, vowing that the Sunni kingdom will do \"anything necessary\" to restore a deposed government that has been routed by the Iranian-backed group. In an unusual tableau, Saudi Arabias ambassador to the United States announced the rare military operation by his country at a Washington news conference about a half-hour after the bombing began. The strikes started at 7 p.m. EDT, he said. Loud, house-shaking explosions could be heard in theYemencapital of Sanaa and fire and smoke could be seen in the night sky, according to an Associated Press correspondent whose home is near the military airbase in the capital. The Houthis said in a statement to reporters that Saudi jets are hitting the military base, known as al-Duleimi, in Sanaa. They said they fired anti-aircraft missiles in response. Ambassador Adel al-Jubeir said his government had consulted closely with the U.S. and other allies, but said the U.S. military was not involved in the operations. Nine other countries have joined the military coalition, he said from a podium at the Saudi embassy, but he declined to name them. \"HavingYemenfail cannot be an option for us or our coalition partners,\" he said. He declined to say whether the Saudi campaign involved U.S. intelligence assistance, and a White House spokeswoman referred questions to the Saudis. The Saudi strikes were the latest in a series of fast moving developments inYemen a rugged, poor, isolated country that is home to an al-Qaida affiliate that has been the target of repeated American drone strikes. Driven weeks ago from the capital by the Houthis, U.S.- and Saudi-backed Yemeni President Abed Rabbo Mansour Hadi abandoned the country Wednesday, leaving on a boat from the southern port of Aden, Yemeni security officials said. His departure came after Houthi air strikes rained down on his troops, a sign that rebels held air superiority and that Hadis calls for an international no-fly zone had been disregarded. On the ground, the rebels were advancing toward his position. Al-Jubeir said the Saudi airstrikes were designed \"to preventYemenfrom falling into the hands of the Houthis,\" but the reality is that the capital and some of the countrys main cities already have fallen to the group, and ground troops will be required to take them back. The ambassador said he didnt want to discuss military details. It was unacceptable, Al-Jubeir said, that a \"militia,\" as he called the Houthis, should have air power, along with \"ballistic missiles, heavy weapons as well as military bases and ports.\", Al-Jubeir recounted a series of diplomatic efforts to dissuade the Houthi from continuing their offensive. But, he said, they \"have always chosen the path of violence.\", He says the Saudis \"will do anything necessary\" to protect the people ofYemenand \"the legitimate government ofYemen.\", Hadis departure illustrated how one of the most important American counterterrorism efforts has disintegrated. It also raised the specter of what could be a deeply destabilizing proxy war between Saudi Arabia and Iran. The Saudi announcement only reinforced that notion. Three years ago, American officials hailed Hadis ascension to power in a U.S.-brokered deal that ended the longtime rule of Ali Abdullah Saleh during the political upheaval of the Arab Spring. And just a few months ago, President Barack Obama was still callingYemena counterterrorism success story, even as the CIA warned that Iranian-backed Houthi rebels were growing restive in the north of the country. Now, U.S. officials acknowledge their efforts againstYemensdangerous al-Qaida affiliate are seriously hampered, with the American embassy closed and the last U.S. troops evacuated from the country over the weekend. Although the Houthis have seized control of much of the country and are avowed enemies of al-Qaida, they cant project power against the militants the way the Hadi government could with American support, officials say. And now they will be fighting the Saudis and their allies. Deeply anti-American, the Houthis have rejected U.S. overtures, officials say. Al-Qaida in the Arabian Peninsula, or AQAP, is considered the terror group most dangerous to the U.S. because it successfully placed three bombs on U.S.-bound airlines, although none exploded. The chaos inYemenwill give the group breathing space, American officials acknowledge. Beyond terrorism, the latest developments inYemenhave worrisome implications for a Middle East already wracked by Sunni-Shia conflict, experts say. Before the airstrikes began, Saudi Arabia bolstered its troop presence along its border withYemen. Its unclear how Iran will view the Saudi military strikes. \"This is all about Sunni vs. Shia, Saudi vs. Iran,\" said Michael Lewis, professor at Ohio Northern University College of Law and a former Navy fighter pilot who watchesYemenclosely. The U.S. he said, \"cant be a disinterested observer. Nobodys going to buy that. What we needed to do was pick a side.\", But the U.S. had made no move to protect the Hadi government as the Houthis advanced, and American officials gave no indication Wednesday that their stance of neutrality had changed. Asked whether the U.S. military had considered trying to rescue Hadi, a senior American official who declined to be quoted answered: \"The tinderbox inYemenis most complicated because of the geopolitics at stake. The U.S. Saudis, Iranians, Houthis, Yemenis, AQAP, ISIL and AQ have equities in the situation and factor into any decision the U.S. makes or doesnt make.\", As late as Monday, officials insisted the U.S. was still working with Hadis government, despite the fact that the president had been forced out of the capital and the parliament dissolved. \"There continues to be ongoing security cooperation between the United States and the national security infrastructure of the Hadi government,\" White House spokesman Josh Earnest said. Associated Press]", "Date": "20150325", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/nationworld/chi-saudi-ambassador-announces-military-campaign-in-yemen-20150325-story.html", "Title": "[Saudis begin airstrikes against Houthi rebels in Yemen]"}