{"Content": "[Hillary Clinton is once again campaigning for president as the prohibitive front-runner, and once again, she faces a challenge from an insurgent progressive outsider with grassroots support. And once again, while Clinton (re)introduces herself to voters in a low-key listening tour of sorts, her challenger is drawing huge audiences 10,000 in Madison, Wis. 8,000 in Portland, Maine, 5,000 in Denver and overflow crowds in Iowas small towns and elsewhere. Eight years ago, Clinton led in the polls for most of 2007, only to lose the Iowa caucuses and, eventually, the Democratic nomination to a favorite of the partys progressive base. Its feeling a bit like deja vu. \"If she doesnt change the terms of the race, shes going to lose. Again,\" former Mitt Romney strategist Stuart Stevens warned in the Daily Beast this month. It may be tempting to compare the race between Clinton and Sen. Bernie Sanders, I-Vt. to the epic race between Clinton and Sen. Barack Obama: Sanders, like Obama, has consolidated a good portion of the liberal wing of the Democratic Party. Sanders, like Obama, is raising millions from small-dollar donors on the Internet. Sanders, like Obama, is channeling the anger and frustration of some in the party; then, it was about the Iraq war, now, its about Wall Street. But thats where the similarities end. From the perspective of someone who worked on his campaign and in his White House, its clear that Obamas race against Clinton is not a useful example. Understanding the dynamics at play in the 2016 primaries requires looking further back at history. And unfortunately for Sanders, history shows that there are only two types of Democratic insurgent candidates: Barack Obama and everyone else. The current system for selecting nominees in the Democratic Party is less than 50 years old. After the disastrous 1968 campaign and nominating convention in Chicago, the party abandoned the smoke-filled rooms of yore and shifted to a series of primaries and caucuses. The 1972 nomination went to the grass-roots favorite, Sen. George McGovern (S.D.), who used the new rules to edge out establishment picks Hubert Humphrey and Henry \"Scoop\" Jackson. (McGovern won only Massachusetts and the District of Columbia in the general election against Richard Nixon.) In nearly every election since then, an anti-establishment figure has sought the nomination. Sanders is merely the latest such challenger to make some early noise in a Democratic primary race. Hes not even the first one from Vermont: In 2004, former governor Howard Dean rode his opposition to the Iraq war to the top of the field before eventually finishing a distant third in Iowa. That, combined with his famous caucus-night scream, was effectively the end of his candidacy. Dean followed in the footsteps of others, such as then-Sen. Gary Hart (Colo.) in 1984 (and briefly in 1988), California Gov. Jerry Brown in 1976 and again in 1992, and former senator Bill Bradley (N.J.) in 2000. Obama played this role in 2008. The most famous and most successful post-McGovern, pre-Obama challenge came from Sen. Ted Kennedy (Mass.) in 1980, when he almost defeated Jimmy Carter, the incumbent president of his own party. All of these challengers had their moments, rising in the polls, firing up the grass roots and going from unknown underdogs to legitimate contenders. But every one of them, except Obama, ultimately came up short. Their early successes all had some similar explanations. First, the most liberal voters tend to tune in sooner and engage more actively, giving an initial boost to progressive candidates. Second, the overriding bias in political press coverage is toward a competitive race, which means that challengers often receive media attention that exceeds their chances of winning. Finally and perhaps most important, skepticism of the establishment is woven into the fabric of the Democratic Party if the party leadership, the donors and the pundits are all for one person, many in the rank and file start to explore other options. Of course, every election is different, and every historical parallel is imperfect. Each of these candidates did things right and wrong in their races; some made gaffes, and others ran out of money. But ultimately, similar factors played into their defeats. Presidential campaigns are massively sophisticated, expensive operations. Insurgent challenges all start as underfunded, fly-by-night operations, with just enough resources to gain attention in the early days. But when it comes to actually turning out voters, particularly in the very complex Iowa caucus system which requires a candidate to have at least 15 percent support to get any delegates and gives no extra points for winning by big margins in liberal precincts you need a campaign organization worthy of that task. Even if organizers manage to set up a strong operation, many challengers still falter under the intense klieg lights that are attracted to a viable contender for the United States presidency. Lifelong politicians who are first-time presidential candidates think they are ready for the scrutiny, and they are almost all wrong. Finally, every anti-establishment challenger except Obama failed to expand his base beyond the left wing of the party. Bradley and Dean, for instance, did very well with liberal, white Democrats. That can be enough to win key states such as Iowa and New Hampshire, especially in a multi-candidate field, where you may only need a third of the electorate to come out on top. But getting sufficient delegates to win the nomination requires a very broad base of support. It means building a wide coalition of voters, including moderate Democrats and even independents, as well as African Americans and the growing number of Latinos in the party. Obamas campaign succeeded where everyone elses failed for two main reasons. His tremendous popularity with African American voters was critical. Although Obama won the black vote by margins as high as 9 to 1 in some states, this was not preordained. Clinton led Obama among African American voters in most polls until after he won Iowa. Obama also found a way to hold his liberal base while simultaneously attracting the enthusiastic support of self-identified independents and moderates. In 2008, we did best in open contests, which allowed anyone to participate regardless of party registration. Essentially, Obama benefitted from two separate phenomena: liberal frustration with the Democratic Party establishment for supporting the Iraq war and moderate disenchantment with President George W. Bush over Iraq, Hurricane Katrina and a host of other issues. Getting the support of those independents and Republicans was key for us in a number of caucus states, including Iowa. So far, at least, theres little reason to think Sanders can duplicate what led Obama to victory. Yes, hes surged in the polls to be the clear challenger to Clinton, a remarkably rapid and impressive feat for a senator from a small state who has never run for national office before in order to seek the nomination. If his momentum continues, and if former Maryland governor Martin OMalley and others can take chunks of the vote, Sanders could win Iowa and even New Hampshire. But Sanders still looks likely to follow in the tradition of Bradley and Dean. Polls show that hes doing well with liberal voters and struggling everywhere else, and he has negligible support and limited name identification among black and Latino voters. There is no doubt that Sanders has lit the progressive wing of the Democratic Party on fire by speaking out boldly against inequality and excess on Wall Street. But he faces real challenges that Obama did not in expanding his base of support. Sanders is from a small state with very few minority voters, while Obama had deeper relationships to build on, especially with the African American community. Sanderss campaign is growing rapidly, but even with new field offices opening fast, it is still less than half the size of Obamas organization at a similar juncture in our race: In July 2007, Obama had 80 paid staffers working in 25 offices in Iowa. Obama was able raise more early money for his campaign; that, coupled with his potential to make history as the nations first black president, attracted a very experienced set of political operatives with deep knowledge of how to run a sophisticated campaign. While Sanders has decided to play the role of the liberal challenger to Clinton, pushing her to the left at every opportunity, Obama ran a much less ideological campaign, which allowed him to build a broader base of support from the outset. If 2008 is not the best parallel for Sanders vs. Clinton, what is? Probably the 2000 contest between Vice President Al Gore and Bill Bradley. That contest, like this one, was about who would get a chance to succeed a two-term Democratic president. That contest, like this one, was essentially a two-person race (though this could change in the coming months). And in that contest, like this one, the Democratic Party was looking to redefine itself for a new era. Bradley made a surprisingly strong challenge to a sitting vice president, forcing Gore to shake up his campaign, move his headquarters from D.C. to Nashville and retool his entire effort. Ultimately, though, Bradley could not broaden his base of support, and he ended up losing all 50 states to Gore. History says that Clinton is likely to be our nominee and that Sanders is doomed to repeat the fate of Bradley and the rest. Of course, history said the same thing about Obama, and theres a reason that people say \"anything is possible in politics.\" But the odds are that by this time next year, the 2008 campaign will remain the exception, not the rule. Washington Post, Dan Pfeiffer is a CNN political commentator and a former White House senior advisor.]", "Date": "20150719", "Author": "[Dan Pfeiffer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-bernie-sanders-obama-dan-pfeiffer-20150719-story.html", "Title": "[Bernie Sanders isn't Barack Obama, and 2016 isn't 2008]"}