{"Content": "[Workers at ArcelorMittal and U.S. Steel mills in the Lake and Porter counties and across the nation are planning rallies in a show of solidarity as contract negotiations with the two steel giants continue to move slowly. United Steelworkers Locals 1010 and 1011, whose members work at ArcelorMittal, will stage a mock picket at 2 pm. Wednesday at Indiana Harbor, Steve Wagner, vice president of Local 1010, said. \"All are welcome to attend,\" Wagner said. According to a statement from the United Steelworkers, most ArcelorMittal locations are planning rallies on Wednesday while U.S. Steel workers are planning a series of events for later in the week. On Aug. 21, Locals 1066 and 1014, in Gary, whose members work at U.S. Steel, are inviting other USW locals to join their members in a March of Solidarity at 3:30 p.m. The march begins at 500 E. 5th Ave. and ends at Gateway Park, at 4th and Broadway. \"Its basically about solidarity along the lakefront,\" Tim Johnson, Local 1066 CAT assistant coordinator, said of the march. \"Were asking people to stand in solidarity,\" he said, adding its always good to have community support as well. Johnson said he expects a large turnout Aug. 21. He said there will be additional, smaller, rallies between now and the deadline date. Contracts with both US Steel and ArcelorMittal expire on Sept. 1. The USW said in a message to members that its important to show the companies that its members remain united as talks continue. The union said both companies are attempting to use a temporary downturn in the domestic steel industry as an excuse to strip away decades of progress at the bargaining table. \"Both steelmakers are demanding dramatic increases in the amount that workers pay for health insurance, concessions in contract language around overtime, safety and job security, and cutbacks in retirement security,\" the union stated. \"We understand the very real challenges that our industry is facing right now and we are fully prepared to work with all of our employers to ensure the security and viability of our industry and our workplaces. But we also understand that we are working in a cyclical industry and weve faced good times and weve faced challenging times,\" the union stated. A spokeswoman for U.S Steel has said the company doesnt generally comment on ongoing negotiations. ArcelorMittal has stated that the initial proposals were made in an effort to close the labor cost gap with the companys competitors without reducing wage rates, which the company said are among the highest in the industry. Karen Caffarini is a freelance reporter for the Post-Tribune.]", "Date": "20150814", "Author": "[Karen Caffarini]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-steel-rally-advance-st-0817-20150814-story.html", "Title": "[USW plans rallies at steel mills as new contract looms]"}