{"Content": "[Like many Americans, my wife and I have watched the Planned Parenthood undercover videos in horror. One of the videos, secretly recorded by the Center for Medical Progress, shows a top Planned Parenthood executive haggling over the price of aborted body parts hearts, lungs, liver and heads while sipping wine. In another, Planned Parenthood abortionists sift through a dish filled with tiny arms, legs, hands, eyes and more, with one doctor blurting out about a specimen, \"Its another boy!\", Another explains how these personnel can alter second-trimester abortion procedures to extract \"fully intact human cadavers\" for potential buyers. Luckily, members of the U.S. Senate watched these videos with the same horror we did, and held a vote on legislation that would end taxpayer funding of Planned Parenthood while fully funding womens access to health care. Every Republican senator except for one joined two Democrats in voting to advance this measure. The lone Republican to vote against this bill? U.S. Sen. Mark Kirk of Illinois. I served with the senator in Congress. I like him personally. Hes done good things for our state. But this is a vote my wife and I cannot overlook. Pro-life or pro-choice, we should all be able to agree at a bare minimum that these videos are, in the words of Hillary Clinton, \"disturbing.\" Senator Kirk hasnt said that, or anything close to it. Instead, he explained his vote by saying, \"I do not plan to cut access to basic health care and contraception for women.\", But the bill he voted against wouldnt do that. Instead, it seeks to redirect the more than $500 million Planned Parenthood receives in annual taxpayer funding to other entities that provide the same services (and usually more), but dont perform abortions or engage in a grisly organ trade. Planned Parenthood performs more than 327,000 abortions per year. No other agency comes close to this figure. These facts leave us scratching our heads. Why did Sen. Kirk cast this vote?, The only reasonable explanation is that he has made a cold calculation that doing the right thing could hurt him in his re-election bid. And without a doubt, he is going to have a tough fight on his hands. But in order to win, he cannot lose the Republican base. This vote does just that, in addition to alienating independents and Democrats who have been disgusted by these videos. He cant possibly win over hard-line abortion advocates. His likely opponent U.S. Rep. Tammy Duckworth has them locked up. It is early, and Sen. Kirk has time to change course. According to reports, there are as many as seven more investigative videos coming out. That will likely mean further congressional action. One vote sure to happen in the Senate as soon as next month will be on the Pain-Capable Unborn Child Protection Act. This common-ground legislation would limit abortions after 20 weeks, or 5 months of pregnancy. It would prohibit the late-term abortions (except in cases of rape, incest and life of the mother) that Planned Parenthood finds especially useful in harvesting valuable body parts. Polls show that a strong majority of Americans support this legislation. One Washington Post-ABC News poll in 2013 showed that 60 percent of women support it, compared to just 25 percent opposed. Bills like this can move us forward together on this contentious issue. Yet, Kirk is one of only a handful of Republican senators who isnt co-sponsoring this bill. While Sen. Kirk is home for the August recess, I hope Illinois voters will urge him to rethink politically and morally and do the right thing. Lives and real womens health care hang in the balance. Former U.S. Rep. Bobby Schilling, R-Colona, represented Illinois 17th District from 2011-2012.]", "Date": "20150807", "Author": "[Bobby Schilling]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-kirk-abortion-planned-parenthood-schilling-perspec-0810-20150809-story.html", "Title": "[Sen. Kirk, reconsider your position on Planned Parenthood funding]"}