{"Content": "[Donald Trumps frontal assault on political correctness has been the surprise hit of the 2016 presidential derby. Turns out a big slice of America is fed up with \"p.c.\" dictums about what can or cant be said about racial issues, the legal status of immigrants or even the gender-bending of Caitlyn Jenner. Im no fan of The Donald, mind you, but I also get frustrated with p.c. or in my oddball case, with p.w.c. as in public works correctness. Thats right. I harbor unpopular opinions about public works. I think bike lanes are dangerous and, for the most part, unnecessary. I think the grabbing of precious traffic lanes on busy urban streets for conversion into \"bus rapid transit\" is also a mistake that will be regretted in time. I think installation of elaborate \"disinfection\" equipment at sewage treatment plants only tends to obscure not cure the reason our local rivers get polluted. Dont get me wrong. Im not one of those benighted libertarians who think spending tax dollars on public infrastructure is a \"pork barrel\" scam or \"crony capitalism.\" No, its an investment and it almost always pays both short- and long-term benefits short-term by putting people to work, both directly and by triggering the purchase of stuff from portland cement to Caterpillar road-graders; long-term by making the local economy more attractive to global corporations in search of lower commute times and shipping costs, along with good schools and, lest we forget, harbors where execs can moor their yachts. What I cant abide, though, are ill-conceived projects that end up providing rhetorical ammo to those who dont support public works. Take those \"disinfection\" plants being built alongside the existing sewage treatment plants operated by the Metropolitan Water Reclamation District of Greater Chicago. In some future world, this extra cleansing process might upgrade the quality of the Calumet, Des Plaines and Chicago rivers to swimmable and drinkable levels. But the problem now is that too much wastewater never gets to those treatment plants. During a hard rain like Tuesdays, hundreds of outdated \"combined\" (stormwater-plus-toilet-water) sewer lines across Cook County get overloaded and dump millions of gallons of brown goo directly into our waterways. Sometimes, if the rivers get too high, floodgates are opened to dump the excess into Lake Michigan. Yuck. When completed, the districts Deep Tunnel and Reservoir system will capture much, though not all, of that overflow for subsequent treatment. But the only real fix far more expensive than disinfection gear will come when we repipe our sewers to separate toilet from stormwater. All else is distraction. Then theres bus rapid transit, or BRT, as the transpo wonks call it. It works great in some cities, especially newer ones with linear, spread-out layouts, such as Curitiba, Brazil. There theyve built a wide central corridor to accommodate the bus-only lanes and boarding platforms. But downtown Chicago? The citys Loop Link BRT, now under construction, will indeed whisk commuters and day-trippers from West Loop Metra stations to Michigan Avenue via Washington Street, then back to the Metra stations via Madison Street. Thats great if youre going to the Art Institute or Millennium Park. But what if youre headed south to the Museum Campus, Soldier Field or McCormick Place? Or north to Water Tower Place or one of the Streeterville hospitals? Transfer to a regular bus? Hail a cab?, Then theres the wisdom of grabbing two lanes from both Washington and Madison for the bus lane and boarding stations. Theoretically that leaves two lanes for cars, but what if someone decides to turn, or park illegally, or make a delivery?, The unused railroad right-of-way that runs under the Merchandise Mart all the way to Tribune Tower would have made a far better off-street route. But a more expensive one just like separating those sewer lines. So we grab lanes from already jammed streets and disinfect only the dirty water that manages to reach the treatment plant. Our pols get to cut ribbons and our civic groups take credit for promoting these ideas. Me? Ill stay p.w. incorrect. John McCarron teaches, consults and writes about urban affairs.]", "Date": "20150820", "Author": "[John McCarron]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-public-works-deep-tunnel-bike-lanes-bus-mwrd-perspec-0821-jm-20150820-story.html", "Title": "[I'm frustrated by p.w.c. public works correctness]"}