{"Content": "[Its time to step back for a second and soak in just how badly congressional Republicans have messed up on foreign policy over the past two months. There is no denying that President Barack Obamas overall foreign policy is unpopular with the American people (though the depth of that unpopularity is another question entirely). Armed with a pretty strong midterm election performance, the GOP-controlled Congress came to power with legitimate policy disagreements with the president and some legitimate gripes about the process through which Obama was conducting foreign policy. It wasnt just Republicans either. In January there were clear signs that both Democrats and the foreign policy establishment shared GOP policy preferences on the Keystone pipeline, relations with Israel and nuclear negotiations with Iran. And yet, over the past two months, the Republican-controlled Congress has managed to go from one blunder to another on foreign policy and national security questions. The covert invitation for Benjamin Netanyahu to speak to Congress did not sit well with Democrats, foreign policy experts and even GOP foreign policy advisers. The bungling over funding the Department of Homeland Security qualifies as a GOP own-goal as well. The backfire, And now we arrive at the open letter to Irans leadership. That little missive clearly alienated congressional Democrats who have been wary about the nuclear negotiations:, \"I think Republicans have made it harder for us to approach this in a careful and bipartisan way,\" said Sen. Tim Kaine, D-Va. who has led his partys push for congressional review of the administrations policies on war and sanctions, and sponsored a bill that would allow Congress to review any removal of congressionally imposed sanctions against Iran. Democrats said the Republicans letter, written by Sen. Tom Cotton, a freshman from Arkansas, undermined Obamas efforts to reach an agreement but also weakened their resolve to cross party lines and challenge their own president. \"The whole brouhaha last week reduced from a 40 percent chance to a 4 percent chance that Democrats will vote in sufficient numbers to override a veto,\" said Rep. Brad Sherman, a California Democrat and one of the most ardent supporters of Israel in his caucus. And this is before we get to the foreign policy establishment, which has been uniformly appalled. It takes real effort for people such as Les Gelb, David Ignatius, Fred Kaplan and Richard Haass to get off their bipartisan fence and blast one party for acting recklessly on foreign policy and yet Sen. Cottons letter has managed to pull it off. And how has the GOP reacted to all of this? On the one hand, theres no denying that theres been some doubling down:, At the same time, however, youre seeing reports that many GOP members of Congress are surprised and a bit chagrined by the blowback. As Tim Mak notes at The Daily Beast:, \" (E)ven among Republicans whose offices have signed the letter, there is some trepidation that the Iran letter injects partisanship into the Iran negotiations, shifting the narrative from the content of the deal to whether Republicans are unfairly trying to undercut the president.\", \"Before the letter, the national conversation was about Netanyahus speech and how Obamas negotiations with Iran are leading to a terrible deal that could ultimately harm U.S. national security. Now, the Obama administration and its Capitol Hill partisans are cynically trying to push the conversation away from policy, and toward a deeply political pie fight over presidential and congressional prerogatives,\" said a Senate Republican aide whose boss signed the letter. Republican aides were taken aback by what they thought was a lighthearted attempt to signal to Iran and the public that Congress should have a role in the ongoing nuclear discussions. Two GOP aides separately described their letter as a \"cheeky\" reminder of the congressional branchs prerogatives. \"The administration has no sense of humor when it comes to how weakly they have been handling these negotiations,\" said a top GOP Senate aide. If the GOP response ranges from sheer denial of a problem to a shrug, thats a sign that theyre not serious at all about foreign policy. The haywire, So how did the GOP congressional leadership err on this so badly? Let me suggest three drivers:, 1) The executive branch has a structural advantage on foreign policy. Congress feels like theyve been dissed on foreign policy. The truth is that both the Constitution and history have stacked the deck in favor of the executive branch. A GOP defense of the Cotton letter, for example, is to point to past examples of congressional interference in foreign policy. None of those cases worked out terribly well for members of Congress, however. This is simply an arena of policy that works to the commander in chiefs advantage. 2) Congress aint what it used to be. These kinds of stunts would have been vetoed by party leaders in Congress even a decade ago, because there were people whod been in Congress for a while, had earned seniority and could have told everyone how this was going to play out. But an awful lot of the GOP Senate caucus is new to that chamber, and you have the old bulls, such as Sen. John McCain saying things like, \"I saw the letter, I saw that it looked reasonable to me and I signed it, thats all. I sign lots of letters.\" Which is code for, \"What was in that letter again?\", 3) To get ahead in the GOP, you need to be a disruptor. In the olden days, members of Congress burnished their reputation by putting forward concrete policies and getting legislation passed. But passing bills through Congress is rarer now, and modern-day Republicans are not really rewarded for passing legislation, theyre rewarded for disrupting government. This gives backbenchers like Cotton an incentive to engage in some Schumpeterian \"creative destruction\" and get rewarded for it with more campaign contributions. The effect such stunts have on foreign policy are secondary. Its possible that as this Congress matures, foreign policy errors like this will fade. Its also very possible that President Obama will score some foreign policy own-goals. But two months into the new Congress, the GOP has squandered what was supposed to be a political and policy advantage. GOP members have squandered it badly. Washington Post, Daniel W. Drezner is a professor of international politics at Tufts University and a nonresident senior fellow at the Brookings Institution.]", "Date": "20150312", "Author": "[Daniel W. Drezner]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-cotton-obama-iran-letter-mccain-perspec-0313-20150312-story.html", "Title": "[The GOP's self-induced foreign policy disaster]"}