{"Content": "[Republican Gov. Bruce Rauner scored the biggest legislative win of his short tenure on Wednesday when Democratic House Speaker Michael Madigan fell three votes short in a bid to override the governors veto of a major labor bill. Amid a high-stakes battle against a governor who has made weakening unions a cornerstone of his agenda, Democrats and their allies in organized labor were unable to prevail on legislation that would send stalemated state contract talks with union workers to arbitration if an impasse is reached. The vote came at the end of an intense day at the Capitol in which both sides tried to one-up each other and build a scorecard they can bring to voters during next years campaigns for House and Senate seats. The two-hour debate was marked by personal attacks and the unexpected absence of a Chicago lawmaker who Madigan blamed for the defeat. In a statement, Rauner praised lawmakers \"who stood with taxpayers.\" The governor added that he hoped \"todays action marks the beginning of serious negotiations over how we can deliver needed structural reforms and a balanced budget.\", That idea was all but dismissed by Madigan, who contended the labor measure amounted to \"a significant step by the governor in what I fear will be an effort to bring down wages and the standard of living for middle-class families.\", Madigan previously had vowed he would have enough votes to override the veto, but it became clear Wednesday afternoon that the promise was in jeopardy due to the absence of Democratic Rep. Ken Dunkin of Chicago. State Rep. Ken Dunkin, Democrat ofChicago, inSpringfield in May2015. (E. Jason Wambsgans / Chicago Tribune), , , State Rep. Ken Dunkin, Democrat ofChicago, inSpringfield in May2015. (E. Jason Wambsgans / Chicago Tribune), , , Dunkin told the Chicago Tribune via text message that he would not be coming to Springfield this week. Dunkin did not answer when asked where he was, and his voice mail was full. A Monday post on Dunkins Facebook page featured a photo of him in New York City with a group of Chicago youth tennis players. With Dunkin not there, 68 Democrats voted to override Rauner, three shy of the 71 needed. Voting against the bill were 33 Republicans and Democratic Rep. Scott Drury of Highwood in Lake County. In addition, Democratic Rep. Jack Franks of Marengo voted \"present,\" along with seven Republicans, including three Springfield-area GOP members with significant union constituencies. Eight Republicans did not cast a vote. Madigan said he had expected all of his Democratic members to show up for the vote, including Dunkin. He declined to say if Dunkin, the former head of the legislative black caucus, would face punishment such as losing his chairmanship of the committee that sets funding for universities. The speaker argued that Dunkins absence stripped further support for an override, saying other supporters jumped ship when they realized he wasnt there. \"Had Mr. Dunkin been here, there would have been 71 Democrats voting to override. He should have been here today voting on this bill for labor peace. Hes like all members of the General Assembly. He makes his own decisions,\" Madigan said. Drury, the lone Democrat to side with Rauner, said he simply could not support unions giving up the ability to strike, even in the face of tough negotiations with Rauner. \"We in Illinois have a long history of doing quick fixes that have led to bad long-term public policy decisions,\" Drury said. The Senate already had approved an override, and the bill will expire without action from the House this week. The House is not scheduled to return to the Capitol for three more weeks. Still, Madigan may derive some political benefit from going ahead with the roll call. The move forced some Republicans in heavily unionized districts to make uncomfortable votes and provides Madigan and his union allies with fodder to use in the 2016 House campaigns. At stake was a measure backed by public employee unions that would require binding arbitration if Rauner and unionized workers reach an impasse in attempts to reach a new contract. In exchange, state workers could not be locked out or go on strike. The states collective bargaining agreement with the American Federation of State, County and Municipal Employees Council 31 expired July 1, the start of the new budget year. Talks have been ongoing, though little progress has been reported. Supporters had hoped to pick up votes from among a handful of Republicans who represent districts with a strong labor presence, but Rauner and House Republican leader Jim Durkin of Western Springs pushed for a united front against an override. \"What you are doing right now is changing the rules of engagement midstream, and I think thats unfair and unconstitutional,\" Durkin told House members during debate over the bill. Tensions ran high during the debate, with each side accusing the other of bringing the state to the brink of chaos. \"What is the infatuation with shutting this state down? What is the infatuation with stopping essential services,\" said Rep. John Bradley, D-Marion. \"I stand with the middle class, I stand with working men and women, I stand with state workers, I stand with common sense, I stand with keeping this state open.\", Republicans accused Democrats of being in the pocket of labor several pointed out that sponsoring Rep. Mike Smiddy, D-Hillsdale, used to be an AFSCME member. Democrats shot back that Republicans were hiding behind Rauners personal wealth, which he has vowed to use to defend allies and defeat Democrats in the upcoming elections. While this battle may have been at least temporarily settled, both sides acknowledge a larger war is brewing. \"The governors ferocious and false attacks on this moderate and responsible bill clearly show he wants conflict, not compromise,\" Illinois AFL-CIO President Michael Carrigan said in a statement. \"The governors assault on this bill may have won the day, but poisoned the well for legislators of both parties who want to work together responsibly to solve problems and serve the people of Illinois. It is clear that Gov. Rauner will stop at nothing to carry out his scorched-earth agenda against working people, their rights and well-being.\", It wasnt the first time Dunkin, a 13-year veteran lawmaker, was absent for a high-profile vote. In 2009, Dunkin missed the impeachment of then-Gov. Rod Blagojevich. The lawmaker, who was a Blagojevich ally, was on a cruise in the Caribbean, according to reports at the time. Dunkins latest absence was a reminder of one of the most awkward moments in the state legislative career of President Barack Obama. In 1999, lawmakers were called into special session to consider restoring a tough anti-gun violence law that had been struck down in court. Obama, then a state senator, was challenging U.S. Rep. Bobby Rush, a Democrat who lost a son to gun violence earlier that year. As a battle over the legislation stalemated, Obama and his family flew to Hawaii for Christmas. When lawmakers were called back into session Dec. 29 to vote on a compromise proposed by then-Gov. George Ryan, Obama remained in Hawaii. Ryan thought he had the votes to pass it, including Obamas. But when Ryan offered to send a state plane to get him for the vote, Obamas staff refused to say where he was. The deal narrowly failed, and Obama later said his young daughter was ill and he couldnt leave her to travel to Springfield. mcgarcia@tribpub.com, rap30@aol.com]", "Date": "20150902", "Author": "[Monique Garcia, Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-bruce-rauner-michael-madigan-union-vote-met-0903-20150902-story.html", "Title": "[Rauner prevails on major labor bill as Madigan fails to muster votes]"}