{"Content": "[For Democrats, New York would offer a diverse tableau in liberal Brooklyn and a touch of Clinton nostalgia. Philadelphia would give the party a patriotic backdrop while Columbus would raise the curtain on another campaign showdown in Ohio. Democrats are closing in on a final decision on where to hold their 2016 convention, a site that could serve as a passing of the baton from President Barack Obama to Hillary Rodham Clinton, the leading contender for the Democratic nomination should she run for president again. With a price tag of at least $65 million, the choice will come down to whether to set the stage for Obamas Democratic successor in a big city or in the confines of another battleground state. Obama was formally nominated in Denver in 2008 and in Charlotte, North Carolina, in 2012, allowing his campaign to use the events to register new voters and recruit volunteers in states crucial to his political map. The three cities in the hunt for the 2016 host venue have been negotiating with the Democratic National Committee and a final decision is expected in late January or early February. New York, the nations largest city, has been a popular choice in the past, holding Democratic conventions in 1976, 1980 and 1992, when former President Bill Clinton was first nominated at Madison Square Garden. The city has played up its diversity as the home to a large Latino population and organizers are confident that Brooklyns bid the first time New York has pitched a political convention outside Manhattan wouldnt have trouble raising money. Hillary Clinton represented New York in the Senate and the Clintons live in nearby Westchester County, where the former secretary of states presidential campaign is expected to be headquartered should she seek the nomination, as widely expected. Philadelphias organizers point to the citys heritage as the home of the Liberty Bell and Independence Hall, where the Declaration of Independence and U.S. Constitution were adopted, along with its convenient East Coast location and compact, easy-to-navigate community. Columbus, meanwhile, would bring the convention to one of the nations top presidential battleground states and offer a convenient rebuttal to Republicans, who are holding their July 2016 convention in Cleveland. Downplaying symbolism, party leaders say their choice will be based on practical matters such as finances, transportation, security and available hotel rooms. Organizers of the 2012 convention in Charlotte struggled with fundraising and some delegates at past conventions have complained of long commutes from far-flung hotels. \"This decision will primarily center around logistics, financing and security, but we have three excellent options and are looking forward to a diverse and inclusive 2016 convention that displays our partys values,\" said Lily Adams, a DNC spokeswoman. Democrats also need to pick a date, which could factor into the partys 2016 strategy. Republicans will hold their Cleveland convention from July 18-21. Democrats are considering either the week of July 25, immediately after the Republican event, or the week of Aug. 22, following the Summer Olympics. Heres a look at the three cities vying for the convention:, ", "Date": "20150119", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-democrats-2016-convention-20150119-story.html", "Title": "[Decision looms for Democrats on 2016 convention site ]"}