{"Content": "[Democrats have had a lot of fun joking about the huge field of Republican presidential candidates and the clown car they keep piling out of. The Democrats, by contrast, couldnt fill a minivan. And the way things are going, that may be a big problem. Say what you will about the GOP, it has an abundance of people with the credentials to warrant real consideration. Jeb Bush, John Kasich, Rick Perry, Chris Christie and Scott Walker have extensive records as governors. Marco Rubio, Rand Paul and Ted Cruz have managed to stand out from the Senate crowd. Carly Fiorina was CEO of a major corporation. The rank and files main problem is sorting through them all. Democrats, by contrast, have only five candidates. At the moment, its really a two-person contest between Hillary Clinton and Bernie Sanders. And those two options suggest the party could be in trouble come November 2016. Clinton has been the heir apparent since losing her partys primary campaign to Barack Obama in 2008. She has obvious assets: universal name recognition, plenty of money, vast campaign experience and an ex-president husband who gives a great speech. But she has a couple of drawbacks one that is not going away and another that seems to be growing bigger by the minute. The first problem is that she doesnt stir the kind of excitement that Obama and Bill Clinton did. Democrats seem not so much committed as resigned to her, as their best chance to win. But that belief is in question thanks to a steady drip of revelations about her use of a private email server for government business during her time as secretary of state compounded by her inaccurate claims about it. Some of the emails she was supposed to turn over, she didnt, and some contained classified information. On Tuesday, her lawyer announced she was giving the server and a thumb drive containing copies of the messages to the FBI, which is assessing the security implications of what she did. The episode revives some of the old complaints about Clinton: that she is secretive, deceptive and given to bending the rules when it suits her political convenience. And she got a shock when a poll showed her trailing Sanders in New Hampshire. All of which is treacherous news for the party. Sanders, a self-styled socialist, has attracted big and enthusiastic crowds, but his positions veer too far left to be salable in a general election. Former Maryland Gov. Martin OMalley boasts excellent campaign skills, but hes practically unknown beyond his home state. Former Virginia Sen. Jim Webb and former Rhode Island Gov. Lincoln Chafee are equally unknown but lack those campaign skills. The pickings are so slim that talk is percolating about a late entrance by Joe Biden, John Kerry or even Al Gore. Anyone know how to reach Michael Dukakis?, How is it that a party that has won the popular vote in five of the last six presidential elections has so little presidential timber? Obama and the Clintons have towered over the party for so long that theyve stifled the growth of other prospects. John Edwards, who ran a strong race in 2008, stepped into scandals that ended his political career. One problem is that the party has fallen on hard times at the state level. There are only 18 Democratic governors. Democrats are also in the minority in the U.S. Senate, and they have few stars. The biggest, Elizabeth Warren of Massachusetts, declined invitations to run this year. The party has some solid prospects, including New York Sen. Kirsten Gillibrand, Colorado Gov. John Hickenlooper, New Jersey Sen. Cory Booker, Minnesota Sen. Amy Klobuchar, Virginia Sen. Tim Kaine and Housing Secretary Julian Castro. But this time around, they are strictly veep material. Right now, the party resembles a baseball team that has been winning for years but has an aging roster, a weak bench and a minor league system full of raw youngsters. Maybe Hillary Clinton will weather all the trials and keep the Democratic hold on the White House. But win or lose, Democrats have a lot of rebuilding to do.]", "Date": "20150814", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-democrats-hillary-clinton-bill-obama-sanders-biden-gore-kerry-edit-0816-jm-20150814-story.html", "Title": "[The Democrats have a candidate shortage]"}