{"Content": "[Political scientists know quite a bit about how U.S. presidential elections work. We generally agree that \"fundamentals\" such as the economy have a strong effect on elections, and we collectively have a good grasp on how both party nominations and general elections work. But we dont know everything! After all, there just arent that many presidential elections to use for comparison. Thats especially true of the nominations process, because reforms after 1968 changed it a lot. So new, untested conditions will occur in almost every presidential election cycle. Heres a list of some of what we dont know that might be relevant to 2016:, Will nominating a woman matter to voters? Theres good evidence a candidates gender doesnt matter much in other elections, yet the presidency might be different. We cant know in advance if Hillary Clinton might bring out a hidden vote of those who are excited about a possible female president -- or those who oppose the idea. Im skeptical it will matter much, yet we cant get definitive answers from pre-election studies. What impact would Jeb Bushs family history have on voters? Political scientists have found that candidates arent all that important in presidential general elections. (Yes, I know many people dont accept this, but its what the evidence shows.) It doesnt mean the individuals dont matter at all. The biggest exceptions to the general rule are those who are perceived to be far from the ideological mainstream. But weve never had anything similar to Jeb Bushs position -- no one has had two unpopular presidents in the family before -- so we have no way of knowing how general-election swing voters would react if he was nominated: Would he be seen as a generic Republican, or is the Bush name poison for some who would otherwise consider the partys nominee?, Will Republicans successfully narrow their field before Iowa? Both parties have found ways to limit the number of serious candidates by the time of the Iowa caucuses, and many Republican candidates in particular have dropped out before then. But weve never had a Republican nomination battle with this many viable candidates. So far, Rob Portman and Mitt Romney have been eliminated. Id bet that only a handful of the strong contenders will survive into 2016, and that the contest will have a solid structure by then. Yet there hasnt been a similar campaign, especially on the Republican side, since the reforms, so well have to see how they handle it. I could add an item on the post-Iowa winnowing. I think the evidence shows that parties have become good at rapidly reducing the number of viable candidates and preventing the others from affecting the outcome. But other political scientists are less confident that voters will follow what parties decide. Some suggest that new campaign-finance arrangements will allow losing candidates to stay in when in the past they would have dropped out. That, too, will be tested in this cycle. One more: Does it hurt a party to fight hard over its nomination while the other party settles on a candidate early? Some argue that contested primaries hurt a party by wasting resources and making it harder to unite for the general election. Others believe contested nominations energize the party. Overall, the evidence is mixed. Either way, the effect appears to be small. Still, we have a bit of uncertainty on this one. All in all: The Monkey Cage and Mischiefs of Faction and FHQ and other sources for what political scientists know are going to be excellent guides for Election 2016. But its important for us to tell you what we dont know, too. Jonathan Bernstein is a Bloomberg View columnist covering U.S. politics.]", "Date": "20150204", "Author": "[Jonathan Bernstein]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-hillary-clinton-jeb-bush-2016-presidential-election-20150204-story.html", "Title": "[What we don't know about Hillary Clinton and Jeb Bush]"}