{"Content": "[About 160,000 low- and moderate-income Indiana residents will keep the health insurance premium subsidies provided through the Affordable Care Act under a U.S. Supreme Court ruling Thursday. The court ruled 6-3 that the Internal Revenue Service could allow the subsidies even in the 34 states, including Indiana, that didnt set up their own health insurance exchanges. Supporters of the subsidies say the ruling is good news for the thousands of residents who rely on the tax credits to obtain health care. The Kaiser Family Foundation estimates Indiana receives more than $51 million in federal tax subsidies to pay for health insurance, with the average enrollee seeing a tax credit of about $320 a month. Did you hear us doing the happy dance here at HealthLinc? joked Beth Wrobel, executive director of HealthLinc Community Health Centers, which has clinics in Valparaiso, East Chicago, Michigan City, Mishawaka and Knox. About 1,000 of HealthLincs 25,000 clients have gotten into the health care market place since it opened, she said. A lot of times these people never had insurance before and sometimes getting insurance can be the difference between getting healthy and getting a job, so it has an economic impact, she said. Losing health insurance premium subsidies, she said, would be a setback for those clients, as well as the areas economy as a whole. She said she has witnessed many instances where being able to get a medical test or procedure would have made a difference in someones life. Health care to me should not be political. Having health care is essential to everyones lives, she said. Everyone is one step away from not having health care. Those people with subsidies could be us tomorrow.\", Republicans in Indiana, meanwhile, did not shareWrobels enthusiasm. \"Todays display of judicial activism by the Supreme Court upholds this deeply flawed law to the detriment of millions of Hoosiers who will continue to be subject to the mandates and taxes in Obamacare,\" Gov. Mike Pence said in a statement. Republican U.S. Sen. Dan Coats called the law poorly written and executed, while Eric Holcomb, who is seeking to replace Coats in the Senate, urged fellow Republicans to take action. \"Those of us who feel the Affordable Care Act was the wrong answer to a national problem just cant continue talking about what were against; we now have to present what were for,\" Holcomb said in a statement. Indiana Democratic Party Chairman John Zody said the ruling \"reaffirms what we already know - commonsense ideas that improve the lives of everyday folks, including Hoosiers, will always win.\", Obama greeted news of the decision by declaring the health care law \"is here to stay.\" He said the law is no longer about politics, but the benefits millions of people are receiving. -Post-Tribune freelance reporter Amy Lavalley contributed to this Associated Press report]", "Date": "20150625", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-supreme-court-obamacare-indiana-20150625-story.html", "Title": "[Indiana residents to keep Obamacare subsidies under Supreme Court ruling]"}