{"Content": "[Its not much fun to play the good news/bad news game concerning Syria because the situation is so discouraging, but we found something to cheer in recent reports from that countrys border area with Turkey. Thats where Syrian Kurds are battling Islamic State in coordination with U.S.-led airstrikes. Momentum can shift overnight, but from what weve heard, the YPG Syrian Kurd militia dealt Islamic State also known as ISIS a significant defeat in northern Syria, denying ISIS a supply route into Turkey and putting pressure on its self-proclaimed capital, Raqqa. But the bad news is bad: The United States put up $500 million last year to train and arm thousands of moderate Syrians to join the war on Islamic State. The plan was to train 5,000 Syrian rebels a year for three years. So how many of those fighters are now in boot camp? Just 60. Defense Secretary Ash Carter acknowledged 60 is \"an awfully small number.\" No kidding. He said it will get larger \"over time.\" It had better. Yes, theres more than one reason for the embarrassingly slow start, beginning with the logistical challenge of setting up training operations in Turkey, Jordan, Qatar and Saudi Arabia. But its the recruiting process that really bogs things down. The U.S. needs to carefully vet volunteers to assure every Syrian fighter is trustworthy and not, for example, undercover ISIS. There are 7,000 recruits in the pipeline. President Barack Obama is putting a second limitation on the volunteers that complicates the situation: The Syrian rebels are being trained to fight Islamic State, not the forces of Syrian leader Bashar Assad, whom the moderate Syrians are really itching to target. The U.S. isnt focused on Assad and may not have legal authority to attack his troops. This became an issue Tuesday in a Senate hearing when Carter, in an exchange with Sen. John McCain, said American trainers are making no assurances to Syrians recruits that U.S. warplanes would come to their aid if they got bombed by Assad. Syrian recruits need to know the U.S. will have their back in battle. Why would anyone sign up without that guarantee?, Its a measure of the tangled fight against Islamic State that the rules of engagement are so convoluted. Syria is a battlefield with multiple sides and players, including the Assad regime vs. his many opponents in a bloody civil war, plus Islamic State, which moved to fill the void left by Assads collapsing government in Damascus. The situation is similarly complex in Iraq, where Sunni Islamic State holds a broad swath of territory, much of it taken from the weak Iraqi army in a country with a Sunni-Shia divide. Again, the U.S. is in agonizing training mode, trying to whip the bedraggled Iraqis back into shape to dislodge ISIS. Things are going a little better, but are still behind schedule. The U.S. has trained about 9,000 Iraqi soldiers, well short of the goal of 24,000. The U.S. controls the skies but Islamic State will not be defeated without a battlefield force, and thats a role Obama insists must be played by the Iraqis and Syrians. America cant repeat the pattern of fighting a war and then going home, only to watch the bad guys return to wreak havoc. Is there any example to suggest a competently trained local army can defeat Islamic State? Yes, and thats the good news: The Syrian Kurd militia, fighting alongside some Free Syrian Army brigades, has driven back Islamic State forces in recent weeks, taking the important Syria-Turkey border crossing of Tal Abyad, solidifying more than a month of territory gains. Theyve done this with the help of U.S. airstrikes, showing that the U.S. strategy of partnering with hometown boots on the ground can work. There are caveats to broader optimism, the biggest being that the Kurds are a proven military force. In Iraq, Kurdish fighters known as peshmerga are battle-hardened partners of the U.S. holding the line against Islamic State. No one else on the U.S. side has proven as able yet. Wladimir van Wilgenburg, an expert on the region at the Jamestown Foundation, tells us it could take two or three years for the U.S.-trained Iraqis to dislodge Islamic State. He says the job will be even harder in Syria because there is no obvious political solution. In fact, rivalries in Syria may be more entrenched and sensitive than in Iraq. Van Wilgenburg notes that the Syrian Kurd militia, for example, wont continue its drive to Raqqa because thats an Arab town and the Kurds main interest is connecting Kurdish enclaves. Iraq, with its Sunni-Shia split, has similar complexities. Obama, too, said this week that defeating Islamic State will be a long-term campaign. Sixty fighters at a time, it certainly will.]", "Date": "20150709", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-isis-syria-kurds-islamic-state-obama-iraq-edit-0710-jm-20150709-story.html", "Title": "[Recruiting the Syrians, cheering the Kurds]"}