{"Content": "[When Barack Obamas people announced last week that they are searching worldwide for an architect for the Obama Presidential Center in Chicago, they won no points for transparency. Martin Nesbitt, chairman of the Barack Obama Foundation, declined to identify the firms that were invited to submit qualifications for the center or to say how many were invited. He did reveal, though, that most of them are American and several are from Chicago. Having consulted sources, I can now name 11 of the firms and observe that they are A) Of high caliber; B) Represent a broad geographic and aesthetic spectrum; and C) Include the established firms one would expect to be invited. Read ongoing Tribune coverage of Chicagos bid to land the Obama library and museum. Read ongoing Tribune coverage of Chicagos bid to land the Obama library and museum. Two of the firms -- Ennead Architects (formerly Polshek Partnership Architects) and Robert A.M. Stern Architects, both of New York -- designed the most recent presidential libraries (a modern one for Bill Clinton and a traditional one for George W. Bush). If Obama wants to make a fresh statement, one has to wonder, why would he want them?, Renzo Piano, the architect of the Art Institute of Chicagos Modern Wing and New Yorks new Whitney Museum, also received a request for qualifications. Michelle Obama publicly praised his Whitney building after touring it earlier this year. Piano, an Italian, is the 1998 winner of the Pritzker Architecture Prize, the fields highest honor. Another invited architect attended a White House dinner with the Obamas. But its not the presumed front-runner for the job, the London-based, Tanzanian-born architect David Adjaye, who sat with them during a 2012 state dinner for British Prime Minister David Cameron. Its the German-born Chicago architect Helmut Jahn, who in 2011 sat at the Obamas head table at a state dinner in honor of German Chancellor Angela Merkel. \"I had dinner at the White House with Obama, too,\" said Jahn, whose projects include the United Airlines terminal at OHare International Airport and the Mansueto Library at the University of Chicago. The rumor mill already has the job going to Adjaye, whose projects include the under-construction National Museum of African American History and Culture in Washington. It was easy to interpret the global search as a way of opening the door for him. He would be the first non-American architect to design an American presidential library. If, as expected, Adjaye is on the list of invited architects his spokeswoman did not respond to an email his chances wont be hurt by fortuitous timing: On Sept. 19, three days after the deadline for architects to send in their qualifications, the Art Institute will mount a major exhibit devoted to his work. For President Barack Obama and the first lady, who will jointly choose the architect for the presidential center, the museums imprimatur could offer political cover. They could argue that Adjaye isnt being picked because of his African background hes getting the job because hes good. But that choice wont be made until late this year or early next year. For now, other invited firms arent ready to cede the project, which is expected to cost at least $500 million and be built in Washington Park or Jackson Park. Fifty or more firms are thought to have been invited. \"I dont believe that Adjaye is a shoo-in,\" said Mark Sexton of the Chicago firm Krueck+Sexton, whose projects include the elegantly faceted Spertus Institute at 610 S. Michigan Ave. Using a political metaphor to describe the architectural selection process, Sexton added: \"Its a little like the Republican primaries. Whoever is on top right now, it changes. Theres a long, long way before the election.\", Technically, the process is open to any architect. Organizers have pledged that all submissions will be considered, regardless of whether they are from architects who were invited to submit qualifications. Other Chicago firms invited to compete include Ross Barney Architects, led by Carol Ross Barney, a key designer of the downtown Riverwalk who has won plaudits for new Chicago Transit Authority rapid-transit stations. That experience could help because part of the Washington Park site is next to a CTA Green Line station. Another local contender is the Chicago office of Perkins+Will, whose chief designer, Ralph Johnson, has already run the gantlet of slipping a museum into cherished parkland. His credits include the Peggy Notebaert Nature Museum in Lincoln Park. Open-space advocates have expressed concern that the presidential center will disturb the pastoral atmosphere of Washington and Jackson parks, both of which were designed by Frederick Law Olmsted. Also invited is Chicagos Tigerman McCurry Architects, headed by Stanley Tigerman and Margaret McCurry. The firms brings intellectual heft and a longtime commitment to design for the disadvantaged, a quality thats relevant because the Obama center will be built near impoverished South Side neighborhoods. The non-Chicago firms asked to complete are equally impressive and just as well-established. Besides the Piano, Ennead and Stern firms, they include New Yorks Diller Scofidio + Renfro, which co-designed New Yorks wildly popular High Line; the San Francisco office of Skidmore, Owings & Merrill, which shaped an acclaimed U.S. consulate in the Chinese city of Guangzhou; and North Carolina architect Philip Freelon, whose firm last year became part of Perkins+Will. Freelons entry will be independent of the firms. Freelon designed a critically praised Washington public library that Obama toured this year. Chicago architect Jeanne Gang declined to comment on whether shes invited, as did the Los Angeles-area firm Morphosis, whose principal Thom Mayne in 2005 won the Pritzker Architecture Prize. Some Chicago architects said they would compete for the job even though they werent asked. \"You know, what the hell? Im going to submit anyway,\" said architect Juan Moreno, who designed the brightly colored El Centro, a satellite building for Northeastern Illinois University along the Kennedy Expressway. Posted online, the request for qualifications tells interested firms to submit information including descriptions of three to five relevant projects. At this point, entrants are not being asked to provide designs. Later this year, the president and first lady will select firms that go on to the next round. That round will culminate when finalists make actual proposals to the Obamas and they select an architect. The foundation expects to reveal the winner in early 2016. Will Chicago-style politicking influence the choice?, \"We realize that this isnt something you lobby for,\" Sexton said. \"Our goal right now is to simply make it into the next round.\", bkamin@tribpub.com, Twitter @BlairKamin]", "Date": "20150901", "Author": "[Blair Kamin]", "Link": "http://www.chicagotribune.com/news/columnists/ct-obama-library-architect-selection-kamin-met-0902-20150901-column.html", "Title": "[ Piano, Jahn among architects vying for Obama library]"}