{"Content": "[\"Let us never forget that government is ourselves and not an alien power over us. The ultimate rulers of our democracy are not a president and senators and congressmen and government officials, but the voters of this country.\", Franklin Delano Roosevelt, Karen Tallian of Ogden Dunes is a lawyer and state senator from the 4th District, which encompasses the northern half of Porter County, Michigan City and Westville. She is running for governor of the Hoosier State. Tallian is a progressive who is for the decriminalization of marijuana, gay rights, womens rights, and shes pro-labor. ***, Maiden name?, Kotansky,\" she said. You were born and raised in Streator, Ill. \"Yes, Streator is like two hours south of Chicago on the Amtrak. So, its Chicago, Joliet, Coal City, Streator.\", Whats the population of Streator?, \"When I was growin up Streator was kind of famous because it was the home of Owens Illinois Glass Co. which at the time was the biggest glass manufacturing plant in the United States. Streator had a big railway hub. Back in the 50s, the population was maybe 25,000. Now, its probably 15,000. Owens is all but shut down.\", Youre the daughter of an auctioneer. \"Thats not quite true. My dad ran the auction house. He didnt actually do the, Hey, bid a dollar thing. He was in the antique business.\", I didnt realize that you serve Michigan City and Westville, which are in LaPorte County. \"I told Jimmy Arnold after the redistricting that I now have your (casino) boat, your university and your two prisons. By the way, that Kankakee River video thing you did was really great. That night, after we set up this meeting, I was flipping through the channels and there you were. I said: Well, look at that. Thats the guy whos going to interview me.\", Karen, I had a lot of help with that documentary film. College?, \"The University of Chicago in Hyde Park (Ill.) I started off in pre-med, but I got lost in the 60s and ended up with a bachelors degree in psychology and philosophy.\", Groovy. \"I also earned an associate degree from Chicagos Harrington College of Design. After taking some masters classes, I worked in the commodities markets in Chicago for a few years.\", When did you move to Ogden Dunes?, \"In 1975. While raising three kids, I got my J.D. at Valparaiso University.\", This is your fourth term as state senator. \"I came in in December of 05 when Rose Antich resigned. I ran in 06, 10 and 14. This is my 10th year. \"They have something called the ranking member of various committees. Because we have a Republican-controlled legislature, the chairmen of a committee is going to be a Republican. The top Democrat in charge of that committee is called the ranking minority member. Ive been the ranking minority member on the environment committee for like eight years, and on the pensions and labor committee for 10 years. For six years, Ive been the ranking minority member on the senate appropriation committee and Im also on the state budget committee.\", You are a friend of Labor. As we speak, Im looking at this plaque that reads: \"United Steelworkers District 7, 2014 honoree Woman of Steel presented to Karen Tallian, State Senator.\", \"In the Senate, Im the person who was the loud mouth voice against right-to-work legislation and when Gov. Pence pushed to repeal the common construction wage. When teachers had their collective bargaining taken away, I was the one in the Senate who was on the front line of that. Same when the Republicans passed the Religious Freedom Restoration Act. The bottom line is there needs to be a balance of power. Republican control of state government has created policies more conservative than the electorate.\", Continue, please. \"People think of labor and they think of unions. But there are a lot of people who arent lucky enough to be part of a union. We have a lot of women who work full-time at minimum-wage jobs. They are below the federal poverty level. Thats just wrong. Ive filed a bill for the last three years to increase the minimum wage. It never gets a hearing. Im just kinda sick of it. \"Im sick of the Mitch Daniels and Mike Pence administrations that have for the last 12 years made our K through 12 education into a privatization and strange experiment, which we all see is not working very well.\", Talk to me. \"For the last three budgets I have watched them put money in a drawer to keep a big surplus, all the while our agencies are deteriorating. Some of them, like the (Indiana Department of Natural Resources), are barely able to function. Every year, they keep takin away more money. We want 3 percent off, 3 percent off, 3 percent off ... . You can only do that for so long. The next governor is going to face some financial problems that have been created by their constant chipping away of money from the agencies.\", Karen, Ive always maintained that Northwest Indiana is the 51st state of the union. Chicagoans consider us rubes and the downstaters deem us thugs and foreigners. \"There does seem to be a bit of a bias against Northwest Indiana, even though we do generate a huge economic engine for the rest of the state. We send a lot of money to the Statehouse.\", Your bid to become our next governor?, \"You havent asked me, but other people, when I do interviews around the state, ask me: Can somebody from Northwest Indiana get elected governor? They dont ask that question if a politician hails from places like Evansville, Muncie or Lafayette. We do have a huge voting bloc of Democrats up here.\", ***, Karen Tallian has my vote. Jeff Manes is a freelance columnist for the Post-Tribune. jeffmanes@sbcglobal.net]", "Date": "20150724", "Author": "[Jeff Manes]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/lifestyles/ct-ptb-manes-with-karen-tallian-st-0725-20150724-story.html", "Title": "[Senator 'just kinda sick of' Republican control of the state]"}