{"Content": "[When media guru Marshall McLuhan declared back in the 1960s that \"Every innovation has within itself the seeds of its reversal,\" I had no idea what he meant. But, like his other catchy quotables \"global village,\" \"cool media,\" \"the medium is the message\" it stayed with me. Now, in the Internet age, I am seeing proof of his prophesy every day. For example, McLuhan predicted that a rapidly expanding automobile culture would lead to more traffic jams, air pollution and longing for space to take long walks or ride bicycles. Im sure hed give a knowing I-told-you-so nod to todays battles between car people and bike people for asphalt space. I became convinced when my millennial-generation son and his friends rejected wristwatches in their teen years as \"so last century.\" They preferred to tell time with their cellphones. But more recently and less happily, I see far more sinister seeds of reversal in this eras greatest innovation, the Internet. We greeted the Web as a liberator but, in todays age of terrorism and post-Cold War autocrats, it also poses as a growing menace to the press freedoms it otherwise invigorates. In the hands of groups like ISIS, for example, the Web is a worldwide weapon in \"a new war on journalists,\" said Knight Foundation President Alberto Ibarguen in November. Speaking at the International Press Freedom Awards Dinner of the New York-based Committee to Protect Journalists, on whose board I am a member, Ibarguen cited the gruesome online beheadings of American journalists James Foley and Steven Sotloff as examples of how todays terrorists \"will kill a journalist not to stop the story but to create one.\", The Atlantics Jeffrey Goldberg sounded a similar alarm. Extremists have turned against journalists, he recently wrote, not only because terrorists have become more extreme but also because they \"dont need us anymore.\", Remembering how administrators of a Taliban madrassa that he visited 15 years ago were launching a website, Goldberg wrote, \"I remember being amused by this. I shouldnt have been. There is no need for a middleman now. Journalists have been replaced by YouTube and Twitter. And when there is no need for us, we become targets.\", Terrorists are not the only threat that terrorizes journalists in the new Internet-age media order. In his new book, \"The New Censorship: Inside the Global Battle for Media Freedom,\" Joel Simon, CPJs executive director, coins the label \"democratators\" to describe a new wave of elected rulers like Russias Vladimir Putin and Turkeys Recep Tayyip Erdogan, who shamelessly navigate the information age with an iron fist of strategic information controls. Both regimes have received low marks from CPJ, Reporters Without Borders and Human Rights Watch for abuses of press freedoms and other civil liberties. Besides murder, kidnappings and democratators, another growing threat Simon cites is government surveillance and pursuit of reporters confidential sources. Revelations of NSA surveillance and Justice Department probes of journalists at AP, Fox News and The New York Times brought CPJ closer to home after years of finding plenty of press abuses overseas. What can be done? Forget the false debate over whether the traditional media or the new blogosphere, Twitterverse, social media are better. Each plays a vital role in keeping the public informed, maintaining robust debate and changing world events. In her 2012 book \"Consent of the Networked,\" Rebecca MacKinnon, a former CNN bureau chief in Beijing and an Internet policy specialist, urges us to stop arguing over whether the Internet empowers people. Instead, she says, we should address how technology should be governed best to support the rights and liberties of users around the world. Im not comforted by the coalition of Internet-restricting nations like China, Russia, Iran and Saudi Arabia that have called for the United Nations to take over Internet governance. But the de facto governance by corporations that mine our data for commercial reasons raises disturbing questions too. McLuhan was right about every innovation containing the seeds of its own reversal. We need to seriously start thinking about how our current wave of communications innovations can best be governed before the next one comes along. Clarence Page, a member of the Tribune Editorial Board, blogs at chicagotribune.com/pagespage. \"Culture Worrier,\" a collection of his best columns, is available in print and at chicagotribune.com/ebooks. cpage@tribpub.com, Twitter @cptime]", "Date": "20150106", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-isis-perspec-0107-20150106-column.html", "Title": "[Internet age can threaten freedoms]"}