{"Content": "[College of DuPage Interior Design Assistant Professor and Program Coordinator Jane Kielb was recently named President of the Illinois chapter of the International Interior Design Association (IIDA). \"Its such an honor to be chosen for this role from a group of such extremely respected and successful professionals in the Interior Design industry,\" Kielb said. As President of the Illinois chapter of the IIDA, Kielb will be responsible for providing leadership in support of the organizations commitment to promoting the highest level of standards in the interior design industry through education, knowledge and networking opportunities. During her term as president, Kielb said she plans to work with the IIDA Illinois Executive Board to evaluate the chapters programs and practices and integrate and streamline those processes wherever possible. \"This organization includes emerging, intermediate and experienced design professionals,\" she said. \"To support our wide variety of programs, we solicit industry partners. There is a synergy between involved members and strong industry partners. As a board, we will do everything we can to provide all groups, including students, with the greatest benefits and opportunities possible. Its a win/win.\", Before her election, Kielb had already fulfilled a variety of duties in the role of President Elect, including co-chairing events such as a leadership breakfast and the IIDA Illinois chapter Design Awards. Previous to her term as President Elect, Kielb served two years as the IIDA Illinois chapters Vice President of Student Affairs and spent seven years juried with the National Council for Interior Design Qualifications (NCIDQ), an independent, nonprofit organization of credentialing bodies committed to establishing standards of competence for interior design and interior architecture professionals. Following her term as IIDA President, she will also be expected to provide advice and guidance serving as Past President. Kielb, who has spent more than 30 years as a professional interior designer, including time as senior store planner for the Midwest regional office of Hallmark Cards, said that the IIDA provides a great opportunity to CODs interior design students. \"Ive had more than 40 students who became IIDA members and many of them have found internships and jobs through their involvement in the IIDA,\" she said. Kielb said that the quality of the College of DuPage Interior Design program and the students who complete the program has been gaining positive attention from major companies in the industry. \"The Interior Design program at COD really is a cut above the rest,\" she said. \"We have three state-of-the-art design studio classrooms, a dedicated computer lab and material resources that are the equivalent of a professional design firm.\", The Interior Design program at COD provides students with a variety of learning opportunities that match current industry trends and standards. Taught by professionals in state-of-the-art learning labs, the program enables students to explore career interests, strengthen marketable skills and build a portfolio of work while earning a variety of credentials, including an A.A.S. in Interior Design, as well as certificates in Interior Design Computer Applications, Kitchen and Bath, Lighting, and Sustainable/Green Interior Design. Click here to learn more about the Interior Design program at College of DuPage. The International Interior Design Association (IIDA) is a professional networking and educational association of more than 10,000 members in eight specialty forums, nine regions, and more than 30 chapters around the world. This item was posted by a community contributor. To read more about community contributors, click here.]", "Date": "20150824", "Author": "[Community Contributor mitchell11]", "Link": "http://www.chicagotribune.com/suburbs/glen-ellyn/community/chi-ugc-article-cod-professor-named-president-of-the-illinois-2015-08-24-story.html", "Title": "[COD Professor Named President of the Illinois Chapter of International Interior Design Association]"}