{"Content": "[A judge on Friday struck down the states landmark pension law that sought to fix Illinois $104.6 billion government retirement system debt, declaring the measure unconstitutional and clearing a path for a showdown in the Illinois Supreme Court. Sangamon County Circuit Court Judge John Belz agreed with public employee unions and retirees who challenged the December 2013 law, maintaining that it without question violates the state constitutions provision that a public worker pension cannot be diminished or impaired. The state of Illinois made a constitutionally protected promise to its employees concerning their pension benefits, Belz wrote. Under established and uncontroverted Illinois law, the state of Illinois cannot break this promise. While the ruling drew praise from unions and retirees, state officials worry it could undermine state finances that already are precarious. A re-election seeking Mayor Rahm Emnanuel also is watching closely to see what ramifications the court battle has for the city, which faces a $550 million increase for police and fire pension funding in 2016 unless the General Assembly grants some relief. Illinois Attorney General Lisa Madigan said she will appeal the decision to the states high court, where cases go when a state law is declared unconstitutional. She will ask justices to expedite the appeal to get a resolution to the long-festering pension issue, given the significant impact that a final decision in this case will have on the states financial condition. The judges ruling came after Democratic Gov. Pat Quinn and lawmakers approved pension legislation nearly a year ago that would scale back cost-of-living adjustments and require government employees to work longer before retirement but pay a little less toward their pensions. The idea was to cut the overall costs of paying down the pension debt and put the state on a 30-year road toward eliminating a massive hole created by decades of underfunding by prior governors and lawmakers. The unions sued. The attorney generals office argued that modifications in pension plans could be made in extraordinary circumstances, such as the overwhelming costs of the huge pension debt, but Belz brushed that aside Friday. The pension protection clause contains no exceptions, restrictions or limitations for an exercise of the states police powers or sovereign powers, Belz wrote, referring to positions Madigans office took in support the law. Dan Montgomery, head of the Illinois Federation of Teachers, which includes the Chicago Teachers Union, called Belz ruling a clear and total victory. A spokesman for Democratic House Speaker Michael Madigan noted that the ruling is just the first step in the legal process and maintained the law will be upheld by the Illinois Supreme Court. Democratic Senate President John Cullerton, who expressed doubts about the laws constitutionality when it passed, said Friday the ruling confirms that, while the need for reform is urgent, the rule of law is absolute. Cullerton, who originally had championed a separate plan that involved trade-offs worked out with a union coalition, issued a statement that he long believed there is a constitutional way to confront Illinois pension challenges and remained committed to that. Senate Republican leader Christine Radogno said she remained hopeful state Supreme Court justices would find the law constitutional and, at the very least, provide guidance for potential changes. Her comments reflected the view of Republican Gov.-elect Bruce Rauner, who said Friday before Belz ruled that he hoped the lower courts decision would provide feedback on whats do-able and whats not that we can begin to factor in.. . . Its going to be a lot of work and we need to do a lot of planning. Quinn, who signed the much-hyped pension bill into law, once maintained he was put on earth to fix the states retirement systems and made a pension overhaul a top priority of his administration. A Quinn budget spokesman said Fridays ruling would not have an immediate impact on the state budget because officials did not factor in pension changes to the current spending plan. But if the high court upholds Fridays ruling, the states pension payment could jump from $6.2 billion this year to $6.9 billion in the next budget year. If the pension changes were upheld, that payment would be closer to $5.9 billion, according to the Quinn budget office. In addition to state government, the Emanuel administration has a lot riding on the state Supreme Courts ultimate ruling. In April, Emanuel got passed a state law that altered pensions for city of Chicago workers and laborers. Unions have been mulling a lawsuit. The city legislation requires workers to pay more toward their retirements and reduces future increases to cost-of-living benefits. In exchange, the city is ramping up its payments into those funds until the increase hits $250 million a year in 2020. Emanuel has maintained that his pension approach is different from the one enacted by the state because a majority of the city unions signed off on the plan. A top official with the Service Employees Union International Local 73 even urged Quinn to sign the bill. Beyond that, Emanuel has said negotiations with police and fire unions to work out pension changes have stalled as the labor groups wait for the ruling on the state pension law. The outcome of those talks will have an even bigger impact on the citys shaky finances. Tribune reporters Monique Garcia, Michelle Manchir and Rick Pearson contributed.]", "Date": "20141121", "Author": "[Ray Long, Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-key-ruling-on-illinois-pension-law-expected-friday-afternoon-20141120-story.html", "Title": "[Landmark state pension law struck down by Springfield judge]"}