{"Content": "[Conservative fears are finally coming true. Back when President Barack Obama was deporting large numbers of undocumented immigrants 409,849 individuals in 2012 conservatives presented an alternate reality. The federal government has reached a point now where virtually no one is being deported, except those convicted of serious crimes, Sen. Jeff Sessions, R-Ala. an arch immigration foe, said in June 2013. The conservative nightmare extended beyond the administrations allegedly cushy treatment of undocumented immigrants already settled in the U.S. Some conservatives, including Sessions, characterized Obamas border control as a policy of open borders. (The plural of border is always a curious usage; none of these critics seems the least bit concerned about the Canadian frontier.) The lawless brown hordes streaming unchecked over the border and settling into a life of ease have been a recurring source of angst for some conservatives. In reality, the U.S. population of undocumented immigrants was about 12 million in 2007, according to the Pew Research Center, widely regarded as the most accurate source. By 2012, the number had fallen to about 11 million. In a mathematical miracle, all those people streaming north through open borders led to a net decrease in undocumented immigrants in the country. In his first term, Obama had hoped that aggressive deportations and strong border security would earn the confidence of conservatives, enabling Congress to pass a comprehensive fix to immigration. In 2013, 14 Republicans helped push immigration reform through the Senate. But in the House, the legislation fell before the thrashing sounds of recrimination and crazy. According to Speaker of the House John Boehner, R-Ohio, the reason House Republicans were incapable of passing immigration reform legislation was widespread doubt about whether this administration can be trusted to enforce our laws. Last November, Obama put flesh on the conservative bogeyman. A Nov. 20, 2014, Department of Homeland Security memorandum narrowed the categories of immigrants targeted for deportation, citing criminals, potential terrorists and recent border crossers. The memo advises:, Nothing in this memorandum should be construed to prohibit or discourage the apprehension, detention, or removal of aliens unlawfully in the United States who are not identified as priorities herein. However, resources should be dedicated, to the greatest degree possible, to the removal of aliens described in the priorities set forth above, commensurate with the level of prioritization identified. As The Washington Post reported in a superb story last week, the Department of Homeland Security is rapidly retreating from deporting law-abiding undocumented immigrants from the nations interior. We are making it clear that we should not expend our limited resources on deporting those who have been here for years, have committed no serious crimes and have, in effect, become integrated members of our society, DHS Secretary Jeh Johnson told an audience at Rice University last month. These people are here, they live among us, and they are not going away. The southern border is still relatively secure more so than at any time in history. But Johnsons integration language marks a new era. According to the Post, the administration is on track to deport almost half as many people 229,000 this year as in 2012. The immigration security bureaucracy is notoriously independent-minded; agents in the field may not be as lenient with settled immigrants as their bosses in Washington would like. But Obama has clearly given up on both legislation and Republicans, and the president who was once called deporter in chief by immigration activists appears to have had enough of deportations too. Those who cross the border and are caught will still be sent back. But the typical undocumented immigrant has been living in the U.S. for a decade or more. Obama seems intent on making it as easy as possible for those immigrants to stay. Donald Trumps squawking on Mexicans roiled the Republican presidential field in late June and dominated the news. It took a while for leading candidates, including the most pro-immigration voices in the field, Jeb Bush and Marco Rubio, to repudiate Trump. (Wisconsin Gov. Scott Walker, whose inability to nail down an immigration stance has become comical, never quite got there.), The 2016 Republican nominee for president will almost certainly not make a fuss about deportation policy, regardless of past positions. In all likelihood, facing a difficult road with Hispanic and Asian voters, he will support legalization of long-settled undocumented immigrants. Citizenship remains an unsettled question. But the era of deportation is coming to an end. Bloomberg, Francis Wilkinson writes on politics and domestic policy for Bloomberg View.]", "Date": "20150709", "Author": "[Francis Wilkinson]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-immigrant-deportation-border-security-20150709-story.html", "Title": "[The end of the deportation era has arrived]"}