{"Content": "[On the same day that state Rep. Ed Sullivan Jr. said that he wont seek reelection in 2016, two candidates lined up to replace him. \"The time has come for me to return to private life at the end of my current term and move on to different adventures,\" Sullivan, a Mundelein Republican, said in a statement Monday. Sullivan, who came to statewide attention in 2013 when he became the first House Republican to back gay marriage, also said that a diagnosis of type II diabetes led to his decision to step aside, and allow for \"new voices in Springfield.\", Lake Barrington resident Nick Sauer, who describes himself as a conservative Republican, said Monday that he will run to succeed Sullivan. Hes a member of the Lake County Board and a Lake County Forest Preserve commissioner. And Gov. Bruce Rauner recently appointed Sauer as a director of the Illinois Tollway Board. \"So the governor is in my corner, and Im excited about his ideas for reform [that] he has advocated,\" Sauer said. He argued that the governors \"Turnaround\" program is initiating ways to expand and develop business in the state and to balance the budget. \"The program has plans for driving Illinois and [making] it the number one state in the Midwest region again,\" he said. As a Lake County Board member, Sauer said he has sent residents emails two to three times a week on his decisions regarding county issues. He pledged to do the same if voters send him to Springfield. Dan McConchie of Hawthorn Woods also announced his bid Monday for the District 51 seat, which includes all or parts of that village, as well as Barrington, Deer Park, Green Oaks, Kildeer, Lake Zurich, Libertyville, Long Grove, Mundelein and Vernon Hills. McConchie is a 20-year resident of Lake and northern Cook counties, and said he was running for public office because of poor representation in Springfield. \"I come from a background of doing state legislative work for a nonprofit Americans United for Life. I recognize I have something to contribute with my strategic problem solving in Springfield,\" said McConchie, who is Americans United for Lifes vice president for government affairs. \"Were broke and people are leaving our state because we have a spending problem, not a tax problem.\", McConchie also said he has been responsible for both an organizations budget and its payroll \"so I know what local families and small business owners face everyday under our expensive, dysfunctional state government.\", Sauers campaign received an immediate endorsement from Lake County Board Chairman Aaron Lawlor. \"Nick Sauer is a real leader and we have benefited from his strong voice and common sense approach on the Lake County Board. He will make a great State Representative for District 51,\" Lawlor said in a statement. Sauer was a board trustee for Barrington School District 220 from 2009 to 2012, and he graduated from Barrington High School in 2001. Sauer is a member of Willow Creek Community Church in South Barrington, hes chairman of the Cuba Township Republicans and he is involved with the Lions Club, Royal Family Kids Camps, as well as Citizens for Conservation. He received a bachelors degree from the University of Denver and is obtaining a masters degree from Northwestern University. McConchie serves on the public works committee for the village of Hawthorn Woods and sits on the board of directors of Informed Choices Pregnancy and Parenting in Grayslake and Crystal Lake. He holds a degree in biblical studies from Central Bible College in Springfield, Mo. and a masters degree in Christian thought from Trinity Evangelical Divinity School in Deerfield. The primary election for the office is March 15, 2016. tshields@pioneerlocal.com, Twitter: @tshields19]", "Date": "20150826", "Author": "[Todd Shields]", "Link": "http://www.chicagotribune.com/suburbs/barrington/news/ct-bcr-ed-sullivan-leaves-house-tl-0827-20150824-story.html", "Title": "[Sullivan to step aside as state representative; two candidates announce bid]"}