{"Content": "[As the war for Illinois future raged on lastweek, Gov. Bruce Rauner launched a skirmish to embarrass legislators whove taken very good care of themselves. \"Speaker Madigan and the legislators he controls will leave town without a responsible, balanced budget and without any reforms while taking a pay raise for themselves,\" began the communique from Rauners office. \"Thats unfair to taxpayers and the people they represent. It is time to stop protecting the political class at the expense of the middle class.\", Maybe it was the jab about cheating \"the middle class,\" certain Illinois Democrats robotic mantra, along with \"extreme\" and \"moderation.\" But Rauners expose of inconvenient truth got under the parchment-thin skin of the potentate Rauner had outed, House Speaker Michael Madigan. \"Im not going to spend a lot of time on that question,\" Madigan told reporters. Really? Im not going to spend a lot of time on that question. Do not think us rude (or, heaven forfend, \"extreme\"), Mr. Madigan, but we will spend time on that question. Your whole enterprise of majority legislators protecting the perquisites of their power even as people who rely on state services wonder what happens to them deserves much more July sunlight. In terms of total state spending, Illinois legislators pay isnt remarkable (although the Ballotpedia website says theyre the fifth-best-paid nationwide). But the raw hubris Rauner keeps exposing We live to serve politicians, oh, and lawyers too that is remarkable:, Recall that, after then-Gov. Pat Quinn tried to block legislators pay, they huffed and puffed and changed state law so that indignity wouldnt recur: No matter what ails state government, their pay essentially is as guaranteed as payments to bondholders. On Friday we learned of another Madigan shenanigan. The Tribunes Ray Long reported that, even as other grants from Springfield have been frozen, a $35 million grant will help build a new school in Madigans Chicago district. The online headline: \"Money flows to Madigan district while state dollars tight.\", Such tricks may not charm voters who last week got a taste, but only a taste, of how the debt-dripping reign of Madigan & Co. will cost them. The Cook County Boards vote to raise the sales tax ostensibly will pay for that governments underfunded pensions. These exorbitant debts will tempt how many governments statewide, the deadbeat one in Springfield included, to raise taxes?, Most Cook commissioners at least didnt try to blame all their financial problems on a recession that ended more than six years ago. As several of them admitted, the blame goes to politicians who serially spent, or promised, money they didnt have. Same for governments across this state, none more flagrant than the one where Madigan took office on Jan. 13, 1971. If Madigan and Senate President John Cullerton (Jan. 10, 1979) conscientiously accepted responsibility for the ruination thats occurred on their watch, we missed it. Madigan, frantic to thwart Rauners reforms, instead retreats to shopworn theatrics about the dangers of the delay in passing a budget. You get the impression, from the publics lack of alarm thus far, that many citizens see right through Madigan. He digs in deeper, he offers no compromises, he just resists changes to an Illinois system that has trashed public finances and chased off employers while leaving him flush with clout. You would not know from Madigans brittle comportment that he advanced so many of the pension sweetener laws that have left Illinois governments helpless to meet their runaway obligations. When citizens ask why services are being cut, tell them: Madigan and his enablers in the legislature are the reason. You also get the impression, watching Madigan, that he doesnt know what to do about Rauner. Never has Madigan had to confront a governor with the resources, the patience and the sheer will to challenge his autocracy. Madigans sniping at the governor essentially, This isnt how we do things in Springfield, so capitulate! falls on fallow ground. We dont see either man caving soon. We do, though, hear from Illinoisans who dont want to pay higher taxes until legislators accept reforms that Rauner and the voters who elected him demand. Every time a politician in this state talks about raising taxes, at any level of government, those voters get a gut-punch reminder of how Madigan & Co. have squandered taxpayers dollars. Voters elected Rauner because they finally realized that a broke and broken Illinois couldnt provide adequate services to their fellow citizens, let alone cultivate the economic climate more growth, jobs and resulting tax revenue to pay for our plundered public sector. Illinois is mired in slow growth in large part because other states boast reforms that Madigan stubbornly rejects. Never forget that as the war for Illinois future raged, one field general didnt want to talk about his states political definition of self-service: Im not going to spend a lot of time on that question. Thank you, Mr. Speaker. May your members enjoy their paychecks as you refuse to write a balanced budget, as you refuse to accept term limits and other fixes. Youve shown all of us your priorities. Self-serving? Extremely. Follow theTribune Editorial Boardon Twitter@Trib_ed_boardandFacebook]", "Date": "20150717", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-madigan-rauner-illinois-edit-0719-20150717-story.html", "Title": "[Thank you, Mr. Madigan, for flaunting 'self-service']"}