{"Content": "[Two massive attacks in Kabul on Friday, one near a government and military complex in a residential area and the other a suicide bombing outside a police academy, killed at least 35 people, sending the strongest message yet to Afghan President Ashraf Ghani that militants are still able to strike at his heavily fortified seat of power. No one claimed responsibility for the attacks, though officials indicated they blamed the Taliban. The implications of the assaults, however, undermine claims by security services and the government that the capital is immune from devastating attacks. They also pose a major challenge to Ghani, who has made the peace process with the Taliban the hallmark of his presidency since taking office last year. Afghanistans government says at least 15 people were killed by a truck bomb explosion at an army compound in Kabul, the first attack since the Talibans new leader was announced. (Reuters), Afghanistans government says at least 15 people were killed by a truck bomb explosion at an army compound in Kabul, the first attack since the Talibans new leader was announced. (Reuters), In the evening hours, a suicide bomber dressed in a police uniform struck outside the gates of a police academy in Kabul, killing at least 20 recruits and wounding 24, Afghan officials said. The attacker walked into a group of recruits waiting outside the academy and detonated his explosives-laden vest, said a police officer, who goes by the name of Mabubullah. Many Afghans use only one name. A security official, who spoke on condition of anonymity because he was not authorized to talk to reporters, said there were at least 24 wounded among the recruits. Later on Friday evening, insurgents launched an attack on a NATO military base near Kabuls international airport, according to the coalition spokesman, Col. Brian Tribus. Two insurgents were killed in the assault, he added, without giving further details. No one claimed responsibility for that attack and it was not immediately clear if there was any damage to the NATO base. Earlier in the day, a massive truck bomb killed at least 15 people in a residential area of Kabul. That 1 a.m. blast flattened an entire city block and also wounded 240 people, officials said. It was one of the largest ever in Kabul a city of 4.5 million people in terms of scale, flattening a city block and leaving a 10-meter (30-foot) crater in the ground. The presidents office said 47 women and 33 children were among the casualties in that attack. The presidents deputy spokesman, Zafar Hashemi, said about 40 of the wounded would remain hospitalized. It was unknown how the attackers smuggled a large amount of explosives into the heavily guarded city. Ghani threatened a rapid and forceful response to the bombing, saying it was aimed at diverting public attention from the Talibans leadership struggle. Last week, Afghan authorities announced the death Mullah Mohammad Omar, the one-eyed, secretive head of the Taliban who hosted Osama Bin Ladens al-Qaida in the years leading up to the Sept. 11, 2001, attacks. Mullah Omar had not been seen in public since fleeing over the border into Pakistan after the 2001 U.S.-led invasion that ousted the Taliban. The Afghan intelligence agency said Mullah Omar had been dead for more than two years. The Taliban leadership confirmed his death and even appointed a successor but the revelation still sparked a leadership struggle among senior Taliban figures, raising concerns of a succession crisis that could splinter the group. Pakistan, which wields significant influence over the insurgent group and which hosted the first round of landmark Afghan-Taliban peace talks last month, denied that Mullah Omar had died in Karachi. Pakistans defense minister, Khawaja Muhammad Asif, repeated that denial in parliament on Friday. The peace talks were indefinitely postponed following the announcement of Mullah Omars death. Ghani, freshly returned from medical treatment in Germany, visited the wounded from the early Friday attack in hospital as social media carried calls for blood donations, \"We are still committed to peace. But we will respond to these sort of terrorist attacks with force and power,\" Ghani said in a statement, condemning the high civilian casualty count. Zafar Hashemi, the presidents deputy spokesman, blamed the Taliban and said the attackers aimed to \"hide the cracks between their own factions and create terror.\", At a White House briefing Friday, press secretary Josh Earnest said the U.S. \"condemns in the strongest terms\" the bombing in Kabul. \"This heinous attack demonstrates once again the ever-growing gulf between extremists and the people of Afghanistan and it certainly shows the blatant disregard for human life on the part of those extremists,\" Earnest said, adding that the Afghan people have endured much but remain resilient \"even in the face of a brutal insurgency.\", The Obama administration continues to urge the Taliban to heed Ghanis call for reconciliation and make peace with the government, Earnest also said. The appointment of Mullah Omars deputy, Mullah Akhtar Mansoor, to succeed him sparked protests from his brother and son, and appears to have led to serious rifts that internal committees are now trying to heal. An Afghan security official speaking on condition of anonymity as he was not authorized to give information to the media said the Taliban had split into four factions, all with powerful political credentials and substantial armed followings. He said that agents of Pakistans ISI intelligence agency believed to have sheltered the Taliban leadership since their regime was overthrown in a U.S.-led invasion in 2001 were in Quetta to help the Taliban resolve the crisis. Mullah Akhtar is believed to have led the group into informal and formal peace talks at the behest of Islamabad. Other contenders for the leadership might not be so open to a dialogue with the Afghan government, possibly believing that apparent success on the battlefield this year puts victory within sight. \"The peace talks are on ice for the moment until the Taliban can come up with a coherent political voice,\" said Graeme Smith, Afghanistan analyst with the International Crisis Group. \"The Afghan government has no choice but to wait for the leadership crisis to be resolved. There is no one to talk to right now. Peace negotiators need someone to talk to,\" he said. Associated Press]", "Date": "20150807", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-kabul-blast-20150807-story.html", "Title": "[Kabul blasts kill at least 35, test Afghan president's peace plan]"}