{"Content": "[Some may be trying to discredit Democratic presidential candidate Sen. Bernie Sanders chances of garnering the party nomination, but several people in Northwest Indiana not only disagree but are fighting back. Supporters of the New Hampshire independent senator gathered Sunday at Beer Geeks in Highland to coordinate a letter-writing campaign espousing his message to local media outlets. With that number of people, they were able to bank enough letters to blanket the area through November, coordinator Tonya Johnson said. Johnson, of Griffith, said the group first discussed the issues they thought best represented the areas needs, then determined which outlets each would target and when. Then they divided up the weeks that each issue would hit. \"We put our best writers on the union topic, then we have others on the topic of free tuition,\" Johnson, of Griffith, said. Deepak Ariga, a physican who lives in Munster, said hes tackling universal healthcare in his letters. \"Say what you want, but Medicare works,\" Ariga said. \"And Sanders is his own man\", Sanders has also been at least an indirect supporter of prevailing wage, often slipping that requirement into bills being considered by the U.S. Senate, Johnson said, so thats another on the list of topics for Northwest Indiana. Dissolving the free-trade agreement with China and the states removing 60,000 people off food stamps are, too. The group will not, however, be touching national topics, such as Planned Parenthood or the senators support of the universal $15 minimum wage, Johnson said. \"Most (Sanders supporters) support raising the minimum wage, but not all of us agree that it should be raised to $15 immediately,\" she said. \"I received an email directly from Sanders campaign, and they recommend to break down his main talking points and determine how theyll resonate with people.\", Johnson, whod never been inspired to work directly on a presidential campaign before Sanders, and the group understand the he has a long road ahead of him. But Sanders has learned to harness the one medium many have yet to: the Internet. \"If 2008 was the start of the Internets role in electing the next president, 2016 is going to be even bigger,\" Johnson said. \"He doesnt have the name recognition or the corporate backing, but once people hear his message, it really resonates. They especially appreciate that all his money is by direct donations; when they hear that, they say, Give this guy a chance.\", Michelle L. Quinn is a freelancer reporter for the Post-Tribune. Learn more:, Those interested in joining the Letter Warriors for Bernie letter-writing campaign should log on to https://www.facebook.com/groups/1610891962507396/.]", "Date": "20150831", "Author": "[Michelle L. Quinn]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-bernie-letter-st-0901-20150831-story.html", "Title": "[Pro-Sanders Dems gather to jump into local political discourse]"}