{"Content": "[Senate Democratic Leader Harry Reid, the wily Nevadan who dominated the Senate for a decade from the minority to the majority and back again, announced Friday he will retire after five terms. Three-term New York Sen. Chuck Schumer faces a relatively clear path to replace him as the next Democratic leader. Reid endorsed the No. 3 Senate Democrat, and Dick Durbin of Illinois, the current No. 2, told Schumer Thursday night he had his support, according to a spokesman. Durbin plans to run again for the job of Democratic whip. The White House reacted to news on Friday (March 27) that U.S. Senate Democratic Leader Harry Reid will retire next year. (Reuters), The White House reacted to news on Friday (March 27) that U.S. Senate Democratic Leader Harry Reid will retire next year. (Reuters), \"I think its very important to have continuity in our leadership,\" Reid told KNPR radio in Nevada about backing Schumer. Reid, 75, who shepherded key Obama administration initiatives including the presidents health care law, lost his role as majority leader the Senates top job when Novembers elections swept the Republicans into control. He suffered a personal setback on New Years Day, falling while exercising and suffering serious bruises and a lasting injury to his right eye. Reid was the Republicans top target in 2016 and widely considered vulnerable to losing the seat hed held since 1987. Still, the stubborn gold miners son had cheated political death before, and few were writing him off. In a statement early Friday, Reid said the recovery period from his eye injury, which may leave him with permanent vision loss, gave him time to think about his political future. \"We have to make sure that the Democrats take control of the Senate again,\" he said. \"And I feel it is inappropriate for me to soak up all those resources on me when I could be devoting those resources to the caucus, and thats what I intend to do.\", Reid, who rose from nothing in the tiny desert town of Searchlight, Nevada, had grown more unpopular at home due to positions hed taken on national issues. He turned back a challenge in 2010 and was sure to face an aggressive, big-money attack by Republicans if he ran again. President Barack Obama issued a statement that said Reid \"has become not only an ally, but a friend.\", In a surprise, Obama called in to the radio show, chatting with Reid about their years together pushing legislation, fighting the Great Recession and overhauling the nations health care system. Said Obama, \"Weve had a great run.\", As Democratic leader, Reid thrived on behind-the-scenes wrangling. He guided the Senate through a crippling recession and the GOP takeover of the House in the 2010 elections, which sparked years of bitter partisan battles and congressional gridlock. He was known for frequent gaffes and impolitic remarks, once complaining that tourists to the Capitol smelled, and calling former President George W. Bush a \"loser\" and a \"liar.\", Since returning to work after his fall, Reid has struggled to regain sight in his right eye, appearing in the Capitol in bandages and then with his eye shielded by tinted glasses. He told The Associated Press early this month that the injury was \"a tremendous inconvenience,\" but nothing more, and not enough to stop him from seeking re-election. \"Ive had black eyes before,\" said Reid, who was an accomplished amateur boxer in his youth. Even from his post in the minority, Reid leveraged Senate rules to exert steely control. He held his 46-member caucus together against attempts by Republicans to pass legislation undoing Obamas executive actions on immigration, forcing Senate Majority Leader Mitch McConnell to back down, and House Speaker John Boehner to follow. The episode left some House Republicans complaining bitterly that Reid might as well still be majority leader. In classic fashion, Reid could not resist needling McConnell, with whom he had an icy relationship, as he disclosed his departure. \"My friend Sen. McConnell, dont be too elated. Im going to be here for 22 months,\" Reid said in a video he filmed to announce his retirement. McConnell was gracious in his comments on Reids retirement. \"Nothing has ever come easily to this son of Searchlight,\" the GOP senator said in a statement. \"Underestimated often, his distinctive grit and determined focus nevertheless saw him through many challenges. They continue to make him a formidable opponent today.\", Reid insisted that his decision had nothing to do with his injury or his re-election chances, saying \"the path to re-election is much easier than it probably has been anytime that Ive run for re-election.\", Republicans would surely have disagreed, but the implacable self-confidence was typical of Reid. He survived re-election in 1998 by only 428 votes, and won in 2010 after meddling in the GOP primary to weaken the establishment candidate so that he ended up running against a tea-party backed Republican with some extreme positions. Reid has built a formidable Democratic machine in Nevada, working to move up the states caucuses so that it plays a significant role in the presidential nominating contest, and in the process registering droves of Democratic voters in the swing state. Reid also endorsed former Nevada attorney general Catherine Cortez Masto to run for his seat next year. That should make her a solid contender for the Democratic nomination. On the Republican side, Gov. Brian Sandoval has been encouraged to run but has said he intends to serve out his full term as governor. Other possibilities are Rep. Joe Heck and former Lt. Gov. Brian Krolicki. Associated Press]", "Date": "20150327", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/nationworld/chi-harry-reid-retires-20150327-story.html", "Title": "[Harry Reid to retire; Durbin backs Schumer to lead Democrats in Senate]"}