{"Content": "[Jeb Bushs deep dive into corporate America, where he served on the boards or as an adviser to more than a dozen companies, could trigger complications for him if he wins the White House. Companies that paid Bush as a board member or adviser regularly hire lobbyists to press issues in Washington before federal agencies, Congress and the White House. Others have been fined by U.S. agencies, such as the Environmental Protection Agency, or faced inquiries from the Securities and Exchange Commission. Some are expected to conduct business beyond November 2016 that will be directly affected by U.S. government decisions. That nexus raises thorny questions for Bush if he wins the Republican nomination and the presidency: How would he respond when one of the companies that paid him seeks favorable treatment or undergoes scrutiny from the federal government?, That potential entanglement could hamper any presidential candidate with a history in corporate America, such as Democrat Hillary Rodham Clinton, the former secretary of state whose family foundation received big-money support from corporate interests. \"Anytime you have these kinds of entanglements, theres certainly the potential for conflict,\" said Dale Eisman, a spokesman for Common Cause. Unlike lower-ranking employees, a president cant effectively recuse himself and pass on a decision to a more neutral supervisor. Bush began shedding his corporate ties late last year to prepare his run for president. Potential conflicts of interest involve federal interactions with companies that paid him millions. Beyond his own companies and educational foundations, Bush was a board member or adviser to at least 15 companies and nonprofits after leaving the Florida governors office early in 2007, an AP review found. At least seven of those companies lobbied the federal government in recent years an effort likely to continue over a range of issues, such as health care and corporate taxes. Bush spokesman Tim Miller said Bush wont play favorites. \"If Jeb is successful in his campaign, special interests are going to find his administration to be unwelcome territory because hes going to clean out the broken tax and regulatory system,\" Miller said. The companies Bush formerly advised frequently appear before regulatory agencies. Take, for instance, Dallas-based Tenet Healthcare, where Bush served on the board of directors for eight years through 2014, earning nearly $2.4 million in compensation. In the past two years, Tenet has hired lobbyists to represent its interests on dozens of issues in Washington, including the congressional budget, Medicares reauthorization and the Hospital Payment Fairness Act. Tenet has benefited from President Barack Obamas health care law, with the companys CEO saying last year that an increase of newly insured people led to an uptick in admissions to its hospitals. Republicans, including Bush, have chided \"Obamacare,\" raising the specter that a GOP White House victory could lead to a legislative imbroglio and trigger a massive lobbying effort from industry. Tenets lobbying goes well beyond one issue. Since 2014, the company put its lobbyists to work before 10 different federal agencies and offices. Another example is Rayonier Inc. a publicly traded Florida timber company where Bush served on the board of directors from 2008 to 2014 and earned nearly $1 million in total compensation. This year, Rayonier has hired lobbyists on federal issues involving taxation of timberland, an international trade dispute involving U.S. pulp production and the tax treatment of timber real estate investment trusts. In November, with Bush on the board, the SEC subpoenaed Rayonier over its public filings; the company said it is cooperating with the agency, which is led by a presidential appointee. Rayonier spokesman Mike Bell said any candidate seeking to rise to national prominence would naturally bring \"a body of knowledge, background associations and affiliations with business and nonprofits.\", Rayonier wont stop lobbying in Washington and Bell said he does not believe the connection would be troublesome. \"I am confident that Governor Bush knows when to recuse himself,\" he said. Another potential connection involves the Barrick Gold Corp. where Bush served on the international advisory board from 2011 to 2013. In the last two years, Barrick lobbyists pressed issues with the Senate, House, Army Corps of Engineers, Treasury and EPA. Barrick has been fined by the EPA, an agency also led by a presidential appointee. Andy Lloyd, a Barrick spokesman, said the company complies with lobbying regulations in every country it serves, \"and we will continue to do so.\", Associated Press]", "Date": "20150618", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-jeb-bush-board-roles-20150618-story.html", "Title": "[ As president, Jeb Bush would face entanglements from board roles ]"}