{"Content": "[Chicago police have confirmed a criminal investigation has been opened into a parish priest who was removed from ministry by the Chicago Archdiocese after it said materials were found on a computer in his possession. The confirmation from police spokesman Anthony Guglielmi came after the diocese disclosed Monday on its website that the Rev. Octavio Munoz Capetillo had been removed as pastor of St. Pancratius Church on Chicagos Southwest Side. \"Given the nature of the material, we reported our concerns to the civil authorities and will cooperate fully in their investigation,\" the archdiocese said in a statement. \"In the interim, Archbishop (Blase) Cupich has withdrawn Father Munozs ... authority to minister.\", Munoz, who was removed from ministry July 27, will liveaway from St. Pancratius until the matter is resolved, the archdiocese said. A temporary administrator will be appointed to assume his duties at the parish. Until his recent appointment at the church, Munoz had been director of Casa Jesus, a renowned archdiocese training program for Latin American men who aspire to become priests. From 2008 to 2015, Munoz, a native of Mexico, sought candidates for the priesthood from Mexico, Colombia, Ecuador and other Latin American countries in hopes of recruiting clergy who more accurately reflect the church in Chicago. Munoz, who was ordained in 2004, was first assigned to St. Agnes Catholic Church in Chicago Heights. Parishioners at St. Pancratius found out about Munozs removal during Mass on Sunday. In the statement, the archdiocese said it is \"committed to ensuring those serving our parishioners are fit for ministry.\", \"Archbishop Cupich offers his assurance of prayers and solidarity with the community at St. Pancratius, knowing that this development is unsettling, and he pledges to provide updates on this situation as they become available,\" the statement said. mbrachear@tribpub.com, jgorner@tribpub.com, Twitter @TribSeeker, Twitter @JeremyGorner]", "Date": "20150804", "Author": "[Manya Brachear Pashman, Jeremy Gorner]", "Link": "http://www.chicagotribune.com/news/ct-chicago-archdiocese-priest-removed-met-20150803-story.html", "Title": "[Chicago police investigate priest pulled from ministry over items on computer]"}