{"Content": "[When 20 schoolchildren, mostly first-graders, were shot to death at Sandy Hook Elementary School on Dec. 14, 2012, the nation renewed a fierce debate over gun laws. The slaughter of children, many of whom hid under desks and in closets to avoid a mad gunman stalking their hallways, seemed the tipping point for a sincere re-examination of state and federal gun laws. President Barack Obama proposed a broad agenda on firearms. But it was narrowed to legislation that would expand the requirements for criminal background checks of gun-buyers. As parents of Sandy Hook victims watched from the Senate gallery, even that legislation was blocked. Only four Republicans, including Sen. Mark Kirk of Illinois, supported it. Friends and family of 7-year-old Amari Brown hold a candlelight vigil at the home of his mom,Amber Hailey, on July 5, 2015. Amaridied after being shot the previous night. (Brian Nguyen, Chicago Tribune), Friends and family of 7-year-old Amari Brown hold a candlelight vigil at the home of his mom,Amber Hailey, on July 5, 2015. Amaridied after being shot the previous night. (Brian Nguyen, Chicago Tribune), The racially motivated murder of nine churchgoers in South Carolina last month has barely revived the gun debate. Democratic Sen. Joe Manchin of West Virginia and Republican Sen. Pat Toomey of Pennsylvania, who sponsored the background check bill in 2013, have expressed mild interest in pushing it again. Republicans now control the Senate. This past holiday weekend in Chicago, at least 55 people were wounded and 10 people were killed in shootings, including 7-year-old Amari Brown. Another summer weekend in Chicago. On last years Fourth of July holiday in Chicago, 16were killed and 82 wounded. The circumstances behind these tragedies are different mental illness, racial hatred, apparent gang retribution. They have one thing in common: death by firearm. A 7-year-old. A 7-year-old! Police say Amari Browns father was the target, and that he is a gang member with a long arrest record. If, when, a killer is identified, Chicagos likely to have another debate about how serious we are in prosecuting career violent offenders, in disrupting the cycle of gang violence. From Sandy Hook to Charleston to a weekend in Chicago. There are plenty of causes, plenty of responses. We want to focus for a moment on one. Its time to revive that legislation the U.S. Senate failed to approve in 2013. Federally licensed gun dealers are required by law to conduct background checks on buyers before making a sale. The legislation would have expanded the requirement to buyers at private sales and gun shows, which are often the preferred shopping venue for people who cannot pass a background check. The measure exempted most sales between friends and family. \"To me, its a no-brainer,\" Chicago police Superintendent Garry McCarthy told us in 2013, when the tragedy at Sandy Hook nearly propelled Congress to act. \"We should have background checks on every person who buys a gun to prevent criminals, terrorists or, where appropriate, mentally ill people from getting guns. It would stop criminals from buying guns at gun shows. It would help prevent illegal guns from getting into the hands of criminals.\", Police chiefs want universal background checks. Polls show overwhelming public support. Guns flow into Chicago from states with less restrictive rules on sales, such as Indiana. A 2013 federal gun trafficking case detailed how a straw purchaser bought 43 firearms in a 26-hour period from Indiana gun shows and shops, without question. He brought the guns to Chicago and sold them to ... an undercover law enforcement official. Go ahead and read that again: He bought 43 firearms in 26 hours. A national standard for background checks could have made a difference in a case such as that. But the last serious effort on background checks failed in the U.S. Senate, even with grieving Sandy Hook parents looking on. And the killing goes on. Follow theTribune Editorial Boardon Twitter@Trib_ed_boardandFacebook]", "Date": "20150706", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-gun-murder-background-check-edit-20150706-story.html", "Title": "[From Sandy Hook to Charleston to Chicago]"}