{"Content": "[Illinois Senate President John Cullerton spent an hour with the Tribune Editorial Board on Wednesday. There were no injuries. Cullerton came with an agenda more on that in a minute and endured our questions on other matters. Not once did he use the word \"extreme\" to describe Gov. Bruce Rauner. We really ought to get together more often. Some of what we heard was encouraging. Cullerton pitched a bill that lays the groundwork to rescue Chicago Public Schools. Borrowing elements from plans pushed by Rauner, Senate Democrats and Mayor Rahm Emanuel, it would revamp the states school funding formula and ease the pressure on CPS pensions while freezing property taxes across the state for two years. The Chicago Teachers Union isnt buying it. Neither is Rauner. Last week, Democrats loyal to House Speaker Mike Madigan sided with Republicans to defeat the bill in the Senate. No, theres not a lot of trust in Springfield these days. But we do see in this the kind of mix that could lead to an eventual agreement. Credit Cullerton for cobbling it together, and for continuing to push it despite zero encouragement from Madigan. That was the happy part of our meeting. The rest suggested it will be weeks, maybe months, before the governor and Democratic leaders come to terms on a state budget. Cullerton offered few hints of concession toward Rauners fundamental message: If Illinois is going to raise taxes on its citizens it has to reduce the structural cost of government and improve the economic climate of the state. Rauner wants to give local governments more flexibility on what matters are subject to collective bargaining Cullerton suggested thats a non-starter. Rauner wants to curb venue shopping for friendly courts in the civil justice system no dice with Cullerton. If theres room to deal, he suggested, it might come in modest changes to the workers compensation system and prevailing wage laws. The changes Rauner seeks wed argue theyre business-friendly, taxpayer-friendly, citizen-friendly are geared toward shaking a moribund status quo here that has consigned Illinois to be an economic also-ran. But Cullerton says he doesnt believe the states economic climate is as bad as Rauner thinks it is. The governors agenda, Cullerton says, is just \"the wish list of the business community that supported him.\", At the same time, there is just one item on the wish list of trial lawyers and public employee unions: Stop Rauner. And so we hit one month without a state budget, with no sign of movement on a resolution, as social service providers and their employees grow more nervous that the state will stiff them. Whats it going to take?, Rauner has other agenda items. We wish Cullerton was thinking as creatively about, oh, empowering citizens, as he is about school funding. He could accede to Rauners simple ask that the House and Senate leaders promise to bring two constitutional amendments to votes in their chambers. One calls for an independent commission, not the General Assembly, to redraw legislative boundaries every 10 years. The other would set term limits for lawmakers and statewide officeholders. Cullerton says its traditional for lawmakers to consider constitutional amendments in the second year of a legislative term. He told us candidly that a term limits amendment would pass if put to a vote of the public but he doesnt consider that a mandate to put it on the ballot. Truth is, the governor and House and Senate leaders could agree tomorrow on how to close a $4 billion gap in the budget approved by lawmakers and vetoed by Rauner. Rauner has said hes open to the Democrats demands for more tax revenue. We trust it wouldnt be $4 billion more in tax revenue. And we trust the governor will stick to his insistence that any tax hike be matched with a fundamental change in the cost of government and a spur to the state economy. Thats the essential point: Illinois can grow its way to prosperity, but it cant tax its way there. We take it as a good sign that Cullerton is trying to find agreement, at least on how to fund schools. He does seem to want to create some distance, at least in style, between himself and Madigan, who is locked in a glare-off with the governor. Madigans chief contribution to all this has been his weekly clenched-fist news conference. (Home of the famous quote: \"Im not going to spend a lot of time on that question.\"), If theres a Plan B, Mr. Speaker, wed sure like to hear it. Our doors open.]", "Date": "20150729", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-cullerton-budget-schools-edit-0730-20150729-story.html", "Title": "[President Cullerton comes to call]"}