{"Content": "[The Democrat-controlled General Assembly could take its first political shot at Republican Gov.-elect Bruce Rauner Thursday as lawmakers return to Springfield to act on a measure that would require a special election to fill part of a four-year term left vacant after the death of Comptroller Judy Baar Topinka. Approving the change would have the effect of limiting Rauners pick to replace Topinka to just two years in office instead of four, as voters would get to choose a new comptroller during the next statewide election in 2016. On Monday, Rauner announced he would appoint former corporate executive Leslie Munger of Lincolnshire to the post. Quinn first issued a proclamation last month calling lawmakers back to Springfield for a special session to fill the comptroller spot. But on Wednesday, Senate President John Cullerton and House Speaker Michael Madigan issued their own order requiring lawmakers to take up a broader proposal that would require a special election to fill a vacancy for any statewide constitutional office. Democrats argue the move is about ensuring that voters get a say in filling such a vacancy. Republicans are opposed to the idea and contend its not a coincidence that 2016 is a presidential election year, when Democrats in Illinois historically perform better at the ballot box. I think democracy is always better when the people call the shots, when the people are in charge, Quinn said Tuesday during a speech before the City Club of Chicago. When it comes to election of statewide officials, whatever the office might be, whether its comptroller or attorney general or secretary of state, you know, I think if theres a vacancy, that it should be filled as soon as possible by the voting people. Under legislation introduced by Cullerton, if a statewide constitutional office becomes vacant with more than 28 months remaining in the term, a special election to fill the spot would be held during the next statewide election. House Majority Leader Barbara Flynn Currie called it a straightforward proposal and a no-brainer that wouldnt cost the state any additional money since a special election would be held when voters already were scheduled to head to the polls. Rauner has said the Illinois Constitution gives him the power to make a four-year appointment and suggested that any attempts to undermine that might result in legal action. Republican legislative leaders argue that lawmakers instead should focus on getting an amendment on the 2016 ballot that would consolidate the comptroller and treasurers offices. Gov.-elect Rauner will be sworn into office in just a few days, and Democrats are already planning to strip away his constitutionally mandated executive authority.Not only is the action planned for tomorrow unconstitutional, its nothing short of a power grab by the Democratic majority in a lame-duck session,\" said House Republican leader Jim Durkin of Western Springs. \"Lets not repeat the failures of the past. Work with this incoming governor rather than work against him. Democratic Rep. Lou Lang dismissed the notion that it was a power grab by Democrats, saying the drafters of the state constitution didnt intend for a governor to have the ability to appoint someone to a full four-year term. We have a unique situation here. This is not a situation where there are two years left on a term, three years left on a term, this is an entire term, said Lang, of Skokie. I dont think the constitution contemplated that wed have a situation where the governor got to appoint someone for the entirety of a term. One question is whether lawmakers, including those of the lame-duck variety, will travel to Springfield in extremely cold weather to take the vote. Meanwhile, Quinn has declined to say whether hed use lawmakers return to the Capitol to make a last-minute effort to raise the states minimum wage, which fizzled during the fall. While the Senate approved a proposal that would hike the states $8.25 hourly rate to $11 by 2019, there wasnt enough support in the House. Madigans top deputies said Tuesday that theres little indication that has changed. mcgarcia@tribpub.comrlong@tribpub.com]", "Date": "20150108", "Author": "[Monique Garcia, Ray Long]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-democrats-could-thwart-rauner-on-special-election-for-comptroller-20150107-story.html", "Title": "[Democrats could thwart Rauner on special election for comptroller]"}