{"Content": "[Guatemalas Congress lifted President Otto Perez Molinas immunity of office on Tuesday, opening him up to possible prosecution in a widening customs corruption scandal that has rocked his administration and the countrys political system. With all 132 lawmakers present in the 158-seat assembly voting to approve the historic measure, prosecutors are now free to file criminal charges against Perez Molina just like any other citizen, and a judge would be able to order his detention. The congressional vote does not remove the president from office, but a judge later granted an order barring him from traveling outside the country. \"Guatemala is showing that nobody is above the law, and as a result this is a message for all current and future public servants that our behavior must be subject to the constitution,\" prosecutor Thelma Aldana said at a news conference. About 200 people outside the capitol hugged each other, cheered, waved Guatemalan flags and set off firecrackers as news of the congressional vote reached them, an echo of earlier massive street protests calling for his removal from office. Drivers honked horns, and people recorded the moment with selfies. \"Excellent! It is a step forward for Guatemala,\" said Gerardo Corzo, a 71-year-old retiree. Perez Molina, 64, has said he is innocent of corruption and has vowed to face the legal process against him. \"The president is aware of the new scenario, which was not the most desirable but was very probable,\" his spokesman, Jorge Ortega, told The Associated Press. \"He has said he will be very respectful and submit himself to the rule of law.\", Those voting against Perez Molina included members of his own ruling party. \"The party gave us permission to vote and withdraw the presidents immunity,\" lawmaker Luis Fernandez Chenal said. \"He who owes nothing, fears nothing.\", There was no immediate word on when any charges may be filed against the president, but prosecutors say they have reason to believe he was involved in the customs scheme. Aldana said he is being investigated for possible illicit association, bribery and customs fraud. Uncovered by prosecutors and a U.N. commission probing criminal networks in Guatemala, it involved a ring known as \"La Linea,\" or \"The Line,\" in which businesspeople paid bribes to avoid import duties through the customs agency. The ring is believed to have defrauded the state of millions of dollars. The scandal has already claimed the job of Perez Molinas former Vice President Roxana Baldetti, whose ex-personal secretary was named as the alleged ringleader. Baldetti resigned May 8 and is currently in jail awaiting trial on accusations she took millions of dollars in bribes. A number of Cabinet officials have also left office. An earlier move to strip Perez Molinas immunity that was brought by an opposition lawmaker died in the same Congress. This latest motion was presented by prosecutors and the U.N. commission. Adriana Beltran, a Guatemala analyst at the Washington Office on Latin America, said the investigations and Tuesdays vote send a \"remarkable\" message to Guatemalans about political reform and the rule of law: \"That you can make it work following due process and respecting human rights, and that those that at one point were considered untouchable can be brought to justice.\", Protesters have demanded not only that Perez Molina step down but that Sundays presidential elections be postponed. He says delaying the vote would be against the law. Perez cannot run for re-election and is set to remain in office until a handover in January. Under Guatemalas constitution, the president is immune from prosecution and it requires a two-thirds majority from Congress to strip it. Earlier Tuesday, civilians formed a wall of bodies to let lawmakers into Congress, protecting them from dozens of presidential loyalists who had blocked access to the building since the morning in a bid to delay the proceedings. Interior Department Vice Minister Elmer Sosa had arrived with riot police to \"guarantee the safety of protesters and Congress,\" and lawmakers were finally able to go inside and begin the session. \"It was impressive that the people themselves came and created a human chain and a path so we could enter,\" said opposition legislator Leonel Lira. In the wake of the scandal, major government offices and businesses, the power base in Guatemala, have urged Perez Molina to reconsider his resolve to stay, including the government comptrollers office. Even Guatemalas national Council of Bishops issued a statement urging him to resign. \"This decision demonstrates that the people and their collective actions can get results, but this is just the beginning,\" said activist Byron Garon. \"Now we want him and his vice president to be tried and convicted, and for them to give back to Guatemala all that they stole.\", Associated Press]", "Date": "20150901", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-guatemala-president-20150901-story.html", "Title": "[Guatemalan president's immunity lifted in corruption scandal ]"}