{"Content": "[If only American politics were a movie, then Sen. Mark Kirk could blurt out whatever comes to his mind. The media would be astonished at the honesty. Theyd call it endearing. Soon, Washington would speak a dead language: direct talk. And filmgoers across the land would feel a wave of the warm and fuzzies. But thats the movies. And Sen. Kirk knows this isnt some picture show. Hollywood tried that blurting honestly plot with \"Bulworth\" and it flopped, miserably. By now you know the issue: Kirk just blurts things out, like his already famous \"bro with no ho\" comment. In talking with a colleague, Senator Mark Kirk spoke of unmarried Senate colleague South Carolina Republican Lindsey Graham as a \"bro with no ho.\" (WGN-TV), In talking with a colleague, Senator Mark Kirk spoke of unmarried Senate colleague South Carolina Republican Lindsey Graham as a \"bro with no ho.\" (WGN-TV), He hasnt had much of a filter on what he says in recent years. Whether that has anything to do with the stroke he suffered in 2012, I dont know. It seems he was once more cautious. Now words just pop out of there. Kirks problem is that he has gone and released his inner Joe Biden. Biden, a Democrat, can get away with stupid, weird, even racist comments, since the media treats him more like some crazy uncle. Kirk, however, is a Republican. Hell never get the same break. And now hes hip-deep in Ho-Gate, with no way out except one:, Discreetly step down and let Illinois Republican bosses pick a replacement candidate to run for election in 2016. \"But whos going to tell him?\" said a GOP insider. \"I dont want to do it.\", Well, someones got to. Otherwise, Senate Republicans will lose the seat for sure, and other Republicans farther down the ticket in Illinois will suffer. The national money boys and the big cash political action committees will wash their hands of Illinois in 2016. \"Ive been joking with Lindsey,\" Kirk said on Thursday at an Appropriations Committee session in Washington. He was referring, of course, to Republican presidential hopeful and confirmed bachelor Sen. Lindsey Graham, and the speculation that Graham would have a bevy of \"rotating\" first ladies. Yeah. I dont quite get the physics of that either. First, theres no chance in h-e-double hockey sticks that Graham will be elected president. Hes just there to peel the skin off Sen. Rand Paul and help Jeb Bush win the nomination for the establishment GOP. And that bit about the revolving first ladies?, Just thinking of it gives me a weird vibe. It involves fading Southern belles with dance cards in their hands and ringlets in their hair, wearing hoop skirts, flirting with President Lindsey in fluttery, breathless tones, as if they were all in a bad Warner Bros. movie written by Truman Capote. Anyway, the main thing is what a hot microphone picked up next from Kirks own mouth:, \"Hes a bro with no ho,\" Kirk said of Graham. \"Thats what wed say on the South Side.\", Really? A bro with no ho? Thats what wed say on the South Side?, He might have meant south Wilmette or south Highland Park, but what does the \"bro with no ho\" mean exactly?, Is it some North Shore approximation of urban speak relating to perennial bachelors with visions of revolving first ladies?, Or is it something upper-middle-class North Shore white college kids say when they want to go all urban on yall?, Word. Kirks office issued one of those classic nonapology apologies, saying he was sorry \"to anyone offended by his remark.\", But Democrats who want his job jumped on it. They skipped the Revolving First Ladies bit and focused on the ho part. \"No woman, let alone a woman like me, an African-American and mother of two daughters, who has prosecuted rapists and wife abusers and who has spent much of her career overcoming sexist and racist stereotypes would think his remark either appropriate or funny,\" said Andrea Zopp. Then Tammy Duckworth got into it, through her campaign manager Kaitlin Fahey. \"Senator Kirks joke is as offensive as it is unfunny, and he should apologize, personally and immediately,\" Fahey said in a statement. This is just the beginning. When Hillary Clinton rolls through Illinois, shell put Kirks head on a (rhetorical) pike to show what happens to Men Who Just Dont Get Gender Politics. Oddly, I didnt hear many Democrats shriek when Joe Biden said that Americans need to develop an Indian accent to walk through a Dunkin Donuts or a 7-Eleven. Or, when Biden stood before an African-American audience before the last presidential election to shout like a black preacher that GOP candidate Mitt Romney would \"put yall back in chains.\", Thats racist, yall. Biden gets away with it. Kirk wont. Illinois is a blue state. Hillary, a daughter of Illinois, was beaten with the race card by President Barack Obama in 2008. Now shes running on gender. Of course, not everyone agrees with me. \"I dont think Mark Kirk should step down,\" Illinois Republican Party Chairman Tim Schneider told me over the phone. \"He made an unfortunate comment in a joking fashion into a hot mic. That doesnt make it right, but he apologized for it. Hes moderate on social issues. Hes fiscally conservative. Mark Kirk is just the reform-minded person we need in the Senate.\", That may be, but Kirk has had a history of verbal gaffes in recent years, comments about locking up thousands of black gangsters and driving fast through African-American neighborhoods. The man is a fountain now. I dont think its all Kirks fault. Still, if he remains, hell pay, as will the rest of the Republican ticket. Why?, Because politics isnt a movie. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150612", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-mark-kirk-statement-0612-20150612-column.html", "Title": "[Sen. Mark Kirk and his comments could tank GOP ticket in 2016]"}