{"Content": "[The U.S. Supreme Courts ruling Friday that allows gays to marry across the country divided opinion across Indiana, with supporters celebrating but calling for more civil-rights protections and opponents saying the ruling illustrates the need to protect religious freedoms. A look at what theyre saying:, I KNOW NIKI IS SMILING, Munster residents Amy Sandler and Niki Quasney fought to have their Massachusetts wedding recognized in Indiana as Quasney was dying of cancer last year. Theirs was the first same-sex marriage recognized in the state, a designation that withstood a stay ordered by an appeals court before it ultimately ruled Indianas gay-marriage ban unconstitutional. Quasney died in February at age 38, but Sandler said she was \"elated\" by the courts decision and that it gives her hope for her daughters generation. \"My heart is just singing for all children and families and people across this country,\" Sandler told The Associated Press. \"My heart is just filled with joy today, and I know Niki is smiling.\", Sandler, 38, said she believes it is significant that the majority opinion was written by Supreme Court Justice Anthony Kennedy, who was nominated by President Ronald Reagan. \"It shows that it doesnt matter if youre a Republican or a Democrat or Libertarian or however you define your political identity that equal rights are human rights,\" she said. SUPPORTERS RALLY, Supporters carried signs and waved rainbow flags at the Indiana Statehouse, where more than 100 people gathered to celebrate the decision. Many said the ruling is important but that more must be done to ensure Indiana couples are protected from discrimination. \"When Americans are all treated as equal, we are more free,\" President Barack Obama declared in a speech given at the White House after the Supreme Court extended gay marriage nationwide. (YouTube/White House), \"When Americans are all treated as equal, we are more free,\" President Barack Obama declared in a speech given at the White House after the Supreme Court extended gay marriage nationwide. (YouTube/White House), The rally was organized by Freedom Indiana, the grassroots group that blocked efforts to add Indianas ban on same-sex marriage to the state constitution. Campaign manager Katie Blair said in a statement that Indiana still needs statewide protections so lesbian, gay, bisexual and transgender residents arent fired or denied housing or services because of their sexual orientation. \"Just as all Americans should have the freedom to marry, we want to make sure all Hoosiers have the freedom to live, work and play in our state with no fear of discrimination,\" Blair said. OPPONENTS CITE RELIGIOUS FREEDOM, Opponents of same-sex marriage said Fridays ruling underlines the need to protect religious freedom. \"Todays Supreme Court decision is yet another that ignores the religious beliefs and convictions of millions of Americans,\" said Republican U.S. Rep. Luke Messer. \"It is now more important than ever that we protect religious freedom, allow individuals to follow their conscience and prevent unfair discrimination.\", Indiana Gov. Mike Pence signed a religious objections bill into law in March. Critics who feared it would be used to discriminate against gay, lesbian, bisexual and transgender residents called for boycotts of the state, and lawmakers revised the law to address some of their concerns. Pence issued a statement saying he was disappointed with the ruling but that the state would abide by it. -Associated Press, ]", "Date": "20150626", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-gay-marriage-indiana-supreme-court-20150626-story.html", "Title": "[Indiana groups hail gay marriage ruling, seek more protections]"}