{"Content": "[Islamic State fighters who launched a surprise attack on a Syrian border town massacred more than 200 civilians, including women and children, before they were killed or driven out by Kurdish forces, activists said on Saturday. Kurdish activist Mustafa Bali, the Britain-based Syrian Observatory for Human Rights and Kurdish official Idris Naasan put at 40-50 the number of elite IS fighters killed in the two days of fighting since the militants sneaked into the town of Kobani before dawn on Thursday. Clashes, however, continued to the south and west of the predominantly Kurdish town on the Turkish border on Saturday, they said, although the fighting in the south quietened down by nightfall. Naasan said 23 of the citys Kurdish defenders were killed in the fighting, but the Observatory put the number at 16. The discrepancy could not immediately be reconciled, but conflicting casualty figures are common in the aftermath of major fighting. \"Kobani has been completely cleared of Daesh, and Kurdish forces are now combing the town looking for fighters who may have gone into hiding,\" Bali, using the Arabic acronym for the IS, told The Associated Press by telephone from Kobani. The official Syrian news agency, SANA, also reported that Kobani has been cleared of IS fighters. The more than 200 civilians killed in the last two days include some who perished in IS suicide bombings, including one at the border crossing with Turkey, but they were mostly shot dead in cold blood, some in their own homes, the activists said. \"They were revenge killings,\" Rami Abdurrahman, the observatorys director, told the AP. Others were caught in the cross-fire as gun battles raged in the towns streets or were randomly targeted by IS snipers on rooftops. Bali, Abdurrahman and Naasan all said the number of Kobani civilians and IS fighters killed was likely to rise as rescue teams continue to search neighborhoods where the fighting took place. Massacring civilians is not an uncommon practice by the Islamic State group, whose men have slaughtered thousands in Syria and neighboring Iraq over the last year, when its fighters blitzed through large swathes of territory and declared a caliphate that spans both nations. The Islamic State group often posts on social media networks gruesome images of its fighters executing captives as part of psychological warfare tactics designed to intimidate and inspire desertions among their enemies. Last week, it posted one of its most gruesome video clips, showing the execution of 16 men it claimed to have been spies. Five of the men were drowned in a cage, four were burned inside a car and seven were blown up by explosives. The killing of so many civilians in Kobani, according to Abdurrahman, was premeditated and meant by the Islamic State to avenge their recent defeats at the hands of Kurdish forces. The Western-backed Kurdish forces have emerged as a formidable foe of the extremist group, rolling them back in the north and northeast parts of Syria, where the Kurds are the dominant community, as well as in northern Iraq, where they have also made significant gains against the IS. Kobani has become a symbol of Kurdish resistance after it endured a months-long siege by the Islamic State group before Kurdish forces, backed by U.S.-led coalition airstrikes, broke through and drove the militants out in January. Thursdays surprise attack on the town and a simultaneous one targeting the remote northeastern town of Hassakeh came two days after the Islamic State group called for a wave of violence during the Muslim holy month of Ramadan, a time of fasting and piety that is now in its second week. \"You Muslims, take the initiative and rush to jihad, rise up you mujahideen everywhere, push forward and make Ramadan a month of calamities for the nonbelievers,\" IS spokesman Abu Mohammed al-Adnani said in an audio message released Tuesday. In what also appears to be a response to that call, terror attacks took place Friday across three continents: shootings in a Tunisian beach resort that left 39 people dead, an explosion and a beheading in a U.S.-owned chemical warehouse in southeast France and a suicide bombing by an Islamic State affiliate at a Shiite mosque in Kuwait that killed at least 27 worshippers. The attacks also came after the group suffered a series of setbacks over the past two weeks, including the loss earlier this week of the Syrian border town of Tal Abyad one of the groups main points for bringing in foreign fighters and supplies. Fighting is continuing in Hassakeh for the third successive day, with government and Kurdish forces separately fighting IS militants who have seized several neighborhoods in the mostly Kurdish town, according to the Observatory. Forces loyal to embattled Syrian President Bashar Assad have brought in reinforcements from the town of Deir el-Zour to the south while the Syrian air force pounded IS positions inside the town. Associated Press]", "Date": "20150627", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-islamic-state-syria-20150627-story.html", "Title": "[ Activists: Islamic State fighters kill 200 civilians in Syrian town ]"}