{"Content": "[Saying \"big ideas change the world,\" Ohio Gov. John Kasich declared his candidacy for the Republican nomination Tuesday and pitched his well-rounded resume to voters who have a multitude of high achievers to size up. Kasich, 63, launched his campaign at Ohio State University before a crowd of 2,000 at an event marking the entry of a strong-willed and sometimes abrasive governor in a nomination race now with 16 notable Republicans. \"I am here to ask you for your prayers, for your support, for your efforts because I have decided to run for president,\" Kasich said in a scattered 43-minute speech packed with family anecdotes, historical references and calls for national renewal. \"I have the experience and the testing\" says Ohio Governor John Kasich as he announces his bid for presidency during an event at Ohio State University. July 21, 2015. (Reuters), \"I have the experience and the testing\" says Ohio Governor John Kasich as he announces his bid for presidency during an event at Ohio State University. July 21, 2015. (Reuters), A veteran congressman as well as governor, Kasich is telling voters he is the only GOP candidate with experience in three broad areas of political leadership the federal budget, national security and state government. He also spent nearly a decade at Lehman Brothers. \"I have the experience and the testing,\" he said, \"the testing which shapes you and prepares you for the most important job in the world and I believe I know how to work and help restore this great United States.\", As budget chairman in the House, he became an architect of a deal in 1997 that balanced the federal budget. Now in his second term in swing-state Ohio, hes helped erase a budget deficit projected at nearly $8 billion when he entered office, boost Ohios rainy-day fund to a historic high and seen private-sector employment rebound to its post-recession level. This, through budget cutting, privatization of parts of Ohios government and other, often business-style innovations. \"We didnt really have to slash things,\" Kasich said of the budget squeeze. \"We just had to use a 21st century formula.\", Former state Sen. Nina Turner, a Cleveland Democrat whos allied with Kasich on such efforts as community-police relations, said she voted against every one of what she said were \"pass-the-buck budgets\" by Kasich. \"We cannot be celebrating and dancing happily on the state level, meanwhile there are more school levies on the ballot and local governments have to look into the faces of their citizens and say, I either have to raise your taxes or I have to cut this service,\" she said. Unions, which turned back an effort by Kasich and fellow Republicans to limit public workers collective bargaining rights, say Kasichs successes have come at a cost to local governments and schools, and that new Ohio jobs lack the pay and benefits of the ones they replaced. As a marching band kept up a spritely cadence before Kasich spoke, scores of demonstrators gathered across the street to protest his cuts to the budget and to school districts specifically, as well as his closing of centers for people with development disabilities. \"Im here to make sure that the nation knows, as John Kasich announces his run for president, that he is not an advocate for anybody that is vulnerable,\" said Melissa Svigelj, 42, an educator from suburban Cleveland. \"Unless you are part of the 1 percent, Kasich is not your friend.\", Among his supporters, Margo Bishop, 77, of Gahanna, Ohio, said she values his candor. \"I just like his honesty,\" she said. \"I think hes speaking out, and even if I dont agree all the time, but at least hes saying something.\", Kasich embraces conservative ideals but bucks his party on occasion and disdains the Republican sport of bashing Democrat Hillary Rodham Clinton. \"There are some that will try to divide us. We see it all the time,\" he said Tuesday. \"I dont pay attention to that nonsense.\", His entry nearly rounds out an unusually diverse Republican lineup with two Hispanics, an African-American, one woman and several younger candidates alongside older white men. So many are running that its unclear Kasich will qualify for the GOPs first debate in his home state in just two weeks, when only the top 10 candidates in national polling will be on stage. In recent months, hes made trips to New Hampshire, South Carolina, Iowa, New York and Michigan, and will be returning to early voting states. His allies at the political organization New Day for America reported raising $11.5 million on his behalf before his entry into the race. Associated Press]", "Date": "20150721", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-john-kasich-gop-presidential-race-20150721-story.html", "Title": "[Ohio Gov. Kasich is 16th entry into GOP presidential race ]"}