{"Content": "[Last November, voters elected Republican majorities to both chambers of Congress. So if the U.S. Department of Homeland Security shuts down over a budget impasse between the House and Senate, it will be the fault of Senate Democrats?, Thats what House Speaker John Boehner said, with a straight face, after the Senate failed three times to advance a House gotcha bill that would tie Homeland Security funding to the reversal of President Barack Obamas executive action on immigration. Just weeks after the election, Obama threw a turd in the punch bowl at the GOP victory party by taking unilateral action to spare some 5 million undocumented immigrants from deportation. The president exercised \"prosecutorial discretion\" to declare certain groups of immigrants most of them parents of American-born children or legal U.S. residents a low priority for enforcement. Angry House Republicans tried to undo that action by passing a $39.7 billion Homeland Security spending bill that would block funding to carry out Obamas order. Senate Democrats filibustered the measure, but its not certain that Republicans could muster 51 votes to pass it anyway. There definitely arent enough votes to override Obamas promised veto. So if House Republicans dont change course, were headed for a Homeland Security shutdown. What would that look like?, Most people probably wouldnt notice. During the 2013 federal government shutdown, Americans couldnt get into the National Zoo to see the pandas, but they still had to go through TSA screening at the airport. Thats because operations designated \"essential\" continued despite the funding dispute. Roughly 200,000 of Homeland Securitys 230,000 employees are considered essential, so theyd continue to work without paychecks if funding lapsed at the end of this month. Most training, hiring, research and purchasing would be suspended. Border security, disaster relief and cybersecurity programs would continue uninterrupted. Still, the world is a scary place lately, and Americans cant help but feel uneasy about even a partial Homeland Security shutdown. You know what else theyre going to feel? Disgusted. \"The American people didnt give us the majority to have a fight between House and Senate Republicans,\" Sen. John McCain, R-Ariz. said on NBCs \"Meet the Press.\" \"They want things done.\" Yep. Several polls have found half (or more) of Americans disapprove of Obama taking immigration matters into his own hands. At the same time, the public largely supports the policies themselves. In 2012, the Senate passed a strong bipartisan immigration bill that would have become law if Boehner had called it for a vote. But he yielded to the vocal minority who are still apparently calling the shots in the House. He promised a series of smaller bills that never materialized. Eventually, Obama ran out of patience. Polled last week about which should be a higher priority, 73 percent of Americans said Congress should focus on passing a comprehensive immigration reform package. Only 17 percent said overturning Obamas action was more important, according to the Public Religion Research Institute poll. Yet here we are, on the brink of a partial government shutdown that Boehner seems to think is not his fault. \"Its up to Senate Democrats to get their act together,\" he said on Fox News Sunday. Hes wrong. This isnt a Republican vs. Democrat standoff. Its a Republican vs. Republican standoff. Specifically, its the grown-up Republicans in the Senate vs. the hold-our-breath-till-we-turn-blue Republicans in the House. When Senate Majority Leader Mitch McConnell took the gavel in January, he promised there would be no government shutdowns on his watch. Hes urging Boehner to send the Senate a Homeland Security funding bill without the strings attached. McCain, who chairs the Senate Armed Services Committee, also wants a clean bill. Boehner needs to take charge of his caucus and produce one. After that, the House can replace Obamas executive action by helping to pass an immigration bill that he will sign. The American people want immigration reform. They also want a fully functioning Homeland Security Department. What they dont want is more gridlock.]", "Date": "20150216", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-homeland-security-edit-0217-20150216-story.html", "Title": "[A Homeland Security shutdown? It's on you, Speaker Boehner]"}