{"Content": "[Does paying ransom to a foreign kidnapper free one American but put more at risk?, Not any easy question. But if youre someone like Nancy Curtis of Cambridge, Mass. you were never too interested in that debate. You wanted to save your son, Theo Padnos, who was taken hostage by al-Qaida in Syria in 2012. For years the U.S. government has insisted that paying off kidnappers encourages more kidnapping and helps fund the bad guys. American officials not only refused to negotiate with hostage-takers, they sometimes threatened to prosecute family members for trying to rescue their loved one. Officials say the U.S. government will no longer threaten to prosecute families who try to pay ransom to win the release of their American hostage relatives held overseas. (Reuters), Officials say the U.S. government will no longer threaten to prosecute families who try to pay ransom to win the release of their American hostage relatives held overseas. (Reuters), While nothing can guarantee the safety of all Americans, a change in approach announced Wednesday by President Barack Obama should make some terrible situations more manageable for families, and maybe more hopeful. At a price. Obama said the government will stick to its \"no concessions\" policy and wont pay ransom to terrorist groups holding hostages, but officials will support families in their own efforts to secure a captives release. Families wont be threatened with prosecution, government representatives will be allowed to communicate with the hostage takers and, overall, families will be kept in the loop and treated better as if theyre on the same team as their government, not a nuisance or threat to policy objectives. \"These families have already suffered enough, and they should never feel ignored or victimized by their own government,\" Obama said at the White House as he released details of the new U.S. hostage policy. If you detect a basic contradiction in the new American approach, well, thats because its plainly there: The government wont negotiate with kidnappers but it will assist families that want to pay ransoms. If the bad guys are listening, they may be revising upward their next-quarter revenue projections. In theory, Obamas approach adds a second layer of contradiction: If the government supports a familys quest to save a kidnap victim but wont pay the ransom, where does the money come from? Do only those with access to wealth get reunited with their loved one? Are poor families supposed to launch a fundraiser on Kickstarter.com?, As Obama spoke Wednesday you could hear him wrestling with his decision. Paying ransom, he said, \"risks endangering more Americans and funding the very terrorism we are trying to stop.\" But then, more than once, he reflected on his visits with the families of hostages and hearing how their anguish and isolation was compounded by American officials who refused to help. His message to them: \"Were not going to abandon you. We will stand by you.\", It would be easy, from the safety of home, to rail on the president for making a confused statement, but what if the hostage was someone we know an aid worker in Africa, a journalist in Syria? Wed expect the U.S. government to do everything possible, short of making the payment. When Nancy Curtis son, writer Theo Padnos, was abducted, she was on her own until a contact at the Red Cross tipped her off to the existence of another quietly suffering family whose son, journalist James Foley, also was a hostage in Syria. At the time, according to a detailed account of five American hostages in the current New Yorker magazine, \"U.S. government policy was to keep information about hostages strictly secret, for privacy reasons.\", The Curtis and Foley families joined forces with others, The New Yorker reported, and eventually Padnos was released by his captors. Sadly, Foley and two other hostages held by Islamic State, Steven Sotloff and Peter Kassig, were murdered. A fifth, Kayla Mueller, also died in captivity. Theres no question these are boom times for kidnapping. Islamic State continues its barbarism, finding new and even more repulsive ways to murder hostages. European countries apparently will pay ransoms. Currently 31 Americans are held overseas, some taken by drug cartels or criminals, The New Yorker said. The U.S. government shouldnt, and apparently wont, change its policy on paying ransom. The prospect of mining the U.S. Treasury probably would spur more kidnappings. It seems humane, though, to signal to families that the government wont ignore their pleas for help.]", "Date": "20150624", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-hostages-policy-obama-0625-20150624-story.html", "Title": "[The high cost of kidnapping]"}