{"Content": "[Prompted by Donald Trumps rants about Mexican immigrants and his comments questioning Sen. John McCains status as a war hero, readers have emailed me with a question:, Is now the time for Mayor Rahm Emanuel to force the bloviating, bombastic New Yorker to take down the ugly sign on his Chicago riverfront tower?, My answer: Forget it. The city approved the sign and for the foreseeable future, were stuck with it. No legal Clearasil can remove Trumps self-inflicted urban acne. Attempts to characterize it as a symbol of \"hate speech\" an idea some readers floated after the real estate developer, reality TV star and front-running Republican presidential candidate characterized Mexican immigrants as \"rapists\" and drug dealers are destined to go nowhere. But Chicagoans can still fight back, if only with words. They can ridicule the grotesquely oversized, crudely detailed sign, which flaunts 20-foot-high reflective stainless steel letters that spell out TRUMP and glow at night, that looms even larger because it is slapped on the skyscrapers riverfront-facing lower level, where its impossible to ignore. One way is to heed the message of independent Chicago tour guide Margaret Hicks, who has started putting the Trump sign on her half-serious, half-tongue-in-cheek walking tour of downtown Chicago disaster sites. Some of the tragedies Hicks covers on the twice-weekly, $20 tour like the Great Chicago Fire of 1871 or the Eastland Disaster, which claimed 844 lives when an excursion boat rolled over July 24, 1915 are the real thing. Others are less epic, like the Trump sign and the infamous 2004 Dave Matthews Band \"poop dump.\" In that one, the bands bus driver dumped 800 pounds of human waste through the grated Kinzie Street Bridge and it landed on about 100 sightseers in an open-deck tourist boat below. Donald Trump has a new target. Senator Lindsey Graham slammed Trump on CBS \"This Morning\" and when Graham said, \"Run for president - just stop being a jackass!\" Trump retaliated at a campaign stop and gave out Grahams cell phone number. July 22, 2015. (Inside Edition), Donald Trump has a new target. Senator Lindsey Graham slammed Trump on CBS \"This Morning\" and when Graham said, \"Run for president - just stop being a jackass!\" Trump retaliated at a campaign stop and gave out Grahams cell phone number. July 22, 2015. (Inside Edition), When Hicks was a Chicago Architecture Foundation river cruise docent, she was expected to be neutral, sticking to the facts and keeping her opinions to herself. But now that shes out on her own her company, which does other tours, is called Chicago Elevated shes free to swing away. \"Its really glaring,\" Hicks said of the Trump sign. \"It takes away from the flow. Your eye just goes down the river and it just stops at the Trump sign.\", Bingo. This isnt just about the sign. Its about the way this eyesore mars the urban space along the riverfront, where civic values are supposed to take priority over naked displays of commercialism. The great 1920s skyscrapers that flank the beaux-arts Michigan Avenue Bridge the eclectic Wrigley Building, the neo-Gothic Tribune Tower, the Art Deco 333 N. Michigan Ave. and the neoclassical 360 N. Michigan Ave. engage in a fabulous visual conversation. The black slab of Ludwig Mies van der Rohes former One IBM Plaza (now AMA Plaza) and the corncobs of Bertrand Goldbergs Marina City extend that dialogue westward and into the mid-20th century. But the sign, which went up last summer and is more than three times the size of the sign near Tribune Towers base, is the equivalent of a boorish intruder at a black-tie ball: It never shuts up and never ceases to call attention to itself. Now that the vibrant extension of the Chicago Riverwalk has opened across the river, its clear that Emanuel did the right thing by getting the City Council to pass legislation that controls the size, placement and materials of future signs along the downtown riverfront. A great public space shouldnt be marred by humongous, in-your-face branding exercises promoting private companies. As for the Trump sign, it seems fitting that, under certain light conditions, the \"T\" temporarily goes dark and the other four letters remain, all shiny and leaving only the word \"RUMP.\", bkamin@tribpub.com, Twitter @BlairKamin]", "Date": "20150723", "Author": "[Blair Kamin]", "Link": "http://www.chicagotribune.com/news/columnists/ct-architecture-notes-kamin-met-0715-20150723-column.html", "Title": "[Trump sign a stop on one guide's Chicago disaster tour]"}