{"Content": "[Gov. Bruce Rauner has delivered some unsettling news to park districts already planning for the spring construction season. The Illinois Association of Park Districts recently issued a legislative alert after the governors office announced state grants have been indefinitely suspended until further notice to deal with a $1.6 billion budget deficit. \"An indefinite suspension of grants means our projects will be put on hold,\" said Jeff Long, public relations manager for the Fox Valley Park District. \"The timing is difficult because it comes on the cusp of the construction season,\" Long said. Peter Murphy, Illinois Association of Park Districts president and CEO, called the governors move an \"unprecedented\" decision. He said the suspension includes capital grant programs, such as Open Space Lands Acquisition and Development (OSLAD), Park and Recreation Facility Construction (PARC), as well as Illinois Public Museum grants. \"With construction season upon us, this decision could not come at a worse time,\" Murphy said. He said the suspension affects even those construction projects that are currently in progress. \"The suspension not only threatens jobs that are helping to grow Illinois economy, it creates exposure to local taxpayers for existing contractual obligations and project costs. The construction delays will also end up costing local taxpayers time and money,\" Murphy explained. Long said between 2012 and 2014, the Fox Valley Park District has commitments of roughly $3 million in grants. He said planned upgrades to Copley I and Jericho Lake parks, as well as the Prisco Community Center, now are all on hold because of the suspension of grant funds. He said the work at Jericho Lake was bid and contracted for, but work has not begun. He said construction was just about to begin with the recent arrival of spring-like weather. \"Construction was to begin any day with the nice weather but that will be put on hold until we hear more,\" he said. Copley I park was planned to get a new shelter, playground and ball field, but that, too, is on hold. Long said new ball field lights likely will be installed because the project was already approved and a contract has been signed. \"The ball field lights will be installed and other portions of the improvements will be put on hold,\" he said. Jericho Lake and Copley I each received commitments of $400,000 in OSLAD grants in 2013 and 2014 respectively. Long said these parks are overdue for revitalization. \"Jericho Lake is 20 years old,\" he said. The Fox Valley Park District last summer received a $2 million grant commitment to expand the fitness center at the Prisco Community Center. No work has begun on the project. Long said South River Street Park improvements were funded with a commitment for a $217,200 grant in 2012. Long said while the park district has not been reimbursed, it has not received word that it will not be paid. \"We are still waiting for confirmation one way or the other,\" Long said Thursday. \"We have always upheld our promises and strived to fulfill the vision that residents have for their parks,\" Long said. \"These projects have been publicly announced and now we are pulling back which is unlike the park district. For the time being it affects our mission.\", The city of Aurora, which operates its own park system, issued a statement in response to the proposed cuts. \"Should the state of Illinois and the Rauner Administration proceed with these proposed cuts, improvements at Phillips Park and the Grand Army of the Republic Hall would be postponed indefinitely, leaving the Aurora community without two highly anticipated and long-awaited projects by our residents,\" the statement said. \"With a $400,000 grant the state of Illinois had awarded in late 2014, Aurora would have reimagined Mastodon Lake at Phillips Park as an educational adventure area and outdoor classroom where children could learn about local ecology and the science of fossils while at the same time restoring the health of the lake for recreational fishing and wildlife,\" the statement read. \"A second grant awarded in June 2014 for $750,000 would have finally restored the interior of the Grand Army of the Republic Hall and reopened the doors of this beloved historic institution to the community after nearly 20 years. \"Both projects were funded not only to enrich and educate, but as a practical means of creating jobs to stimulate the local economy,\" according to the statement. \"Neither project constitutes wasteful or inefficient government spending. Parks and museums are family-friendly amenities enjoyed by our residents and visitors to our city and are the kinds of attractions that build community pride.\", The city has also been warned that other projects may be included on the chopping block, including funding for exhibits at the Grand Army of the Republic Hall, several small parks in Near West Side neighborhoods and an elevator to allow access at a new downtown community center totaling another $591,000. \"If all of these projects are cut, that would be an additional $1.74 million eliminated from Auroras park and cultural amenities,\" Aurora city officials said. The Forest Preserve District of Kane County is already taking action by reaching out to state representatives because it has several projects affected by the cuts. The district received notices from the Illinois Department of Natural Resources asking it to \"cease incurring additional obligations, costs or spending for which grant reimbursement would be sought,\" said Laurie Metanchuk, director of community affairs and environmental education. The Illinois Public Museum grant for design, fabrication and installation of a White Oak exhibit at Creek Bend Nature Center within the LeRoy Oakes Forest Preserve in St. Charles is immediately affected by the decision. Kane County has completed the project and was supposed to receive $150,000 reimbursement, Metanchuk said. The district was also supposed to be receiving $400,000 reimbursement through an Open Space Land Acquisition and Development grant for improvements at Brunner Family Forest Preserve in West Dundee, a project that has been underway since September 2013, she said. The total cost of the project which includes woodland and stream bank restoration is nearly complete, she said. District officials are also concerned with a recently awarded Open Space Land Acquisition and Development grant to purchase additional land for the Freeman Kame Forest Preserve, Metanchuk said. The grant was announced earlier this year for a $568,500 reimbursement, she said. \"Weve not yet received a notice suspending these funds, however, we are concerned that one may be forthcoming,\" she said. \"The Forest Preserve District is already contractually obligated to purchase this property.\", Linda Girardi is a freelance reporter]", "Date": "20150313", "Author": "[Linda Girardi]", "Link": "http://www.chicagotribune.com/suburbs/aurora-beacon-news/news/ct-abn-aurora-parks-st-0316-20150313-story.html", "Title": "[State grant cuts may put many Aurora area projects on hold]"}