{"Content": "[I loved reading the \"If You Give a Mouse a Cookie\" books to my daughter. The somewhat Aesopian theme is that if you give the mouse what it wants a cookie it will just want more: a glass of milk, a straw, etc. The story came to mind last week, a week that began with many vowing to inter the Confederate flag and ended with the Supreme Court mandating that there is a constitutional right to same-sex marriage. As far as culture war victories go, the flag news was big, but the marriage ruling was tantamount to VE Day. It might be too much to think that progressive activists and intellectuals would demobilize after such a \"Mission Accomplished\" moment. But a reasonable person might expect social justice warriors to at least take the weekend off to celebrate. But no. Even when the cookie is this big, the mice want something more. The call went out that there were new citadels to conquer. Within hours of the decision, Politico ran a call to arms titled \"Its Time to Legalize Polygamy: Why Group Marriage Is the Next Horizon of Social Liberalism.\" On Sunday, Time magazine had Mark Oppenheimers \"Nows the Time to End Tax Exemptions for Religious Institutions.\", Earlier in the week, as corporations and politicians were racing one another to shove the Confederate flag down the memory hole, a co-host asked CNNs Don Lemon if the Jefferson Memorial should be removed from the National Mall because the former president owned slaves. He said no, but that \"there may come a day when we want to rethink Jefferson.\", Within hours of the same sex-marriage ruling, the White House was beaming the gay pride rainbow flag on its facade. This is the White House whose current occupant campaigned in 2008 passionately insisting that his religious faith required him to oppose gay marriage. The president and his party now consider that position to be unalloyed bigotry. Many of us always believed Barack Obama was lying about his opposition to gay marriage a belief corroborated when his former guru, David Axelrod, wrote in his memoir that hed advised his client to conceal his personal view for political expediency. It is something of a secular piety to bemoan political polarization in this nation. But polarization in and of itself shouldnt be a problem in a democracy. The whole point of having a democratic republic, never mind the Bill of Rights, is to give people the right to disagree. A deeper and more poisonous problem is the breakdown in trust. Again and again, progressives insist that their goals are reasonable and limited. Proponents of gay marriage insisted that they merely wanted the same rights to marry as everyone else. They mocked, scorned and belittled anyone who suggested that polygamy would be next on their agenda. Until they started winning. In 2013, a headline in Slate declared \"Legalize Polygamy!\" and a writer at the Economist editorialized, \"And now on to polygamy.\" The Atlantic ran a fawning piece on Diana Adams and her quest for a polyamorous \"alternative to marriage.\", We were also told that the fight for marriage equality had nothing to do with a larger war against organized religion and religious freedom. But we now know that was a lie too. The ACLU has reversed its position on religious freedom laws, in line with the lefts scorched-earth attacks on religious institutions and private businesses that wont or cant embrace the secular fatwa that everyone must celebrate \"love\" as defined by the left. I very much doubt well get a constitutional right for teams of people to get \"married,\" but I have every confidence the drumbeat will grow louder. Social justice forever ill-defined so as to maximize the power of its champions has become not just an industry but also a permanent psychological orientation among journalists, lawyers, educators and other members of the new class of eternal reformers. By no means are social justice warriors always wrong. But they are untrustworthy, because they arent driven by a philosophy so much as an insatiable appetite that cannot take yes for an answer. No cookie will ever satisfy them. Our politics will only get uglier, as those who resist this agenda realize that compromise is just another word for appeasement. Tribune Content Agency, Jonah Goldberg is a fellow at the American Enterprise Institute and a senior editor of National Review.]", "Date": "20150701", "Author": "[Jonah Goldberg]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-polygamy-liberals-gay-marriage-20150701-column.html", "Title": "[You can't compromise with culture warriors]"}