{"Content": "[Rowan County Clerk Kim Davis shut her blinds at work Tuesday to block the view of rainbow-clad protesters outside. They carried flowers and flags and signs saying \"you dont own marriage.\" They chanted \"do your job.\", Moments later, she told a lesbian couple who walked in asking for a license to try another county. Davis is among a handful of public officials across the Bible Belt so repulsed by the thought of enabling a same-sex marriage that they are defying the U.S. Supreme Court and refusing to issue a license to anyone, gay or straight. \"Its a deep-rooted conviction; my conscience wont allow me to do that,\" Davis told The Associated Press. \"It goes against everything I hold dear, everything sacred in my life.\", Some judges and clerks in Alabama and Texas have done the same, ordering their offices in the name of religious liberty and free speech to issue no marriage licenses at all. Legal experts are dubious that religious freedom arguments will protect public officials who not only refuse to participate due to their own beliefs, but also decline to make accommodations so that others who dont object can serve the public instead. Two things can happen if a Kentucky clerk wont issue a marriage license to a same-sex couple: They can resign, or go to jail, said Sam Marcosson, a constitutional law professor at the Louis D. Brandeis School of Law at the University of Louisville. \"If it means that you simply cannot fulfill your duties because of your religious beliefs, what is required of you is that you can no longer hold that office,\" Marcosson said. \"That applies to a judge, that applies to a senator, that applies to anyone who holds public office.\", Clerks and probate judges hold the keys to marriage in counties around the country, and in many rural areas, there are few alternatives for hundreds of miles. Couples turned away could seek a court order, and a clerk who still refuses to issue a license could be jailed for contempt, Marcosson said. They also risk criminal official misconduct charges, said Warren County Attorney Ann Milliken, president of the Kentucky County Attorneys Association. The misdemeanor, punishable by up to a year in jail, is committed when a public servant \"refrains from performing a duty imposed upon him by law or clearly inherent in the nature of his office.\", Casey Davis, the clerk in Casey County, Kentucky, says he wont resign and hed rather go to jail than issue a marriage license to a same-sex couple. None have yet come in to get one, he said. After the Supreme Court declared that marriage is a constitutional right equally held by all Americans, clerks in Arkansas and Mississippi resigned Tuesday rather than be forced to sign the licenses of gays and lesbians. Linda Barnette, the circuit clerk in Grenada County, Mississippi, for 24 years, wrote in her resignation letter that she is a \"follower of Christ\" and that she chooses \"to obey God rather than man.\", Other reluctant Kentucky clerks gave up the fight on Tuesday. Lawrence County Clerk Chris Jobe, who also serves as president of the Kentucky County Clerks Association, told The Courier-Journal in Louisville that he would resume issuing licenses for fear of being removed from office. Several other Kentucky clerks made similar concessions. Even in Mississippi, Texas and Louisiana, where governors took the most vigorous stands against Fridays Supreme Courts ruling, clerks were issuing licenses. But Davis stayed firm in denying one Tuesday to April Miller and Karen Roberts, a couple of 11 years who live in Morehead. The office of Kentucky Attorney General Jack Conway encouraged any couples who are turned away to seek private counsel. Miller and Roberts contacted the American Civil Liberties Union of Kentucky to represent them. \"This is where we live; we pay taxes here, we vote here. And we want to get married here,\" said Miller. Outside Davis office, drivers honked and waved, flew rainbow flags from their windows and shouted \"love must win!\", But a small group also gathered to support Davis, demonstrating the stark divide that remains in the most theologically conservative stretches of the South and Midwest, where state leaders fought hard for years to prevent same-sex marriage. \"Our country is on the wrong path, we as a people no longer exalt God,\" said Dennis Buschman, who carried a Bible as he led a half-dozen people supporting the clerks defiance. He called homosexuality an \"abomination\" and a \"serious, serious sin.\", Some protesters confronted them. \"God did not elect her, I did,\" said Kevin Bass, a former police officer who arrived at the courthouse with his wife to support gay couples seeking licenses. \"If she objects to doing her job, she can go.\", As a police officer for 20 years, he said, he could not choose which laws he liked to enforce. Inside the county building, Davis seemed worried. She showed the AP a curse-laden hate mail she received overnight. When she took her oath of office in January and promised to uphold the state constitution, gay marriage wasnt a part of the deal, she figures. Davis would not say whether shell quit her job to stand up for her beliefs, but vowed never to issue a marriage license to a gay couple. \"No man can put a harness on his conscience. That is protected by the Kentucky Constitution, the very Constitution I took an oath to uphold,\" she said. Associated Press]", "Date": "20150630", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-same-sex-marriage-20150630-story.html", "Title": "[Same-sex marriage fight turns to clerks who refuse licenses]"}