{"Content": "[Lollapalooza will fill Grant Park with hundreds of thousands of people next weekend, the latest event that like the Pitchfork Musical Festival and the Grateful Deads farewell concerts at Soldier Field before it puts Chicago center stage. With springs NFL draft, which transformed itself and Grant Park into a three-day football fan festival, the citys plan to raise its profile and promote tourism through large-scale events is showing momentum. While locals may grumble about cordoned-off streets and lollygagging visitors, and skeptics question the bottom-line economic benefits, the city says its strategy is paying off. Lollapalooza generated nearly $82 million last year in direct spending, while the NFL draft which returned to Chicago after a half-century in New York added nearly $44 million, according to separate economic impact studies funded by the city and event organizers. The city has yet to release its final costs for the draft, but sources say total expenses are expected to come in under $5 million. Not ready to declare the events a financial boon, Allen Sanderson, a University of Chicago economics professor who has criticized the city for giving away too much to lure the NFL, said the draft was ultimately a win for Chicago. \"A lot of things broke well for the city,\" Sanderson said. \"I think it was definitely good for the city.\", The studies looked at attendees from outside Cook County who spent money on everything from hotels and restaurants to transportation, money that would not likely have been spent in Chicago otherwise. \"The direct impact is all of the spending that is new (money) to the community as the result of the event,\" said Jeremy Jordan, director of the Sports Industry Research Center at Temple University, which conducted the NFL draft study on behalf of Choose Chicago, the citys convention and tourism bureau. The Grateful Dead broke post-renovation attendance records at Soldier Field, topping 70,000 at each of the bands final three concerts over July Fourth weekend. A report by Choose Chicago shows that Deadheads descending on the city grabbed an additional 28,200 hotel room nights and added $7.7 million in hotel revenue versus the average for the same weekend the past five years. That brought in an additional $431,000 in hotel tax revenue for the city. A sold-out Pitchfork wrapped up its 10th annual music festival July 19 at Chicagos Union Park, putting attendance at more than 50,000 for the eclectic three-day event featuring Wilco, Chance the Rapper and Sleater-Kinney, among other performers. Mayor Rahm Emanuel, who has set a goal of 55 million visitors a year by 2020, issued a statement touting such big events as integral to the citys tourism efforts. \"Signature events held in Chicago create more customers for our businesses today and bring the potential for repeat visitors and more economic growth for tomorrow,\" Emanuel said. \"The City of Chicago will continue to redouble our efforts to attract more marquee events.\", Lollapalooza may be at the top of Chicagos marquee. The summer music festival launched in 1991 and put down roots in Chicago in 2005. It has grown into a major attraction which annually draws thousands of concertgoers to Grant Park and infuses millions into the local economy. This year, the Lollapalooza Music Festival is running from Friday to Aug. 2 with an extensive roster headlined by Paul McCartney, Metallica and Florence + the Machine. The sold-out festival drew 100,000 fans per day last summer, according to the Chicago Park District. C3 Presents, the Austin, Texas-based company that produces Lollapalooza, pays the Park District $1.5 million annually plus a percentage of ticket sales as part of a 10-year contract for use of Grant Park through 2021. Last year, the total payment was nearly $3.9 million, according to the Park District. Lollapaloozas total economic impact, including indirect spending, reached $143 million last year, up from $85 million in 2010, according to a study commissioned by C3. The study found the festival has generated $587 million for the Chicago economy over five years. The study, conducted by C3s Austin neighbor AngelouEconomics, said out-of-town attendees spent nearly $65 million on everything from hotels to restaurants during the course of the three-day festival. Lollapalooza generated $8.2 million in local and state tax revenues, according to the study. Festival promotion, primarily through digital and print, added more than $130 million in media value for Chicago, according to the study, something not included in the economic impact total. The U. of C.s Sanderson, an expert in sports economics, suggests impact studies tend to overstate the actual value of such events. \"If you take whatever numbers somebody gives you, move the decimal point one to the left, youre probably pretty close,\" Sanderson said. \"Its 10 percent reality and 90 percent marketing.\", A number not apparently in dispute is the 200,000 visitors that packed Grant Park for the NFL draft, far exceeding the expectations of both the league and the city. A no-frills theatrical event for its previous 50-year run in New York, Chicago last hosted the draft at the Sheraton hotel in 1964, and luring it back was seen as a big win for Choose Chicago. The expanded event featured a pop-up \"Draft Town\" covering 900,000 square feet of the park with concessions, activities, a Super Bowl museum and \"fan caves\" for all 32 NFL teams. The report showed 60 percent of attendees were male and nearly half of the visitors were from outside Chicago, a broad definition that took in everybody from suburbanites to rabid draftniks from other markets. Fans from Detroit, Indianapolis, St. Louis and Minnesota were most plentiful among the out-of-towners but Tampa, Fla. which had the No. 1 pick, also had a strong contingent, according to organizers. Half of attendees drove to the draft, while 11 percent flew by commercial airline. The event generated nearly 31,000 hotel nights from nonlocal visitors and $456,000 in city hotel tax revenue, according to the study. Total economic benefit to the city was pegged at $81.6 million, a slightly fuzzy number which takes into account indirect spending economic ripples from the event such as business-to-business transactions and money that recirculates through local household spending after the initial infusion. Chicago was backdrop for 8.8 million TV viewers on ESPN and NFL Network during the first day of the draft alone, according to Nielsen. With other major networks also camped out in Grant Park, Choose Chicago said the value of the TV and digital media was nearly $115 million. \"All the networks were broadcasting remotely from Chicago for multiple days,\" said Don Welsh, Choose Chicagos president. \"We couldnt even attempt to buy that.\", Choose Chicago said it spent about $4 million to put on the NFL draft, with $2.5 million allocated for marketing the event, primarily to regional NFL cities. Another $1.6 million went toward infrastructure. The nonprofit organization used $2 million it received through the citys airport fund usage fees paid by airlines at OHare and Midway airports for most of the advertising costs. Other expenses were covered through private and corporate donations. The $4 million does not include costs for police, paramedics, road closures and other city services, according to Libby Langsdorf, a city of Chicago spokeswoman. Though the draft concluded May 2, those invoices have not yet been issued. Langsdorf said they will be forwarded to Choose Chicago for payment but didnt specify timing. Sources close to the situation said the total additional costs are expected to be less than $1 million, which Choose Chicago says it can cover. The city and its partners also committed significant resources to the event, such as free use of Roosevelt Universitys Auditorium Theatre, where the draft itself was held. The Park District offered up Grant Park for free, waiving a $937,500 rental fee, according to documents released to the Tribune under a public records request. The city made a one-year deal with the NFL to host the draft with a commitment for 2016, if the league chooses to return. \"We do not have a timeline on a decision for a location for next years draft,\" NFL spokesman Brian McCarthy said. Welsh said the city is in discussion with the NFL to bring the draft back, hopefully sooner than the previous 51-year interval. \"Our objective will be to provide a proposal within the next couple of weeks that clearly conveys that we are committed to the NFL and want to grow the event,\" Welsh said. McCarthy said the success of the event will likely bring a new demand next year. \"One of the things we learned is we needed even more space,\" McCarthy said. rchannick@tribpub.com, Twitter@RobertChannick]", "Date": "20150725", "Author": "[Robert Channick]", "Link": "http://www.chicagotribune.com/business/ct-chicago-festivals-economy-0726-biz-20150724-story.html", "Title": "[From Lollapalooza to NFL draft, high-profile events paying off for Chicago]"}