{"Content": "[It must make the birthers heads explode to hear President Barack Obama ridicule the ridiculous charge that he is a secret Kenyan. Thats only one good reason for him to do it. \"Birthers\" are people who just cant or refuse to get it through their narrow minds that Obama was born as he and documentation says he was, a legal United States citizen. Yes, Im thinking of you, Donald Trump. \"I suspect that some of my critics back home are suspecting that Im back here to look for my birth certificate,\" the president quipped at a Saturday night state dinner hosted by Kenyas president, Uhuru Kenyatta. President Barack Obama took to the dance floor at a State Dinner held in his honour in Nairobi on Saturday. (AP), President Barack Obama took to the dance floor at a State Dinner held in his honour in Nairobi on Saturday. (AP), On Sunday, speaking to a packed sports arena in Nairobi, he brought cheers by calling himself \"the first Kenyan-American to be president of the United States.\", Indeed he is. In fact, having an ethnic hyphen is in many ways the American way. This is particularly true in cities like Obamas hometown, Chicago, where ethnicity is celebrated with annual parades and neighborhood festivals from St. Patricks Day to Columbus Day. But the irony of being a racial or ethnic pioneer like the nations first black president is the need to play down any action or expression that might be viewed as divisive. In fact, Obamas critics will call him divisive whether he calls attention to his racial heritage or not. But now that hes in his final 18 months as president and has no more campaigns to run, he can be more candid about doing what his two most recent predecessors have done: help Africa, the worlds least-developed continent, to have the worlds fastest-growing economies. Obama had not returned to Kenya for his first visit as president only to visit economic development projects and say hi to his Kenyan kinfolk. He aimed to strengthen security alliances in the war against Boko Haram and other regional terrorist groups. He also aimed to make a strong plea for human rights, press freedoms and government transparency across the continent. In turning attention to Africa in his final months in office, he follows two predecessors. President George W. Bush surprised everyone, including critics like me, with the Presidents Emergency Plan for AIDS Relief. By the time he left office, his program helped expand the number of HIV-infected people who were receiving anti-AIDS medication from fewer than 50,000 to almost 2 million and more than 4 million worldwide by 2012. President Bill Clinton, through the Clinton Foundation, also has raised millions to fight AIDS, assist farmers and help make forests and cities more sustainable through climate change in Africa. Expanding on those gains and spurring more economic development were major themes of Obamas trip to Kenya and Ethiopia. For this, he was warmly welcomed. He also received enthusiastic applause especially from the women present, judging by the video coverage when he compared discrimination against women in the workplace to leaving half of your talented players on the bench. But not surprisingly, his criticism of discrimination against gays and lesbians quite eloquently as \"the path whereby freedoms begin to erode and bad things happen\" was not as warmly received. \"For Kenyans today, the issue of gay rights is really a nonissue,\" Kenyatta said. \"We want to focus on other issues that really are day-to-day issues for our people.\", For this Kenyatta was applauded by Kenyans in attendance, according to news reports. Still, Obama had put the issue on the table and into Kenyas national conversation as more than a \"non-issue.\" For Africa, where progress in gender rights is about where it was in 1950s America (or worse), that was a bold statement for Obama to make. In all of sub-Sahara Africa, only South Africa, which wrote equal rights for gays and lesbians into its founding constitution after the end of apartheid, has legalized same-sex marriage. Against the backdrop of history, Obama and other outsiders must step gently or be accused of cultural neocolonialism. \"Leave Africas affairs to the Africans\" is a plea or demand that I have been hearing for more than 30 years of following African politics and social changes. Thats understandable. But if our nations first Kenyan-American president cant speak to Africa with a persuasive voice of tough love, who can?, Clarence Page, a member of the Chicago Tribune Editorial Board, blogs at www.chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150728", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-obama-kenya-africa-trump-bush-clinton-kenyatta-perspec-0729-jm-20150728-column.html", "Title": "[Obama frees his inner Kenyan]"}