{"Content": "[For the first time in a decade, the state is preparing to add another requirement to the list of classes high school students must take to get their diplomas a civics course and its generating controversy, confusion and opposition. Last weekend, the state Senate passed legislation to require students to take at least one semester of civics to graduate. This would be a stand-alone class not just a section of a history or government course and it would involve discussions of current events and controversial issues, community service, and simulations of the democratic process, such as reenacting a legislative session. The goal is to \"help young people acquire and learn to use the skills, knowledge, and attitudes that will prepare them to be competent and responsible citizens throughout their lives,\" the legislation states. The state House approved the bill earlier, so it now heads to Gov. Bruce Rauner for his signature, with expectations that it will become law in 2016 just in time for the ultimate civic lessons surrounding the next presidential election. But the political fight isnt over major education lobbying groups say they plan to urge the governor not to sign the bill. \"It sounds like such a simple thing that everybody would like. We would love to like it too,\" said Ben Schwarm, deputy executive director of the Illinois Association of School Boards. \"But there are multiple problems we have.\", Schwarm also heads up lobbying efforts of the Illinois Statewide School Management Alliance, an influential coalition of education organizations that includes school boards, superintendents, principals and school business officials. The alliance strongly opposed the legislation this spring, Schwarm said, citing concerns about long-term expenses for educator training and additional teachers, fewer elective classes for students and hassles with rearranging pupil schedules, among other issues. At the Illinois Principals Association, associate director and general counsel Brian Schwartz said theres confusion about when the civics requirement would kick in and at which grade levels. Overall, he said, \"We would prefer that the General Assembly take a comprehensive look at what kids are being required to take to graduate, instead of continuing to add and add and add.\", Over some 20 years, the state has passed a host of laws requiring grade schools through high schools to teach financial literacy, violence prevention and conflict resolution, genocide across the globe and other so-called instructional mandates. But the number and type of credits required to graduate from high school have changed little. In August 2005, then-Gov. Rod Blagojevich signed legislation to raise state graduation standards for the first time in 21 years, requiring students to take more math, English, science and writing courses to graduate. At the time, the social studies requirement remained the same: Two years of social studies, one year of which must be the history of the United States or a combination of U.S. history and American government. The law also requires schools to teach American patriotism and principles of representative government, as well as the proper use and display of the American flag. Ten years later, under the legislation going to Rauner, the two social studies credits would have to include at least one semester in civics, a subject considered marginalized in an era of high-stakes testing in reading and math. Nationwide, students score poorly on civics exams, called the National Assessment of Educational Progress. Often, fewer than a quarter of test takers perform at the proficient level. In Illinois, civics has gained attention with the help of a state-appointed task force of lawmakers, educators and advocacy groups, which have been critical of the current state of civics education that focuses on rote memorization rather than spirited discussion and debate. The Illinois Task Force on Civic Education held hearings around the state last fall and pushed for legislation this spring to require a stand-alone civics class for graduation. When detractors complained about lack of money to cover the cost of required civics classes, nonprofits including the Robert R. McCormick Foundation, The Chicago Community Trust and other business and civic groups pledged to contribute at least $1 million annually for three years for teacher training in civics across the state. Shawn Healy, chairman of the task force and a civics scholar at McCormick, said the foundation plans to manage the funds raised and work with regional education offices to train teachers. Based on data from the state, Healy said the vast majority of high schools have a course that could be classified as civics, though some changes may be necessary, and he believes many schools have social studies teachers in place who could teach the course. Still, critics are concerned about what happens when the private money runs out in three years and whether thousands of students will be scrambling to get in a civics course before graduating. Healy anticipated that, if signed, the law would be implemented in the 2016-17 school year, beginning with incoming freshman who will need the civics course to graduate. However, Matt Vanover, public information director at the Illinois State Board of Education, said the agency interprets the legislation as taking effect Jan. 1  meaning within the 2015-16 school year and affecting all high school students enrolled at that time, not just freshmen. That would mean, for example, that a senior who hadnt taken a civics class would have to do so rather quickly and would likely have to re-juggle his or her schedule. The state board was \"neutral\" on the civics legislation, said Vanover. Schwarm, of the school boards association, said the education organizations worked hard to kill the legislation, but in the end, both the state House and Senate passed it. \"The big reason, I think that this one passed, when others havent, is because it is for civics. For legislators, they are all about civics,\" Schwarm said. Its unclear what Rauner will do. Schwarm said he was told that Rauner doesnt like \"unfunded mandates\" placed on schools. But Healy said the governors education staff indicated he was in favor of the civics legislation. Rauner spokeswoman Catherine Kelly said: \"The governor will carefully consider any legislation that crosses his desk.\", drado@tribpub.com]", "Date": "20150603", "Author": "[Diane Rado]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-civics-law-met-20150602-story.html", "Title": "[Debate over civics: Should it be required for graduation in Illinois?]"}