{"Content": "[University of Illinois trustees Thursday approved a $167,200 bonus for outgoing president Robert Easter, who will retire from a decadeslong career at the campus next week. The performance bonus is on top of Easters $478,558 salary, and is in addition to a $180,000 bonus he received in November for accomplishments during the prior academic year. The bonus is to be paid by May 17, Easters last day as president. It brings his compensation for this fiscal year to $645,758. Also on Thursday, at its board meeting in Springfield, the U. of I. board honored Easter with a \"distinguished service medallion\" for his roles as faculty member, dean, interim chancellor and 19th president. He took over as president in 2012, delaying his retirement to step in after President Michael Hogans tenure ended after months of controversy. Easter is the 29th person to get a medallion since the award was introduced in 1974. \"Over the course of his nearly 40-year career, his contributions to the University are unmatched and his loyalty has become legendary,\" according to a resolution approved by trustees. While he was called an \"exceptional scholar and visionary leader,\" trustees said he will be \"remembered just as much for his kindness, his thoughtfulness, his loyalty and his deep affection for the University.\", Easter also was honored with the title of president emeritus. That resolution praises Easters \"stellar and unwavering commitment\" to U. of I. and recognizes him as \"someone who has answered the call for help during troubled times at the University.\", The campus three chancellors also presented Easter with gifts: A book about Abraham Lincoln, a piece of inscribed marble from Mumford Hall, where Easter began his academic career, and a photograph of the two newest peregrine falcons at the University of Illinois at Chicago campus, which have been named after Easter and his wife, Cheryl. Easter called the retirement recognition a \"very special moment\" and said he accepted the honors on behalf of all the loyal employees who \"truly are the University of Illinois.\", U. of I. in recent years has moved to an incentive-based compensation package for the president, providing a relatively lower salary with the opportunity to get additional compensation based on performance. Easter got 95 percent of his potential bonus for this academic year. He was evaluated on performance goals that included helping with the transition to the next president, Timothy Killeen, who starts May 18; working with donors on fundraising; increasing diversity among faculty, students and vendors; and recruiting and hiring numerous high-level administrators, including the new chancellor at UIC. The performance-based pay is part of a program developed in 2013 to move away from retention-based incentives. Easter received $90,000 during the first year of the program. A U. of I. spokesman said Easters total compensation places him in about the middle of Big Ten university presidents. But the bonus drew criticism from state Sen. Bill Cunningham, D-Chicago, who is chairing a subcommittee charged with examining compensation and benefits for public university administrators. \"President Easter has performed well on behalf of U. of I. but at a time when student tuition is skyrocketing and universities complain about state budget cuts, I dont see how six-digit bonuses can be justified,\" Cunningham said. Easter, 67, started at U. of I. in 1973 as a doctoral student with an interest in swine nutrition. He retired as the schools interim chancellor in 2011 before being tapped to replace Hogan. In November, U. of I. announced that Killeen, a world-class scientist and a leader in overseeing large research enterprises, would succeed Easter after this academic year. Also on Thursday, trustees approved a preliminary operating budget of $5.6 billion for the next fiscal year, though the level of state funding remains uncertain. The final budget wont be considered until later this year. jscohen@tribune.com, Twitter @higherednews]", "Date": "20150508", "Author": "[Jodi S. Cohen]", "Link": "http://www.chicagotribune.com/news/ct-university-of-illinois-president-bonus-met-20150507-story.html", "Title": "[U. of I. president gets $167,200 in final bonus]"}