{"Content": "[\"Shes the blond. Im the redhead.\", State Treasurer Judy Baar Topinka, explaining in 1997 the scant difference between her office and that of state Comptroller Loleta Didrickson. In a better place and time, politicians would focus this week on Judy Baar Topinkas life, legacy and funeral services. But with the governorship changing parties in four weeks, theres some urgency to the question of succession in the comptrollers office. We hope Mondays statement from Attorney General Lisa Madigan more on that later brings some order for the moment. In time, though, the state should move to abolish not one but two unneeded offices, comptroller and lieutenant governor. The savings for a government that cant pay billions in debts or afford better services for its weakest citizens: a recurring $14 million every year. If we were suspicious types, wed think some Illinois pols want to appear frugal while making sure that such economies which also threaten party clout, patronage hires and the grooming of aspirants to higher offices never show up on the ballot as constitutional amendments:, In March 2011 the Illinois Senate voted 55-0 to ask voters whether to merge the jobs of treasurer (We invest state money) and comptroller (We write state checks). But House Speaker Michael Madigan euthanized the measure in his Rules Committee. The two offices functions were unified in the 1950s when state auditor Orville Hodge embezzled more than $1.5 million. Madigan has suggested that without both offices, Illinois could be vulnerable to another scandal. Thats a risk some two dozen more fiscally shrewd states already accept, citing vastly improved financial controls than those of 60 years ago. In 2010 all four major-party candidates for treasurer and comptroller agreed that the two offices should be combined. Topinka was elected comptroller and in 2011 told a reporter she saw \"absolutely no downside\" to the proposal: \"How can you refuse the low-hanging fruit of combining two offices, which makes eminently good sense, to save $12 million annually?\", Ride a glass-sheathed elevator to the 15th floor of Chicagos Thompson Center to see how easily the comptroller (Suite 500) and treasurer (Suite 600) could physically merge if legislators would let voters merge them. Except for the political spoils, making taxpayers fund these overlapping but separate offices if it ever made sense is at best obsolete. Speaker Madigan, tear down this wall. In April 2013, Madigans House voted 83-28 to ask voters whether to kill the job of lieutenant governor. This time it was the Senate that didnt get around to concurring. Which was odd because Illinois had suffered no evident anguish in going without a so-called \"lite gov\" after Pat Quinn advanced from that office to the governorship in January 2009. The Illinois Constitution gives lite govs two duties: Wait around in case the governor dies, quits or is removed from office, and do whatever the governor tells you to do. Several states do without lite govs, and in 1981 Illinois Dave Neal quit the job citing the boredom: \"A person of average intelligence could learn it in a week.\", Weve urged an amendment that would have the attorney general fill a gubernatorial vacancy. Voters elect attorneys general after long campaigns; they elect lite govs only as running mates of candidates for governor. Pols fret that an attorney general of one party might succeed a governor of the other. So what? The governorship belongs to the people, not to political parties that yearn to hold it. Lisa Madigans statement Monday sets the stage for eliminating the comptroller and lieutenant governor. She says, we think correctly, that Illinois has two comptroller vacancies: Democrat Quinn, as todays governor, can appoint a caretaker for the final weeks of Topinkas current term; her chief of staff, Nancy Kimme, is the logical choice. But Republican Bruce Rauner becomes governor Jan. 12, so he can name a replacement upon declaration that the comptroller-elect cant serve the new term. Madigan wants to see voters elect a comptroller in the 2016 general election to serve the last two years of that term. And Senate President John Cullerton went so far as to declare: \"We need a special session to immediately consider legislation for a special election.\", If this were a major office say, U.S. senator wed agree. But this is an office that shouldnt even exist. Judy Baar Topinka would throw a fit over wasting taxpayer money on a special legislative session to resolve an insignificant issue that lawmakers can address ... next month. The solution here:, Governor Quinn, promote the chief of staff to maintain continuity for four weeks. Illinois will survive. Governor-elect Rauner, show voters youre serious about cutting needless costs. Encourage legislators to tee up the constitutional amendment(s) that will eliminate these two offices. Make sure your comptroller appointee works from the get-go toward that goal. If you think he or she might go native, ask now for a letter of resignation, effective after the 2016 election. That way voters can eliminate the office without having some newly elected comptroller clinging to the door handle, refusing to leave, until 2018. If everybody does what Judy Baar Topinka would want, the people of Illinois win. Cant you hear her applauding?]", "Date": "20141215", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-quinn-rauner-topinka-madigan-comptroller-edit-1216-20141215-story.html", "Title": "[ Speaker Madigan, tear down this wall]"}