{"Content": "[As Cook County Board President Toni Preckwinkle scrambles to collect the votes she needs to pass her penny-on-the-dollar sales tax increase, shes holding out the possibility shell scale back the tax hike down the road if the state approves her proposed overhaul of the county government worker retirement system. But its unclear whether Preckwinkles pension plan can withstand an inevitable legal challenge. It would reduce cost-of-living increases, and the Illinois Supreme Court recently ruled that doing so violates the state constitution. Preckwinkle aides say her approach is different because the county would provide something in return: increased taxpayer contributions into the pension fund and guaranteed health care insurance subsidies for retirees. But critics point to the same clause in the Illinois Constitution that the state Supreme Court cited in May when it tossed out a law that sought to cut state worker pensions once a government grants a pension, it \"shall be an enforceable contractual relationship, the benefits of which shall not be diminished or impaired.\", \"I think that it is dubious at best to think that the proposed county legislation will withstand court scrutiny,\" said Commissioner John Fritchey, D-Chicago, an attorney and former state legislator who opposes the sales tax increase. \"While I respect that the presidents statement is an effort to soothe public outrage, I think all it does is create premature and misplaced false hope.\", That legal backdrop casts doubt on the possibility that Preckwinkle will be able to one day roll back a portion of the 1-percentage-point sales tax increase shell try to get approved at a special Wednesday County Board meeting. If approved, the county portion of the sales tax would rise from 0.75 percent to 1.75 percent, pushing the overall rate in Chicago to 10.25 percent, among the nations highest. Preckwinkle is trying to shore up a county pension fund that is $6.5 billion short of what it needs to meet its obligations to retired workers. That amount will continue to grow by $360 million a year, pushing off debt onto future generations, unless something is done, Preckwinkle has said. To that end, Preckwinkle wants to require workers to pay more in pension contributions, increase retirement ages for many workers, impose a maximum salary on which benefits are calculated and reduce cost-of-living increases except in high-inflation years. In return, the county would put more money into the pension fund and guarantee health coverage for retired workers that the county is not now obligated to provide. The idea is that the county is providing new benefits as a \"consideration\" for other cuts. The recent state Supreme Court ruling contained a footnote that county officials say opens the door to the consideration approach on pensions. \"Additional benefits may be added ... and the state may require additional employee contributions or other consideration in exchange,\" the footnote states. Thats exactly what Preckwinkles pension proposal does, said Chief Financial Officer Ivan Samstein, who is Preckwinkles point person on the pension issue. \"This is consistent with some value received in exchange for concessions granted, and thats what (the Illinois Supreme Court) essentially stated in the opinion that the state legislature may require additional contributions or other consideration in exchange for granting benefits contemporaneously,\" Samstein said. That general argument is among those being tested in a lawsuit filed against changes Mayor Rahm Emanuel secured for two city pension funds last year. Lawyers argued in court last week that because the city is for the first time guaranteeing adequate funding for those two retirement systems, it is providing a \"net benefit.\", Cook County Circuit Judge Rita Novak said she would rule on that case July 24, which is after the Wednesday County Board vote on the sales tax increase. Although Emanuel is fighting to salvage the changes to pension funds covering city workers and laborers, the mayor has given up on the idea of consideration in his legislative proposal to address the underfunding of retirement accounts for police officers and firefighters. That bill, approved by the General Assembly but not yet sent to Gov. Bruce Rauner, simply seeks to stretch out the timetable for restoring financial health to those two funds. The city also would pour proceeds from a still-unapproved casino into the funds. Thats a reversal for Emanuel, who prior to the Supreme Court ruling had said that any revenue solution for city pension funds must be linked to reform, which is shorthand for reductions in benefits or increased employee contributions. To back its argument, the county commissioned an outside legal opinion from Laner Muchin, a firm that represents employers on labor issues. The county legislation \"could be upheld as constitutional,\" concludes the confidential opinion, which the Chicago Tribune obtained. That conclusion was attacked in an opinion by a deputy to Cook County States Attorney Anita Alvarez, who has been at odds politically with Preckwinkle. The countys legislation, despite buy-in from some county unions, \"unilaterally imposes changes\" that diminish or impair benefits and therefore is unconstitutional, wrote Deputy States Attorney Daniel Gallagher in response to a request from Commissioner Larry Suffredin, D-Evanston, who opposes Preckwinkles sales tax hike. To comply with the contract theory of consideration, changes must be a result of bargaining and not just imposed, Gallagher wrote. He also noted that the health care provision would not benefit all employees and said that guarantee cannot be used \"as an offset for unilaterally imposed cuts to basic annuity benefits that already exist.\", Preckwinkles team contends that unions representing two-thirds of county workers back the measure, a sign that it was the result of negotiation. The debate over the legality of Preckwinkles pension proposal comes as she tries to persuade nine of the 17 County Board members to vote for the sales tax hike, the bulk of which would be used for increased pension fund payments. Included in the pitch is her pledge to consider reducing the sales tax if her pension plan were enacted. If the plan became law and withstood a court challenge, it would substantially reduce how much the county has to pump into the pension system each year. Without the pension changes, the additional amount is nearly $341 million. With them, its about $147 million. Preckwinkle and her aides, however, have made it clear they are not banking on the pension bill being approved, given the partisan gridlock in Springfield and the history of failed attempts by the General Assembly to address problems with pension systems across the state. \"We still believe that pension reform is an essential component of long-term stability, but this has been the topic of the day for 4,000 days now in Illinois,\" Samstein said. hdardick@tribpub.com, Twitter @ReporterHal]", "Date": "20150713", "Author": "[Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cook-county-pension-reform-met-20150713-story.html", "Title": "[Preckwinkle: Pension plan may lower Cook County sales tax. But is plan legal?]"}