{"Content": "[The Islamic State militant group has killed 1,878 people in Syria during the past six months, the majority of them civilians, a British-based Syrian monitoring organization said on Sunday. Islamic State also killed 120 of its own members, most of them foreign fighters trying to return home, in the last two months, according to the Syrian Observatory for Human Rights. The militant group has taken vast parts of Iraq and Syria and declared a caliphate in territory under its control in June. Since then it has fought the Syrian and Iraqi governments, other insurgents and Kurdish forces. Rami Abdulrahman, the head of the Syrian monitoring group, told Reuters that Islamic State killed 1,175 civilians, including eight women and four children. He said 930 of the civilians were members of the Sheitaat, a Sunni Muslim tribe from eastern Syria which fought Islamic State for control of two oilfields in August. Reuters cannot independently verify the figures but Islamic State has publicized beheadings and stoning of many people in areas it controls in Syria and Iraq. These are for actions it sees as violating its reading of Islamic law, such as adultery, homosexuality, stealing and blasphemy. The group, an offshoot of al Qaeda, has also released videos of executions of captured enemy fighters, activists and journalists. It beheaded two U.S. journalists, and one American and two British aid workers this year in attempts to put pressure on a U.S.-led international coalition, which has been bombing its fighters in Syria since September. Abdulrahman, who gathers information from all sides of the Syrian conflict, said that Islamic State had also executed 502 soldiers fighting for President Bashar al-Assad and 81 anti-Assad insurgents. He said that 116 foreign fighters who had joined Islamic State but later wanted to return home, were executed in the Syrian provinces of Deir Al-Zor, Raqqa and Hassakeh since November. Four other Islamic State fighters were killed on other charges, Abdulrahman said. The overwhelming number of the groups victims have been from the Syrian population.cracked down on peaceful pro-democracy protests in 2011. Reuters]", "Date": "20141228", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-islamic-state-executions-20141228-story.html", "Title": "[Islamic State executed nearly 2,000 people in six months: monitor]"}