{"Content": "[An unforeseen flood of revenue is shrinking federal deficits to the lowest level of President Barack Obamas tenure, Congress nonpartisan budget adviser said Tuesday. But in a report that will fuel both parties in their autumn clash over spending, the analysts also warned that perilously high shortfalls will roar back unless lawmakers act. Two weeks before Congress returns from recess, the Congressional Budget Office said it expects this years federal deficit to fall to $426 billion. Thats $60 billion less than it expected in March, thanks to greater-than-expected individual and corporate income tax collections, and less than a third of the record $1.4 trillion gap of 2009 as the government tried fighting off the Great Recession. White House spokesman Eric Schultz said Congress should prevent cuts in agency budgets and fund highways and other projects, saying, \"We need to stay focused on this route and avoid self-inflicted wounds\" like a government shutdown. Annual deficits should fall to $414 billion next year before an aging population and swelling health care costs ignite shortfalls that should sail past $1 trillion in 2025, the budget office said. That would push the governments accumulated debt that year to $21 trillion, or 77 percent the size of the countrys economy, threatening higher interest rates, surging government debt costs and other problems. \"Thats 77 percent and growing,\" budget office director Keith Hall told reporters. \"This is an unsustainable path here for federal debt.\", Republicans said the report underscored the need to curb spending. Congress has already approved a blueprint claiming a balanced budget in a decade by squeezing savings from Medicare and Medicaid, and they want to retain caps on agency spending enacted in a 2011 budget deal. \"Without control over spending, our nation will lose control over its own future,\" said House Budget Committee Chairman Tom Price, R-Ga. Democrats say such cuts are unneeded. Maryland Rep. Chris Van Hollen, top Democrat on the budget panel, said lawmakers should make \"necessary investments\" in education and other programs and said \"serious negotiations\" will be needed to avoid a government shutdown this fall. Though GOP leaders have said they wont let the budget clash spark a government closure as the 2016 elections approach, they may have a tough time winning conservative votes to pass needed spending bills. One major complication is conservatives demands to halt federal spending on Planned Parenthood, whose officials were secretly captured in videos describing how they provide medical researchers with fetal tissue. Blocking that money would lead to likely clashes with Democrats and Obama. The budget office lowered its projection for 2015 economic growth to a modest 2.3 percent, down from its 2.8 percent forecast in January and reflecting a weak first quarter. It projected that growth will return to around 3 percent annually in 2016 and 2017 before dipping again. Those numbers, locked in last month, did not reflect the steep world financial market drops of recent days. Hall said those reductions hadnt yet weakened the worlds economy, adding, \"I dont feel too worried about it.\", This years $426 billion projected deficit would be the smallest since the $161 billion budget gap of 2007. The fiscal year runs through Sept. 30. If the projection proves accurate, this years shortfall would be 2.4 percent the size of all U.S. economic activity, a proportion that many economists consider acceptable. On average over the last 50 years, annual deficits have been 2.7 percent of the economys size. The analysis also said that though the government has reached its legal borrowing limit, this years unexpected extra revenue means the Treasury Department should be able to use accounting maneuvers to free up cash and avoid breaching that ceiling until mid-November or early December. Treasury Secretary Jacob Lew told Congress last month that he can use bookkeeping moves to prevent exceeding the borrowing limit until late October or early November. Those include temporarily taking cash from certain federal pension funds that is restored once Congress enacts a new debt ceiling. Congress often tries using the debt limit fight as leverage with the White House. Wary of angering voters, GOP leaders want to avoid an unprecedented federal default, which could result should the parties deadlock. Associated Press]", "Date": "20150825", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-budget-deficit-forecast-20150825-story.html", "Title": "[Budget report shows shrinking deficits but warns lawmakers to act]"}