{"Content": "[Jonathan Pollard worked as a civilian in U.S. naval intelligence when he carried secrets by the briefcase to the apartment of a secretary at Israels embassy in Washington. His arrest by the FBI made his case the most bombastic of 1985 fabled as Americas \"Year of the Spy\" for its eight major espionage cases. Pollard submitted to seven months of polygraphs and pleaded guilty to one count of transmitting national security information to a foreign government. Because Israel was an ally, his parents in South Bend, Ind. his father, Morris, was a chaired professor and cancer researcher at Notre Dame expected a sentence of 10 years or less. Jonathan Pollard, a former Naval intelligence analyst convicted of spying for Israel, has been granted parole and will be released from prison in November after nearly 30 years, his lawyers said Tuesday. July 28, 2015. (AP), Jonathan Pollard, a former Naval intelligence analyst convicted of spying for Israel, has been granted parole and will be released from prison in November after nearly 30 years, his lawyers said Tuesday. July 28, 2015. (AP), \"Life,\" U.S. District Judge Aubrey Robinson Jr. declared in March 1987. \"No! No!\" shouted Pollards wife, Anne, collapsing to the floor. Her penalty for her role in the scheme: two five-year sentences. She was moved, hysterical, to a holding cell that didnt keep her screams from echoing in Robinsons courtroom. U.S. Attorney Joseph diGenova predicted that Jonathan Pollard would \"never see the light of day again.\" To the chagrin of Israeli prime ministers but with the insistence of several presidents, Pollard has been imprisoned ever since. Tuesdays news that Pollard will be paroled Nov. 21 is a fresh provocation in a 30-year saga. The U.S. Department of Justice says terms of Pollards sentence require that he be freed 30 years after his arrest unless the feds demonstrate that hes likely to commit new crimes. But expect accusations that the Obama administration is setting Pollard free without protest because the White House wants Israel to soften its opposition to the U.S.-brokered nuclear deal with Iran. Why does a spy case from long ago matter so much to so many? Because, like the fresher dispute over the Iranian nuclear threat, it has been a gaping wound in the U.S.-Israel partnership. Pollard, decorated by the Navy for his intel work early on, grew convinced that the U.S. was cozying up to Arab states while not fully sharing crucial information with Israel. In 1984 he approached Israeli air force officer Aviem Sella with an offer so generous that Sella was suspicious. Soon, though, Pollard began delivering thousands of pages of information about Syrian and Iraqi chemical warfare capabilities, Libyan and Syrian air defense systems, Soviet weapons deliveries to Arab nations, Iraqi and Pakistani nuclear weapons programs. Pollard used a \"courier card,\" which made him immune to searches, to spirit materials to Israelis, who quickly copied them in a second apartment and returned them. Pollard at first worked for free, but soon Israel was paying him $1,500 a month, then $2,500. Prosecutors alleged that Israel paid for the Pollards overseas vacations; an Israeli agent allegedly promised Pollard $30,000 a year, delivered to a Swiss account, and that Pollard eventually would be resettled in Israel under the name Danny Cohen. Pollards acceptance of money severely undercut his supporters claims that he was motivated solely by his desire to help Israel. Naval intel officers grew suspicious about Pollards use of documents beyond the scope of his own classified research. Confronted near his Suitland, Md. office, he denied wrongdoing, stalled for time and, during questioning, was allowed to call his wife. After he worked their pre-arranged code word, \"cactus,\" into the conversation, Anne hid a suitcase of classified materials elsewhere in the Pollards apartment building. There never has been a detailed disclosure of what Pollard conveyed. U.S. officials called their losses immense and repeatedly floated the accusation that Israel traded or sold some of Pollards data to China and the Soviet Union. After Pollards trial, his attorneys said federal prosecutors cheated on their plea bargain and, having agreed not to seek a life sentence, essentially let then-Secretary of Defense Caspar Weinberger do it for them: He submitted to the judge two documents, the so-called Weinberger Declarations, purporting to describe Pollards vast damage to U.S. interests. The documents are considered so sensitive that theyve never been revealed feeding charges from Pollards defenders that he couldnt confront the accusations. Pollard later tried to have his guilty plea withdrawn or his life sentence reconsidered. A federal appellate panel ruled against him, and in 1992 the U.S. Supreme Court rejected his appeal without comment. \"Its a great tribute to our system,\" ex-prosecutor diGenova said dryly at the time, \"that even an admitted spy can use our system to the nth degree.\", Continual pleas from Israeli officials and American Jews failed; so many influential people argued for Pollards freedom that Washingtonian magazine dubbed him the Spy with a Fan Club. Now Pollard, who turns 61 next week, will walk. We hope the next chapter of this case brings a full and well-documented disclosure of what Pollard gave to Israel. Questions of what he did, and whether his parole now is just, inform Americas future: This nation survives as is only if the people entrusted with its security keep its secrets from others. For those too young to remember his case or to appreciate its 30 years of tension between allies, Jonathan Pollard should be more than a footnote to history:, We hope other would-be spies keep Pollard top of mind. When people dispute whether 30 years is close enough to keeping you behind bars until you die, maybe youre smarter to protect your countrys intel even from its friends.]", "Date": "20150728", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-jonathan-pollard-spy-israel-iran-edit-0729-20150728-story.html", "Title": "[Jonathan Pollard: 'The Spy with a Fan Club']"}