{"Content": "[BenCarson, retired neurosurgeon turned conservative star, has confirmed that he will seek the Republican presidential nomination in 2016. Carson, who has never run for public office, is expected to be the only high-profile African-American to enter the GOPs presidential primary as he tries to parlay his success as an author and speaker into a competitive campaign against established politicians. \"Im willing to be part of the equation and therefore, Im announcing my candidacy for president of the United States of America,\" he said in an interview aired Sunday night by Ohios WKRC television station. He is set to make a more formal announcement during a speech from his native Detroit on Monday. Carsonearned national acclaim during 29 years leading the pediatric neurosurgery unit of Johns Hopkins Childrens Center in Baltimore, where he still lives. He directed the first surgery to separate twins connected at the back of the head. His career was notable enough to inspire the 2009 movie, \"Gifted Hands,\" with actor Cuba Gooding Jr. depictingCarson. \"I see myself as a member of we the people,\" he told the Associated Press in an interview earlier this year, arguing that his lack of experience is an asset. \"I see myself as a logical American who has common sense,\" he continued, \"and I think thats going to resonate with a lot of American, regardless of their political party.\", The 63-year-old Detroit native remains largely unknown outside of conservative activists who have embraced him since his address at the 2013 National Prayer Breakfast, where he offered a withering critique of the modern welfare state and the nations overall direction. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. The speech restated themes fromCarsons2012 book \"America the Beautiful,\" but he excited conservatives by doing so with President Barack Obama sitting just feet away. Carsonhas since become a forceful critic of the nations first black president on everything from health care to foreign policy.Carsonalso offers himself as a counter to other notable African-American commentators with more liberal views. Most recently,Carsonhas spoken out on the unrest in his hometown, where residents have protested and rioted in the wake of Freddie Gray dying while in custody of the Baltimore Police Department. In a Time op-ed,Carsondecried the protests and related vandalism as \"gross misconduct.\", Carsonmoved to Palm Beach, Florida, after his retirement from Johns Hopkins, but he is announcing his campaign in his hometown of Detroit, where his mother raised him and his brother in poverty. He attributes his politics to his upbringing, often describing his neighborhood culture as one where residents celebrating any new announcement of government support. Still, he acknowledges that his mother received welfare aid, and he insists that he supports \"a safety net for the people who need a safety net.\", Carsonis a staunch social conservative, opposing abortion rights and same-sex marriage, views he attributes to his personal faith as a practicing Christian. He has more complex views on health care and foreign policy, including statements that could put him at odds with the most conservative branches of his party. He has compared the Affordable Care Act, Obamas signature legislative achievement, to slavery. YetCarsonalso has blasted for-profit insurance companies; called for stricter regulations including of prices of health care services; and said government should offer a nationalized insurance program for catastrophic care. Carsonpitches himself as a staunch supporter of Israel in its disputes with other Middle Eastern nations, and he has hammered Obama on his dealings in the region. But in his earlier writings,Carsoncriticized the U.S. for historically being too eager to wage war. Associated Press]", "Date": "20150503", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-ben-carson-president-20150503-story.html", "Title": "[Ben Carson, famed neurosurgeon, running for president]"}