{"Content": "[Gov. Scott Walker leads other Republican presidential candidates in his home state of Wisconsin but trails Democrat Hillary Rodham Clinton there in a potential general election matchup, according to the first statewide poll since Walker announced his candidacy. The Marquette University Law School poll showed Clinton ahead of Walker 52 percent to 42 percent among 802 registered voters in Wisconsin. The margin of error was 4.3 percent on the poll done between Aug. 13 and Aug. 16 in the days following the first Republican presidential debate. The poll showed the U.S. Senate race tightening between incumbent Republican Sen. Ron Johnson and Democratic former U.S. Sen. Russ Feingold. It showed Feingold with 47 percent compared with 42 percent for Johnson. In the April poll, Feingold led Johnson 54 percent to 38 percent. Feingold is seeking a rematch with Johnson, who defeated him in 2010. Feingold had served 18 years in the Senate before the loss. The 2016 presidential primary in Wisconsin is April 5 and the general election, where the presidential and Senate races will be decided, is Nov. 8, 2016. Walker officially joined the presidential race in mid-July, after months of touring around the country in early voting states. In the April poll, three months before he got in the race, his support for president was at 40 percent. But in the latest poll, a month after he and other Republicans got in the race, Walkers support dropped to 25 percent. After Walker, Ben Carson was second highest at 13 percent followed by Donald Trump at 9 percent. That question about the GOP presidential field was of a smaller sample of 334 registered voters who identified as Republican or as independents who leaned Republican. It had a 6.6 percentage point error margin. On the Democratic side, Clinton led with 44 percent while Vermont Sen. Bernie Sanders came in second at 32 percent. That question of 396 Democratic voters had a 6.1 percentage point error margin. The poll also shows Walkers job approval rating is at an all-time low, at 39 percent. It was at 41 percent four months ago, which was also his lowest since the poll was done in 2012. Walker won re-election to a second term as governor in November. Associated Press, ]", "Date": "20150820", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-scott-walker-wisconsin-poll-20150820-story.html", "Title": "[Scott Walker leads GOP rivals in Wisconsin, but trails Clinton in poll]"}