{"Content": "[Vice President Joe Biden stood in front of a room of University of Illinois students Thursday and talked candidly about a subject that has long been taboo on college campuses. His message was clear: It is up to them particularly young men to reject the quiet tolerance of sex assault and stand up against the victimization of women. Gentlemen, silence is a form of approval, he said. You all know the difference between right and wrong. We measure the decency of a nation by whether it condemns or condones this kind of behavior. Biden is visiting college campuses to promote President Barack Obamas Its On Us initiative, which asks Americans to stand up against sexual violence. U. of I. was selected, he said, because students have developed one of the most active campaigns in the country to educate peers and others about sexual violence. The U. of I. program was initiated by the student senate and gained wide support from the administration. In a 30-minute speech that sounded at times like a church sermon, Biden spoke passionately about his decades of work to bring attention to the issue of domestic and sexual abuse. Since Obama rolled out the initiative in September, Biden has visited multiple colleges and universities to encourage an open dialogue about sexual violence. The public awareness campaign is designed to empower students and administrators to take responsibility for preventing sex assaults, an issue that many institutions traditionally have been quiet about for fear of bad publicity. Vice President Joe Biden shows the T-shirt he received from student leaders Sarah Hochman, left, and Matt Hill at Campus Recreation Center Easton on the campus of the University of Illinois in Urbana, Ill. on April 23, 2015. Vice President Joe Biden shows the T-shirt he received from student leaders Sarah Hochman, left, and Matt Hill at Campus Recreation Center Easton on the campus of the University of Illinois in Urbana, Ill. on April 23, 2015. Meanwhile, the numbers have escalated. According to a White House Task Force on sexual assault, 1 in 5 women is sexually assaulted in college, most often by someone she knows. Only 12percent of those assaults are reported, and in those cases, only a fraction of the perpetrators are brought to justice. As a result, many survivors do not report the assault and are left feeling isolated and ashamed. The task force also looked at sexual assaults on men, though they happen less often. Earlier last year, Biden launched a government website to help women seeking information about campus sexual assaults. The website, NotAlone.gov, was introduced during a flurry of publicity, including public service announcements featuring actors such as Daniel Craig, Benicio Del Toro, Kerry Washington and hip-hop artist Common. The PSA specifically speaks to men, calling on them to step up and take action if they witness someone in danger of being sexually assaulted. Over the past year, the issue of sexual abuse on campus has gained attention, but the movement isnt just about talk. From the Chicago City Council to the Illinois General Assembly to the U.S. Congress, lawmakers have been presented legislation that would provide those who have been attacked with more rights and hold colleges and universities accountable for addressing incidents of sexual assault. Illinois Attorney General Lisa Madigan, who spoke to students before Biden arrived, said federal rules, regulations and guidance that address campus sexual assault are scattered and confusing to higher education institutions. She has supported more uniform regulations statewide. The Illinois House on Thursday passed a bill that lays out requirements for colleges and universities. The proposed Preventing Sexual Violence in Higher Education Act would require institutions to develop comprehensive sexual violence policies, including detailed incident reporting options and university response guidelines. It would also require institutions to notify students of their legal rights, such as obtaining an order of protection, changing housing or class schedules, and obtaining medical assistance, as well as require institutions to adopt a fair process for adjudicating allegations and provide a confidential adviser to survivors. The bill will now go to the Illinois Senate. The local legislation would complement a sweeping bipartisan bill introduced in the U.S. Senate in February that not only establishes rights for victims but also would levy stiff financial penalties against colleges and universities that mishandle sexual assault cases. Last year, Mayor Rahm Emanuel introduced an ordinance to the City Council creating a Sexual Assault Victims Bill of Rights that would require each university and college with campuses in Chicago to adopt a uniform bill of rights for students who survived an attack. The student-led effort on the Champaign-Urbana campus comes seven months after the Chicago Tribune reported that the university had paid a $77,000 settlement to a student who accused campus officials of minimizing her sexual assault and complaints even after photographs and a video of the incident were passed around a fraternity house. The university admitted no wrongdoing but agreed to better train staff on how to handle sexual misconduct complaints and revamped its disciplinary process regarding assault allegations. Student body Vice President Matt Hill, a 20-year-old junior from Buffalo Grove, was one of the co-founders of the campus movement. He and others on the student senate had heard about the Its On Us campaign during a national student government conference last summer and decided to start a program on campus. They partnered with the university to produce public service announcements featuring student leaders, sororities and fraternities, and student-athletes to promote awareness. So far, according to Hill, more than 900 students have signed pledges. Already, he said, he can see the culture on campus changing. The problem were addressing is that people dont feel comfortable talking about the issue. Sometimes, they dont even want to say the words sexual assault, said Hill. One of the benefits of what were doing is that people are beginning to open up about it. Biden told students Thursday exactly what to do if they come upon a situation where a woman is in danger of being assaulted. Step in, yell or holler, call somebody. Do whatever it takes to stop it, he said. Guys, its time for all of you to step up. Show some courage and be the man you were raised to be. dglanton@tribpub.com]", "Date": "20150424", "Author": "[Dahleen Glanton]", "Link": "http://www.chicagotribune.com/news/local/breaking/chi-biden-at-u-of-i-20150423-story.html", "Title": "[Biden tells U. of I. students to stand up against sexual violence]"}