{"Content": "[U.S. Sens. Mark Kirk and John McCain, in Chicago on Sunday for an event at the Ukrainian Cultural Center, reacted diplomatically to news reports that their Republican Senate colleague Ted Cruz was expected to announce a presidential bid. Cruz is expected to announce Monday, according to published reports. He would become the first high-profile Republican to formally enter the 2016 presidential race. \"Hes a viable candidate,\" said McCain, of Arizona. Kirk responded to a Cruz candidacy by saying \"the more the merrier.\" Kirk said he is not yet supporting a candidate. McCain said he is supporting Sen. Lindsey Graham, a South Carolina Republican who also is considering a 2016 White House bid. The Arizona senator, who lost the 2008 presidential election to Sen.Barack Obama, said Cruz \"is a very valuable member of the Senate Armed Services Committee\" and is \"very articulate.\", McCain and Kirk met with members of the local Ukrainian-American community to issue their support for Ukraine in its conflict with Russia. McCain has been one of the most vocal U.S. advocates for providing the Ukrainian government with help to protect its citizens against Russian aggression. \"Can we, in the name of God, give the Ukrainian people weapons to defend their own sovereign country?\" McCain said to a packed hall at the community center. Before his speech, McCain told selected guests, including Ukrainian diplomats, \"Im sorry we havent done more. Im sorry we have a president who refuses to help. Im not here as a Republican, but Im here as a person who wants to see Ukraine not be dismembered.\", McCain joked that because he has been sanctioned by Russian PresidentVladimir Putin for his position and comments on the conflict, \"It means I cant spend spring break in Siberia.\", Kirk, who called McCain his hero, told the crowd he believes the U.S. needs to supply Ukraine with \"offensive lethal weaponry.\", Kirk also has been an outspoken critic of Russia and in February signed a bipartisan letter urging Obama to increase military assistance to Ukraine. He co-sponsored 2014 legislation authorizing U.S. aid to Ukraine while imposing sanctions on Russia. The outspoken Cruz, 44, has been criticized at times by members of his own party, including McCain. But he has won praise from tea party activists and others conservatives for leading the GOPs push to shut down the federal government during an unsuccessful bid to block funding for the federal health care law. He has established himself as an uncompromising conservative who may appeal to the GOPs libertarian and socially conservative wings. The Houston Chronicle reports Cruz, elected to the Senate in 2012, will announce his presidential bid Monday at a convocation ceremony at Liberty University in Virginia. If he announces as expected, Cruz is likely to be followed by several big names in the GOP, including former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker and two Senate colleagues, Kentuckys Rand Paul and Floridas Marco Rubio. The Associated Press contributed. poconnell@tribpub.com]", "Date": "20150322", "Author": "[Patrick M. O'Connell]", "Link": "http://www.chicagotribune.com/news/ct-kirk-mccain-ukrainian-met-20150322-story.html", "Title": "[ McCain, Kirk weigh in on a Ted Cruz presidential campaign]"}