{"Content": "[Shootings over the Fourth of July weekend left 10 people dead and 55 others wounded, a toll lower than last year but one marked by an intense stretch of gun violence over eight hours on one of the nights. Among those killed was 7-year-old Amari Brown, shot in the chest as he watched fireworks near his fathers home in Humboldt Park late Saturday night. Police say they believe the attack was aimed at the father, whom they described as a ranking gang member. Mayor Emanuel and CPD Superintendent McCarthy respond July 6, 2015, to another violent weekend after increased security efforts by Chicago police. The youngest victim of this past weekends gun violence was a 7-year-old boy; police say the boysfather was the intended target. (WGN TV), Mayor Emanuel and CPD Superintendent McCarthy respond July 6, 2015, to another violent weekend after increased security efforts by Chicago police. The youngest victim of this past weekends gun violence was a 7-year-old boy; police say the boysfather was the intended target. (WGN TV), Also gunned down was 17-year-old Vonzell Banks, who was shot as he played basketball Friday at a park named for Hadiya Pendleton, a high school student fatally shot in 2013 near President Barack Obamas Chicago home. The wounded included a 16-year-old boy and a 15-year-old girl shot shortly after midnight Sunday as they walked in Old Town, and a 19-year-old man shot around 10 p.m. Saturday as two groups fought near Navy Pier after the fireworks display there. The violence peaked from dusk Saturday until dawn Sunday, when 30 people were shot across Chicago -- nearly half the total for the entire weekend, measured from 3 p.m. Thursday until just before dawn Monday. Last Fourth of July, 82 people were shot, 16 of them fatally, over 84 hours. Five of those shot were wounded by police. There were no police-involved shootings this year. The shootings this Fourth of July were primarily scattered across the South and West sides. Englewood -- the police district with more shootings than any other in the city so far this year -- did not have a single person shot over the holiday weekend. A number of other neighborhoods saw several shootings: Little Village, four people shot; Back of the Yards, six shot; and the Austin neighborhood, eight people shot. Two North Side neighborhoods -- Old Irving Park and Albany Park -- each had shootings in which three people were wounded. One man died in the Albany Park shooting. Chicago Police Superintendent Garry McCarthy said the weekend outbreak in violence shows the number of officers working the streets isnt as critical in preventing shootings as having effective gun laws that put gun offenders behind bars for a long time. McCarthy has long contended that Illinois sentencing laws for gun crimes are too lenient. \"If you think that putting more cops on the street would make a difference, then take a look at the fact that we put a third more manpower on the street for this weekend,\" McCarthy said. \"Whats the result? Were getting more guns. Well, thats great. Its not stopping the violence. \"And its not going to stop the violence until criminals are held accountable and something is done to stem the flow of these guns into our city.\"]", "Date": "20150706", "Author": "[Peter Nickeas]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-violence-20150706-story.html", "Title": "[10 killed, 55 wounded in Fourth of July gun violence in Chicago]"}