{"Content": "[Money. Even in this age of debit cards and online banking, cash still passes through the hands of most of us on a regular basis. It still symbolizes power and privilege, as well as compensation and investment. It is an integral part of our society, our culture and, of course, our economy. The male faces that grace our paper money are a constant reminder of the contributions those men made to this country. All fine and good, but male isnt the only gender of those who helped build, strengthen, fix, improve and grow our nation. Believe it or not, women have been there from the beginning. So when the U.S. Treasury Department announced last week that soon we will see a womans face on the $10 bill, all I could think was, \"Wow, what took us so long?\", Sure, there were the Susan B. Anthony and Sacagawea dollar coins, both in limited circulation, hammering home the message that women can only be promoted, celebrated and recognized on a limited, lesser-than-men basis. Martha Washington is the only woman to have her portrait on a U.S. currency note. It was on a $1 silver certificate, but was short-lived. Pocahontas also appeared on currency in the 1800s, but not in portrait style. So, yes, its high time. Granted, $10 cant buy today what it could back in Alexander Hamiltons time, but sometimes face value can be priceless in terms of conveying a message of opportunity, equality and progress. Treasury Secretary Jacob Lew is expected to announce later this year which woman the newly minted bill will feature. Meanwhile, the public gets its say. Vote via Twitter at #TheNew10. The criteria: The selection must be a woman who is deceased and who symbolizes the theme of democracy. The new bill wont make its debut until 2020, the 100th anniversary of the 19th Amendment, which gave American women the right to vote. That prompted a Twitter campaign all its own. Do we really need an anniversary or another five years to get this up and running? And if were going to wait until 2020, why not raise the bar and go with 20s all the way around?, On that note, some people are taking issue with the fact that the Treasury Department is changing its use of Hamiltons image but keeping controversial Andrew Jacksons mug on the $20 bill. That started a #DumpJackson campaign. On the upside, the long wait gives us plenty of time to revisit, retell and recelebrate the large pool of potential candidates. Among them: Harriet Beecher Stowe, Harriet Tubman, Amelia Earhart, Jane Addams, Sally Ride, Eleanor Roosevelt and, of course, Susan B. Anthony. To help pare the list, I asked certain members of the public people who know a bit about historical accomplishments whom they would like to see on the 10-spot. William Kresse, assistant professor of accounting at Governors State University, said Elizabeth Cochrane. \"She went by the pen name Nellie Bly and was the mother of investigative journalism,\" he said. Kresse chose Bly because he has a great respect for journalists role in a democracy. \"She created a type of journalism that is essential for survival of a free society,\" he said. \"She was way ahead of everyones time.\", Joyce Cruse, social studies instructor at Richards High School in Oak Lawn, said, \"Women and their achievements have been marginalized throughout U.S. history and that has been reflected in most U.S. history textbooks and courses. \"As you know, there are many ways in which women remain marginalized today,\" she said. Her choice for the new 10?, \"Personally, I would be very torn between Eleanor Roosevelt and Gloria Steinem,\" she said. \"Both women worked tirelessly for others. I would also add to the list Abigail Adams, Jane Addams, Dorothea Dix, Susan B. Anthony, Jeannette Rankin and Betty Friedan.\", Ed Bara is an adjunct professor of history at Trinity Christian College in Palos Heights. For years he taught Chicago history at Andrew High School in Tinley Park. He said in considering how to bestow such an honor, he looked for a woman who went against the existing attitudes, pushed for or advocated new ideas and stood her ground against opposition and existing ideas. Falling within that range, he said, are five women:, Abigail Adams, who told her husband, John Adams, when he was chosen to help write the Declaration of Independence that he should not forget the women. Anthony, who advocated in this order: temperance, abolition and womens suffrage. Addams, a single woman who worked to improve the community and civic life in Chicago. She also founded the settlement house movement. Roosevelt, who, while husband Franklin was busy with economic reforms, became the spokesperson for the underprivileged and for minorities. She pushed for social reform and civil rights. Elizabeth Cady Stanton, a social activist, abolitionist and member of the Seneca Falls Convention, considered to be the seed of the womens rights movement. \"There are many others,\" Bara said. \"Clara Barton, Susan B. Anthony, Harriet Beecher Stowe, Dolly Madison, Rosa Parks, but these women were more parts of movements already in motion.\", Gina Hanna, social studies teacher at Shepard High School in Palos Heights, voted for Roosevelt. \"Even though I think we cannot forget the contributions of Alexander Hamilton to our young nation, it is time we recognize our great women in the same manner,\" she said. \"It will be a huge shift in thinking for most Americans to accept a woman on our currency but if we are not growing as a nation and evolving as humans, we are not living. \"With the very real possibility of our first female president coming in 2016, I hope Americans will eventually embrace this idea,\" she said. \"Who knows, maybe the $100 bill is next.\", dvickroy@tribpub.com]", "Date": "20150621", "Author": "[Donna Vickroy]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-vickroy-women-st-0622-20150621-story.html", "Title": "[Teachers weigh in on which woman should be on new $10 bill]"}