{"Content": "[As Nigerians celebrated the electrifying victory Wednesday that returned one of its harshest former dictators to power, sobering challenges confront Muhammadu Buhari, from anIslamicinsurgency that has killed thousands to widespread poverty and graft. The 72-year-old Buhari made history as the first opposition party candidate to win elections in Africas most populous nation, ending President Goodluck Jonathans bid for another term. For a former general who three decades ago led Nigeria following a coup, it was an amazing transformation to a democratically elected president. Celebrations on the streets of Nigerias Kano City as fellow northerner Muhammadu Burhari officially becomes president. Celebrations on the streets of Nigerias Kano City as fellow northerner Muhammadu Burhari officially becomes president. Fresh from his victory, Buhari warned the countrys brutal Boko Haram insurgents that he would be coming after them. \"Boko Haram will soon know the strength of our will and commitment to rid this nation of terror,\" he said Wednesday as he received a certificate attesting to his victory. \"We shall spare no effort until we defeat terrorism.\", The bespectacled president-elect also warned that corruption would not be tolerated after he takes office on May 29. As Nigerias leader three decades ago, he returned lootedstateassets to government coffers, but his so-called \"war against indiscipline\" also sent soldiers into the streets with whips to enforce traffic laws and imposed humiliating punishment on tardy civil servants. His regime executed drug dealers, jailed journalists critical of the government and passed laws that allowed indefinite detention without trial. Buhari, who insists he has undergone radical change since then and now embraces democracy, pledged Wednesday to take on the twin scourges of corruption and anIslamicuprising he said has \"challenged Nigeria to its limits.\", Nigerian President Goodluck Jonathan has conceded defeat to president-elect Muhammadu Buhari. (Reuters), Nigerian President Goodluck Jonathan has conceded defeat to president-elect Muhammadu Buhari. (Reuters), \"Corruption attacks and seeks to destroy our national institutions and character ... distorts the economy and creates a class of unjustly enriched people,\" Buhari said, wearing splendid white robes with gold embroidery. \"Such an illegal yet powerful force soon comes to undermine democracy because it has amassed so much money that they believe they can buy government.\", Boko Haram, whose barbarous campaign to establish anIslamic\"caliphate\" has driven 1.5 million from their homes, kidnapped hundreds of schoolgirls and left large swathes of northern Nigeria burned to ashes, has in recent weeks been hit hard by forces from Nigeria and neighboring Chad, Cameroon and Niger. Buhari ruled Nigeria for less than 20 months before being deposed by a coup in 1985 amid wide dissatisfaction that he had been slow to overcome the nations economic problems. It may be deja vu for Buhari when he takes over the presidency: Nigerias economy, Africas biggest, is suffering again because of low oil prices. The country is Africas biggest oil exporter and the government is heavily dependent on oil sales for its revenues. The 2015 budget has already been slashed because of slumping oil prices, and the value of the local naira currency has plummeted. New scanners to confirm voters biometric identity cards are credited with reducing voter fraud a factor in previous elections though the machines did not work at about 300 of the 150,000 polling stations. Jonathan, whose party has governed Nigeria since decades of military dictatorship ended in 1999, conceded with grace late Tuesday, saying, \"I promised the country free and fair elections. I have kept my word.\", In a continent where there have been cases in which a sitting president refused to accept defeat at the polls and violence resulted, the turn of events in Nigeria was welcomed by Nigerians and foreign leaders alike. In the northern city of Kaduna, thousands celebrated in the streets, shouting \"No Boko Haram! No Boko Haram!\" Many danced and held up posters of Buhari, waving brooms to symbolize his pledge to sweep out corruption. Jubilant youths did wheelies on their motorbikes, while dozens of supporters climbed onto a police car as officers looked on. In front of Buharis home in Abuja, supporters gathered amid flags and debris from last nights victory celebrations. Dignitaries came to meet Buhari, including U.S. Ambassador James Entwistle and Linda Thomas-Greenfield, assistant secretary ofstatefor African affairs. President Barack Obama earlier hailed the election outcome. \"President Jonathan has placed his countrys interests first by conceding the election and congratulating President-elect Buhari on his victory,\" Obama said in a statement. \"I look forward to working with President Jonathan throughout the remainder of his term, and I thank him for his many years of service and his statesmanlike conduct at this critical juncture.\", Jonathans concession has defused tensions and fears of post-election violence. Some 1,000 people died and 65,000 were made homeless in riots in the countrys Muslim north after Buhari lost to Jonathan in 2011. Results from Saturdays election show Buhari winning votes across religious, tribal and geopolitical lines. Because of decades of military rule this was only the eighth election since Nigeria won independence from Britain in 1960, and the fifth since democracy was restored in 1999. Associated Press]", "Date": "20150401", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-nigeria-buhari-election-20150401-story.html", "Title": "[As Nigeria celebrates Buhari's stunning win, challenges loom]"}