{"Content": "[Chase is out and PNC Bank is in, providing the Chicago Bears investment and banking services as part of a new multimillion-dollar marketing deal. Bet someone at Chase was supposed to flag Jay Cutlers $126.7 million deal as suspicious. Astronomers have discovered what they believe is the universes largest known structure. A so-called supervoid, its a blob 1.8 billion light years across. Its vast, cool emptiness among the stars surpasses even E! Entertainment Television. Original Kraft Macaroni & Cheese sold in the United States next year no longer will include artificial preservatives or synthetic colors. Youll find a powdered cheese-based product, just as nature intended. \"Weed 3: The Marijuana Revolution\" and \"High Profits\" produced high ratings and a bit of buzz for CNN over the weekend. How long before CNN calls itself the Cannabis News Network? Slogan: CNN Weve Gone to Pot. Of course you watch that stuff on CNN and soon you find yourself craving Food Network. A plane carrying Serbias president went into a nearly disastrous plunge Friday when the co-pilot spilled coffee on an instrument panel and hit a switch while cleaning up. Good to see the same stringent safety standards as in Sector 7-G of Springfields nuclear plant on \"The Simpsons.\", A new study from Gallup finds 51 percent of U.S. managers \"checked out\" and 14 percent actively disengaged. This might concern the 35 percent of managers who are fully engaged with their work if they had time to read it. Isis is off the U.N.s World Meteorological Organization official list of future hurricane names because its been tainted by ISIS, which cant be downgraded soon enough to just a lot of wind. It was 151 years ago Wednesday that Congress authorized the U.S. Mint to put \"In God We Trust\" on coins. Then as now, however, Congress itself had to be kept under close supervision. philrosenthal@tribpub.com, Twitter @phil_rosenthal]", "Date": "20150421", "Author": "[Phil Rosenthal]", "Link": "http://www.chicagotribune.com/business/columnists/ct-rosenthal-margin-call-0422-biz-20150421-column.html", "Title": "[Besides PNC Bank interest, what got NFL Bears to give up Chase?]"}