{"Content": "[A recent article in The New York Times explained correctly and succinctly the steps that would follow a congressional decision not to approve the agreement the Obama administration negotiated with Iran to curb that countrys development of a nuclear weapon. In the course of doing so, however, the author repeated an error that perpetuates a grave and consequential and common misunderstanding of how Americas separated-powers government is supposed to work. Setting up the discussion to follow, the article posed this question: \"According to the Constitution, the president is responsible for the nations foreign policy. Why does Congress get a say on the Iran nuclear deal?\", Im not quite sure what Constitution the writer was referring to, but it clearly wasnt ours. There is not a single word anywhere in the United States Constitution that places Americas foreign policy within the presidents jurisdiction. In fact, it repeatedly does the exact opposite precisely because the Constitution lays out a system of governmental decision-making that deliberately withholds most traditional head-of-state powers from the American president and places almost every serious power of government in the hands of the peoples elected representatives in Congress. An American president is head of state, but he is deliberately not the head of government and that holds true on foreign policy questions as well. Here is a paraphrase of the entirety of the constitutional grant of presidential authority in the area of foreign affairs: The president may make treaties only with the consent of the Senate. To repeat, unless Congress approves, theres no treaty. Even if a majority of the Senate agrees with the president, thats still not enough; in todays Congress, it takes 68 people to make a treaty the president and two-thirds of the Senate. The president may \"nominate\" (that is, he may suggest) Americas ambassadors to other countries, but its not an appointment; the nomination has absolutely no force unless the Senate agrees. In fact, the only actual authority the president has in the entire foreign policy arena that does not require congressional approval is to \"receive\" ambassadors appointed by other countries to represent them in Washington. If these newly appointed ambassadors want to drop by and say hello, they can pop in and introduce themselves to the president or whoever he designates. Thats it. So where is the actual constitutional authority in foreign affairs?, Turning treaties into something more than unenforceable paper agreements and actually appointing ambassadors are congressional powers. So are: deciding what countries shall receive foreign aid and how much theyll get; deciding whether to declare war; regulating all American commerce with foreign nations (trade agreements, tariffs, etc.); deciding how to punish violations of international law; making the rules regarding military captures on land and sea. Who decides who will chair the Joint Chiefs of Staff, who will be promoted to the rank of admiral or general, who will be Americas secretary of state or its ambassador to the United Nations? In each and every case authority rests in the Congress, not the White House. If Congress sometimes is lax in exercising its authority, that does not constitute a transfer of power it is merely a decision not to use it in the particular case. An example that had real consequences: When President Ronald Reagan decided to provide U.S. aid to the rebel forces in Nicaragua, Congress stopped him. And when his administration tried to skirt the law, the scandal tainted the rest of his presidency. When it was later decided to turn the spigot back on to allow nonlethal aid to those same rebels, who decided? Again, it was Congress call. This is not a minor issue. The Founders were well aware of the ability of European kings to make treaties and send their publics to war; here, it was decided, those things could not happen unless the people themselves, through their elected representatives, agreed. So where does this endlessly repeated false claim that foreign policy is exclusively in the presidents domain come from? In 1936, in the Supreme Court case the U.S. v. Curtiss-Wright Export Corp. the court found that a congressional delegation of authority to the executive branch was legitimate. The issue was not what the president could do but what the Congress could do, and the court held that Congress had acted within its authority. In that case, Justice George Sutherland, in an observation that had no actual bearing on the issue itself (the legal term is \"dicta,\" which essentially means \"personal opinion\"), declared that presidents had an overriding plenary power in the field of foreign affairs. But in upholding that finding in subsequent cases, the court repeatedly fell back on the fact that the president was acting in accord with Congress. Nearly two decades later, in the 1952 Supreme Court case Youngstown Sheet and Metal v. Sawyer, Justice Robert Jackson referred back to the Constitution itself and declared that presidential authority was at its strongest when the president was acting in accord with Congress, less so if the Congress had merely remained silent on the matter, and at its very weakest when the president attempted to act contrary to Congress. This is no mere exercise in technical nitpicking. In cases ranging from presidential claims of executive privilege or the right to decide for themselves whether they would be bound by the law (George W. Bush was particularly egregious in asserting these extra-constitutional powers) to holding prisoners indefinitely without charges, eavesdropping on citizens emails and phone calls, etc. the question of how much a president may or may not do on his own say-so is the single most fundamental issue in American governance. To assert, incorrectly, that this is an area in which authority rests with the president and not with the peoples Congress is not a minor error; federal powers are diffuse for a reason and the fact that the big questions are left to the people themselves, through their representatives, is at the very essence of what makes us different. There are no Vladimir Putins in our White House and so long as we remember where authority resides, and why, there never will be. Former U.S. Rep. Mickey Edwards served as ranking Republican on the House subcommittee on foreign operations. He is a vice president of the Aspen Institute. ---]", "Date": "20150916", "Author": "[Mickey Edwards]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-constitution-iran-president-congress-perspec-0917-20150916-story.html", "Title": "[A serious misunderstanding about foreign policy]"}