{"Content": "[The Republican presidential candidates will square off Wednesday for their second debate at the Ronald Reagan Presidential Library in Simi Valley, Calif. where immigration is sure to be a topic of discussion. Its unlikely, however, that any of the candidates will follow the example of Reagan himself, who signed the 1986 Immigration Reform and Control Act, giving more than 3 million unauthorized immigrants a path to citizenship. Instead the air will likely be filled with anti-immigrant bombast and facile sound bites about unworkable ideas. Recent statements include a reference to an \"invasion\" by Bobby Jindal, himself the child of immigrants; calls to triple the Border Patrol by Ted Cruz, who was born in Canada and whose father benefited from our most generous refugee laws; references to Asian \"anchor babies\" by Jeb Bush, whose wife was born in Mexico; contemplation of a wall along the Canadian border by Scott Walker; and, of course, the reference to Mexicans as rapists by Donald Trump of New York City, the beating heart of our \"nation of immigrants.\", There will also be facile policy proposals, like hugely expensive walls, economically and morally calamitous mass deportations, and radical calls to amend the U.S. Constitution to eliminate birthright citizenship. The shame of it is that the United States is the most successful experiment in building a \"nation of immigrants\" in world history. We actually know what works and what doesnt. Our history teaches us that what works is not \"liberal\" or \"conservative,\" but rather common sense. So lets have a debate about what actually works:, A nation of equals works. A huge underclass of poverty-level workers who have no stake in our democracy does not. Lets debate a path to citizenship for the undocumented, and get back to our democratic fundamentals. Learning English works. Immigrants want to learn English, because it helps them earn more for their families and talk to their neighbors. Lets debate a national campaign to help them to do so. Family-based migration works. In the U.S. the engine for \"immigrant integration\" is family, not government. Your family and your place of worship help you to find a job, get an apartment and start a business. Lets debate \"family values\" and the wisdom of current proposals to move away from family toward economic points in deciding who comes to this nation. Birthright citizenship works. In the U.S. you are a citizen and equal because you were born here, and that creates hope and ambition. In Europe your citizenship is in most cases based on where your parents are from, resulting in third-generation Turkish Germans who speak only German but still cannot vote in Germany. So lets debate whether we seriously want to be more like Europe!, Immigrant entrepreneurship works. Immigrants or their children founded 40 percent of our Fortune 500 companies. Immigrants are twice as likely as the native-born to start a business. Lets debate the role of immigrants as job creators. What works? Just ask new Americans themselves. They are advancing a \"New American Dreams\" platform that contains these types of common-sense approaches. Beyond that, our nation also knows that bigotry and hysteria dont work. The hatred toward the Irish in the 1850s, the Chinese Exclusion Acts of the 1880s, hysteria regarding Jewish \"Bolsheviks\" and Italian terrorists and criminals in the 1920s, mass deportation of Mexicans (including U.S. citizens) during the Depression and internment of the Japanese during World War II are now all sources of national shame. But immigrants also know that democracy works. New Americans were naturalized and started voting in massive numbers after the 1994 anti-immigrant Proposition 187 in California, turning that state from Reagan Republican to solid blue. Immigrants angry over the passage of a strong anti-immigrant bill passed by the U.S. House in 2005 marched, naturalized and then voted in massive numbers. Their votes helped usher Democrats into control of Congress and President Barack Obama into the White House. In 2012, Republican candidate Mitt Romney effectively \"self-deported\" his White House chances with anti-immigration rhetoric that resulted in some 70 percent of the 15 million Latino and Asian voters going for Obama. This year will be no different. The day after the Republican debate is Citizenship Day, a national event that commemorates the signing of the Constitution and recognizes all who, by coming of age or by naturalization, have become U.S. citizens. Across the nation immigrant rights coalitions are hosting 40 naturalization workshops and launching naturalization and voter registration campaigns with an eye toward 2016. So as the Republican presidential candidates take the stage Wednesday and the rhetoric begins to fly, they may want to keep in mind that Latinos, Asians and other new Americans understand that in November 2016, whoever wins the GOP primary will have to face all of the voters in this nation. Eva Millona is co-chair and Joshua Hoyt is executive director of the National Partnership for New Americans.]", "Date": "20150914", "Author": "[Eva Millona, Joshua Hoyt]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-immigration-republican-debate-perspec-0915-20150914-story.html", "Title": "[A deeper debate on immigration is welcome]"}