{"Content": "[Hours after reportedly calling on U.S. Sen. Mark Kirk to halt his re-election bid, a major Republican fundraiser backtracked Tuesday and hailed Kirk as the partys best candidate for one of the nations most hotly contested Senate seats. Republican businessman and fundraiser Ron Gidwitztold Crains Chicago Business that Kirks recent misstatements and gaffes have put the Illinois GOP on the defensive. \"I call on him to step aside and allow other Republicans to seek his seat,\" Gidwitz told Crains. See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. Asked about the comments later, Gidwitz told the Chicago Tribune he believes \"Mark Kirk is the strongest candidate to win the seat. I fully support his re-election.\" Crains also acknowledged that Gidwitz sought to retract his earlier comments. Still, Gidwitzs initial comments underscore the uncertainty many Republicans have privately expressed toward Kirks re-election chances in 2016 a presidential year in which Illinois traditionally trends Democratic. Illustrating the early intensity of the Senate contest, Kirk has found himself facing criticism over a series of controversial statements. In February, Kirk said \"coffins\" should be placed outside Democratic offices if the Department of Homeland Security were to be shut down in a budget dispute. Last month, Kirk joked over an open microphone that his colleague, Sen. Lindsay Graham, R-S.C. was a \"bro with no ho\" because he was unmarried. This month, Kirk questions at a Senate panel made it sound as though he thought the Consumer Financial Protection Bureau was collecting personal data on Supreme Court justices and members of Congress. Shortly before that, Kirk, an outspoken opponent to the multination Iran nuclear deal led by the White House, accused President Barack Obama of wanting to \"get nukes\" to the country. Kirk apologized for the Graham comment and acknowledged that his Obama Iran comments were just \"me being too carried away with\" his opposition. Kirk, who suffered a major stroke in January 2012, already was facing a difficult bid for a second term for a seat that Democrats view as one of their top targets next year. Kirk has enlisted the resources of the Illinois Republican Party to help with his re-election, and he has the backing of GOP Gov. Bruce Rauner, whom he actively campaigned with last year. Seeking the Democratic nomination are two-term U.S. Rep. Tammy Duckworth of Hoffman Estates and Andrea Zopp, former chairman of the Chicago Urban League. Duckworth has been endorsed by the Democratic Senatorial Campaign Committee, a move criticized by Zopp and her supporters. rap30@aol.com]", "Date": "20150729", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-mark-kirk-gidwitz-comments-met-0729-20150728-story.html", "Title": "[Top Republican donor takes back call for Kirk to quit Senate race]"}