{"Content": "[The latest fallout of Aaron Schocks inglorious descent from up-and-coming politician to the subject of a federal grand jury investigation takes place Tuesday, when central Illinois primary voters will decide the nominees who will vie to replace the former congressman. Five men three Republicans and two Democrats are seeking a primary nomination in the vast 18th Congressional District, which stretches on the north from the outskirts of Peoria to the southern suburbs outside Springfield and from small towns east of Bloomington westward to Quincy and the Mississippi River. The district encompasses all or part of 19 counties, including some of the states most valuable farmland. But its also one of the most heavily Republican districts in Illinois. Schocks rapid downfall amid questions about his office and campaign spending has added to a crisis in confidence in government in a district known for rock-ribbed conservative values. Candidates in the unusual special election are trying to restore faith with voters that dissipated when Schock resigned at the end of March after six years in Washington. \"You get a real reaction when you campaign here. Everything from people who are upset with what (Schock) did and really angry to people who are disappointed, people that are saddened, people that are soured on politics, people who think that a young guy like this that had the world in his palm, that if it could happen to him, it could happen to anybody,\" said state Sen. Darin LaHood of Peoria, one of the three Republicans seeking the congressional nomination and entry into the Sept. 10 special general election. \"People are genuinely just sad, but the bottom line is that people want reassurance that this isnt going to happen again, that somebody with integrity is going to take this job,\" LaHood said. The LaHood name is a familiar one to voters in central Illinois. LaHoods father, Ray, served as the districts Republican congressman from 1995 until 2009, when he was named as Democratic President Barack Obamas transportation secretary a position he left in 2013. Before his election to Congress, Ray LaHood was chief of staff to his predecessor, Robert Michel, who was House Republican leader. The younger LaHood, a former federal prosecutor and 4 1/2-year state lawmaker, is more conservative than his father. But the family connection has been sharply criticized by Mike Flynn, LaHoods chief rival for the nomination. Flynn, a Quincy native, co-founded the conservative website biggovernment.com with Andrew Breitbart. Flynn has said voters deserve better than \"a retread and a family hand-me-down\" and said the seat should not be \"passed down like a family heirloom.\", \"In my life, I have never seen a wider gulf between the voters and the elected officials. They live separate lives. They dont even understand the challenges we face,\" Flynn said at a recent debate in Springfield. \"This election and this campaign is about changing that. This is about giving you your voice back in this district,\" he said. Darin LaHood dismissed the family connection. \"I spent 10 years as a state and federal prosecutor before I ever got into politics, so I have my own background, my own record,\" he said. In the Republican race, LaHood far and away has the money advantage, raising $997,306 compared with Flynns $69,942. LaHood also has secured endorsements from Gov. Bruce Rauner, former Gov. Jim Edgar and most of the GOP county chairmen in the district. The third candidate in the GOP contest, Donald Rients, of Benson, has raised $6,828, federal records show. \"I understand the people of the district, best friends and farmers. I felt I had to run for this,\" said Rients, a technical manager for an insurance company. \"I wanted to see somebody in there that is going to do what they say, somebody that will do their best for the people of this district.\", The three Republicans share similar stances opposing abortion, gun control and same-sex marriage, and each vows to protect religious liberty as a result of the recent Supreme Court decision overturning state bans on gay marriage. But LaHood has sought to position himself further to the right, and counter Flynn, by criticizing the current Republican leadership in Washington amid what he contends is abundant mistrust of the federal government in the district. \"You would never know the Republicans took over the U.S. Senate because I dont think theyve laid out a lot of ideas and been bold and proactive on Republican principles, laying out a road map for how well lead,\" LaHood said. On the Democratic side, Rob Mellon, a history teacher and military veteran from Quincy, and Adam Lopez, a financial adviser and member of the Springfield school board, are seeking the nomination. Mellon lost a two-man Democratic primary to challenge Schock last year. Lopez, first elected to the Springfield Board of Education in 2013, is campaigning on his support of organized labor. Like the Republican contenders, the Democrats are vowing to restore trust with the voters. rap30@aol.com]", "Date": "20150704", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-schock-primary-met-0705-20150704-story.html", "Title": "[ Trust a big issue in race to replace scandal-plagued Schock ]"}