{"Content": "[A few years ago, my son got a job at a Boy Scouts summer camp. When he came home, he shared stories about camp and some of the other adult leaders who served as camp counselors or teachers. One of them, he told us, was gay, and it wasnt a big deal. Of course, if he admitted he was gay, it would have been a big deal because, at the time, gay adult leaders were banned from Boy Scouts. That policy came to a rather quiet end last week when Robert Gates, former U.S. defense secretary and current president of Boy Scouts of America, announced the end to that ban. Over the years, Ive seen this issue tear apart local Scouting communities and the local service organizations that fund them. Ive seen families quit Boy Scouts and join other groups over the issue. And Ive seen community groups stop funding local Boy Scout troops because of it. I decided to stay in Scouting with my sons throughout the debate for a couple of reasons. First, I wanted the positive influence Scouting would have on my sons, and second, I thought it best to work to change policy from within. Seems the strategy has worked. And heres why I think internal advocacy has had a greater impact than any outside pressure applied by social action groups:, The media says the old policy was a ban on adult gay leaders. It never explains a simple fact. If you are a parent or legal guardian of a boy in Scouting, you are an adult leader. Its less common for Scouts to have strangers stepping forward, applying for jobs as adult leaders and being screened and interviewed for the jobs. Although that is a procedure for paid positions, its not the case at the individual troop level, where the real interaction between Boy Scouts and adult leaders occurs. Basically, the adult leaders most Boy Scouts deal with on a regular basis are the moms and dads of the other boys in their troop or den. And, yes, women are active in Boy Scouts, also. Over the years, society has changed to the point where it is more and more likely that a boy coming into Scouting might have two moms or two dads. That simple fact under the ban would have put local Scout leaders in the position of denying a mom or dad the opportunity to spend time with their son at meetings, merit badge workshops and camping trips. I dont think that was going to happen. So policy change or not, gay adult leaders was going to happen. It probably already has. There is a need to protect young people from sexual predators and pedophiles. As we have all learned over the years, homosexuality does not equate with pedophilia or other sexual deviance any more than heterosexuality does. And no matter anyones sexual orientation, sex in any shape or form has no place in Scouting. It just isnt appropriate. So the idea that a gay leader might start teaching Scouts about being gay is just nonsense. Its inappropriate for leaders to talk about sexuality at all. Finally, adult leaders are offered training in youth protection, so we are on the lookout for behavior, talk and activity that is inappropriate with Scouts. Scouting is about developing leadership and outdoor skills for boys. For years, weve been teaching boys to treat everyone equally and fairly. And now it is happening. Randy Blaser is a freelance columnist for Pioneer Press.]", "Date": "20150729", "Author": "[Randy Blaser]", "Link": "http://www.chicagotribune.com/suburbs/evanston/lifestyles/ct-evr-blaser-boy-scouts-tl-0806-20150729-story.html", "Title": "[Randy Blaser: Boy Scouts move to allow gay leaders long overdue]"}