{"Content": "[Early in Mission: Impossible Rogue Nation, the Senate Intelligence Committee is holding a hearing on whether to disband the Impossible Mission Force that gives the film franchise its name. Theres a curiosity about the scene: The seven or eight senators sitting on the dais are all men. My wife and I turned to each other in astonishment. In this day and age, no one thought to seed the group with a woman or two, even among the nonspeaking extras. Who on earth would make such a mistake?, The answer seems to be, just about everybody. Thats the conclusion of this weeks report from the Media, Diversity, and Social Change Initiative at the Annenberg School for Communication and Journalism at the University of Southern California. The study analyzed the top 100 films in domestic box office from 2007 through 2014 (excluding 2011) and found that of 30,835 characters with speaking parts, only 30.2 percent were female. It seems unlikely that 2015 will improve things. Take Rogue Nation. If you look at the cast in credits order, there is only one woman (Rebecca Ferguson) among the top seven, and only three among the top 25. In eighth place is the Chinese film star Jingchu Zhang, added to the cast last year with enormous fanfare. She has only one tiny scene about 40 seconds of screen time administering a polygraph test. Hermione Corfield, No. 15, comes to a bad end just minutes into the story. Most of the summer tentpoles feature a woman near the top of the billing, but few give her much to do. Ive written already about the female roles in Avengers: Age of Ultron. In Ant-Man, Evangeline Lillys character spends the whole movie saying, in effect, Put me in, coach! but gets no recognition until the credits are rolling. In Jurassic World, Bryce Dallas Howard functions mainly as designated screamer. Its true that the Top 100 list for 2015 includes such female-heavy blockbusters as Inside Out, Cinderella, Pitch Perfect 2, Insurgent and Spy. In November, the last film in The Hunger Games series arrives, with its female symbol of the revolution, female president of the revolutionaries and female general of the revolutionary army. And of course Mad Max: Fury Road was rich with female characters. But these films are outliers. Moreover, even when women have major roles in action films, they often face Padms Peril a trope in which the female co-star must put aside moral scruples and love the unlovable. In Star Wars: Episode II Attack of the Clones, Anakin Skywalker confesses to Padm Amidala that in his fury over his mothers death, he has massacred an entire tribe of Tusken Raiders, including women and children. Rather than offer the smallest criticism of the man who will become Darth Vader, Padm crouches beside him and murmurs reassuringly, To be angry is to be human. This isnt The Godfather and Michael lying to Kay about his crimes. This is the boyfriend admitting to having done terrible things and staying the boyfriend. (At least Kay Corleone left.) Weve come a long way in the two decades or so since the reign of movie heroines so brilliantly unpacked by feminist cultural critic Carol J. Clover in her book Men, Women, and Chain Saws: Gender in the Modern Horror Film. In short, the Annenberg data reinforces what we already know about Hollywoods male culture. Still, there are problems with the report. For example, its hard to attach significance to the 30.2 percent figure unless we also know the demographics of the pool from which actors are drawn or, for that matter, the resumes that might make some actors more attractive to profit-minded studios. Maybe the studios hiring practices tell us something about the market. This leads to a second, more significant issue. Year in and year out, a substantial chunk of box-office receipts go to films in the action adventure genre in short, violent movies. Violence is culturally gendered male. If the top films tend to be about war, or terrorists, or alien invasions, those who fight back violently will be disproportionately male. Tentpoles tend to feature henchmen. As the name implies, henchmen are almost always men. If not sadists, henchmen are at least chilly, ruthless killers. And they are routinely wiped out, often to the cheers of the audience, in blood-curdling ways. So rarely are the resident thugs female that its shocking when (a) we see one, and (b) she dies as horribly as the typical henchman as, for example, at the end of 2007s Live Free or Die Hard. Audiences, I suspect, remain uneasy with mayhem committed by women, and, often, against them. So here, too, hiring practices may reflect popular taste. I am not defending the demographics of the summer movie. I am only suggesting that, as so often, we are identifying the smaller rather than the larger problem. Studios want to make money. If the way to do this is to shunt women into smaller roles, then those of us who pay for tickets should shoulder most of the blame. Bloomberg View, Stephen Carter is a Bloomberg View columnist and a law professor at Yale.]", "Date": "20150812", "Author": "[Stephen Carter]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-female-roles-movies-20150812-story.html", "Title": "[Summer films full of henchmen, no henchwomen]"}