{"Content": "[In the two months since President Barack Obama named the Pullman factory district the citys first national monument, Chicagoans have been left to ponder what that designation will mean. The Chicago chapter of the American Institute of Architects and the National Parks Conservation Association organized a tour Thursday to kick off a three-day \"collaborative ideas workshop\" in which teams of volunteer urban planners, architects, landscape architects, engineers, economists and historians will contribute ideas and draw up design concepts to help guide development of the Pullman National Monument. Richard Wilson, an urban planner who has had a hand in designing Chicagos Riverwalk and expanding Beijings central business district, was among those offering expertise. He said one of the unique tasks for designs for this national park will be balancing history and tourism with those living there. \"Well, its not an ancient museum, its a neighborhood where real people live, so we want to think about new places, new businesses,\" he said. \"One of things we want to address might be just where to get a sandwich.\", Wilson said the teams will also likely consider \"ecotourism\" to highlight some of the areas green initiatives, such as a solar plant in West Pullman. About 40 members of the group will be divided into teams and assigned to categories including access and connections, historic preservation and adaptive reuse, community development and visitor experience. Residents also were able to contribute their ideas Thursday, during one of two public meetings held by the Chicago chapter of the American Institute of Architects and the National Parks Conservation Association, an organization that independently advocates for the preservation and expansion of national parks. \"People have been asking, So, whats next for Pullman? Whats this place going to look like?\" said Lynn McClure, the associations Midwest regional director. \"Those are the kind of questions we want to tackle.\", After the tour, the teams held a community meeting at Greenstone United Methodist Church. The Pullman neighborhood owes its name to railroad tycoon George Pullman, who created a company town in the late 1800s where the sleeper cars bearing his name were built and an army of laborers lived in the ornate homes nearby. The company was one of the few at the time to hire African-Americans many of the men had been slaves in the South to be car porters. When economic conditions suffered, Pullman reduced wages 25 percent, prompting his employees to walk off the job in 1894. The companys porters founded the first African-American union, which is credited with being a launching pad for the civil rights movement. One of the hottest topics for the project will be transportation, both to the site from the Loop and within the roughly milelong area, which is bounded by 103rd Street to the north, 115th Street to the south, Cottage Grove Avenue to the west and the Norfolk & Western rail line to the east. Pullman isnt accessible by CTA rapid transit service, though the Metra Electric District line runs from Millennium Station in the Loop to the site at 111th Street and Cottage Grove. However, the platform is a flag stop, meaning trains stop only if signaled to do so. Wilson said the team is expected to tackle a station redesign. Parking is expected to be another talking point as planners want to avoid overflow from the modest parking lot near South Cottage Grove, which could create competition between residents and visitors, McClure said. The design teams will be sequestered Friday to work on concepts and presentations, which will be unveiled from noon to 3 p.m. Saturday in the north wing of the factory building. \"At the end of the day, we will not have a binder report or a (Microsoft) Word document that just sits on a shelf,\" McClure said. Representatives from the National Park Service, the Chicago Department of Transportation, the Chicago Transit Authority, the Regional Transportation Authority, the Illinois Historic Preservation Agency, the Chicago Metropolitan Agency for Planning and Ald. Anthony Beale, 9th, are expected to attend Saturdays unveiling. Sandra Washington, who retired from the National Park Service in December after 24 years, said that while the report will be handed to the National Park Service, the thrust of the information wont be on the Park Service. \"They are going to hand it to the city of Chicago, the state of Illinois, and hand it back to the neighborhood,\" Washington said. \"This isnt being done for the Park Service, this is being done for the neighborhood itself. They are the biggest recipients because people live here this is their home.\", McClure said it generally takes the National Park Service a year to make a budget and put together a team. That could be expedited, she said, as Pullman already has a full-time staff assisted by Park Service staff from the Indiana Dunes National Lakeshore. tbriscoe@tribpub.com, Twitter @_tonybriscoe]", "Date": "20150416", "Author": "[Tony Briscoe]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-pullman-ideas-workshop-met-20150416-story.html", "Title": "[Workshop kicks off to plot Pullman monument's future]"}