{"Content": "[Tucked away at his family home in Delaware, Vice President Joe Biden has been huddling with longtime aides and family members, evaluating what it would take to launch a viable presidential campaign against well-funded Democratic opponents with a huge head start. Although Biden has yet to make a decision, his advisers say the vice president and his associates have started gaming out mechanics like fundraising, ballot deadlines and an early primary state strategy. Also under consideration are the personal consequences for Biden and his family, who are still mourning the death of the vice presidents son, Beau Biden, a few months ago. Democratic strategist Steven Schale discusses the Draft Biden movement and what advantages the vice president might have in a contest with Hillary Clinton. Aug. 21, 2015. (Bloomberg), Democratic strategist Steven Schale discusses the Draft Biden movement and what advantages the vice president might have in a contest with Hillary Clinton. Aug. 21, 2015. (Bloomberg), Much of the deliberation has taken place this week at the Bidens house in a secluded, wooded suburb of Wilmington, said several Biden aides, who requested anonymity because they werent authorized to discuss the meetings publicly. In recent days, longtime Biden confidantes Mike Donilon and former Sen. Ted Kaufman have spent time there, along with Bidens surviving son, Hunter Biden, and his sister, Valerie Owens Biden, who has played a top role in all his previous campaigns. A look at the deliberations:, TIMING, Bidens team has settled on a one-month window from Sept. 1 to Oct. 1 in which he could potentially announce plans to run. The vice president long ago set an end-of-summer deadline for his decision, and the last full day of summer is Sept. 22. The longer he waits, the less time he has to build a formidable campaign, but competing events on the administrations calendar make it difficult to launch in the next couple of weeks. If Bidens not in by Oct. 1, it will likely be too late, people who have spoken to Biden recently said. Hell need at least two full months to get the petition signatures and delegates lined up by the beginning of December to qualify for the ballot in early primary states. Thats assuming Clinton remains his biggest obstacle to the nomination. If her campaign were to collapse, Biden could feasibly enter the race much later and remain competitive. Concerns about Clintons falling poll numbers and controversy over her email practices has been one of the driving forces leading prominent Democrats to turn to Biden. Bidens aides are also eyeing the first Democratic primary debate on Oct. 13 as potentially a make-or-break moment. That first debate is expected to attract a huge audience among Democratic primary voters, giving Biden a powerful opportunity to establish himself as a credible alternative to Hillary Rodham Clinton. Bidens strong performance in the 2012 vice presidential debate was widely credited with helping get the campaign back on track after President Barack Obamas weak showing in his first debate. MONEY, Clinton and Sen. Bernie Sanders, the top two candidates in the Democratic primary, have already amassed millions of dollars while securing support from many of the partys top fundraisers. Biden would start with zero in the bank. With that reality in mind, his political advisers have discussed $5 million in hard money direct campaign contributions as a bare minimum of what theyd likely need in the first two months to open campaign offices and be competitive in the first primary contests. Separately, the super PAC encouraging Biden to run has set a goal to raise $2.5 million to $3 million in the next six or so weeks. The super PAC, known as Draft Biden, is exempt from contribution limits, and could pay for pro-Biden television advertising. But the trappings of his current job make campaigning extremely expensive for Biden. When the vice president travels for political events, his campaign has to reimburse the government for much of the cost of Air Force Two. It remains to be seen whether Biden could attract enough major donors and bundlers to fund a competitive campaign. After all, many of the partys top fundraisers are already committed to Clinton. \"If he decides to run and I hope he will Id be a huge supporter,\" said Paula Levine, a Democratic fundraiser and Biden family friend who has raised money for his previous campaigns. \"But Joe has to make the decision thats right for him and his family.\", THE MAP, Aiming to prove Biden would be competitive in key primary states, Draft Biden has been organizing and recruiting Democratic talent in Iowa, New Hampshire and South Carolina. This week Steve Schale, who ran Obamas presidential campaign in Florida, joined the super PAC, becoming the most senior Obama campaign staffer to publicly support a Biden run. Bidens team has said its optimistic about his prospects in South Carolina, which holds the third primary contest and where Biden has deep political roots. In an attempt to lock up support there, Clintons campaign has dispatched top advisers John Podesta and James Carville to South Carolina, where theyve been holding public events and announcing endorsements. In a bout of encouraging news for Biden this week, a Quinnipiac University poll of three battleground states Florida, Ohio and Pennsylvania found Biden faring as well as or better than Clinton against the top Republican candidates. In Ohio, 48 percent said theyd support Biden over Republican Donald Trump, giving Biden a 10-point lead over the GOP front-runner. \"What this shows is that potentially, Mr. Biden could be a competitive candidate,\" said Peter Brown, the polling institutes assistant director. Associated Press, ]", "Date": "20150821", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-biden-2016-run-20150821-story.html", "Title": "[ Decision nearing, Biden games out mechanics of a 2016 run ]"}