{"Content": "[When Gov. Bruce Rauner proposed a 31 percent cut in state funding for public universities, then-University of Illinois President Robert Easter said the reduction would be bad for students. But the only conclusion Illinoisans can draw from the conduct of U. of I. board members and administrators in recent years is that they already have too much money and cant be trusted with more. What other conclusion can be drawn from the sweetheart contracts, the parade of scandals and the attempts to evade not only public scrutiny but state law through unsavory secrecy? This is a university that has a lot to answer for, regardless of how much state money its getting. Exhibit A is the $500,000 retention bonus provided for Chancellor Phyllis Wise in her contract if she served until the end of her five-year contract next year. Due to her resignation from that post Thursday, the good news is that the university wont have to pay that sum. The bad news is that university officials agreed to pay her $400,000 as part of her resignation agreement, which looks a lot like four-fifths of that retention bonus for an administrator who left early and under a cloud. Lets see what happens now. The Tribunes Jodi S. Cohen reportsthat a three-member executive committee of the U. of I. board, including new Chairman Edward McMillan, will vote Wednesday on whether to approve that whopping lump-sum payment. \"I wouldnt give someone $400,000 to leave peaceably if they (did what she did),\" former board Chairman Christopher Kennedy told Cohen. Wise stepped down as chancellor the day before the university released some 1,100 pages of emails from her and other administrators, many of them embarrassing. What is clear from the avalanche of paper is that Wise was determined to get around the state Freedom of Information Act by discussing university business on her private email account and urging others to avoid official channels for communications. One email she sent had this subject line: \"Better not to correspond on my IL email.\", Why would Wise want to keep her conversations about public business hidden from the public that helped pay her salary at a public university? We can think of several predicaments, all of which could be addressed in meetings or other official channels. The university is being sued by Steven Salaita, a professor whose offer of a faculty position was withdrawn after he made controversial comments on Twitter. The American Association of University Professors passed a resolution saying the school \"violated Professor Salaitas academic freedom and cast a pall of uncertainty over the degree to which academic freedom is understood and respected.\", U. of I. also is being sued by seven former womens basketball players, who accuse coaches of creating a racially hostile environment. They and former members of the football and mens basketball teams claim they were threatened with the loss of their scholarships, in violation of university policy. Two of the football players say head coach Tim Beckman physically attacked them. The university has a chance to chart a new direction. It has a new president, Timothy Killeen, along with the new chairman, McMillan, who was reappointed to the board by Gov. Bruce Rauner. We remember Rauner telling us a few months ago that he proposed those big budget cuts for the universities because \"I had to get their attention.\", We doubt this is what he had in mind. Lets see if the executive committee puts a stop to this deal. Lets also see if the full board will curb backloaded contracts and clamp down on lavish severance deals and other exit agreements that stick students and taxpayers with the costs. This states universities love to plead, \"Honest, we cant help ourselves, because the administrator we just (fired, demoted, squeezed out, whatever) had a contract that forced us to pay.\", Then stop writing contracts that force you to pay. Same for the lame argument that Illinois public universities and community colleges have to offer obscene compensation agreements (Hello there, College of DuPage) because, \"Gosh, other schools do the same thing.\" These outlandish compensation deals too often become the foundation of outlandish departure packages. How about really good pay ... for really good work. Killeen says Rauner has given him a summer \"homework assignment,\" to assess how U. of I. can contribute to the revival of the Illinois economy. But Killeen has another obvious task, too: explaining how the school can overcome its troubled recent history, show it is serious about controlling essential costs and eliminating unnecessary ones, and become the sort of institution that once again inspires pride and respect. Its not an easy task, but it is an urgent one.]", "Date": "20150810", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-university-illinois-wise-rauner-killeen-scandal-bonus-edit-0811-jm-20150810-story.html", "Title": "[The U. of Illinois' scandals and sweetheart deals]"}