{"Content": "[President Barack Obama faces a high-stakes, politically explosive negotiation this week over his Iran nuclear deal. Not with Iran. With Congress. On Tuesday, the Senate Foreign Relations Committee takes up a measure that would allow Congress to weigh in on a final nuclear deal with Iran. The bill, introduced by Republican Sen. Bob Corker of Tennessee, would require Obama to allow Congress 60 days to digest and debate the deal before the president could waive key economic sanctions on Iran imposed by Congress. Those congressional sanctions target Tehrans banking system, oil exports and the business interests of the Revolutionary Guard. Obama said over the weekend that he was worried that Republicans critics were trying to \"screw up the possibility of a deal.\" The fear: the prospect of a 60-day congressional debate would somehow be viewed by the Iranians as a \"poison pill.\", But the Corker bill doesnt require Congress to approve or reject a deal; if lawmakers sit on their hands, the deal would go forward. If Congress narrowly rejects the deal, the president would still hold veto power. The deal would go forward. No deal would be stopped by a purely partisan blockade. If Congress disapproves with a veto-proof majority, however, then the presidents hands would be tied: He could lift sanctions set by executive order, but he couldnt waive sanctions set by Congress. In that case, any deal with Iran likely would crumble. Know this, though: A veto-proof majority would signal profound, bipartisan opposition to the deal. It would be a powerful sign from Congress that the deal creates more risk than security. Theres strong support for the Corker bill from Republicans and from several prominent Democrats, including Sen. Charles Schumer of New York. They want Congress to have a role in one of the most significant national security issues of our age. Iran is on the threshold of building an atom bomb. A nuclear Iran would roil an already chaotic region, igniting a Middle East nuclear arms race as Saudi Arabia and other of Irans rivals acquire their own weapons. Under the Corker bill, Obama would have to convince lawmakers that he has extracted the best possible deal from Iran. He would have to persuade them and their constituents that the deal meets the overarching U.S. goal: to prevent Iran from building a nuclear weapon. A vote by Congress to approve a final deal would instill more confidence in it by allaying fears that the next Congress and president would seek to unravel it. Senate Republicans stoked those fears with their ill-considered open letter a few weeks ago to Iranian supreme leader Ayatollah Ali Khamenei. We dont yet know the final outlines of Corkers legislation. Lawmakers are planning to attempt at least 50 amendments. Some Democrats will try to strip out language that would require the administration to certify that Iran isnt directly sponsoring terror attacks against the U.S. or its citizens. Some Republicans will try to add restrictions that could make a deal with Iran more difficult to negotiate. The legislation should focus on an evaluation by Congress of the core of the issue: Does a deal with Tehran thwart Iran from building nuclear weapons? No more and no less. Republicans wont achieve a veto-proof majority if they turn this into poison-pill legislation. A 60-day examination period before sanctions could be waived doesnt strike us as a poison pill. If the U.S. its allies in the nuclear talks and the Iranians reach a final deal by the June 30 deadline, it must be carefully inspected for trap doors or unintended consequences. A 60-day period would create more confidence and provide more clarity in a deal. It would help pre-empt disputes like the one that has flared since the sides announced the framework accord: President Obama says economic sanctions will be lifted slowly and in stages, as Iran meets its obligations. But Khamenei says the framework requires all sanctions to be lifted \"on the same day of the agreement, not six months or one year later.\" Thats no trifling matter. The entire deal could hinge on when and how sanctions relax. Republicans argue that the Corker bill will help Obama drive a better bargain. Irans leaders should know Congress is waiting in the wings to ask some tough questions. In the meantime, crippling sanctions will remain in place. Thats not a poison pill. Thats a bracing dose of reality.]", "Date": "20150413", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-iran-congress-corker-obama-nuclear-congress-edit-0414-jm-20150413-story.html", "Title": "[Why Congress should have a voice on Iran]"}