{"Content": "[When President Franklin D. Roosevelt delivered his famous 1933 inaugural address in which he said that \"the only thing we have to fear is fear itself,\" he added an important clarification describing this fear as \"a nameless, unreasoning, unjustified terror.\" The terror that the people in Israel are facing, as was reflected in the outcome of the last elections, has a name reason and it is justified. Facing regional chaos, it is only natural that people are leaning more toward conservatism. The storm that took over the Middle East during the last four years, a storm once called the Arab Spring, left behind plenty of debris and an ocean of instability. In this ocean, Israel, the Jewish state, which maintains the only island of stability, faces four regional players. The first, and assuredly the most dangerous, is the Shiite Crescent led by Iran and stretching over to Iraq, Syria and all the way down to Hezbollah in south Lebanon. The second player is the Sunni moderates, led by Saudi Arabia and Egypt and including Jordan, the Arab Gulf states and states in North Africa. Against the failure of those moderate Sunni states to successfully face the Shiite challenge, we are witnessing the emergence of a third player the nonstate Sunni radical actor. Young members of al-Qaida and Islamic State are more violent than what we have seen in the past. The last player in the equation is the Muslim Brotherhood, which has a presence in all the Sunni states and all too often opposes the traditional regimes. Two Middle East states Turkey and Qatar are supporting this player in one way or another. This entire chaotic situation is reflected in a dangerous way on the borders of Israel. In the north, where there once was Lebanon, we find an Iranian proxy known to all as Hezbollah, a terrorist organization that reportedly has around 100,000 missiles and rockets. East of Lebanon on the other side of the Golan Heights, where there once was Syria we find Jabhat al-Nusra, an offspring of al-Qaida. On Israels southern border, along the Sinai desert, we face Ansar Beit al-Maqdis, an offspring of Islamic State. And as if that is not enough, on the northeastern part of Sinai, in Gaza, where there once was the Palestinian Authority, Israel faces not one but two terrorist organizations the Palestinian Islamic Jihad, another Iranian proxy, and Hamas, an offspring of the Egyptian Muslim Brotherhood. Make no mistake, Israel in 2015 is the strongest regional power and can successfully face all of these challenges and others not mentioned here (like the Iranian nuclear challenge). Still, the 8 million people living 6,200 miles east of Chicago are worried. Their concern has to do with maintaining a stability that has been achieved since the establishment of the Jewish state 67 years ago. This stability political, economic, social and military is being challenged day in and day out. Roey Gilad is consul general of Israel to the Midwest.]", "Date": "20150415", "Author": "[Roey Gilad]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-israel-terror-election-perspec-0415-20150415-story.html", "Title": "[The chaos that surrounds Israel]"}