{"Content": "[The movement to recognize college athletes as employees has suffered a major setback, with the National Labor Relations Board deciding Monday not to assert jurisdiction in the case of the Northwestern University football players seeking to unionize. The NLRB chose not to review the case because it said a ruling would disrupt labor stability, applying only to the 17 schools in the football bowl subdivision of the NCAA that are private. The more than 100 other public universities with big-time football are governed by the labor laws in their states, including every team in the Big Ten except Northwestern. The board felt that any ruling could be detrimental to competitive balance. Of course, competitive balance concerns are constantly cited to block the efforts of those trying to win more rights for college athletes. Critics of Power Five autonomy warned that granting college footballs biggest conferences the ability to govern themselves would place smaller, less wealthy schools at a disadvantage, without acknowledging that those programs are already inherently disadvantaged in the NCAA. But the system as we know it hasnt crumbled you cant further break whats already broken and Power Five athletes are treated much more fairly now, with benefits such as scholarships that cover the true cost of attendance. Its nice that the NLRB is so concerned with maintaining fairness among NCAA teams, but it should be more concerned with fairness for NCAA labor. True, the scope of the boards decision is extremely narrow, leaving open the possibility of future attempts to unionize college athletes. It vacates a previous ruling by regional NLRB director Peter Sung Ohr that Northwestern football players are university employees and can unionize. And the NLRB went out of its way to repeatedly state that it wasnt ruling on the merits of the case; the board made no judgment on the central question of whether college athletes are employees. The NLRB blocked a historic bid by Northwestern University football players to form the nations first college athletes union, dealing a blow to a labor movement that could have transformed amateur sports. (AP), The NLRB blocked a historic bid by Northwestern University football players to form the nations first college athletes union, dealing a blow to a labor movement that could have transformed amateur sports. (AP), But by washing its hands of the case, the NLRB essentially did take a side: not labors. As sports economist Andy Schwarz writes, the message to college athletes at private universities is clearly that theres no forum to which they can turn. If the NLRB isnt responsible for this issue, who is?, The language matters: Those of us in favor of expanding college athletes rights had hoped that Ohrs ruling signaled the beginning of the end of the myth of the student-athlete, a marketing term created by the NCAA in order to defend against workers compensation claims when players got injured on the field. The policies denying athletes livable wages and adequate health care need to change, but so does the attitude that these athletes are amateurs playing sports as a means to an education that theyre anything but low-cost minor leaguers getting primed for the pros. Fortunately, the attitude and the policy are shifting, albeit incrementally. The NLRB had an opportunity to give both a major push in the right direction and wanted no part of it. The notions that tend to fuel inequality and unfairness throughout athletics are often based on the idea that somehow sports are a different type of business or, in this case, not a business at all and dont have to play by the same rules, be it tax codes or antitrust laws or workers rights. But college sports is a big business and college athletes are a labor force participating in what amounts to a completely one-sided work-study program. The NLRB could and should have adjudicated this case, as it has with previous cases seeking to unionize graduate students and classify teaching assistants as university employees. Instead, it cowed to the pressures of its education and business constituencies. College athletes will have to be satisfied for now with the small victories that have come their way in the past year, from cost-of-attendance scholarships to easing meal restrictions. And the Northwestern players can still push for policy changes even without the protection of a formal union. The hope is that this case will inspire other groups of players from public universities to take on their schools under their states labor laws. That excludes athletes in right-to-work states and offers an incredibly piecemeal solution to such a far-reaching problem. Despite this setback, it does appear were inching ever closer to being truly honest about the business of college athletics. The federal ruling in 2014 on the use of player likenesses was a monumental win for athletes and labor, and at least one other case could signal significant change: Noted sports lawyer Jeffrey Kessler has filed an antitrust lawsuit against the NCAA that seeks to compensate college athletes on an open market. The argument that restricting an athletes compensation to the value of a scholarship amounts to horizontal price-fixing is compelling, but the NCAAs defense against this likely still rests on the idea that college athletes arent workers who provide a service that can be bought and sold. Thanks to the NLRB, well have to continue to call these athletes something other than employees until this farcical system is changed. Chris Webber might have some suggestions. Bloomberg, Kavitha Davidson writes about sports for Bloomberg View.]", "Date": "20150819", "Author": "[Kavitha Davidson]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-nlrb-ruling-northwestern-football-union-20150819-story.html", "Title": "[NLRB decision means no end, yet, to the 'student-athlete' myth]"}