{"Content": "[These are banner days for some flag-wavers but not for others. South Carolina recently removed the Confederate battle flag from its Capitol grounds. But a Russian political party opposed to gay rights unveiled a new symbol a \"heterosexual flag\" featuring a mom and dad holding hands with three children. Here are 10 facts to run up the flagpole:, 1/ Two of the most famous World War II photos depict flag-raisings, and both involve dishonesty for propaganda purposes. Joe Rosenthals picture from Iwo Jima was not posed despite rumors to the contrary but it also was not the first flag raised on Mount Suribachi; it was the second. After Rosenthals photo created a sensation, a general suppressed photos of the first flag-raising, preferring to leave a public misimpression. In the second case, the controversial image shows the Soviets flag-raising over Germanys Reichstag. Photographer Yevgeny Khaldei traveled from Moscow with the flag in his luggage and set up the shot two days after the fall of Berlin. Later, the photo was retouched to darken the smoke and remove a watch from a soldiers wrist. Why would Soviet censors care about a watch? Because the soldier originally had one on each wrist, an indication he had been looting. 2/ The study of flags is vexillology. 3/ The Chicago flags four stars represent Fort Dearborn, the Great Chicago Fire, the Worlds Columbian Exposition and the Century of Progress Exposition. There have been campaigns to add a fifth star to recognize the citys role in the nuclear age or honor Mayor Richard J. Daley. A South Chicago family business, WGN Flag & Decorating Co. even sells five-star city flags. \"My great-great-grandfather overheard some bigwigs talking about adding a star for Daley,\" and WGN quickly stocked a five-star flag, said current operator Carl \"Gus\" Porter III. The Daley honor fell through, but those flags came in handy when there was talk of a fifth star if Chicago hosted the 2016 Olympics. WGN provided five-star flags as gifts for visiting Olympics officials, Porter said. But Chicago lost the Olympics anyway and remains a four-star city.* , 4/ Fijis flag features a dove, but several other flags sport symbols of war. An old West African flag shows one man beheading another. The flags of Kenya and Swaziland feature spears, while Angolas has a machete. Mozambiques banner includes a more modern weapon an AK-47. The Confederate battle flag was lowered from the grounds of the South Carolina Statehouse on July 10, 2015, marking a stunning political reversal in a state where many thought the rebel banner would fly indefinitely. (AP), The Confederate battle flag was lowered from the grounds of the South Carolina Statehouse on July 10, 2015, marking a stunning political reversal in a state where many thought the rebel banner would fly indefinitely. (AP), 5/ The U.S. Supreme Court ruled in 1989 that protester Gregory Lee Johnson was exercising his First Amendment rights when he burned an American flag. Weeks after the ruling, about a dozen congressmen heard a rumor that Johnson planned to burn a flag on the court steps, and they showed up with fire extinguishers and a bucket of water. Johnson stayed away, so the politicians sprayed and drenched an effigy of him. A reporter said it was \"the first time someone was doused in effigy.\", 6/ Every modern national flag is rectangular except Nepals, which boasts a double-decker triangle, called a double pavon. 7/ The American Civil War was a very real, very bloody game of Capture the Flag. A regiments colors were a point of pride; when the \"boys rallied round the flag,\" it was more likely the regimental flag than the Stars and Stripes (or the Stars and Bars). The flag was heavily guarded because its capture or even a fall to the ground was unthinkable. Few incidents better illustrated its importance than the fight for the Sunken Road during the Battle of Antietam in 1862, when no fewer than eight men in the Irish Brigade died carrying the New York regiments distinctive green banner. 8/ The half of the flag farthest from the pole is called the fly, and the outer edge is the fly edge. 9/ The North American Vexillological Association offers guidelines for good flag design: Keep it simple, limit the colors, define the borders, dont use lettering or seals and use smart, distinct symbols. Most U.S. state flags are notoriously bad. Illinois complex flag violates most if not all of these tenets with its lettered, multicolored seal featuring a bald eagle and a rock all anchorless on a white background. 10/ In designating how long Old Glory should fly at half-staff to honor a deceased official, the U.S. Flag Code makes it perfectly clear how government officers stack up: 30 days for a president, but just 10 days for a vice president, a chief justice of the U.S. Supreme Court or a U.S. House speaker. A Cabinet secretary, high court justice or state governor should be honored from death until interment, according to the code. A member of Congress? Two days. Mark Jacob is the Tribunes associate managing editor for metro news; Stephan Benzkofer is the Tribunes weekend editor. mjacob@tribpub.com, sbenzkofer@tribpub.com, Sources: \"The United States Flag: Federal Law Relating to Display and Associated Questions,\" by the Congressional Research Service; \"Irish Brigade In The Civil War,\" by Joseph G. Bilby; \"Immortal Images: A Personal History of Two Photographers and the Flag-raising on Iwo Jima,\" by Tedd Thomey; \"Burning the Flag: The Great 1989-1990 American Flag Desecration Controversy,\" by Robert Justin Goldstein; \"The Spirit of the Laws in Mozambique,\" by Juan Obarrio; The Washington Post; Tallahassee Democrat; chicagomag.com; time.com; hoaxes.org; famouspictures.org; rmg.co.uk; govtrack.us; britannica.com, * The Chicago flag is so popular that theres even a website of Chicago flag tattoos, predictably called chicagoflagtattoos.com.]", "Date": "20150716", "Author": "[Mark Jacob, Stephan Benzkofer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-flags-iwo-jima-civil-war-confederate-perspec-0719-jm-20150716-story.html", "Title": "[10 things you might not know about flags]"}