{"Content": "[When New York Gov. Al Smith, a Catholic, ran for president in 1928, fearmongers warned he would include Pope Pius XI in Cabinet meetings. In 1960, when John F. Kennedy sought the Democratic nomination, the American Council of Christian Churches announced itself \"as being opposed to a Roman Catholic for president.\", Weve come a long way. Kennedy won the presidency, and today no one would dream of making an issue of putting a Catholic in the White House. But we still have a ways to go. Last week, GOP candidate Ben Carson exhibited the sort of bigotry that JFK once faced. Asked whether he thinks Islam is consistent with the Constitution, the retired neurosurgeon said, \"No, I dont, I do not. I would not advocate that we put a Muslim in charge of this nation. I absolutely would not agree with that.\" Afterward, his campaign cited what it sees as a \"huge gulf between the faith and practice of the Muslim faith, and our Constitution and American values.\", Its been a bad week for those hoping to see Republicans cultivating minorities. Donald Trump declined to correct a questioner who said Barack Obama is a Muslim. But some Republican leaders are pushing back against Carson. Ted Cruz cited the constitutional ban on religious tests for office. Bobby Jindal said hed be happy to consider voting for a Muslim who shared his conservative policy views. The best response came from Lindsey Graham. \"What would he say to the young man I met in Kabul who left Afghanistan, became an American citizen, joined the United States Army?\" Graham asked. \"What would he say to the approximately 3,500 American Muslims who have been to Iraq and Afghanistan fighting for our freedom, risking their lives?\", Carson has a disturbing amount of company among voters 40 percent of whom would not vote for a Muslim for president, according to a 2012 Gallup poll. But the prejudice against Muslims is no more reasonable than the suspicions faced by Smith and Kennedy. The common assumption is that Muslims are not only monolithic but united behind the most extreme and violent members of their religion. Trump voiced that sentiment when he told an interviewer, \"It wasnt people from Sweden that blew up the World Trade Center.\" No, and it wasnt people from Iran or Afghanistan or Saudi Arabia who blew up the federal building in Oklahoma City in 1995 or killed five people with anthrax-laced letters in 2001 or assassinated a Kansas abortion doctor in 2009. Every religion has its radical elements, Islam included. But the great majority of Muslims, here and abroad, do not endorse or engage in violence. Eight out of 10 American Muslims say \"violence against civilians\" in defense of Islam is never justified, according to a 2011 Pew Research Center survey. A study by New America, a Washington think tank, found that since Sept. 11, 2001, 48 people have died in the United States at the hands of right-wing terrorists, compared with 26 killed by Islamic terrorists. Bloody lunacy is not the monopoly of any faith. Nor is there is anything intrinsic in Islam that makes it incompatible with Americanism or disqualifies its adherents from public office. The ideals of freedom, democracy and the rule of law that underlie our institutions appeal to Muslims just as they do to Catholics, Protestants, Jews, Mormons, Hindus and nonbelievers. Keith Ellison had no problem taking the oath of office in 2007 after his election to the U.S. House of Representatives from Minnesota, which made him the first Muslim in Congress.. He swore to \"support and defend the Constitution of the United States against all enemies, foreign and domestic.\" He put his hand not on a Bible but a Quran a Quran once owned by Thomas Jefferson. When the Constitution was being debated in 1787, one delegate warned that without a religious test for office, \"Papists\" and \"Mohametans\" (Muslims) might be elected. His argument failed to persuade the convention. Today, people of countless faiths live side by side in peace as Americans. Carsons disparagement of Muslims, by contrast, brings to mind the warning issued in 1960 by Kennedy, in an address to Protestant ministers in Houston:, \"For while this year it may be a Catholic against whom the finger of suspicion is pointed, in other years it has been, and may someday be again, a Jew or a Quaker or a Unitarian or a Baptist. ... Today I may be the victim, but tomorrow it may be you until the whole fabric of our harmonious society is ripped at a time of great national peril.\", If a Muslim candidate is right for the job, Americans should be willing to vote for that person. And if not, the candidates religion should be treated as the irrelevancy it is. Someday, we have no doubt, it will be.]", "Date": "20150921", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-muslim-kennedy-ben-arson-trump-bigotry-religious-edit-0922-jm-20150921-story.html", "Title": "[A Muslim for president?]"}