{"Content": "[Suburban voters next week will choose the first new mayor to serve Naperville in two decades, several trustees to help oversee the embattled College of DuPage and the leader of beleaguered Harvey, where a controversial mayor seeks a fourth term against six challengers. Tuesdays election will bring new leadership to suburbs like Country Club Hills where the mayor is stepping down because of a new term limits referendum engineered by several challengers and determine the fate of hundreds of other elected offices spanning municipalities and school districts across the region. Here are some of the more high profile suburban contests on the ballot:, West, After serving five terms, Naperville Mayor George Pradel, 77, is stepping down from office following an era of historic growth for this suburb of about 145,000 residents. Four candidates are facing off for the seat. Steve Chirico, a councilman since 2011, has prioritized economic development and finding uses for long-vacant buildings. U.S. Navy Reserve retiree James Haselhorst has called for more resources for small businesses and a greater focus on south Naperville. Doug Krause, who has served on the council for about a quarter-century, has said traffic congestion is among his biggest concerns, as well as senior issues and problems related to drug and alcohol dependence. Retired firefighter Marty Walker has said hes committed to using renewable energy and green policies, as well as addressing drug and alcohol problems. As the College of DuPage faces ongoing scrutiny following a series of Tribune reports documenting financial mismanagement, 12 candidates are running for three six-year trustee positions on its seven-member board. Two current trustees are seeking re-election. Read ongoing coverage of issues at Illinois largest community college with more than 28,000 students and $108 million in local property tax dollars, located in west suburban Glen Ellyn. Read ongoing coverage of issues at Illinois largest community college with more than 28,000 students and $108 million in local property tax dollars, located in west suburban Glen Ellyn. The Tribune revealed that the board approved a $763,000 severance package for President Robert Breuder, one of the largest for a public employee in Illinois history. The Tribune also uncovered that the school had retained its former radio engineer and paid invoices to his company after he had been convicted of running a scheme to steal from nearby Elmhurst College. The former employee was charged with felony theft in February and is accused of falsifying invoices to steal more than $200,000 from College of DuPage. Another Tribune report found that Breuder and other school officials regularly billed the college for alcohol as they spent nearly $190,000 on close to 500 occasions at Waterleaf, the campus professionally run restaurant. Voters in Hinsdale High School District 86 will decide whether they support the district petitioning the state to prohibit teachers from striking, as well as including parent/student feedback and classroom attendance on teacher evaluations. The referendum is advisory, and district officials are not bound to follow the will of voters. Elgin Mayor David Kaptain is seeking a second term against challenger Joseph Galvan, who runs a business consulting firm and has criticized the current administration for failing to revitalize downtown; the incumbent has said the number of businesses downtown has actually increased. And challenger and Village Council Commissioner Geoff Neustadt is trying to unseat Downers Grove Mayor Martin Tully, who is seeking his second and last term due to term limit policies. North, Wilmette voters will decide whether to approve $14.5 million in lakefront improvements to spruce up Langdon and Gillson parks. Plans would include landscaping, new playground equipment at both parks, improvements related to the Americans With Disabilities Act and safety upgrades for bicyclists and pedestrians. Voters in Glencoe will let school leaders know whether they favor hiring an armed, privately funded law enforcement officer for the middle school. The measure is advisory and nonbinding, so the one-year pilot program would still have to be approved by the Glencoe School District 35 Board of Education. The school resource officer would come from the Glencoe Public Safety Department and develop school security plans, help during medical emergencies and run anti-bullying and Internet safety programs. The referendum was crafted by the Glencoe School Safety Project, a group formed following the 2012 fatal shootings at Sandy Hook Elementary School in Newtown, Conn. In Buffalo Grove, incumbent Village President Jeffrey Braiman who has served on the board since 1991 but almost left his mayoral term early when he ran for a Lake County judgeship last year faces challenger Beverly Sussman, a village board member since 2009. And six candidates are vying for an open mayoral seat in Zion. South, Controversial third-term Harvey Mayor Eric Kellogg faces five challengers on the ballot and one mounting a write-in campaign in a bid to lead this high-crime, impoverished suburb of about 25,000 people. Kellogg has served as mayor for more than a decade, and this election comes in the aftermath of Tribune reports detailing Harveys poor policing and budget woes, including millions of dollars in unpaid water bills from Chicago. The incumbent was nearly kicked off the ballot earlier this year because of long overdue campaign finance violation fines, but his campaign paid the fees just days before he could have been removed. A statement released by the citys spokesman on Kelloggs behalf said the mayors accomplishments include improvements to Dixie Highway, increasing the number of police officers and attracting more than 100 new businesses and facilitating existing business expansion. Opponents the Rev. Ronald Cummings, Charles \"Chuck\" Givines and Anthony McCaskill are all former mayoral candidates. Albert Abney and Terry E. Brown are on the mayoral ballot for the first time. Woodrow \"Woody\" Nunn is running as a write-in candidate. In one of the stranger incidents marking this race, investigators are looking into a fire that destroyed Abneys campaign office a day after the building was vandalized last month. Challengers have cited crime, finances and housing as the biggest issues this election. Country Club Hills will select its first new mayor since 1987, replacing Mayor Dwight Welch, who is stepping down following a term limits referendum crafted by several of the aldermen attempting to succeed him. Four current aldermen and one former alderman are running for the open spot. Major issues include plans for an outlet mall, property tax rebates and red light cameras. Homer Glen Mayor Jim Daley will face challenger George Yukich, a village trustee who earned more votes as a write-in candidate than his incumbent opponent in the February primary. Yukich had been removed from the primary ballot by the village election board, which includes Daley. And two candidates are vying to unseat New Lenox Mayor Tim Baldermann, also the superintendent of Union School District 81 in New Lenox Township, who is seeking a third term. Challengers are Andrew Englebrecht, a newcomer to village politics, and Ron Sly, the former public works superintendent. eleventis@tribpub.com, Twitter @angie_leventis]", "Date": "20150403", "Author": "[Angie Leventis Lourgos]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-suburban-election-races-0404-20150403-story.html", "Title": "[Suburban voters to pick Naperville mayor, College of DuPage trustees]"}