{"Content": "[Second-term U.S. Rep. Tammy Duckworth is expected to announce her candidacy Monday for the U.S. Senate and a potential challenge to Republican Sen. Mark Kirk, a source familiar with her plans said. Duckworth, an Iraq War veteran, will be the first Democrat to formally announce for the 2016 U.S. Senate seat, though others have said they are considering a primary bid, including congressional colleagues U.S. Reps. Robin Kelly of Matteson, Bill Foster of Naperville and Cheri Bustos of East Moline. A Duckworth candidacy creates the potential of a general election matchup involving two candidates who have worked to overcome serious physical challenges. Duckworth, 47, lost her legs when her helicopter was shot down in Iraq. Kirk, 55, suffered a stroke two years into his term,which has impaired his speech and movement. He has said he is seeking re-election. Duckworth, of Hoffman Estates, is expected to make her announcement Monday in a Web video to supporters, said the source, who was not authorized to speak publicly about her campaign plans. Later that day, she will attend a private fundraiser in downtown Chicago. Democrats believe Kirk, who won his first Senate term in 2010, to be among the most vulnerable Republican senators in the nation with Illinois traditionally a blue state in presidential election years. Kirk won the seat formerly held by President Barack Obama by fewer than 60,000 votes in defeating then-Democratic Treasurer Alexi Giannoulias. The Republican is receiving strong backing for his re-election from new GOP Gov. Bruce Rauner. Duckworths Senate candidacy had been widely expected. The congresswoman, who gave birth to her first child in November, entered Congress in 2012 by defeating then-U.S. Rep. Joe Walsh, a Republican, in a newly drawn district favoring Democrats. Walsh, currently a radio talk show host, has expressed interest in challenging Kirk. Duckworths candidacy for the Senate could also create a contest for her west and northwest suburban 8th Congressional District seat, which stretches from Lombard and Bensenville on the east to Elgin and Carpentersville on the west. Raja Krishnamoorthi, who lost to Duckworth in the 2012 Democratic primary, has been mentioned as a potential congressional contender, along with first-term Democratic state Sen. Tom Cullerton, a former Villa Park village president and cousin of Illinois Senate President John Cullerton.]", "Date": "20150328", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/breaking/chi-tammy-duckworth-senate-20150328-story.html", "Title": "[Duckworth to join race for Kirk's Senate seat]"}