{"Content": "[The Democrats drubbing in the midterm elections simplified one of Hillary Clintons challenges: Now she can strike some distance from President Barack Obama. Everybody else is doing it. The former secretary of state, who is almost certain to run for president, has the luxury of time to elaborate her strategy. There will be matters beyond her control: relentless attacks, including some from the left. But its mainly the political right and Republicans who will work tirelessly to dig up dirt on the expected 2016 Democratic nominee. For all the talk of empowered congressional Republicans investigating every facet of the Obama administration, they wont miss any opportunity to look into Clinton. Shes tough, resilient and likely to be prepared for this predictable onslaught. More instructive is whether shes prepared for matters within her control. These include defining her candidacy and possible presidency. It wont be sufficient to run on competence, breadth of experience and reminders that, by the way, my husbands White House years were the salad days for the U.S. economy. Her foreign policy credentials are fodder for champions and critics alike. But there is no domestic centerpiece. She needs an innovative, even bold approach -- this is a cautious politician -- to dealing with middle-class economic stagnation and income inequality. That requires choices and trade-offs. She has a good and lucrative association with Goldman Sachs. She also praises the liberal Massachusetts Democratic Senator Elizabeth Warren: \"I love watching Elizabeth give it to those who deserve to get it,\" she said last month at a campaign rally in Massachusetts. One of the institutions Warren likes to \"give it to\" is Goldman Sachs. Can Clinton put together an efficient, functioning campaign? In the 2007-2008 cycle, the Clinton camp was rife with infighting, warring clans as the many elements of Clintonland weighed in, sometimes not helpfully. Especially controversial was top strategist Mark Penn, who had to step down late in the campaign when it was disclosed he was simultaneously working for the government of Colombia. Its expected that former President Bill Clintons chief of staff, John Podesta, will assume the role of chief executive in the 2016 campaign. It would be a widely praised selection. He is an adult who, as a strategist, understands the nexus of politics and policy as well as anyone since Jim Baker, the legendary Republican who served in the Ronald Reagan and George H.W. Bush administrations. Other names being considered for top positions include Democratic operatives and Clinton campaign alumni such as Robby Mook, who won every primary he directed for her in 2008, and Guy Cecil, who has run the Democrats national Senate campaign committee. There also are prominent women such as Stephanie Schriock, who has managed successful Senate candidates and now runs Emilys List, which tries to elect pro-choice Democratic women to political office. (And Penn, who was on the outs, is reportedly talking to the Clintons.), Clinton also is reaching out for advice outside her political circle, most notably from David Plouffe, who ran Obamas presidential campaigns. And unlike 2008, this time shell get the crucial technology and data right. The big question is whether she will assemble a coherent team that holds at bay some of the more disruptive elements of the far-reaching Clinton constellation. Will there be a Bill problem? The former presidents indelicate comments caused her some anxiety in 2008. He was rusty then, having been out of the campaigning limelight for a while. In 2012 and during this years midterm congressional elections, hes shown hes back: easily Americas best stump campaigner as well as the most popular politician. Like everyone else, she pales next to him on the campaign trail. He also possesses superb political instincts; she doesnt and is more methodical. Unfavorable comparisons will be made; she cant let that get to her. The ex-secretary of states book and promotional tour earlier this year fell flat. Yet she won raves for her campaign appearances this autumn. In modern American politics, there has never been such a prohibitive front-runner who wasnt the incumbent president. No one, in either party, can boast of such odds of winning. Yet Clintons path will be full of unforeseen changes, and more than a few ugly moments. How she prepares in the next few months may well determine how she weathers the storms. Albert Hunt was formerly the executive editor of Bloomberg News, directing coverage of the Washington bureau.]", "Date": "20141110", "Author": "[Albert R. Hunt]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-hillary-clinton-president-2016-campaign-20141110-story.html", "Title": "[What to expect from Hillary Clinton's 2016 presidential campaign]"}