{"Content": "[Some evangelical Christian conservatives are trying to get their brethren to unite behind one Republican primary candidate in the 2016 presidential race. Theyre likely to fail and theyll probably be better off if they do. Evangelicals want a nominee who not only takes conservative positions on such issues as abortion and same-sex marriage, but makes those issues a priority and addresses them without defensiveness. Its perfectly reasonable for activists to want candidates to elevate their top issues. They may even be right that Republican politicians are too afraid of losing votes over social issues, especially abortion. But evangelical leaders are unlikely to advance their goals by trying to get their coreligionists to vote as a bloc in presidential primaries. That approach has repeatedly failed in the past, for reasons that havent changed. Mike Huckabee, the former governor of Arkansas, ran in 2008 as a \"Christian leader\" who would \"speak the language of Zion\" as a \"mother tongue.\" He was the evangelicals favorite in the 2008 primaries, winning pluralities of their votes in Iowa and South Carolina (enabling him to win first and second place in those contests) and majorities in some later states. But he never won their support overwhelmingly. Presumably a lot of evangelical voters even those who agreed with Huckabee about abortion, same-sex marriage and other social issues thought he was unelectable or found the other candidates more attractive for other reasons. Maybe they found the kind of religious appeal Huckabee was making to them inappropriate in a political campaign. A lot of evangelical voters will bring these same attitudes to the 2016 race, which Huckabee is considering entering. Some of them will find Ben Carson more inspiring than Huckabee; some of them will consider Jeb Bush perfectly acceptable and more electable; and so on. Thats one reason that a strategy of unifying evangelicals is unlikely to work: They wont unify. Another is that there are a lot of other Republican voters. Huckabee performed dismally among non-evangelicals in 2008. Although the evidence isnt conclusive, he appears to have done poorly even among Catholic social conservatives. A more concerted effort by evangelicals to act as a bloc would probably have turned off non-evangelicals even more. The strategy could even boomerang. If the bloc vote materializes to some extent but cant deliver the nomination to its favored candidate, then the actual winner will have a lower percentage of evangelical supporters than he might have had otherwise. So hell be less dependent on evangelicals and thus less beholden to them. If, for example, Huckabee follows the evangelical-bloc strategy and loses, hell make it harder for other candidates to run successful campaigns trying to unite people of varying religious commitments on the right end of the party, and make it easier for a moderate to win. Thats precisely the outcome that evangelical leaders want to avoid. Not acting as a bloc, on the other hand, allows the groups influence to permeate the party. If evangelical voters are up for grabs, every politician in the party has an incentive to court them and nobody has an incentive to ignore them. That doesnt guarantee that theyll achieve their political goals it doesnt mean the Republican nominee will put their issues front and center but it would give them real weight within the Republican coalition. Ramesh Ponnuru, a Bloomberg View columnist, is a senior editor for National Review, where he has covered national politics for 18 years, and a visiting fellow at the American Enterprise Institute.]", "Date": "20150108", "Author": "[Ramesh Ponnuru, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/sns-wp-blm-news-bc-gop-comment07-20150107-story.html", "Title": "[Republicans can't count on evangelicals in 2016]"}