{"Content": "[This is where people come to get away. There are no high-rises or skyscrapers. No subdivisions, no traffic. No red light cameras trying to make an extra penny for a bankrupt city. Cellphone service is spotty, at best. The towns population is in the hundreds. Some live in houses right off the road, while others are tucked away in cabins a mile deep in the woods. On this particular night, the early dinner crowd is gathered at the local pub and grub, Jungle Jims. The parking lot is packed. Inside, the owner is serving up drinks at a crowded bar. A second bartender doubles as a server, carrying hot dishes to patrons seated in the dining area. In the world of Facebook-Twitter-cable news, the punditry is buzzing about the presidential race. Thursdays Republican primary debate is still being debated. Every press release, sneeze or sip of water generates a breaking news flash at the bottom of the TV screen. But here, the political discussions are at a completely different level. Theyre personal. At first blush, a lot of people underestimate themselves. They say they dont \"follow politics.\" That they dont know the issues. Sure, perhaps they cant name all their elected officials, or rattle off statistics about the national debt. But like the rest of us who dont always realize it, theyve all made life choices based on whats happening in their city halls, statehouses and the nations capital. Chantel Daletski, who is sipping on an iced drink, lives near Joliet. Her oldest daughter is 23 and planning her future but not in the state where she was raised. \"She basically feels forced out of Illinois,\" says Daletski, 47. Her daughter wants to settle down, buy a home and start a family. Just not in Illinois. Taxes are too high, and economic opportunity is too scarce. \"She doesnt want to work and work and have nothing to show for it,\" Daletski says. Across the table is Daletskis fiance, Bob Deddo. He understands the situation Chantels daughter faces. Deddo used to live in Illinois. Now his home is Menominee, Mich. where his house is on a \"huge lot in town\" and has a multicar garage. He boasts that his property tax bill is only $2,400. \"Thats considered high for where I am,\" he says, quickly pointing out that his friends in Illinois are paying two, three or even four times that for a lot less house on a lot less land. Of course, his new town isnt the metropolitan hub that Chicago is. But after years of the hustle and bustle, he doesnt crave that anymore. \"Its a slower lifestyle here. No traffic,\" he says as he chows down a beef brisket sandwich. Besides, in Illinois, \"the taxes were too high and the politicians are too crooked.\", At the bar, Gerald Odekirk laments the broken promises made by politicians who have come and gone over the past few decades. The baseless pledges, the cheap talk its part of the reason Odekirk is tired of career politicians. The last time he really got excited about a presidential candidate was in the 1990s, when Ross Perot ran. \"When we get a renegade, thats when I vote,\" says Odekirk, 67, of Plymouth, Wis. Perot \"was gonna take care of the common people.\", Candidates spend big money on consultants and political strategists, trying to tap into the psyche of middle America. They go to places like this to glad-hand folks and snap photos for campaign mailers, showing just how regular they really are. Instead of just posing for the cameras, candidates would be smart to listen. Yes, some people are truly uninformed and apathetic. But a lot of people are smarter than candidates and campaigns give them credit for. In spite of the things that politicians do, people fight to live on their own terms. Daletskis daughter wants economic opportunity. Shell cross state lines to get it. Deddo wanted property tax relief. He packed up his life and started over, elsewhere. Odekirk cant stand corruption and career politicians. Hes not the only one craving someone who will give it to him straight. People are tired of grand bargains, deals, new programs and promises. They dont want government in their face all the time. These feelings are universal, whether you live in the north woods of Wisconsin or a bustling city. As the evening nears, more groups funnel into Jungle Jims. A new dad walks in with a 6-week-old in a baby carrier and a proud new mom. A bride and bridesmaids dressed in turquoise stop in for a quick drink on their way to a big night. The parking lot fills with more trucks and four-wheelers. The early dinner crowd begins to head out. Whether for a few hours or a few days, theyve managed to escape the fray. They drive off into the early sunset, where the trees are tall and straight, back to the country and the woods. Diana Sroka Rickert is a writer with the Illinois Policy Institute. The opinions in this essay are her own.]", "Date": "20150810", "Author": "[Diana Sroka Rickert]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-candidates-campaigns-ross-perot-wisconsin-illinois-voters-perspec-0811-jm-20150810-story.html", "Title": "[Listen up, candidates: Give voters more credit]"}