{"Content": "[For more than a half-century, the South Side has taken great pride in the legacy of the DuSable Museum one of the nations earliest independent museums of African-American history, founded by African-Americans. But in the next five years, the DuSable will face a new contender in the neighborhood: the Barack Obama Presidential Center. The presidents library and museum bring the prospect of economic revival, infusing long-neglected South Side neighborhoods with new businesses and investments that promise to generate $220 million a year and attract 800,000 visitors annually. Whether the Obama center is built in Washington Park or Jackson Park, longtime South Side institutions including the Museum of Science and Industry hope to benefit. But the project also raises concerns about whether an independent, financially strapped museum such as the DuSable Museum of African American History can stay afloat in the shadow of a towering presidential library and museum run by the federal government and backed by a multimillion-dollar endowment. \"Some have said the library will come and it will be sucking funds. I dont think thats going to be the case. I think the library will have a positive impact on the surrounding area,\" said Troy Ratliff, DuSables chief operating officer. \"The question is: I came to the Obama library, whats going to make me leave the library and walk over to DuSable? That has to be a question that gets answered.\", The library project comes as the DuSable faces mounting challenges. Like many museums across the country, particularly those that focus on ethnic culture, the DuSable has struggled financially as funding sources have dried up, according to museum officials and state financial records. Beach renamed August 11, 2015, for DuSable Museum co-founder, Margaret Burroughs. (WGN-TV), Beach renamed August 11, 2015, for DuSable Museum co-founder, Margaret Burroughs. (WGN-TV), Its leadership also is in flux, an instability that recently placed advocates, volunteers and board members at odds with each other over the artistic direction of the museum. Despite its troubles, the DuSable has survived, largely because of its unique stature as a South Side icon. It is the only place in Chicago that documents the progression of African-Americans from the rusty iron ankle shackles worn by slaves to a talking, life-sized animatronics figure of the citys first black mayor, Harold Washington. Tucked away among the trees in Washington Park, just steps from the sprawling University of Chicago Medical Center, the DuSable has never reached the citywide acclaim of the more prosperous Museum of Science and Industry farther east. Yet, for many who live on the South Side, the DuSable is a must-see attraction for schoolchildren, family reunions and Sunday afternoon outings. Attendance from 2012 to 2014 climbed from 102,603to 118,473, according to museum officials, a more than 15 percentincrease. Visitors experience thousands of years within a few rooms. Wooden masks and dance wands once used by the Yoruba people of West Africa are encased on the walls. There is a slave bill of sale from 1794 documenting the purchase of a black couple and their child. Artifacts tell the stories of black soldiers from the Civil War to World War II, displayed along with profiles of African kings and queens. Chicago historian and artist Margaret Burroughs and her husband, Charles, launched the museum in their South Side home in 1961, primarily with items from their private art collection. A decade later, the Chicago Park District donated the land and building that now houses the museum. Burroughs and other local artists, historians and educators pooled their resources to create a museum that would showcase the contributions of African-Americans and provide a forum for exchanging ideas. Though such museums affiliated with colleges and universities had been in existence since the 1800s, the DuSable was the second independent, nonprofit African-American museum to open in the United States. The Barack Obama Foundation, the nonprofit spearheading the library project, has not specified what kind of partnerships it will forge in the community. Museum experts, however, have said that aligning with the DuSable, as well as other South Side institutions, could create a synergy that enhances the Obama centers policy work, research and educational programs. The South Side institutions would like to see the Obama library become the flagship for the coalition they call Museum Campus South, a promotional effort backed by the citys tourism arm, community organizations and two U. of C. departments. That group, spearheaded by the DuSable, aims to create a cohesive arts and culture scene on the South Side. \"The Obama library ... is not starting from scratch,\" Ratliff said. \"We have great cultural institutions here. It becomes one of them. ... Our challenge is to continue whats going on here already.\", DuSable does have problems to contend with. The museum, which receives money from the Chicago Park District as well as grants and private donations, has lost money for at least two years, according to public financial records. The museum made almost $1 million more than it spent in 2011. The following year, expenses outpaced income by nearly $148,000. Things scarcely improved in 2013, the most recent year records are available, with the museum spending about $135,000 more than it earned. Such losses may not seem like much, but they paint a stark contrast to years like 2009, when DuSable cleared $3.5 million more in income over costs. One source of DuSable funding took a hit this year after Gov. Bruce Rauner froze millions in state grants for capital improvements to public museums, Ratliff said. The DuSable benefited from such dollars as recently as 2014, receiving $750,000 under former Gov. Pat Quinns administration to upgrade its lobby, roof and other infrastructure. The museum also has been without permanent leadership since Carol Adams, the president and CEO since 2009, retired last year. The board is conducting a nationwide search for a new CEO and curator. Both positions should be filled in the next two months, according to Ratliff. Ratliff acknowledged the DuSables money troubles but said administrators are working to boost memberships and that he is confident DuSable finances will trend positive by the end of 2015. Paid memberships which can range from $40 to $1,500 per year dropped slightly from 1,404 in 2013 to 1,392 in 2014. But in 2015, membership has jumped to 1,850, according to museum officials. \"I think theres been a greater awareness of the museum,\" Ratliff said. \"I think weve been doing a number of culturally focused activities that have brought more people through the door.\", Most supporters acknowledge that the DuSable must rejuvenate itself, but they disagree on the best way to go about it. When noted artist Theaster Gates proposed a radical shift in museum operations earlier this summer something that sought to incorporate more external perspectives it set off a firestorm. Gates, who is a DuSable board member and a U. of C. visual arts professor, suggested a committee that would oversee programming at the museum for two years in an effort to revitalize the institution. Gates would head that committee, which would work in tandem with U. of C.s Center for the Study of Race, Politics and Culture, and the Arts and Public Life Initiative that Gates directs. A group of longtime DuSable volunteers and loyalists angrily rebuffed Gates proposal. Organized as the Concerned Committee for the Support of Independent Black Cultural Institutions, they were wary of Gates motives, in part because of his association with the U. of C. Historians and activists closely linked with the museum said the DuSable represents a crucial cornerstone of the African-American community. It gives prominence to art and culture that may not otherwise be publicly presented and allows the community to keep domain over the artifacts and materials that help form the narratives of black history. Affiliation with a university, some said, could place that in jeopardy. \"The ability to tell our stories from our point of view and our voice is extremely important,\" said Yvette Moyo, publisher of The South Shore Current magazine. \"If its told from another perspective, it will not be our story anymore. As an institution, thats what DuSable Museum does for us allows us to see us from our perspective, tell our stories the way we see it.\", Additionally, some see Gates as an outsider and resent the idea of him exerting such influence over the museums direction without the input of historians and community members who have been involved with the museum for decades. Others stress that it is imperative not to lose sight of Burroughs vision. \"Its not saying that we dont want others to be involved, just bring in those who could more accurately help that museum to be the historical place of information that its founder intended,\" said historian Timuel Black. Gates declined to be interviewed by the Tribune. At a community meeting at the universitys Arts Incubator in early August, Gates said he had been asked to brainstorm ideas for DuSable programming but did not specify who made that request. He said he acted out of love for \"an institution on the brink of near financial collapse.\", \"Its a ticking bomb. Its a time bomb,\" Gates said. \"How is it possible that this black thing we love so much, how is it this space that had so much goodness in the past for black people could fail so hard?\", He also acknowledged that he did not consult anyone when creating the proposal and intimated he wanted to collaborate with community leaders in envisioning the museums next steps. Samuel Black, president of the Washington, D.C.-based Association of African American Museums, said a healthy debate over the direction of an institution can be useful, but museums must have a clear strategic plan. \"The thing is to be able to direct those suggestions and funnel them into some kind of initiative that would improve the museum,\" he said. Despite the initial rift, it is clear that supporters share similar goals for the museum and agree some change needs to happen. \"This institution, like any institution, has to change along with the various needs that change in the community,\" Ratliff said. \"If you become stagnant, you become irrelevant. Do you think if Margaret was sitting in this chair, shed be arguing for stagnation? I doubt it very seriously. She would recognize the fact that it is an evolutionary process.\", cdrhodes@tribpub.com, dglanton@tribpub.com, Twitter @rhodes_dawn, Twitter @dahleeng]", "Date": "20150813", "Author": "[Dawn Rhodes, Dahleen Glanton]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-dusable-museum-future-met-0814-20150813-story.html", "Title": "[DuSable Museum braces for change ahead of Obama library arrival ]"}