{"Content": "[Highwood Bocce Club members will vote Sunday on their willingness to relocate to allow the city of Highwood and a developer to move forward with a project that city officials say could change Highwoods destiny. The vote will tell whether a majority of Bocce Club members are amenable to moving out of the indoor courts facility, which was built around 1969 by some of the clubs own members, who worked as brick masons or in other building trades, according to members. The club rents their space from the city under a 50-year lease agreed to in 2009. Highwood officials have offered to relocate the club to a new $4 million bocce ball facility to be built where the citys public works building now stands at 541 Bank Lane, about a block to the north of the current club at 440 Bank Lane. Tom Holleman, a bocce club trustee who heads the clubs relocation proposal committee, said members have mixed feelings about the move. \"There are 46 years of history here and some of these families have been with it from the start,\" Holleman said. \"There is the history of our own members and their families having built it. There are memories associated with the club. To some extent, that is irreplaceable. That is a pretty big part of why it is a conflicted decision.\", On the upside, the new facility would have 58 percent more total square footage and one additional indoor bocce court, and the courts would be lengthened to international standards, according to the relocation proposal. The current bocce club site, which is owned by the city of Highwood, is among five properties that Gart Partners has been trying to assemble since late 2014 for a new apartment and retail complex that would include a public parking garage. The redevelopment area stretches from the Highwood train depot to the southwest and the Bocce Club to the northwest to Teddy OBrians pub to the northeast and the Curry Hut to the southeast. The city is offering to finance the new bocce facility using extra tax revenue anticipated from the Gart project and others within the Downtown Tax Increment Financing District, according to Highwood officials. Bocce Club president Lenny Innocenzi said there about 470 club members and he hopes a good number of members will cast ballots Sunday. Voting is set to take place from 3 to 7 p.m. \"It is change and change is scary,\" Innocenzi said. \"There are a lot of members that would like to move and a lot who want to stay here.\", The wording on the ballot makes it clear the Gart Partners project may not happen for reasons unrelated to the Bocce Clubs decision. The question also stresses that the vote is merely preliminary. The Bocce Clubs board will have opportunities to halt the relocation plans if the city or Gart Partners makes significant changes to what is being proposed. If the project does not proceed, the Bocce Club will remain where it is with no changes to the current lease, the ballot question notes. \"From the citys perspective, the proposed development is a critical piece of an overall plan to address financial issues and reinvest in the citys infrastructure,\" said Holleman, emphasizing that hes not a Highwood resident himself. \"From the residents perspective, it will be the biggest building in the city and will change the look and density of the downtown,\" Holleman said. \"Some view that as positive. Some view that as negative. But there is no question it will have a significant impact.\", In an Aug. 12 letter, Highwood Mayor Charles Pecaro appealed to club members to vote \"yes\" on Sunday, Aug. 23, and outlined what is at stake for the city. He said a favorable vote would allow the city to continue its discussions with Gart Partners on a plan \"that will alter the downtown business district and allow Highwood to increase its competitive advantage over surrounding suburbs. These discussions will most likely not continue without your help.\", Pecaro said the revenue from downtown redevelopment would allow the city to complete infrastructure projects, redevelop dilapidated buildings in the community and bury overhead utility lines. The new housing would bring new residents to the community that would help local businesses and restaurants. The mayor reminded Bocce Club members that the city had come to the clubs aid seven years ago when the club needed a longer-term lease in order to secure a bank loan for needed renovations and an addition. kberkowitz@pioneerlocal.com, @KarenABerkowitz]", "Date": "20150821", "Author": "[Karen Berkowitz]", "Link": "http://www.chicagotribune.com/suburbs/highland-park/news/ct-hpn-bocce-club-vote-tl-0827-20150821-story.html", "Title": "[Bocce Club vote key to Highwood development plans]"}