{"Content": "[At stake in a U.S. Supreme Court decision expected this month are federal subsidies that help more than 200,000 Illinoisans pay for health insurance. If the court eliminates the subsidies, upholding the latest legal challenge to the Affordable Care Act, average premiums in the state for policies bought through the federal marketplace would jump to more than twice what they are now. Thousands would likely abandon their health plans, experts say, throwing the states individual insurance market into chaos. Or the court could leave the subsidies in place, and little to nothing would change. The health law requires everyone to have health insurance or pay a penalty, a requirement that is meant to broaden the pool of people who enroll. The rule helps balance another requirement in the law that insurers must offer coverage to anyone, no matter how sick he is. To help people pay the monthly premiums, the law established income-based subsidies, issued in the form of tax credits. The challengers in King v. Burwell contend that a four-word clause in the law, \"established by the state,\" restricts subsidies to states that operate their own insurance marketplaces. The Obama administration argues that the law was clearly intended to make the subsidies available to everyone, including people in up to 37 states that use the federal exchange, HealthCare.gov, instead of operating state-based exchanges. Thirteen states operate their own exchanges, and three New Mexico, Nevada and Oregon established exchanges but now use HealthCare.gov. The Internal Revenue Service issued guidelines in 2012 that made the subsidies available in all states. The plaintiffs in the court case challenged the agencys interpretation of the four-word clause. In a March hearing, the courts four liberal justices appeared to support the Obama administrations argument that the law was intended to make the subsidies available nationwide, but it was unclear whether a fifth judge would support the administrations view. The court decided the matter shortly after the hearing but has not yet announced the decision. Who would be affected:, People qualify for subsidies based on income. Individuals who earned from about $16,000 to $47,000 last year in Illinois qualified for subsidies this year. Families of four who made from about $33,000 to $95,000 also qualified. People who made less than that qualified for coverage through Medicaid. Those who made more could buy plans on the marketplace but didnt receive subsidies. As of the end of March, 232,371 Illinoisans were receiving tax credits 79 percent of those who bought insurance on the marketplace. With subsidies, marketplace enrollees are paying an average premium of $128 per month. The average premium would jump to $336 without the subsidies, according to federal enrollment data. If the subsidies are withdrawn, many healthy people would likely abandon their plans and instead pay the laws penalty for not having insurance, said Cynthia Cox, associate director of health reform and private insurance at the Kaiser Family Foundation, a nonprofit research organization focused on health issues. The penalty for 2015 is $325 per person or 2 percent of yearly household income, whichever is greater. If healthy people abandon their plans, insurers would likely make up for the lost revenue by dramatically increasing premiums as early as January, Cox said. Those increases would likely apply to individual plans sold off the exchange as well as those sold on it. She predicted that employer plans would not be affected. Another potential wrinkle if premiums increase: Though the health law requires everyone to have insurance, those who would have to pay more than 8 percent of their income for the cheapest available plan are exempt from the requirement. What will the state do?, Supreme Court decisions usually take effect 25 days after they are issued. The courts decision is expected at the end of June, meaning subsidies could stop in July or August. Congress could amend the language to restore subsidies, but the Republicans who control both houses seem unlikely to do so. In Illinois, state officials could establish a marketplace to keep the subsidies. The cost of establishing an Illinois exchange was estimated at $92 million in 2011, but more options are available now, including buying or leasing an exchange platform from other states or the federal government. Efforts to launch a state-based exchange in Illinois failed under former Gov. Pat Quinn, a Democrat. A spokeswoman for Republican Gov. Bruce Rauner did not say whether the administration is planning for the potential loss of subsidies, nor whether Rauner would support a state-based exchange. \"The governors office will take appropriate action depending on how the Supreme Court rules,\" spokeswoman Catherine Kelly said in an email. Illinois is in a slightly different position than other states that stand to lose subsidies, said Nicholas Bagley, an assistant professor of law at University of Michigan Law School who has closely studied the Affordable Care Act. The state operates a \"partnership marketplace,\" meaning it regulates health plans more closely than states that solely use the federally facilitated marketplace. Illinois also runs a call center and oversees outreach to potential enrollees, unlike some states. The third part of having a state-run marketplace is operating the enrollment platform itself. Because Illinois performs two of the three tasks already, fewer hurdles stand in the way of Illinois establishing its own exchange than for other states, Bagley said. This story was produced in partnership with Kaiser Health News, an editorially independent program of the Kaiser Family Foundation. wjventeicher@tribpub.com, Twitter @wesventeicher]", "Date": "20150612", "Author": "[Wes Venteicher]", "Link": "http://www.chicagotribune.com/news/ct-obamacare-supreme-court-met-20150612-story.html", "Title": "[What will Supreme Court's Obamacare ruling mean for Illinois?]"}