{"Content": "[A gunman unleashed a barrage of fire at a recruiting center and another U.S. military site a few miles apart in Chattanooga on Thursday, killing at least four Marines before he was shot to death by police, and sending service members scrambling for cover as bullets smashed through the windows. Federal authorities said they were investigating the possibility it was an act of terrorism, but have no evidence yet that anyone but a lone gunman was involved. They also said there was no indication that the general public was in danger. The FBI took has taken charge of the case. Authorities identified the gunman as Kuwait-born Muhammad Youssef Abdulazeez, 24, of Hixson, Tennessee, though the spelling of his first name was in dispute, with federal officials and records giving at least four variations. A U.S. official said there was no indication Abdulazeez was on the radar of federal law enforcement before the shootings. The official was not authorized to discuss the case and spoke on condition of anonymity. The shootings took place minutes apart, with the gunman stopping his car and spraying dozens of bullets first at a recruiting center for all branches of the military, then apparently driving to a Navy-Marine training center 7 miles away, authorities and witnesses said. The attacks were over within a half-hour. The shooter fired from inside his car when he went to the recruitment center, but then got out of the vehicle to shoot the four marines at the training center, FBI agent Ed Reinhold told a news conference late Thursday. In addition to the Marines killed, three people were reported wounded, including a sailor who was seriously hurt. \"Lives have been lost from some faithful people who have been serving our country, and I think I join all Tennesseans in being both sickened and saddened by this,\" Gov. Bill Haslam said. Authorities would not say how the gunman died, but the U.S. official who spoke on condition of anonymity said investigators believe Chattanooga police fired the fatal shot that killed him. At least one military commander at the scene also fired at the gunman with his personal weapon, but forensic investigators determined that police killed him, the official said. Reinhold said Abdulazeez had \"numerous weapons\" but would not give details. He said investigators have \"no idea\" what motivated the shooter, but \"we are looking at every possible avenue, whether it was terrorism, whether its domestic, international, or whether it was a simple criminal act.\", Reinhold also told a news conference late Thursday that \"there is no indication at this point that anybody else was involved.\", U.S. Attorney Bill Killian told the news conference that \"as far as we know at this juncture, there are no safety concerns for the general public.\", Within hours of the bloodshed, law officers with guns drawn swarmed what was believed to be Abdulazeezs house, and two females were led away in handcuffs. A dozen law enforcement vehicles, including a bomb-squad truck and an open-sided Army green truck carrying armed men, rolled into the Hixson neighborhood, and police closed off streets and turned away people trying to reach their homes. Abdulazeez graduated from the University of Tennessee at Chattanooga in 2012 with a bachelors in electrical engineering and was a student intern a few years ago at the Tennessee Valley Authority, the federally owned utility that operates power plants and dams across the South. The U.S. National Counterterrorism Center is reporting no apparent nexus to terrorism has been uncovered in the investigation, but intelligence officials are monitoring the investigation closely. The Islamic State group has been encouraging extremists to carry out attacks in the U.S. and several such homegrown acts or plots have unfolded in recent months. The names of the dead were not immediately released. In addition to the wounded sailor, a Marine was hit in the leg but not seriously hurt, and a police officer was shot in the ankle, authorities said. In Washington, President Barack Obama pledged a prompt and thorough investigation and said the White House had been in touch with the Pentagon to make sure military installations are being vigilant. \"It is a heartbreaking circumstance for these individuals who served our country with great valor to be killed in this fashion,\" he said. Vice President Joe Biden likewise said: \"Their families have already given a lot to the country, and now this.\", The shootings began at the recruiting center on Old Lee Highway, where a shot rang out around 10:30 or 10:45 a.m. followed a few seconds later by more fire, said Sgt. 1st Class Robert Dodge, leader of Army recruiting at the center. He and his comrades dropped to the ground and barricaded themselves in a safe place. Dodge estimated there were 30 to 50 shots fired. Doors and glass were damaged at the neighboring Air Force, Navy and Marine offices, he said. Law enforcement officials told recruiters that the gunman stopped his car in front of the recruiting station, shot at the building and drove off, said Brian Lepley, a spokesman with the U.S. Army Recruiting Command in Fort Knox, Kentucky. The recruiting center sits in a short strip mall, between a cellphone business and an Italian restaurant, with no apparent special security. The gunman opened fire next at the Navy Operational Support Center and Marine Corps Reserve Center Chattanooga. All the dead were killed there. The Navy-Marine center, situated in an industrial area of the city, is a fenced-off installation. Its two entrances have unmanned gates and concrete barriers that require approaching cars to slow down to drive around them. Marilyn Hutcheson, who works at Binswanger Glass across the street, said she heard a barrage of gunfire around 11 a.m. \"I couldnt even begin to tell you how many,\" she said. \"It was rapid-fire, like pow-pow-pow-pow-pow, so quickly. The next thing I knew, there were police cars coming from every direction.\", She ran inside, and she and other employees and a customer waited it out with the doors locked. The gunfire continued with occasional bursts for what she estimated was 20 minutes. Bomb squads, SWAT teams and other local, state and federal authorities rushed to the scene. \"If it was a grievance or terroristic related, we just dont know,\" she said. Associated Press]", "Date": "20150716", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-chattanooga-military-facility-shooting-20150716-story.html", "Title": "[Barrage of bullets leaves 4 Marines dead in Tennessee attack]"}