{"Content": "[Cook County Board President Toni Preckwinkle is trying to muster enough support to raise the sales tax by a penny on the dollar an about-face on the key issue that propelled her into office. The money would help shore up the pension system for county government workers and balance next years budget. But getting nine of the 17 commissioners to vote for the sales tax hike could prove challenging, given the enormous backlash that unfolded in 2008 after the County Board increased the sales tax by 1 percentage point. Cook County Board President Toni Preckwinkle ran this ad in her 2010 campaign against then President Todd Stroger. Cook County Board President Toni Preckwinkle ran this ad in her 2010 campaign against then President Todd Stroger. The move by then-Board President Todd Stroger led to his ouster in the 2010 Democratic primary, as Preckwinkle emerged from a crowded field after pledging to eliminate what remained of the unpopular tax hike. Preckwinkle ran a campaign ad in which she shook hands with an actor portraying Benjamin Franklin. \"I used to teach my history students about Ben Franklin. A penny saved is a penny earned,\" says Preckwinkle, a former schoolteacher, using the patriots famous phrase. By 2013, the county had rolled back the remaining half-penny of the so-called Stroger tax during Preckwinkles first term. Despite some other tax and fee increases, Preckwinkle went into last years re-election bid unopposed on the strength of having lowered the overall county tax burden while making significant spending cuts. Safely re-elected, Preckwinkle has been meeting individually with commissioners to build support for restoring the sales tax hike, several sources familiar with her plans told the Chicago Tribune. Preckwinkle declined to answer questions on the potential tax hike Monday. \"Our finance team is hard at work looking at a number of scenarios for coping with this difficult situation, and we expect to present a plan to our Board of Commissioners shortly,\" Preckwinkle spokesman Frank Shuftan said in a statement. A 1-percentage-point hike would take the sales tax in Chicago to 10.25 percent, once again making it among the nations highest. Birmingham and Montgomery in Alabama have sales tax rates of 10 percent, as do some California cities, and were listed as the highest in the country in a nationwide study conducted three years ago. New York Citys rate is 8.875 percent, while San Franciscos is 8.75 percent. Currently, the county portion of the sales tax is .75 percent. The states is 6.25 percent. Chicago government tacks on another 1.25 percent and the Regional Transportation Authority another 1 percent. Although the irony of Preckwinkle proposing what contributed mightily to Strogers political downfall was not lost on people familiar with the proposal, they also said Preckwinkle is in a better position to sell a sales tax hike. She has cut payroll and reduced other costs, while also avoiding the type of mismanagement and patronage scandals that embroiled her predecessor. If Preckwinkle can line up the votes, she would introduce the tax increase in early July and try to get it approved by the end of the month, sources said. The tax hike would generate more than $300 million a year starting in 2016, when the county will face rising debt payments, increased payroll costs and possibly increased pension fund payments. The tax hike plan would come before Preckwinkle even unveils her new budget proposal. But acting early could give Preckwinkle a better chance of getting state lawmakers and Gov. Bruce Rauner to approve her proposed county pension fund changes. Preckwinkles plan would require the county to put more money into the pension system, and lawmakers are reluctant to approve a plan that could be viewed as tantamount to voting for a tax increase. If the sales tax increase already is approved, Preckwinkle can provide lawmakers with some political cover. In addition, a vote next month would allow Preckwinkle to get out front of any city tax hikes that Mayor Rahm Emanuel might try to pass as part of his budget proposal for next year. It would be harder for county commissioners to support Preckwinkle if the City Council, which faces a nearly $1 billion shortfall and is looking at myriad ways to plug that hole, also was considering a sales tax increase. Under Preckwinkles pension proposal pending at the Capitol, the county would be required to pay another $147 million a year into the pension fund. The plan also would reduce cost-of-living increases for retired workers, raise the retirement age and require government workers to pay more toward retirement while guaranteeing retirement health care subsidies. If Preckwinkle decided to try to stabilize the pension fund without those changes, the annual cost to taxpayers would be even greater. As it stands, the county pension fund is about $6.5 billion short of what it needs to meet future benefits, and that amount grows by more than $30 million a month, Preckwinkle said recently. There had been some talk of a county property tax increase to cover pension fund payment increases, but too many commissioners opposed that idea, even though that tax was last increased in 1994, the sources said. Last October, Preckwinkle warned of a difficult year ahead after the County Board approved an election-year budget proposal with no tax increases. Ivan Samstein, the countys chief financial officer, said then that although overall county debt is lower than when Preckwinkle took office, the amount due in 2016 would be at least $75 million more than this year. Commissioner Larry Suffredin, D-Evanston, voted against the budget, saying that the county was not doing enough to fund future increased pension payments, plan for public health care system funding uncertainties and reduce the number of jail inmates. \"Postponing bad news does not eliminate it,\" Suffredin said then. \"There is no planning for next year built into this election-year budget. Transparency requires that I warn people of the coming budget storm.\", hdardick@tribpub.com, Twitter @ReporterHal]", "Date": "20150622", "Author": "[Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cook-county-property-tax-increase-0623-20150622-story.html", "Title": "[Preckwinkle pushing 1 percent county sales tax increase]"}