{"Content": "[Illinois Democrats on Thursday pledged to stay united against Republican Gov. Bruce Rauners union-weakening agenda, but divided in their support of a challenger to take on GOP U.S. Sen. Mark Kirk next year. Several speakers, including recipients of state subsidized social services, took to the stage on Democrat Day at the Illinois State Fair to criticize Rauners budget cuts. A day earlier, the first Republican governor elected since 1998 spent Governors Day blaming the states problems on \"Chicago machine\" Democrats. Party crashers tried to dampen the mood at the Illinois State Fair for the first Republican Governors Day in 13 years. Aug. 19, 2015. (CBS Chicago), Party crashers tried to dampen the mood at the Illinois State Fair for the first Republican Governors Day in 13 years. Aug. 19, 2015. (CBS Chicago), Michael Madigan, the veteran House speaker and state Democratic chairman, encouraged rank-and-file party members to contact their lawmakers to help bolster the House and Senate supermajorities. \"Weve taken a lot of criticism. Weve taken a lot of verbal abuse. But we are united,\" Madigan told the party faithful. Earlier, at a breakfast hosted by Democratic county chairmen, Madigan, who has been speaker for 30 of the past 32 years, described the \"epic struggle\" his party is engaged in with Rauner. \"Illinois has a Republican governor who thinks that the Illinois budget-making (process) can be used and leveraged to bring down the wage rates all across the state, and it would bring down the standard of living for middle-class families,\" said Madigan, who cited Democratic lawmakers opposition to Rauners demands for provisions to weaken collective bargaining and prevailing union wage requirements for municipalities and local school districts as part of a comprehensive budget agreement. Senate President John Cullerton noted the actions of his majority the day before to override Rauners veto of legislation that would require arbitration on a new contract between the administration and state workers in lieu of a lockout or strike if an impasse is reached. \"We are willing to work with Gov. Rauner, but we dont work for Gov. Rauner,\" said Cullerton, who scored the biggest applause line from the hundreds of people who attended the chairmens breakfast at a downtown Springfield hotel. \"We acted to take extreme options off the table in hopes of encouraging moderation and reasonable compromise, and thats important for everyone involved. I hope the governor gets the message,\" Cullerton said. Labor contracts with state workers expired July 1, and the House must also override the veto for the bill to become law. Madigan once again pledged he would have the 71 votes needed for the override, but said a roll call may not be held next week when the House returns to the Capitol. While the legislative opposition to Rauner remained entrenched, there were divisions among Democrats over who should challenge Kirk, a top target nationally in next years election. Senior U.S. Sen. Dick Durbin was on vacation but recorded a video in which he restated his support for two-term U.S. Rep. Tammy Duckworth of Schaumburg for the Senate. Durbin is a longtime Duckworth backer, and the Democratic Senatorial Campaign Committee has endorsed her, raising complaints from her primary rivals. \"When I talk to my colleagues in the Senate from all over the United States, they all say, The road to a majority of Democrats in the Senate starts in the state of Illinois,\" Durbin said. Duckworth took what appeared to be a veiled shot at primary rival Andrea Zopp, the former Chicago Urban League chief who also previously served on the Chicago Board of Education when it closed nearly 50 schools. Duckworth spoke of her childhood attending a crumbling school \"that different types of people might want to shut down because it was one that most of the kids were on some sort of public assistance, a lot of kids didnt graduate.\", Cook County Commissioner Richard Boykin, a former chief of staff to U.S. Rep. Danny Davis, said he expected to make a decision on whether to run for Senate on Sept. 9. Boykin, too, criticized Zopps role at the Chicago Public Schools, saying hes heard from voters who are \"fed up with individuals who would go and close 50 schools. And whenever you close a school, youre opening a prison.\", Zopp, who used the fairgrounds event as the formal campaign kickoff, said her background as a lawyer and business and civic executive made her \"uniquely qualified\" to serve as senator. \"My roots in Illinois and the values of the Democratic Party run deep,\" Zopp said. As Zopp, a first-time candidate, neared the end of her morning speech, she stumbled over her words before pausing and addressing the audience. \"Sorry. People are like, really Andrea? You know better, try again,\" she said into the microphone. \"We wrote a great speech for you, and youre messing it up., \"As a trial lawyer, right, now the jury is going, Oh my God,\" she added. State Sen. Kwame Raoul, D-Chicago, said he backs Zopp, saying her qualifications for the U.S. Senate were \"better than President Obama.\" Raoul also was critical of the DSCCs endorsement and said a nominee shouldnt be decreed from Washington. Cullerton, the Senate president, said he backed state Sen. Napoleon Harris of Harvey for the nomination should he run. Harris said he expected to formally file nominating papers \"soon.\", In 2012, Harris sought a congressional seat even before he was sworn in to his first term as a state senator, only to drop out later. If it stands, the field of four U.S. Senate candidates would feature Duckworth, who is of Asian descent, and Zopp, Boykin and Harris, three African-Americans who could split the traditionally heavy black Democratic primary vote. The day also featured Chicago City Clerk Susana Mendoza and state Sen. Daniel Biss of Evanston, two contenders for the special primary nomination for the office of comptroller. They would run against Republican Leslie Munger, who was appointed to fill the vacancy left by Judy Baar Topinka, who won re-election last year but died before being sworn in. Illinois Secretary of State Jesse White reiterated that he would not seek a sixth term in 2018. White, 81, has made similar declarations in the past but opted to run again. rap30@aol.com, mcgarcia@tribpub.com]", "Date": "20150820", "Author": "[Rick Pearson, Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-democrat-day-illinois-state-fair-met-20150820-story.html", "Title": "[Illinois Democrats united against Rauner, divided on U.S. Senate race]"}