{"Content": "[Michael Rosengarden says he is a \"big believer\" in medical marijuana. But his sympathy for Illinois cannabis patients runs into a roadblock at his workplace, where he wont employ anyone found with drugs in their system. \"The liability is significant, and Im not interested in losing what Ive worked a lifetime to put together,\" said Rosengarden, president of Autohaus Automotive, a car dealership in Northbrook that has been in his family for 43 years. As Illinois moves closer to opening its first medical marijuana dispensaries, some employers have begun navigating the tricky landscape of medical weed at work. Theyre examining how they would handle an employee or job candidate who can buy and use pot legally under state law while potentially conflicting with their drug policies and with federal law, which still classifies marijuana as a Schedule 1 controlled substance, alongside cocaine and heroin. 10 Children are among first Illinois residents to be approved for medical marijuana use. August 5, 2015. (WGN-TV), 10 Children are among first Illinois residents to be approved for medical marijuana use. August 5, 2015. (WGN-TV), While the states Compassionate Use of Medical Cannabis Pilot Program Act prohibits employers from discriminating against a marijuana patient, it permits employers to drug test and to enforce zero-tolerance and drug-free workplace policies, as well as to discipline qualifying patients for violating those rules. As in most states where medical marijuana is legal, the Illinois law does not protect qualifying patients from being fired for failing a drug test, which can happen long after the high is gone. \"Ultimately, in Illinois, (patients) need the sympathy of the employer,\" said employment attorney Joe Yastrow, president of Chicago-based Laner Muchin, who represents management. But even sympathetic employers may feel that their hands are tied. Rosengarden, who employs 180 people who in some way handle cars at his Mercedes-Benz dealership, said he is opting to stick with his drug policies, which include pre-employment and post-accident testing, for fear that his workers compensation and liability insurance providers wont reimburse expenses incurred by a worker who tests positive for marijuana. \"Society is moving in one direction, but there are certain aspects of the law or the people we partner with who arent there yet,\" Rosengarden said. \"Were caught in the middle.\", With just 2,800 qualifying patients so far, and many of them not employed given their debilitating conditions, the number of people directly affected is small for now, said Dan Linn, director of government and public relations at the Illinois Cannabis Industry Association. But for those who get tangled in the conflicting policies, \"it will be a tough decision if they have to choose between their medicine and their livelihood,\" Linn said. \"I am definitely concerned because this is a very likely problem we can foresee happening, looking at other states.\", Lawsuits challenging marijuana-related terminations in other states where it is legalized have consistently gone in favor of employers. In a closely watched case, the Colorado Supreme Court in June ruled that Dish Network could legally terminate Brandon Coats, a paraplegic veteran with medical authorization to use marijuana, after he failed a drug test. It concluded that a state law that prohibits employers from terminating employees for lawful activities outside of the workplace didnt protect Coats because his use of marijuana violated federal law. (Illinois has a similar \"lawful activities\" statute.), In Michigan, the Sixth Circuit Court of Appeals in 2012 ruled that Wal-Mart could fire Joseph Casias, a cancer patient with a medical marijuana card, after he tested positive for pot, saying that users are not protected in the private sector. In Illinois, the issue hasnt yet been tested, but the language of the state law seems to put patients at the mercy of their bosses. Employers can accommodate a workers medical marijuana use but dont have to, and workers who try to claim disability discrimination for their medical pot use are unlikely to succeed, Yastrow said. The Illinois Human Rights Act and the Americans With Disabilities Act both exclude current illegal drug users from protection. Aside from certain jobs explicitly forbidden by state law from being filled by medical pot patients including law enforcement officers, firefighters, correctional officers, school bus drivers or anything requiring a commercial drivers license it is up to the employer to decide how compassionate they want to be. And for many employers, the potential liability is not worth the risk. Jeffrey Risch, chair of the Illinois Chamber of Commerces Employment Law and Litigation Committee, said he has spoken with hundreds of employers about how they plan to handle medical marijuana at work, and every one of them has said they will continue to enforce zero tolerance on drugs, regardless of whether they are dealing with forklift operators or accounting clerks who rarely move from behind their computer screens. \"Marijuana is still viewed by the employers I interface with as a drug that they dont want to tolerate,\" he said. \"Every one of them will say passionately, sincerely, that they owe an obligation to their workers ... to maintain a healthy work environment free from the effect or use of drugs.\", Peter Bensinger, president and CEO of Chicago-based Bensinger, DuPont and Associates, which analyzes employee drug tests for companies, said he has not seen clients changing their drug policies to allow exceptions for marijuana, which he says can affect coordination, judgment, short-term memory and driving skills. \"Employers basically want a drug-free workplace,\" said Bensinger, who served as head of the Drug Enforcement Administration from 1976 to 1981. \"They do not want workplaces to have a double standard,\" where one group of employees can fail drug tests without consequence and another cant, a potential liability if it is argued that drug policies arent being enforced consistently. But some employers are taking a different tack. At a manufacturing company on a quiet street on the Northwest Side, the plant manager, who oversees 40 employees on the shop floor, is a qualifying cannabis patient. He and his boss asked to withhold their names and the name of the company, given the sensitivity of the topic. In 20 years of suffering from fibromyalgia, a condition that he describes as feeling like \"a stubbed toe spread out all over your body,\" the plant manager, who is 53, said he has tried multiple prescription drugs that either havent worked or caused bad side effects. An 11-year veteran at the company, he grappled with whether to tell his bosses after he was accepted into the states medical marijuana program, worried he might be fired on the spot. But he wanted to be honest because his job includes safety-sensitive tasks; occasionally, he drives a forklift. The companys CEO calls the plant manager \"an outstanding worker.\" He said he trusts him to use marijuana responsibly, hoping that if he feels better he will work better too. \"Im looking at it for him as something he needs, like you would take an aspirin,\" the CEO said. \"If he tests positive, its not going to be an issue. If it starts impacting his work here, then that will be an issue.\", The plant manger, who has been getting pot on the black market while he waits for dispensaries to open, said marijuana eases his pain and relaxes his muscles. While it does slow his reaction time and thinking, he said it spares him the paranoia, angst and a \"Gumby\" feeling he gets when he takes his prescription oxycodone. The employee splits his treatment between pills and marijuana, but once he can get pot legally he hopes to phase out the pills, which he worries are addictive. He said he makes it a point to take his medications by 5 each evening to make sure he isnt groggy when he has to wake up at 3 a.m. and he doesnt bring marijuana to work. The CEO said he plans to talk to his workers compensation insurer once patient cards are issued and the dispensaries are open, and he may update the companys drug policy to reflect the marijuana accommodation. But he worries about setting a precedent and the heightened risk of workers injuring themselves or others if they come to work stoned. The plant manager, he said, stands out as a clear, concise thinker, and if he sees that changing it could raise a red flag. The plant manager worries too. If something happens to him, will he be able to collect unemployment? Workers comp? Disability? Will his insurance deny his medical bills? How will he make his mortgage or car payments?, Though he is grateful to have an understanding boss, \"Right now, it seems like a huge risk, which doesnt seem right as it is something that the state deems to be legal,\" he said. \"Which then begs the question: If I am doing something that is legal, then why should I be punished for it, or treated differently than other employees?\", The business community pushed to keep the ability to enforce a drug-free workplace during negotiations over the language of the Illinois law, so they could apply their policies yet also exercise discretion if they wanted to make an exception for a card-carrying patient, said Bob Morgan, former coordinator of the Illinois Medical Cannabis Pilot Program, who is now in private practice at Chicago law firm Much Shelist. The most important thing now, he said, is for employers to educate themselves on the law, including the fact that it forbids use in public and limits use to people suffering from a handful of debilitating conditions. \"This entire program poses a lot of challenges to a lot of people,\" Morgan said. \"But across the whole, what weve seen in other states is that employers generally find ways to accommodate their employees because there are strong market forces. They want their employees to feel better.\", Morgans colleague Sheryl Jaffee Halpern, who heads the labor and employment group at Much Shelist and primarily represents management, said most clients are being practical about how much they can tolerate marijuana use. Those in safety-sensitive industries may tighten the language of their zero-tolerance policies, while those in lower-risk environments may take a less rigid approach. Yastrow, the management-side employment lawyer at Laner Muchin, said that one of his partners is severely ill with cancer, and if a doctor recommended marijuana as a treatment \"in a New York minute Id say thats fine with me.\", \"Im not worried about any overarching safety issues in our workplace, so if this person tells me that this will make his suffering less, then personally, Id be all for it,\" he said. Yastrow feels that employers should consider treating a medical marijuana patient like any other employee who is on prescribed medication, \"and that is to make an assessment of whether or not they can do their job. And if they can do their job and there is no danger presented, then not to exclude them based on some more general view of the drug or drug use.\", But even employers who want to make concessions for marijuana patients have to calculate the risk. An employer, particularly in a safety-sensitive industry, could risk costly litigation if a marijuana-using employee gets hurt or hurts someone else, or run into complications with insurance, Yastrow said. Insurance rates can be influenced by whether an employer has a drug-free workplace, said Trey Gillespie, senior workers compensation director at the Property Casualty Insurers Association. And while insurers cant exclude specific employees from coverage, they can decline to reimburse workers, or reduce benefits, for injuries if they decide the employees were intoxicated at the time of the accident, according to Illinois workers compensation statute. But how to determine if someone is \"intoxicated\" by marijuana is a complicating layer, especially since there is no legal threshold as there is with alcohol. A urine test, which is the most common method in workplace testing, tells you only if someone has used pot, not whether they are intoxicated, said Dr. David Fletcher, a medical review officer and founder of SafeWorks Illinois in Champaign, which analyzes drug tests for employers. Because marijuana settles into the bodys fat deposits, it can stay in the system long after the last drag of a joint, generally two to three weeks in someone of moderate size who consumes pot once or twice a week, Fletcher said. But it isnt just drug testing that has some people worried. Illinois medical marijuana law says there is no cause of action against an employer who acts on a \"good faith belief\" that an employee was impaired. \"That to me is frightening,\" said Chicago-based attorney Lori Ecker, who represents plaintiffs. \"Theres nothing that requires employers to give training to supervisors to know what to look for. Bleary eyes could be because of the pain they are experiencing from the underlying disability. And it could be just a supervisor making that stuff up.\", With what she sees as little protection from the law, patient advocate Feliza Castro hopes to rally employers to protect their workers. Castro, founder of The Healing Clinic and the nonprofit advocacy group Justice for Patients, said she is partnering with employers that are able to modify their workplace drug policies to make exceptions for medical marijuana patients, in hopes they will set an example for others to follow. She has lined up companies in health care, law, and food and beverage, and expects to announce them when the dispensaries open. Though it isnt clear when that will be, Castro believes it could be as early as October, when the first cannabis crops are expected to be ready, or as late as January. Meanwhile, bills have been introduced in Congress that would remove marijuana from Schedule 1 status, where it is defined as having no medical use, which in turn blocks federal funding of studies looking into whether that is so. Rescheduling marijuana would allay much of the haze around allowing pot among employees, though supporters arent holding their breath that it will happen soon. \"Itll catch up,\" said Rosengarden, the car dealer. \"Its just a matter of time.\", aelejalderuiz@tribpub.com, Twitter @alexiaer]", "Date": "20150821", "Author": "[Alexia Elejalde-Ruiz]", "Link": "http://www.chicagotribune.com/business/ct-medical-marijuana-workplace-0823-biz-20150820-story.html", "Title": "[Why medical marijuana can still get you fired in Illinois]"}