{"Content": "[For one attorney, the pursuit of former Chicago police Cmdr. Jon Burge and the torture of African-Americans spanned a good portion of his career, nearly three decades in which disbelief that detectives abused suspects gave way to acceptance and legal defeats became victories. For the other attorney, his dealings with the Burge cases have been more recent, just four years. Yet those torture claims had become a stain on the city and a source of tension with African-Americans. His boss, Mayor Rahm Emanuel, wanted to put the long-standing scandal to rest. So it was on a Friday in early April that civil rights attorney Flint Taylor was visiting with a high school friend outside Boston after speaking about his career in public interest law and Burge at Harvard Law School. Stephen Patton, the citys corporation counsel, was in Florida for a long weekend, driving from Fort Lauderdale to West Palm Beach. After months of quiet negotiations, they spoke on the telephone and agreed on a deal to pay $5.5 million in reparations to Burges victims. The City Council is expected to ratify the deal Wednesday, making Chicago the first municipality in the country to pay reparations for such egregious police misconduct, lawyers involved in the negotiations believe. Burge and the \"midnight crew\" of detectives under his command used electric shock, suffocation and even Russian roulette to coerce confessions from dozens of black suspects, special Cook County prosecutors concluded after a four-year investigation. Burge went to federal prison for lying about the torture. While the $5.5 million in reparations pales in comparison with the more than $100 million the city has already paid out in settlements, judgments and other legal costs from the scandal, the money was a key component in reaching the agreement. Still, other features of the deal including a permanent memorial recognizing the victims as well as a requirement that Chicago Public Schools teaches eighth- and 10th-graders about the Burge legacy should cement the scandal in the citys history. The odds were long that both sides would find agreement. For decades, the city under Mayor Richard M. Daley, a former Cook County states attorney had fought the claims of abuse even as the number of victims rose and a consensus emerged that Burge and his detectives engaged in torture. Taylor and his colleagues at his outside-the-Loop practice, the Peoples Law Office, had been particularly harsh critics of the city. But then in September 2013, Emanuel issued an apology, calling the Burge era a \"dark chapter\" in the citys history. \"I think they decided at City Hall that they wanted to do the right thing,\" Taylor said. \"I think they decided, even after all the money they had paid out over the years, that something really wrong had happened here, and they wanted to make things right. That was a big change.\", The idea of reparations dated to about 2008, when a group of advocates started discussing that notion. And even after an ordinance calling for $20 million in reparations was introduced in October 2013, its chances seemed slim. That ordinance stalled, in fact, and Ald. Howard Brookins, 21st, said recently that his expectations were not great that the city would pay anything, even if officials came around on other aspects of an ordinance. Things changed shortly before the February mayoral primary. Taylor had been dealing with Patton over a lawsuit involving the 2004 death of David Koschman, who had died after a drunken encounter with a Daley nephew. Koschmans mother, represented by Taylor, accused police of a shoddy investigation. The city eventually settled the lawsuit for $250,000, and Patton apologized on behalf of the city for Nanci Koschmans ordeal. Taylor said he and Patton worked well together. As in most negotiations, a number of other people played key roles as well. On one side with Taylor was Joey Mogul, another Peoples Law veteran, advocates from Amnesty International and a local group calling itself Chicago Torture Justice Memorials. The city tapped the skills of various staffers from the mayors office and the law department. Brookins and other aldermen were involved too. The two figures at the center, though, were Taylor and Patton, a pair of veteran attorneys with distinctly different legal backgrounds. Taylor was thrust into the public eye with the Fred Hampton case, working with colleagues to unravel the fatal shootings of the Black Panther leader and a second man in a 1969 raid. Later, he sued the Ku Klux Klan and the American Nazi Party, as well as police, in Greensboro, N.C. over how authorities handled an anti-Klan protest that resulted in five deaths. He began his pursuit of Burge in 1987 when convicted cop killer Andrew Wilson called from prison saying he had been tortured by the police commander, including being pressed against a hot radiator and burned. \"Lawyers wouldnt represent him,\" Taylor said of Wilson, who had been sentenced to death for killing two Chicago police officers. \"We were compelled by the torture and felt then as we do now that torture is never right, no matter what youre charged with.\", Taylor, 69, has been chasing Burge ever since. Before he was named the citys top attorney in 2011, Patton was one of the lead negotiators representing tobacco companies in the landmark $206 billion settlement with the states that ended much of the industrys advertising. He also represented the city in its closure of Meigs Field. At 61, Patton, a former president of the Chicago Bar Foundation, runs a department with some 270 attorneys. He believes attorneys should do pro bono legal work and has started a program for firms to give time to the city, part of his desire to spread the gospel of volunteer work as well as trim the citys massive legal costs. Patton came into office with a desire to deal with cases before they cost the city a lot of money, a more aggressive triage that meant settling wrongful conviction and police misconduct cases that would end in a settlement anyhow without years of costly litigation. He also inherited eight Burge lawsuits, he said, settling six of them and winning two at trial. He began to talk to City Council members about trying to wrap up the Burge cases with reparations. \"The mayor made it very clear that his desire was to right the wrongs and to try to do things that would finally bring closure to this issue,\" Patton said in a recent interview. \"Sometimes justice requires more than simply achieving the legally correct outcome in a particular lawsuit.\", Mogul, who had drafted the reparations ordinance, said building support in the City Council was crucial. Eventually, two dozen aldermen backed the measure. She said advocates also wanted to make reparations an election issue, tapping into disaffection with Emanuel in parts of the African-American community. Last December, protesters marched to Emanuels office and gave him petitions with 40,000 signatures, suggesting support for reparations was growing. Shortly after the rally, Patton who said the mayor on his own wanted to pursue a measure telephoned Taylor and asked to meet. \"We were anxious,\" Mogul said. \"We wanted to see what they had to say, but we also werent going to give up on what we were doing.\", At a meeting at City Hall, Patton laid out a plan of benefits for Burge victims, including City Colleges of Chicago tuition and psychological counseling. The citys package did not include financial compensation. Advocates held to their proposal for $20 million in reparations. The meeting ended less amiably than it had begun. But both sides continued to talk. They haggled over how many people might be eligible for reparations, with Taylor starting with a list including some 120 people. The city believed far fewer should be eligible. Through negotiations, that number fell to around 55 or 60, a number the city found fair. But money remained a sticking point. The city, however, came to realize that the money carried symbolic value for advocates and victims, adding weight to the apology Emanuel had delivered and to other benefits the city was offering. With a hearing on reparations scheduled before the City Councils Finance Committee on April 14, advocates planned to meet on the Saturday before. After a half-dozen negotiating sessions over the winter, the nonfinancial issues had been largely settled. But the money had not yet been resolved, though Patton believed he had telegraphed his willingness to go as high as $5 million. On April 10, Taylor decided to try to bridge the financial divide and called Patton, who was in Florida on a short getaway. They settled on a fund of $5.5 million, with a cap of $100,000 for each victim and whatever money was left to be returned to the city. The next day, Taylor called into the meeting of advocates. They sounded out some of the more prominent Burge victims Darrell Cannon and Anthony Holmes with details of a hypothetical plan. There was a restrained celebration, the kind tinged with concern over what could still go wrong. Along the way, some concessions had to be made to reach a deal. Advocates had agreed that no money would go to the families of about 20 torture victims who had since died. Their families, however, would be eligible for other benefits such as the free college tuition. On the day the Finance Committee hearing was scheduled, the settlement was instead announced, with Patton laying out details for aldermen. \"We do this not because its required legally. It is not,\" he said. \"We do it because we think its the right thing to do for the victims, their families and the city.\", smmills@tribpub.com]", "Date": "20150506", "Author": "[Steve Mills]", "Link": "http://www.chicagotribune.com/news/ct-burge-torture-reparations-lawyer-met-20150505-story.html", "Title": "[Burge reparations deal a product of long negotiations]"}