{"Content": "[For Democratic politicians, same-sex marriage has become an easy issue: Theyre for it. Many Republican VIPs notably presidential hopefuls like Wisconsins Scott Walker face a far more complicated landscape. Looming ahead for these contenders are early contests in states such as Iowa and South Carolina, where a major role will be played by conservative Christian voters firmly opposed to same-sex marriage. Further down the road is the 2016 general election, where the nominee will likely need backing from independents and moderate Republicans who support gay unions. \"Republicans are trying to thread the needle on this, with varying degrees of skill. It doesnt take a genius to figure out why,\" said Gregory Angelo, executive director of Log Cabin Republicans, which represents gay conservatives and seeks to make the GOP more inclusive. \"The more shrewd members of the field know that in order to win the general election, they cannot be in absolute opposition to LGBT equality,\" Angelo said. \"If that is their position, they automatically turn off a large portion of the electorate.\", Some of the most conservative contenders such as Sen. Ted Cruz of Texas and former Arkansas Gov. Mike Huckabee are comfortable using forceful language in opposing gay marriage and railing against judges who have struck down state laws against it. Others, even while sharing disapproval of gay marriage, have used softer phrasing. Sen. Marco Rubio of Florida says hed attend a same-sex wedding of someone close to him, and remarked that sexual preference is something most people are born with, not a choice. Sen. Rand Paul of Kentucky has suggested gay couples could enter into civil contracts. And former Florida Gov. Jeb Bush, after a court order made gay marriage legal in his home state, urged respect for the rule of law. Bush added: \"I hope that we can also show respect for the good people on all sides of the gay and lesbian marriage issue, including couples making lifetime commitments to each other who are seeking greater legal protections and those of us who believe marriage is a sacrament and want to safeguard religious liberty.\", The U.S. Supreme Court will hear oral arguments in four states same-sex marriage cases on Tuesday, and by the end of June is expected to rule on whether such marriages now allowed in 36 states should be recognized nationwide. Cruz has signed a brief filed with the high court on behalf of 57 GOP lawmakers, urging the justices not to impose a nationwide rule and instead to let the political debate continue. Opinion polls show that a majority of Americans, including young Republicans, favor nationwide legalization. A Supreme Court ruling to that effect might be a relief to some GOP candidates, such as Wisconsin Gov. Scott Walker, who has made clear that gay marriage is not a favorite topic of discussion. \"Jeb Bush and Scott Walker want to have this be settled law before the presidential election really gets going, so they can move on,\" said Marc Solomon, national campaign director for the advocacy group Freedom to Marry. In the 2012 GOP primary campaign, most of the leading candidates endorsed the idea of a federal constitutional amendment to ban same-sex marriage. The current contenders no longer broach that idea, instead urging the Supreme Court to avoid a nationwide ruling for gay marriage and leave the matter to the states. \"Its important that citizens, not judges, define marriage,\" said Ryan Anderson, a research fellow at the conservative Heritage Foundation. \"For all these candidates, thats the message I want to see.\", However, some conservative leaders already are bracing for a possible Supreme Court decision in favor of same-sex marriage. \"I would want presidential candidates who understand the need to protect religious liberty in the aftermath of a Supreme Court decision,\" said the Rev. Russell Moore, president of the Southern Baptist Convention Ethics and Religious Liberty Commission. \"Many (gay-rights activists) are not wanting simply a live and let live approach to marriage but are wanting instead to use the power of the state to coerce religious people and institutions to violate their consciences in actively celebrating such unions,\" Moore said in an email. Louisiana Gov. Bobby Jindal alluded to such pressure as he reinforced his opposition to same-sex marriage in an opinion article in Thursdays New York Times. \"Polls indicate that the American consensus is changing but like many other believers, I will not change my faith-driven view on this matter, even if it becomes a minority opinion,\" Jindal wrote, dismissing complaints from the business community about legislation that would allow some businesses to deny services to same-sex couples. The issue of religious freedom has been troubling for some Republicans governors, including Mike Pence of Indiana and Asa Hutchinson of Arkansas. In each state, GOP lawmakers modified new religious-objections laws after critics said they could be used to discriminate against gays. Amid the uproar, the Republican governors of Michigan and North Dakota took a different tack, urging their own legislatures to extend anti-discrimination protections to gays. Developments in Iowa, with its high-profile GOP caucus, underscore the shifting nature of the marriage debate. Republican Gov. Terry Branstad, as a candidate in 2010, assailed the state Supreme Court for legalizing gay marriage. But testifying recently in a deposition, he said \"the whole situation has changed,\" adding: \"The state laws have been overturned by the courts. And so we have a new situation in this country today, and I think its something we have to accept.\", Thats been the attitude among many Republicans in the early-primary state of New Hampshire, where gay marriage was legalized in 2009 by a Democratic-controlled legislature. In 2012, after the GOP had gained control, lawmakers rejected a bid to repeal that law. Few GOP primary voters in the state want gay marriage to be a front-burner issue, said Dante Scala, a political science professor at the University of New Hampshire. \"They prefer that their candidates not discuss social issues at every opportunity.\", By contrast, Democratic front-runner Hillary Rodham Clinton, in the recent video that launched her campaign, signaled her full embrace of same-sex marriage. Among the \"everyday Americans\" featured in the video was a gay couple in Chicago sharing the excitement of their plans to wed this summer.]", "Date": "20150427", "Author": "[David Crary]", "Link": "http://www.chicagotribune.com/news/local/breaking/chi-gay-marriage-a-difficult-issue-for-gop-white-house-hopefuls-20150427-story.html", "Title": "[Gay marriage a difficult issue for GOP White House hopefuls]"}