{"Content": "[Most voters dislike their elected officials. Whether its the U.S. Congress, the state legislature or their local alderman, most citizens will tell you they are all corrupt nitwits who are out to destroy whatever it is that average people hold dear. Despite the venom, Im guessing that legislation to make the Chicago Board of Education an elected body will be wildly popular. Actually, thats more than an educated guess. More than 80 percent of voters supported an elected school board during an advisory referendum that was on the ballots in most Chicago wards in February. Mayor Rahm Emanuel has closed many public schools, angering a lot of people. Parents have been complaining about the quality of education for decades. Teachers are unhappy. And the school system is headed for a financial meltdown. So something has to be done. A group of state legislators representing Chicago on Monday held a news conference to say they believe an elected school board is the way to turn things around. They are supporting House Bill 4268, which would create a 13-member elected board that they say would return power to the citizens and parents. \"Its important for families to have a voice in their childrens education,\" said state Rep. Elgie Sims, D-Chicago, one of the bills supporters. At this point, I feel the need to point out that only about 15 percent of registered voters bothered to turn out for suburban school board elections in Cook County in April. In the April 2013 school board elections, 18.9 percent of registered voters cast ballots in Cook County. In 2011, the number was 16.7 percent. County Clerk David Orr, the chief election official for suburban Cook County, always says those numbers are misleading because in many school districts candidates have no opponents, and in many others people are happy with the way their schools are being run so they dont vote. Also, the suburban school elections occur in \"off-year\" elections when there is no presidential race that would attract more voters to the polls. I like Orr. I think hes a nice guy who does a good job and tries his best to be optimistic about the electoral system in America. But I think the voter turnout speaks for itself. People really dont care about their schools. Not when it comes to voting. And maybe that lack of voter interest on Election Day is a good thing because in my experience the vast majority of Illinois residents are woefully uneducated when it comes to all things school related. They dont know, for example, that the primary source of financing public education in this state is the property tax, producing about two-thirds of all the money for the schools. The state of Illinois is dead last in the nation in the percentage of funds in contributes to the public schools, which is why property tax bills have skyrocketed over the last 30 years. Gov. Bruce Rauner has called for a property tax freeze, which is extremely popular with voters. Do they realize that may cause their local school districts to cut teachers, increase class sizes and eliminate some extracurricular programs to save money? I doubt it. When it comes to the schools, people never seem to be able to put 2 and 2 together, which may be yet another example of the failure of this states public school system. There seems to be growing feeling among taxpayers that teachers are overpaid and their benefits need to be reduced. Given those high property tax bills, I can understand that. But do people want teachers to go on strike? Would they support their local schools in October if their children were still sitting at home instead of going to class?, History tells me that pressure would build on a school board to cave in to the demands of teachers and give them a raise and keep the benefits. People have jobs to go to and cant stay at home to take care of the kids or afford the cost of a day care service. People only seem to care about their schools when there is some sort of crisis. In Lincoln-Way High School District 210, for example, the school board this week is scheduled to vote on closing a high school. The district, which includes some of the more affluent communities in the Southland (Frankfort, New Lenox and Mokena, along with small portions of Tinley Park and Orland Park) has been placed on the state board of educations financial watch list, usually reserved for school districts in poorer areas. The citizens are in an uproar. They dont understand how things could have gotten this bad. They dont understand why the school board decided to build two high schools several years ago and now discovers that it doesnt have the population or economic base to support them. Somebody needs to be held responsible, folks are saying. That would be nice. But as they say down in Texas, thats closing the barn door after the horses have left. Or, as they say in these parts, thats like wondering where all the teacher pension money went after the legislature spent it elsewhere. When candidates are running for president, particularly those running in the Republican primaries, they always talk about local government being the best form of government because people get involved and can make decisions about how they want their money spent. School boards are always mentioned prominently in these sorts of discussions about how great democracy can be. I get a hoot out of that because Ive spent more than 30 years attending school board meetings, and Ive missed most of those great lessons in democracy. First of all, when citizens show up at a school board meeting, they usually dont have a clue about whats going on. They may get an agenda that briefly explains whats going to take place, but those one- or two-line descriptions are so vague you would need an interpreter to explain them. And when it comes time to vote, board members rarely discuss the items on the agenda in detail instead referring to \"Under item 3, can we have a vote approving (c) through (h) and including the amended language for (d) and (e)?\", Sometimes theres a reference to important paperwork that only the board members have in their possession, and they typically refuse to release that even after the meeting, claiming its the work product of the legal staff or that the public simply cant be trusted with the information. Thats not as bad as it may sound, but chances are even if you saw the paperwork you wouldnt understand it without guidance from paid professional staff the full-time people who tell school board members what to do. The staff input is needed because chances are that your average school board member has very little knowledge in things such as architecture, engineering, core curriculum requirements and state and federal mandates regarding special education and sex discrimination. A tip of the cap to the professionals who have to deal with all manner of federal and state regulations that are written in ways that no English-speaking American could understand, and court decisions that even the best lawyers often cannot interpret when it comes to education. On the other hand, I have seen school superintendents successfully urge school boards to expel for life an 8-year-old who brought a bullet to class in a carton of crayons left at a relatives house and an honor roll student who traveled to a homecoming football game in a car that carried beer in the trunk. The kid said she knew nothing about the beer, the car driver said he packed the trunk before she got in the car and there was no evidence to the contrary, but a zero-tolerance policy means just that. So logic cannot be allowed to control the decision-making process, the professionals told the school boards, which went along with the recommendations. After spending tens of thousands of dollars defending their decisions in court, both those school boards lost and the students were reinstated. Perhaps none of these problems will manifest themselves in Chicago, where news media scrutiny is intense, resulting in a City Council thats considered both honest and financially responsible. Ooops!, Perhaps special interest groups representing unions, street gangs and patronage politicians wont have any influence in the outcome of those election contests. Free elections are what democracy is all about, after all. Youve got to support them. Especially if you have the money to influence their outcome. pkadner@tribpub.com]", "Date": "20150810", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-cps-election-st-0811-20150810-story.html", "Title": "[Kadner: An education about elected school boards]"}