{"Content": "[New Jersey Gov. Chris Christie wants an apology. He wants it from all in the media who dared to raise questions about the ethics of his administration and to wonder if he personally was involved in \"Bridgegate.\" That scandal, you may recall, had to do with lane closures on the George Washington Bridge in 2013 that caused serious traffic jams near Fort Lee, N.J. The traffic jams were orchestrated by a top Christie aide and two high-level officials he appointed, according to prosecutors in a federal case, and the motive was political payback to Fort Lees mayor, a Democrat, for not supporting Christie in the governors race. One of the appointees involved has pleaded guilty. So, yeah, Christie is really the aggrieved party here. Reporters investigated the story. It was front-page news. It led news broadcasts. Columnists, pundits and political adversaries raked the governor over the coals. Oh the injustice of it!, No evidence has surfaced that Christie knew of the plan. This has been widely reported. Yet Christie is still fuming. He cried to CNBCs \"Squawk Box\" that the controversy was blown way out of proportion when compared to Hillary Clintons use of a private email account while she was secretary of state. \"Has there been coverage of the email situation with the secretary? Absolutely,\" Christie said. \"But the intensity of the coverage and the relentlessness of the coverage is different, and thats where the bias is revealed.\", Im sure Hillary Clinton got a nice chuckle out of that one. The answer to the latest petulant demand from this tantrum-prone governor is a firm and resolute \"no.\", No conservative ever went broke complaining about the big, bad media. Yet Christie the whiner and Christie the tough guy add up to an amalgam thats not too attractive as a candidate for the highest office in the land. It was Christies snide, dismissive demeanor when news of the scandal broke that set the tone for press commentary. At one time he joked, \"I worked the cones, actually. Unbeknownst to everybody, I was actually the guy out there, in overalls and a hat.\", When the Port Authority of New York and New Jersey started investigating the controversy, Christie called New York Gov. Andrew Cuomo to complain, according to The Wall Street Journal. (New Jerseys ranking official at the Port Authority at the time, Bill Baroni, is one of the three current defendants in the federal case over Bridgegate.), Sorry, governor, but that says a great deal about your character and fitness for office. So, no no apologies here. While were at it, its delusional to claim that Hillary Clintons escapades are being ignored. The State Department just released more than 800 pages of emails from Clintons private account. The reason? The media have been baying for them, and pressure is mounting to make everything public at a faster pace. Many in the press no doubt hope the emails will shed light on the controversial role of the Clinton Foundation. Political consultant Peter Schweizers much-anticipated book, \"Clinton Cash: The Untold Story of How and Why Foreign Governments and Businesses Helped Make Bill and Hillary Rich,\" has raised the question whether rich foreigners influenced Hillary Clinton to make preferential decisions as secretary of state. In an \"exclusive\" deal with Schweizer, The New York Times published an investigation based on his work suggesting that donations from a Canadian businessman might have helped a Russian company seal a deal to gain control of 20 percent of U.S. uranium production. While presenting no evidence Clinton was involved in the decision, the Times alluded to \"special ethical challenges.\", Schweizers book has no smoking gun connecting the Clintons to malfeasance, but that will not matter. The allegations fit the narrative that has long dogged the Clintons: that they believe they can bend the rules, marching along with a sense of entitlement. Maybe like Christies image of petulance, the Clintons image of entitlement has been earned. Maybe these are the storylines they have created for themselves. Let it be said again: No solid evidence has surfaced that Christie knew of the plan being hatched to snarl traffic. But did Christies brash persona encourage or even breed within his administration the disregard for ethics necessary to carry out the Bridgegate?, Given his continued behavior, Christie is indicating the answer might be \"yes.\", Mary Sanchez is an opinion-page columnist for The Kansas City Star. Tribune Content Agency]", "Date": "20150525", "Author": "[Mary Sanchez]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-chris-christie-bridgegate-perspec-0526-20150526-story.html", "Title": "[Don't cry for Chris Christie]"}