{"Content": "[On Sunday, Prime Minister Stephen Harper announced that Canada will hold a national election Oct. 19. The campaign will last just 11 weeks a total of 78 days after which voters will elect their prime minister. That is incredibly short by American standards, but it will be the longest campaign in Canadian history. (Harpers successful election campaigns in 2008 and 2011 were 37 and 35 days, respectively.), And, better yet, the entire campaign will cost next to nothing compared with our presidential elections. Under Canadian law, the parties will be allowed to spend a maximum of about $25 million in Canadian currency equivalent to about $19 million in U.S. currency for the first 37 days of the election campaign, plus an extra $685,185 Canadian per day thereafter. Now, thats an efficient, inexpensive national election!, By contrast, democracy in this country is slow, cumbersome and outrageously expensive. Our multibillion-dollar election campaigns drag on endlessly with mind-numbing repetition, silly slogans and attack ads that insult the intelligence of most of the electorate. Presidential elections blend into midterm elections in a seamless chain of \"election years\" that paralyze the legislative process. Lawmakers, focused on a continued series of upcoming elections, shy away from grappling with urgent issues of national importance like reducing deficits, balancing budgets and reforming immigration. The result is that Washington grinds to a halt and the peoples business is left unattended, as politicians are forced to spend the majority of their time pandering to their constituents and special-interest groups to fill their campaign war chests. Some will say that an election cycle as short as that in Canada cheats the voters. Theyll argue that the Canadian electorate will be poorly informed on the central issues in the campaign and on the positions of the candidates. Theyll contend that 11 short weeks is insufficient time to fully vet the candidates or for the media to ferret out whatever skeletons may be lurking in their backgrounds. I disagree. I think American voters are quick studies who are just as smart and politically astute as our Canadian neighbors. Surely the U.S. electorate doesnt need more than two years to become familiar with the issues and to vet the candidates for president. Those who are motivated to be fully informed about the election can and will do so quickly, even within several weeks. And those who are not so inclined or who vote straight party tickets every election or who \"vote with their gut\" probably never will examine the issues or party platforms closely anyway, no matter how long the campaign drags on. Shortening the duration of American election campaigns also would go a long way toward addressing the seemingly intractable issue of campaign spending reform that Congress has been unable to address in an effective manner. Shorter campaigns would mean less time to raise and spend campaign dollars. So I applaud the shorter election cycle our Canadian neighbors enjoy. By stark contrast, in this country the expanding length of political campaigns and obscene campaign spending (estimated to top $5 billion in the 2016 campaign) are spinning out of control and bound to get worse. Gerald D. Skoning is a Chicago attorney.]", "Date": "20150805", "Author": "[Gerald D. Skoning]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-canada-campaign-election-harper-perspec-0806-20150805-story.html", "Title": "[The long and short of campaign lessons from Canada]"}