{"Content": "[The stalemate at the Capitol entered its second week with more political theater on display, and this time the stage play revolved around property taxes as Democrats, who rule the legislature, and Republican Gov. Bruce Rauner jockeyed for position on an issue thats highly sensitive to homeowners throughout the state. Following a pattern that has consumed much of the session since early May, Democrats publicly took apart a Rauner proposal to freeze property taxes while setting themselves up to argue in the coming weeks that they had extended an olive branch of compromise. GovernorRauner: \"Having no real reform, and declaring victory, thats how we get in the mess we are in We need true structural reform.\" June 9, 2015. (WGN TV), GovernorRauner: \"Having no real reform, and declaring victory, thats how we get in the mess we are in We need true structural reform.\" June 9, 2015. (WGN TV), Rauner, meanwhile, dismissed the activity as a \"waste of time,\" saying Democrats were not serious about negotiating a deal because their two legislative leaders work at law firms that make money contesting property tax bills. Its against that backdrop that the calendar continues to turn while state government remains without the ability to spend money for the budget year that begins July 1. Democrats approved a spending plan thats at least $3 billion short, but have yet to send it to Rauner, who has said he cant sign a \"phony\" budget. The rookie governor also wants lawmakers to approve his pro-business, anti-union agenda as part of a deal, and a property tax freeze is one of the items. On Tuesday, Democrats resumed what has become their standard response to Rauners demands: public rejection on the House and Senate floor. The issue of property taxes was the latest target. Rauner wants a tax freeze coupled with changes to municipal collective bargaining and public works contracting. Those changes, he contends, would allow local governments more control over their expenses, offsetting the need to raise revenue through property tax hikes. Democrats and their union allies counter that the changes are aimed at weakening organized labor a fierce opponent of Rauner during last years campaign and wont help municipalities in the long run. As they have done on other portions of the Rauner agenda, each chamber of the legislature, against objections from their Republican minorities, took turns isolating the property tax freeze from the less politically palatable union-related items. Shortly before the entire Senate convened for an hourslong hearing on the issue, Senate President John Cullerton met with Rauner and offered what a Cullerton aide described as a compromise to approve a property tax freeze in return for changing the funding formula for education instead of the union-related changes. Rauner said he was \"supportive\" of changing the education formula but dismissed the notion of pairing it with a property tax freeze. \"The ideas on the table didnt include what really matters, Ill say that,\" Rauner told reporters at a news conference he convened outside the governors mansion. The union provisions, which Rauner refers to as \"local control of government costs,\" are \"the single most important thing,\" Rauner said. Despite continued private meetings between Rauner and the Democratic leadership, there are few signs a deal is close to being struck. The tension escalated Tuesday as Rauner pointed to Cullerton and House Speaker Michael Madigans connections to law firms that handle property tax appeals as a reason for the impasse. \"They have a fundamental conflict of interest with the taxpayers, with homeowners, small business owners in the state,\" Rauner said. \"We recognize that conflict of interest and weve got to talk candidly about the challenges that are in front of us.\", Rauner has been vocal in his criticism of Madigans law firm, Madigan & Getzendanner, which specializes in Cook County property tax appeals. Cullerton is a partner at Thompson Coburn, a large firm that handles a range of cases, including property tax appeals. \"(Rauners) comments are unfortunate,\" Cullerton spokeswoman Rikeesha Phelon said. \"If he would rather go on the personal attacks rather than talk about reasonable compromises for a property tax freeze, Id say we have a long way to go.\", While Rauner was blasting Madigan and Cullerton, Democrats pressed on with their public rejection of his ideas, as the House took up the Rauner property tax proposal in the form of two amendments: One that would freeze rates unless local voters approve a referendum for an increase, and a second that addressed the union-related ideas. The setup allowed Democrats to go on record supporting a property tax freeze 43 voted for it and put Republicans in the position of once again shying away from casting votes in support of their governors agenda. The property tax freeze failed to gain the three-fifths support that would be required to make the changes apply to home-rule municipalities, while the union-related measure received zero \"yes\" votes. Republicans cast \"present\" votes in both instances, saying they would not participate in a process aimed at embarrassing the new governor. \"Theyre saying this is the governors initiative, and it isnt, so we were hauled down to do things weve already done, in piecemeal fashion and form, and its just more gamesmanship by the Democratic leadership,\" said Rep. Ron Sandack, R-Downers Grove. Madigan defended the process, saying the situation was of Rauners making and Democrats were giving Republicans \"the opportunity to vote for what their governor has requested.\", \"We dont agree with the governor on the advocacy of his nonbudget issues, but taking up those issues for consideration is an accommodation to the governor,\" Madigan said. \"Were here, were available, were interested in ideas, were interested in new ideas. We want to get the job done.\", kgeiger@tribpub.com, jhellmann@tribpub.com]", "Date": "20150609", "Author": "[Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-met-rauner-madigan-property-taxes-met-0610-20150609-story.html", "Title": "[Rauner, Democrats spar on property taxes as stalemate enters 2nd week]"}