{"Content": "[Its been a rough week for Jeb Bush and its not even half over. On Monday night, he stumbled over a question about his father a reminder that the son and brother of former presidents still struggles to give polished answers about his familys legacy. He also struggled to explain how he would combat Islamic State forces in Syria. And on Tuesday, Democrats quickly attacked him for suggesting that he was \"not sure we need half a billion dollars for womens health issues\" a comment he then retracted and sought to clarify. As he prepares to face front-runner Donald Trump and other rivals in the first GOP debate Thursday, Bush describes himself as the \"joyful tortoise\" in the long race for president the candidate who is slowly building support while contenders like Trump sprint ahead before falling back. But Bush has fallen back himself: Debate host Fox News puts Trumps polling average at 23.4 percent. Bush, his closest rival, once enjoyed similar numbers but now averages 12 percent support. The former Florida governors off-the-cuff style on the campaign trail has earned him favorable reviews from some voters in the early primary states and he remains easily accessible to reporters who trail him across the country. But those exchanges often lead to long-winded answers that land Bush into verbal cul-de-sacs, making it difficult to steer out. \"Jeb is a smart guy, and like a lot of smart guys, he occasionally overestimates his ability to improvise,\" said Terry Neal, a Washington-based communications consultant and former Washington Post reporter who covered Bushs Florida gubernatorial campaigns for the Miami Herald. \"Its very different than the problems his brother had. [George W. Bush] was often uniformed or seemed uninterested in details on the campaign trail. Jeb is not that, he just is not careful in what he says and then gets frustrated by the reactions he gets.\", Fergus Cullen, a prominent New Hampshire Republican activist who hosted a house party for Bush, said the former governor is unfairly \"held to a higher standard than the average candidate.\", At a GOP candidates forum hosted in New Hampshire on Monday night, Bush appeared \"like just another one of the candidates,\" Cullen said. \"He didnt look like, sound like or act like a front-runner whos going to dominate the field. I think its unreasonable to think he was ever going to be that kind of candidate.\", Bush tried to lighten the mood during the forum in response to a question about how he is distinguishing himself from his father and brother. His delivery was clumsy. \"My dad is probably the most perfect man alive,\" he said. \"In fact, Ive got a T-shirt that says, uh, at the Jeb swag store, that says, Im the my dads the greatest man alive. If you dont like it, Ill take you outside.\", The comment was a botched version of a line Bush frequently uses on the campaign trail. On Monday, talk of a \"Jeb swag store\" also seemed odd, but his campaign unveiled an online store Wednesday featuring mugs, a guacamole bowl and a T-shirt suggesting that if someone disagrees that George H.W. Bush is the greatest, \"We can step outside.\", Earlier in the same forum, Bush suggested that deploying \"special forces\" to fight the Islamic State terrorist group would be a good idea but that \"boots on the ground\" might not be necessary. \"Not sure I understand Jebs distinction between boots on the ground and special forces on the ground,\" tweeted Jonah Goldberg, an editor-at-large a at the conservative National Review Online. \"Do they not wear boots?\", Bush was warmly received at the Southern Baptist Convention on Tuesday as he voiced strong opposition to federal funding for Planned Parenthood, a widely held sentiment among Republicans. But he also wondered aloud whether federal funding for all womens health research should be reduced. \"You could take dollar for dollar although Im not sure we need a half a billion dollars for womens health issues but if you took dollar for dollar, there are many extraordinarily fine organizations, community health organizations, that exist, federally sponsored community health organizations, to provide quality care for women on a wide variety of health issues,\" Bush said. Hours later, Bush he that he \"misspoke\" and clarified that only Planned Parenthood funding should be revoked. But Democrats seized on the comments and Democratic front-runner Hillary Rodham Clinton read them aloud during an appearance in Colorado a reminder of the potency of Democrats charges that Republicans are waging a \"war on women.\", Even slight modifications to his long-held beliefs are causing trouble for Bush. He has supported statehood for Puerto Rico since he worked on the island for his fathers 1980 presidential campaign. But last week he told about six dozen evangelical pastors in Orlando that although he backs statehood, the current economic situation is \"not sustainable.\", When Puerto Rican newspapers suggested that Bushs support for statehood was wavering, aides scrambled to clarify that he still supports statehood but also believes that the island needs to address its economic challenges. \"Lo uno no quita del otro\" one does not remove the other Bushs Hispanic media spokeswoman, Emily Benavides, was quoted as saying. Ron Bonjean, a Republican consultant who remains neutral, said that because Bush hosts so many free-wheeling town hall meetings and press conferences, \"hes prone to make more mistakes.\", \"For now it feels like hes ironing the kinks of his delivery and fine-tuning it,\" he said. \"But those types of gaffes will have to come to an end, sooner rather than later.\", - - - -, Washington Post staff writer Sean Sullivan contributed to this report.]", "Date": "20150806", "Author": "[Ed O'Keefe]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-jeb-bush-gop-debate-20150806-story.html", "Title": "[Heading into debate, Jeb Bush stumbles again]"}