{"Content": "[District 219s first in-school health center opened this week on Monday, July 13 at Niles West High School, and Niles North will follow suit when it opens a similar health care center on July 27. School district officials say the school-based health centers will go above and beyond the traditional in-school nurses office by offering more health services, including psychiatric care, immunizations, physicals, and even reproductive health services. Students who utilize the health centers will receive treatment from physicians assistants and nurse practitioners with oversight from a pediatrician, according to information from the school district. Uninsured students will be able to get free health care services through the program, according to information from the school board, while insured students would still be billed. District 219 and clinic operator Heartland Health Centers received a $1.3 million grant from North Suburban Healthcare Foundation last year that enabled the schools to launch the clinics this summer. School officials have said the district will likely spend $500,000 annually to operate the two clinics. Beyond providing health care to students without insurance, school officials have said the increased access to medical care during the school day would likely decrease absenteeism and improve academic achievement. District 219 superintendent Nanciann Gatta had hoped to test the effectiveness of the new program under a deal she helped secure with Northwestern Universitys Feinberg School of Medicine. A memorandum of understanding presented to the School Board on July 13 would mean the universitys Department of Family and Consumer Medicine would conduct ongoing research on the impact of the clinics on student health and academic performance. The partnership on June 22 was signed-off on by Rex L. Chrisholm, vice dean for scientific affairs at Northwestern University, but it was stalled by the newly-elected District 219 School Board this week, whose new members decided to table the measure until it could be reviewed by the Health and Wellness Committee. Longtime board president Robert Silverman stepped down from the board last month, and Mark Sproat was appointed to fill the position. Linda Lampert, Brian Novak, Mark Sproat and David Ko voted to table the approval of the partnership with Northwestern, while incumbents Carlton Evans and Ruth Klint dissented. Lampert explained her decision to vote against the proposal as a way to uphold her campaign platform, where she pledged to advocate for better communication between the School Board and the public. \"People are holding us accountable, and they expect us to hold everyone in the district responsible,\" Lampert said. \"This is for the sake of transparency.\", Sproat also criticized the districts review process, claiming the research proposal should have been discussed in committee before it appeared before the School Board, but Gatta made it clear she wasnt stepping down. \"The [partnership with Northwestern] is an added layer of accountability,\" she said. \"I feel it is our utmost responsibility to be open and transparent about the work were doingwhat it takes, and whether were seeing a return on investment.\", Dr. Pete Marcelo, assistant superintendent of special education and student services, said the memorandum of understanding was clear-cut, and didnt require an in-depth review. \"The understanding is what it isa memorandum of understanding,\" he said. \"Theres really not much to talk about besides that theres a memorandum of understanding and were going to do some research with someone.\", Natalie Hayes is a freelance reporter for Pioneer Press.]", "Date": "20150715", "Author": "[Natalie Hayes]", "Link": "http://www.chicagotribune.com/suburbs/skokie/news/ct-skr-d219-health-clinics-tl-0716-20150714-story.html", "Title": "[First D219 in-school health center opens at Niles West]"}