{"Content": "[ Rep. Tammy Duckworths challenge to Republican Sen. Mark Kirk portends a costly battle in what figures to be one of the most closely watched 2016 Senate contests. Duckworth, 47, a two-term Democrat from Hoffman Estates who lost her legs in the Iraq War in 2004, announced her bid Monday in a two-minute video. While other Democrats could enter the race and force a primary election, Duckworth is the first to declare her candidacy and would counter Kirk as a veteran and a survivor of physical challenges. Kirk, 55, of Highland Park, was elected to the Senate in 2010 after nearly 10 years in the House of Representatives. He recovered from a massive stroke in 2012 that kept him out of Congress for nearly a year. Illinois has had 48 U.S. senators in its history, only one a woman: Carol Moseley Braun, a one-term Democrat elected in 1992. Duckworth will be running in a presidential election year in a state that last favored a Republican for the White House in 1988. One possible rival for the Democratic nomination, Rep. Cheri Bustos of East Moline, on Monday said she wont run and offered a tacit endorsement of Duckworth. Bustos said in a statement that she cant see \"jumping into a race at this time when we already have such a strong fighter for working men and women and veterans.\", That leaves Democratic Reps. Bill Foster of Naperville and Robin Kelly of Matteson as Duckworths most likely rivals. Foster had no comment Monday. Kelly will make a decision on the race soon, spokeswoman Kayce Ataiyero said. Kirk was one of the most vulnerable GOP senators nationally even before Duckworth announced her candidacy, said Nathan Gonzales, editor of The Rothenberg & Gonzales Political Report, a biweekly newsletter. Duckworth has never run for statewide office, he noted. \"Well find out how good a candidate Tammy Duckworth is in the next 12 to 15 months,\" said Gonzales, who sees the strong possibility of a race animated by \"millions of dollars in TV ads.\", Kirk began the year with $2 million in campaign funds while Duckworth had more than $1 million. Winning Senate candidates in 2014 spent an average of about $9.65 million each, The Campaign Finance Institute in Washington said. And that money was dwarfed by tens of millions that outside groups poured into fiercely fought races, led by the more than $73 million in outside money spent in the North Carolina race. Duckworth lost her legs when the helicopter she was co-piloting in Iraq was hit by a rocket-propelled grenade. She retired from the military in October as a lieutenant colonel in the Illinois Army National Guard, and gave birth to her first child in November. Before entering Congress, she was a veterans official for the federal and state governments. Kirk is a retired Navy Reserve commander who left the service in 2013. His campaign was quick to respond to Duckworths candidacy, taking a shot at the U.S. Department of Veterans Affairs, where Duckworth was an assistant secretary from 2009 to 2011. \"Sen. Mark Kirk has served as a voice for all the people of Illinois throughout his time in the Congress. He works across the aisle to take on the Veterans Administration for corruption and mistreatment of our returning heroes in Illinois, cut spending and block Iran from obtaining a nuclear weapon,\" said Kirk campaign spokesman Kevin Artl. The Republican Party also wasted no time taking on Duckworth, linking her to imprisoned Gov. Rod Blagojevich, who appointed her Illinois veterans affairs chief. \"Congresswoman Duckworth is a partisan politician who got her start in politics as a result of Rod Blagojevichs political maneuvers,\" said Andrea Bozek, a National Republican Senatorial Committee spokeswoman. Duckworth lost her first House race in 2006, defeated by Republican Peter Roskam of Wheaton, who remains in Congress, and won a seat in 2012 by ousting Republican Joe Walsh. In the carefully choreographed video announcing her Senate candidacy, Duckworth tells of how her late father lost his job at age 55 and food stamps \"kept my brother and me from going hungry.\" She said she graduated from college after taking out loans, receiving Pell grants and doing \"lots of waitressing.\", In the video, Duckworth calls for more prekindergarten classes, affordable college loans and tax cuts for the middle class and small businesses. She said she has given back $10,000 of her congressional salary, now $174,000 a year, and cut more than $100,000 from her office budget, which was $1.2 million in 2014. Duckworth, born in Bangkok to a Thai mother and American father, is the first Thai-American elected to federal office. Duckworth was not available for media questions after her video announcement. She was to appear Monday at a Chicago fundraiser that was closed to the press, an adviser said. Kirk is to speak Thursday at a luncheon at Maggianos Little Italy at Grand Avenue and Clark Street, hosted by the City Club of Chicago. Kirk, like Duckworth, could face a primary opponent. Walsh, now a talk radio host, said Monday he will decide within a month whether to get in the race. He criticized Kirk for failing to get behind state Sen. Jim Oberweis in his 2014 challenge to Democratic Sen. Dick Durbin. Walsh also took a shot at Duckworth, calling her a \"sympathy candidate\" in light of her combat injuries. At the same time, he said, many state Republicans are privately concerned about Kirks health and whether hes up for a re-election campaign and another term. On Monday, VoteVets, a political action committee that says it has 400,000 supporters, endorsed Duckworth and Sen. Kirsten Gillibrand, D-N.Y. and sent out a fundraising appeal on Duckworths behalf. Democrats control 46 seats in the 100-person Senate two independents caucus with Democrats so they need to capture five more seats to regain the majority, four if they win the White House because the vice president acts as a tiebreaker in 50-50 votes. kskiba@tribpub.com, Twitter @KatherineSkiba]", "Date": "20150330", "Author": "[Katherine Skiba]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-tammy-duckworth-senate-mark-kirk-20150330-story.html", "Title": "[Duckworth's bid for Kirk's U.S. Senate seat promises costly battle]"}