{"Content": "[In a recent note to College of DuPage employees, President Robert Breuder shared some well-worn advice for a happy life. \"Live simply and appreciate what you have,\" he wrote in his weekly newsletter. \"Give more. Expect less.\", The message struck some as tone-deaf, given that Breuder had just inked one of the largest and most controversial severance packages for a public employee in Illinois history. It also sounded somewhat odd for a man whose Champagne tastes have contributed to some of his greatest successes as well as to some of the most pointed criticism in a 35-year career as college president. His unapologetic leadership style and ambitious agenda have led to the impressive expansion of two local community colleges. He improved the facilities and enhanced the curricula, making the schools more attractive to high school graduates. But with his imposing figure and brusque demeanor, he has alienated many, including faculty who gave him no-confidence votes at his two most recent posts. Breuder a wine connoisseur with a penchant for hunting elephants and other big game also has been repeatedly criticized for enjoying himself at the colleges expense and prioritizing goals that seem a poor match for the communities he serves. \"Someone recently called him the Bobby Knight of college presidents, and I think thats somewhat accurate,\" said David Carlin, a former College of DuPage board chairman and trustee candidate in the upcoming election. \"Hes colorful, passionate and has a great track record. But Bobby Knight rubbed some people the wrong way and so does Bob Breuder.\", All that came to a head last month, when College of DuPage trustees voted 6-1 to pay Breuder $763,000 to leave the school in March 2016. The agreement, which also promises that a building will be named for him, positions the deal as a retirement package, but some trustees now acknowledge that the buyout was negotiated to terminate Breuders contract, which had been secretly extended to 2019. It wasnt the first time Breuder, 70, had negotiated a big parting check. In the past six years, two publicly funded colleges have given him retirement packages totaling $1.27 million. Harper College trustees approved an early retirement package in 2008 that paid Breuder $509,000 and gave him the title to a school-owned Lexus SUV, valued at about $40,000. Six days after the deal was signed, he was hired by the College of DuPage as its president. Breuder will earn $484,812 this year to oversee the Glen Ellyn-based school, including a $22,000 housing allowance, a $10,200 car allowance and thousands more for his cellphone and professional development. The college the states second-largest provider of higher education after the University of Illinois at Urbana-Champaign has more than 29,000 students and offers nearly 100 degree and certificate programs. It received more than $108 million in property taxes and $57 million in state funding last year. In interviews with the Tribune, faculty members, trustees and others described Breuder as a man who comports himself with the gravitas and aggressiveness of a corporate CEO. They said he is a confident visionary undeterred by public opinion and even the harshest criticism. Breuder declined to be interviewed for this story. But in an oral history of his career in 2011, he described himself in much the same way. \"You know, I think when I look at myself and look in the mirror, Im not much of a follower. ... Im really a leader,\" he said. \"Im cut out to be at the front as opposed to the rear. I dont take directives too well. And I always felt that if I went into the military, which I avoided, quite frankly, Id have to go in as a five-star general or nothing at all.\", Raised in Queens, N.Y. Breuder got his start in higher education teaching botany at a small New York college. He became an administrator in 1981, when he was named president of Williamsport Area Community College in Pennsylvania. According to an oral history posted on the schools website, the then-struggling campus had several dilapidated buildings and offices laid with mismatched remnants because there wasnt enough money in the budget for carpeting. In spite of the colleges financial woes and a threatened closure, Breuder pushed ahead with the construction of an advanced technology and health sciences center. That led to a partnership with Penn State University and helped transform Williamsport into a four-year school now called the Pennsylvania College of Technology. The health sciences center part of the $100 million in building and renovation projects done during Breuders tenure is now named for him. Breuders legacy there is also tied to a controversial teaching restaurant called Le Jeune Chef, an upscale establishment run by a professional staff with student assistance. The restaurant, which boasts the areas most extensive wine cellar, earned Wine Spectators prestigious Award of Excellence in the early 1990s and was elevated to Best of Award of Excellence status in 2000. \"We created a great program in Pennsylvania,\" Breuder told Wine Spectator magazine in a 2001 feature about him. \"And I wanted to do the same at Harper. But the more you defend what youre after and try to get cerebral, the worse it gets.\", Indeed, after he arrived at Harper, Breuders passion for wine became a running joke. He taught a wine appreciation course and billed the college $2,258 for a trip to a California food and wine festival as part of his professional development budget. He also pushed for a new $5.3 million culinary arts and hospitality center, which would house a gourmet restaurant, bistro, bakery, wine cellar and several kitchens. The proposed complex would have been funded as part of a $124.8 million bond sale, but voters rejected the referendum amid heavy criticism. He also lobbied for Harper to become a four-year college like he had done in Williamsport. The campaign faced strong opposition from nearby universities and residents who wanted the school to remain a traditional, two-year community college. \"I did feel like his appetite was outsized to the job he was doing,\" said state Sen. Matt Murphy, R-Palatine, a former Harper trustee who frequently spoke out against Breuders spending there. \"Personally, I felt a lot of it was ego-driven. He wanted to be the guy who expanded community college in Illinois. He wanted that legacy.\", Breuder frequently crossed swords with Harper faculty members, who gave him a no-confidence vote in 2001 and accused him of trying to break their union. With his large frame, slight New York accent and silk handkerchiefs, Breuders domineering demeanor clashed with the shared-governance approach embraced at most colleges and that Harper faculty sought too. \"I could work with him, but some people found him intimidating,\" said David Richmond, a Harper history professor and the current president of the Cook County College Teachers Union. \"If he finds that he can intimidate you, he sees that as weakness. He loses respect for you and makes it difficult to work with him.\", The faculty briefly went on strike in 2002. Two months later, Breuder announced plans to retire in 2005, and college trustees promised he would get a five-year, $325,000 consulting package at that time. Instead the board delayed his retirement three times and continued to grant him additional perks. \"Hes not stupid. He knows how to get a board behind him,\" said former Harper trustee Leon Shure, who was censured by his fellow trustees for publicly criticizing Breuder in 2002. \"He is always trying to recreate what he did before, and he can always get the majority of the board to buy into it.\", When Breuder got to the College of DuPage he embarked on similar plans, including the construction of a fancy restaurant and award-winning wine cellar. He also ran into similar problems, such as a no-confidence vote from the faculty. But by several measures, he will leave the college in better shape than when he arrived. The board credits him with accomplishing more than 100 \"significant outcomes\" during the past six years. They include adding about 70 academic programs and completing about $550 million in construction for new and significantly renovated buildings. The school boasts a homeland security institute with a mock downtown to practice fire drills and rescue exercises and a culinary auditorium with special lighting to study wine. Breuder is a frequent diner at Waterleaf, the on-campus restaurant that Tribune restaurant critic Phil Vettel gave three out of four stars. On the academic side, Breuder oversaw the schools 3+1 baccalaureate completion program, which allows students to earn a bachelors degree with one of six partner universities, and he has been a consistent and leading voice for allowing community colleges to offer four-year degrees. The College of DuPage also is now one of seven colleges in the state with a direct admission program to the University of Illinois engineering school. While student enrollment hasnt fully rebounded from its height in fall 2004, it is up nearly 9 percent from the start of Breuders tenure even as national and state trends have seen enrollment declines. By many accounts, Breuder has had a solid relationship with students on the commuter campus. In addition to mentoring several students, he faithfully attends monthly pizza parties hosted by the student government. \"He has been very accessible to us,\" said Stephanie Torres, a nursing major and president of the colleges Student Leadership Council. \"He tells it straight to us. He doesnt sugarcoat it, even if its not what we want to hear.\", Kenneth Florey, an attorney who has worked with Breuder at the College of DuPage and at Harper, said the school is now in better financial shape and is more appealing to potential students. \"When leaders have difficult jobs to do, they dont a lot of times make a lot of friends,\" said Florey, who is on the colleges foundation board. \"When an institution is being turned around, you are going to hurt some feelings.\", Faculty members, though, say Breuders accomplishments came at a steep price. \"The sad part is the things he has accomplished he could have accomplished without the hostility and animosity,\" said political science professor David Goldberg, who chairs the faculty unions grievance committee. \"People are afraid of him. There is a palpable climate of fear and intimidation at the college.\", Goldberg also said Breuder has shown little interest in the liberal arts, focusing instead on career and revenue-generating programs. In more informal moments, Breuder likes to talk about his passion for big game hunting. The college has paid $26,000 over the past five years to the Max McGraw Wildlife Foundation, an exclusive hunting and fishing club in far northwest suburban Dundee Township where he is a member. Breuder had the same perk at Harper; he has defended the expense by comparing it with a country club where he can host staff retreats and woo donors. More disconcerting for some, however, has been his sharing of hunting photos, including a picture of an elephant he claims to have shot while on a safari in Botswana in 2013. A picture which shows him and his wife smiling as they lean into the slain animal caused a public stir when it appeared on a safari guides website. But that kerfuffle was minor in comparison with the fallout this summer after the school lost $20 million in promised state funding after a watchdog group released emails in which Breuder said there was \"perhaps no real need\" for the money but he would tell then-Gov. Pat Quinn that the school would use it for a \"Teaching and Learning Center\" that would be \"politically attractive\" in a tense re-election year. The controversy led to scrutiny from faculty and the public, as Breuders spending, comments and leadership were all placed under a microscope. In September, the faculty union overwhelming voted no confidence in him, the first such vote in the schools 48-year history. The mounting tensions put the board in a tough situation, said college trustee Kim Savage. The board wanted to hire someone new but felt handcuffed by a \"bad contract\" that would have put the school on the hook for $2 million if Breuder stayed through the end of his deal, she said. Breuder, she said, would not have left early without compensation. \"To keep this tension going on to 2019 just would not be productive for the college,\" said Savage, who worked in higher education administration for 30 years and voted for the buyout. The contract, his perks and even the dead elephant were raised during the recent board meeting to reaffirm Breuders severance package. As area residents, faculty members and politicians berated trustees and Breuder for more than three hours, he sat stone-faced. At one point, Breuder engaged an angry resident in a staring contest until a campus police officer removed the man from the room. Others in the crowd called Breuder a \"bum\" and a \"coward\" and said his tenure was a \"disaster.\" , \"Ive never seen you before in my life, Mr. Breuder,\" Bartlett resident Erik LaVergne said. \"But I can smell your arrogance from here.\", The crowd laughed and clapped. Breuder stared straight ahead. sstclair@tribpub.com, jscohen@tribpub.com, Twitter @stacystclair, Twitter @higherednews]", "Date": "20150206", "Author": "[Stacy St. Clair, Jodi S. Cohen]", "Link": "http://www.chicagotribune.com/news/ct-college-of-dupage-robert-breuder-tenure-20150206-story.html", "Title": "[College of DuPage's Breuder: 'Bobby Knight of college presidents']"}