{"Content": "[There are very few unspoken rules among major-party candidates for president, and Bernie Sanders is breaking one of them. Hes saying that Americas leaders shouldnt worry so much about economic growth if that growth serves to enrich only the wealthiest Americans. \"Our economic goals have to be redistributing a significant amount of [wealth] back from the top 1 percent,\" Sanders said in a recent interview, even if that redistribution slows the economy. \"Unchecked growth especially when 99 percent of all new income goes to the top 1 percent is absurd,\" he said. \"Where weve got to move is not growth for the sake of growth, but weve got to move to a society that provides a high quality of life for all of our people. In other words, if people have health care as a right, as do the people of every other major country, then theres less worry about growth. If people have educational opportunity and their kids can go to college and they have child care, then theres less worry about growth for the sake of growth.\", Sanders position inverts decades of orthodoxy among liberal and conservative candidates alike, by prizing redistribution above all else. It taps into the mounting frustration in America, particularly among more-liberal voters, with the widening gap between the rich and everyone else. It is this kind of unorthodoxy that has helped galvanize liberal voters in New Hampshire and Iowa and elevate Sanders in early polls. It is also represents a sharp challenge to front-runner Hillary Rodham Clinton, who wants to maintain broad appeal even as she expands her support among liberal Democrats. Many liberal economists, including some close to Clinton, contend that some policies designed to reduce inequality will in fact spur faster growth. \"The middle class needs more growth and more fairness,\" Clinton said in a campaign kickoff speech in New York City last month. \"Growth and fairness go together. For lasting prosperity, you cant have one without the other.\", Sanders, a self-described socialist, has an agenda that includes sharply raising tax rates on the highest earners, increasing government spending by $1 trillion to rebuild infrastructure and create millions of jobs, and renegotiating Americas international trade agreements in hopes of boosting domestic workers. Political observers say his growth stance is a break from the past and a reflection of the nations changing economic politics. \"Even FDR wouldnt have said that, in the depths of the Depression,\" said Rick Ridder, a Denver-based political consultant who has worked on several Democratic presidential campaigns stretching back decades. But he added: \"Its not as dangerous [to say] as it might have been in the 1970s or 1960s right now, because income inequality is so great, and growing.\", Heather Boushey, a liberal economist who has discussed policy informally with Clinton and who runs the Washington Center for Equitable Growth think tank, argues that it is not politically wise to play down the need for economic growth. \"If you dont grow, then you really have to just take from someone and give it to somebody else. Thats a tough place to start,\" she said. \"Youre setting yourself up for some tough conversations that go not just against politics, but also human nature.\", The stagnation of middle-class incomes which were no higher in 2013 than they were in 1989, after adjusting for inflation has emerged as a dominant issue in the 2016 presidential campaign. After years of dismissing Democrats inequality focus as \"class warfare,\" Republican candidates are making explicit appeals to frustrated workers. In some cases, such as with Sen. Marco Rubio of Florida, who favors a new tax credit for families with children, Republicans are offering policies designed to direct money to lower- and middle-class workers. In other cases, candidates are returning to the classic GOP promise that a rising tide of growth will lift all workers boats. Former Florida Gov. Jeb Bush has set a goal of annual real gross domestic product growth of 4 percent, a rate not seen in the United States this century. \"We have to emphasize the lack of growth\" in reaching out to voters, Louisiana Gov. Bobby Jindal told a meeting of pro-growth conservatives in New York last month. \"We need to be making the case for growth and opportunity and better days ahead.\", Sanders says that tax cuts, expanded trade and the erosion of collective-bargaining rights over the past 40 years have created an economy that delivers maximum profits for large corporations and little relief for workers. Many economists, particularly conservatives, warn that restricting trade and adding new regulations to the labor market would crimp economic efficiency and slow growth. Sanders rejects that argument. \"By efficiency, many conservative economists mean, the best way for large corporations to make excessive profits, \" he said, adding: \"Theyre efficient for the people who own the corporations. Theyre not particularly efficient for the people who have been thrown out on the street.\", \"So if youre talking about maximizing corporate profits, thats not what I think the economy should be about.\", ]", "Date": "20150713", "Author": "[Jim Tankersley]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-bernie-sanders-income-inequality-20150713-story.html", "Title": "[The thing Bernie Sanders says about inequality that no other candidate will touch]"}