{"Content": "[Republican Chris Christie has just announced he doesnt want to be elected prom king of America. Whew! Thats a relief. The nation was terrified hed put on a white dinner jacket, red cummerbund and fox trot across Iowa in patent leather pumps. Meanwhile, Democrat Hillary Clinton has got to be studying that recent CNN poll on her untrustworthiness and saying to herself: \"Well, the good news is that four out of 10 Americans dont think Im a liar.\", Jeb Bush? He doesnt like that Confederate flag, but then, who does? And Donald Trump the GOPs circus geek who dukes big-city Democrats to help his developments along says he really likes Mexicans. Presidential candidate Donald Trump believes that Hillary Rodham Clintons email controversy is far worse than the conviction of former Illinois Gov.Rod Blagojevich. Presidential candidate Donald Trump believes that Hillary Rodham Clintons email controversy is far worse than the conviction of former Illinois Gov.Rod Blagojevich. \"I have many friends in Mexico,\" he told the Chicago Tribune editorial board after his rant on immigration. \"I have great relationships in Mexico.\", As for politicians, Trump says, \"Nobody knows politicians better than I do. I give a lot of money to Democrats, as a businessperson. For instance, I give to everybody. Everybody loves me, you know? They all love me.\", Yes, Donald, they all love you. All this noise is so much politics, I know. But I was born in Chicago where elections are decided long before voters figure out what happened to them, and I hear another sound. It sounds like theyre making meat puppets. Republican establishment meat puppets for Jeb. Democrat establishment meat puppets for Hillary. Whole armies of them. The Clinton Restoration. The Bush Restoration. Two horns on the head of the same goat. And the meat puppets come running. The establishment pretends it creates jobs when it doesnt, and pretends it values individual liberty when it doesnt. But theres one thing they dont have to pretend. New Jersey Gov. Chris Christie, who spent three years as president of his high school class, returned to his alma mater to announce hes running for president of his country. June 30, 2015. (AP), New Jersey Gov. Chris Christie, who spent three years as president of his high school class, returned to his alma mater to announce hes running for president of his country. June 30, 2015. (AP), They dont have to pretend about making meat puppets. They do it so well. The boys with the money buy political consultants, men like David Axelrod and Karl Rove. And polling is done and the meat puppets are goaded, animated, encouraged to rest their heads close to the TV screen and bathe in the echo-chamber of their choice. Those prospective meat puppets are offered hashtags and talking points with which to collectively tweet out their animosities, and so they herd themselves into compliant tribes that vote. Its all about being ready for 2016. If you dont believe me, just close your eyes the next time Trump opens his mouth, or the next time somebody with a big media voice goes on a rant about Trump. Thats when youll hear the unmistakable noise. Its that giant sucking sound, sucking up all the oxygen in the room, leaving just enough breathable media air for Hillary and Jeb. So Trump preens and struts and reporters stick microphones in his face for pearls of wisdom, or for stupid comments with which to mock him. Does it matter? Its show biz. He plays the deal maker, and voters are his apprentices in this reality show. It wont last long. Hes a fraud. But for now he sucks up all the media and assures us that we love him. If TV news were a quiet pool of water, he could drown himself in a flat screen. Trump takes media attention, yes. And he takes time away from other candidates. With so many candidates in the Republican field, big government bullies like Christie and Trump, big government dynastic heirs like Jeb!, conservatives like Louisiana Gov. Bobby Jindal and Sens. Ted Cruz and Marco Rubio, and the libertarian Sen. Rand Paul, heres what could happen. The one with the money and the organization benefits. Thats Jeb Bush. Its no accident, because politics is no accident. Not in Washington, not in Chicago. The Republican establishment does not want voters to see contrast between Bush and Paul. They will not allow this. Since Bushs brother and the neo-cons led Americans into that ill-fated war in Iraq, the Republican Party has been in serious need of a real debate about its future, a debate between big government GOP types who back the Bush Restoration and the conservative-libertarian wing that does not. But that would threaten the establishments control. And they wont take that chance. Its all about arithmetic. Ive read where the Republicans should be congratulated for offering so many candidates with so many competing ideas, while the establishment Democrats deal with the inevitability of Hillary. That may be. But I also see time being taken, and taken, until theres little time left. And only meat puppets would think this is an accident. In Chicago and Illinois, the political birthplace of President Barack Obama, it is done this way. The political bosses dont wait for the general election to win. Elections are won in the primaries. The bosses dilute the opposition, throw in extra candidates, knowing the numbers. Theyve already done the math. Its all about control. And on the other side, Hillary waits, fending off her much more liberal opponents, who are whetstones to help her keep an edge. Shes got the money. Shes got Bill. Yes, she polls badly when it comes to her truthiness. Most of us would be ashamed if six out of 10 people considered us to be untrustworthy. But heres something you already know about the Clintons. They are impervious to shame. By 2016, when Trump is forgotten, if it is Jeb! and Billary, some will ask questions like:, \"Clinton and Bush? Are you kidding? Again?\", \"Another election between the lesser of two evils? How did this happen?\", You might look back to this summer of Trump, and the dance of the meat puppets. jskass@tribpub.com, Twitter: @John_Kass]", "Date": "20150630", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-bush-clinton-meat-puppets-0701-20150630-column.html", "Title": "[Trump, Christie: Diluting the candidate pool for the Bush and Clinton show]"}