{"Content": "[Two years without a property tax increase and stingy state funding have Orland School District 135 officials eyeing a deficit budget that could drop reserve funds below the school boards recommended level. Board members voted Monday night to begin the budget process for the next school year by putting on public display a spending plan that district finance director Carl Forn said contains a $2 million structural deficit. \"Obviously, we have not raised taxes,\" board vice president Laura Berry said. \"Our major consideration is that we have not gotten the funds that we anticipated from the state.\", The 2014-15 fiscal year closed June 30 with District 135 not receiving $1.3 million of the $6.1 million the debt-ridden state had promised for transportation and special education expenses. The district still has more than $35 million in reserve, but that figure is declining because the school board has kept the districts property tax levy flat during the past two fiscal years. A public hearing and vote on the budget likely will be held next month while a decision on whether to raise the levy, which is the amount the district seeks to raise via the property tax, wont take place until November or December. District 135 had more than $50 million in reserve before a new board majority led by President Joe La Margo, who was absent Monday, decided to tap those funds to avoid tax hikes while making investments such as providing every student in the third through eighth grades with a take-home computer. But the projections that Forn presented to the board Monday show the reserve money declining to $30.5 million by the end of the current fiscal year on June 30, 2016. That would put the reserves at 43 percent of the annual budget, below the 45 percent floor established by the board. \"Im not recommending any drastic action ... because it is projections,\" Forn said. \"I dont want to run around telling you the sky is falling. ... Were not there yet.\", Additional spending pressures include an increase in required bilingual teachers and a new teachers contract that board members were briefed on Monday in closed session. The old pact expired June 30, but Superintendent Janet Stutz expressed confidence that negotiations will conclude before classes resume Aug. 24. In another year, District 135 also will have the added cost of offering full-day kindergarten, which has been estimated at about $800,000 a year. In other action Monday, the board welcomed its new member, Dave Shalabi, to his first meeting. The Orland Park real estate broker was appointed last month to replace Michael Carroll, who was elected in April to the Orland Park Village Board. Stacy Westin also was hired as assistant principal of Jerling Junior High School after serving in the same position for the past eight years at Hauser Junior High in Riverside. Her salary will be about $82,400 a year. Patrick Guinane is a freelance reporter.]", "Date": "20150714", "Author": "[Patrick Guinane]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-district-135-budget-st-0715-20150714-story.html", "Title": "[Orland District 135 looks at deficit budget]"}