{"Content": "[After the 2008 presidential election, it was obvious that American politics was entering a new era in which race would figure less than it had before. For the first time in our history, we had a president who was not white, and it was bound to have a profound, positive impact. Whites would find that a black president would not make their lives worse. Blacks would face less prejudice and feel more fully American. The deep wounds of slavery and discrimination would heal and fade. We were entering a \"post-racial\" era. It lasted about as long as the average honeymoon. Barack Obama stimulated more racial neuroses than he banished. Before long, Fox News host Glenn Beck called him a \"racist\" with a \"deep-seated hatred for white people.\" Rush Limbaugh said he was \"behaving like an African colonial despot.\" Obamas birth certificate was an issue that wouldnt go away. From this years campaign, its clear that race is just as potent a factor as ever. In fact, attitudes about race may be the basic divide in the 2016 election. The shooting of Michael Brown in August 2014 exposed a wide gulf among Americans between those of any race who regarded black anger about police conduct as legitimate and those who didnt. To a large extent, the split ran along partisan lines. An ABC News-Washington Post poll last year found that Republicans were twice as likely as Democrats to think whites and blacks get equal treatment from the criminal justice system or to say police dont discriminate. Put simply, most Democrats sympathize with African-American grievances. Most Republicans dont. In an Associated Press-Times Square Alliance survey in December, GOP voters said the rise of Islamic State was the most important news event of 2014. Democrats, by contrast, gave priority to the unrest in Ferguson, Mo. and elsewhere over the deaths of unarmed black men at the hands of cops. This is not purely a matter of differing philosophies of criminology. On issue after issue, racial attitudes play a major role in where the two parties come out. Illegal immigration, Black Lives Matter, the Confederate flag, even the mountain previously known as McKinley all are filtered through fundamental though sometimes subconscious feelings about race. Donald Trump is doing so well because he exploits racial anxieties masterfully without ever raising them directly. He complains we are \"losing our country,\" ridicules \"political correctness,\" accuses Mexicans of \"bringing crime\" and claims to represent the \"silent majority.\" All these themes are perfectly designed to appeal to white resentments and fear of minorities. Trumps strategy is hardly unique. When a white sheriffs deputy was shot to death in Houston, allegedly by a black man, Ted Cruz blamed it on Obama for striving to \"tear us apart along racial lines, to inflame racial divisions.\", When Maryland Gov. Martin OMalley apologized for telling Black Lives Matter protesters that \"all lives matter,\" Jeb Bush took umbrage. \"If he believes that white lives matter, which I hope he does, then he shouldnt apologize with a group that seemed to disagree with it,\" said Bush, neatly smearing both OMalley and the protesters. Mike Huckabee said Martin Luther King Jr. would \"be appalled by the notion that were elevating some lives above others.\" Its never clear whether Huckabee is an ignoramus or merely a demagogue. For the record, King said, \"A society that has done something special against the Negro for hundreds of years must now do something special for the Negro.\", The activists slogan is meant to elevate the value of black lives, not diminish that of white ones. A longer version would be: \"Black lives should matter as much as white lives.\", Responding to police mistreatment of African-Americans by saying \"all lives matter\" is like demanding that doctors divide their time evenly between the healthy and the sick. Taking the slogan to be racist is like regarding Black History Month as racist. Which, come to think of it, Trump probably does. Whites are on their way to becoming a minority of the population. The Republican candidates know that many of the party faithful associate this trend with national decline and social decay, so they cater to and maybe even share these fears. For half a century, the GOP has been able to reap political success from the racial reality once noted by Alabamas George Wallace (a segregationist Democrat): \"Theys more of us than they is of them.\", That wont be the case for many more years, and a party that wants to prosper has to adapt. But Republicans are campaigning like its 1968. Steve Chapman, a member of the Tribune Editorial Board, blogs at www.chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150902", "Author": "[Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-race-donald-trump-barack-obama-perspec-0903-20150902-column.html", "Title": "[Republicans and racial fears]"}