{"Content": "[Local middle school athletic directors may have until next fall to get up to speed with a new state law concerning student athletes and concussions. The Youth Sports Concussion Safety Act, signed by Gov. Bruce Rauner last month, takes existing regulations that determine when high school athletes can return to games after suffering a concussion and, starting Jan. 1, extends them to younger students, officials said. That means that, once the spring semester begins, junior high schools will have to pay a licensed doctor to come to sports games or practices and evaluate players who may have suffered a concussion, if they want that player to be cleared to return, according to Katharine Eastvold, spokeswoman for state Sen. Kwame Raoul, D-Chicago, who co-sponsored the change. At the last School Board meeting for Kildeer-Countryside Elementary District 96, superintendent Julie Schmidt discussed the prospect of having to fund that by Jan. 1. \"This is a really expensive mandate,\" Schmidt said of the law. But after hearing pleas from junior high administrators, Springfield legislators are taking a second look. A bill that will push the mandate back to the start of the 2016-17 school year passed the state Senate last month, and was unanimously approved out of committee in the House on Wednesday, according to Eastvold. \"There had been quite a reaction from some school districts, who said they needed more time to prepare for this,\" Eastvold said Thursday. Some of those reactions came from Stevenson High School and its three feeder districts. \"I think they realized that it was too much to ask,\" said Tricia Betthauser, the athletics director at Stevenson, who is helping her feeder schools Districts 96, 102 and 103 adjust to the rules she has had to play by in recent years. \"A lot of people were really concerned.\", Under high school regulations the same ones which would apply to middle schools a student can be pulled out of a game or practice if a coach, athletic trainer, game official or the childs parents suspect that the athlete has suffered a concussion, Betthauser said. Before that athlete can return, he or she must be evaluated by a doctor, or a trainer working under a doctors supervision, who must fill out a written document attesting to the childs health, Betthauser said. If no doctor is present at a game or practice, that athlete is done for the day, and must see a doctor later to return. Many high school have a team of officials set to respond to concussions. At Stevenson, Betthauser said theirs includes athletic trainers, nurses, counselors and psychologists who determine how many contests and practices a concussed player will need to skip before he or she is ready to return. Even if the regulations are delayed until next fall, junior highs must now organize similar response teams. \"This was not one that anyone was expecting would be aimed at us, but it was,\" Schmidt told her school board during an Aug. 18 meeting. The new law also takes aim at park districts and independently organized youth sports organizations but to far less expense. Scott Harper, board president of the Lincolnshire Sports Association, said the only requirements the law brings to groups like his is that they must provide information about concussions to parents and train their coaches in which signs to look for during preseason clinics all of which his organization already does. \"Its the awareness campaign part of the bill,\" Harper said. \"The bill really focuses on schools. We dont need to do much beyond what we do today.\", The law covers private schools as well. At Buffalo Groves St. Mary School, Principal Nikki Raftery said the Archdiocese of Chicago will allocate the funding Catholic schools will need to hire doctors for next years games. Betthauser said she was relieved when she heard the proposal for a delay was making its way through Springfield. She said her feeder districts would appreciate more time to budget for their new requirements, and find the best doctors. \"I think [legislators] were maybe not realizing the scope of whats out there, and what it means,\" Betthauser said. rwachter@pioneerlocal.com, Twitter: @RonnieAtPioneer]", "Date": "20150903", "Author": "[Ronnie Wachter]", "Link": "http://www.chicagotribune.com/suburbs/buffalo-grove/news/ct-bgc-concussions-tl-0903-20150903-story.html", "Title": "[Middle schools may get more time on concussion protocols]"}