{"Content": "[Glencoes Don Trossman didnt have to go far to learn the importance of helping those in need. It was simply a matter of emulating his father. Harold Trossman overcame a difficult start, growing up in a Jewish orphanage. The elder Trossman eventually became a successful businessman and while his career was demanding, he remembered his upbringing and was always determined to reach out to others that faced difficult circumstances of their own. \"My father always had a desire to give back,\" Don Trossman said. \"He went on the board of the Jewish Childrens Bureau. It was his past service that was pertinent to me into wanting to give back.\", Having picked up the mantle of service from his father, Don Trossman was honored last month with the Irving B. Harris Leadership Award from Jewish Child and Family Services (JCFS), where he served as a board member and then became president from 2008-2010. \"What it means to me is having served on the board for 12 years, it gave me the opportunity over that period of time to make a difference in our community,\" Trossman said in a recent phone interview. \"Im humbled and honored that they awarded it to me. The mission of (JCFS) is to provide health, healing and caring services infused with Jewish values to strengthen lives of many people. We take care of many people who cant take care of themselves in many respects.\", When Trossman took over as JCFS president in 2008, it came at a time of adjustment. JCFS had been created as a result of a merger of previous agencies, which meant a new order of things. Then, Trossmans task became even more arduous when the economy weakened during the Great Recession years of 2008 and 2009. \"Surviving that recession was no easy task during 2008-10 when I was president,\" Trossman said. \"We were doing a lot of other things for the agency and in the process we had to right size the organization and I guess my financial skills were helpful.\", Another task for Trossman was finding a replacement for Robert Bloom, the agencys executive director who retired. Howard Sitron was brought in and remains the JCFS president and CEO to this day. \"Everything paid off. I didnt do it alone,\" Trossman said. \"I was the leader for those two years, but there are a lot of really fine people that helped.\", That series of accomplishments has made Bloom both an admirer and a friend. \"When he came on the board, he made me anxious because he knew so much,\" Bloom said. \"I was intimidated by how much he knew and he taught me better ways to go about with the administrative side, especially budgets. I always felt he was my partner. He is a genuinely nice man. He listens to what you have to say and tries to help clarify issues.\", Don Trossman said he was born in the Hyde Park neighborhood on Chicagos South Side and moved to Glencoe when he was 4. He went to college at Tulane University but says he dropped out in his senior year to serve in the military as the Vietnam War was raging. While never going into conflict, Trossman was on active duty in the U.S. Air Force Reserve. \"I did my duty to God and country through this reserve service and I got to go on with my life,\" Trossman said. Not interested in running the day-to-day affairs of the family retail and manufacturing business, Trossman pursued a career in the world of commercial real estate finance. Forty-three years later Trossman is still at it, now as a partner at Cohen Financial, a national real estate capital services corporation. \"Its been a lot of fun,\" Trossman said. \"Ive been able to make a good living and live my life.\", After stints living in Evanston and Winnetka, Trossman and his wife, Janis, moved back to Glencoe in 2001. \"Glencoe is a wonderful community,\" Trossman said. \"It is sleepy in the sense that it does not have all the retail that downtown Highland Park or Evanston does. It has a great school system that feeds into New Trier and all of my friends are up north. So we stayed.\", They have two children, Jill Bender, who works with adults with disabilities and son Robert Trossman, a martial arts instructor. Don and Janis Trossman enjoy traveling and he is an avid golfer. While there is no intention to slow down, Trossman is now looking back on an intriguing life both on a personal and private level which has now been enhanced by the honor from JCFS. \"My wife and I have successfully overcome catastrophes that have befallen us as well as having enjoyed having good times,\" Trossman said. \"Life has been good to us.\", Daniel I. Dorfman is a freelance reporter for Pioneer Press.]", "Date": "20150714", "Author": "[Daniel I. Dorfman]", "Link": "http://www.chicagotribune.com/suburbs/glencoe/news/ct-gln-trossman-honored-tl-0716-2-20150714-story.html", "Title": "[Glencoe resident honored for lifetime of giving back]"}