{"Content": "[Indiana Gov. Mike Pence vigorously defended the state religious objections bill that he signed into law Thursday as businesses and organizations including the NCAA pressed concerns that it could open the door to legalizing discrimination against gay people. The state became the first to enact such a change this year among about a dozen where such proposals have been introduced. Arkansas governor said Thursday he supported a similar bill thats advancing in that states Legislature. Pence, a Republican mulling a possible 2016 presidential campaign, signed the bill privately in his office with at least a couple dozen supporters on hand. He later met with reporters and refuted arguments from opponents that law would threaten civil rights laws by saying that hasnt happened under the federal religious freedom law Congress passed in 1993 and similar laws in 19 other states. \"There has been a lot of misunderstanding about this bill,\" Pence said. \"This bill is not about discrimination, and if I thought it legalized discrimination in any way I wouldve vetoed it.\", Those arguments didnt satisfy opponents who worry the law, which will take effect in July, presents Indiana as unwelcoming and could give legal cover to businesses that dont want to provide services to gays and lesbians. National gay-rights consider the Indiana bill among the most sweeping of similar state proposals introduced as conservatives brace for a possible U.S. Supreme Court ruling legalizing same-sex marriage nationwide. The Washington-based Human Rights Campaign said Indiana lawmakers \"have sent a dangerous and discriminatory message.\", \"Theyve basically said, as long as your religion tells you to, its OK to discriminate against people despite what the law says,\" said Sarah Warbelow, the groups legal director. The Indianapolis-based NCAA, which is holding its mens basketball Final Four in the city next weekend, said in a statement it was concerned about the legislation and was examining how it might affect future events and its workforce. \"We will work diligently to assure student-athletes competing in, and visitors attending, next weeks Mens Final Four in Indianapolis are not impacted negatively by this bill,\" NCAA President Mark Emmert said in the statement. \"Moving forward, we intend to closely examine the implications of this bill and how it might affect future events as well as our workforce.\", Soon after Pence signed the bill, Salesforce.com founder and CEO Marc Benioff announced on Twitter that he was canceling all programs that require its customers or employees \"to travel to Indiana to face discrimination.\", The San Francisco-based company bought Indianapolis-based marketing software company ExactTarget for $2.5 billion in 2013 and has kept hundreds of employees in the city. A company spokeswoman declined to elaborate on Benioffs statement. Conservative groups backing the bill have said it merely seeks to prevent the government from compelling people to provide such things as catering or photography for same-sex weddings or other activities they find objectionable on religious grounds. Indiana Right to Life President and CEO Mike Fichter praised the new law, saying it would give abortion opponents legal recourse if they are pressured to support the procedure. The organization circulated an online petition to thank Pence for signing the bill. At least two groups the Christian Church (Disciples of Christ) and gamers convention organizer Gen Con have said they would reconsider plans to events in Indianapolis because of the legislation. Pence pointed out that President Barack Obama voted in favor of a similar state law while he was an Illinois legislator. But when Pence was asked whether he would support matching Illinois by adding sexual orientation to the states civil rights law, he responded: \"Thats not on my agenda. I wont be pursuing that.\", Associated Press]", "Date": "20150326", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-indiana-religious-freedom-bill-sb101-pence-20150326-story.html", "Title": "[Indiana Gov. Pence defends religious objections law: 'This bill is not about discrimination']"}