{"Content": "[Boeing on Tuesday announced that CEO Jim McNerney, who led the aerospace giant for the past decade, will step down July 1. His successor is chief operating officer Dennis A. Muilenburg, who joined the company as an intern 30 years ago. McNerney, 65, endured the woes and successes of the launch of Boeings new 787 Dreamliner aircraft, which suffered from production delays and a worldwide grounding in 2013, only to later be lauded for its fuel efficiency and customer-pleasing features. He also led the Chicago-based company, which had nearly $91 billion in revenue last year, during a new era of prosperity in worldwide commercial airplane sales for Boeing and declining sales to the U.S. military. Boeing turns 100 years old next year. Jim McNerney, Jim McNerney, McNerney will remain chairman of Boeings board of directors, where he has served since 2001. He will remain a Boeing employee through February to ensure a smooth transition of his CEO responsibilities to Muilenburg, the company said, adding that he will also continue advocating on behalf of Boeing, including in Washington, D.C. Boeing didnt say the move was part of a succession plan, but McNerney had reached Boeings mandatory retirement age of 65. The company said he had made priorities of succession planning and leadership development at the outset of his tenure. McNerney earned $28.9 million in 2014 and was the highest-paid CEO of a public company in the Chicago region, according to a recent Tribune analysis. Muilenburg, 51, has been COO since 2013. Dennis is an extremely capable, experienced and respected leader with an immense passion for our company, our people, and our products and services, McNerney said in a statement. As CEO, Dennis will bring a rich combination of management skills, customer focus, business and engineering acumen, a can-do spirit and the will to win. With a deep appreciation of our past accomplishments, and the energy and skill to drive those to come, he is well suited to lead our very talented Boeing team into its second century. Dennis A. Muilenburg. Dennis A. Muilenburg. Muilenburg said in a statement that hes taking over at a time when Boeing is financially strong and well-positioned in our markets. As we continue to drive the benefits of integrating our enterprise skills, capabilities and experience what we call operating as One Boeing we will find new and better ways to engage and inspire employees, deliver innovation that drives customer success, and produce results to fuel future growth and prosperity for all our stakeholders, Muilenburg said. McNerney was elected Boeing chairman, president and chief executive in 2005. During his tenure, the company recaptured the global lead in commercial airplane deliveries from rival Airbus with steady increases in production and a comprehensive update of its product line, the company said. Commercial jets now account for about 70 percent of the companys revenue; most of the remainder came from its military and space operations. The company maintained a strong position in defense markets despite a downturn in U.S. military spending. Boeings financial performance improved under McNerney, with revenue rising 73 percent to a record $90.8 billion last year from $52.5 billion in 2004, the year before he became CEO, the company said, adding that order backlogs and earnings per share tripled over the period. McNerney helped Boeing recover from missteps that started before his tenure. The 787 carbon-fiber composite jet was assembled from parts manufactured around the globe, then assembled by Boeing. Never before had the company handed over so much control of its production to outsiders, and the budget-saving measure ended up creating headaches, delays and expensive cost overruns. The 787 was grounded for 100 days in 2013 by aviation regulators worldwide because of overheating onboard batteries, a problem that regulators say has been fixed. Under McNerney, Boeing also moved some of its production away from unionized workers in the Seattle area to non-union ones in South Carolina. Outside the 787, the company has kept to safe bets. Instead of developing new commercial airliners, it has tweaked its existing offerings stretching fuselages to accommodate more passengers and altering existing airframes to accommodate new, more fuel-efficient engines. Muilenburg formerly served as president and CEO of Boeings defense business, headquartered in St. Louis. Before that, he was president of the units Global Services & Support business, and he led Boeings Combat Systems division. He joined Boeings engineering ranks as an intern in Seattle in 1985. Associated Press contributed. gkarp@tribpub.com, Twitter @spendingsmart]", "Date": "20150623", "Author": "[Gregory Karp]", "Link": "http://www.chicagotribune.com/business/ct-boeing-new-ceo-20150623-story.html", "Title": "[Boeing names veteran insider as new CEO]"}