{"Content": "[The White House is close to bringing Congress another plan for closing the prison for terrorism detainees atGuantanamoBay, Cuba, a campaign pledge that President Barack Obama hasnt given up on, his spokesman said Wednesday. \"There has got to be a better way for us to spend taxpayer dollars than to spend more than $100 million a year operating a prison that only has, I think now, 116 inmates,\" press secretary Josh Earnest said. \"There also has to be a better way for us to protect our national security interests than to deliver on a silver platter a particularly effective recruiting tool for terrorists, which is to continue the operation of that prison.\", Under a defense policy bill passed by the Senate, lawmakers would consider the White House plan and decide whether to ease restrictions that make it harder for Obama to transfer detainees out of the prison at the U.S. naval base in an effort to close it. The House version of the legislation doesnt contain that provision, however, and it may not survive when lawmakers finish negotiating a compromise version of the entire bill. The White House has threatened a veto of the defense bill over several issues, including if it makes it harder to close theGuantanamoBay prison. Congress has repeatedly stymied the presidents plans to close the prison in the past, however, and Obama has backed down from similar veto threats. Earnest said the administration was in the \"final stages\" of drafting the plan for Congress. Sen. John McCain, R-Ariz. chairman of the Senate Armed Services Committee and a prisoner of war during the Vietnam War, proposed creating this new path toward the possibility of closing theGuantanamoBay facility. But theres opposition among many Republicans and Democrats, too. Lawmakers fear that detainees from the war on terror sent home to the Middle East will return to the battlefield. They also object to moving them into U.S. prisons. House Speaker John Boehners office said in a statement that bipartisan majorities in Congress oppose \"closingGuantanamoBay and bringing dangerous terrorists to U.S. soil.\", \"Given the serious threats America faces, its incredible to see this administration threatening to veto a bill that gives our troops a pay raise, strengthens our cybersecurity and imposes greater restrictions on releasing terrorists,\" Boehner spokesman Cory Fritz said. Associated Press]", "Date": "20150722", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-white-house-guantanamo-20150722-story.html", "Title": "[Obama tries another push to close Guantanamo Bay prison]"}