{"Content": "[More than a dozen years ago, a young aspiring politician stopped by my office for a 45-minute chat. He was dazzling. That was Bobby Jindal, an Indian-American son of immigrants, Rhodes Scholar, top health official in Louisiana in his 20s, who held a major post in the George W. Bush administration at 30. With a winning smile, comfortable manner and sharp intellect, he had future written all over him. He was elected to Congress and twice governor of Louisiana. Hes now a Republican candidate for president; none has more impressive credentials. Yet today hes the most unpopular politician in Louisiana, trailing even President Barack Obama. He barely registers in any presidential polls. The journey of this incredibly promising politician would make a good book. Henry Goodwin, a spokesman for the governor, says the poll ratings are explained by Jindals willingness \"to spend his political capital\" on educational, hospital and ethics reforms. He said no other presidential candidate could match the governors record of \"conservative reform.\", A lot of Republicans tell a different story. \"Its been terrible,\" says State Senator Robert Adley, citing the states worsening fiscal and jobs situation over the past eight years. Why? \"Blind Ambition,\" he says. The 44-year-olds national ambitions were apparent from the day he was elected governor. He constantly courts the partys right-wing base. Thus, before the last presidential election, the son of immigrants supported a \"birther\" measure to require presidential candidates to provide a birth certificate to qualify for the Louisiana ballot, a loony anti-Obama scheme. The honors student in biology signed legislation promoting the teaching of creationism in the schools. Hes hardly the first politician to pander. But, Republicans acknowledge, Jindals pandering is too obvious. On the biggest issue, Louisianas fiscal crisis, he gave veto power over taxes to Grover Norquists Americans for Tax Reform, the Washington anti-tax group. For most of his governorship, he cut taxes. He fashioned a series of education reforms but didnt adequately fund them. Jindal initially favored the Common Core education standards; he flipped when conservatives rallied against the program. Higher education was hit hardest in the budget: \"Since the recession, we are No. 1 in America in reducing funding of our colleges and universities,\" says State Treasurer John Kennedy, a Republican. \"Thats not a record to be proud of.\", Facing a $1.6 billion shortfall this year caused by the slump in oil prices and the tax cuts Jindal devised a ruse that raised fees for college students, then offset that with a credit that was supposed to camouflage cuts in corporate tax breaks and an increase in cigarette taxes. \"He told us this had the blessing of Americans for Tax Reform,\" said state Rep. Joel Robideaux, R, chairman of the legislatures Ways and Means Committee. \"It was disingenuous to pretend that we didnt deal with taxes.\" (Jindal still contends there was no net tax increase.), The voters werent fooled. \"We needed hands-on leadership and he took his eye off the ball,\" says Robideaux, \"and folks in the higher education and health care communities felt they were forgotten by the governor.\", Jindal often is described as aloof and insular. Few Republicans attended his presidential announcement speech. \"I have not talked to the governor in two years,\" Kennedy says, adding that he had \"regular conversations\" with the three previous governors. The states two top Republicans, Jindal and Sen. David Vitter, colleagues say, go to lengths to avoid talking. Vitter is the favorite to win the governors race this year, not a pleasant prospect for Jindal. The senator, meanwhile, probably isnt pleased about an ad taken out by opponents that depicts him and the unpopular governor as identical, politicians who are \"more interested in the next job than the one theyre supposed to be doing now.\", Bloomberg, Albert Hunt is a Bloomberg columnist.]", "Date": "20150713", "Author": "[Albert Hunt]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-bobby-jindal-unpopular-birther-creationism-20150713-story.html", "Title": "[Bobby Jindal's record doesn't match his credentials]"}