{"Content": "[Republicans are in a funk on the eve of the first presidential primary debate. The partys popularity has dipped, largely because Republican voters are souring on it. Their lack of confidence in their party surely has something to do with Donald Trumps rise in the polls. Bitterness between conservative groups and the Senate Republican leadership is at a peak, with the former saying the latter are too devoted to keeping corporate welfare programs like the Export-Import Bank alive and insufficiently committed to defunding Planned Parenthood. The partys low morale is partly the result of two strategic decisions its leaders have made over the past year. They chose to run an agenda-less campaign to win control of the Senate in 2014, and having won it they chose to act as though their most important goal was to \"prove they could govern\" that is, to enact legislation or at least get it to President Barack Obama to sign or veto. Neither of these decisions was obviously crazy. If candidates had run on specific agendas\"If elected, I will push Bill X to replace the Affordable Care Act\" they might have disagreed with one another, Democrats might have found effective lines of attack against their ideas, and they might not have gained the substantial majorities they did. The second decision, trying to govern with Obama, looked like an alternative to potential political fiascoes. Republicans worried that a single-minded strategy of fighting Obama risked a government shutdown that could hurt the partys chance of winning the presidency in 2016. But these choices also had potential disadvantages. Running without an agenda, candidates instead raised vague expectations that, if they won, conservatives would see big victories of some sort on illegal immigration and Obamacare. Trying to advance legislation with some bipartisan buy-in would inevitably mean pushing the priorities of some corporate constituencies rather than those of voters and thus deepening the perception that Republicans are the political arm of big business. The strategy was also bound to run up against two immovable obstacles. First, Senate Democrats have an incentive to filibuster Republican bills so that they never reach the presidents desk. That way Republicans look unproductive, and fail by the terms they themselves established. Second, conservative Republicans were likely to grow restive, and the stage would be set for a factional fight that again made the party look incompetent. These potential drawbacks to the strategy have largely materialized. Conservatives and swing voters who are paying attention have seen the Republican Congress act on business priorities: advancing a highway bill and getting a Trade Promotion Authority signed by the president. They have also seen them fret for months about the possibility that the Supreme Court would force them to do something about Obamacare, something Republican voters actually want, and then breathe sighs of relief that it didnt. Some of this activity was worthwhile the trade bill, especially, was in the national interest but Republicans have done little to advance attractive ideas to appeal to the voters watching them, or to make inattentive voters sit up and take notice. They havent pushed bills to cut taxes or boost economic growth or cut college tuition. And of course Congress has achieved nothing on immigration. It isnt surprising, then, that roughly a fifth of Republican voters are flocking to Trump, a candidate who promises big, not-terribly-specific changes but seems like he might mean it. Republicans erred in assuming that their alternatives were either trying to prove they could govern with Obama or engaging in an endless series of showdowns with him. A third alternative would have been to advance a governing agenda of their own, ideally during the midterm campaign, on issues such health care, taxes and higher education. That strategy wouldnt have resulted in the enactment of a lot of Republican bills, since Democrats could still have filibustered them. But Republicans would have been standing for something more attractive than they are today not a high bar and making Senate Democrats pay some price for obstruction. And maybe the partys own voters wouldnt be quite so heartily sick of them. Bloomberg, Ramesh Ponnuru, a Bloomberg View columnist, is a senior editor for National Review, where he has covered national politics for 18 years, and a visiting fellow at the American Enterprise Institute.]", "Date": "20150805", "Author": "[Ramesh Ponnuru]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-republicans-own-fault-20150805-story.html", "Title": "[Republicans should blame themselves for Donald Trump]"}