{"Content": "[The first Republican presidential debate takes place Thursday, and one thing is certain: All but one of the Democrats, Republicans and independents who are seeking the nations highest office will be losers in the end. Heres a look at 10 facts about failed presidential candidates:, 1. A perennial presidential candidate in the mid-19th century was Leonard \"Live Forever\" Jones, a Kentuckian who believed that if people could find a way to live sinless lives, they would never die. Jones envisioned a city of immortals where cemeteries would be unnecessary, but that city was never built, and he never made much of an impact as the candidate of the High Moral Party. Jones, to his presumed embarrassment, died in 1868. 2. Victoria Woodhull, an Ohio native often described as the first female candidate for U.S. president, was an amazing public figure an advocate for womens sexual freedom, a Wall Street broker, a spiritual healer and the first American publisher of \"The Communist Manifesto.\" When she ran as the Equal Rights Party candidate for president in 1872, women didnt have the right to vote, and Woodhull hadnt yet reached the minimum age of 35. She spent Election Day in jail on a charge of sending obscene materials through the mail, and any votes she got apparently went uncounted. In 1877, Woodhull moved to England, and later became one of the first women there to own a car. 3. The anti-war protesters who descended on Chicago for the Democratic National Convention in 1968 were adept at publicity. Near the Picasso sculpture downtown, they appeared with a hog named Pigasus and announced him as their candidate for president. Seven protesters were arrested on charges of disturbing the peace and Pigasus was taken to the Anti-Cruelty Society, later to be adopted by a farmer in Grayslake. At the jail, a police officer told the suspects: \"Ive got bad news for you, boys. The pig squealed.\", 4. Samuel Tilden infamously lost the hotly contested 1876 election by one electoral vote to Rutherford B. Hayes, but that didnt stop Wichita Falls, Texas, from including him when it named streets after presidents, slipping Tilden Street between Grant and Hayes streets. 5. Harold Stassen started out as a prodigy, becoming the youngest governor of Minnesota at age 31. He ended up as a joke, running for the Republican presidential nomination nine times and coming up empty. Even so, he chalked up some impressive accomplishments, including appointing the first black officer in his states National Guard and signing the United Nations Charter, one of eight Americans to do so. 6. Just one man, Franklin D. Roosevelt, has been American voters choice for president more than twice. So say all the history books. But Grover Cleveland did capture the most votes in three consecutive elections: 1884, 1888, 1892. Unfortunately for Cleveland, Republican Benjamin Harrison grabbed more electoral votes and the presidency in 1888. Cleveland had to settle for being the only president to serve nonconsecutive terms. 7. New York Gov. Al Smith, the Democratic candidate in 1928, faced nasty campaign rhetoric targeting his Catholicism. One example: A photo of the Holland Tunnel linking New York and New Jersey was widely distributed with a caption claiming it secretly led to the Vatican. If that werent enough, Smith also strongly opposed Prohibition, which put him in the wet camp. Naturally, his campaign buttons read: \"Vote for Al Smith And Make Your Wet Dreams Come True.\" He lost in a landslide to Herbert Hoover. 8. Martin Van Burens Free Soil candidacy in 1848 was Americas first serious third-party movement, but its abolitionist stance was a nonstarter in the South. Still, when Van Buren was credited with nine votes in Virginia, his campaign cried foul just nine votes out of 92,000 cast? A Virginian wit responded, \"Yes, fraud, and were still looking for the son-of-a-bitch who voted nine times.\", 9. The 1948 election saw Strom Thurmond, the States Rights Party candidate, spit virulent racism at every turn, but it was the Progressive Partys Henry Wallace who walked into the buzz saw of public disfavor. In the midst of a Red Scare, Wallace made the mistake of suggesting there was more than one way to deal with the Soviet Union. The blowback was staggering. The Pittsburgh Press published the names, addresses and workplaces of Wallace supporters. Other supporters were arrested, beaten and even killed. And in New York, a judge said support for Wallace could weigh against a parent in a child-custody case. 10. Bob Dole lost several bids for the presidency, but he never lost his sense of humor. After his defeats, he said, \"I slept like a baby. Every two hours I woke up and cried.\", Mark Jacob is the Chicago Tribunes associate managing editor for metro news; Stephan Benzkofer is the Tribunes weekend editor. mjacob@tribpub.com, sbenzkofer@tribpub.com, Sources: \"Almost President: The Men Who Lost the Race But Changed the Nation,\" by Scott Farris; \"Legendary Locals of Louisville,\" by Kris Applegate; \"Ben Hardin: His Times and Contemporaries, with Selections from His Speeches,\" by Lucius P. Little; \"Notorious Victoria: The Life of Victoria Woodhull, Uncensored,\" by Mary Gabriel; \"Theres a Riot Going On: Revolutionaries, Rock Stars, and the Rise and Fall of 60s Counterculture,\" by Peter Dogget; \"Chicago 68,\" by David Farber; \"American Dreamer: The Life and Times of Henry A. Wallace,\" by John C. Culver and John Hyde; \"Martin Van Buren: The American Presidents Series: The 8th President, 1837-1841,\" by Edward L. Widme; The New York Times; mentalfloss.com; Heritage Auctions; npr.org; biography.com.]", "Date": "20150801", "Author": "[Mark Jacob, Stephan Benzkofer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-failed-presidential-candidates-perspec-0802-jm-20150731-story.html", "Title": "[10 things you might not know about presidential also-rans]"}