{"Content": "[Leslie Munger, appointed by Gov.-elect Bruce Rauner as state comptroller, awaits a possible vote by legislators Thursday on whether shell serve for the full four years or will face an election challenge in 2016. That has been at issue since the death of Republican Judy Baar Topinka after her re-election in November, with the states constitution unclear on the proper course for filling the vacancy at comptroller. Rauner says Munger should serve the full four years, but departing Gov. Pat Quinn has called the Legislature into a special session Thursday to consider limiting Mungers term to two years and holding a vote at the next general election. On Wednesday, Senate President John Cullerton and House Speaker Michael Madigan issued their own order calling on lawmakers to take up a broader proposal that would require a special election to fill any long-term vacancy in a statewide constitutional office. Munger said Wednesday shes not worried about the outcome of the vote. \"If that comes to pass, hopefully the fact that Ive done a good job will help me get elected,\" she said in a phone interview from Florida, where she has been vacationing with her family. Munger, 58, made her mark as manager of an $800 million hair care enterprise. But she has been out of the corporate world for the last 14 years, and is more recently known for volunteer work in her north suburban community. After her hair care company was sold to a firm overseas, she said, the travel demands of the job led her to rethink her career. \"I had young children at the time and at some point, I just decided its too much, Im gone too much, I need to go home,\" Munger said. \"I just decided its time to step off the merry-go-round and raise my children.\", Munger made her first campaign for office last year as the GOPs challenger to Democratic state Rep. Carol Sente. She lost by a slim margin in November. As a candidate, Munger was able to draw on political connections that date back to her time in the corporate world. She oversaw the U.S. hair care business for Helene Curtis and Unilever from 1984 to 2001 under former CEO Ron Gidwitz, who served on Rauners campaign finance committee. Familiar with deadlines, \"Shes very familiar with numbers, shes very familiar with deadlines,\" Gidwitz said. \"She understands the consequences of missing deadlines and not being successful with projections. So she will be a terrific comptroller.\", A self-described \"political outsider,\" Munger has been active in local politics, serving as a Republican precinct committeeman and on the board of governors of the Lake County Republican Federation. Munger met Rauner shortly before launching her campaign but got to know him after attending a number of the same political events, she said. \"We were all new candidates, all on the same track of constant meetings, fundraisers, Republican events,\" Munger said. After the campaign, Munger submitted her resume to the Rauner transition team, expecting that shed be called on to help in some way. She said she hadnt imagined an appointment to an elected office. But after she was approached last weekend about the comptroller job, , Munger said, it started to seem like a good fit. At Helene Curtis, \"I had to deliver profit numbers to the company, I had to deliver sales,\" she said. \"When budgets were not coming in as planned, we had to cut spending and we still had to maintain strong, healthy brands.\", Munger said Rauners staff told her she was a contender for the position because \"Im a fiscal conservative, Im a Springfield outsider. I bring a fresh perspective and new eyes.\", She believes her business background and education also played a factor. Munger holds an MBA from Northwesterns Kellogg School of Management. Munger is an active volunteer and former board member of the Lincolnshire-based Riverside Foundation, which provides assistance to adults with intellectual and developmental disabilities. She said her work with the foundation made her aware of the important role of the comptroller, who is responsible for paying the states bills. At one point years ago, the state was behind in payments to the foundation, forcing the foundations board to borrow to pay its bills, Munger said. That changed when Topinka took over the office, she said. \"She started putting those kind of bills at the top,\" Munger said. \"So I really became aware of what a difference this office can make and how important it is to be fiscally responsible.\", Munger sees her lack of political experience as an asset. \"I believe its good to have somebody outside of Springfield,\" she said. \"I believe more outside people who have real-life experience, who have to live under the things that our government is doing to us, I think thats a good thing because we know what real life is like.\", Munger and her family have prospered, public records show. Along with their home in Lincolnshire, Munger and her husband, John, an intellectual property lawyer, paid $630,000 in 2013 for a waterfront home on an island along the Gulf Coast in South Florida, according to property records. In 2012, Munger signed a document intended for submission to the Wisconsin Department of Natural Resources describing herself as the longtime owner of a lakefront home in Manitowish Waters in northern Wisconsin. Dan Proft, a former talk show host and unsuccessful candidate for governor, praised Mungers selection, saying Rauner had delivered on a campaign promise. \"When he ran, he said he was going to bring in outside talent, and by selecting Munger, hes done just that,\" said Proft, whose Liberty Principles PAC, bankrolled by conservative mega-donor Richard Uihlein, supported Munger in her legislative race. Munger was named Lincolnshires Citizen of the Year in 2004 and the Riverside Foundations Auxiliary Volunteer of the Year in 2013. At the Riverside Foundation, Munger has been a standout volunteer whos \"always looking for the next thing, the next way to help,\" said executive director Deborah Rogers. Her work with the organization has included fundraising, and shes spent time with the groups intellectually and developmentally disabled clients, Rogers said. \"Shes very kind, very social, very friendly,\" Rogers said of Munger. \"Shes liked by many, many people.\", But state Sen. Terry Link, D-Waukegan, criticized the appointment, noting that Rauner cast himself during the campaign as an outsider who planned to \"shake up\" Springfield. Rauner appointing an unsuccessful candidate from his own party \"sounds like business as usual,\" Link said. \"I dont know if shes qualified or not but thats the same thing he was criticizing people for in the past,\" Link said. Legislative dynamics, The issue put before the special session Thursday could be the Democrat-controlled General Assemblys first chance to take a political shot at the incoming Republican governor. Democrats argue that an election for comptroller in 2016 is about ensuring voters get a say in filling such a vacancy, rather than allowing an unelected person to serve in the job for the full four years. Republicans are opposed to the idea, and contend its not a coincidence that 2016 is a presidential election year, when Democrats in Illinois historically perform better at the ballot box. \"I think democracy is always better when the people call the shots, when the people are in charge,\" Quinn said Tuesday during a speech before the City Club of Chicago. \"When it comes to election of statewide officials, whatever the office might be, whether its comptroller or attorney general or secretary of state, you know I think if theres a vacancy, that it should be filled as soon as possible by the voting people.\", Under legislation introduced by Cullerton, if a statewide constitutional office becomes vacant with 28 months or more remaining in the term, a special election to fill the spot would be held during the next statewide election. A Madigan spokesman said the speaker supports the legislation. House Majority Leader Barbara Flynn Currie called it a \"straightforward\" proposal and a \"no-brainer\" that wouldnt cost the state any additional money since a special election would be held when voters already were scheduled to head to the polls. Rauner has said the Illinois Constitution gives him the power to make a four-year appointment, and he suggested any attempts to undermine that might result in legal action. Republican legislative leaders argue lawmakers instead should focus on getting an amendment on the 2016 ballot that would consolidate the comptroller and treasurers office. One question is whether lawmakers, including those of the lame-duck variety, will travel to Springfield in extremely cold temperatures to take the vote. Tribune reporters Monique Garcia and Ray Long contributed. kgeiger@tribpub.com, dhinkel@tribpub.com]", "Date": "20150108", "Author": "[Kim Geiger and Dan Hinkel]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-leslie-munger-comptroller-met-20150107-story.html", "Title": "[ Rauner's pick for comptroller not worried about possible 2016 election]"}