{"Content": "[How do you know when a presidential candidate is being deceptive? No, silly, not when his or her lips are moving. Candidates often tell the truth like when they say they want your vote or your money. Moving lips are not a reliable clue. So what is? Any statement that envisions an amendment to the U.S. Constitution. Politicians often act as though the Constitution is a sacred text handed down from heaven, like the Bible. Unlike the Bible, though, they have all sorts of recommendations for improving it. These proposals fall into two general categories: hopeless fantasies and pathetic frauds. This year, both Republicans and Democrats support revisions to the nations charter. After the Supreme Court said gay couples have a constitutional right to marry, Ted Cruz said every justice should be subject to a retention election every eight years junking the life tenure for all federal judges provided by the framers. Scott Walker wants an amendment to let states ban same-sex marriage. Bobby Jindal, Rick Santorum and Mike Huckabee also said the decision called for altering the Constitution. Jeb Bush is against those proposals, but he has his own changes in mind. He favors an amendment to require a balanced federal budget. Rick Perry endorsed that when he ran in 2012. He, Huckabee and Santorum have come out for an amendment to ban abortion. Not that the GOP has a monopoly on such designs. Bernie Sanders is sponsoring a constitutional amendment to override the Supreme Courts rulings on campaign finance and \"stop billionaires from buying elections.\" Hillary Clinton is on board; so is Martin OMalley. What all these measures have in common is that they have no chance of coming to pass in the foreseeable future, if ever. Weve already elected a president who supported the Federal Marriage Amendment George W. Bush. If he couldnt get it through at a time when the citizenry opposed same-sex marriage, a Republican successor is not going to get it through now, in stark defiance of public opinion. Supporters may say Bush didnt make much of an effort, which is true but doesnt help their case. He didnt make much of an effort because he knew that trying to get it approved by a supermajority in both houses of Congress, and then winning ratification by three-quarters of the states, would be a waste of time. The balanced budget amendment is one of those ideas whose time has come and gone. Back in the 1970s, there was even a push for states to call a constitutional convention to consider it, which fell short of the 34 needed. Ronald Reagan was for the amendment, and so were many Democrats. But it went nowhere. In the 1990s, the need became even less evident when Congress and President Bill Clinton managed to eliminate the budget deficit all by themselves. Overriding the Supreme Courts rulings on campaign finance regulation is even harder to imagine. In the first place, it would require a lot of ordinary people to demand action on a subject they understand only dimly. In the second, it would face concerted and well-funded opposition from the very interests that supposedly are empowered by the status quo. The logic of the supporters undermines the plausibility of their strategy. If Sheldon Adelson and the Koch brothers can use their fortunes to prevent the election of candidates they dislike, why couldnt they prevent a constitutional amendment they reject? Passing the amendment, on the other hand, would prove it isnt needed, by dramatizing the weakness of moneyed interests. In any case, its not going to happen, if only because Republicans, who are universally opposed to it, are so dominant at the state level. After the 2014 elections, the GOP held legislative control in 30 states. Given their huge disadvantage, Democrats might as well try to land a kite on the moon. Endorsing a constitutional amendment is a way of evading useful action, often because there is nothing to be done. Rather than admit defeat on a matter that is important to some voters, candidates try to gull them with solutions they know are bogus. No one should be fooled. As Mark Twain might say if he were still around today, there are three kinds of falsehoods: Lies, damn lies and constitutional amendments. Steve Chapman, a member of the Tribune Editorial Board, blogs at www.chicagotribune.com/chapman, schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150731", "Author": "[Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-constitutional-amendments-abortion-balanced-budget-bush-clinton-perspec-0802--20150730-column.html", "Title": "[Phony amendments from presidential hopefuls]"}