{"Content": "[CLEVELAND Hillary Clinton equated Republican policies on women to those of terrorist groups that want to revive the Middle Ages. Speaking at a Cleveland rally, Clinton criticized the positions of Republican presidential candidates on issues such as banning abortion even in the case of rape and incest, calling them \"extreme views\" and \"dead wrong for 21st century America.\", \"We expect that from some of the terrorist groups,\" she said. \"We expect that from people who dont want to live in the modern world. But its a little hard to take coming from Republicans who want to be president of the United States.\", That drew a rebuke from the Republican National Committee, which said she should apologize for \"inflammatory rhetoric\" and that \"to equate her political opponents to terrorists is a new low for her flailing campaign.\", Clinton returned to Ohio for a \"grassroots organizing\" event and fundraiser amid sagging poll numbers and controversy about using a private email server when she was secretary of state. She won the Democratic primary in the Buckeye State in 2008 when her campaign was on the ropes. It buoyed her, though she ultimately lost to Barack Obama. \"I will never forget what Ohio did for me in 2008,\" Clinton told the crowd on the campus of Case Western Reserve University estimated at about 3,000. \"You lifted me up when I was down and out.\", Ohio may determine the presidency, so campaigning there makes sense -- especially now -- for Clinton, said Joe Trippi, a Democrat who was campaign manager for Howard Dean in 2004 and worked against Clinton for John Edwards in 2008. \"She connects in Ohio,\" he said. \"She seems to be more comfortable there, more authentic there.\", A national Quinnipiac University poll released on Thursday shows that Clinton leads the race for the Democratic nomination with 45 percent, compared with 22 percent for Sen. Bernie Sanders of Vermont and 18 percent for Vice President Joe Biden. Yet her support has dipped from 55 percent on July 30, and Biden polled better against the leading Republican candidates. A Quinnipiac poll released Aug. 20 also found that while Clinton had a clear lead in the battlegrounds of Florida, Ohio and Pennsylvania, her high negative ratings presented an opening for Biden. In Ohio, 54 percent of voters polled had an unfavorable opinion of Clinton. Republicans, who will hold their nominating convention in Cleveland next year, have been hammering at her, and raising questions about her use of the private server. \"Ohioans clearly are going to have a hard time trusting Hillary Clinton,\" state Republican Chairman Matt Borges said told reporters Wednesday. Regardless, Clinton hasnt lost support among Democrats, said Rep. Tim Ryan, who backs the candidate. That should discourage Biden, he said. \"If theres an opening, I dont see it in Ohio, and I love Joe Biden,\" Ryan said. Still, Clinton needs to recapture the drive she showed in 2008, said Mary Rose Oakar, a former U.S. representative from Cleveland. Oakar backed Clinton in 2008 and said she hasnt committed for 2016. \"She was right out there, very dynamic and had that zest in her, fire in her belly,\" Oakar said. \"I want to see a little more of that.\", Her husband, Bill, carried the state twice in his two presidential elections. Ohio also voted for former Republican President George W. Bush twice and Obama twice. It has picked the winner in the past 13 presidential contests. On Thursday, Clinton also vowed to be her own president, a contrast to previous contrast to previous remarks from Biden, who said he would embrace the Obama administrations achievements. \"Im not running for my husbands third term, and Im not running for President Obamas third term,\" Clinton said in the Cleveland speech. \"Im running for my first term.\"]", "Date": "20150827", "Author": "[Mark Niquette, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-clinton-gop-bg27-20150827-story.html", "Title": "[Clinton compares Republican policies to those of terrorists]"}