{"Content": "[Former technology executive Carly Fiorina and retired neurosurgeon Ben Carson jumped into the race for the Republican presidential nomination Monday, both longshots who nevertheless have the potential to attract a more diverse group of supporters to the party. Fiorina is likely to be the only prominent woman to seek the GOP nomination, with Carson the only likely African-American. They are both also political outsiders in a field likely to be dominated by governors, former governors and senators. The two are not considered political allies and the timing of their announcements, planned weeks ago, is coincidental. Fiorina, 60, chose a nationally broadcast morning network news show to announce her candidacy, and she also posted a video. The former chief executive of Hewlett-Packard Co. appearing on ABCs \"Good Morning America,\" said she understands \"executive decision-making.\", She also criticized Democrat Hillary Rodham Clinton, the front-runner for her partys nomination, for a lack of transparency, including the use of a private email server while secretary of state and foreign donations to her familys charitable foundation. \"I have a lot of admiration for Hillary Clinton, but she clearly is not trustworthy,\" Fiorina said. Carson, 63, also got ahead of himself on Sunday, confirming his plans to run in an interview on an Ohio television station. He declared his candidacy in his hometown of Detroit on Monday, telling supporters the nation is \"a place of dreams\" where people can thrive when freed from an overbearing government. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. \"Its time for people to rise up and take the government back,\" he said. \"The political class wont like me saying things like that. The political class comes from both parties.\", Both candidates begin the race as underdogs in a campaign expected to feature several seasoned politicians, among them former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker, Florida Sen. Marco Rubio and Texas Sen. Ted Cruz. Yet while they have claimed much of the early attention and favor from donors, the GOP race is a wide-open contest that could ultimately feature as many as two dozen notable candidates. The Republican field is already more diverse than it was four years ago. Rubio and Cruz are each vying to become the first Hispanic president. And most of the candidates are in their 40s and 50s. Still, Republicans have acknowledged a pressing need to broaden the partys appeal beyond its traditional base of older, white men. President Barack Obama won re-election in 2012 with the strong support of women and ethnic minorities, who are becoming a larger portion of the American electorate. Raised in Detroit by a single mother, Carson practiced medicine and served as the head of pediatric neurosurgery for close to three decades at Baltimores Johns Hopkins Childrens Center. Carson directed the first surgery to separate twins connected at the back of the head. His career was notable enough to inspire the 2009 movie, \"Gifted Hands,\" with actor Cuba Gooding Jr. depicting Carson. He gained national renown in conservative politics after condemning Obamas health care law at the 2013 national prayer breakfast. He has established a strong base of vocal support among tea party-backers, some of whom launched an effort to push Carson into the race before he set up an exploratory committee earlier this year. Yet he has stumbled at times in the glare of national politics. He has suggested the Affordable Care Act is the worst thing since slavery, compared present-day America to Nazi Germany, and called problems at the nations Veterans Affairs hospitals \"a gift from God\" because they revealed holes in the countrys effort to care for former members of the military. Fiorina, meanwhile, has a resume more likely to draw support among the Republican establishment. The former business executive became a prominent figure in Republican politics in 2010, when she ran for Senate in California and lost to incumbent Sen. Barbara Boxer by 10 points. Associated Press]", "Date": "20150504", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-carly-fiorina-ben-carson-presidential-bids-20150504-story.html", "Title": "[GOP field grows: Fiorina, Carson launch bids for 2016 nomination]"}