{"Content": "[Napervilles business community is taking a close look at the possibility of a 1 percent city sales tax. City staff has proposed adding the retail tax using the citys home rule powers, as one of several strategies for shrinking a long-foreseen $6.8 million gap in the 2016 budget. It would be the first city sales tax in the municipalitys history. Also pending in upcoming discussions with policy makers is a possible increase in residents monthly garbage collection fees from $2 to $12.35. Staff has said the latter sum reflects the actual cost paid to the hauler by the city, which now draws the funds for that expense from real estate tax income. An additional 1 percent sales tax would bring the total retail sales tax rate in the city to 8.25 percent, and that has the attention of city merchants and other business people. The Naperville Area Chamber of Commerce will take up the issue when its Legislative Committee meets Aug. 10. The committee will be hearing about the proposal from City Manager Doug Krieger, but \"is not inclined to support this idea as it is currently imposed,\" President and CEO Nicki Anderson said in an email this week. \"We have a process of vetting, educating and understanding the issues with our membership before making a public position,\" Anderson said. \"Currently we are in discussions with our members about the impacts on local businesses, (and) have discussed the topic with city staff.\", The Naperville Development Partnership also has concerns about the sales tax proposal. Pointing out that the Illinois Department of Revenue has named Naperville as the states second largest generator of retail sales volume, after Chicago, NDP President Christine Jeffries said her organization would prefer a temporary quarter-percent sales tax. She has suggested the income from the more modest tax could be augmented by the city taking in an additional quarter-percent tax, essentially replacing a tax at that rate now collected locally by the state for the DuPage Water Commission that is scheduled to sunset on June 1, 2016. The two new revenue streams, Jeffries said earlier this month, would bring the city $9 million more income annually. Although most other communities with a local tax collect less than the 2.25 percent added to retail purchases in Springfield, Naperville would not have the largest percentage among nearby cities and villages with home rule authority that add a local share to sales taxes. Figures provided by city staff show Downers Grove, Wheaton, Glen Ellyn and Lombard all have a 1 percent tax. Aurora, Warrenville and Elgin add a 1.25 percent local share, the data show, and Bolingbrook and Plainfield have a 1.5 percent village tax. Joliets city sales tax is 1.75 percent. The City Council is scheduled to discuss the possible budget shortfall remedies in a specially called meeting set for Aug. 11. scarlman@tribpub.com , Twitter @scarlman]", "Date": "20150723", "Author": "[Susan Frick Carlman]", "Link": "http://www.chicagotribune.com/suburbs/naperville-sun/news/ct-nvs-chamber-tax-st-0724-20150722-story.html", "Title": "[Chamber studying sales tax hike plan]"}