{"Content": "[Angela McCrovitz is a Gary-area native with strong ties to her community. One grandfather worked at U.S. Steel while the other ran a cafe and, on occasion, cooked for Chicago gangster Al Capone, she said. After a career in pharmaceutical marketing, she turned a job layoff into a new career as a chef. Now 55, Miller resident McCrovitz is taking on the challenge of helping to try to revitalize the Marquette Park pavilion as a public facility. McCrovitz is the head chef for Sweet Revenge, the catering company that handles functions such as weddings, anniversaries and high school reunions that are held there. She said she wants to expand the kind of events to make Marquette Park more of a cultural amenity for the city of Gary. \"Id like to do cooking classes,\" she said, adding she thinks showing people off-beat ways of preparing different types of food could become an attraction for the pavilion. \"It could offer hands-on experience that people would enjoy,\" she said. \"It could be for either adults or children.\", McCrovitz also has ideas of combining cooking with literature, by having classes that read books featuring food, then helping students learn to actually prepare the dishes they read about. She thinks Marquette Park is a wonderful place to have such events, particularly because of work done in recent years to restore the pavilion to its century-old glamour. \"It has a history,\" said McCrovitz. \"It is beautiful architecture, and Im glad to be a part of the program here.\", As for her favorite food, she admits her ethnic heritage (part Italian, with Hungarian, Czech and Greek) makes Italian-style cooking \"natural to me.\" But she says she can cook about any international style, although she said preparing sushi is one item she prefers not to do. \"I can do it, but there are other people out there who can do it better than I do,\" said McCrovitz, who was once a vice president in pharmaceutical marketing until being laid off from her job in the weeks following the Sept. 11, 2001, terrorist attacks at the World Trade Center and the Pentagon. \"A lot of companies cut positions, and I had to reinvent myself,\" she said, adding she turned to cooking for which she feels she has \"a knack.\", She once worked as a food stylist for Better Homes & Gardens magazine, and for a few years was the owner of Angelas Pastry restaurant in the Miller Beach neighborhood until differences with the landlord caused her to close down, she said. Now, she is working as a caterer, as has been an adjunct faculty member for Kendall College in Illinois since 2012, and said she is earning a good-enough living that shes not sure she wants to return to the grind of operating a restaurant. McCrovitz, who for a time lived near Dallas, Texas, and Charleston, S.C. has ideas about a business venture that she thinks would take advantage of one of Northwest Indianas daily features the South Shore commuter rail line that runs from downtown Chicago to South Bend. McCrovitz would like to operate a chain of food trucks that would park near the commuter stations and offer different food options for people looking to catch a train to or from their jobs in Chicago. \"In Miller where I live, you park your car at the station, and about the only place to get any food right there is at McDonalds,\" she said. \"Theres really no place to get a prepared meal, and I think I could offer that service.\", Although she has lived and worked elsewhere for a time during her life, McCrovitz said she is pleased to be back in Gary, because she feels an attachment to the city, and not just because she was born on the same floor of the same hospital as pop singer Michael Jackson; albeit two years later. McCrovitz said she thinks Gary has potential for an economic comeback because of Illinois residents moving to the Hoosier state in search for a place to live with a lesser tax burden. \"They see the housing we have here, and I think it is a chance to take back our city from some of the problems it faces,\" she said. while adding, \"I have faith in the leadership this city has to make worthwhile change.\", Gregory Tejeda is a freelance reporter for the Post-Tribune.]", "Date": "20150813", "Author": "[Gregory Tejeda]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-marquette-park-chef-st-0814-20150813-story.html", "Title": "[Chef, caterer takes on challenge of Marquette Park pavilion]"}