{"Content": "[No more pencils, no more books. No more teachers dirty looks. Usually this is an anthem of celebration, of respite from the angst-inducing strictures of K-12 schooling. But this year, across Kansas, the jingle is coming a little sooner than expected, and with mournful undertones. At least eight Kansas school districts recently announced that theyre starting summer break early this year, and not because kids have already learned so much that they deserve a few extra days off. Its because these schools ran out of money, thanks to state leaders decision to ax education spending midyear to plug an ever-widening hole in their budget. In at least one district, Twin Valley, children are being kicked out two weeks earlier than planned. Haven School District is closing five days early to save an expected $4,000 per day, said Superintendent Rick White, but next year the district will likely shave off 10 days. White told me that members of the school board are also looking for other creative ways to absorb the $750,000 in cuts handed down by the legislature for this year and next. They, and their educators, must continue to find new and innovative ways to do less with less. In balancing the budget on the backs of children, Kansas politicians are behaving shamefully. But they may also be doing the rest of the country a favor, by giving us a preview of what might happen if Republicans control the White House and Congress after the 2016 election. The consequences in Kansas, after all, are a result of fulfilling the great Laffer Curve dream that has Republican presidential hopefuls such as Marco Rubio, Scott Walker and Chris Christie all salivating: dramatic tax cuts, concentrated among those at the top, coupled with the promise that such action will, through trickle-down voodoo, increase tax revenue and boost economic growth. In the real world, politicians rarely get to carry out that budget plan in a big way. Then Republican Kansas Gov. Sam Brownback came along and, with a Republican legislature on his side, passed sweeping tax cuts in 2012. Despite faith-based forecasts promising bountiful revenue, tax receipts have come in, again and again, hundreds of million dollars below projections. The latest estimates leave the state with a $422 million shortfall for the fiscal year beginning July 1. But rather than acknowledging that this tax \"experiment,\" as its been whitewashed, has failed and needs to be reversed, Brownback and Republican legislators have mostly doubled down. To make up for the shortfalls, the state has hacked away at core services, from roads to welfare. Education turned out to be a particularly plum target. Kansas elected officials have a decadeslong history of shortchanging students, and the state has been subjected to multiple lawsuits over whether its funding levels violated the state constitutions requirements for adequate and equitable public education spending. The most recent major case was filed in 2010 that is, before Brownback took office. And although last year the states Supreme Court found school funding levels indeed to be unconstitutional, the state appealed the decision and has since cut funding further. The most recent reductions, announced in March, required districts to absorb an additional $51 million in cuts by the time this fiscal year ends June 30. This time, the cuts were cloaked in a new funding formula called \"block grants,\" which, as I have explained, are just a cowardly tactic for forcing painful funding decisions down the totem pole under the guise of \"flexibility.\" That way school boards, rather than legislators, have to take the heat for making unpopular cuts. For districts, that has meant permanently closing a school here, expanding class sizes there, eliminating a math and science teacher here, maybe instituting pay-to-play athletics there. Teachers in the schools that are closing early are hustling to revamp their curricula so they can still cover all the material the state requires. Students are feeling the heat, too. \"Theres a level of frustration about all the material we have to cram in now,\" Haeli Maas, a 17-year-old junior at Smoky Valley High School in Lindsborg, told me. Maas recently penned an open letter to Brownback pleading with him not to \"write off\" her generation. She didnt mention tax hikes specifically almost none of the students, parents and educators I spoke with volunteered this as a solution without my probing them but she said their necessity is clear. So far, she said, Brownback has not responded. The Washington Post, Catherine Rampell is an opinion columnist at The Washington Post.]", "Date": "20150504", "Author": "[Catherine Rampell]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-education-republicans-kansas-sam-brownback-rubio-walker-christie-perspec-0505-20150504-story.html", "Title": "[Kansas politicians behaving shamefully in front of children ]"}