{"Content": "[Republican presidential candidate Scott Walker on Tuesday offered an alternative to President Barack Obamas health care law that would provide tax credits and restructure Medicaid, and took a swipe at GOP rivals in Congress for their inability to repeal the law. \"Im willing to stand up against anyone, including members of my own party,\" Walker said at Cass Screw Machine Products in suburban Minneapolis. \"Im willing to stand up against anyone to get the job done.\", Walkers proposal calls for repealing the law immediately and replacing it with a plan that gives states more power to operate Medicaid, ties refundable tax credits to age rather than income, and shifts to discretion of states the decision on whether to offer the popular Obama provision that currently allows people up to age 26 to remain on their parents insurance plans. The biggest hurdle facing the Wisconsin governor, and other Republicans calling for repeal, is getting the 60 votes needed in the Senate. The Supreme Court in June also upheld a key component of the law, a major setback for critics fighting it in court. Walker detailed his plans with a slide presentation that mixed policy and politics, seeking both to distinguish himself from Republicans who have failed to eliminate Obamas law, such as Sens. Ted Cruz, Marco Rubio, Rand Paul and Lindsey Graham, and to tie Democratic presidential contender Hillary Rodham Clinton to it. \"We were told by Republican leaders during the campaign last year that we just needed a Republican Senate to repeal Obamacare,\" Walker said. \"Well, here we sit.\", Walkers anti-Washington argument will appeal to conservatives frustrated that Republicans leaders in the House and Senate have not moved fast enough to undo Obamas policies. But the criticism misses the political and institutional reality: Republicans hold 54 Senate seats, short of the 60 needed to break a filibuster, and Obama can veto legislation. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. Of Clinton, he added:, \"As bad as things have been under Obamacare, theyd only get worse under Hillary Clinton,\" Walker said. Clinton took to Twitter to criticize Walkers health care plan. \"16 million Americans have gained health insurance from the Affordable Care Act,\" Clinton tweeted. \"We need to protect it not repeal it.\", Other Democrats were dismissive of Walkers proposal. \"If this vague grab-bag of conservative wish-list items is the best health plan the GOP can come up with for the largest economy on earth, its the clearest signal yet that Republicans like Scott Walker are out of ideas and out of touch,\" said Democratic National Committee spokesman Eric Walker. Walkers plan does not include cost figures or an estimate of the number of people who would be covered, making it nearly impossible to compare with current law. For the period from April to June of this year, 11.4 percent of U.S. adults were uninsured, which translates to about 16 million people gaining coverage since the rollout of Obamas health care law in 2013. Walker said his plan would be paid for by eliminating $1 trillion in taxes that are levied under the current law and by making other changes to Medicaid and how health insurance is taxed. Robert Laszewski, a health care industry consultant and commentator who has been critical of Obamas law, called Walkers proposal naive. \"We need to see the specifics,\" Laszewski said. \"Every regulation that raises one persons insurance costs provides another with a valuable benefit. We need to see who will win and who will lose under Walkers plan.\", Walker isnt the first Republican to put forward a detailed plan for replacing Obamas law. Louisiana Gov. Bobby Jindal released his plan last year and Rubio outlined his approach in an opinion piece published Monday. And while alternatives have been introduced in Congress, none has gotten traction as Republicans have yet to coalesce around any particular idea. Jindal criticized Walkers plan for the age-based tax credit for those who dont have insurance through their employer, calling it \"Obamacare lite.\", \"In a health care plan that is light on specifics, Governor Walker endorsed the fundamental underpinning of Obamacare the notion that America needs another entitlement program,\" Jindal said in a statement. Associated Press]", "Date": "20150818", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-scott-walker-health-care-plan-20150818-story.html", "Title": "[Scott Walker proposes tax credits to replace Obamacare]"}