{"Content": "[Nigerias federal high court Monday ordered drug agents to release a newly elected senator and suspend its extradition proceedings on 20-year-old drug charges related to the TV hit \"Orange Is the New Black.\", It also ordered the withdrawal of armed agents who have besieged the home of Sen.-elect Buruji Kashamu since Saturday. Judge I.N. Buba ordered the federal attorney general and the chairman of the National Drug Law Enforcement Agency to appear in court before noon Tuesday to show why he should not charge them with contempt of court. He said all parties should desist from any action until a court ruling scheduled Wednesday on a previous suit by Kashamu to prevent his extradition. Kashamus spokesman had told The Associated Pressthat the drug agents did not have an arrest warrant. But the agency insists it does have one, according to an email from spokesman Ofoyeju Mitchell. \"The extradition move by the NDLEA for Kashamu to answer drug trafficking charges is legal,\" he said in a statement. \"The Agency has not violated his rights and will continue to work within the confines of the law.\", Drug agents surrounded Kashamus home Saturday, days before senators are to be sworn into the new legislature Friday. The drug agency said he was under house arrest. Kashamus spokesman, Austin Oniyokor, said Kashamu is the victim of a political conspiracy. After years of inaction, the United States has requested his extradition, according to Nigerias drug agency. Asked for comment, a U.S. State Department official told the APthat the department does not comment on law enforcement matters. The moves come as Kashamu is seen to have lost the perceived protection of outgoing President Goodluck Jonathan, who lost March elections. A Chicago grand jury in 1998 indicted Kashamu for conspiracy to import and distribute heroin in the U.S. Prosecutors charge he was the kingpin of a heroin trafficking ring there in the 1990s. Kashamu has said the prosecutors really wanted his dead brother, whom he closely resembled. A previous request to extradite him from Britain failed in 2003. Kashamu spent five years in a British jail before he was freed over uncertainty about his identity. He was carrying $230,000 when he was arrested there. A dozen people long ago pleaded guilty in the case, including Piper Kerman, whose memoir was adapted for the Netflix hit \"Orange Is the New Black.\"Kerman served part of her sentence in federal prison in Chicago. Associated Press]", "Date": "20150525", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-orange-is-the-new-black-kashamu-20150525-story.html", "Title": "[Court orders release of politician wanted in Chicago in 'Orange Is the New Black' case]"}