{"Content": "[Vowing that Islamic State forces are \"going to lose,\" President Barack Obama urged Congress on Wednesday to authorize military action against terrorists who are cutting a swath across the Middle East. Yet he ruled out large-scale U.S. ground combat operations reminiscent of Iraq and Afghanistan. \"Im convinced that the United States should not get dragged back into another prolonged ground war,\" the president said at the White House as he set Congress on a path to its first war-powers vote in 13 years. Despite his words of reassurance, initial reaction in Congress amounted to bipartisan skepticism, with much of the dissatisfaction centered on his attempt to find a political middle ground with respect to ground forces. Republicans expressed unhappiness that he had chosen to exclude any long-term commitment of ground forces, while some Democrats voiced dismay that he had opened the door to deployment at all. Sen. John McCain, R-Ariz. also said Obama had ruled out air support for U.S.-trained rebels battling Syrian President Bashar Assad, adding, \"Thats immoral.\", Under Obamas proposal, the use of military force against Islamic State fighters would be authorized for three years, unbounded by national borders. The fight could be extended to any \"closely related successor entity\" to the Islamic State organization that has overrun parts of Iraq and Syria, imposed a stern form of Sharia law and killed several hostages it has taken, Americans among them. \"Make no mistake. This is a difficult mission,\" Obama said in seeking action against a group that he said threatens Americas own security. He said it will take time to dislodge the terrorists, especially from urban areas. \"But our coalition is on the offensive. ISIL is on the defensive, and ISIL is going to lose.\" ISIL is one acronym for the Islamic State group. The 2002 congressional authorization that preceded the American-led invasion of Iraq would be repealed under the White House proposal, a step some Republicans were unhappy to see. But a separate authorization that was approved by Congress after the Sept. 11, 2001, terror attacks would remain in force, to the consternation of some Democrats. At the heart of the debate, the struggle to define any role for American ground forces is likely to determine the outcome of the administrations request for legislation. White House spokesman Josh Earnest said the proposal was intentionally ambiguous on that point to give the president flexibility, although the approach also was an attempt to bridge a deep divide in Congress. While asking lawmakers to bar long-term, large-scale ground combat operations like those in Afghanistan and Iraq, Obama said he wants the flexibility for ground combat operations \"in other more limited circumstances.\" Those include rescue missions, intelligence collection and the use of special operations forces in possible military action against Islamic State leaders. While he proposed legislation to terminate in three years, Obama said, \"It is not a timetable. It is not announcing that the mission is completed at any given period. What it is saying is that Congress should revisit the issue at the beginning of the next presidents term.\", Whatever the outcome, Obamas request puts Congress on the path toward a vote that could reverberate unpredictably for years. A post-9/11 request from then-President George W. Bush for authorization to use military force against Iraq was intensely controversial, and it played a role in Obamas successful campaign for the White House in 2008. His chief rival for the Democratic nomination, then-New York Sen. Hillary Rodham Clinton, voted in favor of the Bush proposal. Obama, who was not in Congress at the time of the vote, said later he would have opposed it, and he made it an issue in the presidential race. Clinton, who served four years as Obamas secretary of state and is now a likely candidate for president in 2016, had no immediate reaction to the new White House proposal. Lawmakers were not as reticent, although outright supporters of the presidents plan were relatively scarce. House Speaker John Boehner, R-Ohio, expressed doubt it would \"give our military commanders the flexibility and authorities they need to succeed and protect our people.\", He said changes are likely before the measure comes to a vote, although one House committee set an initial hearing for Thursday. Senate Majority Leader Mitch McConnell, R-Ky. like Boehner, said the proposal would receive serious consideration. Democrats had a different reason to question the presidents proposal. The House Democratic leader, Rep. Nancy Pelosi of California, issued a statement that refrained from endorsing Obamas request. It said Congress should act judiciously and promptly to pass legislation \"narrowly tailored\" to the fight against Islamic State fighters. She has said previously she opposes deploying U.S. \"boots on the ground.\", Patrick Leahy of Vermont, the Senates longest-serving Democrat, cautioned that any legislation must be in a form that avoids \"repeating the missteps of the past and that does not result in an open-ended authorization that becomes legal justification for future actions against unknown enemies, in unknown places, at unknown times.\", In a letter to lawmakers accompanying the three-page draft legislation, Obama referred to four American hostages who have died in Islamic State custody at least three of them beheaded. He said the militant group, if left unchecked, \"will pose a threat beyond the Middle East, including to the United States homeland.\", Among the four hostages was Kayla Mueller, a 26-year-old humanitarian worker whose death under unknown circumstances was confirmed Tuesday. In the past, Obama has cited congressional authorizations from 2001 and 2002 to justify his decision to deploy more than 2,700 U.S. troops to train and assist Iraqi security forces and conduct airstrikes against targets in Iraq and Syria. Obama said coalition airstrikes were disrupting terrorist supply lines, destroying their tanks, their barracks, their training grounds and the oil and gas facilities that support their operations. Associated Press]", "Date": "20150211", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-war-authorization-isis-20150211-story.html", "Title": "[Obama asks for fresh war powers, says Islamic State 'going to lose' ]"}