{"Content": "[Every election year, elected officials travel around the state handing out your tax dollars as if they were Santa Claus. They issue news releases and hold press conferences to announce that they, not you, are responsible for state grants to park districts, library districts, school districts, municipalities and all sorts of not-for-profit social service organizations. In effect, they use your money to promote themselves and their re-election campaigns. The power of incumbency is how political pundits refer to it. \"People are pretty much sick and tired of these kinds of activities in Springfield,\" said state Rep. Anthony DeLuca, D-Chicago Heights, explaining why hes the chief sponsor of legislation designed to curtail that sort of political activity. House Bill 113 states that beginning Sept. 1 of the year of a general election and ending the day after the general election \"the proper name or image\" of any state constitutional officer or member of the state legislature \"shall not be included in a public announcement on behalf of an officer, member or state agency related to any contract or grant awarded by a state agency.\" It would be a violation of the State Officials and Employees Ethics Act to do so. \"There is already a law on the books that prohibits us (state legislators) from sending out newsletters or announcements subsidized by the taxpayers that could be interpreted as aiding our political campaigns,\" DeLuca said. \"I look at this as just an extension of that law.\", DeLucas measure was unanimously passed by the House last month, 113-0, but upon its arrival in the Senate it was sent to the executive committee where the chairman, state Sen. Don Harmon, D-Oak Park, sent it to a subcommittee. \"Its been buried in subcommittee for weeks now, and I keep asking when its going to be called for a vote and cant get an answer,\" DeLuca said. \"We only have a few weeks left before the end of the legislative session (in Springfield), and Im afraid this bill is never going to be called out of committee.\", A spokesman for the Democratic Senate leadership said the bill is being held in subcommittee over concerns about the vague term \"public announcement,\" which could be interpreted to mean any announcement from a legislators office about the award of a state grant during the specified time frame. Harmon hopes to talk to DeLuca about what he meant by that language. I would hope thats exactly how it would be interpreted. I believe thats what DeLuca intended, and I think his fears are justified. Im surprised that the measure got this far. Last fall, former Gov. Pat Quinn traveled the state handing out hundreds of millions of dollars in state money between September and early November. Quinn handed out more than $140 million in state grants last October compared with $1.48 million in October 2013, according to one newspaper report. While campaigning for re-election, its something of a tradition for state legislators to put out news releases patting themselves on the back for getting tax money for local projects in their district. The self-promotion often includes a news conference or ribbon cutting with municipal officials from their area, who tell anyone willing to listen how wonderful the state senator or representative has been while holding up the check for news photographers to see. Political opponents as outsiders can criticize state spending and talk about what programs they hope to get passed in Springfield if elected, but its difficult to counter the influence of cash-in-hand and more difficult still to compete with the publicity an incumbent can generate (at taxpayer expense) by passing out those checks. \"It can happen not only weeks before an election, but the day before an election,\" DeLuca said. \"Its become common in recent years for elected officials to time these grant announcements as early voting begins. I think its just wrong and ought to be stopped.\", The legislation isnt perfect. No reform measure ever is, which is why I rarely get as excited as some of my colleagues about efforts at campaign finance reform. Politicians and special interests always find creative ways to violate the intent of such efforts. DeLuca acknowledged that he had to alter the language of his original bill after working out a compromise with the staffs of Gov. Bruce Rauner and House Speaker Michael Madigan, D-Chicago. \"There were concerns with the original language because it would have prohibited elected officials from appearing at any event where a state grant was being awarded after Sept. 1 of an election year,\" DeLuca said. DeLuca said elected leaders worried that if a major federal grant were awarded, especially in combination with state matching funds, that state officials in Illinois would be prohibited from participating in a news conference or having their names mentioned in press releases along with a congressmen or the president. \"So if they want to stand on the stage along with others and get their photograph taken, and if their names are mentioned that would be acceptable under the law, DeLuca said. \"But they cant put out their own news release or use their staffs to promote their role in obtaining the money.\", As I said, there are always loopholes. A shrewd politician could have his staff contact a suburb such as Oak Lawn or Orland Park to notify them that a state grant has been awarded for a road, sewer or water project. And should they consider holding a news conference to announce the grant, the state senator or representative would appreciate it if they mentioned him by name. And if they invited that legislator to appear at a village board meeting so they could shake his hand and get his photograph taken for the village newsletter, well, DeLuca admitted hes not clear if that would technically be a violation of the law. In addition, the law allows state agencies to send out news releases announcing grant awards during the proposed blackout period, although the names of individual legislators or constitutional officers could not be mentioned in those releases. Let me make it clear, however, that I appreciate DeLucas effort to do the right thing and the intent of the law. Taxpayers ought to make it as difficult as possible for elected leaders to use their money to trumpet their achievements in office. And, like I said, it just ticks me off to see all the state grants that get hoarded and released in the weeks leading up to a general election. Quinn touted himself as a champion of political reform. But desperate for votes, he used those state grants to make himself look good and compete with Rauners massive campaign fund. Thats considered smart politics in some circles. I think it illustrates how incumbents come to believe that the states money is their own. I telephoned a number of good government-type groups to ask them what they thought of DeLucas measure, and all of them, to my surprise, said they were unaware of it until my phone call. They all said it sounded like a good idea, while putting in a pitch for their own election reform bills, which would do more to end corruption and make government more transparent. I think DeLucas initiative is simple and to the point. It may not solve the problem, but it would make it clear that such campaigning with public funds is considered unacceptable to the people of this state. Taxpayers should let state Senate President John Cullerton, D-Chicago, Harmon and their senator know they want DeLucas bill called for a vote. It passed with bipartisan support in the House. There wasnt a single \"nay\" vote recorded. Obviously, no legislator wants to be on record opposing this bill, and that in itself says something. Pass the funding announcement blackout bill. pkadner@tribpub.com]", "Date": "20150518", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-blackout-st-0519-20150518-story.html", "Title": "[Kadner: Impose election blackout on grant announcements]"}