{"Content": "[The explanation: It was just a joke among friends, in the privacy of the U.S. Senate Appropriations Committee. \"Hes going to have a rotating first lady. Hes a bro with no ho.\", Illinois Sen. Mark Kirk didnt know the microphone was on when he made the quip about fellow Republican Sen. Lindsey Graham, the South Carolina bachelor who wants to be president. Kirk didnt mean for his words to leave the room. But they did. You dont have to be a woman, an African-American, a single person or a Democrat to be offended by Kirks remarks. Theyre inappropriate, insensitive and a little baffling. What was he thinking?, Kirk is up for re-election next year. His name appears regularly at the top of those most-vulnerable-in-2016 lists. So far, two Democrats have announced plans to run against him. Both are women. One is African-American. Both said Kirks comments show its time for him to go. Not long ago, Kirk stepped in it by saying people \"drive faster through\" black neighborhoods. He was talking to the Peoria Journal-Star about promoting black entrepreneurship, but that message was lost. For Kirk, the episode should have served as a reminder to choose his words carefully. Instead, he repeated the mistake last week, explaining the bro-with-no-ho remark with, \"Thats what wed say on the South Side.\" Yuk yuk. Its natural to wonder whether these lapses in judgment are an effect of the stroke Kirk suffered in 2012. Kirks recovery has been inspiring, but he will need to show voters that his cognitive skills are up to the task of serving in the Senate. Kirk is not the first public figure to be outed by an open mic. In 2008, civil rights leader Jesse Jackson was caught grumbling that presidential hopeful Barack Obama was \"talking down to black people.\", \"I want to cut his nuts out,\" Jackson said. The next year, President Obama called rapper Kanye West \"a jackass\" for interrupting Taylor Swifts acceptance speech at an MTV awards presentation. A nearby mic broadcast the remark. Another microphone picked up former President George W. Bush calling a New York Times reporter a \"major-league (expletive).\", What were they thinking? Like Kirk, they thought nobody was listening. Kirk says he was just backslapping with his friends in Congress. That must make a lot of them cringe. Our advice to Sen. Kirk: Find a microphone. Make sure its on. Apologize. Repeat.]", "Date": "20150614", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-mark-kirk-senate-comment-edit-0615-20150615-story.html", "Title": "[A word to Sen. Mark Kirk: Watch your mouth, bro]"}