{"Content": "[An internal audit, conducted during a contentious board of trustees campaign, found that College of DuPage Chairwoman Katharine Hamilton violated the schools ethics policy by using her position to help political allies win seats on the board, according to a copy of the report obtained by the Tribune. The four-page report found that Hamilton, then vice chairwoman of the board, violated the ethics policy by publicly endorsing candidates and working on their campaigns earlier this year while in her official capacity as a trustee. It cites several instances in which Hamiltons board title was used in campaign literature supporting the \"Clean Slate,\" three candidates hand-picked by Hamilton to help her gain control of the board and oust controversial President Robert Breuder. The report states Hamilton also broke ethics rules when she endorsed the slate Deanne Mazzochi, Frank Napolitano and Charles Bernstein on her public Facebook page, which identifies her as a board member and primarily is used to share college-related items. All three candidates won seats in the April election and, with Hamilton, make up a new majority. Hamilton became chairwoman. \"The review determined that Vice-Chair Kathy Hamilton has been involved in four types of prohibited political activity as defined by (school policy),\" the report says. \"Since the state of Illinois has a similar Ethics law, I recommend you seek legal assistance to determine whether specific state laws were violated.\", Hamilton, in an interview this week, dismissed the findings which the previous board never publicly addressed as an \"absurd,\" politically motivated attempt to thwart her plans for sweeping changes at the states largest community college. The college has been under fire by taxpayers and lawmakers for lavish spending and lax financial oversight under the leadership of Breuder and the prior board. The college ethics policy bars trustees and employees from participating in \"prohibited political activity,\" including seeking contributions for political fundraisers and soliciting votes for candidates in their official capacity, according to legal advice cited in the review. The report, from internal auditor James Martner, was dated March 16 and sent to Breuder. Martner began his investigation of Hamiltons political activity after an allegation she had violated the schools ethics ordinance, according to the audit. At the time, Breuder had become the focus of the campaign, as the majority of 12 candidates criticized his leadership style, spending and $763,000 severance package to leave office in March 2016, three years early. Hamilton the only trustee to vote against the buyout had promised to dismiss Breuder and try to nullify his severance deal if voters elected her slate. Hamiltons term was not up. Besides the chairmanship, the Clean Slates victories put Hamilton in control of a 4-3 majority. The new board immediately voted to place Breuder on paid administrative leave pending the outcome of state and federal criminal investigations. Hamilton backed up her endorsement by contributing nearly $120,000 to the Clean Slate candidates in financial and in-kind donations through both personal funds and her own campaign committees war chest an unusually large amount of money for a community college campaign. Her husband also donated $10,800 to the three hopefuls, according to state board of election records. The report raises no questions about her political donations but instead focuses on several instances in which her name or photograph was used to solicit contributions for the slate or to promote it. In one example, the report references a Facebook page run by former U.S. Rep. Joe Walshs grass-roots group, which posted pictures of Hamilton at a fundraising event for Mazzochi, Napolitano and Bernstein on March 11. It would be difficult to hold Hamilton legally responsible for how other people use her name, title or image, said Kent Redfield, political science professor emeritus at the University of Illinois at Springfield and an expert in the state ethics act upon which the colleges policy is based. However, Hamilton does have an obligation to maintain a clear line between her elected office and political activity, he said. Campaign literature, he added, often includes a footnote saying that the officials title is for identification purposes only and not an endorsement from the government entity the official represents. \"Its best to be as clear as possible,\" Redfield said. \"You have an ethical responsibility to make sure the public understands the difference between you as an elected official and you as an individual.\", Hamilton said she didnt know about the audit until earlier this week and called it a \"smear campaign\" by an administration that she had openly criticized. \"It shows politics gripped College of DuPage leadership prior to the April election and the COD leadership spent tax dollars to hold onto its power,\" Hamilton said. She pointed to a Tribune investigation that found that the college had spent more than $260,000 on \"campaign-style\" mailings to promote the school. Martner also recently performed an audit of the colleges investment portfolio, which found the colleges finance administrators violated school policy by ignoring caps and other restrictions placed on funds.Based on that report, Hamilton supported a decision to place the schools treasurer and controller on leave last week. \"(The colleges administration) gave me no notice about the complaint against me, and it didnt give me an opportunity to tell my side of the story,\" she said. \"Free speech and due process reign at COD as does the entire U.S. Constitution.\", After Martner submitted the report in March, Breuder and the schools legal counsel shared it with then-board Chairwoman Erin Birt. Birt said she was made aware of the ethics complaint after the college already had distributed the agenda for a March 19 board meeting. She said attorneys advised her the board would need to take action before the matter could be referred to the DuPage County states attorneys office. She said she opted not to hold a special board meeting to address the issue and, by the next meeting April 30, Hamilton was the new board chairwoman. \"I didnt want to interfere with the election process,\" Birt said. \"I felt it wasnt appropriate to have a special board meeting to draw attention to this at the time.\", Former Trustee Kim Savage, who lost her re-election bid in April, said she was unaware of the audit but thought during the campaign that Hamiltons actions had crossed the line. She said she was asked to support candidates for other offices during her tenure and always made clear that, as a trustee, she could not make an endorsement. \"It is extremely important that trustees set a positive example by not blatantly disregarding policies,\" she said. jscohen@tribpub.com, sstclair@tribpub.com, Twitter @higherednews, Twitter @stacystclair]", "Date": "20150618", "Author": "[Stacy St. Clair, Jodi S. Cohen]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-college-of-dupage-hamilton-ethics-audit-20150618-story.html", "Title": "[Audit: College of DuPage trustee Hamilton breached ethics policy]"}