{"Content": "[Democratic lawmakers have spent this spring trying to needle Gov. Bruce Rauner, holding hearings and some sham votes on bits and pieces of his \"Turnaround Agenda.\", House Speaker Mike Madigan says hes simply running Rauners ideas up the flagpole to gauge the level of support. Taking them up is \"an accommodation to the governor,\" he says. Theyve been shot down, some in grand style. Madigan set up a vote on a phony version of Rauners right-to-work proposal. The vote was zero yes, 72 no, 37 present. Ha-ha!, Good theater. Well, adequate theater, while nothing else gets done in Springfield. But the Democrats who control Springfield wont go near two of Rauners turnaround proposals. They wont call votes, not even sham votes. That would be the two amendments to the Illinois Constitution that would empower voters to take back their state. One would limit the terms of statewide officers and lawmakers. The other would take the once-a-decade job of redrawing legislative districts away from Madigan and Senate President John Cullerton and assign it to an independent panel. While lawmakers are fussing around on a budget, lets get everybody on the record on term limits and remaps. Lets see where they stand. The Democratic leaders dont want to do that because Illinois voters overwhelmingly support both measures. We know this because theyve said so in poll after poll after poll and because hundreds of thousands of them signed petitions to bring those amendments to a vote in 2014. Rauner bankrolled the effort to pass the term limits measure. The remap amendment was backed by a statewide coalition that has regrouped for another try. Madigans lawyer went to court to get them thrown off the ballot. Both campaigns struggled to defend against Madigans scorched-earth attack. The playbook: Get the state Board of Elections to disqualify hundreds of thousands of signatures. Get the campaign to spend all its money fighting the challenges instead of getting its message to voters. The amendments are a big threat to the status quo, to Madigan and Cullerton. Between them they have more than 80 years in the General Assembly. Longevity is the key to their accumulated power. They call the shots because they control the maps. They draw their own districts, and they draw the districts that protect their members. Thats how theyve built those obedient supermajorities. The maps are so rigged that more than half the races on the November ballot were uncontested. Your elected representatives owe their jobs to Madigan and Cullerton, not to you. And they act like it. If they answered to voters, lawmakers would heed those polls and petitions and put the amendments on the ballot themselves. Theyd spare their constituents the effort and expense of collecting all those signatures and navigating the thicket of case law. All it would take is a three-fifths vote of both houses. If you believe what those lawmakers say at election time, most of them support a fair map and term limits. They support the voters right to amend the constitution. Lets see if they mean it. The amendments are just sitting there. So are lawmakers. Lets have a vote.]", "Date": "20150611", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-remap-term-limits-illinois-edit-0612-20150611-story.html", "Title": "[Who's afraid of empowering the people?]"}