{"Content": "[Religious leaders by turns welcomed or condemned a new Boy Scouts of America decision to allow gay leaders, even as the new policy shifts the decision to local churches that sponsor Scout troops. If churches maintain the ban, the immediate effect on the troops they sponsor could be limited. But Scouting officials and other observers say the move marks a significant turning point in the history of a national institution. The Scouts 2.5 million youth members, ages 7 to 21, are organized into troops or packs that are sponsored by local churches or civic or school groups. Those sponsors choose who leads each unit, and the new Scout policy states that churches \"may continue to use religious beliefs as criteria for selecting adult leaders, including matters of sexuality.\", The Boy Scouts of America has ended its blanket ban on gay adult leaders but will allow church-sponsored Scout units to maintain the exclusion for religious reasons. (AP), The Boy Scouts of America has ended its blanket ban on gay adult leaders but will allow church-sponsored Scout units to maintain the exclusion for religious reasons. (AP), The policy is intended to let members and parents choose local units with similar beliefs, while respecting the right of churches to maintain their own beliefs. Michael Hale, Scout executive for the Northeast Illinois Council, in Lake and northern Cook counties, had advocated for the change. \"I think it will have quite a bit of an effect,\" he said. \"I think its a fairly good-sized step for us.\", But he added that sexual orientation does not typically come up as an issue. \"Our program is not about sexuality; its about building character,\" he said. When the Boy Scouts began accepting gay members in 2013, one church in Crystal Lake dropped its sponsorship. But Hale was not aware of any other charter partners that left. At least one national church, though, now is reconsidering the issue. The Church of Jesus Christ of Latter-day Saints, or Mormon church, which sponsors many Scout troops, released a statement that its members were \"deeply troubled\" by the new policy and will re-examine their association with Scouting. The National Catholic Committee on Scouting issued a statement that its Scout troops will be led by \"faith-filled role models,\" and calling for staying with the Scouts to \"continue this important journey together.\", But President Richard Land of the Southern Evangelical Seminary condemned the Scouts policy. Comparing it to putting heterosexual men in charge of teen girls on overnight camping trips, he predicted that \"tragedy will follow.\", Other church leaders were glad to hear the news. The bishop for the United Methodist Church in northern Illinois, Sally Dyck, wrote in a statement: \"We celebrate this openness toward all who are gifted and qualified to provide leadership.\", Scout officials emphasize that they still conduct criminal background checks on all leaders and require them to undergo training on protecting youth from abuse. \"This decision allows each sponsoring organization to follow their conscience,\" said Randy Hansen, who has volunteered with the Scouts in the northwest suburbs for 20 years. \"But for us in the field, its a non-issue. Ive never heard anyone asked their sexual orientation. We just dont go there.\", Even within one denomination, there may be a variety of responses to the new policy. Marc Ryan, chief operating officer for the Pathway to Adventure Council, which oversees 26,000 Scouts in more than 500 local units in the Chicago area, said that different Roman Catholic parishes have different stances on the issue, but its ultimately the sponsors right and responsibility to approve the leaders. Scott Histed, a committee member with Troop 318 in Orland Park, agreed with the national councils move. \"I believe the Scouts have a marvelous protection policy (for youth) ... and I hope (gay leaders) receive the acceptance I feel they deserve,\" he said. \"This was considered thoughtfully by the national council.\", Civil liberties groups welcomed the change. Ed Yohnka, spokesman for the ACLU of Illinois, said many troops already allowed gay leaders, despite the prior national ban. \"Bottom line is the Boy Scouts are doing the right thing and moving away from discrimination,\" he said. \"The exemptions are troubling but, ultimately, this is an incredibly good thing.\", Sam Sibley said he has worked with gay leaders and Scouts during his 20 years as a scout volunteer in Evanston. He shared a letter he said he wrote to national leaders five years ago, urging an end to the ban. \"It is the quality of the program offered, not the depth of religious belief and intolerance, that determines how well people work together. There is no need to discriminate on race, color, creed, sexual orientation or other such criterion. Scouting is quite able to transcend all of these and be a fun-filled character building association,\" the letter said. A breakaway group, Trail Life USA, expects it may get more members as a result of the new policy. The organization, started in 2014 as a Christian alternative to Scouts, does not accept homosexual leaders and claims 14,000 members. Trail Life Chairman John Stemberger said hes not trying to compete with what he said was once \"an American icon,\" but said hes trying to maintain Christian values rather than \"caving in\" to the changing culture. Pioneer Press reporter Bob Seidenberg and freelance reporter Erin Gallagher contributed. rmccoppin@tribpub.com, Twitter @RobertMcCoppin]", "Date": "20150728", "Author": "[Robert McCoppin]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-boy-scouts-gay-leaders-chicago-met-20150728-story.html", "Title": "[Boy Scouts change to allow gay leaders a step forward, area leaders say]"}