{"Content": "[Theres something the Republican presidential contenders want you to know: You should be TERRIFIED. Your level of fear should be such that no font-size or combination of all-caps letters could possibly capture the sheer garment-soiling sense of horror that fills your mind. Ill let the politicians speak for themselves. Per Sen. Marco Rubios website: \"The world has never been more dangerous than it is today.\", Wisconsin Gov. Scott Walker, discussing terrorism at a recent event in South Carolina: \"Its not a matter of if another attempt is made on American soil, it is when.\", New Jersey Gov. Chris Christie defended domestic surveillance programs this week and said \"you cant enjoy your civil liberties if youre in a coffin.\", And on Monday, Sen. Lindsey Graham explained his presidential aspirations like this: \"I am running because I think the world is falling apart.\", These assertions will undoubtedly play well with voters who make up the Republican base. They seem to love being afraid, perhaps because Fox News is like a fright sprinkler: TYRANNY! EBOLA! (chicka-chicka-chicka-chick) BLACK PANTHERS! SHARIAH LAW! (chicka-chicka-chicka-chick) DEATH PANELS! VOTER FRAUD!, Fear-mongering isnt a new campaign technique, nor is it a tool used only by Republicans. Democrats will undoubtedly paint whoever wins the GOP presidential nomination as an orphan-devouring cross between Ultron and Ebenezer Scrooge. But I worry about the efficacy of this Republican \"the world is collapsing around us\" meme. It will resonate with those who are going to vote for the GOP candidate anyway. But what about people who occasionally step outside the conservative news bubble, particularly younger voters who tend to be more optimistic?, There are, without question, many things to fear in this world. But to say the world is falling apart or that we have never lived in a more dangerous time is completely and demonstrably incorrect. Max Roser, an economist at the Institute for New Economic Thinking at the Oxford University, culled data that tracked, among other things, how the world has changed over decades in terms of violence, education and the number of democratic political systems. He put it all together on a website called ourworldindata.org and what it shows is that the world is considerably safer than it has ever been as well as better educated and more democratic. As Roser wrote last year in an article on the universitys website: \"It is easy to be cynical about the world and to maintain that nothing is ever getting better. But fortunately the empirical evidence contradicts this view.\", Thats a problem for a political party that, at the moment, seems to have the threat of a looming apocalypse as the primary armament in its arsenal. A recent Pew Research Center poll found a sizable disparity between the policy views of people younger than 30 and people 65 and older. The younger respondents considered supporting scientific research a top priority. The older respondents ranked defending against terrorism at the top of the heap, a full 15 percent higher than those under 30. This is a problem for Republican politicians, because when theyre not busy predicting Armageddon they like to relax by making fun of science. Sure, there are other things GOP presidential contenders like Walker and Rubio and Sen. Ted Cruz think we should fear: same-sex marriage, immigrants, Obamacare. But again, none of that scares younger voters. In fact, they tend to support those issues. So if you cant spook them with terrorism and you cant convince them the country is being destroyed by gay people, Mexicans and affordable health care, what will work?, The key, I think, is for Republicans to focus some of their precious voter-scaring time on subjects tailored to terrify a younger demographic. Im talking about things like: slow wireless connections; smartphones with less than a 20-percent charge; and gluten. Since weve established that facts are irrelevant to fear mongering, Ive come up with a few truly terrifying lines that GOP presidential candidates are more than welcome to borrow. \"Its not a matter of if terrorists will come and disrupt Americas Wi-Fi signals, its a matter of when.\", \"Under the Obama administration, smartphone batteries have been losing power at alarming rates. Thats because the president has been taking your hard-earned battery power and redistributing it evenly among all Americans. Can your phone battery afford another four years of power-hungry socialist Democratic rule? No, it cant. And you cant enjoy your phone if its in a phone coffin.\", \"I am running for president because I think the world is falling apart from too much gluten.\", Thats enough to make anyone who doesnt wish it was still the 1950s shudder. Now just feed these issues into the Fox News fright sprinkler, get some younger people to tune in and the election is the GOPs to lose: GLUTEN! (chicka-chicka-chicka-chick) NO WI-FI! (chicka-chicka-chicka-chick) LOW BATTERY!, rhuppke@tribpub.com]", "Date": "20150520", "Author": "[Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-huppke-gop-fear-mongering-20150520-story.html", "Title": "[ GOP candidates want you to be terrified]"}