{"Content": "[Some of you have started to crack under the strain of awarding the Moutza of the Month for May. And I think I understand why. The morons desperate for the ancient Hellenic face-palm come at us in jabbering, idiotic waves, like those relentless fast zombies in \"Game of Thrones.\", \"Maybe its me, but this gets more difficult every month!\" Lisa Schultz cried out on Facebook. Its not you, Lisa. Its the world. Like all the creepy narcissists who think theyre so special, like the baby-rabbit-killing Danish radio host, and Sidney Blumenthal. Or the haters who own the Tampa Bay Lightning. And weve been hit by epidemic outbursts of stupidity, none more stupid than the devil-may-care sky diver who lit his parachute on fire for effect and then went splat on the ground for emphasis (surprise!). No wonder Lisa Schultz is overwhelmed. But Lisa? Theres something we civilized people can do:, We can thrust our open palms at them like the Greeks and say \"Nah!\" (Here!) and \"Parta!\" (Take them!). Consider ABC News Personality George Stephanopoulos. The former Clinton operative hosts the \"This Week\" program on Sundays and \"Good Morning America\" during the week. Stephanopoulos recently interviewed a Clinton critic whod written the book \"Clinton Cash\" on the kinky Clinton Foundation. George was hostile, his tone belittling. While he was beating up the Clinton critic the only thing he forgot to mention to his audience was that he had donated thousands of dollars to The Clinton Foundation. George Stephanopoulos? Parta! Nah and Nah! You understand, dont you? Sure you do. Nah!, Blackhawks fan Larry Lang nominates the Tampa Bay Lightning, playing the Blackhawks in the Stanley Cup finals. In their supreme arrogance, Tampa decided that in certain sections of their publicly owned stadium that Blackhawks fans should not be allowed to wear Blackhawks gear. Really Tampa? Ever read the Constitution?, Feesah (Blow on this). Nah! Feeeesaaaaah!!!!!, Now that Ive calmed down, maybe Blackhawks fans might think about complying with this unconstitutional order. Just take off the jerseys, Blackhawks fans. Take off your pants. Take off all your clothes. Socks, underwear too. Just use a beer cup or three for modesty. And stand there naked in your seats, cheering the Blackhawks, showing Chicago winter bellies and pale Chicago hairy backs and Blackhawks tattoos. Tampa fans will be terrified by the possibility of RST (Random Sweat Transfer). Thatll teach them. Nah!, Reader Andy Cawston wants the May Moutza for James E. Hickey, the 73-year-old who jumped off Idahos Perrine Bridge for a flashy sky-diving stunt. \"Not only did he JUMP off of a perfectly good bridge for no reason,\" wrote Cawston, \"but he lit his own parachute on fire DELIBERATELY, sealing his demise. \"I vote a posthumous Moutza for this imbecile, with a cross-nomination to the Darwin Awards Blow on this, Nah!\", James E. Hickey fell 500 feet to the Snake River. But his fire was so cool. Never speak ill of the dead. But a Moutza isnt dialogue. Its sign language. Nah!, Some want the May Moutza for former U.S. House Speaker Denny Hastert of Illinois. Yes, Hasterts indictment did screw up my schedule so that we ended up giving the May Moutza in June. But he has a criminal case, and besides, there are others deserving Moutzas out there, like the one I give to Comcast Cable. The other night we rented \"Backcountry\" a good, scary movie about a young couple that goes camping. I wont spoil it for you. Its kind of like \"Jaws\" for bears. But the subject is personally compelling. Years ago, my brothers and I had a bear problem up at a remote fly-in camp, with a giant aggressive 500-pound male and we had no gun. So I watched \"Backcountry\" with interest. But at the worst possible time in the movie, it shut down. When we clicked on \"recently viewed\" and tried to restart it, the movie had disappeared completely. Those screams our neighbors heard werent from the couple in the woods. The high pitched one was mine. Comcast Cable, Im so sick of you. Naaaaaaaaiiiieeeeehhh!, Some disagree, including soccer coach Danny Carlino, who warned me away from satellite. \"They all suck and will turn you into creepy Rob Lowe,\" said Carlino. I knew that in his mind, he had already considered a Cool John Kass and a Creepy John Kass. \"All systems fail,\" reasoned Steven Johnson. \"Some more often than others. The real issue is the crap on cable as George Carlin once said, \"Whatever happened to sitting in the backyard with a stick? Just digging a hole with it.\", Stick or no stick, Ill have to call and wait an eternity in Comcast Customer Service Limbo just to beg for my money back. Nahhhhhhhh!!!!!!, CBS newsman Bob Schieffer said the media perhaps gave a pass to President Barack Obama in the 2008 campaign. \"Maybe we were not skeptical enough,\" he said. Really, old man? Speak for yourself. Nahhhh! Parta!!!, \"Moutza worthy?\" asked reader Cristov Dosev. \"This is eligible for Moutza of the decade.\", Perhaps, but were talking about the May Moutza. George Stephanopoulos, you didnt disclose the Clinton Foundation donations. Now, I know that you know Greek customs, patrioti. And you win the May Moutza of the Month! Congratulations. Nahhhh!!!!!!, Note: If you really want to learn how to throw a proper Moutza, join me and Moutza maestros William \"Old School\" Lee and editor Trevor Jensen at 10 a.m. Sunday, June 7, at the Good Eating Tent at Printers Row Lit Fest. Coffee and Moutzas will be served. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150602", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-moutza-met-0603-20150602-column.html", "Title": "[Fake newsman, haters in Tampa and flaming BASE jumpers want a moutza]"}