{"Content": "[Not so fast with those remap \"reform\" petitions. Sure, Illinois needs to change the hyper-partisan way its lawmakers redraw legislative districts every 10 years to reflect population changes recorded by the U.S. Census Bureau. Sure we ought to stop the party in power Democrat or Republican from cramming the other partys voters into as few districts as possible while carefully spreading around the rest to maximize their wins. Last time around, Illinois Democratic cartographers were so good at cramming, spreading and otherwise scaring off prospective opponents that most state legislators ended up running unopposed. Legislators especially need to stop the vicious practice of remapping opponents out of their districts, forcing them to move to a new district or face an incumbent from their own party. With total control over the 2011 remap no coin flip necessary Illinois Democrats worked that stunt on several GOP legislators. Then theres the nonsense of drawing districts that snake around the state like no critter Gov. Elbridge Gerry of Massachusetts could have imagined in 1812, when his name became attached to the dark art of political mapmaking. Gerrymander? Illinois 4th Congressional District looks more like a jagged horseshoe, wending from Chicagos Humboldt Park neighborhood out to the western suburbs, then back to the Pilsen neighborhood. If youre a Hispanic in Cook County and dont live in the 4th District, not to worry. The next remap might give you a chance to re-elect Rep. Luis Gutierrez. But heres the thing: Why should Illinois move unilaterally to install a nonpolitical system for redrawing legislative districts at a time when GOP-dominated states such as Texas, Alabama, Florida and North Carolina are just as twisted toward the Republican side?, Thats why you should think twice before signing the ballot petition being circulated across Illinois calling for a state constitutional amendment that would replace the current system with one less susceptible to partisan bias. Its a complicated fix, but it ultimately would require party leaders to accept a court-appointed and presumably nonpartisan \"master\" who would draw the final map. Sounds great. Whats more, the Independent Map Amendment drive is led by an all-star group of civic leaders, most with innocent intentions. They range from former Gov. Jim Edgar, a Republican, to former White House chief of staff William Daley, a Democrat. My old friend George Ranney, former president of Metropolis 2020 is their senior adviser and former Tribune Co. CEO Dennis FitzSimons chairs the board. Even so, unilateral political disarmament by Illinois is not the way to go. Whats needed is a nationwide fix, preferably one mandated by the U.S. Supreme Court. And that may happen sooner rather than later, what with a handful of state remap cases pending before the high court. Arizona Republicans, for instance, are suing to invalidate a nonpartisan map commission recently established there. A lawsuit out of Texas, a state gerrymandered by Republicans, seeks to tighten the GOPs grip by not counting undocumented immigrants in apportioning districts. Its all very complicated, but keep this in mind when that petition circulator comes calling: Republicans now control the remap apparatus in three times as many states as Democrats by one recent count, 18 versus 6. The rest of the states have set up nonpartisan commissions or were so badly politicized that their districts are drawn by the courts. Make no mistake, remap reform is desperately needed. Many whove studied the problem rightly argue that partisan maps are a root cause of the acrimony and gridlock we see now in Springfield and in Washington. Guaranteed re-election from \"safely drawn\" districts is a death sentence for legislative compromise. But a unilateral move to political neutrality by Illinois? Thats neither fair nor reasonable. Whats needed is a national remap formula that assures multilateral disarmament. Circulate that. John McCarron teaches, consults and writes on urban affairs.]", "Date": "20150628", "Author": "[John McCarron]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-remap-illinois-perspec-0629-20150628-story.html", "Title": "[When the voters really don't matter ]"}