{"Content": "[Mundelein Mayor Steve Lentz believes America is in a moral crisis. He said so during a Fourth of July speech that wound up grabbing headlines, an address that veered from standard patriotic talk into concern about the recent legalization of same-sex marriage by the U.S. Supreme Court and the number of unmarried women having children. Lentz said the courts ruling on same-sex marriage is \"really just one event in a decadeslong adventure in a moral crisis that were in.\" He then said the \"out-of-wedlock birthrate is just crazy high\" and cited rates for black, Hispanic and white mothers that were, respectively, 70 percent, 50 percent and more than 30 percent. \"Our nation is in a moral crisis,\" Lentz said during a ceremony at the Fort Hill Heritage Museum, \"and its something that needs to be talked about more.\", OK. Lets talk about it. I emailed Lentz and asked about the nonmarital birthrates: \"How do you feel about addressing this problem and as you cited with the statistics you used in your speech, its certainly a problem by making birth control more accessible to teenagers and lower-income women?\", I cited a July 5 article in The New York Times about a state program in Colorado that offered teenagers and low-income women \"free intrauterine devices and implants that prevent pregnancy for years.\", Per the story: \"The birthrate among teenagers across the state plunged by 40 percent from 2009 to 2013, while their rate of abortions fell by 42 percent, according to the Colorado Department of Public Health and Environment. There was a similar decline in births for another group particularly vulnerable to unplanned pregnancies: unmarried women under 25 who have not finished high school.\", This is the response I received from Lentz: \"I have no followup comments to my speech other than to ask interested folks to listen to it front to back and judge for themselves.\" (A recording of his speech is available on his Facebook page at http://www.facebook.com/SteveLentzForMayor.), Thats not really talking about it. The implication in the mayors speech and the reason many found it offensive is that same-sex marriage and unmarried women having children is a sign of moral erosion. He cited a long-out-of-print anthropological study from the 1930s that he said found cultures with \"a strict code of marital monogamy, heterosexual marital monogamy\" were the most successful. What Lentz is describing as a moral crisis is really just a changing world. The fact that hes not comfortable with those changes makes them a crisis to him, but not to the broad swath of people he was elected to represent. Many politicians these days are bemoaning our lost morals because they cant accept a world that no longer aligns with their views. Back in March, Sen. Rand Paul, now a GOP presidential candidate, said \"theres also a moral crisis that allows people to think that there would be some sort of other marriage.\", This week, as the South Carolina legislature debated removing the Confederate flag from the statehouse grounds, Republican state Sen. Lee Bright slid off topic and referenced the White House being lit up in rainbow colors after same-sex marriage was legalized: \"I watched the White House be lit up in the abomination colors! It is time for the church to rise up. This nation was founded on Judeo-Christian principles, and they are under assault by men in black robes who were not elected by you.\", Lets look past the fact that not all the people in black robes are men, that the nations founders put those black-robed people there for a reason and that had the same-sex marriage decision gone the other way Lee would have hailed the black-robed people as moral heroes. This legal decision may not jibe with the senators worldview, but perhaps he didnt need to leap right to describing a rainbow as \"the abomination colors.\", Those who frame same-sex marriage as part of a moral crisis need to remember that they dont have to get same-sex married. Their moral crisis is not everyone elses moral crisis. To the Mundelein mayors point on nonmarital birth rates which, according to the Centers for Disease Control and Prevention, have actually declined by 14 percent since peaking in the late 2000s its a nuanced subject that cant be addressed by a woe-is-us mention of morality and the citation of an old study. What Lentz and others who use the moral crisis trope are effectively saying is: \"If everyone would just believe what I believe, then everything would be fine.\", Thats not going to happen. And even if it did, everything wouldnt be fine. You can believe that gay people didnt exist and teens didnt get pregnant back in the good old days all you want, but thats nonsense. Were there lower rates of unmarried mothers? Yes, but women had less ability to make decisions for themselves and sexuality in general was unhealthily repressed. Giving people easy access to contraception and sex education that goes well beyond teaching abstinence can help what Lentz describes as a crisis. And doing so, as with same-sex marriage, doesnt mean people who morally oppose it have to take part. Would he support such an approach? I dont know. He didnt want to talk about it, despite insisting the nations moral crisis was \"something that needs to be talked about more.\", rhuppke@tribpub.com]", "Date": "20150708", "Author": "[Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-huppke-mundelein-mayor-20150708-story.html", "Title": "[Mundelein mayor's moral crisis isn't everyone's]"}