{"Content": "[Democrat Gov. Pat Quinn isnt leaving office without waging at least one more battle against Republican successor Bruce Rauner, ordering lawmakers on Thursday to return to Springfield Jan. 8 to decide whether voters should get to pick a new comptroller in 2016 following the death of Judy Baar Topinka. If the Democrat-controlled General Assembly goes along with the idea of a special election, it could have the effect of limiting Rauners pick to replace Topinka to just two years in office instead of the full four-year term. Topinka, a Republican, was to begin a second term in office Jan. 12, but died last week from complications of a stroke. Her death so close to the swearing-in ceremony has sparked a host of legal questions that have yet to be tested regarding Illinois succession provisions. Quinns special session move comes after Attorney General Lisa Madigan issued a legal analysis Monday in which she said Topinkas death created two vacancies one for the remaining weeks of her current term that could be filled by Quinn, and a second for the term beginning Jan. 12 that could be filled by Rauner. However, the attorney general also argued that lawmakers should pass a measure that would allow voters to pick a new comptroller during the next statewide election in 2016, saying it is undemocratic for someone to be appointed to a four-year term. Judy Baar Topinkas passing has not only left us heartbroken the people of Illinois have been left without their elected representative in the comptrollers office, Quinn said in a statement released Thursday. Nobody but Judy Baar Topinka was elected to do this job. Thats why its so important that voters have the soonest possible opportunity to elect their comptroller. Holding a special election is the right thing to do. Quinns push for a special election also serves a political purpose 2016 is a presidential election year, which is usually more favorable to Democratic candidates in Illinois. Gathering lawmakers at the Capitol just days before Rauner and a new crop of legislators are scheduled to be sworn in also would give Quinn a last-ditch chance to raise the states minimum wage before he leaves office, an effort that fizzled during the fall. The early return may provide more show than substance, however. While Senate President John Cullerton supports Quinns comptroller efforts, powerful House Speaker Michael Madigan maintains the best way to fill Topinkas spot is for Quinn and Rauner to come to an agreement without the help of lawmakers. Its an executive branch matter, and we hope the governor and the governor-elect work together on a sensible solution, Madigan spokesman Steve Brown said. Rauner and Republican legislative leaders have dismissed the need for a special election to fill a portion of Topinkas term, saying the constitution makes clear his ability to appoint someone to fill the vacancy for four years. A Rauner spokesman said Thursday that any attempts to undermine that ability could result in costly litigation and uncertainty for Illinois taxpayers. Additionally, any major change like this should apply to all future vacancies and be carefully and thoughtfully discussed not rushed through in a last minute special session that would look overtly political, Rauner spokesman Mike Schrimpf said in a statement. If lawmakers do sign off on a special election, it sets the stage for Illinois to have up to three different comptrollers from now until 2018, though the issue is far from resolved. Quinn has yet to name someone to take up Topinkas post. On Thursday, aides would say only that an announcement will be coming soon. mcgarcia@tribpub.com@moniquegarcia]", "Date": "20141218", "Author": "[Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-quinn-wants-special-election-in-2016-on-topinka-vacancy-20141218-story.html", "Title": "[Quinn wants special election in 2016 on Topinka vacancy]"}