{"Content": "[First, the good news: It turns out President Barack Obama was right. Al-Qaida is being destroyed. One could even say he deserves some credit for this happy turn of events. Which brings us to the bad news: Al-Qaida is dying out because its being replaced by something far worse. According to a fascinating report in The Guardian newspaper, two of al-Qaidas leading clerics say that the Islamic State has all but destroyed its parent organization. Basically, people in the market for jihad think the Islamic State offers the best product on the market. Its ironic. For a decade, terror analysts marveled about how creative al-Qaida was. Lawrence Wright in his gripping account of the rise of al-Qaida, The Looming Tower, writes that Osama bin Laden and Ayman al Zawahiri deliberately set out to bring the best practices of the business world to religiously fueled terror and carnage. Al-Qaidas jihadis got paid vacations, round-trip tickets home to visit family, health care, etc. They saved huge money on retirement gifts, since Allah promised to provide 72 virgins at the end of a productive career in lieu of a gold watch. Among al-Qaidas biggest innovations: franchising. A 2003 Washington Post headline put it well: Terrorism Inc.; Al-Qaida Franchises Brand of Violence to Groups Across World. Like the McDonalds home office, al-Qaida HQ would help start-ups with branding, training and marketing and then let them do their thing. Back in 2003, that model was working well for the organization. A senior U.S. official told the Post that al-Qaidas children were growing up and moving out into the world, loyal to their parents but no longer reliant on them. And theres the rub. Not all kids are loyal. The al-Qaida franchise in Iraq was always too much of an innovator for al-Qaidas executive leadership. Abu Musab al-Zarqawi, the Jordanian head of the outfit, refused to protect the brand. Al-Qaida proper was in the war-on-America business. But while Zarqawi had no qualms about killing Americans, he thought there was room to grow in not just robbery, but in extortion and religiously motivated slaughter. When he started killing Iraqi Shiites in huge numbers, Ayman Zawahiri, then al-Qaidas number two man, sent Zarqawi a letter that amounted to a reprimand from the home office, Why were there attacks on ordinary Shia? he asked. Al-Qaida wanted a pan-Islamic caliphate. Slaughtering Shiite civilians was a violation of this strategic plan. But Zawahiris letter was telling for another reason: He asked the Iraq franchise to share more of its profits. Fast forward to today. The Islamic State, which grew out of Zarqawis dissident franchise, is gobbling up market share. Having declared it wants a monopoly on jihadist terror wherever it operates, it recently beheaded 10 members of the Taliban. There are many reasons for the Islamic States success. But one crucial factor was Obamas decision to pull U.S. troops out of Iraq in 2011. He spent the next few years dismissing it as the jayvee team so he could brag about decimating al-Qaida. Now that the Islamic State is encircling Baghdad, the president wants to replicate the surge but on the cheap. Last week he said he wants to send a few hundred advisers to stand up National Guard Units to help Sunni communities secure their own freedom from ISILs control. Sunni tribes helped make the Anbar Awakening possible. Theres little reason for confidence this will work, given the fact that the Sunni tribes have little reason to trust the U.S. after having been abandoned once already. The fact that Obama is seen to favor Iran and the Shia makes trust even more difficult. But as disastrous as the presidents mishandling has been, its important to note that extremists arent flocking to fight with the Islamic State because of anything he has done or said. They are flocking to the Islamic State because it has, for all its twisted cruelty and evil, a much more compelling marketing campaign than al-Qaida. Al-Qaida was stodgy and abstract. The Islamic State is exciting and even fun, at least for a certain kind of fanatic. The reports describing and viral videos showing young men ransacking and pillaging, riding cars wherever they want and buying sex slaves for as cheap as a pack of cigarettes are intoxicating for those who want to join an Islamic foreign legion for losers. Add in religious fervor and, most important, the justifiable sense that the Islamic State is winning, and you can see why al-Qaida was a victim of what economists call creative destruction. Tribune Content Agency, Jonah Goldberg is an editor-at-large of National Review Online and a visiting fellow at the American Enterprise Institute. JonahsColumn@aol.com]", "Date": "20150612", "Author": "[Jonah Goldberg]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-isis-al-qaida-marketing-strategy-20150612-column.html", "Title": "[ISIS beat al-Qaida with its marketing plan]"}