{"Content": "[Police and fire union leaders are responding skeptically to the Matteson Village Boards decision Monday night to not lay off employees, including police and firefighters, at least for now, in reducing the villages large budget deficit. After a 45-minute closed session trustees voted 4-2 to pursue other cost-cutting measures rather than layoffs. Matteson faces a substantial budget shortfall, though village officials have cited widely differing figures. Village Administrator Brian Mitchell has said it amounts to about $8 million, but Trustee Kevin Little cited a $5 million figure Monday night. Mayor Andre Ashmore opened the meeting by telling a crowd of about 60 residents and employees that he was opposed to laying off workers, particularly public safety employees. He cited a surge in armed robberies during the past three weeks, including one in which the robber fired shots into the air, and said the holdups might have resulted from rumors that the village already had laid off police. Ashmore also said he understands what it means to be laid off, having lost his job as a policy advisor in the Department of Commerce and Economic Opportunity now that Bruce Rauner is governor. In his opening comments, Ashmore suggested several possible alternatives to layoffs tor educe expenses, including collecting selling the village water system to a private utility and obtaining home-rule taxing powers via referendum. Leaders of the fire and police unions welcomed the boards decision Monday night but said it didnt mean that layoffs would not occur later. \"They didnt withdraw the notice of intent to lay off,\" police union President Robert Wilson said. \"If they were going to withdraw, theyd have to notify the union. ... At the next board meeting, they could give direction to lay off employees. ... From the unions perspective, they still plan to go ahead with the layoffs. Its just been delayed.\", Matteson Firefighters Association President Scott Gilliam said the vote ultimately has little impact on whether employees would be laid off. Wilson said about all village employees got out of Mondays vote was that two trustees, Sheila Chalmers-Currin and Veloid Cotton Sr. are on record as being in favor of layoffs. Voting to avoid layoffs were trustees Sam Brown, Paula Farr, Kevin Little and Bridget Yancey. Little was the lone trustee to publicly support Ashmores approach, but he acknowledged that laying off employees was consistent with the villages \"fiduciary responsibility\" to eliminate the budget deficit. He said trustees must balance that responsibility against the detrimental effect of layoffs on village services and the workers quality of life. Dennis Sullivan is a freelance reporter.]", "Date": "20150303", "Author": "[Dennis Sullivan]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-matteson-layoffs-st-0304-20150303-story.html", "Title": "[Matteson to avoid employee layoffs, for now]"}