{"Content": "[Dozens of health insurers say higher-than-expected care costs and other expenses blindsided them this year, and theyre going to have to hike premiums for individual policies well-beyond 10 percent for 2016. The proposed double-digit hikes would apply to plans sold on the health insurance exchanges created under President Barack Obamas law, as well as individual coverage sold through brokers and agents. Insurers point to costs from customers they gained under the health care overhauls coverage expansion and the rising expense of prescription drugs among other reasons for their planned increases, according to preliminary rate information released Monday on the federal governments HealthCare.gov website. Blue Cross and Blue Shield of North Carolina is seeking a roughly 26 percent premium increase, while plans in Illinois and Florida, among other states, are asking for hikes of 20 percent or more. Individual health insurance policies are a relatively small slice of the overall market. Many more people are insured through an employer. And it is not clear whether any of these preliminary rate hikes will stick. Regulators in many states have the power to reject price increases, and many who dont are expected to at least pressure insurers to soften their plans. Health insurance price hikes have been the subject of growing scrutiny for years. Health insurance experts say its tough to draw broad conclusions about prices from the requests released Monday. The health care law only requires insurers to report proposed hikes of 10 percent or more. Thats only a partial picture of the market that tilts toward a worst-case scenario. \"Its hard to generalize, but that said, I think all signs are pointing to bigger premium increases than in 2015,\" said Larry Levitt of the nonpartisan Kaiser Family Foundation, a clearinghouse for information on the health care system. Levitt said part of the reason is that insurers will be basing their 2016 premiums on a full years worth of cost or claims data. Thats the first time that has happened for plans sold on the overhauls public insurance exchanges, which started enrolling customers in the fall of 2013. \"Its hard to generalize, but that said, I think all signs are pointing to bigger premium increases than in 2015,\" said Larry Levitt of the nonpartisan Kaiser Family Foundation, a clearinghouse for information on the health care system. Levitt said part of the reason is that insurers will be basing their 2016 premiums on a full years worth of cost or claims data. Thats the first time that has happened for plans sold on the overhauls public insurance exchanges, which started enrolling customers in the fall of 2013. Rates for 2015, for instance, were set based on only a few months of data collected last spring. Insurers normally want to see a couple years of claims from a patient population before they set rates. Higher-than-expected costs were the main reason behind the hike sought by Blue Cross and Blue Shield of North Carolina, which was allowed to impose a 13.5 percent increase for this year. The insurer cited the costs of emergency room use, heart and cancer treatments and the cost of specialty drugs treating hepatitis C in its rate justification filed with federal regulators. Some insurers may be seeking what seems like a sizeable rate increase because they charged much less than the competition for this year, said Catherine Murphy-Barron, vice president of health with the American Academy of Actuaries. \"The increase is not the right thing to be looking at, its the general level of the premiums of everyone in that market at that tier,\" she said. Insurers will spend the next several weeks talking to regulators about their premiums before rates are finalized later this summer. The companies will have better data to back up their request for hikes, but that might mean little if they are negotiating with a regulator determined to hold down prices, said Dave Axene of the Society of Actuaries. \"Even if you have all the evidence in the world, its not a friendly environment at times,\" said Axene, an actuary who helped insurers in several states set prices for 2016. Consumers should start learning how rates may change for their specific plan by early October. That will give them several weeks to shop for the best deal before Nov. 15, which is when people can start signing up for coverage. Associated Press]", "Date": "20150601", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-health-insurance-prices-20150601-story.html", "Title": "[Many health insurers go big with initial 2016 rate requests ]"}