{"Content": "[Rachel Dolezal, the civil rights activist who rose to prominence as a black woman but was unmasked last week as white, said on Monday she would step down as head of the local NAACP chapter, citing concern that the controversy was hampering the groups larger mission. In a message posted on the organizations Facebook page, Dolezal, a blue-eyed blonde from western Montana, did not explain why she had dyed her hair, darkened her skin and misrepresented herself as a mixed-race black woman for much of the past decade. \"While challenging the construct of race is at the core of evolving human consciousness, we can NOT afford to lose sight of the (broader social issues) that affect millions, often with a life or death outcome,\" wrote Dolezal, 37. \"This is not about me. Its about justice.\", Whatever her intentions, Dolezal touched off a contentious national debate about race, what exactly it is and whether it even exists. In interviews, Dolezal said she considers herself to be black, and she described choosing the black community over white culture during her college years in Mississippi. \"You choose a side,\" Dolezal said in an interview last year with an Eastern Washington University student that was posted online. \"You can kind of be a bridge, but pretty much you have a home one place or another. And in Mississippi, white culture I didnt feel at home there at all.\", There is a long history of black people \"passing\" as white in America. Famously, an early NAACP president, Walter White, identified as black but let his blonde hair and blue eyes protect him when investigating hate crimes and lynchings in the South. While not unprecedented, Dolezals story revealed that America has never agreed on language to describe the reverse phenomenon. While few doubt Dolezals commitment to civil rights, questions remain: Is being black as easy as just saying you are? And if not, why not?, \"Dolezal has been dressed precisely as we all are, in a fictive garb of race whose determinations are as arbitrary as they are damaging,\" wrote Jelani Cobb, a history professor and director of the University of Connecticuts Africana Studies Institute. \"If blackness is simply a matter of a preponderance of African ancestry, then we should set about the task of excising a great deal of the canon of black history,\" he added \"up to and including the current President.\", Prominent members of Spokanes black community reacted with relief to Dolezals resignation, but they also expressed concern for a woman they had considered a friend. \"Thats what a real leader would do that cares about the community,\" education activist Kitara McClure said of Dolezals decision to resign. But, McClure added: \"It makes me feel sad that she went to those lengths to get attention.\", In this isolated and overwhelmingly white city on the high plateau of eastern Washington, the Dolezal scandal had left many people mortified and confused. Three stitched-together images of Dolezals many changing looks rocketed across social media in recent days. The caption: \"Spokane doesnt always make national news. But when we do, its really embarrassing.\", In the lush, progressive Northwest, Spokane is often a punch line the capital of the strange, the scary and the broken. A mayor was outed as gay and recalled from office. A white supremacist planted a bomb at the annual Martin Luther King Jr. parade. Before Ferguson or Baltimore, a Spokane police officer was found guilty of beating a disabled man to death and a courtroom of uniformed cops stood to salute him. \"Were a super white city,\" said Larry Cebula, a history professor at Eastern Washington University, where Dolezal has taught in the Africana Education program. \"Someone like Rachel could put on blackface, basically, and fool everyone.\", In a place desperate for progress and aching for heroes, Cebula said, \"We wanted to believe it.\", Just 2.3 percent of Spokanes 200,000 residents are black, compared with about 13 percent nationwide. Still, the city has a long history of black leadership, of \"black people persevering, black people challenging racism. Black people thriving. Black people committed to the struggle,\" said Dwayne Mack, author of the book \"Black Spokane: The Civil Rights Struggle in the Inland Northwest.\", The first black man arrived here in 1878 and by 1896 was elected to the city council. In the 1930s, the Negro Active League published a manifesto holding local blacks to high standards of education and admonishing layabouts and complainers. In 1981, the city elected a black mayor, James Everett Chase, who notably refused to ban a rally by the white-supremacist organization Aryan Nations, based in nearby Idaho. It was this legacy of progress and achievement that Dolezal stepped forward to inherit when she unexpectedly was elected president of the Spokane NAACP in November. On the day her scandal made international headlines, Dolezal smiled out from local newsstands, the cover girl for this months issue of the Inland Business Catalyst. A column she wrote titled \"Forever Free\" led the pages of the local weekly newspaper. In Spokane, Dolezals voice was loud. Few black leaders have been willing to discuss the scandal. This weekend, during Sunday services at Calvary Baptist Church, the citys oldest black congregation, the minister shooed away television cameras. Some members of Spokanes black community fretted to a reporter that they might sound racist if they tried to address it. Others privately cheered Dolezal, saying if she wanted to be black, well, then, \"go, girl.\" All said they wanted the truth from a woman who on Monday laid legitimate claim to having revitalized Spokanes 95-year-old NAACP chapter. \"Because (she) chose to be deceitful, everything, regardless of the good its done, is thrown into question,\" said Francell Daubert, a videographer whose grandfather was an early black leader here. In interviews, those who knew Dolezal painted her as a gifted artist and hairdresser with a flair for self-invention. No one could explain what inspired her to lie outright about her race. But with each passing year, they said, her biography seemed to grow more twisted. In 2013, she told the Eastern Washington University student newspaper that she was born in a teepee, hunted food with a bow and was beaten by her parents with a \"baboon whip.\", Born in Troy, Montana, on Nov. 12, 1977, to conservative white Christian missionaries, Dolezal had one sibling, a brother Joshua, until she was 16 years old. Then in 1993, the Dolezals began adopting four black children: Zach from Haiti and Ezra, Izaiah and Esther from elsewhere in the United States. After graduating from high school in 1995, Dolezal attended Belhaven University in Jackson, Mississippi, where she participated in Voice of Calvary, a \"racial reconciliation community development project where blacks and whites lived together,\" her father said. She later received a masters of fine art from Howard University. Ironically, the Smoking Gun reported on Monday, Dolezal sued Howard in 2002, charging that the historically black school had discriminated against her because she was white, removing her art from an exhibition \"to favor African American students.\", In 2000, Dolezal married a black man, Kevin Moore, whom she met in Jackson. They had a son, but the marriage fizzled after they moved in 2004 to Bonners Ferry, in northern Idaho. Reached by phone, Moore declined to comment. By 2005, Dolezal was divorced and living in Coeur dAlene, Idaho, where she worked as an artist, according to local newspaper stories. Her racial transformation began soon after; by 2009, she was identifying as a black woman, living in Spokane and teaching in the Africana Education program at Eastern Washington University. Her students loved her. \"Its like she took this big stamp of validation and slapped it down and said, Yeah, you can do all these things. And, yes, youre beautiful, and yes, youre intelligent,\" said Tamara Wright Chavez, 39. \"Regardless of what Rachel Dolezals ethnicity is, the one thing I know for certain? She had unquestionably positive impacts on my education and my own self-image as a black woman,\" said Jaclyn Archer, 23. The university no longer lists Dolezal on its website, but she taught there this spring. By 2010, Dolezal was using her new image to seek the spotlight. She was elected president of the NAACP last November, beating out the incumbent, a black man named James Wilburn. Dolezal quickly raised money, moved the chapter office from a low-income black neighborhood to a shiny downtown office, and established herself as a dynamic leader in a chapter that had lost some prominence. Then came the scandal. Late Monday, Dolezal boarded a plane for New York, where she was scheduled to give an exclusive interview on the \"Today\" show. She skipped an NAACP meeting where she had been asked to explain herself. \"The worst part about what Rachel did was going and acting like she can understand what it means to be black,\" her youngest brother, Zach Dolezal said, adding that her charade should have ended when a TV reporter asked her last week whether she was African American. When someone asks, \"Are you black? Or are you white?\" Zach Dolezal said, \"thats when you say yes or no. \", ---, Phillip reported from Washington, Susan Svrluga and Alice Crites contributed from Washington.]", "Date": "20150615", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/nationworld/ct-naacp-leader-rachel-dolezal-resigns-20150615-story.html", "Title": "[NAACP leader Rachel Dolezal resigns amid furor over racial identity ]"}