{"Content": "[At the heart of a once-bustling neighborhood known as Uptown, a large, shuttered-for-decades theater sits amid pawnshops, beauty parlors, a used bookstore, a nearby old theater and empty storefronts. Then the theater reopens, the Uptown arts and entertainment district is launched, crowds flock to nearby restaurants, bars and other attractions, and the city reaps the economic benefits of a newly hot destination spot. Many Chicagoans, businesspeople and officials would love to see this scenario played out in the North Side neighborhood that houses the Uptown Theatre, which will mark its 90th birthday on Aug. 18 but hasnt hosted a public event since the J. Geils Band played there Dec. 19, 1981. The once-shuttered Fox Theater in Oakland, Calif. has been an economic engine for its downtown community since it reopened a few years ago. Developers say the same thing could happen if Chicagos Uptown Theatre ever reopens. (Jose M. Osorio, Chicago Tribune), The once-shuttered Fox Theater in Oakland, Calif. has been an economic engine for its downtown community since it reopened a few years ago. Developers say the same thing could happen if Chicagos Uptown Theatre ever reopens. (Jose M. Osorio, Chicago Tribune), Yet the above description actually applies to Oakland, which saw its Uptown arts and entertainment district jump-started by the 2009 opening of the Fox Theater more than 40 years after that old movie palace had hosted its last screening. The Foxs revamp fit into a larger strategy spearheaded by then-Mayor Jerry Brown, now Californias governor, to boost downtown Oaklands population and economic viability. The reopening of the theater, which hosts about 100 live events a year and has the Oakland School for the Arts as a tenant, is widely credited as a catalyst for the neighborhoods change. \"Since the Fox opened weve had about 200 ground-floor storefronts just within the core downtown area open, and many of these businesses are trying to locate around the arts and entertainment district and be as close to the Fox and the (nearby) Paramount Theatre as possible,\" said Steve Snider, district manager of Oaklands Uptown and Downtown community benefit districts. Such districts have become increasingly vital to cities and regions striving for global reach and the dollars of tourists. The success of Oaklands Uptown, which is what the northern part of its downtown is called, has registered in Chicago, and Bay Area developer Phil Tagami, who oversaw the Foxs $74 million redo, was hired as a consultant on a prospective Uptown Theatre restoration. Tagami understands the rewards of a newly reopened theater drawing from near and far. \"Its an amazing benefit to the city hotel rooms, of course restaurants and then a bunch of bar activity after the show,\" he said. Green Day has played at the Brahmin temple-inspired Fox and bassist Mike Dirnt opened his second Rudys Cant Fail Cafe on its ground floor while other headliners have included Bob Dylan, Paul Simon, My Morning Jacket and, on back-to-back nights in late July, young British popster Charli XCX and vintage grunge rockers Alice in Chains. During the day a soundtrack of buzz saws and jackhammers signals the repurposing of vintage, vacated buildings for new residential tenants, tech offices, hotels and restaurants as well as the transformation of formerly gritty intersections into lounge-worthy public spaces. \"This is the most active, hippest part of town,\" said real estate developer Drew Haydel, whose Lane Partners plans to remake a 1929, 350,000-square-foot building that recently housed Sears on its ground floors but has been unoccupied on the upper floors for more than a decade. For Haydels Menlo Park, Calif.-based company, such an investment slated to include office space to cater to the Bay Areas booming tech scene, along with a high-end food hall would not have been in the cards before the Fox opened. \"Theres no doubt that the Fox Theater is a big part of what contributes to that vibrancy,\" Haydel said. Jerry Mickelson, principal and co-founder of longtime Chicago concert promoter Jam Productions, has taken note. \"You go there, and its really amazing, and I would expect the same thing to happen here,\" he said. Actually, he has banked on that happening. In 2008 Mickelson and Jam partner Arny Granat formed a spinoff company, UTA II, to buy the Uptown Theatre out of bankruptcy for a reported $3.2 million. In 2011, there was much optimism for the neighborhoods prospects after Mayor Rahm Emanuel took office and called for the creation of an Uptown music district, a proposal that echoed a 2000 Urban Land Institute report envisioning the theater as the \"crown jewel\" in an Uptown Entertainment District. The Lawrence Avenue/Broadway nexus already boasts such long-standing music venues as the Aragon Ballroom, the Riviera Theatre and the Green Mill jazz club. Throw in the massive, supremely ornate Uptown Theatre, which opened in 1925 touting its \"acre of seats in a magic city\" (numerical translation: 4,381), and the neighborhood might reach its potential as a hot destination point that draws from around and outside the city. \"It can happen now because people are finally seeing the intertwined connection between culture and economic development,\" Emanuel said in a 2011 Tribune interview. Four years later that connection is being forged elsewhere. On a relatively undeveloped stretch of Flatbush Avenue in Brooklyn, N.Y. the Kings Theatre, a 1929 movie palace from Uptown Theatre architects Rapp and Rapp, reopened in February with a Diana Ross concert. The Kings had been closed for 37 years, and the price tag on its refurbishment was about $95 million, $52.5 million provided by New York City, which owns the property, said New York City Economic Development Corp. Senior Vice President Christina DeRose. \"It was this opportunity to create a new economic driver for the neighborhood,\" DeRose said. A new Gap Factory Store now sits across the street, and a boutique hotel and gym are on their way. The Uptown Theatre, meanwhile, remains boarded-up, a mass of dead energy at the neighborhoods epicenter. Outside and inside, the theater looks pretty much the same as when Emanuel was first elected, which is to say that its beautiful and in desperate need of some pricey bodywork. Mickelson estimated that the cost to maintain the landmark structure has been about $500,000 a year and even so, his company has been in Cook County Circuit Court with some regularity so the city can monitor its condition. Between 1975 and 1981, Jam Productions presented Uptown concerts by such artists as the Grateful Dead, Bruce Springsteen and the E Street Band and Bob Marley and the Wailers, but the partners had little clue how long it might take to get the place reopened. \"When we bought it, the economy tanked,\" Mickelson said while guiding a walk-through of the building last month. \"But I didnt put a timetable on it. I just knew it needed to be saved.\", Heres what needed saving:, Covering 46,000 square feet, the Uptown Theatre was built to be the largest, most lavish theater yet from Balaban & Katz, the company that was already operating such Rapp and Rapp-designed movie palaces as the Loops Chicago Theatre, the South Sides Tivoli, the West Sides Central Park and the North Sides Riviera. The gracefully raked auditorium, with its red-glowing dome ringed by griffin and king figures, boasts a higher capacity than just about any movie palace outside Radio City Music Hall. And the stunning, marble-floored front lobby with its eye-catching gargoyles, frescoes, torchiers and 24-karat gold and silver leaf designs and other public spaces are so generously proportioned that the theater touted being able to turn over its entire capacity in just 16 minutes. \"We think that once this Uptown Theatre is done, that people not only from all over the city but certainly the surrounding suburbs would come to it,\" said Ald. James Cappleman, whose 46th Ward includes the venue. \"And people coming from other parts of the country and other parts of the world would want to visit it because its so grand. A theater like this will never be built like this again, ever.\", Choose Chicago, the citys tourism arm, has been working on plan to attract visitors to Uptown, with Jason Lesniewicz, the organizations cultural tourism and neighborhoods manager, envisioning a reopened Uptown as \"a major draw\" in a city known for its architecture. The local architecture firm Booth Hansen issued a feasibility study in 2009 estimating that the building, which experienced flooding and other damage over the years, would require about $55 million to become operational again and close to $71 million to be restored completely. The price now is widely assumed to be higher. Mickelson has been seeking the right combination of private investments and city, state and national funds and tax credits to cover these costs no easy feat. So he flew out to Oakland and met with Tagami, who pulled together 27 funding sources, along with hundreds of charitable donations, to restore the Fox. That theater like the Kings and unlike the Uptown was city-owned. Tagami initially declined Mickelsons invitation to join the project, but \"I fell in love when I saw the theater,\" he said. \"Its gorgeous.\", Over dinner at an upscale restaurant near the Fox, Tagami continued: \"The Uptown is 10 times nicer than the Fox was when we started. The Fox was undescribable. A third of the ceiling was missing. Mushrooms the size of this table were growing in the building. There were 22 homeless people living there. Thered been a fire in half the building, so it had been kind of burned out upstairs.\", Tagami said he worked with Mickelson on the Uptown for 18 months but isnt actively involved now, though he said hed be happy to help again if the right conditions were met to move the project forward. Among them: getting investors, stakeholders and the city all on the same page and timetable. Tagami considered Emanuel to be in the pro-Uptown camp, with qualifications. \"He didnt say no,\" Tagami said. \"He said, Well get there. He said, I like the theater, its very interesting, but I have other things that are pressing.\", Emanuel declined to be interviewed for this story. On the state level, the Illinois legislature passed a bill last summer allocating $10 million to the Uptowns restoration. But that was a different session under a different governor; now Gov. Bruce Rauner is embroiled in budget battles, and that money is off the table. Raising tens of millions of dollars to support a private companys venture is tough, and recouping that money through programming might be an even greater challenge. The Uptown is an unwieldy space: Its capacity is 2,000 seats greater than the 2,344 of the Cadillac Palace, the largest of the downtown Broadway in Chicago refurbished theaters, so traditional theatrical productions arent likely to run there. Mickelson said being able to remove the orchestra-level seats as the Fox, Riviera and Vic have done would increase the capacity further, though the question is how often live events might be booked there. Other ideas floated: using parts of the building for community space, restaurants, bars and movie screenings. \"Id like to see anything that generates revenue and allows this thing to work,\" Mickelson said. Tagami recommended that a nonprofit entity take over the buildings ownership Mickelson agrees. \"The Uptown shouldnt be privately owned,\" Mickelson said. \"A not-for-profit to me needs to be part of the equation. Thats the direction Ive been heading in in the last few years.\", So as Mickelson guided a July walk-through of the theater, officials from the Chicago Infrastructure Trust, an organization created by Emanuel in 2012 to attract private investment to public projects, were getting their own tour from Jimmy Wiggins, a Jam venue operations manager. The trust, Mickelson said, was \"working on putting together the funding plan.\", But the next week the mayor shook up the infrastructure trust, announcing that CEO Stephen Beitler, who was on that Uptown tour, had resigned and nominating Leslie Darling, the citys first assistant corporation council, as the new executive director. Emanuel also added six new board members. The reconfigured board has yet to meet or to set its priorities, though city officials have floated a variety of potential projects for it to tackle, including high-speed rail to OHare. Through a city spokeswoman, Darling, who has yet to assume her new position, declined to be interviewed about the Uptown. Meanwhile, Uptown, the Chicago neighborhood, lives on without its namesake theater. Uptown still hasnt solved all of its crime and gang issues, but bars and restaurants are growing in number and popularity, some upscale food and coffee places have opened along Wilson Avenue, developers have been unveiling new residential projects, and the $203 million Wilson Red Line station reconstruction is generating economic activity while reintroducing daylight to nearby businesses. On the entertainment front, the 6-month-old Uptown Underground is drawing crowds to its burlesque/cabaret acts. Also, a bouldering gym called First Ascent is scheduled to open in late fall on the second floor of the North Broadway building that housed Borders until 2011. The city has chipped in a $50,000 grant to underwrite the Uptown Saturday Nights culture crawls now running the second Saturday of each month. These events include family programming, neighborhood tours and free music performances. The Chicago Department of Transportation is planning a Broadway/Lawrence streetscape with a new plaza to sit outside the Riviera, and work has begun to turn a three-block stretch of Argyle Street into a \"shared street.\", Sara Dinges, president and CEO of the community economic development organization Uptown United, said that over the past four years, about $700 million has been invested in or committed to the neighborhood. \"So a lot is going on,\" she said. \"And its in spite of the theater not being open,\" Uptown United Associate Director Wally Rozak added. \"Theres a lot of activity happening there, a lot of vitality involving entertainment, culture and the arts, that we dont have to wait for the Uptown Theatre,\" said Michelle Boone, Chicagos cultural affairs and special events commissioner. Still, she called the theater \"the big capstone piece of the puzzle.\", No neighborhood transition is going to make everybody happy. Rents rise, stores get displaced, the vibe shifts. \"Its not the city it used to be,\" complained Oakland resident Lyn Bonthius as she awaited her husband across from the Fox on a recent afternoon. But when her husband, woodcarving artist Rik Harris, arrived, he praised the Fox as \"fantastic\" and the new restaurants as \"super.\", \"Its a good thing to make the city pop a little bit,\" he said. Now the question is whether and when the Uptown Theatre might give its Uptown a similar pop. \"If we can do it in Oakland, for the love of God, you could do it in Chicago,\" Tagami said. \"Hello. I mean, really?\", mcaro@tribpub.com, Twitter @MarkCaro]", "Date": "20150809", "Author": "[Mark Caro]", "Link": "http://www.chicagotribune.com/news/globalcity/ct-global-city-uptown-theater-met-20150808-story.html", "Title": "[Tale of two Uptowns: Chicago and Oakland, Calif. ]"}