{"Content": "[Yemens al-Qaida branch on Wednesday confirmed it carried out last weeks deadly assault on a French satirical newspaper to avenge cartoons depicting the Prophet Muhammad, as it called for unity among jihadi ranks and vowed more attacks on the West. In an 11-minute video posted on the groups Twitter account, Nasr al-Ansi, a top commander of al-Qaida in the Arabian Peninsula, said the attack on the office of the Charlie Hebdo weekly in which two gunmen massacred 12 people was in \"revenge for the prophet.\", He warned of more \"tragedies and terror\" in the future, saying \"you will look for peace and stability but you will not find it because of the deeds of those carrying out martyrdom operations and heroes of lone jihad.\", Al-Ansi said AQAP \"chose the target, laid out the plan and financed the operation.\" He said the radical Yemeni-American cleric Anwar al-Awlaki, who was killed in a U.S. drone strike in Yemen in September 2011, had arranged the attack. If confirmed, that would mean the Paris attack was years in the making. But Al-Ansi produced no evidence to support his claims, leaving lingering questions over the exact relationship between the attackers and the militant groups leadership in Yemen. U.S. intelligence officials say they have no evidence AQAP coordinated the attack or knew about it in advance. The officials spoke on condition of anonymity because they werent authorized to discuss classified matters publicly. An AQAP member told The Associated Press Friday that the group was responsible, but the video contained the first official claim. The statement emerged as Charlie Hebdo defiantly released a new issue with a caricature of the prophet on the cover, with copies selling out before dawn across Paris. The assault on the magazine was the first successful operation by AQAP outside of Yemen, and came after a number of failed attacks on the U.S. which views the Yemeni affiliate as al-Qaidas most dangerous franchise. Al-Ansi said orders came from al-Qaidas top leader Ayman al-Zawahri, Osama bin Ladens successor. The attack on the weekly was the beginning of three days of terror in France that saw 17 people killed before three Islamic extremists were gunned down by security forces. Brothers Said and Cherif Kouachi, who carried out the attack on the paper, were \"heroes,\" al-Ansi said. \"Congratulations to you, the nation of Islam, for this revenge that has soothed our pain,\" he said. He made no claim to a subsequent attack on a kosher grocery store by a friend of the Kouachis, Amedy Coulibaly, who killed a French policewoman on Thursday and four hostages on Friday. Coulibaly appeared in a video message two days after his death pledging allegiance to the Islamic State group, a fierce rival to al-Qaida, and saying he had worked with the Kouachis. The Coulibaly video raised questions over possible cooperation between the rival groups, which are competing for resources, recruits and leadership of the worldwide jihadi movement, and which in Syria are battling over turf. Al-Ansi called the timing of the two attacks a \"coincidence.\" But he also praised Coulibaly and appealed for unity among jihadi ranks, saying the attack marked a \"new turning point in the history of confrontation\" with the West. \"Al Qaeda seeks to unify the jihad and will work with other groups,\" said Katherine Zimmerman, a research fellow at the American Enterprise Institute. \"Coulibalys support for ISIS did not appear to affect AQAPs calculations in praising his role.\", However, she added that AQAPs rejection of the Islamic States self-styled caliphate would likely preclude cooperation at higher levels. By taking responsibility for the deadliest attack in France in more than half a century, al-Qaidas Yemeni branch is positioning itself as the groups most influential offshoot. In Yemen, the group is battling against the government as well as Shiite rebels, known as Houthis, who have seized the capital and other parts of the country as part of a prolonged power struggle with the U.S.-backed president. As the Houthis have moved into predominantly Sunni areas they have driven many into the arms of the jihadis. The group has also benefited from a popular backlash against years of U.S. drone strikes, which have targeted AQAP leaders and safe houses but also killed civilians. In Wednesdays video, al-Ansi accused France of belonging to the \"party of Satan,\" saying it \"shared all of Americas crimes.\", Formed in 2009 as a merger between the terror groups Yemeni and Saudi branches, AQAP has been blamed for a string of unsuccessful bomb plots against American targets. These include a foiled plan to down a Detroit-bound airliner in 2009 using a new type of explosive hidden in the bombers underwear, and another attempt a year later to send bombs hidden in toner cartridges aboard cargo planes bound to the U.S. from the Gulf. At least one of the two brothers involved in the Paris attack traveled to Yemen in 2011 and either received training from or fought alongside the group, authorities say. A U.S. intelligence assessment described to the AP said 34-year-old Said Kouachi was trained in preparation to return home and carry out an attack. Al-Qaida has in the past threatened the Charlie Hebdo staff and other cartoonists who depict Islams prophet, which is considered sacrilege by most Muslims. Editor Stephane Charbonnier, one of those killed last Wednesday, was on a hit list published in a 2013 edition of Inspire, AQAPs English-language publication. Al-Ansi mocked Sundays anti-terror march in Paris, attended by one million people and more than 40 world leaders, indicating the video was made in the last two days. \"Look carefully at their gathering. They are the same who fought us in Afghanistan, Caucasus, Gaza, the Levant, Iraq, Somalia and Yemen,\" al-Ansi said. The video played footage from the march alongside images of the Sept. 11 attacks. It also featured footage of 2012 demonstrations against a short online film that mocked the prophet, sparking worldwide protests. Those protests were linked to the Sept. 11, 2012 attack on the U.S. mission in Benghazi, Libya, in which U.S. Ambassador Chris Stevens and three other Americans were killed. Associated Press]", "Date": "20150114", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-paris-terror-attacks-20150114-story.html", "Title": "[Yemen's al-Qaida claims responsibility for Charlie Hebdo attack, vows more violence ]"}