{"Content": "[Whether James Holmes gets life without parole or a death sentence for the Colorado theater shooting, he will spend years behind bars, joining about 6,000 inmates in Colorado and hundreds of thousands of others nationwide who suffer from mental illness. Experts say prisons are ill-equipped to treat the growing number of inmates with mental illnesses especially the majority who are not convicted of crimes as violent as Holmes, who was diagnosed with a form of schizophrenia. A jury on Thursday convicted the 27-year-old former neuroscience graduate student of murder and other charges for his 2012 assault at a midnight screening of a Batman movie that killed 12 and wounded dozens of others. The same jurors will decide his sentence in the penalty phase of the trial, which starts Wednesday and will take about a month. Even if they decide Holmes should be executed, as prosecutors want, he would spend years in prison as his mandatory appeals play out in court. Holmes pleaded not guilty by reason of insanity, but jurors rejected the claim after two state-appointed psychiatrists testified he could distinguish right from wrong, Colorados test for sanity. But the two state psychiatrists and two defense psychiatrists agreed he suffers from mental illness. If jurors had found Holmes was insane, he would have been committed indefinitely to a state mental hospital. Instead, he could end up at the San Carlos Correctional Facility, Colorados 250-bed prison for inmates with mental illness, where experts agree his treatment will be at a far lower standard than if he were hospitalized. \"In most hospitals, you dont have staff whipping out Tasers and pepper spray and using it on their patients,\" said Jamie Fellner of Human Rights Watch, who has studied mental health treatment in prisons and recently wrote a report detailing instances of mentally ill prisoners being beaten or so violently restrained that they die. \"This kind of treatment isnt just restricted to someone whos committed a horrific crime.\", Last year, Colorados Department of Correction approved a $3 million settlement to resolve a lawsuit from a family of an inmate with a form of schizophrenia who died after being restrained in the San Carlos prison. Staffers were videotaped joking as Christopher Lopez suffered seizures and died. The agency said it fired three people. A spokeswoman for the Department of Corrections said no one was available to comment Friday on the prison systems mental health care. People with mental illness sometimes wind up in jail because law officers dont know what else to do with them, said Scott Glaser, executive director of the Colorado chapter of the National Alliance on Mental Illness. And once in the criminal justice system, they find it hard to get out. \"They cannot usually get effective treatment,\" Glaser said. \"It increases recidivism. If someone is dealing with a mental illness that affects their decision-making. Its very easy for them to end up in the system again.\", Nationwide, a 2006 federal study estimated that 56 percent of all prisoners in state custody suffered from mental illness and 15 percent suffered from some sort of psychotic disorder. Mental health advocates say their treatment is almost uniformly substandard for a variety of reasons. Mentally ill people do not fare well in the crowded, loud environment of prisons, the study concluded. They are more likely to have trouble following rules, which makes them more likely to be punished and end up in solitary confinement. The isolation of a solitary cell can vastly aggravate their mental illness. They are also more likely to be victims of sexual abuse, the study said. Colorado lawmakers banned solitary confinement for inmates with serious mental illness after a prisoner who had been held in solitary for much of his eight-year term was suspected of killing the state prisons chief, Tom Clements, in 2013. \"Prison is a pretty horrific place to be, especially if you have a mental illness,\" said Laura Usher of the National Alliance on Mental Illness national office. The incarceration of mentally ill inmates in jails and prisons has been a persistent national problem since the widespread closure of mental hospitals in the 1970s. The promised local community care system to handle the newly released mentally ill never materialized, and now they often end up behind bars. There the Constitution entitles them to basic medical treatment, said Dr. Renee Binder, president of the American Psychiatric Association, but its often hard to meet that standard. The APA and other groups are pushing for more programs to keep the mentally ill out of prison initially be those special courts or local treatment. \"When someone ends up in jail and prison and has a serious mental illness, its really a problem with the system,\" Binder said. \"The question needs to be asked: Could we have prevented this?\", Associated Press]", "Date": "20150717", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-james-holmes-prison-20150717-story.html", "Title": "[ Holmes will join many other mentally ill inmates in prison ]"}