{"Content": "[I dont want to go all Seymour Hersh on the Obama administration, but Im having a hard time believing some of the fruits of the Osama bin Laden raid. Thats the raid that led to the death of the terrorist bin Laden, father of the attacks of 9/11 that left thousands of our countrymen dead. Theres nothing funny about him. But what came out of the raid is simply bizarre. Journalist Hersh says bin Laden was actually betrayed for money by elements of the Pakistani intelligence service who turned him over to the U.S. The Obama administration, which guards the bin Laden death mythology carefully since it is a metaphoric scalp of high political value refuted Hersh. They trotted out a White House spinner to say that another Obama administration official said that Hersh is a liar and that our intelligence services found the mass murderer. Either way, the circumstances of bin Ladens death dont bother me. I never figured wed get the real story, and I hope hes crab food buried at the bottom of the ocean. I really wouldnt care if hed been dumped in some alley for feral hogs to eat. What bothers me is what Obama administration officials now said they found during the raid. Like his reading list that included the conspiracy theorists holy book, \"The Bloodlines of the Illuminati\" by Fritz Springmeier. If anyone accused me of reading that after theyd killed me, Id have to come back from the dead just for the sake of revenge. And this crazy al-Qaida job application, full of ridiculous questions from the Terrorist Human Resources Department. Questions like:, \"Do you wish to execute a suicide operation?\", How would you answer that? If you write \"no,\" youre off the team. And if you say \"yes,\" you know theyll think of you as a meat puppet. Another question straight out of the HR handbook focused on applicant goals. \"What objectives would you like to accomplish on your jihad path?\", What objectives? You could write something like, \"Oh, Id like to bring the West to its knees,\" or \"Im hankerin to kill a mess of Christians and Jews,\" but what terrorists dont say that?, It wouldnt really distinguish you from countless other illiterate barbarians dreaming of mountains of pilaf and virgins in the afterlife. Perhaps you might write, \"My path? We must strike at the heart of the West, so I hope to direct a hit movie discrediting the 300 Spartans. But first I need a script and $200 million.\", The most bizarre question was the one involving recreation:, \"Do you have any hobbies or pastimes?\", Like what, exactly? Bombs and head lopping? Or it could be gambling and smoking and looking at Internet porn and drinking whiskey in direct conflict with certain holy texts, but you think theyd actually have the gumption to tell the truth? No. Thats why the question is a complete waste of time. And what if a prospective terrorist was truly into bonsai? I dont mean growing a few dwarf Japanese maples in your backyard, but true, meticulous bonsai, like an oak tree passed down over generations, an oak as big as your hand. Would that disqualify you? Or would it suggest patience, something needed in terrorism?, Or what if you were the president of the Saudi Brony society young men who dress up in pony costumes and are obsessed with \"My Little Pony\" cartoons and \"My Little Pony\" dolls?, You didnt know they existed? Well, then, Im sad to say, they do, and in great numbers. If you dare mock a Brony, they all get together and go online and become very upset. Would Osama give a Brony a chance to kill Westerners for the glory of his holy war? Or is al-Qaida against Bronys too?, A guy I know lets just call him Jim said the al-Qaida Human Resources Department blew it by asking prospective terrorists a vague hobby-related question. \"They should have been more specific, and they could have made it Web-friendly,\" said Jim. \"And they could have used cats.\", Cats?, How?, \"A question could have been: How would you use cats to illustrate al-Qaidas march to power? Then the job applicants could have posed cats or used pictures of cats on a map to show al-Qaida movements in various Middle Eastern countries,\" said Jim. Jim just stood there, staring, with no expression on his face. I was almost certain he was mocking me. \"Cats are very big on the Web,\" said Jim. Yes they are, Jim. \"Im serious,\" said Jim. Not all the al-Qaida job application questions were dumb. One of the smart questions was, \"Do you have any chronic or hereditary disease(s)?\", \"Yes,\" a candidate might say. \"I suffer from the heartbreak of either psoriasis or eczema, Im not sure. So please let me kill lotsa infidels to assuage my embarrassment!\", Another question that was decently framed was the one about popping ones clogs (just look it up) or wearing a pine overcoat (look that up too). But if youre too lazy to look anything up yourself, these are references to death, one British, the other, apparently, American. Heres the al-Qaida question:, \"Who should we contact in case you became a martyr?\", On second thought, thats a horribly written question. Shouldnt it have been: \"Whom\"?, Its clear the al-Qaida Human Resources Department should have posted another job opening, for Terrorist Grammarian. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150520", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-al-qaida-application-met-0521-20150521-column.html", "Title": "[Osama bin Laden's recruitment application an HR mess]"}