{"Content": "[Saudi-led airstrikes hit weapons caches held by Iran-backed Shiite rebels, touching off massive explosions Monday in Yemens capital that killed at least 19 people and buried scores of others under the rubble of flattened homes. The U.S. Navy, meanwhile, has dispatched the aircraft carrier USS Theodore Roosevelt toward the waters off Yemen to join other American ships prepared to intercept any Iranian vessels carrying weapons to the rebels, U.S. officials said. After the coalition airstrikes, mushroom clouds rose over the mountainous outskirts of Sanaa, where the arms depots are located. The Fag Atan area has been targeted several times since March 26, the start of the air campaign against the rebels known as Houthis. Powerful explosions rocked the Yemeni capital of Sanaa on April 20, 2015, as Saudi-led airstrikes targeted suspected weapons caches and missiles held by Shiite rebels. (AP), Powerful explosions rocked the Yemeni capital of Sanaa on April 20, 2015, as Saudi-led airstrikes targeted suspected weapons caches and missiles held by Shiite rebels. (AP), \"It was like the doors of hell opened all of a sudden,\" said Mohammed Sarhan, whose home is less than 2 kilometers (1 mile) from the site. \"I felt the house lift up and fall.\", The blasts among the most powerful in Sanaa since the airstrikes began deposited a layer of soot on the top floors of buildings in the Yemeni capital and left streets littered with glass. Anti-aircraft fire rattled in response. One bomb hit near the Iranian Embassy in Sanaa, drawing a sharp rebuke from Tehran. Saudi Arabia and several of its allies, mainly Gulf Arab countries, have been trying to drive back the rebels, who seized Sanaa in September and have overrun many other northern provinces with the help of security forces loyal to former President Ali Abdullah Saleh. The U.S. supports the Saudi campaign. Western governments and Sunni Arab countries say the Houthis get their arms from Iran. Tehran and the rebels deny that, although the Islamic Republic has provided political and humanitarian support to the Shiite group. The Houthis and Salehs troops have also advanced on the southern port of Aden, Yemens main sea hub, forcing President Abed Rabbo Mansour Hadi to flee the impoverished but strategic country last month. The Houthis and their allies have been trying to take over Aden for weeks. The announcement that the USS Theodore Roosevelt is heading for the region comes amid reports that a convoy of Iranian ships may be headed toward Yemen to arm the Houthis. There are about nine U.S. ships in the region, including cruisers and destroyers carrying teams that can board and search other vessels. The U.S. officials spoke on condition of anonymity because they were not authorized to discuss the ship movement on the record. The carriers deployment follows last weeks approval of a U.N. Security Council resolution that imposed an arms embargo on three Houthi leaders, two key supporters, Yemens ex-president Ali Abdullah Saleh and his son, and those acting on their behalf. The resolution passed in a 14-0 vote with Russia abstaining. White House spokesman Josh Earnest would not comment specifically on any Navy movements in Yemeni waters, but said the U.S. has concerns about Irans \"continued support for the Houthis. \"We have seen evidence that the Iranians are supplying weapons and other armed support to the Houthis in Yemen,\" White House spokesman Josh Earnest said. \"That support will only contribute to greater violence in that country. These are exactly the kind of destabilizing activities that we have in mind when we raise concerns about Irans destabilizing activities in the Middle East.\", One of Mondays airstrikes hit dangerously close to the Iranian Embassy, shattering windows but causing no casualties among the staff, the Iranian state TV reported. Iran summoned the kingdoms envoy in Tehran in protest. Deputy Foreign Minister Hossein Amir Abdollahian warned the Saudis to abide by their international obligations and respect diplomatic missions, the report said, adding that it held Riyadh responsible for the safety of its mission in Sanaa. In a column in Mondays New York Times, Iranian Foreign Minister Mohammad Javad Zarif called for a regional dialogue, and said \"Yemen would be a good place to start.\", He noted that Iran had urged an immediate cease-fire, humanitarian aid and an \"intra-Yemeni dialogue\" leading to the formation of a national unity government. In response to Zarifs remarks, U.S. State Department spokeswoman Marie Harf said: \"Are we looking for ways to work with our partners, with the Gulf countries, with other countries, to make the region more stable? Of course. Does that include Iran? You know, weve always said we wont be coordinating with them on these issues.\", At U.N. headquarters in New York, ambassadors from the six Gulf countries and Yemen met U.N. Secretary-General Ban Ki-moon to discuss the call in last weeks Security Council resolution for humanitarian pauses and, In the Fag Atan area, a 10-house village was destroyed in the explosions, according to witnesses who spoke on condition of anonymity because they fear for their safety. While some villagers had fled earlier, those who remained were believed to have been killed, they said. Mohammed Saleh said he and his family fled in a friends car after his was destroyed in the strike. He said hospitals were packed with wounded. Repair shop owner Saleh Haitham said he saw people running for shelter as rocks and shrapnel flew around them. Many posted videos and photographs of the explosions and damage on social media. Houthi spokesman Mohammed Abdel-Salam, denounced the airstrikes as a \"crime that exposed the hatred and envy\" of the Saudi-led coalition. A Yemeni official said the airstrikes were hoping to destroy Scud missiles known to be at Fag Atan. Medical officials said 19 bodies were brought in to hospitals but many were buried under the debris and the death toll was expected to rise. The official and the medics spoke on condition of anonymity because they were not authorized to talk to media. The Al-Masirah TV network, which is run by the Houthis, as well as the rebel-controlled Interior Ministry said at least 30 people including Mohammed Shamsan, a TV presenter for another network and two of his crew members were killed and hundreds were wounded. The casualty figures could not be independently confirmed. The turmoil in Yemen has raised concerns that al-Qaidas local branch, considered the most dangerous affiliate of the terrorist network, is exploiting the security and political vacuum. U.S. drone strikes targeting militants have been scaled back amid the chaos. Earlier this month, al-Qaida overran Mukalla, the provincial capital of Yemens largest province, Hadramawt. In the port city, the militants on Monday formed an alliance with tribesmen to oversee the running of daily affairs and businesses. Militants and tribesmen in joint groups known as \"Sons of Hadramawt\" are guarding local government facilities, banks and the airport, local spokesman Lutfi bin Saadon told The Associated Press. Fighting intensified Monday in Aden, with Houthis and Saleh loyalists battling youth militias and forces loyal to Hadi, who is in exile in Saudi Arabia. Clashes were underway near the Aden airport and in the central al-Arish district, witnesses said, speaking on condition of anonymity because they feared for their safety. Coalition airstrikes targeted an Aden hotel suspected of being used by the Houthis and allied forces. All land lines and communications were cut amid the fighting. Saudi Arabias Interior Ministry said a border guards was killed and two others were wounded from gunfire and mortar fire Sunday night from inside Yemen. The border guards were in the kingdoms southern province of Najran, the ministry said. It did not specify who the attackers were. At U.N. headquarters in New York, ambassadors from Gulf countries met U.N. Secretary-General Ban Ki-moon to discuss provisions of last weeks U.N. resolution demanding that all Yemeni parties, especially the Houthis, end violence and return swiftly to U.N.-led peace talks and calling on Ban to initiate \"humanitarian pauses.\", Qatars U.N. Ambassador Alya Ahmed Saif Al-Thani said afterwards that Ban briefed the ambassadors on his choice to succeed Jamal Benomar as the new U.N. envoy for Yemen, reportedly Ismael Ould Cheikh Ahmed of Mauritania, who currently heads the U.N. Ebola mission in West Africa. She refused to say whether Gulf nations approved of the choice. Associated Press]", "Date": "20150420", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-yemen-navy-warship-iran-20150420-story.html", "Title": "[U.S. warship heads to Yemeni waters to intercept Iranian weapons]"}