{"Content": "[On the stage at the Reagan library Wednesday night, even the most hawkish candidates chirped only modest ambitions. The Republican Party is no longer the party of regime change, no longer the party of wars of liberation. The front-runners vision for American power, in fact, was right out of Barack Obamas 2008 campaign. Back then, Obama distinguished himself from Hillary Clinton and the Republican field by reciting an old chestnut from John F. Kennedy: \"Let us never negotiate out of fear. But let us never fear to negotiate.\" Obama said his willingness to forge relationships with adversaries would restore Americas standing in the world. But this was also a recognition of the limits of U.S. power. America cannot just change every regime that is evil.  , This time around it was Donald Trump making this kind of promise. \"I would get along with a lot of the world leaders that this country is not getting along with,\" Trump said. He specifically boasted that he would get along with Russias president, Vladimir Putin. \"We wont have the kind of problems our country has right now with Russia and many other nations,\" Trump said. Oh, the irony. Remember: It was Obama who began his first term in office with a policy to reset U.S. relations with Russia. That policy was centered on a reboot of an arms control treaty to limit strategic nuclear weapons and a promise to not press too hard about Russias invasion of Georgia in 2008. To put it mildly, that plan did not work out. Putin invaded Ukraine, declared war on his political opposition and just this summer hosted Irans most dangerous general, Qassem Suleimani. But it was not just on Russia where Trump inadvertently endorsed Obamas policies. Take his answer on Syria. He noted that America was fighting the Islamic State and so were Russia, Syria and Iran. \"Let them fight each other and pick up the remnants,\" he said. Obama has never been this blunt. But that has been the net effect of his policy on Syria as well. Consider the acknowledgment Wednesday that the Pentagon has trained only four or five Syrian rebels to date -- nearly four years into the conflict. Its easy to dismiss Trumps thoughts on foreign policy. He doesnt really do details. He doesnt know the names of terrorist leaders. But Trump today is the front-runner, and his brash declarations reflect something important about the state of foreign policy these days in the Republican Party. Today Republicans are content to intimidate Americas enemies, but not necessarily end the regimes. Even Marco Rubio, the candidate with the most developed hawkish worldview, doesnt propose to end evil regimes. He has identified threats from Russia, China, Iran and radical Islam. But his main point is that U.S. power should be used to blunt these powers and strengthen the allies most threatened by them. Rubio is not promising liberation, so much as he is promising deterrence. The distinction matters, in an age when the U.S. faces real threats. Republicans see a world where the Iran deal has added new danger; Irans leader poses an implacable threat to the U.S. and its allies; China is a cyber threat and an expanding military power; and Russia seeks to re-establish itself as a hegemon on the world stage. Some of the candidates also care about the spread of democracy in the abstract. Rubio pledged to meet as president with Chinese and Russians \"who aspire to freedom and liberty\" in those countries. Ted Cruz has been consistent in calling attention to the plight of Christians persecuted in the Muslim world. John Kasich has talked about Western civilizations battle of ideas, against murderous ideologues. But Cruz, Rubio and Kasich never hint at the grand ambition that led George W. Bush to use American arms to build a democratic Iraq from the ashes of Saddam Husseins tyranny. Bushs younger brother, who has been plagued more than the other candidates by the Iraq war, also avoids promising regime change. But unlike most of his competitors, Jeb Bush does believe America should re-engage in Iraq. He emphasizes that this process should be largely political and diplomatic. And for Syria, Bush even warned against precipitous regime change, saying \"we have to make sure the [Bashar al-Assad] regime is not replaced by something as bad or worse.\", None of this is to say that the Republicans would continue to implement the policies of President Obama. While there was disagreement Wednesday night between candidates like Trump, Kasich and Sen. Rand Paul, who all said they would enforce the Iran nuclear deal, and other candidates like Scott Walker and Cruz who promised to rip up the agreement on their first day in office, all candidates agreed Obamas deal was a suckers bet. There was also a consensus to increase spending on the military and rehabilitate the U.S. relationship with Israel. But in one important sense, the Republican field for 2016 has also begun to acknowledge, indirectly at least, the limits of American power to remake the world in its image. Its the kind of insight Sen. Obama brought to the campaign trail in 2008. Today it lurks in the background of the Republican Partys approach to statecraft as the candidates audition for the presidency. , , _ Eli Lake is a Bloomberg View columnist who writes about politics and foreign affairs. , For more columns from Bloomberg View, visit http://www.bloomberg.com/view]", "Date": "20150917", "Author": "[Eli Lake, Bloomberg View]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-declassified17-20150917-story.html", "Title": "[Republicans and the limits to American power abroad]"}