{"Content": "[Chicago ad man Mike DAmico, who became the unlikely face of American soccer during last summers World Cup as the exuberant fan dubbed \"Teddy Goalsevelt,\" is back to save the sport he loves. An associate creative director at Havas Chicago, DAmico enlisted a few of his ad buddies and posted a spoof video on YouTube late Wednesday announcing that Goalsevelt was running for president of FIFA, the beleaguered governing body of soccer. His stated goal is to replace Sepp Blatter, the longtime FIFA president who stepped down Tuesday just days after his re-election amid charges of rampant corruption. Channeling Teddy Roosevelt in full Rough Rider regalia, Goalsevelts stump speech touted his own tongue-in-cheek candidacy with a promise to clean up soccer and a pithy platform outlining his strengths:, \"A man. A plan. Not corrupt. Mustache.\", An upstate New York native who grew up playing football, DAmico got hooked on soccer after moving to Chicago in 2007. Smitten during the 2010 World Cup, he decided to make a pilgrimage to Brazil last June, where he unveiled his Teddy Roosevelt-inspired character, a look assembled around his bushy mustache all that remained of a newly shaven, once-prodigious beard. Captured on TV cameras wildly cheering a U.S. goal during a 2-2 draw with Portugal, DAmico lit up the Internet, where he was soon christened Teddy Goalsevelt. He became a symbol of the growing American passion for soccer, and something of an instant celebrity, at least while in costume. \"I was just sort of the lucky dummy that they cut to in the middle of that Portugal game,\" DAmico said. DAmico, 32, who lives in Ukrainian Village, put aside his alternate persona for the most part after the World Cup. In September, he changed ad agencies, moving from Cavalry (yes, Cavalry) to Havas, where he works on accounts like AutoZone and Dish. Like many soccer fans, DAmico was outraged by the federal racketeering charges brought by U.S. authorities against nine former FIFA executives last month after a lengthy investigation revealed that they had accepted bribes from cities seeking to host the World Cup. When Blatter, who led FIFA for 17 years, was subsequently re-elected, only to resign several days later, DAmico resurrected Teddy Goalsevelt, with a plan to throw his Cavalrymans hat into the ring. He mobilized fellow Chicago ad creatives, and they roughed up a script and shot the video Wednesday at Optimus, a production facility on East Grand Avenue. It was uploaded to YouTube just before midnight, and by Thursday morning, Teddy Goalsevelt was once again a social media phenomenon. DAmico said the primary goal was to offer some comic relief for soccer fans after a rough and tumultuous week. But as more is revealed about the people actually running FIFA, he says his fictional candidacy makes real sense. \"Its so comically, out-of-control corrupt that someone like Teddy Goalsevelt could become a viable candidate,\" DAmico said. \"Thats how desperate people are for someone who maybe has a little bit of integrity. How bad do things have to be that you would turn to somebody who dresses up as a president from 100 years ago?\", rchannick@tribpub.com, Twitter @RobertChannick]", "Date": "20150605", "Author": "[Robert Channick]", "Link": "http://www.chicagotribune.com/business/ct-teddy-goalsevelt-fifa-0605-biz-20150604-story.html", "Title": "[Teddy Goalsevelt throws hat in FIFA presidential ring]"}