{"Content": "[Recently, the mayor of Mundelein has seen his name in the press quite frequently, due to a Fourth of July public appearance where he spoke about Americas \"moral crisis,\" citing gay marriage and \"the out-of-wedlock birth rate\" as two major issues. Ive been mulling if/how to approach the issue, and what Ive concluded is that it has a much wider scope and more complexities than we might initially think. While I fall into the camp that believes the mayor vastly overstepped his domain as an elected public figure, as I assessed my reaction to his comments it seemed that the many layers of being a public figure began to peel away like an onion. With a nod to E. L. James, many shades of grey once again, versus black and white. Did I like or agree with his comments? Absolutely not. Did they seem appropriate for the venue and situation? No way. So far, it seems pretty simple, yes? But wait. Dont we make decisions about our public figures, who we support and who we try to defeat, based upon their beliefs in so many important categories? Morality, religion, economics, foreign relations they are a few of our touchstones as we decide whose vision matches our own, and thereby who we support in elected office. Now, that is usually what election campaigns are for. Candidates sharing their personal views with the voting public, and then that constituency deciding who will assume office. However, at least in my view, once a candidate becomes the elected official, they become representative of their entire constituencynot just the ones who agree with them, but even the ones who may have campaigned against them. Their public persona should reflect that element as they perform their official duties. Now, I would imagine the hard part for elected officials is to maintain their individual opinions while serving the general public equitably. The key is figuring out when its appropriate to share highly personal observations about the state of the world, as opposed to occasions when its better to act as a representative of all the people and tailor remarks accordingly. It must be a bit of a tightrope, but I do believe the public has the right to expect that from officials who are entrusted with serving the greater good of the whole community. Lets face it, being a politician these days isnt always the easiest road to walk. Matter of fact, lately it seems that the majority of people who actively seek high offices, like president of the United States of America, are the egomaniacs who want the Oval Office for personal reasons. Yes, there are certainly enough politicians who milk the system and use it for private gain, causing cynicism and distrust among the public for many elected officials. But there are also plenty of hardworking, dedicated people who dont get big perks for performing their assigned tasks, and are probably underappreciated. That category most likely includes many small town mayors and elected officials. No matter the office or governmental hierarchy, however, trying to serve the entire public sector fairly while keeping individual personal opinions firm but private is the ultimate way to stay true to oneself and still represent the entirety of a constituency in the best way possible. Pat Lenhoff is a freelance columnist for Pioneer Press. Email: viewfromvh@yahoo.com]", "Date": "20150811", "Author": "[Pat Lenhoff]", "Link": "http://www.chicagotribune.com/suburbs/mundelein/news/ct-vhr-lenhoff-mundelein-mayor-tl-0820-20150811-story.html", "Title": "[Mundelein mayor should remember who he represents]"}