{"Content": "[More bad news for Chicago (and Illinois) taxpayers arrived Friday morning in a 35-page, double-sided packet. On one of the last pages: \"The entire Act is void.\", Cook County Circuit Court Judge Rita Novak tossed out Chicagos pension reform law. City Hall had negotiated the pension changes for municipal and labor employees with many of the citys unions on board. But Novak, using the Illinois Supreme Courts May pension opinion as her sword, ruled that the citys plan violates the Illinois Constitution: A public workers pension is a contract that cannot be \"diminished or impaired.\", Yes, its a Chicago-centric decision, but the implications menace governments statewide. Many of them promised too many retirement dollars to their employees. Now those governments are learning from judges that theyll have to impose draconian changes higher taxes, fewer services, much more outsourcing, concentration on core responsibilities, or anything else they can do to slash costs. All because too many politicians gave away too much future tax revenue to too many workers and then didnt properly fund their pension systems. Never forget that all of that foolish behavior was intentional. Chicago thought it had a stronger case than the state made before the justices killed that plan. But 14 active and retired city workers challenged the city-focused law, and Novak ruled it unconstitutional:, \"The changes to members annuities (in the law) are the same type of changes that the Supreme Court invalidated \" she wrote. \"It follows then that here, as in the case before the Supreme Court, there is simply no way that the annuity reduction provisions can be reconciled with the rights and protections established by the people of Illinois when they ratified the Illinois Constitution of 1970 and its pension protection clause.\" Boom. The city says it will appeal. But its clearer with each ruling two Supreme Court cases and this one in Cook County that governments throughout Illinois are running out of options. State and local officials have to figure out how theyll function while meeting these obligations under this constitution. When the citys law passed, Emanuel said it was constitutional, would protect pensions going forward and would be a model for other pension funds. Without the changes, he said, Chicagos funds would face insolvency: \"Without this reform, these two funds will run out of money in just a matter of years, which is why we must defend this law to protect the future of our workers, retirees and taxpayers.\", But now that the law has been struck down, and an appeal may fall on deaf ears, Illinois governments have to figure out what to do next. And it cant be more borrowing. Thats been the citys crutch so far, both for City Hall and Chicago Public Schools. Just borrow into oblivion, as servicing that debt consumes ever more dollars that taxpayers want spent on services. Nor can higher taxes be everyones sole go-to. Cook County Board President Toni Preckwinkle already pushed through a half-billion-dollar sales tax increase, in part to deal with pension costs. The state is in a grotesque stalemate over its finances. Gov. Bruce Rauner, Senate President John Cullerton and House Speaker Michael Madigan cant agree on much of anything, let alone a pension strategy. Even a compromise offered by Cullerton and supported by Rauner that would give pensioned employees a choice on how to reduce their benefits doesnt appear likely to pass constitutional muster, given the courts rulings. In this state, under these unambiguous decisions, you cant willingly negotiate away a constitutional right. So, elected officials, show us the ugly. Show taxpayers what government in this state is going to look like. Packing 50 kids into each classroom? Outsourcing entire city departments? Demanding the necessary state permission to file for bankruptcy? Taxing residents to death so more move away? What?, Because its clear theres nowhere near enough public money to meet all of these obligations. Nor will there be enough money in countless tomorrows. State and local elected officials, many still in power, gave too much of it away.]", "Date": "20150724", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-pension-emanuel-rauner-madigan-cullerton-illinois-judge-edit-0726-jm-20150724-story.html", "Title": "[Pension doomsday: How will Illinois pols cope with this crisis?]"}