{"Content": "[As his critics grew louder, Republican White House contender Ben Carson retreated slightly late Monday from his weekend charge that Muslims shouldnt serve in the presidency. In an interview with Fox News, Carson said he would be open to a moderate Muslim who denounced radical Islam as a White House candidate. But he also said he stood by his original comments, saying the country cannot elect people \"whose faith might interfere with carrying out the duties of the Constitution.\", \"If youre a Christian and youre running for president and you want to make this into a theocracy, Im not going to support you,\" Carson told Fox News host Sean Hannity in an interview to be broadcast later Monday. \"Im not going to advocate you being the president.\", White House Press Secretary Josh Earnest says on Ben Carson isnt the only Republican presidential candidate to make offensive statements. Sept. 21, 2015. (AP), White House Press Secretary Josh Earnest says on Ben Carson isnt the only Republican presidential candidate to make offensive statements. Sept. 21, 2015. (AP), Carson said members of the Islamic faith who are willing to accept the American way of life \"will be considered infidels and heretics, but at least then I will be quite willing to support them.\", The intensifying political fallout is a distraction at least as the retired neurosurgeon tries to capitalize on recent momentum in the unruly GOP field. But it also highlights a sentiment among voters in both parties who agree with Carsons reluctance to elect a Muslim to the nations highest office. Carsons campaign reported strong fundraising and more than 100,000 new Facebook friends in the 24 hours after he told NBCs \"Meet the Press\" on Sunday: \"I would not advocate that we put a Muslim in charge of this nation.\", His campaign manager Barry Bennett told The Associated Press on Monday: \"While the left wing is huffing and puffing over it, Republican primary voters are with us at least 80-20.\", \"People in Iowa particularly, are like, Yeah! Were not going to vote for a Muslim either,\" Bennett said. \"I dont mind the hubbub. Its not hurting us, thats for sure.\", The head of the nations largest Muslim advocacy group called on Carson to drop out of the 2016 presidential contest during a Capitol Hill press conference on Monday, declaring him \"unfit to lead because his views are in contradiction with the United States Constitution.\", \"Not long ago, some people thought that a Catholic cannot be a president, an African-American cannot be a president,\" said Nihad Awad, executive director of the Council on American-Islamic relations. \"They were wrong then, and they are wrong now.\" He cited Article 6 in the Constitution, which states, \"no religious test shall ever be required as a qualification to any office or public trust under the United States.\", A couple of Republican candidates joined a chorus of Democrats condemning Carsons statement. South Carolina Sen. Lindsey Graham said Sunday that the comment \"shows that Dr. Carson is not ready to be commander in chief.\", Businesswoman Carly Fiorina also denounced rival Carsons recent comments about not wanting a Muslim elected to the White House. \"Well I think thats wrong,\" said Fiorina. \"You know it says in our Constitution that religion cannot be a test for office.\", The leading Democratic presidential candidate, Hillary Rodham Clinton, addressed the issue Monday on Twitter: \"Can a Muslim be President of the United States of America? In a word: Yes. Now lets move on.\", While the law is clear, the politics of Muslim culture in America are not. Fourteen years after Islamic extremists executed the deadliest terrorist attack in U.S. history, a suspicious stance resonates with some voters despite the fact that as Democratic Sen. Harry Reid put it Monday \"they teach in our schools, fight in our military and serve in Congress.\", The U.S. Muslim population is growing, according to a May survey by the Pew Research Center, which found the group represented just under 1 percent of the U.S. population. A June Gallup poll found that 54 percent of Republicans would not vote for a well-qualified Muslim nominee from their own party; 39 percent of independents and 27 percent of Democrats said the same. \"Carson is not going to lose any votes in a GOP primary with those comments,\" said GOP strategist John Feehery. \"He could probably gain a few.\", Indeed, conservatives have repeatedly embraced anti-Muslim sentiment in recent years. Nineteen states introduced legislation in 2015 to restrict the use of foreign law in state courts, Republican-backed steps largely designed to block the influence of Shariah the legal framework that regulates many aspects of life based on the Quran and Islamic tradition in some Muslim countries. Nine states have already implemented such laws, according to the National Conference of State Legislatures. And conservatives have consistently tried to link President Barack Obama to Islam throughout his presidency, using imaginary religious ties. Republican front-runner Donald Trump declined last week to correct a voter who inaccurately stated that Obama is a Muslim. For Trump, the election of a Muslim president was \"something that could happen. Would I be comfortable? I dont know if we have to address it right now.\", Associated Press]", "Date": "20150921", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-ben-carson-muslims-20150921-story.html", "Title": "[Ben Carson claims benefits from Muslim criticism ]"}