{"Content": "[Whenever I think of politics today, I immediately think of a scene from a classic Marx Brothers movie. In the film \"Horse Feathers,\" Groucho Marx plays the president of Huxley College, Professor Quincy Adams Wagstaff, who happily sings:, \"I dont know what they have to say / It makes no difference any way / Whatever it is, Im against it. / No matter what it is or who commenced it, Im against it!\", Sound familiar? Can you say \"Trump?\", The ascent of Donald Trump as a leading presidential contender is one of the more fascinating stories of the 2016 presidential race. He sure has made a lot of people take notice, made it hard for other candidates to gain any traction and is causing a lot of liberals and establishment conservatives to go bananas. But there is little reason to freak out over Trump or fret for the life of the republic because of Trumps pronouncements on issues or antics on TV. Its happened before. Long before The Donald, there has been a certain streak of independence in Americans who just have to say \"No\" to policy. In a way, Trumpism is the latest incarnation of a truly American trait. Dont fear it. Just acknowledge it. If you go back to the beginning, you come across something called the Whiskey Rebellion of 1794. The new federal government instituted a tax on whiskey to generate revenue to pay for (what else?) national debt. But western farmers felt the federal government was overstepping its reach in an abuse of federal authorities. So they refused to pay the tax, until ultimately relenting under the threat of military force. Fast-forward about 60 years. Immigration is changing the nature of the republic, or so some Americans fear. The Germans, the Irish and especially the Catholics are ruining the country and dont share the same American ethic as those already residing in the U.S. People who held this view were called Know-Nothings. Calling themselves the American Party, they even ran a candidate for president in 1856 in former President Millard Fillmore. Remember him? I didnt think so. In recent times, weve had the candidacy of Strom Thurmond in 1948 for the States Rights Democratic Party. Thurmond was at least a segregationist, but as America learned after his death, he mustve been highly conflicted about it, having fathered a daughter by the familys black maid. There are some who still recall the George Wallace campaign of 1968, who ran for president as a candidate for the American Independent Party. Wallaces main issue was segregation he was for it big time but also attracted support with promises to increase social security, end the Vietnam War and curtail foreign aid. The result was Richard Nixon. Even more recently, we saw the emergence of Ross Perot in the 1992 election, whose third-party candidacy handed the election to Bill Clinton. So Trump and Trumpism is nothing new. The current personification of this typically American gene has some advantages over the whiskey rebels, the Know-Nothings and likes of Strom Thurmond and George Wallace. Trump has instant mass media today and he knows how to use it. Hes very good at articulating the Professor Wagstaff philosophy of \"Whatever it is, Im against it.\", But I truly doubt Trump will ever get beyond interesting historical footnote when it comes to presidential politics. The American electorate prefers to be for something. But when the ruling classes fail to pay attention or work for the common good, the spirit of the Know-Nothings rise again. Randy Blaser is a freelance columnist for Pioneer Press.]", "Date": "20150903", "Author": "[Randy Blaser]", "Link": "http://www.chicagotribune.com/suburbs/evanston/lifestyles/ct-evr-blaser-donald-trump-tl-0910-20150903-story.html", "Title": "[Randy Blaser: Donald Trump phenomenon is nothing new]"}