{"Content": "[The devil is not in the details. Its in the entire conception of the Iran deal, animated by President Barack Obamas fantastical belief that he, uniquely, could achieve detente with a fanatical Islamist regime whose foundational purpose is to cleanse the Middle East of the poisonous corruption of American power and influence. In pursuit of his desire to make the Islamic Republic into an accepted, normalized \"successful regional power,\" Obama decided to take over the nuclear negotiations. At the time, Tehran was reeling the rial plunging, inflation skyrocketing, the economy contracting under a regime of international sanctions painstakingly constructed over a decade. Then, instead of welcoming Congress attempt to tighten sanctions to increase the pressure on the mullahs, Obama began the negotiations by loosening sanctions, injecting billions into the Iranian economy (which began growing again in 2014) and conceding in advance an Iranian right to enrich uranium. Its been downhill ever since. Desperate for a legacy deal, Obama has played the supplicant, abandoning every red line his administration had declared essential to any acceptable deal. Inspections, They were to be anywhere, any time, unimpeded. Now? Total cave. Unfettered access has become \"managed access.\" Nuclear inspectors will have to negotiate and receive Iranian approval for inspections. Which allows them denial and/or crucial delay for concealing any clandestine activities. To give a flavor of the degree of our capitulation, the administration played Irans lawyer on this one, explaining that, after all, \"the United States of America wouldnt allow anybody to get into every military site, so thats not appropriate.\" Apart from the absurdity of morally equating America with the worlds foremost state sponsor of terrorism, if we were going to parrot the Iranian position, why wait 19 months to do so after repeatedly insisting on free access as essential to any inspection regime?, Coming clean on past nuclear activity, The current interim agreement that governed the last 19 months of negotiation required Iran to do exactly that. Tehran has offered nothing. The administration had insisted that this accounting was essential because how can you verify future illegal advances in Irans nuclear program if you have no baseline?, After continually demanding access to their scientists, plans and weaponization facilities, Secretary of State John Kerry two weeks ago airily dismissed the need, saying he is focused on the future, \"not fixated\" on the past. And that we have \"absolute knowledge\" of the Iranian program anyway a whopper that his staffers had to spend days walking back. Not to worry, we are told. The accounting will be done after the final deal is signed. Which is ridiculous. If the Iranians havent budged on disclosing previous work under the current sanctions regime, by what logic will they comply after sanctions are lifted?, Sanctions relief, These were to be gradual and staged as the International Atomic Energy Agency certified Iranian compliance over time. Now were going to be releasing up to $150 billion as an upfront signing bonus. Thats 25 times the annual budget of the Iranian Revolutionary Guard. Enough to fuel a generation of intensified Iranian aggression from Yemen to Lebanon to Bahrain. Yet three months ago, Obama expressed nonchalance about immediate sanctions relief. Its not the issue, he said. The real issue is \"snap-back\" sanctions to be reimposed if Iran is found in violation. Good grief. Iran wont be found in violation. The inspection regime is laughable and the bureaucratic procedures endless. Moreover, does anyone imagine that Russia and China will reimpose sanctions? Or that the myriad European businesses preparing to join the Iranian gold rush the day the deal is signed will simply turn around and go home?, Non-nuclear-related sanctions, The administration insisted that the nuclear talks would not affect separate sanctions imposed because of Iranian aggression and terrorism. That was then. The administration is now leaking that everything will be lifted. Taken together, the catalog of capitulations is breathtaking: spot inspections, disclosure of previous nuclear activity, gradual sanctions relief, retention of non-nuclear sanctions. Whats left? A surrender document of the kind offered by defeated nations suing for peace. Consider: The strongest military and economic power on Earth, backed by the five other major powers, armed with what had been a crushing sanctions regime, is about to sign the worst international agreement in American diplomatic history. How did it come to this? With every concession, Obama and Kerry made clear they were desperate for a deal. And they will get it. Obama will get his \"legacy.\" Kerry will get his Nobel. And Iran will get the bomb. Charles Krauthammer is a Washington Post columnist. Washington Post Writers Group, letters@charleskrauthammer.com]", "Date": "20150702", "Author": "[Charles Krauthammer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-nuclear-bomb-kerry-obama-sanctions-perspec-0703-20150702-story.html", "Title": "[The worst agreement in U.S. diplomatic history]"}