{"Content": "[At the first glimpse of the rumpled 73-year-old senator from Vermont, the standing-room-only crowd at a historic inn here on Sunday morning erupted leaping up, waving signs and breaking into chants of \"Bernie, Bernie, Bernie!\", The scene has become a familiar one as Bernie Sanders makes a most unexpected surge in his bid for the Democratic presidential nomination. Sanders a self-described democratic socialist has seen his crowds swell and is gaining ground in the polls on the formidable Democratic front-runner, Hillary Rodham Clinton. In New Hampshire, where Sanders was on yet another weekend swing, one survey last week showed him within 8 percentage points of Clinton. Sanderss emerging strength has exposed continued misgivings among the partys progressive base about Clinton, whose team is treading carefully in its public statements. Supporters have acknowledged privately the potential for Sanders to damage her perhaps winning an early state or two even if he cant win the nomination. \"Hes connecting in a way that Hillary Clinton is not,\" said Burt Cohen, a former New Hampshire state senator and Sanders supporter who attended Sunday mornings event, where a nasty rain didnt seem to deter many people from coming. \"Hes talking about things people want to hear. People are used to candidates who are calculated, produced and measured, and they see through that. Bernies different.\", During his hourlong stump speech here, Sanders railed against the \"billionaire class\" and pledged to make large corporations pay their fair share of taxes if he becomes president. But much of his message focused on improving the lot of the lower and middle classes by providing free college; guaranteeing workers vacation time, sick leave and family leave; and raising the minimum wage to $15 an hour. \"I dont believe it is a terribly radical idea to say that someone who works 40 hours a week should not be living in poverty,\" Sanders told a crowd of about 300 people. For all the excitement surrounding his grass-roots effort, Sanders still faces significant skepticism from party elites and even from some of his supporters about whether he can advance beyond being a summer sensation. Some suggest he could fade as voters think more seriously about who they want as their nominee, and even Sanders acknowledges that money could become an issue once the contest moves to bigger states, where television advertising is more essential. Sanders also has said that his campaign has a lot of work to do to connect with minority voters. Although he has a long history on civil rights, Sanders represents a state that is 95 percent white, and he remains largely unknown among African-Americans a crucial constituency in South Carolina and other states on the primary calendar following Iowa and New Hampshire. Ultimately, Sanderss fate may rest with voters like Beth Powers, who sat in the bleachers on Saturday at a Nashua community college gymnasium, where Sanders kicked off his seven-stop Granite State swing before a crowd of more than 500 people. \"I love Hillary, but I like that fact that Bernie is a populist, and hes saying a lot of important things,\" said Powers, 48, a high school teacher in nearby Milford who started learning about Sanders on Facebook through postings by friends and liberal media sites she follows. Powers said shes leaning toward Sanders but admitted being a little torn: \"Im a realist. In terms of money and networking, hes got some real ground to make up. If people like me dont come out for him, he doesnt have a chance.\", Nathan Retelle, who was sitting nearby, was perhaps more representative of those in the gym. His mind is firmly made up. \"Ive never been able to vote for anybody before who I actually wanted to win,\" said Retelle, 30, who works in the health-care information-technology field and drove to the event from Methuen, Massachusetts. \"For the longest time, its been different politicians doing only slightly different things.\", Retelle said he sees Clinton as \"a fully entrenched creature of the political establishment. My impression is shell say whatever she needs to say at the moment.\", Clintons advisers had long planned for a populist challenge from her left, perhaps from Sen. Elizabeth Warren, D-Mass. Sanders appears to be the heir to populist support for Warren, who took herself out of the race before Clinton entered it in April. Sanders routinely praises Warren in his stump speech. Some Clinton supporters had months ago identified former Maryland governor Martin OMalley as the potential challenger with the greatest appeal. Although OMalley who campaigned in Iowa on Sunday is running as a populist to Clintons left, he is polling far behind Sanders and still working to introduce himself to voters. The Clinton campaign declined to discuss Sanderss candidacy on the record, but the strategy is plain: She will not attack him she has yet to mention him on the campaign trail and will stick to her plan to roll out her policy agenda in phases this summer. Clinton loyalists note that she has taken liberal positions on issues including immigration reform, voting rights and same-sex marriage, and is expected to follow suit with proposals affecting college affordability and student debt, raising the minimum wage and expanding paid leave. Clintons focus on race relations and gun control since the Charleston, South Carolina, massacre also provides an implicit comparison with Sanders, who has no broad base of support among African-Americans in large urban areas and the South. Clinton also has called for national gun control, while supporters pointed out Sanderss uneven record on the issue. The Clinton campaign is betting that as she builds a progressive platform, Sanderss appeal will wane at least among those attracted to him primarily because of his ideological credentials. Sanders supporters drawn more by distaste for a Clinton coronation may be a different story. One prominent Clinton booster, Sen. Claire McCaskill, D-Mo. appeared to dismiss Sanders as a flash in the pan during a television appearance last week. \"Any other candidate that has the numbers that Hillary Clinton has right now would be, you know, talked about as absolutely untouchable, and all of a sudden, Oh, Bernie, Bernie, Bernie, \" McCaskill said on Thursday on MSNBCs \"Morning Joe.\", \"Its not unusual for someone who has an extreme message to have a following,\" she said. In an interview over the weekend, Sanders said some in Washington have misjudged the potential breadth of his support and are wrongly suggesting that his appeal is limited to liberal activists. \"The truth is, the vast majority of the voters in this country are middle-class and working-class people,\" Sanders said. \"I think the vast majority of those people are totally frustrated with a political system in which big money buys elections, and theyre totally disgusted with our countrys economics. . . . If we can get through to those people, not only will we win the Democratic nomination, were going to win the general election as well.\", Sanders said part of his appeal will be the consistency of his record on issues on which others are now sounding a lot like him. During his appearances over the weekend, for example, he brought up the Supreme Courts decision on Friday making same-sex marriage legal in all 50 states a ruling that Clinton and the other Democrats touted. In the same breath, Sanders also repeatedly cited his 1996 vote in Congress against the Defense of Marriage Act, a law signed by President Bill Clinton, which defined marriage for federal purposes as the union of one man and one woman and allowed states to refuse to recognize same-sex marriages granted by other states. \"It is one thing now for every politician in the world, at least on the Democratic side, to be wildly enthusiastic about gay rights,\" Sanders said. \"That wasnt the case back in 1996. . . . You can come up with any position you want today, but people have a right to know: Have you been consistent?\", ---, Gearan reported from Washington.]", "Date": "20150628", "Author": "[John Wagner and Anne Gearan]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-bernie-sanders-hillary-clinton-20150628-story.html", "Title": "[In Bernie Sanders, an unlikely but real threat to Hillary Clinton]"}