{"Content": "[Jamie Womacks Friday schedule looked something like this: six back-to-back meetings starting at 7:30 a.m. without a moment for a bathroom break. But around noon, while many Chicago cubicle dwellers gazed longingly out the window, Womack and many of her colleagues at CareerBuilder called it a day. Summer hours, a perk the company offers during July and August, had officially kicked off and Womack planned to spend Friday afternoon, generally \"a pretty unproductive time\" at the office anyway, getting a haircut and getting home early to spend time with her two sons. \"That Friday morning becomes that much more productive because youre trying to get everything done in a half day,\" said Womack, vice president of marketing at CareerBuilder. Chicago-based CareerBuilder is among a minority of companies with formal policies allowing their employees to shorten their workweeks during the summer, a benefit managers say boosts morale and retention in an era when flexible work schedules have become an increasingly sought-after benefit. In an annual survey, the Society for Human Resources Management found that the flexibility to balance work and life was very important to job satisfaction for 55 percent of employees last year, up from 45 percent the previous year. And among workers who plan to stay at their jobs, work-life flexibility was the second-most cited reason for staying, after pay. Yet only 14 percent of employers nationwide offer seasonal scheduling like summer hours, a share that has been consistent over the past five years, according to a recent survey by the trade group, which polled 463 human resources professionals. Other surveys suggest the practice could be on the rise: About 21 percent of organizations plan to offer their employees early Friday exits or other flexible work hours this summer, while 12 percent actually extended the benefit in 2012, according to CEB, a business research and advisory firm that polled 200 human resources leaders over the past two months. (It should be noted that intentions are often loftier than reality: 30 percent of companies intended to offer it in 2012, and less than half actually did.) , Brian Kropp, human resources practice leader at CEB, said that employers without summer hours \"are still missing an opportunity to improve employee engagement and to demonstrate their appreciation for employees efforts in a low-cost way.\", But some research suggests they may not be all theyre cracked up to be. A 2012 study by Captivate Network, a digital media company, found that 53 percent of employees who left early on Fridays during the summer reported a drop in their productivity, and 23 percent who made up for those short days by working longer Monday through Thursday reported increased stress levels. That exacerbates general sluggishness during the summer, when productivity slips 20 percent, attendance dips 19 percent and distraction soars 45 percent, the survey said. Talk to Chicago-area companies with summer hours, however, and you get a much different story. At CareerBuilder, where all 2,146 employees in its North American offices are encouraged to leave at noon on summer Fridays, the policy was first implemented five years ago as a morale booster when the down economy made for tough times at the recruiting firm, Womack said. But as employees shared news of the perk on their social networks, \"we kept it because honestly it became social proof that we care about our employees,\" she said. Unlike some companies that require employees to log longer hours on other days to compensate for an early Friday exit making for more of a shifted workweek than a shortened one CareerBuilder pays people for 40 hours even if they only work 35. There were initially concerns about whether shorter hours would allow the company to properly service clients, but it has received no negative feedback from clients, and teams ensure that there is coverage if necessary so customers arent left in a lurch, said Jade Augustine, vice president of human resources for CareerBuilder North America. \"We really empower the employees to manage their time,\" Augustine said, and there is motivation to be particularly efficient the rest of the week to guarantee an early escape. \"If at any point it feels as though its not being managed properly, the manager is there to work with them.\", Employees were skeptical at first that they could really leave early without penalty, Augustine said, so managers were encouraged to head to doors at noon to set an example, even if it meant taking unfinished work home or to the coffee shop around the corner. \"We tell (managers), even if you are working, do it not here so that people dont think youre still here,\" Augustine said. Now, she said, its rare to find anyone at their desks Friday afternoons. While the impact of summer hours is difficult to measure, Augustine said they are a popular selling point for recruiters when they talk to prospective candidates, and the perk ranks highly in the annual employee engagement surveys. At Morningstar, which offers summer hours between Memorial Day and Labor Day in the U.S. and some variance of the policy in other countries, employees are still expected to work a full 40-hour week, but they can shift the work so they take off Friday afternoon, said Bevin Desmond, head of human resources and global markets. The malleability fits into the investment companys general trust-based time-off policy, she said. Morningstar employees dont get a set number of sick days or vacation days but are given guidelines (average vacation time: three weeks) and trusted to do whats best for them. Morningstar introduced summer hours at least 15 years ago on a team-by-team basis, but five years ago it made it a companywide policy for consistency, Desmond said. It looks different for everyone: At least half of Chicago employees are gone after lunchtime Friday, others stay until 2 p.m. and some teams that are more tied to a schedule or need to be accessible, like a product support team or public relations, make sure someone sticks around. \"Its definitely something everyone looks forward to,\" Desmond said, particularly in Chicago, where \"its so lovely in the summer compared to the rest of the year.\", The summer hours policy at Omron Automation and Safety, an industrial automation company with U.S. headquarters in Hoffman Estates, has been so positive that this year they started it in June rather than July, said Marc Klemencic, human resources manager for the U.S. division. The policy, in place until Labor Day, allows employees to work one 4-hour day per week if they work 9-hour days the other four days, he said. The shortened day can be any chunk of time on any day. The company doesnt allow people to work 10-hour days to take a whole day off. The policy requires some oversight by managers to ensure their entire department isnt off at the same time. Omron started the policy about five years ago when \"we saw there was a shift in the working parent\" and a greater desire for work-life balance, particularly in the summer when families take vacation, Klemencic said. He said it has been a good recruiting tool, productivity has not dropped, and it has contributed to an average 7.5-year employee tenure with the company and a turnover rate of less than 10 percent. \"Companies want productivity, but productivity doesnt mean anything if you dont have a happy workforce,\" Klemencic said. aelejalderuiz@tribpub.com, Twitter @alexiaer]", "Date": "20150713", "Author": "[Alexia Elejalde-Ruiz]", "Link": "http://www.chicagotribune.com/business/ct-summer-hours-0712-biz-20150710-story.html", "Title": "[ Shorter summer work hours: A perk or a stress creator?]"}