{"Content": "[Cubas blue, red and white-starred flag is set to fly outside the countrys diplomatic mission in the United States for the first time since the countries severed ties in 1961. While no formal ceremony is planned Monday for the U.S. Interests Section in Havana, it too will become a full-fledged embassy just after midnight as the Cold War foes formally enter a new era of engagement despite what remains a deep ideological gulf. \"Its a historic moment,\" said longtime Cuban diplomat and analyst Carlos Alzugaray, adding that now the truly hard work begins: Resolving thorny disputes such as mutual claims for economic reparations, Havanas insistence on the end of the 53-year-old trade embargo and U.S. calls for Cuba to improve on human rights and democracy. \"The significance of opening the embassies is that trust and respect that you can see, both sides treating the other with trust and respect,\" Alzugaray added. \"That doesnt mean there arent going to be conflicts there are bound to be conflicts but the way that you treat the conflict has completely changed.\", Cuba plans a solemn morning ceremony at its stately mission in Washington with some 500 guests, including a 30-member delegation of diplomatic, cultural and other leaders from the Caribbean nation, headed by Foreign Minister Bruno Rodriguez. The U.S. government will be represented by Assistant Secretary of State for Western Hemisphere Affairs Roberta Jacobson, who led U.S. negotiators in six months of talks leading to the July 1 announcement that embassies would reopen, and Jeffrey DeLaurentis, the U.S. Interests Section chief in Havana who will now become charge daffaires. Rodriguez is scheduled to meet later in the day with U.S. Secretary of State John Kerry. Officials say the U.S. Interests Section in Havana will not immediately raise the stars and stripes, instead waiting for a formal ceremony expected to be presided over by Kerry in August. But theyve already drilled holes on the exterior to hang signage flown in from the U.S. and arranged to print new business cards and letterhead that say \"Embassy\" instead of \"Interests Section.\" What for years was a lonely flagpole outside the glassy six-story edifice on Havanas seafront Malecon boulevard recently got a rehab, complete with a paved walkway. Every day for the last week, employees have been hanging hand-lettered signs on the fence counting down, in Spanish, to Monday: \"In 6 days we will become an embassy!\" and so on. The missions Facebook account also celebrated by posting a series of pre-1959 revolution photos of the U.S. diplomatic presence in Havana. On one recent day it uploaded an image of the Swiss flag with the word \"Gracias!\", Both interests sections have technically operated under the aegis of \"protecting power\" Switzerland; the Swiss also were caretakers for the former American Embassy and ambassadors residence from 1961 to 1977, when the U.S. had no diplomatic presence in the country at all. Havana, too, has been sprucing up the surrounding streets in anticipation of a flood of media cameras, painting curbs and lampposts and scrubbing sentry stations. At least one residential building across the street also got a fresh coat of paint. But the main action Monday will be in Washington. Among the attendees will be Cuban singer-songwriter Silvio Rodrigez, former parliament president Ricardo Alarcon, Havana City historian Eusebio Leal and the artist Kcho. \"It is going to be a celebration on our part,\" said Gustavo Machin, deputy director for U.S. affairs at Cubas Foreign Ministry. Machin also said many Americans who have worked to cultivate U.S.-Cuba ties over the years have been invited. Wayne Smith, a former U.S. diplomat who was serving in Havana when relations were cut and returned in the late 1970s as chief of mission, confirmed hes on the guest list: \"Wouldnt miss it!\", Smith, an outspoken critic of U.S. policy on Cuba, said he left the foreign service in 1982 because it became clear to him Washington was not going to move toward engagement with Havana. So the events since Decembers historic announcement have been personally rewarding. \"I disagreed with the Cuban system and all of that, but it seemed to me we could have accomplished more through dialogue than through simply refusing to talk, maintaining a constant embargo and really just a totally hostile policy,\" Smith said. \"But thats what we did, year after year after year, the same old thing, and it gained us nothing.\", Associated Press]", "Date": "20150719", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-united-states-cuba-relations-20150719-story.html", "Title": "['Historic moment' comes Monday as U.S., Cuba reopen embassies]"}