{"Content": "[With Gov. Bruce Rauner and House Speaker Michael Madigan willing to wage war on behalf of the middle class, those of us in that group ought to feel like the prettiest girl in school being coveted by the most popular boys. By that I mean you ought to be suspicious of their motives because this isnt about our charming personalities or the color of our eyes. These two guys are after something that would be a lot more obvious if they were teenagers. Politicians always claim to be fighting each other on behalf of the middle class these days. Republicans and Democrats claim thats all they think about. There was standoff in Springfield May 31, 2015, as lawmakers went home without passing Governor Rauners proposals. Rauner speaks to WGN about what is really happening in Springfield on June 1, 2015. (WGN TV), There was standoff in Springfield May 31, 2015, as lawmakers went home without passing Governor Rauners proposals. Rauner speaks to WGN about what is really happening in Springfield on June 1, 2015. (WGN TV), As someone who has been middle class all of this life (based on U.S. Census data), I know one thing for sure what theyre talking about isnt me. In case you havent heard, as the Illinois Legislature adjourned its spring session, Madigan (the state Democratic Party chairman) said he opposed workers compensation reform because the middle class needed to know they would be compensated if injured on the job. The governor said he was the true protector of the middle class, as he wages war with the \"political class\" in Illinois. \"Speaker Madigan and (Senate President John) Cullerton make their money from big government, and big government is crushing the state,\" Rauner said. Actually, I though it was the roughly $100 billion pension debt that was crushing the state created by Republican and Democratic political leaders who over about 25 years refused to make the states required payments into its pension funds and also borrowed money from the funds. But Im just a middle-class guy and not as smart as Madigan, D-Chicago, whos a millionaire, or Rauner, something close to a billionaire. Its odd how people who are not middle class are always telling me and other middle-class people what they need. I tried to find out what \"middle class\" means and discovered that almost every authority agreed on one thing there is no single definition of middle class. Some economists argue that if you take away the top 25 percent and bottom 25 percent of wage earners in the country, you are left with the middle class. I found one definition that said people in the middle class are those with household incomes from $35,000 to $100,000 a year. Another source said the U.S. Census Bureau defines middle class as having an income of $40,000 to $80,000 a year, which sounded reasonable to me. But there are definitions of middle class that include lower-income middle class and upper-income middle class that stretch the definition far beyond those figures. Republican presidential candidate Mitt Romney said people earning up to $250,000 a year were middle class. President Barack Obama at one time suggested that people making $200,000 a year were middle class. Suddenly, this middle-class kid of working parents, who has felt neglected by those fighting for the poor and those fighting on behalf of the rich, feels neglected. Sort of like the middle kid. But politicians are always talking about the middle class and how theyre battling on their behalf. Take Rauner and Madigan. Rauners priorities now, according to numerous reports out of Springfield, are workers compensation reform, tort reform, term limits, a constitutional amendment on legislative redistricting and limiting the ability of unions to collectively bargain on health insurance. If someone had asked me to list my top five priorities as a middle-class American, only health insurance would have made the list. I think Im in the majority when I say most middle-class Americans are primarily worried about job security and wages. Not the minimum wage, which is what politicians always talk about, but a living wage. By that, I mean enough money to support your family, save for retirement, put away some for the kids college education and have enough left over to maybe go on vacation once a year. Politicians talk a lot about creating jobs but rarely talk about the problem of keeping people in the jobs they have now. I mean, if a guy works hard, does his job well and his employer continues to make a profit, he ought to feel hes going to be able to continue working for the next year and maybe even get a pay raise. But thats not the case. Companies get bought up by other companies and the mergers result in layoffs. Companies that are making money move overseas to make even more money, creating more unemployed Americans. And companies making money sometimes lay off workers simply because their profits have declined from year to year or quarter to quarter, and their stockholders are unhappy. So people in the middle class keep losing their jobs or see their friends and neighbors losing jobs, and so they worry about their jobs all the time. When politicians talk about the middle class it seems like theyre always talking about people who hate a lot of other people. The appeal is to people who hate the poor for being lazy and eating up their tax money, or they hate the rich for making lots of money at the expense of the working class or they hate immigrants (usually Hispanics) for coming here illegally or blacks (for demanding equal rights) or women (for demanding equal pay) or Muslims (because of terrorists). Im not sure anyone can really speak for all middle-class people. I mean, were all different. Im sure there are some folks who will disagree about my comments regarding job security, although I feel confident a lot more middle-income people care about that than tort reform. Tort reform is one of the governors top priorities. I doubt most middle-class people could tell you what tort reform means, but its basically limiting the amount that people can get by filing lawsuits. That may be a priority of big business, and Rauner may believe it would lead to more companies locating in Illinois or staying here. But its not going to make the top 10 (top 100?) complaints of middle-class wage earners. As for Madigan, if he were really worried about the middle class he might have done something to stop elected officials in this state from pilfering the pension funds. Rauner is right when he notes that Madigan has been the one constant in Illinois through the states budget mess. Madigan is a hypocrite to be whining about working people having to go to emergency rooms or being on the Medicaid rolls if they dont get adequate compensation from on-the-job injuries. As a middle-income American, I find myself worrying as much about the stock market as anything these days. Thats because my 401(k) retirement plan is pretty much tied to the performance of the market. So now, when companies cut their payroll, laying off hundreds or thousands of middle-income Americans, I can watch my stocks go up. If a U.S. corporation moves its headquarters overseas and sees a giant tax savings as a result, I benefit as a middle-class American. Hypocrisy is not just a flaw in the character of politicians, its become a national compulsion. What people really want from their governments is responsible adult behavior. Dont spend more money than you have. Dont give my money to your friends and campaign contributors. Make sure the programs that you spend money on actually do what they are supposed to do. Dont steal. Dont cheat. Dont lie. And dont pick fights over stuff that really doesnt matter to most people to gain some political advantage, when all it does is distract from all those other issues and stifle progress. I realize that my recommendations are far too difficult to implement. Its far easier to continue the old ways of doing things. Of course, that ultimately results in nothing of substance getting done. That wont stop anyone in Springfield from telling you they represent the middle class. pkadner@tribpub.com]", "Date": "20150601", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/opinion/ct-sta-kadner-middle-st-0602-20150601-story.html", "Title": "[Champions of the middle class in Springfield ]"}