{"Content": "[Chicago Public Schools unveiled a budget Monday meant to pressure Gov. Bruce Rauner and state lawmakers into providing nearly a half-billion dollars in pension relief, a gambit school officials warn will bring painful cuts if help doesnt arrive by Jan. 1. In addition to help from the state, the $5.7 billion operating budget relies on extensive borrowing, an influx of tens of millions in dollars in surpluses from special city taxing districts and an increase of the districts property tax. \"We cannot cut our way to a balanced budget,\" said Chicago schools chief Forrest Claypool in a call with reporters. \"Unfortunately, if Springfield fails to do its part, we will be forced to close a $500 million gap later this year with a mixture of more unsustainable borrowing and even deeper cuts.\", And if Springfield does comes through which is far from a sure thing Claypool said the district would still need concessions from unions and larger tax hikes in years to come to keep up with the cost of ballooning pension payments. \"Theres lots of paths to a final solution, but all of them have to be worked,\" Claypool told the Tribunes Editorial Board on Monday. \"Springfield is still in stalemate. We need some time for them to get past their own issues to deal with this.\", The districts appeal for $480 million in pension relief from Springfield comes at a difficult time. The Republican governor and Democrats who control the legislature are deadlocked over the states own spending plan as Illinois government continues to spend more than it takes in. Rauner says hes willing to help CPS but in return wants to build in union-weakening provisions that would apply to all Illinois school districts a point he reiterated at a news conference called hours after the release of CPS proposed budget. \"The power of the teachers union has been overwhelming,\" Rauner said. \"Chicago has given and given and given. Its created a financial crisis that the Chicago schools face now.\", Laurence Msall, president of the nonpartisan Civic Federation budget watchdog group, called the districts spending plan \"enormously risky.\", \"Its difficult to even call it a budget because it has a half-billion dollar hole that the district hopes will be filled by Springfield and we have seen little positive evidence that that will happen,\" Msall said. \"To call this spending plan a budget challenges the common notion of having your expenses match your known revenue.\", Spending in theproposed operating budget is down about $68 million from last year, officials said. The district earlier this year said it was making $200 million in budget cuts that included the elimination of about 1,400 jobs. On Monday, the district said about 480 teachers will be laid off, though those teachers can apply to fill some of the 1,450 teaching vacancies anticipated before school starts. The budget crisis comes amid difficult talks with the Chicago Teachers Union over a new contract. CTU President Karen Lewis called the budget proposal as \"a lot more spin than anything.\", \"I think part of the problem (relies) on the monies they claim are there arent really there,\" Lewis said of the budget. \"And how do you budget when youve got a $500 million hole? So youre going to start school and in November run out of money? Then what?\", Talks with the CTU over a one-year deal broke down last week, and the district is now seeking a multiyear deal. While not on the table this year, Claypool has made clear he will ask teachers to begin picking up the full share of their pension contributions. District officials said the long-standing practice of paying the bulk of teacher contributions will cost nearly $134 million. To help patch over a budget gap the district said exceeds $1.1 billion, CPS will raise its property taxes to the maximum amount allowable resulting in a $19 tax bill bump for the owner of a $250,000 home, the district said while pushing $200 million in debt into the future. CPS plans to borrow $200 million in order to make its $539 million annual debt payment a growing obligation that stems from years of questionable borrowing. By borrowing again to pay off the debt, a maneuver nicknamed \"scoop and toss\" because it scoops up debt payments as they come due and tosses them into the future, CPS is adding to its overall interest payments. By resorting to \"scoop and toss,\" along with another $54 million in one-time transfers from other district accounts, CPS says it can free up more than $250 million in classroom funds that would have otherwise gone to pay off debt. \"We recognize that this is not sustainable in the long run,\" said Ginger Ostro, the districts chief financial officer, who also was at the Editorial Board on Monday. \"But its one of the choices we had to make in this budget in order to avoid cuts to the classroom.\", Ostro, like Claypool, conceded that pushing debt into the future at higher cost and using one-time revenue to cover other debt payments is not a sound financial practice, but said it was necessary to avoid even steeper education cuts. The districts cash flow struggles will only be manageable in the coming year thanks to $935 million worth of short-term credit authorized by the school board in June, Ostro said. Those loans are secured on the promise of future property tax revenue. Claypool floated another idea to help pay for teacher pensions: restoring a property tax levy dedicated to teacher pensions that would generate an estimated $170 million. Such a dedicated levy existed in Chicago before 1995, and Claypool said restoring it would be the last component of a bargain with lawmakers to have the state pay more into the pension fund and with teachers to eventually make their full pension contributions. Claypool said the district has until the beginning of the 2016 calendar year to determine a way forward. \"Were making no apologies for buying time,\" he said at the Editorial Board, defending the bet on Springfield by arguing the alternative would diminish public education in the city. Ostro conceded that if Springfield rebuffs the request for help by Jan. 1, the ensuing cuts will be deeper than if they were spread across the entire budget year. \"Obviously, implementing cuts mid-year to get the same dollar amount, means more later in the year than it does in the beginning,\" Ostro said. \"And thats why were buying time to get a structural solution, so we dont have to go down that path.\", Public comment on the budget will be taken at three meetings around the city Aug. 18. The budget will be presented to the Board of Education at its Aug. 26 meeting. Chicago Tribunes Tony Briscoe and Rick Pearson contributed. jjperez@tribpub.com, hdardick@tribpub.com, hgillers@tribpub.com, Twitter @perezjr, Twitter @reporterhal, Twitter @hgillers]", "Date": "20150810", "Author": "[Juan Perez Jr., Hal Dardick, Heather Gillers]", "Link": "http://www.chicagotribune.com/news/ct-chicago-schools-budget-met-0811-20150810-story.html", "Title": "[CPS' $5.7 billion spending proposal relies on $480 million from Springfield]"}