{"Content": "[When Cubas foreign minister raised his nations single-star flag outside its newly opened embassy in Washington last month, construction equipment giant Caterpillar did the same outside its Peoria headquarters. Caterpillar is one of a growing number of Illinois and Chicago-area companies, civic organizations and cultural institutions rushing into a nationwide race to establish a foothold in the tiny communist country just 90 miles off the Florida shore a potential trove of new profits on an island that has been off-limits, for the most part, for more than a half-century. \"Just about everybody focuses on the tens of thousands of 60-year-old cars that are on the streets, but for Caterpillar, we focus on the 60-year-old roads they are being driven on. Thats where we see our opportunity,\" said Bill Lane, the companys director of global government affairs. Though a 54-year-old embargo on trade and travel remains in place, President Barack Obama last December began normalizing relations with Cuba by easing trade restrictions on several sectors, including travel, telecommunications, Internet services, building equipment, banking and airlines. Exceptions for agricultural and medical products have been in place since 2000 and 1992, respectively. In May, the U.S. removed Cubas designation as a state sponsor of terrorism. And on July 20, both countries formally reopened their embassies in Havana and Washington. Now, in cities across the country, the race is on to stake a claim on Cubas future. In Illinois, farms and food companies, medical device outfits and construction firms are among those embarking on scouting missions. But companies elsewhere are just as eager. From the tech-heavy Bay Area, Airbnb established operations on the island April 2, just four months after Obama and Cuban President Raul Castro announced in mid-December that they would restore diplomatic relations one of the first U.S. companies to dive in. Google executives visited in June to advocate for open Internet access. New York Gov. Andrew Cuomo flew in for a 26-hour trade mission in April, the first sitting U.S. governor to visit since the December announcement. And in Tampa, Fla. once a fundraising hub for Cuban independence hero Jose Marti, officials are pushing for a Cuban consulate. Chicago businesses and investors \"better learn, and we better learn fast, because others are looking,\" said local attorney Patrick Croke, who assists companies in entering Latin America. \"Im sure New York and Miami will be all over this.\", Entering the Cuban market remains a daunting task, even for businesses with a presidential green light to proceed. Payment and shipping restrictions, for instance, put U.S. firms and farmers at a disadvantage to foreign rivals a situation that has caused Illinois growers to lose most of their Cuba export business to Asia and Brazil over the past decade. And \"at the end of the day, its an island with 11 million residents with limited spending capacity,\" said Matthew Aho, a consultant in the Cuba practice of law firm Akerman. \"Its important to remember Cuba is a communist country in which the government controls the vast majority of the economy, so its a different operating environment, to say the least.\", Still, getting in first is often critical to winning business in an emerging market, said Aho, who assisted Airbnb on its entry into Cuba. \"I think well see a lot of jockeying by U.S. businesses now.\", Many companies \"want to push the envelope to see how far this administration is willing to go,\" said Janet Kim, head of the international trade practice at law firm Baker & McKenzie. \"Once you open Cuba, it becomes yet another entry point for South America and South America is a huge market for the Midwest,\" said Theresa Mintle, president of the Chicagoland Chamber of Commerce. At the moment, Cuba is a small and shrinking slice of business for Illinois, just $3 million in exports last year, mostly chicken parts. But observers see potential for significant growth and say the state has some competitive advantages. While Florida is just 90 miles from Cuba and home to 70 percent of Cuban-Americans, it also has an acrimonious history with its Caribbean neighbor. Illinois has a small Cuban-American population but \"has long been at the forefront of engagement,\" Aho said. \"Since 2001, when food and agriculture products were authorized for export, Illinois farmers and farm exporters have been actively pursuing contracts in Cuba.\", Former Illinois Gov. George Ryan led a delegation of government, business and academic leaders there in 1999, the first sitting governor to visit since revolutionary leader Fidel Castro came to power in 1959. The push for business ties is widening now. Behind some of the efforts is Chicago commercial real estate broker Ruben Ruban Jr. whose father fled Cuba in 1967, at age 19, after stealthily making his way onto the U.S. naval base at Guantanamo Bay, a place of refuge. \"Hes got scars all over his back, still, from (climbing through) the barbed wire,\" Ruban said. Asked how his father feels about his sons efforts to restore commercial and cultural ties with communist Cuba, Ruban said, \"Hes actually very, very happy. ... Anything I can potentially do to help out family and the Cuban population at large, thats only a good thing.\", Along with business consultant Paul Johnson, who heads a statewide group focused on building ties with Cuba, Ruban is working on several initiatives. Plans in the works include bringing in a Cuban delegation to discuss cross-border commerce at a Chicagoland Chamber of Commerce forum this fall; organizing an agriculture-oriented trade mission, potentially led by Lt. Gov. Evelyn Sanguinetti and U.S. Reps. Rodney Davis and Cheri Bustos in October; and crafting a telecommunications- and medical-focused trade mission in December. \"In order for us to increase trade between both countries, we have to compete with existing relationships that Cuba has such as with Brazil, Argentina, Canada, Russia and China,\" Johnson said. Independently, a number of local companies and industries are joining the race. Burr Ridge-based Grafton Medical Alliance, which sells implants used in spinal surgeries, plans a trip to Cuba this summer to meet with hospital administrators and surgeons. The markets potential \"is an eye-opener for any entrepreneur,\" said Jim Henry, president of the firm, which started in a garage four years ago and expects $12 million in sales this year. Meanwhile, American tourism is surging since Obama eased travel restrictions late last year, rising 36 percent, to 51,458 visitors, from Jan. 1 to May 9, according to The Associated Press. Plans for cultural exchanges are on the rise, with groups such as the Chicago Childrens Choir planning a trip next year. \"We believe music is that cultural bridge,\" said Josephine Lee, the choirs president and artistic director. Touring \"is life-altering for our kids and for the people they visit.\", As Cuba prepares for the influx of tourists, Illinois businesses see related opportunities, particularly if trade restrictions are eased further. Roy Donoso, whose companies in Chicago and throughout Latin America consult on construction projects, will trek to the Cuban city of Trinidad next month. Through a company he owns in Ecuador, he is competing for a contract to provide environmental consulting on a 400-room hotel project in the Cuban city. The contract would be a small one. \"This is more of an investment in the future,\" said Donoso, president of Sumac, which specializes in energy efficiency work. \"Obviously we want to be there before anyone else.\", United Airlines is pursuing government approval to launch service to Cuba from hubs in Houston and Newark. The airline declined to comment on whether it has plans for additional routes. Meanwhile, Chicago-based consultant Charlie Serrano, who advises firms on entering Cuba and who operates tours to Cuba, hopes to launch direct charter flights from Chicago to Havana later this year. And the Illinois Corn Marketing Board just returned from a trade mission to Cuba, where its delegation of food producers met with staff members in government ministries, with the goal of fostering future business ties. \"When tourists come to Cuba they will want high-quality food, and that is what we can provide them, through pork, beef and chicken,\" said Don Duvall, a fourth-generation farmer who owns a 1,000-acre spread near the Wabash River in southeastern Illinois. He is export chairman for the corn marketing board. The corn, soybeans and wheat raised in fields just north of Shawnee National Forest are shipped out on barges that push through the Wabash River to the Ohio and then the Mississippi, ending up in New Orleans. As close as that is to Cuba, Duvall said, \"We should be the lowest-cost provider.\", Because of an array of banking and financing restrictions, however, that is not the case. Illinois farmers, like those throughout the Midwest, have seen exports to Cuba plummet since 2009. \"Cuba can buy from Brazil and pay those transportation costs, and its cheaper than getting it from 92 miles away,\" Duvall said. \"That doesnt make sense.\", Caterpillar, too, sees promise as tourism rises. \"It will require more power generation and much better infrastructure,\" said Lane, who was part of a Caterpillar team that visited Cuba in April, analyzing opportunities for its construction equipment, gas turbine engines and mining trucks. The company is pushing for an end to the embargo. \"One thing you realize when youve been down there is that just because the U.S. has not been there in 54 years, it doesnt mean your competitors have not been down there,\" Lane said. As promising as Cuba sounds, no one knows whether the recent thaw in U.S.-Cuban relations will deepen. The Cuban \"government remains wary of rapid shifts toward capitalism and is prone to backtracking on measures to liberalize the economy,\" Moodys Investors Service wrote in a June report. And the trade ban appears unlikely to be lifted by Congress anytime soon. Illinois firms, even those in sectors opened up by Obamas policy changes, say it will be difficult to capture a share of the market unless there is further loosening of trade restrictions, such as a prohibition on extending credit to Cuban customers. Sen. Dick Durbin, D-Ill. who supports an end to the embargo, thinks that goal remains within reach. He cites recent polls showing younger generations of Cuban-Americans are more open to engagement than their parents or grandparents. \"If candidates for president see that,\" he said, \"it will inspire them to support open trade., On Cuban shores, Duvall saw evidence of shifting attitudes as well. \"People were moved by our visit,\" he said. \"They were happy we were there, particularly the younger people in the ministries. They recognized that perhaps their system doesnt work and its time to move on.\", kbergen@tribpub.com, Twitter @kathy_bergen]", "Date": "20150731", "Author": "[Kathy Bergen]", "Link": "http://www.chicagotribune.com/news/globalcity/ct-race-to-cuba-met-20150731-story.html", "Title": "[ Illinois firms race to establish foothold in Cuba]"}