{"Content": "[Hillary Rodham Clinton is suffering rapid erosion of support among Democratic women -- the voters long presumed to be her bedrock in her bid to become the nations first female president. The numbers in a new Washington Post-ABC News poll are an alarm siren: Where 71 percent of Democratic-leaning female voters said in July that they expected to vote for Clinton, only 42 percent do now, a drop of 29 percentage points in eight weeks. The period since the last survey coincides with the news that the FBI is looking into the security of e-mails sent over a private server Clinton used when she was secretary of state, as well as an intense media focus on her response to the controversy. The episode has raised questions about her judgment and revived memories of the scandals that plagued the presidency of her husband, Bill Clinton, in the 1990s. The steep decline among women, sharpest among whites, is the main force driving the polls overall numbers, which show support for Hillary Clinton falling from 63 percent in July to 42 percent now. Her numbers among women have declined to the point where they are about even with her share among men. As a result, Clintons once-commanding national lead over Sen. Bernie Sanders (I-Vt.), who is running to her left, and Vice President Biden, who is considering joining the race, has been cut by two-thirds. Both men are now polling in the low 20s against her. The poll suggests that the historic significance of Clintons campaign, which holds the prospect of electing the nations first female president, is being overtaken by other forces. In the survey, Clinton received significantly higher support from non-white Democratic-leaning women, 60 percent of whom were behind her as their partys nominee. By comparison, only 37 percent of white Democratic women said they would vote for her. There was no statistically significant difference between the support she drew from women older than 50 and her standing among younger women. The doubts that many female voters now have about Clinton -- and the deep reserves of loyalty she maintains among others -- came out in conversations over the past week with more than two dozen women in Ohio and New Hampshire. They are states where Clinton had two of her biggest wins the last time she ran for the Democratic presidential nomination, in 2008. The double-digit advantage she held among women carried her to victory in both states. Maya Chenevert, a community college student in Columbus, Ohio, who works as a nanny, recalled: \"In 2008, I was only 13, but I was super excited about Hillary. Im actually amazed that Im not going to vote for her, because 13-year-old me would be so disappointed.\", Chenevert had originally hoped that she would be casting her first vote in a presidential election for Sen. Elizabeth Warren (D-Mass). With Warren taking a pass on 2016, Chenevert now thinks that Sanders offers her the greatest hope of someday being able to afford the schooling it will take to reach her dream of becoming a physician assistant. Does she want to see a woman in the White House? \"Of course. But Id rather wait another eight, or 12, or 16 years for another woman to run,\" Chenevert said. \"I totally swayed my mom, who has liked Hillary since 2008. She was so excited about a woman. She still would love to see a woman, but she doesnt think Hillary is the right woman.\", Clintons most loyal supporters, on the other hand, make the case that if a former secretary of state, senator and first lady cannot win, it will be a long time before any other woman has a realistic chance. If not Clinton, \"it says, Not in my lifetime. Thats what it seems to me, for sure. She seems so competent,\" said Ena Wilson, a retired teacher who lives near Cincinnati. At 88, Wilson can recall when abortion was illegal and unsafe, worries that Planned Parenthood is under siege and is frustrated that women still do not make as much money as men. \"I felt these issues. Ive been fighting them all my life, and I cant believe it sometimes that we havent made more progress than this,\" Wilson said. Wilson worked a phone bank for Clintons 2008 campaign, and she still meets nearly every Friday at a coffee shop with six other women with whom she bonded during that experience. They are in their late 50s and older, and call themselves Team Hillary; last week, Wilson and two of the others drove more than 100 miles to see Clinton speak in Columbus. Afterward, over lunch, they were still excited by what they had heard. \"She said -- and I believe it to my core -- I will fight for you,\" said Michele Mueller, 65, who had made the trip with Wilson. \"Thats what we want to hear.\", \"Its unfinished business,\" added their friend Joyce Shrimplin, 69, a retired high school teacher. \"What if she doesnt make it this time? Thats why our generation of women are so fervent about it.\", On the stump, Sanders also appeals to womens concerns, touting his support for abortion rights, equal pay and paid family and medical leave. \"I hope they will hear it,\" he said in a brief interview after a Labor Day campaign stop in Amherst, N.H. \"I do understand there is a desire on the part of many women, perfectly understandable, to see a woman being elected president. And we all want to see that. We want to see women hold more political offices.\", \"But I also would hope that in these enormously difficult times, where it is absolutely imperative that we stand up to the billionaire class, bring our people together to fight for a progressive agenda, that all people -- women -- look at that candidate who has the record to do that,\" added Sanders, who has a growing lead in New Hampshire polls. At the Democratic barbecue where Sanders spoke in Amherst, Sen. Debbie Stabenow (D-Mich.) made a pitch for Clinton. \"I want to have my daughter Lilly there on Inauguration Day,\" Stabenow said. \"We will have made history, and we will have let our grandchildren know they can do anything -- not because we said it, but because they saw it.\", Elise deMichael, a retiree from nearby Milford, N.H. who supports Sanders, was in the audience and agreed with Stabenow about how exciting it would be to see a woman inaugurated. \"But its got to be the right woman,\" she said. \"Hillarys so divisive. It breaks my heart for her. Im sorry shes not likeable. Its going to happen. Did we ever think there was going to be a black president?\", Clinton has told reporters who ask about the e-mail controversy: \"Nobody talks to me about it, other than you guys.\", But in the interviews with women in New Hampshire and Ohio, it came up again and again. \"Her judgment sometimes -- the e-mail thing. Theres always a smoking gun,\" said Vanessa Foley, a nurse from Milford, N.H. who wore a Bernie Sanders sticker at the Amherst barbecue. Kathy Lawson, a retired teacher, moved to New Hampshire from Maryland a decade ago to be near her grandchildren and was in the crowd at a Labor Day parade in Milford, N.H. She voted twice for President Obama, but is now leaning toward a Republican, Ohio Gov. John Kasich -- though \"if Joe Biden gets in, Im in for him.\", She is already certain how she will not vote. \"Not Hillary,\" she said. \"I dont think shes honest. I just dont want the drama we had for eight years, and weve already seen it.\", Others argue that Clintons weakness is on the issues. It took Columbus nurse Jen Kanagy 18 years to pay off her student loans. Now she worries about whether she will be able to afford to send her own 10-year-old daughter Olivia to college. She read about Clintons $350-billion college affordability plan, which would allow those repaying loans to refinance their outstanding debt at lower rates, saving an average of $2,000 over a 10-year repayment period. \"Her college plan was going to give people $17 a month,\" Kanagy said. \"What is that? Thats not even a pizza.\", Sanders, on the other hand, is promising to make public colleges and universities tuition-free, and Kanagy has become so enthusiastic that she and Olivia went to Madison, Wis. to see him speak there. \"It was like tailgating at a rock concert,\" she said. \"I see this happening. I think people are waking up.\", Clinton herself appears to recognize that as well. She is holding several weeks of rallies billed as \"Women for Hillary,\" but the message she is delivering is one that speaks to broad concerns, focusing heavily on the economic benefits of equal pay, better child care and reproductive rights. With this month marking the 20th anniversary of a speech that then-first lady Clinton gave in Beijing declaring that \"womens rights are human rights,\" the campaign is also releasing daily videos with clips from the address, which electrified the audience at the United Nations Fourth World Conference on Women. \"Her dedication to women really resonates with me, especially when it comes to equal pay and paid leave. I think its embarrassing that we dont have equal pay. I believe she is going to fix it,\" said Miranda Ross, 18, a member of the Ohio State University Democrats who worked for Obama in 2012 and expects to cast her first vote for Clinton. \"I feel like her campaign is just getting started,\" added her friend Caroline Gonzalez, 20. Some women who now find themselves unable to support Clinton insist that they continue to respect and appreciate her decades of work on the causes they share. One of them is Sylvia Gale, 66, a former New Hampshire state legislator, who stood outside an AFL-CIO Labor Day breakfast in Manchester. \"Hillary has been a strident advocate for womens rights for many years, and I will not speak against her,\" Gale said. But in her hands, she held a hand-made sign that said: \"Feminists for Bernie.\", \"Ive never been ashamed to call myself a feminist,\" Gale said. \"But because Hillary has gotten a lot of coverage in the mainstream and other media as being the womens candidate, I guess I just wanted to say -- not for all of us.\", Scott Clement and Peyton Craighill contributed to this report.]", "Date": "20150914", "Author": "[Karen Tumulty]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-clinton-poll-women-20150914-story.html", "Title": "[Poll: Sharp erosion in Clinton support among Democratic women]"}