{"Content": "[The Republican Partys presidential class demanded aggressive steps to curb illegal immigration, seizing on a delicate political issue while facing off in New Hampshire on Monday night during a crowded and pointed preview of the 2016 primary seasons first full-fledged debate. All but three of the 17 major Republican candidates for president participated in what was essentially a debate lite, which unlike Thursdays nationally televised debate in Cleveland didnt have a cut-off for participation. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. Without exception, the candidates aimed their criticism at Democrats instead of each other in a two-hour meeting where they had more in common than not. Not mentioned was the candidate making the most news headed into Thursdays debate: Donald Trump. The billionaire businessman declined to participate in Mondays gathering, but is poised to take center stage later in the week. Mondays meeting offered a prime-time practice round for the GOPs most ambitious, appearing on stage one at a time, who addressed several contentious issues, immigration topping a list that also included abortion and climate change. Former Texas Gov. Rick Perry, who may not qualify for the upcoming debate as one of the GOPs top 10 candidates in national polling, called the flow of immigrants crossing the border illegally \"a serious wound.\", \"You want to stanch the flow,\" he said as his Republican rivals watched from the front row of the crowded St. Anselm College auditorium. On those immigrants who have overstayed visas, Perry charged, \"You go find em, you pick em up and you send em back where theyre from.\", Former Pennsylvania Sen. Rick Santorum went further, calling for a 25 percent reduction of low-skilled immigrants coming into the country legally. \"Everyone else is dancing around it. Im going to stand for the American worker,\" Santorum declared. Mondays participants included seven current or former governors, four senators, a businesswoman, a retired neurosurgeon and one former senator. Trump, who launched his presidential bid by calling Mexican immigrants rapists and criminals, was among only three major candidates who didnt participate. Mondays event was broadcast live on C-SPAN and local television stations in Iowa and South Carolina states that, along with New Hampshire, will host the first contests in the presidential primary calendar next February. Just an hour before the forum began, the Senate blocked a GOP-backed bill to strip funding from Planned Parenthood, reviving a debate on social issues that some Republican officials hoped to avoid in 2016. Three of the four senators participating in Mondays event Marco Rubio of Florida, Ted Cruz of Texas and Rand Paul of Kentucky did so via satellite from C-SPANs Washington studio so they wouldnt miss the high-profile vote. \"We had to be here to vote to de-fund Planned Parenthood,\" Cruz said. Its a welcome debate for Democrats who see women married women, particularly as a key constituency in 2016. Leading Democratic presidential candidate Hillary Rodham Clinton, who would be the nations first female president, lashed out at the attacks on Planned Parenthood in a web video released before the GOP forum. \"If this feels like a full-on assault for womens health, thats because it is,\" Clinton said in the video, criticizing by name former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker and Perry. Democrats are also eager to debate Republicans on immigration. GOP leaders have acknowledged the need to improve the partys standing among Hispanic voters. Yet while many Democrats favor a more forgiving policy that would allow immigrants in the country illegally a pathway to citizenship, most Republicans in the field instead focus on border security. Rubio, once a lead salesman for a comprehensive immigration overhaul, said Americans want the border fence completed and more border security agents before theres any discussion of what to do with those 11 million immigrants in the country illegally. Others offered a softer tone. Ohio Gov. John Kasich said \"law-abiding, God-fearing\" immigrants should be allowed to stay. Those who break the law, he said, \"have to be deported or put in prison.\", Bush said fixing the nations immigration system is a key part of his plan to help the economy grow 4 percent each year. He also called for reducing legal immigration, particularly the number of people allowed to enter the country to rejoin family. President Barack Obama injected another contentious issue Monday when he unveiled new emissions limits on power plants designed to address climate change. He called it a moral obligation and warned anew that climate change will threaten future generations if left unchecked. Wisconsin Gov. Scott Walker called the move \"a buzz saw to the nations economy.\", \"I want to balance a sustainable environment with a sustainable economy,\" Walker said. Several candidates involved Monday night wont make the cut for Thursdays debate. Those on the bubble include South Carolina Sen. Lindsey Graham and former technology executive Carly Fiorina, who charged that Clinton has repeatedly lied during investigations into her use of a private email server and an attack on an American embassy in Libya while she was secretary of state. \"These go to the core of her character,\" Fiorina said. After the debate, Kasich was asked about Trumps absence. \"I never thought about him,\" the Ohio governor said. \"Itd have been great if hed have been here.\", Associated Press]", "Date": "20150803", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-gop-candidates-new-hampshire-forum-20150803-story.html", "Title": "[GOP candidates lash out at illegal immigration in New Hampshire voters' forum]"}