{"Content": "[Israeli Prime Minister Benjamin Netanyahu delivered a blistering speech to Congress on Tuesday, raising images of the Holocaust and warning that an impending nuclear deal with Iran would be worse than no deal at all. Among his objections to the deal-in-progress as it has been reported: The agreement would lift restrictions against Iran in a decade or so and would let Tehran maintain much of its growing nuclear infrastructure. How effective was Netanyahu? His speech was sufficiently compelling that a defensive White House scrambled to get President Barack Obama, who very much wants a deal with Iran, in front of TV cameras for an 11-minute rebuttal. You already know that Netanyahu spoke at House Speaker John Boehners invitation, not the White Houses, a breach of protocol that ignited a political firestorm. None of that matters now. What matters is what the prime minister achieved. Standing where Obama stands when he addresses Congress, Netanyahu offered arguments against the developing deal as it has been partially reported. In doing so, the prime minister who warned Congress about Israels ability to survive also implicitly warned Obama that history will judge him as well as any deal he approves: Netanyahu made it impossible for this president or future presidents to claim that a nuclear-armed Iran was completely unforeseen. Netanyahus political theater is an affront to the White House and what he sees as its overeagerness to reach a deal. He says that a so-called sunset clause would allow Iran to waltz free after a decade or so of restrictions, which would merely delay for \"the blink of an eye\" a nuclear-armed Iran. He suggests that instead of a time limit on the deal, the U.S. and its allies lift restrictions when Iran meets several conditions. Among them: He suggests that a deal require Iran to back off its support for terror groups across the Middle East. Another sticking point for Netanyahu: How much nuclear infrastructure should Iran be allowed to keep or operate? The more Iran has, Israel contends, the faster it would be able to break out and build a weapon, should it decide to do so. Much of any deal likely would hinge on international nuclear inspectors. Yet, as Netanyahu notes, Iran has spent many years stonewalling those international inspectors and their questions. It still is, according to a newly released International Atomic Energy Agency report. And inspections alone wouldnt stop Iran from building a bomb. Netanyahus assertion: \"Inspectors document violations they dont stop them.\", Netanyahu earned the cheers of Congress when he thanked lawmakers for decades of staunch, bipartisan support. But, he warned Israel will not remain \"passive in the face of genocidal enemies\" like Iran. It would meet Irans threat to wipe the Jewish state off the planet, he indicated, even if it stands alone. Thats a threat no president can dismiss lightly. In his rebuttal, Obama did, though, dismiss Netanyahus speech as old porridge. The president looked like a man who has tried hard to achieve something but wonders if its slipping from his grasp. Once done, a nuclear deal would be hard for Congress to undo. Obama wont invite a congressional vote and wouldnt likely win one. Theres inevitable speculation about how the next president, especially if he or she is a Republican, could try to unravel such an agreement. That uncertainty what will the next U.S. administration do? may give pause to Iranian Supreme Leader Ayatollah Ali Khamenei if he is presented with an agreement that his functionaries have negotiated with Obamas. U.S.-led and Iranian negotiators are or arent closing in on what would be billed by its proponents as a landmark agreement. Well know within weeks, if not days, whether these talks produce a deal. If they do, the details will be scrutinized with Netanyahus strong warning in mind.]", "Date": "20150303", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-netanyahu-obama-nuclear-iran-congress-speech-edit-0304-jm-20150303-story.html", "Title": "[Netanyahu's strong warning to Congress and Obama]"}