{"Content": "[Once again, President Barack Obama has done something to upset Rush Limbaugh. Im so sick of this happening. Youd think by now the president would just stop doing stuff that he knows is going to get Limbaugh mad, stuff like talking to other countries, proposing ideas, saying things, being president, sitting, standing and having the name Barack Obama. Its as if Obama doesnt even care that the conservative talk radio hosts incessant exasperation might be unhealthy. So rude. Consider todays show. Limbaugh was nearly apoplectic over Obamas videotaped message wishing the people of Iran a happy Nowruz, which is the Persian new year. Its unprecedented, Limbaugh howled. An American president addressing the Iranians. Hes right. It is wholly unprecedented, with the exception of Obama doing it last year, the year before that, the year before that and all the other years he has been president, and Presidents George W. Bush, Bill Clinton and George H. W. Bush also sending Nowruz messages because its an annual thing that happens. Of course Obamas message this year comes just as America and several other countries are working toward a nuclear agreement with Iran. One portion of the presidents comments that Limbaugh took umbrage with was this: Our negotiations have made progress, but gaps remain. And there are people, in both our countries and beyond, who oppose a diplomatic resolution. My message to youthe people of Iranis that, together, we have to speak up for the future we seek. Just recently a group of 47 Republican lawmakers were widely lambasted for sending a letter warning Iranian leaders that any deal with Obama could not be trusted. So its likely Obama was referencing that highly publicized and rather embarrassing event while also noting that there are Iranian politicos who arent crazy about a nuclear deal either. This is how Obamas rather innocuous statement there are people, in both our countries and beyond, who oppose a diplomatic resolution got Limbaugh-ized: Obama goes on television in Iran to complain about Americans. And he equates the American people who disagree with him to hardliners in Iran who disagree with their government. He compares Iranian hardliners to Americans who are skeptical of his deal. A few beats later, Limbaugh said; What in the world is going on here? So the president of the United States addresses his people, the Iranians. Oh, yeah. Thats the stuff his people, the Iranians. Thats the kind of unhinged hyperbole that makes the wheels of partisan outrage fly. It really is atrocious of the president to issue a message like this, knowing full well it was going require pundits like Limbaugh to get all bent out of shape and stomp up and down to jam Obamas words into the Preconceived Narrative/Conspiracy Theory News Grinder (trademark pending). It seems Obama will never learn. Much like the people who only listen to Rush Limbaugh. rhuppke@tribpub.com]", "Date": "20150320", "Author": "[Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/chi-obama-iran-message-limbaugh-20150320-story.html", "Title": "[Obama's message to Iranians upsets Rush Limbaugh how rude]"}