{"Content": "[Looking for more power to raise taxes and fees in Franklin Park, village officials want to seek home rule authority during the March 2016 primary. Home rule is the shifting of some state powers to the local municipality. When a municipality reaches a population of 25,000 residents, it automatically gains home rule power. Smaller municipalities have to vote for it, according to the Illinois Constitution. What tends to capture voters attention about home rule is the increased ability to raise taxes, particularly property taxes, said Rebecca Hendrik, professor of public administration at the University of Illinois at Chicago. Home rule communities are not subject to the states property tax extension limitation law, informally known as the \"tax cap.\" The law states that non-home rule communities cannot raise property taxes more than 5 percent or the rate of inflation whichever is less. \"The way [municipalities] try to sell it is they promise not to raise property taxes and will only use home rule to raise sales taxes,\" said Hendrik. Sales taxes are already maxed out in Franklin Park, thanks to a 1 percent increase approved by voters in a 2014 referendum. As for property taxes, Village President Barrett Pedersen said property taxes tend to rise faster in non-home rule communities. \"Your sources of revenue under home rule are significantly enhanced,\" Pedersen said. \"That is the most attractive thing. It places less pressure on property tax.\", Still, voters get nervous. In November 2010, a referendum on granting home rule power to village officials failed, with 54 percent of voters against it. This time around, officials are startin their effort to win over voters earlier and plan use the Citizens Advisory Committee on Infrastructure to help gain buy-in with voters. Village officials say they would like home rule powers for other reasons, including being able to institute parking fees, a crime-free housing ordinance and additional bonding capacity. The home rule referendum was one of three referendums that the Village Board moved to place on the March 2016 ballot during their April 20 meeting. Board members also signed off on two advisory referendums. One asks whether the village should build a pedestrian underpass between Ruby and 25th streets. The other asks whether the village should prohibit employment of family members of officials or officers of the village. Whether any of these referendums will get on the ballot is unclear at this point. \"The election calendar has not even been released by the Illinois State Board of Elections yet,\" said Courtney Greve, spokeswoman for the Cook County Clerks office. \"We are literally still counting ballots from the April 7 election.\", Ballot referendum questions must be submitted to the Cook County Clerks office. Heather Kimmon, legal counsel for the Illinois State Board of Elections, said a final draft of the election calendar is being worked on and that the state board hopes to distribute it by June 29. Resident Ken Zurek says two referendum questions submitted for the April 7 election by himself and his former running mate for village trustee, Chris Litwin, should be ahead of the Village Boards referendums. Zurek and Litwins two referendum questions are about setting eight-year term limits for village officials and about eliminating salaries and benefits for village officials. Zureks two referendums were not placed on the April 7 ballot because three other referendums the maximum allowed by county law during an election had already made it on the ballot. Zurek believes having submitted his referendums previously puts them first in line for inclusion in the March 2016 ballot; the Cook County Clerks office declined to comment when asked for their opinion on the matter. Zurek said he plans to go to federal court to make sure his and Litwins referendum questions get on the ballot. He also accused village officials of placing three referendums on the ballot 11 months early as an attempt to block his and Litwins referendums. Asked if the three referendum questions approved by the village board were an attempt to block other referendum questions from getting on the ballot, Pedersen declined to answer specifically, saying, \"there were a number of different considerations.\"]", "Date": "20150421", "Author": "[Mark Lawton]", "Link": "http://www.chicagotribune.com/suburbs/franklin-park/news/ct-fhj-home-rule-tl-0423-20150421-story.html", "Title": "[Franklin Park wants second shot at greater taxing powers]"}