{"Content": "[History is the polemics of the victor, William F. Buckley allegedly said. Not so in the United States, at least not regarding the Civil War. As soon as Confederates laid down their arms, some picked up their pens and began to distort what they had done, and why. Their resulting mythology went national a generation later and persists which is why a presidential candidate can suggest that slavery was somehow pro-family, and the public believes that the war was mainly fought over states rights. The Confederates won with the pen (and the noose) what they could not win on the battlefield: the cause of white supremacy and the dominant understanding of what the war was all about. We are still digging ourselves out from under the misinformation that they spread, which has manifested in both our history books and our public monuments. Take Kentucky. Kentuckys legislature voted not to secede, and early in the war, Confederate Gen. Albert Sidney Johnston ventured through the western part of the state and found \"no enthusiasm as we imagined and hoped but hostility . . . in Kentucky.\" Eventually, 90,000 Kentuckians would fight for the United States, while 35,000 fought for the Confederate States. Nevertheless, according to historian Thomas Clark, the state now has 72 Confederate monuments and only two Union ones. Neo-Confederates also won western Maryland. In 1913, the United Daughters of the Confederacy (UDC) put a soldier on a pedestal at the Rockville, Md. courthouse. Montgomery County never seceded, of course. While Maryland did send 24,000 men to the Confederate armed forces, it sent 63,000 to the U.S. Army and Navy. Nevertheless, the Confederate monument tells visitors to take the other side: \"To our heroes of Montgomery Co. Maryland / That we through life may not forget to love the Thin Gray Line.\", In fact, the Thin Gray Line came through Montgomery and adjoining Frederick counties at least three times, en route to Antietam, Gettysburg and Washington. Lees army expected to find recruits and help with food, clothing and information. They didnt. Maryland residents greeted Union soldiers as liberators when they came through on the way to Antietam. Recognizing the residents of Frederick as hostile, Confederate cavalry leader Jubal Early demanded and got $300,000 from them lest he burn their town, a sum equal to at least $5,000,000 today. Today, however, Frederick boasts what it calls the \"Maryland Confederate Memorial,\" and the manager of the Frederick cemetery filled with Union and Confederate dead told me in an interview, \"Very little is done on the Union side\" around Memorial Day. \"Its mostly Confederate.\", In addition to winning the battle for public monuments, neo-Confederates also managed to rename the war, calling it \"the War Between the States.\" Nevermind that while it was going on, no one called it that. Even Jeopardy! accepts it. Perhaps most perniciously, neo-Confederates now claim that the South seceded for states rights. When each state left the Union, its leaders made clear that they were seceding because they were for slavery and against states rights. In its \"Declaration Of The Causes Which Impel The State Of Texas To Secede From The Federal Union,\" for example, the secession convention of Texas listed the states that had offended them: Maine, Vermont, New Hampshire, Connecticut, Rhode Island, Massachusetts, New York, Pennsylvania, Ohio, Wisconsin, Michigan and Iowa. These states had in fact exercised states rights by passing laws that interfered with the federal governments attempts to enforce the Fugitive Slave Act. Some also no longer let slaveowners \"transit\" through their states with their slaves. \"States rights\" were what Texas was seceding against. Texas also made clear what it was seceding for: white supremacy. We hold as undeniable truths that the governments of the various States, and of the confederacy itself, were established exclusively by the white race, for themselves and their posterity; that the African race had no agency in their establishment; that they were rightfully held and regarded as an inferior and dependent race, and in that condition only could their existence in this country be rendered beneficial or tolerable. Despite such statements, during and after the Nadir, neo-Confederates put up monuments that flatly lied about the Confederate cause. For example, South Carolinas monument at Gettysburg, dedicated in 1965, claims to explain why the state seceded: \"Abiding faith in the sacredness of states rights provided their creed here.\" This tells us nothing about 1863, when abiding opposition to states rights as claimed by free states provided South Carolinians creed. In 1965, however, its leaders did support states rights. Indeed, they were desperately trying to keep the federal government from enforcing school desegregation and civil rights. The one constant was that the leaders of South Carolina in 1860 and 1965 were acting on behalf of white supremacy. So thoroughly did this mythology take hold that our textbooks still stand history on its head and say secession was for, rather than against, states rights. Publishers mystify secession because they dont want to offend Southern school districts and thereby lose sales. Consider this passage from \"The American Journey,\" the largest textbook ever foisted on middle-school students and perhaps the best-selling U.S. history textbook:, The South Secedes, Teachers and students infer from that passage that slavery was not the reason for secession. Instead, the reason is completely vague: [white] Southerners feared for their \"rights and liberties.\" On the next page, however, \"Journey\" becomes more precise: [White] Southerners claimed that since \"the national government\" had been derelict \"by refusing to enforce the Fugitive Slave Act and by denying the Southern states equal rights in the territories the states were justified in leaving the Union.\", \"Journey\" offers no evidence to support this claim. It cannot. No Southern state made any such charge against the federal government in any secession document I have ever seen. Presidents Buchanan and before him, Pierce, were part of the pro-Southern wing of the Democratic Party. For 10 years, the federal government had vigorously enforced the Fugitive Slave Act. Buchanan had supported pro-slavery forces in Kansas even after his own minion, the Mississippi slave owner Robert Walker, ruled that they had won only by fraud. The seven states that seceded before February 1861 had no quarrel with \"the national government.\", Teaching or implying that the Confederate states seceded for states rights is not accurate history. It is white, Confederate-apologist history. It bends even breaks the facts of what happened. Like other U.S. history textbooks, \"Journey\" needs to be de-Confederatized. So does the history test we give to immigrants who want to become U.S. citizens. Item 74 asks, \"Name one problem that led to the Civil War.\" It then gives three acceptable answers: \"slavery, economic reasons, and states rights.\" If by \"economic reasons\" it means issues about tariffs and taxes, which most people infer, then two of its three \"correct answers\" are wrong! No other question on this 100-item test has more than one \"right\" answer. The reason is not because the history is unclear, but because neo-Confederates still wielded considerable influence in our culture and our Congress until quite recently, when a mass of politicians rushed to declare the Confederate flag unsuitable for display on government grounds. Now the dean of the National Cathedral in Washington, D.C. has noted that the cathedral needs to de-Confederatize its stained glass windows. That would be a start for D.C. which also needs to remove its statue of Albert Pike, Confederate general and leader of the Arkansas Ku Klux Klan, from Judiciary Square. The Pentagon also needs to de-Confederatize the Army. No more Fort A.P. Hill. No more Fort Bragg, named for a general who was not only Confederate but also incompetent. No more Fort Benning, named for a general who, after he had helped get his home state of Georgia to secede, made the following argument to the Virginia legislature:, What was the reason that induced Georgia to take the step of secession? This reason may be summed up in one single proposition. It was a conviction that a separation from the North was the only thing that could prevent the abolition of her slavery. If things are allowed to go on as they are, it is certain that slavery is to be abolished. By the time the north shall have attained the power, the black race will be in a large majority, and then we will have black governors, black legislatures, black juries, black everything. The consequence will be that our men will be all exterminated or expelled to wander as vagabonds over a hostile earth, and as for our women, their fate will be too horrible to contemplate even in fancy. With our monuments lying about secession, our textbooks obfuscating what the Confederacy was about, and our army honoring its generals, no wonder so many Americans supported the Confederacy until last week. We can literally see the impact Confederate symbols and thinking had on Dylann Roof, but other examples abound. In his mugshot, Timothy McVeigh, who bombed the Murrah Building in Oklahoma City in 1995, wore a neo-Confederate T-shirt showing Abraham Lincoln and the words, \"Sic semper tyrannis!\" When white students in Appleton, Wis. a recovering sundown town that for decades had been \"all white\" on purpose, had issues with Mexican American students in 1999, they responded by wearing and waving Confederate flags, which they already had at home, at the ready. Across the country, removing slavery from its central role in prompting the Civil War marginalizes African-Americans and makes us all stupid. De-Confederatizing the United States wont end white supremacy, but it will be a momentous step in that direction. Loewen, Emeritus Professor of Sociology at the University of Vermont, is the author of \"Lies My Teacher Told Me\" and \"The Confederate and Neo-Confederate Reader.\"]", "Date": "20150704", "Author": "[James W. Loewen]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-confederate-myths-20150702-story.html", "Title": "[Why do people believe myths about the Confederacy? Because our textbooks and monuments are wrong]"}