{"Content": "[New Congress convenes with Republicans holding majority in House and Senate. A new Congress has convened with Republicans ready to take charge of the House and Senate. Kentucky Sen. Mitch McConnell was poised to become the new Senate majority leader. In the House, John Boehner was widely expected to win another term as speaker. The Senate includes 13 freshmen, and the House has 58 freshmen. Republicans assume full control of Congress on Tuesday for the first time in eight years in a day of pomp, circumstance and raw politics. They planned to move swiftly toward a veto showdown with President Barack Obama over the Keystone XL pipeline, summoning unity despite a tea party-backed effort to unseat House Speaker John Boehner of Ohio. \"We will get to work right away,\" pledged House Majority Leader Kevin McCarthy, R-Calif. \"And with a new Republican-led Senate, we anticipate many of these bipartisan solutions to finally reach the presidents desk.\", At the White House, Obama planned to meet with the new congressional leadership next week as both sides positioned themselves for two years of clashes and, perhaps, occasional cooperation that will help shape the outcomes of the 2016 presidential and congressional elections. As required by the Constitution, Congress was to convene at noon. With Vice President Joe Biden presiding, Mitch McConnell of Kentucky was to automatically ascend to majority leader of the Senate following his approval by rank-and-file Republicans last year. McConnell replaces Democrat Harry Reid of Nevada, who was a surprise no-show from the days proceedings after he injured himself exercising. Reid, who broke several ribs and bones in his face when a piece of equipment snapped last week, said his doctor had ordered him to work from home Tuesday. A photo Reid posted to Twitter showed him with his right eye taped over as he met with top lawmakers. Newcomers and veterans alike were to raise their hands to swear the oath of office, many with spouses, children and grandchildren looking on to witness the biennial display of pageantry. McConnell and Boehner both were to deliver remarks on their chambers floors as they began laying down markers for legislative battles ahead. First, Boehner had to survive his election as speaker the main event on any opening days agenda. Tea party-backed Reps. Louie Gohmert of Texas and Ted Yoho of Florida put themselves forward as challengers to Boehner, and more than a dozen Republicans announced they would oppose Boehner. The ranks of the opponents grew in the hours ahead of Tuesdays vote, but appeared to remain short of the number needed to place Boehners election in jeopardy. Many lawmakers dismissed the challenge as a needless distraction at a moment when the party should be celebrating new majorities and showing voters it can lead. \"Its time to put all this silliness behind and move on,\" said Rep. Phil Roe, R-Tenn. \"Were on probation. If we dont perform ... (voters) can make a pivot in a heartbeat.\", Nor did any of the rebels predict they would succeed in toppling the 65-year-old Boehner. Instead, they said the current high command wasnt conservative enough. For his part, Yoho said the initial goal of the Boehner challenge is to force the leadership contest past one ballot, so there could be a serious discussion about change. \"I think we need to articulate a vision for the country, a vision for this conference,\" he told reporters late Monday. \"I threw my hat into the ring so people could have a choice and an alternative.\", Yoho said the Boehner leadership team, among other things, hasnt given rank-and-file GOP members sufficient time to consider legislation before calling for a vote. Two years ago, Boehner faced similar criticism, and sweated out his election to a second term. His hand is considerably stronger this year after the Republicans sweeping electoral triumph. The party will hold 246 House seats in the new Congress, to 188 for the Democrats, the biggest GOP majority in nearly 70 years. Coupled with the commanding majority was word of the first retirement New York Republican Chris Gibson announced he would step down at the end of his term, but signaled he was not finished with politics in his home state. The intra-party leadership struggle underscored the political peril facing Republicans as they looked ahead to two-house control of Congress. Yet the evident ability to pass the Keystone pipeline legislation showed their potential to advance an agenda. Votes in a Senate committee and on the House floor were scheduled for later this week on the pipeline, which passed the House but died in a Democratic-led filibuster in the Senate late last year. Now, Republicans appear to have more than enough votes to clear it through the Senate as well, given the Republican pickup of nine seats in the elections. While Obama has not said if he will reject the measure, White House spokesman Josh Earnest outlined a series of concerns with the pipeline before adding, \"Im not prepared at this point to issue a veto threat related to that specific piece of legislation.\", But Republicans stand ready to cast the measure as a bipartisan jobs bill of the type that should be signed into law. \"Theres a lot we can get done together if the president puts his famous pen to use signing bills rather than vetoing legislation his liberal allies dont like,\" McConnell said late last year. Earnest, meanwhile, was less ambiguous about another issue. Referring to an assertion by a Louisiana reporter, he said Rep. Steve Scalise of Louisiana, the third-ranking House GOP leader, had once described himself as \"David Duke without the baggage.\" Earnest also said Scalises presence in the leadership of House Republicans \"says a lot about who they are.\", Scalise spoke more than a dozen years ago to a white supremacist organization founded by Duke. The lawmaker said recently the appearance was a mistake, and said he condemns the groups views. Associated Press]", "Date": "20150106", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-new-congress-convenes-20150106-story.html", "Title": "[New Congress convenes with Republicans holding majority in House and Senate]"}