{"Content": "[Former U.S. Rep. Mel Reynoldsfailed to appear at a scheduled arraignment Monday to enter a plea on federal tax charges. Reynolds lawyer Theodore Poulos explained later that Reynoldstraveled overseas in early June and couldnt return for his arraignment because his daughter fell ill. Thehearing in federal court in Chicago was supposed to be Reynoldsfirst court appearance since his indictment two weeks agoon charges he didnot file income tax returns for four straight years. Former U.S. Rep. Mel Reynoldswas not present for an arraignment scheduled July 6, 2015. (WGN TV), Former U.S. Rep. Mel Reynoldswas not present for an arraignment scheduled July 6, 2015. (WGN TV), But the hearing never began after defense attorneys and prosecutors gathered in court. Instead, a court official agreed with both sides to reschedule the hearing for July 30. Poulos said his client is expected to return and plead not guilty. Reynolds failed to file a tax return for each of the four years despite receiving \"gross income in excess of the amount required to file an income tax return,\" according to a four-count indictment made public late last month. Each of the four counts carries a maximum sentence of one year in prison and a $250,000 fine. The indictment isthe latest setback for Reynolds, 63, a former Rhodes scholar and once a rising star in the Democratic Party. He was convicted in two separate cases in the 1990s for having sex with an underage campaign worker and for bank and campaign fraud. Reynolds was convicted in 1995 of criminal sexual abuse, obstruction of justice and child pornography charges for having sex with a onetime campaign intern, 16, and then trying to sabotage the case against him. He was sentenced to five years in prison. While serving his state prison sentence, Reynolds was convicted again in 1997 on 15 counts of federal campaign and bank fraud for illegally raising campaign cash and defrauding banks out of hundreds of thousands of dollars. He was sentenced to 6 1/2 years in federal prison. Reynolds served 2 1/2 years in state prison, then was transferred to federal prison. In 2001, President Bill Clinton commuted Reynolds federal sentence with two years remaining to serve. By 2003, Reynolds made the first of several failed attempts at a political comeback, running against U.S. Rep. Jesse Jackson Jr. in the 2004 Democratic primary. After Jackson resigned in 2012 amid his own scandal, Reynolds again sought to win back his former 2nd Congressional District seat under the slogan of \"Redemption,\" but he again was unsuccessful. Last year Reynolds was arrested and jailed in Zimbabwe on charges he had sexually explicit photos and videos on his mobile phone in violation of a censorship law. Days later, authorities dropped the pornography charges and Reynolds pleaded guilty to a misdemeanor visa violation and was deported. tbriscoe@tribpub.com]", "Date": "20150706", "Author": "[Tony Briscoe]", "Link": "http://www.chicagotribune.com/news/ct-mel-reynolds-arraignment-met-0707-20150706-story.html", "Title": "[ Ex-U.S. Rep. Mel Reynolds a no-show for arraignment]"}