{"Content": "[The Senate will vote before its August recess on a Republican effort to bar federal aid to Planned Parenthood, GOP leaders said Tuesday, as anti-abortion groups clamored for action by lawmakers. Democrats said they will strongly oppose what they called the latest Republican effort to weaken womens health care programs, but stopped short of flatly predicting its defeat. The positioning came as an anti-abortion group released a third covertly recorded video of Planned Parenthood officials discussing procedures for obtaining tissue from aborted fetuses for research and showing stark close-ups of what it said was fetal tissue in a Planned Parenthood lab. The unveiling of the videos has put Planned Parenthood and many Democrats on the defensive, though there is little sign that they wont be able to head off the GOP effort. \"Good luck,\" Senate Minority Leader Harry Reid, D-Nev. said of the uphill Republican drive to garner the 60 of 100 Senate votes they will need to cut off Planned Parenthoods money. \"Were dealing with the health of American women, and theyre dealing with some right-wing crazy.\", There are a total of 54 Republicans in the Senate, mostly opposed to abortion, and just a handful of anti-abortion Democrats. One of them, Sen. Bob Casey, D-Pa. said in a brief interview that he would not support the effort to end government help for Planned Parenthood because \"they provide all kinds of primary health care\" for women and because of the prohibition against using federal funds for virtually any abortions. GOP senators unveiled a bill Tuesday evening prohibiting federal aid to Planned Parenthood and directing that the money instead be directed to \"other eligible entities to provide womens health care services.\" Aides said an initial vote on the measure, sponsored by Sen. Joni Ernst, R-Iowa, was likely early next week. The bill cites state and local health departments, federally backed community health centers and other providers of health services to women who might get the money. Republicans were hoping that might encourage Democrats to pull funds away from Planned Parenthood, which even some abortion-rights Democrats have avoided defending since the videos were released. Citing the \"horrendous videos,\" Senate Majority Leader Mitch McConnell, R-Ky. a co-sponsor, said, \"This legislation would ensure taxpayer dollars for womens health are actually spent on womens health not a scandal-plagued political lobbying giant.\", Planned Parenthood has said it has done nothing illegal or improper. It receives more than $500 million annually in government aid, including some state funds. Federal funds cannot be used for abortions except for pregnancies involving rape, incest or where the mothers life is in danger. Planned Parenthoods latest annual report says it performs about 4.5 million tests and treatments for sexually transmitted diseases yearly, provides 3.6 million contraceptive devices and procedures and hundreds of thousands of cancer screens. It also reported nearly 328,000 abortion procedures. Since most federal aid for abortions is banned, \"This means GOP defund efforts almost exclusively target preventive services,\" the group said in a written statement Tuesday. Earlier Tuesday, Sen. Rand Paul, R-Ky. a presidential hopeful, said in an interview that thanks to his \"persistence,\" Senate GOP leaders had committed to a pre-recess vote on blocking Planned Parenthoods federal money. He has introduced a bill that would end all of the organizations federal aid and is part of the group producing a GOP bill. Paul said that win or lose, simply having the vote will be \"a huge victory for conservatives\" opposed to abortion. Asked by lawmakers Tuesday about Planned Parenthood, Health and Human Services Secretary Sylvia Burwell said the dispute over how the group gets fetal organs for research involves \"passion and emotion and belief on many sides of the issue, and I want to respect that.\", Burwell also told the House Education and the Workforce Committee, \"There are statutes that guide the use of fetal tissue that are in place and should be enforced.\", It is illegal to sell fetal tissue for profit, but legal for a group providing it to recover the costs of the procedure. Planned Parenthood has said it only takes fetal organs if the mother agrees to let that occur, and only after she has planned to have an abortion. House Republicans say there are no plans for a vote in that chamber before it begins its recess, probably on Wednesday. The Senate is scheduled to leave the Capitol at the end of next week. The videos have been released by the Center for Medical Progress. Its founder, David Daleiden, previously worked with the anti-abortion group Live Action, which has released several undercover videos aimed at discrediting Planned Parenthood. Associated Press]", "Date": "20150728", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-senate-planned-parenthood-20150728-story.html", "Title": "[Senate plans vote to defund Planned Parenthood; 'Good luck,' says Reid]"}