{"Content": "[Fifty years have passed since the Watts riots, a disaster that brought death, destruction and an unexpected, although long overdue, boost to the value of racial diversity in newsrooms. Six days of looting, shootings and arson in the Los Angeles neighborhood resulted in 34 deaths, more than $40 million in property damage and a spur to white flight from inner cities, especially when it was followed by similar eruptions in other cities. Unlike the 50th anniversary of the voting-rights march in Selma, Ala. and other recent landmark commemorations, Watts offers us no larger-than-life heroes or giant steps of human progress. A short article in the Aug. 11, 2006, Los Angeles Times reported on the origins of the 1965 riots in Los Angeles Watts neighborhood:, , \"Aug. 11, 1965: At 7:19 p.m. in Watts, a California Highway Patrol motorcycle officer named Lee Minikus pulled over 21-year-old Marquette Frye on suspicion of drunk driving. Minikus was white. Frye was black. When the two scuffled at Avalon Boulevard and 116th Street, a crowd gathered. \"That night, 1,000 people rioted in Watts, some throwing bricks, rocks and bottles at police and motorists, The Times reported. About 100 officers were brought in to attempt to quell the five-hour melee by sealing off an eight-block area, the newspaper said. \"It was just a night to throw rocks at policemen, Deputy Police Chief Roger Murdock, who headed the riot squads, told The Times. \"What followed was six days of rioting -- in which 34 people died, more than 1,000 were injured and property damage was estimated at $40 million.\", , Read more >>, Bad things began to happen in Watts on Aug. 11. Thats when black motorist Marquette Frye, 21, was arrested for drunken driving in a routine traffic stop that quickly turned into a riot. It wasnt the first major riot of the period. A similar uprising exploded in New Yorks Harlem and briefly spread to Brooklyn a year earlier. And it wasnt the largest either. Other conflagrations would erupt in Chicago, Detroit and other cities, culminating in the wave of more than 100 riots that followed the Rev. Martin Luther King Jr.s assassination in 1968. But Watts stands out in many memories, including mine, as a pivotal event in shaping the polarized racial and political landscape through which we Americans struggle today. Coming on the heels of President Lyndon B. Johnsons historic civil rights bills and the early days of his \"war on poverty,\" Watts helped spur a conservative backlash that continues to push back against similar progressive reforms today. You can even hear echoes of the Watts debate in todays \"Black Lives Matter\" protests over fatal encounters between unarmed black men and white police officers although without todays cellphone cameras. But as an aspiring black student journalist, I mostly remember the Watts riots for their impact on the media that covered them. Despite all you may hear about \"liberal media,\" American newsrooms in those days were no more racially or gender diverse than the early seasons of \"Mad Men,\" AMCs series about a 1960s ad agency. The Watts riots caught the media with their diversity down. Suddenly called upon to report and explain events in a part of town with which they were woefully unfamiliar, editors and news directors had a revelation: It might be a good idea for them to hire a few reporters and photographers who could be sent out to \"the ghetto\" without looking too conspicuous. Most memorably, the Los Angeles Times now a sister newspaper to the Chicago Tribune, where I work had no black reporters or photographers, like most other American newspapers. So they deputized Robert Richardson, a 24-year-old African-American messenger for the newspapers classified ad department. Richardson dutifully grabbed a pen, a notebook and a handful of dimes for pay phones in those pre-cellphone days to provide eyewitness accounts from behind the color line. Despite his lack of experience, Richardsons reports were sufficiently compelling to help the Times to win a Pulitzer Prize, journalisms highest award, for its riot coverage. His story also became a compelling 1990 Turner Network Television feature film, \"Heat Wave,\" starring Blair Underwood as Richardson, as if no Los Angeles drama is complete without a movie being made of it. Richardsons work meant a lot to me and other students of color who were considering journalism careers. We had almost no other visible role models in the mainstream media. Each of the three television networks had its one black reporter in that year, for which each network patted itself on the back. But America deserved more. Three years later, President Johnsons National Advisory Commission on Civil Disorders, chaired by former Illinois Gov. Otto Kerner, would make that same point about the hiring of \"Negro journalists.\" The same also needed to be said of Hispanic journalists and other journalists of color and vastly underrepresented women journalists. Times have changed. These days old media are less worried about building diversity in the Internet age than with holding to the diversity they have. Yet new media are opening up vast new opportunities for young aspiring journalists, if they pursue them as doggedly as they pursue good stories. As my grandmother advised me back in the bad old days of all-white newsrooms, \"Just prepare yourself. When the doors of opportunity open up, be ready to step inside.\", Wise words still. Clarence Page, a member of the Chicago Tribune Editorial Board, blogs at www.chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150816", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-watt-riots-race-richardson-perspec-0816-jm-20150814-column.html", "Title": "[How Watts changed journalism]"}