{"Content": "[The other man from Hope is running for president again. Declaring Tuesday that he can bring \"the kind of change that truly can get America from hope to higher ground,\" former Arkansas Gov. Mike Huckabee announced his Republican candidacy in the hometown he shares with former President Bill Clinton. Though they share roots in Hope, Huckabee is pitching himself as the best Republican to take on Bills wife, Hillary Rodham Clinton, the dominant Democrat in the 2016 race. \"It seems perfectly fitting that it would be here that I announce that I am a candidate for president of the United States of America,\" Huckabee told hundreds of supporters. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. An anti-Clinton message is one part of Huckabees effort to expand his support beyond the social conservatives who helped him win eight states in the 2008 Republican nominating contest that eventually was won by John McCain. Huckabee is the third notable Republican to announce a presidential campaign this week, bringing the field to six, with more to come. He argued that in his more than 10 years as governor, he took on Democrats in \"Bill Clintons Arkansas.\" Huckabee was elected lieutenant governor, his first public office, months after Clinton left the governors mansion for Washington. \"I governed in a state that was the most lopsided and partisan in the country,\" he told supporters. \"No Republican governor had more Democrats and fewer Republicans. I challenged the deeply entrenched political machine that ran this state. It was tough sledding, but I learned how to govern and how to lead.\", Current Arkansas Gov. Asa Hutchinson, who in 1998 was one of the House prosecutors in the impeachment proceedings against Bill Clinton, joined in introducing Huckabee. Besides the anti-Clinton emphasis, Huckabee sees himself as an economic populist and foreign affairs hawk who holds deeply conservative views on social issues such as abortion and gay marriage. He preached a more muscular response to the rise of Islamic State militants and to Iran, vowing that \"we will deal with jihadis just as we would deal with deadly snakes\" and saying \"ayatollahs will know that hell will freeze over before they get a nuclear weapon.\", He said: \"As president I promise you we will no longer merely try to contain jihadism. We will conquer it.\", Yet Huckabees position on sending U.S. ground forces to fight the Islamic State is less categorical than his rhetoric might suggest; hes said that should be done only as part of an international coalition with nations in the region such as Saudi Arabia and Jordan. At home, Huckabee advocates a national consumption tax, which is similar to a sales tax, to replace the existing federal taxes on personal income and payrolls. He rejects calls for a minimum wage increase, saying his proposals will yield a \"maximum wage\" for workers. A governor from 1996 to 2007, Huckabee compiled a mixed record ideologically. He both cut and raised taxes, drawing the ire of some national groups like the Club for Growth. He pleased conservatives with a late-term abortion ban but raised eyebrows by issuing more criminal pardons and sentence commutations than his three predecessors combined. Huckabee, an author and former Fox News host, hopes to appeal to everyday Americans who \"dont feel like anybody understands or knows who they are, much less cares whats happening to them.\", As he put it Tuesday: \"Power, money and political influence have left a lot of Americans behind.\", Huckabees potential strength among the growing number of Republican candidates rests with cultural conservatives who wield strong influence in the partys nominating process. Evangelical Christian voters helped him win the Iowa caucuses in 2008 and finish a strong second in South Carolina, the largest of the early-voting states. Huckabee would need to replicate that early success to create an opening to build a wider coalition this time and compete deep into the primary schedule. Associated Press]", "Date": "20150505", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-mike-huckabee-20150505-story.html", "Title": "[Mike Huckabee launches second White House bid ]"}