{"Content": "[Iran is bound to get tough after the nuclear deal comes into force. Its foreign policy will become more strident. Its support for Syrian President Bashar Assad will deepen. Its anti-Israel rhetoric will sharpen. Its Shiite militias in Iraq will take the attack to the Islamic State. It will double down on the Houthis. But dont give up on the deal. It will go through, and Iran will live by its demands. Irans Supreme Leader Ayatollah Ali Khamenei and President Hassan Rouhani need to prove that they have not sold out to the \"Great Satan.\" The hard-liners in and out of the Revolutionary Guard need to be accommodated, and their support for the deal needs to be won. During weekly news conferences the two leaders of the US House disagreed on the outcome of the Iran deal. July 16, 2015. (AP), During weekly news conferences the two leaders of the US House disagreed on the outcome of the Iran deal. July 16, 2015. (AP), Burnishing Irans credentials as the spearhead of the anti-U.S. and anti-Western world order is precisely the way forward, for the moment. Iran sees itself as the leading state in the Middle East region and clearly would like to be for the Middle East what China would like to be for East Asia and what the U.S. is instead: the dominant power in its region. Lifting sanctions will provide Iran with greater resources to move quickly to realize its regional aspirations. But the intensity of those aspirations will diminish. Irans politics are moderating. Its revolutionary fervor has abated and will continue to decline. Its youth demand more, not less integration into the world order: more travel, more study abroad, more rock n roll. Any rationale for Irans constructing a nuclear weapon will disappear as it becomes clear that the U.S. is not going to invade Iran nor will Israel attempt to bomb its nuclear facilities. Over the 10-year heart of the nuclear deal, Iran will be less inclined to sacrifice its own welfare to benefit its clients. It will emerge from the deal a different country not necessarily an Iran the U.S. would prefer but one with whom we will be able to do even more business. Marvin Zonis is professor emeritus at the University of Chicagos Booth School of Business.]", "Date": "20150716", "Author": "[Marvin Zonis]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-nuclear-deal-perspec-0717-20150716-story.html", "Title": "[Don't give up on the Iran deal]"}