{"Content": "[Comptroller Judy Baar Topinkas death left a void in Illinois beyond her colorful personality: She would have been sworn in Monday for her second term in the office. Gov.-elect Bruce Rauner has named GOP businesswoman Leslie Munger to fill the vacancy, but for how long?, The incoming governor wanted the company of another Republican in the comptrollers office for a complete four-year term, but Democrats had no interest in giving him a housewarming gift. Gov. Pat Quinn called a special session, and lawmakers on Thursday passed a bill that will set an election for comptroller on the 2016 ballot. There was no good reason to rush a special session; Democrats just wanted to avoid the muss and fuss of dealing with a new governor on the issue. Rauner might have vetoed the bill. We would have encouraged him to sign it. An elective office shouldnt be filled by appointment for four years. So voters will get to elect a comptroller in 2016, rather than wait until 2018. The bill also sets rules for calling elections in the rare case of long-term vacancies in other constitutional offices. If an office becomes vacant with 28 months or more remaining in the term, a special election to fill the spot will be held during the next statewide election. What you saw Thursday was how quickly and efficiently Senate President John Cullerton and House Speaker Michael Madigan can act when they set their minds to it. We hope, as soon as the new legislature is sworn in, that Cullerton and Madigan set their minds to some unfinished business: saving taxpayers $12 million a year by merging the offices of comptroller and treasurer. That would require a constitutional amendment. State Sen. Mike Frerichs, the treasurer-elect, supports it. Leslie Munger supports it. Bruce Rauner supports it. Judy Baar Topinka did too. People are now calling this \"Judys Amendment.\", So lets get on with it. The Senate voted in 2011 to put an amendment before voters, but Madigan wouldnt bring it to a vote in the House. Lets get this before voters in 2016. We would have preferred that the merger be done immediately after public approval then. But if theres going to be a special election then for a two-year term, lets at least make it a campaign based on who will most quickly and efficiently shut things down. The jobs of treasurer (investing state money) and comptroller (paying state bills) are handled by one office in many states. They were separated in the 1970 Illinois Constitution, in reaction to a scandal in the treasurers office. Plenty of people are confident that with modern financial controls, we could avoid a repeat. Yes, we know, this is Illinois, but look: Two offices dont guarantee perfectly clean government. Illinois has a thousand things to do to restore the state economy and put government on sound footing. The $12 million savings projected by this move is, in relative terms, modest. But it would go a long way to giving voters some confidence that this legislature will join with the new governor to find savings, big and small.]", "Date": "20150109", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-comptroller-treasurer-edit-0109-20150108-story.html", "Title": "[Let the next election for comptroller be the last]"}