{"Content": "[Rep. Aaron Schocks resignation after six weeks of intense scrutiny over spending, travel and real estate deals marked a stunning fall for a politician once seen as a rising young voice in Congress. \"It seemed like he was going to be a new, younger face in the political scene, and it was disappointing to see,\" said Angela Loring, 38, a teacher interviewed outside a Peoria grocery store in his congressional district. Schock, 33, the first member of Congress born in the 1980s, said Tuesday he will step down March 31. He was in his fourth term in the House of Representatives, having served since 2009. The Republican from Peoria, whose conduct has been the subject of investigations by several news organizations, admitted no wrongdoing in his resignation statement, saying only that the constant questions were a \"great distraction.\", Once he steps down, Schock no longer will come under the jurisdiction of congressional ethics investigators. However, legal observers said the recent issues that have dogged Schock ever since the Washington Post on Feb. 2 wrote about his $40,000 \"Downton Abbey\" office decor could follow him into his post congressional life. A Capitol Hill source said lawyers at the Justice Departments public integrity section, the Federal Election Commission, or state or federal prosecutors in Illinois still could examine the allegations leveled against Schock to determine if he violated the law. The source spoke on condition of anonymity. Charles Tiefer, a Democrat and former acting-general counsel of the House, said Schocks lifestyles-of-the-rich-and-famous ways were to blame for his downfall. \"The vast majority of congressmen know better than to engage in flamboyant expenditures and activities which are, at best, in the gray area of the law,\" said Tiefer, who teaches at the University of Baltimore Law School. Schock easily won re-election in November, but the spate of recent media reports quickly led to rumors he would resign. Still, just a week ago, according to a story in the Peoria Journal Star, Schock said, \"Im not going anywhere.\", Sen. Dick Durbin, the assistant Senate Democratic leader from Illinois, said Tuesday he was surprised by Schocks resignation and suggested the move \"reflects the gravity of his situation.\", \"The allegations against Congressman Schock are serious, raising questions about his expenditure of official funds and campaign funds,\" Durbin said in a statement. Schock did not return messages left Tuesday on his cellphone. The Posts Feb. 2 story on Schocks office redo might have been a flash in the pan, except that his aides tried to quash the story and asked a reporter to delete photos hed taken. Aides initially said the interior designer had offered her services for free but that he had to pay for furnishings. House ethics rules generally prohibit members of Congress from accepting gifts or services worth more than $50. Not long after a watchdog group asked the Office of Congressional Ethics to look into the matter, Schock repaid $40,000 from his personal checking account for the redecorating work, The Associated Press reported. By then reporters and others were combing through Schocks financial dealings and his Instagram account to document his travel and expenses. Schock visited at least nine foreign countries since the start of 2014, sometimes on government business and sometimes for pleasure, a Tribune review found. In addition to allegations that he did not properly account for foreign travel, Schock is accused of not conforming to requirements on the use of private aircraft. The Associated Press on Feb. 23 reported that Schock spent more than $40,000 to fly on private jets owned by some of his political donors. The wire service had examined travel expenses, flight records and location data on Schocks Instagram account. Ethics rules changed in January 2013 to permit members of Congress to pay for private airfare with tax dollars as long as they pay their share of the cost. But the AP found that Schock paid for most of his private flights with public dollars before the rule changed. It could not be determined whether Schock paid his share of the flights after the 2013 rule change. The media outlet Politico on Feb. 24 questioned why Schock had not reported in his annual financial disclosure statement a 10-day trip he took in March 2011 to Saudi Arabia. The countrys antiquities and tourism commission paid for the trip. Politico also found that the congressman had \"attended dinner and drinks in 2011 at Windsor Castle, Buckingham Palace and at a swank nightclub London and never disclosed receiving a single gift on his financial disclosure form.\", Schock was in London at the time for the prestigious Royal Ascot races. The Sun-Times reported March 2 that Schock had billed taxpayers for a private plane ride to Chicago for a Bears game. Schock quickly repaid the government $1,237 for the trip. At a news conference March 6 in Peoria, Schock told reporters that at times he has made mistakes. \"I know that when I take a trip, and I post photos online, it can create the misimpression of being out of touch, or an image that is not worthy of my constituents,\" he said. \"I have tried to balance being a young congressman and doing things differently and more open with maintaining a level of seriousness on the issues of the day. I know some days I have failed at this.\", Still, there was no let-up for Schock. The Associated Press on Friday reported that Schock \"built much of his personal wealth\" through real estate deals with political donors. A lawmaker can do business with donors as long as the terms are \"commercially reasonable.\", News outlets more recently were digging into Schock receiving thousands of taxpayer dollars for mileage reimbursement. In late February, Schock enlisted two veteran Washington lawyers for an internal review of his office and political operation. Neither responded Tuesday to Tribune questions on the status of that review. Nor did two veteran GOP political operatives Schock just brought on. A precocious politician, Schock had won a seat on the local school board when he was 19 and was elected president three years later. He subsequently won a seat in the state House. Schock was just 27 when he succeeded retiring Rep. Ray LaHood. LaHood, whose son, Darin, a state senator, is believed to be interested in the congressional seat which will now be up for grabs in a special election said in an interview that he had unsuccessfully tried to phone Schock on Tuesday. \"Personally, Im very sad,\" said Ray LaHood, who held the congressional seat for 14 years. The district includes Peoria and the Springfield area, bedrock GOP turf that has been represented by a Republican in Congress since 1917. Schock never fit the mold of the reserved Midwestern congressman, driving home that point recently when he told a TV reporter he has never been a \"crusty old white guy.\", Known for his sharp style and good looks. He showed off his six-pack abs on the cover of Mens Health magazine in 2011 and once was voted the \"hottest freshman\" by readers of the Huffington Post. His flashy, in-your-face lifestyle has been well documented long before the latest controversy frequently by Schock himself on the online photo-sharing site Instagram. He has chronicled his adventures to the Greek Isles and the glaciers of Patagonia. He has surfed the waves off Hawaii, danced the tango in Buenos Aires and parasailed in the Andes. The Tribune in 2013 reported that Schocks campaign spent more than $2,600 on cuff links, paid $390 to a seaplane company based in the British Virgin Islands and spent more than $1,500 on concert tickets. Under federal election laws, the expenditures disclosed in campaign finance filings to the FEC are legal as long as they served a political or campaign purpose. Schock was one of the Illinois delegations heaviest spenders on meals and travel. In Peoria on Tuesday, several constituents expressed dismay at the latest turn of events. \"Im disappointed in Aaron altogether for taking advantage of the situation,\" said Carl Cohen, 77. \"And he thought more of himself than the community.\", Ray LaHood, however, said he stands by Schock. \"What I would tell (Schock) is Im very sorry for the way his congressional career ended and lookit, you find out who your friends are when things like this happen and Im a friend of Aarons and always will be,\" LaHood said. Washington lawyer Kenneth Gross, formerly the associate general counsel at the Federal Election Commission, which handles civil enforcement of campaign-finance rules, said Tuesday that \"a number of issues have been raised regarding (Schocks) handling of campaign funds and office expenditures, but its hard to know what constituted a critical mass to cause him to resign.\", One campaign-finance lawyer, who spoke on condition of anonymity, said that as a general rule, the Justice Department, should it be taking a look at a lawmaker, would not be swayed one way or another by a resignation. Schock had been under scrutiny in 2012 for allegedly soliciting a $25,000 contribution from a political action committee in excess of legal limits. But that case, before the House Ethics Committee, will go away once Schocks resignation becomes official. Tribune reporter Todd Lighty reported from Chicago. Tribune reporter Jessie Hellmann contributed. kskiba@tribpub.com, tlighty@tribpub.com, Twitter @Katherine Skiba]", "Date": "20150317", "Author": "[Katherine Skiba, Todd Lighty]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-aaron-schock-resigns-20150317-story.html", "Title": "[Rep. Aaron Schock's problems could follow him after he quits Congress ]"}