{"Content": "[Tinley Park plan commissioners have endorsed plans for a strip mall at the southwest corner of Harlem Avenue and 191st Street after receiving assurances the development would not increase flooding at nearby houses. A public hearing last week drew a dozen Brookside Glen subdivision residents, most of whom objected to the seven-storefront strip mall proposed by Chicago-based Aetna Development Corp. and the Webster Property Group. The building would be slightly smaller than the TJ Maxx store at the Brookside Marketplace shopping center across 191st Street. Commissioner Bob McClellan, addressing residents concern about flooding, said the plan commission has to \"trust the modeling of the engineers. I wholeheartedly believe it will not impact your real estate values.\", Most of the homeowners questioned whether the strip mall and its parking lot, which would be in a floodplain, would increase stormwater runoff onto their properties. Resident Jennifer Vargas asked for a \"100 percent guarantee for our houses that we will not flood because of this development.\", Civil engineer Tracey Richard, representing Aetna President George Hanus, said \"there is no 100 percent prediction,\" but the amount of stormwater runoff \"doesnt even register\" on the floodplain scale because \"its so small.\", Village Engineer Chris King agreed, telling the residents and commissioners that there would be \"no impacts to the floodplain\" because stormwater would go into detention ponds. \"Itll be channeled in a different way. Instead of a floodplain that floods, youll have lakes,\" King said. Brookside Glen resident Steve Reed stressed that he and his neighbors dont oppose the planned strip mall but want to \"preserve home values, lifestyle and opportunities for the people that come after us.\", Reed said the subdivisions residents remain skeptical that Aetna and Tinley Park officials have their best interests in mind, recalling Aetnas failed plan in 2008 for a large mall anchored by a 24-hour Wal-Mart at 191st and Harlem. Aetna dropped that plan in response to a weak retail market and Brookside Glen residents opposition. David Mangurten, a partner with the Deerfield-based KMA & Associates architectural firm, said there isnt a tenant list for the strip mall yet because \"its hard to market without a building being there.\", But Mangurten said the 16,722-square-foot building would offer a \"good mix\" of tenants, based on Aetnas other developments. After the public hearing, commissioners last Thursday endorsed rezoning the property from residential to commercial with stipulations that the land be raised by about six feet, detention ponds be created, a recreational trail be installed along both 191st and Harlem and that a permanent right-in/right-out access be created on Harlem Avenue. Tinley Parks planning director, Amy Connolly, said the village is also requiring the developers to establish easements to allow traffic to go between the mall and future retail development to the west without having to use 191st or Harlem. The plan commissions approval is a recommendation to the Village Board, which has final approval. Dennis Sullivan is a freelance reporter for the Daily Southtown.]", "Date": "20150824", "Author": "[Dennis Sullivan]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-tinley-park-strip-mall-st-0823-20150821-story.html", "Title": "[Tinley Park strip mall at major corner gets early OK]"}