{"Content": "[A quiet debate is underway among American Muslims about how to reclaim our faith and affirm our love of the prophet. \"Je suis Charlie\" may have spread across social media following the massacre at the offices of the French satirical journal Charlie Hebdo. But to many Muslims, \"Je suis Muhammad\" was the truer response. Answers can be found in the teachings of our prophet. Muslims strive to model their lives after the man they consider \"mercy to mankind.\" Muslims love Muhammad, as they love other prophets, and cannot help but feel hurt when he is insulted or slandered. Since the attacks of Sept. 11, 2001, there has been a steady increase in the negative perception of Muslims. A Pew poll last year concluded that Muslims were perceived more \"coldly\" by the general public than any other religious group. Notably, however, the poll also showed that people who know Muslims tended to have a \"warmer\" attitude toward them. That is why its such a problem whenever American Muslims are portrayed by the media and pop culture as \"others,\" not unlike how Catholic, Jewish or Japanese Americans have been viewed at points of our history. Today, this attitude is particularly dangerous because it coincides with an increase in threats and attacks against Muslims and Islamic places of worship in both the United States and Europe. We dont yet have a full understanding of why three young Muslims were murdered in Chapel Hill, North Carolina, this week, but it is understandable why so many fear this terrible crime was at least partly motivated by anti-Muslim feeling. Fortunately, to address such views we only have to talk more openly about what our faith teaches us. In her book \"Muhammad, A Prophet for Our Time,\" the British scholar Karen Armstrong explained the shallow Western understanding of the Muslim prophet, and his followers, and presented a counternarrative based on his biography. \"Muhammad was not a man of violence,\" she wrote. \"Muhammad had been distinguished in his selfless treatment of the people around him.\", Muhammad is the most beloved name among Muslims. I carry his name and so do my two sons. In Arabic culture, people are expected to reflect the attributes of the names they carry. The boxer Cassius Clay chose the name Muhammad when he became Muslim, and so did Elijah Muhammad, the founder of the Nation of Islam. The civil rights leader Malcolm X went on a spiritual journey, tracing the steps of the prophet Muhammad in the holy city of Mecca, that he said transformed his life and removed hatred and racism from his heart. The image of Muhammad in the minds of Muslims is of a pious, simple man who understood peoples limitations. He was gentle, humble, loving, witty and accommodating. He asked his followers to respect every life even the lives of animals and plants. He said that the life of one person is more sacred than the holiest place on earth. He forgave his enemies, even those who killed and desecrated the dead body of his uncle. He savored the company of slaves and the disenfranchised. He denounced racism and championed social justice. He told men to honor women and not to hurt them. Needless to say, the barbaric, criminal acts of the Islamic State and the Paris murderers do not represent the teachings of Muhammad. President Barack Obama said recently, \"Our biggest advantage . . . is that our Muslim populations . . . feel themselves to be Americans. And there is this incredible process of immigration and assimilation that is part of our tradition that is probably our greatest strength.\" From all accounts, the three students killed in Chapel Hill Deah Shaddy Barakat, Yusor Mohammad Abu-Salha and Razan Mohammad Abu-Salha were ideal citizens who sought to help the less fortunate and believed in serving their community. They also followed the model of the prophet. More Americans need to get to know their Muslim neighbors and to see their contributions to our civic life. In Chicago, where I live, there are Muslims in all walks of life, making a particularly large contribution to my own profession, medicine. The Willis and the John Hancock towers were designed by Fazlur Rahman Khan, a Muslim architect. Organizations such as the Inner-City Muslim Action Network are at the forefront of social entrepreneurship, working to combat violence and provide opportunities for inner-city youth. Thousands of Muslim-owned businesses and restaurants are the opposite of supposed \"no-go zones\" they are welcoming zones to all that add global favor to the city of big shoulders. This is the reality in cities and towns across America. During his life, and not unlike Jesus and Moses, the prophet Muhammad had to deal with relentless campaigns to tear down his character and discredit his message. The best response, the Koran tells us, is to \"return an insult with a good deed.\" That is the faith I know, and that is the man Muslims love. Washington Post, Mohammed Zaher Sahloul is a past president of the Council of Islamic Organizations of Greater Chicago.]", "Date": "20150216", "Author": "[Mohammed Zaher Sahloul]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-chapel-hill-muslim-americans-20150216-story.html", "Title": "[The conversation Muslims need to have]"}