{"Content": "[Wisconsin Gov. Scott Walker, a preachers son who withstood a recall election spawned by his fight with public employee unions, is joining the crowded Republican presidential race, aides said on Thursday. Having spent the past several months traveling the country, speaking to conservatives, courting voters and scoring well in some early polls, Walker will officially enter the race with a campaign announcement in the Milwaukee suburb of Waukesha on July 13, the aides said. They spoke on condition of anonymity because they werent authorized to publicly discuss the campaign launch. The news that Governor Scott Walker will officially file paperwork to become a candidate for president was no surprise to some people in his hometown of Delavan. July 2, 2015. (WTMJ Milwaukee), The news that Governor Scott Walker will officially file paperwork to become a candidate for president was no surprise to some people in his hometown of Delavan. July 2, 2015. (WTMJ Milwaukee), Walker started a countdown of sorts to his kickoff by posting a slice of his presidential campaign logo on Instagram, with eight more pieces to come in the days ahead. He also tweeted an image of himself waving next to an American flag with the message \"It begins.\", In fact, the race has been underway for months. The jumbled Republican race already has already attracted 14 candidates, with New Jersey Gov. Chris Christie getting in earlier in the week. Walker rose to national prominence soon after his election as governor by pushing for a law in 2011 that effectively ended collective bargaining for most public workers in the state. Four years later, he pressed to make Wisconsin a right-to-work state where employers and unions are barred from requiring all workers to pay union dues. In 2011, protests at the Statehouse grew as large as 100,000 people at times, and Democrats in the state Senate fled Wisconsin for three weeks hoping to undermine Walkers efforts. Walkers victories over organized labor certified him as a rising Republican star. It also made him a top target for Democrats and union leaders, who tried to recall Walker in a special election in 2012. Walker beat back the effort, winning by a larger margin than in 2010 and becoming the first governor in U.S. history to survive such an effort. Along the way, he shattered state campaign finance records, collecting six-figure checks from prominent conservatives across the country and building a network hes tapping now for his presidential bid. In between signing the union laws, Walker, aided by the states Republican-controlled Legislature, also worked down a list of conservative priorities. He cut income and corporate taxes by nearly $2 billion, lowered property taxes, legalized the carrying of concealed weapons, made abortions more difficult to obtain, required photo identification when voting and expanded the states private school voucher school program. But Walker has made missteps along the way. He promised in 2010 that if elected his policies would lead to the creation of 250,000 private-sector jobs. He fell far short of that, as only about 129,000 jobs were added during his first term, and manufacturing-heavy Wisconsin has lagged the national average in job growth since shortly after Walker took office. His proposed budget cuts to public schools and the University of Wisconsin, the deepest in state history, have generated bipartisan opposition. Walker has been dogged throughout his tenure as governor by two investigations, neither of which has led to any charges of wrongdoing against him. The first, begun in May 2010 while Walker was running for governor, focused on activity within Walkers county executive office. Six Walker aides and associates were convicted of charges including theft and misconduct in office. The second investigation, which grew out of the first, centered on whether conservative groups illegally coordinated fundraising and other political activity to benefit Walkers recall campaign and other Republicans who faced recalls in 2011 and 2012. This investigation is on hold while the state Supreme Court weighs lawsuits challenging its validity. Walker is trying to become the first president since Harry Truman, elected nearly 70 years ago, without a college degree. Walker attended Marquette University for three years, but dropped out 34 credits short of graduation in 1990 to take a job with the American Red Cross. Walker ran for the state Assembly that year and lost. He moved to a more conservative district outside of Milwaukee and ran again in 1993, winning that time. He hasnt lost since. Associated Press]", "Date": "20150702", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-scott-walker-presidential-campaign-20150702-story.html", "Title": "[With social media tease, Wisconsin Gov. Scott Walker enters 2016 race ]"}