{"Content": "[On Monday, Wisconsin Gov. Scott Walker officially became Republican presidential candidate No. 15. First, he came out with a campaign videothat was more amber waves of grain and fruited plains than about the candidate, but he made his point that he is a conservative who will \"fight and win for the American people.\", Then, in the late afternoon, he made his formal announcement from a stage in suburban Milwaukee, with a call for \"fresh leadership\" and \"big, bold ideas from outside of Washington.\", The question is whether he can be heard above the din of 14 other candidates, and over the roar of one Republican in particular: Donald Trump, who has stolen a march on his rivals since his own announcement June 16. Walker may be able to sell himself as an establishment Republican candidate with the same kind of base-pleasing views as Trump, but with a less bombastic self-presentation. On the surface, you couldnt ask for two more different candidates than the real estate mogul and the preachers son. Trump is, well, Trump. Walker, on the other hand, is genial, affable and low-key. As a teenager, he filled in for his father delivering the Sunday sermons and flipped hamburgers at McDonalds. He quit college, as he explained it to his parents, to make sure there was money to send his younger brother. Democrats who worked with him over the years admit how pleasant he is. This is where the contrast between Walker and Trump ends and the similarities begin. In his political life, Walker has tried to bring about the America that Trump says we need. He did so first as an assemblyman (calling for a harsh \"truth in sentencing\" law, prison privatization, and voter-ID laws) and then as Milwaukee county executive (making cuts to spending on parks and public transit, and focusing on making life better in the suburbs rather than helping those in the city). By the time he left that post, Milwaukee had the nations second-highest black poverty rate and an unemployment rate almost four times higher for blacks than for whites. He was elected governor with high turnout among his white base. His first act was to bust the public unions and give businesses a tax break. The idea of alternatives to prison adopted by some Republicans has no appeal in Wisconsin, which has the highest rate of black males behind bars of any state. A release of e-mails ordered by a court that convicted a group of Walker aides for violating campaign laws revealed a casual racism and homophobia. The messages from the era when Walker was county executive were circulated on a secret router (shades of Hillary Clinton). One referred to dogs that should qualify for welfare because they were \"mixed in color, unemployed, lazy, cant speak English and have no frigging clue who their Daddys are.\", Walkers former deputy chief of staff, Kelly Rindfleisch, forwarded it, adding, \"hilarious\" and \"so true.\" Last year, Walkers deputy finance director sent out tweets making reference to \"half-breeds\" and one in which she vowed to \"choke that illegal mex cleaning in the library.\", Trump and Walker arent that far apart on many issues, just on how they express them. Trump appeals to very conservative Republicans, tea party supporters and older, white suburban voters, the most likely to turn out in the early nominating contests. These voters also are Walkers base. Some of the same sentiments that inspire Trump animate Walker, but the Wisconsin governor expresses them in his boy-next-door way and in his policies. Democrats were at first shocked by how conservatively Walker governed after running a bland campaign. He took on labor, pushed draconian spending cuts with no tax increases, refused Medicaid funds, expanded school choice, and tilted toward business interests, including a plan to help the Milwaukee Bucks build a new stadium. State Sen. Bob Jauch, D, told the National Journal that the soft-spoken Walker \"has an altar boys appearance, but Darth Vader writes his policies.\", Walkers strength comes from surviving a recall, getting re-elected in a bluish state, an impressive fundraising record with a $37 million haul during his recall campaign, and an appeal to hard-core conservatives without looking mean. More recently, Walker also has taken harder line in other areas: criticizing a path to citizenship for undocumented immigrants as amnesty, condemning leniency for so-called dreamers and supporting a constitutional amendment that would throw gay marriage back to the states. His conservatism has catapulted him to the top of some polls in neighboring Iowa and hes spoken of in the same breath as Jeb Bush and Marco Rubio, only with impressive chops as a sitting governor (thats until John Kasich of Ohio, with his 30-point reelection win, gets in later this month). The latest Economist-YouGov poll puts Trump at the head of the Republican pack -- his favorability among Republicans jumped to 49 percent this month from 38 percent in June. Trumps numbers are twice as high as Walkers in the latest Fox poll. Trump has shown how hungry people are for a return to an older America. Well see whether he gets to fill that appetite at the first debate or if the Boy Scout does. Bloomberg, Margaret Carlson is a Bloomberg View columnist. ]", "Date": "20150714", "Author": "[Margaret Carlson, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-scott-walker-donald-trump-republican-candidates-20150714-story.html", "Title": "[Scott Walker enters race as the quieter Donald Trump]"}