{"Content": "[Jeb Bush said during Wednesday nights Republican presidential debate that Donald Trump wanted casino gambling in Florida. Donald Trump said \"I did not.\", \"I promise, if I wanted it, I would have gotten it,\" Trump told Bush during the exchange. Bush replied, \"No way, man.\", But the fact is, Trump wanted it and didnt get it under the Bush administration, despite donating money to the state Republican Party and Bush. \"The bottom line is Donald Trump was interested in casino gambling in Florida, I can tell you that for a fact,\" said former Florida House Speaker John Thrasher, who said he met with Trump twice and talked about the issue, once in New York and once in Trumps Palm Beach Mar-A-Lago resort. Thrasher, now president of Florida State University, said during both meetings Trump pushed for Florida to sign a compact with the Seminole Tribe of Florida to allow casino gambling. At the time, early in Bushs first term, Trump was working with the tribe on a deal to manage whats now the Hard Rock Casino. That deal eventually fell through, but not before Trump pushed Florida leaders to come to an agreement. The stumbling block? Bush. \"It was pretty clear Jeb Bush wasnt interested in casino gambling,\" Thrasher said. When it was pointed out to the Trump campaign that he actually was interested in casinos during the Bush administration, spokeswoman Holly Hicks said by email, \"Mr. Trump never asked Jeb Bush personally to approve casino gambling.\", But he did push for it. Former state Sen. Dennis Jones was at Thrashers second meeting with Trump, along with powerful Sen. Jim King, and confirmed Trump wanted to talk about casinos. Jones said Trump also said he wanted to be a player if Florida ever approved destination casino resorts, which Trump is still interested in. \"I kind of smiled a little bit when Trump was saying it, that if he wanted it, he would have gotten it. It doesnt work that way in Florida,\" Jones said. \"I dont think Jeb would have allowed it and I dont think the Legislature would have passed it.\", Before Bush took office, Trump was making plans for a Miami Beach casino if Florida voters approved a constitutional amendment. They didnt and Trumps plans fell through. While Bush was in office The Seminole Tribe wanted to open the Hard Rock Casinos in Hollywood and Tampa and Trump wanted to manage them. Now Trump wants to bring a resort casino to his Trump National Doral golf resort near Miami if lawmakers decide to expand gambling an issue that comes up every year in Florida but which the Republican-dominated Legislature continually reject. Bush, who served from 1999 to 2007, staunchly opposed casino gambling. The Seminole Tribe did open the Hard Rock Casino in 2004, but did so with poker rooms, bingo and machines that looked like slot machines but were based on bingo. They wanted real slot machines and card games such as blackjack and tried negotiating a compact with Bush. After Bush was elected and before he was sworn in, lobbyist Fred Baggett repeatedly tried getting a meeting with Bush to push the compact. \"He wanted to meet Jeb directly to discuss casino gambling,\" said Bobby Martinez, who was the lead lawyer on Bushs transition team. \"I knew that Jeb had no interest in introducing casino gambling in Florida and I politely told Fred that I could not and would not arrange a meeting with Jeb.\", Bush never did agree to expand the games. His successor, then-Gov. Charlie Crist, did sign a compact allowing card games and slot machines and the casino has become extremely successful. Bush said during the debate that he cant be bought by donors and used Trump as an example. \"The one guy that had some special interests that I know of that tried to get me to change my views on something that was generous and gave me money was Donald Trump. He wanted casino gambling in Florida,\" Bush said. Lobbyist Brian Ballard, who backs Bush and who represents Trumps business interests in Florida, agrees that if Trump had asked Bush to support casinos, Bush would have said no. \"If I represented him then, I would have said, Save your money. Jeb Bush is not going to be for destination resorts,\" Ballard said. Associated Press]", "Date": "20150917", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-donald-trump-jeb-bush-florida-casino-but-he-did-20150917-story.html", "Title": "[ Trump tells Bush he didn't want a Florida casino, but he did ]"}