{"Content": "[Islamic State-linked militants struck Egyptian army outposts in the Sinai Peninsula on Wednesday in a coordinated wave of suicide bombings and battles that underlined the governments failure to stem an insurgency despite a two-year crackdown. Security officials said dozens of troops were killed, along with nearly 100 attackers. The restive territorys deadliest fighting in decades followed the assassination of Egypts chief prosecutor and a vow by President Abdel-Fattah el-Sissi to step up the legal battle against Islamic militants. Later Wednesday, a special forces team raided a Cairo apartment and killed nine fugitive members of the outlawed Muslim Brotherhood, including a former member of parliament, security officials said. The Brotherhood responded by calling for a rebellion against el-Sissi, saying the nine were \"murdered in cold blood.\", Authorities and pro-government media have blamed Egypts recent violence on the Brotherhood, which has been branded a terrorist group, as well as other supporters of ousted President Mohammed Morsi. The Brotherhood denies involvement. The new bloodshed also came as Egypt was marking the second anniversary of the events that led to the July 3, 2013, military-led overthrow of Morsi, although the celebrations were muted by Mondays killing of Prosecutor General Hisham Barakat and fears of unrest by the former presidents supporters. Militants in northern Sinai, which borders Israel and the Gaza Strip, stepped up their attacks following Morsis fall. Last year, the main insurgent organization operating in Sinai pledged allegiance to the Islamic State group, calling itself Sinai Province. The coordinated Sinai assault focused on the town of Sheikh Zuweid and targeted at least six military checkpoints, security officials said. The militants also took soldiers captive and seized weapons and several armored vehicles, they added, speaking on condition of anonymity because regulations did not authorize briefing the media. Scores of militants besieged Sheikh Zuweids main police station, shelling it with mortars and rocket-propelled grenades and exchanging fire with dozens of police inside in an attack that lasted most of the day, the officials added. As fighting raged, an Apache helicopter gunship destroyed one of the armored carriers captured by the militants, they added. Warplanes also roared through the skies. The officials gave a death toll of 64 soldiers, 90 militants and four civilians. It was the biggest battle in the Sinai since the 1973 Arab-Israeli war. At least 55 soldiers were wounded, they said. Other security officials put the number of soldiers killed at more than 50, but did not give a precise figure. In a statement on state television, the military said 17 soldiers had died, with 13 wounded, while at least 100 \"terrorist supporters\" had been killed. The conflicting totals could not immediately be reconciled, and discrepancies are common following such attacks. Military spokesman, Brig. Gen. Mohammed Samir said that the countrys armed forces targeted and destroyed two militant gatherings in northern Sinai. The territory, characterized by hardscrabble towns, desert and mountainous areas suitable for guerrilla operations, has long been neglected by the government. Local Bedouin tribesmen have grown to resent Cairo, turning to smuggling, organized crime and, in some cases, radical Islam. The sustained attack the first of its kind suggested the militants have ambitions to seize an entire city. The Islamic State affiliate that calls itself Sinai Province claimed its fighters targeted 15 army and police positions and staged three suicide bombings, two that targeted checkpoints and one that hit an officers club in the nearby city of el-Arish. The authenticity of the claim could not be immediately verified but it was posted on a Facebook page associated with the group. Army checkpoints in the area are routinely staffed by 50-60 soldiers. An Associated Press reporter heard two explosions from the Egyptian side of the Rafah border crossing with Gaza and saw smoke rising, though it was not immediately clear what caused the blasts or if they were linked to the militant assault some 40 kilometers (25 miles) away. Last week, Islamic State spokesman Abu Mohammed al-Adnani issued an audio statement calling for massive attacks during the Muslim holy month of Ramadan, now entering its third week. The United States condemned the assault as a terrorist attack, with White House spokesman Ned Price saying that the U.S. \"stands resolutely\" with Egypt and will continue to work with Cairo to address threats to its security. The planning and coordinated execution of the Sinai attack shows the insurgency in the area is growing stronger, especially since Morsis ouster and the crackdown on Islamic militants. They have been battling Egyptian security forces in the northern Sinai for more than a decade, despite military reinforcements, strict curfews and the destruction of homes and tunnels along the border with Hamas-ruled Gaza. The insurgency also poses a serious threat to Egypts security as the military-backed government struggles to restore stability after years of unrest since the 2011 uprising that ousted Hosni Mubarak. \"This specific attack is by far the worst weve ever seen,\" said Daniel Nisman, CEO for the Levantine Group risk consultancy. \"Its not a hit-and-run this is what they used in places like Syria and Iraq to actually capture and hold territory.\", Nisman said the attack revealed the weaknesses of the militarys \"scorched earth\" operations in the northern Sinai, which he says have made it difficult for an army that is \"very, very overstretched\" from multiple missions and struggles to recruit support among the local population. In the Cairo raid, the Interior Ministry said that the nine Brotherhood members who were killed had been plotting attacks on the police, the judiciary and the media. Three special forces members were wounded in the operation, the ministry said in a statement. In addition to weapons, investigators found 43,000 Egyptian pounds ($5,630), along with documents and memory cards, and the information seized would be used in the investigation into Mondays killing of Barakat, the prosecutor general. State TV showed images of the apartment after the raid, with bloodied bodies on the floor with several Kalashnikov assault rifles near their hands. One of the dead was Nasr al-Hafi, a former deputy in the lower house of parliament for the Brotherhoods Freedom and Justice party, while the other was a Brotherhood leader, Abdel-Fattah Mohamed Ibrahim. The Brotherhood said the men were innocents who supported families of slain and arrested members, calling el-Sissi a \"butcher.\", \"Come out in rebellion and in defense of your country, yourselves and your children,\" it said in a statement issued in English. It called the killings \"a turning point that will have its own repercussions,\" adding that \"it will not be possible to control the anger of the oppressed.\", At Barakats funeral, el-Sissi had pledged to bring his killers to justice. He signaled an even tougher campaign against the Brotherhood. Since Morsis ouster, Egypt has arrested thousands of Islamists and other dissidents, convicting hundreds in collective trials and issuing mass death sentences, with Barakat overseeing the prosecution of many of the cases. Morsi is among those condemned to die, but an appeals process remains ahead of him. Associated Press, ]", "Date": "20150701", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-egypt-army-checkpoint-attacks-20150701-story.html", "Title": "[Massive assault on Egypt army in Sinai kills 64 troops ]"}