{"Content": "[Despite 11th-hour pleas, Lincoln-Way District 210 officials decided to shutter Lincoln-Way North High School next year, in a drastic move aimed at shoring up the cash-strapped school districts finances. In a district that once thrived on new growth, the school board voted 5-2 to close the school. The move, officials said, was necessary to save $5.2 million annually, reverse the districts deficit spending and get it off the states financial watch list. \"This is crazy. It breaks my heart, but we have to close North,\" board member Christopher McFadden said. \"I hate that I have to do this. I hate that (superintendent) Scott Tingley inherited this mess.\", School leaders voted to close one of four high schools in the southwest suburbs. CBS 2s Mike Parker reports. School leaders voted to close one of four high schools in the southwest suburbs. CBS 2s Mike Parker reports. The State Board of Education this spring placed District 210 on its watch list of financially troubled districts in light of its large budget shortfall. The district must submit a deficit reduction plan to the state board by September, explaining how it intends to eliminate the districts annual deficit spending within a three-year time period. School board members were faced with limited options closing a school, a 5 percent property tax rate increase in each of the next two years or eliminating courses and extracurricular activities. District officials have estimated that closing a school will end the districts annual deficit spending by the 2017-18 school year. On Thursday night, board members Christine Glatz and Dee Molinare, who live in the North neighborhood, were opposed and supported closing Central, rather than a new building. \"We are all Lincoln-Way. We will pull together as the Lincoln-Way community regardless of decision,\" Molinare said, urging the community to support them in this decision. Molinare also urged her fellow board members to make a logical, financial decision, not one based on emotional ties, personal agendas or what ifs. Before the board discussed the proposal, some took final shots at the board, accusing them of \"negligence at the highest level\" and pleaded one more time to keep North open and close Central. Liz Sands Hudson, who supported closing Central, urged the board to \"make a decision that will last,\" with no more betting on potential growth, projected numbers, an economic turnaround or the state coming through. Those who voted to close North and keep Central open said even though they do not want to close another school, there are too many uncertainties with the states own budgetary woes. Should they be forced to close a second school, they need to have the two biggest schools open. One mother said she prays this is the last time the district will have to close a school. Before voting on which of the four high schools to close, the board voted 6 to 1 to keep its boundaries based on its feeder schools. Member Chris Kosel said they would revisit the boundary issue annually and if there are any changes in state funding or other issues, and realign them if necessary in the future. A vast majority of emails strongly supported keeping the feeder schools together, said member Arvid Johnson. \"The fact that we are in financial crisis is not a reason to blow up the feeder school system. It works,\" McFadden said. Board member Molinare disagreed, saying \"children do well mixing it up with other kids. It helps some kids break a stigma that may need to move from.\", \"We better be able to educate them,\" regardless of where they come from, she said. Closing North means students in Manhattan and Mokena will also be changing schools next year. According to the new three-school configuration, all North students will attend the East campus, with students in Frankfort District 157C, for a total of 2,867 students. Lincoln-Way Central will house students from Mokena District 159 and Martino Junior High in New Lenox District 122, totaling 2,206 students. Liberty Junior High students, also from District 122, will continue to attend Lincoln-Way West, with the addition of Manhattan District 114 students, with an enrollment of 2,275. If Lincoln-Way North is like its mascot, the Phoenix, it could rise again when the district returns to sound financial footing. But, until then, officials hope it can be given new life to a leased tenant. Its location at 199th and Harlem Avenue, in Frankfort Township, about a mile south of Interstate 80 is one reason the board opted to close North, despite vehement protests from parents. Its highly visible and accessible location makes it attractive to potential tenants that could generate some revenue for the district. Despite the reasoning, the closure was bitterly fought by North parents, who launched a website and took out newspaper ads recently saying the district should operate schools that are the \"safest,\" \"most up to date,\" and \"least to maintain in the future.\" They said their financial and enrollment data all pointed to closing Lincoln-Way Central High School. The issue has divided the once tight-knit high school community. Parents and former students of Central and West high schools also used social media to garner support to save their respective schools. The East campus never seemed to be seriously considered as an option to close, but according to board President Kevin Molloy, it is the most costly to operate. The difference in operating costs for the four schools varied by $400,000, he said. At the May board of education meeting, Tingley painted a grim picture of district finances, citing declines in enrollment, state aid and its equalized assessed valuation, coupled with budget uncertainty in Springfield. He explained three options to parents at the time close a school, seek a property tax increase or cut classes and extracurricular activities the latter two options were later ruled out by the board. Board members said if they are forced to close a second school, they want to continue to operate the two largest campuses Central and East, each with a capacity for 3,750 students. The identical North and West campuses were built for 2,500. When those two schools were built, enrollment was projected to be 10,100 by the 2013-14 school year, but was actually 7,246. Current enrollment is 7,134, and it is now projected to drop to 6,600 by 2020. If there is any growth, it is expected to be in the southwest area of the district, which is why officials said they supported keeping the West campus open. For every 1,000 drop in enrollment, the district loses $6 million in state aid, Molloy said. Molloy said it is no coincidence that the districts deficit spending will total $5.2 million the same amount the state has promised in state aid, but never delivered. \"The board has not been negligent. We have been fighting this since 2008,\" he said, adding that since that time, the district has made $9 million in cuts. The district still owns 72 acres at the southeast corner of 191st and Harlem, for which it paid $3 million in 1996. It was almost sold in 2006 for $11.5 million to W.M. Store Realty of Tinley Park for commercial purposes. Parents, who objected to closing North, previously objected to building the high school at that busy intersection, and neighbors later hired an attorney to fight plans for a proposed Wal-Mart. slafferty@tribpub.com]", "Date": "20150814", "Author": "[Susan DeMar Lafferty]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-lincolnway-school-closing-st-0814-20150813-story.html", "Title": "[Lincoln-Way North High School to close]"}