{"Content": "[Most Americans are familiar with the prestige that surrounds the United States military service academies. Various names and phrases, spoken like solemn incantations, attest to their sacrosanct status: the Point, the Long Gray Line, Annapolis, cadets. Their graduates constitute a whos who of American greatness, including Ulysses Grant, Jimmy Carter, novelist James Salter and sci-fi writer Robert Heinlein, to name only a few. Gen. Douglas MacArthur, in a 1962 address at West Point, typified the veneration thats usually heaped on the academies when he told the cadets that they were \"the leaven which binds together the entire fabric of our national system of defense.\", The service academies the U.S. Military Academy for the Army, the U.S. Naval Academy, the U.S. Air Force Academy and the U.S. Coast Guard Academy promise to educate and mold future officers charged with leading the enlisted members of the military. But they are not the hallowed arbiters of quality promised by their myths. Their traditions mask bloated government money-sucks that consistently underperform. They are centers of nepotism that turn below-average students into average officers. They are indulgences that taxpayers, who fund them, can no longer afford. Theyve outlived their use, and its time to shut them down. The most compelling and obvious argument is the financial one. It officially costs around $205,000 to produce a West Point graduate, although a 2002 Government Accountability Office study put the cost at over $300,000; officers at the Air Force and Naval Academies are minted for $322,000 and $275,000 respectively. According to at least one measurement, thats about four times as much as it costs to produce an officer through the Reserve Officers Training Corps, which trains officers-to-be while they attend civilian colleges. One reason for the expense is that attendance at the academies is free for cadets. In fact, since theyre technically members of the armed forces, the students get paid for going to school. As Bruce Fleming, a heretical professor at the Naval Academy wrote for Salon, they receive \"a government-sponsored guarantee of a golden ticket to life: college at taxpayer expense with no student debts, the highest salary of any set of graduates, and guaranteed employment and . . . health benefits for at least five years, frequently well beyond.\", Perhaps risking your life in patriotic service merits lavish treatment. During my own Army service, not having to worry about housing or medical care surely allowed me to concentrate on my duties as a soldier. But graduates of the academies, which cover every possible expense for four years, make up only 20 percent of officers serving in the military. The rest are from the ROTC and from Officer Candidate School, which is for college grads and enlisted personnel who want an officers commission. Are those other officers less deserving of a \"golden ticket\"?, No, because they are not merely more numerous they are also equally (or more) effective as officers. No evidence shows that officers who attended civilian colleges, or any one of the U.S. Senior Military Colleges such as the Citadel, are lesser leaders than their service-academy colleagues. Tom Ricks, a Pulitzer Prize-winning defense journalist, put it succinctly: \"After covering the U.S. military for nearly two decades, Ive concluded that graduates of the service academies dont stand out compared to other officers.\" After all, perhaps the most preeminent Army leader in recent times, Colin Powell, is a product of the ROTC, not West Point. This parity in skill has been slowly expressing itself in a rising number of promotions for ROTC officers over the past few decades. Thirty years ago, most Army three-star generals had graduated from West Point. As of 1997 (the last year for which data is available), only a third had. A study of naval officer ascension using data from 2003 concluded that, on average, there were no real differences in promotion rates between Naval Academy officers and ROTC officers. Of course, these arguments from statistics cant be definitive, but they do indicate that ROTC officers are able to compete with their peers. Nearly half of the Joint Chiefs of Staff serving over the past decade bypassed the service academies. These days, too, a little thrift wouldnt hurt. The F-35 fighter jet, the most expensive boondoggle in weapons history, is six years late, has already cost taxpayers nearly $400 billion and still doesnt work; in the latest budget, Congress allocated $120 million for M1 Abrams tanks the Army says it doesnt want or need; the Daily Beast recently called the 2016 budget a Christmas present for military contractors. According to the Project on Government Oversight, it includes billions of dollars in spending that the Pentagon didnt request. Former Defense Secretary Robert Gates, himself a nexus of bipartisan consensus, said at the Federal Innovation Summit last summer that \"what is needed most of all are leaders who are prepared to challenge conventional thinking, break crockery, stop doing what doesnt work well or at all, and set a new course.\" Well, heres our chance. Some arguments in favor of the service academies cite the rigorous selection process. But we really have no idea how elite their students are. Admittance to a service academy requires a nomination from a member of Congress, the vice president, a secretary of the respective military branch or other high-level officials. These nominations are doled out in a process with rather vague guidelines and nonspecific criteria, making political patronage inevitable. The academies admit recruits according to Title 10, U.S. Code, Section 6954 which, for guidance, merely says how many cadets can be admitted, who can nominate them and where they can come from. According to an investigation by USA Today, nepotism often governs the nominations, with many going to well-connected families or big-name donors. Bruce Fleming has complained in numerous media outlets about the low quality of the students he teaches at the Naval Academy, and he says three Freedom of Information Act requests about the admissions process havent gotten him any closer to understanding why some students are admitted over others. Gore Vidal (born at West Point and connected to the institution by heritage) depicted the service academies as loathsome breeding grounds for a permanent military-elite class of \"ring knockers,\" as he wrote in the New York Review of Books in 1973. Thats exactly why people have been trying to shut the academies down since at least 1830, when folk hero and Tennessee congressman Davy Crockett tried to pass a bill abolishing West Point. Another attempt was made in 1863, when Sen. B.F. Wade, R-Ohio, said in the bills defense, \"I do not believe that there can be found, on the whole face of the Earth . . . any institution that has turned out so many false, ungrateful men as have emanated from this institution.\", As an enlisted Army infantryman, I served under platoon leaders who attended both West Point and ROTC. All were competent and professional. But the best graduated from the University of California at Santa Barbara. What made him singular was his bravery and his resourcefulness. He was willing, in small ways, to deviate from standard operating procedure when the situation called for it. He also connected to the enlisted guys in an extraordinary way. The service academies are institutions with deep roots, but bravery and resourcefulness are eminently more American than any particular school. Our country deserves more leaders like my platoon leader, and we can have them without the financial and social burden of the service academies. The author is a veteran and a writer who lives in Portland, Maine. He contributes to the Baffler, the Atlantic and Al Jazeera, among other publications. Washington Post]", "Date": "20150125", "Author": "[Scott Beauchamp]", "Link": "http://www.chicagotribune.com/news/plus/chi-abolish-west-point-and-the-other-service-academies-too-20150124-story.html", "Title": "[Abolish West Point--and the other service academies, too]"}