{"Content": "[Donald Trump sees himself as a martyr to the truth. All he did was point out that among the foreigners who have come to this country are some who do not scrupulously abide by all our criminal laws only to be pilloried for his honesty. \"When Mexico sends its people, theyre not sending their best,\" he said when he announced his presidential campaign. \"Theyre bringing drugs. Theyre bringing crime. Theyre rapists.\", For this unvarnished assessment, he has paid a price: Univision and NBC severed their ties with him. Macys said it is dropping his line of clothing. Mattress-maker Serta wont sell Trump Home products anymore. But the King of Candor did not retreat. \"NBC is weak, and like everybody else is trying to be politically correct,\" he said after the network dropped his Miss USA and Miss Universe pageants. He told Fox News Bill OReilly he wouldnt retract his charge about Mexican immigrants because \"its totally accurate.\", Asked about it in a session with the Chicago Tribune Editorial Board on Monday, Trump brandished a sheaf of newspaper articles to confirm his point. But he didnt read them very carefully beforehand. One story, he noted, said that 80 percent of Central American women are raped on their way to the United States. Does this mean the victims were accompanied here by rapists who have crossed into America and are now dwelling among us? Not quite. The Huffington Post story he cited said the victims are usually raped before they get here by bandits, human traffickers or government officials (including, presumably, corrupt police) in Mexico. \"Migrants being raped\" does not equal \"rapists migrating.\", Trump had other articles, including a couple reporting deadly crimes committed by people who have come here without permission. But anecdotes can be misleading. Out of any group of people Episcopalians, West Virginians, tennis fans, legal immigrants from Canada you can find some criminals. That doesnt mean the bad guys are representative of the whole. The outrages cited by Trump are outside the norm, to say the least. U.S. Rep. Henry Cuellar, D-Texas, pointed out last year, \"The murder rate is actually higher in Washington, D.C. where I work, than in my hometown of Laredo, Texas, or other cities on the border like McAllen.\", In 2011, El Paso, Texas, had the lowest crime rate ranking of any city with 500,000 or more residents. That is despite being just across the Rio Grande from Ciudad Juarez, Mexico which in 2011 had the second highest murder rate of any city on Earth. The same pattern shows up away from the border as well. In his extensive research on Chicago a city Trump cited for its violent crime Harvard sociologist Robert Sampson has found \"a significantly lower rate of violence among Mexican-Americans compared to blacks and whites.\", Here, he says, \"increases in immigration and language diversity over the decade of the 1990s predicted decreases in neighborhood homicide rates in the late 90s and up to 2006.\", If Trump wants to avoid rapists, heres some advice: Head for areas with lots of residents who were born in Mexico. Sampson thinks it is no coincidence that crime rates nationwide have plunged over the past two decades just as immigrants, authorized and unauthorized, were arriving in record numbers. In the first place, these newcomers are generally less prone to break the law than native-born Americans are. Most Mexicans who undertake the risks and sacrifices required to come here want to work at honest jobs and provide for their families, not rape and kill. Mexicans who want to rape and kill, after all, can find plenty of suitable targets without leaving home. In the second place, the influx of foreigners, particularly from Mexico, has helped revive many blighted communities. They have generated economic activity and filled vacant buildings, both of which tend to curb crime. Whats true of Chicago, Sampson notes, is also true of New York and Los Angeles, where crime has subsided fastest in the neighborhoods with the highest immigrant concentrations. Trump regards the backlash as a product of spineless pandering to groups that vigorously suppress any information they find inconvenient. But he has only managed to prove something his own admirers strive to forget: Just because a statement is politically incorrect doesnt mean its true. Steve Chapman, a member of the Tribune Editorial Board, blogs at http://www.chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150704", "Author": "[Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-donald-trump-immigrants-nbc-oreilly-rapists-perspec-0705-jm-20150702-column.html", "Title": "[Trump and the myth of immigrant crime]"}