{"Content": "[ The Illinois Senate on Tuesday approved legislation that would give a stalemated state government the power to spend roughly $5 billion in federal money to fund programs like energy assistance for the poor after those dollars were put on hold. The 57-0 vote represented a rare area of budget agreement between Democrats who control the chamber and Republican Gov. Bruce Rauner, who supports the proposal, according to an aide. The state lost broad authority to cut checks when the new budget year began July 1 without a full spending plan in place after Rauner vetoed most of the budget Democrats sent him that was more than $3 billion out of balance. The governor did sign off on funding so that elementary and high schools can open in the fall, and a patchwork of existing laws coupled with various court orders have kept cash flowing to about 80 percent of state government. Left unfunded, however, are social service agencies that care for some of the states most vulnerable, including children, the elderly, people with disabilities and those with addictions. Those agencies rely on a combination of state and federal dollars, and some have been forced to curb services, lay off workers and take out lines of credit as they try to make ends meet. Freeing up federal money is nothing short of a lifeline while the budget stalemate continues, said Dalitso Sulamoyo, president of the Illinois Association of Community Action Agencies, which represents about 40 social service groups across the state. \"Its critical to our continued operations. It would have been a waste to leave those federal dollars unspent,\" Sulamoyo said. \"Thats progress compared to everything else weve seen these past few months.\", While the measure would give social service providers a much-needed infusion of cash, it also relieves another pressure point that could have forced Rauner and Democrats to reach agreement on a full budget. The sides have been at loggerheads because Rauner has linked his policy agenda to prop up businesses but weaken unions with the budget-making process. Democrats argue his ideas would undermine the middle class. Money that would be freed up under the plan includes $330 million to help low-income families pay their electric bills, $275 million for job training, $304 million to support domestic violence victims, $176 million to help those with disabilities live independently, $312 million for breast and cervical cancer screenings, HIV testing and immunization services, and $98 million to deliver meals for the elderly and prevent abuse. The measure now goes to the House, where a spokesman for Speaker Michael Madigan said the chamber would consider it next week because members want more time to make sure nothing is left out. The vote on the proposal came as the Senate returned to the Capitol after taking a break for several weeks. The chamber also is expected to vote on a measure that would roll back an automatic 2 percent pay hike lawmakers received beginning July 1. The House moved to repeal the salary bump last week after pressure from Rauner, who argued legislators shouldnt get a raise while the budget goes unresolved. Senate Democrats also approved a measure pushed by Senate President John Cullerton that would freeze local property taxes for two years while giving Chicago Public Schools some help by picking up roughly $200 million in pension costs. The measure was backed by city officials, but its unlikely to clear the House. The measure is opposed by Rauner, who is pushing for a property tax freeze but wants a broader plan that would also let towns limit collective bargaining rights and repeal prevailing wage laws. In addition, Senate Democrats also passed a measure to make changes to the workers compensation system despite opposition from Republicans, who said it did not mirror plans backed by Rauner that would toughen requirements for employees to prove an injury happened on the job. Rauner signs juvenile justice measure, In other action Tuesday, Rauner signed a bill into law that would result in fewer juveniles being automatically transferred to adult court. The legislation, which was pushed by Cook County Board President Toni Preckwinkle, eliminates the automatic transfer to adult court of 15-year-olds accused of any crime, no matter how serious. For 16- and 17-year-olds, only those charged with murder, aggravated criminal sexual assault and aggravated battery with a firearm would automatically be sent to adult court. The measure does not prevent juvenile defendants from being tried as adults. But it ensures that some will have their cases heard first in front of a juvenile court judge, who can consider factors such as background, mental capacity and culpability before deciding whether to send the youth to adult court. mcgarcia@tribpub.com, kgeiger@tribpub.com]", "Date": "20150804", "Author": "[Monique Garcia, Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-illinois-senate-met-0805-20150804-story.html", "Title": "[Illinois Senate votes to turn on another budget spigot amid stalemate]"}