{"Content": "[More than two dozen awards worth more than $124 million were made to companies without a formal staff review by the underwriting department of Gov. Scott Walkers economic development agency, it reported Friday. Documents detailing the awards were made public late Friday afternoon in advance of a Wisconsin Economic Development Corporation board meeting on July 20 to discuss one troubled unsecured loan that went to a failing company owned by a Walker donor. The Republican Walker, who is expected to formally launch a presidential campaign in mid-July, has been hounded by troubles with the quasi-private jobs agency he created shortly after taking office in 2011. An internal review released Friday showed that WEDC gave out 27 award contracts to 24 companies between July 2011 and June 2013 without staff review, which WEDC said was not required at the time. Those were discovered during a review of 371 awards WEDC made in its first two years of operation. Walkers spokeswoman Jocelyn Webster said the governor would review the documents to prepare for the discussion at the July 20 board meeting. Rep. Peter Barca, the Assemblys Democratic leader, called the situation \"outrageous.\" He said there are many unanswered questions about how many loans were approved over underwriters objections. \"I am not at all confident we have even a fraction of the troubling details board members need in order to carry out our fiduciary responsibility,\" he said. \"This is yet another example of how senior WEDC officials have kept the board and Wisconsin taxpayers in the dark about serious problems surrounding the governors jobs agency.\", Some of the companies on the list are owned or affiliated with donors to Walkers political campaigns. Kenneth C. Stock, the chief executive of KCS International, a luxury boat builder in Oconto, donated $8,500 to Walker. Members of the Sonnentag family, which owns County Materials, have donated at least $36,000 to Walker. Laona-based WD Parket LLC, is a fifth-generation company run by the Connor family, longtime Republican donors. The three highest un-reviewed awards all came through the enterprise zone program. The largest, $62.5 million, went to Kohls Department Stores for an expansion of its corporate headquarters on June 28, 2012, for a project that was expected to create 3,000 jobs but that has created just 473 so far. The next highest was $18 million to Kestrel Aircraft Company for an expected 665 jobs, but just 24 have been created. The third highest was $15 million to Plexus Corp. to create 350 jobs, but none have been created, according to a tally provided by WEDC. Of the 27 awards, just over 6,100 jobs were expected to be created, but to date only about 2,100 have been. Nearly 8,900 jobs have been retained, according to WEDC. The projects made about $490 million in investment, the report said. One of the 27 unsecured awards was a $500,000 loan to the now-defunct Milwaukee construction company Building Committee Inc. that was collapsing at the time and created no jobs. That was among several loans questioned by state auditors that led Walker in May to call for scrapping the loan program. The loan to BCI came after its owner William Minahan had given Walkers 2010 gubernatorial campaign a last-minute $10,000 donation on Election Day the maximum individual contribution. A memo from Jake Kuester, the vice president of credit and risk at WEDC, outlined what he called an \"extensive review\" of all awards the agency made worth more than $200,000 during its first two years in operation. Kuester said employees of the former Department of Commerce, which WEDC replaced, said it was an \"acceptable practice\" for the secretary of the agency to approve an award with no formal written staff review \"when the need to be flexible and reactive to a businesss needs warranted it. That practice was carried forward into WEDC during its early days.\", In July 2013, the WEDC board approved a new policy that included requiring a written review on all program awards. Since then, WEDC says it has approved more than 760 awards, all of which were reviewed by staff. Associated Press]", "Date": "20150619", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-scott-walker-jobs-agency-20150619-story.html", "Title": "[Scott Walker's Wisconsin jobs agency gave out $124 million without review]"}