{"Content": "[The latest Quinnipiac poll shows that the American public rejects President Barack Obamas Iran deal by more than 2-to-1. This is astonishing. The public generally gives the president deference on major treaties. Just a few weeks ago, a majority supported the deal. What happened? People learned whats in it. And dont be fooled by polls that present, as fact, the administrations position in the very question. The Washington Post/ABC poll assures the respondent that, for example, \"international inspectors would monitor Irans facilities, and if Iran is caught breaking the agreement economic sanctions would be imposed again. Do you support or oppose this agreement?\", Well, if you put it that way, sure. But it is precisely because these claims are so tendentious and misleading that public and congressional opinion is turning. Inspections? Everyone now knows that \"anytime, anywhere\" indispensable for a clandestine program in a country twice the size of Texas with a long history of hiding and cheating has been changed to \"Youve got 24 days and then were coming in for a surprise visit.\" New York restaurants, observed Jackie Mason, get more intrusive inspections than the Iranian nuclear program. Snapback sanctions? Everyone knows that once the international sanctions are lifted, they are never coming back. Moreover, consider the illogic of Obamas argument. The theme of his American University speech Wednesday was that the only alternative to what he brought back from Vienna is war because sanctions even the more severe sanctions that Congress has been demanding will never deter the Iranians. But if sanctions dont work, how can you argue that the Iranians will now be deterred from cheating by the threat of sanctions? Snapback sanctions, mind you, that will inevitably be weaker and more loophole-ridden than the existing ones. And then came news of the secret side agreements between Iran and the International Atomic Energy Agency. These concern past nuclear activity and inspections of the Parchin military facility where Iran is suspected of having tested nuclear detonation devices. We dont know whats in these side deals. And we will never know, says the administration. Its \"standard practice,\" you see, for such IAEA agreements to remain secret. Well, this treaty is not standard practice. Its the most important treaty of our time. Yet, Congress is asked to ratify this \"historic diplomatic breakthrough\" (Obama) while being denied access to the heart of the inspection regime. Congress doesnt know whats in these side agreements, but Iran does. And just this past Monday, Ali Akbar Velayati, a top adviser to Irans supreme leader, declared that \"entry into our military sites is absolutely forbidden.\", One secret side deal could even allow Iran to provide its own soil samples (!) from Parchin. And now satellite imagery shows Iran bulldozing and sanitizing Parchin as we speak. The verification regime has turned comic. This tragicomedy is now in the hands of Congress or, more accurately, of congressional Democrats. It is only because so many Democrats are defecting that Obama gave the AU speech in the first place. And why he tried so mightily to turn the argument into a partisan issue those warmongering Republicans attacking a president offering peace in our time. Obama stooped low, accusing the Republican caucus of making \"common cause\" with the Iranian \"hard-liners\" who shout \"Death to America.\", Forget the gutter ad hominem. This is delusional. Does Obama really believe the Death-to-America hard-liners are some kind of KKK fringe? They are the government, for Gods sake the entire state apparatus of the Islamic Republic from the Revolutionary Guards to the Supreme Leader Ayatollah Ali Khamenei who for decades have propagated, encouraged and applauded those very same \"Death to America\" chants. Common cause with the Iranian hard-liners? Who more than Obama? For years, they conduct a rogue nuclear weapons program in defiance of multiple Security Council declarations of its illegality backed by sanctions and embargoes. Obama rewards them with a treaty that legitimizes their entire nuclear program, lifts the embargo on conventional weapons and ballistic missiles, and revives an economy described by Irans president as headed back to \"the Stone Age\" under sanctions with an injection of up to $150 billion in unfrozen assets, permission for the unlimited selling of oil, and full access to the international financial system. With this agreement, this repressive, intolerant, aggressive, supremely anti-American regime the chief exporter of terror in the world is stronger and more entrenched than it has ever been. Common cause, indeed. Washington Post Writers Group, Charles Krauthammer is a Washington Post columnist. letters@charleskrauthammer.com]", "Date": "20150806", "Author": "[Charles Krauthammer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-deal-nuclear-inspectors-obama-perspec-0807-jm-20150806-story.html", "Title": "[Just who is helping Iran's hard-liners?]"}