{"Content": "[Englewood Construction, one of the countrys leading commercial construction firms, announces its restaurant group has recently completed four projects throughout the United States. \"Restaurant has become a hot sector for construction as people feel the effects of the economic recovery and splurge more on dining and entertainment,\" said William Di Santo, president of Lemont, Ill.-based Englewood Construction. \"In fact, in its 2015 Restaurant Industry Forecast, the National Restaurant Association projected well see the sixth year of real growth in restaurant sales, which is a positive indicator for future construction activity. Were already experiencing this momentum as we discuss additional restaurant work with current and new clients that will keep us busy through summer and fall.\" , Englewoods four recently completed restaurant projects fall into the upscale casual dining category - one of the fastest-growing segments of restaurant construction, according to Di Santo. In the Chicago area, Englewoods restaurant group built a new 11,265-square-foot Coopers Hawk Winery and Restaurant at Cicero Avenue and 111th Street in Oak Lawn, Ill. It is the 19th location for the restaurant group, which is known for its casual fine dining and Napa-style wine tasting. The new restaurant features indoor and outdoor seating and a large private dining room for up to 275 guests. Additionally, Englewood completed an expansion, including a new outdoor seating area, at The Purple Pig restaurant at 500 N. Michigan Ave. in Chicago. The award-winning Mediterranean eatery features sharable plates with a focus on pork, and an extensive offering of wines. Communal tables and late hours spur on the casual, social atmosphere. \"The Purple Pig project tapped into our extensive experience working along the busy Michigan Avenue corridor,\" said Di Santo. \"Coopers Hawk was also a high-profile project, and entailed unique finish work to incorporate design elements such as glass, reclaimed wood, concrete finishes and exposed structural beams.\" , Englewood also completed two new restaurant projects with national client Darden Restaurants Inc. including a 10,913-square-foot ground up construction of Seasons 52 in Bridgewater, N.J. and an 8,000-square-foot build-out for Yard House in Kansas City, Mo. Di Santo noted the Yard House project posed unique challenges, since its structure on one side was 3 feet lower than the opposite side. Englewood created an innovative structural plan to elevate the lower side and level out the overall floor plan. \"We always enjoy drawing from our collective years of construction experience to find and implement a viable solution for an interesting scenario like this one, while also keeping the project on schedule,\" Di Santo said. , About Englewood ConstructionEnglewood Construction, Inc. is a commercial general contractor specializing in the construction of retail, restaurant, shopping center, hotel, education and office/industrial projects throughout the United States. Established in 2001, Englewood Constructions executive team has more than 30 years of commercial construction experience, including executive positions with R.A.S. Builders and Capitol Construction. Since its founding, Englewood Construction has managed over 500 projects in 28 states and amassed a national qualified vendor base exceeding 20,000 subcontractors and suppliers. For more information on the company, visit www.eci.build, and to learn the latest insights and tips on solving commercial construction issues visit the companys award-winning blog at www.hardhatchat.com. This item was posted by a community contributor. To read more about community contributors, click here.]", "Date": "20150903", "Author": "[Community Contributor Taylor Johnson]", "Link": "http://www.chicagotribune.com/suburbs/naperville-sun/community/chi-ugc-article-englewood-construction-completes-four-restaur-2015-09-03-story.html", "Title": "[Englewood Construction Completes Four Restaurant Projects ]"}