{"Content": "[This week, the Naperville Public Library, along with schools throughout the area and many organizations throughout the country, will be observing Constitution Week, which runs Sept. 17-23. Visitors to the Nichols branch in downtown Naperville will find a couple of special displays located just to the left of the main circulation desk, thanks to longtime Naperville resident Bettye Wehrli, who erected the same display a year ago at the 95th Street branch with help from library staff member Gail Rattray. \"Im a real reader of history, and every generation of my family has been involved in wars up to but not including the Viet Nam War,\" Wehrli said. \"Im a member of the local Ft. Payne Chapter of the Daughters of the American Revolution and currently work as their secretary. I did some research and looked for materials and Gail did the art work.\", Back on Sept. 17, 1787, delegates to the famous Constitutional Convention met for the final time in order to sign the document that has governed our country ever since. On Aug. 2, 1956, President Dwight D. Eisenhower officially enacted the observance based on a congressional resolution presented by the Daughters of the American Revolution, but the official week-long observation never took place until President George W. Bush called for a Constitution Week in September of 2002. Wehrli said that in her opinion, childrens books often provide a solid, concise synopsis of subject matter and that she and Rattray found one at the library that \"provided all the necessary facts.\", \"Ive always said you can learn a heck of a lot from childrens books, and we found this library book that addressed all our needs,\" she said. \"I began putting all the facts together, and Gail, who is a terrific graphic artist, did all the art work.\", More than a week ago, Wehrli and Rattrays project was brought to the Nichols branch where it will be on display through the end of Constitution Week. The three-hour installation remained unchanged from last year, Wehrli said, \"as visitors and staff were really excited about it last year\" and she hopes with an election year coming up it will solicit even more response. Rattray, who works in customer service at the 95th Street library branch, said she worked \"over 40 hours\" to put the drawings and illustrations of the giant mural together based on what she and Wehrli found in books and that the public response to it has been very positive. \"When we first rolled it out last year at our facility here, people seemed to like it and came in and took pictures and spoke about how important the Constitution is,\" Rattray said. \"I think doing the actual research took more time than the drawings.\", Rattrays supervisor, Carla Nolidis, recalled that \"people made a special trip to come to the library last year to see the exhibit\" and many remarked how it was \"a beautiful and important part of history.\", \"Visitors definitely wanted the opportunity to see it and weve decided to have it displayed on a rotating basis,\" Nolidis said. \"We had it first here at the 9th Street branch, and now its at Nichols and next year, it will go to the Naper Boulevard and complete the cycle. We also have a lot of people now in the community that have come from other places and are not aware of this countrys history.\", Nichols branch manager Olya Tymciurak said the 18-foot, three dimensional displays \"contains many facts about the Constitution\" and that a collection of books for adults as well as children have been culled from the collection for those wishing to learn more. \"We also limited copies of the Constitution we can hand out to people,\" she said. David Sharos is a freelance reporter for the Naperville Sun.]", "Date": "20150915", "Author": "[David Sharos]", "Link": "http://www.chicagotribune.com/suburbs/naperville-sun/ct-nvs-library-constitution-week-st-0918-20150915-story.html", "Title": "[Nichols library exhibit outlines importance of Constitution]"}