{"Content": "[Jeb Bush sharply criticized President Barack Obama on Tuesday for withdrawing troops from Iraq, but he declined to say whether he would order additional ground forces into the country to repel Islamic State militants. Speaking to about 60 business and Republican leaders in New Hampshire, the former Florida governor and likely presidential candidate blamed the Democratic president for allowing the rise of the violent extremist group that has captured vast parts of Iraq and Syria. Obama has no strategy to \"take out\" the Islamic State group and \"restore some stability in Iraq,\" Bush said. But when asked after his campaign event how he would act to contain the Islamic State group in Iraq if elected president, Bush declined to offer any specifics, saying he would rely on the advice of Americas military leaders. \"I would take the best advice you could get from the military, make decisions based on that conditions on the ground,\" Bush told a group of reporters. Islamic State militants scored a major victory in Iraq this week when they overtook the city of Ramadi, the capital of western Anbar province, which saw heavy fighting after the U.S. invasion in 2003. Obama pledged during his 2008 campaign to end the war in Iraq and ordered the withdrawal of U.S. forces in 2011. Bush, as have other Republicans, argued that Obama could have negotiated more firmly with the Iraqi government to keep a small force in the country to conduct counterterrorism missions and provide training to the Iraqi army. \"The surge created a fragile but stable Iraq that the president could have built on,\" Bush said, referring to an increase in U.S. forces in the country ordered in 2007 by his brother, former President George W. Bush. The Iraqi government demanded any troops left in Iraq who broke the law be subject to Iraqi law, not U.S. military courts. The Obama administration refused to agree to the terms. Last year, Obama returned a few thousand U.S. troops to Iraq in response to the Islamic State groups move from neighboring Syria into Iraq, but their role is limited to training and advising. A U.S.-led coalition is carrying out daily airstrikes on IS targets in Iraq. Bush was visiting New Hampshire for the third time since announcing in January he was weighing a candidacy for president, and in discussing Iraq, returned to an issue that tripped him up last week. When asked whether, knowing what he knows today, he would have ordered the 2003 invasion, Bush sidestepped the question for several days, before ultimately saying he would not have done so. On Wednesday, Bush said a more fitting question would have been for Obama about the rise of the Islamic State group. \"Knowing what you know now, Mr. President, would you, should you, have kept 10,000 troops in Iraq? Or 15,000 or 4,000?\" Bush said. \"ISIS didnt exist when my brother was president. Al-Qaida in Iraq was wiped out when my brother was president.\", Associated Press]", "Date": "20150520", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-jeb-bush-iraq-obama-20150520-story.html", "Title": "[Jeb Bush blames unrest in Iraq on Obama]"}