{"Content": "[Here we go. If youre a woman who might prefer someone other than Hillary Clinton as the next president of the United States, youre a self-loathing, anti-woman traitor. Already, women I know report that theyre feeling the heat from their more-liberal friends. Not a Democrat for Hillary? Good luck leaning forward, at least in this town. Ive heard from a few readers along the same lines. Heres a bracing sample from a reader named Kathryn: \"If you cannot see the merits of a distaff leader, perhaps you should trade your ovaries for testicles. You are trying so hard to be open-minded that youre in danger of becoming a hypocrite. For shame.\", Actually, I do see the merits of a distaff leader, assuming shes the candidate who most closely represents whats best for the country. Her ovaries matter no more to me than anothers testicles, if we must stoop to such symbolism. But the sole fact of a candidates sex doesnt move me much. Would I like to see a woman president? Absolutely. Would I vote for a woman instead of a better-qualified man just for the pleasure of experiencing a first-woman president? Nope. And, neither, one hopes, would any other responsible, thinking voter. For the record, which I realize is annoying when outrage is so much more convenient, my ovaries and I have written several favorable articles about Clinton through the years, especially concerning her contributions to womens empowerment around the world. Beginning with her 1995 declaration in Beijing at the Fourth World Conference on Women that \"Human rights are womens rights and womens rights are human rights,\" through her tenure as secretary of state, Clintons pro-woman efforts rank among the most powerful diplomatic accomplishments in recent history. Social science confirms and popular consensus affirms that womens equality is every nations greatest asset and the worlds best hope for security and peace. Give women jobs and their children receive better nutrition and education. Give women political strength and they help guide policies that reflect a more egalitarian world. These are not smallish things, and Hillary Clinton is the face of these achievements on a global scale. But theres a third plank to womens empowerment, and herein lies the difficulty for many women in this country reproductive autonomy. Although settled by law, theres always the worry on the left that another U.S. Supreme Court seat or two could change all that. Meanwhile, Republican-controlled states are tightening laws that make abortion less accessible. Such is the unspoken context for a Hillary Clinton campaign. While abortion may not be foremost in voters minds, it still pervades debate among the political class. EMILYS List, which has raised hundreds of millions of dollars and supports only pro-choice women, would never help a pro-life woman reach elective office. The ultimate test of a womans equality with men, after all, is to not be burdened with pregnancy and an \"unwanted\" child. The logic of this premise is unassailable, but only if you measure equality by mens instruments a discussion for a future column. Meanwhile, Clintons challenge is how to position herself as The Woman Candidate she who can finally crash through the ultimate glass ceiling to become the first woman president when, plainly, only certain women qualify for sisterhood. Rather than resting this burden solely on Hillarys shoulders, perhaps women on the left and the right might consider dropping their weapons and sitting down to resolve the abortion issue among themselves. They would find, I suspect, far more in common with each other than with the stronger-torso set. Democrats might also find more willing interest from Republican women than they imagine. Heres a glimpse of what I mean. Last year, while appearing on a panel with two men and speaking to a Republican audience of mostly men, I suggested that the GOP divest itself of its pro-life platform not to sacrifice principle but to broaden its appeal to women and perhaps as part of re-imagining the issue. As far as I could tell, every woman in the room applauded; and virtually none of the men did. The truth is, the \"war on women\" has become an internecine battle among women, which Ill concede takes testicles to say. But theres another way, and women have to find it together. Maybe Clinton can take the lead? We could call it \"The Powder Room Initiative: Women with Women for All Women.\", How do you like them ovaries?, Washington Post Writers Group, Kathleen Parker is a syndicated columnist. kathleenparker@washpost.com]", "Date": "20150419", "Author": "[Kathleen Parker]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-hillary-clinton-president-abortion-perspec-0420-20150417-story.html", "Title": "[Hillary Clinton: The Year of the Woman Trap]"}