{"Content": "[A massive security operation is in place to protect President Barack Obama during his visit to Kenya, which has been frequently targeted by al-Shabab militants based in neighboring Somalia. Ahead of Obamas arrival Friday evening, large numbers of security forces patrolled in the Kenyan capital, Nairobi. Several U.S. military aircraft were spotted flying around the city and the military has stepped up attacks on Islamic militant targets in Somalia in recent weeks. Major Nairobi roads will be temporarily closed and authorities said the international airport will be closed at times coinciding with Obamas landing and departure Sunday for Ethiopia. Safaricom, a mobile network operator, warned of disruptions while Obama is in Nairobi to meet entrepreneurs and hold talks with Kenyan President Uhuru Kenyatta. \"We recognize the fact that as the most protected individual in the world, there will be some security measures undertaken by his team which could include the temporary disruption of mobile signals close to where the President is at any given time,\" Safaricom said. Al-Shabab, which is linked to al-Qaida, has conducted major attacks in Kenya, including the 2013 attack on Nairobis Westgate mall and an April attack in Garissa town that killed nearly 150 people. This month, Somali officials said African Union and local troops seized Bardhere, one of the last major towns held by extremists in Somalias southwest. A militant commander was also killed in a U.S. drone strike, according to Somali and U.S. officials. A Somali intelligence official told The Associated Press that the use of surveillance drones has increased in the past two weeks. \"They are watching militants movements towards Kenya so closely,\" said the official, who requested anonymity because he is not authorized to speak to the media. Kenya prepares to welcome President Barack Obama back \"home,\" with residents of Nairobi hoping the focus will be on security. (Reuters), Kenya prepares to welcome President Barack Obama back \"home,\" with residents of Nairobi hoping the focus will be on security. (Reuters), Obamas schedule includes a Sunday address at a Nairobi stadium that will be broadcast live on Kenyan radio and television. U.S. Ambassador Robert Godec said attendance is by invitation only to representatives from \"a wide range of Kenyan society\" despite speculation that huge crowds would gather. \"We discourage people from coming to the venue if theyre not explicitly invited,\" Godec said. Obama, whose father was Kenyan, will have time for meetings with relatives during his visit, said the ambassador. Sarah Obama, the matriarch of the Obama family, flew from the western Kenyan city of Kisumu to Nairobi on Friday ahead of a meeting with the American president, Kenyan media reported. Sarah Obama was the second wife of Obamas grandfather and helped raise his father, Barack Obama Sr. The president referred to her as \"Granny\" in his memoir, \"Dreams from My Father.\", \"Today, I am going to talk to him face to face,\" Sarah Obama, who is in her 90s, said before boarding the Nairobi-bound plane. She said she would try to convince Obama to visit his fathers grave in the western village of Kogelo, though U.S. officials have said the president will not travel to the town on this visit. \"I will leave it to God,\" said Sarah Obama, who walked with a cane. Gay rights, human rights the rooms elephants, Obama voiced strong support for gay rights in Africa on Thursday, bucking calls from some African leaders to keep his views on such controversial issues to himself. Obama, who departed Washington late Thursday, had faced criticism from rights groups and growing calls to press the issue aggressively while in a region known for a bleak record on human rights. In an interview with the BBC, Obama said he had been \"blunt\" with African leaders about gay rights in the past and planned to make it part of his agenda for this trip, too. Obama cited his relatives still in Kenya to argue he knows how the countrys history of mistreating women and girls has held Kenya back. Asked about Kenyan Deputy President William Ruto, a critic of gay rights in the U.S. Obama said: \"Yeah, well, I disagree with him on that, dont I?\", \"Everybody deserves fair treatment equal treatment in the eyes of the law and the state,\" Obama said. \"And that includes gays, lesbians, transgender persons. I think those same values apply when it comes to different sexual orientations,\" Obama said, A number of Kenyan politicians and religious leaders have warned Obama in outspoken terms that any overtures on gay rights would not be welcomed in Kenya, where gay sex is punishable by up to 14 years in prison. Yet as he prepared for his visit to Africa, he faced equally determined pressure from Human Rights Watch and other groups, who urged Obama in a letter to put the \"pressing human rights concerns\" in Kenya and Ethiopia \"at the forefront of your discussions.\", \"While both countries face real security threats, we are concerned by the way in which each government has responded, often with abusive security measures and increased efforts to stifle civil society and the media,\" the groups wrote. After his visit to Kenya, Obama will fly Sunday to Ethiopia, becoming the first U.S. president to travel there. Hell confer with Prime Minister Hailemariam Desalegn and address the African Union, which is headquartered in Ethiopia. Ten members of Congress were traveling to Kenya aboard Air Force One with the president, including Congressional Black Caucus Chairman Rep. G.K. Butterfield of North Carolina, other caucus members and Arizona Sen. Jeff Flake, the lone Republican. Obama infrequently takes lawmakers with him on trips. Flake is chairman of the Senate Foreign Relations subcommittee on Africa and has supported Obamas policies on immigration and re-engagement with Cuba. A different group of 10 lawmakers was scheduled to travel back from Ethiopia with Obama. The White House says the trip, Obamas fourth to the continent as president, is an important opportunity for him to promote trade and investment with Africa, but to also check in with important Horn of Africa partners in the fight against Islamic extremism. The U.S. and Kenya work together to counter al-Shabab in Somalia, and Ethiopia shares intelligence with the U.S. But both countries have also garnered a reputation for shortcomings when it comes to human rights. Ruto, who will cross paths with Obama during official events on the trip, is also under indictment by the International Criminal Court for alleged links to violence after the 2007 election. The ICC recently dropped similar charges against Kenyatta, an outcome that increased the odds of an Obama visit to the East African nation. The Ethiopian government earlier this month released several journalists and bloggers who had been arrested in April 2014 on charges of incitement and terrorism, according to the Committee to Protect Journalists. The journalism watchdog group ranks it as the second-worst jailer of journalists in Africa. \"With all the countries in Africa, and a visit to two countries, to pick Ethiopia is a very bad optic,\" said Jennifer Cooke, director of the Africa program at the Center for Strategic and International Studies. Associated Press]", "Date": "20150724", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-obama-kenya-ethiopia-20150724-story.html", "Title": "[On eve of visit, Obama voices support for gay rights in Africa]"}