{"Content": "[NEW YORK Mayor Bill de Blasio says he wants to influence the 2016 U.S. presidential race. Republicans are making his wish come true. De Blasio, a Democrat who vowed to use the campaign to raise the nations awareness of income inequality, has instead become the target of Republican candidates who call him a symbol of inept liberalism. His role in helping Hillary Clinton get elected to the Senate 15 years ago makes him an even more attractive whipping boy. What began as a trickle of Republican criticism has intensified as the New York mayors approval ratings dropped to a lowest- ever 44 percent in an Aug. 5 poll. News reports have focused on his habitual lateness, an increase in homicides and more visible homelessness and panhandling -- by vagrants, costumed cartoon characters and topless women. The New York Post, a frequent critic of the mayor, ran a front-page photograph of public urination. \"If you are going to put liberals like Bill de Blasio in office in New York City -- every one of us who spends time in the city has seen the decline in the quality of life here in New York City,\" New Jersey Gov. Chris Christie said in an Aug. 18 interview with Bill OReilly on Fox News. The attacks by Republican candidates continued on Tuesday. In an appearance on MSNBC, former New York Gov. George Pataki said he agreed with host Joe Scarboroughs observation that its beginning to feel like 1990, when the city recorded 2,262 homicides -- almost seven times the total last year. \"Things are getting worse,\" Pataki said. \"Leadership matters, and were seeing a decline in the quality of life for the moment. I hope de Blasio gets his act together and comes to his senses, but Im not optimistic.\", Former Arkansas Gov. Mike Huckabee, appearing at a June 29 National Sheriffs Association conference, asserted that shootings in New York had increased 20 percent under de Blasio, though crime statistics show otherwise. While homicides are up about 10 percent compared with last year, at the current rate they would be the second-fewest ever by year-end. Since de Blasio took office in January 2014, school test scores have improved and the city built or saved 20,500 affordable housing units -- more than 10 percent of his goal to produce 200,000 by 2025. Hes expanded all-day kindergarten enrollment to 70,000. Private-sector jobs hit a record 3.66 million in July, a 3.4 percent gain in 12 months. Those successes havent stopped Republicans from assaulting his tenure. \"Bill de Blasio represents all that is bad with Big Government run amok,\" said Ford OConnell, a strategist who advised John McCains 2008 presidential campaign. \"Hes someone all Republicans can focus on, from South Carolina to New Hampshire. Once you tie him to Hillary Clinton, it makes more sense.\", Jeb Bush, the former governor of Florida, attacked de Blasios education policies at an Aug. 19 forum in Manchester, New Hampshire. Bush said the mayor created his signature universal pre-kindergarten program merely to empower the teachers union. De Blasios reluctance to pour more resources into charter schools showed the mayor was doing \"everything in his power\" to deprive \"low-income kids of the education they need to succeed,\" Bush said. Sen. Ted Cruz of Texas raised a similar line of attack at the Heritage Action Conservative Policy Summit in Washington in January, accusing the mayor of being \"more interested in pleasing the union bosses who are writing checks to him than taking care of the kids.\", Charter schools, which are permitted to skirt rules established by collective bargaining between school districts and teachers, have won support from Wall Street executives. In 2014, a group of hedge fund managers created a $4.3 million pro- charter political action committee to help New York Republicans retain state Senate control. Brigid Harris, who teaches law and government at Montclair State University in New Jersey, said Republican candidates are probably attacking de Blasio to raise money. However, voters in early-primary states like New Hampshire, Iowa and South Carolina arent familiar enough with the New York mayor for those attacks to galvanize conservatives, she said. \"It makes sense if theyre trying to court that Wall Street, New York money,\" she said in an interview. \"That might manage to endear them with that crowd. It seems like more of a money grab than a vote grab.\", De Blasio insists hes not interested in running for the White House, despite the creation of a #DraftDeBlasio Twitter hashtag this year and a flurry of rumor-citing reports in the New York Post, Business Insider and New York magazine. He has so far declined to endorse Clinton or anyone else for president. Instead, he described himself as a \"national convener\" and has invited all the candidates to a forum on income inequality in the fall. In May, he joined Sen. Elizabeth Warren, a liberal Massachusetts Democrat, and economist Joseph Stiglitz to present a policy agenda on the subject and to shape the 2016 presidential race around it. De Blasio joked about becoming the target of so many attacks at an Aug. 20 news conference. A reporter observed that his vow to rid Times Square of topless panhandlers sounded like something that would have been proposed by ex-Mayor Rudolph Giuliani, a former Republican presidential candidate. \"I have never been accused of sounding like Rudy Giuliani, dont you worry,\" de Blasio said with a laugh. \"Hes the only national Republican who hasnt criticized me lately. He needs to catch up. Jebs way ahead of him.\", , *****, , Dopp reported from Trenton, N.J.]", "Date": "20150825", "Author": "[Henry Goldman and Terrence Dopp, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-deblasio25-20150825-story.html", "Title": "[As approval drops, De Blasio becomes Republican whipping boy]"}