{"Content": "[I applaud Republican presidential candidate Rick Perrys call for the Grand Old Party to patch up its differences with African-Americans, among other voters of color. Although I eagerly wait to hear how he would follow up his words with deeds, lip service is better than no service at all. The former Texas governors olive branch offers a welcome counterpoint to billionaire Donald Trumps dangerous depictions of marauding immigrants flowing across the border to rape, pillage and steal jobs from hardworking Americans. Perrys no softy on border security issues. A year ago, for example, he sent a 1,000-troop National Guard surge to the border when thousands of unaccompanied children turned up at the border seeking amnesty. But he also was \"offended,\" he said last weekend, by Trumps characterization, contrary to official crime statistics, of most unlawful immigrants as violent criminals. Trump countered by tweet that Perry \"needs a new pair of glasses,\" a crack at which I, as a fellow wearer of spectacles, take umbrage. Yet Trump is getting what he wants, which is to be the center of attention. His fellow GOP candidates are being asked to take positions on his positions and whether they represent the party to which Trump belongs but in which he has never held elective office and, I would wager, never will. The dispute between Trump and Perry lampoons a serious divide within the GOP over the partys future. It is a divide between what I call the \"outreachers,\" who want to expand the partys turnout to more single women and people of color, and the \"double downers,\" who want to roust out larger turnouts among true believers in the partys base. Perry declared his own position in a speech at the National Press Club, while Trumps xenophobic rants dominated the spotlight elsewhere. Perry called on the party of Abraham Lincoln to \"reclaim our heritage as the only party in our country founded on the principle of freedom for African-Americans.\", Indeed, Republicans can justifiably claim credit for leadership against slavery and the centurylong regime of Jim Crow segregation that Southern Democrats maintained. But what, African-Americans understandably ask, has the GOP done for us lately?, \"For too long, we Republicans have been content to lose the black vote because we found we didnt need it to win,\" Perry said. \"But when we gave up trying to win the support of African-Americans, we lost our moral legitimacy as the party of Lincoln, as the party of equal opportunity for all.\", Indeed, Perrys words were so powerful and courageously candid that I almost forgot why Republicans stopped being so \"content to lose the black vote,\" not to mention other voters of color: They discovered after Mitt Romneys demographically driven defeat in 2012 that they no longer could rely on a majority of white voters alone to bring victory. Romney won a larger percentage of the white vote in 2012 than Ronald Reagan did in 1980. But this time that wasnt enough to beat the majorities of black, Hispanic and Asian-American voters who turned out to re-elect President Barack Obama. Romney said as much in early 2013 when asked on \"Fox News Sunday\" why he believed he lost the White House. \"We didnt do as good a job in connecting with that (nonwhite) audience as we should have.\" With that, Romney showed a keen grasp of the obvious. He was not alone. In recent decades the GOP has treated the black vote as if we African-Americans were not even worth being pandered to. After losing the majority vote in five of the last six elections, its time for the party to broaden its appeal or risk shrinking back to a regional power. Although Perry said more about the failings of Democrats in improving black employment, education and crime than he offered in terms of solutions, he did show a significant new ideological shift: \"Too often, we Republicans myself included have emphasized our message on the 10th Amendment,\" which protects states rights, \"but not our message on the 14th,\" which calls for \"equal protection of the laws\" for individuals. Indeed, the party of Lincoln switched places with the party of Andrew Jackson and the Confederacy in recent decades in emphasizing states rights over civil rights. Now is an excellent time to start switching back. Clarence Page, a member of the Tribune Editorial Board, blogs atwww.chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150707", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-gop-black-vote-rick-perry-perspec-0708-20150707-column.html", "Title": "[Rick Perry gets it: GOP needs black voters]"}