{"Content": "[The Republican-controlled Wisconsin Senate passed the $73 billion state budget just before midnight Tuesday, sending it to the Assembly after voting to repeal a prevailing wage law for local government projects, a move Democrats called an affront to the middle class. The fight over prevailing wage a law that sets a minimum salary for construction workers on public projects had helped waylay the budget for more than five weeks as Republicans tried to broker an agreement that could win passage in both houses. The Assembly, where Republicans have a 63-36 majority, was scheduled to vote on the budget Wednesday night, a move that would send it to Gov. Scott Walker before he is to launch his presidential campaign Monday. Walker has not said if he will sign the budget, or issue any vetoes, before the campaign launch. The Senate also unanimously voted to repeal a gutting of the state open records law, changes added in a surprise move by the GOP-controlled Joint Finance Committee last week. In the face of a swift and fierce bipartisan backlash over the move that would have exempted nearly all records created by state and local government officials, Walker and legislative leaders backed off and the Senate voted 33-0 to remove the changes. Removing those provisions was the only Democratic victory Tuesday. Republicans hold a 19-14 majority in the Senate and rejected all other Democratic proposals including reversing a $250 million budget cut to the University of Wisconsin and increasing funding for public K-12 schools during more than eight hours of debate. \"This budget is a continuation of an agenda weve seen fail over and over again, and theres no reason to believe this time it will be any different,\" said Democratic Sen. Dave Hansen in arguing against cuts to higher education and other Republican initiatives. \"We can do much better.\", Republican Majority Leader Scott Fitzgerald issued a statement praising the plan. \"While there is no doubt that this was a difficult budget, it was also a responsible one,\" Fitzgerald said. \"By making some tough financial decisions, we ensured that the interests of Wisconsins hardworking taxpayers were protected.\", The budget passed on an 18-15 vote, with Republican Sen. Rob Cowles, of Allouez, joining all 14 Democrats against. Cowles said in a statement that he objected to the amount of nonfiscal policy items in the budget. Republicans did remove a proposed change that had raised the ire of current and retired public employees. The budget committee last week proposed changing the makeup of a panel that oversees the Wisconsin Retirement System so it would include only state lawmakers and not others, including a member of the public, as it does now. Opponents worried that making all members elected officials would politicize the groups work and give the majority political party too much control over retiree benefits. Budget debate began a week into the new fiscal year, but state government continued being funded at current levels. Republicans had hoped this two-year spending plan would move more smoothly since they control both the Senate and Assembly, allowing Walker to coast into announcing his presidential run. But Republicans ran into a logjam in late May, unable to reach an agreement on prevailing wage, how much to spend on transportation and whether to go along with a $500 million funding plan for a new Milwaukee Bucks arena. While Republicans reached a deal on the prevailing wage, and how much to fund roads, they have not yet come to terms on the Bucks arena. That is being pursued as a separate bill, with no vote yet scheduled. The vote on scaling back the prevailing wage was close at 17-16. Two Republicans, Rick Gudex and Howard Marklein, voted against the measure. Republican supporters argued that scaling back the law would save taxpayers money and make it easier for smaller contractors to compete when bidding on public projects. Democratic opponents argued it would lower wages and hurt the middle class. \"Were kicking in the teeth of Wisconsin workers,\" said Democratic Sen. Chris Larson, of Milwaukee. Associated Press]", "Date": "20150708", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-wisconsin-budget-20150707-story.html", "Title": "[ Wisconsin Senate passes budget, partially repeals prevailing wage ]"}