{"Content": "[Readers accused me of being a cheerleader for City Hall after my Sunday column listed 34 signs that this is the decade of the city. I reject that label. I am, however, an unabashed cheerleader for this city as much as reader Paul is a cheerleader for the suburb of Elmhurst. His comments begin this edition of reader feedback. After 22 years living in Chicago, I moved to Elmhurst. So here are some things all of them folks/companies moving to Chicago will not enjoy:, A city not on the verge of economic ruin. Very well run city and county governments. No likely huge property tax increases; Elmhurst recently lowered its portion. No cloud tax on Internet streaming. A school district not on the edge of ruin. DuPage, not Cook County, sales tax rates. Affordable housing costs. No ruinous pension obligations. No red light cameras. Almost no daily murders and gunfire. Not 34 signs, but I think you get the idea. Paul, Elmhurst, And few(er) museums, art galleries, world-class restaurants, movies in the park, riverwalks, professional sporting events, James Beard awards, NFL drafts and public transit. And how do you think Elmhurst would look right now, Paul, but for its proximity to all of Chicagos jobs?, And, no, Elmhurst did not recently lower its portion of the property tax. In December, Elmhurst approved a no-increase property tax levy. It also reinstituted a pre-recession practice of not taxing homeowners for debt service costs. That is expected to save the average Elmhurst homeowner $25 annually, the Tribune reported in December. Dan Lyne, a senior vice president with commercial real estate firm CBRE, told me he frequently hears three words from company executives looking to relocate or open new operations downtown: Culture, energy and change. Elmhurst is a lovely place I still consider Robertos pizza the best! but Id happily trade $25 in tax savings and then some for Chicagos energy. Speaking of taxes, one savvy reader caught a seeming inconsistency in my logic. Last week I criticized Chicagos plan to implement a so-called cloud tax on rented computing power/services, saying such a decision should rest with the Illinois legislature. Meanwhile, in a column a few months back, I gave the green light for mandating paid sick leave for an estimated 416,000 workers in Chicago who arent entitled to it. But heres my question: Why is it OK for Chicago to go it alone on paid sick leave but taxing the cloud requires a state-wide solution? Both increase the cost of doing business in Chicago one for those businesses with heavy labor costs and the other for the burgeoning tech industry. In the end, neither is good for Chicago in isolation and only serve to weaken our states economic engine. Theresa, Chicago, This is a thoughtful note, but adding a tax simply for the purpose of generating more revenue which is precisely what the cloud tax is all about cant be compared to an initiative meant to protect disenfranchised, often female and minority workers. Further, sick leave rules actually protect business owners, by helping reduce turnover and ensure their employees dont come down with the flu en masse. Also, I know of no city in America that has enacted a cloud tax, whereas cities from New York to Seattle, Philadelphia to Oakland have enacted paid sick leave legislation. Why? Because Americans overwhelmingly believe its the right thing to do, even if it lowers their wages. A 2010 National Opinion Research Center survey of 1,461 Americans presented respondents with a series of arguments for and against paid sick time legislation. \"The con arguments included If employers are forced to increase costs by providing for paid sick days, they will cut other costs by reducing wages or benefits like health care coverage, and A one-size-fits-all, paid sick leave mandate from the government would threaten workers wages and benefits. Government mandated benefits that increase business costs would have to be made up by cuts in wages or benefits,\" The Washington Post reported. \"But after hearing these arguments, respondents views on sick leave legislation were unchanged 75 percent supported mandatory sick time before hearing the arguments, while 74 percent supported it afterward. Even more telling, respondents rated the appeals about lower wages among the least compelling of the con arguments.\", Sorry to be negative again about what you have written, but I am sure that a lot of your business section readers are, like me, so tired of reading about glass ceilings, women being underrepresented, under paid and so forth. Constant whining and crying that business is not fair to women interspersed with articles about the evil white guys (e.g. Ty Warner). This is not helpful to those of us trying to run our businesses and find new opportunities. Jim , I will stop writing about discrimination against women and equal pay for equal work when it ceases to be a problem. And since you mention Warner, I recently criticized U.S. District Judge Charles Kocoras for giving the billionaire Beanie Babies founder probation for evading millions in taxes and an appellate court for backing the judge up. Kocoras justified probation by citing letters of support from Warners friends, employees and recipients of his charity, deeds that \"were irrelevant to the charges at hand and only available to someone with means,\" I wrote. I read with interest Melissa Harris article about the extraordinarily light sentence of probation Judge Charles Kocoras imposed on Ty Warner for evading (millions) in taxes. My interest was piqued because, as a tax lawyer and CPA, I once represented a Mr. James Spraggins, an African-American gentleman who was charged with evading approximately $200,000 dollars in taxes, a sum about 3.5 percent of the amount that Mr. Warner admitted to evading. The same judge, Charles Kocoras, sentenced James Spraggins, who had no prior record, had operated a modest temporary help employment agency, and who had no significant net worth, to 18 months of incarceration. The difference, as best I can discern, was Mr. Warners connections, his wealth, and, perhaps, the color of his skin. Mr. Warner obtained what Ms. Harris described as a sentence like that imposed for a speeding ticket, whereas my client went to jail. Such is justice in America. Lee Tockman, Chicago , Another key difference was that Spraggins went to trial rather than plead guilty. A Federal Bureau of Prisons database shows he was released in January 1986. I reached Spraggins daughter, Vivian, on Monday. Her father died in 2008 at age 87. mmharris@tribpub.com, Twitter @chiconfidential]", "Date": "20150804", "Author": "[Melissa Harris]", "Link": "http://www.chicagotribune.com/business/ct-harris-reader-react-0805-biz-20150804-column.html", "Title": "[Readers react: City vs. suburbs, paid sick leave and 'evil white guys']"}