{"Content": "[Lets talk, for a moment, about fauxtrage. We all know outrage is in. It generates clicks, sells papers, powers online petitions by the bushel. Its a reliable national industry. And why wouldnt it be? Theres plenty to be outraged about, if you have the time and the stomach for it. If you want to, you can spend every day in a perpetual high dudgeon or at least a low simmering dudgeon. But as peoples tendency to wax indignant has increased, so, too, has a strange sickly cousin of Genuine Outrage: fauxtrage, outrage at the absence of outrage. Trumped-up, astro-turf outrage. You can tell fauxtrage a mile away because it is always prefaced with the phrase \"Where was the outrage when ...?\", Sometimes it also comes wrapped in a nice \"When will [Person Who Usually Denounces Things] denounce [Thing Impacting Someone On Your Side]?\" or \"[Name] should apologize for [Thing You Have Never Objected To Before]\" or even \"[Name] is the REAL racist.\", Its taking a weapon thats been used successfully against you in the past and thinking that you can wield it willy-nilly against someone else with the same result. It seems like it should work the same both ways. Its usually followed by getting upset that it doesnt work. \"You just discounted my opinion because I was a man! What if I were a woman? #notallmen #therealsexist.\", \"You just said shut up little man to me? Now we see your HYPOCRISY! #silencer! Cant wait to see all the [dismissive term for those with whom you disagree] denouncing THIS speech.\", Just run a Twitter-search for the phrase \"Where Was The Outrage When ...\" or \"Wheres the outrage?\" or \"The Real Racist/Sexist/Misogynist/etc.\" or \"NOW WHOS THE [NOUN]\" if you have any doubt that this is a real phenomenon. It can also fall in the format of sudden, inexplicable demands for apologies from people who, you thought, should really not be in the business of calling kettles black. Witness Erick Erickson, trying his darnedest to call Donald Trump out for being sexist. You remember Erick Erickson. Good old \"Men Should Dominate Women Because Nature\" Erick Erickson. If you dont, Bristol Palin does. Here is her recent blog post:, By now, youve undoubtedly heard that theres a guy named Erick Erickson, of RedState, who disinvited Donald Trump from a gathering of conservatives because, as he put it, \"there are even lines blunt talkers and unprofessional politicians should not cross. Decency is one of those lines.\", Want to learn some \"lessons in sexual and political decency\" from Erickson? Here are three:, 1. Ericksons RedState once used a demeaning fake photo (wearing a revealing shirt with Santa Claus) of my Mom for an attack article on her. Erickson refused to take it down even after he was made aware that it was photoshopped. 2. He once called Supreme Court justice David Souter \"the only goat [bleeping (bleep mine, not Bristols)] child molester to ever serve on the Supreme Court.\", 3. And theres this [Erickson tweet]: \"How awesome is Fox for letting Trump come on and bash Rosie!! Awesome.\", Yup. Bristol went on to complain about the fact that the question was asked at all, complaining that conservatives were falling victim to the same \"politics of outrage.\", I dont endorse everything Donald Trump says or does . . . Mainly because I actually have to work for a living and I dont pay as much attention to politics as professional pundits. But I know that I hate the \"politics of outrage\" that people engage in. Give me a break. We only have so many opportunities to hear from the fifty million candidates who are apparently running for President. And we get the Fox moderators asking questions that the New York Times applauds? Please. Lets dont use the Democratic \"war on women\" talking points when we have ISIS to worry about. Whether or not we agree about the validity of the question, Bristol Palins got a point. This is not a winning strategy, and if you dont grasp why, its because you misunderstand the whole reason the \"outrage industry\" works. One of the things Ive been most struck by, whenever I find myself in rooms of people who all share the same beliefs (on whatever side of the aisle) is how ready they are to assume that the people who do not share those beliefs are being disingenuous. That beliefs you disagree with are somehow less genuine than those you share because No Intelligent Person Could Truly Believe Such A Thing or because Theyre Just Claiming That Theyre Offended To Shut Us Up as though there were some big red Outrage Button that could be pressed, on cue, to achieve a desired political result. That would be too easy. And when you dont assume sincerity on the part of your opponent, you wind up with fauxtrage. Fauxtrage is always overplayed. WHERE IS THE OUTRAGE? you bellow, when nothing happens. GET THAT REAL SEXIST OUT OF HERE! I FOR ONE AM SHOCKED SHOCKED TO FIND GAMBLING IN THIS ESTABLISHMENT. Theres a certain clumsiness to every cynical effort to find and push the Magic Outrage button. Its the same round-peg-square-hole misfittedness of John Boehner trying to explain his budget in GIFs or any and all conservative rap. What results feels wrong. Its Frankensteins monster. It looks almost like the thing you want, but it feels strange and artificial and moves haltingly. Its like going home and doing all the things that the magician tells the audience hes doing and wondering why your rabbit doesnt disappear. The trick is that there is no button. If outrage were cynical and automatic, pumped out by a big machine whenever the news cycle ran dry, it would lose its power. You may not always like it or agree with it, but what gives it its power is that it is genuine. You cant turn it off and on at will. When you fail to understand that, you do so at your peril. If you succeed in turning the machine on, if you manage to get people indignant when a Fox personality says something sexist, it wont stop at Trump. Networks with glass desks shouldnt throw stones. Washington Post, Alexandra Petri writes the ComPost blog, offering a lighter take on the news and opinions of the day. She is the author of \"A Field Guide to Awkward Silences.\"]", "Date": "20150812", "Author": "[Alexandra Petri]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-bristol-palin-donald-trump-outrage-industry-20150812-story.html", "Title": "[Bristol Palin is right about conservatives and Trumped-up outrage]"}