{"Content": "[In todays bitter, politically partisan America, when a foreign policy problem such as the threat from the Islamic State has no quick fix, you can bet administration critics will focus on attacking President Barack Obama for some irrelevant, lesser issue. Heres an example: picking a fight over semantics. On Wednesday, the eve of the White House Conference on Countering Violent Extremism, the president explained why he has avoided using phrases such as \"radical Islamic jihadists.\" Groups such as ISIL (the Islamic State) and al-Qaida, he said, \"try to portray themselves as religious leaders, holy warriors in defense of Islam.\", Such groups also \"propagate the notion that America, and the West generally, is at war with Islam,\" Obama continued. \"Thats how they recruit. Thats how they try to radicalize young people, somehow represent Islam, because that is a falsehood that embraces the terrorists narrative.\", He has stated those ideas before, but they are willfully ignored. \"To call it violent extremism and not to call it radical Islamic jihadists goes to show the president is underestimating our enemies,\" was the way Republican Sen. Tom Cotton of Arkansas put it on CNN hours after the president spoke. How is a president who is bombing Islamic State forces in Iraq and Syria, sending military advisers to prepare local forces for fighting in both countries, and has authorized counterintelligence operations against terrorists around the world be considered to be \"underestimating\" our enemies?, Rep. Michael McCaul, Republican of Texas, the chairman of the House Homeland Security Committee, went further on CNN Sunday. \"I think we are at war with radical Islamists. And I think its important to define the enemy to defeat the enemy,\" he said. The president, McCaul said, was trying to be \"politically correct and not say what it is. If you ask ISIS if theyre at war with us, theyll tell you they are. And theyll tell you theyre doing it for religious reasons.\", Obama tried again. On Thursday he explained in his speech to the White House conference that \"there is a complicated history between the Middle East, the West, and none of us, I think, should be immune from criticism in terms of specific policies, but the notion that the West is at war with Islam is an ugly lie. And all of us, regardless of our faith, have a responsibility to reject it.\", He added, \"Muslim communities, including scholars and clerics, therefore have a responsibility to push back not just on twisted interpretations of Islam, but also on the lie that we are somehow engaged in a clash of civilizations; that America and the West are somehow at war with Islam or seek to suppress Muslims, or that we are the cause of every ill in the Middle East.\", Perhaps the Republicans would be happy with the words used by Sameh Shoukry, Egypts foreign minister, who attended the White House conference. Appearing Thursday night on Charlie Roses television program, Shoukry said there was a need for a more comprehensive approach to terrorists, not only ISIS in Iraq but all terrorist groups promoting \"radical jidhadist fundamentalist ideology.\", Note that like Obama, Shoukry avoided using \"Islamic\" in describing the enemy. During his CNN interview, McCaul described the White House conference as \"a bit of a psychotherapy session without any substance or any solutions.\", He agreed that fighting the Islamic State needed \"a multifaceted solution, but the military is certainly a component of this. And all they (the administration) talked about was how we have to have better education and economic assistance, without dealing with these barbarians as they truly are, and that we need to defeat and destroy them.\", In fact, on Thursday, Obama began his talk pointing out what the United States and coalition allies, including several Arab countries, were doing. He talked about the bombing in Iraq and Syria against the Islamic State and increasing information-sharing to make it harder for fighters to travel in and out of the countries. He discussed Yemen and Somalia, where the United States is working \"with partners to help them build up their security forces, so that they can prevent ungoverned spaces where terrorists find safe haven.\", Did McCaul or his staff miss those remarks? Did the American public?, Heres the reality: There is no quick fix to the Middle East terrorist problem. There is plenty of easy talk by U.S. politicians about putting American boots on the ground as part of a solution even to some in the U.S. military. On Monday at Camp Arifjan, Kuwait, Defense Secretary Ashton Carter was asked by a U.S. officer, \"What would it take, sir, for you to recommend to the president of the United States U.S. military boots on the ground in the direct combat role against Daesh (the Arabic designation for the Islamic State)?\", Carter, five days on the job and in the Middle East to get first-hand information, gave the correct answer: \"I think we need to be convinced that any use of our forces is necessary, is going to be sufficient, that weve thought through not just the first step, but the second step and the third step.\", The hard lesson we should know by now is that it is the local forces that must defeat the Islamic State and prevent its return over the long term. U.S. boots on the ground, even in a supporting role, would be just a first step. The second step would be: Once that enemy is defeated, what fills the local governmental vacuum? And the third step: How do U.S. forces leave?, Were still trying to figure out that third step after 14 years in Afghanistan. Just think how long it would take to again leave Iraq. Now consider Syria where the problems are more difficult.]", "Date": "20150224", "Author": "[Walter Pincus]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-islamic-state-radical-islam-violent-extremism-20150224-story.html", "Title": "[Islamic State threat can't be fixed quickly]"}