{"Content": "[You never know whom you are going to empower. That sentiment seemed to move the crowd Friday at the 30th anniversary luncheon for the Abby Foundation, an Olympia Fields-based nonprofit that still has a goal to \"raise money and give it to women and children who need it,\" according to its website. The message was spoken by keynote speaker Zoraida Sambolin when she addressed the mostly female audience at the Tinley Park Convention Center. Sambolin, a longtime member of the morning news team at NBC5 and former CNN anchor, chronicled her fight with breast cancer that ended in a voluntary and widely publicized double mastectomy. She recounted how women inspired and empowered her along the way, including actress Angelina Jolie, who had penned an op-ed regarding her decision to undergo the same procedure about the same time as Sambolin was making her decision to do so. Sambolin used that narrative to talk about hope, strength, compassion and bravery ideals championed by the womens philanthropic organization and she used it, too, to remind the room full of volunteers and leaders that women must treat themselves with the same care they afford others. \"Here is what I know about every single one of you here today: When you look in the mirror, you see a person who cares,\" Sambolin said. \"You see a person who does really good work, a person who gives back, who empowers others. You see a person who reaches back and lifts women up. ... What I dont know is if you see a person who takes care of herself.\", The Abby Foundation was founded by Loleta Didrickson in 1985. Then a state representative, she was still a decade away from her appointment to Gov. Jim Edgars cabinet as director of the Department of Employment Services. She had yet to spend four years as state comptroller. According to current Abby Foundation president Sue Gowen, it was during that early tenure as a state representative that Didrickson came across a statistic saying 90 percent of charitable donations in Illinois were distributed to mens organizations, and thus the inspiration for the Abby Foundation was born. \"She (Didrickson) started this foundation which would give women a chance to contribute dollars that they knew would go to a womens organization,\" Gowen said. Didrickson has a daughter named Abby, but the Abby Foundation is named for Abigail Adams, first lady to second U.S. President John Adams. Abigail Adams wrote in a 1776 letter addressed to her husband and the Continental Congress, \"... remember the ladies, and be more generous and favorable to them than your ancestors.\", Current state Comptroller Leslie Munger, in a prepared statement, congratulated Didrickson on \"30 years of dedication to community\" and for creating \"more opportunities for women to move forward.\", For several years, the luncheon was sponsored by the Star Newspapers and championed by the late Joanne Zerkel, a reporter and editor and advocate for womens and childrens rights. Part networking event, part award banquet, Fridays luncheon was preceded by two hours of vendors offering information about local colleges, womens professional organizations, woman-run businesses, and community organizations that specialize in advancing and aiding women. Karen Di Prizio, representing South Suburban College, called the event \"a great opportunity to showcase women in education.\", Karen Leluga, director of resource development and community relations for the Tinley Park-based Crisis Center for South Suburbia, praised the Abby Foundations work and history of giving to the center and other organizations that benefit women. The crisis center was one of three grant recipients under Didricksons leadership in the foundations inaugural year. Glenna Elvery, a longtime supporter of Southland nonprofits and board member at the Homewood-based South Suburban Family Shelter, was named the Abby Foundation Woman of the Year. Gloria Morningstar presented the award and called Elvery, who owns The Cottage on Dixie restaurant in Homewood, \"a true example of the type of volunteerism that embodies the Abby Foundation mission.\", In her remarks, Didrickson said, \"I look out here and I look at all the women here together, and that was always the goal and always the dream. It was always about what we can do for other women. \"My heart is very full right now as I stand up before you and I see the wonderful togetherness that has never left us in the Southland area. And you know what? This couldnt have happened anywhere else around the state of Illinois. It couldnt have happened elsewhere because we women really have grit out here.\", Gowen said the foundation has donated at least $2.5 million to various organizations and for scholarships, including for students and for women returning to school, since its inception. For more information about the foundation, visit abbyfoundation.org. Angela Denk is a freelance reporter for the Daily Southtown.]", "Date": "20150810", "Author": "[Angela Denk]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-abby-foundation-st-0811-20150810-story.html", "Title": "[Abby Foundation marks 30 years of helping women, children]"}