{"Content": "[U.S. Secretary of State John Kerry said Friday he \"profoundly disagrees\" with the reasoning behind decisions by two prominent Democratic lawmakers to vote against the nuclear deal he negotiated with Iran. Speaking in the Vietnamese capital, Kerry said the facts do not bear out the arguments made by the Senates No. 3 Democrat Chuck Schumer, and the ranking member of the House Foreign Affairs Committee, Eliot Engel. He said he respects the right of lawmakers to make their own decisions about the merits of the deal, but said rejection does not offer any alternative than a drumbeat to conflict. Schumer and Engel, both from New York, made their announcements on Thursday. Schumer is the first Democratic senator to say he will vote no on the deal, which would curb Irans nuclear program in exchange for billions of dollars in relief from crippling sanctions. Schumer, who is Jewish, complained that the pact does not allow inspections \"anywhere, anytime\" and that the United States cannot demand inspections unilaterally. Kerry said he has great respect for both Engel and Schumer, and called Schumer a friend, noting he served with him in the Senate. \"I obviously profoundly disagree with the judgements made,\" Kerry said. He said that with 25 years of uranium tracking, \"it is physically impossible to build a bomb.\", \"Its a question of eliminating options in a realistic way,\" he added. \"I would respectfully suggest that rejection is not a policy for the future, it does not offer any alternative.\", Kerry said that if the deal is rejected, \"there will be a hue and cry about Irans continued activity and that will lead people to put pressure on military action since the United States would have walked away from the diplomatic solution.\", Associated Press]", "Date": "20150807", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-kerry-schumer-iran-nuclear-deal-20150807-story.html", "Title": "[Kerry 'profoundly disagrees' with Schumer, Engel on Iran ]"}