{"Content": "[Evil lurks in unlikely places. In movies, it is always the all-American nice guy who turns out to be the villain. In real life, think Bill Cosby (scolding others to \"pull up their pants,\" even as he allegedly attacked women he had drugged into unconsciousness), Josh Duggar (he of \"19 Kids and Counting,\" who, according to his parents, molested four of his sisters and another child, while Mom and Dad covered up so their moralizing reality show could go on), and former Rep. Mark Foley, R-Florida (who resigned from Congress in 2006, after the disclosure of sexually explicit e-mails he had sent to teenage congressional pages). If you want to jump on the Hypocrite Wayback Machine, theres televangelist Jim Bakker (sent to prison for dipping into $165 million in donations, part of which went to silence a church secretary who had accused him of rape). Now add to the list former House Speaker Dennis Hastert, R. He was indicted last week for withdrawing huge amounts of cash in increments of less than $10,000 to pay off \"Individual A\" (identified by the New York Times as a male former student), with whom he met several times in 2010 and agreed to pay $3.5 million to \"compensate for and conceal\" past \"misconduct.\", Dennis Hastert? Any number of other politicians could be indicted for something similar without setting your hair on fire, but Hastert? The rumpled, shambling, small-town wrestling coach chosen by Republicans to be speaker as the antidote to previous scandal-plagued leaders. He wafted into office as a breath of fresh air compared to former Speaker Newt Gingrich, R-Georgia, the twice- (since then thrice-) married conservative who was having an affair with a staffer while supporting President Bill Clintons impeachment. Gingrichs replacement, Rep. Bob Livingston, R-Louisiana, another hounder of the president, had to quit before being sworn in because it turned out he had been involved in several affairs, including one with a lobbyist who (personally) lobbied him. Now all-American nice guy Hastert, who liked being known as Coach, turns out to have been not so nice at all. For starters, he accumulated millions while in office, in part by shoehorning fine print into a huge bill that provided federal funds to build a freeway that turned raw land he bought for a pittance into a goldmine. Throughout, he maintained a humble aura. Except when it came to matters of morality. There, he followed in the hypocritical footsteps of his predecessors, devoting much energy to shaming others about their sexual behavior. He advanced the anti-gay Defense of Marriage Act through the House and proposed a constitutional amendment to annul same-sex unions in states that allowed them. He railed against Clinton, saying as he voted to authorize a House Judiciary Committee investigation that they had to \"uphold the rule of law\" rather than sweep \"the matter under the rug,\" which was hardly the case. By then, Clinton had already been subjected to unprecedented levels of public humiliation with the release of the Starr Report, which indulged in gratuitous descriptions of the presidents fumblings with Monica Lewinsky and anatomy. Grand juries cant indict on charges of hypocrisy, so Hastert was indicted on what looks like banking technicalities. Its well known that the FBI takes being lied to badly (Hastert laughably told investigators that he kept the hundreds of thousands in cash because he felt the banking system wasnt safe), but it doesnt prosecute all liars. What may be happening is that Hastert, like Cosby, cant be successfully prosecuted for the alleged underlying crime of sexual abuse -- one so heinous that its perpetrators must be segregated in prison to avoid violent retribution from morally superior murderers and other criminals. But he can be punished, even if it is only for breaking banking laws and lying. Either too much time has passed or Individual A wont go public for a larger prosecution. Which brings us back to Bill Cosby and, glancingly, to Bill Clinton, both of whom, like Hastert, took advantage of the less powerful in pursuit of their own pleasure. Cosby rendered his victims comatose before assaulting them. Clinton, one of the most powerful people in the world , took advantage of a child- woman -- she could be his, or anyones, daughter --- who recently made us all a little ashamed by letting us know what it felt like to be on the receiving end of the feeding frenzy of moral condemnation that came her lonely way. The affair may have been consensual but it was by no means between equals. Had Republicans focused on Clintons predatory power play with an intern, they might have prevailed. Instead, they preferred to humiliate the president with voyeuristic pornographic detail. Not only did Clinton survive their misguided effort, he now bestrides the globe as one of the most revered men in public life. Unlike Clinton, Cosby lives on only as one of the walking dead, a fate that may be worse than prison for a celebrity who once had a halo of sainthood for his paeans to family values and tough love for those who stray. He lost his new show, he lost his reruns, he lost his TV special. His concert tour is a field of cancelled dates. Protests and hecklers marred the few that went on. No matter what happens when Hastert appears in court next week, no matter how slight the charges compared to what he allegedly did, the portraits will come down and there will be no roads named after him. He is dead to us. Margaret Carlson is a Bloomberg View columnist. For more columns from Bloomberg View, visit http://www.bloomberg.com/view]", "Date": "20150606", "Author": "[Margaret Carlson]", "Link": "http://www.chicagotribune.com/news/ct-hastert-joins-crowded-club-of-fallen-moralists-20150606-story.html", "Title": "[Hastert joins crowded club of fallen moralists]"}