{"Content": "[Dr. Zaher Sahloul has crossed the Syrian border nearly a dozen times to help treat victims shot, bombed, gassed and suffering from malnutrition in a war-ravaged country where the dictatorial government attacks its people and Islamic State terrorists murder innocent civilians. He raises money to support doctors and nurses in Syria, heads an organization that raises funds to buy medical supplies for their clinics and hospitals as well as those in refugee camps and somehow still maintains his medical practice as a critical care practitioner in Oak Lawn. As president of the Syrian-American Medical Society, Sahloul has been quoted in newspapers from Great Britain to India to Japan and has appeared on television news shows throughout the world. Recently, he was part of a three-member panel that presented a video of a chlorine gas attack on Syrian residents that reduced National Security Council members to tears. Time and again, Sahloul has made the case that Syrians are being killed and seriously injured in chemical attacks, which he believes are perpetrated by President Bashar al-Assad. President Barack Obama drew a \"red line\" in 2013 after Assad was accused of using sarin gas, internationally banned after World War I, on his people. Since that time, Sahloul says, Syrians have been repeatedly bombed with chlorine gas barrels dropped from helicopters. While Assad denies that his government has any involvement, Sahloul contends that only the government has helicopters. \"I realize that its difficult for many people here to understand whats going on in Syria,\" he said. \"What they hear on the news is about ISIS (an acronym for the Islamic State) and terrorists. But the 22 million people who live in Syria are not terrorists. \"People forget that this all began in 2013 when the Syrian people launched a revolution to oust Assad on social media,\" Sahloul said. \"The vast majority of the people there have the same values as the people here in America. They want the same things. They want to operate businesses, they want to feel safe in their homes, they want freedom.\", Born in Algeria to Syrian parents who were teachers, Sahloul spent most of his young life in Syria, where he went to medical school before coming to Chicago in 1989. \"There are people there who were my colleagues, my classmates, battling for their lives, working to save lives, so how can I not help them,\" Sahloul said, when I asked him why he repeatedly risks his life traveling across the Turkish border into Syria. \"I am not the only one doing this,\" he said. \"We work with Doctors Without Borders and other organizations. I am just one of many.\", I asked him if hes not worried because the Islamic State would certainly consider him a valuable prize, and it has beheaded a few Americans. \"Well, my wife and (three) children are certainly afraid for me,\" he said. \"But you cant do nothing when such atrocities are occurring and you know the people who are the victims. They are killing women, the elderly and children there. \"And I dont think its really understood by the American people because if it were, they would put pressure on their elected officials to do something, as they did with Bosnia.\", Sahloul said he originally had no intention of going into Syria during the revolution, but he began visiting refugee camps in Turkey and Jordan and after hearing and seeing the inhumanity that was taking place felt he had to get more involved. \"There are 1.6 million Syrian refugees, inside and outside of the country,\" he said. He credits the United States for pouring massive amounts of humanitarian aid into the nation but has come to believe that is not enough. \"Whats going on there amounts to a genocide,\" Sahloul said. \"Its important that people who can do something do what they can to stop it.\", In addition to treating victims in makeshift clinics that often lack proper medical equipment, Sahloul has been working with other doctors to document the chemical attacks on the population. \"I talked to the doctors who treated the victims, spoke to people who witnessed the attacks and talked to the victims themselves,\" Sahloul said. \"The talk about hearing the helicopters, then the sound of the barrel bombs dropping, which dont sound like regular bombs, and then the smell of chlorine gas. \"The symptoms they describe are what you would expect from such a chemical attack. I have no doubt that it has happened, over and over. Were talking about a gas that was used in chemical weapons 100 years ago.\", So why would the government use such chemicals instead of more modern weapons deemed acceptable by the world?, \"Its psychological warfare of a sort,\" Sahloul said. \"After one such attack, which killed three people, 50 percent of the people who lived in the area moved. Thats the goal.\", Activism is not new to Sahloul, who is a former board chairman of the Council of Islamic Organizations for Greater Chicago and is a past president of the Mosque Foundation of Bridgeview, where he organized interfaith gatherings of Jews, Christians and Muslims to increase understanding and cooperation. He is also a board member of Illinois Coalition for Immigration and Refugee Rights. And he remains on the staff at Christ Medical Center in Oak Lawn. In a comment that would likely make many local residents laugh, Sahloul said, \"We are so lucky here in the Chicago area. We have so much to be grateful for and so much opportunity. I appreciate that good fortune, but we cant take it for granted and we owe it to other people, those with the courage to fight for the same things, to do what we can to help them.\", He still believes that America will do the right thing in Syria, although you can hear frustration in his voice when he talks about the opportunity the United States missed by failing to support the initial public uprising, \"which happened before ISIS ever existed,\" he said. \"I am proud of this country,\" he added. \"I am proud my country has sent $4 billion in humanitarian aid to Syria. And we recently met with U.S. Sen. Richard Durbin, D-Ill. who agreed to send a letter to President Obama, signed by other senators, asking for the establishment of a safe zone in Syria where refugees can go without being shot at or bombed or exposed to chemical attacks.\", Sahloul also met with the Russian delegation to the United Nations to ask for its support. The Russians, supporters of Assad, are reluctant to criticize him or do anything that might be viewed as undermining his tenuous grip on Syria. \"Were making progress,\" Sahloul said. \"I remain hopeful. If you provide people with the information they need, I believe they will eventually make the right decisions.\", I told Sahloul that I admired his courage. \"I live in Burr Ridge in a beautiful home, have a wonderful family and live in a great country,\" he said. \"There are others who continue to live in Syria the doctors and nurses who refuse to leave, the ordinary people who have leaned how to treat their friends and neighbors in need of medical care with few supplies that are more worthy of such admiration. \"We all need to help them. All of the people in the world. Humanitarian aid is no longer enough. Thats the message we need people to hear.\", pkadner@tribpub.com]", "Date": "20150428", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-sahloul-ct-0429-20150428-column.html", "Title": "[Oak Lawn doctor a voice for victims in Syria]"}