{"Content": "[Milwaukee Mayor Tom Barrett hates \"the Rust Belt\" as a moniker for the Great Lakes region who likes rust? so hes been pushing for a more apt nickname:, The Fresh Coast. \"That captures who we are, and it captures who Chicago is, and it captures who Cleveland is,\" Barrett said. \"We are cities that were built on the Great Lakes. And now as the economies have changed, as the water issues have changed, this is becoming a greater and greater economic and demographic strength for us.\", Lake Michigan is synonymous with Chicago and Milwaukee for reasons that are especially apparent this time of year, as people play and lounge on its beaches, bike and jog along its shoreline, and swim and sail in its waters. But these two cities and the other Great Lakes metropolitan areas Detroit, Toronto, Cleveland and Buffalo increasingly are viewing water as something else: fuel for their economic engines. Access to the Great Lakes, which contain more than 20 percent of the worlds surface freshwater, may have its benefits, but the more significant push may lie in the development and export of technologies to address the worlds water problems. Milwaukee is betting big in this area, clustering well-established companies and startups, university researchers, nonprofits and governmental agencies in its seven-story Global Water Center, a converted warehouse that opened less than two years ago. Work there is coordinated by The Water Council, an economic development organization that recently dropped Milwaukee from its name to indicate its beyond-local aspirations. \"When people think of water technologies or water needs, theyre going to think of Milwaukee,\" Barrett said during a conversation at the Global Water Center last month. \"Thats what the goal is, and its becoming a reality.\", Chicagos economy is more globally oriented than Milwaukees, yet Chicago lacks Milwaukees public presence in the water tech world. Still, Mayor Rahm Emanuel said he too envisions his city as \"the premier place\" for water-related ideas and research and he wants that business. \"If you come up with a project for household water conservation, I want it invented here, patented here and built here in the city of Chicago,\" Emanuel told a Great Lakes Economic Forum audience in late April. \"I know one thing: Theres going to be a lot of demand (for water innovations) going forward across the globe.\", The Chicago areas water tech work is relatively diffuse, encompassing the Metropolitan Water Reclamation District, universities the University of Chicago in particular west suburban Argonne National Laboratory and the city itself. Whats yet to be determined is whether water ultimately will serve more as a battleground among Milwaukee, Chicago and other Great Lakes cities or a rising tide that lifts all boats. Seth Snyder, the Argonne scientist recently appointed to oversee and coordinate the laboratorys water research projects, is banking on the latter. Snyder contends that if the region can offer new ways to treat and recycle its bountiful water sustainably, an influx of water-using companies will follow. And hes not ready to admit that Chicago lags behind Milwaukee as a water technology hub. \"We see ourselves as going after much bigger, broader transformational questions and much bigger solutions,\" Snyder said. Studies show that the nations groundwater supply is rapidly dwindling, particularly in the Colorado River basin, the southern Great Plains and Californias Central Valley. More dire water issues lurk globally. The nonprofit Water.org reports that 750 million people lack access to clean water, and more than 840,000 people die annually from a water-related disease. \"Water is this massive challenge that just needs to be addressed,\" said Argonne nanoscientist Seth Darling. \"Its just all coming to a head.\", Water Council President and CEO Dean Amhaus said he was on a water-related panel in Texas a few months ago, and a member of the local water development board was showing slides illustrating the droughts severity in the state. \"The next slide she showed was how Texas is attracting 1,000 to 1,200 people every single day, and she says, And were not going to stop. We want to grow, grow, grow, grow, \" Amhaus recalled. \"And I said, How can you do this? Have you all talked as a state? You cant keep on attracting more and more people when you dont have the water. And they said, Well, were Texas. Well just do this. \", Households are far from this countrys biggest water users. The most recent United States Geological Survey water-use report, for 2010, shows 355 billion gallons used daily in the U.S. down 13 percent from 2005. More than 45 percent was used for electric power and more than 32 percent for irrigation, so thats about 78 percent for energy and agriculture alone compared with almost 12 percent for the public water supply. \"Theoretically, turning off the lights saves more water than turning off the shower,\" said John Robinson, founder and chairman of Chicagos Blue Tech Alliance. Water-related economic opportunities for the Great Lakes region appear to be twofold:, Many companies use a lot of water, and ordinary people desire an adequate supply as well, so pitches can be made to lure these businesses to the \"Fresh Coast.\", The Great Lakes region is also home to companies, universities, government agencies and a national laboratory deeply engaged in water technology, a concentration of knowledge that could help create solutions that might be exported nationally and internationally. \"Theres a lot of money to be made and a lot of new businesses to be grown in that kind of work,\" said John Austin, director of the Michigan Economic Center. Austin noted that 20 of the worlds top 100 research universities are in the Great Lakes region. \"This is a global problem. We can be the innovators.\", That was Amhaus thinking several years ago when he met with business representatives covering the seven southeast Wisconsin counties and realized how much work was being done in the water sector. For its part, Milwaukee is a city formerly driven by water-intensive industries, including breweries and tanneries. Even though many of those original businesses are gone MillerCoors is the only remaining major Milwaukee brewery other companies that supported these industries remain. They include AO Smith, which made glass-lined brewery tanks and now specializes in water heaters, and Badger Meter, which continues to make devices that measure water flow. In March 2010 Amhaus became president and CEO of what was then the Milwaukee Water Council, and the following year the organization began to unite the regions water-related entities under one roof. The big payoff came in September 2013 with the opening of the Global Water Center, which looms over a water tech business park and has been spurring development in the burgeoning Walkers Point neighborhood. The building houses the councils headquarters and other civic and governmental organizations; offshoots of AO Smith and Badger Meter; satellites for companies with anchors in the Chicago area, including Sloan Valve, Rexnord, Veolia; incubator space for startups; and labs and offices for the University of Wisconsin at Milwaukees School of Freshwater Sciences, the University of Wisconsin at Whitewaters Institute for Water Business and incoming tenant Marquette University. \"Marquette wants to be involved in making Milwaukee a world water hub,\" Marquette University President Mike Lovell said. \"The organization and the level of collaboration exceed anything Ive ever been a part of.\", Water is made ultrapure in the basement before being distributed to offices throughout the building. On the roof a local company, Hanging Gardens, is demonstrating 14 different types of vegetation aimed at mitigating stormwater. The first floor flow lab offers opportunities to test such projects as a portable water filtration system for water-scarce areas. Elsewhere in the building, university researchers explore how to detect invasive species in ballast water, and how to measure the water in trees in the Amazon. Fledgling companies also work on a permeable paving surface that absorbs stormwater, a wireless groundwater monitoring system and a technique in which microscopic bubbles are added to wastewater so the contaminants can rise to the surface and be skimmed. The company responsible for that last project, MikroFlot Technologies, was launched in Chicago early last year before moving to the Global Water Center. MikroFlot founder Jose Ramirez, who commutes to Milwaukee from Vernon Hills, said he got his companys seed money in Chicago but moved the operation up to the Global Water Center because its one of the only places where so many components universities, companies, startups, legal and accounting services and government agencies are accessible under one roof. About a mile away, more research is being conducted at the School of Freshwater Sciences waterfront facility that opened in September. The work there includes genetic-sequencing studies, the insertion of transmitters into wild sturgeon so they can be tracked via drones and the year-round breeding of perch that ultimately can be sold to area restaurants. \"We arent a biology school that has some people doing water,\" said Eric Leaf, the schools development director. \"We are a water school that has some people doing biology.\", Amhaus said the university is \"operating like a private enterprise\" in this \"industry-driven cluster.\" So The Water Councils focus isnt to attract water-using companies to Milwaukee but rather companies \"that have solutions for water,\" Amhaus said. \"Thats whats going to grow.\", This clusters work has generated so much activity, including Water Council consultations with South Korean and Brazilian officials, that Amhaus said the Global Water Center soon will expand to a second building in the business park. But The Water Council has no intention to expand to Chicago, despite having considered opening an office in the city. \"Were not going to assign a person to Chicago because theres not enough of a market there,\" Amhaus said. \"Here in Chicago theres certainly a lot going on in terms of water issues, but we dont have anything like The Water Council,\" said Josh Ellis, water policy expert for Chicagos Metropolitan Planning Council. Water-related research and activities are taking place in the Chicago area, but the dots are just beginning to be connected. The Emanuel-chaired World Business Chicago, whose mission is to \"put Chicago at the forefront of the global economy,\" has no plan in place to try to lure water-using companies to the city or to build off of Milwaukees successes. \"Were not all that knowledgeable about what Milwaukee is doing,\" World Business Chicago Chief Marketing Officer Wendi Taylor Nations said, noting that her organization is still \"figuring out what we have.\", No one from the city government was made available to discuss its water plans. Robinson, whose nonprofit Blue Tech Alliance aims to foster investments in water technologies, acknowledged that Milwaukees water collaborators have \"told their story better than everybody,\" but \"if youre looking at straight water engineering expertise, greater Chicago has significantly larger talent pool to pull from.\", While much of Emanuels water focus has been addressing the citys aging infrastructure and boosting public spaces such as the newly opened Riverwalk stretch, the University of Chicago has been collaborating with Israels Ben-Gurion University to develop new water purification methods. The Metropolitan Water Reclamation District, meanwhile, has been proactive in pursuing ways to treat wastewater so water-intensive industries might locate nearby and use this recycled water instead of tapping into the drinking water supply. \"The biggest obstacle to the reuse of treated wastewater in this region is that drinking water is so cheap,\" reclamation district Commissioner Debra Shore said. \"Whats driving the reuse of water in other places is scarcity.\", Shore noted that the districts Stickney Water Reclamation Plant, in partnership with Ostara Nutrient Recovery Technologies, has embarked upon a plan to pull phosphorous and nitrogen from wastewater to use as commercial fertilizer, a process already utilized in other cities. The district also is collaborating with Argonne to recover biogas, which might provide fuel to turn wastewater treatment into an energy-neutral process. Argonnes Snyder said the federal Department of Energy, which funds much of the national labs work, has declared the water-energy nexus to be a top priority. About $11 million in water research is taking place at Argonne. \"Because of the national needs, we believe that will grow significantly,\" Snyder said. Among Darlings projects is the development of nanoscale membranes that would filter out viruses and other tiny particles while a photocatalytic material would protect the membrane from pollutants thus taking chemicals and energy usage out of the wastewater treatment process. \"The idea is to build a hub, an intellectual hub, of research and development in this area here,\" Darling said. \"And even though you cant move clean water from Chicago to Haiti or India or wherever else theres not enough of it, you can move the technology there and allow them to clean up.\", Robinson says that, rather than focus on creating new water technologies, Chicago should make its mark as a venture capital source for that research. \"The industry is seeking a hub for connecting intellectual capital with venture capital,\" Robinson said. \"Chicago is a natural launch pad because the financial sector is strong.\", In that regard, Robinson said, \"our proximity to water is meaningless.\" But Darling and others see the citys connection to its lakefront as a key element to its once and future relationship with water. \"I think its just natural for us to be inclined toward water because of the Great Lakes being here,\" Darling said. \"It just makes sense that this is something that we would be going after.\", Tribune reporter Kathy Bergen contributed. mcaro@tribpub.com, Twitter @MarkCaro]", "Date": "20150612", "Author": "[Mark Caro]", "Link": "http://www.chicagotribune.com/news/globalcity/ct-water-tech-hub-met-20150612-story.html", "Title": "[ Milwaukee dives into water tech, Chicago just getting feet wet]"}