{"Content": "[Donald Trump recently tweeted his gratitude for a huge surge Hyooj! Hyooj! in his black and Hispanic support that, it turned out, did not quite exist. \"A great honor to receive polling numbers like these,\" Trump tweeted on Sept. 8. \"Record setting African American (25%) & Hispanic numbers (31%).\", Excuse me? Trump is winning almost a third of the Hispanic vote after calling Mexican immigrants criminals and rapists in his announcement speech? That sounds too strange to be true and probably isnt. Trump links to a website called The American Mirror, which essentially pulls the 25 percent figure for black voters from a SurveyUSA poll of voters who were offered a head-to-head choice of Trump versus Hillary Clinton, who received 59 percent. The rest were undecided. For Trump, that support is more than twice the 11 percent black turnout that George W. Bush received in 2004. Quinnipiacs poll found Trump receiving only 3 percent of the black vote. In CNN/ORCs poll, Trump received only 24 percent among all nonwhite voters. In a telephone conversation, Jay H. Leve, president and CEO of SurveyUSA, attributed this disparity to his companys methodology. He also noted that his firms similarly larger-than-most margin for Arnold Schwarzeneggers California gubernatorial race turned out to be right. Ah, the power of celebrity. All of which reminds me of what the great African-American writer Zora Neale Hurston wrote in 1945. \"There is an oversimplification of the Negro,\" she declared. \"He is either pictured by the conservatives as happy, picking his banjos, or by the so-called liberals as low, miserable and crying. The Negros life is neither of these. Rather, it is in-between and above and below these pictures.\", Fudged facts dont win elections. Quite the opposite, a front-runner can become swayed by his or her own spin to the point of delusions. As a result, Mitt Romneys team in 2012 expected victory based on polls, but their own base was not fired up enough to turn out in winning numbers while President Barack Obamas base did. Romneys demographically driven defeat spurred Republican Party leaders to launch a major campaign to diversify their appeal for 2016. What happened? Today that minority outreach vision sounds about as fashionable amid the Grand Old Partys primary fights as beehive hairdos and go-go boots. Few people are more disappointed than black Republicans like Robert Woodson, founder of Washingtons Center for Neighborhood Enterprise, which helps neighborhood-based organizations in fighting crime, poverty, illiteracy and family dysfunction. Woodson, a MacArthur genius grant winner, gained fame in recent years for taking Rep. Paul Ryan, R-Wis. on a \"listening tour\" in low-income neighborhoods and helping him craft the anti-poverty agenda Ryan released last summer. But Ryan, chairman of the House Ways and Means Committee and Romneys 2012 running mate, decided not to run for president. Thats left Woodson \"disappointed that poverty does not seem to be a very important issue among Republicans in the primary,\" he told me. Worse, hes seen the Grand Old Partys candidates, with the occasional exception of Jeb Bush and Carly Fiorina, among others, blow off opportunities to form useful partnerships with poor and minority communities. \"I was expecting more,\" he said. \"I was expecting, at least, for them to understand thats why they lost it last time.\", Woodson listed at least four areas of concern that GOP candidates have gotten wrong, including the following:, They have talked about the problems of poor and minority communities without spending much, if any, time in those communities, learning the real problems and possible remedies. They have \"taken the race or ethnicity door,\" treating all problems as racial even when they arent. They have been more eager to preach to local leaders than listen and learn about \"neighborhood assets,\" as the late Republican Rep. Jack Kemp, for whom Ryan and Woodson worked, called local people who are producing solutions that already are working. They expect fast results. It takes time to rebuild long-decaying relationships. It isnt too late for Republican presidential hopefuls, Woodson said, if they become serious about it, go to some of the places Ryan has visited and \"encourage their wealthy friends to invest in organizations that are solving problems\" but need support to do more. \"If you plant charitably you can harvest politically,\" Woodson said, \"but you dont plant and harvest in the same year.\", Right. Be patient. It pays. Clarence Page, a member of the Chicago Tribune Editorial Board, blogs at www.chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150915", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-gop-donald-trump-minorities-jeb-bush-perspec-0916-20150915-column.html", "Title": "[Why the GOP still fails with minority voters]"}