{"Content": "[What is Islamic State, exactly, and whats the best strategy to destroy it? Buckle up. Congress is finally approaching an overdue and surely contentious debate on whether to give American presidents new legal authority to demolish this murderous foe. Yet many among us cant meet the first rule of war: Know thy enemy. Yes, its a marauding military whose grisly beheadings and execution by immolation mark it more as a mad occupying army than a shadowy terrorist organization. And yes, it holds a broad stretch of territory in Iraq and Syria territory larger than the United Kingdom that it declares the heart of a new caliphate, or Muslim nation. But the groups self-assigned role in the impending end of the world? Hmm. What motivates these people? Why do so many of them, Westerners included, eagerly come to the desert to fight and die?, The best examination weve seen appears in the current issue of The Atlantic. \"What ISIS Really Wants,\" by Graeme Wood, argues that Islamic State is not a death cult that distorts Islam in a bid to gain political power. Rather, it is a fanatically rigid religious movement based on specific teachings and traditions of seventh-century Islam, which it implements to a dangerously literal degree. The distinction is important because it helps us explain Islamic States brutality and anticipate its next moves. In the view of Islamic State leaders, there is only one extremely narrow belief path to follow its own puritanical Salafist branch of Sunni Islam. The rest of us, even practicing Muslims, are infidels to be subjugated or killed. On the hit list: all 200 million Shiite Muslims, anyone not strictly following Shariah law, anyone recognizing any government beyond the caliphate. \"The reality is that the Islamic State is Islamic. Very Islamic,\" Wood writes. \"Yes, it has attracted psychopaths and adventure seekers, drawn largely from the disaffected populations of the Middle East and Europe. But the religion preached by its most ardent followers derives from coherent and even learned interpretations of Islam.\", This is a controversial perspective among the worlds 1.6 billion Muslims, many of whom reject Islamic States theology as a scandalous, un-Islamic mutation. An open letter signed by more than 100 Muslim leaders cites a litany of Islamic States actions their religion forbids, from killing the innocent to declaring a caliphate without consensus from all Muslims. That denunciation is important, but it doesnt invalidate the Atlantic articles premise: Islamic State follows a precise religious playbook and sees itself \"purifying the world by killing vast numbers of people\" while preparing for an End-of-Days battle in the Middle East. Wood, quoting scholars and Islamic State devotees, says the groups apocalyptic vision is crucial to its identity. Its leaders, citing a prophecy, believe they must draw enemies into a climactic battle at Dabiq, Syria. That fight will lead to Judgment Day. It wasnt much noticed at the time, but when Islamic State beheaded American hostage Peter Kassig, the group declared: \"Here we are burying the first American crusader in Dabiq, eagerly awaiting the remainder of your armies to come.\", The puritanical fanaticism of Islamic State is a vulnerability: The group derives its legitimacy from seizing and controlling territory. Unlike the stealthy al-Qaida, Islamic State must have a caliphate to rule. And if it follows its own doctrine, it will never negotiate permanent treaties. In other words, it will continually seek to expand until we hope it collapses or suffers more casualties than an advancing army can survive. Thats an argument in favor of a sustained, patient military campaign to exterminate it. There is a second front in this war: the ideological battle. Eradicating Islamic State requires convincing would-be followers worldwide that its messianic beliefs are theologically illegitimate, and lead its dupes to a dead end. \"We cannot defeat these people just by using force, we will defeat them by promoting justice,\" Nihad Awad, executive director of the Council on American-Islamic Relations, tells us. \"This is the antidote to ISIS justice, and fair play, and democracy and freedom.\", That requires replacing a vacuum of despair among adherents with hope. And that makes the war of beliefs another difficult battle to win. What should Congress do? Were on record saying that while President Barack Obama wants permission to engage this after 2,000 airstrikes, and with 2,600 U.S. troops on the ground he also wants lawmakers to tie his hands. Hes asking Congress to sign off on a plan to fight a limited war that excludes \"enduring offensive ground combat operations.\" He also would tie the hands of a future president by setting a three-year expiration on the resolution. Weve instead urged Congress to give this president not the limited authority he seeks but the broader authority that he and future presidents may well need. There are worse places to begin this debate than with an understanding of Islamic State. These are very bad people. We cannot permit them to fortify a realm in a neighborhood thats already difficult for America, its interests and its allies.]", "Date": "20150223", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-isis-islamic-state-atlantic-grame-wood-edit-0223-jm-20150220-story.html", "Title": "[Understanding Islamic State and its End-of-Days vision]"}