{"Content": "[More than 500 people came to Deerfield to hear about potential solutions to a number of world problems and from the sound of their applause to many points made by former U.N. Ambassador John Bolton, a lot liked what they heard. Bolton touched on declining American influence in the world, the Iranian nuclear issue, the threat from the Islamic State, his ideas to resolve the Israeli-Palestinian conflict and more at a Moriah Congregation event Feb. 22 in Deerfield. The former ambassador believes the countrys influence is declining in the world, he said it is a situation of the countrys own making and it can be changed by an attitude shift of the citizenry. \"Things are pretty grim for the perspective of the United States and its allies who love freedom,\" said Bolton, who was appointed U.N. ambassador in 2005 by President George W. Bush, and served about 16 months in that role. \"It is something we have done voluntarily and it can be reversed. If we dont, no one will take our place which will lead to anarchy in parts of the world or other powers will seek to take our place.\", Bolton specifically mentioned Russian moves in Ukraine and his fear of what will happen if the Russians attempt to encroach on one of the Baltic republics Lithuania, Estonia and Latvia who are NATO members. He also fears Chinas naval buildup in the South China Sea. \"Every barrel of oil from the Middle East that goes to Asia goes through the South China Sea,\" Bolton said. \"If it becomes a Chinese lake it could disrupt the economies of Japan, South Korea and other allies.\", Some of Boltons opinions came from his prepared remarks while others were in response to questions which were submitted electronically and asked through a moderator. He was directly asked what to do about the Islamic State, also known as ISIS. \"The best solution is to obliterate it,\" Bolton said. \"They control an area in Iraq and Syria that is roughly the size of Great Britain. Every day that goes by they are gaining strength. Every day that goes by our Arab friends are in a weaker position.\", Though Bolton did not mention any specific strategy, he did say the Islamic State largely operates in areas which no longer have much government control. \"We see collapsing governments from almost the Atlantic Ocean to the Indian border,\" Bolton said. \"In what used to be Libya, ISIS has established a base. There is no Iraq anymore. The Kurds will never step back, ISIS controls the Sunni areas of Iraq and Syria and the Shiite area is under the control of the Mullahs in Iran. (Syrian President Bashar al-)Assad only holds Damascus and the Alawite section. These two countries dont exist anymore.\", Iran and its ability to develop a nuclear weapon was another topic to which Bolton gave a lot of attention during his speech, and some of the questioners wanted to know still more. His objection to any deal with the Iranians which falls short of eliminating their nuclear program is centered around a lack of trust. \"Everything is based on the assumption we know everything Iran has,\" Bolton said. \"We only know what theyve told us. Before you have inspections you have to have a baseline. We do not know the extent of cooperation between Iran and North Korea.\", Bolton further opined Iran is financing North Koreas nuclear program as well as the reactor the North Koreans built in Syria which Israel destroyed in 2007. One questioner wanted to know what Bolton thought would happen if the Israelis took military action against Irans nuclear sites. \"They wont attack American military installations or block the Strait of Hormuz,\" Bolton said. \"The United States would destroy their air force and then their navy. They dont want that. If Israel enters Saudi Arabian air space the Saudis will light flares and say right this way.\", He does worry there will be missile attacks on Israel from Hezbollah and Hamas at the behest of Iran. One questioner asked Bolton what he thought about prospects of a peace agreement between Israel and the Palestinians. He expressed little confidence in current efforts for a two-state solution and then gave his opinion. \"I believe in the three-state solution,\" Bolton said. \"Give Gaza to Egypt, (Israel) should figure out the border on the West Bank and then give Jordan sovereignty over the rest of it. Its the only logical outcome.\", Steve Sadin is a freelance reporter for Pioneer Press. Twitter: @sadinsteve]", "Date": "20150224", "Author": "[Steve Sadin]", "Link": "http://www.chicagotribune.com/suburbs/deerfield/news/ct-dfr-john-bolton-tl-0226-20150224-story.html", "Title": "[Former U.N. ambassador rallies crowd at Deerfield synagogue]"}