{"Content": "[I will now graciously accept any apologies that my Republican friends want to send my way for long ago having sharply criticized my defense of the \"present\" vote in the General Assembly. During the campaign seasons of 2004 and 2008, the indignati in the GOP as well as assorted Democrats were pointing their quivering fingers at candidate Barack Obama because he had voted \"present\" not yea or nay on 129 bills and 11 personnel appointments during his eight years as an Illinois state senator. \"We dont have a present button as governor,\" sneered Republican vice presidential nominee Sarah Palin in 2008 when Obama was the Democratic candidate for president. \"We are expected to lead, we are expected to take action and not just vote present. \", \"He couldnt figure out whether to vote yes or no,\" added former New York City Mayor Rudy Giuliani. \"It was too tough.\", After I patiently explained during Obamas 2004 run for the U.S. Senate and the 2008 campaign that \"present\" is a time-honored political tactic in Springfield, not an act of handwringing indecision, the eye-rollers pounced. I was pro-dither an apologist for a weak-kneed waffler; an enabler of a latter-day Hamlet!, Well, on Thursday 37 Republican members of the Illinois House voted \"present\" on a bill to allow local governments to institute \"right to work\" zones in which employees at unionized workplaces could opt out of joining the union. A handful of other members of the caucus simply didnt vote on the idea, which is a major part of Republican Gov. Bruce Rauners legislative agenda and which the majority Democrats resoundingly defeated. Republicans cast a similar flurry of \"present\" votes the previous week on a bill to approve the drastic social-service cuts that are implicit in Rauners budget, and theyre likely to do it again in the next week when a proposal comes to the floor to OK business-friendly changes in the administration of workers compensation. I dont blame them. These bills arent serious. Theyre designed to fail, introduced by Democrats for the dual purpose of illustrating to Rauner that his big ideas are going nowhere in the General Assembly and trying to get Republican lawmakers to cast \"yes\" votes that can be used against them during the next campaign. Typically, \"present\" translates as a \"soft nay\" vote because a bill has to win \"aye\" votes from a majority of the lawmakers. It suggests partial agreement with the proposal, but with significant reservations. Its also a way for those representing legislative swing districts to help kill a bill without casting a lightning-rod vote, as well as a way for those representing solid districts to provide cover for their colleagues in swing districts who want to prevent a problematic bill from passing. And here, of course, \"present\" translates as an \"Im not going to play your silly games\" vote by Republicans refusing to get suckered into casting futile votes to OK individual elements of Rauners plan before bipartisan negotiations have yielded any of the compromises or grand bargains that must emerge before the General Assembly can adjourn for the summer. Rauner referred to these Democratic ploys as \"political theater\" at a news conference Thursday, and he was completely right. After all, if House Speaker Michael Madigan were actually interested in putting controversial ideas to a floor vote and not merely yanking the governors chain, hed ask lawmakers to take a stand on a proposed amendment to the Illinois Constitution that would impose term limits on state lawmakers. Its a wildly popular element of Rauners overall agenda that Madigan, who has been in the General Assembly since the Earth cooled, opposes. Then again, theatrics posturing, bluffing, demonstrating, misdirecting have always been a part of the political process. Rauner himself has been engaging in a bit of stagecraft lately, attempting (with but modest success) to persuade city councils and village and county boards throughout the state to pass symbolic resolutions in support of his proposals to weaken unions. The result of these histrionics so far has been a clear indication that Rauner isnt the star of the show, that he will have to at least share the limelight with the Democratic leaders if not cede much of it to them. He seemed to acknowledge as much Thursday when he dropped his peremptory, CEO attitude by stressing the need for negotiation and compromise and saying hes \"taken a number of things off the table,\" referring, vaguely, to his long list of bullet-point proposals to \"turn around\" state government. Truth is, though, that all these acts in Springfield are starting to wear thin. Ordinary names help some offenders hide in plain sight, Earlier this month, a DeKalb County judge found 22 former fraternity members guiltyof misdemeanor hazing or felony reckless conduct in the death of Northern Illinois University freshman David Bogenberger, 19, who died as a result of excessive alcohol consumption at a frat initiation. Bogenberger was \"ridiculed, tormented (and) poisoned\" by his so-called brothers, his mother said in a statement to the court. None of those found guilty will serve any jail time, but, a Tribune editorial noted as partial consolation, \"These 22 men cannot outlive online records and references to their crimes.\", Thats certainly true for some those with unusual last names such as Pfest, Vergaralope and Jandick will never be more than a click or two away from their roles in this ugly deed. But others those with much more common last names such as Jimenez, Post, Harvey and Diaz will almost certainly find themselves well-camouflaged by search engines. Google justice isnt all its cracked up to be. Re: Tweets, Readers have voted this by @SamReidSays as the funniest tweet of the week: \"Dogs are probably really excited about dog sledding before they find out what it actually is.\", If you want to get in on the polling action, write me at ericzorn@gmail.com and Ill subscribe you to the free newsletter that alerts you as soon as the semi-finalists are posted. Got more questions? Comments? Post them to chicagotribune.com/zorn. Twitter @EricZorn]", "Date": "20150515", "Author": "[Eric Zorn]", "Link": "http://www.chicagotribune.com/news/opinion/zorn/ct-present-vote-perspec-zorn-0517-20150515-column.html", "Title": "[Remembrance of things 'present' in Springfield ]"}