{"Content": "[He was once one of Illinois most promising young politicians, but on Thursday, former U.S. Rep. Mel Reynolds was struggling to find a place to live that wouldnt be in violation of his sex offender status while he awaits trial on charges that he failed to file tax returns. The situation nearly landed Reynolds in jail for the night, but after several hours of making calls, Reynolds was able to secure a court-approved place to stay on an emergency basis. He was ordered to appear before a federal magistrate judge at 2 p.m. Friday with a more permanent address. Former U.S. Rep. Mel Reynolds proclaimed his innocence on tax charges in front of the media Wednesday. (WGN-TV), Former U.S. Rep. Mel Reynolds proclaimed his innocence on tax charges in front of the media Wednesday. (WGN-TV), \"This is a one-night deal,\" said Reynolds court-appointed attorney, Richard Kling, who declined to offer details on where or with whom Reynolds would be staying. He said Reynolds has a more permanent place lined up that should satisfy the court. Reynolds troubles began shortly after he pleaded not guilty to the misdemeanor tax charges in the morning, and discussions turned to where he would live while free on a personal recognizance bond. Prosecutors said the South Side residence where Reynolds had recently been staying was not appropriate. Under the terms of his 1995 conviction for having sex with an underage campaign worker, Reynolds cannot live within 500 feet of a school. Another residence proposed in suburban Bartlett was rejected because of its proximity to a childrens center. Kling then said his client proposed staying at a motel in Indiana, but U.S. Magistrate Judge Maria Valdez objected, saying that was \"not acceptable.\", That left Reynolds and his attorney scrambling to find a place for him to live in order to avoid the possibility of being ordered into custody. As Kling addressed reporters after the morning hearing, Reynolds stood to the side scrolling through his smartphone and making calls. Kling said Thursday afternoon that Reynolds hoped to be allowed to travel while on bond so he can visit his \"very sick\" daughter in Africa, where Reynolds had been living when the indictment was returned last month. Reynolds, 63, was charged with failing to file income tax returns from 2009 through 2012.The four-count indictment alleged that Reynolds failed to file a tax return for each of the four years despite receiving \"gross income in excess of the amount required to file an income tax return.\" Each count carries a maximum sentence of one year in prison and a $250,000 fine on conviction. Reynolds arraignment came a day after he held a news conference to proclaim his innocence. \"The narrative has been that somehow I didnt pay my taxes, I didnt file,\" Reynolds said Wednesday. \"By going to trial, this is going to set the record straight.\", Once a rising political star, Reynolds had a spectacular fall from grace when a Cook County jury convicted him in 1995 on criminal sexual abuse, obstruction of justice and child pornography charges for having sex with a onetime campaign intern, 16, and then trying to sabotage the case against him. He was sentenced to five years in prison. In 1997, while serving his state prison sentence, Reynolds was convicted again this time in federal court on 15 counts of campaign and bank fraud related to illegally raising campaign cash and defrauding banks out of hundreds of thousands of dollars. He was sentenced to 6 1/2 years in federal prison. Reynolds served 2 1/2 years in state prison and then was transferred to federal prison, but in 2001, President Bill Clinton, hours before leaving office, commuted Reynolds federal sentence with two years left to serve. By 2003, Reynolds made the first of several failed attempts at a political comeback, running against U.S. Rep. Jesse Jackson Jr. in the 2004 Democratic primary. After Jackson resigned in 2012 amid his own scandal, Reynolds again sought to win back his former 2nd Congressional District seat under the slogan of \"Redemption,\" but he again was unsuccessful. Last year, Reynolds was arrested and jailed in Zimbabwe on charges that he had sexually explicit photos and videos on his mobile phone in violation of a censorship law. Days later, authorities dropped the pornography charges, and Reynolds pleaded guilty to a misdemeanor visa violation and was deported from the southern African country. jmeisner@tribpub.com, Twitter @jmetr22b]", "Date": "20150730", "Author": "[Jason Meisner]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-mel-reynolds-arraign-taxes-met-20150730-story.html", "Title": "[After scramble, Mel Reynolds finds 'one-night deal' to avoid jail stay ]"}