{"Content": "[Major ballot changes could be implemented for the 2016 primary and general elections under a proposed law changes that Will County Clerk Nancy Schultz Voots said would be tough and costly to implement. House Bill 1452, sponsored by state Rep. Larry Walsh Jr. D-Elwood, would require that election information be printed in a foreign language if a precinct has at least 10 percent of its people speaking that language and who have been identified as having limited proficiency in English. The figures would be tracked through census data. The House passed the bill, and its now before the Senate. Voots said she has not yet determined how much it would cost to print foreign language ballots and election information, hire bilingual election judges and interpreters and change information on her website. She hopes to persuade Walsh to amend his bill and implement the change after the 2016 elections. \"We should not be implementing this in a presidential election. It will be more confusing for voters,\" she told members of the county boards legislative committee on Thursday. \"This is a huge bill. It might be more costly than the poll books,\" she said, referring to a new law allowing same-day voter registration in all of the countys 303 precincts on Election Day, beginning with the March 2016 primary. To conduct same-day registration in all precincts and prevent fraud, Voots said it will cost more than $1 million to purchase electronic poll books for each precinct and train about 3,000 judges. The poll books would alert election judges whether the voter is registered elsewhere in the county. Earlier this year, Voots tried unsuccessfully to amend the same-day registration law to delay its implementation until after the presidential election. Her budget this fiscal year did not include expenses for poll books or foreign language materials, she told the committee, and more time is needed to find polling places that have reliable Internet service and to find bilingual judges. She said she may have to reduce the total number of precincts. \"(Legislators) are making it impossible for us to do our job,\" she said. \"... If they are going to pass these laws, give me the money for them or give me more time to implement them.\", In the November 2014 election, Will and other counties offered same-day registration on a trial basis in a few precincts. The ballots were considered \"provisional\" and were not counted until two weeks later, after they could be verified. County board member Steve Balich, R-Homer Glen, said House Bill 1452 is \"unconstitutional\" because English is the official language of Illinois according to the state constitution. A voter should bring their interpreter to a polling place if needed, he said. In suburban Cook County, Clerk David Orr has implemented election information, including ballots, in Spanish, Chinese and Hindi, according to Orr spokeswoman Courtney Greve. Touch-screen voting machines are equipped with ballots in English, Spanish, Chinese and Hindi, allowing the voter to select a language on the screen before voting. Orrs office has assigned bilingual election judges in precincts with high concentrations of Spanish, Chinese and Hindi-speaking voters who are not proficient in English and may need special assistance in voting. Voters and election judges also can use telephone hotlines, available in those three languages plus Korean and Polish, to call for assistance. Orr supports same-day registration, saying previously that it will make Illinois a \"premier state in terms of modernizing voter registration.\", By sharing databases with other state agencies such as the secretary of state, Department of Employment Security and Department on Aging, the voter registration process will be more efficient because election officials will be better able to know whether a voter has died or moved, even if it is out of state, according to Orr. slafferty@tribpub.com]", "Date": "20150515", "Author": "[Susan DeMar Lafferty]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-foreign-ballots-st-0514-20150515-story.html", "Title": "[Will Co. clerk wants to delay foreign language ballots]"}