{"Content": "[Its safe to say that virtually all political professionals think Donald Trumps presidential campaign is doomed. The odds of him winning the Republican nomination are long and the odds of him winning the general election are nonexistent, they say. The key reason is that Trumps campaign is based on alienating Latinos, a large and fast-growing voter bloc, by supporting the deportation of 11 million undocumented immigrants and building a wall along the border with Mexico to prevent further emigration. If the eventual Republican nominee needs 47 percent of the Latino vote to win the general election the threshold set by two political scientists in a study for Latino Decisions what chance does Trump have?, But what if Trump could replace Latino votes with those of another large minority group that traditionally votes Democratic? Then he might have a fighting chance at victory. And even without changing his message, black voters could be that group. African Americans have long been receptive to the anti-immigrant concepts behind Trumps campaign. Simply put, the jobs, housing and other opportunities that immigrants take come largely at the expense of blacks who were born in the United States. As long ago as 1881, the abolitionist Frederick Douglass complained that immigrants from Ireland, the Latinos of the day, were stealing jobs from African Americans. \"Every hour sees us elbowed out of some employment to make room for some newly-arrived emigrant from the Emerald Isle, whose hunger and color entitle him to special favor,\" Douglass wrote in his autobiography. A few years later, in his famous Atlanta Exposition address, Booker T. Washington begged white employers to reject \"those of foreign birth and strange tongue and habits\" in favor of native-born blacks, who had toiled \"without strikes and labor wars.\" By 1916, mass immigration had made black workers \"superfluous,\" the New Republic charged. The immigrant \"is the Negros most dangerous competitor,\" it said. Black newspapers editorialized in favor of the Immigration Act of 1924, which enacted the first major restrictions on immigration. In an editorial, the Chicago Defender said: \"With the average American white mans turn of mind the white foreign laborer is given preference over the black home product. When the former is not available the latter gets an inning.\" The labor leader A. Philip Randolph went even further, saying the Immigration Act wasnt nearly enough. \"Instead of reducing immigration to 2 percent of the 1890 quota, we favor reducing it to nothing,\" he said. By 1993, black poet Toni Morrison put the issue succinctly in an essay for Time, saying, \"Whatever the ethnicity or nationality of the immigrant, his nemesis is understood to be African American.\", Economically, the division is beyond doubt, and Trump could exploit it if he chose to. According to the Census Bureau, the incomes of black households have long been considerably lower than the incomes of Hispanic households. In 2013, the former had a median income of $34,598, while the latter had a median income of $40,963, a difference of nearly 20 percent. There is little doubt that immigration depresses the employment and wages of black men. A 2010 study by the economists George Borjas, Jeffrey Grogger and Gordon Hanson found that a 10 percent immigration-induced increase in the labor supply reduced African Americans wages by 2.5 percent and the employment rate among blacks by 5.9 percentage points. Since the 1990s, academics have been studying the political and economic cleavage between blacks and Latinos. A 1997 study by sociologist Roger Waldinger found that employers in Los Angeles favored Latino over black workers, a situation reinforced by tense relations when the two groups worked side by side. A 2006 study by political scientists David O. Sears and Victoria Savalei found that even newly-arrived Latinos were better able to assimilate politically into the broader society than blacks who were still subject to a strict color line. As a consequence, public opinion among a majority of working-class and middle-class African Americans supports a more restrictive immigration policy, according to a 2012 study by political scientist Tatishe Nteta. Gallup found that 49 percent of African Americans think immigration worsens the availability of job opportunities for them, compared with 34 percent of non-Hispanic whites. A New American Media poll found that 51 percent of African Americans believe that Latinos are taking away jobs, housing and political power from the black community. A 2012 Pew Research Center poll found that 61 percent of blacks agreed that \"the growing number of newcomers threaten traditional American values,\" vs. 48 percent of whites. Translating potential black support for anti-immigration policy into votes for Trump would not be easy. Black voters overwhelmingly pick Democrats in presidential elections. On the other hand, Republicans have not seriously competed for African American votes since 1960, when Richard Nixon receivedone-third of the black vote. Tellingly, the only Republican to take an anti-immigrant message directly to the black community in recent years received a positive reception. Tom Tancredo, then a U.S. Representative from Colorado, addressed the NAACPs national convention in 2007, the only member of the GOP to do so. During his speech, he received warm applause when he quoted a black woman who told him, \"I always knew something would bring us together. Who knew it would be our common language?\", Sooner or later, Republicans will recognize that the partys negative image among Hispanics will keep it out of the White House indefinitely unless a new source of non-white votes can be found to replace the declining share of whites in the population. The original idea of Republican leaders was to enact immigration reform to neutralize Hispanic hostility, but Trumps success, as well as the endorsement of his immigration views by other GOP candidates such as Wisconsin Gov. Scott Walker and Sen. Ted Cruz of Texas, makes that impossible for now. So if Republicans are stuck with an anti-immigrant message, they may as well use it to their advantage by reaching out to the black community, where it could resonate in an election in which the nominees of both parties will almost certainly be white. Would African American voters pick Trump just because of his views on immigration? Clearly, Republicans will need better outreach to the black community than they have had in decades. But immigration gives Trump entre to African Americans with an issue that will resonate with many and at least give him a hearing. An aggressive effort by him to court black voters could change the political dynamics and hit Democrats where they least expect it. Some will point to past negative comments Trump has made about President Barack Obama that could sour African Americans on him. But it is remarkable that he has shown an ability to slough off statements and policy flip-flops that would have doomed other candidates. For example, despite Trumps history of making misogynistic comments, his support among women in a matchup with Democratic front-runner Hillary Rodham Clinton is about the same as it is for other Republican candidates, according to a Quinnipiac University poll released Aug. 27. Trump seems invulnerable to the traditional rules of politics. But that is also why he is receptive to ideas that have been taboo among Republicans for many years, such as raising taxes on the ultra-wealthy. Although the focus today is on the GOP nomination, it is not too soon for Trump to think about a general-election strategy. Using his immigration position to make a play for black votes is exactly the sort of unexpected play that has propelled him to the top of the GOP pack. He may just be audacious enough to pull it off. Washington Post, Bruce Bartlett has worked for many Republican officeholders, including Jack Kemp and President Ronald Reagan, for whom he was a domestic policy adviser. He is the author of \"Wrong on Race: The Democratic Partys Buried Past.\"]", "Date": "20150908", "Author": "[Bruce Bartlett]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-hispanic-voters-20150908-story.html", "Title": "[Donald Trump doesn't need Latino voters to win the GOP nomination]"}