{"Content": "[When a fire in 2006 nearly demolished Pilgrim Baptist Church, an architectural treasure by Louis Sullivan that is known as the birthplace of modern gospel music, many Chicagoans insisted that the building had to be restored. Two years after the fire, architects hired by the Bronzeville churchs board of trustees revealed dazzling plans for a $37 million rebuilding project that would include a social services building and a cultural center. At the time, some architectural preservationists questioned how an aging congregation whose membership had declined from its height of 1,000 members to a couple of hundred would be able to undertake such a project. Pilgrim Baptist Church is engulfed in flames on Jan. 6, 2006. Pilgrim Baptist Church is engulfed in flames on Jan. 6, 2006. Now those skeptical voices ring prophetic. Nearly a decade after the blaze, steel bracing that stabilizes the churchs limestone walls offers the only clear evidence that anyone intends to save one of Chicagos most historic places. Hopes of a restoration have fallen so far that some architectural preservationists think the only remaining option might be to preserve the surviving walls and turn the site into a park. Completed in 1891 by Chicago engineer Dankmar Adler and architect Sullivan, the 10,500-square-foot building was originally a Jewish synagogue, Kehilath Anshe Maariv. Then it became Pilgrim Baptist, where in the 1930s Thomas A. Dorsey blended jazz and blues with religious music to create modern gospel music. In the churchs heyday, Sunday services were standing room only. \"The building was literally in motion and really inspired in terms of the space,\" said Tim Samuelson, Chicagos cultural historian. \"Then you combine it with a church service and some of the finest gospel music youd ever hear anywhere its a place you would never forget.\", Now the building is considered an eyesore in the community, and the bracing blocks the sidewalk around the building at 33rd Street and Indiana Avenue, forcing pedestrians into traffic, according to neighbors. Frustrations have come to a head, they said, as they allege the churchs board of trustees wont share its building plans and is unresponsive to the communitys concerns. \"We want the church to be either rebuilt, demolished or moved on in some fashion because we need access to the sidewalks there,\" said Danny Bishop, a community member who spearheaded a petition to demand an action plan from the church this year. \"Over the course of close to 10 years a decade they have been disingenuous to the community regarding any rebuilding plans.\", At the very least, the community would like church leaders to place a roof on the building, fill in windows to prevent deterioration and move the stabilization beams inside the walls, according to Leonard McGee, president of The Gap Community Organization, which is leading the petition drive. \"The first five years youre understanding and youre sympathetic and you try to say, What can we do to help?\" McGee said. \"It was a great house of worship, and we would like to see the house of worship restored, but at the same time, how long should we have to wait before we get our sidewalks back?\", Bishop said the community group met earlier this month with the local alderman, Pat Dowell, 3rd, and they agreed to write a letter demanding a meeting to discuss definitive rebuilding plans, including expenditures and a date when the walls would either be renovated or removed. Dowells office said the letter was sent late last week. Church officials have not responded to Tribune requests to explain where renovation plans stand. Cynthia Jones, vice chairman of Pilgrim Baptist Churchs board of trustees, when contacted at the church last weekend, said she did not see a letter or petition from the community. She declined to comment further, referring questions to Pilgrim Baptists attorney, Stephen Pugh. Pugh declined to comment, citing pending litigation related to the project. The last time the board was quoted in the Tribune was in April 2011, when it announced immediate plans to start a $3.5 million first phase of construction that would have, among other things, removed scaffolding and added a roof. At the time, Jones declined to discuss how much money was available for rebuilding, saying only that foundations had promised funds and that the recession had deterred earlier rebuilding efforts. \"Its been a long, long journey,\" Jones said at the time. The devastating 2006 fire was caused by a rehab project that went awry: Workers using a propane torch for roof repairs accidentally started the blaze. A year later, the church said it had raised less than $250,000 in private donations for the restoration. The Pritzker Family Foundation promised a $500,000 matching grant, and former Gov. Rod Blagojevich promised $1 million in state money, which later became mired in controversy when it was directed to and used by a school that held classes on the churchs grounds. In 2010, the church filed a lawsuit against the Illinois Department of Commerce and Economic Opportunity, seeking compensation for the mix-up. The suit, which the church later withdrew, claimed the church had spent $65,015 on demolition and building expenses. Pilgrim Baptist never received any of the promised $1 million from the state, a representative of the commerce department said recently. The Pritzker Family Foundation originally promised to match private donations for 2007 but extended it to 2008 as well and ended up disbursing $399,287 to Pilgrim Baptist Church, a representative of the foundation said this week. The churchs board has become increasingly reluctant to share building plans, according to Joyce Smith, a member of The Gap Community Organization who joined Pilgrim Baptist five years ago when she moved into the area but has since left the church. \"Without that transparency, it makes you very (suspicious),\" Smith said. \"What are you doing with the money?\", She estimated that church membership has declined to fewer than 75. The congregation has been meeting across the street from the original building, and a Tribune reporter counted about 50 people at a service there last Sunday. Howard Medley, a deacon who described himself as a longtime member of the church, said he donated $50,000 to the building project four years ago, but after seeing no progress, has since demanded his money back to no avail. A few years ago, Medley said, the board of trustees told the deacons that they had raised $4.7 million, largely from private and church donations, but did not allow the deacons to take copies of the paperwork that detailed the funding. \"I believe that we need an audit. We need the government to give an audit there,\" said Medley, who said he has stopped attending because of the disagreements. \"I dont want to fight a church.\", After filing a lawsuit against the church seeking information on the building funds and expenditures, church member Isaac Whitman said he has been turned away by security guards when he tries to enter Sunday services. In his suit, he claims that the church is using rebuilding funds for general operations and legal fees, including the dispute over the controversial dismissal of its previous pastor, Tyrone Jordan. Smiths frustration is compounded by the fact she frequently walks by the churchs ruins on her way home. In the winter, snow buildup pushes pedestrians farther out into traffic, according to community members. \"Especially in wintertime, when it gets dark very early, its scary. Its very scary,\" Smith said. \"Its just not safe.\", The community petition for a timetable includes 450 signatures from those who live around Pilgrim Baptist, according to Ald. Dowell. \"Its coming to a point where the rubber is meeting the road on the decision on the future of that property,\" Dowell said, \"and it has to be done in a thoughtful way because the building and the area has historical significance, and were dealing with an important institution in the Bronzeville community.\", In the 1950s and 60s, membership at Pilgrim Baptist declined as people moved out of the neighborhood, and an aging church struggled to maintain the building. In the two years before the fire, a congregation of about 200 worshippers had spent $500,000 in renovations, church officials told the Tribune at the time. Samuelson recalled how, as part of work that began in the 1980s, he had helped restore a painted-over ceiling at Pilgrim Baptist, which he compared to the hull of Noahs Ark. \"I always thought it was a special building, not only for its architectural history but for its historical background its Jewish history background, for its gospel music background, for its Bronzeville background,\" Samuelson said. \"Its got a lot of layers to it.\", John Vinci, an architect who helped with renovation work before the fire, said even back then, he saw this day coming. \"I just felt in my bones they could not do what they were attempting to do by themselves,\" Vinci said of the churchs trustees. \"Somehow I could see their arrogance and their stubbornness, and I resented it when they didnt have the intelligence to put the church in good hands and make it into a national cause and relinquish its control. They wanted to control everything.\", At this point, city historians and architects hope to at least salvage the walls and incorporate them into a memorial park on the site, with hopes that either the church or another organization eventually can raise enough money to rebuild. \"Im fairly angry,\" Vinci said, \"but now the only hope I see is making it into a park, which would honor both the Jewish progressive congregation that was there and one of the last sites of an Adler and Sullivan synagogue.\", Ideally the church will donate the property to another entity, said Ward Miller, who co-wrote a book about the works of Adler and Sullivan and is the executive director of Preservation Chicago. \"Maybe this could be a place where people could get together ... celebrating modern gospel music,\" Miller said. \"There are simply not enough Adler and Sullivan buildings remaining, and its loss would be a terrible tragedy on top of the loss by fire of the church building back in 2006.\", The community around it remains skeptical that church leaders will be able to fulfill past promises. \"Im not going to say miracles dont happen, but it would be a miracle. Right now they have not been good neighbors,\" McGee said. \"Right now its a sad day, but its even sadder when children cant walk by safe.\", mmrodriguez@tribpub.com, Twitter@merjourn]", "Date": "20150724", "Author": "[Meredith Rodriguez]", "Link": "http://www.chicagotribune.com/news/ct-pilgrim-baptist-rebuild-met-20150723-story.html", "Title": "[Hope fades for restoring Pilgrim Baptist Church]"}