{"Content": "[With evidence that the U.S. economy is rebounding from a winter slump, the Federal Reserve will likely signal this week that an interest rate increase is coming just not quite yet. Many economists say that if the economy keeps improving, the Fed will most likely raise its key short-term rate when it meets in September. That rate has been held at a record low near zero since 2008. The Feds timetable has far-reaching impact: Once it begins raising short-term rates, other rates for mortgages, auto loans, corporate borrowing could head higher. Stock and bond prices could be squeezed. In recent weeks, key sectors of the economy the job market, retail spending, home sales have improved. The gains mark a reversal from the January-March quarter, when the economy is estimated to have shrunk, in part because of a harsh winter. On Wednesday, the Fed may sketch a slightly brighter picture of the economy in a statement after its latest policy meeting ends and in a news conference by Chair Janet Yellen to follow. The central bank will also update its economic forecasts. Among economists, the Fed is seen as wanting to prepare investors for a coming rate hike if the economy continues to improve while stressing the reassuring message that it will raise rates very gradually. The idea is to avoid spooking investors, who are already on edge over the likelihood of a rate hike and the threat of a default by Greeces government. The Fed wants to convince the markets that the economy will be sturdy enough to withstand slightly higher rates. When the Fed last met in April, the economy had just emerged from a stall-out. Growth in the January-March quarter had been depressed by weather that kept consumers home, a labor dispute that disrupted West Coast ports, a stronger dollar that slowed exports and cheaper oil that triggered cutbacks by drilling companies. After its meeting, the Fed downgraded its assessment of the economy and gave no indication it was any closer to raising rates. Recent economic reports have turned more buoyant, with a rebound in home construction and retail sales and near-record auto sales. Perhaps most important, the job market has revived, having added an average of 217,000 jobs a month this year. The unemployment rate, at 5.5 percent, is down from 6.3 percent a year ago and 7.5 percent two years ago. Even pay growth, which has languished during the economic recovery, has begun to pick up. All that points to solid economic growth of around 2.5 percent in the current April-June quarter. Yet there are still lingering problems that Yellen and other Fed officials are likely to cite as reasons for delaying a first rate hike a while longer. Though average hourly earnings rose 2.3 percent in May from a year ago, wage increases remain generally sluggish. Other labor market indicators from the number of people jobless for more than six months to the number of part-time workers who would prefer full-time jobs remain at levels the Fed views as subpar. Beyond employment, the central bank has yet to achieve its other mandate promoting stable prices. Inflation has remained persistently below the Feds 2 percent annual target. Too-low inflation tends to hold back economic growth. Some economists also note that if a Greek default and an exit from the euro currency alliance were to ignite turmoil in global markets, or if investors dumped bonds and sent long-term rates soaring, the Fed might decide to put off a rate increase until next year. The International Monetary Fund this month downgraded its forecast for the U.S. economy and urged the Fed to consider delaying a rate hike until 2016. IMF Managing Director Christine Lagarde said the risks of raising rates too soon and slowing and perhaps wounding the economy before its reached full strength outweighed the risks of waiting a bit too long and allowing inflation to creep up. Diane Swonk, chief economist at Mesirow Financial, said she expects the Fed to raise rates by a quarter-point in September and then to wait until the first quarter of 2016 before making another quarter-point move. The idea would be to give investors time to adjust. At the same time, economist David Jones, the author of several books on the Fed, says the jump in rates on 10-year Treasury notes and on German bonds shows that bond investors have grown skittish. \"When the Fed does start to move, we are going to see a spike in interest rates and significant volatility not just in the United States but global markets as well,\" Jones said. Associated Press]", "Date": "20150616", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/business/ct-fed-coming-rate-hike-20150616-story.html", "Title": "[Fed likely to signal coming rate hike if economy strengthens]"}