{"Content": "[Joe La Margo says the districts reserve funds to be preserved at a level higher than suggested in budget, Orland School District 135 board president Joe La Margo vowed Monday to preserve the districts cash reserves beyond what was offered in a budget plan last month. District finance director Carl Forn presented a spending outline in July that predicted that reserves would drop from more than $35 million now to $30.5 million when the next budget expires in June 2016. That would put reserves at 43 percent of annual spending, below the 45 percent minimum set by the board. La Margo, who was absent from the July meeting, concluded Monday nights meeting by taking issue with the Daily Southtowns reporting on the proposed spending plan, which will be voted on in September. \"It made it sound like we were giving away the farm, that we had an unbalanced budget and this and that,\" La Margo said. \"I can tell you this that can be no further from the truth. We will be living within our fund balance policy. We will be passing a balanced budget.\", It would take some combination of $1.4 million in spending cuts, more revenue or rosier projections to reach the 45 percent balance sought for the four funds education, transportation, operations and working cash that comprise the districts reserves. La Margos comments Monday came after the school board approved transferring $105,000 in working cash fund reserves to the transportation fund to help offset some of the $1.3 million that the state shorted District 135 in the fiscal year that ended June 30. Forn said last month that the states stinginess had contributed to a $2 million deficit between district revenue and spending. When he voted against the districts last property tax increase in December 2012, La Margo complained that District 135 was sitting on \"$52 million in the bank.\" He was appointed board president the following year and since has overseen budgets that kept the tax levy (the amount the district expects to raise via the property tax) flat for two years. Last year, the board spent $2.9 million in reserve money to retire debt a year early saving the average homeowner about $200 and used another $2.6 million to bankroll the first year of a plan to provide every student in the third through eighth grades with a take-home iPad or laptop computer. While pledging to keep reserves above the floor that board members set last year, La Margo said potential state funding cuts tied up in the budget stalemate in Springfield would determine whether the board votes this winter to raise the tax levy. \"We have held our levy flat for the past two years and have no plans of increasing it unless the state somehow does what they have been threatening to do and we have to revisit everything,\" he said. He also rifled off a laundry list of other cost-saving efforts, including a new bus contract expected to save $200,000 a year and a 2014 telephone provider swap thats predicted to save $75,000 a year. However, an audit showed that the District 135 needlessly spent $81,000 because it took more than a year to cancel its old phone service. La Margo said a public hearing on the 2015-16 budget and the boards vote on it will occur at the Sept. 14 meeting at the Administration Center, 15100 S. 94th Ave. Patrick Guinane is a freelance reporter.]", "Date": "20150811", "Author": "[Patrick Guinane]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-district-135-reserves-st-0812-20150811-story.html", "Title": "[D135 board president vows to keep reserve fund level]"}