{"Content": "[The Obama administration formally removed Cuba from the U.S. terrorism blacklist Friday, a decision hailed in Cuba as the healing of a decades-old wound and an important step toward normalizing relations between the Cold War foes. Secretary of State John Kerry signed off on rescinding Cubas \"state sponsor of terrorism\" designation exactly 45 days after the Obama administration informed Congress of its intent to do so on April 14. Lawmakers had that amount of time to weigh in and try to block the move, but did not do so. \"The 45-day congressional pre-notification period has expired, and the secretary of state has made the final decision to rescind Cubas designation as a state sponsor of terrorism, effective today, May 29, 2015,\" the State Department said in a statement. \"While the United States has significant concerns and disagreements with a wide range of Cubas policies and actions, these fall outside the criteria relevant to the rescission of a state sponsor of terrorism designation,\" the statement said. The step comes as officials from the two countries continue to hash out details for restoring full diplomatic relations, including opening embassies in Washington and Havana and returning ambassadors to the two countries for the first time since the U.S. severed diplomatic relations with the island in January 1961. The removal of Cuba from the terrorism list had been a key Cuban demand. The Cold War-era designation was levied mainly for Cubas support of leftist guerrillas around the world and isolated the communist island from much of the world financial system because banks fear repercussions from doing business with designated countries. Even Cubas Interests Section in Washington lost its bank in the United States, forcing it to deal in cash until it found a new banker this month. Banks continue to take a cautious tone about doing business with Cuba since U.S. laws still make the island off limits for U.S. businesses. Leaders of the Republicans-controlled House have shown zero interest in repealing the laws from the 1990s that codified the U.S. embargo on trade with Cuba. \"Taking Cuba off the terrorism list is one step toward normalization, but for doing business down there, we have a long way to go,\" said Rob Rowe, vice president and associate chief council at the American Bankers Association. In a blog post, the White House called the decision on the terrorism list another step toward improving relations with Cuba. \"For 55 years, we tried using isolation to bring about change in Cuba,\" it said. \"But by isolating Cuba from the United States, we isolated the United States from the Cuban people and, increasingly, the rest of the world.\", The terrorism list was a particularly charged issue for Cuba because of the U.S. history of supporting exile groups responsible for attacks on the island, including the 1976 bombing of a Cuban passenger flight from Barbados that killed 73 people aboard. The attack was linked to Cuban exiles with ties to U.S.-backed anti-Castro groups and both men accused of masterminding the crime took shelter in Florida, where one, Luis Posada Carriles, currently lives. \"I think this could be a positive act that adds to hope and understanding and can help the negotiations between Cuba and the United States,\" said director Juan Carlos Cremata, who lost his father in the 1976 bombing. \"Its a list we never should have been on,\" said Ileana Alfonso, who also lost her father in the attack. Top U.S. Republicans criticized the move, with House Speaker John Boehner of Ohio saying the Obama administration had \"handed the Castro regime a significant political win in return for nothing.\", \"The communist dictatorship has offered no assurances it will address its long record of repression and human rights at home,\" Boehner said in a statement. Former Florida Gov. Jeb Bush said the decision was a mistake and called it \"further evidence that President Obama seems more interested in capitulating to our adversaries than in confronting them.\", House Minority Leader Nancy Pelosi, a California Democrat, praised the move, saying it is a \"critical step forward in creating new opportunities for American businesses and entrepreneurs, and in strengthening family ties.\", U.S. and Cuban officials have said the two sides are close to resolving the final issues needed for restoring diplomatic relations, but the most recent round of talks ended May 22 with no announcement of an agreement. White House press secretary Josh Earnest said Friday that \"there continue to be issues that need to be worked out.\" He said important progress had been made, but would not give a time frame for an announcement. \"Thats obviously among the next milestones,\" he said. Washington and Havana are wrangling over U.S. demands that its diplomats be able to travel throughout Cuba and meet with dissidents without restrictions. The Cubans are wary of activity they see as destabilizing to their government. Both the U.S. and Cuba say reopening embassies would be a first step in a larger process of normalizing relations. That effort would still have to tackle bigger questions such as the trade embargo as well as the future of the U.S. military base at Guantanamo Bay and Cubas democracy record. Associated Press]", "Date": "20150529", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-cuba-removed-from-terror-list-20150529-story.html", "Title": "[Cuba removed from U.S. list of terrorism sponsors ]"}