{"Content": "[This year is the golden anniversary of Medicare, the U.S. governments sprawling health care initiative, which President Lyndon Johnson signed into law in 1965. Today, Medicare covers more than 55 million people, including 9 million beneficiaries who are under age 65 and permanently disabled. Here are the basics on this popular program: If you are an American citizen or a legal resident in the United States for at least five years, you are eligible for Medicare when you or your spouse turn 65 and have paid a payroll tax for at least 10 years. You must officially enroll in the program, unless you already receive Social Security, in which case you are automatically enrolled. If you or your spouse works beyond age 65 for an employer that provides you with health insurance, you can delay enrollment until you retire. About three months before Medicare coverage starts, the government sends an Initial Enrollment Questionnaire (IEQ). I encourage you to access the robust website MyMedicare.gov, where you can complete the IEQ, view your eligibility information, track your health care claims and check your deductible status. There are four different parts of Medicare coverage:, --Part A covers hospital services and skilled nursing facility stays of up to 100 days, as well as home health care and hospice care. All eligible people get Part A and most receive the coverage \"premium free\"; others pay a premium of up to $407 per month. --Part B covers doctor visits/outpatient services/lab work/preventative services. If you earn less than $85,000 individually ($170,000 jointly), your monthly premium is $104.90. Premiums rise with income, topping out at $335.70 (for those earning over $214,000 individually and $428,000 jointly), --Part C consists of Medicare Advantage Plans, private insurance alternatives to Original Medicare Plans. --Part D covers prescription drugs. If your income is above a certain limit, youll pay an income-related monthly adjustment amount in addition to your plan premium, up to a maximum of $70.80. While Medicare covers a large swath of health care costs, you are on the hook for premiums, deductibles, coinsurance and copayments, unless you qualify for a low-income program, like Part Ds \"Extra Help\" and state assistance for Part B premiums and other costs. If you want to attain coverage for out-of-pocket expenses, you can purchase Medicare Supplemental Insurance (\"Medigap\"), which is sold by private insurance companies. Speaking of gaps, there are a few categories of care that the Medicare system does not cover, including: long-term care; routine hearing, vision, foot and dental care; and medical services provided outside of the United States. THE NUMBERS: In 2014, net Medicare spending was $505 billion, accounting for 14 percent of the federal budget. Medicare is funded primarily from three sources: general revenues (42 percent), payroll taxes (39 percent) and beneficiary premiums (14 percent), but the current system has big financial issues. According to the 2015 Trustees of the Social Security and Medicare trust funds report, \"the Medicare Hospital Insurance (HI) Trust Fund will be depleted in 2030. ... At that time dedicated revenues will be sufficient to pay 86 percent of HI costs.\" (Current law provides funding for the other parts of Medicare, which is why the analysis focuses on the hospital side.), The problem with the Medicare system is easily diagnosed: Although the pace of health care spending has slowed over the past five years, its still projected to balloon due to an aging population, as well as a bloated payment system. The bitter pills offered to fix the system include: charging higher Medicare premiums for those able to afford them, raising the age of eligibility and increasing cost-sharing by beneficiaries to deter unnecessary use of medical care. Considering that the Kaiser Family Foundation recently found that by two-to-one margins, people of all political persuasions favor preserving Medicare in its current form, as opposed to replacing it with vouchers or other forms of premium support, most experts believe that Americans will have to swallow a cocktail of medicines to cure the disease. (Contact Jill Schlesinger, senior business analyst for CBS News, at askjill@JillonMoney.com.), (c) 2015 Jill Schlesinger Distributed by TRIBUNE CONTENT AGENCY, LLC]", "Date": "20150729", "Author": "[Jill Schlesinger, Tribune Content Agency]", "Link": "http://www.chicagotribune.com/business/sns-201507291830--tms--retiresmctnrs-a20150729-20150729-story.html", "Title": "[Medicare at 50 years: Popular, but needs bolstering]"}