{"Content": "[Chicago Public Schools officials will not offer teachers an additional year on their current contract, saying the district cannot afford a built-in 3 percent pay hike. \"We were optimistic that solutions to the Boards structural financial challenges would have been achieved by now and a well-deserved increase for CPS staff would have been possible,\" interim district chief Jesse Ruiz wrote in a letter to Chicago Teachers Union President Karen Lewis on Thursday. \"Regrettably that is not the case.\", The districts decision means negotiations will continue to replace a deal that expires June 30. \"In the coming weeks, we hope to work with you on the most pressing fiscal issue facing CPS the continued inequity in pension funding,\" Ruiz wrote. \"CPS students and Chicago taxpayers continue to carry the burden of this inequity, and it has come at a great cost. In the coming weeks, we hope you will join us in Springfield on working to reform this inequity.\", Under a provision in the current agreement, the Chicago Board of Education could have proposed an extension of the existing contract through June 30, 2016, with a minimum 3 percent pay boost. The union would have had 30 days to accept or reject such an offer. The 3 percent hike would have cost the district an additional $105 million, according to district spokesman Bill McCaffrey. In the letter to the CTU, Ruiz wrote: \"Our financial challenges are well known, and while the Board of Education recognizes that CPS teachers and staff have worked extremely hard during the last three years, and our students have achieved great academic success as a result of these efforts, the Board unfortunately cannot extend this contract.\", The CTUs Lewis said the districts move shows how little teachers are valued by the district. She also poked at the scandal enveloping CEO Barbara Byrd-Bennett, who is on paid leave amid a federal investigation into a $20.5 million no-bid contract the district gave to a firm for which she formerly worked. \"It would have behooved the Board to offer a fourth year of the contract, because in light of recent events, thats a group that needs as much good news as possible right now,\" Lewis said in a statement. \"By refusing to offer a 3 percent raise, the Board is clearly letting educators know that it doesnt place even a modicum of value on the work done in schools every day for the children and families of the city of Chicago.\", Lewis called the districts financial muddle a problem of its own making, citing the contract to SUPES Academy that has interested federal investigators as well as overruns on a janitorial contract. While Lewis statement indicated the union would have been happy to accept an extension, CTU Vice President Jesse Sharkey earlier this week said leadership wasnt sure it would go for one if it were offered. \"Money is not our memberships biggest concern right now,\" Sharkey said. The unions current contract was reached after a seven-day strike in 2012. Talks this time around were slowed by the runoff election between Mayor Rahm Emanuel and Jesus \"Chuy\" Garcia, Lewis hand-picked candidate. The union used the election to air contract demands that included limits to class sizes, increases in teacher preparation time, a reduction of paperwork mandates and additional school counselors and nurses. Decades of borrowing and delayed pension payments have put the district in a $1.1 billion hole. The district is faced with an array of difficult options that are playing out against Gov. Bruce Rauners efforts to rein in pension obligations and labor unions. Sharkey said a pay increase isnt necessarily the primary issue if teachers are faced with layoffs, additional school closings or diminishing resources. \"If the district has no money to put a counselor in a school where a half-dozen kids get shot, or not enough money to have the counselor whos there actually counsel, then they dont have the money for a 3 percent raise, do they?\" he said. jjperez@tribpub.com, Twitter @PerezJr]", "Date": "20150430", "Author": "[Juan Perez Jr.]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-cps-teachers-contract-met-0501-20150430-story.html", "Title": "[ Chicago schools decline to offer extra year on teachers contract]"}