{"Content": "[Hillary Rodham Clinton is in \"excellent physical condition and fit to serve as president,\" her physician declared Friday just one in a flood of disclosures about the Democratic presidential candidate pushed out by her campaign on a busy summer day. Within a three-hour period, the State Department made public more than 2,200 pages of emails sent from Clintons personal account, her campaign released the information about her health and she unveiled eight years of tax returns. Meanwhile, Clinton herself was campaigning at the annual meeting of the National Urban League and calling for an end of the nations trade embargo of Cuba during a speech in Miami. Friday was also the deadline for super PACs to file their first financial reports of the 2016 campaign with federal regulators, revealing the names of a slew of billionaires and millionaires paying for the early days of the election fight. Campaign aides cast the records dump as part of an effort to compete with Republican presidential candidate Jeb Bush on the issue of transparency. Clinton is the first 2016 presidential candidate to release her health records, and aides said she planned to release more details about her finances than Bush, the former Florida governor who has already made public 33 years of his tax returns. The Clintons paid nearly $44 million in federal taxes and made almost $15 million in charitable contributions from the tens of millions the couple earned between 2007 and 2014, according to her campaign. Last year, they paid an overall federal tax rate of 35.7 percent. The couple earlier reported having earned more than $30 million from speeches and book royalties since mid-2013, In a statement, Clinton emphasized that she came into her wealth later in her life an effort to draw a distinction with Bush, the scion of a rich political family. On the campaign trail, she frequently mentions her middle-class upbringing in a Chicago suburb and the loans she and former President Bill Clinton used to fund their education. \"Weve come a long way from my days going door-to-door for the Childrens Defense Fund and earning $16,450 as a young law professor in Arkansas and we owe it to the opportunities America provides,\" she said. Bush has earned nearly $28 million since leaving the Florida governors mansion in 2007 and paid an effective federal income tax rate of roughly 36 percent in the past three decades, according to tax returns released by his campaign last month. Hes said he paid a higher rate than the Clintons, though he earned less income. Both candidates are in the top 1 percent of taxpayers, who paid an average of 30.2 percent between 1981 and 2011, according to figures from the Congressional Budget Office. The average for middle-income households in that time was 16.6 percent. The financial release came just hours after Dr. Lisa Bardack, an internist and chairman of the Department of Medicine at the Mount Kisco Medical Group near the candidates suburban New York home, publicly detailed Clintons health in a two-page letter. The report said Clinton, who is 67, has fully recovered from a concussion she sustained in December 2012 after fainting, an episode that Bardack attributed to a stomach virus and dehydration. During the course of her concussion treatment, Clinton was also found to have a blood clot and was given medication to dissolve it. She remains on the medicine as a precaution, Bardack wrote. The blood clot, which was in a vein in the space between the brain and the skull behind the right ear, led Clinton to spend a few days in New York-Presbyterian Hospital and take a month-long absence from the State Department for treatment. Republican strategist Karl Rove later cast the incident as a \"serious health episode\" that would be an issue if Clinton ran for president, fueling a theory the concussion posed a graver threat to her abilities than Clinton and her team let on. Bardack said testing the following year showed \"complete resolution\" of the concussions effects, including double vision, which Clinton wore glasses with special lenses to address. According to her doctors assessment, Clintons cholesterol and blood pressure are in normal, healthy ranges, and she has had the major cancer screenings and exams recommended for someone her age. She has a very common thyroid condition and seasonal allergies, and takes a blood thinner Coumadin as a precaution since her fall and the blood clot. There was no mention of Clintons height or weight. \"Theres no red flags there,\" said Dr. Mark Creager, director of the Dartmouth-Hitchkock heart and vascular center in Lebanon, New Hampshire, and president of the American Heart Association. The doctor noted that Clintons father lived into his eighties and her mother into her nineties. She has two brothers, and one had premature heart disease. Due to that family history, she had full cardiac testing, including an ultrasound exam of arteries in her neck, and all was well. Clintons doctor said she exercises regularly practicing yoga, swimming, walking and weight training and eats a diet rich in lean proteins, vegetables and fruits. She does not smoke and drinks alcohol \"occasionally,\" Bardack wrote. Associated Press]", "Date": "20150731", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-clinton-tax-health-records-20150731-story.html", "Title": "[ Clinton releases tax, health records on busy Friday ]"}