{"Content": "[By mid-morning, the line of taxpayers outside the IRS center stretched along the marble wall, past the elevators and water fountain, all the way back to the metal detectors near the entrance of the Earle Cabell Federal Building. Andrew Concha emerged from the office holding a purple sign. He checked his watch 11:04 a.m. then calculated how many people could be seen before the tax assistance center closed at 4:30 p.m. He placed the sign behind the 17th customer, signaling to the other 30 or so in line that their chance of seeing a specialist that day was slim. \"Im not technically turning them away yet,\" Concha explained. \"Im letting them know it may not be in their interest to wait three to four hours to see someone.\", With Tax Day approaching, it was the best the IRS could offer. Five years of budget cuts by Congress have left the agency so cash-strapped that IRS Commissioner John Koskinen doesnt bother sugarcoating the state of customer service. \"Its abysmal,\" he said. Nationwide, only 4 in 10 callers to the agencys toll-free help line are getting through to a real person. The number of courtesy disconnects a euphemism for an overloaded system hanging up on the customer has reached 5 million, up from 200,000 last year, the agency reported. When callers do get off hold, they can forget about asking questions that require real expertise. These are now considered \"out of scope.\" The call-center staff members have been instructed to only tell callers what tax forms they need, where to get them and where to look for online information. No longer can staff offer line-by-line assistance, provide guidance on tax planning or tax law, or help make payment arrangements. Taxpayers who file paper forms will get refunds later than usual. And with 5,000 fewer agents to go after tax cheats than four years ago, officials estimate that $2 billion in revenue will go uncollected. At the Dallas tax assistance center, theres an empty space where the office printer sat before it was yanked out. The maintenance contract was too expensive. The shelves in the Forms Room are mostly bare. The 40-page P-17, the bible of tax-return preparation, now costs $23 and must be ordered online. Overcrowding at the Dallas center came to a head in February when the fire marshal showed up and notified its manager, Johnny Holiday, that he couldnt have customers sitting on the floor and blocking exits and walking space. So now, no one gets in the door unless the person has a seat in one of the 40 chairs in the waiting area. Late last month, Holiday had to call security officers when a man lunged at an employee, cursing, after waiting two hours to drop off documents for an audit. Holiday spends his time devising strategies to bring order to an office that, being the IRS, should thrive on order. Twenty minutes before the doors open at 8:30 a.m. on a recent morning, hes making sure that the Line Elimination Team is in place. Its job is do triage on the line, pulling customers out of the queue who have straightforward requests, like asking to make a payment or to get a copy of an old return. Staff members move along the line, handing out paper tickets like at the deli counter, asking customers in Spanish why they were here. This task takes three of his specialists. That leaves only eight others to meet with taxpayers and answer their questions. As money has gotten tighter, the demands have grown. Two years ago, another walk-in center in DeSoto, 16 miles south of Dallas, closed, leaving the IRS office in the Earle Cabell building to absorb the business. With its gray carpets, dropped ceilings with fluorescent lights and keypad-coded doors five blocks from where John F. Kennedy was shot, the Earle Cabell building is a monument to a time when there was more optimism about the federal government. Since 2010, Republicans on Capitol Hill have slashed the IRS budget by $1.2 billion, about 17 percent adjusting for inflation. Just this fiscal year, $346 million was cut. By contrast, cuts across the rest of the government have been far more modest and concentrated between 2012 and 2014. During that two-year period, automatic spending reductions shrank non-defense spending, as adjusted for inflation, by 1.3 percent, while IRS spending was chopped 5.6 percent, according to Scott Lilly, budget expert at the Center for American Progress. Even in an era of shrinking government, conservatives antipathy toward the tax collection agency stands out. It is punishment for a string of missteps an extravagant conference for employees in Anaheim, California, the targeting of conservative groups seeking tax exemptions, and $1 million in bonuses given to agency employees who didnt pay their federal taxes. \"We deliberately lowered IRS funding to a level that will make the IRS think twice about what youre doing and why youre doing it,\" Rep. Ander Crenshaw, R-Fla. who chairs the House panel that sets the agencys budget, said at a hearing last month. The IRS should \"focus on core missions providing taxpayer services.\", Leslie Paige, vice president for policy and communications at Citizens Against Government Waste, said every government agency could sustain deep cuts and in particular the IRS. \"I think taxpayers and their representatives need to think long and hard about throwing more money at an agency that has proven that it persistently mismanages and wastes the money they have gotten in the past,\" she said. As funding has declined, the agencys workload has grown. The IRS is helping to administer subsidies and compliance under President Barack Obamas health-care law and deal with other new wrinkles in the tax code. The agency is also battling an epidemic of identity theft and new, sophisticated cheating schemes. Since the budget cuts, the agency has processed 11 percent more returns, the IRS said. Koskinen, hired to restore trust in the IRS, is also looking for money to upgrade a system that still runs on COBOL, the computer language that debuted half a century ago. He needs more revenue agents. In Dallas, they only go after people whove cheated the government out of $1 million or more. \"At this point it is a little frustrating when people say, We keep cutting your budget so youll be more efficient, \" Koskinen said. When Jerry Reed, a beaten-down taxpayer, finally made it to a cubicle inside the Dallas center, Andrew Concha apologized for the long wait. Reeds tax return had been flagged by the IRS because it reflected a refund of more than $10,000. Agency officials suspected that Reed was a victim of identity theft. In reality, Reed was due the refund because he had taken a large business loss when his consulting business failed. He tried to resolve the confusion online but couldnt figure how to proceed. He called the toll-free line, waited on hold for 90 minutes and hung up. Then he drove to the federal building one day after work, but he was too late to get a ticket. In the past, IRS employees would work as late as midnight during tax season, but now, with the elimination of overtime pay, they go home at 4:30 p.m. \"Because of the cuts, people have really lost patience with us,\" Concha said. In the high-rise building next door, money ran out for seasonal employees a full month before the April 15 deadline, and they were sent home, leaving 200 empty cubicles, agency officials recalled. So at the Dallas call center one of 25 answering questions from coast to coast only 450 employees were left to field the flood of calls during tax season. \"They know the minute we say, Im going to have to transfer you to someone who can answer your question, theyre going to be on hold for a number of hours,\" said Donna Miller, an agent on detail with the local chapter of the National Treasury Employees Union. On a recent morning, a loudspeaker in the call center invited all employees to Room 212 at 1 p.m. for a retirement party for a woman named Peg. Peg was not being replaced because of an IRS hiring freeze. It has fallen to Chris Caroll, the operations manager, to buck up his beleaguered staff. Bald with a goatee, he walks the seven floors of cubicles every day, urging employees to email, call and knock on his door if they need to talk. \"We knew we had to be empathetic versus the typical management style,\" he said. Yet he cannot even order them calendars, calculators, or rulers. Back downstairs, in the lobby outside the taxpayer assistance center, taxpayer Laurence Zeigler had figured out that he wouldnt get to see anyone at the IRS on this day. All he needed, he said, was to give them his correct address. Near the exit, his credentials in a faded gray folder that long ago carried his vo-tech diploma, he vented to a friendly security guard. \"Man, I just got laid off,\" he said. \"Its like, I really need that money.\" His $400 refund had been held up by an incomplete return. \"I would just call them,\" the guard offered. Waiting on hold did not sound like a great idea to Zeigler. Concha came back out to check on the line. \"If you get in this line, the wait will be two hours,\" he announced. \"If you get inside, it will be another two hours.\", \"Did you say, another two hours?\" someone called out. It was Kim Garrett, on her fifth visit to clear up the matter of her Social Security number, which she said the IRS didnt have. \"You cant call,\" Garrett said, to anyone who would listen. \"You cant get online, and you cant see anybody. What are your options?\", The others in line nodded in agreement. ]", "Date": "20150407", "Author": "[Lisa Rein]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-irs-budget-cuts-customer-service-20150407-story.html", "Title": "[IRS helping hand hard to get after budget cuts]"}