{"Content": "[Mayor Rahm Emanuel faces a difficult path in his effort to forge a \"grand bargain\" to steady Chicago Public Schools finances. He needs broad buy-in from state legislators and the Chicago Teachers Union to reshape the law and win contract concessions that would free up cash. He needs an agreement with the Chicago Teachers Pension Fund to put off next years massive pension payment. And Emanuel also will have to navigate the treacherous politics of a property tax hike, a key component of the proposals he laid out this past week as he outlined $200 million in CPS budget cuts. Putting the pieces of a plan in place will play out over months, a City Hall source said. \"The expectation is not that well be in Springfield next week and every single piece of this framework gets done,\" said the source, who is familiar with City Halls discussions with Springfield. \"Were very well aware that itll require tremendous effort and time. Were talking about elements that would be watershed changes with the state, like changing the (school) funding formula, that are not easy conversations.\", Emanuels \"Plan A\" would be for the state to cover all of CPS pension costs, as it does for every other school district in the state. That could be tougher to sell to legislators and CTU leaders. \"Plan B\" is more complex but potentially easier to sell to lawmakers in a piecemeal fashion. It includes the property tax hike to help pay for pensions and an effort to get state government to pick up annual CPS pension costs of about $200 million. Emanuels proposed property tax increase would add a levy solely to fund pensions. Former Mayor Richard M. Daley redirected funds from a similar levy to operations when he took over the schools in 1995. If that levy had been in place this year, it would have generated about $169 million for the teachers pension fund, according to an estimate provided by Cook County Clerk David Orrs office. Increasing the districts property taxes to provide money for the pension fund would require the state to lift the CPS property tax cap, which limits the annual total property tax increase to 5 percent or the rate of inflation, whichever is less. Lifting that cap was part of legislation proposed this past week by Senate President John Cullerton, D-Chicago, an Emanuel ally. Although that bill went nowhere, elements of it could be resurrected at a later date. In exchange for securing additional property tax money for pensions, Emanuel wants teachers to cover the full cost of their own pension contributions. The Chicago Teachers Union called that a reversal on understandings reached in ongoing contract negotiations. For years, the city has picked up all but 2 percent of the 9 percent contribution required of teachers. The budget cuts announced this past week were largely blamed by the mayor and school officials on a $634 million pension payment the district made good on last Tuesday. In a bid for future relief from such massive payments, schools officials are looking to negotiate the consequences of late payments to the teachers pension fund. In exchange for extra time to make a portion of its pension contribution, CPS has offered to pay the fund 7.75 percent interest on the late payment, pension fund Executive Director Charles Burbridge said Thursday. The district would also make its contributions to the fund on a monthly basis instead of annually. Burbridge said CPS would back that offer with a \"proposed security interest in their property.\" That means the fund could essentially repossess CPS property and charge rent to the district for its use if the school district didnt pay whats due. \"Theyre signaling to us a year in advance that theyre going to miss a payment,\" Burbridge said. \"Thats really what this gets down to, is what recourse will we take in the event of a missed payment.\", Burbridge said the fund rejected an earlier proposal that would have given it a security interest in shuttered CPS properties that the district has struggled to sell. The Emanuel administration also has discussed the possibility of enacting a CPS capital improvement property tax that would raise an extra $50 million a year that is not subject to the property tax cap. That would require both the approval of the City Council and the Chicago Board of Education. Although that $50 million would have to be spent on construction or debt payments, it would free up money that could be spent on other items. If both the pension tax and capital improvement tax had been in place this year, the district would have raised an additional $219 million. The two taxes would have meant a property tax increase of about $208 for the owner of a $250,000 home, the clerks office estimated. Such a tax increase would run counter to Emanuels narrative of holding the line on property, sales and gas taxes which was a frequent refrain in his re-election campaign this year, despite four successive CPS increases to the maximum allowed under the cap during the mayors first term. The two new taxes would produce a far bigger hit on taxpayers than theyve seen in recent years. But the timing could make such a hike palatable politicians often propose large tax increases as soon as possible after an election, with the hope that voters will largely have forgotten by the time the next election rolls around. The portion of CPS pension payment Emanuel wants the state to cover amounts to roughly one third of the districts total contribution. It is the amount the district pays to cover pension and health benefits earned by its employees in any given year. The bulk of CPS pension payments this year and in the foreseeable future make up for years of so-called \"pension holidays,\" when the district got a break from its required contribution. That underfunding which included an entire decade when CPS made no pension contributions under former Mayor Richard M. Daley has forced the district to pay hundreds of millions of dollars extra every year in accordance with a plan to reach a state-mandated funding level of 90 percent by 2059. This past Thursday, in another confirmation of CPS precarious financial situation, a major rating agency downgraded the districts debt to two notches above junk status. Standard & Poors, the last agency still maintaining an A-level rating for the school district, noted that CPS had to borrow to make its massive pension payment this past week, which illustrates the \"severity\" of the districts budget woes. The agency noted that the board faces \"many challenges\" in its efforts to restore financial stability. jjperez@tribpub.com, hdardick@tribpub.com, hgillers@tribpub.com, Twitter @Perez Jr. Twitter @hgillers, Twitter @reporterhal]", "Date": "20150703", "Author": "[Juan Perez Jr., Hal Dardick, Heather Gillers]", "Link": "http://www.chicagotribune.com/news/ct-chicago-school-finances-met-0705-20150703-story.html", "Title": "[Mayor Emanuel faces tough trek toward 'grand bargain' for shoring up CPS]"}