{"Content": "[Chris Christie bills himself as the candidate willing to speak the truth even if his audience doesnt want to hear it. Opening his talk at Becks Sports Grill, he wastes no time inviting a negative reaction. \"The last time I was here was to go to the UNI-Dome,\" he recalls, referring to the University of Northern Iowas nearby football venue. \"Mary Pat and I are alums of the University of Delaware.\", At this point, those present drown him out with groans in bitter memory of the Blue Hens elimination of the Panthers in the Football Championship Subdivisions 2007 playoffs. His slogan is \"Telling It Like It Is,\" and the rest of his presentation is also risky with the crowd of 150, which has plenty of white hair. Christie promotes his plan for entitlement reform which includes raising the Social Security retirement age, means-testing pensions, reducing cost-of-living adjustments and raising Medicare premiums for well-to-do seniors. People warn that entitlement reform \"is the third rail of American politics: You touch it and you die,\" he notes. \"Well, heres what were doing: Were hugging it.\", Its the sort of appeal that reminds people why Christie got a lot of entreaties to enter the presidential race four years ago: his reputation for unvarnished candor and a willingness to take on hard issues and powerful interests. Another part of his pitch is devoted to assailing Barack Obama, particularly for the nuclear deal with Iran, which the candidate calls \"the worst thing that has happened in foreign policy in recent memory\" suggesting Christie has forgotten the Iraq War. \"He lied to us,\" he charges. This attack is not supposed to revive but erase memories memories of the aftermath of Hurricane Sandy just before the 2012 election. Then, as The New York Times reported, Christie \"locked arms with Mr. Obama, flew with him on Marine One, talked with him daily and went out of his way to praise him publicly.\", Republicans seethed at this breach of partisan etiquette, and some of Mitt Romneys aides blamed Christie for the election outcome. Christie intends to leave GOP voters with no doubt that he holds \"this president,\" as he invariably refers to Obama, in the contempt he deserves. Christies ideas on how to deal with the Iranians amount to spurning any agreement until the other side capitulates an approach that was tried by Obamas immediate predecessor, without success. Aside from dramatizing his ostensible toughness, they serve to exhibit a fluency in national security and foreign affairs that many governors lack. His problem this year is not a lack of assets. He is nimble on his feet, knows the issues adequately and has a flair for distilling complex matters into simple choices. He has a sense of humor that he deploys without strain. Hes even lost 100 pounds thanks to lap-band surgery. His chief problem is that hes been usurped by other contenders in the GOP race. The brash truth-teller role has been filled by Donald Trump. The scourge-of-public-employee-unions mantle has fallen on Scott Walker. The establishment favorite who can appeal beyond the base? Jeb Bush. Christie also carries a whiff of scandal: the 2013 closing of lanes on a major bridge to punish the mayor of Fort Lee for not endorsing him. Two of the governors allies have been indicted, and another, who said Christie knew about the retaliation while it was going on, pleaded guilty. Christie denies it, and prosecutors have not implicated him. But that episode and his aggressive personality have taken a toll even with hardened New Jerseyans, only 30 percent of whom have a favorable opinion of him. Here, one woman prefaces a question by identifying herself as a public school teacher then says, \"Please dont hit me.\", After listening to her question about how his \"pro-life\" principles square with his policies on education, he bristles: \"You definitely do not need to lecture me about what pro-life means.\" But thats about the only reminder that when provoked, Christie can be rude and overbearing. (He once insisted, \"I am not a bully.\"), Today, he does nothing to put off these polite Midwesterners, who swarm him afterward seeking handshakes and photos. Christie can leave knowing hes given them sound reasons to consider his candidacy. And he didnt hit anyone. Steve Chapman, a member of the Tribune Editorial Board, blogs at www.chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150805", "Author": "[Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-chris-christie-iowa-perspec-0806-20150805-column.html", "Title": "[Chris Christie in Iowa: Jersey brash meets Midwest nice ]"}