{"Content": "[Republican presidential candidateJebBushearned $7.4 million in 2013 and has paid an average federal income tax rate of 36 percent over the past three decades, according to tax returns released by his campaign on Tuesday. Bushdisclosed the returns on a website that outlines his work history since 1981, including the years since the two-term Florida governor left office in 2007. In that period,Bushhas served on numerous corporate boards and has seen his income rise sharply. His income in 2013, the year covered by the most recent tax return released, included $5.8 million in consulting and speaking fees. A year earlier,Bushreported just under $6 million in total income. His income in both years was up sharply from what he made in the years before his election as Florida governor in 1998 and during his eight years in office. Bushsaverage federal tax rate puts him in the top 1 percent of taxpayers, who paid an average of 30.2 percent between 1981 and 2011, according to figures from the Congressional Budget Office. The average for middle-income households in that time was 16.6 percent. Presidential contenders are required to file financial disclosure forms within 30 days of announcing their candidacy.Bushhas yet to release his and has requested a 45-day extension to do so, said spokesman Kristy Campbell. But those records reflect only sources of income, transactions, assets and liabilities, and the same information for their spouses. The figures are also categorized in wide ranges, such as $5 million to $25 million. Tax returns are much more detailed, and it has become customary in the past several decades for presidential candidates to make them public. \"At this point, its a political requirement, if not a legal one,\" said Joseph Thorndike, director of the Tax History Project, a group that has collected tax forms for presidents and top presidential candidates since 1995. Bushsdisclosure sets him apart from other candidates, past and present, on multiple fronts. No other candidate has released as many returns asBush. The closest was Bob Dole, the 1996 Republican nominee, who released 29 years of his income tax returns. In 2004, Democratic nominee John Kerry disclosed 20 years of such records. Bushstax returns also show he paid a dramatically higher federal tax rate on average than that paid by the GOPs 2012 nominee, Mitt Romney, over roughly the same time. Romney was hammered by critics for refusing to release more than two years of his tax returns. Romney instead released a letter from his tax advisers offering a summary of his tax liability for a 20-year period. Among other things, the letter described his charitable giving and the range of his effective federal tax rates. Romneys average tax rate: 14 percent. Bushis the first of the nearly two dozen major candidates for president in 2016 to release tax returns. But Ron Weiser, a former finance chairman at the Republican National Committee, saidBushsactions are aimed not at his competition for the GOP nomination but at Democratic front-runner Hillary Rodham Clinton. \"WhatBushreports having made is likely much less than what Hillary Clinton has made, and shes portraying herself as for the little guy,\" Weiser said. The Clintons have had earnings exceeding $30 million combined in speaking fees and book royalties since January 2014, according to the personal financial disclosure Hillary Clinton filed in May. The report showed the couple amassed more than $25 million in speaking fees and Hillary Clinton earned more than $5 million from her 2014 memoir, \"Hard Choices.\", Clintons earning since 2014 put the couple in the top one-tenth of 1 percent of all Americans. In the online posting,Bushcites, \"One fun fact I learned in this process: I have paid a higher tax rate than the Clintons even though I earned less income.\", BushsRepublican rivals did not indicate when their tax returns might be made public. Florida Sen. Marco Rubios team, for one, said his returns will come out but declined to say when. According to previously released financial disclosures,Bushleft the Florida governors office less wealthy than when elected. The decline in his net worth, from $2 million in 1998 to less than $1.3 million in early 2007, came largely from a diminished investment portfolio. Bushalso earned less as governor $129,000 his last year in office than he did in the private sector, where he had been paid $755,000 annually by a development company in Coral Gables, Florida, before taking office. Since leaving the public sector,Bushhas served on the boards or as an adviser to at least 15 companies and nonprofits, earning at least $3.9 million from four companies alone since 2007.Bushwill be required to detail such pay for 2014 within dollar ranges when he files his personal financial disclosure. That document will detail how much individual companies, such as Barclays Capital or the Barrick Gold Corp. paidBushas an adviser. Instead, his corporate pay is lumped together in Tuesdays disclosure under the heading of \"consulting and speaking.\", Campaign spokeswoman Allie Brandenburger saidBushsdecision to release the tax returns was \"consistent with the high level of disclosure he has practiced during his life in public office.\", In February,Bushreleased more than 275,000 emails that were sent to and from his private email account during his time as governor. Associated Press]", "Date": "20150630", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-jeb-bush-tax-returns-20150630-story.html", "Title": "[Since 1981, Jeb Bush paid an average tax rate of 36 percent ]"}