{"Content": "[Ald. Carrie Austin had started to list Mayor Rahm Emanuels top accomplishments when she stopped and looked up in frustration at the crowd assembled to show the African-American communitys enthusiasm for the mayors re-election. \"Let me say that again. Yall aint clapping!\" Austin, 34th, snapped at about 150 mostly middle-aged and middle-class business, religious and government leaders gathered last month in a Near North Side gym. A subdued Emanuel then spoke, recalling the \"tough things\" hes done so kids could avoid \"broken lives and broken dreams\" and praised the involvement of parents who have lost children to gun violence. \"I dont think Id have that generosity of soul and spirit,\" he said. \"Id be wound up around an axle with anger.\", Emanuel finished to tepid applause. The mayors young political director sprung to the podium, shouting the call of \"Four more years!\" into the microphone. The crowds half-hearted response sputtered out after a few chants. The mayor quickly shook a half-dozen hands and made a break for the back door exit, where he dodged a throng of photographers with cameras and reporters with questions. The weekend rally illustrated a political truth for Emanuel: Its harder the second time around. Every time he makes a decision as mayor, someones left unhappy. And as mayor during tough times, Emanuel has made a lot of them. Hes closed schools, raised taxes and fees, and tried to staunch an unrelenting violent crime problem. Along the way, his polarizing style has turned off more than a few Chicagoans. Against that backdrop, Emanuels campaign strategy has been to play it safe: sand off the rough edges through millions of dollars in TV ads, stick to a disciplined message centered on his accomplishments, and portray himself as the composed adult in the room amid a field of challengers with lesser political pedigrees and far less campaign cash. That Emanuel will finish first Feb. 24 is in little doubt. But thats not the benchmark. Hes running to avoid the national political embarrassment that would result if hes unable to secure a majority and finds himself in an April 7 runoff election. \"I think the mayor is basically running against himself, and hes running against the decisions hes made,\" said Ald. Roderick Sawyer, 6th, who isnt supporting a candidate in the mayors race. \"People arent as excited about him as they might have been before, but theres still a substantial number of them who look like theyre willing to give him another shot.\", The mayors TV blitz has led to his job approval rebounding slightly in a Chicago Tribune poll last month, but overall voters continue to disapprove of his handling of education, crime and neighborhood economic development. Emanuel has chalked up much of that unpopularity to inheriting a city \"that was at the brink\" with massive budget deficits, woefully unfunded pension plans and a broken school system. \"The status quo was failing the city of Chicago, failing the residents, and jobs, families and companies were leaving. I promised we were going to make change,\" Emanuel said during last weeks final debate. \"The core part of politics is about leading, not about popularity. Leading requires telling people the truth, the hard truth and doing the necessary things.\", During the past year, Emanuel repeatedly has declined Tribune requests to discuss how he runs City Hall, raises campaign money and conducts his re-election bid. Emanuels hardest truth remains his decision to close 49 elementary schools and one high school program. His hand-picked Chicago Board of Education argued the schools needed to be shuttered because they were underenrolled and would save Chicago Public Schools much-needed money. When asked about the closings, Emanuels standard response is that it was the most difficult decision hes had to make, but the kids are getting a better education at their new schools. The mayor has spent more time touting his other education policies: securing full-day kindergarten for all, pushing for expanded pre-kindergarten for low-income families and unveiling a program he says will provide full-ride scholarships at any of the City Colleges for CPS students who graduate with a B average. Hes had wins outside of education too. Emanuels decision to shut down the Red Line South for four months to speed up its $425 million reconstruction has paid off with dramatically decreased travel times. Hes now moving forward with a four-year revitalization of the Blue Line, though hes not completely shutting it down to get the work done. Hes also won $70 million in federal funding to bring a high-tech manufacturing center on Goose Island thats supposed to be bolstered by an additional $250 million in private money from Illinois corporations. Although progressives say he was a late convert to the cause, in December Emanuel won approval of a gradual increase of Chicagos minimum wage to $13 an hour by 2019. Other proposals have been more controversial. The mayors use of $55 million in tax money to develop an entertainment and hotel complex centered on a South Loop arena for DePaul University basketball has drawn the ire of critics who argue the money should have been spent on education or in neighborhoods in more dire need of economic development. Some of Emanuels big splashes also have turned out to be busts, including his Chicago Infrastructure Trust. The mayor brought former President Bill Clinton to town to unveil the quasi-governmental agency that aims to leverage private investment in public works projects. Nearly three years later, the trust has done little. The city and school district face huge budget holes and major pension funding shortfalls that will come due in what would be the mayors second term. Other than not ruling out a property tax increase, Emanuel has offered almost no specifics on how he would resolve the money problems, saying voters should look at his track record. \"We balanced four budgets in a row without a property, sales or gas tax increase, four years in a row we put money back into the rainy day fund and four years in a row we increased our investment in after-school, summer jobs and early childhood,\" Emanuel often says. What he doesnt mention is that during his first term, hes increased phone, parking, vehicle, cable, water and sewer fees, installed ticket-issuing speed cameras and raised CPS property taxes by the maximum amount in each of the last four years. Emanuel also has had some missteps in his administration. After the Tribune reported he charged taxpayers for trips that included political events or featured little to no city business, Emanuel repaid the city nearly $22,000, including the tab for an $1,800-per-night hotel room for President Barack Obamas second inaugural. Another Tribune investigation found about 60 percent of the mayors roughly 100 top donors who have contributed $14 million to his campaign received some benefit from his administration. All four challengers have accused Emanuel of running a pay-to-play administration. The mayor hasnt explained why so many of his elite campaign contributors have received city contracts, city development approvals, pension and legal work, and help with federal regulators. Instead, Emanuel offers general statements about changing the ethics culture at City Hall. The mayor has continued to pile up campaign cash. Since Jan. 1 alone, hes raised $1.3 million, part of more than $15 million hes collected for his re-election. Thats about four times more than what Cook County Commissioner Jesus \"Chuy\" Garcia, 2nd Ward Ald. Bob Fioretti, businessman Willie Wilson and perennial candidate William \"Dock\" Walls have raised combined. While Emanuel continues to be a prodigious fundraiser like he was in his first run for mayor, how hes campaigned has changed. Four years ago, Emanuel was often out at elevated train stops and businesses with cameras and reporters in tow, but this time around that access is restricted to tightly orchestrated campaign events. Those who attend are carefully vetted to ensure no protesters gain access. Campaign spokesman Steve Mayberry insisted Emanuel regularly campaigns with regular Chicagoans, \"often centered around home visits.\", Emanuel \"interacts with Chicago residents in public spaces ... at least five times per week,\" Mayberry said. Evidence of such interactions usually only surfaces afterward with a photo on social media showing Emanuel shaking someones hand at an \"L\" stop or in a grocery store. The mayors aides declined requests to accompany him while he did such campaigning. Ald. Walter Burnett Jr. said he attended a meet-and-greet lunch last week where Latino supporters brought their undecided friends to hear Emanuels re-election pitch. \"They made their case for them, and then he was meeting all of their friends, and just like everywhere I go with this guy, people couldnt wait to meet him,\" said Burnett, 27th, who is backing Emanuel for re-election. Four years ago, Burnett said he was neutral in the mayors race. But this time, along with others in the citys political establishment, hes squarely behind Emanuel. The same goes for U.S. Rep. Luis Gutierrez, Ald. Edward Burke, and U.S. Rep. Bobby Rush, each of whom supported other candidates four years ago. Campaign operatives say House Speaker Michael Madigans political army also is laying get-out-the-vote groundwork for the mayor. Emanuel also has President Barack Obama in his corner. Last time out, Emanuel ran a TV ad with a clip from an Obama news conference in which the president wished Emanuel well on leaving the White House. This time, Obama has offered a formal endorsement, cutting a radio ad in which he tries to turn a potential Emanuel weakness into a strength: \"Lets be honest, at times the guy can be a little hardheaded, but theres a reason Rahm fights as hard as he does he loves our city.\", Obama will lend another assist to Emanuel on Thursday, when hell travel to Chicago five days before the election bearing a gift for the mayors campaign: a designation of the historic Pullman neighborhood as a national monument. The distinction has long been sought by community supporters as a way to boost economic development. In addition to stronger support from Obama and the Democratic establishment than he had in 2011, Emanuel also has benefited from the backing of some unions, most of which worked against him the last time. Major unions, representing carpenters, plumbers, pipefitters, painters, operating engineers and hospitality workers all have endorsed Emanuels campaign. The mayor has reported receiving nearly $2 million in political contributions from unions for his re-election. At a rally last week inside a South Loop operating engineers hall, union leaders recalled that in 2011, their pension funds were cratering and many workers were unemployed. International Operating Engineers Local 150 President James Sweeney noted that back then, his union was running a food bank for members but now is at full employment. Last time, Sweeneys union and many others lined up behind Gery Chico for mayor, worried they couldnt trust Emanuel after he helped former President Clinton pass the North American Free Trade Agreement two decades earlier. Sweeney even called Emanuel a \"Wall Street Judas,\" which Emanuel allies decried as anti-Semitic. This time, Sweeney had nothing but praise for Emanuel as he spoke to hundreds of employees gathered from several different unions. \"Our fears of him not listening to us, of shutting us out and just dictating werent true. He reached out to us. He worked with us,\" Sweeney said. \"Many people have told us what we want to hear, but thats not leadership. Leadership tells you what you need to hear, and Rahm Emanuel has told us what we need to hear,\" Sweeney said. \"We may not always like it, but we find a way to get to a solution. He deserves our vote now and deserves for us to talk to our neighbors, our friends, anybody on the fence, that we need this mayor.\", Up until this point in the campaign, Emanuel often had appeared somnambulant, at least compared with the Washington legend hed carved out for himself. But on the union hall stage to raucous cheers from the workers, dozens of whom had gathered around a truck tailgate in the parking lot, drinking cans of Miller Lite the mayor gave a fiery, off-the-cuff speech. His voice was a strained shout as he listed a host of areas in which he proclaimed Chicago was No. 1. \"We didnt agree on everything, but we agreed on putting Chicago first.\" Emanuel said. \"And once we had that trust, we could work through every issue.\", Throughout, one union worker frequently punctuated Emanuels lines by yelling \"Nice!\" as the crowd hollered and whistled. The mayor took note and made a reference to still being well-versed in profanity. \"Whoever this guy is whos saying nice, you are coming with me everywhere I go!\" Emanuel said as the crowd laughed and many shouted. \"And who said I didnt know a four-letter word? Nice!\", Tribune reporter Rick Pearson contributed. bruthhart@tribpub.com]", "Date": "20150215", "Author": "[Bill Ruthhart]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rahm-emanuel-chicago-mayor-met-20150215-story.html", "Title": "[ Mayor Rahm Emanuel is finding it harder the second time around]"}