{"Content": "[Anthem is buying rivalCignafor $48 billion in a deal that would create the nations largest health insurer by enrollment, covering about 53 million U.S. patients. In just three weeks, starting with Aetnas $35 billion bid for Humana Inc. on July 3, the landscape of U.S. health care has been altered in a buyout frenzy that could transform five massive U.S. health companies into just three, including UnitedHealth Group. Companies that provide coverage are adjusting to the national health care overhaul and must contend with slow growth in employer-sponsored health insurance, a massive chunk of the health care market. The deal announced Friday is valued at $54.2 billion including debt. Shareholders ofCigna, based in Bloomfield, Connecticut, will receive $103.40 per share in cash and 0.5152 shares of Anthem stock for each of their shares. The companies put the total value at $188 per share. Industry analysts have pointed out several advantages to an industry consolidation. A larger insurer can gain more leverage and negotiating power to use in hashing out rates with care providers. However, the two mega deals announced this month are going to be scrutinized heavily by regulators, who want to ensure that they do not gain so much power that they can dominate the market. The impact these big acquisitions have on consumers likely wont be felt for at least a year, because insurers have already finalized most of their plans for coverage that starts in January. A combination may lead to fewer choices and some price changes for consumers, depending on where they live and who already is in their market. Anthems combination withCignawill result in a company with a much broader base over which to spread costs and expenses, and it could make technology investments over the industrys biggest customer pool. Data and technology are playing a growing role in monitoring patients and care. At a very basic level, that means things like tracking whether patients are keeping up with their immunizations. Insurers also are trying to give consumers better information on the cost and quality of the care they buy, based on their coverage. Deductibles and other out-of-pocket costs have been rising for years. That leaves a growing number of consumers with bigger bills to pay before most of their insurance coverage starts, so it can encourage more to shop around. Anthem officials have noted that aCignadeal will help build their companys Medicare Advantage enrollment in states like Texas and Florida. Medicare Advantage plans are privately run, fast-growing versions of the federally-funded program for people over age 65 and the disabled. Anthem, based in Indianapolis, is currently the nations second-largest health insurer, whileCignaranks fourth in terms of enrollment. Anthem Inc. specializes in selling individual coverage and insurance to workers of small businesses. It also has grown its government business, which includes Medicare, Medicaid and coverage of federal employees. Health insurance isCignaCorp.s main business, but it also sells group disability and life coverage in the U.S. and it has a growing international segment that Anthem lacks. Much ofCignashealth insurance business involves coverage where the employer pays the claims and then hiresCignato administer the plan, a growing and less-profitable form of coverage in employer-sponsored health care. The deal is targeted to close in the second half of 2016.Cignastockholders still need to approve the agreement, and Anthem shareholders need to approve the issuance of shares in the transaction. Anthem stockholders will own about 67 percent of the combined company, withCignashareholders owning approximately 33 percent. The Anthem board will expand to 14 members.CignasPresident and CEO David Cordani and for independent directors fromCignascurrent board will join the nine current members of Anthems board. Cordani will serve as president and chief operating officer of the combined business, with Anthems Joseph Swedish as chairman and CEO. Associated Press]", "Date": "20150724", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/business/ct-anthem-buying-cigna-20150724-story.html", "Title": "[Anthem bids $48 billion for rival Cigna to create insurance giant]"}