{"Content": "[Democrats gave speedy approval Thursday to a measure that would require a special election to fill part of the term left vacant after the death of Comptroller Judy Baar Topinka, as Republicans railed against the move as a power grab aimed at undermining Gov.-elect Bruce Rauner as he prepares to take office. The move foreshadowed what could be a combative relationship between Rauner and Democrats who run the legislature as Republicans assume control of the governors office for the first time in 12 years. The legislation, which was pushed through during a special session called by Senate President John Cullerton and House Speaker Michael Madigan, would effectively limit Rauners comptroller pick to two years in office instead of four before facing voters. Departing Democratic Gov. Pat Quinn indicated he would sign the bill before leaving office Monday. Under the measure, if a statewide constitutional office becomes vacant with more than 28 months remaining in the term, a special election to fill the spot would be held during the next statewide election. In this case, voters would get to pick a new comptroller during the 2016 election a presidential election year in which Democrats in Illinois typically perform well at the polls. That political realty wasnt lost on Republicans, who accused Democrats of a last-minute power grab before Rauner is sworn in. It sets this new day in Springfield off on a disappointing foot and poisons the well, said Sen. Matt Murphy, R-Palatine. Cullerton said the proposal was not meant to be a partisan issue but to clear up confusion about the states succession rules that were raised after Topinkas death so close to the start of what was to be her second term. Cullerton argued that those who drafted the state constitution could not have predicted that a governor would have the ability to appoint someone to a full term, contending they would want voters to have the ultimate say. Quinn appointed his former budget chief, Jerry Stermer, to serve as comptroller until Rauner makes his appointment next week. Rauner announced this week that he plans to name former corporate executive Leslie Munger of Lincolnshire to the post. Munger unsuccessfully campaigned for a House seat last fall. Democrats contended that lawmakers needed to act now to avoid a legal battle in which Munger is sworn in on Monday and could claim a property right to the office for four years. Rauners team had hinted at a court challenge, saying the Illinois Constitution makes clear his ability to appoint Munger to full term. A Rauner aide said there were no plans to sue over the measure, despite a statement taking Democrats to task for not acting in a bipartisan fashion and for passing a constitutionally dubious bill. In four days we are going to put a new governor in, and just on the eve of that we are stripping him of some of his constitutional executive authority, and thats something that, if I was governor, I would take very personally, said House Republican leader Jim Durkin of Western Springs. We would not be here today if Gov. Quinn was re-elected and a Democrat was elected comptroller. But Rep. Jack Franks, D-Marengo, said he would have supported the measure regardless of which party was in charge. Democratic institutions are never are never weakened by increased participation of the people that they serve, Franks said. Meanwhile, Cullerton dismissed the notion that the maneuver sets a poor tone for his working relationship with Rauner, saying, We have plenty of other things to talk about to get us set on a good foot. rlong@tribpub.comjhellmann@tribpub.commcgarcia@tribpub.com]", "Date": "20150108", "Author": "[Ray Long, Jessie Hellmann and Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-special-comptroller-election-clears-first-hurdle-in-springfield-20150108-story.html", "Title": "[Illinois lawmakers quickly approve special comptroller election in 2016]"}