{"Content": "[Last year, the Democrats who run the Illinois House and Senate passed a phony budget. It kept everybody happy by promising lots of spending. But it didnt raise nearly enough money to cover all that spending. The governor signed it. That was Pat Quinn. The voters saw right through it. They elected a new governor. Thats Bruce Rauner. And this year, having learned their lesson, the Democrats who run the Illinois House and Senate are ... wait. What? Theyre going to do it all over again?, Really?, Theyre apparently preparing to pass another phony budget, one that promises to spend much more money than the state has. And the governor? Oh, thats right. There was an election. Gov. Bruce Rauner spent his first months in office fixing the phony budget his predecessor signed. Hes made it absolutely clear he wont play that game. If anyone needed a reminder, Rauner offered it Thursday in an opedin the Springfield Journal-Register. \"I might be new around here, but I understand what I was sent to do. It was not to accept the dismal failure that our state government has become.\", Springfield Democrats have spent the last few weeks engaged in some time-wasting theater, setting up and shooting down various elements of Rauners economic change agenda. House Speaker Michael Madigan set up a vote on local right-to-work zones, a Rauner proposal. But Rauner didnt ask for the vote or craft the language of the bill. Madigan did. This was all about Madigan trying to embarrass him. The bill didnt get a single \"yes\" vote. And that accomplished ... what?, It wasted a few more hours of everyones time. Its the same old tired template. On Thursday, the House rejected a constitutional amendment proposed by Madigan to set an income tax surcharge on millionaires. Plenty of Republicans and a few Democrats apparently agreed with the sentiment expressed in the debate by state Rep. Jeanne Ives: \"This state has not earned the right to new revenue.\", A few more hours wasted, no closer to a budget. Madigan and Senate President John Cullerton complain that budget negotiations with Rauner have been fruitless. From what we hear, its because they wont give. On anything. Behind closed doors, Rauner has taken his most controversial proposals off the table. Hes pushing for workers compensation reform, term limits, an honest effort at restructuring state government. He will be flexible on their wishes, which would include more spending than he proposed in his budget. We know what Rauner told voters last year, and what he told us in an April editorial board meeting, and what he wrote Thursday in the Journal-Register. Hes willing to compromise. He knows Democrats run the House and Senate. But things have to change. He wont pour more money into Illinois-as-usual. Yet there are the House and Senate leaders, as Springfield winds down another legislative session toward a May 31 deadline, apparently preparing to pass a phony budget and dare Rauner to cut the spending or veto the whole thing. Illinois-as-usual.]", "Date": "20150521", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-edit-legis-0522-20150521-story.html", "Title": "[Welcome to Illinois-as-usual]"}