{"Content": "[Islamic State militants infiltrated a Palestinian refugee camp in Damascus on Wednesday and were clashing with a Palestinian group, the deepest foray yet by the extremist group into the Syrian capital, seat of President Bashar Assads power, according to opposition activists and Palestinian officials. Jordan, meanwhile, closed its only functioning border crossing with Syria, following heavy clashes on the Syrian side between rebels and government forces. Islamic State fighters, who control large swaths of territory in northern Syria, entered the Yarmouk camp from the nearby Hajar Aswad neighborhood. The Britain-based Syrian Observatory for Human Rights said the IS group took control of large parts of the camp. If they gain full control, they can potentially threaten the heart of the capital. Islamic State militants reportedly entered the embattled refugee camp of Yarmouk in southern Damascus. Islamic State militants reportedly entered the embattled refugee camp of Yarmouk in southern Damascus. The Observatory reported heavy clashes in the camp between IS fighters and members of an anti-Assad Palestinian faction called Aknaf Beit al-Maqdis. Anwar Raja, the spokesman for the pro-Assad Popular Front for the Liberation of Palestine General Command, said that IS fighters had been based in the Hajar Aswad neighborhood for months. He said Wednesdays push into the camp showed coordination between IS and a rival group, the Nusra Front, al-Qaidas branch in Syria. \"The Nusra Front opened the road for them in order to infiltrate the camp and several hours ago they entered Yarmouk,\" Raja said by telephone. It was not immediately clear why Nusra would facilitate the entry of IS into the camp. Yarmouk, a Palestinian refugee camp in southern Damascus, has been under government siege for nearly two years. U.N. aid workers have been sending food parcels into the camp, where thousands of civilians remain trapped and in desperate need of food and medicine. The camp had witnessed fighting in the past between government forces and militants who control much of the camp. The U.N. agency that supports Palestinians, known as UNRWA, said it was extremely concerned about the safety and protection of the Syrian and Palestinian civilians in Yarmouk, particularly the children. \"Credible information from public sources indicate that a variety of armed groups are engaged in fierce fighting in areas where Yarmouks 18,000 civilians, including a large number of children reside, placing them at extreme risk of death, serious injury, trauma and displacement,\" the agency said in a statement. It demanded \"an end to the fighting and a return to conditions that will enable its staff to support and assist Yarmouks civilians.\", Meanwhile, Jordanian government spokesman Mohammed al-Momani told The Associated Press that the Nasib crossing was temporarily closed late Tuesday because of clashes nearby. \"It is important for us to keep the safety for the passengers and those who are trying to cross between the two countries,\" he said. \"So we decided to close the border temporarily, until things calm down. Then we will open it again.\", A spokesman for rebels in southern Syria, Issam al-Rayess, confirmed that rebel fighters were trying to take control of the border crossing from Syrian authorities. The Nasib crossing is the only functioning crossing between Jordan and Syria and is considered a crucial gateway for Syrias government and for Syrian, Lebanese and Jordanian traders and merchants. A Syrian Foreign Ministry statement on Wednesday said it holds Jordanian authorities responsible for \"obstructing the movement of trucks and passengers and any ensuing economic or social repercussions.\", Also Wednesday, a Nusra Front leader said that a Syrian city captured from government forces last week would be ruled according to Islamic law, or Sharia. In an audio recording released by the group online, Abu Muhammed al-Golani also indicated the group does not seek to monopolize power in the northwestern city of Idlib, and called for the protection of state institutions and property. A group of rebels led by the Nusra Front and the ultra-conservative Ahrar al-Sham group seized Idlib from government officials Saturday, after a four-day assault. Associated Press]", "Date": "20150401", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-islamic-state-syria-20150401-story.html", "Title": "[Islamic State enters Palestinian refugee camp; Jordan closes border ]"}