{"Content": "[President Abed Rabbo Mansour Hadi fled Yemen by sea Wednesday as Shiite rebels and their allies moved on his last refuge in the south, captured its airport and put a bounty on his head, officials said. Hours later, Saudi Arabia announced it had begun airstrikes against the Houthi rebels. The departure of the close U.S. ally and the imminent fall of the southern port of Aden pushed Yemen further toward a violent collapse. It also threatened to turn the impoverished but strategic country into another proxy battle between the Middle Easts Sunni powers and Shiite-led Iran. Saudi ambassador to the United States Adel al-Jubeir said his country had begun airstrikes against the rebels. He said his government had consulted closely with the U.S. and other allies but said the U.S. military was not involved in the operations. He declined to say whether the campaing involved U.S. intelligence assistance. There were indications that others in the region would follow suit: The United Arab Emirates, Kuwait, Qatar and Bahrain joined Saudi Arabia in a statement published by the Saudi Press Agency, saying they would answer a request from Hadi \"to protect Yemen and his dear people from the aggression of the Houthi militias which were and are still a tool in the hands of foreign powers that dont stop meddling with the security and stability of brotherly Yemen.\" Oman, the sixth member of the Gulf Cooperation Council, didnt sign onto the statement. In a statement from the state news agency Egypt, too, announced political and military support. \"There is coordination ongoing now with Saudi Arabia and the brotherly gulf countries about preparations to participate with an Egyptian air and naval forces and ground troops if necessary,\" the statement said. Arab leaders are expected to meet in Egypts Red Sea resort of Sharm el-Sheik this weekend for a pre-planned summit, which is now expected to be dominated by the developments in Yemen. It is not clear if Hadi will be able to attend the summit. Saudi Arabia and its Gulf allies believe the Shiite rebels, known as Houthis, are tools for Iran to seize control of Yemen and say they intend to stop the takeover. The Houthis deny they are backed by Iran. The crumbling of Hadis government is a blow to Washingtons counterterrorism strategy against al-Qaidas branch in Yemen, considered to be the most powerful in the terrorist network. Over the weekend, about 100 U.S. military advisers withdrew from the al-Annad air base where they had been leading a drone campaign against al-Qaida in the Arabian Peninsula, or AQAP. Yemen now faces fragmentation, with Houthis controlling much of the north, including the capital of Sanaa, and several southern provinces. In recent days, they took the third-largest city, Taiz, as well as much of the province of Lahj, both just to the north of Aden. In fighting in Lahj, they captured Hadis defense minister, Maj. Gen. Mahmoud al-Subaihi, and then swept into the nearby al-Annad base, which the U.S. military had left. The Houthis are backed by former President Ali Abdullah Saleh, the autocrat who ruled Yemen for three decades until he was removed amid a 2011 Arab Spring uprising. Some of the best-equipped and trained military and security units remained loyal to Saleh and they have helped the Houthis in their rapid advance. Hadi left Sanaa for Aden earlier this month after escaping house arrest under the Houthis, who overran the capital six months ago. In Aden, he had sought to make a last stand, claiming it as the temporary seat of what remained of his government, backed by allied militias and loyal army units. Security officials in Yemen said the Saudi airstrikes targeted a camp for U.S.-trained special forces, which is controlled by generals loyal to Saleh. The officials said the targets included the missile base in Sanaa that was controlled by the Houthis earlier this year. One of the Yemeni security officials said the strikes also targeted the fuel depot in the base. The Houthis said in a statement to reporters that Saudi jets hit the military base, known as al-Duleimi, and that they responded with anti-aircraft missiles. Saudi-owned Al-Hadath TV aired pictures of the operation. The dark screen flashed with glaring lights and there was what sounded like machine guns or possibly anti-aircraft missiles. With Houthis and Saleh forces closing in on multiple fronts, Hadi and his aides left Aden after 3:30 p.m. on two boats in the Gulf of Aden, security and port officials told The Associated Press. The officials would not specify his destination. Saleh said in a speech two weeks ago that Hadi might head for the African country of Djibouti across the gulf, just as leaders of southern Yemen fled . Hadi is scheduled to attend an Arab summit this weekend in Cairo, where Arab allies are to discuss forming a joint Arab force that could pave the way for military intervention against the Houthis. The officials said Hadi had been preparing for the move since Sunday, when rebel leader Abdul-Malik al-Houthi vowed in a fiery speech that his forces will keep advancing south, referring to Hadi as a \"puppet\" of international powers. Shortly after Hadi fled his palace in Aden, warplanes targeted presidential forces guarding it. No casualties were reported. By midday, Adens airport fell into hands of forces loyal to Saleh based in the city after intense clashes with pro-Hadi militias. Yemens state TV, now controlled by the Houthis, announced a bounty of nearly $100,000 for Hadis capture. The Houthis still face multiple opponents. Sunni tribesmen and local militias are fighting them in many places around Yemen, and the rebels have little support in the south. Some military units remain loyal to Hadi, although they are severely weakened. Alarmingly, al-Qaida militants have emerged as a powerful force against the rebels, and there are signs of a presence of the even more extremist Islamic State group. Last week, the group claimed responsibility for suicide bombings against the Houthis in Sanaa that killed 137 people. AQAP is considered the terrorist group most dangerous to the U.S. because it successfully placed three bombs on U.S. bound airlines, although none exploded. U.S. officials acknowledge their efforts against AQAP are seriously hampered, with the U.S. Embassy closed and the last U.S. troops evacuated. Although the Houthis are avowed enemies of al-Qaida, they cant project power against the militants the way the Hadi government could with U.S. support. The deeply anti-American rebels have rejected Washingtons overtures, officials say. Hadis exit is a humiliating reversal, coming in large part at the hands of Saleh, the man he replaced in 2012 under a deal that allowed the former leader to remain free. The atmosphere in Aden was tense, with most schools, government offices, shops and restaurants closed. In the few cafes still open, men watched the news on TV. Looters went through two abandoned army camps, taking weapons and ammunition. Mohammed Abdel-Salam, a spokesman for the Houthis, told the rebel-controlled Al-Masirah news channel that their forces were not aiming to occupy the south. Foreign Minister Riad Yassin told Dubai-based Al-Arabiya TV he officially requested the Arab League send a military force to intervene against the Houthis. Depicting them as a proxy of Shiite Iran, he warned of an Iranian \"takeover\" of Yemen. On Tuesday, Hadi asked the U.N. Security Council to authorize a military intervention \"to protect Yemen and to deter the Houthi aggression\" in Aden and the rest of the south. Associated Press]", "Date": "20150325", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-yemen-shiite-rebels-20150325-story.html", "Title": "[President of Yemen flees by sea amid rebel advance in south]"}