{"Content": "[Will Rick Perry drop out?, Presidential nominations work by winnowing. One by one, candidates drop out until only the winner remains. A big question mark for the 2016 cycle is whether this process will still hold now that most restrictions on campaign financing have disappeared, in particular because major candidates are now supported by specialized super-PACs. Manybelieve candidates will stick around far longer than they used to. The first test for the announced candidates has arrived. Perrys campaign, we learned Monday night, is broke and has stopped paying staffers. As of now, however, the team is pledging to carry on, in part because Perrys super-PAC still has plenty of money. Politico also suggests that Rand Paul and Rick Santorum are hanging on partly because of super-PACs. If the normal winnowing doesnt happen in this cycle, thats a big deal. It could undercut the partys influence over who gets the nomination. Typically, only candidates with significant support and little strong opposition among party actors have a realistic chance of winning. Party influence depends on stable, predictable rules and practices, and if this has changed if, for example, most of the 17 Republican candidates remain in the race well into the caucuses and primaries then almost anything could happen. But we arent there yet. First of all, Perry could still fold, as early as this week. Remember: Every campaign swears up and down its candidate is staying in the race even if behind the scenes everyone knows its over. After all, something a late major endorsement, an unexpected poll just might give the candidate reason to stick around, but no one is going to waste resources on a campaign that is already hinting its time to pack it in. Moreover, no candidate ever truly has to drop out. No money? Run a smaller and smaller operation. As long as a few volunteers remain with cars to move the candidate around and provide spare rooms for him or her to sleep in, its possible to keep going in some fashion, even if the campaign is restricted to a one-state footprint. Think of the decision to run (or continue running) as a question of costs and benefits. The big benefit, of course, is the chance of becoming president. For Perry at this point, or for any other contender whose money runs dry, the chances of winning the reasons to run have become tiny. But the benefits can still exceed the costs, if the costs are very small. Perry isnt currently in office, so living in Iowa wont distract him from any duties. At 65, hes unlikely to run for office again, so he doesnt have to worry about his future political reputation. So maybe it comes down to whether the former Texas governor enjoys electioneering, or perhaps whether he can realistically assess his prospects. And its always possible to find examples of candidates given up for dead who then rallied. Perrys campaign is talking about John McCains implosion and revival in the 2008 cycle and Rick Santorums out-of-nowhere Iowa surge in 2012. If Perry continues on until Iowa and if other candidates such as Bobby Jindal and Chris Christie also stay in it will be an indication that traditional winnowing of candidates might be in trouble. More likely? One or more of them will be long gone by New Years Day, and the process will work as it has for decades meaning the parties will choose their nominees. Bloomberg, Jonathan Bernstein is a Bloomberg View columnist covering U.S. politics.]", "Date": "20150813", "Author": "[Jonathan Bernstein]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-rick-perry-campaign-20150813-story.html", "Title": "[Does Rick Perry have an exit plan?]"}