{"Content": "[Sean Morrison, a security business owner from Palos Park, has been selected to replace former Republican Cook County Commissioner Elizabeth Gorman on the county board. The 17th County Board District Republican committeemen voted to elect Morrison, the Palos Township committeeman and sole nominated candidate, Wednesday evening at Hackneys Restaurant in Palos Park. \"I intend to bring a businessmans approach to this,\" Morrison, a self-described fiscal conservative, told the committeemen before the vote. Morrison won a majority of the weighted vote of the 11 committeemen in the county board district, which includes part or all of towns including Hickory Hills, Orland Hills, Orland Park, Palos Hills, Palos Park and Tinley Park and stretches north to Des Plaines. Bremen Township committeeman Kevin Suggs and Leyden Township committeeman Bradley Stephens were absent, and Charlene Foss-Eggemann, Maine Township committeeman, was the sole dissenting vote. Morrison, who said he has served as committeeman for about three and a half years, owns Alsip-based Morrison Security Corporation, which provides physical security and security guards. He is a Brother Rice graduate who lives in Palos Park with his wife and two daughters. He ran for a seat on the countys Board of (Tax) Review in the 2010 and 2012 Republican primaries but lost to Dan Patlak both times. He said he hasnt yet identified specific issues he will make priorities but intends to use his business background to focus on county finances. \"The biggest issue facing Cook County is the budget,\" Morrison said. Morrison said hed continue looking for ways to cut spending, but would have voted against Board President Toni Preckwinkles proposal to increase the sales tax by a penny on the dollar, which was approved, and isnt opposed to spending if its in constituents interests. \"Theres also a time spending is a good thing if spending will bring us into the 21st century,\" said Morrison, saying Gorman had told him some county systems are \"archaic\" and in need of upgrades. Foss-Eggemann questioned the quick turnaround between Gormans resignation and Wednesday nights appointment, saying her vote against Morrison was \"only because of the process.\", There was no time to reach out to constituents who may have been interested in serving, she said. \"We should take a more considered approach, I think, and do the due diligence,\" she said. Gorman said her objection was political, and both she and Morrison said they needed to fill the spot quickly with a county board meeting coming up next week. Gorman resigned from her county post last week after voting present on Preckwinkles proposal to increase the sales tax. She said the board has been Chicago-dominated during her tenure but said she also helped suburban constituents, including fighting tax increases, upgrading county technology and investing in flood management and road improvements. Gorman was elected to her fourth term last year and said she was leaving to take a job in the private sector as a government affairs director but intends to continue serving as a Republican committeeman. lzumbach@tribpub.com, Twitter @laurenzumbach]", "Date": "20150722", "Author": "[Lauren Zumbach]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-cook-county-board-appointment-st-0723-20150722-story.html", "Title": "[Morrison appointed to replace Gorman as Cook County commissioner]"}