{"Content": "[Obliging the government to control itself is what we are called upon to do today. Illinois Supreme Court, May 8, 2015. With their public finances ravaged, their taxpayer debts enormous and any prospects for cost control bleak, Illinois voters declared on Nov. 4 that theyd had enough. They fired the incumbent governor and instead hired an insurgent who said state and local governments could not continue to tax and spend as ruinously as they had. He zeroed in on pension costs that now devour one-fourth of Illinois operating revenues. On Friday the Illinois Supreme Court tacitly agreed that the massive industry of government in this state has lost control of itself. The justices reaffirmed a principle they articulated in a similar case last July: Lawmakers who tried to regain some control of future state spending by trimming retirement benefits violated the Illinois Constitution. If anyone doubted the truth of Gov. Bruce Rauners insistence that Illinois must radically restructure the costs and scope of government, Fridays ruling settles that. The state with some 7,000 local governments, with the credit rating worse than its 49 peers, with unfunded pension liabilities above $100 billion and rising by more millions daily, with taxation at levels that already are driving businesses (and jobs) beyond its borders that state has to overhaul its operations. Expect to hear politicians or advocacy groups or finance experts float notions youve never heard in Illinois. That to preserve money for pension costs, the state workforce may have to be drastically reduced, that work contracted to private firms that dont have to provide such benefits. That as the cost of retirement benefits continues to skyrocket, more of the obligation must be placed on the workers who will reap the benefits. Thats not to blame the workers; thats to recognize brutal reality. You wont hear these and other dramatic thoughts only about state government: Fridays ruling vastly complicates life for Chicago Mayor Rahm Emanuel, Cook County Board President Toni Preckwinkle and thousands of other local officials. They prayed that the court would uphold state attempts to curtail retiree benefits, or at least explain how future laws might be written to meet constitutional constraints. Fridays decision offered neither. Maybe Emanuel et al. can offer the court more compelling arguments: Unlike the state, cutting benefits really is our last resort. But after Fridays ruling, theyre running uphill. So the huge enterprise of government in Illinois now confronts a financial challenge unlike any it has known: The new taxation necessary to satisfy all of these state and local pension demands would make this a ghost state. So let the restructuring begin. The Illinois legislators who created this retiree benefits debacle will try to shift the blame. Notice how often you hear about Rauners proposed budget cuts for this and the next fiscal year. As if the newcomer, not his predecessors, devastated state finances. No, voters understood who caused this. They elected Rauner in the hope that he could lead the salvage mission. Many of the legislators who voted for the provisions now choking state and local governments will fight him every step of the way. Now, though, the game changes. Illinois is about to endure a new and toxic tension between those who have court-protected benefits and those who dont. That group includes not only taxpayers who must pay for those benefits, but the parents of school-age children, the Medicaid recipients, the university students and all the other Illinoisans who may think their needs, or their childrens needs, are as meritorious as public pension funds. Fridays unanimous court opinion says all those Illinoisans are dead wrong. So as the slashing of non-retirement costs intensifies, dont blame the chief executive officers who have to wield the knives. Blame the state and local lawmakers who, over the decades, built this miserable Illinois slaughterhouse.]", "Date": "20150508", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-illinois-pension-law-unconstitutional-edit-20150508-story.html", "Title": "[Salvaging Illinois after the pension ruling]"}