{"Content": "[Armed with a red rose for his husband, Vincent Cousineau walked along North Halsted Street in Chicago on Friday, cheering at honking cars celebrating the news that the nations high court had struck down bans on same-sex marriages, effectively making gay marriage legal nationwide. \"I was shocked at how emotional I was seeing the ruling. I just cried,\" said Cousineau, 47, choking up on his way to meet his partner, who was leaving work early after hearing about the landmark decision. The justices ruled 5-4 that outlawing gay marriage and refusing to recognize same-sex marriages legally performed in other states violated the equal protection and due process clauses of the Constitutions 14th Amendment. The decision in the fiercely contested case marked the most significant victory for gay marriage rights in U.S. history, providing same-sex married couples the same national legal rights and social recognition as heterosexual couples. Cousineau said that when he came out 30 years ago, he assumed he would never be legally allowed to tie the knot, but hell celebrate his third wedding anniversary next week. And, thanks to Fridays ruling, \"we dont have to look at a map to see where we will be a married couple anymore,\" the Chicago resident said. Advocates say that distinction is what makes the ruling significant in Illinois, where same-sex marriage was legalized last year. In making gay marriage bans unconstitutional, the Supreme Court not only shut down the possibility of state legislatures repealing laws allowing gay couples to marry but also ended nonrecognition of such marriages in some states. Thirty-six states and the District of Columbia had legalized gay marriage prior to the ruling. \"This is such a huge, historic day weve been waiting for for decades,\" said John Knight, director of the LGBT and AIDS Project at the ACLU of Illinois. Despite last years legalization in Illinois, Knight said Fridays ruling is just as important to couples in this state because now their unions are recognized across the country. \"Its very important for us in Illinois too to know that we dont have to worry about driving to Michigan and getting sick or having some sort of accident and not having marriages recognized in the emergency room,\" he said. \"Also, its a matter of basic respect that its not just a state-by-state thing. ... It really undermines the dignity of peoples marriages to have them denied or not recognized in parts of the country.\", The courts opinion also serves as recognition of the history of discrimination against same-sex couples, Knight said. \"This is the kind of harm that cant continue,\" he said. \"From a legal standpoint, were thrilled theres both a recognition of liberty and equality. We, too, have the fundamental right to marry.\", \"Weve been fighting for this day for decades, and the Supreme Court has delivered us a great victory,\" added Camilla Taylor, an attorney with Lambda Legal in Illinois, which was involved in the Supreme Court case and other same-sex marriage cases. \"Its complete affirmation of the equal personhood of lesbian and gay people.\", Critics of the ruling, however, called it \"politics run amok\" and a threat to religious liberty. And those who rejoiced Friday said the courts decision is just one step toward true equality in the LGBT community. Joy over the decision radiated Friday throughout the Boystown area of Chicagos Lakeview neighborhood, which already was gearing up for the annual Pride Parade this weekend. At the Sidetrack bar on North Halsted, people drank and celebrated. Lambda Legal distributed shirts that read \"Love Rules\" and a DJ spun Billy Idols \"White Wedding.\" Gloria Woods, 55, said she was both hopeful and wary before the ruling but felt elated once the court sided with her and other members of the LGBT community. \"Ive been personally hoping for this for my own relationships for a long time,\" she said. Woods, who married her partner in March 2014, said that issues of sexual orientation were hard to broach in her work as a diversity counselor when she first started 20 years ago. Today, she said, these issues are being taken seriously. Mayor Rahm Emanuel and other officials celebrated Friday with the packed crowd at Sidetrack. \"I want to thank you for speaking up,\" Emanuel said. \"I want to thank you for speaking out. I want to thank you for never giving in and never giving up.\", Officials pointed to LGBT rights in the city and the state, declaring that Chicago helped lead the charge toward marriage equality. \"So goes Chicago, so goes Illinois, and now, so goes the country,\" Emanuel said to loud cheers. State Rep. Kelly Cassidy, D-Chicago, an advocate for gay rights in the state legislature, said the courts ruling Friday was a major victory but that the work was not yet over. \"Until we have taken care of all inequality, until all hatred is eliminated, we are not done,\" Cassidy said. \"Today, its gratitude. Tomorrow, back to work.\", Several other state and local politicians released statements Friday in support of the ruling, including U.S. Sen. Dick Durbin, Cook County Board President Toni Preckwinkle and Cook County Clerk David Orr. Fridays ruling appeared to split upon typical ideological lines, with left-leaning Justices Ruth Bader Ginsburg, Elena Kagan, Sonia Sotomayor and Stephen Breyer and moderate Anthony Kennedy forming the majority, while conservative Chief Justice John Roberts and Justices Clarence Thomas, Antonin Scalia and Samuel Alito dissented. \"The limitation of marriage to opposite-sex couples may long have seemed natural and just, but its inconsistency with the central meaning of the fundamental right to marry is now manifest,\" Kennedy wrote in the majority opinion. \"With that knowledge must come the recognition that laws excluding same-sex couples from the marriage right impose stigma and injury of the kind prohibited by our basic charter.\", \"No union is more profound than marriage, for it embodies the highest ideals of love, fidelity, devotion, sacrifice, and family,\" Kennedy wrote. \"In forming a marital union, two people become something greater than once they were. As some of the petitioners in these cases demonstrate, marriage embodies a love that may endure even past death. \"It would misunderstand these men and women to say they disrespect the idea of marriage. Their plea is that they do respect it, respect it so deeply that they seek to find its fulfillment for themselves. Their hope is not to be condemned to live in loneliness, excluded from one of civilizations oldest institutions. They ask for equal dignity in the eyes of the law. The Constitution grants them that right.\", Taylor of Lambda Legal called those words \"gorgeous.\", \"Its hard to describe the extreme sense of joy I feel for lesbian and gay couples ... and their kids, knowing the government recognizes their family,\" she said. Others long opposed to the idea of same-sex marriage criticized the courts decision and worried about its impact. \"Its a monumentally foolish and dangerous decision,\" said Laurie Higgins, cultural analyst with the Carol Stream-based Illinois Family Institute. \"It robs our citizens of our rights to self-government. Nowhere in the Constitution says marriage should be defined as a gender-less institution.\", Higgins said legalizing same-sex marriage \"will further erode religious liberty,\" possibly forcing churches to marry all couples or directing religious schools on how to instruct on homosexuality. She also worries about the ruling infringing on the rights of wedding-focused business owners. \"The idea of equality regarding marriage depends on first defining marriage,\" Higgins said. \"I would argue there is no unmarried adult in America who has been denied the right and freedom to marry. Every homosexual had a right to take part in marriage (with someone of the opposite sex). They are asking to redefine what (marriage) is.\", The Chicago-based Thomas More Society also took issue with the ruling. \"Todays Supreme Court decision purporting to redefine the institution of marriage will be regarded by many Americans as a grave aberration that obliterates the borderline between the rule of law and policymaking,\" Steve Crampton, special counsel to the society, said in a statement. \"Natural marriage the union of one man and one woman is the foundation for a stable, fruitful civil society. Without it, societies are prone to crumble ... This is not justice. It is sheer judicial activism and politics run amok.\", Recognition of same-sex marriage \"is a tragic error that harms the common good and most vulnerable among us,\" Archbishop Joseph Kurtz, president of the U.S. Conference of Catholic Bishops, said in a statement. \"Regardless of what a narrow majority of the Supreme Court may declare at this moment in history, the nature of the human person and marriage remains unchanged and unchangeable,\" Kurtz said. \"Just as Roe v. Wade did not settle the question of abortion over forty years ago, Obergefell v. Hodges does not settle the question of marriage today. Neither decision is rooted in the truth, and as a result, both will eventually fail.\", Attitudes toward gay rights began to shift in Illinois in 2005, when an anti-discrimination bill became law. Six years later, civil unions were approved for gay couples. In November 2013, then-Gov. Pat Quinn signed the bill that changed the definition of marriage in Illinois as an act between a man and a woman to an act between two people. In June 2014, the first gay couples were allowed to legally marry in the state. In March, Illinois Attorney General Lisa Madigan joined with top attorneys from 16 other states, including Massachusetts, in filing a brief with the Supreme Court arguing that same-sex couples had a constitutional right to marry. \"Marriage equality is not only about ensuring everyone has the same rights and privileges by law,\" Madigan said in a statement. \"It is about upholding the principles this country was founded on, that all individuals are equal.\", While Lambda Legals Taylor said Friday was a day for \"feeling wonderful,\" she also said there is work to be done. First, advocates need to make sure all states follow the courts decision and grant marriage licenses to same-sex couples, and recognize their unions just like all other marriages. Taylor said Fridays decision also \"highlights a problem our country faces. A majority of states still permit (lesbian and gay) discrimination.\", \"So couples could get married and come to work and be fired for it,\" she said. \"That has to change.\", The ACLUs Knight agreed, saying \"the fight for full equality is not over by any means.\", \"We can marry at the moment, but there is no guarantee well be treated fairly,\" he said, referencing the lack of federal anti-discrimination laws for same-sex couples. Although marriage will be treated as a right, theres still a threat to employment and health insurance access for spouses, among other issues in some states, Knight said. Rick Garcia, policy director at the Chicago-based Civil Rights Agenda, said Fridays ruling \"sets the tone\" toward full gay rights across the country but that discrimination still exists. \"Some may say, Arent you ever satisfied? My answer is, no,\" Garcia said. \"As long as a gay kid is beaten up in school, as long as a transgender person is fired, as long as a gay couple who is married cant have a reception at a hall no, I am never satisfied.\", \"Were closer to that full equality today than we were yesterday ... but its not over.\", cdrhodes@tribpub.com, kthayer@tribpub.com, jacraven@tribpub.com, Twitter @rhodes_dawn, Twitter @knthayer, Twitter @jasper_craven]", "Date": "20150626", "Author": "[Dawn Rhodes, Kate Thayer]", "Link": "http://www.chicagotribune.com/news/ct-supreme-court-gay-marriage-ruling-met-20150626-story.html", "Title": "[ Supreme Court gay marriage ruling praised by Illinois advocates]"}