{"Content": "[You hear a lot of flattering but unverifiable numbers and predictions attached to the Obama administrations plan to reduce carbon emissions from power plants. (Itll be like removing 166 million cars from the highway! The health savings will far outstrip the cost!), But if you focus on one scary fact climate change is happening you come around quickly to the idea that this new energy blueprint is sound, if imperfect. The rules, released Monday by the Environmental Protection Agency, set limits for the first time on greenhouse gas emissions from power generating stations. The overall goal: to cut carbon pollutants from the power sector 32 percent below their 2005 level. President Barack Obama presented his final plan for carbon dioxide reduction targets on Monday, Aug. 3, 2015, which would reduce emissions 32 percent below 2005 levels by 2030. President Barack Obama presented his final plan for carbon dioxide reduction targets on Monday, Aug. 3, 2015, which would reduce emissions 32 percent below 2005 levels by 2030. Power plants, which produce electricity, are the targets here because most burn coal or natural gas and they contribute one-third of the nations carbon dioxide emissions. These fossil fuels (especially coal) are dirty and dangerous. Trapped in the atmosphere, greenhouse gases raise the globes temperature and wreak havoc with the environment. Shrinking ice caps, rising seas, more flooding, more intense heat waves these phenomena are happening now. The question is whether we can band together as a planet in time to reverse the effects. A momentary pause: Just in writing the preceding paragraph, we entered the frustrating realm of citing unverifiable numbers and predictions to argue for the EPA action on global warming. Wed prefer to know with more certainty what the risks are to the planet and what the economic costs and benefits of aggressive action will be. But we cant know for certain. We can only combine science and common sense and say the right path is to clean up industrializations awful mess in the skies and present future generations with a healthier Earth. The EPA regulations, tweaked a bit from a draft version released last year, take a strong step in that direction. The rules also set down a crucial marker for the U.S. to use in negotiations to reach a U.N. deal in Paris in December to reduce global greenhouse gases. Chinese President Xi Jinping, at a November summit meeting with Obama, pledged for the first time to cap Chinas emissions, though relying on some squishy math. The more seriously the U.S. acts, the more likely other polluting nations like China and India will do the same in Paris. The heart of the EPA plan is to shift power plants from burning so much coal to using cleaner sources, including natural gas, wind and solar energy. Coal generates about 40 percent of the nations electricity, while wind and solar together chip in 5 percent. By 2030, according to the plan, coal would drop to 27 percent, below the renewables at 28 percent. Natural gas, which burns more cleanly than coal, would remain a big part of the mix. The how-tos for this dont come down from on high, which is good. Individual states will each receive a goal for reducing emissions. They will sketch out plans by 2018 and start meeting reductions in 2022. This gives Illinois a chance to make some decisions for its own benefit, though we know coal wont and shouldnt be a big part of the answer. Its just too dirty. The EPA says the plan will cost utility companies billions expenses theyll likely pass along to ratepayers. The EPA includes some important guidelines and incentives, including an emissions trading system that would allow power plants or states to team up to buy and sell carbon allowances. Thats exciting because cap-and-trade encourages cooperation by acknowledging the obvious: All 50 states, and the entire world, share one atmosphere. Another positive wrinkle doesnt go far enough: The plan acknowledges the role of nuclear energy, which emits zero carbons, by allowing several states with nuclear plants under construction to include them in their plans. But the EPA guidelines dont change the overall game for nukes, which are safe and should be an expanding part of the U.S. energy mix. Two basic assumptions among many warrant consideration: The country was already moving in the right direction by recognizing that burning coal is an old habit we need to quit. Energy companies are investing in new technology and, led by California and others, seem ready to embrace investment in renewables. The new rules \"will act like an accelerant,\" Ted Craver, CEO of the parent of Southern California Edison, told The Wall Street Journal. \"Now all the states will have to grapple with the need to reduce carbon emissions.\", Which isnt a guarantee that the plan will be enacted as rolled out Monday. The coal industry will argue forcefully, and with some merit, that the administrations reach exceeds its legal grasp. Well see how federal courts rule. Nor is this initiative divorced from politics. Its part of President Barack Obamas effort to burnish his legacy, so congressional Republicans wont be kind. Theyll also accuse the administration of kowtowing to the same environmental hard-liners who have kept the administration mistakenly, we think from approving the Keystone XL pipeline project. And critics of several stripes will ask hard questions about the dollar costs and climate benefits of overhauling how this nation produces electricity. One way or another, though, America has to diminish its reliance on coal. The quality of our future on this planet hangs in the balance.]", "Date": "20150804", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-epa-climate-change-carbon-emissions-20150803-story.html", "Title": "[Reversing the tide on climate change ]"}