{"Content": "[If Cook County businesses are worried about losing shoppers to Northwest Indiana when their sales tax bumps up 1 percentage point on Jan. 1, Indiana business leaders want them to know its already happened. When Cook County sales tax on general merchandise rises to 10.25 percent in Chicago, 10 percent in Calumet City, 9.75 percent in Orland Park and 9.5 percent in Lansing it will be nearly 3 percentage points higher than Indianas 7 percent sales tax. \"Some people will cross the state line for the (lower sales tax),\" said Africa K. Tarver, director of the Mayors Office of Economic Development in Hammond. \"But, I think those consumers already come here. It is not as if we dont already service consumers from our neighboring Illinois communities. They already shop here, and they like what they are getting.\", In Hammond, The Marina District Development, in the shadow of the Chicago Skyway at 5th Avenue and Indianapolis Boulevard, features a Wal-Mart Supercenter, and anticipates a Ross Dress for Less and other retail and restaurant businesses. Tom Collins, of the Luke Family Brands, hopes more Illinois shoppers will be drawn to the Marina District Development. About 15 miles south of the Marina District and just a stones throw away from the state line, Groens Fine Furniture, 208 Matteson in Dyer, has been in the same location for 32 years, and \"I dont think it will affect us,\" said Cathy Groen, sales manager. \"Time will tell.\", At Shops on Main in Schererville, \"they are creating a shopping mecca around us. We see a lot of Illinois people,\" said Josh Halpern, president of Alberts Diamond Jewelers. Alberts, opened in 1905 in East Chicago and has been owned by the Halperns since 1960. They have two stores: one at the intersection of Main Street and Indianapolis Boulevard in Schererville, and another in Southlake Mall. When customers call the store, one of the hold messages touts lower sales taxes in Indiana. \"For me, it is a positive,\" said Halpern. Its not just the taxes that push people over the state line, say business leaders. \"We have more things to draw consumers to Indiana,\" said Tarver. \"You may see more consumers from Indiana staying in Indiana. There are other factors that go into play.\", One such factor is free parking, an additional cost that sometimes deters Sally Vargo Eubank and her husband, Bill, from heading into Chicago. The couple own Heart to Heart Gift Gallery, 921 Ridge Road in Munster. The sales tax increase \"certainly helps us. Im sure people would love to not have to pay that higher tax,\" Vargo Eubank said. \"I actually couldnt believe they raised that tax it was already high. We have some Chicago clients. People who live in the city and come back to shop with us for gifts and things for the home. We have so much to offer: great prices, great service, free parking and we have 7 percent sales tax.\" , Debbie Mandarino, owner of Debbies Dresses, 1828 Indianapolis Blvd. in Whiting, is not sure how much her business will be affected by the Cook County tax increase. \"I have been watching. I dont know if it will impact us that much. I dont think I get customers just because the sales tax is lower,\" she said and added she has a lot of out-of-state customers and doubts the bump from 9.25 percent to 10.25 percent matters that much to them. The increase \"certainly helps the retail vendors in Indiana. We welcome that. We are open for business,\" said Dave Ryan, executive director for the LakeShore Chamber of Commerce in Hammond. \"I feel sorry for those who purchase at retail in Illinois. It is tough on the people who are on a fixed income and trying to save every cent. The perception is that 10.25 percent is the highest tax in the land. They have to raise money, but they are doing it on the backs of the purchaser.\", \"Its an interesting discussion,\" said Chris Bengtson, chief operating officer for Strack & Van Til grocery store chain. The chain operates 19 Strack & Van Til grocery stores in Northwest Indiana and one in Chicago at 2627 N. Elston Ave. It also operates 12 Ultra Foods grocery stores in Illinois and four in Northwest Indiana. Nonprepared foods are taxed at 2.25 percent across the border, but Indiana does not tax food in grocery stores. \"Is there a net gain or net loss (for Strack & Van Til)? We have stores on both sides of the border. There is certainly an upside for Indiana stores with shoppers coming to the Indiana side, depending on where the store is situated. We have a Munster (Strack & Van Til, 12 Ridge Road) store that does quite a bit of business. Theres an equal amount of downside, as we operate on both sides of the border.\", \"In my conversations with customers on the Indiana side near the border who make it a point to drive across the border to come to a store I have never heard anyone reference the (sales tax) on the Illinois side,\" Bengtson said. Nancy Coltun Webster is a freelance reporter for the Post-Tribune. About the Cook County tax, The sales tax increase in Cook County communities does not affect non-prepared food items, prescription medications and non-prescription medications with medicinal value and consumer medical devices such as prosthetics, dentures and eye glasses.]", "Date": "20150725", "Author": "[Nancy Coltun Webster]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-indiana-sales-tax-st-0724-20150723-story.html", "Title": "[Cook County sales tax remains a draw to Northwest Indiana]"}