{"Content": "[As divisive as the U.S. congressional debate on the Iran nuclear deal has been, all sides can say they got something they wanted. President Barack Obama has locked up enough Senate votes to keep lawmakers from scuttling the accord. Republicans may end up voting it down in both chambers, even if they cant override Obamas veto. And Democrats can show their pro-Israel supporters they dont all love the deal either -- without endangering a key foreign policy initiative. \"All parties can see silver linings for themselves,\" said Robert Shapiro, a political science professor at Columbia University in New York. Republican presidential candidate Donald Trump says the Iranian nuclear deal was incompetently negotiated and vowed for a better deal if he were elected president. (AP), Republican presidential candidate Donald Trump says the Iranian nuclear deal was incompetently negotiated and vowed for a better deal if he were elected president. (AP), Republican presidential candidate Donald Trump says the Iranian nuclear deal was incompetently negotiated and vowed for a better deal if he were elected president. (AP), Republican presidential candidate Donald Trump says the Iranian nuclear deal was incompetently negotiated and vowed for a better deal if he were elected president. (AP), As Congress opens debate on the Iran nuclear deal, Democratic presidential candidate Hillary Rodham Clinton outlined her case in support of the agreement. In remarks at the Brookings Institution, Clinton also issued a firm warning to Iran. (Sept. 9, AP), As Congress opens debate on the Iran nuclear deal, Democratic presidential candidate Hillary Rodham Clinton outlined her case in support of the agreement. In remarks at the Brookings Institution, Clinton also issued a firm warning to Iran. (Sept. 9, AP), Joined by military veterans, several dozen House Democrats, including Minority Leader Nancy Pelosi, gathered on the steps of the Capitol Tuesday evening to show their support for the Iran deal. (Sept. 8, AP), Joined by military veterans, several dozen House Democrats, including Minority Leader Nancy Pelosi, gathered on the steps of the Capitol Tuesday evening to show their support for the Iran deal. (Sept. 8, AP), Congress returned to work on Capitol Hill on Tuesday and their first order of business was to take up debate over a resolution that would disapprove of the Iran nuclear agreement. (Sept. 8, AP), Congress returned to work on Capitol Hill on Tuesday and their first order of business was to take up debate over a resolution that would disapprove of the Iran nuclear agreement. (Sept. 8, AP), Senate Minority Leader Harry Reid defended the nuclear deal with Iran Tuesday, saying Democrats have enough votes in the Senate to ensure deal isnt blocked. Reid made the comments at the Carnegie Endowment for International Peace. (Sept. 8, AP), Senate Minority Leader Harry Reid defended the nuclear deal with Iran Tuesday, saying Democrats have enough votes in the Senate to ensure deal isnt blocked. Reid made the comments at the Carnegie Endowment for International Peace. (Sept. 8, AP), When its over, the U.S. will have entered into an agreement with Iran to limit its nuclear ambitions that will lead to the end of many economic sanctions and allow the Islamic Republic to re-enter the global community after decades of isolation. The House and Senate are set to begin debate and possibly vote on a resolution of disapproval this week, as lawmakers return to Washington following their August recess. Obama has at least 38 Senate votes in support of the Iran deal, four more than the 34 he needs to keep Congress from blocking the Iran agreement. Both parties also will seek to use the divide over the accord in their 2016 political campaigns. \"The Republican opponents now have this as an issue to hold against the Democrats in the upcoming election,\" Shapiro said in a phone interview. He said of Democrats in Congress, most of whom have offered lukewarm support for the accord, that \"everybody wanted to hedge their bets.\", The deal would ease economic sanctions on Iran in exchange for curbs on the countrys nuclear program. Obama has lobbied hard for Democratic support and has made pitches to U.S. Jewish leaders to counter opposition to the deal by Israeli Prime Minister Benjamin Netanyahu. \"Pretty good politics for everyone,\" said Joshua Huder, a senior fellow at the Government Affairs Institute at Georgetown University in Washington. \"This way the president gets what he wants and Republicans get to moan and campaign on the presidents terrible deal.\", Obama gained the final Senate vote needed to protect the agreement Wednesday as Maryland Democrat Barbara Mikulski -- who is retiring at the end of her term -- said she will support the accord. Since then four other Senate Democrats, including Cory Booker of New Jersey, have announced theyll support the deal. Depending on what other unannounced Senate Democrats do, Obama may even get 41 Senate votes necessary to prevent the Senate from advancing to a vote on the disapproval resolution. As of Sunday he was three votes short of that total. Early last month, it wasnt clear whether Obama would have the votes needed to prevent the Republican-led Congress from blocking the accord -- especially after the Senates No. 3 Democrat, Chuck Schumer of New York, said Aug. 6 that he opposed the deal. In the House, more than 240 lawmakers have said they oppose the deal, well over the 218 needed to pass a resolution of disapproval. Sens. Robert Menendez of New Jersey and Ben Cardin of Maryland have been the only other Democrats in the chamber to join Schumer in disapproving the agreement. Even so, that could work to the advantage of Schumer, seen as the next Senate Democratic leader after Minority Leader Harry Reid of Nevada retires. Asked whether the Iran decision may affect Schumers ability to succeed Reid, Josh Earnest, White House press secretary, told reporters last month that he \"wouldnt be surprised\" if Senate Democrats considered voting records when choosing a new leader. Now that Obama has the votes to uphold the accord, Schumers opposition is less likely to hurt him, Doug Muzzio, a professor of public affairs at Baruch College in New York, said. \"It seems as if hell get his principled stand, and also not be charged with being the slayer of the agreement,\" Muzzio said. Schumer has \"lain low and for good reason,\" Muzzio said. \"Why dramatize his opposition? He is counting votes too, and if it went for the president, he didnt want to be way out there alone opposing it. I think his uncharacteristic quiet is a strategic calculation on his part.\", Top lawmakers on both sides of the aisle arent easing up on the rhetoric, even absent any real legislative drama over the outcome of the debate. Mitch McConnell, the Kentucky Republican who is Senate majority leader, blasted the Obama administration last week for reducing \"this important national security matter to a partisan contest.\", \"While the president may be able to sustain a veto with the tepid, restricted and partisan support of one-third of one house of Congress over Americans bipartisan opposition, it will require a bipartisan Congress\" to strengthen Persian Gulf defenses and stand up to Iranian violations of the agreement, McConnell said in a statement. The Houses No. 2 Republican, Kevin McCarthy of California, took a similar tone. \"With a clear majority of Congress and the American people lining up in opposition to this deal, the House will not approve this deal,\" McCarthy said in a statement last week after Mikulskis announcement. \"This is a bad deal for our country and for our allies.\", The Houses top Democrat, Nancy Pelosi of California, that same day released a letter she sent to fellow Democrats declaring, \"I am confident we will sustain the presidents veto in both houses of Congress.\", New York-based pollster John Zogby said of the likely outcome, \"there is no Profiles in Courage chapter to be written here.\", Democrats support the deal either for ideological reasons or to back Obama, and Republicans oppose it on the same grounds, he said. And for those Democrats who oppose it -- such as Schumer and Representatives Eliot Engel and Carolyn Maloney, both fellow New Yorkers, Zogby said they do so \"because they fear their pro-Israeli constituents.\", \"Everyone walks away a winner, I suppose,\" said Zogby. Everyone that is, except for organizations like the American Israel Public Affairs Committee, the most prominent pro-Israel lobby in the U.S. which mounted an all-out campaign to kill the deal. Rutgers University professor Ross Baker said, \"The only losers are the interest groups, some of them impromptu, who wasted their money on all of those full-page newspaper ads and spots on cable\" opposing the deal.]", "Date": "20150908", "Author": "[Kathleen Miller and Billy House, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-iran-congress08-20150908-story.html", "Title": "[Everyone's a winner even with divides in Congress on Iran deal]"}