{"Content": "[If Donald Trump were president, he would have Mexico pay to build a wall along its 2,000-mile border to keep itself out. Hed block the billions of dollars that Mexicans illegally in the United States send home to their families. And prevent their children born in America from automatically becoming U.S. citizens. There wouldnt be many of these children, however, because Trump would be deporting millions of undocumented Mexicans all of them, if he had his way. How does that sound, Mexico?, \"We dont know if we should laugh or if we should cry,\" said Guadalupe Loaeza, a prominent Mexican columnist. \"We think hes really a nightmare.\", The longer he floats atop the polls, the more Donald Trump has started to make people here feel a bit queasy, forcing them to contemplate whether his candidacy is really something they need to worry about. As Trump published his immigration proposals this week, Mexicans expressed growing concern about his bid for the Republican nomination. \"What he says makes me laugh, but its a nervous laughter,\" said Gustavo Vega Canovas, a professor at the international studies center of the prestigious College of Mexico. \"His comments sound to me like Germany in the 1930s, when they made Jews responsible for everything that was happening.\", \"Hes playing with the fears of an important part of the American population,\" Vega added. \"Perhaps that will help him win the nomination, but it wont help with the election, because he wont have the Hispanic vote that is very important.\", Trump has said that he respects Mexico and is trying to defend the needs of working Americans. But he has caused outrage in Mexico by labeling border-crossers drug dealers and rapists. The Mexican government has tried mostly to stay above the fray. Over the past few months, Foreign Minister Jose Antonio Meade and other top officials have gone on record with their displeasure about Trumps comments. But theyve also chosen not to engage Trumps near-daily anti-Mexico barrages, in part because the candidates proposals change so often and also because officials dont expect hell be president. \"We havent even considered that seriously,\" a senior diplomat in Mexicos Foreign Ministry said about the possibility of a Trump victory. \"Otherwise I think we would be combating it verbally.\" He spoke on the condition of anonymity because of diplomatic sensitivities. Even if he doesnt win, Trumps hard-line stance on immigration could have a lasting impact. His keep-em-out rhetoric seems to have influenced other candidates, such as Wisconsin Gov. Scott Walker, who said this week his position on immigration is \"very similar\" to Trumps. Asked how the Mexican government views Trumps immigration plan, the Foreign Ministry said in a statement Monday that \"we continue to stand by our position that these comments reflect prejudice, racism or plain ignorance.\", \"Anyone who understands the depth of the U.S.-Mexico relationship realizes that those proposals are not only prejudiced and absurd, but would be detrimental to the well-being of both societies,\" the statement said. The Mexican government issued a fact sheet noting that the more than 33 million people of Mexican origin in the United States account for 8 percent of the GDP, that there are more than 2 million Hispanic entrepreneurs in the United States, and that trade between the two countries has reached $530 billion per year. \"What Trump is missing here is that this is a relationship that is a mutually beneficial one for both countries,\" Arturo Sarukhan, a former Mexican ambassador to the United States, told MSNBC. \"At the end of the day, Mexico and the United States will either fail or succeed together, and that a rising tide will lift boats on both sides of the border.\", Trumps comments have already burned bridges between his companies and his Mexican partners. Billionaire businessman Carlos Slims Ora TV and the Mexican entertainment giant Televisa canceled projects with Trump, including broadcasting his Miss Universe pageant. Trumps threat to block remittances from immigrant workers struck Mexicans as particularly provocative. \"Were living in a moment of profound crisis, with the fall of petroleum prices and public finances in a very bad state; this would lead to the destruction of the economic system,\" said Rodolfo Garcia Zamora, an economics professor at the University of Zacatecas. \"Theres very little feasible about this declaration,\" he added, \"but it increases the culture of fear and aggression against migrants.\", Trumps comments are covered in the Mexican media, but not as extensively as in the United States. Hes often treated as an oddity or a bad joke rather than a serious politician. In a column over the weekend, Armando Fuentes Aguirre wrote in the Reforma newspaper that while he believed in the ultimate goodness of humanity, there exist bad men capable of instilling evil in others. \"Donald Trump is one of these perverse specimens of whom humanity should feel ashamed,\" he wrote. Fuentes, like many Mexicans, doesnt expect Trump to win the nomination or move into the White House. \"That would push the limits of indecency, and would set back several decades a country that despite all its flaws and defects has maintained its fight against racism and discrimination. I trust that Republicans and all North Americans will lance this ugly boil that has suddenly erupted in their national life.\", Washington Post correspondent Gabriela Martinez contributed to this report.]", "Date": "20150818", "Author": "[Joshua Partlow]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-for-mexicans-donald-trump-20150818-story.html", "Title": "[For Mexicans, the Donald Trump candidacy is getting scarier]"}