{"Content": "[Cook County Board President Toni Preckwinkle has scheduled a special meeting Wednesday for a vote on her proposed 1-percentage-point sales tax increase. During a radio show taping Friday, Preckwinkle suggested that shes secured \"yes\" votes from nine commissioners, the number shell need to get the tax hike approved. \"I believe Ill have nine votes on Wednesday because Ive talked to all of the commissioners,\" Preckwinkle said on \"Connected To Chicago,\" which airs at 7 p.m. Sunday on WLS-AM 890. The Tribune previously polled all 17 commissioners, and many said they have not yet made up their minds. One commissioner who is a potential ninth vote was noncommittal Friday. \"I havent decided yet,\" said Commissioner Luis Arroyo Jr. D-Chicago, who added that Preckwinkle has been lobbying him. When first asked about his vote two weeks ago, Arroyo said, \"Right now, my constituents are not in favor of it.\" On Friday, he said hes hearing \"pros and cons.\", Commissioner John Daley, D-Chicago, who backs the sales tax increase, announced he will hold a Finance Committee hearing on the issue at 10 a.m. Wednesday. Preckwinkle scheduled a full board meeting to come right after the committee meeting. If approved, the county portion of the sales tax would rise from .75 percent to 1.75 percent. In Chicago, that would put the overall sales tax rate to 10.25 percent, among the nations highest. Preckwinkle said the tax increase, estimated to raise nearly $474 million a year, would be used primarily to restore financial health to the countys underfunded employee pension system. The rest would pay for rising annual costs on debt incurred before she took office, and for road and bridge work, she said. The Cook County Board president did not rule out other potential tax increases when she proposes the 2016 budget later this year. \"Its unclear where were going to be in the fall for the budget as a whole,\" Preckwinkle said. During the taping, Preckwinkle also dismissed Republican Gov. Bruce Rauners attempt to incorporate her proposed changes to the county pension fund in a broader bill he put forward this week. \"Its not our bill,\" Preckwinkle said of the governors legislation. \"It includes clauses which eviscerate our public employee unions, taking away almost all of their right to bargain over hours and wages and pensions and vacation time. Thats not the bill that we put forward, and so I dont want the governor to suggest that hes somehow cooperating and working with us when the plan he put forward is not the plan that we submitted to the legislature.\", hdardick@tribpub.com, Twitter @ReporterHal]", "Date": "20150710", "Author": "[Hal Dardick]", "Link": "http://www.chicagotribune.com/news/ct-cook-county-sales-tax-met-0711-20150710-story.html", "Title": "[Preckwinkle sets Wednesday meeting on sales tax hike]"}