{"Content": "[Democrats who control the General Assembly were unable to corral enough votes to completely override Republican Gov. Bruce Rauners vetoes of a new state budget on Wednesday, leaving the state without full spending power as the political stalemate that threatens to shut down portions of state government showed no signs of dissipating. The Senate did find enough support to send the governor a temporary, one-month budget to pay for core services in the meantime, though that effort was largely symbolic after Rauner had said he would not sign the measure. Gov. BruceRauner plans to veto the Senates temporary budget plan, looking for pro-business reform. House Speaker MichaelMadigan calls on Raunerto be reasonable. (WGN-TV), Gov. BruceRauner plans to veto the Senates temporary budget plan, looking for pro-business reform. House Speaker MichaelMadigan calls on Raunerto be reasonable. (WGN-TV), The state has been operating without a budget for nearly three weeks after Rauner vetoed a spending plan Democrats sent him that was more than $3 billion short. Its led to questions over the legality of paying workers, and thrown the states network of social service providers into turmoil as they cut services and lay off employees in anticipation of soon running out of state dollars. The partisan bickering persists after the yearly budget fight morphed into a larger ideological battle that pits Rauner and his pro-business, anti-union agenda against Democrats who contend they are striving to protect the middle class by blocking his political wish list. Because lawmakers were unable to override Rauners budget veto, the majority of the spending plan they approved in late May effectively dies. House Speaker Michael Madigan, D-Chicago, blamed the situation on the absence of several of his Democratic members, but support for an override had long been in question. Senate Democrats did vote to overturn vetoes on five budget bills that would fund sensitive programs such as juvenile justice and public health. The House now has 15 days to try to do the same. Madigan said his caucus will \"look at it as we go along,\" but said he was concerned about taking action because it would trigger an automatic veto session in which lawmakers can collect mileage and per diem payments totaling tens of thousands of dollars a week. Madigans assertion that he isnt attempting to override the budget vetoes as a way to save the state money was a direct rebuttal to Rauner, who blasted lawmakers for taking a pay raise while the budget remains unresolved. In recent years, the General Assembly has voted to forgo the annual cost-of-living increase in a nod to the states ongoing financial troubles. No such vote took place this year, meaning lawmakers are in line for a salary bump. \"Speaker Madigan and the legislators he controls will leave town without a responsible, balanced budget and without any reforms while taking a pay raise for themselves,\" Rauners office said in a statement. \"Thats unfair to taxpayers and the people they represent. It is time to stop protecting the political class at the expense of the middle class.\", Madigan declined to address legislative pay raises. \"Im not going to spend a lot of time on that question,\" he told reporters. The speaker countered that Rauner should instead focus on approving the temporary budget lawmakers sent him. \"The governor will have an opportunity to read the bill and reflect on what the bill will do. The bill will provide 30 days of appropriations for essential services,\" Madigan said. \"I dont think anyone in the legislature or governors office would disagree with my characterizations that those services are essential.\", The stopgap budget would funnel money for 30 days to key areas such as foster care, monitoring nuclear sites and meals for seniors. It would also ensure state workers get paid for the month, which has come under debate following dueling legal opinions on the matter. Republican Comptroller Leslie Munger cut checks for 6,800 workers who were to be paid Wednesday after a ruling from a St. Clair County judge who sided with labor unions that argued not paying workers would be a breach of collective bargaining agreements. That court decision contradicts an earlier order from a Cook County judge who said Munger should pay workers only the $7.25-per-hour federal minimum wage until a budget deal can be reached. Illinois Attorney General Lisa Madigan, the speakers daughter, has asked the Illinois Supreme Court to weigh in on both cases. In the meantime, Speaker Madigan said the House will continue to try to pass piecemeal budget bills to fund various social service programs including breast and cervical cancer screenings. He called his entire chamber for a hearing Wednesday to highlight the uncertainty the stalemate has caused for service providers who rely on government funding. Lawmakers heard from people like Maria Socorro Pesqueira, president and CEO of Mujeres Latinas En Accion, a Chicago nonprofit that provides services to immigrants and victims of domestic violence. Because of a long-standing lag in payments from the state, Mujeres Latinas is currently being paid for work it performed in May. But the ongoing nature of the budget impasse has Pesqueira worried. \"We dont know how long things will go,\" said Pesqueira, who added that her organization has furloughed workers and is operating at 60 percent capacity in anticipation of a funding crunch down the road. In the Senate, Democrats could not find the votes to pass their version of a property tax freeze, an issue Rauner has been pushing as part of his agenda. The measure also contained changes to the way state payments to schools are calculated as well as pension relief to Chicago Public Schools. The idea was rejected by Rauner last month, who said it missed the point of his property tax proposal because it did not contain limits on union influence in municipal hiring and contracting. The day also provided a venue for child care advocates to air frustrations with Rauner over the restrictions his administration has placed on a state-subsidized child care program during the budget impasse. Enrollment for the program has been frozen and advocates estimate that 90 percent of new applicants are being denied access to the program under Rauners new rules. \"For a state that wants to be family-friendly and business-friendly, this goes against both of those,\" said Sessy Nyman, vice president for policy at Illinois Action for Children, at a Capitol news conference. Geiger reported from Chicago. mcgarcia@tribpub.com, kgeiger@tribpub.com]", "Date": "20150715", "Author": "[Monique Garcia, Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rauner-legislature-state-budget-met-0716-20150715-story.html", "Title": "[Lawmakers fail to override Rauner budget vetoes]"}