{"Content": "[Republican Gov. Bruce Rauner and Democratic House Speaker Michael Madigan are digging in during the Springfield stalemate, their resistance to giving ground driven by political calculations each believes will help his side eventually prevail. The battle of wills comes down to the money versus the map. Rauner, a wealthy former private equity investor, is not afraid to use his money to ensure loyalty among Republicans and to try to pick off Democrats in next years House and Senate contests to create a General Assembly more receptive to his \"Turnaround Agenda.\", But Madigan, the powerful speaker whos been at the Capitol for 44 years, drew the boundaries on the legislative map that will play a large role in deciding those individual races. In addition, Madigan has the benefit of a presidential year in 2016, when Democrats tend to turn out in higher numbers. And he might even have at the top of the ticket a home-state presidential candidate in Hillary Rodham Clinton. Against that backdrop, state government is about to enter its third month without a full budget, even as spending continues to outpace revenues by $6 billion. Rauners primary leverage is to hold off on a tax hike until he wins approval of his pro-business, union-weakening policies that he says will jump-start Illinois economy, hoping that starving the state of more money will lead to Democrats folding under the pressure. So far though, Democrats have held firm, countering that Rauner wants to hurt the middle class by taking away unions ability to negotiate a fair wage, making it tougher for injured workers to win claims against employers and limiting big-dollar damage awards in civil suits. Ask Rauner or Madigan whether the impasse at the Statehouse is about Illinois political future, and each politician quickly demurs, only to later affirm the high-stakes power game both are playing. Last week, Rauner suggested to reporters that he was \"not focused on 2016 at all.\" A day later, he told top Republicans about his plans for political domination. \"Every election cycle, were going to be competitive and were gradually going to grow and build that and bring the principles of the Republican Party back throughout the state of Illinois. Be a true, strong party,\" Rauner said. \"My goal: help out the Republican Party (to) become the majority party in the next eight years.\", Madigan, meanwhile, dismissed electoral considerations as a motive for the impasse. \"I am not here to think in terms of the election of November of 16 or the election of November of 18. Both of those elections are a long way away,\" the speaker said after a House session earlier this month. A week later, the speaker was asked if his actions this summer have amounted to political posturing and gamesmanship against Rauner. \"Were building a case in the legislature relative to the governors position on budget-making, thats what were doing,\" he replied. With House and Senate candidates able to start gathering signatures Tuesday to get a spot on the ballot, the two politicians see Illinois through distinctly different sets of eyes. Each thinks his side is winning with voters. Rauner, in his first foray as a public officeholder, contends that his election last fall was a mandate for change and reflects voters desire to end one-party Democratic rule. \"Were not a blue state. Were not a red state,\" Rauner said recently. \"Were a purple state.\", Madigan said Rauners election was the result of voters narrowly opting for a new Republican face over a vulnerable Democrat. The speaker noted that an advisory ballot proposal to raise the minimum wage, aimed at stirring Democratic turnout, got 650,000 more votes than then-Gov. Pat Quinn collected. \"I dont think Gov. Rauner won the election. I think that Gov. Quinn lost the election,\" Madigan told a Springfield TV station. Map vs. money, Key to enacting Rauners long-term agenda is electing like-minded Republican lawmakers to end Madigans longtime dominance as a Democratic political force. The governor is trying to weaken the unions and trial lawyers, both major sources of Democratic campaign money. Rauner, who spent $27.6 million of his personal fortune en route to winning last November, has promised to fund Republican candidates and back supportive GOP incumbents for House and Senate next year. Hes already given out about $400,000. The governors financial backing means \"the next (election) cycle will be different than the ones weve seen in the past,\" said House Republican leader Jim Durkin of Western Springs. \"We do have a very strong, committed and resourceful governor who will be very involved with the legislative election.\", Last years election results should not exactly strike fear in Madigan, however. Durkin and the House GOP spent several million dollars and picked up zero seats. A gain of just a single district would have taken away Madigans veto-proof majority, but the speaker retained his 71 members. Senate Republicans did pick up one seat, but Democrats still hold a 39-20 edge, enough for Senate President John Cullerton to override Rauners vetoes with three votes to spare. Rauner poured nearly $8 million into the Illinois Republican Party last year. The state GOP then put nearly $3.8 million into House and Senate elections, helping hold 13 Republican seats and picking up the Senate seat against a politically wounded Democrat. But the state party spent more than $1.5 million in 15 losing contests against Democrats. In addition, the governor, his wife, Diana, and his campaign put more than $280,000 directly into legislative races. Rauner doesnt need to win Republican legislative majorities in 2016 but is looking to erode Democratic control. All of the House is up for election, while 40 of the Senates 59 seats are on the ballot, 28 of them held by Democrats. Next years contests will play out on a battlefield Madigan designed. The new boundaries gave an edge to Democratic candidates at the expense of Republicans and cut down the number of tossup districts where the two parties can square off in the suburbs and Downstate. \"Im a realist, I know what that map means,\" Durkin said. \"We will have a very robust campaign season on the horizon.\", Never-ending campaign, With an eye toward the next election, the extended legislative session this summer hasnt produced a break in the impasse. It has provided a series of symbolic votes. Madigan has said that hes tried to meet Rauner \"halfway\" on a number of the governors agenda items, chief among them a measure to freeze property taxes that House Democrats have called for a vote 13 times this summer. The proposal has yet to pass amid accusations from Republicans that it does not mirror the freeze Rauner wants. Indeed, the measure stripped out a key provision backed by the governor that would allow counties and towns to limit collective bargaining and prevailing wage rules a move Rauner argues would allow local officials to cut costs to make up for the drop in tax dollars. The series of votes has a political upside for Democrats, allowing them to be on the record as voting for a tax freeze and providing fodder for them to attack Republicans for failing to support it. Madigan also has held separate votes on the union-weakening provisions Rauner wants, but those measures have failed. Democrats argue that the votes show that even Republicans dont support the governors agenda against organized labor. Republicans have largely abstained from voting on Madigans measures, calling the roll calls a \"sham.\", Reflecting the nonstop campaign that Illinois politics has become, there have been hundreds of mailings and automated phone calls into legislators districts across the state from both sides and their allies. The Democratic Party of Illinois, chaired by Madigan, sent mailers into at least nine House districts held by Republicans, many of them freshmen, attacking them for not voting on the property tax freeze. Madigan contends it was Rauner and the Republicans who launched the in-district battles through the governors \"Turnaround Illinois\" super political action committee. The fund, with Rauners money behind it, had been viewed as a way to inspire political fear in trying to split rank-and-file Democrats from Madigan, but so far with negligible results. \"Turnaround Illinois\" spent $2 million in TV ads in June to try to turn the public against Madigan and sent critical mailers into more than 20 Democratic legislative districts asking voters to question their lawmakers political allegiance to the House speaker. Rauner this month also acknowledged that his side has had robocalls \"going on for weeks trying to communicate with people around the state about whats going on with different issues and different bills, and encourage them to reach out to legislators.\", Outside groups also have gotten in on the act. In May, which was supposed to have been the final month of session, Americans for Prosperity Illinois sent mailers into some Democratic districts linking Madigan to local lawmakers and criticizing them for failing to enact a meaningful property tax freeze. Illinoisans for Growth and Opportunity, the IllinoisGO super PAC, has sent recent mailers into Chicago Democratic districts that highlight problems with Chicago Public Schools funding and attack Cullerton and local lawmakers. Over the summer, Democratic-allied elements of the Service Employees International Union have sent a series of critical mailings into 17 House districts across the state held by Republican lawmakers, many of whom have in the past displayed support for organized labor. The mailings take on Rauner and the GOP for failing to resolve the states financial mess. Democratic Rep. Lou Lang of Skokie, a top Madigan lieutenant, said Rauners focus on using the speaker as a political target ignores history as well as what motivates voters. \"This is not the first time the Republican Party has used Mike Madigan as their foil to try to win elections. And the truth is, while Mike Madigan is an important person in the state, a person in Effingham or East St. Louis or Rockford or Rock Island doesnt get to vote for Mike Madigan,\" Lang said. The path forward, The map and the upcoming presidential election could give Madigan a leg up in the wait-and-see game that has become Springfield. Rauner has charted a sometimes-confusing path during the impasse by relieving several potential budget pressure points. Madigan has dubbed them \"U-turns.\", While vetoing most of the budget Democrats sent to him, Rauner signed the portion dealing with education funding to ensure schools opened in the fall. Though Rauners lawyers told a legislative panel that they disliked government funding being run by court order in the absence of a budget, they pushed for a judicial ruling to ensure employee paychecks go out. The Rauner administration also has backed expanding provisions of federal court-ordered required programs, and he signed a bill to allow dollars from Washington to flow to many social programs and providers. Right now, nearly 90 percent of the state budget is being funded without an appropriation. A major financial supporter of Rauner is the Illinois Manufacturers Association. Greg Baise, the groups president and CEO, said that regardless of the future political implications, both sides need to reach a compromise on the budget quickly. \"You can only go so far when you wake up every day and Mike Madigan has 71 votes and John Cullerton has 39 votes, and thats not going to change until the next election,\" Baise said. \"I applaud the governor for his ardent support of business reforms that the business community supports very strongly. But ultimately, we need to get a budget, a balanced budget, so our businesses manufacturers included understand that this state is finally getting its act together,\" he said. But Durkin, the House GOP leader, said Republicans arent going to back down or give up on their governor. \"I will hold out. We are not going to cave in. This may take some time, but there is too much at stake,\" Durkin said. \"Twelve years of one-party rule has come to an end, and (Democrats) arent used to this and they dont like it.\", mcgarcia@tribpub.com, rap30@aol.com]", "Date": "20150828", "Author": "[Monique Garcia, Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-bruce-rauner-madigan-digging-in-met-20150827-story.html", "Title": "[Rauner, Madigan dig in during Springfield stalemate]"}