{"Content": "[Barbara Byrd-Bennett has resigned as chief executive ofChicago Public Schools amid a federal investigation into a $20.5 million no-bid contract. In a letter dated last week, Byrd-Bennett said she planned to step down Monday. She did not give any reasons for her decision. Byrd-Bennett has been on paid leave since mid-April, when school officials released wide-ranging subpoenas from the federal investigation. Her paid leave was scheduled to end next week, and she had not been expected to return to her post. Chicago Teachers Union reacts to Barbara Byrd-Bennett resignation on June 1, 2015. Barbara Byrd Bennett resigned amid a federal probe into a no-bid contract. (CBS Chicago), Chicago Teachers Union reacts to Barbara Byrd-Bennett resignation on June 1, 2015. Barbara Byrd Bennett resigned amid a federal probe into a no-bid contract. (CBS Chicago), She is not eligible for a pension, CPS spokesman Bill McCaffrey said, nor was she to receive any severance deal. The district referred questions about the timetable for selecting a new schools chief to Mayor Rahm Emanuels office. Byrd-Bennett, who has not been accused of wrongdoing, acknowledged when she went on leave that her presence could divert attention from the pressing affairs of the district as it tackles labor talks with the citys teachers union and confronts a $1.1 billion budget deficit. In 2013, according to CPS records, the district approved a \"leadership development services\" agreement with the Wilmette-based SUPES Academy for up to $20.5 million that extended through June 2016. District records show SUPES was hired on a \"non-competitive basis\" to train school network chiefs and principals. Byrd-Bennett once worked for SUPES. Board member Jesse Ruiz, who took over when Byrd-Bennett went on leave, will continue to serve as interim CEO, according to a statement from board President David Vitale. Michael Scudder, Byrd-Bennetts attorney, said he and his client were declining to comment in light of the pending investigation. In her brief resignation letter, Byrd-Bennett said she will \"remain forever thankful for the opportunity to serve the children of Chicago.\", Emanuel released a statement saying he was \"saddened by the circumstances that have led to Barbaras resignation and I wish her well.\", The timing of Byrd-Bennetts departure also lands as the terms expire for several school board members, who are appointed by the mayor. Andrea Zopp, a board member and former head of the Chicago Urban League who is seeking a U.S. Senate seat, announced her resignation from the school board and Urban League last week. Chicago Teachers Union officials said Monday that they were not surprised by Byrd-Bennetts resignation, adding the investigation that forced her departure sets a horrible example for our students and the educators who look to her leadership. We really, clearly need to have stability in public schools, union Vice President Jesse Sharkey told reporters Monday. When they pick a CEO, pick someone whos a veteran educator, someone who has some roots in Chicago who knows our city, someone whos been around for a while and whos likely to stay around for a while. jjperez@tribpub.com, ]", "Date": "20150601", "Author": "[Juan Perez Jr.]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-barbara-byrd-bennett-resigns-20150531-story.html", "Title": "[CPS chief Barbara Byrd-Bennett resigns amid federal criminal investigation]"}