{"Content": "[Does Illinois House Speaker Mike Madigan, the powerful political boss of a broken state, have any weak spots?, Theyre not easy to find, hidden by the dragons impenetrable scales. But yes, you can reach him, through his servants. You can get to him in his Southwest Side lair. You can touch his meat puppets in the Statehouse, who hold office in the suburbs, in districts where taxpayers are tired of Boss rule. And, you can touch his man, Cook County Assessor Joe Berrios. First, though, consider Madigans strengths. The Chicago Democrat, chairman of the Illinois Democratic Party, works harder than anyone at the craft of power. He has been the unrivaled boss of Illinois for decades. During that time, government red ink and more than $100 billion in public employee pension debt has helped sink the states economy, washing out businesses and jobs and offering a bleak future for young people. Yet the Khan of Madiganistan, lord of that dry economic wasteland once known as Illinois, could give two figs for what people say. \"Illinois has become a dictatorship from Chicago to the taxpayer and you can see where thats gotten us,\" Gov. Bruce Rauner said the other day, when he referred to Madigan derisively as king. So what did Madigan do? His loyal mini-me, state Senate President John Cullerton, D-DeLeo, went to work against Rauner. Senate Democrats undercut Rauners leverage with the states costly public employee unions, denying the governor the ability to use the threat of a lockout in contract talks. And who pays? Dont be a chumbolone. You pay. Meanwhile, the Khan sits secure, wealthy from his legal practice reducing property taxes for the large downtown real estate interests. He is all powerful, perched comfortably like some Chicago Genghis upon a throne of skulls. He ignores angry editorial rhetoric and Rauners commercials. Dragons respond only to power. Only at the source can they be touched. And the source of Madigans power is in his super majority as House speaker. It wouldnt be easy to threaten his hold, and I expect his jesters and media biscuit eaters to cry foul and unleash their trolls. It would also cost some $10 million, well within the reach of Rauners political funds for 2016. If done correctly, Madigans resources could be stretched thin. First, a Democratic candidate in Madigans increasingly Hispanic Southwest Side district must be found to challenge his re-election. Ideally, the candidate would be a woman, a Latina; best if she were a mom, a cop, Roman Catholic with a college degree. If such a candidate were well-funded, the Khan would be forced to keep his troops close. Hed have to spend power to keep it. Second, Rauner must mount well-funded challenges in districts where Republican sources say he ran strongly in comparison to House and Senate Democratic candidates. The targets could include House Reps. John Bradley, D-Marion; Deb Conroy, D-Villa Park; Carol Sente, D-Lincolnshire; Kate Cloonen, D-Kankakee; Mike Smiddy, D-Hillside; Marty Moylan, D-Des Plaines; Michelle Mussman, D-Schaumburg; Sam Yingling, D-Grayslake. State Senate targets could include Sens. Melinda Bush, D-Grayslake; Tom Cullerton, D-Villa Park; Gary Forby, D-Benton; Julie Morrison, D-Deerfield and Bill Haine, D-Alton. Third, a challenge must be made to Madigans man in Cook County Berrios, the Cook County Democratic Party chairman. Berrios is a longtime Democratic Party war horse. He worked his way up. And personally, I happen to like him because, unlike many in politics, hes no phony. He relishes the role of Cook County boss and puts relatives on the public payroll. \"So Im old school,\" Berrios told me Thursday. \"Whether my family worked for me or they worked for someone else, the comments would the same, that Im helping family. But they have to produce or Ill get rid of them. I expect them to work harder than everyone else.\", Still, Chairman Berrios knows theres a target on his back. Hes had a string of recent defeats. His daughter lost her state House seat to Will Guzzardi in 2014. And earlier this year, Berrios backed the loser in the 36th Ward aldermanic race. But Berrios great sin was that he lost his own longtime incumbent alderman in his home 31st Ward. Berrios guy, Ray Suarez was defeated by a newcomer, former television journalist Ald. Milly Santiago, a dynamic candidate. Now there are rumblings she might run against Berrios for the 31st Ward Democratic committeemans spot in March. If she could knock him off as ward committeeman, hed be out as county chairman and worthless to the Khan of Madiganistan. \"Im sure some feel theres vulnerability since the aldermanic election,\" Berrios told me. \"But Ive got a good organization. I expect to meet with Ald. Santiago next week, to find out her intentions.\", Santiago hasnt decided on a challenge to Berrios. But she is holding a fundraiser at a Berrios hangout, the Erie Cafe, on Oct. 8. And she sat down with me for an interview to talk it over. \"Some people have told me Milly, this is your momentum and youre going to be able to prove that its time for a change, \" she said. \"And these big bosses may be very concerned. Im not afraid. I challenged the Machine and I was very vocal about attacking Joe Berrios through my campaign, talking about all these years of corruption and personal interest and everything else.\", So shes thinking about it. And Berrios is thinking, as are Madigans meat puppets in the legislature. And Rauner. Of course, Madigan is always thinking. Not about rhetoric or Rauners TV spots, but about power over Illinois and how to keep it. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150821", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-kass-santiago-berrios-met-0821-20150820-column.html", "Title": "[Can the Khan of Madiganistan be touched in 2016?]"}