{"Content": "[Imagine, if you will, Sarah Palin standing behind a lectern made of gold, smiling like the cat that ate the canary and shouting, in a gratingly fake Chicago accent: Da Donald and Da Coach are DA BEST FOR DA COUNTRYYY!, It could happen, people. Reality could easily surpass the wildest dreams of every comedy writer in America. Consider this recent development in Trumpsylvania (Population: 1 really huge winner who makes great deals, I mean, honestly, the deals will be so great youll be sick of great deals). Donald Trump was hit by a wave of criticism Thursday after insulting the physical appearance of GOP presidential rival Carly Fiorina. Meanwhile, new troubles for Hillary Clinton, as Democratic opponent Bernie Sanders gains ground in the polls. Sept. 10, 2015. (AP), Donald Trump was hit by a wave of criticism Thursday after insulting the physical appearance of GOP presidential rival Carly Fiorina. Meanwhile, new troubles for Hillary Clinton, as Democratic opponent Bernie Sanders gains ground in the polls. Sept. 10, 2015. (AP), The Chicago Sun-Times on Tuesday quoted former Bears head coachand reckless word hurler Mike Ditka saying: I do like Donald Trump. I think he, sometimes hes gotta think a little bit more before he says things, but I think hes on the right track. I think that he has the fire in his belly to make America great again and probably do it the right way. I do like him, yes. I do like him. Trump responded, saying to the Sun-Times: Mikes kind of attitude and personality is what our country needs as its representative. Trump continued:Id love to have Mike involved in some capacity. Why? Because Mike knows how to win and our politicians dont. I smell a buddy flick!, Trump, of course, is right. Ditka is a total winner, unless youre a fan of the New Orleans Saints, the team he coached to a 15-33 record over three years, or a person who thinks the mid-1980s Bears, one of the best football teams ever assembled, should have won more than one lousy Super Bowl, I MEAN CMON THAT TEAM WAS LOADED, WHAT THE HECK?!?!, Sorry, where was I?, Oh, yeah, Trump/Ditka 2016. Its really a match made in heaven. Both men dislike President Barack Obama. Ditka once said that if he had run as a Republican against Obama in the 2004 U.S. Senate race in Illinois he couldve stopped Obama from becoming president: \"Biggest mistake Ive ever made. Not that I would have won, but I probably would have and he wouldnt be in the White House.\", (Ditka is also, apparently, fluent in Pompousese,Trumps native tongue, a language that allows people to say things like, Not that I would have won, but I probably would have.), Trump and Ditka also have a mutual dislike of political correctness. Trump recently said, I think the big problem this country has is being politically correct. Last year, in an interview about the controversy over the Washington Redskins team name, Ditka said: Its all the political correct idiots in America, thats all it is. Clearly a Trump/Ditka ticket is what America needs to get it to stop being such a polite wuss and start kicking some serious global butt. But that delectably crazy political stew is missing one key ingredient: Sarah Palin. You can betcha that the most straight-shootin-est, God-fearin-est, refudiatin-est half-term governor in all the land is just the person Trump needs to round out his team. Trump has praised Palin, saying recently that hed love to have her as part of his administration because she really is somebody who knows whats happening and shes a special person. And Ditka introduced Palin at a 2008 campaign rally, saying that she epitomizes all the good things, all the good values of this country. Theres clearly a circle of mutual respect: Trump loves Ditka, Ditka loves Palin, Palin loves Trump, Trump loves Trump, Trump again loves Trump, Trump loves Palin, Palin loves the sound of her own voice, and all three hate thinking before they speak. Its easy to see where this is heading. Who says a presidential campaign has to feature only two people? (The Constitution might say that, but reading is for wimps and lefties.), Why not go for the Trumpian trinity: Trump/Ditka/Palin 2016! Trump would, of course, be both president and vice president because he is so hugely successful. Ditka would be in charge of glaring at liberal losers. And Palin would be tasked with insulting the people Trump disagrees with using nonsensical yet somehow still offensive phrases. Do it, Mr. Trump. Get Ditka and Palin on board. We get da government we deserve. And in a country where da Donald is leading in da primary polls, da Coach and da Mama Grizzly are exactly what we deserve. rhuppke@tribpub.com]", "Date": "20150910", "Author": "[Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-trump-ditka-huppke-20150910-story.html", "Title": "[Trump/Ditka 2016? It could happen]"}