{"Content": "[With outsider candidates Carly Fiorina, Ben Carson, and Donald Trump upending the Republican presidential race, establishment picks are scrutinizing the electoral map for their likeliest path to victory. Increasingly, candidates like Ohio Gov. John Kasich are finding the road to securing the party nomination runs through Michigan. \"If you can do well in Ohio, Michigan, and New Hampshire, they reflect where the country is,\" former New Hampshire Sen. John Sununu, a close Kasich ally, said following Wednesday nights GOP debate. \"Theyre not hard right, theyre not hard left. They send a message about your ability to do well across the entire spectrum of the Republican primary electorate.\", Its long been clear that New Hampshires first-in-the- nation primary is key for Kasich, the only establishment candidate rising in polls prior to the CNN debate. And at least for now, he is expected to collect the bounty of delegates from his home state of Ohio. But Michigan, with its March 8 primary, is another story. In a poll of Michigan voters released this week, Carson leads the Republican field with 24 percent. Trump came in close second with 22 percent, followed by former Florida Governor Jeb Bush at 8 percent. Kasich is tied for eighth with 2 percent. Still, hoping for a meaningful share of the states 59 electoral primary votes, Kasich has been a frequent visitor since kicking off his campaign in late July. \"Weve been there five times now,\" said Chris Schrimpf, a spokesman for the campaign, noting that the governor has visited his neighboring state more than any other candidate this year. \"That is not an accident.\", Kasich is returning to Michigan this weekend to speak at the Mackinac Republican Leadership Conference on Mackinac Island, where 2,200 donors and activists will gather. He wont be the only candidate making the trip, however. Bush, Fiorina, Texas Sen. Ted Cruz, Wisconsin Gov. Scott Walker, and Kentucky Sen. Rand Paul will also attend the states biggest Republican cattle call of the 2016 election cycle. As proof that Kasich will have to fight bitterly in an establishment showdown for a share of Michigans 59 delegates, Bush announced 200 new endorsements in the state on Thursday, saying in a press release, \"I am in this race for the long haul, and Michigan is a key part of that strategy.\", Last month, the Detroit Free Press reported that Michigan donors have given more than $4 million to 2016 campaigns and super-PACs. Bush has taken in the biggest share-$1.7 million-although $1 million of that came from six donors. Other big hauls went to New Jersey Gov. Chris Christie ($900,000), Walker ($450,500), and Carson ($269,958), who announced his campaign in his childhood city of Detroit earlier this year and is counting on favorite-son votes on the conservative side. \"Were the launching pad into the next phase of the race,\" said Ronna Romney McDaniel, head of the Michigan Republican Party, who expects her state to play a major role in who becomes the partys next standard bearer. McDaniel is the niece of Mitt Romney, who pulled out all the stops to secure a last minute endorsement from Michigan-native Kid Rock when he thought his 2012 primary lead was in jeopardy. \"A candidate can do well here if they tap into that Michigan story,\" she said. Despite his current polling numbers in Michigan, the state presents an opportunity for Kasich, whose supporting super-PAC has flooded the New Hampshire airwaves with ads and subsequently leapfrogged Bush into third place. In search of the momentum needed to secure the party nomination, Kasich is also now beefing up his team in Iowa, eyeing South Carolina (he has visited the state a half dozen times), and building a ground game and roster of endorsements in the Southern states that make up the so-called SEC primary on March 1. Provided he does well in New Hampshire, a loss in those states wouldnt nearly be as devastating to Kasichs candidacy as doing poorly in Michigan, the delegate-rich Midwestern state that has a similar blue-collar electorate and manufacturing- based economy to Ohio. Employment in Ohio has outpaced other states that have governors in the presidential race. Kasich, who whose approval rating is about 60 percent, won re-election last year with support from two-thirds of Ohios voters, getting a quarter of the states African-American votes. If theres any state that understands economic strife, Schrimpf said, and appreciates what it takes to turn economies around, its Michigan, home of Detroit, the largest major American city to file for Chapter 9 bankruptcy. \"If he catches fire, I think he would do very well in Michigan, but he just hasnt caught fire,\" said Sandy Baruah, president of the Detroit Regional Chamber, which has close ties to Michigans business and donor communities. While the chamber will remain neutral in the race, Baruah is supporting Bushs campaign and admits that its too early to say who will do well there. \"Ive yet to run into anyone who says Im supporting John Kasich,\" he said. \"But hes on a lot of peoples number two list.\", Theres one other possible Michigan advantage for Kasich. Staking his candidacy on the New Hampshire primary brought unwelcome comparisons to Jon Huntsman, the former Utah governor who skipped Iowa caucuses in 2012 and took third in the Granite State primary before dropping out of the race. The similarities often cited are no small part rooted in the fact that Kasichs campaign senior strategist, John Weaver, worked on Huntsmans presidential campaign four years ago. Fred Davis, the veteran media strategist who works for a pro-Kasich super-PAC, also worked for Huntsman. Somewhat less talked about, however, is that both Weaver and Davis also helped elect Michigan Gov. Rick Snyder, the former CEO of Gateway Computers, best known for this self- effacing moniker \"One Tough Nerd.\" Snyder won the Republican primary in 2010 against four more conservative candidates by avoiding divisive social issues, positioning himself as the straight-talking, sensible moderate who focused on fixing the states economy while his opponents toed the conservative line. \"Snyder is kind of a Kasich-like figure,\" said Bill Ballenger, editor of Inside Michigan Politics. \"Theyre cut out of the same cloth. They come out of extremely different backgrounds, but hes basically tried to govern in Ohio the way Snyder governs in Michigan.\", Depending on how winnowed the GOP field is by early March, its a scenario Michigan political observers say could easily happen again. \"If were still looking for the conservative candidate, Kasich could play extremely well and come out as a viable alternative,\" says Saul Anuzis, state chair for Cruzs Michigan campaign.]", "Date": "20150918", "Author": "[Steven Yaccino, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-gop-michigan18-20150918-story.html", "Title": "[GOP establishment candidates pin their hopes on Michigan]"}