{"Content": "[Lets talk about the elephant in the room. Its a Republican, and he thinks you guys are being a little unreasonable. GOP leaders came out of the 2012 presidential election committed to being more inclusive. The partys 2016 presidential candidates have taken that bull by the horns, dutifully broadening the number of minority groups they routinely offend. Donald Trump has been in charge of insulting Latinos. The co-chairs of the Gay and Lesbian Denigration Team are Mike Huckabee and Ted Cruz. And now retired neurosurgeon Ben Carson has stepped in to make sure Muslims dont feel under-disparaged. Over the weekend, Carson said he would not want a Muslim to be president and doesnt believe the Muslim faith is consistent with the Constitution. A few days before that, Trump nodded along at a campaign event while a man said that President Barack Obama is a Muslim and, regarding Muslims in general, asked, \"When can we get rid of em?\", Trump inclusively responded: \"We are going to be looking at a lot of different things and, you know, a lot of people are saying that.\", Yes, and many of the same people applauded last weeks arrest of a Muslim teenager in Texas who brought a homemade clock to school to show his teachers. While police found that the clock was just a clock, Sarah Palin, a noted Trump enthusiast, showed her support for disenfranchising Muslim voters by saying: \"Thats a clock, and Im the Queen of England.\", In a \"Meet the Press\" interview that aired Sunday, Carson was asked if he believes \"Islam is consistent with the Constitution.\", \"No, I dont, I do not,\" Carson said.\"I would not advocate that we put a Muslim in charge of this nation. I absolutely would not agree with that.\", Now everyone knows Carson is a deeply religious man and the Constitution is his favorite part of the Bible. So he is presumably aware of Article VI, which states that \"no religious test shall ever be required as a qualification to any office or public trust under the United States.\", But sometimes you have to read between the lines and, using the special vision God has given you, see the parts of the Constitution the founding fathers wrote in invisible ink. Its there that youll find what Carson is talking about. I think. Anyway, no need to let facts get in the way of the Republican Party diversifying its base of insultees. And speaking of those insultees, theyd probably feel less insulted if they just agreed to a few minor compromises. For example, Mexican immigrants could build Trump the giant wall that he wants so bad, and then promise to immediately leave the country. Gay people could broker an accord with GOP candidates like Cruz and Huckabee easily if they would just stop wanting to get married, and, if its not too much trouble, stop being gay. And Muslims? Just three steps. I emailed the Council on American-Islamic Relations which loudly protested Carsons comments over the weekend and presented my proposal:, \"I feel like we can smooth this whole situation out fairly easily if Muslim Americans agree to three simple requests: stop using clocks; promise to never run for president; and accept Barack Obama as a fellow Muslim, regardless of what he says. Does this sound reasonable?\", To my surprise, Ahmed Rehab, executive director of CAIRs Chicago office, responded with the following VERY SERIOUS and in no way tongue-in-cheek statement that I absolutely believe is factual and not in any way satirical:, \"The Grand Ominous Conference of the Muslim Elders Of the Occidentals Of the West (GOC-MEOOOW) has been in caucus for 72 hours scratching their heads as to how to politely break the news to Dr. Ben Carson that weve ALREADY fielded a Muslim president. But we do pledge not to field another for at least 4 years to give non-Muslims a fair shot at the White House.\", See? Its not that hard, folks. If youve had your faith, sexuality or heritage insulted by a Republican presidential candidate, all you need to do is stop doing the things that make them uncomfortable. Then you can focus in on the important messages being delivered by these candidates. None of whom will ever become president. (Im pretty sure thats in the Constitution as well.), rhuppke@tribpub.com]", "Date": "20150921", "Author": "[Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-carson-muslim-president-huppke-20150921-story.html", "Title": "[ GOP finds diversity in offending voters]"}