{"Content": "[\"This was not a subject that was on anybodys mind until I brought it up at my announcement.\", Donald Trump, on immigration, Republican debate, Aug. 6, Not on anyones mind? For years, immigration has been the subject of near-constant, often bitter argument within the GOP. But it is true that Trump has brought the debate to a new place: first, with his announcement speech, about whether Mexican migrants are really rapists, and now with the somewhat more nuanced Trump plan. Much of it visa tracking, E-Verify, withholding funds from sanctuary cities predates Trump. Even building the Great Wall is not particularly new. (I, for one, have been advocating that in this space since 2006.) Dominating the discussion, however, are his two policy innovations: (a) abolition of birthright citizenship and (b) mass deportation. Birthright citizenship. If you are born in the United States, you are an American citizen. So says the 14th Amendment. Barring some esoteric and radically new jurisprudence, abolition would require amending the Constitution. Which would take years and great political effort. And make the GOP anathema to Hispanic-Americans for a generation. And for what? Birthright citizenship is a symptom, not a cause. If you regain control of the border, the number of birthright babies fades to insignificance. The time and energy it would take to amend the Constitution are far more usefully deployed securing the border. Moreover, the real issue is not the birthright babies themselves but the chain migration that follows. It turns one baby into an imported village. Chain migration, however, is not a constitutional right. Its a result of statutes and regulations. These can be readily changed. That should be the focus, not a quixotic constitutional battle. Mark Halperin and John Heilemann discuss Donald Trumps trip to the Iowa State Fair and the release of his immigration plan on With All Due Respect. Aug. 17, 2015. (Bloomberg), Mark Halperin and John Heilemann discuss Donald Trumps trip to the Iowa State Fair and the release of his immigration plan on With All Due Respect. Aug. 17, 2015. (Bloomberg), Mass deportation. On Sunday, Trump told NBCs Chuck Todd that all illegal immigrants must leave the country. Although once theyve been kicked out, we will let \"the good ones\" back in. On its own terms, this is crackpot. Wouldnt you save a lot just on Mayflower moving costs if you chose the \"good ones\" first before sending SWAT teams to turn families out of their homes, loading them on buses and dumping them on the other side of the Rio Grande? Less frivolously, it is estimated by the conservative American Action Forum that mass deportation would take about 20 years and cost about $500 billion for all the police, judges, lawyers and enforcement agents and bus drivers! needed to expel 11 million people. This would all be merely ridiculous if it werent morally obscene. Forcibly evict 11 million people from their homes? It cant happen. It shouldnt happen. And, of course, it wont ever happen. But because its the view of the Republican front-runner, every other candidate is now required to react. So instead of debating border security, guest-worker programs and sanctuary cities where Republicans are on firm moral and political ground they are forced into a debate about a repulsive fantasy. Which, for the Republican Party, is also political poison. Mitt Romney lost the Hispanic vote by 44 points, and he was advocating only self-deportation. Now the party is discussing forced deportation. It is not just Hispanics who will be alienated. Romney lost the Asian vote too. By 47 points. And many nonminorities will be offended by the idea of rounding up 11 million people, the vast majority of whom are law-abiding members of their communities. Donald Trump has every right to advance his ideas. He is not to be begrudged his masterly showmanship, his relentless candor or his polling success. I strongly oppose the idea of ostracizing anyone from the GOP or the conservative movement. On whose authority? Let the people decide. But that is not to say that he should be exempt from normal scrutiny or from consideration of the effect of his candidacy on conservatisms future. If you are a conservative alarmed at the countrys direction and committed to retaking the White House, you should be concerned about what Trumps ascendancy is doing to the chances of that happening. The Democrats presumptive candidate is flailing badly. Republicans have an unusually talented field with a good chance of winning back the presidency. Do they really want to be dragged into the swamps right now, on immigration that will make that prospect electorally impossible?, Yes, I understand. The anger, the frustration, etc. etc. that Trump is channeling. But how are these alleviated by yelling \"Im mad as hell\" and proceeding to elect Hillary Clinton?, Washington Post Writers Group, Charles Krauthammer is a Washington Post columnist. letters@charleskrauthammer.com]", "Date": "20150820", "Author": "[Charles Krauthammer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-immigration-hillary-clinton-hispanic-deport-perspec-0821-jm-20150820-story.html", "Title": "[GOP mired in immigration swamp]"}