{"Content": "[In his first two weeks as a declared presidential candidate, Gov. Scott Walker has touted himself as someone who can unite the country behind conservative reforms that he passed in a blue state. Its an appealing resume in a crowded Republican field from which no one has emerged as a front-runner. It also rings hollow to Walkers many critics in Wisconsin. After Walkers campaign manager said last week that the governor was running as a uniter, Jay Heck, executive director of Common Cause Wisconsin, said the assertion was like calling Donald Trump humble. Wisconsin Gov. Scott Walker has advice for Illinois Gov. Bruce Rauner on July 27, 2015. (WGN-TV), Wisconsin Gov. Scott Walker has advice for Illinois Gov. Bruce Rauner on July 27, 2015. (WGN-TV), Among conservative activists, Walker has built a reputation for honesty, driven by a perception that some politicians are all talk and no action, whereas Walker has achieved many conservative legislative victories in Wisconsin. People want leaders who are going to say what theyre going to do and then go out and do it, he said on a recent trip to Iowa. Walkers critics say thats not what hes offering, pointing to what they call a pattern of reversals and misleading statements. After saying repeatedly during his re-election campaign that a right-to-work bill would be a distraction and wouldnt reach his desk, he quickly signed it once the Republican-controlled Legislature passed it earlier this year then touted it as part of his presidential campaign. In a gubernatorial campaign ad, he emphasized that legislation he signed left the decision to have an abortion between a woman and her doctor. Last week, Walker signed legislation banning abortions after 20 weeks. And after a federal court overturned Wisconsins constitutional amendment banning same-sex marriage last year, Walker said the issue was over in Wisconsin. But after a more definitive ruling by the U.S. Supreme Court, he endorsed a constitutional amendment that would allow states to reinstate bans. Throughout his gubernatorial campaign, Walker deflected questions about his presidential ambitions, saying he was committed to the state. But within weeks of re-election, he pivoted to the early stages of a presidential campaign and traveled extensively outside the state as Republicans quarreled over major changes to his budget proposal. Walker is hardly unique among politicians in exaggerating or amending his record. But several statements hes made in the past two weeks call for additional context:, Walker: I think were doing pretty good considering I just announced on Monday and Im already in second place in the national polls. July 17 interview with reporters in Davenport, Iowa, The facts: Walker officially announced his campaign on July 13 in Waukesha, but aside from being able to say at last, Im running for president and Im asking for your vote, the governor has been going through the motions of campaigning since January. At least seven national polls since then have placed him in the lead or tied for the lead as he made multiple trips to Iowa, New Hampshire and South Carolina. Walker: I believe in balanced budgets. I went from $3.6 billion in the hole that I inherited to balanced budgets in each of the years Ive been in office. Weve created a surplus. July 17 town hall meeting in Cedar Rapids, Iowa, The facts: Walker inherited a more than $3 billion budget hole from his predecessor, former Democratic Gov. Jim Doyle. But Wisconsin law requires all governors to adopt a balanced budget. Also like other governors, Walker balanced the budget by pushing some of the states spending obligations onto the next budget. The latest state budget started about $2 billion in the hole after tax cuts took a bigger bite out of state revenues than initially projected. In the current budget, revenue is expected to exceed spending by $161 million this year, but fall $30 million short next year, leaving Wisconsin with a very small cushion compared with other states. But Those numbers rely on agencies finding more than $1 billion in unspecified cuts and revenues growing about 4 percent in each of the next two years. By the time work begins on the next budget, the states nonpartisan number crunchers project if revenues stay flat the state will be $210 million in the hole, which is a significantly smaller hole than in previous years, but isnt a surplus. Walker also has built up a $280 million rainy day fund. Walker: We need a leader whos not going to pit one group of Americans against another. July 17 town hall meeting in Cedar Rapids, Iowa, The facts: Before taking office Walker referred to public employees as the haves and everyone else as the have-nots. In January 2011, he told a billionaire campaign donor who wanted the state to pass right-to-work legislation that he would soon be introducing legislation as part of a divide-and-conquer strategy toward labor. The legislation, known as Act 10, virtually ended public sector collective bargaining, sparked massive protests in Madison and triggered a recall election that Walker ultimately won. Walker: Where would you rather spend this dollar? In Washington or at your kids and grandkids school? I think most of us would rather spend it in our school where you dont have all that money skimmed off the top with all the bureaucracy in Washington. July 17 town hall meeting in Cedar Rapids, Iowa, The facts: The vast majority of the money the U.S. Department of Education spends goes back into local classrooms or to help pay college tuition. With fewer than 4,000 employees, the department is the smallest federal agency. Administrative costs are about $2 billion, a fraction of the roughly $175 billion returned to the states in direct grants for special education and low-income students, Pell grants and other college loan programs, and other education programs. Walker: Im not blocking it. Im governor; I dont have anything to do with the federal government. July 19 conversation with a Wisconsin family in Plainfield, Iowa, about a federal lawsuit that has blocked President Barack Obamas executive order shielding immigrant families from deportation. The facts: A day earlier at the Family Leadership Summit in Ames, Walker touted his support for the lawsuit, in which Wisconsin has joined 24 states to block the order. Last fall I was one of the first governors to join the federal lawsuit saying the president has overstepped his constitutional bounds, Walker said. Walker: The issues they raise are literally about cases from four years ago when (the Wisconsin Economic Development Corp.) first started. Theyve put in place many positive reforms since then. July 22 interview with reporters in Nashville, Tennessee, The facts: Walkers flagship job-creation agency gave a $500,000 loan to a company without proper scrutiny in September 2011 at the urging of Walkers top cabinet secretary. The agency continued to seek taxpayer-backed funding for the company as recently as 2013, even after learning the companys owner, a top Walker campaign donor, had told a luxury car leasing company that he would repay debt with state funding. It sued the company last year and received a monetary judgment, but has yet to recover the money. Walker: I meet every week with all the legislative leadership in both chambers and both parties. July 22 radio interview with Steve Cochran, WGN-AM/720, The facts: Walker and Republican legislative leaders have said even with his busy presidential travel schedule this year, the governor meets with them regularly and stays in constant phone contact. But weekly meetings with Democrats? Not according to Senate Minority Leader Jennifer Shilling, D-La Crosse, and Assembly Minority Leader Peter Barca, D-Kenosha. Spokespeople for the Democratic leaders said they have met with Walker six times this year, while three other meetings were canceled.]", "Date": "20150727", "Author": "[Matthew DeFour]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-scott-walker-statements-20150727-story.html", "Title": "[Scott Walker's statements not always in line with actions]"}