{"Content": "[Ben Carson, who formally announced his run for the presidency Monday, is a brilliant surgeon, gifted storyteller and charismatic speaker. But modesty is not among his talents. The retired Johns Hopkins professors launch video, nearly five minutes long, positions the aspiring Republican presidential nominee right alongside Abraham Lincoln and Martin Luther King Jr. \"We can once again become the authors of ideas that have such profound magnitude,\" proclaims the deep voice-over, while Mount Rushmore appears on screen. \"Great transformations begin from a single event.\", Such as George Washington crossing the Delaware, or Ben Carson winning the Iowa caucuses. The video moves on to an American flag, the Declaration of Independence, a church and then the seated stone figure of Lincoln, enthroned at his memorial on the Mall. \"First we must heal, and healing requires a leader with calm, unwavering resolve someone more concerned about the next generation than the next election.\", Someone such as Lincoln. Or Ben Carson. Presently we see a statue of King, at his memorial on the Tidal Basin. \"Someone who knows the pursuit of happiness is best fostered with opportunity and justice for all,\" the narrator continues. Someone such as King. Or Ben Carson. We see the Empire State Building, the Golden Gate Bridge, a bald eagle, a snowcapped mountain, wheat fields and Carson, reclining in a business suit, with what appears to be a Bible at his side. The camera zooms in on this portrait of Carson. \"We can see this through together, with a leader who derives his strength from God and his duty from the American people,\" the narrator intones. Words appear \"Heal Inspire Revive\" and we hear the voices of the Selected of God choir, which previously helped Chrysler sell cars in a Super Bowl ad. The video, which Carsons campaign says was set to the music of hip-hop producer Alexi von Guggenberg, is delightfully over the top. And this is why Carsons long-shot candidacy should be such an exciting addition to the presidential race. His positions, his provocations and his showmanship are all delightfully over the top. Since coming to prominence a few years ago when he blasted President Barack Obama at the National Prayer Breakfast, he has called Obama a psychopath, compared the United States to Nazi Germany, and labeled Obamacare the worst thing since slavery. On Monday, Carly Fiorina was the victim of Carsons excess. The former executive, like Carson mounting an outsider bid for the Republican nomination, had a fairly standard kickoff. She announced her bid on \"Good Morning America,\" posted a short announcement video and took questions online. \"This is a pivotal point for our nation, and so I think its totally reasonable to look outside the political class thats been in Washington for a really long time,\" she told George Stephanopoulos. Carson, easily eclipsing Fiorina, used almost those exact words in his larger-than-life announcement video. \"Historians will write about this critical turning point for our nation,\" proclaims voice-over artist Gerald McBride, whose website features his recent work for a Detroit jeweler. (\"Our unmatched selection of diamonds, watches and more!\") For Carson, McBride says, \"We can no longer afford ... the empty rhetoric of the political class.\", Carson has little in common with the political class but for one thing: his absolute confidence in his own greatness as seen again in his kickoff extravaganza. A lengthy, multigroup musical performance preceded his kickoff speech Monday morning at the Detroit Music Hall. The program included \"America the Beautiful,\" \"Battle Hymn of the Republic\" and, of course, a screening of the Rushmore-Lincoln-King-Carson video. Carson then emerged and introduced his wife, who, he said, generally loses to him at pool. (He predicted the headline: \"Carson admits he beats his wife.\") From there, it was a 30-minute Carson performance, with roving microphone and without notes, ranging from the patriotic to the self-indulgent. Carson, his eyes puffy (his mother is gravely ill), spoke about his childhood (\"I remember when our favorite drug dealer was killed\") then rambled from Nathan Hale to Saul Alinsky, from the Baltimore \"turmoil\" to Obamacare. \"We have allowed the purveyors of division to become rampant in our society,\" said the man who called the president a psychopath. At last, after Carson said he would make it to the White House \"if God ordains it,\" an enormous flag descended at the back of the stage, and the choirs again crooned the last bars of the \"Battle Hymn\": \"His truth is marching on.\", Amen. Carsons version of the truth and his irrepressible ego are going to make 2016 a whole lot more entertaining. Washington Post, Dana Milbank is a Washington Post columnist. Twitter @Milbank]", "Date": "20150505", "Author": "[Dana Milbank]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-ben-carson-washington-lincoln-rushmore-mlk-president-perspec-0506-jm-20150505-story.html", "Title": "[Ben Carson's ego just made 2016 more exciting]"}