{"Content": "[Mayor Rahm Emanuel must come up with at least $754 million in new revenue and budget cuts to balance the citys books, according to preliminary 2016 budget estimates the administration released Friday. A little less than half $328 million would cover increased payments to the police and fire pension funds that Emanuel and aldermen did not account for in this years budget. That number could be even higher if the mayor doesnt get the pension relief hes seeking from Springfield. In addition, City Hall must figure out how to close a projected $426 million hole in next years budget, an annual financial analysis showed. The shortfall comes as Emanuel has been borrowing at high interest rates to keep the city afloat. Unlike previous years, Emanuel is not taking a property tax increase off the table. At a news conference this week, the mayor would not rule out a politically unpopular property tax hike, saying hell wait to show his hand until September, when he rolls out \"a full budget with all parts in there.\", A leading budget expert said homeowners should prepare themselves. \"It is very difficult to see how the city could come up with $328 million increased contribution to the pensions without a significant increase in the property tax and/or the sales tax,\" said Laurence Msall, president of the nonpartisan Civic Federation budget watchdog group. A property tax is the likely culprit, given that Cook County Board President Toni Preckwinkle recently engineered a penny-on-the-dollar sales tax hike, returning Chicagos rate to the highest of any major U.S. city. City Budget Director Alexandra Holt has set up August meetings to discuss the budget gap with aldermen, many of whom have floated ideas to bring in more money. Among them: charging for trash pickup, adding a tax on sugary beverages, extending the cigarette tax to smokeless tobacco and prodding the state to expand sales taxes to include services. \"The mayors instructions to me this year are not different than they have been the last four years, which is that you start with the reforms, you start with the savings, you start with the efficiencies,\" Holt said Friday. \"The place that you do start is reforms and savings, because you have to do that before you go to people and say, OK, you do need to pay more. \", Holt also said the city plans to hold town hall meetings \"where the mayor is going to hear directly from the public about what they want to do.\" At those meetings, people will be informed of the effects of potential budget cuts on services. Emanuel, meanwhile, said he has dispatched Holt to meet with Inspector General Joseph Ferguson to discuss ways to close the gap. In 2011, Ferguson released a report listing a smorgasbord of ways to increase revenue and cut costs that ran the gamut, from requiring all documents be printed on two sides and reducing firetruck staffing, to boosting the property tax or imposing a city income tax. But many aldermen concede that a property tax increase is likely, given that its a major revenue generator the city controls without needing approval from state government, which is locked in a partisan battle over its own budget. Some aldermen have gone so far as to propose ways to soften the blow of a property tax increase on low-income and elderly homeowners, figuring a hike is inevitable. The $328 million increase in police and fire pension fund contributions could hit $549 million if Republican Gov. Bruce Rauner does not sign legislation that would allow Emanuel to pay less upfront and take longer to pay off the retirement fund debt. State lawmakers approved the legislation but have yet to send it to Rauner, given the stalemate at the Capitol. The $426 million budget gap projected for next year breaks down into three parts: $233 million for day-to-day city operations, a $93 million increase in payments to all four city pension funds and $100 million to pay down debt instead of push it off into the future at higher cost. Emanuel could catch a break in next years budget after a Cook County judge recently tossed out changes the city made to pensions for retired city workers and laborers. The law was found unconstitutional because it cut benefits, but the measure also required the city to put more money into the two retirement funds. That higher contribution wouldnt have to happen next year if Emanuel loses his appeal to the Illinois Supreme Court. The downside: Long-term pension debt would grow by hundreds of millions of dollars a year down the line. The bottom line, Msall said, is that tough financial times are ahead. \"What this report is a clear indication of is that the City Council and the administration have to move forward on reduced spending, elimination of unnecessary expenditures, greater efficiencies, but also a reality that they are going to need new tax revenue,\" he said. Chicago Tribunes Bill Ruthhart contributed. hdardick@tribune.com, Twitter @ReporterHal, ]", "Date": "20150731", "Author": "[Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rahm-emanuel-chicago-budget-shortfall-met-0801-20150731-story.html", "Title": "[Emanuel needs $754M more to make ends meet]"}