{"Content": "[With criticism mounting from businesses, educational institutions and human rights groups, Indianas Republican legislators are seeking to mitigate the fallout from last weeks passage of the Religious Freedom Restoration Act. Some GOP officials are talking about inserting language to clarify its intent, but Democrats say the only fix is repeal or inserting protections for sexual orientation and gender identity into Indianas civil rights law. The bill, which was signed into law by Gov. Mike Pence on Thursday, has been criticized for potentially allowing businesses to discriminate against the LGBT community, but supporters say the legislation was necessary to strengthen Indianas already robust religious freedom protections. Northwest Indianas General Assembly delegation was split along party lines with Republicans voting in favor of it, including Rep. Hal Slager, R-Schererville; Rep. Ed Soliday, R-Valparaiso; Rep. Julie Olthoff, R-Crown Point; Rep. Bill Fine, R-Munster; Sen. Rick Niemeyer, R-Lowell, and Sen. Ed Charbonneau, R-Valparaiso. Democrats voted against it, including Rep. Charlie Brown, R-Gary; Rep. Vernon Smith, D-Gary; Rep. Linda Lawson, D-Hammond; Rep. Chuck Moseley, D-Portage; Rep. Scott Pelath, D-Michigan City; Sen. Earline Rogers, D-Gary; Sen. Karen Tallian, D-Ogden Dunes; Sen. Lonnie Randolph, D-East Chicago; and Sen. Frank Mrvan, D-Hammond. The negative reaction has been swift with businesses such as Angies List and Salesforce reversing plans for significant investment in the state and several conventions either threatening or deciding against holding their events Indiana. Valparaiso University President Mark Heckler joined other university leaders across the state in calling for legislators to amend the law as well as using \"this opportunity to advocate for the values held by all those who strive to make Indiana a welcoming and inclusive state.\" , Pence, House Speaker Brian Bosma, and Senate President David Long have indicated a willingness to add language that would bar any discrimination, but theyve stopped short of making sexual orientation a protected class in the states civil rights statute. Brown, the Gary Democrat, said Republicans spent much of Monday afternoon in a caucus. , \"I think theyre spending quite a bit of time saying what do we do now?,\" Brown said. \"They have limited choices now, but the real question is theyre still in the majority will they be able to go against what many of their members wanted? Theyve been opposed to the effort to recognize gay marriage in Indiana.\", Slager said he was supportive of the bill, but hes not sure how the effort to clarify the bill will shake out before the session ends on April 29. \"As I understood it, 30 other states have adopted (RFRA bills) or used it as a standard in common law, it was providing guidance to courts on how they would sort through issues when peoples rights are in conflict,\" Slager said. \"I didnt think much about it. Now it seems to be evolving into discussion about making gays and lesbians a protected class. \"Im kind of at loss on how it got to this point.\", Indianas law is similar to a federal RFRA passed in 1993 and versions passed in 20 other states, but it differs from most versions in a few respects. Under the definition of persons covered by the law, Indiana includes for-profit corporations. It also covers not only disputes between a person and the government, but between private citizens, thus opening the door for businesses to refuse service. VU law professor Ivan Bodensteiner said he doesnt see the act as having much at all to do with religious freedom. \"As to whats going on here, this might be whats been referred to by (Supreme Court) Justice Anthony Kennedy as a law born of animosity. Is it really about religious freedom, or is it really about allowing people to use religion as a pretense for discriminating?\", For example, Bodensteiner said the law would give an apartment complex in a community that has an anti-discrimination ordinance a defense if they refused to rent to a gay tenant and cited their religious beliefs. Brown said the debate about citizens being denied services brings back uncomfortable echoes of Jim Crow laws that discriminated against blacks. \"Not wanting to provide services to people that just gets to the bottom of my soul, for people to hide behind religion and be so mean and cruel,\" Brown said. \"As a racial minority, it deeply offends me.\", Tallian, from Portage, said Republicans had a chance to clarify the bill via amendments in both chambers, including one in the Senate that would made the law inapplicable to \"any state law or local ordinance that prohibits discrimination on the basis of sexual orientation. It was defeated 40-10. \"RFRA excludes things that are already included in our civil rights law, but we continue to not have protections for sexual orientation in our law,\" Tallian said. \"Thats why Indiana is worse off than Illinois and other states. \"Look, they say this not about discrimination, but as long as youre not willing to say OK to a change in the civil rights law, then we kind of dont believe you. Your motives are suspect.\", Tallian said any clarification measure would likely go in the budget bill, which can include any topic.]", "Date": "20150331", "Author": "[Christin Nance Lazerus]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-religious-freedom-legislators-st-0331-20150331-story.html", "Title": "[ GOP hope to clarify new law; Dems want gay rights protected]"}