{"Content": "[Marilu Fanning wanted no part of a \"hatchet job\" column on Republican presidential candidate Donald Trump. The Lake Station woman would vote for Trump in a heartbeat, despite his abrasive antics, showboat remarks and lack of any public office experience. \"Trump certainly leaves himself open to criticism, but hes the first politician I can think of who is stronger than the press,\" she said. \"Trump will come across as Trump no matter how the media tries to slant and spin him. I predict that eventually they will be on his side and he will be as popular with the press, and us as well, as John F. Kennedy.\", Marilu Fanning of Lake Station says she would vote for Republican presidential candidate Donald Trump. Marilu Fanning of Lake Station says she would vote for Republican presidential candidate Donald Trump. Those are very high aspirations and expectations, reflected by millions of American voters, including many in Northwest Indiana. Trump has made splashy headlines since throwing his hair into the ring blasting outrageous sound bites with off-putting candor but why would anyone vote for him?, \"For one, I dont think a lot of people see his flaws as flaws,\" Fanning replied. \"The bottom line is his success. Its the foundation that all of America knows well.\", For example, she pointed to the towering yet controversial Trump building in Chicago. \"He comes to town, says Im going to build a giant building with my name on it. The mayor says Oh, no youre not, and Trump says, Lets talk. Two years later, theres a tower with his name one it,\" Fanning said. \"The man gets things done in a world of unfriendly politicians and union labor, and that is something no one can take away from him and no one can come close to matching.\", By far, most of the Trump supporters in this area who contacted me are women. Many said theyre attracted to his maverick-like style in a GOP candidate pool of politically correct political types who come across as too wishy-washy on every hot-button issue. \"Why Id vote for Donald? He cant be bought,\" Elaine Herrmann said. \"Maybe, just maybe, our country would function without all the financial hassles of the corporate world. Corporations, in turn, wouldnt need lobbyists and that leads to less benefits being paid out.\", During Wednesday nights marathon Republican presidential debate, Trump came across as, well, Trump, again forcing his opponents to react to his statements. Not the other way around. I think voters love these edgy encounters, regardless if theyll vote for him or not. Im sure millions of voters who tuned in to the debate would otherwise have nothing to do with such a political event so early in the presidential race. Why? To see what Trump would say and how other candidates would respond. At the very least, hes the catalyst for a dialogue. \"If Trump can grab a seasoned veterans attention like (long-time White House media correspondent) Brit Hume, hes going to reach a lot of people who normally dont pay that much attention,\" Fanning said. \"American politics is always about image and headlines. Hes way ahead of the field on that one. I dont think the other candidates are on the same lap as Trump.\", Like a good book, she noted, you just cant put him down. However, will this novel narrative be enough of a story to win the GOP nod? Enough to beat Hillary Clinton or Bernie Sanders in November next year? Enough to reunite Americans and solve the many intrinsically complex problems that plague our country?, \"Trump will investigate. Trump will prosecute. Trump will go after everyone involved just for fun,\" writes author, speaker and politician Wayne Allyn Root. \"That will all happen on Trumps first day in the White House. Who knows what Trump will do on Day 2?\", In his latest commentary regarding Trump and his chances for the White House, Root articulates the hopes of many disgusted and disappointed middle-class Americans. \"Thats why the dogs of hell have been unleashed on Donald Trump,\" writes Root, author of \"The Murder of the Middle Class,\" a book on the \"unholy conspiracy\" between big government, big business and big media. Local voters such as Fanning, Herrmann and likely tens of thousands of others are fed up with big government, big business and big media. So much so that a blow-hard billionaire with a loose cannon for a mouth looks appealing, if not a legitimate candidate for the highest office in the land. \"One might think his candor is refreshing in a room full of meet the new boss, same as the old boss stodgy politicos, but anarchy is also refreshing in a disastrous sort of way, isnt it?\" asked Dawn Kirk of Crown Point. \"There is no way he really wants to do the job,\" added Kathy Sturm of Merrillville. \"Its too much like work and hell drop out before he lets that happen. Hes just in it for publicity, and media is giving him exactly what he wants.\", So does Trumps run for president say more about us than about him? More about our country than about all the presidential candidates seeking to live in the White House?, Are we this disappointed with President Obama and his administration? Are we this disillusioned with American politicians? Are we this disgusted with the direction of our nation?, Its hard to fathom that this political climate can create the perfect storm of circumstances to elect someone like Trump into office. Or is it?, \"Theres only one man who isnt beholden to anyone,\" Root writes, echoing what Im hearing from local Trump supporters. \"Trump has the audacity to ask out loud why American workers always get the short end of the stick.\", I think the obvious winner of Wednesday nights debate was Carly Fiorina, who also offered the single best quote in response to Trumps previous insult about her looks. \"I think women all over this country heard very clearly what Mr. Trump said,\" she said. Possibly, but many of the women who contacted me are clearly hearing something else about him. And theyre clearly buying what hes selling. jdavich@post-trib.com, Twitter: @jdavich]", "Date": "20150917", "Author": "[Jerry Davich]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/opinion/ct-ptb-davich-trump-voters-st-0918-20150917-story.html", "Title": "[Trump catches wave in perfect storm of disgust over status quo]"}