{"Content": "[It wasnt long ago that the forecasting arm of the Wisconsin legislature was predicting that state government by mid-2015 would be flush with a surplus topping $1 billion, which Gov. Scott Walker could have showcased in his bid for the Republican presidential nomination. Today, that projected surplus has morphed into a $2.2 billion budget deficit that Republican lawmakers are struggling to fix. Sharp divisions between Walker and legislators about how to solve the problem have complicated his plans for formally entering the already crowded field of GOP presidential hopefuls. When he does, his financial stewardship may prove more political vulnerability than bragging point. Governor Walker is now revealing he plans to announce his presidential plans in mid-July. June 26, 2015. (WTMJ Milwaukee), Governor Walker is now revealing he plans to announce his presidential plans in mid-July. June 26, 2015. (WTMJ Milwaukee), Once in lockstep with Walker, GOP lawmakers are flashing some independence as they struggle to make ends meet. They have refused to go along with the governors proposed cuts in money for elementary and secondary schools and his plans to finance a big boost in road construction solely by borrowing. They have also forced him to moderate his proposed reductions in funds for higher education. Dale Knapp, research director for the nonpartisan Wisconsin Taxpayers Alliance, said the states current budget woes are in great measure \"self-induced.\" Walker and Republican allies in the legislature gave themselves no cushion for error in their bet that broad tax cuts would jump-start the states economy and more than pay for themselves. \"When the new projections didnt materialize, we put ourselves into a hole,\" Knapp said. State Sen. Scott Fitzgerald, that chambers Republican majority leader, laid blame for Wisconsins financial problems not on tax and spending cuts but on a still-sputtering national economy. \"Were still waiting for it to kick in, and I think were better positioned to be successful when it does,\" said Fitzgerald. That said, Fitzgerald acknowledged that a round of tax cuts lawmakers enacted last year had made it more difficult to reach agreement on a new budget. \"Its got us boxed in,\" he said. Spokeswomen for Walkers campaign-in-waiting did not respond to questions about Wisconsins economic performance during his tenure. Just days after taking office in 2011, Walker launched a high-profile drive to lure business from neighboring Illinois. It featured highway billboards and an opinion page piece in the Chicago Tribune contrasting his less-is-more approach to taxes and business regulation with that of Illinois Democrats. Walker then capped his first month in office with a State of the State speech that summed up his pro-growth manifesto with the words of a homestate Green Bay Packers icon. \"Coach Vince Lombardi once said, Success demands singleness of purpose, \" Walker declared. \"We are defining success for this administration by our ability to shape an environment where 250,000 jobs are created. Every action of our administration should be looked at through the lens of job creation.\", Viewed through that lens, Walker significantly missed. Federal data show Wisconsin added a little over 119,000 jobs over Walkers first term, less than half his goal. From 2011 to 2014, the pace of private-sector employment growth in Wisconsin ranked 36th among the states and the District of Columbia, according to the federal Bureau of Labor Statistics. Walkers state ranked behind all its Rust Belt neighbors, Illinois included. Wisconsin even trailed Kansas, which has been the focus of national attention after steep tax and spending cuts pushed by Republican Gov. Sam Brownback produced big government deficits but little economic pop. The number of jobs in the private sector grew by 5.7 percent in Wisconsin over the last four years, federal numbers show. Nationally, the growth rate was 9.3 percent. Walker won a second term last year with 52.3 percent of the vote after an initial four years marked by huge and raucous protests against his anti-union policies as well as a 2012 recall vote that he survived. His staredown with organized labor raised Walkers profile in national conservative political circles and clearly has played a role in his presidential ambitions. As he ran for that second term in 2014, Walker assured voters that the state was in the best financial shape in years and would begin this year with a surplus. Instead, even before he could take the oath for a second time, Walkers own Department of Administration warned that expected tax revenues and spending requests were out of whack and the state budget was headed for a more than $2 billion deficit over the next two years. In response, Walkers budget for the 2016-17 biennium proposed significant cuts in aid to elementary and secondary schools and the University of Wisconsin system. At the same time, he wanted to spend $220 million to help the Milwaukee Bucks basketball team build a new stadium. He also proposed putting $1.3 billion in new road spending on the states credit card with no added source of revenue to cover the increased borrowing costs. By April, a poll conducted by the Marquette University Law School showed Walkers job approval ratings had taken a big hit. Just 41 percent of Wisconsin registered voters surveyed said they approved of the way he was handling himself as governor, with 56 percent expressing disapproval. \"His notion that we fixed everything and its all hunky-dory just isnt holding up,\" said Charles Franklin, director of the Marquette poll. In early 2014, the Legislative Fiscal Bureau, the bipartisan financial scorekeeper for the Wisconsin legislature, had forecast a budget surplus that would reach $1.04 billion by the end of this June. Jon Peacock, director of the Wisconsin Budget Project, a liberal group, said Walker and Republican lawmakers spent that projected surplus by engaging in a new round of tax cutting after already slashing taxes in previous years. \"There are lots of conservatives who truly did believe that we would grow our way out of any predicament,\" said Peacock. \"But the economy in Wisconsin has slowed down and we continue to lag behind the national recovery.\", The Legislative Fiscal Bureau has estimated that tax cuts during Walkers first term sliced state revenues by more than $1.9 billion. As they try to dig out of the problems, legislative Republicans have quarelled with Walker over several issues, including the basketball stadium. Walker has significantly scaled back his original spending plans for the arena, but some Republicans remain uncomfortable with imposing budget austerity while helping to finance a stadium largely for private interests. Another big sticking point is Walkers budget for roads, with fiscal hawks in the Republican caucus balking at the governors plans to finance it solely through borrowing. With a presidential campaign looming, Walker remains opposed to raising the states gas tax or vehicle license fees common means to defray the costs of borrowing for transportation spending. Without creating such a new source of revenue, one out of every $4 in the state road fund would be spent on loan interest and principal rather than on actual construction, budget experts warn. Republican lawmakers now find themselves haggling over which road building projects to delay or eliminate, even though highway spending typically produces jobs and is popular with voters. The road building industry, which has much to gain from robust construction, finds itself between concrete and a hard place. \"We have been consistent from the beginning of this process that if leaders arent willing to raise the needed revenues to pay for transportation investments, then we need to live within our means and not rely on an excessive amount of borrowing,\" said Pat Goss, executive director of the Wisconsin Transportation Builders Association. Walkers camp has sought to downplay the budgeting friction as well as the subpar employment figures, highlighting instead an alternative set of federal numbers showing that the unemployment rate in Wisconsin is better than the national average. That is a turnabout for Walker; during his 2012 recall battle, he cast doubt on the reliability of that federal jobs data when it indicated employment in the state was shrinking. Such rhetorical moves may be contributing to Walkers declining popularity with Wisconsin voters. \"Its hardly surprising that he minimizes problems,\" said Franklin, the Marquette pollster, \"but there are problems, and his minimization is not compatible with the difficulty we see ourselves in.\", bsecter@tribpub.com]", "Date": "20150629", "Author": "[Bob Secter]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-scott-walker-wisconsin-budget-met-20150626-story.html", "Title": "[Budget woes complicate Gov. Scott Walker's White House ambitions]"}