{"Content": "[On the same day that Caitlyn Jenner appeared on the cover of Vanity Fair, a federal government agency coincidentally came out with guidelines addressing transgender people in the workplace. The four-page guide from the Occupational Safety and Health Administration addresses a very specific area of the workplace: bathrooms. OSHA recommended that transgender workers should have access to restrooms that correspond to their gender identity. It sounds like common sense. But bathroom access for transgender individuals has generated controversy and led to claims of discrimination. Transgender people face many forms of discrimination on the job, according to legal experts, but restroom restrictions can be especially hurtful. \"Its a uniquely intimate and humiliating form of discrimination,\" said Matt Wood, supervising staff attorney at the Transgender Law Center in Oakland, Calif. \"It singles out transgender people for stigma and shame.\", OSHA says bathroom access is more than a civil rights issue. Its also a safety and health matter on the job, which comes under the agencys jurisdiction. OSHA has a wide scope, regulating everything from noise exposure to hazardous materials to cleanliness. As part of its sanitation standard, the agency ensures employees have easy access to clean restrooms. Problems arise, according to OSHA, when employers restrict access or segregate transgender people from other workers by requiring them to use gender-neutral or other specific restrooms. For example, if a transgender woman has to use the mens room, she may fear for her safety. OSHA also said that if transgender people are uncomfortable in using a particular bathroom, they may avoid using restrooms entirely while at work, creating health concerns. OSHAs advice is part of a broader push by the government to protect lesbian, gay, bisexual and transgender employees. President Barack Obama signed an executive order last year prohibiting job discrimination against LGBT employees of federal contractors and the federal government. A few months later, in December, the Justice Department issued a memo confirming that prohibitions on sex discrimination also ban employment discrimination based on gender identity or transgender status. An estimated 700,000 adults in the United States are transgender, according to OSHA, citing the Williams Institute at the University of California at Los Angeles. These individuals face widespread mistreatment at work. In a 2011 study by the National Center for Transgender Equality and the National Gay and Lesbian Task Force, 90 percent of the 6,450 transgender people surveyed reported experiencing harassment, mistreatment or discrimination on the job. About one-quarter said that they had lost a job due to being transgender. The survey also found that many attempted to avoid discrimination by hiding their gender or gender transition. OSHAs recommendation on bathroom access is needed because it is a problematic issue for employers, said Scott Eldridge, a partner at Miller Canfield who practices management-side labor and employment law. \"In my practice, I have fielded a number of calls from clients of mine with this very issue,\" he said. Wood, of the Transgender Law Center, said a lot of employers want to deal with transgender employees on issues of restroom access and dress code on a case-by-case basis, which he considers a recipe for a lawsuit. On Thursday the U.S. Equal Employment Opportunity Commission sued Deluxe Financial Services, a check-printing company based in Minnesota, for refusing to let a transgender woman use the womens restroom. The lawsuit on behalf of Britney Austin also alleged her managers and co-workers intentionally referred to Austin with male pronouns and made fun of her appearance. The company did not return a phone call seeking comment. The suit follows a significant decision by the EEOC in April, ordering the Department of the Army to pay damages to a transgender employee, Tamara Lusardi. After Lusardi, a disabled veteran, transitioned from male to female on the job in 2010, her supervisor continued to call her \"sir\" and \"he,\" and she was told she could not use the same restroom as other female employees. Lusardi was required to use a single-person, gender-neutral restroom out of concerns that other employees might feel uncomfortable sharing a restroom with her. The restroom restriction \"served as a constant reminder that she was deprived of equal status, respect, and dignity in the workplace,\" according to a report by the U.S. Office of Special Counsel, which investigated Lusardis complaint. \"Like anyone else, I just want the freedom to be myself at work,\" Lusardi said in a statement posted on the website of the Transgender Law Center, which represented her. \"I hope my case and this decision will help other transgender people feel safe enough to bring their full authentic selves to work.\", OSHAs advice is consistent with the EEOC ruling in the Lusardi case that found restroom restrictions unlawful, Eldridge said. The agency further instructed that employers should not ask workers to provide any documentary proof of their gender identity. Wood, however, advises transgender employees to talk to their bosses. \"I counsel employees that it may be a good idea to talk to human resources and think about what the transition looks like and what you will need to make sure the transition goes smoothly,\" he said. Eldridge said OSHAs guidance was lacking in one area: The agency didnt bring up how employers should address other employees concerns about sharing a restroom with a transgender person. But Wood said he has a simple answer to co-worker anxiety about bathroom access: \"The best response for an employer is to say they have to comply with federal law.\", asachdev@tribpub.com, Twitter @ameetsachdev]", "Date": "20150605", "Author": "[Ameet Sachdev]", "Link": "http://www.chicagotribune.com/business/ct-osha-transgender-0607-biz--20150605-story.html", "Title": "[ OSHA issues guidelines on restroom access for transgender workers]"}