{"Content": "[Brushing off criticism from a majority in Congress, President Barack Obama said Republicans are reflexively opposing the Iran nuclear deal because his name is on it. Ahead of next months deadline for a vote that could derail the agreement, Obama argued in two interviews released Monday that solid GOP opposition was unsurprising. He cited Republicans resistance to his health care law and budget proposals as evidence that their recent hostility had nothing to do with whats in the deal. \"Unfortunately, a large portion of the Republican Party, if not a near unanimous portion of Republican representatives, are going to be opposed to anything that I do,\" Obama told NPR News. That hasnt always been the case. In June, Republicans drove legislation through that gave Obama expanded authority to negotiate trade deals with Europe and Asia, even as many in Obamas own Democratic Party deserted him. Many Republicans also have shown a willingness to work with Obama on criminal justice matters and on military spending that exceeds caps imposed by both parties. On the Iran deal, Obama has tried to discredit the opposition and attract as much Democratic support as possible before Congress votes on the agreement roughly a month from now. The White House has acknowledged that Congress probably will pass legislation opposing the deal, which Obama will veto. Obamas goal is to secure enough Democratic votes to prevent Congress from overriding his veto. So far, some three dozen House members, all Democrats, have announced support, along with nearly 20 Democratic senators. Hawaii Sen. Brian Schatz and Minnesota Sen. Amy Klobuchar on Monday became the latest to side with Obama. \"There is no other alternative that achieves these results,\" Schatz said. A blow came last week when New York Sen. Chuck Schumer, in line to be the top Democrat in the Senate, announced his opposition. Obamas interviews were recorded before Schumers announcement, but were released Monday as the White House tried to keep the presidents voice in the debate during the August lull. Lawmakers have left Washington for their annual congressional recess, and Obama is in Marthas Vineyard in Massachusetts for his family vacation. In an interview with online news site Mic, Obama shifted his focus to young people, including some in Iran and Israel who posed questions to the president via video. Asked by a 22-year-old woman in Iran why Obama had to hurt the Iranian people with harsh economic penalties to get a deal, Obama said his hand was forced because his outreach to Irans supreme leader went unrequited while the U.S. caught Iran secretly enriching uranium at its Fordow facility. \"Unfortunately we didnt have a better way of doing this,\" Obama said. \"What we had to do was to more severely enforce sanctions so that Iran had greater incentive to come to the table and negotiate.\", Also Monday, the White House said Obama will host a nuclear security summit in late March and early April in Washington. Associated Press]", "Date": "20150810", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-iran-nuclear-deal-gop-obama-20150810-story.html", "Title": "[Obama says GOP opposing Iran deal over politics, not merits ]"}