{"Content": "[Donald Trump stopped in Chicago on Monday to warn people about the dangers of illegal immigration and explain why he should be elected president of the most powerful nation on the planet. I couldnt help thinking that Kim Kardashian has a lot of the same qualifications as Trump (a successful reality TV show and a growing business empire) and was recently named one of the most influential people in America. Together, they would form a powerful ticket and represent pretty much everything this country has come to stand for self-promotion, self-absorption and self-glorification. If you really want to know who Trump is, take a look on the Internet at his gold-plated Manhattan penthouse apartment. According to one website, the front door is covered in gold and diamonds, another describes the cherub statuary, theres an indoor fountain, a mural painted on the ceiling and very uncomfortable-looking chairs as far as the eye can see. A sultan of old would feel right at home in these digs, so its understandable that Trump would be concerned about the barbarians storming across our borders, raping women and ravaging the countryside. On Monday, he was the featured speaker at a luncheon hosted by the prestigious City Club of Chicago. More than 2,000 people were on a waiting list for the event, according to reports the greatest interest apparently ever shown in one of the organizations guests, which usually include Chicago politicians, Illinois governors and assorted representatives from the Chicago business community. Trump, the successful host of \"The Celebrity Apprentice\" and a real estate billionaire, is bigger than any of them, which had to inflate his already massive ego. As Ive stated in the past, the first qualification of presidential candidates is deep belief that they are better, brighter and perhaps even prettier than any other human being. Who but such a person would consider himself qualified to hold a job where the lives of billions throughout the world are at stake and a push of button can incinerate the planet?, Yes, in this great land of ours, virtually anyone can be the president, but it takes an individual with a terrible personality disorder to believe that he actually deserves the job. I do not contest Trumps credentials. Theres a feeling among many people in this country that as a businessman who is not a career politician, Trump is better qualified than the 118 other candidates who have announced, or plan to announce, their presidential campaigns. That feeling is that someone who knows how to make money by buying, selling and even closing companies is a person who can get things done. Those who have held government office in the past, from Abe Lincoln to Barack Obama, have been disappointments. Kim Kardashians net worth is reported to be $85 million. She has a cosmetics line; gets paid huge amounts of money to show up at club and shop openings, parties and other events; is part of her familys fashion clothing line that has sold hundreds of millions of dollars worth of garments; is a model and, of course, stars in the Kardashians reality TV show. Her wedding dress cost $2.1 million, and she drives a Ferrari and a black Rolls-Royce Ghost, among other vehicles. In addition, she is said to be one of the most successful social media marketers in the history of the world. And shes only 34. I mention all this to establish her credentials as someone who knows how to spend money on herself, which indicates she would not have the socialist tendencies of those who dominate Congress. My guess is she knows little about foreign policy, street crime or the hundreds of other issues national leaders are asked to deal with on a regular basis but neither does Trump. Very few people have all the necessary qualifications, including many who have lived in the White House. What Trump, Kardashian and other successful people have in common is branding. Their names may be better known than their accomplishments, sort of like Colonel Sanders without the fried chicken. And, as you know, the colonel remains so important to the identity of the restaurant chain he created that an actor now appears in commercials wearing a white suit and a beard to convince people that nothing has changed but the name of Kentucky Friend Chicken, which is now KFC. I am not sure what Trump actually stands for as a political candidate. He told the Chicago Tribune that street crime in Chicago is out of control because cops arent tough enough in this city, so he apparently yearns for the days of former police Cmdr. Jon Burge. Burge, who was sentenced to 41/2 years in federal prison for perjury, led a crew of police officers who for years beat and tortured confessions out of people suspected of committing crimes. Unfortunately, some of them werent criminals, but the crew made sure they were sent to prison anyway. \"You need tough cookies,\" Trump told the Tribune. \"These (street gang members) are tough kids. These are not babies. If they saw you walking down the street, they wouldnt give a damn about you. You cant be so gentle with these people.\", He also said you cant stop crime by being nice. \"Youre going to stop it by being one tough son of a bitch.\", And what do we do with a cop who was tough, we send him to prison for perjury. Perjury! Im surprised Trump didnt think to have his photo taken sitting with Burge in his federal prison cell, arm draped over a shoulder. Trump is controversial, but he says what he thinks and thats refreshing. At least, thats what his supporters would tell you. Its not every day you hear a successful businessman say the sort of stuff you might hear from a drunk in a neighborhood tavern. Professional politicians are way too slick to say what people on the street are thinking. The Donald has the pulse of the people. Hey, the guy talked about visiting a White Castle when he was a kid in Brooklyn. \"I dont know if theyre even still around,\" he said after talking about how good the burgers used to be. Well, you cant expect a presidential candidate to know everything, can you?, And as for former Gov. Rod Blagojevich, convicted of political corruption and serving a 14-year federal prison sentence, Trump called him a \"very nice guy.\", At the City Club, Trump stood by his comments about illegal immigrants, but with protesters outside, wanted people to know that he has nothing against the Mexican people. \"How can I not love people who give me many millions of dollars for apartments,\" he said, referring to the apartment buildings he owns. Now thats the sort of man we need negotiating foreign trade agreements. He explained that the United States \"is a laughingstock, were a joke, were all a bunch of clowns.\", I imagine people in foreign countries watching YouTube videos of Trump and reading about the Kardashians and nodding their heads in agreement. Trump has lost his \"Apprentice\" TV show (he said he quit, NBC claimed he was fired for his remarks about immigrants). In addition, NBCUniversal announced it was canceling the Miss Universe and Miss USA pageants, which were jointly owned by NBC and Trump. Trump immediately saw the truth of the matter. \"If NBC is so weak and so foolish to not understand the serious illegal immigration problem in the United States, coupled with the horrendous and unfair trade deals we are making with Mexico, then their contract violating closure of Miss Universe/Miss USA will be determined in court,\" he said in a statement issued after NBCUniversal, which is owned by Comcast, announced that it was dropping those shows. With all that Trump has done and said, hes still primarily ridiculed for his hair. And that, too, says a lot about America.]", "Date": "20150629", "Author": "[Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-trump-kardashian-st-0630-20150629-story.html", "Title": "[Kadner: Donald Trump, the American success story]"}