{"Content": "[WASHINGTON Just when they thought they were out, Kim Davis pulled them back in. Republican strategists are worried that the return of same- sex marriage as a presidential campaign piata could hurt the party in the 2016 general election, putting it on the wrong side of a growing majority of Americans that believes gay couples should have the right to marry. National Republicans operatives hoped the issue was settled in June when the Supreme Court ruled to legalize same-sex marriage nationwide. But Kim Davis upended that. The Kentucky clerk became a martyr for the religious right when, citing religious objections, she was arrested early September for refusing to follow the courts edict and issue marriage licenses for same-sex couples. And it has elevated the issue again by highlighting the rift between the evangelical wing of the Republican Party and relative social moderates who want to put the issue to rest. \"I think the longer this lingers, the worse it is for the Republican party and for the conservative movement,\" said John Feehery, a longtime Republican strategist and lobbyist. \"Civil disobedience never works well for conservatives. And in this case, it smacks of bigotry.\", The issue has ignited a debate within the Republican presidential primary. Making a strong play for social conservative voters, several candidates have stood up for Davis even as she violated the law-including Texas Sen. Ted Cruz, Louisiana Gov. Bobby Jindal and Mike Huckabee. Others said her religious beliefs dont grant her carte blanche to violate the law, and some tried to satisfy Christian conservatives without calling for disobedience. \"Today, judicial lawlessness crossed into judicial tyranny. Today, for the first time ever, the government arrested a Christian woman for living according to her faith. This is wrong. This is not America,\" Cruz said in a statement after her arrest. \"I stand with Kim Davis. Unequivocally. I stand with every American that the Obama Administration is trying to force to chose between honoring his or her faith or complying with a lawless court opinion.\", Sunday on ABC, Huckabee defended Daviss decision to disobey the Supreme Court ruling, arguing that it can be ignored. \"You obey it if its right,\" he said, comparing the same-sex marriage ruling to Dred Scott v. Sandford, the 1857 decision that validated slavery. Cruz and Huckabee announced plans to visit Kentucky and meet with Davis on Tuesday, elevating her stature with the right even as a judge ordered her release from jail. , \"If youre looking to fundraise and gin up the conservative bases support, this is a good way to do it,\" said Republican strategist Ron Bonjean. \"At the same time, for mainstream voters re-litigating the same-sex marriage debate isnt helpful because it marginalizes the Republican Party as un-accepting... The key here is for Republicans to not look like theyre un-accepting of others who lead different lifestyles. The goal is to broaden our base.\", Meanwhile, Democratic front-runner Hillary Clinton and her rivals support same-sex marriage and have praised the Supreme Courts ruling. Six in 10 Americans believe same-sex marriage should be legal, according to Gallup. Just 26 percent of likely voters believe that a public official should be able to ignore a federal court ruling for religious reasons, according to a recent Rasmussen Reports poll.Just the beginning, Some three-quarters of white evangelical voters dont support same-sex marriage, according to a Pew poll. Stoking the flames of discontent is conservative televangelist Pat Robertson, who recently said on the Christian Broadcasting Network that Daviss arrest was \"just the beginning, its the warm-up of this battle\" against opponents of gay rights. Republican front-runner Donald Trump, Ohio Gov. John Kasich, former Hewlett-Packard CEO Carly Fiorina and South Carolina Sen. Lindsey Graham clearly stated that Davis must follow the law and offer marriage licenses to same-sex couples. \"You have to go with it. The decisions been made, and that is the law of the land,\" Trump said Friday on MSNBC. Kasich noted on ABC that Davis is \"a government employee\" and said \"she should follow the law.\" Graham said on Hugh Hewitts radio show: \"As a public official, comply with the law or resign.\", Rhetorical shots have been fired between Republicans. Jindal blasted out a fundraising email with the subject line \"Trump turns his back on Christians\" after the real estate moguls comments. Jindal lamented that his rival \"refused to stand up for Kim Davis.\" Playing up a larger cultural divide, the Louisianan said that \"even really, really rich guys in Manhattan like him should oppose jailing Christians for their religious beliefs.\", The more that candidates like Cruz, Huckabee and Jindal \"advocate for the more extreme position, the less chance they have of winning a general [election], should by some miracle they win the nomination,\" Feehery said. Jeb Bush and Florida Senator Marco Rubio, both Roman Catholics, sympathized with Davis as well as her critics, suggesting there was middle ground between respecting her religious freedom and letting same-sex couples marry. Both Floridians oppose same-sex marriage personally but have tended to downplay it in the campaign. In a statement to Bloomberg, Rubio called for \"a balance between governments responsibility to abide by the laws of our republic and allowing people to stand by their religious convictions.\" In New Hampshire, Bush said there \"ought to be big enough space for [Davis] to act on her conscience and for, now that the law is the law of the land, for a gay couple to be married in whatever jurisdiction that is,\" according to NBC News. Bonjean said Bush and Rubio are \"really trying not to alienate the conservative base.\"Supreme politics, The most passionate opponents of same-sex marriage are calling for a level of defiance against the Supreme Court that has little, if any, precedence in American history. Some conservatives compare the same-sex marriage ruling to Roe v. Wade, the 1973 ruling to grant abortion rights nationwide that sparked a backlash that has powered the anti-abortion movement to this day. But other historical corollaries have their limits. Huckabes analogy to Dred Scott, the case that helped lead the nation into Civil War, goes only so far. The ruling said that people of African ancestry couldnt be U.S. citizens, even if they were born in the country, and that Congress was powerless to ban slavery in U.S. territories. Lincoln condemned the decision and the opinion by Chief Justice Roger Brooke Taney. In his 1861 inaugural address, Lincoln rejected the idea that the other two branches of government should meekly defer the Supreme Court on fundamental constitutional questions. If those issues were deemed \"irrevocably fixed\" by Supreme Court rulings, Lincoln said, \"the people will have ceased to be their own rulers, having to that extent practically resigned their government into hands of that eminent tribunal.\", Still, Lincoln didnt question the power of the courts to decide the legal case before them or to set precedents to govern similar disputes. Nor did he say that a county clerk could defy her states laws-and a federal court order-without expecting to suffer the consequences. And ultimately the Dred Scott ruling was overturned not by defiance but by the 13th and 14th Amendments to the Constitution. Huckabee, who has made his defense of Davis a centerpiece of his campaign lately, compared her to California Lt. Gov. Gavin Newsom, who allowed same-sex marriage licenses in San Francisco while he was mayor. Newsom rejected the comparison, noting that he stopped issuing the licenses when the courts ordered him to. Huckabee won the Iowa Republican caucuses in 2008, and is making a similarly aggressive play for evangelical voters this election. He is struggling to gain traction this time, facing stiffer competition in a 17-member primary field. The call for disobeying a court ruling was more remarkable to legal experts when it came from Cruz, a successful Supreme Court litigator before he became a politician. The political danger for the party, said Republican strategist Bonjean, is that \"most people view this as an accepting people other than yourself litmus test as opposed to just on the merits of same-sex marriage.\"]", "Date": "20150909", "Author": "[Sahil Kapur and Greg Stohr, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-marriage-gop09-20150909-story.html", "Title": "[Same-sex marriage returns as 2016 issue, worrying some Republicans]"}