{"Content": "[Voters determined to have their voice heard on gay marriage turned out in strength Friday for Irelands most hard-fought referendum in decades, a contest that pitted the liberal forces of social change against the nations conservative Catholic foundation. Polls closed at 10 p.m. after 15 hours of voting that featured long-distance trips by Irish citizens, including thousands of emigrants who returned by aircraft or ferry to take part in the worlds first national vote on gay marriage. Backers of gay marriage had hoped for high turnout, reflecting strong participation by young and first-time voters. Electoral officials said this appeared to have happened, particularly in Irelands major urban centers of Dublin and Cork, where many arriving at polling stations declared it was their first time voting. Ireland has become the first country to legalize gay marriage through a popular vote, defying the Roman Catholic Church in a landslide victory to change the constitution of the traditionally conservative nation. Polling station officials said Ireland could top 60 percent turnout nationally for the first time since the country narrowly voted to legalize divorce in 1995, but was unlikely to reach the 68 percent achieved when the Irish voted to ease access to foreign abortions in 1992. Results will be announced Saturday. \"This is really a turning point in our country, and I fully believe were going to have a yes vote,\" said Aodhan O Riordain, the governments equality minister, speaking after he cast his own ballot to amend the description of marriage in Irelands 1937 constitution to a contract between \"two persons without distinction as to their sex.\" O Riordain, 38, called it the most important vote of his generation. Ireland has no system for mail-in voting, so Irish expatriates in London, New York, Bangkok and Nairobi planned weekend trips home. Many documented their journeys on Twitter, often under the hashtags #HomeToVote or, for some of those in neighboring Britain, #GetTheBoatToVote. One posted a picture on a London-to-Wales train with travelers decked out in rainbow colors and balloons of the gay rights movement. A campaign poster in Dublin urges voters to vote no in Irelands referendum on gay marriage. A campaign poster in Dublin urges voters to vote no in Irelands referendum on gay marriage. Voters questioned by The Associated Press as they left several Dublin polling stations demonstrated a clear generational gap. Those under 40 were solidly \"yes,\" with older voters much more likely to have voted \"no.\", \"You can give the gays their rights without redefining the whole institution of marriage. What theyre asking for is too much,\" said Bridget Ryan, 61, as she voted with her border collie in tow at a Catholic parish hall. A second proposed amendment to lower the minimum age of presidential candidates from 35 to 21 was not expected to pass. On the gay marriage question, leaders of the countrys predominant faith, Roman Catholicism, have led the opposition, arguing that legalization would undermine marriage as a pillar of society and trigger unintended legal consequences in Irish courts, where adoption and surrogacy rights loom as legal battlegrounds. Yet even within the church, a vocal grass-roots minority voted in favor, arguing that their bishops had no right to stop the state from managing civil wedding rules. \"A lot of practicing Catholics are voting yes, and its no different in the clergy,\" said the Rev. Tim Hazelwood, a 56-year-old County Cork parish priest who told his flock from the pulpit at weekend Masses he was defying the bishops line on the vote. \"We didnt get much leadership from our leaders. I was hearing cold and clinical arguments against gay marriage, and what they said didnt represent my view of Gospel values at all,\" said Hazelwood, a psychotherapist who counsels gay parishioners on how to cope in an often-unfriendly world. Hazelwood said he knows of at least four fellow priests who also voted yes and estimates that one in 10 did nationwide. \"They would share my view that Ireland and the church have caused gay people a lot of unnecessary hurt and pain, and its time for that to stop,\" he said. A \"yes\" result would provide fresh evidence of waning church influence in a country that handed control of key state services to the church upon independence from Britain in the 1920s. In the 1930s Ireland wrote its constitution in close consultation with Catholic leaders and in the 1980s voted forcefully in referendums to strengthen Irelands abortion ban and to reject divorce. The Catholic Church in Ireland has suffered declining Mass attendance since the early 1990s, when its moral authority started to be battered by two decades of scandals over sexual abuse and its systemic cover-up in parishes and church-run institutions for children. Underscoring the changed national mood, Prime Minister Enda Kenny assailed the Vaticans role in the cover-ups after he took power in 2011 and closed Irelands embassy to the Holy See. By the shores of Dublin Bay, roadside campaigners from the Yes Equality lobbying group waved rainbow flags and held up placards urging commuters to \"Vote for us.\" Cars honked back in approval. The Students Union of Ireland, determined to spur students back to their often faraway home districts to vote, produced an app offering custom-tailored advice on the best transport links to take. Cab booking companies Hailo and Uber offered free lifts to polling stations. And one of Irelands best known comedians, New York-raised Des Bishop, ran his own personalized taxi service for voters, taking free orders by tweet. Bishop said his last free fare, Ashley Kehoe, was a first-time voter who told him she was voting for gay marriage \"for the Ireland we want to live in for the future. Great to see people so engaged.\", Gay couples who hope to marry were keeping their fingers crossed. Many also expressed a sense of dread that the amendment might be rejected. Anne Marie Toole, 34, and Dil Wickremasinghe, 41, proposed to each other five years ago while strolling on a Dublin pier. But they agreed to wait until Ireland legalized gay marriage, rather than travel to a country where the practice is already legal. \"We had options to move elsewhere and we said no, based on our belief and our trust that marriage equality would come to Ireland,\" said Toole, who is from a small town outside Dublin and came out to her parents and four siblings when she was 29. Only this week they had a baby boy, Phoenix, thanks to an IVF treatment at Dublins first fertility clinic to serve lesbian couples. As they took turns cradling the 5-day-old Wikremasinghe is the biological mother, whereas Toole faces a potentially long wait to become the boys legal guardian they imagined what raising their boy in an accepting Ireland would be like. \"I would love for this referendum to pass,\" said Wikremasinghe, a Sri Lankan and Irish citizen. \"Because then I Id know that when Phoenix is old enough to go to school, or when Phoenix is playing in the park, and we are there to pick him up and to hold him ...\", She paused, overcome with emotion, wiped away tears and continued in a whisper: \"Id know then that hes not going to be viewed any differently than all the other kids.\", Associated Press , ]", "Date": "20150522", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-ireland-gay-marriage-20150522-story.html", "Title": "[High turnout as Ireland votes on historic gay referendum]"}