{"Content": "[As U.S. Sen. Dick Durbin sat on a chair onNortherly Island after celebrating the new parks opening, he admitted that Washingtons summer recess had been anything but free time for him. Illinois senior senator found himself in a familiar role, though one largely by default this time, in whipping up enough Democratic votes to support President Barack Obama and U.S. participation in an international agreement meant to curb Irans nuclear program. \"Ive got my fingers crossed,\" Durbin, the No. 2 Democrat in the chamber, said Friday as he ticked off the names of a handful of then-uncommitted Democratic senators. \"You get nervous toward the end. What are they waiting for?\", Durbin has counted votes countless times in his Senate career. On Wednesday, the four-term Democrat becomes Illinois longest-serving popularly elected senator at 6,824 days and counting. The 70-year-old from Springfield will eclipse the record set upon the death of iconic Republican Senate Leader Everett McKinley Dirksen, of Pekin, who served from 1951 to 1969. The longest-serving Illinois senator is Shelby Cullom, who served 30 years, from 1883 to 1913, a time when state legislatures elected senators, not the voters. It was 1996 when Durbin first ran for the Senate after previously having served 14 years in the House, following unsuccessful bids for lieutenant governor in 1978 and the state Senate in 1976. The Senate seat was being vacated by the retirement of Paul Simon, Durbins employer when Simon served as lieutenant governor. In winning the Democratic primary, Durbin defeated Pat Quinn, who would go on to become governor. And in the general election, Durbin defeated Republican nominee Al Salvi by 15 percentage points. OnSept. 9, 2015, U.S. Sen. Dick Durbin will become Illinois longest-serving popularly elected senator. The four-term Democrat will have served 6,824 days, eclipsing the record set by Republican Sen. Everett McKinley Dirksen, of Pekin, who served from 1951 to 1969. OnSept. 9, 2015, U.S. Sen. Dick Durbin will become Illinois longest-serving popularly elected senator. The four-term Democrat will have served 6,824 days, eclipsing the record set by Republican Sen. Everett McKinley Dirksen, of Pekin, who served from 1951 to 1969. In subsequent elections he defeated now-Illinois House Republican leader Jim Durkin by 22 percentage points, physician Steve Sauerberg by 40 percentage points and, last fall, edged Republican state Sen. Jim Oberweis by just more than 10 percentage points. It has been a long and sometimes controversial career for Durbin, a native of East St. Louis and graduate of Georgetown Law School who served as a college intern for the late Illinois Sen. Paul Douglas, a liberal icon. A key issue in Durbins first Senate victory was gun control. Durbin ran ads featuring former White House press secretary James Brady, who was wounded in the 1981 attempted assassination of President Ronald Reagan. Salvi opposed federal gun-control efforts and erroneously said Brady had at one time peddled machine guns, only to apologize for being misinformed. The political damage had been done. But nearly two decades later, Durbin is still pushing for tougher gun laws while acknowledging little progress has been made. Durbin said the Supreme Courts 2008 decision that the Second Amendment provided a personal right to possess a firearm, \"the first time it has ever articulated that clearly, has really set us back in terms of the debate. Its unfortunate because gun violence continues and grows.\", Citing recent gun violence in Chicago, Durbin said, \"Its just a heartbreaking number (of incidents) and a clear indication we are flooded with firearms and theyre in the hands of people who should never have them and if we arent sensible enough to try to restrict opportunities for former felons, mentally unstable people to have firearms, then were going to continue to see these devastating numbers.\", As much as he is an advocate for strong gun laws, Durbin also is an advocate for the Democratic Party and the White House. He has been a regular on Sunday morning national political shows to articulate the viewpoints of Senate Democrats. Despite his sometimes intense partisanship, Durbin also has been a member of several prominent bipartisan commissions, including the National Commission on Fiscal Responsibility and Reform, known better by its co-chairs, former GOP Sen. Alan Simpson and former Clinton White House chief of staff Erskine Bowles. Durbin also was a member of what became known as the \"Gang of Six\" senators charged with deficit reduction and the \"Gang of Eight\" senators, which offered comprehensive changes to immigration law. He co-wroteand has long supported the proposed DREAM Act to allow immigrant students the chance to earn citizenship. More recently, Durbin has been critical of unscrupulous for-profit colleges and universities with questionable accreditation and dubious ability to train students that accept federal student loans. Durbin, however, may be best known for legislation that he sponsored as a Springfield congressman, which banned smoking on commercial flights. The law went into effect 25 years ago, and Durbin is now seeking federal regulation of e-cigarettes. On the Senate floor, he often speaks without notes in arguing the Democratic viewpoint on legislation and was once dubbed \"the debater\" by Time magazine. But sometimes his off-the-cuff speaking can also cause controversy. Republicans still remember a 2005 floor speech in which Durbin read from an FBI agents email complaining about the abuse of an al-Qaida prisoner at Guantanamo Bay and referenced the human rights abuses of Nazis and others with \"no concern for human beings.\", After initially defending his remarks in the face of criticism that spanned from the White House of Republican George W. Bush to City Hall under then-Mayor Richard Daley, Durbin took to the floor and offered a tearful apology. While Durbin long harbored ambitions for national office and was considered as a potential running mate by now-Secretary of State John Kerry in Kerrys unsuccessful 2004 Democratic presidential bid he has found himself a mainstay of a Senate where seniority translates to influence. In 2001, he was first appointed to the Democratic leadership team as an assistant floor leader and was promoted to the whip position four years later, a rank thatalso carries the title of assistant Democratic leader. But earlier this year Senate Democratic leader Harry Reid backed Durbins former Washington housemate, Sen. Charles Schumer of New York, the No. 3 ranking Democrat, to replace Reid following the 2016 elections. Durbins role in securing support for the Iran nuclear deal with Schumer as an opponent of the agreement has put a new spotlight on his role, even though he has served as Democratic whip since 2005. Entering the summer recess, Durbin had been the only member of Senate Democratic leadership to voice support for the agreement, making him its chief whip by default. He now has the backing of at least enough Democrats to sustain a presidential veto of a resolution of disapproval of the Iran agreement, should it pass the Senate. Whipping votes is \"what Ive done a number of times and this one was special. It was historic and it was rare and I cant think of another time when Ive had to whip over an August recess,\" Durbin said. \"The fear was that when members left Washington and were subjected to all of the negative television advertising back home, it would be hard to get them to support the presidents position,\" he said. The activity appears to have reinvigorated Durbin, though he wont say whether he would seek another term in 2020. There is, however, a more immediate goal with the shake-up in Democratic leadership after the 2016 elections. \"I certainly want to be the whip, and thats an election every two years in the Senate Democratic caucus,\" he said. \"I do it constantly. This was more visible than most.\", rap30@aol.com, Twitter @rap30]", "Date": "20150906", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-senator-dick-durbin-met-20150904-story.html", "Title": "[Durbin in familiar role as he approaches record tenure in Senate]"}