{"Content": "[As President Barack Obama talked to reporters after becoming the first American president to visit a federal prison, his thoughts appeared to flash back to the \"Choom Gang.\", That was the nickname of the pot-smoking crew to which the future president belonged in his Honolulu high school days, according to Obama biographer David Maraniss. \"Choom\" was Hawaii teen slang for marijuana smoking. Obama recalled his own choom days and \"maybe a little blow\" or cocaine in his own memoir, \"Dreams From My Father.\" It was illegal but not unlike the sort of youthful experimentation in which countless other young people engage. Fortunately for him, as with many of the rest of us, he managed to avoid getting arrested and put \"into the system\" of prison, probation and parole that could have made his current career path impossible. As he became the first occupant of his office to visit a federal correctional facility Thursday, he reflected on the thin line between prison and the presidency. \"There but for the grace of God,\" he mused after his tour of El Reno, a medium-security prison in Oklahoma in which he met with six nonviolent drug offenders. \"When they describe their youth and their childhood, these are young people who made mistakes that arent that different than the mistakes I made and the mistakes that a lot of you guys made,\" the president said afterward. \"The difference is they did not have the kinds of support structures, the second chances, the resources that would allow them to survive those mistakes.\", That sensible argument has been made many times before, mostly by liberals and libertarians. But movement to reverse mass incarceration has gained new traction in recent years. This is particularly true at the state level as small-government conservatives are appalled by growing evidence of the drug wars mounting costs and diminishing returns. Consider this: The nations prison population more than quadrupled since 1980 from 500,000 to 2.2 million today, according to the Justice Department. Our national incarceration rate is between 5 and 10 times higher than in Western European countries, according to the National Research Council. And while the nations population is about 30 percent African-American and Hispanic American, Obama pointed out, they account for about 60 percent of federal prison inmates. No wonder many people are calling mass incarceration \"The New Jim Crow,\" which is also the title of a best-selling expose by law professor Michelle Alexander. Our prison population has doubled in the last two decades alone at a cost of about $30,000 per person each year, the United States Sentencing Commission said in a May report Obama pointed out in a speech on sentencing reform at the NAACP convention in Philadelphia before visiting the Oklahoma prison. Appropriately, former President Bill Clinton repudiated much of his own 1994 crime bill at the convention the next day. By sending even minor offenders to prison \"for way too long,\" he said, \"I signed a bill that made the problem worse and I want to admit it.\", As with same-sex marriage, gays in the military and marijuana legalization, the politics of the \"war on drugs\" has shifted dramatically since the early 90s, when Clinton felt obliged to show he could be tough on crime, welfare recipients and Sister Souljah. Now we have such diverse presidential candidates as Rand Paul and Ted Cruz on the right and Hillary Clinton on the left pushing back against mandatory minimum sentencing, among other inflators of prison populations. By weeks end presidential adviser Valerie Jarrett confirmed to me a Wall Street Journal account of the \"open channel of communications\" that she and the Democratic Obama White House have with the billionaire brothers Charles and David Koch, major funders of Republicans and other conservative causes. \"I am optimistic,\" she told me in an email, \"that we have greater bipartisan support than ever before.\", But now what? House Speaker John Boehner, echoing the spirit of changing times, announced he would open the floor of the House to debate on sentencing reforms. That would include an increasingly popular bipartisan bill called the SAFE Justice Act. It would reduce mandatory minimums for low-level offenders, give more sentencing flexibility back to judges and create specialized courts for drug crimes that have had impressive success in many cities. Those reforms and others in the bill are badly needed. Lets hope Congress new spirit of bipartisan cooperation around shared crime-fighting goals will help this bill become law and kick the \"new Jim Crow\" out the door. Clarence Page, a member of the Tribune Editorial Board, blogs at www.chicagotribune.com/pagespage. cpage@tribpub.com, Twitter @cptime]", "Date": "20150717", "Author": "[Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-jim-crow-mass-incarceration-obama-perspec-0719-20150717-column.html", "Title": "[Kick the 'new Jim Crow' out the door]"}