{"Content": "[The dust is just starting to settle after a contentious week in Indiana, where the state endured national criticism from those who perceived the newly passed Religious Freedom Restoration Act as giving business owners a religious-based license to discriminate against gay, lesbian, bisexual or transgender citizens. With businesses threatening to curtail investments in the state, legislators hammered out and Gov. Mike Pence quickly signed a language fix that prevented the law from being used as a defense for refusing to provide services or public accommodations to LGBT citizens. Political observers wonder what, if any, repercussions the debate could have on the 2016 elections. Predicting the future, The 2016 primary is about 13 months away, so time will tell if the RFRA fallout could be used as a wedge issue, said Indiana University Northwest Political Science Professor Marie Eisenstein. \"I think it can be hard to predict,\" Eisenstein said. \"I can certainly see it being used as a wedge issue as part of the culture war issue. Candidates are going to be asked about these sorts of laws. \"My early assessment is that Gov. Pence and Republicans who have supported the law have done a very poor job articulating their response. If they continue to be unable to generate a response, it could be a real problem.\", Hammond Mayor Thomas McDermott said he thinks the repercussions will linger into 2016, \"I think anybody that votes for it, its definitely not the last theyve heard of it,\" McDermott said. \"For local legislators, its not the type of issue that Northwest Indiana voters are going to forget about it.\", Porter County GOP Chairman Michael Simpson said it wont likely have an impact on municipal elections this fall, but hes not sure about 2016. \"Ive been reading posts on social media, from social conservatives who are mad that the Republicans abandoned them and wanted law the way it was, and from friends from the LGBT community, who are mostly happy with what transpired,\" Simpson said. \"I think people will have conversations and some will want to make an issue of it. Im not sure how much traction those will get because a year is a long time in politics.\", Sen. Karen Tallian, D-Ogden Dunes, voted against the original bill and the fix, which she said didnt go far enough. Tallian said if the elections were soon, Republicans could have a real problem on their hands. \"But in 2016, its a hard question to answer,\" Tallian said. \"I have to say that I think the Democrats feel vindicated in a way because we told them this legislation was going to be a problem and indeed it turned out to be that.\", Rep. Hal Slager, R-Schererville, voted for the law and the language fix and he was surprised by the reaction, which happened after it had passed both Houses. \"Obviously a lot of people who were both opponents and proponents, there was a misinterpretation the law,\" Slager said. \"People were just not reading the law, and businesses reacted to it.\", Pence missteps, Even though the Indiana General Assembly passed RFRA by overwhelming margins in both chambers, much of the criticism has been directed at Pence, who has struggled to articulate his support for the original bill or detail how he wanted to fix it, Eisenstein said. \"Its not as if a defense isnt out there, if hes willing to make an argument, and its not as if Indiana has only RFRA law on books,\" Eisenstein said. \"Hes done a bad job telling what its about. \"If you think youre on the side of right, make the argument. If you back down, then it looks like youre not that sure.\", Because 2016 is a presidential election year, top-of-the-ticket races such as president and governor could drive turnout. Lake County Sheriff John Buncich, who is also the Lake County Democratic Party Chairman, said Pences performance over the past few weeks has sparked much discussion and interest among Democrats about who they will run for governor. \"Gov. Pence was trying to position himself for a national race, but it blew up in his face,\" Buncich said. \"And so be it. Hopefully well be able to capitalize on that. A strong presidential ticket along with a strong gubernatorial ticket will help our cause.\", Simpson said hes doesnt think that Pence would be a drag on the Republican ticket if he seeks re-election, but he could be a problem for some voters. \"I do think as for him running for re-election that RFRA will be a point of contention for both own constituency, the fundamentalist conservatives, but the folks on other side also going to remember and talk about it,\" Simpson said. \"Because its a presidential year it depends on top-of-the-ticket candidates and what theyre saying thatll make a difference.\", Civil rights protections, The debate did expose a schism among leading Republicans in the state. Social conservative activists including Eric Miller lauded RFRA for protecting florists and bakers who wish to decline to service gay weddings, while businesses that traditionally have backed Republicans such as Angies List and Eli Lilly, alongside the Indiana Chamber of Commerce, really led the charge for changes. As a business owner, Simpson found the discussion of discrimination troubling. \"We would never approve of or condone any form of discrimination of anyone,\" Simpson said. \"Quite simply you serve everyone; the one color we pay attention to is green, the color of money. Its how we make a living. So I would stand with every business owner who is against discrimination.\", Eisenstein said Indiana has a Republican-dominated legislature, but that doesnt always prevent legislative bodies from landing in divisive public debates. The language fix could yield more substantive discussions on including sexual orientation and gender identity in the 2016 session. Tallian said Republican leaders have indicated some openness to having the discussion and Democrats will certainly push it. \"What they will do with it, I dont know,\" she said. Illinois has a slightly different version of RFRA, but includes civil rights protections for sexual orientation and gender identity. Slager said hes done business in Illinois for many years and hes never encountered any issues on that front. \"Im sure thats a conversation that needs to be had,\" Slager said. \"People are curious why we didnt go that far with the fix, but we had to address the issue of this bill first and to go beyond that policy issue, it needs to be vetted.\", McDermott said the debate likely will take place even though some may want to just put the issue in the rear-view mirror. \"I dont think they want to talk about civil rights protections next year, but they probably will have no choice but to do damage control and prove thats not what their party is about,\" McDermott said. \"Many of the legislators have to go on the ballot next year, so its something theyre going to have to answer for.\"]", "Date": "20150404", "Author": "[Christin Nance Lazerus]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-religious-freedom-fallout-st-0405-20150404-story.html", "Title": "[ Politicial repercussions of RFRA fallout unclear]"}