{"Content": "[I spent a nice long weekend away from the news, and returned to find people talking about how Donald Trump might really win and how Joe Biden could win after all. No, they cant. Everything we know about presidential nominations screams that Trump has no chance of winning the Republicans nod and that Hillary Clinton has the Democratic nomination sewn up. As evidence, lets look again at how the process works and how polls can be misleading. For one thing, endorsements by party leaders are simply a much better indication of how nominations will turn out than early polling. Polls that ask whether people like certain politicians at this point dont really predict how voters will feel about those same politicians down the road. And perceived electability in November 2016 is a major reason to support a candidate, both for voters as well as for party insiders. How can todays polls be so wildly out of sync with what voters will eventually do?, Perhaps youve had the experience of making a significant purchase of a product you know little or nothing about a first car, maybe, or a household appliance. Before you buy, youll probably do at least some research. You might be the type to study all the information thats out there, or you could ask friends and family, or perhaps you trust one site for this sort of thing. Youll be an informed consumer before you buy. What if, however, someone asked you what car you would buy a year before you decided you were in the market for one? Or asked your opinion of dryer brands three months before your ancient machine broke down?, If you care a lot about cars or even laundry, you might be able to give an answer based on a fair amount of information. But if you arent overly interested in these subjects, and if you havent shopped for the product before (or not recently), the reply you would give might have little to do with your eventual purchase or your views of the various companies after your research. Voters are in this position now. The primaries and caucuses are still months away. Unless a voter lives in an early-primary state, its impossible to predict which candidates will be on the ballot once the election comes to his or her state or if the primary will even be competitive by then. If people do vote in a competitive state primary, and then when they vote in the general election, they will have done a lot more research. Theyll have watched TV ads, seen positive or negative news coverage of the candidates, perhaps talked to family or friends who follow politics more closely than they do, and maybe listened to one or more party leaders whom they trust. So why dont people just refuse to answer pollsters calls now, or simply say they are undecided? Many voters, even those not engaged in politics, will nevertheless have something to say about whatever is currently in the news about Trump or Clinton or Jeb Bush or Bernie Sanders. But those answers are not, in most cases, anywhere close to a final decision about anything. Theyre just a reaction to the information out there right now information that will change over the course of the campaign. And party actors politicians, campaign and governing professionals, formal party officials and staff, donors and activists, party-aligned interest groups, and the partisan press will have a lot of influence over what information will be available to casual voters when elections approach. Its possible that something important has changed, and that what explained previous elections no longer holds in 2016. But so far theres no sign of anything like that. Keep that in mind when you see those polls showing an early Trump lead or unimpressive favorability ratings for Clinton or liberal love for Sanders. Bloomberg, Jonathan Bernstein is a Bloomberg View columnist covering U.S. politics. ]", "Date": "20150730", "Author": "[Jonathan Bernstein]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-versus-hillary-clinton-20150730-story.html", "Title": "[No, Donald Trump can't win. And yes, Hillary Clinton can.]"}