{"Content": "[Im relieved that the nightmare of Jonathan Pollards imprisonment is about to be over. Not because I feel any sympathy whatsoever for the convicted spy who will be paroled in November after spending 30 years in prison. No, what relieves me is that, once hes freed, well be spared the spectacle of respectable American Jewish leaders calling for his early release. Those requests have been harmful to the principle that American Jews can be totally loyal Americans and also care about Israel. The end of this whole shameful episode is therefore cause not for celebration, but for relief. Even at this distance of time, it remains stunning to me that anyone outside Israel would think Pollard was unfairly treated. Those who advocated the release of the former Navy analyst advanced a variety of reasons. The most significant and consistent argument was that Pollard had been the victim of a U.S. government deception: First the Department of Justice told him they would seek something less than a life sentence. Then the secretary of defense, Caspar Weinberger, wrote a letter to the sentencing judge asking for the maximum sentence on the grounds that Pollards stolen secrets had badly damaged the countrys security. Its hard to imagine anyone less well placed to complain about a government trick than a person who deceived that very government, his employer to whom he had sworn an oath of loyalty. Even if the governments approach was sneaky, it pales next to Pollards actions. Then theres Pollards refusal to disclose all the information he had stolen, to say nothing of the distinct probability that some of what he passed to Israel was then traded to the Soviets at the height of the Cold War. Its one thing for Israeli government officials like Benjamin Netanyahu to seek Pollards release. After all, Netanyahu has no duty of loyalty to the U.S. except for what one might expect from a close ally. Publicly asking for clemency for the Israeli spy might have been damaging to the countrys credibility, but it was good domestic politics for Netanyahu and no doubt pleased the Israeli intelligence community. Yet for anyone holding a U.S. passport to seek Pollards release was, in my view, a serious moral and political error. American Jews have, for the most part, successfully managed to show their fellow citizens that while they support and often love Israel, theyre also profoundly loyal to their own country. Before you get upset and say theres no reason Jewish Americans should have to prove their loyalty any more than other Americans, let me state categorically that I would hold other American ethnic groups to precisely the same standard. Its perfectly natural to feel attachment to another nation in association with your religion, ethnicity or birthplace. Yet sometimes, that nations interests will conflict with that of the U.S. Israel is no exception to this reality, no matter how close an ally it may be. And when an American spies on the U.S. for Israel, thats the clearest possible case of conflicting loyalty. A loyal American should must react to such a betrayal with horror. It shouldnt matter what the ethnicity of the spy is. But the ethnicity of the person of seeking his release does matter. For American Jews to ask that Pollards sentence be shortened is to call into question the capacity of all American Jews to remain loyal to their country when the possibility of conflict arises. Notice that nowhere have I said that Pollard should have gotten a longer sentence, or been kept in prison unnecessarily just because he was Jewish. To the contrary, Pollard should have gotten exactly the same sentence as any other spy who betrayed as he did and caused the harm that he caused. That is exactly what has happened. Pollard got a sentence of life, which at the time included the possibility of parole in 30 years. Thirty years is now up. Pollard is being released because, under the law, he can only be denied parole if he has misbehaved in prison or poses a threat of future crime. Neither of these conditions pertains. In other words, hes not being released early. Hes being given exactly the treatment that any other criminal would receive. From the beginning, that was the way to treat Pollard. He deserved no special consideration because he was Jewish or because he spied for an ally. Going forward, it would be wonderful to forget both Pollards perfidy and the support he was given by some Americans who should have known better. But it would probably be better to remember the former in order to avoid any repetition of the latter. Deception under conditions of conflict is part of human nature, and it will never be completely eliminated. Nevertheless, fair and just punishment is the right response to spying in violation of an oath. That happened, thankfully. And now the punishment is over. Bloomberg, Noah Feldman, a Bloomberg View columnist, is a professor of constitutional and international law at Harvard and the author of six books, most recently \"Cool War: The Future of Global Competition.\"]", "Date": "20150729", "Author": "[Noah Feldman]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-jonathan-pollard-israel-spy-release-20150729-story.html", "Title": "[Jonathan Pollard's release and the shame of American Jews]"}