{"Content": "[For decades, Donald Trump has made flippant misogyny as much a part of his trademark as his ostentatious lifestyle. Now, the former reality-television host and current front-runner in the polls for the 2016 GOP presidential nomination may be paying a price for a boorish barb that also renewed his partys internal consternation over its recent history of alienating women voters. What did it was not what he said which was in keeping with his earlier comments but directing it a highly regarded Fox News Channel anchor who is popular with the Republican faithful. Trump was disinvited to speak at Saturdays RedState Gathering of conservative activists in Atlanta after the celebrity real estate mogul seemed to hint that Megyn Kellys menstrual cycle drove her to ask him tough questions at Thursday nights Republican debate in Cleveland. \"I think there is a line of decency that even a nonprofessional politician can cross. Suggesting that a female journalist asking you a hostile question is hormone-related, I think, is one of those lines,\" conference organizer Erick Erickson said in an interview. Yet Trumphas a history of similar inflammatory statements about women both as a sex, and with reference to his antagonists and subordinates. As far back as a 1991 interview with Esquire magazine, Trump had boasted: \"You know, it doesnt really matter what [the media] write as long as youve got a young and beautiful piece of [expletive]. But shes got to be young and beautiful.\", In a 2006 book, he wrote of women as objectified collectibles: \"Beauty and elegance, whether in a woman, a building, or a work of art is not just superficial or something pretty to see.\" He once sent New York Times columnist Gail Collins a copy of something she had written about him with her picture circled and \"The face of a dog!\" written over it. And in 2012, he tweeted that Huffington Post founder Arianna Huffington is \"unattractive both inside and out. I fully understand why her former husband left her for a man he made a good decision.\" (Huffingtons ex-husband, former congressman Michael Huffington, R-Calif. came out as gay after their divorce.), In Thursday nights debate, moderator Kelly reprised other Trump comments. \"Youve called women you dont like fat pigs, dogs, slobs, and disgusting animals,\" she said. Trump seemed amused and replied that he was referring to comedian and actress Rosie ODonnell. \"Your Twitter account has several disparaging comments about womens looks,\" Kelly continued. \"You once told a contestant on Celebrity Apprentice it would be a pretty picture to see her on her knees. Does that sound to you like the temperament of a man we should elect as president, and how will you answer the charge from Hillary Clinton, who [is] likely to be the Democratic nominee, that you are part of the war on women?\", Trump replied that he was battling a greater scourge political correctness and \"frankly, what I say, and oftentimes its fun, its kidding. We have a good time.\", Then, he issued what sounded like a threat: \"Honestly Megyn, if you dont like it, Im sorry. Ive been very nice to you, although I could probably maybe not be, based on the way you have treated me. But I wouldnt do that.\", On Friday, Trump did exactly that. He retweeted a Twitter followers description of Kelly as a \"bimbo,\" and told CNN that Kelly \"had blood coming out of her eyes, blood coming out of her wherever.\" Later, Trumps campaign issued a statement maintaining that he had been referring to Kellys nose, not her hormonal cycle, and that \"only a deviant would think anything else.\", The comment was \"completely in character for Trump,\" said Katie Packer Gage, a political consultant who was GOP nominee Mitt Romneys deputy campaign manager in 2012. \"Whats new is he picked on somebody who is beloved by conservative voters, and he has just doubled and tripled down on it.\", His rivals warn that Trumps comments about women will reflect badly on the entire party. \"Give me a break. Do we want to win? Do we want to insult 53 percent of all voters? What Donald Trump said is wrong,\" former Florida governor Jeb Bush said during his appearance at the RedState event. \"Mr. Trump ought to apologize.\", Instead, the real estate mogul ramped up his criticism of Kelly in an interview with The Washington Post: \"Shes a lightweight as a reporter, very unprofessional. Her questions were ridiculous.\", It remains to be seen how much if at all the episode has damaged Trumps standing. His earlier comments characterizing illegal immigrants as rapists and killers, and disparaging the military service of Sen. John McCain, R-Ariz. might also have been fatal to another candidacy, but only seemed to draw more supporters to Trump. Polls to date not only show him with a strong lead over the other 16 Republican contenders, but that among GOP primary voters, women are nearly as likely to support him as men are. In part, that is because he is running as a celebrity outsider who gives voice to the frustrations that many voters feel with the political system. Trump, however, will be given more scrutiny as voters get closer to making a decision at the polls. \"Whats different is that nobody ever focused or heard any of those comments through the lens of a man who wants to be president,\" said Republican pollster Kellyanne Conway, who is working for a super PAC supporting the candidacy of Sen. Ted Cruz, R-Texas. \"In the past, hes been a businessman, the host of a popular program.\", Trumps greater challenge, over the long term, might have been demonstrated during other, less-talked-about segments of Thursdays debate, which was the first of nine officially sanctioned faceoffs that are scheduled during the primary season. Pressed repeatedly for evidence to back up some of his more outlandish claims such as that the Mexican government was dispatching murderers and rapists across the border Trump was vague and evasive. Nor has he come up with much by way of policy prescriptions, beyond suggesting that the force of his own personality is the answer to the nations problems. \"At a certain point, those that are Trump supporters will want policies, will want ideas, will want to know what he wants to do,\" said Ashley OConnor, a Republican political consultant whose firm is working for New Jersey Gov. Chris Christies presidential campaign. Washington Post staff writers Robert Costa, Alice Crites and Philip Rucker contributed to this report.]", "Date": "20150809", "Author": "[Karen Tumulty]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-donald-trump-misogyny-20150809-story.html", "Title": "[Donald Trump's history of flippant misogyny]"}