{"Content": "[First, Hillary Clinton must deal with that debilitating email scandal on the road to becoming president of the United States. Then and only then will she be able to claim her true destiny and see her will become law, and her likeness carved into the living rock of Mount Rushmore. Youve heard about the apparently illegal emails and the hint of a massive cover-up, one rule for workers, another rule for the Clintons, who are above the rule of law. And youve seen the Democrats wringing their hands in panic, the Republicans issuing subpoenas, the roiling accusations, leaks against enemies, servile media lap dogs running to bury the Clinton bones and another pretend conservative named Bush putting himself forward, promising to restore dignity to the White House and maybe fight another war or two. Am I crazy, or does any of this sound vaguely familiar? Its almost as if weve lived through this before. Either way, Hillary must deal with it. And deal with it she shall, in the Hillary fashion. But please dont become hostile and go all MSNBC on me. And please dont give me a freaky look and start shrieking in the voice of a common fishwife:, \"What difference, at this point, does it make?\", What difference, at this point, does it make? What difference, at this point, does it make? Ill tell you what difference it makes. Ill tell you if youre brave enough to see the future in your mind. Now dont be a baby and close your minds eye. Open it. Thats right, open your minds eye wide, unblinking, so you may witness the glorious Clinton Restoration. Youll need a soundtrack, so let me suggest music of the baroque. And there, see, Hillary in her second term as president of the United States, served ably by Chicagos Rahm Emanuel as vice president/Ministry of Truth. Former President Barack Obama is chairman of the Second Constitutional Convention. First lady Michelle Obama is a U.S. senator, from Illinois, Hawaii or New York, depending on where she feels like living. And first laddie Bill Clinton?, Bills off globe-trotting around the world as secretary of state without portfolio, in Tajikistan one day, dealing in oil and dancing girls and at the Hague the next, in a secret meeting delivering a silver butter knife to Vladimir Putin, telling him that is the tool Hillary uses to remove the hearts of her nations enemies. Yet before Hillary can accomplish all this, the rest of us must grasp a complicated concept about this Hillary email scandal. Its just another Clinton-style scandal. Its not as if you havent seen them before. So please have the common decency to stop pretending that you dont know what Im talking about. You know exactly what a \"Clinton-style scandal\" is, is:, A Clinton scandal is the kind of scandal in which the Clintons spit on the rule of law and then tell the law that its raining. Its what they do. Its what theyve always done. Its what America has encouraged them to do, by enabling them in this decade after decade, our nation as some kind of cliched soap opera, full of glitz and hair and reaction shots and powerful women who have meetings and powerful men who have meetings. The short version of the Hillary email scandal is that by law, federal government officials may not use private emails for public business. A government official using private email for government business would, in effect, allow that official to operate in secret, without anyone learning what the official did or didnt do. If that official were doing personal business, like, say, investing in cattle futures, that might be considered the officials private business. So they might use private email for that. But if you were Hillary Clinton, and had a private email account, and a private server in one of your mansions, youd be able to hide information about the publics business from the public. Thats what she apparently did as U.S. secretary of state, although now she promises to make the emails public. U.S. Rep. Trey Gowdy, the Republican chairman of the select committee on Benghazi, has issued subpoenas for those Clinton emails. Democrats are worried. And liberal pundits, perhaps guilty about ignoring that race card that Obama shoved down Hillarys throat in the 2008 Democratic presidential primary, are rushing to her defense and blaming Republicans. Yet outside Washington, some Americans, even Democrats, think that the public should know whats going on in their government. Obama, himself a Democrat, even campaigned on this idea in 2008, telling Americans that transparency in government was vital to defeat the cynicism born in the broken politics of our past. But then that business of the IRS squeezing political groups that didnt agree with Obama got in the way, and that transparency stuff was forgotten. While troublesome for government, this \"peoples right to know\" meme is quite radical but consistent with the law as its commonly understood. It follows then, naturally, that the Clintons will have to change the common understanding. Theyve done it before. There are plenty of egg suckers to wag their tails and pound their keyboards and tweet that its not really a scandal after all. It just happened. Email is like sex. Everybody does it. It is what it is. And in the end, doesnt Hillary know that it all depends on what the definition of is, is?, jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150306", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-hillary-met-0308-20150308-column.html", "Title": "[ Another Clinton scandal has John Kass experiencing deja vu]"}