{"Content": "[For years, good-government advocates have pushed for a new way to draw Illinois House and Senate district boundaries to curb the influence of partisan politics in deciding who controls the General Assembly, only to fall short due to legal hurdles. Now a new group funded by well-heeled backers is taking another run at the issue as it tries to learn from mistakes of the past by getting an earlier start and drafting a proposal it believes can withstand an inevitable court challenge. The Independent Map Amendment effort says its well on its way to getting enough signatures to put the measure on next years ballot, aided by voter frustration over the stalemate at the Statehouse. But like last time, the latest drive is drawing opposition from a group led by African-American businessmen who said they fear changes in the process could end up reducing minority representation and influence at the Capitol. Some of them successfully challenged a similar proposal last year, aided by a lawyer with close ties to Democratic House Speaker Michael Madigan, a 44-year veteran who helped write the Illinois Constitution and is opposed to changing how legislative maps are drawn. At stake is a proposed constitutional amendment that voters would decide in the 2016 general election that would change the every-decade method of redrawing the states 118 House and 59 Senate districts to conform to population changes in the federal census. Currently, the legislature is charged with drawing the maps, which critics contend lets lawmakers pick their own voters by bending district boundaries to favor one political party over the other. The twists of the current map lines, drawn by Democrats and approved by then-Democratic Gov. Pat Quinn, is a major factor in the impasse between Gov. Bruce Rauner and Madigan. Rauner, a Republican, has pledged to use his wealth to erode Madigans power and support, which has given Democrats a 71-47 edge in the House and a 39-20 advantage in the Senate. Last November, 82 out of 137 legislative races across Illinois were uncontested. In the end, Republicans picked up only one seat from Democrats in the Senate and none in the House. In years that one party doesnt control the legislature and the governors office, a bipartisan commission tries to agree on a map. If that fails, a lottery is held usually out of a replica of Abraham Lincolns stovepipe hat to pick a tie-breaking member to determine which party controls the map. The constitutions framers hoped the lottery would force compromise out of fear the losing party would suffer overwhelmingly in the legislature. But the mapmaking clout has proven so alluring that leaders have risked the 50-50 outcome. The Independent Map amendment would scuttle the legislatures direct involvement, trading it for a more complicated method that supporters argue puts distance between politics and the process. The states auditor general would choose a three-member review panel at random from a pool of names. That panel would then select seven members at random from a different pool of 100 names to serve on a mapmaking board. Each of the four legislative leaders also would pick a member. The final 11-member board would be charged with drawing the maps, with seven votes needed for approval, including at least two members from each political party and three independents. The amendment is sure to take up a large chunk of space should it end up on the November 2016 ballot the groups sample question takes up a whole sheet of paper in small type. The ability to change the constitution through a citizens petition is extremely limited in Illinois. A judge rejected a similar legislative redistricting attempt last year because it would have unconstitutionally imposed a ban on commissioners serving in public office. That aspect is not part of the new effort. Had it survived the court challenge, it was questionable whether supporters had enough valid signatures to get on the ballot. A 2010 League of Women Voters bid also failed to gather enough valid signatures. The Independent Maps group is a bipartisan effort chaired by Dennis FitzSimons, chairman of the Robert R. McCormick Foundation and a former chairman and CEO of Tribune Co. Backers include former Republican Gov. Jim Edgar and Democrat Bill Daley, the former White House chief of staff to President Barack Obama. The group has raised almost $1.5 million since April, including $250,000 from the McCormick Foundation, $200,000 from industrialist Lester Crown, and $100,000 each from hedge fund manager Ken Griffin, venture capital investor Steve Miller, and Sam Zell, former Tribune CEO. Griffin, Crown and Zell have been financial backers of Rauner or a Rauner-aligned political action committee. On the opposite side is a group formed last month called Peoples Map, chaired by John Hooker, a former ComEd vice president and new Chicago Housing Authority chairman. The group also includes Frank Clark, retired ComEd chairman and CEO and the new Chicago Board of Education chairman; developer Elzie Higginbottom; Chicago Teachers Union President Karen Lewis and Keith Kelleher, president of the Service Employees International Union Healthcare Illinois and Indiana. Hooker, Higginbottom and Clark were among the lead plaintiffs in the successful court challenge that prevented a similar redistricting proposal from appearing on the November 2014 ballot. Their lawyer was Michael Kasper, Madigans onetime legal counsel and a top lobbyist at the Capitol and City Hall. Hooker said the previous and current opposition to the mapmaking effort was not at Madigans behest, and he selected Kasper because he has known the election law attorney for \"many, many years.\" So far, the Peoples Map group has not reported any fundraising activity. Unlike other efforts, Independent Maps got an early start in collecting petition signatures, and officials said theyve already gathered at least 280,000, with an estimated 290,216 valid ones needed to qualify for next years ballot. The goal is 600,000 by the spring deadline to submit. \"Were getting both paid and volunteer signatures and validating both sets of signatures as we go,\" said Cindi Canary, the groups executive director. But Canary and her group are fighting two related fronts. The Peoples Map group contends the Independent Maps effort would end up reducing minority representation and abet Republican attempts to gain seats in the legislature. At the same time, Rauner has made an independent map-making process one of several conditions for negotiations with Democrats over a new state budget. Canary said there is no partisan goal in the Independent Map drive and said Rauner has no involvement with the group. \"If the governors supportive, I think thats terrific. But if that leads Democrats to think its a Republican front, thats horrible because its not,\" she said. \"When I go around and talk to people, real people, the sense Im getting is: A pox on both their houses. We have no budget,\" Canary said. \"Theres a lot of screaming and fighting, and how is (any) of this making things better? We need to change things.\", But Hooker, whos no stranger to Springfield, said his biggest concern is that the Independent Map proposal relies on unelected appointees to draw new map lines in what is inherently democratic and political. \"I believe the current process, in which a majority party is chosen, is one spoken by the people,\" Hooker said. \"If they really want to change the system, my problem is I think some of the changes may have unintended consequences to minority districts.\", Hooker said his group fears that gains made over decades through the federal Voting Rights Act could unintentionally be lost. And he said he is afraid of minorities losing ground in a legislative process in which seniority helps determine who gets committee chairmanships and party leadership spots. \"The map has consequences there,\" he said. Canary, however, said the proposed amendment strengthens minority voting rights because it includes language that makes clear any new map must follow all federal civil and voting rights laws provisions not in the state constitution. The proposed amendment also states that any new map \"shall not dilute or diminish the ability of a racial or language minority community to elect the candidates of its choice, including when voting in concert with other persons.\" And the redrawn districts \"shall respect the geographic integrity of communities sharing common social and economic interests.\", Canary acknowledged she was surprised at the early pushback and the need for Independent Maps to address issues \"built on emotions.\", \"Theyre trying to pull on peoples legitimate concerns that a long history of voting rights battles will be upset,\" she said. If the proposal survives an inevitable court challenge and is found eligible for the ballot, 60 percent of voters would have to approve it. \"When you think of it that way, you realize you need a much broader demographic than any candidate gets. So I think we do very much want to talk specifically to the African-American and Hispanic community and to appeal to Democrats and Republicans, city people, suburban people and people who live in urban areas,\" Canary said. Outside the likely legal expenses, she estimated it will take $6 million to $8 million to run \"a really serious campaign\" to win passage. Hooker, who said he has raised his concerns to FitzSimons, the Independent Maps chair, said Peoples Maps launched its opposition campaign early because \"we learned from the last time that you cant let this thing fester and miss some of your opportunities to tell your side.\", \"We will take and do all the legal steps that we need to take and in the democratic process thats out there and thats available to us,\" he said. rap30@aol.com]", "Date": "20150914", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-illinois-remap-amendment-rematch-met-20150914-story.html", "Title": "[New political mapmaking push gains ground, concerns]"}