{"Content": "[The obvious problem when trying to rank the 10 people most likely to wind up as the Republican presidential nominee next year can be summed up in two words: Donald Trump. On one hand, Trump is ahead in most national polls on the nominating contest an NBC-Wall Street Journal poll out Sunday puts him at 19 percent, four points clear of Wisconsin Gov. Scott Walker and he even leads (or comes close to leading) in surveys conducted in early-voting states such as Iowa and New Hampshire. On the other hand, he is Donald Trump. I put the question of where to rank Trump to the five senior GOP strategists who arent working for one of the 17 Republicans running for the nomination. (I kid; there are at least 10 unaligned GOP operatives.) What I got from that group surprised me: They were much more bullish on Trumps chances than I expected with several arguing that Trump absolutely belonged in the top tier. I wont spoil the surprise as to where The Donald wound up. You have to read down for that. Remember that the candidates are ranked by their likelihood of winding up as the Republican nominee next year. 10. Ben Carson: His name came up quite a bit during my conversations with the Republican strategists. Not that the famed pediatric neurosurgeon would win, but that he would probably stick around for an extended period in the race because of his core group of supporters. It is worth noting that although people such as New Jersey Gov. Chris Christie and former Texas Gov. Rick Perry are fighting to stay in the top 10 to be eligible for Thursdays debate in Cleveland, Carson has been solidly in the top 10 for a while. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. 9. Christie: He hangs on in the top 10 despite reports out of New Hampshire that arent all that encouraging. Why? Because he is one of the most naturally talented candidates in the field and, at some point over the next six months, will get a second look from some GOP voters. But he is clearly nowhere close to where he wants to be. 8. Sen. Rand Paul: Theres one race that he is winning at the moment: most disappointing candidate. Pauls fundraising both for his campaign committee and his super PAC are dismal, and there seems to be dissension within his ranks. The senator from Kentucky appears to be going back to his libertarian roots to regain his footing; thats a good move for his chances of remaining in the race for an extended period but probably decreases his chances of winning. 7. Mike Huckabee: Huckabee is going to be Huckabee. The former Arkansas governor has always been a poor fundraiser and he kept up that reputation over the first six months of the year. He has also long viewed himself as a major player in the culture wars, which gets him into trouble with mainstream America fairly regularly. (The latest: his ill-advised \"ovens\" comment about Israelis and the Iran deal.) Huckabee is talented. But he just never seems to get that talent isnt enough. 6. Sen. Ted Cruz: His great strength in this race has long been that he was unchallenged for the tea party lane. Now Trump has barged into that lane and, for the moment, taken it over. Cruzs latest dust-up with establishment Republicans in the Senate will not hurt him with voters, but it ensures that this powerful group will be even more dead set on keeping the nomination from him. The senator from Texas will have enough money and is right on the issues for the Republican base. But Trumps emergence complicates Cruzs path to the nomination. 5. Gov. John Kasich: Early returns for him are promising. An ad buy in New Hampshire bumped up his numbers in that crucial early-voting state, and his polling numbers have moved up nationally, as well probably ensuring him a spot in the debate to be held in his home state of Ohio on Thursday. That said, Kasichs announcement speech was, um, terrible, and if he cannot find a more coherent (and short) message going forward, that could be problematic. 4. Trump: Yes, as of right now, Donald J. Trump is the fourth-likeliest Republican to be the partys nominee. I cant really believe it, either. However, Trumps poll numbers have not only risen rapidly but have showed some durability. Every Republican strategist I talked to put him in the top four and many ranked him as high as two or three. I still do not know whether Trump can sustain his appeal with voters, but as of today, it is what it is. (And, yes, I hate that phrase.), 3. Walker: The Wisconsin governor has withstood the Trump Bump in Iowa and still looks like a favorite to win the first-in-the-nation caucuses there in February. Among the Republicans I spoke with, real doubts remain about how ready Walker is for the big stage and how talented he is as a candidate. I think his performance thus far has been mediocre, with occasional moments of good to very good. Is that enough?, 2. Sen. Marco Rubio: Theres no debate that his poll numbers have dipped since the extended bump he received after his announcement. But, on the fundamentals, the senator from Florida is in very good shape. His fundraising performance was quite strong, he remains the second choice of lots and lots of Republicans, and conservative Republicans really like him. The most obvious problem for Rubio is that he does not have an early state where he is running very well; South Carolina seems his likeliest target. 1. Jeb Bush: Amid all of the Trumpiness of the races past six weeks, the former Florida governor has looked more and more like the adult in the room the one guy willing to stand up and say: \"Wait a minute. What exactly are we doing here?\" Bush runs little risk in taking on Trump because Trump supporters are never going to be Bush supporters and vice versa. Plus, the $114 million Bush has raised is a stunning number that ensures he will be in the race for as long as he wants to be. One note: He still has problems with the GOP base. But if Trump becomes the candidate of the GOP base, its hard to see Bush losing that one-on-one fight. Washington Post]", "Date": "20150802", "Author": "[Chris Cillizza]", "Link": "http://www.chicagotribune.com/news/opinion/ct-most-likely-to-win-gop-nomination-2016-20150802-story.html", "Title": "[Ranking the men most likely to win the GOP nomination]"}