{"Content": "[The magnolia tree in our front yard is bursting with color, all pink and white and signaling to the world that spring is here, and all I could think of was this:, Hillary must be nigh. For I could all but feel her powers. Suburban Chicago, where I live, isnt exactly Iowa, where Hillary Clinton was campaigning for the presidency. But its close enough, in that same strange country network broadcasters insist on calling \"The Heartland.\", And, so, I thought I could sense her as she rolled around Iowa in what she calls her brown \"Scooby\" van, Hillary driving, perhaps singing along to Fleetwood Mac, just another average American, just like other average Americans who name their cars after old TV shows. At some point, of course, perhaps while spontaneously interacting with voters in front of cameras, shed have lunch, maybe an average American lunch, like that average American chicken burrito bowl from Chipotle she bought herself the other day. Thats what average American former first ladies, former U.S. senators and former U.S. secretaries of state do, especially those who are worth millions and millions of dollars and whose family charitable foundations take money from Saudi Arabians, where you wont find any women running for high office. They get in line for the Chipotle burrito bowl, and they wear dark glasses because they dont want to put on airs. And then the burrito bowl episode is somehow leaked to the media, the Chipotle manager saying something like, \"Hey, I didnt know it was Hillary,\" which provides even more evidence of her average Americaninity. Try this: Just face a blooming magnolia or any other collection of vibrant blossoms and squint, and you can almost see Hillary walking around Iowa, campaigning. Squint hard enough and you might see the birds chirping, and woodland creatures following her, tiny vegetarian beasts like Thumper and Bambi, and flowers blooming in her wake. And even her footsteps smell of crushed rosemary and thyme. Im not hungry. She is. Shes been waiting a long time for this. And now its her turn. Shes also a woman, something we might even be reminded of on occasion, and if anyone dares criticize her on policy, they will be branded as women-hating misogynists. And theyll be burned at the stake and the world will hear their piteous screams as the Hillary Action Army tweets, \"Men Just Dont Get It.\", OK, they wont be burned, but those who criticize Hillary will be roundly (metaphorically) spanked. And who likes spankings? I dont. The politics of race and gender is part of the Democratic playbook. Those who dared to criticize presidential candidate Barack Obama were branded racists. If you dont believe me, think about Hillary herself, reduced to tears at that roadside diner in the 2008 campaign, her White House hopes dashed on the rocks of Obamas identity politics. She played the female card. But the Obama campaign played the race card. Bill Clinton was outraged that his wife had been branded as racially insensitive. So her favor was bought with the post of secretary of state. Hillary had already been through so much. She had to put up with Bills chasing other women and girls like the intern, Miss Lewinsky. And Hillary had to eat crow and smile and tell the world how much she liked the taste of that crow. So she rambled on about how she wasnt all about standing by her man like Tammy Wynette, even though thats exactly what she did. She had to save his presidency so that shed have this chance now. And she had developed accents. Obama has some. So does she. And as first lady of the United States, defending Bill, she told the turtles on fence posts story. It was one of those country stories told to city folk, the kind you might see in a B-movie, with some actor in overalls telling it while whittling a stick on the fake courthouse steps with others making Hollywood gestures:, \"Thats a knee-slapper, Jed!\", Only Hillary had no whittling stick. She wore a nice blue suit, and she told it on national television without any knee-slapping. And if you Google \"Hillary\" and \"turtles on fence post,\" you may find it. In her view her family troubles werent the result of what her husband did in scandal after scandal. It was all the fault of their enemies. \"You know if you find a turtle on a fence post, it didnt get there by accident,\" Hillary Clinton said in a 1998 interview on \"Good Morning America.\", \"And I just look at the landscape around here, and I see just lots of big ol turtles sitting on lots of fence posts. And I think we need to find out how those ol turtles got on those fence posts,\" Mrs. Clinton said. These days, the old turtles are gone, but the Scooby-Doo van remains. In his 2014 book, \"Clinton Inc.,\" Daniel Halper describes Hillary Clintons run for the New York Senate seat. A Secret Service agent is quoted discussing the armored brown van, \"which we had called the mystery machine, the Scooby-Doo van.\", Mrs. Clinton and her staff objected to a limousine. \"They complained that the optics werent right for an aspiring senator who wanted to look like she was a woman of the people and not a product of the White House.\", Just like the men fighting for the job, Mrs. Clinton is thoroughly a product of American politics. But shes waited longer. And now she wants her due. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150414", "Author": "[John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-hillary-clinton-runs-met-0415-20150415-column.html", "Title": "[Hillary's just another average American who's awaited her due]"}