{"Content": "[\"Thank you, Planned Parenthood. God bless you.\", Barack Obama, address to Planned Parenthood, April 26, 2013, Planned Parenthoods reaction to the release of a clandestinely recorded conversation about the sale of fetal body parts was highly revealing. After protesting that it did nothing illegal, it apologized for the \"tone\" of one of its senior directors. Her remarks lacked compassion, admitted Planned Parenthood President Cecile Richards. As if Dr. Deborah Nucatolas cold and casual discussion over salad and wine of how the fetal body can be crushed with forceps in a way that leaves valuable organs intact for sale is some kind of personal idiosyncrasy. On the contrary, its precisely the kind of psychic numbing that occurs when dealing daily with industrial-scale destruction of the growing, thriving, recognizably human fetus. This was again demonstrated by the release this week of a second video showing another official sporting that same tone casual and even jocular while haggling over the price of an embryonic liver. \"If its still low, then we can bump it up,\" she joked, \"I want a Lamborghini.\", Abortion critics have long warned that the problem is not only the obvious what abortion does to the fetus but also what it does to us. Its the same kind of desensitization that has occurred in the Netherlands with another mass exercise in life termination: assisted suicide. It began as a way to prevent the suffering of the terminally ill. It has now become so widespread and wanton that one-fifth of all Dutch assisted-suicide patients are euthanized without their explicit consent. The Planned Parenthood revelations will have an effect. Perhaps not on government funding, given the Democratic Partys unwavering support and the president wishing it divine guidance. Planned Parenthood might escape legal jeopardy as well, given the loophole in the law banning the sale of fetal parts that permits compensation for expenses (shipping and handling, as it were). But these revelations will have an effect on public perceptions. Just as ultrasound altered feelings about abortion by showing the image, the movement, the vibrant living-ness of the developing infant in utero, so, too, I suspect, will these Planned Parenthood revelations, by throwing open the door to the backroom of the clinic where that being is destroyed. Its an ugly scene. The issue is less the sale of body parts than how they are obtained. The nightmare for abortion advocates is a spreading consciousness of how exactly a healthy fetus is turned into a mass of marketable organs how, in the words of a senior Planned Parenthood official, one might use \"a less crunchy technique\" (crush the head, spare the organs) \"to get more whole specimens.\", The effect on the public is a two-step change in sensibilities. First, when ultrasound reveals how human the living fetus appears. Next, when people learn, as in these inadvertent admissions, what killing the fetus involves. Remember, the advent of ultrasound has coincided with a remarkable phenomenon: Of all the major social issues, abortion is the only one that has not moved toward increasing liberalization. While the legalization of drugs, the redefinition of marriage and other assertions of individual autonomy have advanced, some with astonishing rapidity, abortion attitudes have remained largely static. The country remains evenly split. What will be the reaction to these Planned Parenthood revelations? Right now, to try to deprive it of taxpayer money. Citizens repelled by its activities should not be made complicit in them. But why not shift the focus from the facilitator to the procedure itself?, The House has already passed a bill banning abortion after 20 weeks. Thats far more fruitful than trying to ban it entirely because, apart from the obvious constitutional issue, there is no national consensus about the moral status of the early embryo. Theres more agreement on the moral status of the later-term fetus. Indeed, about two-thirds of Americans would ban abortion after the first trimester. There is more division about the first trimester because ones views of the early embryo are largely a matter of belief, often religious belief. Ones view of the later-term fetus, however, is more a matter of what might be called sympathetic identification seeing the image of a recognizable human infant and, now, hearing from the experts exactly what it takes to \"terminate\" its existence. The role of democratic politics is to turn such moral sensibilities into law. This is a moment to press relentlessly for a national ban on late-term abortions. Washington Post Writers Group, Charles Krauthammer is a syndicated columnist. letters@charleskrauthammer.com]", "Date": "20150723", "Author": "[Charles Krauthammer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-planned-parenthood-fetal-parts-perspec-0724-20150723-story.html", "Title": "[The price of fetal parts]"}