{"Content": "[A landmark Iran nuclear agreement was taking shape early Tuesday after clearing final obstacles, and a senior diplomat said it included a compromise between Washington and Tehran that would allow U.N. inspectors to press for visits to Iranian military sites as part of their monitoring duties. But access at will to any site would not necessarily be granted and even if so, could be delayed, a condition that critics of the deal are sure to seize on as possibly giving Tehran time to cover any sign of non-compliance with its commitments. Under the deal, Tehran would have the right to challenge the U.N request and an arbitration board composed of Iran and the six world powers that negotiated with it would have to decide on the issue. Still, such an arrangement would be a notable departure from assertions by top Iranian officials that their country would never allow the U.Ns International Atomic Energy Agency into such sites. Iran has argued that such visits by the IAEA would be a cover for spying on its military secrets. Contacted shortly before daybreak, the diplomat said final drafting of the deal was still going on. But another diplomat said that the deal was tentatively set to be announced in the afternoon Vienna time. Both demanded anonymity because they are not authorized to discuss the confidential negotiations. While access is a key part of monitoring envisaged cuts on Tehrans present nuclear activities, it is also important for the IAEA as it tries to kick-start nearly a decade of stalled attempts to probe allegations that Iran worked on nuclear arms. Washington says that Iran must cooperate with the IAEAs probe as part of any overall deal before all sanctions on it are lifted. The Iranians insist they have never worked on weapons and have turned down IAEA requests to visit sites where the agency suspects such work was going on, including Parchin, the military complex near Tehran where the agency believes explosives testing linked to setting off a nuclear charge was conducted. Irans acceptance in principle of access to military sites will give the agency extra authority in its attempts to go to the site and its demands previously rejected by Tehran to interview scientists it suspects were involved in the alleged nuclear weapons work. Any deal will go to the U.N. Security Council, which is expected to endorse by the end of the month, to start the mechanics of implementation long-term, verifiable limits on Iranian nuclear programs that could be used to make weapons in exchange for an end to sanctions on the Islamic Republic. The deal also must address Irans call that an arms embargo on it be lifted or at least modified and U.S. opposition to the demand. Washington wants to maintain the ban on importing and exporting weapons, concerned that an Iran flush with cash from the nuclear deal would expand its military assistance for Syrian President Bashar Assads government, Yemens Houthi rebels, the Lebanese militant group Hezbollah and other forces opposing Americas Mideast allies such as Saudi Arabia and Israel. Iranian leaders say the embargo must end as their forces are combating regional scourges such as the Islamic State. And theyre getting support from both Russia and China, who want at least a partial lifting of the restrictions. Moscow, in particular, hopes to expand military cooperation and arms sales to Tehran, including the long-delayed transfer of S-300 advanced air defense systems a move long opposed by the United States. As a midnight Monday target for a deal approached in Vienna, diplomats said the nuts and bolts of the written nuclear accord had been settled days ago. And Iranian President Hassan Rouhani briefly raised expectations of an imminent breakthrough by proclaiming on Twitter: \"Iran Deal is the victory of diplomacy & mutual respect over the outdated paradigm of exclusion & coercion. And this is a good beginning.\", Minutes later, Rouhanis tweet was deleted. He then retransmitted it, adding the word \"If\" in front of \"Iran Deal\" to reflect that negotiators werent there yet. The proposed pact would impose long-term and verifiable limits on Irans nuclear program and provide the Islamic Republic tens of billions of dollars in relief from international sanctions. Associated Press]", "Date": "20150714", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-iran-nuclear-deal-20150713-story.html", "Title": "[Diplomats: Iran nuclear agreement likely Tuesday afternoon]"}