{"Content": "[The Porter County Property Tax Board of Appeals entered the space-time continuum Tuesday and the Greater Valparaiso Chamber of Commerce came out with an answer in its quest to keep its personal and real property exemption. The board ruled that the chamber could have an exemption of 70.5 percent. \"I think thats a very fair allocation of the use,\" said attorney Todd Leeth, who represented the chamber, adding it was within 2 percent or 3 percent of where he thought it would be. The chamber applied for and received a full exemption in 2004, one year after the entity purchased its building at 162 Lincolnway, said Rex Richards, the chambers president. Jon Snyder, the county assessor, announced in January that a wide swath of organizations from throughout the county would have to appear before PTABOA to defend their tax-exempt status, including the chamber. State statute dictates that at least 50 percent of a building be used for activities that fall under the tax exempt classification; those classifications include charitable, educational and religious purposes. Nursing home facilities also are exempt. Because the burden of proof falls on the taxpayers, it was up to the chamber to prove enough of its building was used for educational purposes that it could still receive an exemption. Tuesdays hearing on the chamber, which was continued in April so PTABOA could get more information, focused on what percent of the chambers building was used by the nine or so entities the chamber shares its quarters with, and how much time each of those groups used the building. Those groups include the Service Corps of Retired Executives, or SCORE, where potential business owners or those who want to grow their business have a mentoring relationship with SCORE members. The groups outreach expands throughout the region, Richards said. \"In my take, thats educational,\" Leeth said, noting the mentoring aspect of the program. \"I think that falls within the intent of statute for educational purposes.\", The Valparaiso schools also have used the building, Richards said, for training for the superintendents staff. The Valparaiso City Council also used the offices to interview school board candidates. \"This is a community building, so the school corporation has used it from time to time,\" he said. Amy Lavalley is a freelance reporter for the Post-Tribune.]", "Date": "20150728", "Author": "[Amy Lavalley]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-porter-tax-board-st-0729-20150728-story.html", "Title": "[Chamber to get reduced property tax exemption ]"}