{"Content": "[A prize for whoever could have predicted that water cooler gossip from the first Republican presidential debate would include menstrual cycles. Yes, days after the GOP candidates staged their first debates on national television, the primary talking point remains a postmortem on Donald Trumps remark about moderator Megyn Kellys \"blood coming out of her wherever.\", Oh boy. What did he say? Wait. Was that a sexist remark? Or an \"Amityville Horror\" flashback?, Kelly responded to the weird Trump-ism on Monday night, telling viewers of her show \"The Kelly File\" that she would not \"apologize for doing good journalism, so Ill continue doing my job without fear or favor.\", Jeb Bush blames Clinton for ISIS and Trump complains about mistreatment. August 11, 2015. (WGN-TV), Jeb Bush blames Clinton for ISIS and Trump complains about mistreatment. August 11, 2015. (WGN-TV), Trump, for his part, had better get used to hard questions coming at him without fear or favor. He is, after all, running for president. That said, everyone who confidently predicts Trumps political demise after each crude comment might have to get used to being wrong. It seems that supporters of the unfiltered, unscripted, unapologetic Trump only grow more fond of him. They like his shoot-from-the-hip attitude. They squeal when he knocks the finer-tuned candidates off their game. They high-five when he offends particularly when he offends people they perceive as Americas self-important elites. It seems to work. Polls showed he held or gained support after insulting Kelly, and before that John McCain, and before that the entire nation of Mexico. But hes not really that ... artful ... at the insult. Singed by Kellys question about how he has treated women and how he would answer the charge by Democrat Hillary Clinton that hes \"part of the war on women\" Trump lashed out. He told CNN after the debate that Kelly was gunning for him, that \"you could see there was blood coming out of her eyes. Blood coming out of her wherever.\", Trump insisted he was not implying that the Fox News host was having her period and sour because of it. She was, he reiterates, gunning for him. Thats what he meant. Thats what he says he meant. And really, isnt that the likely explanation? A blurted stream of consciousness, given the deliverer? Watching him sputter, we didnt think his inanity looked rehearsed. He didnt appear to have that much discipline. Trumps insults are hardly nuanced. He prefers schoolyard taunts; to quote Kelly quoting Trump: \"Youve called women you dont like fat pigs, dogs, slobs, and disgusting animals. \" Thats Trumps preferred vernacular. Look, we can appreciate the fine art of ... the artful insult. \"Thou art a boil, a plague-sore or embossed carbuncle in my corrupted blood.\" King Lear. Now William Shakespeare could sling an insult. Alas, what Trump lacks in comparable quality he tries to make up for in volume. Doesnt suffice. For viewers and pundits, a more substantive takeaway from the debate could have been Gov. Chris Christies straight talk on the need for entitlement reform or Gov. John Kasichs compassionate explanation for why he expanded Medicaid in Ohio. Christie and Sen. Rand Paul had a delicious (if brief) debate on the balance of liberty and security. But Trump is still all the talk. And thats OK for now. Its easy for Trump to dismiss the calls for him to leave the race, given that in polling hes leading the race. And theres really no reason for him to withdraw. Hes not damaging the Republican Party. Heck, the rest of the GOP candidates have jumped at the chance to wag their fingers at him. And as we wrote after the debate, an outspoken Trump frees the other candidates to abandon their safe, scripted talking points. Voters will tell Trump when its time to go away. Wont they?]", "Date": "20150811", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-edit-trump-megyn-kelly-christie-paul-bush-rubio-edit-0812-bd-20150811-story.html", "Title": "[What's a party to do about Trump?]"}