{"Content": "[One of the key arguments used by the United States and the Western powers to justify the recent Iran nuclear deal is that the alternative to this deal is war. This is simply not true. There is a third option. It is called waiting. For several years, Iran has been on the threshold of developing a nuclear weapon. All that was missing was a decision by Supreme Leader Ayatollah Ali Khamenei to do so. Many of us have read the occasional International Atomic Energy Agency report on Irans growing stockpile of enriched uranium and centrifuge cascades, but in the end, Iran did not build the bomb. Instead, it continued to straddle the fine line between expanding its nuclear capabilities without breaking out to build the bomb. Why? Because Irans goal has not been to merely get a nuclear bomb. It wants to acquire the bomb while ensuring the survival of its regime. That is why the world needs to wait and give the existing sanctions more time. These sanctions have already caused significant damage to Irans economy and are the very reason the Iranians came to the table in the first place. If the sanctions remain, Irans regime will not be able to survive for long. Unlike North Korea, which was willing to be cut off from the world so it could develop nuclear weapons, Iran cares for its economy and wishes to retain high-level international trade. Iran is no North Korea. But, we are told, Iran will never forfeit its military nuclear program. Wrong. What seems impossible today is possible tomorrow if we are just willing to have patience, to wait and keep up the pressure. Iran must face an either-or decision: either give up its nuclear bomb program or give up its economy. It cant have both. The proposed deal reached earlier this month gives Iran exactly what it wanted sanctions relief and an opportunity to wait for the right moment to build the bomb. When that happens assuming the West discovers the violation it will be almost impossible to reimpose the sanctions with the same impact they are having today. Iran is ruled by a ruthless regime that cannot be trusted. It has already violated consecutive United Nations Security Council resolutions, and to think that it will now adhere to this deal is to ignore reality. When a criminal keeps on stealing, we dont say, let him keep his catch. We throw him in prison. Proponents of the deal will read this and say: \"We have tried sanctions for nearly a decade, and they havent worked. In addition, countries like Russia and China wont allow new sanctions.\", Both these arguments are misleading. First, the new sanctions of 2012 are working. In fact, theyre incredibly effective. While it is true that certain sanctions have been in place for years, the so-called crippling sanctions in place today were only imposed over the past couple of years. They are what brought Iran to the table, and they are what will get Iran to agree to a better deal. And even if we accept the argument that certain countries will lift their sanctions, those imposed independently by the U.S. and European Union are enough to impair Irans ability to conduct trade on the global market. These sanctions, like the banking freeze, have a crippling effect, and international businesses will not risk being blacklisted by the United States and the European Union to make a few dollars in Iran. Simply put, Americas sanctions can alone do the job. This is a historic moment, and I, too, understand the desire to reach a deal. For years, the world has been forced to confront Iran and its nuclear ambitions. There is something appealing in buying a decade of quiet with the proposed deal. But this is an illusion. For countries like Israel, Saudi Arabia and our other neighbors in the Middle East, this deal is no more than a facade that provides cover for Iran to eventually get the bomb. We see already now what an Iran without a nuclear weapon is doing destabilizing Yemen and solidifying its grip on Lebanon, Syria, Iraq and the Gaza Strip. This deal makes no mention of Irans support of terror. Should we suddenly believe this will all magically stop?, Israel is perhaps the country with the most to lose if the same ayatollahs who call for our destruction obtain weapons of mass destruction. But we have patience and are willing to wait for the right deal to be reached to bring a viable, true and long-lasting peace to the region. A good deal can and must be achieved. It is up to the world to make sure that happens. Naftali Bennett is Israels minister of economy and chairman of the Jewish Home Party.]", "Date": "20150408", "Author": "[Naftali Bennett]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-nuclear-framework-israel-obama-united-nations-perspec-0409-jm-20150408-story.html", "Title": "[Keep up the sanctions and wait out Iran]"}