{"Content": "[Conventional wisdom suggests the Supreme Courts ruling that federal subsidies are not illegal despite the sloppy language of the Affordable Care Act is a huge blow to Republicans, who have long been trying to dismantle an odious law that conservatives believe will inevitably make health insurance more expensive and greatly reduce quality of care. Indeed, earlier this month President Barack Obama warned Republicans that overturning the federal subsidies would be a loss for Republicans. \"This is now part of the fabric of how we care for one another,\" he said. \"It seems so cynical to want to take health care away from millions of people.\", And now that the Supreme Court has allowed the law to stand as it was originally drafted, Democrats are basking in the victory. Hillary Clinton tweeted, \"Yes! SCOTUS affirms what we know is true in our hearts and under the law: Health insurance should be affordable and available to all. -H\", Of course, its not the first time Americans have been told to just ignore the language of the Affordable Care Act, but Republicans neednt lick their wounds over the defeat. Politically, this is actually a win and Democrats shouldnt be so quick to gloat. For one, while invalidating the subsidies would have been a symbolic victory for the Republicans who have been insisting the law was badly written and ill-conceived, it would have brought huge new problems for the GOP and at the worst possible time. Twenty-six of the 34 states affected by the ruling where many people would have lost their health insurance have Republican governors, as well as 22 GOP senators up for re-election in 2016. When people who once could afford health insurance are suddenly without it, they dont go to the ballot box blaming Obamas lousy law-writing abilities. They blame Republicans. Then there was the practical issue of what to do if the law collapsed, as many said it would if the court ruled against it. In April, U.S. Sen. Ron Johnson, R-Wis. rightly warned, \"Without an effective response from Republicans, there is little doubt that the crisis would allow President Obama to permanently cement Obamacare in place.\", To that end, he and others, including Republican U.S. Sens. Lamar Alexander, Orrin Hatch and John Barrasso, offered up the idea of stop-gap legislation to keep subsidizing health insurance for a transitional period while states came up with their own markets. That sounds good, but probably easier said than done. In the chaos of a collapsed health care law, its unlikely Republicans could get their states settled and subsidized through 2016. Rhetorically, the ruling did Republicans a tremendous favor as well. Republicans running for president would much rather be able to rail against Obamacare than gloat about the loss of health insurance for as many as 8 million Americans. Case in point? The reaction of Republican National Committee Chairman Reince Priebus to the SCOTUS ruling: \"Todays ruling makes it clear that if we want to fix our broken health care system, then we will need to elect a Republican president with proven ideas and real solutions that will help American families.\", Former Texas Gov. Rick Perry, running for president, echoed those sentiments: \"While I disagree with the ruling, it was never up to the Supreme Court to save us from Obamacare. We need leadership in the White House that recognizes the folly of having to pass a bill to know whats in it.\", Furthermore, while opposing Obamacare was great for business in 2010 and 2012, ushering in a wave of Republican legislators like Rand Paul and Ted Cruz, Republicans today would much rather be discussing Obamas failed foreign policy and scandal-ridden bureaucracies, the fragile economy and the widening of income inequality under his wealth-redistributing administration. With the ruling, now they can. One person for whom the ruling isnt such good news? Hillary Clinton, who would have had a terrific talking point on her presidential campaign if shed been able to hammer the Republicans for taking away your health care. The Obamacare ruling is good news for the millions of Americans who cannot afford insurance and can now keep receiving federal subsidies. Its bad news for the future, however, if we cant find a way to insure the sick and elderly without great cost to the young and healthy. As for Republicans, it looks like they just dodged a bullet. S.E. Cupp is a Washington-based CNN contributor and author of \"Losing Our Religion.\", Tribune Content Agency, thesecupp.com]", "Date": "20150628", "Author": "[S.E. Cupp]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-supreme-court-republicans-obamacare-perspec-0629-20150626-story.html", "Title": "[The Supreme Court's gift to Republicans]"}