{"Content": "[Marking the 50th anniversary of the Voting Rights Act, President Barack Obama remembered the African-American men and women across the South who won their rights through persistence and courage, and he urged citizens today not to give up that hard-earned power of the ballot. Americans owe a great debt, Obama said, to the \"thousands, many of them unnamed, who were courageous enough to walk up and try to register time and time again.\", \"Sharecroppers, maids, ordinary folks had it not been for them awakening the consciousness of the nation, the president could not have mustered the political support that was required to ultimately get this seminal law passed,\" Obama said. He appeared at a White House event alongside Rep. John Lewis, D-Ga. who was among the civil rights protesters who marched with Martin Luther King Jr. in Selma, Ala. in 1965. News broadcasts showing police beating protesters especially live coverage of the \"Bloody Sunday\" attack at the Edmund Pettus Bridge stirred outrage that helped President Lyndon Johnson push the Voting Rights Act through Congress. Obama, the nations first black president, said the right to vote is accepted now, \"in the abstract, at least,\" but has been eroded by voter ID laws, bans on voting by felons and other measures that fall hardest on minorities, the poor, students or the elderly. He called on Congress to revise and strengthen the Voting Rights Act in response to a Supreme Court decision that struck down a major provision of the law as outdated. Still, Obama said, its not voter suppression efforts that are primarily to blame for keeping Americans away from the polls. An article on the front page of the Los Angeles Times on Aug. 7, 1965 about Pres. Lyndon B. Johnson signing the Voting Rights Act. An article on the front page of the Los Angeles Times on Aug. 7, 1965 about Pres. Lyndon B. Johnson signing the Voting Rights Act. \"The fact of the matter is that far more people disenfranchise themselves than any law does by not participating, by not getting involved,\" Obama said. \"Huge chunks of us citizens give away our power,\" he said. Obama declared a national voter registration day on Sept. 22, calling for a sweeping effort to get everyone registered. Associated Press]", "Date": "20150806", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-voting-rights-act-anniversary-obama-20150806-story.html", "Title": "[ On anniversary of Voting Rights Act, Obama says too few use hard-won right ]"}