{"Content": "[Mitt Romney, the Republican nominee for president in 2012, called for the immediate removal of the Confederate battle flag from outside the South Carolina Statehouse, scrambling the 2016 GOP presidential contenders into staking a position on a contentious cultural issue. Some still steered clear from the sensitive debate, even after the shooting deaths of nine people in a historic African-American church in Charleston further exposed the raw emotions about the flying the flag. Many see the Confederate flag as \"a symbol of racial hatred,\" Romney tweeted on Saturday. \"Remove it now to honor #Charleston victims.\", The former Massachusetts governor joins President Barack Obama and civil rights leaders in calling for the flag to come down as the nation grapples with Wednesdays murders. The man charged with the crimes, Dylann Storm Roof, held the Confederate flag in a photograph on a website and displayed the flags of defeated white-supremacist governments in Africa on his Facebook page. Romneys statement prompted most of the Republican Partys leading presidential contenders to weigh in on flying the Confederate battle flag, although few took a definitive position one way or the other. Many instead expressed personal dislike for the flag, but suggested it was up to the people of South Carolina to decide. Former Florida Gov. Jeb Bush said Saturday his position is clear: \"In Florida we acted, moving the flag from the state grounds to a museum where it belonged,\" he said in a statement provided to The Associated Press, referring to his 2001 order to remove the Confederate battle flag from the grounds of the historic Old Capitol building. \"Following a period of mourning there will rightly be a discussion among leaders in the state about how South Carolina should move forward, and Im confident they will do the right thing,\" Bush said. Wisconsin Gov. Scott Walker declined to offer his position. \"I think theyre going to have a good, healthy debate and should have a healthy debate in South Carolina amongst officials at the state level,\" he told reporters after a speech Saturday night in Washington. \"I think out of deference, before we have that discussion, we should allow the families of the loved ones to bury their dead.\", South Carolina was the last state to fly the Confederate battle flag from its Capitol dome. A compromise in 2000 moved the flag to a 30-foot flagpole elsewhere on Statehouse grounds, where it has been flying at full staff. The debate holds political risks for Republicans eager to win over South Carolina conservatives who support the display of the battle flag on public grounds. The state will host the nations third presidential primary contest in February, a critical contest in the 2016 race. South Carolina Sen. Lindsey Graham, one of four Republican senators running for president, told CNN hes open to revisiting the decision to use the flag, but it \"is a part of who we are.\", Former technology executive Carly Fiorina said Saturday she agrees the flag is a \"symbol of racial hatred\" yet declined to call for its removal, saying her \"personal opinion is not whats relevant here.\", Texas Sen. Ted Cruz said the last thing the people of South Carolina need is \"people from outside of the state coming in and dictating how they should resolve it,\" Cruz said in a statement provided to The Associated Press. He said he understands both sides of the debate including those who see the flag as a symbol of \"racial oppression and a history of slavery\" and \"those who want to remember the sacrifices of their ancestors and the traditions of their states not the racial oppression, but the historical traditions.\", Ohio Gov. John Kasich said its ultimately \"up to the people of South Carolina to decide, but if I were a citizen of South Carolina Id be for taking it down.\", Spokesmen for most of the other Republican presidential contenders also either ignored such questions or formally declined to comment. They include Louisiana Gov. Bobby Jindal, former Arkansas Gov. Mike Huckabee, businessman Donald Trump and Sens. Rand Paul and Marco Rubio. Democrats have been more willing to offer their opinions. A White House spokesman said Friday that Obama continues to believe the flag belongs in a museum. Democratic presidential contender Hillary Rodham Clinton has yet to address the issue this week, but in 2007 called for the flags removal, in part because the nation should unite under one banner while at war. Associated Press]", "Date": "20150620", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-confederate-flag-debate-20150620-story.html", "Title": "[ Confederate flag sets off debate among GOP 2016 contenders ]"}