{"Content": "[Ben Carson likes to tell a joke about how his fellow conservatives, his silent majority, can get out the vote. He told one version of it at a speech in Conroe, Texas, an exurb north of Houston, and more than 1,000 people roared with laughter. He told it the same way to the conservative Eagle Forum conference this weekend, where the demand for seats here forced organizers to move Carsons appearance from the hotel into a wedding tent. \"Go talk to your uncle, who is an alcoholic,\" Carson said. \"All he wants to do is drink all day long. Let him know that if we go down this road, therell be no alcohol!\", Its not clear why those words strike a chord with supporters. Nor is it clear how Carson is drawing enormous crowds in places barely touched by his rivals, including in Anaheim, California, and Ferguson, Missouri where, on the anniversary of the Sept. 11, 2001, terrorist attacks, he talked with the mayor about racial healing rather than chasing the news cycle of somber remembrances. What is clear is that Carson, a retired neurosurgeon, will enter the second GOP debate Wednesday polling behind only Donald Trump, another non-politician in the presidential race doing little of whats expected from candidates. And that seems to be the takeaway, so far, of the 2016 Republican nominating process. Like front-runner Trump, Carson is running laps around the candidates who have conventional political experience and are reading from a playbook that seems to have stopped working this year. While the rest of the Republican field fulminated about the Iran nuclear deal working its way through Washington, Carson was several time zones away, quibbling with Trumps harsh characterization of the \"stupid\" deal. \"I would call it unwise, perhaps, but not stupid,\" Carson said in Anaheim. \"To some degree, I fault Congress for not insisting that something that involves us and other nations is a treaty. If its a treaty, it has to be approved by two-thirds of the Senate. I dont know why our leaders are not savvy enough to understand that.\", An unlikely movement has begun rallying around that soft-spoken but uncompromising approach to politics. Carsons supporters often see the hand of God in his success. In Texas, supporters set up a table piled with copies of \"Ben Carson: Rx for America,\" written by John Philip Sousa IV, who works for the 2016 Committee, the pro-Carson super PAC. All 800 copies of the book were gone before Carson finished his speech. The volunteer forms filled up so quickly, with at least 500 people signing up, that people took to scrawling on the blank sides. \"This is God its all God,\" said Shannon Farr, the Texas chairman of the super PAC. \"I was that person who said: I came here to drink a margarita and talk. I dont want to talk about politics. Now Im the one talking politics and no one wants to drink a margarita with me.\", Carsons rally in Anaheim drew nearly 8,000 people to a conference center where parking cost $15 and signs for corporate events outnumbered a single whiteboard announcing Carson. The speech in Texas packed a high school auditorium and most of its cafeteria, where stragglers could watch a simulcast. One thing missing has been the national news media. In Anaheim and in St. Louis, Carson held news conferences in which empty chairs outnumbered reporters by as many as 5 to 1. But even those gatherings eventually filled up, once VIP supporters were brought in to watch Carson handle reporters. At every stop, supporters brought copies of his books, copies of the film adaptation of his life, stories of how his brain surgeries saved their niece or nephew or son. \"Its a God thing hes God-sent,\" said Bill Springer, 71, after Carsons speech in Texas. \"Obama was God-sent, too. Obama is a blessing, because hes doing what God has planned, so wed better get ready for it.\", Springer was talking about the apocalypse. In fact, the brightest-burning enthusiasm for Carsons campaign comes from evangelical voters, who cheer when Carson says that the 2012 election was lost when too few of them voted. A Quinnipiac University poll confirming a Carson surge last week found him easily winning over born-again evangelical voters, with support from 27 percent of those surveyed going to Carson compared with 20 percent for Trump and 15 percent for Sen. Ted Cruz, R-Texas. Carson is not the first evangelical conservative to come to such prominence; the televangelist Pat Robertson was competitive in 1988, and in 2008, former Arkansas governor Mike Huckabee built a machine from Iowas network of pastors. But Robertson and Huckabee had to do some introductions, and they learned the patois of politics. Carson sounds completely unlike a politician. He also has not needed an introduction; his memoir, \"Gifted Hands,\" has been in some home-school curricula for years. \"I dont think that my campaign is a religious campaign,\" Carson told reporters in Anaheim, \"but I do believe that our country has a faith-based foundation. I know how many people would like to deny that, but think about it. Our founding document refers to the inalienable rights given to us by our creator.\", He sounded out that word cre-a-tor. Carson often starts sentences with phrases such as \"its very interesting\" or \"people like to say\" before softly pummeling some \"stupid\" argument that someone made to contradict him. Other candidates, with more electoral experience, talk about the fight for religious liberty. Carson skips to the part about secularists being stupid. \"Every bill in our pocket says, In God We Trust, \" Carson said in Anaheim. \"If its in our founding documents, its in our courts and its on our money, and were not supposed to talk about it what in the world is that? In medicine, wed call it schizophrenia.\" Schiz-o-phren-i-a. Carson talks matter-of-factly about his own intellect. The typical Carson stump speech spends 10 or more minutes telling the story of his youth. Its all there in \"Gifted Hands\" and the other books, but theres something potent about Carsons own telling of how he used to tease kids, get in fights or struggle as the \"worst student\" and someone who \"hated poverty.\", That approach lets Carson evade the normal traps that ensnare candidates and lets him echo the fears of evangelicals without anyone hearing a pander. In each speech this past week, Carson talked up the need for a viable guest-worker program, where even those who had illegally immigrated to the country could be eligible. Every time, he took questions. No one accused him of backing \"amnesty\" though it helped when he suggested canceling 10 visas from the country of any one immigrant who was found overstaying a visa. Every time, he described how a president could \"destroy America\" if he was so inclined and he proceeded to describe the policies of President Obama. The litany ran from \"dividing us by race\" to \"giving people free phones,\" a misreading of a policy that predates his presidency. \"I was an intern in George W. Bushs White House, and I volunteered for Mitt Romneys campaign,\" said Brian Foley, 30, who brought his young family to see Carson in Texas. \"My wife and I talked about it, and we donated to him. We hadnt donated money until this campaign. Hes a guy who can inspire the whole nation. I liked how he referenced Thomas Jefferson and Benjamin Franklins idea that the population of America needs to be educated. That way, we could be less easily manipulated by people with their own agendas.\", Carsons rivals, some of whom have waited out previous summer surges, have no choice but to do the same now. Like Trump, he is seen by rivals as a holding center for very gettable voters, people who might come around once they think seriously about the demands of the presidency. \"If you can separate Siamese twins, youve clearly shown capacity to take complex things and make them work,\" said Huckabee, whose efforts to win back evangelical voters hit an apex with his Tuesday rally supporting Rowan County, Ky. clerk Kim Davis, who has refused to issue marriage licenses to same-sex couples. \"At some point, people will start asking themselves: Whos prepared to sit in the office and carry out this job?\", Carsons answer to a question such as Huckabees is that Carson grew up poor, and he became a doctor. He didnt think he was a politician, then people saw his address at the 2013 National Prayer Breakfast, and God told him he had it in him. \"All the political pundits were saying its impossible,\" Carson told his audience in St. Louis. \" Someone like you? You cant put together the political organization. You cant raise the money. I said, Phew, good! Its good to hear that. I finally said, Lord, all the experts say its impossible. But if you want me to do it, if you open the doors, Ill walk through them. \", An hour after Carson said that, former Texas governor Rick Perry wrapped up his own speech in which he suspended his campaign for the Republican nomination. No candidate had entered the 2016 race with more executive experience as Perry had, and no one had failed so fundamentally to get traction. Perry, in some ways, was the first true victim of the Carson surge. Huckabee, who closed out the afternoon, was determined not to be the second. \"I delight that hes in the race,\" Huckabee said. \"Id delight more if he were at about half a percent.\"]", "Date": "20150913", "Author": "[David Weigel]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-trump-carson-gop-poll-20150913-story.html", "Title": "[Poll: Trump, Carson top GOP race; Clinton leads Dems but support drops]"}