{"Content": "[Parents and residents criticized proposed budget cuts by Chicago Public Schools at one of three public hearings Tuesday, while district officials repeated a warning that the systems bleak financial picture will only worsen without help from state lawmakers. \"Dont hurt us anymore,\" said CPS parent Naomi Counter-Ohiri during a hearing at Malcolm X College on the Near West Side. \"Im pleading to your humanity. When you cut, you cut to the bone. And we are the bone.\", Tuesdays hearings were the publics sole opportunity to deliver feedback on a proposed $5.7 billion operating budget before a scheduled vote next Wednesday by the Chicago Board of Education. The district earlier this summer announced $200 million in spending cuts that included the elimination of more than 1,000 jobs. \"We obviously are facing some huge fiscal challenges,\" school board Vice President Jesse Ruiz told residents at Malcolm X. \"Were doing our best to address those and keep cuts away from the classrooms. Without our partners in Springfield, its going to be very difficult to do.\", The budget, unveiled about a week ago, bets on about $500 million in help from Springfield and was meant in part to pressure Gov. Bruce Rauner and state lawmakers into providing that amount in pension relief. \"If we dont receive that, then the challenges are great,\" CPS chief financial officer, Ginger Ostro, told the crowd. \"Well have to engage in further unsustainable borrowing or potentially even additional cuts.\", District officials also heard from advocates for students with disabilities and special needs who were critical of plans to trim spending on special education. \"Without adequate supports, how are students with disabilities that are talented and intelligent supposed to achieve their goals, further their education or even have access to decent housing in the city of Chicago?\" said Jaime Cornejo, who is affiliated with the Access Living disability rights group. \"I ask you all, I ask the board, to invest in us not divest in us,\" he said. \"We deserve equitable education. We need these support systems and services right now, because we cant miss out on future opportunities.\", According to district officials, the cuts to special education stem from a review by the Office of Diverse Learner Supports and Services that concluded CPS spending exceeds state standards for special education in regard to staffing. As a result, hundreds of teachers and support staff assigned to students with disabilities could be laid off. \"Were trying to make sure that were aligning all the supports and services that were delivering to (state) guidelines,\" Markay Winston, the districts top official for special education services, said at the hearing. \"Part of the effort is, one, to make sure were closer in alignment with our class size ratios. But at the same time, we are not watering down or compromising the quality of supports and services that were delivering.\", The other hearings Tuesday were at Olive-Harvey College on the South Side and Schurz High School on the Northwest Side. jjperez@tribpub.com, Twitter @perezjr]", "Date": "20150819", "Author": "[Juan Perez Jr.]", "Link": "http://www.chicagotribune.com/news/ct-cps-budget-hearings-met-0819-20150818-story.html", "Title": "[CPS budget hearing elicits criticism as officials repeat dire forecast]"}