{"Content": "[Bernie Sanders picked up his first major labor endorsement from the nations largest organization of nurses, reflecting the Vermont senators appeal among unions in his challenge to Hillary Rodham Clinton for the Democratic presidential nomination. The 185,000-member National Nurses United endorsed Sanders during an event with the independent senator in Oakland, California. Clinton received the backing of the 1.6 million-member American Federation of Teachers last month, a union that includes about 120,000 health care workers. But Sanders endorsement is noteworthy because about 90 percent of the NNUs members are women, and it comes as the Democratic presidential field has been actively courting labor unions. Bernie Sanders finished off his west coast campaign swing with a stop in Los Angeles on Monday where he spoke before a large crowd of supporters at the Los Angeles Memorial Sports Arena. (KTLA - Los Angeles), Bernie Sanders finished off his west coast campaign swing with a stop in Los Angeles on Monday where he spoke before a large crowd of supporters at the Los Angeles Memorial Sports Arena. (KTLA - Los Angeles), \"We assumed because we are a womans organization a lot of the nurses would find Hillary Clinton far more resonant because she would break the glass ceiling,\" said RoseAnn DeMoro, the unions executive director, in a phone interview. \"They were far more concerned about breaking Wall Streets stranglehold on our economy than the glass ceiling.\", Clinton, who is seeking to become the nations first female president, met privately with the executive board of the AFL-CIO in late July, as did Sanders, former Maryland Gov. Martin OMalley and former Virginia Sen. Jim Webb. The AFL-CIO, labors umbrella organization, has not indicated whether it would endorse a candidate during the primaries. Announcing the endorsement, members of the nurses union pointed to Sanders record of seeking a single-payer health care system through the expansion of Medicare, his work to challenge Wall Streets role in the economy and his opposition to the Trans-Pacific Partnership trade deal. Sanders and OMalley have joined with labor unions and liberals to oppose the trade deal backed by President Barack Obama but Clinton has declined to take a firm position on the TPP, pointing to her early work on the pact. The nurses union opposes the deal because they say it would empower the pharmaceutical industry and increase drug costs for patients. DeMoro, who attended the private sessions as an AFL-CIO vice president, said Clinton declined to take a position on TPP during the meeting. \"She is so poll-driven, I felt sorry for her. I felt sorry for her sitting in that room,\" DeMoro said. She said that while Clinton has deep support within the party, it may be difficult for the leaders of individual unions to justify endorsing Clinton to their members. \"Its assumed that everyone is supposed to endorse Clinton. I think there is a deep concern of how the members would view that,\" she said. Ann Twomey, president of the Health Professionals and Allied Employees, an AFT affiliate headquartered in New Jersey, said in an interview that Clinton had focused on a number of issues crucial to nurses, including health care access, childrens health and nurse-patient staffing levels. \"She provides a unique and accomplished set of credentials that the other candidates dont have,\" Twomey said. Sanders said in Oakland that the nurses endorsement was an important milestone for his campaign and lauded the groups members as the \"backbone of our health care system.\", \"We have to change the health care system in America and we have to change, boldly and fundamentally, the priorities of this nation,\" Sanders said. Associated Press]", "Date": "20150810", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-bernie-sanders-campaign-20150810-story.html", "Title": "[Bernie Sanders picks up first major labor endorsement ]"}