{"Content": "[The South Carolina House approved a bill removing the Confederate flag from the Capitol grounds, a stunning reversal in a state that was the first to leave the Union in 1860 and raised the flag again at its Statehouse more than 50 years ago to protest the civil rights movement. The move early Thursday came after more than 13 hours of passionate and contentious debate, and just weeks after the fatal shootings of nine black church members, including a state senator, at a Bible study in Charleston. \"South Carolina can remove the stain from our lives,\" said 64-year-old Rep. Joe Neal, a black Democrat first elected in 1992. \"I never thought in my lifetime I would see this.\", The House approved the Senate bill by a two-thirds margin, and the bill now goes to Republican Gov. Nikki Haleys desk. She supports the measure, which calls for the banner to come down within 24 hours of her signature. Its not clear exactly when that will be. \"It is a new day in South Carolina, a day we can all be proud of, a day that truly brings us all together as we continue to heal, as one people and one state,\" Haley said in a statement. Haley herself reversed her position on the flag, saying the pain, grief and grace of the families of the victims in the shooting at Emanuel African Methodist Episcopal church caused her to realize that while some conservative whites saw the Confederate flag as a symbol of pride in their Southern ancestors, most of the blacks who make up a third of the states population see it as a dark reminder of a racist past. The man charged in the shooting, Dylann Roof, brought that view home, telling survivors of the attack that he killed blacks because they were raping white women and taking over the country, according to witnesses. Roof also reportedly took photographs of himself holding the Confederate flag. Earlier Wednesday, a group of Republicans had mounted opposition to immediately removing the flag, but at each turn, they were beaten back by a slightly larger, bipartisan group of legislators who believed there must be no delay. As House members deliberated well into the night, there were tears of anger and shared memories of Civil War ancestors. Black Democrats, frustrated at being asked to show grace to Civil War soldiers as the debate wore on, warned the state was embarrassing itself. Changing the Senate bill could have meant it weeks or even months to remove the flag, perhaps blunting momentum that has grown since the church massacre. Republican Rep. Jenny Horne reminded her colleagues she was a descendent of Confederate President Jefferson Davis, and scolded fellow members of her party for stalling the debate with dozens of amendments. She cried as she remembered the funeral of her slain colleague state Sen. Clementa Pinckney, the pastor of Emanuel African Methodist Episcopal church, who was gunned down as his wife and daughter locked themselves in an office. \"For the widow of Sen. Pinckney and his two young daughters, that would be adding insult to injury and I will not be a part of it!\" she screamed into a microphone. She said later during a break she didnt intend to speak but got frustrated with fellow Republicans. Opponents of removing the flag talked about grandparents who passed down family treasures and lamented that the flag had been \"hijacked\" or \"abducted\" by racists. Rep. Mike Pitts, who remembered playing with a Confederate ancestors cavalry sword while growing up, said for him the flag is a reminder of how dirt-poor Southern farmers fought Yankees not because they hated blacks or supported slavery, but because their land was being invaded. Those soldiers should be respected just as soldiers who fought in the Middle East or Afghanistan, he said, recalling his own military service. Pitts then turned to a lawmaker he called a dear friend, recalling how his black colleague nearly died in Vietnam. \"Im willing to move that flag at some point if it causes a twinge in the hearts of my friends,\" Pitts said. \"But Ill ask for something in return.\", House Minority Leader Todd Rutherford said Democrats were united behind the Senate bill, which sends the flag to the states Confederate Relic Room near the resting place for the rebel flag that flew over the Statehouse dome until it was taken down in 2000. Democrats didnt want any new flag going up because it \"will be the new vestige of racism,\" Rutherford said. After a break around 8 p.m. Rutherford said Democrats were willing to let the other side make their points, but had grown tired. He said while much had been said about Confederate ancestors, \"what we havent heard is talk about nine people slaughtered in a church.\", Democrats then finally began debating, saying they were angry with Republicans asking for grace for people who want to remember their Southern ancestors. Neal told of his ancestors, four brothers who were bought by slave owners with the last name Neal. \"The whole world is asking, is South Carolina really going to change, or will it hold to an ugly tradition of prejudice and discrimination and hide behind heritage as an excuse for it,\" Neal said. Other Democrats suggested any delay would let Ku Klux Klan members planning a rally July 18 a chance to dance around the Confederate flag. \"You dont have to listen to me. But there are a whole lot of people outside this chamber watching,\" Rep. Gilda Cobb-Hunter said. The debate in the South Carolina House began less than a day after the U.S. House voted to ban the display of Confederate flags at historic federal cemeteries in the Deep South. In Washington, the vote followed a brief debate on a measure funding the National Park Service, which maintains 14 national cemeteries, most of which contain graves of Civil War soldiers. The proposal by California Democrat Jared Huffman would block the Park Service from allowing private groups to decorate the graves of Southern soldiers with Confederate flags in states that commemorate Confederate Memorial Day. The cemeteries affected are the Andersonville and Vicksburg cemeteries in Georgia and Mississippi. Also Wednesday, state police said they were investigating an unspecified number of threats against South Carolina lawmakers debating the flag. Police Chief Mark Keel said lawmakers on both sides of the issue had been threatened, but he did not specify which ones. Associated Press]", "Date": "20150709", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-confederate-flag-south-carolina-20150708-story.html", "Title": "[ South Carolina House approves bill removing Confederate flag ]"}