{"Content": "[\"Democrats in the legislature, both the House and the Senate, will offer a spending plan thats consistent with our view of what the state of Illinois should do for Illinoisans who need the government to be helpful to them. We will publicly acknowledge that we dont have the money to pay for this budget.\", Michael Madigan, May 25, 2015, House Speaker Michael Madigan joined the Illinois legislature 44 years and four months ago. Senate President John Cullerton arrived 36 years and four months ago. During their nearly 81 years, the Chicago Democrats engineered, sponsored and voted for pension giveaways, chronic overspending and tax laws that broke Illinois. The consequence of these failures? Remarkably, they have not resigned to, um, spend more time with their families. Instead they behave, and talk, as if they are righteous stewards. And Gov. Bruce Rauner, the guy Madigan and Cullerton are always vilifying? He got to Springfield just four months ago. Having played no role in creating the devastated Illinois of Madigan and Cullerton, Rauner has had to trim spending to correct the diabolically unbalanced budget that Madigan and Cullerton passed last spring for the fiscal year that ends June 30. Headline writers keep using the phrase \"Rauner budget cuts\" not because it tells the story, but because its more economical than: \"Budget cuts you can blame on Mike Madigan and John Cullerton, who tried to placate angry voters before the 2014 election by appropriating gazillions of tax dollars that they knew Illinois never, ever, would collect.\", We revisit that deceit because Madigan and his trailing indicator Cullerton appear to be plotting similar mischief for the fiscal year that starts July 1. Madigan says Democrats will pass a budget thats at least $3 billion short, and will keep fighting reforms to how government operates reforms that, as campaign proposals, got Rauner elected to office. Put another way: At a time when voters demanded changes to the status quo, Madigan says there will be no change to how Illinois does business. So if passage this week of yet another unbalanced budget foreshadows even more savage cuts, dont howl at the guy whos new to Springfield. He isnt crafting the Madigan-Cullerton budget slash 2.0 any more than he crafted the Madigan-Cullerton budget slash 1.0. Howl instead at the men whove spent nearly 81 years using the legislature as their playpen. High taxes? Lousy jobs climate? Billions of dollars in unpaid bills? Spending money they know doesnt exist? Enormous taxpayer debts? Yes, its amazing what you can do in 81 years if your mission is to use other peoples tax dollars to reward your friends and keep yourself in power. The Democrats evident strategy is to hand Rauner a massively unbalanced budget, force him to make billions in unpopular spending cuts and coerce him to accept a big tax increase. Huh? We know voters arent dumb enough to be misled about budget slash 2.0 precisely because those voters werent dumb enough to be misled by budget slash 1.0. This isnt some low-information yesteryear that Madigan and Cullerton fondly recall; Illinoisans understand that they have a financial crisis and a $100 billion-plus unfunded pension liability because their politicians played this game of trying to spend nonexistent money. The surprise here is that certain appropriators who were publicly embarrassed by their roles in last years failed gambit are willing to be embarrassed again by playing roles in this years gambit. Do the appropriators do any Democrats want to vote yet again for an intentionally unbalanced budget? Their constituents are likely to react not with lengthy debates about the governors pluses and minuses, but with piercing questions such as, \"You did that again?\", Oh theres one more surprise: Madigans petulance Monday when he essentially declared, Im for the status quo in Illinois. Because its working so well. Hmm. One of the guys who got us here says hes determined to keep us here. We cant speculate whether Madigan is rattled by the $34 million in campaign cash that Rauner and his allies now control 10 times the $3.4 million that Madigan and Cullerton control. Maybe something else explains Madigans rant. That war chest does give Rauner an option Madigan and Cullerton never have faced: He can spend the summer, autumn and pre-election 2016 explaining to Illinois voters that, even though Democratic legislators wont repair the sorry reality of state government, he was elected to repair it, and he will.]", "Date": "20150526", "Author": "[Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-madigan-cullerton-rauner-budget-springfield-illinois-spending-edit--20150526-story.html", "Title": "[Illinois on the rocks: 'The Madigan-Cullerton budget slash 2.0']"}