{"Content": "[Republican presidential contender Mike Huckabee told a group of evangelical and social conservatives on Friday that the economy and security are national concerns but the country cant get back on its feet \"until it first gets on its knees and repents\" to God over its moral failings. The former Arkansas governor also used his appearance in the southwest suburbs before the Freedoms Journal Institute for the Study of Faith and Public Policy to ridicule the recent Supreme Court decision that outlawed bans on same-sex marriage, calling the judiciary the \"Extreme Court.\", Huckabee discusses the republican struggle in Tinley Park, Illinois. July 31, 2015. (WGN-TV), Huckabee discusses the republican struggle in Tinley Park, Illinois. July 31, 2015. (WGN-TV), \"I would suggest that (when) man believes that he can redefine marriage, its apparent that man believes he has become his own god and this is a dangerous place for America to be,\" said Huckabee, a Southern Baptist minister. The American people need \"a morality clarity, based on the objective truth that some things are right, some things are wrong, and without a moral foundation, our great republic cannot stand because it was based on the notion that we self-govern according to the laws of nature and the laws of natures God,\" he said. Huckabee is most immediately seeking to appeal to an Iowa Republican electorate that has become increasingly evangelical something that helped him win the states first-in-the-nation caucuses in 2008 before Arizona Sen. John McCain captured the GOP nomination. \"If people of the pro-life and pro-family element of the Republican Party all bail out, the one thing we can be sure of we will not win another election,\" Huckabee told reporters afterward. \"Because every time we nominate someone who is a strong pro-life, pro-family candidate, especially for president, we win. When we dont, we lose.\", Former Arkansas Governor and 2016 GOP presidential candidate Mike Huckabee talks to press after speaking at a conference of The Freedom Journal Institute, a pro-life Christian conservative group at Tinley Park Convention Center in Tinley Park on Friday, July 31, 2015. Former Arkansas Governor and 2016 GOP presidential candidate Mike Huckabee talks to press after speaking at a conference of The Freedom Journal Institute, a pro-life Christian conservative group at Tinley Park Convention Center in Tinley Park on Friday, July 31, 2015. Last weekend, Huckabee gained notoriety over his criticism of the multicountry Iran nuclear agreement led by the White House when he said it would \"take the Israelis and march them to the door of the oven.\", \"Ive taken a little bit of heat this past week for some comments I made not one of which I have walked back or apologized for,\" he told the audience at the Tinley Park Convention Center. \"This is like helping to put the bullet in the gun that is pointed to our head and the full enactment of this ill-fated and ill-conceived idea of a negotiation and an agreement with a fanatical, radical Islamic government is like cocking the hammer and then inviting them to squeeze the trigger,\" he said. But much of Huckabees speech was reserved for what he said was the countrys lack of a moral \"rudder.\", If Americans ignore that \"the only explanation for this great republic of ours is the intervention of Gods providence, then we will never see this nation rise to its greatness again,\" said Huckabee, who added, \"Our laws need to reflect his.\", \"Im convinced this country can get back on its feet, but it cant until it first gets on its knees and repents, and when we do that, we can be a greater nation again,\" he said. An abortion opponent, Huckabee said he supported efforts to remove federal government funding from Planned Parenthood in the aftermath of the release of controversial videos involving fetal tissue procurement. But, he said, \"the bigger question we need to be addressing is not just ending the funding for one abortion provider but its ending this national nightmare of abortion period.\", A Quinnipiac University national poll of Republican presidential contenders released a day earlier showed Huckabee in a four-way tie for fourth place with 6 percent support good enough to make the top 10 candidates to appear in the first GOP prime-time debate on Thursday. While other candidates have been working on how they will counter the GOP front-runner, real estate tycoon and reality TV star Donald Trump, Huckabee said he wont engage. \"Im not going to go into it worried about what someone is going to say about me or what Im going to try to say about another cause I dont plan to say anything about any of the others,\" he said. \"I want to win the job by playing the best game, not by breaking the legs of all the others going out.\", rap30@aol.com, Twitter @rap30]", "Date": "20150731", "Author": "[Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-mike-huckabee-ministers-tinley-park-met-0801-20150731-story.html", "Title": "[Huckabee at pro-life event: Nation needs to get 'on its knees and repent' ]"}