{"Content": "[Intolerance was seriously injured this morning in a bold attack led by five U.S. Supreme Court justices. Armed with a belief in love and a sense of human decency, the justices struck intolerance with a ruling that same-sex couples have the right to marry anywhere in the United States, ending years of political attempts to ban such marriages. Investigators say most of intolerances injuries came from this final blow in the courts decision, written by Justice Anthony Kennedy:, No union is more profound than marriage, for it embodies the highest ideals of love, fidelity, devotion, sacrifice, and family. In forming a marital union, two people become something greater than once they were. As some of the petitioners in these cases demonstrate, marriage embodies a love that may endure even past death. It would misunderstand these men and women to say they disrespect the idea of marriage. Their plea is that they do respect it, respect it so deeply that they seek to find its fulfillment for themselves. Their hope is not to be condemned to live in loneliness, excluded from one of civilizations oldest institutions. They ask for equal dignity in the eyes of the law. The Constitution grants them that right. Witnesses say intolerance was stunned by those words, then dropped helplessly to the ground after Kennedys final roundhouse: It is so ordered. Charges arent expected, as the attack was supported by a majority of Americans who say they had grown tired of intolerances poor arguments for bigotry and random acts of nastiness. Though hurt, intolerance is expected to survive. Through a spokesman Republican presidential candidate Mike Huckabee intolerance said of the Supreme Court attack:, I will not acquiesce to an imperial court any more than our Founders acquiesced to an imperial British monarch. We must resist and reject judicial tyranny, not retreat. The Supreme Court can no more repeal the laws of nature and natures God on marriage than it can the law of gravity. Antonin Scalia, one of the four Supreme Court justices not involved in the attack, said in a dissenting opinion that the five justices responsible for intolerances injury are a threat to American democracy. He then reportedly walked off to his home under a bridge mumbling something about tyranny. Love, who observers believe orchestrated the attack and hand-picked the Supreme Court justices to deliver the beating, could not be reached for comment. A close associate, happiness, said love was busy spreading across the country, celebrating. Its very excited right now, happiness said of love. It won. rhuppke@tribpub.com]", "Date": "20150626", "Author": "[Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-huppke-gay-marriage-scotus-20150626-story.html", "Title": "[Intolerance injured in attack by Supreme Court]"}