{"Content": "[The U.S. Supreme Courts new Obamacare ruling means Kathleen Duffy of Chicago can keep paying $108 per month for the health insurance that covers the treatment shes receiving for cancer in her bones and liver. Duffy, whose monthly cost would have jumped to at least $301 had the Supreme Court sided with the federal health laws challengers, expressed relief upon hearing the news. \"It means I dont have to worry about my insurance premium going up,\" said Duffy, 46. \"It means that I dont have to freak out and try to think about how Im going to try to pay for this insurance down the road.\", Among the 232,000 Illinoisans who receive federal help paying for health insurance, those fighting severe illnesses were some of the most relieved at the courts decision. The court ruled that people who live in Illinois and up to 36 other states that use the federal insurance marketplace established under the Affordable Care Act may continue to receive subsidies in the form of tax credits. Challengers in the case had argued that the subsidies should be available only in states that have set up their own marketplaces. People with cancer and other chronic conditions paid the most for health insurance before the health laws passage, if they could get it at all. The health care law requires insurers to offer insurance to everyone, no matter how sick. But by requiring nearly everyone to have insurance, and providing subsidies to help them afford it, the law helps insurers keep premiums in check, supporters say. If the court had eliminated subsidies, people with serious illnesses would have faced difficult decisions, either paying premiums that would have increased in Illinois by an average 169 percent or forgoing care. Now they can keep focusing on their treatment and on paying what they owe after insurance. \"Its still going to be a cost and Im still going to be on disability and its still difficult,\" Duffy said. \"Its not going to be any harder is really where Im at.\", Kathy Kinsella, 63, of Hinsdale, said she will be able to keep paying for blood thinners related to an immune system deficiency, will continue to receive treatment for chronic pain related to a 2005 fall and will be able to receive the necessary care if her breast cancer re-emerges. Kinsella, who pays $353 per month with the subsidy and would pay $739 without it, had been anxiously awaiting the courts second major ruling on the health law since its 2010 passage. The court ruled in 2012 that the laws requirement that everyone have insurance is constitutional. \"It has settled in that, yeah, its gonna be OK,\" Kinsella said. \"And that for me as well I think most people in my situation is such a vast relief.\", On average in Illinois, marketplace enrollees are paying premiums of $128 per month after subsidies. The average premium would have jumped to $336 had the Supreme Court sided with the challengers, eliminating subsidies, according to federal enrollment data. For some people in better health, the courts decision helps keep away anxiety about living without health insurance. Marie Odom, a 51-year-old single woman from Bellwood, said she lost health care coverage in 2005 after she quit her job as a certified nursing assistant to care for her ailing mother. Although Odom has asthma, she said she skipped doctors appointments for years because she didnt have medical insurance. \"I couldnt really afford to be sick. So most of the time, if it wasnt something major, I would just do what I could without going to the doctor,\" Odom said. \"Id stick to the home remedies, or as much as possible over-the-counter medicine, and tried to take care of myself as best as I could.\", This year she applied for coverage under the Affordable Care Act. She was pleasantly surprised by how easily she was accepted for coverage. But it also wasnt perfect: When she called for her first doctors appointment in April, the first opening she could get for a basic physical was July 20, she said. Still, shes happy that Thursdays ruling means shell be able to keep her appointment, not to mention her coverage. \"Im relieved,\" Odom said. \"Its going to be a great help to people who never thought they could afford insurance.\", The courts decision means health care providers can go back to focusing on the laws other provisions, including a shift to preventive care and rewarding providers for keeping people healthy, said Maryjane Wurth, president and CEO of the Illinois Hospital Association. \"It would be the hope that we can promote healthier communities because individuals have insurance and can access those services, rather than waiting for some kind of emergency or acute-care situation further down where they do need higher-cost services,\" Wurth said. The association has pushed for Illinois to establish its own insurance exchange, which would give the state more control over the marketplace. Thirteen states and the District of Columbia currently operate their own exchanges. The best long-term model for the state is still a matter to be discussed, Wurth said. \"I think the decision today clearly bought us some time to have those thoughtful conversations going forward,\" she said. The Rauner administration has not said publicly whether it supports a state-based exchange. Karin Zosel, executive director of Get Covered Illinois, the states enrollment arm, applauded the courts decision Thursday. \"We are pleased that the hundreds of thousands of Illinois residents who have been able to obtain health coverage through Get Covered Illinois under the Affordable Care Act will continue to receive financial help to pay for their coverage,\" Zosel said in a statement. \"Obviously we were awaiting this decision, but weve been focused on our mission day in and day out,\" she said in an interview. \"Well continue to provide Illinois consumers with enrollment assistance and education on how to use their plans.\", Individuals who earned from about $16,000 to $47,000 last year in Illinois qualified for subsidies this year. Families of four who made from about $33,000 to $95,000 also qualified. Nearly 80 percent of those who bought plans on the marketplace received a subsidy, according to federal data. Consumer-focused groups that have been signing people up for insurance for the past two years said the courts decision allows them to focus again on boosting enrollment. An estimated 280,000 Illinoisans who havent yet signed up for insurance are eligible for subsidies, according to a Kaiser Family Foundation analysis. \"Its one less obstacle in making sure were connecting people with an affordable path to coverage,\" said Barbara Otto, CEO of Health & Disability Advocates, a Chicago-based group that has focused on enrollment. Jillian Phillips, policy director at the Chicago-based Campaign for Better Health Care, said the decision eliminates what she called a political distraction. \"Im just glad that no one has to fear now losing those tax credits,\" Phillips said. \"They can focus on using their coverage and on treating illnesses or being healthy.\", This story was produced in partnership with Kaiser Health News, an editorially independent program of the Kaiser Family Foundation. wjventeicher@tribpub.com, Twitter @wesventeicher]", "Date": "20150625", "Author": "[Wes Venteicher, Vikki Ortiz Healy]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-supreme-court-obamacare-illinois-20150625-story.html", "Title": "[Court's Obamacare decision keeps subsidies flowing to 232,000 in Illinois]"}