{"Content": "[The former head of Redflex Traffic Systems Inc. already embroiled in an alleged $2 million bribery scheme that ended the companys red light camera contract in Chicago pleaded guilty Friday in a federal bribery probe in Ohio. Karen Finley, 55, of Cave Creek, Arizona, the firms former chief executive, pleaded guilty in Cincinnati to one count of conspiracy to commit bribery, according to a plea agreement signed March 31 that was unsealed Friday when she appeared in federal court. Finley admitted that she participated in a scheme in which the company made campaign contributions to elected public officials in Columbus and Cincinnati in return for keeping red-light camera contracts. No charges have been filed against the public officials, and none were named by prosecutors. The Columbus Dispatchreported that one of the officials was Columbus Council President Andrew Ginther, who has been considered a front runner in the November mayors race. One of her attorneys said in an email that Finley is \"relieved to have this step in the process behind her.\" Finley did not return a telephone call for comment. Court records unsealed Friday indicate Finley pleaded guilty under seal on March 31 as federal corruption investigators continued their probe of the bribery scheme. Her plea agreement says her sentence in the Ohio case will run concurrent with any sentence she receives in the Chicago case where records indicate she is expected to plead guilty on Aug. 11. Elected officials in Cincinnati and Columbus solicited campaign contributions from Redflex through a political consultant who acted as a go-between with Finley, who \"agreed to provide campaign contributions to these elected public officials in return for the elected public officials agreeing to take, and actually taking, officials acts on behalf\" of Redflex, according to the plea. Read ongoing Tribune reports on the citys controversial and scandal-ridden red-light camera program. Read ongoing Tribune reports on the citys controversial and scandal-ridden red-light camera program. The alleged bribes, which began in 2005, totaled $30,000, according to the plea. Redflex, once the largest operator of red light camera enforcement in the nation, came under scrutiny throughout the country following a Tribune investigation that exposed wrongdoing in the Chicago contract. As a result, the company fired Finley and other top executives and acknowledged paying up to $2 million in bribes to a politically connected former Chicago city official named John Bills. One fired Redflex executive, Aaron Rosenberg, has alleged in court filings that the behavior that led to charges in Chicago and Ohio pervaded the company in camera programs throughout the nation. Rosenberg, who has been cooperating in investigations around the country, is identified by federal prosecutors in the Ohio case only as \"Executive A.\", The Chicago scandal prompted Mayor Rahm Emanuel to fire the company and overhaul a red light camera program marred by corruption, mismanagement and failed safety claims. Chicagos red light camera program which has raked in more than $500 million in traffic fines remains the largest in the nation. Columbus turned off its 44 cameras in March, when a new state law took effect requiring a police officer to be posted at every intersection where a camera is installed.]", "Date": "20150619", "Author": "[Chicago Tribune staff]", "Link": "http://www.chicagotribune.com/news/watchdog/redlight/ct-red-light-bribe-plea-ohio-20150619-story.html", "Title": "[Ex-CEO of red light camera vendor pleads guilty to Ohio bribe scheme]"}