{"Content": "[As the Sabbath sun reached its highest point in the sky Saturday, Chicago Rabbi Seth Limmer shouldered a Torah and helped lead a crowd across a bridge that has come to symbolize Americas deepest divide. In doing so, Limmer, the spiritual leader of Chicago Sinai Congregation, reenacted a moment in the nations history that inspired him and many other clergy to become men and women of God. Over the next 45 days, more than 150 rabbis and other Jewish faithful will join the NAACP on a 860-mile pilgrimage from Selma, Ala. to Washington in pursuit of voting rights, education reform and economic equality. Each will help carry the 20-pound sacred scroll on loan from Chicago Sinai. \"I dont want to look my children in the eye and tell them I was too busy when they ask, \"Where were you?\" said Limmer, 42, who became the leader of the Reform temple in Chicagos Gold Coast neighborhood last year. \"By being there, well help others and change ourselves.\", At a time when the U.S. is grappling with hate crimes, gun violence, police misconduct and mass incarceration, the march across six Southern states ending in the nations capital is a commemoration and a call to action. While honoring the nations civil rights pioneers who marched across the Edmund Pettus Bridge in Selma a half century ago, the journey also seeks justice on behalf of the black lives lost this past year in Staten Island, N.Y.; Charleston, S.C.; Ferguson, Mo.; and Cincinnati. Limmer and other colleagues say that motivation to seek justice and repair the world drove them to the rabbinate in the first place. That imperative came from the Torah. To walk across the historic bridge Saturday with the Holy Scripture is an honor and a privilege that hell never forget, he said, but its also an act of faith. \"I do want to be changed by this,\" Limmer said. \"Our obligation as religious people is to put ourselves in places where well be transformed. I dont know that Id call it selfish. Id call it Jewish.\", Dubbed Americas Journey for Justice, the march organized by the NAACP aims to push lawmakers on criminal justice reform, voting rights, employment opportunities, fair wages and equal education opportunities. Its theme broadens the BlackLivesMatter hashtag from solely a concern about safety: \"Our Lives, Our Votes, Our Jobs, Our Schools Matter.\", A wide array of groups plan to participate, including congregations, the Sierra Club, the National Bar Association and Common Cause, a lobbying group that seeks government accountability. When Limmer heard about the march in June, an iconic image immediately came to his mind. In the photograph from 1965, at the end of the historic march from Selma to Montgomery, Ala. the Rev. Martin Luther King stands next to Rabbi Maurice Eisendrath, president of the Union for Reform Judaism, and the venerable Rabbi Abraham Joshua Heschel. Cradled in Eisendraths arms is a Torah. Limmer said that image inspired him and many other colleagues to become rabbis. As the founder of Rabbis Organizing Rabbis, a group of Jewish leaders focused on social justice with a community organizing model, he issued an invitation and offered to bring a scroll from his synagogues ark. Within 24 hours, 100 rabbis from across the country had joined the movement, he said. Since then about 50 more and some congregants have signed up for a leg of the trip. \"Thankfully there will not be just one of us at any given time,\" said Rabbi Sam Gordon, 65, spiritual leader of Congregation Sukkat Shalom in Wilmette. He will join the march Sept. 1 in Greensboro, N.C. \"(Studying Torah) is not merely an intellectual, cerebral activity. It has to be something we put into action and do. I think thats what Heschel meant when he said praying with his feet. Ive been inspired by that idea.\", Rabbi Wendi Geffen, a leader at North Shore Congregation Israel in Glencoe, said living in the Chicago area has awakened her to inequalities she had never noticed. \"My eyes truthfully have been opened to racial injustice living in Chicago where I see the walls we build in this day and age arent with laws, per se, but with ZIP codes or school systems,\" said Geffen, 40, who likens racism to a plague. She will join the march in Atlanta in August. Here at home she has purposefully sought opportunities to collaborate with African-American clergy. \"In the civil rights movement, we walked hand in hand,\" she said. \"But today when you go to an MLK-Jewish partnered event, the only truth they can claim for the partnership is 50 years ago. I couldnt stomach that.\", Indeed, the solidarity of the civil rights movement eroded over the years as African-Americans and Jews parted ways on various political issues, such as affirmative action. NAACP President Cornell William Brooks acknowledges the complicated relationship, but said the common ground that unites African-Americans and Jews transcends politics. \"Theres a language ... a shared experience, shared oppression, shared deprivation, shared dehumanization, shared diminishment of dignity that not everyone gets,\" he said. Rabbis say the deep connection between Jews and African-Americans is summed up in one word: slavery. Just as African-Americans were slaves in America, Jews were slaves in ancient Egypt. \"We were freed from Egypt not to have a dance party in the wilderness but to fight for those who are oppressed the way we were,\" Limmer said. \"Thats the Jewish takeaway from having been slaves and then freed.\", That obligation to fight oppression is made clear in the Torah, the rabbis said, so it makes sense to carry that mandate with them on the march. Were actually showing this Torah continues to teach us today, but makes us responsible to be responsive today,\" said Rabbi Shoshanah Conover, 41, associate rabbi at Temple Sholom in Chicagos Lakeview neighborhood. She will join the march a few days earlier than Gordon in Greensboro, N.C. \"These teachings and values are to be used, not kept in an ark we never get to open. How we act in this world actually shows whether this Torah is worthy and it is.\", Rain or shine, the Torah will be carried almost daily for each 20-mile stretch. To prepare for rain, Limmer purchased a tall water repellent backpack outfitted for wilderness treks and with plenty of back support. The Torah will miss only one day Sept. 14 when it stops at a Washington-area synagogue for Rosh Hashanah, the first day of the Jewish New Year. There, the sacred scroll will be unfurled and read as Jewish tradition has dictated for thousands of years. Back in Chicago, Limmer will celebrate the holiday with his congregation. Then he and his 9-year-old daughter Lily will fly to Washington to rejoin the march for its final leg. \"Nobody is walking the whole route,\" he said. \"The Torah is the only marcher going the distance. The Torah carries us spiritually. Were carrying it physically. Thats a tremendous part of the journey.\", mbrachear@tribpub.com , Twitter @TribSeeker]", "Date": "20150801", "Author": "[Manya Brachear Pashman]", "Link": "http://www.chicagotribune.com/news/ct-torah-marches-from-selma-met-20150731-story.html", "Title": "[Chicago rabbi, Torah join national civil rights march in Selma]"}