{"Content": "[Federal corruption investigators looking into a $20.5 million no-bid contract at Chicago Public Schools also have asked for any records related to an elite nonprofit education group that has long been at the center of city school reform efforts the first indication that the public relations problem could extend beyond Mayor Rahm Emanuels administration. The Chicago Public Education Fund is closely aligned with the education initiatives of both Emanuel and Gov. Bruce Rauner, who once chaired the nonprofit, as well as some of the citys most prominent power brokers and philanthropists. Although the course of the evolving investigation is still unclear, the scandal has focused on Chicago schools CEO Barbara Byrd-Bennett. She once worked for the Wilmette-based SUPES Academy company that received the no-bid contract to train school principals. On Friday, school officials released the wide-ranging federal subpoenas as they announced Byrd-Bennett would take a leave of absence while the investigation was ongoing. The training program was launched with seed money from the nonprofit education fund. The group is made up of a broad list of the Chicago areas most influential politicians and business leaders all of whom have made restructuring education a top civic priority over the past decade. Many have become key political supporters of Rauner, Emanuel or both. Indeed, Rauner himself was a board director and is currently a director emeritus. Last week, the governors hand-picked board of education named Tony Smith the states new superintendent of schools. Smith, who has spent most of his career in California, was appointed to the funds board of directors last year and served on Rauners transition team after the November election. Launched in 2000, the group was first led by then-Chicago Tribune Publisher Scott Smith. Rauner joined the board the next year and later was its chairman before becoming an emeritus member of the board, along with future U.S. Commerce Secretary Penny Pritzker, a former member of the Chicago school board; and current school board President David Vitale. Others currently on the nonprofit board include Ken Griffin, CEO of Citadel, who has financially backed both Rauner and Emanuels campaigns; Mellody Hobson of the powerful Ariel Investments; Helen Zell, wife of real estate magnate Sam Zell; Susan Crown, a principal of the Chicago firm of Henry Crown & Co.; and Beth Swanson, a former top education deputy to Emanuel. Rauner spokesman Lance Trover said the governor has not been contacted by federal authorities. The administration declined to comment further on the investigation. The subpoenas arrived at CPS as both Emanuel and Rauner have been at the forefront of controversial efforts to use private-sector expertise to reshape public education, an approach thats drawn sharp criticism from teachers unions. The federal probe also comes as the nations third-largest school district teeters on the financial precipice. CPS faces a funding shortfall equal to one-sixth of its budget, largely driven by required increases on teacher pension funding following years of failing to put in enough money to keep the funds solvent. In addition, the district is in the early stages of contract talks with the Chicago Teachers Union, and the last time the two sides had to negotiate in 2012, there was a strike. Byrd-Bennett, whom Emanuel calls \"B Three\" when they appear together at schools, stepped in to help resolve the strike as the mayors first schools chief, Jean-Claude Brizard, fell out of favor at City Hall. Now Byrd-Bennett has become a political liability for a mayor just as he needs a way out of a financial crisis without resorting to Rauners suggestion of declaring bankruptcy. And it appears unlikely she will be on hand to work out a new pact with CTU leaders who failed to stop Emanuels bid for a second term in backing challenger Jesus \"Chuy\" Garcia. CTU Vice President Jesse Sharkey last week decried what he called \"the culture of conflict of interest\" at the school system. With CPS anticipating a $1.1 billion shortfall next school year, Emanuel has pinned his hopes on a long-shot shift in Chicago school funding. Emanuel wants the financially strapped state to use income tax revenue to pick up more than $700 million in pension payments now covered out of city property taxes, just as it picks up those payments for suburban and Downstate schools. Emanuel, who was out of town on vacation when Byrd-Bennett took her leave, said Wednesday that would close most of CPS budget gap. Rauner has declared that a non-starter with the states finances in disarray. In between the strike and the subpoenas, Emanuel and Byrd-Bennett closed 49 schools and a high school program in a move the mayor said was necessary to deal with a rash of under-enrolled schools. The closures drew national attention, given Emanuels affinity for charter schools and that most of the closures were in neighborhoods on the South and West sides and hit minority families harder. Emanuel also drew criticism for what some have said was too big a focus on selective enrollment high schools to the exclusion of neighborhood schools. The situation became an embarrassment for Emanuel when he had to back off naming a planned North Side selective enrollment high school for President Barack Obama after South Side aldermen complained that a school honoring the first African-American president should be in that part of the city, where Obama got his political start. On Friday, the mayors office sought to portray Byrd-Bennetts decision to take a leave as being in the best interest of students. \"Though there have been no formal allegations, the mayor has zero tolerance for any type of misconduct from public officials and welcomes todays decision to help ensure this issue does not distract from the incredibly important work happening in our neighborhood public schools,\" mayoral spokeswoman Kelley Quinn said in a statement. Asked why Emanuels hand-picked school board did not reject the SUPES contract given that Byrd-Bennett had previously been employed there, Quinn responded in an email, \"You would have to ask the board.\", Quinn also said the administration had no involvement in negotiating the SUPES contract. She did not respond to a question about whether the mayor feels the residents of Chicago would have been better served by having a school board that approached the SUPES contract with a more skeptical eye. Ald. Patrick OConnor, 40th, Emanuels City Council floor leader, said by taking a leave, Byrd-Bennett will allow the city to concentrate on the \"huge financial problem\" at CPS and the contract negotiations with the union. \"I dont think that anybody points a finger and says that she did anything wrong. There are a whole bunch of issues that are playing out right now, and the last thing you need or want is to have somebody to point at any investigation going on right now ... and use that to hurt us,\" OConnor said. \"Her taking a leave takes her out of the cross hairs and allows us to focus more directly on the problems at hand.\", Chicago Tribunes John Chase, Bob Secter and Monique Garcia contributed. hdardick@tribpub.com, jjperez@tribpub.com]", "Date": "20150418", "Author": "[Hal Dardick, Juan Perez Jr.]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rahm-emanuel-chicago-public-schools-met-0419-20150419-story.html", "Title": "[Feds eye CPS records on education group backed by state's, city's elites ]"}