{"Content": "[Sen. Rand Paullaunched his 2016 presidential campaign Tuesday with a combative challenge both to Washington and his fellow Republicans, cataloguing a lengthy list of what ails America and pledging to \"take our country back.\", Pauls fiery message, delivered in his home state of Kentucky before he flew to four early-nominating states, was designed to broaden his appeal outside of the typical GOP coalition as well as motivate supporters of his fathers two unsuccessful bids for the Republican presidential nomination. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. In a 26-minute speech that eviscerated \"the Washington machine,\" he spared neither Republican nor Democrat as he attempted to tap into Americans deep frustrations with their government. \"I worry that the opportunity and hope are slipping away for our sons and daughters,\" the tea party favorite said. \"As I watch our once-great economy collapse under mounting spending and debt, I think, What kind of America will our grandchildren see?\", He added: \"It seems to me that both parties and the entire political system are to blame.\", By criticizing fellow Republicans, Paul showed he was ready to run a tough-talking campaign equally at ease criticizing both major parties. \"Big government and debt doubled under a Republican administration,\" Paul said in a swipe at former President George W. Bush, whose brother, Jeb, is expected to be a Paul rival for the GOP nomination. He immediately followed up: \"And its now tripling under Barack Obamas watch.\", In what well might have been a jab at Jeb Bush and other rivals considered more mainstream, he added: \"If we nominate a candidate who is simply Democrat Lite, whats the point?\", At a splashy kickoff rally, Paul promised a government restrained by the Constitution and beholden no more to special interests. \"I have a message, a message that is loud and clear and does not mince words: We have come to take our country back,\" he told cheering supporters. Paul is a fierce critic of Washington, where he is in his first term as a senator but often not in line with his partys leadership. A banner over the stage in Louisville proclaimed: \"Defeat the Washington machine. Unleash the American dream.\", Paul was clearly most passionate about upending the way Washington works. \"I propose we do something extraordinary,\" he said. \"Lets just spend what comes in.\", Cheers erupted when he decried government searches of phones and computer records as a threat to civil liberties. Most Republicans defend the practice as a necessary defense against terrorism. \"I say the phone records of law-abiding citizens are none of their damn business,\" Paul said of government officials. Tom Stewart, a 58-year-old resident of London, Kentucky, joined Pauls rally and counted himself a backer. \"I like that he wants less government,\" Stewart said. \"Less spending. Less intrusion. Maybe less intrusion into everybodys rights around the world.\", Pauls challenge now is to convince other Republican voters that his is a vision worthy of the GOP presidential nomination, a prize twice denied his father, former Rep. Ron Paul of Texas. The elder Paul joined his son at Tuesdays announcement and got a raucous cheer when he was introduced. Paul begins the 2016 race as the second fully declared candidate, behind Sen. Ted Cruz of Texas. They could face as many as 20 rivals before the lead-off Iowa caucuses in February. Paul is a frequent contrarian against his partys orthodoxy, questioning the size of the U.S. military and proposing relaxation of some drug laws that imprison offenders at a high cost to taxpayers. He also challenges the GOPs support for surveillance programs, drone policies and sanctions on Iran and Cuba. But as the presidential campaign has come closer, Paul has shifted his approach somewhat on the question of how much government the country actually needs. He recently proposed a 16 percent increase in the Pentagons budget, a switch from his earlier call for military and troop cuts. Tech savvy and youth focused, Paul is expected to be an Internet pacesetter whom his competitors will have to chase. Pauls digital advisers, for example, kept track of who asked questions in a Facebook exchange after the speech, harvesting data to reach prospective voters. Its unclear how much support Paul can muster in the Republican mainstream. In one sign of his uphill climb, an outside group not connected to any candidate planned to spend more than $1 million on ads criticizing Pauls positions on Iran sanctions. \"Somebody is worried about me,\" Paul said in an interview with Fox News. \"On my day, when Im announcing, someone is spending a million dollars.\", And Democratic National Committee Chairwoman Debbie Wasserman Schultz continued the pile-on, telling reporters, \"Rand Pauls policies are way outside the mainstream.\", Paul is leaving open the door to a second term in the Senate. With the backing of his states senior senator, Majority Leader Mitch McConnell, he is likely to seek the White House and the Senate seat at the same time. McConnell, who backs Pauls presidential bid, appeared Tuesday at a business event in Nicholasville, Kentucky. \"I think we take it one step at a time,\" McConnell said. \"Im confident if Rand is running for the Senate, hell be re-elected.\", One of Pauls likely rivals, Sen. Marco Rubio of Florida, is expected to announce next week that he will skip a Senate re-election bid in 2016 in favor of putting everything into a presidential campaign. Paul began a tour of early-voting states Tuesday night with a trip to Manchester, New Hampshire. Shaking hands and chatting briefly with supporters at Murphys Taproom, a popular spot for supporters of his father, the Kentucky Republican made no formal remarks. He was scheduled to speak at a rally in Milford on Wednesday afternoon. Associated Press]", "Date": "20150407", "Author": "[Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-rand-paul-presidential-campaign-20150407-story.html", "Title": "[Rand Paul officially joins 2016 presidential race]"}