{"Content": "[The booze was flowing freely on a recent Friday at Gibsons Bar & Steakhouse in the Gold Coast neighborhood. Some who were sitting on the sidewalk patio or inside at the bar were unmistakably tourists, sandals dangling from tanned feet, shirts generously unbuttoned to sternums. But others were clearly on the clock, dressed in suits or business casual attire yet clutching sweaty glasses of white wine, beer and martinis. It was not happy hour. It was lunchtime. Lets get this out of the way. This is not a story about a trend supported by much in the way of hard data. But some chefs and restaurateurs say theyre seeing an increase in female executives having wine over business lunches and men hoisting martinis before shuffling back to their offices. The explanations for why this is happening are both numerous and creative, including the surge of the craft beverage industry, the effect of the recently concluded television show \"Mad Men\" on office culture and the gradual thawing of expense accounts after the long winter known as the Great Recession. \"Theyre not getting after it, but theyre not holding back either,\" said Vasilios \"Sil\" Prassas, co-general manager of Gibsons and the adjacent Hugos Frog Bar, gazing at his business lunch clientele, many of whom were talking shop over drinks. Nationally, data do not suggest more people are drinking at lunch. But there are reasons that might be the case in Chicago, according to restaurant industry experts. According to a report by Technomic, a Chicago-based food industry research group, consumers referred to as \"explorers\" which generally include millennials, Generation Xers, women and Latinos are more open to the lunchtime beverage, said Donna Hood Crecca, senior director at Technomic. A Gibsons manager says the lunch crowd is not \"holding back\" when it comes to drinking. A Gibsons manager says the lunch crowd is not \"holding back\" when it comes to drinking. Big cities with restaurants serving increasingly popular craft beverages to young workers, who are more likely to view such beverages as \"food accompaniments,\" could be seeing an increase, Hood Crecca said. And those diners dont have to worry about driving back to the office either. \"In markets like Chicago, New York or L.A. you might be seeing some more lunchtime imbibing,\" Hood Crecca said, \"whereas in the suburbs, people have to drive.\", Bonnie Riggs, a restaurant industry analyst for the market research firm NPD Group, said the more noteworthy development is a 2 percent increase in lunch visits at casual dining restaurants nationally, according to data for a 12-month period ending in May, whereas alcohol sales at lunch have remained relatively flat. About 12 percent of all lunch meals at casual dining restaurants include alcohol, Riggs said. In fine dining restaurants, 42 percent of lunch meals include alcohol. At Gibsons, year to date, alcohol makes up about 30 percent of lunch sales, Prassas said, up about 3 percent from the same time last year. Lunch sales have increased by 8 percent. The increase in lunch traffic could be skewing perspective and leading some to believe more customers are drinking, Riggs said, when in reality there are just more customers drinking or not. Still, she conceded that the improving economy could lead to more \"business entertaining\" on the company dime. \"That could be happening (in Chicago),\" Riggs said. Its happening at Naha, a River North fine dining restaurant, where alcohol sales at lunch are up about 20 percent compared to the same time last year, said Chad Ellegood, the restaurants wine director. In general, lunch sales at Naha have spiked about 10 percent, he said. \"Its been across the board in all categories wine, beer, cocktails,\" Ellegood said. \"I feel like some days just about every diner is having a glass of sauvignon blanc or still rose.\", There have been no dramatic changes at Naha to warrant such an increase, he said. In fact, chef Carrie Nahabedian said they decided to remove the outdoor patio seating this year, a decision that clearly hasnt hurt business. Specific to Naha, Ellegood said the restaurants tasting menus at lunch a rarity naturally lend themselves to diners wanting to pair different beverages with the food. More generally, Ellegood said he suspected the cultural rise of tasting craft beverages, as well as millennials more relaxed approach to work-life balance, to be contributing factors. \"When I first got into the business 15 years ago, it would be three Grey Goose martinis and just shrimp cocktail,\" he said. \"This isnt that.\", Nahabedian had a different theory. She said shes seen an increase in business lunches as opposed to business dinners and she believes that has to do with employers not wanting to cut into their employees personal time at night. Increasingly, Nahabedian said shes seen more wine served at these business lunches. \"The main reason people are drinking more wine at lunch is, first off, everyones working harder than ever before. I dont care who you are,\" Nahabedian said. Lunchtime drinking varies by restaurant. At Joes Seafood, Prime Steak & Stone Crab, another River North restaurant that does a brisk business at lunch, managing partner John Aldape said the heyday of lunchtime drinking is a thing of the past. But having a glass of wine with lunch at Joes is not at all an uncommon practice. \"I think maybe there is some more acceptance to having a drink at lunch,\" Aldape said. \"I dont know how much the numbers reflect that, but it may be loosening up a bit.\", At RPM Steak, a Lettuce Entertain You restaurant like Joes, manager Kelly Clancy said its hard to say whether theres an increase in lunch drinking because the steakhouse just opened last year. Alcohol represents about 20 percent of total sales at lunch. Interviewed around lunchtime, Clancy said she just served a Titos vodka up. She noted a possible trend within a trend. \"We are seeing a good amount of female executives coming in for business lunches,\" Clancy said. \"Theres definitely a good amount of wine being served.\", At Howells & Hood, a casual dining restaurant with a huge craft beer selection located at the base of Tribune Tower, manager Phil Miley said hes seen more beer drinking at lunch among his younger customers. \"Theres definitely that millennial influence. You see young businessmen coming in wearing khakis and golf shirts, rather than slacks and ties, and theyll have a 6-ounce beer rather than iced tea,\" Miley said. Enter the voice of reason or the wet blanket. Drinking at lunch may sound fun, but its still a bad idea, said Andrew Challenger, vice president of the outplacement firm Challenger, Gray & Christmas. Even if youre comfortable with the person sitting across the table, he said, you might be spotted by someone else in the restaurant, and that could affect perceptions of professionalism and future opportunities. \"Theres a place for booze-fried brainstorming, and thats happy hour,\" Challenger said. \"When you come back to work buzzed, thats a great way to get fired.\", For restaurants, though, its all good. Business types are getting back to the practice of putting drinks on the company card, instead of separating out drinks from the rest of the tab, as was common during the recession, he said. \"People arent taking it to the extremes of the Mad Men era, where theyre struggling to get back to the office,\" Prassas said. \"Its one or two drinks, then off to work we go.\", gtrotter@tribpub.com, Twitter @GregTrotterTrib]", "Date": "20150804", "Author": "[Greg Trotter]", "Link": "http://www.chicagotribune.com/business/ct-drinking-at-lunch-0805-biz-20150804-story.html", "Title": "[Bottoms up? Lunchtime drinking making comeback, some say]"}