{"Content": "[For months, Illinois has been locked in a struggle over the future of its power market from the role nuclear energy will play on the electric grid to how customers will be billed to whether solar and wind will gain a greater foothold in the state. The players angling for an edge in the states multibillion-dollar electricity economy include Chicago-based Exelon Corp. which wants electricity users to pay about $2 more a month to help fund what the company says are several struggling nuclear plants. Exelons electric utility subsidiary, Commonwealth Edison, would like to change how residential customers are charged for electricity. At the same time, a competing coalition of labor, business and environmental groups has pushed to grow wind and solar energy, while lowering the states electricity use. The efforts come at a pivotal moment for energy policy in the U.S. on the cusp of the Environmental Protection Agencys anticipated release of a plan to set state-specific goals for curbing carbon dioxide emissions. They also reflect a belief that the states current laws for expanding so-called clean energy and reducing electricity use need to be updated and fixed, according to David Loomis, a professor of economics at Illinois State University, who specializes in utilities and renewable energy markets. \"We are really at a crossroads over how we are going to generate electricity and how that is going to fuel economic growth,\" Loomis said. Any progress this spring was expected to have included a compromise deal in Springfield that may have established a path for meeting the EPAs plan. The jockeying legislation fizzled last week, however, amid continued gridlock over an enormous budget hole and some lawmakers desire to wait until after the late-summer release of the EPAs Clean Power Plan and a power auction that is expected to benefit Exelon. Rep. Bob Rita, D-Blue Island, who had sponsored ComEds proposal, said that it would be ideal to see movement in the fall. He left the door open, however, to possibly taking up the issues next year. \"When you are dealing with energy, it is a complicated issue,\" Rita said. \"So taking a slower approach, I believe, is a good thing.\", Low Carbon Market, Exelon, the nations largest owner of nuclear power plants, has long lobbied for policies that would reward it for not emitting greenhouse gases similar to how wind and solar are reimbursed. In recent months, the company sought financial help for three of its six Illinois nuclear plants that it said are losing money, launching an aggressive billboard and TV-ad campaign to sell its plan. Key to that proposal was the creation of a new Illinois low-carbon market that would give certain low-carbon or carbon-free power facilities paper certificates known as \"credits.\" The value of the credits would be linked to the environmental benefits of the electricity produced by each plant. Public electric utilities such as ComEd would then have to buy those credits from the power facilities with money collected from their customers. ComEd delivers electricity to about 1.2 million customers in Chicago. Exelon said the market would help prop up the nuclear plants that are facing closure, preventing job losses and boosting the states ability to meet the EPAs plan for Illinois to reduce carbon emissions by 33 percent from 2012 levels by 2030. \"The state has no programs that support nuclear energy in the way they support these other zero air emission technologies,\" Exelon executive Joseph Dominguez said in an interview last month. Critics have argued, however, that the proposal would block many low-carbon or carbon-free power facilities from joining the new marketplace, including wind farms under contracts that are typically used to finance new renewable energy projects. As a result, they have predicted that most of the anticipated $300 million a year in profits from the sale of those credits would go to Exelons nuclear plants. \"We see this as a corporate bailout,\" said Cara Hendrickson, chief of the public interest division for Illinois Attorney General Lisa Madigan. \"This is a heads Exelon wins, tails Exelon wins, corporate bailout.\", In a letter to state lawmakers and Gov. Bruce Rauner in May, Exelon disputed some of the criticism, arguing that many facilities would be able to receive and sell the low-carbon credits, reducing the money the company might stand to receive. Exelon officials have said the company has to make a decision on some plant closures by September and previously threatened to begin that process if the low-carbon legislation that was introduced in February was not moved this session. In a statement released this week, Exelon acknowledged the legislation was likely to go nowhere this spring and softened its previous warnings. \"We will continue to analyze the current and expected economics of each of our plants,\" the statement said. \"We have not made any decisions regarding potential plant closures at this time.\", Renewable Energy, At the same time, a coalition backed by Mayor Rahm Emanuel has been focused on increasing funding for renewable energy like wind and solar, decreasing the amount of electricity used in the state and establishing a framework for meeting the EPAs plan that would require power plants to pay for carbon pollution. The Clean Jobs Coalition has sought to fix current state law that prevented money in one of the renewable energy funds from being used and left it vulnerable to being swept for other purposes. The group proposed a new state standard to have electricity produced from sources like wind and solar accounting for 35 percent of power flowing into residences and businesses by 2030, fostering homegrown jobs and cleaner air. The current mandate is 25 percent by 2025. The coalition also wants to reduce the states electricity use by 20 percent by 2025, which would require bold energy efficiency measures such as retrofitting large commercial and apartment buildings, adding incentives for residential customers to buy appliances and heating and power systems that use less energy, according to Rebecca Stanfield, deputy director for policy for the Natural Resources Defense Council Midwest Program. Currently the state has an annual goal of 2 percent per year that it is not meeting. \"Whether you want to lower pollution, create jobs or reduce bills, energy efficiency is the key,\" Stanfield said. \"The writing is on the wall that we cant rely on replacing light bulbs forever. We need the utilities to back more comprehensive programs.\", Some in the energy industry, however, warned that such aggressive moves could lead to higher bills for customers. Val Jensen, ComEd senior vice president of customer operations, said the Clean Jobs legislation introduced this year would have allowed for comfort and safety to be considered when spending money on energy efficiency. Jensen questioned whether that would always translate to reduced energy use and savings. \"It would force us to spend customer money on programs that we do not believe save customers on the energy they use,\" Jensen said. But the coalition contends that costs would need to be offset by savings and would have to be approved by the Illinois Commerce Commission, which oversees utilities. They estimate total savings to customers to be billions of dollars under their plan. Charging customers, ComEd also stepped into the arena this year with its own proposal to recoup more money for energy efficiency spending, launch programs for microgrids and electric vehicle charging stations and change how residential customers are billed for service. Instead of billing customers for the volume of electricity they use in a month, ComEd would like to charge based on a time frame when demand is the highest, taking advantage of new technology that allows the utility to accurately measure the electricity used by individual residences in real time. Jensen said that since the electric grid is built to accommodate the moments of highest demand, such as on a hot July day when everyone turns on their air conditioners, it is fairer to charge customers at that peak rate. \"Theres a lot of conversations going on about the utility of the future,\" Jensen said. \"We think there is a looming issue with respect to fairness and equity over who pays for this utility in the future.\", Opponents, however, have argued that billing by peak demand would allow ComEd to protect its bottom line at a time when households are becoming more energy efficient. They have said the plan also lacks crucial details and should be thoroughly evaluated by the Illinois Commerce Commission, the state agency that usually handles highly technical rate design proposals. \"We need an extensive study about what, exactly, the rate design would mean for ratepayers in Illinois before action is taken,\" Hendrickson said. Following the end of the regular legislative session, ComEd released a statement indicating the company will keep pushing for its energy legislation despite the gridlock in Springfield. \"And we look forward to negotiating a common path forward for Illinois energy future,\" the statement said. cdizikes@tribpub.com, Twitter @cdizikes]", "Date": "20150605", "Author": "[Cynthia Dizikes]", "Link": "http://www.chicagotribune.com/news/ct-energy-future-illinois-met-20150605-story.html", "Title": "[Power Play: Energy legislation stalled, state's electricity future up for grabs]"}