{"Content": "[ The nations gasoline supply likely will have more ethanol in coming years  but not as much as was required by federal law. The Obama administrations proposed renewable fuel standard wont have much of an impact on gas prices, but could become an issue in the 2016 presidential elections, especially in farm states that have profited over the years from higher corn prices linked to the use of corn-based ethanol. Campaigning in Iowa, Democratic presidential candidate Hillary Rodham Clinton has called for a robust renewable fuels standard. The proposed standards also represent a blow to renewable fuel companies that have pushed to keep high volumes of their product flowing into drivers gas tanks. The 2007 renewable fuels law tried to address global warming, reduce dependence on foreign oil and bolster the rural economy. It required a steady increase in the amount of renewable fuels like corn-based ethanol blended into gasoline over time. The new proposal would reduce the amount required by more than 4 billion gallons in 2015 and by more than 3 billion gallons the following year. The agency said the standards set by the law cannot be achieved, due partly to limitations on the amount of non-ethanol renewable fuels that can be produced. Next-generation biofuels, made from agricultural waste such as wood chips and corncobs, have not taken off as quickly as Congress required and the administration expected. There has also been less gasoline use than predicted, the Environmental Protection Agency said. Still, the targets would represent an overall increase in the use of renewable fuels over time. EPA officials said the new requirements would drive growth at an \"ambitious but responsible\" rate. \"We believe these proposed volume requirements will provide a strong incentive for continued investment and growth in biofuels,\" said EPAs Janet McCabe. The lower targets are better news for the oil industry, which has fought the existing law. Oil companies say they would prefer that the market determine how much ethanol is blended into their gas. Tom Buis of the ethanol industry group Growth Energy accused the EPA of siding with the oil companies. \"It is unfortunate that EPA chose to side with the obligated parties who have deliberately refused to live up to their obligation to provide consumers with a choice of fossil fuels or lower cost, higher performing, homegrown renewable energy at the pump,\" Buis said. In a bid to ethanol producers, the administration also announced Friday that the Agriculture Department will invest up to $100 million to help improve infrastructure for delivering ethanol to cars, such as fuel pumps capable of supplying higher blends of renewable fuel.]", "Date": "20150529", "Author": "NULL", "Link": "http://www.latimes.com/business/la-fi-hy-epa-ethanol-20150529-story.html", "Title": "[EPA proposes lowering requirements for ethanol in gas]"}