{"Content": "[ Two decades after California voters took a hard line on illegal immigration, affirmative action and bilingual education, an ascendant class of Latino lawmakers is seeking to rewrite the books and discard the polarizing laws. Flexing its growing clout in Sacramento, this generation of legislators is returning to the 1990s-era fights that propelled them into politics. On Monday, they will mark 20 years since Proposition 187  the landmark initiative withholding public services such as healthcare and education from those in the country illegally  qualified for the ballot. Sen. Ricardo Lara (D-Los Angeles), chairman of the Latino Legislative Caucus, said there is a satisfying \"full circle\" feel in revisiting these formative struggles with Latinos now empowered. But others say the legislators are falling back on yesterdays battles for use as a political cudgel  a move that could risk alienating other voters. Even two decades later, the feelings about Proposition 187 remain raw. The measure barred healthcare, education and other public services for people in the country illegally. It required doctors, teachers and others to report suspected violators of immigration laws. For Lara, whose parents were not legal residents, the proposal felt like a \"blatant, direct attack\" on his family and those like them. Republican Gov. Pete Wilson, who led the campaign for Proposition 187, bristled at descriptions of the initiative as xenophobic and racist. \"They are playing the race card and trying to intimidate people who had the spunk and the logic to protest against Washington, D.C. and Mexico City, who had been quite content to allow state taxpayers to be stuck with the cost of federally mandated services to illegal immigrants,\" Wilson said in an interview. \"Frankly, its beneath contempt.\", The measure  largely struck down as unconstitutional  was approved by 59% of voters in 1994. But its passage led to a surge of voter registration and political advocacy among Latinos. In the 20 years since, Latinos have become the largest ethnic group in the state, and their share of the electorate has doubled. So has the number of Latinos in the Legislature. \"It was 187  I cannot overemphasize  that unified the community,\" said Antonia Hernndez, former leader of the Mexican American Legal Defense and Education Fund, a civil rights group. The measure also bound Latinos to the Democratic Party. Former Los Angeles Mayor Antonio Villaraigosa said the \"mean-spirited, cynical ploy\" by Republicans to push the initiative ultimately backfired. \"That created a generation of Democrats,\" he said. Two years later, voters approved Proposition 209, which barred affirmative action for college admissions and public hiring decisions. And in 1998, Proposition 227, an initiative that effectively banned bilingual education in public schools, passed with 61% of the vote. \"It was a litany. It didnt let up,\" said Assemblywoman Lorena Gonzalez (D-San Diego), of the successive measures. \"lt just became not OK, in the eyes of far too many Californians, to even be Latino.\", Gonzalez, like Lara, was a college student when Proposition 187 was on the ballot; both attended campus rallies against it. Sen. Kevin De Len (D-Los Angeles), the incoming Senate leader, was a lead organizer of a massive downtown Los Angeles rally in the fall of 1994. \"I cut my teeth politically organizing immigrants,\" De Len said. Now De Len is pushing a bill to strip much of the language of Proposition 187 from statute. The bulk of the law was overturned by a federal court, but references to it remain in the state code. (Two provisions that survived court scrutiny dealing with false residency papers would remain law under De Lens bill.), It is time, he said, \"to erase its stain from our books.\", David Hayes-Bautista, a professor of medicine at UCLA who has written extensively about California Latinos, said that just as the state has apologized for other blemishes in its history, such as internment of Japanese Americans during World War II, so too should it acknowledge the pain felt by Latinos because of Proposition 187. \"This is one way to try to address and repair the past,\" he said. In addition, a measure by Sen. Ed Hernandez (D-West Covina) would repeal parts of Proposition 209 in order to allow race-conscious college admissions. And Lara is seeking to undo and amend portions of Proposition 227 in order to expand access to multilingual educational programs. Both bills, should they pass the Legislature, would need to be approved by voters in 2016. \"These are policies that Californians have had to live with for 20 years, and we think the voters should be given an opportunity to revisit them,\" Hernandez said. But Mike Madrid, a GOP consultant, said Latino politicians have made the decades-old fights a \"disproportionately large part of the agenda.\" He said he hopes these lawmakers will now focus more on economic and educational disparities facing the community. \"Let this end also be a beginning of something new,\" Madrid said. \"Lets not keep rehashing the same thing.\", Assemblyman Rocky Chvez (R-Oceanside), one of two Latino Republicans in the Legislature, said he would vote to strike Prop. 187 from the record. \"It shouldnt be there,\" he said. \"It was wrong.\", But he said some of his Democratic counterparts were \"caught in the political rhetoric\" of the past, in hopes of creating a \"wedge issue\" to drive Latino turnout in the November elections. Democrats continue to hold a commanding registration lead among Latinos  55% of Latino voters are Democrats, according to Political Data Inc. a voter tracking firm, while 17% are Republican  but turnout in the community can lag, particularly in years without a presidential election. But revisiting these issues is not without peril for Democrats. Hernandezs measure provoked a backlash this year among some Asian Americans who feared that their community could lose college admission slots if affirmative action was allowed. Lara acknowledges that Latino Democrats were caught \"flat-footed\" by the outcry. \"It was a very sobering moment,\" said Antonia Hernndez, now president of the philanthropic group California Community Foundation. She blamed complacency in outreach to Asians and other groups. The misstep prompted questions of overreach. Ward Connerly, a former UC regent who backed Proposition 209, said he thinks efforts to repeal portions of it will backfire. \"Our side will argue they are opening the door to discrimination,\" he said. \"And racial discrimination is abhorrent to most Californians.\", De Len said he did not expect public backlash because \"California has come a long way.\", Gonzalez acknowledged that revisiting some of these past battles gets her generation of lawmakers \"in trouble sometimes.\" But to not take up those issues now that theyre in the Capitol?, \"Oh no,\" she said. \"Weve been fighting for this for way too long.\", melanie.mason@latimes.com, patrick.mcgreevy@latimes.com, Twitter:, @melmason, @mcgreevy99]", "Date": "20140622", "Author": "[Melanie Mason, Patrick McGreevy]", "Link": "http://www.latimes.com/local/la-me-pol-legislature-latinos-20140622-story.html", "Title": "[Latino lawmakers move to reverse decades of anti-immigrant legislation]"}