{"Content": "[ One of Antonio Villaraigosas closest friends and advisors said Thursday that all signs were pointing toward the former Los Angeles mayor declaring his candidacy for U.S. Senate within the next two weeks. Former Assembly Speaker Fabian Nuez, who speaks often with the former mayor, said Villaraigosas enthusiasm for the Senate race has grown steadily in the four weeks since Democratic incumbent Barbara Boxer announced she would not seek reelection. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Villaraigosa, a Democrat, is very, very close to settling on a team to run the campaign, Nuez said in an interview. Theres still a possibility that he decides not to run, Nuez said. I doubt thats going to be the case. State Atty. Gen. Kamala Harris, also a Democrat, is the only major candidate in the contest so far. For more than three weeks, Harris has been raising money for the June 2016 primary  an arduous task, given Californias high campaign costs and the $2,700 federal limit on donations from individuals. Any top-tier candidate needs to raise several hundred thousand dollars a week, experts say. Harris also has been quick to line up supporters, including the mayors of San Francisco, Oakland and Long Beach, more than a half dozen members of the U.S. House and Senate and Los Angeles City Council President Herb Wesson, a former Villaraigosa ally. On Thursday, former state Senate leader Darrell Steinberg of Sacramento joined the Harris backers. Villaraigosa, a former state Assembly speaker, will relish the role of underdog if he gets in the race, said Jimmy Blackman, who was a top Villaraigosa aide in the Legislature and the mayors office. Campaigns get ugly, and Antonio respects Kamala Harris, but this is business, Blackman said. Willie Brown, a former Assembly speaker and San Francisco mayor who was romantically involved with Harris in the 1990s, has called on Villaraigosa to stay out of the Senate race in deference to her. Nuez and others in Villaraigosas camp have suggested Harris was the handpicked candidate of a San Francisco Democratic machine that has failed to recognize the growing potency of Latino voters, particularly in Southern California. People feel like Antonio is the answer to that, Nuez said. Twitter: @finneganLAT]", "Date": "20150205", "Author": "[Michael Finnegan]", "Link": "http://www.latimes.com/local/political/la-me-pc-villaraigosa-senate-nunez-20150205-story.html", "Title": "[All signs point to Villaraigosa Senate run, Nuez says]"}