{"Content": "[ With the economically struggling city of Detroit as his literal and symbolic backdrop, Jeb Bush on Wednesday argued that a progressive and liberal mind-set was standing in the way of recovery for the nation and particularly for Americans low on the income ladder. Bush, in a speech to the Detroit Economic Club, sketched the bare outlines of what will be his pitch if, as expected, he runs for the Republican presidential nomination in 2016. His remarks were shy on specifics, however, apart from an animated recitation of how he worked to change Floridas education system during his two terms as governor. Look around this city, he told an audience of civic leaders. In its history, there is a warning to all of us. He blamed decisions by Detroits Democratic leaders for the cratered state of a city that once was among the wealthiest in the nation. I know some in the media think conservatives dont care about the cities, but theyre wrong, he said. We believe that every American in every community has the right to pursue happiness, they have the right to rise. So I say lets go where ideas will matter the most, where the failures of liberal government policies are most obvious. Lets deliver real conservative success, and you know what will happen? Well create a whole lot of new conservatives. Bushs unofficial campaign has focused on his effort to rebrand the Republican Party, and the choice of Detroit seemed a willful effort to distance himself from the 2012 campaign by Michigan native Mitt Romney, who was savaged for his opposition to the bailout of the states automakers early in the recession. Bush did not address his own opposition to the bailout -- though he was greeted by a fusillade of criticisms by Democrats seeking to remind Detroit residents of it. But his first words served as something of a repudiation of Romneys controversial criticisms of downscale Americans who were dependent on government and who believe that they are victims. Bush flatly contradicted those words. Tens of millions of Americans no longer see a clear path to rise above their challenges. Something is holding them back -- not a lack of ambition, not a lack of hope, not because they are lazy and see themselves as victims. Something else, something is an artificial weight on their shoulders, he said. People know this country can be more than it is today, he declared. But they also know this as well: We have a lot of work to do. But like Romney, he also blamed Democrats for creating an environment of dependence on government. Instead of a safety net to cushion our occasional falls, they have built a spider web that traps people in perpetual dependence. The progressive and liberal mind-set believes that for every problem there is a Washington, D.C. solution, he said. But that instinct doesnt solve any problems. In a nearly 25-minute speech and in remarks afterward, Bush declined to specify what fiscal path he would take, other than saying he would judge matters solely on whether an action would contribute to growth. Nor did he, when asked in a question-and-answer session, provide details of his positions on other key issues. Asked what the country needed to do to solve its immigration problems, for example, he asserted that immigration represented a huge opportunity  not a problem and was central to sustaining Americas economy over time. He called for firm federal control of the border and said that President Obama should not go beyond his constitutional powers. But he spent most of his answer dealing with legal immigration, not the politically volatile subject of how to handle the millions of residents in the country illegally. Bush did not mention his own past support for a comprehensive immigration solution and for legal status for those lacking proper papers, except for a glancing reference at those brought to this country illegally as children, many of whom are now under the protection of an Obama policy that Republicans have criticized as unconstitutional. Investors, Dreamers, people that come to our great universities, all these people should be welcomed in our country, he said, and the unwritten contract ought to be: Embrace our values and you can pursue your dreams in this great country. The former governor would be the third person in his family to seek the presidency, after his father and brother, and he spoke at some length about his affection for them and his simultaneous need to run as his own man. In 1994, he noted, he ran for governor emphasizing education and lost. Four years later, he ran again, after visiting 250 Florida schools, and won. At the end of that journey, people knew that I wasnt just the brother of George W. and the son of a loving dad; I was my own person, he said. I earned it by working hard to connect with people on a level that truly mattered. That experience on a national scale has got to be part of a national strategy. He also touched on what will likely be a Democratic effort to cast him as a foreign policy hawk in the vein of his brother, who slumped in popularity after the United States extended involvement in Iraq and Afghanistan during his administration. He criticized Obama by asserting that the Islamic State terrorists had filled a void left in the Middle East by American withdrawal. We have to be engaged, and that doesnt necessarily mean boots on the ground in every occasion, Bush said. He said that Obama cast everyone who doesnt agree with him as warmongers. Thats just not the case. He was succinct when asked about an issue that has confounded some prospective GOP presidential candidates in recent days: whether parents should vaccinate their children to help prevent outbreaks such as the current spread of measles. Parents ought to make sure their children are vaccinated. Do we need to get into any detail on that? he said, to applause from the audience. People have the responsibility to make sure their children are protected, over and out. For political news and analysis, follow me on Twitter: @cathleendecker, , More on the 2016 race:, Mitt Romneys exit opens up the Republican field]", "Date": "20150204", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-jeb-bush-detroit-speech-20150204-story.html", "Title": "[Jeb Bush decries liberal approaches in Detroit speech]"}