{"Content": "[ As presidential hopefuls officially begin their campaigns, the two parties face each other with opposing coalitions clearly defined along lines of race, religion and culture. Nearly 90% of the Americans who identify or lean to the Republican party are white. In particular, white, evangelical Protestants, who make up just under one-fifth of the overall U.S. population, account for more than one-third of those who back the GOP. By contrast, the Democrats depend heavily on minorities, people without a religious affiliation and the most highly educated segment of the white population, particularly women with graduate or professional degrees. The contrasting portraits come fromextensive data about party preferences released Tuesday by the nonpartisan Pew Research Center. The data, drawn from about25,000 interviews Pew conducted last year for its surveys, provides a detailed look at where the two parties stand as the presidential campaign begins to take shape. The share of Americans who openly identify with either of the two major parties has declined over the lastdecade as more Americans call themselves independents. Most of those self-described independents, however, lean toward one party or the other, and they have voting behavior that is almost as predictable as more open partisans. The contrasting nature of the two coalitions drives the issues on which each party focuses. The Republicans heavy dependence on evangelical Protestants, for example, helps explain why the partys lawmakers have backed what supporters call \"religious freedom\" legislation in many states and also why they have had so much difficulty navigating the fast-changing politics of that issue. The Democrats reliance on minorities lies behind severalof President Obamas policies, notably his push for an overhaul of the nations immigration laws in ways that would benefit many Latino and Asian-American families. Because its candidates have done poorly with minorities in a nation that has grown steadily less white, the GOP needs to keep winning a bigger majority of white voters to prevail in presidential elections. Republican strategists have split in the past couple of years on whether the strategy of depending on white turnout remains viable in presidential contests. Overall, the Democrats enjoy a 48%-39% advantage in the share of Americans who lean their way, but that edge shrinks to 48%-43% among registered voters, the Pew figures show. The Democratic advantage has been fairly consistent going back to 1992, a period during which the party has won the popular vote in 5out of 6presidential elections. But in elections that dont involve the White House, the voters whomDemocrats count on do not turn out as reliably as Republican backers, creating a major advantage for the GOP in off-year contests. While many of the demographic divisions between the two parties have been constant for years -- Democrats consistently do better with women than with men; Republicans do better with married people than unmarried -- the Pew data show two major recent shifts, one favoring each party. Democrats have greatly improved their standing among Americans with graduate or professional degrees, particularly women. In 1992, Americans with more than a college education divided their political loyalties equally between the two parties. But since the middle of the last decade, that group has become increasingly Democratic. They now favor the Democrats by 56%-36%. Combine the gender gap with educational differences and the contrast become huge. Women with education beyond college favor Democrats by about2-1, for example. By contrast, white men without a college degree favor Republicans by 54%-33%. The other major change has been the growing Republican advantage among white evangelicals, which has expanded steadily during Obamas presidency. They now back Republicans by 68%-22%. Although the two parties also have a generational divide -- with older Americans favoring the GOP and younger ones leaning heavily toward Democrats -- that difference has more to do with religion, ethnicity and race than age itself. The so-called Silent Generation, made ofAmericans born between 1929 and 1946, is the whitest of the countrys major age groups and favors the GOP by 47%-43%. By contrast, Millennials, who range in age from18to33, comprisethe most racially and ethnically diverse generation in the voting population. They favor Democrats 51%-35%, but mostly because more than 4 in 10of them are nonwhite. White members of the Millennial generation have political preferences much like their elders; nonwhites of their age favor Democrats 61%-23%. For more on politics and policy, follow@DavidLauter on Twitter.]", "Date": "20150407", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-party-identification-20150407-story.html", "Title": "[Race and religion split electorate as campaigns begin]"}