{"Content": "[ For conservative voters looking for outsider presidential candidates without the bombast of Donald Trump, an alternative has emerged in recent weeks: Dr. Ben Carson, the pioneering neurosurgeon whose faith is central to his story. Carson spent nearly three decades as director of pediatric neurosurgery at Baltimores famed Johns Hopkins Hospital, where he was the first surgeon in the world to separate Siamese twins and would often say a silent prayer before performing each operation. But hes never run for office before. Hes never even worked on a political campaign. Yet it is precisely those qualities -- his Christian faith, his outsider status and his medical background  that intrigue Republicans yearning for something new from a crowded cast of presidential candidates. Several polls in early-voting states and nationally have Carson in second place to Trump when it comes to support from Republicans. In Iowa, which will kick off the early nominating contests in the 2016 race, Carson is polling well with an important GOP voting bloc, evangelical Christian voters. And he has financial backing from leaders of Fortune 500 companies. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, He fits the bill perfectly, he really does, said Steffen Schmidt, a longtime professor of political science at Iowa State University. Hes not in your face calling people stupid. Hes talking about his life and how its driven by his faith  thats resonating with voters. Carson doubled down on that difference Wednesday when asked by reporters ahead of a rally in Anaheim about what separates him from Trump. His faith, Carson answered. I realize where my successes come from and I dont in any way deny my faith in God, he said. It was something of a change for Carson, who has sidestepped going negative and attacking his challengers and, for the most part, is in lockstep with the GOP field when it comes to Republican ideology. In his stump speeches  where Carson can sound like a college lecturer, rather than a rabble-rousing candidate  he notes his support for downsizing the federal government, replacing the Affordable Care Act and securing the southern border as his first act of immigration reform. We have a problem with illegal immigration in this country and weve got all kinds of theories that people want to put forward.  We have a porous border and we need to seal the border, Carson said at the rally at the Anaheim Convention Center. In his remarks before several hundred supporters, Carson said there should be concerns not just about immigrants illegally entering the U.S. through the southern border but also that the porous border is an opportunity for terrorists to sneak in to the U.S. But at times he appears to wobble when it comes to addressing issues. While speaking to a civic group inside a luxury downtown San Francisco hotel Tuesday, Carson was pressed for specifics on how to reduce the federal deficit and eliminate Obamacare. He only offered vague responses about reining in the governments under-utilized office spaces and creating medical savings accounts that could be an alternative to the healthcare law. Carson, the only black candidate in the 2016 race, also once called Obamacare the worst thing that has happened in this nation since slavery, a comparison that drew criticism from more moderate Republicans and Democrats. And hes alluded to homosexuality as a choice, saying that a lot of people who go into prison go into prison straight  and when they come out, theyre gay. He later apologized. Yet for Republicans, who have struggled to dislodge themselves as a party dominated by older white men, Carsons candidacy also provides new opportunities to widen support to minorities. A postmortem of the 2012 election by national Republicans stressed the need to appeal more to minority voters, chiefly blacks and Latinos, after a cycle in which President Obama far outpaced Mitt Romney in support from minority ethnic groups. Carsons entrance into national politics came a year later at the National Prayer Breakfast in Washington, where he gained plaudits from conservatives  especially tea partyers  for castigating President Obamas healthcare law while the president sat nearby. The broadside launched him onto the paid speaking circuit, and Carson, who retired from Johns Hopkins in 2013, has delivered more than 140 paid speeches over the last two years, talking about his faith and helping others while amassing nearly $4 million off of the talks, according to his personal financial disclosure form. See the most-read stories this hour >>, It is the combination of his faith and his story that his campaign plans to capitalize on, Barry Bennett, Carsons campaign manager, said in an interview. In television and radio ads in Iowa and New Hampshire this fall, the campaign will tell of Carson growing up poor in Detroit and working toward a better life through education. And last weekend marked the 28th anniversary of when Carson separated German twins joined at the head. His campaign noted the milestone on Facebook in a post that gained more than 90,000 likes. His appeal is hes a doctor, hes caring, hes smart. He has a background not in politics, Bennett said. A recent Monmouth University poll of likely Iowa Republican caucus-goers showed Carson outpacing Trump 29% to 23% when it came to support from evangelicals. In a Des Moines Register/Bloomberg Politics poll, Christian conservatives favored Carson 23% to 16% over Trump. Can he hold onto that support will be the big question, said Schmidt, noting that earlier in the summer Wisconsin Gov. Scott Walker, the son of a Baptist preacher with deep Midwestern roots, was the favorite to court the Christian conservative vote in Iowa. Polls now show Walker failing to make significant inroads with evangelicals. By staying clear of the political battles between Trump and former Florida Gov. Jeb Bush, Bennett said his candidate will be well positioned into the fall. From Day One, hes said hes not going to run against anyone, Bennett said. Hes going to run to save the country. Hes not interested in playing those political, cheap games. Among the most ardent supporters of Carson, a Seventh-day Adventist, are some of the wealthiest chief executives of Fortune 500 businesses. Theres Barbara and David Green, the evangelical billionaire owners of Hobby Lobby. And J. Frank Harrison III, CEO of Coca-Cola, who has founded missions overseas. A majority of Carsons financial backing has come from California, where in the last fundraising quarter he raised more than $400,000. Curtis Estes, a Los Angeles resident and certified financial planner at Northwestern Mutual, gave a max contribution to Carsons campaign last quarter and is organizing a Bel-Air fundraiser Wednesday night for him. This country needs fresh thinking. It needs fresh ideas and thats what Ben Carson can supply, Estes said, noting that in next weeks Simi Valley debate he wants to see Carson show that hes qualified to lead on foreign policy and other issues. Lori Martino, a nurse from Chino Hills who was at the rally, said Carsons National Prayer Breakfast remarks caught her eye. I paid attention to him and followed him since, said Martino as she waited for Carson to take the stage in Anaheim. Hes experienced in a different way.  He has life experience. Staff writer Mark Z. Barabak in San Francisco contributed to this report. kurtis.lee@latimes.com, Follow @kurtisaleefor political news, MORE POLITICALNEWS:, Would a presidential run by Joe Biden aim to knock Hillary Clinton out or serve as a standby?, Hillary Clinton makes case for Iran deal, and a more hawkish approach in Middle East, As Congress returns, Obama wins key Senate support for Iran deal, 4:14 p.m.: This story was updated with details and comments from Carsons rally in Anaheim. This story was originally published at 12:59 p.m.]", "Date": "20150909", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/politics/la-na-ben-carson-20150909-story.html", "Title": "[Some Republicans see Ben Carson as Trump minus bluster plus faith]"}