{"Content": "[ With the 2016 election looming, Republicans in Congress want to make sure that the Internal Revenue Service wont crack down on tax-exempt \"social welfare\" groups that serve as conduits for untraceable political spending. And the commissioner of the IRS has indicated that, in any event, the agency wont adopt new regulations of these organizations in time for the rules to be applied to next years election. Without new rules, potentially hundreds of millions of dollars will be spent on election-related activities with no accountability because, unlike \"super PACs,\" these so-called social welfare groups are not required to disclose their donors. That loophole makes a mockery of the Supreme Courts assurance in its Citizens United decision that transparency about the sources of political spending \"enables the electorate to make informed decisions and give proper weight to different speakers and messages.\", When Congress approved tax-exempt status for these groups, it provided that they would be engaged \"exclusively\" in social welfare activities. An IRS publication defining such groups offers as examples associations that build housing for the poor or provide financial planning. But in administering the law, the agency has redefined \"exclusively\" to mean \"primarily,\" allowing these groups to spend huge sums on election-related activity so long as a bare majority of their spending goes for other purposes. Unfortunately, more restrictive regulations have been a casualty of the continuing controversy over the IRS treatment of tea party and other conservative groups seeking tax-exempt status. A Treasury Department inspector-general concluded that the agency subjected those groups to scrutiny based on \"inappropriate criteria.\" Although a House investigation failed to prove that the White House ordered the targeting of conservative groups, Republicans claimed that President Obamas rhetoric \"influenced how the IRS engaged with these groups.\", Despite the backlash, the IRS  appropriately  moved to develop new regulations for social welfare groups. But preliminary rules proposed a definition of \"election-related activities\" so broad that it included nonpartisan voters guides and candidate debates sponsored by nonpartisan groups. Now regulations are on hold, and Republicans in Congress have proposed legislation to impose a one-year moratorium on rule-making. That would be good news for donors who want to influence elections anonymously, but it would be a disaster for democracy. Rather than despair that nothing can be done until after the election, the IRS should move promptly to adopt new regulations that would restore Congress original intent and make it clear that election advocacy isnt a \"social welfare\" activity that can be funded by nameless donors. If Congress attempts to legislate a moratorium on new rules, Obama should reach for his veto pen. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150805", "Author": "[The Times Editorial Board]", "Link": "http://www.latimes.com/opinion/editorials/la-ed-irs-regulations-social-welfare-organizations-501c4-20150805-story.html", "Title": "[A legal -- for now -- end-run around Citizens United]"}