{"Content": "[ Sen. Marco Rubio of Florida jumped into the presidential race Monday looking as a 43-year-old first-term senator might be expected to look: a bit nervous, tripping some over his words before he gained momentum. His Miami speech was earnest, his explanation of his Cuban familys immigrant story evocative. But his reach for the presidency was something more like a call for generational overthrow of the sort that has ended in presidential victories twice in the last half century, both times by Democrats. He defined Hillary Rodham Clinton, who entered the 2016 race Sunday, as \"a leader from yesterday  promising to take us back to yesterday.\", \"But yesterday is over,\" he said pointedly, almost quoting from the Fleetwood Mac lyrics  \"yesterdays gone\"  that Bill Clinton rode to victory at age 46 in 1992. He seemed to define his political mentor, former Florida Gov. Jeb Bush, as a beneficiary of a system disdained today by many Americans. \"In many countries the highest office in the land is reserved for the rich and powerful,\" he said in a jab at the wealthy son and brother of presidents, 19 years his senior. \"But I live in an exceptional country where even the son of a bartender and a maid can have the same dreams and the same future as those who come from power and privilege.\", Rubios retelling of his familys history, its one-generation jump from his fathers job serving drinks in a banquet hall to Rubio himself running for president, was the emotional pillar of the 2012 Republican convention, at which he spoke for nominee Mitt Romney. (His story was so moving that night in Tampa that it only underscored Romneys upbringing as a child of privilege.), His familys story worked again Monday night in Miami, both for its content and its locale: Rubio announced his presidential bid at Freedom Tower, the Ellis Island of Florida, where Cuban refugees were once processed. He echoed the inaugural address by John F. Kennedy, elected at 43, who came to the brink of nuclear war in a clash over Cuba. \"Well, now the time has come for our generation to lead the way towards a new American century,\" Rubio said, as if wrestling the torch from more senior politicians. But if Rubios rhetorical abilities are not in question, his path to the presidency certainly is, a fact demonstrated by what he chose not to talk about. He gained national notice for working with Senate Democrats to forge a comprehensive rewriting of the nations immigration laws. The measure passed the Senate but when it foundered in the House, Rubio ditched his all-in measure for the piecemeal approach advocated by harder-line Republicans. His first moves irked many conservatives; his second made erstwhile allies question his commitment. On Monday, he mentioned immigration only once, without enough specificity to upset either camp. \"If we reform our tax code, reduce regulations, control spending, modernize our immigration laws and repeal and replace Obamacare, if we do these things  the American people will create millions of better-paying modern jobs,\" he said in his sole reference to the emotional issue. The absence in his speech of more than a passing reference to Cuba spoke to a broader conflict at the heart of his candidacy. Rubio is running as the representative of a new generation, but that generation has moved toward conciliation with Cuba. Rubio, on the other hand, has been a leading opponent of President Obamas outreach to the Castro regime. So he risks looking like a man advocating generational change while continuing to embrace the Cold War  which may explain why policy toward Cuba received only a glancing mention, albeit one that drew a roar of approval from the hometown audience. \"And if America once again accepts the mantle of global leadership, by abandoning this administrations dangerous concessions to Iran and its hostility to Israel; by reversing the hollowing out of our military; by giving our men and women in uniform the resources, the care and gratitude they deserve; by no longer being passive in the face of Chinese and Russian aggression; and by ending the near total disregard for the erosion of democracy and human rights around the world, especially Cuba, Venezuela and Nicaragua, if we did these things then our nation will be safer, the world more stable and our people more prosperous,\" he said. As the presidential race clarifies, the path seems clearer for some would-be candidates than others. Bush is looking to overwhelm his rivals in the large field and worm his way into the hearts of Republican voters with the overwhelming fundraising effort he has pressed in recent months. Wisconsin Gov. Scott Walker is seeking the mantle of conservative chief executive who thumped a GOP enemy, organized labor. Several candidates are vying for the evangelical vote. Rubio has neither Bushs money, Walkers executive record, or  as a practicing Catholic  the loyalty of evangelical Christians who play an outsized role in the early voting, especially in the lead-off Iowa caucuses. He is giving up a safe Senate seat  one which Democrats may be able to pick up  with the audacity of youth, on a bet that his generational freshness will resonate over the long haul. \"This election is not just about what laws we will pass,\" he said. \"It is a generational choice, about what kind of country we will be.\", For political news and analysis, follow me on Twitter@cathleendecker , For other columns on politics, go to www.latimes.com/decker.]", "Date": "20150413", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-marco-rubio-analysis-20150413-story.html", "Title": "[Marco Rubio enters 2016 race touting youth, avoiding messy issues]"}