{"Content": "[ Immigrant children who are in the country illegally would receive public healthcare coverage in California under a budget deal announced Tuesday by Gov. Jerry Brown and legislative leaders. An estimated 170,000 immigrants 18 and younger could qualify, marking another victory for advocates and lawmakers who have worked to make the state more welcoming to unauthorized residents. With this budget, were saying that immigrants matter, irrespective of who you are or where youre from, said state Senate leader Kevin de Len (D-Los Angeles). Democratic leaders also won more money for state-funded child care, preschool and dental care as well as a boost for public universities. But they gave up other spending they wanted and acceded to Browns revenue projection, which was about $3 billion lower than theirs. The compromise  the product of what Brown described as strenuous negotiations  paves the way for a new budget to take effect July 1, the start of the next fiscal year. However, some work remains unfinished; the governor called for special legislative sessions to address road repairs and public healthcare. The expansion of healthcare coverage to qualifying immigrant children would begin in May 2016, costing $40 million in the new budget and an estimated $132 million annually after that. Sen. Ricardo Lara (D-Bell Gardens), who had pushed for the change, described it as a modest investment that would prevent children from receiving their healthcare solely in emergency rooms. California once again paves the way while Washington, D.C. continues to create roadblocks for these communities, Lara said. The decision was denounced by Ira Mehlman, a spokesman for the Federation for American Immigration Reform, which supports strict enforcement of immigration laws. This is just one more example of California paying huge bills for its continued efforts to accommodate illegal immigration, Mehlman said. It forces the taxpayers to pay money to provide healthcare that could be going to other vital needs in the state, he added. And God knows there are many vital needs going unmet in the state. The final agreement was announced a day after the Legislature approved $117.5 billion in general fund spending, $2.2 billion more than Brown wanted. Continuing talks produced a final plan of $115.4 billion, only slightly larger than the Democratic governors original proposal. A series of shuffles  such as adjusting a healthcare cost estimate, adding restrictions to a scholarship program and consolidating some administrative functions  freed up enough money for lawmakers to obtain higher funding in other areas. This is a sound and well-thought-out budget, Brown said. Under the plan, the California State University system would receive a $97-million increase and the University of California system would get an extra $25 million  two investments aimed at boosting enrollment. The blueprint has an additional $265 million  more than half of what lawmakers wanted  for preschool and state-subsidized child care. And payments to dentists who serve low-income patients would be restored to pre-recession levels at a cost of $30 million. The deal also preserves other programs sought by both Brown and lawmakers, including $380 million for an earned income tax credit that would allow the working poor to keep more of their paychecks. Other legislative proposals were jettisoned. A broader increase in payments to physicians who treat the needy didnt make the cut. Neither did a plan to allow women on public assistance to receive higher benefits if they have additional children while on welfare. California currently bars such increases. Sen. Holly J. Mitchell (D-Los Angeles), who pushed for removal of the restriction, said she was livid. I guess were in the business of picking winners and losers, she said. It seems poor people and their children always end up at the bottom. Asked how the budget deal was struck, Brown described it as a gradual unfolding of deeper understanding. He didnt say whether he had threatened to veto the Legislatures budget. I dont issue threats, Brown said. I engage in frank and honest conversations. Lawmakers are expected to vote on the agreement Friday. The special legislative sessions, which could run concurrently with the regular session, will be held later this year to address remaining issues. Brown wants to use the session on healthcare to revise and extend the states tax on managed-care plans to comply with federal regulations. Without the tax, Brown said, California would lose a sustainable source of funding for public healthcare and in-home care for low-income elderly and disabled residents. The second session would be geared toward finding new ways to pay for $59 billion in overdue road repairs. Lawmakers have discussed modifying the state gas tax or charging a new fee to fund improvements. One way or the other, were going to have to find some solutions, Brown said. Republican support would be needed to raise taxes or fees. Senate Republican leader Robert Huff (R- San Dimas) criticized Democrats for considering such moves, saying that even though the state has a surplus, they are back to the tax well looking for more money. , Follow @chrismegerian on Twitter for more updates from Sacramento. 8:03 p.m.: This article was updated with more information throughout. 3:21 p.m.: This article was updated to include more details about the budget agreement. The first version of this article was published at 12:21 p.m. ]", "Date": "20150616", "Author": "[Chris Megerian, Melanie Mason]", "Link": "http://www.latimes.com/local/political/la-me-pc-california-budget-deal-jerry-brown-legislature-20150616-story.html", "Title": "[California budget deal grants health coverage to children in U.S. illegally]"}