{"Content": "[ Welcome to the Friday edition of Essential Politics, in which we take a look at the stories that go beyond the daily headlines to provide a deeper insight into the race for president. Im David Lauter, Washington Bureau chief and your Friday host. Wednesday nightsRepublican presidential debate left the partys primary campaign deeply unsettled. It also did nothing to resolve one of the fundamental, underlying issues facing the GOP: Should Republicans try to bring the nations fast-growing Latino population into their camp, as the partys official post-mortem on the 2012 election urged, or should they put all their chips on getting conservative white voters to the polls? Thats an issue in several well-known swing states, but as Kate Linthicum reports from South Carolina, the question also looms, not far off, in other states whose Latino populations are small, but growing fast. And speaking of minority voters, for all the discussion of the declining share of the electorate that is white, Linthicum also detailed the important flip side of the story: Latinos and Asian Americans are nowhere near matching the voting rate of whites and African Americans. As a result, the U.S. voting population is less representative of the countrys racial diversity than it was in the 1950s. In a related matter, for all the political talk about \"anchor babies,\" thenumber of children born in the U.S. to non-citizen mothers is actually on the decline. Politics is not just about demographics, of course. Candidates with their individual strengths and weaknesses matter. Right now, its Carly Fiorinas turn in the spotlight. Seema Mehta, who covered Fiorinas unsuccessful campaign for the Senate in 2010, teamed up with Mark Z. Barabak for aclose look at how Fiorina is trying to capitalize on the attention and the hurdles in her way. In addition to the personalities and quirks of the candidates, campaigns also are influenced by staff. Evan Halper brings us the intriguing story of a pair of sisters, Kristina and Kori Schake, who grew up in Sonoma County and have become major figures in presidential politics, one for the Democrats and the other for Republicans. They reflect on the role that their California background brings to their politics. And then there is money, which former California Assembly Speaker Jesse M. Unruh famously referred to as the \"mothers milk of politics.\" Both parties have long mined California for campaign cash. But this year, the Republican race features asurprising twist on where the money comes from. Michael Finnegan, Melanie Mason and our data team, led by Ben Welsh, explain how. As their story notes, tech industry multimillionaires have become significant sources of money for politicians on both sides of the political divide. But that doesnt mean that Silicon Valley has gone gaga for the presidential candidates. Quite the contrary, as Halper found, thepervasive sense in the valley remains that none of the candidates quite understands what they do or are in sync with the industrys values. Finally, dont forget data: Our Los Angeles Times/USC Dornsife Poll remains the essential resource for understanding how the presidential campaign is being viewed by the states voters. And no one explains the poll findings better than Cathleen Decker. What were reading, One thing we aim to do with this Friday newsletter, in addition to pulling together our own most insightful work, is to highlight a couple of pieces published elsewhere that merit special attention. Here are a pair that demonstrate two very different ways to write about a political campaign, both excellent:, Washington Post reporter David A. Farenthold took a detailed, closely reported look at the life of an also-ran, the often frustrating, sometimes humiliating search for votes when nothing quite seems to be working. He focused his attention on former Pennsylvania Sen. Rick Santorum as he seeks to hit all 99 of Iowas counties, in a so-far futile effort to recapture the magic that pushed him to victory in the Iowa caucuses in 2012. While Farentholds style is description, Ron Brownstein has perfected the art of political analysis. Heres Brownsteins close look at theGOP searching for direction as it confronts the changing demographics of the United States. Thats all for this week. On Monday, my colleagueChristina Bellantoni will be back with the daily newsletter. Until then, keep track of all the developments in the 2016 campaign with our Trail Guide, at our new politics page and on Twitter at @latimespolitics. Feel free to send comments, suggestions and news tips to politics@latimes.com.]", "Date": "20150918", "Author": "[David Lauter]", "Link": "http://www.latimes.com/local/political/la-pol-essential-politics-html-20150918-htmlstory.html", "Title": "[Politics: What comes next for presidential hopefuls]"}