{"Content": "[ Fears that the West Africa Ebola outbreak could spread more widely in America have roiled a midterm election campaign thats already taken numerous unexpected detours, putting candidates in a reactive mode at a time when they had hoped to deliver their closing pitches. What was once called a campaign about nothing has actually been anything but, with clashes in Ukraine, the rise of Islamic State militants and a flood of unaccompanied minors at the southwestern U.S. border testing campaigns ability to adapt their playbook on the fly. The transmission of the Ebola virus within the United States has piqued voter interest in a way that other issues have not, both parties say. Republicans, who have long cast doubts on the Obama administrations competence, began questioning federal preparedness for the possible spread of Ebola at an early stage. After the first reported case of Ebola in the United States by a Liberian visitor, a Senate candidate in North Carolina,Thom Tillis, became one of the first Republicans to suggest banning travel to the United States from West African nations dealing with the outbreak. Others quickly followed, often accompanied by calls for Democratic opponents to join them. At a House hearing Thursday, one lawmaker said Congress might take up the issue of a travel ban in a post-election session if the Obama administration does not institute one on its own. \"People are asking that we do that, and they are exactly correct to make that request,\" said Rep. Michael C. Burgess (R-Texas), an obstetrician who represents a district that includes Dallas northwest suburbs. Rep. Steve Scalise (R-La.), the Houses third-ranking Republican, told reporters after Thursdays hearing that a vote shouldnt be necessary. Obama \"loves bragging about the things he can do with a pen and a phone -- many of which are things that he cant do,\" said Scalise, the majority whip. \"He can approve a travel ban today, and weve called on him to do that.\", The intensity of interest in the Ebola issue drew two House members running in hotly contested Senate races, Democrat Bruce Braley of Iowa and Republican Cory Gardner of Colorado, off the campaign trail to attend Thursdays hearing of a Senate Energy and Commerce subcommittee. Both men expressed concerns about whether the administration had responded quickly enough. Hours later, Braley sought to turn the issue against Republicans during a televised debate, saying the partys zeal to cut federal spending resulted in cuts to the Centers for Disease Controls budget. \"The policies you are promoting would have made it more difficult to address this problem,\" he said to his opponent, Joni Ernst. She accused Braley and the administration of being \"reactive instead of proactive\" on the issue. \"We have seen the threat from Ebola for the past several months,\" she said. That such an external development late in a campaign could knock candidates off stride is hardly unprecedented. Some Republicans still believe Mitt Romney was on a path to victory in the 2012 presidential election until Obama traveled to New Jersey to inspect recovery efforts from Superstorm Sandy with New Jersey Gov. Chris Christie. Now Democrats are leaning on the president to demonstrate his administration has a firmer grip on the Ebola scare. Fridays appointment of Ron Klain as the administrations Ebola czar -- something even Democrats had begun to publicly call for -- was warmly greeted by party leaders, though some Republicans questioned the choice of a longtime Democratic political operative with no medical experience. The White House accused the GOP of playing politics. \"Three weeks before Election Day, Republicans are seeking to score political points?\" White House press secretary Josh Earnest said sarcastically when asked about GOP skepticism about Klain. Democrats have known for more than a year that they would be running in a difficult political environment and planned accordingly, stockpiling millions of dollars to protect the Senate majority and crafting an agenda intended to play to Democratic strengths, like boosting the minimum wage and protecting access to contraceptive care. Republicans now say Democrats attempts to stay on message as these other crises developed left them looking out of touch with the electorate. An ABC News/Washington Post poll conducted this month found that the economy was still the leading issue voters said would determine their vote for Congress. But the same survey found that nearly two-thirds of Americans were concerned about the possibility of an Ebola epidemic in the United States, and the dominance of the story on cable news threatened to crowd the debate with voting already underway in many states. \"What the American people pay attention to is usually radically different than what we pay attention to,\" said Rob Collins, executive director of the National Republican Senatorial Committee. \"The continual crises that this administration has found themselves in has been something that has been a constant theme and something that the American people are paying attention to.\", After Thursdays hearing, Scalise insisted Republicans were not politicizing the Ebola scare, praising members of both parties for their \"serious, sincere, direct questions\" at the hearing. \"This is not a political issue,\" he insisted. \"I think there were a lot of unanswered questions from members on both sides of the aisle today. And so were going to continue to ask these questions.\", Follow @mikememoli on Twitter for more news out of Washington.]", "Date": "20141017", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-ebola-politics-20141017-story.html", "Title": "[Ebola scare is the latest issue to cloud midterm election debate]"}