{"Content": "[ Elizabeth Warren has been crystal clear about her plans. The Massachusetts senator says she is not running for president in 2016, and she hopes that Hillary Rodham Clinton will. But that doesnt mean there arent thousands of liberal fans out there hoping shell change her mind. Who doesnt like a little competition among friends?, As Warren addresses Netroots Nation, a gathering of progressive activists, on Friday in Detroit, representatives from the newly launched \"Ready for Warren\" will be circulating in the crowd, looking to build their list of supporters and encourage Warren to run. (Vice President Joe Biden addressed the Netroots conferenceThursday.), Warrens staff has said she is not supporting the effort. But the group, headed by 2012 Obama campaign alumnus Erica Sagrans, started its Twitter and Facebook page several months ago. They officially launched the ready4warren.com website this week, asking supporters to sign a petition online that will help the group to begin amassing a list, which could be leased or sold to a future presidential campaign. We decided to ramp up our effort to really show Warren that if shes ready, were ready, and were standing behind her if she does decide to jump into the race,  Sagrans said in an interview from Detroit as she and the group awaited Warrens appearance Friday. Sagrans noted that the current situation for Democrats  with Clinton looming as the most formidable candidate  is similar to what we saw in 2008, where Hillary was seen as the inevitable candidate, and the inevitable Democratic nominee, but that ended up not being the case.\", \"There was an opportunity for another candidate, and we think theres a similar situation here, she said. Sagrans carefully sidestepped any criticism of Clinton or discussion of her vulnerabilities, but the groups mission statement on its website praises Warren for taking on Wall Street. \"We are progressives ready to support someone who isnt afraid to take on powerful interests like the Wall Street banks that crashed our economy, the groups website says. Warren is the backbone that the Democratic Party too often forgets it needs. Warren has inspired a movement  yet to jump into the race for president, we need to show Warren that shes got support from all across the country.\", Sagrans said the group was still determining what structure it would pursue as a political committee  and it is not yet set up to accept contributions. But Sagrans has officially stepped in as campaign manager, and Billy Wimsatt, the founder of the League of Young Voters, will serve as a senior advisor to the group. The pro-Clinton corollary, the \"Ready for Hillary\" political action committee, has already built a list of 2 million supporters, and it announced this week that it had raised $2.5 million in the second quarter. Warren has been a far more active presence on the campaign trail this year than Clinton. She was in West Virginia this week offering an assist to Democratic Senate hopeful Natalie Tennant; she campaigned in May for Sen. Jeff Merkley in Oregon. \"Ready for Warren\" volunteers plan to be a presence at her future events, encouraging her to keep an open mind. And opponents on the right have taken notice. The conservative America Rising \"super PAC,\"which specializes in opposition research, sent out a fundraising email Thursday noting that it already had full-time trackers on both Warren and Clinton. Please contribute $5 today to get the White House out of Warrens hands, the email said. Twitter: @MaeveReston]", "Date": "20140718", "Author": "[Maeve Reston]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-elizabeth-warren-campaign-ready-for-warren-gears-up-20140718-story.html", "Title": "[As Elizabeth Warren speaks in Detroit, 'Ready for Warren' gears up]"}