{"Content": "[ I admit it. I was one of those people (mostly women, I suspect) who, back when Hillary Rodham Clinton left the State Department to \"catch up on 20 years of sleep deprivation,\" figured that some of that catching up would also involve some measure of cosmetic freshening up. Though she was still being coy about whether shed make another run for White House, I figured if she did, the 2.0 version of Clinton the candidate would be not just older and wiser but also fitter and smoother  possibly by way of the nips, tucks and injections that are now essentially de rigeur for powerful women of a certain age. But flattering lighting and professional hairstyling aside, the Clinton that announced her candidacy on a YouTube video Sunday looked every bit her 67 years. Following in the venerable tradition of so many aging male politicians, Clinton is vying for the most powerful post in the free world with jowls, face creases and a less-than-Pilates-toned physique. Meanwhile, all of us who were taking bets on whether shed get a whole face-lift or simply Botox herself into generic acceptability can eat our words. While were at it, we should kiss Clintons feet. By unapologetically looking her age, shes giving all women a license to stay in the spotlight even as they mature past their younger, dewier years. And with any luck, she just might put the whole concept of a female expiration date out to pasture. Say what you will about Clinton  and as much has been said about her as any political figure in modern history  it would take some pretty twisted logic to argue that she is anything but flush with the one quality that presumably matters most: experience. Of course, experience is what also gets Clinton in trouble. She has a bit too much of it, or at least too much thats attackable by her enemies. But as things stand, after four years as secretary of State and with a record high approval rating, shes at the least highly competent; her track record goes the distance, and then some. The problem is that such competence, and the experience that creates it, can be a double-edged sword for women. Theres no substitute for it, and no shortcuts. Generally speaking, you can only really achieve it by getting older and eventually getting old. And if youre a woman  particularly in the United States  youre not really allowed to do that in public. Or maybe at least not until now. Given the relentless scrutiny Clinton endures  from her supporters as well as her opponents and about everything from her policy positions to her hairstyles and pant suits  running for president not just as a woman but as a woman of a certain age who dares to look that age seems nothing short of radical. If she succeeds, she will send the message that women can not only make it to the highest levels of U.S. public life, they actually have just as much time to get there as men. Curiously, though, even Clintons most ardent supporters may have a hard time receiving that message. Last month, in a column (an affectionate one, in my view) that likened Clinton to a suitcase coming back around on a long luggage carousel, I got a slew of angry mail, much of it from women of roughly Clintons age. But it wasnt because of the suitcase comparison. It was because I referred to her as a \"67-year-old grandmother.\", According to news reports, Clinton and her handlers plan to actively use her grandmother status to shape her image. But I was testily informed that \"grandmother\" is somehow just as demeaning as all the truly ugly epithets her haters have come up with over the years. This though her \"defenders\" surely know that male politicians are all too happy to flex their paterfamilias muscles by parading around their kids and grandkids. Thats exactly why Clintons willingness to age in front of us is both commendable and crucial. Society is unlikely to stop valuing women for their youth  thats just the biological imperative at work. But until we stop punishing women for having wisdom and experience, until we stop seeing the word \"grandmother\" as a form of negative messaging for female leaders, we will continue to drastically limit our options. And Hillary Clinton is nothing if not a reminder of just how few leaders and options  female or male, Democrat or Republican, young or old  we have to choose from. mdaum@latimescolumnists.com, Twitter: @meghan_daum, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150415", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-daum-hillary-clinton-grandmother-20150414-column.html", "Title": "[Hillary Clinton's no-knife, no-Botox run for the White House]"}