{"Content": "[ Hillary Rodham Clinton does not look as if she is having fun. No matter what message she wants to deliver, reporters insist on peppering her with questions about her email server and, if not her email, then what she thinks of Donald Trump. David Horsey / Los Angeles Times, David Horsey / Los Angeles Times, With congressional investigations droning on and the conservative media chewing on the issue like a pack of pit bulls, the brouhaha inspired by Clintons handling of her public and private email during her service as secretary of State threatens to be a nagging distraction throughout the presidential campaign. Not unlike the kerfuffle over the firing of a few White House travel office employees in the opening months of Bill Clintons first term as president  Travelgate!  the email controversy falls far short of high crimes and misdemeanors once you dig into the details, but the murk of tedious technical issues and bureaucratic rules and regulations just enables those on the right who have built themselves lucrative careers by concocting lurid conspiracy theories about the Clintons. They do not have to prove anything, they only have to raise doubts in the minds of voters who do not take the time to separate facts from aggressively partisan gasbaggery. The latest to join this game is Meghan McCain, Arizona Sen. John McCains daughter. Using her dads fame and the lovely blond hair she inherited from her mother, the young McCain has turned herself into what is vaguely described as a media personality. McCain is a more zaftig version of the many interchangeable blond hotties that Fox News impresario Roger Ailes has assembled to deliver the Republican spin on his cable channel. No surprise then that McCain appeared on Fox last Wednesday to opine that the Clinton email server problem could be our generations Watergate. McCain also offered a harsh assessment of the attire the former first lady chose to wear at her most recent news conference. \"She looks like shes in a prison jumpsuit, McCain said. Its all orange. Hillary Clinton knows something about Watergate; she was a junior member of the House Judiciary Committees legal staff that conducted the impeachment probe of President Richard Nixon. She also knows that she will forever be the target of enemies who want to ensnare her and Bill in a Watergate-level scandal. The closest these Clinton antagonists have come to success was when they uncoveredMonica Lewinskys semen-stained blue dress. That led to Bill Clintons impeachment, but also to the voters pummeling Republican congressional candidates for their overreach. The majority of voters have never bought into the scandalmongering. Like Bill, Hillary can get the best of her foes simply by winning an election, even if she cannot get rid of them. One plus for the Clinton campaign, so far, is that Bill has not created any problems for his wife. The revelation of a phone call between him and Donald Trump was the only recent event that got him into the headlines. In the call, supposedly, Bill encouraged Donald to run for the Republican presidential nomination. If that is true, he did Hillary a favor. The GOP contest has been wildly disrupted ever since Trump entered the race and shot to frontrunner status. And, although comedians and cartoonists cannot resist making suggestive jokes about Bills randy past  as I have done with todays cartoon  it is likely that the Clintonian bimbo eruptions have gone dormant. These days, the ex-president appears not to have the energy for chasing skirts, even if the interest is still there. The guy looks distinctly older and, in interviews, comes across as less sharp and quick than in 2008 when he made what was, arguably, the best speech at the Democratic National Convention. The biggest challenge Hillary may face in the 2016 campaign may not be explaining her email habits nor tolerating catty comments about her colorful wardrobe. The biggest task may be to fight off the perception that, far from being the young couple who took the country by storm in 1992, the Clintons are starting to show their age.]", "Date": "20150824", "Author": "[David Horsey]", "Link": "http://www.latimes.com/opinion/topoftheticket/la-na-tt-scandalmongers-torment-hillary-20150823-story.html", "Title": "[After 23 years, scandalmongers still torment Hillary Clinton]"}