{"Content": "[ Hillary Rodham Clinton warned Friday in her first major foreign policy speech of the 2016 presidential campaign that her potential Republican opponents would return to cowboy diplomacy and reckless warmongering, while she embraced President Obamas policy of engagement and vowed to advance normalization of ties with Cuba by ending the decades-old embargo. Though she served four years as secretary of State, Clinton has focused her campaign so far on domestic issues, primarily the economy. Her first lengthy remarks on foreign policy centered on a pivotal Obama administration decision realized only after she left the Cabinet: the reestablishment of ties with Cuba after a half-century freeze. Though it was not a decision she is closely associated with, the change in Cuba policy is one she had championed for years in the administration and now offers her a chance to embrace a policy that not only enjoys broad support among the public, but also offers a clear political contrast with Republicans. Clinton delivered the speech in Miami, home turf for Sen. Marco Rubio and just hours after sharing a stage with Floridas former governor, Jeb Bush. She acknowledged the issue of Cuba has stirred passionate debate in the city for decades, but said it was entering a new phase. Americas approach to Cuba is at a crossroads, and the upcoming presidential election will determine whether we chart a new path forward or turn back to the old ways of the past, she said. We must decide between engagement and embargo, between embracing fresh thinking and returning to Cold War deadlock. In a major shift, Obama and Cuban President Raul Castro announced in December that they would work to restore full diplomatic relations after five decades of animosity that had its roots in the Cold War. In the months since, the U.S. has removed Cuba from the list of state sponsors of terrorism, and each country opened an embassy in the others capital this month. Many Republican lawmakers, and some Democrats, opposed the change, accusing the president of naively strengthening the hand of a regime that continues to oppress its people. But Clinton said Friday that such thinking was backwards and sided with Obamas view that direct engagement and enhanced ties ultimately best serves the Cuban people. We cant go back to cowboy diplomacy and reckless warmongering, she said. We cant go back to a go-it-alone foreign policy that views American boots on the ground as a first choice, rather than a last resort. In a statement, Bush countered that it was insulting for Clinton to come to Miami and endorse a retreat in the struggle for democracy in Cuba. Secretary Clintons call to abandon the embargo  and the principles of democracy and freedom for the Cuban people  in exchange for nothing in return from the regime in Havana adds insult to the pain they and their families feel, he said. The American people deserve principled leaders who will stand up to our adversaries and stand up for our values. Secretary Clintons politically expedient embrace of President Obamas unilateral concessions to Cuba makes clear she will do neither. A Gallup survey from February found that 59% of respondents favored ending the trade embargo against Cuba while 29% opposed it. Doing so requires the support of Congress, which appears a heavy lift, particularly with Republicans in control of both chambers. But Clinton called on House Speaker John A. Boehner and Senate Majority Leader Mitch McConnell to step up and answer the pleas of the Cuban people by bringing it to a vote. Obamas openness in the 2008 campaign to engage directly with foreign leaders without preconditions was a flash pointin the debate not only with Clinton but Republican rivals. Clinton criticized Obama at the time for saying he was open to meeting with Castro after he assumed the Cuban presidency in 2008 from his brother, Fidel. Clintons opponents, in both parties, also noted that she had supported continuing the embargo as a candidate in 2000 (for Senate) and 2008 and said she her shift was one of political expediency rather than principle. But Clinton framed the change as a pragmatic one, while for her rivals, ideology trumps evidence. I understand the skepticism in this community about any policy of engagement toward Cuba. As many of you know Ive been skeptical too, Clinton acknowledged Friday. But youve been promised progress for 50 years and we cant wait any longer for a failed policy to bear fruit. Clinton said maintaining an unfriendly policy toward Cuba was a barrier to improved relations in the hemisphere, which she said would be a major strategic advantage to the U.S. as China seeks to grow its influence around the world. She accused Republicans of having an outdated view toward Latin America, which she said was now home to vibrant democracies, expanding democracies, abundant energy supplies, and that the U.S. should use what she called the power of proximity to deepen ties. Republicans have already tied Clinton to Obamas foreign policy record, particularly on Iran. But Clinton largely embraced the shift Obama made, saying that under his leadership we learned to lead in new ways for a complex and changing age, and America is safer and stronger as a result. We cannot afford to let out-of-touch, out-of-date, partisan ideas and candidates rip away all the progress weve made, she said. For more presidential campaigncoverage, follow mikememoli]", "Date": "20150731", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/la-fg-clinton-cuba-20150731-story.html", "Title": "[Clinton warns of 'cowboy diplomacy' if Republicans retake White House]"}