{"Content": "[ The Republican presidential field has a CEO, a doctor, three senators and one senator-doctor. On Tuesday, when Donald Trump announced that he planned to join the bunch, it got its first reality TV star. In remarks from Trump Tower in New York, the wealthy real estate developer said, the U.S. has become a dumping ground for everybody elses problems. Politicians are all talk, no action nothing is going to get done,\" Trump said in an hourlong statement. Our country is in serious trouble we dont have victories anymore. Democrats leapt at the chance to use Trump as an excuse to tweak the other GOP candidates. His entry \"adds some much-needed seriousness that has previously been lacking from the GOP field, and we look forward to hearing more about his ideas for the nation,\"the Democratic National Committee said in a statement. Campaigns for the 2016 presidential election are underway and more than a dozen Republicans and Democrats are vying for the nomination of their respective parties. They include senators, former governors and even a reality TV star. And even more candidates expected to enter the wide-open race this summer. Staff writer Kurtis Lee explains.   , Campaigns for the 2016 presidential election are underway and more than a dozen Republicans and Democrats are vying for the nomination of their respective parties. They include senators, former governors and even a reality TV star. And even more candidates expected to enter the wide-open race this summer. Staff writer Kurtis Lee explains.   , Even before Trump jumped into the race, the logic of reality TV has had an effect on all the GOP campaigns. The cast of candidates vying to be president includes some who have joined the race for the same reasons aging sitcom stars put on their dancing shoes and learn to tango. They know they have little chance of winning, but even losing could be good for their careers. The rise of long-shot, nontraditional candidates is a growing trend, particularly in the recent open Republican contests. None will publicly admit it, but as was true four years ago, several candidates appear to be using the presidential race more as a springboard to television or radio punditry or the speaking circuit than as a contest to actually win office. Some need to expand their donor base. Others may walk away with a book deal. All thats required is a healthy ego and a few donors. \"You have a category of people who exist in that fuzzy space where celebrity and politics meet in our culture. Youve seen, increasingly, a number of those candidates running, said Steve Schmidt, a GOP strategist. The trend gives some traditionalists pause and some party operatives heartburn as they try to manage a freewheeling and growing field. The partys front-runners former Gov. Jeb Bush of Florida, Wisconsin Gov. Scott Walker or Sen. Marco Rubio of Florida, for example  dont fall into this new group. Some of the second tier Carly Fiorina or Sen. Lindsey Graham of South Carolina are viewed as angling for positions in the next GOP administration. And compared with the 2012 field which included the pizza tycoon Herman Cain and the firebrand conservative Rep. Michele Bachmann 2016 looks almost staid. But its the sheer number of candidates this year that has created problems for Republican officials. Four years ago, the largest candidate debates had eight participants. This year, the party has struggled to find a way to limit the cast to 10 with the knowledge that some, like Trump, who come with high name recognition, could push aside lesser-known but more substantive hopefuls like Graham. As Mitt Romney did four years ago, this years strait-laced candidates will have to learn to run alongside less predictable counterparts. In his statement Tuesday, for example, Trump said he would build a wall on the countrys border with Mexico. \"And I would have Mexico pay for it,\" he shouted. He also took a strong shot at Bush, who announced his candidacy Monday. Trump jabbed him for his support of Common Core, the national education standards, and for backing immigration reform two issues that already have hurt Bushs standing with conservatives in the party. How the hell can anyone vote for this guy? Trump said. The Republican National Committee emphasizes the upside to the candidate surge. The field is full of quality candidates, spokeswoman Allison Moore said. We have a neurosurgeon, major CEOs, accomplished governors and senators all are highly talented people and capable of defeating Hillary Clinton, Moore said. Whats more, several of the candidates have agreed to share the data they collect from voters for use during the general election. The more candidates out there making contact, the better for the eventual nominee, party strategists say. The reason Republicans seem to have attracted more nontraditional candidates than Democrats may be a function of timing. The rise of social media and digital fundraising has coincided with three consecutive open races for the GOP nomination. More people are running now, frankly, because social media allows you to launch a campaign without the funds in the bank or the organization on the ground, said Lee Edwards, an expert on the conservative movement at the Heritage Foundation, who bemoaned the rise of candidates who seem more concerned about their bank accounts than ideology or party politics. Some of these candidates are banking on exposure through things like the debate. But also, just because they are candidates, this will, frankly, advance their own careers. We know that if so-and-so is a presidential candidate he can charge a higher fee for speaking, for an article or for a book contract. The power of conservative media may also play a role. Conservative radio and Fox News have welcomed some media-savvy also-rans with open arms and big paychecks. The model here is former Arkansas Gov. Mike Huckabee, whose failed bid in 2008 made him a household name, at least in Republican parts of the country, and landed him a show on Fox News. (Huckabees show ended in January, when he announced he was exploring another run for president.), Trump fits into a different category, noted Schmidt, one perhaps only he occupies. Politics has always had its showmen, and Donald Trump is a showman, he said, but hes one who taps into a very real sentiment even if he is accused of making a mockery of the process. There are substantial parts of the American population who think its already a joke  that its fundamentally not on the level, said Schmidt, who in the 2012 campaign referred to that seasons GOP candidate debates as \"the best reality show on TV.\", A candidate like that has a potential to tap into that in a pretty powerful way. No doubt about it. Staff writer Kurtis Lee contributed to this report. For more on politics, follow @KHennessey. 9:13 a.m. This story was updated with additional quotes from Trumps announcement. 8:37 a.m. This story was updated with quotes from Trumps announcement, and from the Democratic National Committee.]", "Date": "20150616", "Author": "[Kathleen Hennessey]", "Link": "http://www.latimes.com/nation/la-na-gop-trump-20150615-story.html", "Title": "[Donald Trump enters race, and GOP wonders: Presidency or reality TV?]"}