{"Content": "[ In case you missed it, heres what former Florida Gov. Jeb Bush had to say last week when asked about people who come to America illegally to make better lives:, \"Yes, they broke the law, but its not a felony. Its an act of love. Its an act of commitment to your family. I honestly think that that is a different kind of crime  that there should be a price paid, but it shouldnt rile people up that people are actually coming to this country to provide for their families.\", And heres what another possible GOP presidential contender had to say about the subject. \"Theres no doubt that immigrants come to this country because they are seeking a better world,\" said Sen. Ted Cruz (R-Texas). \"What isnt positive and beneficial is breaking the law to do so.... Rule of law matters.\", You might think from those two statements that Bush and Cruz are far apart on immigration reform, but theyre not. They both support offering illegal immigrants a way to apply for legal residency in the United States. They both oppose giving those immigrants a clear path to citizenship, at least for now. Where they differ  dramatically  is on how they want that immigration policy to sound. Bush wants the discussion to be about practicality, economic opportunity and compassion. Cruz prefers to focus on border security and defending the rule of law. Their parsing of words is important. Bushs tune appeals to moderates and the Republican business establishment, which wants easier immigration rules for engineers and other professionals. Cruzs tune appeals to law-and-order conservatives  and, of course, to nativists, even if Cruz, a Canadian-born Cuban American, isnt among them. But both views make it clear that at least some Republicans with an eye to high office are less worried about offending the most conservative members of their party than they are about alienating Latino voters. As Republican National Committee Chairman Reince Priebus noted in his postmortem on the 2012 presidential campaign, a candidate who expresses compassion for immigrants stands a better chance of winning votes from Americas biggest ethnic minority than a candidate who dismisses the idea as softheaded. Every GOP politician knows the numbers: George W. Bush won 44% of Latino votes in 2004; Mitt Romney, who advocated \"self-deportation,\" won 27% in 2012. Still, the Republican path forward isnt obvious. The GOP-led House of Representatives has been stymied on the issue, unable to present a conservative alternative to the \"path to citizenship\" that passed the Democratic-run Senate last year. House Speaker John A. Boehner (R-Ohio) says he wants to pass a bill that includes that path to legalization (but not citizenship) that both Bush and Cruz endorse. But when Boehner unveiled his proposals in January, his right-wing members erupted in rebellion, arguing that any vote on immigration reform would needlessly divide their caucus and alienate conservative voters. The House GOP is so allergic to any measure that looks like amnesty that, last week, it shelved one of the mildest of all legalization proposals: a bill that would have offered a path to citizenship for migrants who entered the country as children if they serve in the U.S. armed forces. The right thing to tell illegal immigrants who want to enlist in the U.S. Army, Rep. Steve King (R-Iowa) said, is: \"We have a bus for you to Tijuana.\", The inability to agree on immigration reform might not hurt the GOP in the short run, but unless Republicans act, it will come back to bite the party in 2016. In this years congressional election, Republicans hope to win a majority in the Senate mostly by turning out conservative voters riled up about Obamacare. A messy fight over immigration reform might get in the way of that message, or so some in the GOP ranks have argued. But in the presidential election of 2016, every Republican this side of Steve King knows that if the GOP sounds like the anti-immigrant party, its candidate is likely to lose again. \"Its really hard to get people to listen to you on economic growth, on tax rates, on healthcare, if they think you want to deport their grandmother,\" said Sen. Marco Rubio (R-Fla.), another potential presidential candidate. Its a classic dilemma that pits short-term pain against long-term gain. Unless House Republicans pass some kind of immigration bill, 2016 is going to be a tough year for any GOP presidential candidate. But if they act too soon, some of the conservatives they need to turn out for this years midterm elections might stay home. So, naturally, some Republicans are urging Boehner to wait until next year. But theres no guarantee that next year will be much easier. \"They cant move until they find a consensus on this issue in the House,\" a GOP strategist told me. \"That consensus doesnt exist.\", For members of Congress in safe seats, thats not a job-threatening problem. But those considering a run for president  including Rubio, Bush and Cruz  have to be hoping that consensus comes together long before 2016. doyle.mcmanus@latimes.com, Twitter: @DoyleMcManus]", "Date": "20140408", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-mcmanus-column-jeb-bush-20140409-column.html", "Title": "[ The GOP's 2016 handicap -- immigration ]"}