{"Content": "[ For the last week, the campaign for the Republican presidential nomination has looked like this:, Texas Sen. Ted Cruz has gone to the Senate floor to accuse his partys Senate leader of telling \"a flat-out lie.\" Former Arkansas Gov. Mike Huckabee has accused President Obama of trying to march Israelis \"to the door of the oven\" by agreeing to a nuclear deal with Iran. Sen. Rand Paul of Kentucky has circulated a video showing him taking a chain saw to a stack of tax-code books. And South Carolina Sen. Lindsey Graham destroyed his cellphone with a baseball bat, also on video. And then theres Donald Trump. If a seeming midsummer madness has taken hold of the campaign, theres a method to it: Next week brings the first debate of the Republican primary season, and only the top 10 candidates, chosen by poll rankings, get to take part. The candidates on the bubble have responded with a frenzied effort to attract attention  stunts, accusations and in some cases hundreds of thousands of dollars in advertising. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Although the efforts may make sense for each candidate, they have created a group picture that may hurt the Republican Partys efforts to portray its candidates as sober, serious potential presidents. Democrats certainly think so, and they have been quick to seize an opening. Obama denounced Huckabees remark from Ethiopias capital, Addis Ababa, on Monday, saying that it reflected a culture of \"outrageous attacks\" tolerated by the GOP. The comparison of the Iran deal to the Holocaust was \"part of a general pattern that would be considered ridiculous if it werent so sad,\" Obama said. \"Weve had a sitting senator call John Kerry Pontius Pilate. Weve had a sitting senator who also happens to be running for president suggest that Im the leading state sponsor of terrorism,\" Obama said, referring to Sens. Tom Cotton of Arkansas and Cruz, respectively. \"These are leaders in the Republican Party.\", Candidates always compete for attention, but in this case, a sprawling field of 16 presidential hopefuls, Trumps ability to consume much of the oxygen in the race and the imminence of a poll-driven debate have combined to whip that competition to a frenzy. For the second-tier candidates who are struggling to raise money, the Aug. 6 debate, which is being hosted by Fox News, provides the tantalizing chance of a breakthrough in front of a large television audience of the most-engaged Republican voters. Former House Speaker Newt Gingrich fondly recalls how his debate performances propelled his candidacy in 2012 at a time when his campaign was running on fumes and vastly outspent. \"They were very critical in reaching average voters and reaching people when we had almost no money,\" he said. \"The coverage of the national-media debates, themselves, and the news coverage from the debates sustained us when we were not sustained otherwise.\", The easiest way to raise name identification and potentially gain traction in the polls to qualify for that opportunity is television advertising  much of it on Fox. New Jersey Gov. Chris Christie and his backers, for example, are spending more than $1 million from late July into early August, $250,000 by his campaign committee and the rest by a \"super PAC\" backing his candidacy. Christie appears confident that he will qualify for the debate. At a town hall in Ankeny, Iowa, on Saturday, when a voter questioned Christies record on gun control, he replied, \"If you want to debate me, run for president, get in the top 10 and come to Fox in Cleveland on Aug. 6, and Id be happy to debate you.\", Under the rules set by Fox, participation in the debate will be determined by aggregating the five most recent national polls released as of Aug. 4. Although pollsters generally wont comment publicly on when theyre conducting surveys, theres a widespread expectation that several national polling groups will conduct polls starting this week to hit that deadline. Given the margin of error of any survey and the way the bottom few candidates have been bunched together in most recent polls, the final few positions in the debate could well be allocated in large part by chance. Foxs rules say that in the event of a tie, it may add an extra chair or two, but it hasnt specified what would constitute a tie. Christie, former Texas Gov. Rick Perry, former Pennsylvania Sen. Rick Santorum, former Hewlett-Packard Chief Executive Carly Fiorina and John Kasich, the two-term Republican governor of Ohio  where the debate will be held  are all among the candidates likely to be competing for the last few slots. Christie is not the only one spending heavily on ads. A super PAC backing Perry is spending $1 million on cable television, conservative talk radio and online ad buys. Perry has also received widespread news coverage for denunciations of Trump, whom he declared to be \"a cancer on conservatism\" that needed to be \"clearly diagnosed, excised and discarded.\" In recent weeks, every time Perry criticized Trump, mentions of him on television, in news articles and on social media spiked, according to an analysis by Zignal Labs, which tracks broadcast, online and social media. Several candidates are turning to cable television interviews to try to raise their profile. Its difficult to turn on Fox News without spotting a presidential hopeful. Santorum, the runner-up for the 2012 nomination, spent a recent day doing five television stints, including an hourlong in-studio appearance on Foxs \"Outnumbered\" and a late-night stop on Rachel Maddows left-leaning show on MSNBC. Candidates who are less likely to make the cut have emphasized that other forums will air, including one on Fox hours before the debate. \"If I was in control of the universe, I would like to be on that stage. I hope very much I will be,\" Fiorina told reporters, referring to the debate, after speaking to Rotarians at a Des Moines country club. \"But I cant control that.\", Many Republican officials also would like to see Fiorina on the debate stage. Shes the sole woman in the race and among the sharpest critics of Democratic front-runner Hillary Rodham Clinton. But Fiorina, perhaps sensing that shes a long shot to make the cut, downplayed its importance. \"Realistically, were still in the silly season in this presidential election,\" she said. \"The boys are going to fight, and Im just going to keep on talking about the issues, the problems and the solutions.\", For all the agonizing, the debates importance can easily be overstated. Mitt Romney didnt take part in the first debate in the 2012 cycle, yet went on to be the GOP nominee. Next weeks debate is taking place six months before the first voting, while many voters are enjoying the final weeks of summer and paying little attention to the 2016 campaign. \"I know in the chattering class, this is the most important event in the history of mankind, and it will be until the next day, when the next debate will be the most important event,\" said John Weaver, a senior strategist to Kasich. \"We would love to be in it. If were not in it, were not in it. I dont think its going to have any impact on us ultimately winning the nomination.\", Still, the first question a voter posed to Kasich at a town hall in Des Moines on Friday was about how his supporters could help him earn a spot in the debate. Kasich shrugged. \"I dont know what you can do,\" he said. Times staff writer Christi Parsons in Addis Ababa, Ethiopia, contributed to this report. ALSO:, Obama on four more years: If I ran, I could win, Carly Fiorina jabs Obama, Clinton in speech at Reagan Presidential Library, Facing unfavorable ratings, Clinton shares personal details to be more relatable]", "Date": "20150728", "Author": "[Seema Mehta]", "Link": "http://www.latimes.com/nation/la-na-gop-attention-20150728-story.html", "Title": "[What's behind the frenzy of stunts, accusations among GOP candidates? The Aug. 6 debate]"}