{"Content": "[ Weighing President Obamas request for billions of dollars in new funding to combat the Ebola virus, lawmakers on Wednesday pressed federal agencies to explain how the additional money would help in the fight against the disease. Members of the Senate Appropriations Committee debated Obamas request for $6.18 billion in additional funds to battle the virus, which has infected more than 13,000 people, mostly in West Africa but also in a handful of cases in the United States and Europe. Ebola, in my mind, meets the criteria for emergency spending, said committee Chairwoman Barbara A. Mikulski (D-Md.). Its sudden. Its urgent. Its unforeseen. And its temporary. But the request faced skeptical lawmakers who questioned whether additional money would be well spent by a federal government that has struggled at times with containing the epidemic. Instead of an effective response, what weve witnessed from various agencies is confusing and at times contradictory plans, Sen. Richard C. Shelby (R-Ala.) said. Senators challenged officials over their sometimes disorganized initial response to the Ebola outbreak in the United States, including an evolving federal policy on quarantine and treatment. Shelby questioned how often officials speak with Ron Klain, the Ebola \";czar named by Obama to coordinate the federal response. Ive been in touch every day with Mr. Klain, said Sylvia Mathews Burwell, secretary of the Department of Health and Human Services. She said Klains efforts had helped shape policy across the government during the outbreak. The presidents funding request would be broken into two parts, with $4.64 billion going toward immediate relief efforts in Africa and to better prepare U.S. hospitals. The remaining $1.54 billion would be retained for funding needs in the future. More than $3 billion would go to the Department of Health and Human Services to support interventions in West Africa and to ensure each U.S. state has a designated Ebola treatment center and protective equipment. Another $2 billion would go to the State Department and USAID to support efforts in Africa, with $112 million in additional funds going to support military-led response efforts in the region. Agency leaders testified that the additional funding would enable a final campaign to eradicate the virus in Africa and fund hundreds of treatment centers in the three affected countries. Stopping the disease at its source in West Africa - that, in turn, will protect the homeland, Burwellsaid. She highlighted additional cases discovered this week in Mali as evidence that the outbreak remains virulent. Funding would also go toward ongoing public health efforts worldwide and investments in vaccines and medical research, and for training of domestic healthcare workers in infection control, officials said. Officials emphasized that despite public fear over the disease, future cases of the virus can be contained within the United States through monitoring of suspected patients, including returning healthcare workers. \";We certainly understand peoples concerns. Ebola is scary; its deadly.... But Ebola spreads from direct contact with someone who is sick with Ebola, said Dr. Thomas Frieden, director of the Centers for Disease Control and Prevention. He said the 21-day monitoring regime currently in place had been effective in tracking healthcare workers returning from West Africa and would continue. Frieden defended his agency over lawmakers criticisms that officials allowed a nurse who treated the nations first Ebola patient to travel on a commercial airline. They noted that the military had instituted a mandatory quarantine for troops returning from Africa while the CDC had not done the same for its workers. The guidance we provided was based on decades of experience in Africa. When it did not work here, we changed that guidance, he said. We will change our guidance based on experience and what the science and data show us. The Senate hearing came as panic over the disease in the United States has begun to wane, with the countrys last known patient being declared free of the disease. Dr. Craig Spencer, a Doctors Without Borders volunteer who treated Ebola patients in Guinea, officially recovered from the virus in New York on Tuesday. Only one patient, Thomas Eric Duncan, a Liberian who traveled to Dallas, has so far died of the disease in the United States. The CDC expanded its efforts after Duncans death, making improvements to the safety gear healthcare workers wear while treating patients and establishing a quick-response team to assist at hospitals dealing with Ebola cases. Engineers with the Defense Department also opened a field hospital in Liberias capital Monrovia on Monday, staffed by more than 60 public health workers. The hospital is part of the existing $30-million effort to upgrade the West African nations degraded healthcare infrastructure and slow the spread of the disease. More than 2,000 military personnel are currently active in the country, according to the department.]", "Date": "20141112", "Author": "NULL", "Link": "http://www.latimes.com/nation/la-na-senate-ebola-hearing-20141112-story.html", "Title": "[Lawmakers question Obama's $6-billion request for Ebola funding]"}