{"Content": "[ With President Obamas healthcare law once again facing possible unraveling at the hands of the Supreme Court, the administration and its allies have developed a novel argument tailor-made to appeal to conservative justices: states rights. The high court is set to hear arguments March 4 to determine the legality of Affordable Care Act subsidies for approximately 7 million Americans who receive coverage from federally run health insurance marketplaces, also known as exchanges. Lawyers for the Competitive Enterprise Institute, a small libertarian group in Washington, are challenging the subsidies, pointing to a passage in the law that says such tax credits may go to those who buy insurance on an \"Exchange established by the state.\", Only 13 states fully operate their own online healthcare marketplaces. The other 37 rely on the HealthCare.gov site run by the federal government. If the justices rule for the challengers, consumers in most or all of those states would lose their subsidies, making health coverage unaffordable for most of them. The Obama administration and healthcare advocates are arguing that the law, when read as a whole, makes clear that the subsidies were intended to be available nationwide for low- and moderate-income people, not just those in certain states. But if the justices doubt that reading, supporters of the law have a legal backup plan that highlights the \"clear notice\" rule for states. It says that when Congress passes a new law and seeks cooperation from the states, it must not withhold important information. The principle was spelled out in a 1981 opinion by then-Justice William H. Rehnquist, the same year John G. Roberts Jr. served as one of his law clerks. Liberals hope it will persuade Roberts, now chief justice, and some of his colleagues to uphold the tax subsidies in the 37 states that rely on the federal exchange. This focus on the federal-state balance of power appears targeted at Roberts, whose vote was crucial in upholding the laws constitutionality in 2012, and Justice Anthony M. Kennedy, a longtime champion of the states who has cited the \"clear notice\" principle in the past. Supporters of the law say that even if Congress meant to restrict subsidies to marketplaces created by the state, no one warned state officials that relying on the federal version would deprive their residents of millions of dollars in insurance subsidies. Late last month, lawyers for 22 states, including Virginia, Illinois, Pennsylvania and North Carolina, told the justices they were blindsided by the claim that federal subsidies might be cut off because they failed to establish state marketplaces. \"Surprising states with a dramatic hidden consequence\" violates a basic principle of fair dealing between Washington and the states, the state lawyers said in the court brief. Congress \"does not hide elephants in mouse holes,\" they added, quoting a comment by Justice Antonin Scalia in a previous case. Oklahoma and five other states sided with opponents of the law. Their lawyers said the \"plain text\" bars subsidies for their residents, since they did not establish state marketplaces. California, New York, Connecticut and Maryland, which are among the 13 states that fully operate their own marketplaces, have endorsed the broad view that tax subsidies should be available nationwide. Of the 37 states using the federal healthcare site, a few have either technically established their own marketplaces or have partnership agreements with the federal government. The justices could choose to treat those states differently than the rest, allowing their residents to keep subsidies. But supporters of the healthcare law say they are more hopeful now of prevailing entirely in the high court, in part because of the \"clear notice\" argument. Washington lawyer Walter Dellinger, a solicitor general under President Clinton, said this federalism or states rights argument is likely to get the attention of several justices. \"If you are Congress, you dont impose a penalty on the states and then hide it in an obscure provision involving the tax code that no one noticed at the time,\" he said. This strongly suggests, he said, that Congress did not intend to punish states that decided to rely on a federal marketplace. Other provisions of the law carry the same message, supporters say. A section titled \"State flexibility\" says that states shall establish an exchange so residents can compare prices for insurance and buy policies, and that if states elect not to do so, \"the secretary [of Health and Human Services] shall establish and operate such exchange\" within the state. Citing this passage, officials from the 22 states said they understood this to mean they could run an exchange on their own, or use the federal version, but the choice would have no effect on their residents. Attorneys for the Obama administration argue that the term \"such exchange\" means that the federally run exchange would simply function in place of one created by the state, with no differences in operation. Defenders of the law recognize they face a struggle in winning over the courts conservatives, who have been skeptical of Obamas signature healthcare program. Four justices  Scalia, Kennedy, Clarence Thomas and Samuel A. Alito Jr.  voted to strike down the entire law in 2012. If Roberts joins them this time, they could deal it a severe blow. In 2012, a majority led by Roberts rendered a split decision. They upheld the mandate to buy insurance, but they also said states may refuse to expand free health insurance under the Medicaid program. In a second decision last year, they ruled by a 5-4 vote that corporate employers citing their religious faith may refuse to pay to cover certain contraceptives for their female employees. The latest case began with what some called a \"glitch\" or \"wording flaw\" in the long and complicated bill. Jonathan Adler, a libertarian law professor at Case Western Reserve University who helped launch the suit, argued the law should be interpreted based on its exact words, not the grand aims of its Democratic sponsors. \"The proper question is: What did Congress say? And the words established by the state are pretty clear,\" he said. \"People didnt focus on this in 2010 or 2011 because no one took seriously that so many states would say no.\", Ilya Shapiro, a lawyer at the libertarian CATO Institute, says the blame lies with the Democrats who wrote the law. \"This is a consequence of the frenzy to get something passed on a razor-thin partisan vote,\" he said. \"No one knew what was in it. Maybe the states lawyers missed it, or they were misled by the feds.\", Administration officials were surprised when about three dozen states  both red and blue  chose not to establish marketplaces of their own. They were also alarmed when the Supreme Court voted Nov. 7 to take up the current case, King vs. Burwell, just three days after Republicans won full control of Congress. Challengers won a round last summer when a U.S. appeals court panel in Washington, in a 2-1 vote, interpreted the law as limiting subsidies to the 13 states that fully run their own marketplaces. On the same day, an appellate court in Virginia reached the opposition conclusion, ruling that nationwide subsidies were allowed. In recent weeks, a new round of legal briefs from the administration, state officials, former members of Congress and leading law professors have argued that there was no glitch and that the law, read as a whole, provides insurance subsidies to eligible Americans regardless of where they live. \"They put the text of the statute front and center, and it shows the absurdity of the plaintiffs argument,\" said Elizabeth Wydra, attorney for the Constitutional Accountability Center, a liberal group that supports the law. \"When [the justices] read the briefs, I think it would be hard for them to rule against the government, even though they may not like the law.\", For instance, the laws supporters say, one provision permits subsidies for any applicable taxpayer whose income is less than 400% of the poverty rate, without making reference to whether the marketplace was established by the state or federal government. Another provision defines a \"qualified individual\" as someone who \"resides in the state that established the exchange.\", The provisions show that the federally run exchange was intended to serve as the de facto state exchange, U.S. Solicitor Gen. Donald Verrilli Jr. said in a court brief. Otherwise, if the second provision were read in isolation, it would imply that a federal exchange \"would literally have no customers\" since no potential applicants would live in a \"state that established the exchange.\", Why, he asked, would states have been told by Congress that they had the flexibility to rely on the federal exchange, only to learn later none of their residents could actually use it?, david.savage@latimes.com, Twitter:@DavidGSavage]", "Date": "20150226", "Author": "[David G. Savage]", "Link": "http://www.latimes.com/business/healthcare/la-na-court-health-argument-20150226-story.html", "Title": "[Obamacare defense is tailored for key Supreme Court justices]"}