{"Content": "[ Fueled by derision for politics as usual, Donald Trump has vaulted to the top of the Republican race for president among California voters, a new USC Dornsife/Los Angeles Times poll has found. Trump won the support of 24% of California Republicans surveyed, while Ben Carson, a retired neurosurgeon and lesser-known conservative favorite, was backed by 18%. More than a dozen other candidates, most of them elected politicians, resided in the single digits, far behind the leaders. The anti-establishment flavor of the Republican race contrasted with the predictability of the Democratic primary, in which longtime national front-runner Hillary Rodham Clinton held an expansive lead in California over Vermont Sen. Bernie Sanders and others. Get more national political newsand the latest from Campaign 2016 >>, California voters are reflecting national trends: Trump and Carson lead the GOP field; Clinton leads strongly among Democrats. California voters are reflecting national trends: Trump and Carson lead the GOP field; Clinton leads strongly among Democrats. The potential entrance of Vice President Joe Biden, who is considering a 2016 bid, did little to diminish Clintons dominance, the poll found. In California, as elsewhere, the path forward for Biden remains difficult barring an utter collapse of Clintons candidacy, the results suggested. Trumps support rested on his blunt and often excoriating approach to the race  an approach that has confounded political insiders  and particularly on his tough talk about illegal immigration, a subject that has ricocheted through California politics for more than two decades and helped weaken the state Republican Party. The poll indicated Trumps supporters were highly motivated by the issue. \"This is the first time I have heard a presidential candidate speak about something that is really important and has gotten out of control,\" said Mario DiPasquale. \"That is, illegal aliens, and nobody is doing anything about it.\", The 57-year-old Hawthorne Republican and Trump supporter said hed had to \"reinvent\" himself professionally twice as earlier jobs became dominated by Latinos. He blamed Latinos for taking jobs and for engaging in crime. \"I grew up with blacks; Im cool with them,\" he said. \"What Im not OK with is everywhere you go its brown people, everywhere you go.\", With nearly nine months to go before Californias presidential primary closes out the nominating season, both contests remain fluid, with the GOP race particularly open to change. Among Republicans, 1 in 5 voters polled in the state was undecided about which candidate to back, and many candidates were unknown to a quarter or more of voters interviewed. Among those planning to cast ballots in the Democratic primary, about 1 in 6 was undecided. Trumps lead over Carson was within the margin of error for the polls sample of Republicans  5.3 points in either direction. Among Democrats, who have many more voters eligible to participate in the primary, the margin was 3.6 points in either direction. The poll questioned 1,500 registered voters by telephone from Aug. 29 through Sept. 8. It was conducted by the Democratic firm Greenberg Quinlan Rosner Researchand the Republican firm American Viewpoint on behalf of the USC Dornsife College of Letters, Arts and Sciences and the Los Angeles Times. California Republicans have opted for the safe and predictable candidate in most presidential elections, so their embrace of Trump  even if it proves temporary  is notable. Yet if Jeb Bush, the former Florida governor and an archetype of a candidate successful in California, is hoping that blue-state Republicans can rescue his campaign, the poll offers little comfort. He was in a tie for a distant third place with Texas Sen. Ted Cruz, each getting 6% support. Bushs father and brother won a total of four presidential primaries here  and George H.W. Bush was the last Republican to win the state in a general election, in 1988. Bush, Cruz and the other conventional politicians in the GOP race are all falling to the strong outsider tide: 47% of voters in the poll sided with three candidates who have not held elective office: Trump, Carson and Carly Fiorina, the former Hewlett-Packard chief executive who lost a Senate race in California in 2010. Leaving aside the one-fifth of respondents who were undecided, well over half of those who had a favorite candidate chose a person who had never served in office. Candidates competing against Trump have hoped that the New York real estate tycoon will find himself eclipsed as the gargantuan field of 16 GOP candidates inevitably narrows. For now, the poll indicated, that is wishful thinking. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, When California Republicans were asked how they would vote if they were choosing among Trump, Carson, Bush and Florida Sen. Marco Rubio  the four candidates who led nationally when the poll was conducted  Trump strengthened his standing, with 27% of the vote. Carson added 7 percentage points for a near-tie with Trump at 25%. Rubio and Bush eked their way into double digits, at 13% and 11% respectively. In individual head-to-head competitions, Trump clocked Bush, 47% to 32%. But outsider Carson defeated Trump, 43% to 32%. \"Right now we are all clearly watching the Donald Trump show,\" said Dave Kanevsky of American Viewpoint, the Republican polling firm. But, he noted, even popular shows can find themselves canceled. \"Trump has a high floor,\" Kanevsky said. \"But he could potentially have a low ceiling against a non-Jeb Bush candidate.\", Indeed, 35% of Republican voters polled said they would never consider voting for Trump  three times the percentage that felt that way about Carson. That would normally prove daunting, but in this years factionalized race, Trump was only fifth-highest on the list of GOP candidates shunned by their own party members in California. Kentucky Sen. Rand Paul, who has hoped that his opposition to government spying and advocacy of changes in the criminal justice system would attract young and minority voters, was dismissed by half of Republicans surveyed. Also highly unpopular were New Jersey Gov. Chris Christie, former Arkansas Gov. Mike Huckabee and Bush, all of whom had alienated more than a third of GOP respondents. Lesser-known, and thus less polarizing, were Rubio and Ohio Gov. John Kasich. The voters early verdict was perhaps most humbling for Fiorina. Just four years after she spent tens of millions to impress them, fewer than half of California Republicans surveyed would consider voting for her, and 23% said they would never consider it. As they do nationally, Trumps California supporters represent something of a caucus of the aggrieved. They are younger and more male  he received support from 30% of male Republicans but just 18% of GOP women. His largest level of support came from men who did not attend college, 32% of whom sided with him. Generally speaking, they are among those hit the hardest by the shaky economy and opposed to immigrants in the country illegally. But Trumps current support is not limited to those voters: He won among whites, minority voters (a small and conservative slice of the GOP in California), men, nonconservatives, the young, older voters, college graduates, the married and the unmarried. Carson and Trump divided the partys conservatives and women, and the retired doctor was narrowly behind in other categories. Some voters interested in Carsons campaign described him as Trump without the bluster  an outsider lacking Trumps downsides if also his fiery appeal. Supporters of Trump and Carson had a far bleaker notion of California than other Republicans; only 5% of Trump backers and 8% of Carson voters said the state was headed in the right direction. Among supporters of other candidates, 18% said the state was going in the right direction. See the most-read stories this hour >>, Roland Lizott, a Navy veteran who works in real estate management, said Trump was \"talking a good game. ... Hes saying things a lot of people want to say.\", \"Is he going to become president? I dont believe so  we already have enough nuts running the country,\" Lizott said, laughing. He, too, said he was attracted to Trumps stance on immigration, which includes deportation of immigrants here illegally and the construction of a southern border wall. \"They just need to start enforcing the laws in this state. Any time you say anything about immigration youre a bigot, and thats not the case,\" he said. \"Theres a lot of people out here stressed about their jobs.\", Lizott, a resident of Roseville, northeast of Sacramento, said he was looking at a few candidates but liked Carson. \"Think about it: Hes a brain surgeon,\" he said. \"Hes got to think of all the possibilities before he does something. Hes not going to go off half-cocked.\", If the Republican race presented a blizzard of possibilities, the Democratic presidential contest oozed clarity. Clinton, who with husband and former President Bill Clinton has cultivated California politically for more than two decades, led her nearest active competitor, Sanders, a political independent, 42% to 26%. Other Democrats were in the low single digits  if they registered at all. Clintons victory in the 2008 presidential primary was driven by turnout among women and Latinos, and the poll indicated those groups remained bulwarks of support. She beat Sanders by 24 points among women and 37 points among Latinos. Asian voters in the survey sided with her 41% to 20%, and pluralities of liberals, moderates and conservatives also were in Clintons camp. Sanders strength in polls elsewhere has been driven by whites and liberals, and those were his strongest backers in California as well. He earned 38% of liberals to 44% for Clinton and 33% of white voters to 36% for Clinton. He came closest to toppling her among independent voters who indicated they would vote in the Democratic primary: 29% sided with Clinton and 28% with Sanders. (Democratic Party members went for Clinton 46% to 26%.), \"She has a very solid coalition of moderate-type Democrats and nonwhites that someone like Sanders or anyone from the left flank would have to overcome,\" said Drew Lieberman of Greenberg Quinlan Rosner, the Democratic polling firm. \"I dont see a sign that theres enough of a protest vote out there to beat her in a head-to-head battle.\", Even when Biden was added to the candidate mix, Clinton remained relatively strong at 39%, compared with 23% for Sanders and 11% for Biden. Biden pulled votes equally from the two top candidates. The vice president was in the low double digits in almost every demographic category except for independent voters, where he won 14%, mostly at Sanders expense. Some of Clintons voters have hurried to batten down the hatches, an approach common to tumultuous campaigns waged by both Clintons. Debra Sexton, a Democrat from Corona, supported Clinton in 2008 and believes she was a good secretary of State. She dismissed the furor over Clintons use of a private server for government email as \"stupid political fodder.\", \"The more they complain about her, the more that Im going to support her,\" said Sexton, a retired photography printer. \"In all honesty, I dont see them treating the other candidates the way they do her.\" She attributed that to Clintons gender and name. But even Sexton expressed some worry about Clintons early, and rocky, efforts in the 2016 campaign. \"I wish she would relax a little more,\" Sexton said. cathleen.decker@latimes.com, Twitter: @cathleendecker. For more on politics, go to latimes.com/decker and latimes.com/politics]", "Date": "20150913", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/local/politics/la-pol-prez-poll-president-20150913-story.html", "Title": "[California Republicans echo U.S. trends, favoring outsiders Donald Trump and Ben Carson]"}