{"Content": "[ If theres a by-the-book way to run for president, Martin OMalley seems to have followed it to the letter. The liberal Democrat and former Maryland governor has been a frequent visitor to Iowa and New Hampshire, which will cast the first votes of the 2016 campaign. Hes a polished performer on the political chat-show circuit. Hes issued a sheaf of painstakingly detailed policy briefs, winning applause from the partys left-leaning interest groups. And yet for all of that, OMalley is mired at a near-subterranean level in opinion polls, with support in the 1% to 3% range that, for all intents, amounts to little more than a rounding error. Worse, the scant bit of attention paid to any Democratic presidential hopeful not named HillaryRodhamClinton has been devoted to Bernie Sanders, Vermonts rumpled senator and a conduit for the restiveness pulsing among a legion of progressive activists. OMalley insists its not the least bit concerning. It would be if I hadnt been to this rodeo before, he said Thursday during a two-day fund-raising swing through California. Ive seen candidates of substance and experience commit themselves to the long-haul marathon and campaign the way you have to campaign to succeed in the Iowa caucuses. He was referring to Gary Hart, the Democrat who played the role of handsome-face-of-a-new-generation back in 1984, laboring for months as an asterisk in polls until he placed an unexpectedly strong second in Iowa. That catapulted him into a fierce national race against the overwhelming establishment front-runner, Walter F. Mondale. OMalley, 52, was a young foot soldier in Harts Iowa campaign. So having seen that before, its a little easier for me to have the faith to walk across these months, a conspicuously jet-lagged OMalley said as he gripped a paper cup from Starbucks. His strategy goes back once more to the familiar campaign playbook, specifically the pages labeled long-shot/underdog. OMalley is focused on winning Iowa and New Hampshire voters one by one, at diners and small dinners, in living rooms and church basements. He assails Democratic leaders for allegedly stacking the nominating process in Clintons favor, throwing out words like coronation that play to resentment over the front-runners perceived sense of entitlement. He insists, with increasing asperity, that the half-dozen debates sanctioned by the national party arent enough, joining Sanders in demanding more. He accuses Clinton cordially, for the most partof stinting on policy and ducking controversial issues, like the Trans-Pacific Partnership free-trade deal and construction of the Keystone XL pipeline.OMalley opposes both. In fact, the former governor has issued a veritable blizzard of white papers: on immigrationhe would extend citizenship to millions of undocumented immigrants in political and administrative limbo; financial reformhe would cap the size of the nations biggest banks; criminal justicehe would phase out the for-profit prison industry; and the environmenthe calls for a 100% clean-energy economy by 2055. The difference from other Democrats, OMalley says repeatedly, is his unmatched executive experience as Baltimore mayor, from December 1999 to January 2007, followed by eight years as Maryland governor. Not only do I make progressive promises, but Im the only candidate in our field whos actually accomplished progressive things, progressive results, he told reporters after participating in a high-minded panel discussion on tech and civic engagement. As governor, he showed a wonky passion for statistics-driven policyusing number-crunching formulas to fight crime, tame Marylands bureaucracy and clean up Chesapeake Bay and compiled a record of unswerving liberal activism: raising taxes on the states wealthiest residents, banishing the death penalty, toughening gun laws, raising the minimum wage and approving same-sex marriage. OMalleys eager to discuss all of that and more on a debate stage, face to face with Clinton, at the first party-sanctioned forumOct. 13in Las Vegas. Lets hope they dont put it in an undisclosed hangar in Area 51, he said, dryly. Follow@markzbarabak for national and California politics]", "Date": "20150821", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/la-na-omalley-2016-20150821-story.html", "Title": "[Far down in polls, Martin O'Malley says, 'What, me worry?']"}