{"Content": "[ Midway through a three-nation trip intended to polish his foreign policy credentials, Jeb Bush said Thursday that his meetings with leaders in Germany and Poland have only confirmed his view of challenges facing the United States. It hasnt changed my thinking about the role of America in the world, that we cant be all things to all people, we cant be the worlds policeman, said Bush, who plans to kick off his White House campaign Monday in Florida. But we can be clear and consistent and engaged, both politically and diplomatically and in terms of military, we need to be engaged,\" he added. \"So I guess my views have been validated more in that regard. Bush has kept a low profile so far, meeting with political, business and civil leaders, but avoiding any controversy. He has said he is in a listening mode, and doesnt plan to lay out his own foreign policy plans here in Polands capital or at his next stop in Estonia. He met Thursday with Polish President Bronislaw Komorowski and President-elect Andrzej Duda and other political leaders. He and his wife Columba also laid flowers at the Warsaw Uprising Museum, at a cross where Pope John Paul II conducted Mass in 1979, and at the Tomb of the Unknown Soldier. Bush seemed to suggest he would endorse a more muscular foreign policy, saying the perception of American retreat from the global stage in recent years had emboldened Russian President Vladimir Putin to commit aggression in Ukraine. When theres doubt, when theres uncertainty, when we pull back, it creates less chance of a more peaceful world, Bush told reporters. Youre seeing the impact of that in Ukraine right now. Russian military forces have been accused of backing pro-Moscow separatists in eastern Ukraine, and Putins policies are inciting worries in much of Europe and Washington. Bush again refused to take a position on whether the North Atlantic Treaty Organization should permanently station troops at bases in Poland and the Baltic nations. The alliance has rejected those proposals in the past. But he said the U.S. military should increase its presence in the region. \"I think we need to be more robust,\" he said. Bushs visit has been overshadowed in part by headlines about staff turmoil and other problems in his campaign-in-waiting, and controversy over a 1995 book Bush coauthored that called for a return to public shaming to discourage behavior he considered immoral or improper. \"There was a time when neighbors and communities would frown on out-of-wedlock births and when public condemnation was enough of a stimulus for one to be careful, Bush wrote in \"Profiles in Character.\", Infamous shotgun weddings and Nathaniel Hawthornes Scarlet Letter are reminders that public condemnation of irresponsible sexual behavior has strong historical roots.\", Bush said Thursday that some of his views on shaming have changed since 1995. My views have evolved over time, but my views about the importance of dads being involved in the lives of their children hasnt changed at all, he said. For more political news, follow @LATSeema.]", "Date": "20150611", "Author": "[Seema Mehta]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-jeb-bush-poland-20150611-story.html", "Title": "[Jeb Bush says his trip to Europe has confirmed his view of the world]"}