{"Content": "[ Congress is again careening toward a crisis, this one fueled by opposition to President Obamas immigration plan, which threatens to cut off funding for the Homeland Security Department. The Senate is set to take a crucial vote Tuesday, but rather than resolve the standoff, the outcome is likely to accelerate it. And there is no easy compromise in sight. The problem flares from Republican opposition to Obamas immigration plan, announced last fall, to temporarily defer deportations for up to 5 million immigrants in the U.S. illegally, if they are law-abiding and meet other criteria. Obama said he was forced to act because Congress failed to produce its own immigration overhaul. But Republicans view his actions as an overreach of executive authority. Hoping to stop the president, House Republicans agreed to approve a $39.7-billion funding bill for the Homeland Security Department but only on the condition that none of it be used for Obamas new immigration proposals. The bill went a step further, effectively defunding Obamas 2012 Deferred Action for Childhood Arrivals program. DACA has allowed more than 500,000 young immigrants, so-called Dreamers brought to the country illegally as children, to temporarily remain here for work, school and military service. But the Senate is expected to reject this approach. Even though Republicans have a Senate majority with 54 seats, they are short of the 60 votes needed to overcome a Democratic filibuster. Senate Democrats reject the GOPs attempts to stop the immigration reforms, and all of them backed a letter calling on Senate Majority Leader Mitch McConnell (R-Ky.) to instead pass a Homeland Security Departmentfunding bill that does not block Obamas actions. Opposition may come not just from Democrats; Republicans in the Senate also bristle at the House approach. GOP concerns were amplified after a recent report showed that stopping the presidents immigration policies would actually add $7.5 billion to the deficit over the next decade, according to a joint report by the nonpartisan Congressional Budget Office and Joint Committee on Taxation. That would come largely because of lost tax revenue generated by employed immigrants who would be, in theory, deported. Adding pressure to the stalemate, the Homeland Security Department is poised to run out of money by the end of the month. \"We should pass a Homeland Security bill with no strings attached to it,\" said Sen. Harry Reid (D-Nev.), the minority leader. \"Thats where were going to wind up.\", In times like these, a stopgap measure often emerges to temporarily provide funds while negotiations continue. But even that fallback strategy has problems this time. Simply continuing Homeland Security funding at current levels would leave the department without the $280-million boost both parties have already agreed to, an amount that rises to $1 billion when bipartisan disaster funds are included. Among the lost funds if Congress agrees only to a stopgap measure: a Coast Guard cutter being built in Mississippi; a biological defense center in Kansas to fight hoof-and-mouth disease and other agricultural dangers; and $50 million for the Secret Service to improve security and help protect the emerging 2016 presidential candidates, according to a Senate aide who was not authorized to speak publicly. Republican leaders have yet to come up with an alternative proposal that could win Democratic support. Several Republicans have suggested that shutting down the Homeland Security Department wouldnt pose a problem because some 85% of its employees are deemed essential and must show up to work. That is correct, the Senate aide said, but the employees would be required to work without pay. In the meantime, applications will start being accepted Feb. 18 for the start of Obamas new program for immigrants - an expansion of DACA to provide deportation relief and work permits for those who came to the U.S. illegally before they were 16. Because Obamas program is largely funded by fees the immigrants will pay as they apply, it will not be halted by the stalemate in Congress. For the latest from Congress follow @LisaMascaro]", "Date": "20150202", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-na-homeland-security-20150202-story.html", "Title": "[Congress headed toward showdown over Homeland Security funding]"}