{"Content": "[ Before jetting off to Hawaii for his annual holiday break, President Obama stood before reporters to pat himself on the back on Friday. Hes proud of his accomplishments this year, he said. Hes shown America solves problems. \"And now Im going to go on vacation. Mele Kalikimaka, everybody,\" he said, wishing all a Merry Christmas in Hawaiian. \"Mahalo.\", It was a remarkable drop-the-mic moment coming from man who only a couple months ago was slogging through the doldrums of his underwhelming second term. Bouncing from seemingly unsolvable conflicts in Syria and Iraq, to a crushing defeat of Democrats in the midterm election, the president appeared ready to totter off into lame duck status. Apparently not. Within a few short weeks and through a few big executive maneuvers, Obama ended the year by reminding Washington that his demise is far from imminent. He began last month with a climate deal with China and a bold immigration order, then in the last two weeks helped bring about passage of a major spending bill, saw a blitz of judicial appointees through the Senate and reversed half a century of U.S. policy toward Cuba. Obama has demonstrated the power of the office and his willingness to use it  even at the expense of working with a new Republican majority in Congress. Aides and observers describe the Obama strategy as essentially a legacy-building plan familiar to most presidents in the end of their second term. In Obamas case, the approach of using his established executive and regulatory authority to act, rather than making deals with lawmakers, is based on a conclusion thats he likely to get little help from Congress in achieving his goals. More executive actions are coming, White House advisors say, showing little worry for whether such moves will continue to outrage Republicans or spoil the possibility of cooperation with Congress. The GOP and the president have areas of common ground, they contend, but Obama is not willing to wait for a Republican-led Congress to act when he can on his own. Obama pointed Friday to the year and a half he gave House Republicans to pass a bill to fix the immigration system, an ultimately futile wait, before he moved last month to protect up to 5 million people from the threat of deportation. \"I intend to continue to do what Ive been doing, which is: where I see a big problem and the opportunity to help the American people, and it is within my lawful authority to provide that help, Im going to do it,\" Obama said. He pledged to try to work with Republicans to try to pass broader legislation on his policy priorities, but next year Obama will face a Congress angered by his executive moves and with little incentive to work with him. At the moment, Republican leaders are trying to decide which Obama priority to fight first, be it gutting Obamacare, fighting his environmental regulations, forcing his hand to approve the controversial Keystone XL oil pipeline or blocking his efforts at economic stimulus or immigration reform  all to counter Obamas vision and set the party up for a strong 2016. Senate Republican Leader Mitch McConnell of Kentucky has already announced that the fate of the Keystone pipeline would be the first substantive vote of 2015. And House Speaker John A. Boehner (R-Ohio) has vowed to set up \"a direct challenge to the presidents unilateral actions on immigration when we have new majorities in both chambers of Congress.\", In the face of such presumed irrelevance, Obama is hardly the first second-termer to try to reject it. With their last midterm elections behind them, two-term presidents are freed from some persistent political calculations and often exhibit a willingness to take bolder actions  even if it means sparking fresh dissent. President George W. Bush responded to his partys deep losses in the 2006 midterm by replacing his Defense secretary and pushing ahead with a surge of U.S. forces in Iraq, despite opposition from newly empowered Democrats and some in his own party. Similarly, President Reagan did not let opposition from hawks in his party or others dissuade him from pursuing major arms control agreements with Soviet leader Mikhail Gorbachev. \"The last two years, he ended with a bang, not a whimper,\" said Reagan biographer Craig Shirley. He did note a difference between Obamas go-it-alone approach and Reagans efforts in the final years. \"Reagan never had control of the House; he always had to work with the Democrats to get things done,\" Shirley said. Obamas plan for a blitz of activity after the midterm election has long been in the works, advisors say. This summer, Chief of Staff Denis McDonough told senior staffers he wanted a series of important projects ready to roll out after the midterm  all designed to serve notice that Obama wasnt ready to go gently. Now, advisors say Obama is preparing for more action in the first few months of the year, although some will require cooperation from Republicans. The most likely target is a series of trade agreements, long a goal of the presidents that has more support from Republicans than Democrats. Other overlapping priorities are harder to find. White House aides list cybersecurity, reform of the Foreign Intelligence Surveillance Act, an overhaul of the patent system and infrastructure spending as potential areas of progress. Obama plans to raise the question of investing in early childhood education, which aides think some Republicans are warm to. College score cards and student loans are also on the docket for early in the year. Within the White House, there are varying degrees of optimism about the possibility of one big-ticket item likely to burnish the presidents legacy: tax reform. Though the prevailing view in the White House is that there is enough overlap between Republicans and Democrats to make it worth pursuing, veterans of fruitless battles with Congress are more skeptical. There may also be too much backlash from Obamas other executive moves to find the goodwill necessary to cut those deals. \"Thats a choice theyre going to make,\" said senior advisor Dan Pfeiffer. \"They can decide that theyre not going to do infrastructure because theyre angry about immigration or Cuba, but thats a loss for the country and probably for them. But what doesnt make sense is to not use the tools available to us to help improve the country.\", \"What were not going to do is wait for Congress,\" he said. \"Were going to push our agenda through.\", christi.parsons@latimes.com, kathleen.hennessey@latimes.com]", "Date": "20141221", "Author": "NULL", "Link": "http://www.latimes.com/nation/la-na-obama-relevance-20141221-story.html", "Title": "[Obama ends year with reminders that he's still not irrelevant]"}