{"Content": "[ IRS investigators believe the identity thieves who stole the personal tax information of more than 100,000 taxpayers from an IRS website are part of a sophisticated criminal operation based in Russia, two officials told the Associated Press. The information was stolen as part of an elaborate scheme to claim fraudulent tax refunds, IRS Commissioner John Koskinen told reporters. Koskinen declined to say where the crime originated. Its thought the thieves used already-stolen identity information to send phony requests through the IRS site. Its thought the thieves used already-stolen identity information to send phony requests through the IRS site. But two officials briefed on the matter said Wednesday the IRS believes the criminals were in Russia, based on computer data about who accessed the information. The officials spoke on condition of anonymity because they were not authorized to publicly discuss the ongoing investigation. The revelation highlights the global reach of many cyber criminals. And its not the first time the IRS has been targeted by identity thieves based overseas. In 2012, the IRS sent a total of 655 tax refunds to a single address in Lithuania, and 343 refunds went to a lone address in Shanghai, according to a report by the agencys inspector general. The IRS has since added safeguards to prevent similar schemes, but the criminals are innovating as well. The information was taken from an IRS website called Get Transcript, where taxpayers can get tax returns and other tax filings from previous years. In order to access the information, the thieves cleared a security screen that required detailed knowledge about each taxpayer, including their Social Security number, date of birth, tax filing status and street address. The IRS believes the criminals originally obtained this information from other sources. They were accessing the IRS website to get even more information about the taxpayers, which would help them claim fraudulent tax refunds in the future, Koskinen said. Were confident that these are not amateurs, Koskinen said. These actually are organized crime syndicates that not only we but everybody in the financial industry are dealing with. Congress is demanding answers about how identity thieves were able to steal the information. The Senate Finance Committee has scheduled a hearing for Tuesday. Koskinen and J. Russell George, the Treasury inspector general for tax administration, are scheduled to testify. When the federal government fails to protect private and confidential taxpayer information, Congress must act, said Sen. Orrin Hatch, R-Utah, chairman of the Finance Committee. Taxpayers deserve to know what happened at the IRS regarding the data theft, and this hearing will be the first step of many that the committee takes to determine what happened and how the government can prevent such attacks from happening again. The IRS said it is notifying taxpayers whose information was accessed. The IRS is providing them with credit monitoring services. The IRS has launched a criminal investigation, and the inspector general is also investigating. ]", "Date": "20150527", "Author": "NULL", "Link": "http://www.latimes.com/business/la-fi-congress-irs-20150527-story.html", "Title": "[IRS believes identity thieves from Russia]"}