{"Content": "[ Win or loseand theres no question hes runningRand Paul has firmly established himself as the most intriguing Republican eyeing the White House in 2016. Thursday brought fresh evidence as the Kentucky senator leaped headlong into the racial cauldron that is Ferguson, Mo. with a bluntly stated Time magazine essay on the police shooting of Michael Brown. Weighing in was hardly a surprise; there are flies circling honey pots with more restraint than a politician given a chance to hold forth on the issue of the day. Rather, what was striking was the angry tone and underlying sympathies of Pauls essay, a condemnation of the rising militarization of law enforcement in the country and assertion that equal justice under law is more a pleasing bromide than reality on the streets of 2014 America. Anyone who thinks that race does not still, even if inadvertently, skew the application of criminal justice in this country is just not paying close enough attention, Paul wrote. Our prisons are full of black and brown men and women who are serving inappropriately long and harsh sentences for non-violent mistakes in their youth. Pauls rhetoric is not just a break with others in the embryonic Republican presidential field; it challenges GOP political orthodoxy going back several decades, ever since Richard Nixon made law and order a cudgel to batter Democrats in the riot-torn 1968 campaign. The strategy may have reached its apogeeor nadir20 years later, when the elder George Bush won the White House in part due to fears summoned by the lurid visage of black convict Willie Horton, used as a symbol of Michael Dukakis woolly headed liberalism. All of which makes Paul, in a phrase that grew fashionable when Bill Clinton challenged the verities of his Democratic Party, a very different kind of Republicanone seemingly eager to shatter preconceived notions of him and his party. Taking the side of protesters against alleged police brutality--however implicitly--is a startling way to position ones self in a Republican primary. But it is wholly consistent with what has been an unorthodox Paul strategy from the start. He has made it plain that his appeal is not to the barnacled Old Guard of the party but a younger, presumably hipper and more broad-minded constituency. We need to be like the rest of America, Paul memorably counseled fellow Republicans at a New Hampshire campaign appearance last year. Were going to win when we look like America. We need to be white, we need to be brown, we need to be black, we need to be with tattoos, without tattoos, with ponytails, without ponytails, with beards, without.\", The issues that Paul has pursued, foremost among them personal protections against a vast, overweening federal government, are resonant with the libertarian devotees of his father, former Republican Rep. Ron Paul, a thrice-failed candidate for president. But he also has sought to broaden his appeal, and that of the Republican Party, among skeptical black voters by taking on issues like prison-sentencing reform, noting the disproportionate impact the so-called war on drugs has had on young African American men. What is more, Paul has ventured -- with decidedly mixed results -- before black audiences and other places where Republicans are scarcely seen. (Though some of the drama can be overstated; for all the talk of Pauls brave appearance earlier this year at UC Berkeley, the fact is there are plenty of libertarians and even conservatives to be found in the San Francisco Bay Area, and many of those who attended were already supporters of the Kentucky lawmaker.), Pauls illuminating Time essay was an exercise in political finesse, wrapping his condemnation of police tactics around an argument against government overreach. There is a systemic problem with todays law enforcement, he wrote. Not surprisingly, big government has been at the heart of the problem. Washington has incentivized the militarization of local police precincts by using federal dollars to help municipal governments build what are essentially small armieswhere police departments compete to acquire military gear that goes far beyond what most of Americans think of as law enforcement. That is not an easy argument to makeappealing to both the sensitivities of black voters and the unhappiness of big-government foesand Paul has hardly proven the most supple of politicians. He did not help himself being caught earlier this month on camera fleeing a conversation in Iowa with immigration reform advocates. But attention is the oxygen that breathes life into a presidential campaign, especially at this preliminary stage. By staking controversial, atypical positions like those outlined in Thursdays essay, Paul ensures that people will continue to pay his candidacy notice, even if he ultimately falls short of winning the GOP nomination. mark.barabak@latimes.com, Follow  @markzbarabak, if you wish, for more on 2016 and national politics]", "Date": "20140814", "Author": "NULL", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rand-paul-ferguson-riots-20140814-story.html", "Title": "[With Ferguson essay, Rand Paul proves a very different Republican]"}