{"Content": "[ Its been nearly three years since Rick Perry stood on a debate stage in Michigan and fumbled fruitlessly for the name of the third federal agency he vowed to eliminate as president. Since then, the Texas governor has worked assiduously to restore his once-platinum political reputation  the Republican had never lost an election before his failed White House bid  and to position himself for another try in 2016. There were issue tutorials and appearances on national talk shows, travels to burnish his foreign policy credentials and visits to key political states, in particular the money-lode of California and early-voting Iowa. All that threatened to come undone with Perrys startling indictment Friday on charges that he abused his office by eliminating funds for the states ethics watchdog, an office overseen by the Travis County district attorney, a Democrat and persistent irritant. In a brief yet fierce appearance Saturday before reporters in Austin, Perry denied any wrongdoing and said he was the victim of a partisan persecution  a notion that drew not just Republican support but the backing of some Democrats and legal analysts. \"I wholeheartedly and unequivocally stand behind my veto and will continue to defend this lawful action of my executive authority as governor,\" said Perry, who punctuated his vigorous defense with a frequently wagging finger and sordid details of the arrest last year of his nemesis, Dist. Atty. Rosemary Lehmberg, for drunk driving. It was Lehmbergs conduct and Perrys subsequent threat to veto funding for her office that resulted in Fridays grand jury indictment. \"I intend to fight against those who would erode our states constitution and laws purely for political purposes, and I intend to win,\" the governor said. By portraying himself as a wrongful target, Perry sought not just to deflect the damage of the indictment but to turn the episode to his political advantage, rallying Republican donors and activists aggrieved at the perception of yet another arrogant government overreach. \"We dont settle political differences with indictments in this country,\" Perry said, echoing a cry that allies took up shortly after the indictment was unsealed. \"It is outrageous that some would use partisan theatrics to rip away at the very fabric of our states constitution.\", It will take considerable time before the political effects of the indictment and Perrys aggressive defense are known; still ahead is the prospect of booking, fingerprinting and a requisite mug shot, which seems destined to appear in campaign ads by Democrat and Republican alike. Other GOP presidential hopefuls  Govs. Chris Christie of New Jersey and Scott Walker of Wisconsin  face their own potential legal jeopardy involving accusations of government misconduct, so Perry is not alone in that regard. (Walker, unlike others eyeing a 2016 run, is also in the midst of a stiff November reelection fight.), Against that backdrop, Perrys political skills over the next days and weeks will determine whether he climbs back into the top tier of candidates, where he resided until his collapse in the 2012 campaign; remains an afterthought; or, worse, a lingering joke with the punch line, \"Oops.\", In Texas, where Perrys third and final term ends in January, the governor has been a formidable campaigner, commanding the political agenda and shining in one-on-one encounters. Lately he showed flashes of his old home-state luster, winning positive reviews from activists in Iowa and vaulting himself into the national debate over immigration with a strong stand against the rush of Central American youth to the U.S.-Mexico border. But there have been signs as well of the more cavalier Perry, who by his own admission entered the race the last time ill-prepared and insufficiently serious. In San Francisco in June, he tossed a bouquet to Democrat Hillary Rodham Clinton  \"great secretary of State, first lady\"  a line unlikely to win friends in a GOP primary. After appearing this week at the Iowa State Fair, he exulted in his performance, telling the Des Moines Register, \"Im awesome!\", His indictment, of course, poses a much sterner, more consequential test. Perry was charged with two felony counts that stemmed from his threatened veto of $7.5 million in funding for the public ethics unit in Lehmbergs office, which oversees state and federal lawmakers. After her arrest, the governor had said he would zero out the money unless she quit. \"I exercised  authority to veto funding for an office whose leadership had lost the public confidence by acting inappropriately and unethically,\" Perry told reporters Saturday. Lehmberg served about half of a 45-day jail sentence but refused to resign, and Perry followed through on his veto threat, prompting a government watchdog group to file a complaint saying Perrys actions amounted to improper intimidation. A special prosecutor was appointed and several top aides to Perry appeared before the Austin grand jury for questioning. The governor did not testify. Critics of Perry note that at the time funding for Lehmbergs office was cut, its public corruption unit was investigating one of the governors pet projects, the Cancer Prevention & Research Institute of Texas. Questions have surfaced regarding the institutes funding and the role of some of Perrys political allies. The governor did not address the matter in his eight-minute appearance Saturday, but rather laced into Lehmberg for her belligerent behavior after her arrest. \"Stopped for a DWI with a blood-alcohol level almost three times the legal limit,\" Perry said. \"An individual who, when booked in, had to be restrained, was abusive to law enforcement, was kicking the door. I think Americans and Texans who have seen this agree with me, that that is not an individual who was heading up an office that we can afford to fund.\", Many of Perrys fellow Republicans  including several potential 2016 rivals  rushed to agree. Texas Sen. Ted Cruz, who has not had the warmest relationship with the governor, called Perry a \"friend  a man of integrity\" and used a Twitter hashtag to say he was \"proud to #StandWithRickPerry.\", Republican Gov. Bobby Jindal of Louisiana posted a series of tweets defending Perry and calling the indictment \"a blatant misuse of the judicial system by liberal activists who couldnt defeat him at the polls.\" Former Florida Gov. Jeb Bush, whose son is running for state office in Texas, called the indictment \"politically motivated and ridiculous.\", Far more surprising was the support of many Democrats, who also questioned the case against Perry. Among them was David Axelrod, a longtime Democratic strategist and advisor to President Obama. \"Unless he was demonstrably trying to scrap the ethics unit for other than his stated reason,\" Axelrod stated on Twitter, \"Perry indictment seems pretty sketchy.\", mark.barabak@latimes.com, Twitter: @markzbarabak]", "Date": "20140816", "Author": "NULL", "Link": "http://www.latimes.com/nation/politics/la-na-rick-perry-20140817-story.html", "Title": "[Texas Gov. Rick Perry, others cry partisan foul over felony indictment]"}