{"Content": "[ The charade comes to an end this month for many of the 2016 presidential contenders, who have long avoided saying they are running  while they are so obviously running  in order to sidestep rules that burden declared candidates. Ted Cruz is already in. Rand Paul is expected to follow suit Tuesday. Marco Rubio has a big announcement planned a week later. The timing, like most things in politics, is driven by money. April marks the start of a sprint to raise as much of it as possible for an official candidacy before the summer reporting deadline, which lands as televised primary debates are about to get underway. Candidates who fail to show that the early big money is flowing into campaign accounts could quickly falter. One big exception is Jeb Bush. Although he is perhaps the least coy of the pre-candidates about his plans to run  and among the most aggressive fundraisers  his announcement may not come for a while. Because of his support from big donors and the fact that he holds no federal office  unlike Cruz, Paul and Rubio, all Republican senators  the former Florida governor is ideally positioned to take advantage of massive holes that have been poked in campaign finance laws in recent years. So long as he doesnt say the magic words \"Im running,\" Bush contends that he can raise and spend unlimited sums through a so-called super PAC under his control. His ability to do so reflects the extent to which long-existing federal constraints on raising political cash that had eroded badly by 2012 have melted away. Though super PACs are supposed to operate independently of candidates, even that prohibition on the groups activities disappears because Bush has not explicitly announced he is running for president. Instead of assembling an official campaign apparatus, Bush is trailblazing into a new frontier of super PACs. It is a place off-limits to most of his GOP competitors, who are inhibited by conflict-of-interest rules that limit how much money senators and congressmen can solicit and from whom. \"This is entirely new ground,\" said Paul Ryan, senior counsel with the nonprofit Campaign Legal Center. \"No candidate or prospective candidate has ever done this before. The boundaries are getting pushed further and further.\", The super PACs that emerged in 2012 were themselves new territory. Candidates went to great lengths to avoid the appearance of any influence over them. They were run independently. Contenders certainly did not show up at the super PAC fundraising events where donors were encouraged to disregard the caps that held back how much they could give to official campaign accounts and open their wallets with abandon. Such discretion was nowhere to be found in Bushs fundraising swing through California in recent days. Bush himself headlined the events. He was the big draw on invitations that asked donors to give as much as $100,000 to attend. Bush did declare he would impose a total cap on how much each donor could contribute, according to the Washington Post. But it wasnt the $5,000 maximum that those in the race are limited to asking for by law. It was $1 million. While Bush is moving into uncharted territory, he is also following a family tradition. Both his father, former President George H.W. Bush, and brother, former President George W. Bush, built their primary victories around robust early fundraising. \"It is one of the things we have seen in past Bush candidacies,\" said Anthony Corrado, a professor of government at Colby College in Maine. \"They took a lead in fundraising early on to establish their position in the race. Jeb Bush is now going to do that through this super PAC. This will be seen as campaign money.\", The other star pre-candidate positioned to vacuum up so much cash, so quickly, is Hillary Rodham Clinton. Like Bush, she is unencumbered by a government job and the fundraising restrictions it brings. Clinton, though, is on a different timetable from the Republicans. The Democratic primaries are shaping up to be a mere formality for her, with no serious opposition. She has yet to start fundraising aggressively. If Clinton launches her campaign this month, the move will not be driven by money. Clinton does not need to prove big donors support her. She needs to preserve her popularity, and she is under pressure to have a clearly organized, disciplined campaign staff to respond to the growing mob of reporters scrutinizing her every move. But other non-declared contenders are pursuing strategies similar to Bushs. New Jersey Gov. Chris Christie recently got his super PAC underway. Wisconsin Gov. Scott Walker and former Sen. Rick Santorum of Pennsylvania launched nonprofits that are unrestricted by federal caps and also cloak the identities of donors. But Santorum lacks Bushs donor base, and Walker and Christie may find themselves held back by prohibitions against sitting governors raising money from donors who do business with their states. The fundraising \"innovations,\" as they are called by the lawyers who concoct them, could ultimately be found to be illegal. Yet none of the pre-candidates seems particularly worried. Regulators overseeing campaign finance at the Federal Election Commission who might like to rein in the donations lack the needed support from its board. Experts say gridlock among the appointees at the agency has left the boundaries of what is permissible so vague that campaign lawyers are emboldened to make up their own rules. \"The system has become so porous that you can just push the envelope further and further,\" said Richard Hasen, a law professor at UC Irvine. \"The FEC is not enforcing the law. Its created these gray areas where campaigns can do these things and not get into trouble.\", On Thursday, the Campaign Legal Center filed complaints at the commission against Bush and three other pre-candidates arguing, in essence, that nobody could possibly believe they are anything but candidates, or at least testing the waters of candidacy  and they are breaking the law by ignoring limits on donations. Even in the unlikely event the FEC finds that the law was broken, nobody expects anything to change in this race, least of all the watchdogs who filed the complaint. \"Even if they investigate and find the law was violated, any such conclusion wouldnt come for a year or two or three from now,\" Ryan said. Meanwhile, he expects the latest fundraising loopholes to trickle down to other races, just as the ones that emerged in the 2012 presidential election ultimately did. \"If Jeb Bush gets away with bankrolling a $100-million shadow campaign, that becomes the new normal,\" he said. \"Every major House and Senate candidate will start postponing their campaign launch, setting up a super PAC, ignoring fundraising limits as long as they can, and then at the last minute they will file their paperwork to run.\", evan.halper@latimes.com, Twitter: @evanhalper]", "Date": "20150406", "Author": "[Evan Halper]", "Link": "http://www.latimes.com/nation/la-na-campaign-cash-20150406-story.html", "Title": "[Presidential candidates-to-be make the most of fundraising rule-bending]"}