{"Content": "[ In what may be the last act of a political career spanning more than four decades, Jerry Brown will begin his fourth and final term as governor uniquely positioned to build his legacy as Californias longest-serving chief executive. On Wednesday morning in the Capitol, he sketched out an agenda that casts him as both an expert technician, tweaking government to be more efficient and effective, and a big thinker, transforming the states infrastructure and combating climate change. Much of his fourth term will be dedicated to unfinished business, such as pushing forward with the long-delayed $68-billion bullet train. Hes also examining possible changes in his criminal justice policies, which have diverted low-level offenders to county jails rather than placing them in state prisons. And he wants stricter rules to make California more reliant on renewable energy sources, part of a broader effort to combat climate change. At the same time, Brown pledged to keep a tight grip on the states finances, aided by voters passage Tuesday of Proposition 2, a constitutional amendment requiring money to be saved in a rainy-day fund. \"Im going to try and do everything I can to keep the state in balance,\" Brown said. \"But I also want to build things.\", He added: \"It is a balance between holding my foot on the brake while pushing my other foot on the accelerator. Its definitely paradoxical.\", Brown will face a series of challenges as he presses forward. Theres vocal opposition to a $25-billion proposal for massive tunnels under the Sacramento-San Joaquin Delta, a project the governor has pitched as crucial to the states water system. The temporary tax hikes voters approved in 2012 are set to begin expiring in 2016, costing the state some of the income that helped erase perennial budget deficits. Democrats failed to win a two-thirds majority in the Legislature, which could make it tougher to push some proposals through. And in Washington, Tuesdays election left Republicans in complete control of Congress, imperiling efforts to secure more federal funding for the bullet train. Nonetheless, Brown is in a stronger position than \"any politician in the country,\" said Barbara OConnor, professor emeritus of political communication at Cal State Sacramento. He won reelection with nearly 59% of the vote, and Californians overwhelmingly approved the two ballot measures he promoted: Proposition 1, a $7.5-billion water bond, and Proposition 2, which in addition to the savings fund provides for debt repayment. OConnor, who worked in Browns administration during his first term in the 1970s, says she expects the governor to remain more focused than he was in the past. \"His old nature wouldve explored new ideas, new programs,\" she said. \"His new nature is much more disciplined. He has discrete goals that hes been very public about and he will pursue them at the exclusion of extraneous stuff.\", Browns second term, from 1979 to 1983, was tumultuous. He mounted his second of three unsuccessful campaigns for president, and his relationships with California lawmakers deteriorated. \"I was carving out a path that was not sustainable,\" Brown said Wednesday. There were also significant problems he did not expect, a reminder that political fortunes can shift quickly. The state was wrestling with Proposition 13s limits on property tax revenue and an insect infestation  the Mediterranean fruit fly, better known as the medfly  that devastated crops. This time around, the governor has taken steps to ensure that political surprises dont knock him off course. He still has a considerable war chest, which could be used for ballot-measure campaigns  a hedge against lame-duck \"infirmities,\" as he put it in a recent interview. Brown also said he would try to carefully balance his relationships with members of his own party. The trick, he said, is to remain faithful to Democratic ideals without succumbing to budget deficits. \"Combining the hopes for what government can do with putting reins on what it should not do will define a lot of what Im going to do in the next four years,\" he said, \"and will determine how successful I will be.\", Hell be working with a new crop of top lawmakers, state Senate leader Kevin de Len (D-Los Angeles) and Assembly Speaker Toni Atkins (D-San Diego). But Robin Swanson, a political consultant who previously worked for Assembly Democrats, said Brown had proven he could work with the Legislature. \"Its nice to have somebody in the drivers seat who knows the way,\" she said. Brown offered no indication that he would spend political capital for a full-frontal assault on controversial issues like an overhaul of the states tax code or a revision of teacher tenure rules. \"Im always open to changes, but I do recognize the political realities,\" he said. Brown also brushed off questions about how it felt to finish what may have been his last campaign. He is barred by term limits from serving another term as governor, and he has shot down speculation about running for mayor of Oakland again or mounting another presidential bid. \"I dont like to think about my last campaign. I find it a depressing thought,\" he said. \"So Im not.\", chris.megerian@latimes.comTwitter: @chrismegerian, Times staff writers Melanie Mason and Patrick McGreevy contributed to this report.]", "Date": "20141105", "Author": "[Chris Megerian]", "Link": "http://www.latimes.com/local/politics/la-me-pol-brown-legislature-20141106-story.html", "Title": "[Jerry Brown plans final touches on legacy as California governor]"}