{"Content": "[ Customized TV Listings are available here:  www.latimes.com/tvtimes, Click here to download,  TV listings for the week of May 31- June 6, 2015 in PDF format ,  This weeksTVMovies, SERIES, When Calls the Heart Elizabeth and Jack (Erin Krakow, Daniel Lissing) receive upsetting news in this new episode. 8 p.m. Hallmark, Treetop Cat Rescue This new unscripted series follows a two-person team that specializes in retrieving wayward felines from very tall trees in western Washington state. 9 and 9:30 p.m. Animal Planet, Outlander The romantic fantasy drama set in 18th century Scotland ends its first season; with Caitriona Balfe and Sam Heughan. 9 p.m. Starz, SPECIALS, Dance Crash Choreographer-to-the-stars Brandee Evans lends her talents to a Georgia high schools hip-hop squad in this new special. 7 and 10 p.m. OWN, 2015 Rock and Roll Hall of Fame Induction Ceremony Joan Jett & the Blackhearts, Green Day, former Beatle Ringo Starr and the late Lou Reed are among the honorees at the annual event in Cleveland, Ohio. 8 p.m. HBO, The Secret Life of Marilyn Monroe \"Pan Ams\" Kelli Garner portrays the screen legend in this two-night bio-drama; with Susan Sarandon. 8 p.m. Lifetime; concludes Sun. Nick Swardson: Taste It The off-color comic and \"Reno 911\" regular performs in Austin, Texas, in this new stand-up special. 10 p.m. Comedy Central, MOVIES, Teenage Mutant Ninja Turtles Leonardo, Donatello, Michaelangelo and Raphael are back in action in this 2014 franchise reboot; Megan Fox, Will Arnett, Whoopi Goldberg, Tony Shalhoub and Johnny Knoxville star. 8 p.m. Epix, Joy Ride 3: Roadkill Deranged trucker Rusty Nail (Ken Kirzinger) torments more young folks in this direct-to-video 2014 sequel. 9 p.m. Syfy, WEEKEND TALK, SATURDAY, Today Kelli Garner. (N) 6 a.m. KNBC, Good Morning America (N) 7 a.m. KABC, McLaughlin Group (N) 6:30 p.m. KCET, SUNDAY, Today (N) 6 a.m. KNBC, Good Morning America (N) 6 a.m. KABC, State of the Union Syria, Baghdad and ISIS; Bergdahl exchange for Gitmo detainees: Retired Gen. Stanley McChrystal (U.S. Army). ISIS in Iraq: Former Gov. George Pataki (R-N.Y.). The Patriot Act expires: Sen. Angus King (I-Maine); Sen. Mike Lee (R-Utah). Host: Jim Scuitto. (N) 6 and 9 a.m. CNN, CBS News Sunday Morning (N) 7 a.m. KCBS, Fareed Zakaria GPS ISIS: Retired Lt. Gen. Mark Hertling (U.S. Army); co-author Michael OHanlon (\"Bending History: Barack Obamas Foreign Policy\"). Great Britains changing role: Sir Peter Westmacott, U.K. Ambassador to the U.S. Water: Jan Eliasson, U.N. Asteroids and pandemics: Nathan Myhrvold, Intellectual Ventures. (N) 7 and 10 a.m. CNN, Meet the Press (N) 8 a.m. KNBC; 11 a.m. MSNBC, This Week With George Stephanopoulos (N) 8 a.m. KABC, Fox News Sunday With Chris Wallace Republican presidential candidate Carly Fiorina. NSA surveillance program: Retired Gen. Michael Hayden (U.S. Army). Panel: Julie Pace, Associated Press; Neera Tanden, Center for American Progress; Brit Hume; George Will. (N) 8 a.m. KTTV; 11 a.m. and 3 p.m. FNC, Reliable Sources (N) 8 a.m. CNN, MediaBuzz Retirement plans: Bob Schieffer (\"Face the Nation\"). 2016 presidential election; reporter on trial in Iran; womens magazines coverage of Hillary Clinton: Susan Ferrechio, Washington Examiner; Martin Baron, the Washington Post; Mercedes Schlapp; Joe Trippi; Greg Gutfeld. (N) 8 a.m. and 2 p.m. FNC, Face the Nation Bob Schieffers last broadcast. Former Gov. Jeb Bush (F-Fla.); CIA Director John Brennan. Panel: Dan Balz, the Washington Post; David Ignatius, the Washington Post; Peggy Noonan, the Wall Street Journal; John Dickerson. (N) 8:30 a.m. KCBS, 60 Minutes The chief of the Cleveland Division of Police; groundwater depletion; Larry David. (N) 7 p.m. KCBS]", "Date": "20150529", "Author": "[Ed Stockly]", "Link": "http://www.latimes.com/la-et-st-saturday-highlights-and-weekend-talk-rock-and-roll-hall-of-fame-20150529-story.html", "Title": "[Saturday Highlights and Weekend Talk: Rock and Roll Hall of Fame]"}