{"Content": "[ The fierce reaction to a botched Oklahoma execution may be fueled by the slow weakening of public support for capital punishment, which has coincided with a shift among Democratic politicians toward opposition to the death penalty. Capital punishment was one of a set of issues Democrats used in the early 1990s to toughen their image against accusations that they were soft on crime and criminals. Although many in earlier generations of politicians had opposed the death penalty -- contributing to Democratic losses in national races -- the candidates who drove the partys resurgence favored it. Then-Arkansas Gov. Bill Clinton laid an overt marker for his view in 1992, when he interrupted his presidential campaign to return to Little Rock for the execution of a brain-damaged cop killer, Rickey Ray Rector. His wife and potential 2016 presidential candidate, Hillary Rodham Clinton, supports the death penalty, as does another potential candidate of her generation, Vice President Joe Biden. (President Obama has defended capital punishment for heinous crimes, although he voted as a state legislator not to expand its reach in less severe cases.), Even in the supposed liberal bastion of California, it has been rare since the early 1990s for Democratic candidates to oppose the death penalty. Barbara Boxer, a senator mocked by opponents as personifying the left, supports capital punishment, as does fellow Sen. Dianne Feinstein. But younger Democrats are taking the opposite position, one that would have threatened to blunt their rise in past years. In California, Lt. Gov. Gavin Newsom and Atty. Gen. Kamala Harris oppose the death penalty, as does Los Angeles Mayor Eric Garcetti. The three, all in their 40s, are presumed to be aiming for Senate or gubernatorial races in the not-so-distant future. Newsom has been the most open about his views. I think we should repeal the death penalty, he said last year during an appearance at San Francisco State. Its not a deterrent; there are racial components to it. Likewise, Martin OMalley, the 51-year-old governor of Maryland and would-be presidential candidate in 2016, last year capped a long campaign to eradicate capital punishment in his state when he signed a measure abolishing it. \"Over the longer arc of history I think youll see more and more states repeal the death penalty,\" OMalley told the Huffington Post. \"Its wasteful. Its ineffective. It doesnt work to reduce violent crime.\", Democrats have had some cover in their move toward opposition by fortuitous political circumstances: When Illinois became the first state to declare a moratorium on capital punishment in 2000, it was the work of a Republican governor, George Ryan. Ryans move came after a Chicago Tribune expose about mistakes that had consigned innocent people to death row. Although coverage of exonerated prisoners may have influenced public views of the death penalty, the real driver of change has been perceptions of crime. Periods marked by higher levels of fear about crime have generally coincided with greater support for capital punishment, and vice versa. The high mark for support came in 1994, when 80% of Americans favored the death penalty, according to the Gallup polling organization, which has asked about the issue since 1936. Not coincidentally, Americans in 1994 listed crime as the countrys most pressing issue. By last year, Gallup said, support had fallen to 60% of Americans. (A Pew Research poll taken this year said 62% of Americans supported capital punishment; the difference is statistically insignificant.), Views on the issue depended largely on politics and ethnicity. According to Gallup, support among Republicans continued to run strong, at 81%, to 60% for independents and 47% for Democrats. Pew found that while 63% of white Americans supported capital punishment, only 40% of Latinos and 36% of African Americans shared that view. Support had dropped for all three groups, Pew researchers noted. The bungled execution Tuesday night in Oklahoma  drugs meant to kill a convicted murderer did not, though he later died of a heart attack  may fuel a rise in the percentage of people who are troubled by the death penalty. According to a Pew survey taken in 2011, 27% of Americans said they opposed it because it was immoral, or wrong, or not within the rights of citizens. Another 27% cited the imperfect nature of the justice system, Pew said. cathleen.decker@latimes.com, Twitter: @cathleendecker]", "Date": "20140430", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-voters-democratic-politicians-death-penalty-views-20140430-story.html", "Title": "[Voters, some Democratic politicians swinging against the death penalty]"}