{"Content": "[ Congress gave final approval to a $1.1-trillion spending bill to keep the government from shutting down, but not without a last-minute hitch when Republican Sen. Ted Cruz forced a rare Saturday session, defying party leaders efforts for smooth passage. The political gamesmanship not only put senators in a foul mood as they canceled weekend plans and braced for a round-the-clock session, but also shifted attention back onto Republican Party divisions that leaders have tried to temper as the GOP prepares to take full control of Congress in the new year. Few expected the sudden turn of events, even though the Texas Republican had vowed to use the spending bill as leverage to stop President Obamas immigration plan. Almost as surprising was the resolution to the standoff late Saturday evening. The vote was 56 to 40, clearing the legislation for the presidents signature. Throughout the day Saturday, anger and frustration among fellow Republicans spilled into the open over a strategy that many viewed as uncomfortably similar to the one that led to the 2013 government shutdown, which left the party badly bruised after conservatives followed Cruzs lead. In fact, just days earlier it was liberal Democrats who had taken the spotlight as threatening to derail the government funding package in the House, before Obama formed an unusual alliance with Speaker John A. Boehner to salvage the vote. But among Cruzs colleagues, much of the damage was done. This reminds me very much of the shutdown last year where the strategy made absolutely no sense and was counterproductive, said Sen. Susan Collins (R-Maine). Ironically, the obstruction to getting the funding bill done had been coming from the other side of the aisle. But now I guess the blame will be shared. As an unintended consequence of the Saturday session, Democrats used the extra time to begin the process of confirming a slew of Obamas nominees next week  including his controversial choice for surgeon general, Dr. Vivek Murthy, who has drawn deep opposition from the National Rifle Assn. because of his advocacy of stricter gun laws. The 20 nominees, who also included the head of Immigration and Customs Enforcement and many district court judges, would not likely have otherwise been approved this year, with just days remaining in the lame-duck Congress. The end result of all of this throughout the weekend is the White House is going to end up with far more nominations confirmed than they ever would have, said Sen. Bob Corker (R-Tenn.). And actually, as I talk to Democrats on the floor, even though this is an usual process, most of them are pretty happy about the outcome. But among party conservatives, Cruz was cheered as a hero who was standing up to Obamas plan to defer deportations for up to 5 million immigrants in the U.S. illegally. Thank you, tweeted Erick Erickson, the conservative editor at Redstate.com, who suggested the hardball tactics not only helped the party win the Senate majority in the 2014 midterm election, but would boost the partys political currency heading into 2016. Cruz raised a point-of-order objection to allowing money to be spent on what he called Obamas unconstitutional immigration action, but it was rejected 74 to 22. The Senate was launched into turmoil late Friday, after the Republican leadership had left the Capitol for the night, calling into question whether Sen. Mitch McConnell (R-Ky.), the incoming majority leader, will be able to control his most conservative members as Republicans prepare to run the Senate in the new year. Just before 9 p.m. Eastern time, Cruz strode onto the floor and took aim at the 1,603-page mess of a bill as the kind of backroom politics Americans abhor. Before the United States Senate is a bill that does nothing, absolutely nothing, to stop President Obamas illegal and unconstitutional amnesty, Cruz said. Thats why I rise here to speak. In many ways, the ability of the renegade senators, Cruz and Sen. Mike Lee (R-Utah), to wrest control of the chamber over leaderships objections resembled the struggle Boehner has faced corralling his Republican majority in the House. Democrats had their own divisions as liberal Democrats, led by Sen. Elizabeth Warren of Massachusetts, were raising strong objections to the bill and threatening its passage. Warren was trying, in a blistering floor speech Friday against big banks, to gut one provision that loosened rules on certain types of securities blamed as central to the 2008 financial crisis. Democrats also objected to a provision that lifts campaign caps for wealthy political donors. Most of us understand there are things in this bill we dont like, but we do have an overriding duty to our country to govern, said Sen. Lindsey Graham (R-S.C.). All I can say about democracy is it is messy. It is emotional. It requires give and take. It requires some people not to follow the hottest person in the room. And there will always be somebody running hot. lisa.mascaro@latimes.com, michael.memoli@latimes.com, 8:22 p.m.: This post was updated throughout. 7:10 p.m.: This post was updated with the final Senate vote. 2:13 p.m.:This post has been updated with Senate passage of a temporary spending measure to keep the federal government operating until Wednesday. This post was originally published at 11:21 a.m. PST.]", "Date": "20141213", "Author": "[Lisa Mascaro, Michael A. Memoli]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-senate-ted-cruz-saturday-session-government-shutdown-20141213-story.html", "Title": "[Senate approves $1.1-trillion spending bill after deadline battle]"}