{"Content": "[ Brazils economy took another hit Wednesday after its state-controlled oil company admitted it couldnt calculate how much money had been lost in a vast corruption scandal. Petrobras, until last year Latin Americas largest company by market value, released third-quarter financial results that were incomplete, unaudited and two months late. Shares dived 9% as investors reacted to the ongoing blowback from an alleged kickback scheme. The alleged scheme involving potentially $4 billion has been one of the major drags on Latin Americas largest economy, and officials concede Brazilians face a difficult year of spending cuts and tax hikes before the country has any chance of returning to the growth it enjoyed just a few years ago. \"The entire Petrobras scandal is dragging down capital markets [and] adds to the concerns about Brazils broader macroeconomic situation,\" said Joao Augusto de Castro Neves, a political analyst at Eurasia Group in Washington. By releasing incomplete results, he said, Petrobras executives \"bought themselves some time in terms of their obligations with bondholders, but this also creates uncertainty as to why they didnt release the number, and prolongs some of its troubles.\", In a note attached to the results, Petrobras said that the results were released to \"comply with covenant obligations in debt agreements\" and that it was \"impractical\" to measure losses in the context of the corruption investigation. In recent months, testimony from insiders involved in plea bargains has revealed a vast corruption scheme at the heart of Brazils economy and politics. Large construction companies allegedly received inflated contracts in exchange for cash bribes that were handed over to political parties. No one has been convicted, and the investigation is ongoing. U.S. shareholders have sued Petrobras for allegedly issuing misleading statements and failing to disclose corrupt practices. The negative reaction to Wednesdays news sent So Paulos Bovespa stock index down nearly 1.9%, marking a loss in value of about $5.4 billion. Shares of Petrobras, formally Petrleo Brasileiro, have lost more than two-thirds of their value in the last five months. Brazil principally exports commodities and is in need of an infrastructure upgrade, analysts agree, and the scandal continues to impede two of its most important sectors, oil and construction, from contributing to a return to growth. Bevins is a special correspondent. business@latimes.com]", "Date": "20150128", "Author": "NULL", "Link": "http://www.latimes.com/business/la-fi-ff-petrobras-scandal-20150129-story.html", "Title": "[Brazil's economy hurt by unknown cost of Petrobras' corruption ]"}