{"Content": "[ A year ago, congressional Republicans meeting at a private retreat revolted over their leaders ideas for immigration reform. This year, theyre ready to try again. Republicans wrapped up their meeting at this chocolate-rich company town with rank-and-file lawmakers expressing renewed interest in tackling what many consider a broken immigration system. Whats changed between last year and this?, Republicans acknowledge \"we have not handled the issue well,\" said California Rep. Jeff Denham (R-Turlock), who is among those nudging his party to get beyond harsh rhetoric that can be perceived as anti-immigrant. \"It will be important before the 2016 election to actually show that we can accomplish something on immigration, and Im looking forward to getting that done this year,\" he said. During a closed session, more lawmakers spoke about the need to address the immigration issue more than on any other issue during the three-day retreat, said those involved in the private sessions. Lawmakers added that a sizable number of new members from the freshman class expressed an eagerness to delve into the issue. At the same time, veteran lawmakers have tired of the tough-on-immigrant stance that the party has been forced into by the most conservative among them. The American people want to see the legislative branch work again, said Rep. Michael Conway (R-Texas), who teared up Friday while describing a citizenship ceremony he attended for 28 returning military members who had served in Iraq. Think of it as a two-part strategy: Republicans will continue trying to stop President Obamas executive actions, as they did earlier this week with a House vote to undo the administrations efforts to defer deportations for up to 5 million immigrant youths and parents. At the same time, Republicans want to press forward with their own ideas for immigration. First up will be a tough border security measure coming from Rep. Michael McCaul (R-Texas), chairman of the Homeland Security Committee, who plans to unveil his beefed-up bill soon. If that legislation advances, watch for next steps -- perhaps efforts to craft guest farm worker programs, expand high-tech visas and clamp down on employers who hire immigrants without legal status. This is the step-by-step approach that Republican leaders wanted to launch last year, but failed to deliver -- in part because of concern from their most conservative members that any immigration bill would lead to amnesty for the 11 million immigrants in the country illegally. These comprehensive plans are never going to wash, said Rep. Lou Barletta (R-Pa.), who was among those who led last weeks effort to stop Obamas plans. Until our borders are secure, we shouldnt be talking about any other immigration bills.\", Leaders did not expect to start the new year with an immigration debate. But with Congress at a standoff over $39.7 billion for the Homeland Security Department, which runs out of money next month, the time is ripe for an immigration debate. Politically, Republicans could benefit if they are able to show leadership on an issue that is important to the Latino and minority voters the party hopes to attract heading into the 2016 presidential election. But the GOP also faces grave risks if it pursues only tough enforcement measures that perpetuate the image of the party as being unwelcoming to immigrants. Advocates for immigration overhaul have long warned against a piecemeal approach that clamps down on the border and employers, but does little to address the 11 million who are living in the shadows without legal status. Thats the last thing that we should be thinking about, said Rep. Raul Labrador (R-Idaho), an attorney who has worked on immigration issues. Theres a consensus on the first step. Republicans say they will take it slowly and see where the debate leads. For a party that has tried and failed to tackle the issue, it is a chance to try again. For the latest from Congress follow @LisaMascaro]", "Date": "20150116", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-gop-immigration-020150116-story.html", "Title": "[Are Republicans ready to try again on immigration reform?]"}