{"Content": "[ President George W. Bush said his younger brother Jeb Bush would make a \"great president,\" as speculation builds that the Republican former governor of Florida might mount a run for the White House in 2016. Jeb Bush, a favorite of the Republican establishment, has maintained a high public profile in recent weeks, appearing at GOP fundraising events and weighing in on debates over immigration and education policy. He has publicly backed at least two GOP candidates in 2014 races, including his recent endorsement of California gubernatorial candidate Neel Kashkari. I hope Jeb runs, the former president said during an interviewon CNN. I think he would be a great president. I have no clue whats on his mind, and we will talk when hes ready. In a GOP presidential primary, a new poll shows Jeb Bush and Sen. Rand Paul of Kentucky at the front of the pack, but by an extremely narrow margin. According to a Washington Post-ABC News poll released this week, 14% of Republicans and GOP-leaning independents each support Bush and Paul, while 13% back former Arkansas Gov. Mike Huckabee, and 11% line up behind Wisconsin Rep. Paul D. Ryan. But the former president said his brother, who has said he wont make a decision until after the November election, is unconcerned with polling. Hes checking his core, and as he said publicly, Im thinking about my family, George W. Bush said. And of course, he knows full well what a run for the presidency can do on family. The Bush family is split about the possibility of a third Bush occupying the Oval Office. In appearance on the \"Today\" show last year, former First Lady Barbara Bush said,Weve had enough Bushes and that her son Jeb should not run, though she believes he is the most qualified. In any case, George W. Bush, who ended his term as one of the most unpopular presidents in modern history, said he was ready and willing to offer his counsel to his brother. Hey, Jeb, if you need some advice, give me a call, he said during the Thursday interview. Twitter: @danielrothberg, daniel.rothberg@latimes.com]", "Date": "20140501", "Author": "NULL", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-george-bush-jeb-bush-2016-president-20140501-story.html", "Title": "[George W. Bush wants Jeb Bush to run, says he'd be 'great president']"}