{"Content": "[ My cartoon was prompted by a report by Times political columnistCathleen Decker about how California has become the place where politicians go to rich peoples homes to talk about the lives of less-fortunate people they rarely meet. In late June, for example: President Obama crossed into Southern California airspace on Thursday and promptly took part in two events with donors, one at the home of producer Chuck Lorre and the second hosted by entertainer Tyler Perry. Later he had dinner with Hollywood moguls Steven Spielberg and Jeffrey Katzenberg. Whats notable is the fact that California, despite its huge number of electoral votes, is no longer in play politically in general elections. The state is widely considered to be a shoo-in for Democratic presidential candidates. But contenders from both parties continue to visit to raise money, which they spend on advertising and other campaign costs in battleground states. Thats why visits by presidential contenders to the Golden State tend to be private affairs rather than public rallies. They fly in, meet with generous donors  or those that they hope will become generous donors  and jet out. Decker quotes Tom Epstein, a former Clinton administration operative and now a vice president at Blue Shield of California: Californias just different. Its a money machine now, more than anything else. You know somethings wrong with democracy when the nations most populous state has become politically irrelevant other than as a source of donor cash. And something is doubly wrong when it is possible for candidates to visit a state with relatively high unemployment and only meet with those willing to drop big bundles of money. Having attended some of these functions, and having befriended a number of waiters who work them, I have always been interested in the cultural intersection of the wealthy, privileged personalities at the catered events and the working-class people serving them drinks and crudits. This is not something that the politicians, even the supposedly liberal ones, seem to care much about. But maybe they should. Remember Mitt Romneys 47%\" comment, the one about a nation of takers that may have done more than anything else to derail his chances to become president in 2012?, It was captured on video by a bartender who worked for the catering company for the event. It was not the first time the bartender met Romney though it seems unlikely that Romney could have recalled their previous meeting. That time, told that Romney drank Diet Coke with lemon, the bartender handed him one without being asked at a previous event. Romney didnt say a word, didnt acknowledge the guys existence. He took it and turned and didnt say anything,\" the bartender explained. \"I presented him the exact right drink that he wanted ... Had it there, sitting there on a napkin. He took it out of my hand and turned his back without a thank you or anything else. As a Mormon, Romney may never have been taught the essential importance of always being nice to your bartender. But it appears to have cost him dearly. As Hillary Rodham Clinton, Jeb Bush and other top contenders for 2016 make the rounds at highfalutin events in California, one assumes that they remember what happened to Romney. Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150630", "Author": "[Ted Rall ]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-rall-0630-california-hillary-2016-20150629-story.html", "Title": "[Hey politicians: California is more than just a money bag for your 2016 campaign]"}