{"Content": "[ SACRAMENTO  Antonio Villaraigosas resume definitely qualifies him to be a U.S. senator and suggests the potential of a pretty effective one. Big city mayor. State legislative leader. Player in the national political arena. Plus: iron will, charm and street smarts (usually). But lets not get too far ahead of ourselves. The single biggest, absolutely necessary qualification to gain admission to \"the worlds greatest deliberative body\" is to win more votes than your opponent. So far the former Los Angeles mayor and state Assembly speaker is only \"seriously considering\" running for the seat that four-term Democratic Sen. Barbara Boxer of Marin County plans to vacate in 2016. The sole candidate actually running is state Atty. Gen. Kamala Harris, 50, a former San Francisco district attorney. \"I think hes going to run,\" says veteran political strategist Garry South, whom Villaraigosa has been calling for advice  along with \"a million\" others, the consultant adds. \"Its more likely than not.\", So whats keeping him? Boxer announced her pending retirement Jan. 8. Five days later Harris jumped in. \"When you seriously consider, you have to seriously consider,\" Villaraigosa told reporters in Washington last week. \"Hes doing his due diligence,\" South says. \"Hes talking to everybody in the Western Hemisphere, waiting to get his ducks in a row.\", While Villaraigosa, 62, has been lining up ducks, Harris has been raising money and collecting endorsements, attempting to convince donors  investors  and politicians that her election is inevitable. She looked strong enough to persuade billionaire climate change activist Tom Steyer of San Francisco to opt out of running last week. Of course, thats not how he phrased it. Steyer said he wanted to focus his time and money on fighting global warming. Villaraigosas hesitation, unfortunately for him, also is providing more time for other potential Democratic candidates to \"seriously consider.\" They include three U.S. House members from Southern California: Adam Schiff, 54, of Burbank; Xavier Becerra, 57, of Los Angeles, and Loretta Sanchez, 55, of Garden Grove. They have at least one advantage over Harris and Villaraigosa: Theyre experienced at raising campaign money under stringent federal rules, which limit individual donations to $2,600 per election. At last glance, Schiff had $2.1 million stashed and Becerra, $1.4 million. But to run, theyd have to surrender their House seats. Schiff, a moderate, would be most likely to draw Republican votes in the \"top-two\" open primary, giving him a chance to advance to the November runoff. Thats assuming there isnt a strong Republican candidate, which is a solid bet. Any House member, however, has a statewide identity problem that would take time and tens of millions to resolve. Also, two or more Southern California candidates could split the L.A. vote, which normally is subpar anyway compared with the Bay Area. Additionally, if either Becerra or Sanchez runs, it would pull Latino votes from Villaraigosa. A little history may be helpful here, however: Villaraigosa and Becerra both ran for mayor in 2001. Villaraigosa finished first in the primary; Becerra a distant fifth. Of course, Sanchez also could draw women from Harris. There are a lot of \"ifs\" and potential chess moves. But if Villaraigosa is actually going to run, the sooner he starts, the better for him. Right now, Harris is trotting unhindered. And shes the only one to have run statewide before, winning both of herraces. Villaraigosa has been itching to run statewide  principally for governor  ever since he was first elected to the Assembly in 1994. His performance as speaker offers one important clue as to what kind of senator he would be. He was a good one, especially given the debilitating effects of ill-conceived term limits, which then relegated Assembly members to only six years. During his two years as speaker, Villaraigosa was persistent, often productive and normally pleasant. He cut delicate deals on two big bond issues for schools and parks. He pushed through legislation enacting a Healthy Families Program that provided medical care for children of the working poor. He flexed his muscle to force passage of a bitterly fought bill limiting handgun purchases to one a month. And he delivered many millions in old-fashioned pork for L.A. including $5 million for the Walt Disney Concert Hall. Californians probably arent very squeamish  at least shouldnt be  about accepting pork from Washington. And Villaraigosa has shown he knows how to grab it. As mayor, Villaraigosa got mixed grades. He scored highest on transportation and safety but was disappointing on education reform and job creation. One legitimate excuse: He presided during the job-killing recession. His image was tarnished by an extramarital affair with a TV newscaster  not his first dalliance while married. So he has personal baggage, not an unprecedented burden for politicians. \"After Bill Clinton and Arnold Schwarzenegger,\" South says, \"the bar has been lowered pretty significantly on baggage.\", Villaraigosa would be Californias first Latino senator. He could generate excitement among the fast-growing Latino population, which hasnt been voting in nearly the proportion of other ethnic groups. And 2016 will be a presidential year, which always attracts a higher turnout of Democratic and minority voters than other elections. \"He doesnt have months to make a decision. Hes got two or three weeks at the outside,\" South says. \"You cant wait for an election to be delivered to you.\", If Villaraigosa really savors higher office, 2016 is his best window. Twitter: @LATimesSkelton]", "Date": "20150125", "Author": "NULL", "Link": "http://www.latimes.com/local/politics/la-me-cap-villaraigosa-senate-20150126-column.html", "Title": "[Villaraigosa's experience could play well in the Senate]"}