{"Content": "[ President Obama said Tuesday that he would nominate the former head of one of Hawaiis largest banks to serve on the Federal Reserve Board of Governors, following criticism from some lawmakers about the lack of community banking experience among the central banks leaders. Obama tapped into his home state to select Allan R. Landon, who was chief executive of the Bank of Hawaii from 2004 to 2010. The bank is the second largest in Hawaii and 94th nationally with $14 billion in assets, according to the latest rankings from USBankLocations.com, an industry directory. Before becoming CEO, Landon worked in various positions at the bank. He also was chief financial officer at financial firm First American Corp. and its subsidiary, First American National Bank. Before going into banking, Landon was a longtime partner at the auditing firm Ernst & Young. Allan Landon has the proven experience, judgment and deep knowledge of the financial system to serve at the Federal Reserve during this important time for our economy,\" Obama said. \"He brings decades of leadership and expertise from various roles, particularly as a community banker,\" Obama said. \"Im confident that he will serve our country well. Obamas grandmother, Madelyn Payne Dunham, was a vice president of the Bank of Hawaii for years. When she died in 2008, Landon and other bank officials organized a memorial service for her in Honolulu. A White House spokesman said he didnt know if Obama, who was raised in Hawaii and vacations there, had a relationship with Landon. The seven-member Fed board has two vacancies. Fed governors serve 14-year terms and also are voting members on the Federal Open Market Committee, which sets monetary policy. Three of the five Fed governors are economists, including Chairwoman Janet L. Yellen. The other two are lawyers. The only Fed board member with private banking experience is Stanley Fischer, an MIT economist who was vice chairman of Citigroup Inc. from 2002 to 2005. The Fed board had been without a member with community banking experience since Elizabeth Duke, a former Virginia banker, stepped down in August. Sen. David Vitter (R-La.) voted against Fischers confirmation last year, complaining that the Fed board was dominated by academics and Wall Street executives at the expense of community bankers. Vitter introduced legislation that would require at least one Fed board member to have experience working at or supervising community banks. The bill was included as an amendment to a bill that passed the Senate in July that reauthorized the Terrorism Risk Insurance Act. \"Community banks have been getting the short end of the stick in the financial sector and its only gotten worse since the financial crisis and megabank bailouts,\" Vitter said at the time. Camden Fine, president of the Independent Community Bankers of America, said Tuesday that the group supported Landons nomination. \"Landons experience as the CEO of a community bank and his broader sector experience will bring a much-needed community bank perspective to the boards deliberations,\" Fine said. For breaking economic news, follow @JimPuzzanghera on Twitter]", "Date": "20150106", "Author": "[Jim Puzzanghera]", "Link": "http://www.latimes.com/business/la-fi-federal-reserve-allan-landon-obama-hawaii-20150106-story.html", "Title": "[Obama to nominate former Bank of Hawaii CEO to Federal Reserve Board]"}