{"Content": "[ The announcement came swiftly, catching many by surprise: After decades in Washington, the path-breaking U.S. senator announced she would retire after 2016. If the timing was unexpected, the response was predictable, years of pent-up ambition surging like water through a broken dam. A pair of formidable candidates quickly entered the race and several more immediately began sizing up their prospects. All of this happened recently in Maryland after Democrat Barbara Mikulski, the longest-serving woman in congressional history, revealed her plans to step aside. In California, meantime, Democrat Kamala Harris continues her cake-walking campaign to replace retiring U.S. Sen. Barbara Boxer, facing the slightest opposition in what promised, at first, to be an epic fight. While the lack of strong competition is surprising, the reasons are no mystery. (Requisite caveat: with more than a year until the June 2016 primary  a lifetime in politics, blah blah  much could change.), Part of the explanation speaks to individual motives; each of the potential top-shelf Democratic contenders had reasons for skipping the Senate contest. Lt. Gov. Gavin Newsom and former Los Angeles Mayor Antonio Villaraigosa would both rather be governor, a job that comes open after 2018, when the term-limited Jerry Brown steps aside. Other statewide officials who might have eyed a Senate bid  Treasurer John Chiang, Secretary of State Alex Padilla  were elected just last November, and it hardly would have been seemly to seek a new job a few months later. (Harris, fresh off reelection, had at least served a full term as attorney general.), Credit also goes to Harris, for her decisiveness. The former San Francisco district attorney started with several things going for her, among them solid support in the Bay Area, which routinely outvotes Southern California; her gender, an edge among Democratic voters  most of whom are women  and a job that has historically been a strong political jumping-off point. She built on those advantages by speedily entering the race, locking up donors and significant endorsements, thus making it harder for others to follow. Billionaire Tom Steyer, for one, was leaning toward a run until Harris got into the race, which abruptly changed his calculations. The comparison with Maryland, though, is instructive. Campaigning in a state with just two major media marketsBaltimore and the Washington, D.C. suburbsis a bargain compared to California, which has nearly a dozen in-state TV markets, stretching from San Diego to Redding almost 700 miles away. To blanket the state, candidates also need to buy TV time in parts of Arizona, Nevada and Oregon. The price tag for a meaningful television ad campaign is roughly $4.5 million a week and should run nonstop starting about six weeks from election day. (Most begin much earlier.) So thats nearly $30 million a Senate candidate needs to raise, bare minimum, for TV alone. Its a steep entry fee and a reason why Harris, who is busily socking away dollars, grows tougher to beat each passing day. Of course, the whole purpose of such advertising is to make a candidate known to voters. Thats a monumental undertaking in California, where the population of the Bay Area alone exceeds Maryland by 1 million residents. Maryland has eight House members, more than half of whom are either running to replace Mikulski or giving it serious thought. (As in California, the Democrats are strongly favored to hang on to the Senate seat in November.), \"You have lots of people with pretty good followings ... and the ability to generate voter and/or financial support,\" said Thomas Schaller, who teaches political science at the University of Marylands Baltimore County campus. Compare that to California, with 53 House members, most of whom are unknown to the average voter save, perhaps, for Democratic Leader Nancy Pelosi of San Francisco. \"Being a member of Congress might make you a big shot in Washington, D.C,\" said longtime Democratic strategist Garry South. \"But out here, if you walk two or three blocks outside your district, no one would have a clue who you are.\", Consider Jane Harman. She was a respected three-term member of Congress from Los Angeles South Bay, with a decades-long Washington resume and deep pockets to finance her 1998 gubernatorial bid. She finished third in the free-for-all primary. On the not-distant horizon lies 2018. Along with an open governors seat, the election could bring another shot at an open U.S. Senate seat, should Democrat Dianne Feinstein  elected alongside Boxer in the states historic 1992 election  step aside. That prospect could be enough to encourage even the most restless office-seeker to sit tight just a few more years. Twitter: @markzbarabak]", "Date": "20150322", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-politics-20150322-story.html", "Title": "[U.S. Senate race fails to strike expected sparks]"}