{"Content": "[ New Jersey Gov. Chris Christie has had a tough winter, and its not getting any better with a new poll showing his favorability dropping sharply in his home state. Christie, who hopes to get his partys presidential nomination, wins a favorable view from only 37% of registered New Jersey voters in the latest survey from Rutgers Universitys Eagleton Institute of Politics, one of the states leading polls. Thats a seven-point drop in two months. For the first time, a majority in the Rutgers-Eagleton survey, 53%, viewed him negatively. Although the GOP nomination race has no official candidates yet, it has plenty of competition. This is the season in which presidential hopefuls try to win over important party activists, major donors and experienced staff, all of which are crucial to putting together a successful run. In that invisible primary, weakness at home can become a major liability. Christie has a lot of problems beyond poll numbers. He has a difficult fight ahead with Democratic legislators over the state budget. Investigations into the role that his appointees played in blocking traffic on the George Washington Bridge appear to have widened into other alleged wrongdoing. And a recent trip to London generated unfavorable headlines over Christies remarks about vaccinations. But the more immediate political problem, which the home state disapproval could worsen, is the widespread perception that Christies outspoken personality doesnt wear well with voters. Just over a year ago, Christie was still at the top of the field of potential GOP presidential candidates. Then, in January 2014, the scandal over the bridge became a major national story. As Christies appointees were accused of orchestrating the traffic tie-ups as a form of political retribution, his popularity began to sink. The drop hasnt stopped. No one has come up with proof that Christie was personally involved in the bridge closure, but the continuing investigations have combined with other voter doubts to harm him at home and in states that hold key early primaries. A recent Des Moines Register poll in Iowa, for example, showed just 36% of likely voters in that states Republican caucuses had a favorable impression of Christie. By a significant margin, that was the lowest standing of any of the major potential candidates. Similar findings have come from other state and national surveys. As Amy Walter of the nonpartisanCook Political Report noted a month ago, \"poll after poll shows that the GOP base isnt ambivalent about New Jerseys governor - they simply dont like him.\", A few numbers stand out in the latest New Jersey survey. Christies overall drop in the poll appears to be driven by self-described independents souring on him in large numbers. Christie carried independent voters handily in both of his elections as governor, but now, the share giving him a favorable rating has dropped to 31%, down 16 points since December. Part of the rationale for Christies candidacy has been the argument that his victories in New Jersey show he can broaden the partys appeal beyond core Republican voters. His decline among independents challenges that. And while the George Washington bridge scandal continues to take a toll, its not Christies biggest problem. Asked to say in their own words why they thought Christies standing had declined, 15% cited the bridge scandal. But one-fifth of the voters surveyed mentioned something more fundamental -- Christies overall personality or attitude. For more on politics and policy, follow @DavidLauter on Twitter.]", "Date": "20150213", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-christie-poll-20150213-story.html", "Title": "[Tough winter for Chris Christie as his home-state standing drops]"}