{"Content": "[ President Obama has made the steady withdrawal of U.S. troops from Afghanistan a top priority for his second term, but his decision Tuesday to change course and slow the drawdown reflects a renewed concern about terrorism threats and a clear rapport with the new president after years of friction with his predecessor. The administration had planned to cut the U.S. military force to about 5,500 troops this year as part of a phased withdrawal. But Obama says he now plans to keep the current force of 9,800 troops there through the end of the year, although he still plans to end Americas longest war before he leaves office. At a White House news conference with President Ashraf Ghani, Obama said he hasnt changed his plan to shrink the U.S. force in Afghanistan to a limited security and military aid mission, with several hundred military personnel at the U.S. Embassy in Kabul late next year. He said the specific trajectory of that drawdown will be set this year. The deadline for the normalization of our presence in Afghanistan remains the end of 2016, Obama said. That hasnt changed. Our transition out of a combat role has not changed. But he said he had decided to leave all U.S. troops in place this year to help Afghan forces succeed so we dont have to go back, so we dont have to respond in an emergency because terrorist activities are being launched from Afghanistan. The U.S.-led invasion in late 2001 was aimed at eradicating a sanctuary for Al Qaeda, the terrorist network that launched the Sept. 11 attacks, and oust the Taliban from power. It proved relatively easy to topple the Taliban, but difficult over the next 14 years to pacify or unify a poverty-stricken country ruled by warlords. About 850,000 U.S. troops deployed to Afghanistan, and 2,215 died there, but the Taliban insurgency remains very much alive. Afghan security forces took over primary responsibility for combat operations last year. Since then, more than 9,000 troops and police have been killed in action, a casualty level that a senior U.S. general in November called unsustainable. The Afghan army managed to hold off insurgent attempts to recapture major towns in the south last year, but it still has large gaps that will take years to fill, including the need to build an air force and the capability to keep units supplied in the field, U.S. commanders say. Its unclear whether Obama will reconsider his plan to remove all but a token U.S. force next year. Although he has frequently announced his desire to end U.S. involvement in the two wars he inherited, some experts warn that a complete pullout of American troops could leave Afghanistan vulnerable to the kind of bloodletting that has engulfed Iraq in the last year. After the 2011 withdrawal of U.S. troops, Iraq faced growing sectarian turmoil and much of its U.S.-trained military collapsed when Islamic State militants swept in from Syria and seized about a third of the country last year. The group recently claimed a franchise in Afghanistan. Obama, however, made it clear that security was not the only issue on his mind. He said he agreed to slow the U.S. pullout in part because of the reinvigorated partnership with Afghanistan and the need to secure the countrys fragile national unity government and political reforms after years of instability. Ghani, a U.S.-educated technocrat who worked for 15 years at the World Bank in Washington, replaced Hamid Karzai, who often was harshly critical of U.S. policies and tactics even as American troops were fighting and dying in his country. Karzais refusal to approve a bilateral security agreement necessary to keep U.S. troops in Afghanistan left relations with the White House in tatters last year. Ghani made signing the accord one of his first official acts after his election in the countrys first peaceful and democratic transition of power last fall. Ghanis three-day visit to Washington this week highlighted the warm new relationship. He was issued a rare invitation to the presidential retreat at Camp David, and spent Monday huddling there with Secretary of State John F. Kerry, Defense Secretary Ashton Carter, CIA Director John O. Brennan, Treasury Secretary Jacob J. Lew, Director of National Intelligence James R. Clapper and other senior officials. He also stopped by the Pentagon to publicly thank U.S. troops who had served in Afghanistan, a gesture Karzai had declined. Due to desertions and casualties, the Afghan army and police now number around 330,000, well below the mandated level of 352,000. One of Ghanis goals for his U.S. visit has been to secure promises from the White House and Congress to continue military aid to his cash-strapped government at or near the roughly $4 billion that has been provided in recent years. Obama pledged his support at the news conference. Standing together in the East Room, Obama introduced Ghani as a fellow alumnus of Columbia University and an anthropologist, as was my mother. Responding in English, Ghani complimented Obamas national security team for going out of its way to engage with his government. Tragedy brought us together, he said to Obama. Interests now unite us. He vowed that his government will speak truth to terror. Most U.S. troops no longer engage in ground combat in Afghanistan and are confined to bases as trainers and advisors. But about 2,500 U.S. special operations troops still carry out attacks on the remnants of Al Qaeda and its allies. Obamas new timetable pushes back the start of the final troop withdrawal to next year and allows the continued operation of several bases that are used by U.S. forces to resupply Afghan units and provide them with emergency air support. In his comments Tuesday, Obama didnt rule out the idea that his future decisions about troop levels will depend on the situation. Anthony H. Cordesman, a national security analyst at the nonpartisan Center for Strategic and International Studies, said the fall of a major Afghan city to insurgents could change the White House calculus on how quickly to pull out. Predicting the outcome of the fighting this year, and for that matter next year, is not something you can easily do, said Cordesman, author of the new book Afghanistan at Transition. Obama has come under growing pressure to ease back on his drawdown, or at least to leave the decision to the next occupant in the White House. Republicans have long pushed him to abandon the schedule. House Speaker John A. Boehner (R-Ohio) said Tuesday that Obama shouldnt be dictating policy preferences divorced from security realities. But a group of former U.S. foreign policy and defense officials, including several who served in senior positions in Obamas administration, also urged the president in a letter released Tuesday to reconsider his goal of removing U.S. forces from Afghanistan by the end of 2016. The letter,whose signers included former Undersecretary of Defense Michele Flournoy and the former NATO commander, retired Adm. James Stavridis, called on Obama to reassess our withdrawal timeline and to look at the U.S. military and intelligence posture necessary in Afghanistan after 2016 to protect the United States homeland and U.S. interests overseas from enduring terrorist threats in the region. In May, Obama outlined a plan to gradually halve the number of U.S. troops in Afghanistan to around 5,500 by the end of 2015. The force under that plan would be consolidated in Kabul and at Bagram air base, north of the capital. Joint bases in the strategically important cities of Kandahar and Jalalabad would be closed. Except for a small force at the embassy, most U.S. troops would leave by the end of 2016. But Ghani and senior U.S. commanders have urged the White House to delay the withdrawal, arguing the full U.S. force  and the operations at the two joint bases  is needed to help the Afghan army and police get through the summer and early fall, when insurgent attacks are the highest. Gen. John Campbell, the top U.S. commander in Afghanistan, told Congress last month that the withdrawal of half his forces this year could potentially take our eye off training and advising Afghan security forces when we really need it. Campbell said the Taliban is not likely to defeat the Afghan army in the field but remains a resilient, lethal force. He said the militants recently stepped up attacks against undefended targets in Kabul to undermine the popular perception of improved security. 7:24 p.m.: This article has been updated with new details and background.]", "Date": "20150324", "Author": "[Christi Parsons, David S. Cloud]", "Link": "http://www.latimes.com/world/la-fg-obama-afghanistan-troops-20150324-story.html", "Title": "[Obama says he'll slow Afghanistan drawdown 'so we don't have to go back']"}