{"Content": "[ Confident that hes secured hard-fought victories on some of his biggest initiatives, President Obama has turned his focus to perhaps the chief test of his legacy: the long-term outcome of the Iran nuclear deal. The president ramped up a public campaign Wednesday to sell the nation and the world on the merits of the deal engineered by his administration, saying its his best chance to make the world safer. \"Weve got a historic chance to pursue a safer and more secure world, an opportunity that may not come again in our lifetimes,\" he said. \"And as president and as commander in chief, I am determined to seize that opportunity.\", The stakes are high for Obama, who has enjoyed some success in using his executive authority to overcome opposition in Congress to his priorities on immigration, the environment and the economy. But whether the Iran deal is cemented as his crowning foreign policy achievement or an utter failure relies on some circumstances beyond his control. Irans compliance with the agreement and the willingness of Obamas successors to fully enforce it are two major keys to its future. \"A lot of presidents have made major strategic foreign policy bets,\" said Jon Alterman, Middle East specialist at the Center for Strategic and International Studies. \"The stark reality is, hes not the one who will really implement the deal. Hes dependent on how his successor treats this and how the Iranians treat it. But hes not going to be in the drivers seat when this is judged.\", The point is not lost on Obama. In efforts to reassure critics and concerned allies during the years-long negotiations, the president made it plain that he was not taking the agreements potential long-term consequences lightly. Under its terms, crippling sanctions on Iran will be eased in return for a severe reduction of its capacity to produce a nuclear weapon and compliance with inspections. \"This deal will have my name on it,\" Obama said in May in an address at a Washington synagogue. \"Nobody has a bigger personal stake in making sure that it delivers on its promise.\", He put it in starker terms in a magazine interview: \"Look, 20 years from now, Im still going to be around, God willing. If Iran has a nuclear weapon, its my name on this.\", With a deal in hand, though, the president has sought to put it in historical context,  comparing it to major initiatives by Richard Nixon on China, or Ronald Reagan in reaching arms agreements with the Soviet Union. \"Hes definitely feeling good about himself,\" said James Goldgeier, dean of the American University School of International Service. \"Its important to put it in perspective of what hes accomplishing this year. \"After six years of questions about whether hed have any signature achievements in foreign policy, we now have the opening to Cuba, the nuclear deal with Iran  something that has been of concern to several administrations.\", Obama used an afternoon news conference to present himself as unfazed by condemnations of the deal. At one point in what became an unconventional, free-wheeling exchange with reporters, he seemed even to pose himself questions so he could rebut criticism. He also challenged critics to go beyond rhetoric and propose an alternative that achieves the goal of preventing an Iranian nuclear weapon. He conceded that the nascent accord addresses only a narrow facet of Irans disruptive behavior in the Middle East, though the one of most urgent concern. But he said that cutting off the governments nuclear capability would make it \"a lot easier for us to check Irans nefarious activities. \"Will we try to encourage them to take a more constructive path? Of course. But were not betting on it,\" he said. \"And in fact, having resolved the nuclear issue, we will be in a stronger position to work with Israel, work with the [Persian] Gulf countries, work with our other partners, work with the Europeans to bring additional pressure to bear on Iran around those issues that remain of concern.\", He and other administration officials have stepped up a campaign to reassure Democrats and other partners as Congress is set to begin a 60-day review period that includes a potential vote of approval or disapproval. Vice President Joe Biden, heading into a meeting Tuesday with House Democrats, said he was confident they would support the terms once they fully understand the deal. Israeli Prime Minister Benjamin Netanyahu on Wednesday escalated his own campaign against the accord in a series of interviews with American television network anchors. \"Im making a special appeal to everyone who is concerned with the future of our world,\" he told NBCs Lester Holt. \"To give the pre-eminent terrorist regime of our time access to nuclear weapons down the line, access to the capacity to make a very large nuclear arsenal with zero breakout time, in a few years, and money to finance terrorists today, I think that is a big, big mistake.\", Obama said that Israel has \"legitimate concerns\" and that he is committed to strengthening military and intelligence cooperation, but repeated that he was taking the best path. \"For all the objections of Prime Minister Netanyahu or, for that matter, some of the Republican leadership thats already spoken, none of them have presented to me or the American people a better alternative,\" he said. Advisors insist that the president was always willing to walk away from the negotiating table if a deal was not to his liking. Just two weeks ago, after the Supreme Court rendered significant victories on healthcare and same-sex marriage, he sought to make clear to negotiators that he felt secure in his legacy and didnt want them to think this accord was needed to bolster it. Still, he seemed resigned to a political fight. \"Based on the facts, the majority of Congress should approve of this. But we live in Washington,\" he told reporters. As his aides nervously looked on, the president scanned the East Room to seek out other objections that have been raised about the agreement. He noted at one point that he was running behind schedule, with Marine One ready to whisk him off on a trip to Oklahoma for the first visit by a president to a federal prison. \"But I really am enjoying this Iran debate,\" he said. \"I suspect this is not the last that weve heard of this.\"]", "Date": "20150715", "Author": "[Michael A. Memoli, Christi Parsons]", "Link": "http://www.latimes.com/world/middleeast/la-fg-obama-iran-20150716-story.html", "Title": "[ Long-term success of Iran deal will not be in Obama's hands]"}