{"Content": "[ Democrats were once the party of the white working man  but that was a long time ago. In the 2012 presidential election, Barack Obama won only one-third of the votes of white working-class men, a modern-day low. Mitt Romney, who didnt seem much like a blue-collar guy, swept the votes of those working stiffs by a huge margin. In the 2014 congressional election, Democratic candidates did even worse, one of the main reasons they lost nine Senate seats and their Senate majority. That imbalance has tormented Democratic activists, who still see themselves as champions of the working class, the partys core identity for most of the last century. If Democrats cant figure out how to appeal to todays working-class voters, then they dont deserve to lead, said Stan Greenberg, a political strategist and pollster who helped Bill Clinton win the presidency in 1992. So theyve done polls and held conferences. Theyve launched a grass-roots campaign to connect with blue-collar workers who arent union members. White noncollege voters  which is how pollsters define working class  have become the Democratic Partys great white whale. That may seem like a silly hang-up in view of the conventional wisdom that Democrats have a virtual lock on the next few presidential elections by virtue of demographics. White men, after all, are a steadily shrinking piece of the electorate. When Ronald Reagan won the presidency in 1980, about one-third of all voters were white noncollege men. By 2012, their share was only about half as large: 17%. The groups that are growing  women, minorities, young people  tend to vote Democratic. The partys next nominee could still win the White House based mostly on their turnout; thats how Obama won his second term. But abandoning the hunt for white working-class men would make Democratic candidates vulnerable to any Republican candidate who could win a healthy share of minority voters, as George W. Bush did in 2000 and 2004. Equally important, because of the concentration of minority voters in urban districts, it would doom the Democrats to second place in congressional elections. So its a practical problem, not just a sentimental one. Almost by definition, identity politics is one source of the problem; some white noncollege voters have come to view Democrats as a party that cares about women and minorities more than it cares about them. I think this is where Democrats screw up, you know? former Sen. Jim Webb (D-Va.), who says he may run for president, told Yahoo News recently. I think that they have kind of unwittingly used this group, white working males, as a whipping post for a lot of their policies. And then when they react, they say theyre being racist. The biggest driver of white working-class disaffection, however, is clearly economic insecurity, combined with a sense that big government hasnt done much to stand up for the little guy. Poll after poll has shown that workers without college educations are more pessimistic than anyone else about the economic future. Thats only logical, since their job prospects have been worsening for decades. But theres a striking racial disconnect: White people are more pessimistic than minorities. When the Pew Research Center asked in 2012 whether they expected their children to enjoy a better standard of living, 56% of black and Latino respondents said yes, but only 41% of whites were optimistic. How do Democrats plan to get out of the hole theyre in? , Part of the answer is easy: Theyll adopt some version of Sen. Elizabeth Warrens economic populism. Theyll denounce the excesses of Wall Street and demand a better deal for the working class. That was the very first note Hillary Rodham Clinton sounded last week in Iowa. The deck is still stacked in favor of those already at the top, she said. Theres something wrong when CEOs make 300 times more than the typical worker.... And theres something wrong when hedge fund managers pay lower tax rates than nurses. But Greenberg has proposed adding another piece to the Democrats message: a more serious commitment to both campaign reform and a leaner, more efficient federal government  an updated version of Bill Clintons 1996 pledge that the era of big government is over. White working-class voters are skeptical of government and skeptical of Democrats, he told me last week. Theyre surprised to hear Democrats say they want to change politics and change government. That message, he said, is a precondition to reaching them on other issues. He noted that Hillary Clinton also called last week for outlawing campaign spending by undisclosed donors, even if that takes a constitutional amendment. Democrats dont expect to win a majority of white working-class voters next year  let alone white working-class men. But theyd like to stop their slide. And, of course, Republicans will compete for the same votes. Several potential GOP candidates have decried the stagnation of blue-collar wages  although, like the Democrats, they havent offered much yet in the way of detailed remedies. At least working-class voters will get plenty of rhetorical attention. That wont solve their problems  but they wont be able to complain that nobodys thinking about them anymore. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150418", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0419-mcmanus-whites-20150419-column.html", "Title": "[Democrats' hunt for the white working-class male voter]"}