{"Content": "[ Something unusual happened in Congress this week: Senators voted -- not just once or twice, but more than 20 times, right up until midnight Thursday. In contrast to the recent years of gridlock and paralysis, senators took vote after politically tough vote as they worked their way through a stack of amendments to a bill to approve the Keystone XL pipeline. It was part of the so-called regular order that Senate Majority Leader Mitch McConnell vowed to deliver after Republicans took control of the chamber earlier this month. The Kentucky Republican promised to restore a more open process that many senators hungered for after Democrats ran the place with a tight grip during the previous eight years. But the process was not without its shortcomings and it remains unclear how long his grand experiment will last. Late Thursday, as midnight neared, McConnell abruptly shut down the Keystone debate, forcing senators to take a rapid-fire series of votes without allowing discussion. The scene led to awkward moments as Democratic senators shouted for a chance to be heard, even for just one minute. \"Mr. President! Mr. President!\" Sen. Ed Markey (D-Mass.) hollered, trying to get the attention of the presiding officer. \"I ask unanimous consent that I be allowed one minute to speak on my amendment before it is voted upon.\", McConnell stood stoically at his desk and uttered the simple debate-squashing retort, \"I object.\", The episode became so politically toxic, it now threatens to delay or derail passage next week of the Keystone bill. On Friday, some frustrated Democrats who support the pipeline are hinting they may withhold their votes next week to advance the legislation. \"I think everybody understands, McConnell said late Thursday. We have been on this bill for a while. We have already had more roll call votes on this bill than the entire Senate had on every bill through the whole year of 2014. I think it is time that we start moving forward. Democrats cried foul, saying McConnell was jamming through the Keystone bill. They suggested it might have something to do with the airplanes waiting to usher Sens. Ted Cruz (R-Texas), Rand Paul (R-Ky.) and Marco Rubio (R-Fla.) to a big Palm Springs weekend political retreat being sponsored by the billionaire Koch brothers. McConnells office put the blame squarely on Democrats for slow-walking the process and then objecting to offers he made for votes on their measures as they pursued even more time for debate. Suddenly the chamber erupted in familiar complaints that the majority party was silencing the minority, though this time the roles were reversed. \"Its sad to see Sen. McConnell shut down debate three weeks into the Republican Senate, and even sadder if hes doing it to let a few Republican senators skip town Friday for a retreat hosted by the Koch brothers, said the spokesman for Senate Minority Leader Harry Reid. For the past two weeks, the Senate has been debating the controversial oil pipeline bill in a long, but largely congenial, process that kicked into gear a few days ago as senators began voting. It started as a textbook case of legislating as each side offered their amendments. There was even a moment of levity when the chamber agreed overwhelmingly, 98-1, to a Democratic measure that said simply: Climate change is real and not a hoax. In all, the Senate processed 24 amendments, most of them from Democrats, and McConnell appeared on track to wrap up the lesson in legislating with final passage of the Keystone bill next week. But the price of Thursdays session may be costly if it soured the mood among Democrats who support the pipeline project. Their votes will be needed Monday for a key vote. Republicans have a 54-seat majority, but they need 60 votes to overcome a Democratic filibuster by the pipelines opponents. \"To enable this vote on the Keystone pipeline to finally happen, we need to be able to debate and vote on amendments,\" said Sen. Heidi Heitkamp of North Dakota, a chief Democratic champion of the Keystone project. \"I was disappointed that open debate was hindered.\", The open process has also forced the Republican senators to take the politically uncomfortable votes on amendments offered by Democrats that have almost zero chance of becoming law. Among them was an amendment to require the oil being shipped on the pipeline be used in the U.S. rather than exported, one to require that the project be constructed with only U.S.-made steel and other components, plus four other amendments related to climate change. They all failed -- and are sure to be incorporated into attack ads against Republican senators up for reelection in 2016. Follow @LisaMascaro for more Senate news]", "Date": "20150123", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/la-na-keystone-amendments-senate-votes-20150123-story.html", "Title": "[Keystone XL amendments had senators doing the unusual: voting ... a lot]"}