{"Content": "[ A day after Antonio Villaraigosa said he would not run for the U.S. Senate in 2016, Latino legislators were scrambling Wednesday to find another candidate who might represent their interests in the contest. Members of the Legislative Latino Caucus holding a policy retreat in Napa said there are others who would energize the Latino electorate in the contest to replace retiring Sen. Barbara Boxer. \"Regardless of Antonios decision, there are still viable Latino and Latina candidates who would continue to excite voters, make it a contested race and bring out Latino voters in the 2016 election, said Assemblyman Luis Alejo (D-Watsonville), the caucus chairman. \"There are other viable Latino and Latina candidates that we will converse with.\", Currently, state Atty. Gen. Kamala Harris is the only major declared candidate for the Senate seat. Latino leaders are concerned that issues important to them will not be discussed unless they have a candidate in the race. Im hoping that more people enter the fray and become part of the public debate, said Sen. Ben Hueso (D-San Diego). Talking about the 2016 Senate and 2018 governors races, Hueso said, \"Our interest is that whoever runs gets more people to the polls. We want to see the electorate get energized by the candidates. Look at the last governors race. We didnt see much of a debate in that race. People said its a done deal, why should we go out and vote? \", Villaraigosas decision not to run surprised some at the caucus retreat. The former mayor of Los Angeles met with the group at the La Toque restaurant to reassure them that he is interested in serving the state in some capacity, just not in the Senate. \"From what I heard there is more he wants to do in public service for the people of California,\" Alejo said after the barbecue lunch. \"Antonio is somebody who has worked very closely with the caucus. He is loved and respected and we look forward to working with him in whatever he chooses to do. Alejo said Villaraigosa would be a \"formidable\" candidate for governor in 2018 if he runs. \"When you talk about Latino candidates and name recognition and cross appeal, I think Antonio is a very well-recognized name. Were waiting to see who jumps in. If it is Antonio I think he would be a very strong candidate.\", Hueso agreed. \"Hes somebody who brings a lot of excitement to a race like that,\" he said. \"I can tell you I have a lot of respect for him. Hes an elder statesman in the Latino community. Hes somebody who brings a lot of experience to policy debates. Assemblyman Ian Calderon, like Hueso, is waiting anxiously to see who besides Lt. Gov. Gavin Newsom decides to run for governor. \"I absolutely think he is somebody who is going to be in that conversation,\" Calderon said of Villaraigosa.]", "Date": "20150225", "Author": "[Patrick McGreevy]", "Link": "http://www.latimes.com/local/political/la-me-pc-latino-leaders-senate-candidate-villaraigosa-20150225-story.html", "Title": "[Latino leaders scramble to find another Senate candidate without Villaraigosa]"}