{"Content": "[ Ever since 1981, when Ronald Reagan sat outside his California ranch and signed a tax-reform law that reversed half a century of mostly climbing rates, the pursuit of ever-lower income tax brackets has been the prime goal of Republican economic policy. Altering that party orthodoxy has become a main exhibit for Sen. Marco Rubios claim to be a new generation Republican. The 43-year-old Republican senator from Florida has proposed a tax plan that puts less emphasis on lowering the top tax rate and instead offers a large new credit for families with children, which he says will help working households. The plan, the first substantial tax proposal of the 2016 presidential campaign, already has generated debate within Republican policy circles. For more than a generation, the partys economic policy has been dominated by the Laffer curve, economist Arthur Laffers graphic illustration of his argument that reducing tax rates could generate enough economic growth for tax cuts to pay for themselves. Rubios plan tests whether Republican primary voters are willing to go beyond that supply-side view. At a time when Americans continue to struggle with declining wages and a sluggish economy, many Republican leaders believe they need to counter the GOPs image as the party of the rich. Mitt Romney, the partys nominee in 2012, lost to President Obama in part because he embodied that image and appeared dismissive of poorer voters, according to GOP postmortems on the election. Republicans have also done particularly badly with female voters, among whom a tax cut for children could be popular, some strategists argue. But the partys tax purists have not been entirely pleased with any move to de-emphasize cutting the top tax rate. Some have hurled what might be the ultimate insult for a Republican, comparing Rubios $2,500 child tax credit, which more than doubles the current $1,000 allowance for each child under age 17, to one proposed by Obama. Others simply call the tax plan underwhelming. Republican critics say that the top rate in Rubios plan, 35% compared with the current 39.6%, is too high. In 2012, Romney proposed lowering the top rate to 28%. Some upper-income taxpayers without children could see a tax increase under the Rubio plan, critics note. Former Florida Gov. Jeb Bush took a swipe at Rubios plan in recent remarks to a forumin Washington sponsored by the National Review, the conservative magazine. His brother, former President George W. Bush, boosted the child tax credit to its current level during his administration. But rather than increase the child credit further, Jeb Bush said he would prefer to try to lower the rates down as [far as] possible. Rep. Paul D. Ryan of Wisconsin, the partys 2012 vice presidential candidate, who has a signed copy of the Laffer curvehanging on his office wall, says he has his own plan, which would push top rates down to 25%. He plans to pursue that as chairman of the tax-writing House Ways and Means Committee, he said. I dont want to be critical, Ryan said at a recent breakfast in Washington when he was asked about Rubios approach. We should have a good, robust debate. On the other side, Democrats say Rubios plan would reduce government revenue by far too much. By trying to expand the child credit while still reducing top rates and including other tax cuts that would directly benefit wealthy taxpayers, Rubio ended up with a plan that carries a price tag of $4 trillion over a decade, according to an analysis by the Tax Foundation, a nonpartisan group based in Washington. Rubio says his plan is crucial to reviving economic growth. You have millions of hardworking, tax-paying Americans who are living paycheck to paycheck, he said in introducing his proposal with fellow Republican Sen. Mike Lee of Utah. The cost of everything keeps going up, but their paychecks do not. Child-rearing contributes to society in the form of future taxpayers who will fuel economic growth, not to mention our future Americans, our future leaders, Rubio, a father of four, said at the National Review forum. As Republican candidates unveil their tax plans, activists in the partys right flank have focused on Sen. Ted Cruzs pursuit of a flat tax and his promise to abolish the Internal Revenue Service. Cruz said at an event last week that he wanted a tax code simple enough that every American can fill out their taxes on a postcard. But even some leading anti-tax activists acknowledge the political appeal of Rubios approach. When Rubio started signaling he was going down that direction, I know I was concerned, said Americans for Tax Reforms president, Grover Norquist, whom many Republicans look to as an arbiter of acceptable tax policy. Considering both the fiscal calculus and the electoral one, Norquist came around. Who would have thought you could come up with something thats pretty easy to explain, but it so useful and cheerful and good? Norquist said. Its very attractive politically  and bulletproof against liberal criticism that its just for rich people. The wealthy, however, would still do well under Rubios proposal. He would eliminate taxes on capital gains, dividends or investments  types of income more often received by the rich than those in the middle or lower end of the income spectrum. He would also cut the corporate tax rate to 25% and apply that same rate to small businesses. Doing so would eliminate a long-standing complaint that smaller entities are taxed at higher rates than large corporations. But because many individual business owners use corporate structures, the proposal would revive opportunities for tax shelters, many of which were eliminated as one of the major parts of the Reagan-era tax changes. Under Rubios plan, people could continue to deduct mortgage interest and charitable giving, but other long-standing tax credits could be eliminated as a way to offset some of the costs. One group of taxpayers could see their income taxes rise under Rubios proposal: higher-income workers without kids. Because Rubios plan simplifies the individual code to just two brackets  35% and 15%  couples earning more than $150,000 (or $75,000 for singles) who were previously in a middle bracket would probably be bumped to the higher 35% rate, without the benefit of the child credit. Rubios backers, however, counter that even those taxpayers could benefit from other parts of the plan, such as the elimination of taxes on capital gains, dividend and interest income. The question is, when he actually fills in the details of his proposal, how far down the road is he going to go? said Howard Gleckman, a senior fellow at the nonpartisan Tax Policy Center. Thats a question we cant really answer yet. Its interesting, Gleckman added, that Rubio is arguing that you ought to have a government subsidy for raising children. Hes trying to position himself as a different kind of Republican. lisa.mascaro@latimes.com, Twitter:@LisaMascaro]", "Date": "20150512", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/la-na-rubio-tax-plan-20150512-story.html", "Title": "[Rubio breaks with Republican orthodoxy on tax proposal]"}