{"Content": "[ A year before Republican voters begin winnowing an expansive field of presidential candidates, well-funded potential contenders such as 2012 nominee Mitt Romney and former Florida Gov. Jeb Bush are battling over donors and supporters as they edge toward a decision to run, overshadowing the also-rans even before they enter the race. Wisconsin Gov. Scott Walker on Thursday made a none-too-subtle argument to Republicans gathered here that the partys success depended on selecting someone else  someone with a proven track record and big bold ideas, a new fresh leader  someone with a profile precisely like his. He recounted his political victories  an election, the blunting of a recall attempt and a reelection, three successes in four years. He boasted of his opposition to abortion rights, his gun rights positions, his fights with public labor unions that won him national acclaim among Republicans. He made predictable gibes at President Obama and Hillary Rodham Clinton, the still-undeclared Democratic front-runner in 2016. But his essential argument was less one of fiery objection to his partys opponents than the assertion that his resolute action at the state level provided a template for success in a White House run. Common sense reforms  a phrase he used repeatedly  can work not just in Wisconsin but they can work all across America, he said. The Republican National Committee gathering, which concludes Saturday, comes at a time of both enthusiasm and nervousness for the party. Buoyed by their takeover of the Senate in November, Republicans nonetheless look ahead to a presidential election landscape far less hospitable, given the traditional influx of Democratic-leaning voters. Although he did not mention his potential rivals by name, Walker strongly suggested that the party needed to break with the past  which both Romney and Bush represent  if it is to lessen the odds of a third straight presidential defeat. We got elected for the third time in four years, he said of his November victory. We can do it in a swing state like Wisconsin, we can do it anywhere. Although he repeatedly called for lower taxes, a position he indicated would be a de rigueur element of any presidential campaign, Walker did not mention a topic of high political interest back home  a budget deficit that is expected to grow to more than $2 billion within two years. Instead, he repeatedly played his Wisconsin roots off the national disdain for all things Washington, and asserted that Clinton, if she runs, would suffer for all the time she has spent in the nations capital. One of the things I picked up loud and clear from our state  is that people dont care much for Washington, he said. In November, he added, the big loser wasnt just the president, it was Washington. Clintons varied experiences  the bulwark of her argument for the White House  are her downfall, he suggested. The reason Hillary Clinton was a big loser is that she embodies Washington, she lives in Washington.  You look at everything people dislike about Washington, she embodies it, he said. The answers to the ailments of our nation do not come out of our nations capital. Although he opened his remarks by thanking the audience for its prayers, particularly during the anger-filled recall, Walkers speech amounted to a more secular approach to the partys future avenues for success than that forwarded earlier in the day by retired neurosurgeon Ben Carson, a popular GOP speaker who also is considering a presidential bid. As he argued that Republicans had to avoid being cowed by political correctness, Carson defended conservative positions on same-sex marriage, Obamacare andthe presidents tactics and blamed the media for ostensibly targeting him. (He did acknowledge the accuracy of past articles detailing acts of plagiarism in his book.), We must be willing to stand up for what we believe in, he told a luncheon audience. The party activists will hear Friday from two potential presidential candidates, as outgoing Texas Gov. Rick Perry headlines a lunch event and Romney speaks in the evening from aboard the USS Midway in San Diego Harbor. It will be Romneys first public address since he began spreading the word last week that he might run for president for a third time in 2016. For political news and analysis, follow me on Twitter: @cathleendecker , , , , , , , , , , , , , , , ]", "Date": "20150115", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-gov-scott-walker-2016-nominee-20150115-story.html", "Title": "[GOP's Scott Walker proposes 2016 nominee like Scott Walker]"}