{"Content": "[ Facing a tough midterm election, Democrats put aside some of their remaining scruples about the new age of unlimited campaign spending and courted unions and hedge-fund billionaires for big checks to try to salvage a Senate majority. They spent a lot of money. But not enough. This year, in a reversal of 2012, the big-money Democratic donors watched their investments return little on election night Tuesday. Although Republicans outspent them overall, Democrats got beaten even in states like Colorado and North Carolina where they spent the same or even a little more than Republicans. ------------FOR THE RECORD: Midterm election: In the Nov. 9 Section A, an article about spending during the midterm election said that Democratic candidates and outside groups supporting them spent a total of about $1.64 million, according to the Center for Responsive Politics. They spent about $1.64 billion.   ------------, \"We just saw a national tsunami,\" said Ty Matsdorf, an advisor to the Senate Majority PAC, which spent about $50 million across the country in a mostly futile effort to keep Democrats in office. \"I dont think theres anything more we should have done,\" Matsdorf said. \"Heres the truth: Everybody knew this was going to be a hard cycle. Everyone knew we were going to face extremely strong head winds.\", Republican donors credited their success to a number of adjustments they had made since the last election cycle: more say in choosing electable candidates, investment in get-out-the-vote efforts that had been a Democratic advantage, and a late spending push. The spending in the 2014 midterm showed how the remaining restrictions on campaign spending continue to weaken. More money moved into \"super PACs\" and dark-money nonprofits, where donations are unlimited, and away from candidate accounts that are still subject to strict limits on individual giving and disclosure. Overall, including spending by candidates and outside groups, Republicans spent about $1.75 billion to Democrats $1.64 billion, according to the Center for Responsive Politics, a nonpartisan group that tracks election spending. -----------, For the Record, Nov. 9, 10:35 a.m.: This story originally said that Democrats spent $1.64 million on the midterm elections; they spent $1.64 billion. This story was first published Nov. 8 at 6:31 p.m. -----------, , But those numbers come with a big asterisk: They dont include much of the spending by so-called dark-money groups. Another tracking organization, the nonprofit Sunlight Foundation, has traced about $145 million spent in dark money, but the real number is unknown. Dark-money spending overwhelmingly favors Republicans. In Alaska, outside groups poured $40 million into the Senate race between Mark Begich, the incumbent Democrat, and Republican Dan Sullivan. The votes are still being counted, but all told, candidates and groups will have spent about $120 per registered voter, more than double the figure in any other state  and more than $250 for every voter who actually made it to the polls. Some players in the Republican money establishment say they also learned a lesson from the defeats of the last two elections: no more gaffe-prone, crash-and-burn candidates. American Crossroads, a super PAC thats part of the political operation built by former Bush advisor Karl Rove, put down money in Republican Senate primaries in Alaska and North Carolina to ensure the party would nominate experienced, mainstream candidates who could inspire confidence in deep-pocketed donors. \"We were not going to tolerate wacky candidates taking down the whole ticket,\" said Andy Abboud, a political advisor to Sheldon Adelson, the casino operator and Republican mega-donor who spent close to $100 million in 2012 and ended up with a string of defeats. \"Those candidates were largely discouraged.\", He said Adelson was wary of getting burned again by a candidate like Todd Akin, the former Missouri congressman and Senate candidate who became a national rallying point for Democrats in 2012 when he argued that women rarely became pregnant from a \"legitimate rape.\", \"All the money in the world cannot fix bad candidates,\" Abboud said. This time around, Adelson was also more skeptical of the pitches made by political consultants, Abboud said. \"We live in Vegas,\" Abboud said. \"Were used to people coming here and trying to take our money.\", Adelson wanted to see less money spent on television ads (where consultants get a commission on spending) and more on the tougher work of building effective get-out-the-vote operations, Abboud said, and he pressed operatives on what they were doing differently this year. Adelson gave $5 million in reported spending to the Congressional Leadership Fund, and at least $20 million to two other groups that dont disclose their donors, including another Rove group, Crossroads GPS, as first reported by Politico. Abboud wouldnt say how much Adelson spent overall, except that it was \"less than $100 million.\", Republican groups invested heavily in field operations, particularly Americans for Prosperity, the organization supported by the billionaire conservative Koch brothers, which hired about 600 people to knock on doors in competitive states including Colorado, Florida and North Carolina. Other Democrats said their get-out-the-vote efforts were overrun by a tide that swung toward Republicans in the final week. Late spending by groups on the right helped to close the deals. Crossroads, which spent about $50 million overall this election, spent nearly half that  more than $21 million  in key Senate races in October. A lot of the money went to an ad in which a young girl at a spelling bee is asked to spell the name of the Democratic candidate, and responds, \"O-B-A-M-A.\" \"Close enough,\" the judges say. Crossroads cut the ad in the spring but saved it for the end, thinking humor would help cut through the late clutter of ads, said Steven Law, president of American Crossroads and Crossroads GPS. \"It delivered our best closing argument,\" linking Democrats to the unpopular president, Law said. Democrats could not counter every Republican money move and had to triage between competitive states. In Florida, backers of the Democratic gubernatorial candidate, former Gov. Charlie Crist, scrambled to come up with extra donations after incumbent Republican Gov. Rick Scott put $13 million of his own money into more advertising. \"On the Friday before the election, the campaign fundraisers turned over every rock, mortgaged their children and begged another $500,000 from donors to better compete in Miami,\" Jim Margolis, partner at GMMB, an advertising consulting firm that worked for Crist, said in an email. \"Thirty minutes after we bought the time, Scott simply sent over another $500,000 to cover our move. It was like play money to them.\", Now, both sides are already thinking about 2016, a presidential year in which Democrats will be waging Senate campaigns in much friendlier states. The super PAC and outside money wars will almost inevitably escalate. Although Democrats say they still favor campaign finance reform, there is little chance of that passing the new Senate, expected to be led by Kentucky Sen. Mitch McConnell, who for years has crusaded for unlimited donations without disclosure. \"Nobody likes the system. We wish campaign finance reform would pass so we could go away,\" Matsdorf said. \"I think our supporters, Democratic donors, decided you just have to play by the rules as theyre written, not what you want them to be.\", joseph.tanfani@latimes.com, Twitter: @JTanfani]", "Date": "20141108", "Author": "[Joseph Tanfani]", "Link": "http://www.latimes.com/nation/politics/la-na-midterm-money-20141109-story.html", "Title": "[Democrats lost the big-money game in midterm election]"}