{"Content": "[ A year after the Internal Revenue Service was found to be targeting conservative groups and others seeking tax-exempt status, the scandal has erupted again with disclosures that the agency lost thousands of emails from a former official at the center of the controversy. IRS Commissioner John Koskinen disclosed June 13 that emails sent by Lois Lerner, the former director of the IRS division that oversaw tax-exempt groups, were lost when her computer hard drive crashed in mid-2011. This week, Koskinen told Congress that eight other hard drives from potential recipients had crashed as well. Republicans have seized on the missing emails, alleging in hearings by two House committees that their disappearance is evidence of a coverup by the IRS and that the White House might be trying to conceal its involvement in a politically inspired scheme to target conservative nonprofits. The Treasury Departments inspector general for tax administration said last year that the IRS actions appeared to be the result of low-level incompetence, rather than political bias. Koskinen contends that the IRS is nonpolitical and says the agency is still working to retrieve the emails. I dont believe it, Rep. Paul D. Ryan (R-Wis.) told Koskinen on Friday. Thats your problem. Nobody believes you. The hearings continue. On Tuesday, David Ferriero, the head of the National Archives, said during a hearing of the House Oversight and Government Reform Committee that the IRS did not follow the law when officials failed to report the loss of the emails, as required by the Federal Records Act. Here are some questions and answers about the continuing scandal:, Whats so important about Lois Lerners emails?, Lerners office that handled applications from 501(c)4 nonprofit groups that have raised and spent vast amounts during election campaigns since 2010. The IRS scandal broke in May 2013 after it was revealed that a regional branch office under Lerner was setting aside applications for tax-exempt status from groups identified using terms such as \"tea party\" or \"patriot. Some progressive groups were flagged as well. Republicans want to see who was communicating with Lerner before and during that time. What happened to the emails?, The IRS has turned over 30,000 emails from Lerners account and from others who received the messages. But the agency has been unable to recover some emails written before her computer crashed in June 2011. Emails written that summer show that IRS technical staff, including experts in the criminal division, were unable to retrieve the files. Thanks for trying. Sometimes stuff just happens, Lerner wrote to one staffer. The hard drive was sent to a recycling company and destroyed. So wasnt there a backup?, There was, but the backup tapes were recycled after six months, Koskinen said, and the agency didnt try to recover Lerners emails from the tapes at the time. Budget cuts left the IRS with aging computer systems that limited the size of employees inboxes and lacked the capability to archive everybodys emails, he said. The agency decided it couldnt afford the estimated $10 million it would cost to upgrade the system, he added.  Is there anything else the agency can do to recover the emails?, The IRS has been trying to recreate Lerners emails by searching other accounts, and it has found about 24,000. But last week, Koskinen revealed that seven other hard drives had failed in the search time frame, from Jan. 2009 to April 2011, and an eighth crashed in February 2014. Its not yet clear whether any files can be recovered from those drives. Why are Republicans claimingfoul play?, Lerners hard drives crashed two years before the inspector general issued its May 2013 finding that the IRS was scrutinizing nonprofit applications using improper procedures. But Republicans point out that the IRS was on notice well before then that lawmakers had suspicions about the agencys conduct. They cite a June 2011 letter from Rep. Dave Camp (R-Mich.), chairman of the Ways and Means Committee. Camp, inquiring in an unrelated inquiry about whether 501(c)4 groups would be charged gift tax, wrote that the IRS appears to have selectively targeted certain taxpayers who are engaged in political speech. When did the IRS learn about the lost emails?, The agency learned of the problem in February. But Koskinen said he didnt say anything until this month when the agency completed its investigation into the email glitch. Republicans, predictably, are furious at the delay.  What has Lerner said about all this?, Lerner, fired from the agency last year, has invoked her 5th Amendment right not to testify while the matter is under criminal investigation.  Whats the White House involvement?, So far no evidence has surfaced that the White House directed the IRS effort. Last week, the administration announced that it had found no direct emails between Lerner and officials in the White House. Twitter: @JTanfani, This has been updated to make clear that the IRS hearings continued Tuesday.]", "Date": "20140624", "Author": "[Joseph Tanfani]", "Link": "http://www.latimes.com/nation/la-na-irs-emails-20140624-story.html", "Title": "[Thousands of missing emails at IRS: What's it all about?]"}