{"Content": "[ California donors have provided strong backing to several candidates in the crowded field of Republican presidential hopefuls, although none have come close to the cash pile amassed here by Democratic front-runner Hillary Rodham Clinton. Florida Sen. Marco Rubio, former Texas Gov. Rick Perry and former Hewlett-Packard Chief Executive Carly Fiorina raised significant chunks of their fundraising totals from donors dotting Orange County, the Central Valley and other traditionally Republican areas, according to fundraising reports the campaigns released this week. California has long bankrolled presidential campaigns, and 2016 is shaping up to be no different. The states money has constituted 16% of all itemized contributions so far in the 2016 presidential race. Thats more than any other state  followed by New York and Texas at 13% each, based on a Times analysis of fundraising reports. The totals reflect only money given directly to candidates campaigns  contributions that are limited to no more than $2,700 from each donor for the primary races. The really big contributions  to the \"super PACs\" that are theoretically independent from the campaigns, but in practice closely allied with them  wont be publicly disclosed until the end of the month. Dollars given directly to a campaign can stretch farther than money raised by super PACs, in part because campaigns get a preferential rate for television advertising and in part because the money is directly controlled by the candidates, making it easier for them to focus their message and marshal get-out-the-vote efforts. The state is critical in presidential elections and will continue to be critical,\" said Paul Seamus Ryan, senior counsel at the Campaign Legal Center, a nonpartisan group that tracks campaignfinanceand laws that regulate it. \"California and New York are where the money is ... no question when it comes to national politics.\", Both Rubio and Perry got 22% of their itemized contributions from California, $1.5 million in Rubios case and just short of $219,000 for Perry. Clinton has raised more than $8 million for her campaign committee in California so far, just over 20% of her total. Her campaign took in more from California than all the other presidential candidates combined. Her strongest challenger, Sen. Bernie Sanders of Vermont, a self-described socialist, raised $806,000 from the state  about 25% of his itemized haul. Fiorina, a former California resident who ran unsuccessfully for the U.S. Senate in 2010, is most dependent on California. More than 40% of her contributions came from the state. By contrast, former Florida Gov. Jeb Bush, who has raised more than any of the GOP hopefuls, received less than 7% of his contributions from California. He has been in the state for several days this week raising money in Los Angeles and Silicon Valley. Of Southern Californias donations, 65% went to Clinton. More than 40% of the money donated from California came from Los Angeles, and about 33% from the Bay Area, according to finance reports. Among Republicans, Los Angeles and Bay Area donors supported Rubio the most, doling out $664,000 and $280,000 respectively to his campaign. On the Democratic side, Clinton dominated both portions of the state, raking in$3.8 million in itemized contributions from Los Angeles and$3.1 million from the Bay Area. Ryan, who works for the Campaign Legal Center, notes that the super PAC filings will be when many of the big-money donors are revealed, since these committees can receive unlimited contributions. \"A lot of campaign fundraising is being outsourced to super PACs because thats really where the money is raised,\" he said. Follow @kurtisalee for political news, Times staff writer Maloy Moore contributed to this report. MORE ON NATIONAL POLITICS:, Scott Walker tries to prove hes a national contender for president, Jeb Bush, in San Francisco visit, says Trump is preying on immigration fears, Hillary Clinton, in New Hampshire, declines to commit to liberal wish list]", "Date": "20150717", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/politics/la-na-california-campaign-money-20150717-story.html", "Title": "[California donors have given more to Clinton than all other presidential hopefuls combined ]"}