{"Content": "[ Within minutes of the Supreme Courts decision declaring a constitutional right for same-sex couples to marry, President Obama joined the celebration, calling one of the gay plaintiffs to congratulate him on live television, then going to the Rose Garden to hail Fridays ruling as a moment when \"slow, steady effort is rewarded with justice that arrives like a thunderbolt.\", Almost simultaneously, Wisconsin Gov. Scott Walker, one of the leading Republicans in the race to succeed Obama, denounced the decision as a \"grave mistake\" and called for a constitutional amendment to reverse it. Another GOP hopeful, Sen. Ted Cruz of Texas, said the high court had \"crossed from the realm of activism into the arena of oligarchy,\" and called for a constitutional amendment to allow voters to remove Supreme Court justices from office. By contrast, former Florida Gov. Jeb Bush, also seeking the Republican nomination, stepped softly, saying only that he thought \"the Supreme Court should have allowed the states to make this decision.\" GOP candidate Sen. Marco Rubio of Florida said: \"While I disagree with this decision, we live in a republic and must abide by the law.\", The widely different approaches highlighted how gay rights  same-sex marriage, in particular  continue to divide and shape American politics. Republicans running for president face a choice in responding to the courts ruling. They could try to use the strong emotions same-sex marriages evoke as a way to mobilize conservative voters in primaries, but potentially at the cost of undermining their campaigns in next years general election. Or they could seize on the finality of a Supreme Court ruling as a way of avoiding an issue on which their party is out of step with the majority of voters, but at the risk of alienating conservatives who see the court decision as a violation of deeply held religious principles. How they choose to navigate the issue will help determine whether the vast majority of the country quickly accepts the courts ruling, as happened with the decision to wipe out laws against interracial marriage nearly half a century ago, or whether it will remain divisive for years to come. As recently as a decade ago, Republicans were able to use gay rights to drive a wedge between Democrats and swing voters. But the rapid shift in public opinion  one of the swiftest changes on a major issue that pollsters have recorded  has reshaped the political landscape to the detriment of the GOP. Today, as many surveys have shown, a growing majority of Americans favor allowing same-sex couples to legally marry. Currently, about 3 in 5 Americans take that position, up from fewer than half just five years ago. Those same surveys also show that the voters who care most about the issue tend to be those strongly opposed to the change. Among self-described conservative Republicans, a group adamantly against same-sex marriage, 40% said in a poll last month by the nonpartisan Pew Research Center that they view the issue as \"very important.\", As a result, Republicans seeking the presidency find themselves pulled between a desire to appeal to the older, conservative voters who dominate GOP primaries in many states and the views of the larger electorate, particularly younger Americans, who regard marriage equality as an important civil right. Democrats moved quickly to heighten that tension and reinforce their support among backers of gay rights. Hillary Rodham Clinton, for example, issued a statement praising the courts decision and calling for the country to go further and outlaw employment discrimination against gays and lesbians. The Obama administration announced that the White House would be lighted up Friday night with a rainbow display, a symbol of the gay rights movement. Republican reactions, by contrast, displayed a sharp split, not on the merits of the decision, which all the partys leading candidates opposed, but in how to respond to it. Walker, Cruz, former Arkansas Gov. Mike Huckabee, Louisiana Gov. Bobby Jindal and other candidates on the partys right are all seeking to consolidate support among conservative voters. That gives them a strong incentive to push issues such as same-sex marriage to the forefront, and they moved to do so in the hours after the ruling. While Walker backed amending the Constitution to overturn the courts decision, others pledged support for individuals  business owners, for example  who feel their religious beliefs would be violated if they were to participate in a same-sex wedding. Huckabee warned against \"surrender\" to the courts decree, but did not say what form of resistance he advocated. By contrast, presidential hopefuls including Bush and New Jersey Gov. Chris Christie, who seek support from more moderate Republicans, sought to downplay the issue. \"This is something that should be decided by the people of each state and not imposed upon them by a group of lawyers sitting in black robes at the U.S. Supreme Court,\" Christie said. \"That being said, those five lawyers get to impose it under our system, and so our job is going to be to support the law of the land.\", Dan Schnur, a veteran Republican strategist who now directs the Jesse Unruh Institute of Politics at USC, suggested that \"you can tell a lot about the candidates for president by the way they reacted to todays decision.\", \"Those who think the way to win a general election is by persuading undecided voters are saying, Lets move on. Those who think the way you win a general election is by motivating the base say, This means war,\" Schnur said. \"The Bushes and the Rubios will quietly disagree with the decision and then try to move on. The Walkers and the Jindals will try to use this to light a fire under the Republican base.\", Curt Anderson, the chief strategist for Jindals campaign, said Republicans can benefit by standing up for their principles even if the polls are against them. \"Political parties can always say, Oh well, some of our principles have fallen out of favor, so lets jettison them,\" Anderson said. \"I dont think thats generally a bright idea.\", Voters will stand with a candidate despite disagreement on a specific issue if they see him or her as someone who is not \"mean-spirited,\" Anderson said. But the idea that the U.S. has a latent conservative majority just waiting to be mobilized by the right candidate is not a view widely shared among Republican strategists. \"The Republican Party has lost the popular vote in five of the last six elections not because conservatives havent turned out,\" said Steve Schmidt, who served as senior advisor to John McCains presidential campaign in 2008 and has since become a vocal critic of the partys right wing. \"The notion that there will be a constitutional amendment\" to end same-sex marriage is \"delusional,\" Schmidt said. Young people in particular have come to regard same-sex marriage as the norm. Moving past the issue could give Republicans a chance to focus on education, the economy and other issues that might prove more fruitful, said John Della Volpe, a Harvard pollster and expert on the youth vote. \"Thats helpful to being competitive in a general election,\" he said. Ultimately, said political analyst Stuart Rothenberg, \"Republicans dont want the 2016 election to be a referendum on same-sex marriage.\", \"It may suit [Rick] Santorum and Huckabee and Jindal from a political point of view to rally social conservatives and the evangelical base and make them angry and make them frustrated and try to emerge as the social-conservative alternative,\" Rothenberg said. But, he added, \"to the extent to which it becomes an emotional issue, an angry issue, an issue that makes Republicans look less tolerant, less inclusive, less welcoming  thats a problem.\", Twitter: @DavidLauter, Twitter: @markzbarabak]", "Date": "20150626", "Author": "[David Lauter, Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/politics/la-na-marriage-politics-20150627-story.html", "Title": "[A GOP conundrum: How does a 2016 candidate play the same-sex marriage ruling?]"}