{"Content": "[ After a disappointing round of talks ended last week in Hawaii without resolution, negotiators of the 12-nation Trans-Pacific Partnership are hoping to meet later this month to try again to wrap up one of the worlds biggest free-trade agreements. Between now and then, negotiators have their work cut out for them: They need to iron out tough issues on the length of drug patents, so-called rules of origin for autos and, perhaps most intractable of all, market access for dairy goods  something particularly important for California, Americas biggest dairy-producing state. Even if the U.S. and 11 other Pacific Rim nations can bring the deal to the finish line this month, its almost certain now that an accord wont reach Congress for a vote until next year, in the thick of the presidential campaign. Just what that means for the outcome of a trade agreement that would cover 40% of the global economy is debatable. Conventional thinking is that in a presidential election year, Congress will punt on politically sensitive matters like free trade, particularly because it has split the Democratic Party. Analysts point out that most lawmakers already made their positions public when they cast votes in June to grant fast-track authority, or expanded trade-negotiating powers, to the president. \"Whether its November 2015 or February 2016 [when Congress votes on it] doesnt make a whit of difference,\" said Jim Kessler, senior vice president for policy at Third Way, a centrist Democratic think tank that is behind the Trans-Pacific Partnership. But others, even proponents of the deal, arent so sure. \"The trade debate has become so toxic, particularly in the Democratic Party, that its harder to predict the outcome in an election year,\" said William Reinsch, president of the National Foreign Trade Council, a pro-trade group representing scores of multinational corporations. How that debate in Congress and the public evolves will depend on the final trade agreement  and that is still an open question. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, Despite the failure to conclude an agreement in Maui last week, Obama administration officials have remained upbeat about the Trans-Pacific Partnership  the economic linchpin of Obamas strategy to shift more focus to Asia-Pacific in the face of Chinas rising power. Secretary of State John F. Kerry, in Singapore on Tuesday, hailed what he called \"good progress\" made during the meetings last week. In his speech, Kerry expressed confidence that the trade agreement will promote economic opportunities and a \"stable, rules-based order for the Asia Pacific.\" Singapore is one of the 12 member nations in the Trans-Pacific Partnership, along with the U.S. Japan, Canada, Australia, Mexico, Malaysia, Chile, Peru, New Zealand, Vietnam and Brunei. Deborah Elms, a trade specialist in Singapore, called the Hawaii meetings a big letdown given the expectations that a final agreement would be reached. \"I think the plan was to have John Kerry to do a victory lap in Singapore  to say that the pivot [to Asia] is here,\" said Elms, executive director of the Asian Trade Center, a research and consulting firm. If the next round of talks happens in conjunction with the Assn. of Southeast Asian Nations meeting in Malaysia on Aug. 22 to 25, as is being discussed, Elms said she doubted there was enough time to resolve their differences. The battle over dairy goods, which are protected by governments around the world, is fraught with domestic political considerations. With national elections in October, Canadas ruling Conservative Party has been reluctant to open up its dairy market. The nations offer in Hawaii was far from what was sought by Australia and New Zealand, a major dairy exporter. Canadas hard line in turn prompted the U.S. to resist liberalizing its market. And the dominoes tipped over to Japan too, which didnt want to widen its dairy market when other offers were uncertain. \"Without access to Canada and Japan, its going to cause serious harm\" to American producers, said Cornell Kasbergen, who milks 3,000 cows in Californias Tulare County and owns a dairy operation in Wisconsin with his brother. Things have been rough for Kasbergen and other dairy producers in drought-pinched California. With demand from China down, he said, \"milk prices are low. Water issues are a concern. Its been a tough year.\", The value of U.S. milk industry was more than $30 billion last year, with exports growing to about 17% of that volume, said Jaime Castaneda, senior vice president of the National Milk Producers Federation. In Hawaii last week to monitor the talks, Castaneda still thinks the dairy dispute can be settled by months end. \"As soon as Canada puts a serious offer on the table, other parts of the puzzle will fall into place,\" he said. At issue on automotive \"rules of origin\" is the local content of cars assembled in a country. Carmakers source parts from all over the world. So before cars assembled in Trans-Pacific Partnership countries can be shipped tariff-free to one another, the parties must agree on what percent of a cars value has to be made in that country for that vehicle to be considered having originated there. Under the North American Free Trade Agreement signed by the U.S. Canada and Mexico in 1993, the rules of origin called for at least 62.5% of a cars value to be made in a NAFTA country. Mexico, home to an increasing number of foreign car plants, wants at least that same percentage in the Pacific trade accord, but Japan is seeking a lower threshold as its automakers use parts and materials from Thailand and other Asian countries that are not part of the Trans-Pacific Partnership, according to the Oriental Economist Report, which analyzes Japan and U.S.-Japan relations. \"Mexico was worried that this would lower demand for auto parts made there,\" the report said. Meanwhile, the U.S. faces pressure from virtually all sides on the patent length for \"biologic,\" or drugs derived from vaccines, hormones and other organic agents. Most of the Trans-Pacific Partnership countries provide five years or less to protect such data before other firms can make generic substitutes. But the U.S. has 12 years of protection, and officials have been pressing to apply that standard to the Pacific trade deal, at the behest of key lawmakers such as Sen. Orrin G. Hatch, the Utah Republican who heads the committee on trade issues. \"Hatch and others should understand its not going to be 12 years,\" said an official familiar with the trade talks. \"Theyre still thinking seven or eight, but our trading partners have said not beyond five.\", On the whole, these three sticking points, plus outstanding issues on sugar and mechanisms to resolve disputes, represent a relatively tiny part of a sweeping deal that involves hundreds of tariff items and 29 chapters that cover rules on labor, state-owned enterprises, e-commerce and other areas of commerce and investment. But how these matters are resolved could make the difference when the deal is reviewed by Congress, which approved fast-track trade authority by only a small margin. Under fast-track legislation, the president first has to notify Congress 90 days before signing a final trade agreement. So if negotiators complete the trade deal at the end of August, the public would see the text of the agreement after 30 days and Obama could sign it as early as the end of November. But before it could be submitted to Congress for a vote, the U.S. International Trade Commission must publish an economic impact assessment, and the agency has up to 105 days to complete that report. Even if that assessment was expedited, with legislative rules and committee procedures  not to mention the Christmas holiday recess  its most likely that Congress wont vote on the trade pact until well into next year. \"Theres no magic about the political system,\" said Rep. Brad Sherman (D-Sherman Oaks), noting that it doesnt really matter when the trade agreement comes before Congress. \"Theres politics in Washington 24/7, in presidential and non-presidential years.\" But, said the congressman, who is opposed to the deal, \"the details are going to be very important to members close to an industry thats affected, whether dairy, sugar or pharmaceuticals. Given how close the [fast-track] vote was, everythings a big deal.\", don.lee@latimes.com, Twitter:@dleelatimes, ALSO:, Group seeks a legislative fix as California refinery profits surge, Disney earnings soar 11%, but changes in TV industry pose risks, MAC Cosmetics announces makeup line in honor of late singer Selena Quintanilla]", "Date": "20150806", "Author": "[Don Lee]", "Link": "http://www.latimes.com/business/la-fi-tpp-talks-20150806-story.html", "Title": "[Negotiators hope to wrap up Trans-Pacific Partnership talks this month]"}