{"Content": "[ The White House on Monday delivered a starkly negative assessment of Senate Majority Leader Mitch McConnells ability to deliver on his promises, faulting him for an unconscionable delay of President Obamas choice for attorney general and inept leadership that threatens a bipartisan trafficking bill. White House Press Secretary Josh Earnest accused McConnell of breaking his commitment to give fair consideration to Loretta Lynch, Obamas nominee for attorney general, and urged Republicans to stop \"playing politics\" with the post. There is no question that Republicans are playing politics with the nomination of the nations top law enforcement official, and it should come to an end, he said. In unusually pointed criticism of a congressional leader, Earnest also faulted McConnell, a Kentucky Republican, for a dispute over abortion that threatens to derail the otherwise bipartisan, popular bill to address sex trafficking. Before the new Congress convened in January, the question of whether Obama and McConnell could forge a strong partnership was seen as key to the prospect of any major bipartisan legislation. When the two met after Novembers midterm elections, both parties expressed confidence that they could find common ground on areas like trade and tax reform despite political differences on a host of other issues. The relationship appears to already have hit a low. On Sunday, McConnell said on CNN that a vote to confirm Lynch could be delayed if Democrats continue to block further consideration of the trafficking bill. McConnell noted that Senate Democrats could have moved to confirm Lynch, now the U.S. attorney in Brooklyn, when they still controlled the Senate last fall. In response, Earnest noted that Obama, in a show of good faith, had agreed to McConnells request that consideration of Lynch be put off until this year. Earnest called it \"unconscionable\" that Lynch, whose nomination was recommended by the Senate Judiciary Committee last month, still has yet to receive an up-or-down vote by the full chamber. \"I get asked a lot about whether or not Sen. McConnell was a man of his word and whether or not hes willing to live up to commitments that he makes to the president of the United States,\" Earnest said. \"For him to suggest that, Well, it hasnt been that long, because Senate Democrats delayed introducing her until after the first of the year, thats not a very good sign of faith.\", Earnest also held McConnell responsible for the impasse over abortion that has tied up what was expected to be swift approval of a bipartisan bill to give law enforcement new tools to target human trafficking and establish a $30-million victims fund. Democrats say Republicans slipped in a provision to block the fund from being used to pay for abortion services without their knowledge. Republicans counter that Democrats should have been paying closer attention to the legislative language. Earnest said McConnell should drop the abortion language to allow the bill to proceed, mocking the GOP for taking a \"common-sense\" bill and turning \"it into partisan controversy.\", \"That is not a reflection of a flaw in the bill. Its a reflection of inept leadership,\" he said. \"The fact that Leader McConnell cant build bipartisan support for a child sex-trafficking bill, I think is an indication that his leadership here in the majority is not off to a very strong start.\", For more White House coverage, follow @mikememoli.]", "Date": "20150316", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/la-na-white-house-mcconnell-20150316-story.html", "Title": "[White House attacks McConnell over impasses on Capitol Hill]"}