{"Content": "[ Prime Minister Benjamin Netanyahus planned address to Congress next month is driving an uncomfortable and rarely seen wedge between congressional Democrats and Israel  and that may have been exactly what House Speaker John A. Boehner and other Republicans intended. For many Democrats, and especially the more than two dozen Jewish members of Congress, Boehners decision to invite Netanyahu to speak about Irans nuclear program  despite objections from the White House  is forcing them to choose between their president and their long-standing support for Israel. On Thursday, Rep. John Yarmuth (D-Ky.) became the third Jewish Democrat to say he would not attend the planned joint session speech, a surprising expression of protest in contrast to the usual outpouring of support and standing ovations U.S. lawmakers lavish on Israels leader. \"Theres a tension,\" said Rep. Alan Lowenthal (D-Long Beach), who has not decided whether to attend. \"The prime ministers coming puts us who are supportive of Israel in a difficult position, especially as Jews who do support Israel, because I think its totally inappropriate to come at this time.\", At least 20 other members of Congress have also vowed to skip the speech. Some see Netanyahus visit as an affront to the president, while others view it as the latest in a continuing effort by Republicans to upset the ties between Democrats and Jewish American voters and donors. Boehner insisted the invitation was intended only to give a key ally a forum for discussing the Iran nuclear talks, in which Israel has a significant stake. But privately, Republican aides havent hidden their delight at how the issue is vexing Democrats, without conceding that was the intent. Democrats suspect politics were part of the reason Boehner broke the usual protocol by not coordinating the invitation of a foreign leader with the White House. \"I dont know whats in the speakers mind,\" said Democratic Rep. Lois Frankel, who represents a district in south Florida with a sizable Jewish population and plans to attend the speech. \"He could be thinking about Iran, he could be thinking about politics. I am just very disturbed  and I would say upset  that Israel is to be used as a political football.\", Though Israel has long coveted the bipartisan support it enjoys in Congress, Netanyahus Likud Party and U.S. Republicans have moved closer together in recent years, joined by shared conservative ideologies and hawkish foreign policies. Evangelicals, who are often more pro-Israel than many Jewish Americans, have also pushed the GOP toward greater support of the Netanyahu government. So have wealthy donors like casino magnate Sheldon Adelson, who contributed more than $100 million to Republicans in the 2012 campaign and is expected to be a major player in the 2016 presidential race. Adelson, who is Jewish and is married to an Israeli, is also one of Netanyahus biggest political patrons; he owns a free, pro-government daily newspaper in Israel that has become one of the countrys most-read. But in the U.S. 70% of American Jews identify with the Democratic Party, while just 22% with the GOP, according to a 2013 study by Pew Research Center. President Obama won 69% of the Jewish American vote in 2012, according to exit polling reported by NBC News, though support dropped from 78% in his 2008 election. \"Youre seeing an emerging split between a part of the community that is politically in line with the prime minister and in line with the Republican Party, and a part of the community that is more supportive of a progressive political agenda here and the Labor Party there,\" said Jeremy Ben-Ami, president of J Street, a liberal pro-Israel group. Boehners invitation \"has successfully exposed that that difference can no longer be papered over.\", Obama publicly declined this week to offer advice to fellow Democrats when asked whether they should attend Netanyahus address, though he has said he wouldnt meet with the prime minister when he comes next month, citing the proximity to Israels March 17 election. Vice President Joe Biden, who would usually attend the speech as the president of the Senate, is proceeding with plans to travel abroad then. Amid the initial controversy over the invitation, top Israeli officials worked the halls of the U.S. Capitol last week to gauge the level of concern, particularly among Democrats. The speaker of Israels Knesset met separately with Boehner and House Minority Leader Nancy Pelosi (D-San Francisco), and the Israeli ambassador to the United States met with a small group of pro-Israel Democrats who expressed concern at how the planned visit had devolved into a partisan fight. But this week Netanyahu sought to quell speculation that he might change plans, saying on Twitter that he was \"determined\" to address Congress. Major Jewish groups have largely stayed out of the fray, including the American Israel Public Affairs Committee, which will also host Netanyahu during his visit. But the Republican Jewish Coalition launched a petition urging support for the address. J Street, meanwhile, is calling on Boehner to reschedule the speech after Israeli elections. For now, most Jewish Democrats plan to attend. Rep. Adam B. Schiff (D-Burbank) said it was \"unseemly\" to invite a foreign head of state to speak against White House policy, but that he would be a \"gracious host.\", \"One of the things that overshadows this whole controversy is the fact that there have been efforts over the last few years to politicize support for Israel,\" he said. \"The strength of the U.S.-Israel relationship has always been at its core a very bipartisan one. I think anything that threatens to jeopardize that is not good for the U.S. and is not good for Israel.\", Rep. Eliot L. Engel of New York, the top Democrat on the House Foreign Affairs Committee, dismissed the controversy as \"a tempest in a teapot.\", \"It doesnt matter that the president and the prime minister dont like each other,\" he said. \"Im mostly concerned about the U.S.-Israel relationship and that it remains strong and remains bipartisan.  The minute Israel becomes a partisan issue, then the U.S.-Israel relationship suffers.\", The most vocal Democratic critics of the invitation have been non-Jews. Sen. Patrick J. Leahy of Vermont, the most senior Democratic senator, accused Republicans of orchestrating a \"tawdry and high-handed stunt that has embarrassed not only Israel but the Congress itself.\", The Jewish Americans who are skipping the speech have been careful in discussing the issue, wary of escalating the controversy. \"There are other venues where Id be open to hearing from Mr. Netanyahu, and there are other time periods where I think itd be appropriate,\" said Sen. Brian Schatz (D-Hawaii). \"But I think this was done in a way that was unhelpful to the America-Israel relationship, and I dont want to participate in it for that reason.\", Noting that some outside political and pro-Israel groups are already threatening electoral retribution for lawmakers who dont attend, Yarmuth posted a 600-word statement explaining his view that Netanyahu \"has plenty of other places to express his opinions.\", \"It is both sad and ridiculous that attending this speech will be used as a litmus test for support of Israel,\" Yarmuth said. \"I will not contribute to the impression that this body does not support the president of the United States in foreign affairs.\", michael.memoli@latimes.com, Twitter: @mikememoli]", "Date": "20150212", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/politics/la-na-democrats-netanyahu-20150213-story.html", "Title": "[Netanyahu's U.S. speech drives a wedge between Democrats, Israel ]"}