{"Content": "[ The U.S. has become significantly less Christian in recent years as the share of American adults who espouse no systematic religious belief increased sharply, a major new study found. For what is probably the first time in U.S. history, the number of American Christians has declined. Christianity, however, remains by far the nations dominant religious tradition, according to the new report by the nonpartisan Pew Research Center. The erosion in traditional religious ranks seems likely to continue. Among Americans aged 18 to 33, slightly more than half identify as Christian, compared with roughly 8 in 10 in the baby boom generation and older age groups, the new data show. Moreover, in a reverse of previous patterns, younger Americans do not appear to be adhering more to traditional faiths as they become parents. Just the opposite seems to be happening  members of the millennial generation have grown less religious as they age. The rapid increase in the number of adults without ties to traditional religious institutions has strong implications for other social institutions and for politics. Whether a person attends religious services regularly is among the strongest predictors of how he or she will vote, with traditional religion strongly tied to the Republican Party, at least among white Americans. The decline in traditional religious belief adds to the demographic challenges facing the GOP, which already faces difficulties because of its reliance on white voters in a country that has grown more racially diverse. The interaction between religion and politics may work both ways. Some scholars believe that close ties between traditional religion and conservatism, particularly on issues such as same-sex marriage, have led many younger Americans to cut ties with organized religion. Opposition to same-sex marriage on the part of religious conservatives is turning off so many people from Christianity, said Phil Zuckerman, a sociology professor at Pitzer College who specializes in studying secularism. Were seeing a backlash against the linking of religion and politics. Almost 1 in 5 American adults was raised in a religious tradition but is now unaffiliated, the study found. By contrast, only 4% have moved in the other direction. A leading conservative religious figure, however, said the survey results could be a positive development. People who once would have been pretend Christian are being more honest about their beliefs, said Russell Moore, president of the Ethics and Religious Liberty Commission of the Southern Baptist Convention. Churches should not try to water down their beliefs on issues such as marriage to appeal to a broader audience, he said. Almost-Christianity not only isnt authentic; its dangerous to peoples souls. I think this gives us a great opportunity for the church to free itself from its American civic religion captivity and to be the church again, Moore said. The worst thing we can do is respond to the changing culture with pandering. Because the U.S. Census does not ask questions about religion, the Pew Research Centers massive religion surveys have become a chief source of information on the religious landscape. The current survey questioned 35,071 U.S. adults last summer. Its huge size allows detailed analysis of even fairly small religious groups. The margin of error for the full sample is plus or minus six-tenths of a percentage point. The study found the U.S. still far more religious than most other economically advanced countries. But the significant increase in the share of Americans who do not follow traditional religious belief mirrors trends in Europe and elsewhere. Its becoming much more possible, much more viable, to identify as secular in the U.S. today, Zuckerman said. In previous generations, a lack of religious affiliation was widely viewed as un-American, he said. Nationwide, just short of a quarter of Americans describe themselves as agnostic, atheist or simply nothing in particular, up from roughly 1 in 6 in 2007, according to the new study. The ranks of the nones, as the study labels them, have grown in large part from people abandoning the religions in which they were raised. That trend toward more secularism is particularly strong in the West, where unaffiliated is now the single largest religious grouping, at 28%, compared with 23% who identify as Catholic, 22% evangelical Protestant and 11% as mainline Protestant, the Pew data show. The South remains the most heavily Christian part of the nation. In the Los Angeles metropolitan region, roughly one-quarter of adults are unaffiliated and about one-third are Catholic, the data show. Two other large Western metropolitan regions, Seattle and San Francisco, rank as the most secular of the countrys largest urban areas, with more than one-third of adults having no religious affiliation. Although younger Americans are much more likely to have no religion than older generations, the decline in organized religious belief has affected nearly all population groups  native-born and immigrant; whites, blacks and Latinos; and those with and without college educations, the Pew data found. The decline has been sharpest among Americans born since the mid-1960s. And in those groups, organized religion does not appear to be gaining adherents as people age. In 2007, for example, about one-quarter of Americans aged 18 to 26 said they had no religion. Today, in that same cohort  who are now 25 to 33  just over one-third say they have no religion. If you work in the church, you see it happening. We have growing numbers of congregations that are having a hard time retaining their membership numbers, said Bishop R. Guy Erwin of the Southwest California Synod of the Evangelical Lutheran Church, based in Glendale. The people who are churchgoers are an aging generation, and theyre not being replaced by younger people, he said. We cant just assume that we can do the same old stuff and still be successful. Married people are more likely to have a religious affiliation than the unmarried, but both groups have grown less attached to organized religion in recent years, the Pew data show. Among married adults, 18% describe themselves as religious nones, while among the unmarried, 28% do. Those who are unmarried but living with a partner are particularly likely to be unaffiliated. With the growth of the religiously unaffiliated, Christian ranks have eroded. Roughly 173 million adult Americans identified as Christian when asked last year. Thats just under 71% of the U.S. population, down from 178 million, or 78% of the U.S. in 2007. The total U.S. adult population grew by about 8% during that seven-year period. Protestants once dominated the U.S. population, but no longer hold a majority, the study found. About 47% of the U.S. population identifies with some Protestant denomination, down from slightly more than half in 2007. The decline has been uneven, with mainline denominations, such as Methodists and Presbyterians, shrinking more quickly than evangelical churches. Slightly fewer than 1 in 6 adult Americans identifies with a mainline Protestant church, according to the survey. Evangelicals, by contrast, make up about one-quarter of the adult U.S. population. They now constitute a majority among those who identify as Protestant. ------------, FOR THE RECORD, May 12, 7:25 p.m.: An earlier version of this article described changes over the last eight years. The survey was taken last summer, seven years after the previous poll. May 12, 11:35 a.m.: An earlier version of this article stated that evangelicals form a majority among those Americans who identify as Christian, according to the Pew survey. Evangelicals form a majority among those Americans who identify as Protestant, according to the survey. -------------, An additional 7% of American adults identify with historically black Protestant churches, a share that has remained relatively stable. Catholics, who represent about 1 in 5 Americans, also have seen some decline in numbers since 2007, the study found, although some other studies have found a recent uptick. Almost 13% of American adults are former Catholics  the largest single group of people who have left a faith in which they were raised. Among non-Christian faiths, Judaism remains the largest in the U.S. although only about 2% of the U.S. population identifies as Jewish. The share is up very slightly from what the survey found in 2007. Islam, Hinduism and Buddhism each have less than 1% of the U.S. population, although the Muslim and Hindu populations have grown rapidly, reflecting emigration from Asia. Among immigrants who have arrived in the U.S. since 1990, almost 1 in 6 identifies with a non-Christian faith. For more on policy and politics, follow@DavidLauter on Twitter, ALSO:, Opinion: Pope Francis and the gospel of election reform, Coercive federal power threatens religious liberty, Jeb Bush says, Opinion: Can kids be good without God? Might they actually be better? A professor says yes, 7:25 p.m. This article was updated with changes throughout. 4:03 p.m. This article was updated with quotes from Russell Moore of the Southern Baptist Convention. 3:43 p.m.: This article was updated with quotes from Bishop R. Guy Erwin of the Evangelical Lutheran Church. 1:14 p.m.: This article was updated with additional detail from the Pew study and quotes from Professor Phil Zuckerman of Pitzer College. This post was initially published at 9:50 a.m.]", "Date": "20150512", "Author": "[David Lauter, Hailey Branson-Potts]", "Link": "http://www.latimes.com/nation/la-na-us-religion-20150512-story.html", "Title": "[U.S. has become notably less Christian, major study finds]"}