{"Content": "[ \"We are trying to be reasonable,\" an organizer for Bernie Sanders Seattle rally said. The black female protesters who stormed the stage became enraged. \"We arent reasonable!\" they shouted back. \"If you do not listen to [us], your event will be shut down,\" one of them declared to the crowd. ------------, FOR THE RECORD, An earlier version of this column said that Hillary Rodham Clinton makes five times the average Americans annual income. She makes that amount per speech. ------------, Sanders caved to the protesters from the Black Lives Matter movement and gave activist Marissa Johnson the microphone. \"I was going to tell Bernie how racist this city is, even with all of these progressives, but youve already done that for me. Thank you,\" she said, apparently in response to members of the crowd who booed her. I suppose if youve already conceded that you arent reasonable, its not hard to argue that booing an uninvited rabble-rouser is \"racist.\", Its understandable that all eyes have been on the insane food fight Donald Trump has instigated on the right. Even Trumps biggest detractors  and I count myself among their number  have to concede that Trump is awfully entertaining. But while the spectacle on the right seems like a canceled TV reality show pilot  call it \"Desperate Billionaires of Manhattan\"  the spectacle on the left is no less fascinating or significant. Sanders, the lifelong independent socialist running for the Democratic nomination, has been gathering historic crowds, much larger than anything Hillary Rodham Clinton or Trump have been able to manage. Saturdays rally drew 15,000 people. The following night in Portland, Ore. 28,000 reportedly attended. The best Clinton has done  in her adopted home state of New York, at her kickoff event no less  was 5,500. The Clinton team is clearly nervous. Her poll numbers have been plummeting as Sanders have been surging. The campaign moved up its ad buys from November to this month. Shes been tacking ever further left. The trouble for Clinton and the Democrats generally is that while Barack Obama was able to unite the factions of the left to get himself elected, its not clear anyone else can. Obama wanted to be a Reagan of the left, a \"transformative\" president who moved the magnetic poles of American politics leftward. The jury is out on that project, but he did succeed in at least one sense. Reagan united foreign policy hawks, social conservatives and economic conservatives  the famous three legs to the stool of the conservative movement. Obama did something very similar on the left. He united the civil rights or identity politics wing, the economic or egalitarian wing and the more elitist technocratic wing. Obviously, these movements overlap  just as the different factions of the Reagan coalition overlapped  but each has its own priorities and passions. Aided by his experience as a former community organizer and his historic status as the first black president, Obama held the coalition together through force of personality. The Democratic Party has always had internal conflicts. Franklin D. Roosevelts coalition contained socialist Jews and blacks and Southern segregationists. That coalition held for 20 years after his presidency. But the Obama coalition seems to be fraying while hes still in office, and none of his presumptive heirs have the charisma or skills to repair or sustain the coalition. Sanders has charm, but the Jewish socialist transplant from Brooklyn has spent his political life in a state that has only 7,500 blacks. He lacks the vocabulary to appeal beyond the white left. Meanwhile, the black left, an indispensable voting bloc, has no standard-bearer in the primaries and is clearly angry about it. Clintons most comfortable in the role of elitist technocrat, which is great for fundraising from Wall Street and wooing Beltway journalists, but its not so useful for wooing voters in a populist environment. Thanks to her husband, she still has goodwill among African Americans. But she lacks the charisma, passion or personal story to excite either the black left or the white left. The woman who left the White House \"dead broke\" makes five times the average Americans annual income per speech. The GOPs Trump problem will eventually melt away. I suspect the Democrats troubles are far more durable. jgoldberg@latimescolumnists.com, Follow the Opinion section on Twitter @latimesopinion and Facebook, ALSO:, Who are Bernie Sanders supporters?, Trump on Fox News: Weve always been friends, Hillary Clinton unveils $350-billion plan to make college more affordable]", "Date": "20150810", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0811-goldberg-bernie-sanders-democrats-20150811-column.html", "Title": "[GOP's Trump problem will fade, but Democrats' Bernie Sanders troubles are just beginning]"}