{"Content": "[ As conservatives redouble efforts to end Planned Parenthoods government funding, House Republicans on Wednesday fueled an already emotional and partisan debate by hearing testimony from two women who were born during botched abortions in the 1970s. If abortion is about womens rights, then what were mine? asked Gianna Jessen, who was left with cerebral palsy due to a lack of oxygen during her mothers attempt to terminate the pregnancy. Im here today to share a story not only to highlight the war of abortion taking place at Planned Parenthood, but to give a voice to other survivors like me, Melissa Ohden told the House Judiciary Committee. Both said they survived failed saline-infusion abortion attempts in the late 1970s. The hearing, which did not include representatives from Planned Parenthood, comes after the release of secretly recorded videos showing several Planned Parenthood officials speaking in a cavalier manner about recovering fetal tissue from abortions for use in medical research. The videos, produced by the the Center for Medical Progress, an Irvine-based antiabortion group, swiftly reignited the abortion debate in Washington. Conservative lawmakers are now hoping to put Planned Parenthoods government funding at the center of the upcoming budget battle. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, In stark terms, Ohden recounted the abortion procedure her mother underwent when she weighed less than three pounds. Doctors told her parents she had little chance of recovering from health-related side effects, she said. Wednesdays hearing was the first of at least two Republicans have planned to highlight the risks of late-term abortions and the practice of using fetal organs and tissue from abortions for medical research. The antiabortion group has accused Planned Parenthood of profiting by selling fetal tissue. Abortion-rights advocates dismissed the videos as selectively edited propaganda intended to heighten emotions, not reveal facts. Planned Parenthood, which provides a range of health services for women including abortion and contraceptive services, acknowledges it collects tissue from patients who voluntarily donate it for medical research, but not for profit. Wearing pink T-shirts that read, I Stand With Planned Parenthood, several supporters of the organization were in attendance at the hearing. These hearings are not really hearings, they are political theater oriented toward taking away the right for women to access abortion in this country, Dawn Laguens, executive vice president of Planned Parenthood, said in an interview. There was no evidence of any wrongdoing by Planned Parenthood. Michigan Democratic Rep. John Conyers Jr. the committees ranking minority member, called the hearing one-sided. His Democratic colleague Rep. Hank Johnson of Georgia described it as a show trial, while another, Rep. Steve Cohen of Tennessee, went further and labeled it the Benghazi of healthcare hearings. Conyers also criticized the Center for Medical Progress for not testifying at the hearing. Planned Parenthood was not invited to counter the allegations against it. There is no credible evidence that Planned Parenthood violated the law, he said. The only person who testified in support of Planned Parenthood, Priscilla Smith, director of the Program for the Study of Reproductive Justice at the Information Society Project at the Yale Law School, agreed. The Center for Medical Progresss videos have no evidentiary value, said Smith, who testified in a personal capacity and not on behalf of Yale. Republicans, however, said the videos dramatically highlight the immorality of abortions and Planned Parenthoods role in profiting from the procedures, though it relies more on donations than on government funding. Some members have questioned why our investigation is focused on the conduct of Planned Parenthood and not on the conduct of those who obtained the undercover footage, said committee chairman Rep. Robert W. Goodlatte (R-Va.), Part of the answer is that Planned Parenthood, unlike the undercover reporters, is granted huge amounts of federal funds, making it our business as members of Congress -- charged with controlling the federal purse strings -- to do what we can to ensure federal taxpayers are not contributing to the sorts of horrors reflected in the undercover videos. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, ALSO:, California Assembly approves right-to-die legislation; Senate OK is expected, Secure in Iran deal victory, White House is gently mocking its opponents, U.S. gasoline prices projected to hit $2.03 by December]", "Date": "20150909", "Author": "NULL", "Link": "http://www.latimes.com/nation/la-na-planned-parenthood-hearing-abortion-20150909-story.html", "Title": "[Abortion 'survivors' criticize Planned Parenthood on Capitol Hill]"}