{"Content": "[ A Los Angeles-area lawmaker, Anthony Rendon, has been tapped to be the next state Assembly speaker, maintaining Southern Californias clout in the Capitol and signifying a generational shift in the highest ranks of the Legislature. The official vote to designate Rendon, a Democrat who lives in Lakewood, as speaker-elect will be in January. It is unclear when he will succeed the current speaker, Toni Atkins (D-San Diego). Once Rendon takes command, both the Assembly and the Senate in the nations largest state will be led by Latinos for the first time, with Rendon joining Senate pro Tempore Kevin de Len, a fellow Democrat from Los Angeles. The political shuffle comes as lawmakers who now can serve as many as 12 years in one house rallied to elect one of their own before adjourning next week for the year. Rendon will be the first speaker to serve under the term limits that voters approved in 2012. Atkins, who was elected to the Legislature in 2010 and became speaker last year, was destined for a short tenure because of her 2016 term limit. The big advantage that my class has over previous classes is just the benefit of time, Rendon said. Being able to be here for a significant amount of time gives us the opportunity to sink our teeth not only into different policy areas, but into things like oversight. Rendon, who unsuccessfully ran for speaker against Atkins in 2014, could serve as speaker for nine years  longer than any lawmaker since Democrat Willie Brown, who reigned from 1980 to 1995. Brown, however, was an Assemblyman for more than 15 years before becoming speaker, honing the political skills and cunning that were the hallmarks of his long tenure as leader when there were no term limits. Rendon has served three years. Still, Rendon was able to put it together to get the job. That shows hes got the goods, said state Democratic Party Chairman John Burton, a former president pro tempore of the state Senate. But its going to be a little trial by error, and trial by fire. Democrat John Prez of Los Angeles, who was speaker from 2010 to 2014, said the change gives lawmakers enough breathing room to tackle some of Californias most complex issues and deliver on their own legislative priorities. The downside is that theres more time for lawmakers who may be eclipsed from favored committee assignments, or who are otherwise not happy with their own lot in life, to rebel against the leadership, he said. So the speaker has to juggle both those challenges and opportunities, Prez said. Rendons impending ascension follows major changes in GOP leadership in both houses. State Sen. Jean Fuller (R-Bakersfield) took over for Sen. Bob Huff (R-San Dimas) on Aug. 27, months earlier than expected. And freshman Assemblyman Chad Mayes (R-Yucca Valley) was designated the Assemblys minority leader-elect this week. In January, Mayes will take over the Assembly GOP caucus from the current leader, Kristin Olsen of Modesto. Mayes will be termed out in 2026. Both Huff and Olsen, precluded from running for reelection because of term limits, are eyeing other offices: Huff, the Los Angeles County Board of Supervisors, and Olsen, a state Senate seat. Republican political consultant Rob Stutzman said that once a legislative leader starts running for another office, fellow party members start itching for new blood  a leader devoted to strengthening the caucus and not distracted by personal political ambitions. Once theyre a candidate for another office, their interests are just that  and not the caucus, Stutzman said. Among the Assembly Democrats, Atkins had tried to tamp down the incipient leadership upheaval during the final weeks of the session, asking members to sign a letter pledging to delay electing a new leader until January. But the jockeying continued. Theres been a little bit of a distraction, Atkins said, once the leadership race had ended. But that distraction is now done, for the good of this caucus and the good of this house. Rendons district includes Hawaiian Gardens, Bell and South Gate. Before his election in 2012, he was executive director of a nonprofit child-services organization. He also served as interim executive director of the California League of Conservation Voters. melanie.mason@latimes.com, phil.willon@latimes.com, Twitter: @melmason, @philwillon, Follow@melmasonon Twitter for more on California government and politics. 7:05 p.m. Sept. 4: This post has been updated with additional reaction to Rendons appointment. 6:48 p.m. Sept. 3: This post has been updated with more information about the leadership transitions. 5:25 p.m. Sept. 3: This post has been updated with additional details, including comments from the next Assembly speaker, Anthony Rendon, and current Speaker Toni Atkins. The first version of this report was published at 4:46 p.m. Sept. 3.]", "Date": "20150905", "Author": "[Melanie Mason, Phil Willon]", "Link": "http://www.latimes.com/local/political/la-me-pc-assembly-speaker-vote-20150903-story.html", "Title": "[California milestone: 2 top legislative leaders will be Latino for first time]"}