{"Content": "[ In a large and varied Republican field, there may not be a more confounding presidential candidate than Tuesdays entry, John Kasich. In the 1990s, he was part of the conservative revolution on Capitol Hill. As governor of Ohio for the last four-and-a-half years, he has cut income taxes and government regulation, battled organized labor and approved new restrictions on abortion and voting rights. Trail Guide: 2016 presidential campaign >>, He also spared several inmates from execution, supported higher taxes on cigarettes and fracking of natural gas deposits and horrified many conservatives by expanding healthcare access under the Affordable Care Act, throwing in a lecture on what it means to be a good Christian. When you die and get to the meeting with St. Peter, hes probably not going to ask you much about what you did about keeping government small, Kasich said. But hes going to ask what you did for the poor. You better have a good answer. His political unpredictability, late start in the race and relatively meager fundraising make Kasich a distinct underdog in the GOP contest. He may not even qualify for the first GOP candidates debate next month in Cleveland. But Kasich insisted Tuesday that he has defied long odds throughout his career and offers a set of skills that no other candidate can match. I know what needs to be done, he said at a kickoff rally in Columbus, at his alma mater, Ohio State. Ive been there at all levels, OK?, Delivered in his characteristic plain-spoken style, Kasichs long, meandering speech spoke of the economic anxiety many Americans feel and the disillusionment of African Americans convinced the system is stacked against them. Frequently invoking his faith, he said society too often substitutes harsh judgment for care and compassion. He offered few policy specifics beyond a summons to ignore party labels and work toward solutions. Policy is more important than politics, ideology or any of the other nonsense we see, Kasich said. The appearance in front of 4,000 cheering supporters distilled the candidate to his essence: It was unscripted, ambitious, scattered and often assertively blunt. Indeed, one of the largest questions surrounding Kasichs candidacy is a personal one:, Is he too abrasive to be elected president?, Stories abound of his gruff persona, of a prickly meeting with local reporters in New Hampshire, which holds the first primary; of lashing out at a wealthy GOP donor who questioned his embrace of Obamacare; of threatening lobbyists in Columbus, the state capital, if they obstructed his efforts. If youre not on the bus, well run over you with the bus, he told them two days after he was elected governor. And Im not kidding. Kasich doesnt apologize for his rough manner, citing his blue-collar upbringing in an industrial town outside Pittsburgh. Were pretty direct where we come from, he said at a recent news conference, adding, At the end of the day, its results. Did people feel lifted? Did they feel included?, Kasichs willingness to break with conservatives, by, among other things, defending the federal education standards known as Common Core and backing a path to citizenship for people in the country illegally, ensure he will, at the least, stand out. Whether that is a good thing remains to be seen. His backers say Kasich exhibits an unflinching, unbeholden style that voters, tired of the political same-old, will appreciate. Theres a freshness and authenticity, said Curt Steiner, a longtime GOP strategist in Columbus. Hes not a cookie-cutter candidate. Some Republican activists, which is to say those most likely to vote in the partys nominating contest, take a less-kind view. Kasich has at times gone out of his way to poke his fellow Republicans in the eye, said the conservative National Review, in a story assessing Kasichs presidential hopes. Many may be scratching their heads and asking: Is he serious? And, if so, why bother?, At age 63, Kasich is making his second try for the White House. He waged a short-lived campaign in 1999 but, by his own admission, was too young and inexperienced to take on, much less defeat, the overwhelming front-runner, Texas Gov. George W. Bush. In Congress, where he represented central Ohio for 18 years, Kasich built a reputation for fiscal conservatism; as chairman of the House Budget Committee, he worked with President Clinton to balance the federal budget for the first time in a generation. Even then, Kasich broke with many in his party, voting for an assault-weapons ban, opposing corporate welfare and fighting defense spending he deemed wasteful. After leaving Congress in 2001, Kasich hosted a program on Fox television and worked as a managing director at Lehman Bros. until the Wall Street firm collapsed in 2008. He returned to office in 2010 when he was elected Ohio governor in a close race. Four years later, Kasich romped to reelection against a weak opponent, winning 86 of Ohios 88 counties, including the Democratic strongholds surrounding Cleveland, Akron and Toledo. Part of his appeal as a presidential candidate, at least on paper, is his political strength in a state that Republicans almost certainly need to win the White House. His 55% approval in a February survey is a notable contrast with some of his rivals, including Wisconsin Gov. Scott Walker, who are seen more negatively than positively back home. Ohioans have grown accustomed to Kasichs sometimes raw, blunt-spoken style -- sort of like the crank at the local coffee shop, said John Green, who teaches political science at the University of Akron. Hes got a lot of strong opinions, Green said, but hes not seen as mean-spirited. Kasich doubtless benefits from Ohios economic recovery; while its debatable how much credit the governor deserves, he boasts of turning an $8-billion deficit into a $1.5-billion surplus and brags of a significant drop in the jobless rate, to 5.2% in June. But its not clear how indulgent those just getting to know Kasich might be. Last year, at a donor conference sponsored by the conservative Koch brothers, Kasich angrily rebuked a major GOP contributor who challenged his decision to expand Medicaid under the federal healthcare law. According to a Politico account of the episode, which happened behind closed doors, Kasich pointed a finger, raised his voice and repeated his admonition about arriving at the Pearly Gates in good stead. Another Koch brothers gathering is planned next month in Columbus. The scheduled speakers include Republican presidential hopefuls Jeb Bush and Marco Rubio of Florida, Texans Ted Cruz and Rick Perry and Louisianas Bobby Jindal. Notably absent from the lineup: home-state Gov. Kasich. Follow  @markzbarabak on Twitter fornational and California politics. ALSO:, Just how black is Bernie Sanders?, Obama pushes to extend gun background checks to Social Security, Parents are campaign-trail rivals, but Ivanka Trump and Chelsea Clinton are pals, 12:05 p.m. This article was updated with quotes from John Kasichs announcement speech. The first version of this article was published at 3 a.m.]", "Date": "20150721", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/la-pn-kasich-2016-20150721-story.html", "Title": "[Ohio's John Kasich enters GOP race, bringing heat, intrigue]"}