{"Content": "[ Democrats will sanction six presidential primary debates, the party announced Tuesday in a move welcomed by Hillary Rodham Clinton, the front-runner for its 2016 nomination. Clintons presence as the heavyweight with few challengers had led to speculation that the party might forgo debates altogether. Weve always believed that we would have a competitive primary process, and that debates would be an important part of that process, said Rep. Debbie Wasserman Schultz, chairwoman of the Democratic National Committee. The debates, which will begin this fall and be held in some early primary and caucus states, stand to help Clintons potential challengers by offering opportunities to confront her directly and to build their public profile. For Clinton, there is less of abenefit politically: She could be forced to speak to issues that she would rather avoid staking out positions on because they give Republicans fodder to attack her. Still, on Tuesday, she seemed game to participate, though she was noncommittal as to how many debates she would attend. \"While GOP debates the same failed policies, Democrats will debate how to help families get ahead. Looking forward to a real conversation,\" she said on Twitter. Sen. Bernie Sanders, a Vermont independent who will run as a Democrat, is the only other competitor who has formally announced his candidacy for the partys nomination. Former Maryland Gov. Martin OMalley, former Virginia Sen. Jim Webb and independent former Rhode Island Sen. Lincoln Chafeeare also seriously considering a run. Our debate schedule will not only give Democratic voters multiple opportunities to size up the candidates for the nomination side-by-side, but will give all Americans a chance to see a unified Democratic vision of economic opportunity and progress  no matter whom our nominee may be, said Wasserman Schultz. But within the requirements the party set up is an exclusivity clause that bans candidates from participating in any non-sanctioned debates -- a move that upset some of them. Lis Smith, a spokeswoman for OMalley, said that should he run, \"we will expect a full, robust, and inclusive set of debates.\", \"This has been customary in previous primary seasons. In a year as critical as 2016, exclusivity does no one any favors,\" Smith said in a statement. In 2008, with a much more competitive field, Democrats sanctioned six debates, but allowed candidates to take part in outside debates. That year, the candidates took part in more than 20. Republicans, who could see a presidential primary battle with nearly a dozen candidates, have sanctioned nine to 12 debates and also barred participants from appearing in outside debates. In 2012, the GOP debates dragged along and battered the partys eventual nominee, Mitt Romney, with hits that made him more vulnerable in the general election.  Follow @kurtisalee and email kurtis.lee@latimes.com]", "Date": "20150505", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-democrat-sanctioned-debates-20150505-story.html", "Title": "[As 2016 heavyweight, Hillary Rodham Clinton will debate challengers ]"}