{"Content": "[ Congressional Republicans on Wednesday warned that net neutrality regulations expected to be approved by the Federal Communications Commission will cause years of legal uncertainty for the Internet and that the GOPs more restrained legislation on the contentious issue was the best way to address the issue. What the FCC is most likely going to vote on tomorrow is net nonsense, said Rep. Joe Barton (R-Texas). Its not going to work. It is going to be tested in court, and its going to fail in court. But some experts testifying at a House Energy and Commerce subcommittee hearing Wednesday said it probably would be at least three years before federal judges ruled on telecommunications companies promised challenges to the regulations. That lengthy period could harm investment in expanding broadband networks and put net neutrality protections at risk because the FCC could be controlled by Republicans after the 2016 election. Im concernedthat if Congress does not act, all protection for network neutrality is at risk of being lost, said Rick Boucher, a former Democratic congressman from Virginia who now chairs a telecomindustry trade group called the Internet Industry Alliance. FCC Chairman Tom Wheeler has proposed tough rules for online traffic, including prohibiting broadband providers from charging websites for faster delivery of their content, that depend on classifyingbroadband Internet service as a more highly regulated service under telecommunications law. The move would put broadband in the same utility-like legal category as conventional phone companies, reversing an FCC decision in 2002 classifying it as a more lightly regulated information service. Wheeler and supporters of his plan said the move would provide the best strategy to ensure thatthe rules are not tossed out in court. Twice before, FCC net neutrality rules have been overturned after industry lawsuits. The most recent ruling, in January 2014, said the FCC overstepped its authority by trying to treat Internet service providers as more highly regulated utilities even though the agency hadnt classified them that way. With the Democratic-controlled FCC set to approve Wheelers proposal on a party line 3-2 vote, Republicans said their proposed legislation was a better solution that would ensure basic net neutrality protections but avoid the risks of more expansive agency authority. A legislative answer to the net neutrality question will finally put to rest years of litigation and uncertainty, said Rep. Fred Upton (R-Mich.). Upton, Rep. Greg Walden (R-Ore.) and Senate Commerce Committee Chairman John Thune (R-S.D.) have introduced legislation that would prohibit the practices Wheeler has targeted, including paid prioritization of content, but without giving the FCC the broader authority over Internet service providers contained in his proposal. The legislation would clarify the FCCs authority and avoid legal challenges asserting the agency is overstepping its bounds. The bill is a major concession by Republicans, who for years resisted calls for net neutrality rules because they said they were not needed. But Democrats have dismissed the legislation, saying it would limit the FCCs ability to police the Internet for abuses, and have describedWheelers planas the best approach. I really dont think we should be deciding what to do here based on who we think is going to sue who, said Rep. Frank Pallone (D-N.J.), who noted Republicans traditionally havewanted to limit the ability of people to file lawsuits. The Republicans appear to be more litigious these days than our side of the aisle, he said, pointing to recent GOP legal challenges of President Obamas policies. Rep. Anna Eshoo (D-Atherton), said the Republican net neutrality bill has a distance to go before it can attractDemocraticsupport. She and other Democrats said it was time for the FCC to act. The country has waited long enough, said Rep. Yvette Clark (D-N.Y.). The hearing gave lawmakers one last chance to weigh in on the contentious net neutrality issue beforethe FCC vote. Asecond hearing on the topic by the House Oversight and Government Reform Committee, which also was scheduled for Wednesday, was postponed because Wheeler declined to appear. Rep. Jason Chaffetz, (R-Utah), chairman of the Oversight committee, had asked Wheeler to testify about the relationship between the FCC and the White House. \"As Chairman Wheeler pushes forward with plans to regulate the Internet, he still refuses to directly answer growing concerns about how the rules were developed, how they are structured and how they will stand up to judicial scrutiny,\" Chaffetz and Upton said in a statement Wednesday. \"After hearing from over 4 million Americans on such an important topic to our economic and cultural future, its striking that when Congress seeks transparency, Chairman Wheeler opts against it,\" the lawmakers said. The FCC said the majority of the 4 million public comments received by the agency urged it to take the tough steps Wheeler is proposing. In November, President Obama publicly urged the FCC to take that approach. An initial, less restrictive proposal last spring from Wheeler, a Democrat appointed by Obama, could have allowed broadband providers to charge websites for faster content delivery. Wheelers latest proposal closely tracks Obamas request. The Oversight committee and a Senate panel are investigating whether Obama administration officials improperly influenced Wheelers proposal. The FCC is an independent agency. An FCC spokeswoman did not respond to a request for comment on Wheelers decision not to appear at Wednesdays Oversight committee hearing. For breaking economic news, follow @JimPuzzanghera on Twitter, 9:50 a.m.: This post has been updated with comments from the hearing. The original version of this post was published at 7:32 a.m.]", "Date": "20150225", "Author": "[Jim Puzzanghera]", "Link": "http://www.latimes.com/business/la-fi-net-neutrality-fcc-hearing-20150225-story.html", "Title": "[House Republicans say their bill is best way to address net neutrality]"}