{"Content": "[ The wonderful thing about Californias direct democracy process is that any citizen with an idea and $200 can propose a new law for the statewide ballot. Of course, sometimes thats not so wonderful. Some proposals are not just bad, but awful, and the low barrier to entry means they occasionally get on the ballot. Witness Proposition 8, which banned gay marriage, and Proposition 187, which denied public services to illegal immigrants. Both became law but later were ruled unconstitutional. Most of the time, however, that doesnt happen. The initiative process has built-in checks and balances that usually stand in the way of silly, crazy, abusive or unconstitutional measures. Since the citizen initiative process began in 1912, only 25% of the more than 1,800 ballot proposals cleared for circulation (allowing proponents to circulate petitions and gather signatures) have qualified for the ballot. Of the 363 propositions that made it to a ballot, only 123 were approved by voters. That winnowing suggests that existing barriers prevent most faulty propositions from becoming law while protecting citizens rights to direct democracy. Yet not every one agrees. Two bills aimed at making it more difficult for the public to get propositions onto ballots are gaining traction in Sacramento. AB 1100, by Assemblymen Richard Bloom (D-Santa Monica) and Evan Low (D-Campbell), would raise the filing fee for ballot initiatives from $200 to $8,000, which they say better reflects the cost of processing a proposal. (The fee hasnt changed since 1943.) Not only is that unnecessarily steep, but cost recovery was not what prompted the legislation. It was a reaction  an overreaction, actually  to the \"Sodomite Suppression Act\" filed earlier this year by an Orange County attorney that would outlaw homosexuality and mandate execution of gay people. That proposal is so ridiculous and horrible that it has virtually no chance of gathering 365,880 signatures from registered voters to qualify for the ballot. If it reached the ballot, it wouldnt pass. Low doesnt even want laws like this to be proposed and says a higher filing fee would deter \"frivolous proposals from being submitted.\" But its not the Legislatures job to pass judgment on the merits of an initiative. Thats up to the voters. And such a high filing fee would deter worthy proposals as well as bad ones. Its not the job of the attorney general, either. But it would be under AB 884, by Assemblyman Anthony Rendon (D-Lakewood). That bill would require the attorney general to stamp a big warning on any ballot proposal she or he considers a violation of an individuals rights under the state or U.S. Constitution. Think of the surgeon generals warning on cigarette packs. The problem is that constitutionality is sometimes in the eye of the beholder, and attorneys general are political creatures who might be inclined to use this new power on behalf of the proposals they like and against the ones they dont. Both bills have passed the Assembly and are headed to the state Senate, where they ought to be viewed with great skepticism. Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150529", "Author": "[The Times Editorial Board]", "Link": "http://www.latimes.com/opinion/editorials/la-ed-ballot-initiative-bills-20150529-story.html", "Title": "[Merits of ballot initiatives best left in hands of voters]"}