{"Content": "[ The theatrical drama of the first Republican debate Thursday focused on the man at center stage in Cleveland, Donald Trump, and the bombastic rhetoric he has used to propel himself to the front of the GOP field. But when the Republicans return to the same arena next summer for their convention, it is extremely unlikely that Trump will be the partys nominee, given that a wide swath of the party, particularly its elected officials, finds him unacceptable. So even as the Fox News moderators grappled with the billionaire real estate developer over his history of bankruptcies, past support for Democratic politicians and sometimes offensive statements, a separate and probably more consequential debate was taking place among the other candidates about which of two competing paths the party should follow to win the 2016 election. Four years ago, the 20 debates that the Republican candidates participated in consistently drove the party to the right. GOP leaders, looking back after the election, decided that the debates had harmed their eventual nominee, Mitt Romney, and vowed to avoid that this time. But in Thursdays debate, the partys continued division over which direction to take remained very much on display. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, One side looks at the partys dismal record in presidential elections  losing the popular vote in five of the last six  and the demographic tides and argues that Republicans need to reach out in order to appeal to a changing nation. The other side looks at the partys streak of victories in congressional and state elections, capped by a near-sweep of contested races in 2014, and says the key to victory is to reach in, to find ways to awaken what they see as a conservative majority just waiting for the right candidate to stir it to life. The tension between those two views ran through the debate. The three candidates from the countrys two most populous swing states, former Gov. Jeb Bush and Sen. Marco Rubio from Florida and Gov. John Kasich from Ohio, all base their campaigns on the outreach theory. So, too, does Sen. Rand Paul of Kentucky, though he emphasizes a different set of issues than the other three. On the other side stand Sen. Ted Cruz of Texas and Wisconsin Gov. Scott Walker, along with former Arkansas Gov. Mike Huckabee. Cruz and Walker both won their current jobs by organizing and motivating conservative voters, and both say they can repeat that strategy in a general election. Huckabee has based his campaign almost entirely on his appeal to evangelical voters. The difference between the two camps could be seen on one issue after another. On immigration, for example, Bush criticized those who \"talk about this as a wedge issue\" and defended his support for \"earned legal status\" for those in the country illegally. Walker, who has admitted changing his mind on the issue, emphasized the conservative slogan of \"no amnesty,\" insisting on the \"need to secure the border\" before any other reforms can be considered. Cruz turned the question into an opportunity to denounce Congress GOP leadership, with whom he has conducted an extended feud. \"We keep winning elections,\" Cruz said, but \"we dont have leaders who honor their commitments\" to a conservative agenda. Kasich, asked about same-sex marriage, noted that he had recently attended the wedding of a gay friend and added, \"We need to give everybody a chance  treat everybody with respect.\" The Supreme Court has ruled on the issue, he said, and \"well accept it.\", Huckabee, when asked about abortion, denounced the high court. \"The Supreme Court is not the Supreme Being,\" he said. Democrats have their divisions too, of course, with the partys left-wing activists pushing for greater efforts to redistribute income, tougher limits on big banks and stronger environmental regulations. But the splits among Republicans run deeper. About 1 in 3 people who identify themselves as Republicans do not have a favorable opinion of their party, a recent Pew Research Center survey found. By contrast, Democrats are far more unified, with just over 1 in 10 failing to have a positive opinion of their party. The divisions within the GOP repeatedly have hamstrung the partys congressional majority, undermining Speaker John A. Boehners authority in the House and challenging Majority Leaders Mitch McConnells power in the Senate. The split could become even more dramatic this fall as a fight over federal money for Planned Parenthood threatens to lead to a government shutdown. Many conservative strategists see that threatened fight as an opportunity  a way to rally core supporters by combining opposition to abortion with the GOPs message of limited government and restricting federal spending. In Thursdays debate, several candidates allied themselves with that sentiment, noting that they had cut off funds for Planned Parenthood in their states or favored doing so. But Republican establishment figures, including McConnell of Kentucky, see the conservative plan as an intolerable risk. They fear that the public, which polls show already sees the GOP as the more extreme party, will blame Republicans for any government shutdown. \"One of my favorite old Kentucky sayings is, Theres no education in the second kick of a mule. Weve been down this path before,\" McConnell said at a news conference hours before the debate. He was referring to previous shutdowns going back to the Clinton administration. How that tension within the party will be resolved will not be clear for at least six months, but Thursdays debate began the process. Until now, the GOP field has steadily grown. From here on, the winnowing begins. david.lauter@latimes.com, ALSO:, As GOP candidates debate, Clinton aides cheer Trump show, First GOP debate: Donald Trump gets the most attention, plus 10 key moments, Republican presidential debate: 17 compete for attention, with Trump at the center]", "Date": "20150807", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/la-na-gop-debate-analysis-20150807-story.html", "Title": "[Republican Party divisions nearly upstage Donald Trump in first 2016 debate]"}