{"Content": "[ At a polling station in San Fernando on Tuesday, the lights briefly went out. At Palisades Charter High School, a bomb threat on social media prompted an evacuation. But at the Luxe Sunset Boulevard Hotel on the edge of Brentwood and Bel-Air, one might call the ballot casting a five-star experience. Voters left their cars with the valet parkers, strolled past a Salvador Dal painting on their way to the ballot box and cast their votes as a harpist strummed in the background. People showed up to do their civic duty with diamond rings sparkling on hands clutching Michael Kors bags. Jan Honor has worked as a clerk at elections across L.A. County, but the hotel, she said, stood out. Theres no place like this in the whole country, she said. I would think we would have lines going out to Sunset Boulevard with people coming in to vote. Servers walked around the room offering voters and election volunteers lamb chops to nibble on. On their way out, voters grabbed to-go boxes of Chinese chicken salad. Nice way to vote, one woman said as she left. Most people get to vote in places like recreation centers, schools or community halls. But some polling places are more memorable than others. In South Los Angeles, voters cast ballots just steps from the historic Watts Towers. A polling place sign with an arrow pointing voters in the right direction hung from a light post whose base was decorated with colorful, mosaic tiles. Eva Duval, 74, said that politicians needed to take heed of her neighborhood. They need jobs out here, she said after voting near Simon Rodias creation of tile and concrete. Politicians need to take a tour of Watts and then theyll see. At one polling place, voters were entertained by mariachi musicians, and at the Westchester Villa senior living community in Inglewood, voters were greeted by a large orange flower arrangement and a crystal chandelier. But its unlikely a place could match the luxury of the Luxe. Efrem Harkham, the hotels chairman and chief executive, said celebrities have voted at the Luxe Sunset Boulevard Hotel. Voters get very special treatment, he said. If youre obligated to vote, do it in style. According to the California secretary of States office, it is illegal under state and federal law to offer incentives to voters only if it is done with the expectation that they will cast ballots for specific candidates or measures. Tim Miklaucic, 56, said he votes in every election, and has voted at the Luxe Hotel twice. Its unbelievable. It looks like a Beverly Hills spa resort, said Miklaucic, a Democrat. You cant even compare other polling places. Vikki Radow, 44, said she would have voted regardless of the atmosphere. I dont need a harpist, honestly. Im going to come vote either way, the Brentwood resident said. Everybody needs to vote. brittny.mejia@latimes.com, Times staff writersSamantha Masunaga, Trevell Anderson and Veronica Rocha contributed to this post.]", "Date": "20141104", "Author": "NULL", "Link": "http://www.latimes.com/local/lanow/la-me-ln-bel-air-hotel-luxury-voting-20141104-story.html", "Title": "[In Bel-Air, residents get 5-star voting with valet, lamb chops, harpist]"}