{"Content": "[ Im Davan Maharaj, editor of the Los Angeles Times. Uber and the sharing economy emerge as a rallying cry for Republican candidates; and the death penalty bumps up against governors who wont sign execution warrants. Here are some story lines I dont want you to miss today. #mailchimp-subscribe { font:14px Georgia,Serif; line-height: 30px;}, TOP STORIES, An Uber Election, Republican candidates are jumping on Uber, and not just for rides to the airport. The sharing economy is becoming a campaign issue.Republicans almost universally embrace the use of apps for renting drivers, apartments and most anything else. Democrats are loath to seem anti-tech, but theyve got a problem: Traditional worker rights and upstarts like Uber dont always mesh. The Dying Death Penalty, The death penalty is in retreat. Juries still hand it down, but the number of executions has plummeted. Moreover, four governors simply have said they wont sign death warrants. Among them is John Hickenlooper of Colorado, where James Holmes was just convicted of murder in the Aurora theater massacre. That raises some tough questions as his trial enters the penalty phase. Maximizing the Minimum, County Supervisors voted 3-2 to join L.A. in raising the hourly minimum wage to $15.There was backslapping and talk of \"fair wages\" and a win for the working poor. Problems remain, of course, like dozens of cities in the county that might not go along.And, as Columnist Steve Lopez notes, \"few politicians would know the first thing about how to get by on $15 an hour.\"Whats needed, he writes, is affordable housing. Snowdens Winter, Edward Snowden would like to come home, but not for jail. Its not going to happen. The National Security Agency contractor, who blew the lid off domestic spying and sparked a national debate, is still hiding in Russia. In some places, he has hero status. But in the U.S. polls show that even people who applaud his whistle-blowing dont like him-- hardly an atmosphere for clemency. Bed and Bad Breaks, The tragedy of children without safe places to call home is worsening in the U.S. As many as 2.5 million languish in cars, shelters, spare rooms and run-down hotels -- like the Country Inn in San Bernardino, where homelessness among public school children is around 9%. They live in the shadow of drugs and despair -- and they learn to look out for themselves. CALIFORNIA, -- L.A. residents have been saving water, but maybe not enough. Tighter lawn-watering limitsmay be coming. -- Gov. Jerry Brown trots out his \"troglodytes\" lineagain in a jab at climate change skeptics during a Vatican conference hosted by Pope Francis. -- The 10 Freeway east of Coachella,damaged in a weekend storm, will reopen Friday. -- A private group buys the land under the cross on Mt. Soledad, perhaps signaling the end of a long legal fight over church-state separation. NATION-WORLD, -- And then there were 16: Ohio Gov. John Kasich joins the Republican field running for president. -- Our new online Trail Guide feature is a quick way to keep up with the daily twists and turns of the 2016 campaign. -- President Obama, defending a nuclear deal with Iran, says critics are the same types who rushed the U.S. into the Iraq conflict. -- The Pentagon says a senior Al Qaeda leader was killed in a drone strike in Syria. BUSINESS, -- As gas prices soar, California refineries arereaping nice profits, state data show. -- Citibank agrees to refund $700 million to credit card customers for deceptive practices and other offenses. -- Federal regulators say LifeLockstill misleads consumers about the level of identity-theft protection it provides. -- Apples fiscal third-quarter profit and revenue beat expectations on record sales of iPhones and Macs. -- The FCC appears ready to approve AT&Ts purchase of satellite service DirecTV. SPORTS, -- The Clippers DeAndre Jordan plays it cool andsays hes ready to take the heat for the \"total fiasco\" with the Mavericks. -- The Los Angeles County Country Club will play host to the 2023 U.S. Open golf tournament. -- FC Barcelona beats the Galaxy 2-1 in exhibition soccer in Pasadena. The bigger story may be who wasnt there. -- The latest scores, stats and schedules. ENTERTAINMENT, --Taylor Swift leads the MTV Video Music Awards nominations. Heres a complete list of nominees. -- Less-political hosts could change the game forpolitical candidates on late-night TV. Passings: E.L. Doctorow,84, prominent American novelistwhose works included \"Ragtime\" and \"The Book of Daniel.\" Theodore Bikel, 91, prolific stage and screen actor who also sang in 21 languages. WHAT OUR EDITORS ARE READING, -- The author of \"TrumpNation\" writes a hilarious take about his legal tussle with Donald Trump over The Donalds various calculations of his wealth (Bloomberg View). -- Fifty years after Bob Dylan went electric,George Wein remembers Newport (Forward). -- Weather Undergrounds Jeff Mastersexplains what walloped California last weekend, and what a real hurricane could do. ONLY IN L.A. More than 1,000 pistols, rifles and scopes. Two tons of ammunition. In an SUV down the street, a body that had decomposed for two weeks. Whatever is going on in Pacific Palisades? Police would sure like to know. \"Bob,\" as the neighbors knew him, claimed to work covertly for the CIA or FBI. Who was he really?This is one wild head-scratcher. Please send comments and ideas to Davan Maharaj.]", "Date": "20150722", "Author": "NULL", "Link": "http://www.latimes.com/local/la-me-todays-headlines-html-20150722-htmlstory.html", "Title": "[Today: An Uber Election. The Dying Death Penalty.]"}