{"Content": "[ As next months midterm elections near, politicians from both sides of the aisle are swarming California to boost their parties fortunes in contests that could decidethe balance of power in Washington -- and to forge relationships in advance of the 2016 presidential race. By virtue of its deep-blue Democratic tilt, California hasnt been terribly competitive in presidential contests since 1988. But politicians have long been drawn by the states deep trove of wealthy donors, both Republican and Democratic. This week will prove that little has changed in the nearly half a century since legendary California lawmaker Jesse M. Unruhdeclared that \"money is the mothers milk of politics.\", On Monday, Vice President Joe Biden is scheduled to speak at a fundraiser for the Democratic Congressional Campaign Committee -- featuring a performance by singer Carole King at the 20th Century Fox lot -- before headlining a Hollywood-studded evening fundraiser with House Minority Leader Nancy Pelosi. On Tuesday, Biden is to hold a roundtable discussion with Los Angeles Mayor Eric Garcetti before heading to the Central Valley for events with California candidates. The following day, Sens. Rand Paul, Orrin Hatch and John Thune are set to headline a reception for the National Republican Senatorial Committee at the Bay Area home of Oracle co-founder Larry Ellison. On Thursday, Angelenos will likely be bracing for gridlock created by President Obamas scheduled arrival for aDemocratic National Committee fundraiser at the home of actress Gwyneth Paltrow. Hes then to head to San Francisco for two days heavy with fundraising. Most of the events, whether Republican or Democratic, will raise money that will be spent in states far from California. But some of the prominent visitors, notably House Speaker John Boehner, will betrying to help out candidates in the Golden State. The Ohioan is scheduled to spend several days here, beginning Monday, to raise money for multiple candidates who could tighten the GOPs hold onCongress -- including Carl DeMaio in San Diego, who is in a tight race with freshman Democratic Rep. Scott Peters. On the Democratic side, Senate Majority Whip Steny Hoyer is to be the guest of honor during a luncheon fundraiser at the Los Angeles Athletic Club for Ted Lieu, who is hoping to win retiring Rep. Henry Waxmans seat in the fall. Given the states importance in national fundraising, some of the visitors will be greeted withspeculation about their future plans. Paul, the Republican senator from Kentucky, has been spending a significant amount of time in California, meeting with donors who could help power a 2016 presidential bid. And former Secretary of State Hillary Rodham Clinton is heading back to the Los Angeles area later this month. She plans to raise money for the Democratic Senatorial Campaign Committee at an event headlined by movie industry mogul Jeffrey Katzenberg. The longtime Democratic donor is expected to be a major fundraiser for the former first lady if she mounts a White House bid in 2016. Follow@LATSeemafor political news]", "Date": "20141006", "Author": "[Seema Mehta]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-fundraising-politicians-california-20141006-story.html", "Title": "[Ready, set, traffic: Fundraising politicians to swarm California ]"}