{"Content": "[ There was a man missing from Jeb Bushs foreign policy speech Tuesday night at the Ronald Reagan Presidential Library -- the man who started the war in Iraq that Bush essentially blamed on those who inherited it, namely President Obama and his first secretary of State, Hillary Rodham Clinton. The missing man was Jeb Bushs older brother, former President George W. Bush, whose role went unspoken. Jeb Bush castigated Obama and Clinton for their handling of Iraq, and specifically for getting American troops out -- a move that was as wildly popular at the time as George W. Bushs war was unpopular. The difficulty in ignoring history means you end up with logic like this:, \"Who can seriously argue that America and our friends are safer today than in 2009, when the President and Secretary Clinton -- the storied team of rivals -- took office?\" Bush asked. \"So eager to be the history-makers, they failed to be the peacemakers. It was a case of blind haste to get out, and to call the tragic consequences somebody elses problem. Rushing away from danger can be every bit as unwise as rushing into danger, and the costs have been grievous.\", TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, And if it appeared that Bush was going to detail who rushed \"into danger,\" he did not. He simply said: \"All of that is in the past; it cannot be undone.\", He veered close to a discussion of his brothers role elsewhere in the speech -- or so it seemed for a moment. \"No leader or policymaker involved will claim to have gotten everything right in the region, Iraq especially,\" he said. Then, too, the subject could have turned to George W. Bush and how this Bush might differ from the last. But there would be no discussion of how the war began, or why; Bush skipped to criticizing Obamas decision to pull Americans out of Iraq after a surge of troops sought to take control of the country. He described the \"premature withdrawal\" -- not the decision to wage war -- as \"the fatal error.\", He suggested a wholesale assault on Iraq and Syria to curb what he described as a \"pandemic\" spread of radicalism that has drawn recruits from around the world. Included in his proposals was the overthrow of Syrian leader Bashar al-Assad, but Bush warned: \"We have to make sure that his regime is not replaced by something as bad or worse. The last thing we need in Syria is a repeat of Libya, with its planless aftermath, where the end of a dictatorship was only the beginning of more terrorist violence, including the death of four Americans in Benghazi.\", Unmentioned were the implications of knocking off the strongman who led Iraq, whose absence -- along with the absence of the Iraqi army, dispersed by the Bush administration -- contributed to the rise of the terrorists Jeb Bush deplored. The notable omissions in a speech meant to stake out his approach to world issues spoke to a difficulty at the heart of Jeb Bushs campaign: He cant really mention the role of his brother, whose foreign policy moves remain unpopular even as he has benefited, as all presidents do, from a certain post-presidency boost in popularity. And to dump on him would seem disloyal. But when George Bush goes missing, it only seems to highlight the past in bright neon and beg for some accounting of how the future under Jeb would be better. Both he and Clinton are burdened, to some extent, by family connections as they seek the White House. But while Clintons political skills pale in comparison to her husband Bills, she has an edge: Bill Clinton left the country under an ethical stain but with a booming economy. George Bush left under criticism for an unpopular war, and with a cratering economy. The latest Bush on the stage seemed to suggest that America as a whole is leaning in the direction of George W. Bushs foreign policy, but that appears to be an iffy proposition. Americans overall remain concerned about threats from Islamic terrorists but worried about greater U.S. involvement overseas, especially those that require in-country forces.The coffins returning home are not a distant memory. Some polling suggests that Bushs real audience is members of his own party, more than anyone else. Pew surveys in 2013 and 2014 found a huge surge in the percentage of Republicans who felt the U.S. exerted little authority overseas. Among Democrats and independents, there was only about a third of the hawkish movement found among Republicans. On Tuesday, Bush seemed to acknowledge American reluctance to become more assertive, as he invoked the spirit of Ronald Reagan in suggesting that America would get over it. \"Weariness with conflict ran pretty deep back then, along with despair of ever getting past it,\" he said in a passage that, curiously, credited Reagan with the fall of the Berlin Wall, which came down during his fathers presidency. \"But then along came one formidable figure, who would not accept that way of thinking, and he was the one who mattered the most.\", Bushs father -- who presided over the far more popular invasion of Iraq in 1991, during which he left Saddam Hussein in control in part to maintain stability in the region -- was, like George W. Bush, an unspoken presence in Jeb Bushs speech, and a familial complication of a different sort. George H.W. Bush famously commanded his Iraq war in the template of allied cooperation that had marked past world wars. He worked with foreign leaders to craft a near-unanimous assault against Iraq; the international accord went a long way toward assuaging political criticism at home. It was a far more collegial approach, with little of the my-way-or-the-highway feel of George W. Bushs. But on Tuesday night, the formidable alliances forged by his father were cast aside. \"Were not part of the community of nations,\" Jeb Bush said. \"We cant lead from behind. We have to lead.\", For political news and analysis, follow me on Twitter: @cathleendecker. For more on California politics, go to latimes.com/decker. MORE ON POLITICS, Why a huge Los Angeles crowd turned out for Bernie Sanders, Hillary Clinton will turn over private email server to Justice Department, Jeb Bush says Hillary Clinton played crucial role in Iraqs decline]", "Date": "20150812", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/nation/politics/la-na-jeb-bush-analysis-20150812-story.html", "Title": "[In Jeb Bush's foreign policy speech, George W. Bush goes missing]"}