{"Content": "[ Despite Republican charges that he has abused his authority, President Obama said Wednesday he wont dial back his use of executive power to advance his political agenda without help from Congress. The American public doesnt want him sitting around twiddling my thumbs, Obama said in a wide-ranging news conference. He reiterated his plans to order executive actions on immigration, and said he was considering ways to discourage corporations from moving some operations overseas to avoid U.S. taxes. Obama, who leaves Saturday for a family vacation on Marthas Vineyard, spoke for 45 minutes as he ended an unusual three-day summit of about 50 African leaders in Washington. He promised increased medical assistance, food security and counter-terrorism support to Africas emerging economies at an event intended to help spur trade and investment with the continent. Obama decried the growing Ebola outbreak in West Africa, urged Russia to seek a political solution in Ukraine and said he had no sympathy for Hamas in its battle with Israel. But he also faced questions about his domestic political plans as the midterm election season begins heating up. Before leaving town last week, the Republican-led House approved funding to file a federal lawsuit expected to claim that the president has overstepped his constitutional limits by failing to enforce his healthcare law as it was written. Few experts think the lawsuit will survive judicial scrutiny, and few House Republicans actually want Obama to enforce his healthcare law. But Republican attacks on Obamas imperial presidency are likely to be a staple on the campaign trail. The president, who has mocked the threatened lawsuit as political chicanery, offered a more earnest defense of his executive decisions Wednesday. He acknowledged his legal limits. I never have a green light. Im bound by the Constitution. Im bound by separation of powers, Obama said. What I am consistently going to do, wherever I have the legal authorities ... Im going to seize those opportunities, Obama has said he plans to take executive actions to ease deportation of immigrants who are living in the country illegally, following up on his 2012 order to allow so-called Dreamers  immigrants who were brought to the country illegally as children before 2007 and who have committed no crimes  to apply for deportation waivers. His administration now is exploring ways to expand that program to the Dreamers parents and perhaps others. Obama also said he is looking for ways to prevent U.S. corporations from shifting their headquarters overseas for tax purposes. The maneuver  called an inversion  is allowed under corporate tax law and is being employed with increasing frequency. On Wednesday, Obama called it not fair  not right. Obama has called on Congress to change the law soon. But he said hes not hopeful lawmakers will take up the issue. The Treasury Department is reviewing options to find a way to prevent the practice, he said. Inversion transactions allow U.S. companies to reincorporate overseas, either through a merger or purchase of a foreign entity, and thus avoid paying U.S. taxes on foreign earnings. The practice is often used by companies that retain major facilities and continue to do much of their business in the U.S. Changing tax law to bar the practice would generate an additional $19.5 billion in tax revenue over the next decade, the White House says. kathleen.hennessey@latimes.com, christi.parsons@latimes.com]", "Date": "20140806", "Author": "[Kathleen Hennessey, Christi Parsons]", "Link": "http://www.latimes.com/nation/la-na-obama-immigration-20140806-story.html", "Title": "[Obama says Americans don't want him 'twiddling my thumbs']"}