{"Content": "[ Over the past few days, the field of declared 2016 presidential candidateshas picked up a few more names, each announcement quickly detailed and closely analyzed. Does getting bounced from her seat running Hewlett-Packard, and conducting a solitary and abysmal U.S. Senate campaign, make Carly Fiorinaa serious contender? What about Mike Huckabee, the former Arkansas governor and TV host who already failedin his first bite at the presidential apple? Is former neurosurgeon Ben Carsonin over his head?, For those who follow politics like a spectator sport, these incremental news items are tidbits to be savored. For most of the rest of the country, they are tedious and irrelevant developments in an endless cycle of campaigning. But to the New York Review of Books Elizabeth Drew, the campaign minutiae distractfrom the more important story of the three dangers threatening the American electoral system: voting restrictions, redistricting, and loose rules on large amounts of money being spent to influence voters. In recent years, weve been moving further and further away from a truly democratic election system. In the first of a planned two-part essay, Drew dives into the background of Republican efforts to restrict voting in various states, their successful cornering of state elections, and the effects that has had, and will continue to have, on redistricting. The electoral system has been gamed before our very eyes, but because it has happened slowly, it seems to have gone largely ignored by political reporters focusing on the daily churn (to which I also must plead guilty as a former political campaign reporter). The fix has been put in with the help of the Supreme Court, which gutted the Voting Rights Actand has endorsed voter-IDlaws that are, at best, a solution to an imaginary problem. By the time of the 2014 elections twenty-one states had enacted new restrictions on voting rights, Drew writes. Following the Republican triumphs in the state elections in 2014, forty new voter restrictions were introduced in seventeen states during the first few weeks of 2015 alone. By now, according to the National Council of State Legislatures, a total of thirty-four states have adopted some sort of voter ID law, and as of late March of this year thirty-two such laws were in effect. For years, Republicans were more alert than Democrats to the many opportunities provided by controlling governorships and state legislatures. Right now, the Republicans are in total control of twenty-four states whereas the Democrats have total control of only seven. The lesson seems to be that once Republicans get total power at the state level, they find a way to rig the rules to keep the other sides strongest constituencies from voting. As a strategy for maintaining political power, its both shrewd and cynical, and perhaps worthy of grudging admiration for its effectiveness. But the impact on the integrity and quality of elections threatens the very nature of our democracy. More from Drew:, What is now clear is that the efforts in many states to fix the outcome of the vote by keeping Democratic constituencies from voting have been largely successful. With the white share of the voting population dropping in such swing states as Florida and Nevada, both of which Obama won narrowly in 2012, and North Carolina, which Obama narrowly lost, the Republicans are all the more anxious to hold down the number of black and Latino votes. Laws restricting peoples voting rights will continue to be passed until the pattern becomes too obvious for even the Supreme Court to ignore, or we get a different Supreme Court, or enough people wake up to whats going on and see that democracy is being curtailed. For the time being we cannot expect Congress to help. In fact, we can only help ourselves. But a low sense of political efficacy and a general malaise about the American electoral system suggests we wont. And so the gaming will continue, and the democracy will recede. Follow Scott Martelle on Twitter @smartelle.]", "Date": "20150506", "Author": "[Scott Martelle]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-campaigns-voting-rights-democrats-republicans-20150506-story.html", "Title": "[While we focus on candidates, we lose sight of threats to democracy]"}