{"Content": "[ The embers of Watts had cooled as Ronald Reagan raced toward his first election as Californias governor, a year after riots scarred southern Los Angeles. Yet Watts remained an ominous political presence. As Reagan took on two-term incumbent Pat Brown in what was then an overwhelmingly white and culturally conservative state, Watts and other emblems of the era  civil rights battles, Vietnam War protests and counterculture elbow-throwing  contributed to a frightening sense that California was spinning out of control. Voters reacted to the chaos by embracing a new wave of conservatism that swept Reagan into the governors office and paved his way to the White House. In California, the conservative tide would rise for a generation: Reagan begat George Deukmejian and Pete Wilson, 24 years of Republican governors in a 32-year stretch. The backlash spread beyond Californias borders as well. Aug. 13, 1965: Los Angeles police officers stand guard at Avalon Boulevard and Imperial Highway, near Watts. , Aug. 13, 1965: Los Angeles police officers stand guard at Avalon Boulevard and Imperial Highway, near Watts. , Gov. Pat Brown, left, on \"Meet the Press\" with challenger Ronald Reagan in 1966. , Gov. Pat Brown, left, on \"Meet the Press\" with challenger Ronald Reagan in 1966. , Two years after Reagan won the governorship, the same political winds helped propel Richard Nixon to the presidency  another beneficiary of an electorate worried about societal change and choosing the candidate who took a law-and-order approach. The Republican Party, buoyed by those put off by Democratic views on civil rights and the war, saw its ranks grow nationally. Watts was \"a turning point in a year of turning points, and one of the most important,\" said James T. Patterson, an emeritus history professor at Brown University and author of \"The Eve of Destruction,\" a book about the American transformation wrought in 1965. Yet, 50 years hence, the impact of Watts on Californias politics is negligible. Massive demographic changes have utterly remade the state, sweeping aside the eras Republican gains. In place of those who dominated the states politics in the years after Watts has risen a coalition of Democratic allies. They include Latinos, then such an official nonentity that their presence went unmentioned in census reports, Asian voters, socially liberal whites and African Americans  the most dependable voters on the left. All of that was unforeseen when a traffic stop in Watts put a torch to the city. On its own, Watts didnt defeat Brown, the governor who swept into office in 1959 and built many of the institutions that stand today, from the California Water Project to the states university and college system. As the riots hit, Brown was seeking his third term, a point at which voter adulation ebbs precipitously, and the previous years had been rocky. Student protests convulsed UC Berkeley, making it a national symbol of revolt. Brown, the father of Gov. Jerry Brown and the man who appointed the universitys leaders, bore the brunt. And while much of the activity in the burgeoning civil rights movement was occurring in the South, race reared in California as well. In 1963, Brown had supported and signed the Rumford Fair Housing Act, which outlawed discrimination in renting or selling property. Realtors mounted an initiative to rescind it, and the initiative won the support of two-thirds of California voters in 1964. The state Supreme Court kept the issue alive politically until ruling in 1966 that the initiative was unconstitutional. Then came Watts, a conflagration that began as the governor vacationed in Greece. By the time peace returned, 34 people were dead, a swath of Southern California was in ruins and residents throughout the state were jittery. Reagan entered the race in 1966 with a host of proposals that would seem familiar to a national audience in decades to come: a tax moratorium for retired homeowners, a study of the states tax structure, the removal of judges from \"the influence of partisan politics.\" And he hit hard on the conflict of the era. \"Will we allow a great university to be brought to its knees by a noisy dissident minority? Will we meet their neurotic vulgarities with vacillation and weakness, or will we tell those entrusted with administering the university we expect them to enforce a code based on decency, common sense and dedication to the high and noble purpose of the university?\" Reagan asked in his announcement speech. He demanded heightened police powers, and said that Californias urban streets had become \"jungle paths after dark.\", It was \"a racially laden reference to Watts that no one could possibly misconstrue,\" author Ethan Rarick wrote in his biography of Brown, \"California Rising.\", It was not the only time Reagan would use the line, or brush against matters involving race. He had forcefully opposed the Rumford legislation and defended the initiative that repealed it. In a 1966 speech to the Realtors who had launched the initiative, he said the anti-discrimination act \"invaded one of our most basic and cherished rights  a right held by all our citizens  the right to dispose of property to whom we see fit and as we see fit.\", Some of the people who supported the initiative \"were expressing bigotry and racial prejudice, \" Reagan said, but added, \"I am sure that the majority did so because government was invading a constitutional right.\", In his 1980 campaign for president, Reagan kicked off his post-convention swing with an appearance near Philadelphia, Miss. where three young civil rights workers had been found dead 16 years earlier, in a famous slaying attributed to members of the Ku Klux Klan and local law enforcement officers. Reagans speech segued directly from a denunciation of welfare to wording used by segregationists: \"I believe in states rights,\" he said. Stu Spencer, the political strategist for Reagans gubernatorial and presidential bids, said the language used by Reagan had no racial import. \"He was not a bigot in any sense of the word,\" Spencer said. The 1966 jungle metaphor \"was a nice dramatic statement\" aimed at voters worried about rising crime, he said. As Spencer noted, Reagan did not speak often about Watts. \"Reagan didnt jump on it like a demagogue and milk it,\" he said. \"He really pointed to campus unrest. He kept pounding it. That was the overriding issue in many ways, I have always felt.\", Still, events kept Watts in voters minds. In March 1966, another riot broke out in Watts; two died. And just before the November election, rioting exploded in a black neighborhood in San Francisco. Brown broke off the campaign to tour the area, and Reagan dismissed him by saying the governor \"had not profited at all from the experience of Watts and has done nothing to forestall future disturbances in possible trouble spots.\", He also returned to welfare, saying Browns reelection would mean \"four more years of reckless welfare spending and no change in a welfare system whose only present purpose seems to be to perpetuate the dole and build a political machine.\", Brown asserted that Reagan was both \"riding\" and encouraging a \"white backlash.\", In an appearance on \"Face the Nation\" a few days before the election, Reagan replied that a backlash was \"nothing more than the concerns people have for  extremists in the civil rights movement taking to the streets, the use of violence, of demonstrations instead of an orderly process of appealing wrongs through legitimate channels.\" And he reiterated his objections to the anti-discrimination act and his line about urban streets becoming \"jungle paths.\", The San Francisco riot blunted a mini-comeback on Browns part, turning his long-shot effort into a rout for Reagan. Watts \"had a huge effect on the states political environment,\" said Brown biographer Rarick, the associate director of UC Berkeleys Institute of Governmental Studies. The era of violent protests and rioting deeply disturbed many Californians who had grown up in a more ordered society, Rarick said: \"It was one of several things that frightened a lot of people and made them uncomfortable and thereby helped fuel the rise of the conservative movement in California.\", That same instinct toward conservatism played out in Los Angeles in the first mayoral election after the 1965 riots  when incumbent Sam Yorty turned back a challenge from Tom Bradley  and after the 1992 riots, when the more conservative candidate, Richard Riordan, was elected to lead the city. (Bradley, a former police officer, would become the citys first African American mayor in 1973, eight years after Watts.), \"Reagan was looked upon as someone who could finally respond,\" said Boris Ricks, an assistant professor of political science at Cal State Northridge who was raised not far from the riots epicenter. \"Its just like after the civil unrest of 1992. Richard Riordan was elected because he was going to bring order back to the city. Ronald Reagan was going to bring it back to the state.\", In the half-century since Watts, the surge of new residents has altered the political profiles of Los Angeles and California. Bradleys 1973 election rested on coalition politics that linked African American voters with other groups; the citys new coalition features Latinos in a far more prominent role. The same is true of California, where only 8% of residents were nonwhite in the census before Watts; now more than 60% of the state is nonwhite. As before, political change is being driven by a reaction to events. Watts and 1960s protests once drove the state into conservatives arms. More recently, conservative positions have driven the state into Democratic arms. The country, in contrast, remains a far more competitive place: On the strength of the southern GOP brand developed by Reagan and Nixon  two Californians who ran law-and-order campaigns  the party owns the House and the Senate and remains competitive in the 2016 presidential contest. Not so in California, not any more. \"The state has changed so much,\" Rarick said. \"Once we were the people who gave Ronald Reagan to the nation. And now we elect only Democrats.\", cathleen.decker@latimes.com, Twitter: @cathleendecker. For more on politics, go to www.latimes.com/decker. Interested in the stories shaping California? Sign up for the free Essential California newsletter >>, MORE COVERAGE OF THE WATTS RIOTS, The riots explained: Traffic stop was the spark that ignited days of destruction, Steve Lopez: Eyewitness refuses to give in to discouragement, Then and now: Comparing the scenes from 1965 withtoday]", "Date": "20150805", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/local/politics/la-me-pol-watts-politics-20150806-story.html", "Title": "[Watts riots shifted state to the right, but new demographics pushed it left ]"}