{"Content": "[ Many members of Congress remain deeply skeptical of the landmark deal announced Tuesday to halt Irans nuclear ambitions but are unlikely to have the votes to stop it. While Democrats largely back President Obamas pursuit of an agreement to lift sanctions on Iran in return for measures to prevent the country from building nuclear weapons, Republicans, who have the majority in the House and Senate, say the administration should walk away from a deal they fear concedes too much. But in a promising sign for Obama, few Democrats stood up publicly Tuesday to oppose the deal and the partys presidential front-runner, Hillary Rodham Clinton, expressed support. The final outcome will probably turn on a core group of centrist Democrats in the House and Senate, along with a handful of Republicans, whose votes could determine whether the agreement holds. I think people are going to understand that were in a deteriorating situation in the Middle East, and this offers an opportunity to turn the page, said Sen. Dianne Feinstein (D-Calif.), the top Democrat on the Intelligence Committee. I know we have a lot of geniuses around here, but I would just hope that people would hold their fire. Clinton gave lawmakers similar advice during an unusual daylong series of private meetings with House and Senate caucuses on Capitol Hill, where she spoke favorably of the agreement reached with the U.S. Iran and other major countries. After the morning session with Clinton, Democratic Rep. Brad Sherman of Sherman Oaks, who has concerns about the deal, said lawmakers options are limited. We cannot be as tough as the tough guys want to be on Iran so long as the president of the U.S. supports this deal, he said. Youre trying to pressure and cajole and threaten Tehran from Capitol Hill. Congress has 60 days to vote on the agreement, keeping the issue at the forefront of congressional politics and the 2016 presidential campaign. House Speaker John A. Boehner (R-Ohio), who bypassed the White House earlier this year by inviting Israeli Prime Minister Benjamin Netanyahu to criticize the deal in an address to Congress, promised a fight. \"This isnt about Republicans versus Democrats,\" Boehner said. \"We will fight a bad deal that is wrong for our national security and wrong for our country.\", Although Congress may have enough votes to pass a resolution of disapproval, there would not likely be the two-thirds majority required to overturn Obamas promised veto, allowing the agreement to stand. Republicans are eager for a veto showdown over foreign policy with Obama, believing the public  or at least their constituents  would be on their side. Arkansas Republican Sen. Tom Cotton, who this year wrote a provocative public letter against the deal to the Iranian government, called it a \"grievous, dangerous mistake.\", But what became clear Tuesday was that although the Republicans in the House would almost certainly be able to pass the disapproval resolution under their majority-rules voting structure, the Senate outcome is less certain. In the Senate, a 60-vote threshold is needed to advance legislation over a filibuster. Although several key Democrats are deeply skeptical of the deal, the lack of immediate opposition from within the presidents party offered a potentially positive development for the administration as it tries to rally public support. \"First thing is to not tear down this agreement before the ink is even dry, before we even read it, said Sen. Bill Nelson (D-Fla.), among those who could sway the vote. Congress has a role now, by law, and its to thoroughly scrutinize the details of the agreement. Final votes are not expected until September, guaranteeing a lobbying blitz by the White House and the deals opponents, including Israel. Supporting or opposing this agreement is not a decision to be made lightly, and I plan to carefully study the agreement before making an informed decision, Sen. Charles E. Schumer (D-N.Y.) said. The 60-day clock does not start ticking until the administration sends the full agreement to Congress, which by law must be five days from striking the deal. The chairman of the Foreign Relations Committee, Sen. Bob Corker (R-Tenn.), is expected to launch hearings next week. \"I begin from a place of deep skepticism that the deal actually meets the goal of preventing Iran from obtaining a nuclear weapon,\" Corker said. \"Congress will need to scrutinize this deal and answer whether implementing the agreement is worth dismantling our painstakingly constructed sanctions regime.\", House Minority Leader Nancy Pelosi (D-San Francisco) welcomed the deal, but said Congress \"must maintain our vigilance.\", Theres a block of members here who will really decide whether this agreement is sustained or not, said Rep. Adam B. Schiff (D-Burbank). I would hope all of us give the pros and cons of this agreement serious consideration, and also look soberly at the alternatives. For the latest from Congress and the 2016 campaign, follow @LisaMascaro. 2:41 p.m.: The story was updated with additional background and reaction. The story was originally published at 9:39 a.m.]", "Date": "20150714", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/world/middleeast/la-fg-congress-reaction-iran-20150714-story.html", "Title": "[Some Democrats voice concerns on Iran deal but so far appear ready to support Obama]"}