{"Content": "[ Hillary Rodham Clinton wound down her political operation in 2008 with 2.5 million email addresses in her campaign database. Seven years later, when campaign officials turned on the lights in April, they were stunned to find fewer than 100,000 still worked. Campaign aides learned the bad news in much the same way a reunion organizer trying to reconnect with old friends might, albeit on a much larger scale: an inbox clogged with bounce-back messages on the day Clinton announced her campaign and sent messages to supporters. The huge attrition of valuable data is not unique to Clinton -- a typical email list will lose 1 in 5 subscribers each year, said Jordan Cohen, chief marketing officer for Fluent, which specializes in email list acquisition. But it created one of the first big challenges for the campaigns growing digital team, has played a role in limiting Clintons fundraising so far and sparked a response that illustrates the high priority campaigns now place on acquiring digital data. It wasnt like we all had time to retreat to a local bar and drown our sorrows, said Teddy Goff, the Clinton campaigns digital director  a role he also filled for President Obamas reelection campaign. It was an instantaneous recognition on the part of a lot of us that we had a bigger challenge ahead of us than we realized. The email problems helped account for a relative paucity of small donors to Clintons campaign so far. Finance reports filed Wednesday night with the Federal Election Commission showed that fewer than one-fifth of Clintons donors had contributed $200 or less, a significantly smaller level than President Obama achieved in his two campaigns. Having a large number of small donors is crucial to Democratic campaigns to offset the significant advantage the Republicans are likely to have with big-money donors. Because Clinton so far faces only limited challenges in the Democratic primaries, her campaign still has ample time to catch up. But rebuilding the digital infrastructure has become one of the most critical goals that campaign officials set this year, prompting what became known as the Hillbuilder program. During the campaigns first all-staff meeting, on the day before Clintons public campaign launch on Roosevelt Island in June, campaign manager Robby Mook identified building the email list as one of the top three goals in the years third quarter. On the cubicle walls of the offices used by the digital staff, a sign asks: What are you doing to grow the list today?, In 2012, Obamas reelection campaign, which boasted 30 million addresses at its peak, raised $485 million  more than 40% of its total haul  through its endless, and often parodied, email appeals, according to a former campaign official who provided the internal fundraising data on condition of anonymity. The rest of the fundraising total was split equally between major donors and direct marketing through traditional mail and phone contacts. Increasingly sophisticated methods for analyzing large amounts of data have made emails more and more valuable to campaigns, and not just as a vehicle for direct communication. The ability to track a users online experience helps the campaign develop a profile that is then used to send more-targeted communications. The campaigns are looking at not just are they going to contribute $1, $10 when I send them an email, but are they opening, are they clicking, are they forwarding this email to their friends. Are they taking the email and posting it onto social, Cohen said. There is just inherent value in having engagement that will lead, hopefully, into votes. The Clinton campaigns digital handicap wasnt limited to its email lists. The former secretary of State had no Facebook page, no Instagram account and only 3.3 million Twitter followers at her launch date (President Obamas campaign-run account has more than 60 million today, by comparison). The campaign would not disclose how much its list has grown since April. But it has reached 5 million followers across its accounts on Facebook, Twitter, Instagram, LinkedIn, Spotify and Pinterest, officials said. The campaign launched each of those platforms over the last few months, with a goal of reaching would-be supporters where they normally spend time online and creating a ripple effect that would expand their contact lists. One early, successful tactic was to create a daily, rapid-response-style newsletter that supporters could subscribe to called The Briefing, launched to coincide with a new book critical of the Clinton Foundation. The campaign also sought to build suspense around the Roosevelt Island rally by promising exclusive details about the event to those who signed up on Clintons website. And last week, Clinton emailed supporters inviting them to tell her when their birthdays are, so she  or her digital avatar, at least -- can send a note when the day arrives. Were part of a team together, the email read. Were going to work hard and have a lot of fun through it all. Part of that is taking some time to celebrate and appreciate each other, and thats what Id like to do on your birthday. The idea, Goff said, grew out of the fact  attested to by her own, now public, emails  that Clinton has always gone out of her way to offer birthday wishes to those around her. A successful digital effort, he noted, depends on the authenticity of each communication. Thats a true thing about her that reflects something that we think people are going to enjoy that can also be turned into an online program thats going to help us build our community, he said. Expanding the digital infrastructure isnt just happening organically, of course. The campaign also engaged in more transactional efforts, including exchanging active contacts with the Ready for Hillary organization. They have also already spent $2 million on an online advertising campaign that has helped add names to the list. The core of what were trying to do is serve people with an experience that theyre going to enjoy, thats going to enlighten them and hopefully inspire them to get more deeply involved in the campaign, Goff said. For more on Campaign 2016, follow @MikeMemoli, , 8:50 a.m.: This story was updated to add information from Clintons campaign donation reports. The story was originally published at 3 a.m.]", "Date": "20150716", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/politics/la-na-hillary-clinton-digital-20150715-story.html", "Title": "[Hillary Clinton's other email problem]"}