{"Content": "[ Steep losses for Taiwans pro-China ruling Nationalist Party in local elections last weekend have set off a chain of resignations as the party and central government retrench for the 2016 presidential race, possibly cooling relations with the mainland. On Friday, Taiwans new premier, Mao Chi-kuo, hired three new ministerial-level department heads, part of a broader Cabinet reshuffle that the party said would match peoples expectations. Mao replaced Jiang Yi-huah, who stepped down on Saturday as election results came in. On Monday his whole Cabinet, including 23 department heads, resigned. Taiwanese President Ma Ying-jeou, meanwhile, has quit as chairman of the Nationalist Party after five years on the job to apologize for the election losses. The party picked Vice President Wu Den-yih as interim chair. The partys secretary-general also left. These election losses tell us that our reforms arent fast enough and we still cant meet peoples expectations, Ma said in his resignation speech Wednesday, bowing for 10 seconds during what was his second public apology since Saturday. Possibly I havent done well enough. The Nationalist Party lost nine mayoral and county magistrate posts on Saturday after opinion polls have forecast the party would surrender just three. The opposition Democratic Progressive Party picked up seven seats for an overall majority, and independents were elected to two. Since Ma took office in 2008, the government has broken 65 years of icy relations with Beijing, which claims sovereignty over self-ruled Taiwan and wants the island to reunify with the mainland. Dialogue with Beijing has produced 21 agreements on trade, transit and investment, bolstering Taiwans export-reliant economy while giving Beijing hope for reunification through economic interdependence. The opposition DPP says it favors dialogue with the mainland but asks that Beijing not treat Taiwan as part of the same country; Communist leaders in Beijing reject that precondition. Analysts in Taiwan regard the ruling partys losses at the local level as a vote against the central government, which many people blame for slow-growing wages and high housing prices on parts of the island. Many also want the government to slow down the pace of agreements with China, warning that over-dependence on the mainlands $10-trillion economy could lead to excessive pressure to unify politically. Recent resignations will let the Nationalists install new leaders who are younger and more in tune with what the electorate wants before the 2016 presidential race, said Alexander Huang, strategic studies professor at Tamkang University in Taiwan. They will make sure they have a combat team for the next presidential election, Huang said. The new Cabinet may be instructed to avoid more major deals, such as free-trade agreements, with mainland China to avoid inciting further backlash from voters, analysts say. China wants to sign more agreements but also wants to see the Nationalists reelected in 2016, they say. Im pretty pessimistic about cross-strait relations from now through the next presidential election, said Wu Chung-li, research fellow at Taipei-based institute Academia Sinica. I dont think mainland China will do anything but wait. Jennings is a special correspondent. ]", "Date": "20141205", "Author": "NULL", "Link": "http://www.latimes.com/world/asia/la-fg-taiwan-new-cabinet-china-beijing-20141205-story.html", "Title": "[Ruling party's losses could chill Taiwan's relations with Beijing ]"}