{"Content": "[ Despite a presidential campaign pitched, in part, on a presumed appeal to younger voters, Sen. Rand Paul (R-Ky.) fares no better than other Republicans among those age 18 to 29, according to a new survey from Harvards Institute of Politics. The survey, the latest in a twice-a-year project to gauge the views of the millennial generation, found no front-runneramong the Republicans hoping to become the partys nominee for president. Paul received the support of 8% of those who said they were potential Republican primary voters. No candidate had more than 10% support. A much larger group, 36%, said they did not know whom they would back. Paul has frequently suggested that his positions on issues, including support for changing the nations marijuana laws and skepticism about overseas commitments, would help him attract younger voters who have spurned the GOP in recent elections. Though that may yet happen, it hasnt so far, the survey suggests. Further complicating Pauls path, younger Americans also appear to have grown somewhat more interventionist in their views of foreign affairs, the survey found. A majority of respondents, 57%, said they would support sending U.S. ground troops to take part in a military campaign against Islamic State militants in Iraq and Syria. The share who said the U.S. should take the lead in solving international crises and conflicts has risen to more than one-third, up from about one-quarter, where it stood during the last two years. Whoever wins the GOP contest will have to contend with the fact that, overall, Republicans continue to lag well behind Democrats among those age 18 to 29. By 55%-40%, millennials in the survey said they prefer that a Democrat win the 2016 election. That 15-point gap is somewhat narrower than the 23-point margin by which President Obama won 18- to 29-year-olds in 2012, according to exit polls, but exceeds the 54%-45% edge that John Kerry had among young voters in the 2004 contest against President George W. Bush. The support for Democrats among younger Americans has less to do with generational differences than with race. The millennial generation is far more racially diverse than older age groups, and Democrats receive overwhelming support among blacks and Latinos age 18 to 29. Among whites in the millennial generation, Republicans have the edge, 53%-41%. As with the country as a whole, Obamas standing has improved somewhat among millennials. Overall, 50% of those surveyed said they approved of Obamas performance in office, up from 43% in November. Thats similar to recent findings of the population at large. Views of Obamas handling of the economy improved notably, from 36% approving in the fall to 47% now. Obama also received a sharp jump in approval among Latinos age 18 to 29, with his approval rating going from 49% in the fall to 65% now. In December, the president announced his plan to temporarily shield from deportation millions of people who came to the U.S. illegally, and several surveys have shown an increase in Latino support since then. The survey also indicated millennials remain optimistic about their prospects, despite concerns about the job market. Among those in the survey enrolled in college, nearly two-thirds said they thought it would be somewhat difficult for people in their class to find a permanent job after graduation. But among all 18- to 29-year-olds respondents, 41% said they expected to be better off than their parents, compared with only 13% who expected to be worse off. Those figures were slightly more optimistic than the poll found two years ago. The poll found a sharp split on the question of whether the U.S. justice system can treat people fairly, regardless of race. Just over one-third said they had not much confidence in the systems fairness, and an additional 14% said they had no confidence. Only 9% had a lot of confidence, while 40% said they had some. Blacks and Latinos were much more likely to say they had not much or no confidence than were whites. A majority, 55%, of whites said they had a lot or some confidence, compared with fewer than one-third of blacks and 44% of Latinos. Blacks overwhelmingly said they supported recent protests about killings of black men by police, while only slightly more than one-third of whites agreed. The survey was based on 3,034 interviews conducted using an online panel designed to mirror U.S. demographics. The margin of error is plus or minus 2.4 percentage points. For more on politics and policy, follow@DavidLauter on Twitter ]", "Date": "20150429", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-millennial-poll-20150429-story.html", "Title": "[No edge for Rand Paul among young Americans, poll finds]"}