{"Content": "[ California Lt. Gov. Gavin Newsom announced Wednesday that he has opened a fundraising account to run for governor in 2018. In an email to supporters, Newsom said \"our state is defined by its independent, outspoken spirit. When Californians see something we truly believe in, we say so and act accordingly  without evasiveness or equivocation. \"So today Im announcing that Im creating a committee to run for California governor in 2018. Because I truly and passionately believe in the future of this great state.\", Newsom has long wanted to be governor, and the move  more than three years before the election  is an early shot across the bow at other potential Democratic candidates. By forming a committee, Newsom can raise up to $28,200 per supporter for both the primary and general elections, meaning he can collect $56,400 per donor. The move immediately puts pressure on former Los Angeles Mayor Antonio Villaraigosa, who is considering whether to challenge Atty. Gen. Kamala Harris in the 2016 U.S. Senate race, or possibly run for governor in 2018. No other candidate has opened a gubernatorial campaign committee, according to the secretary of states office. Gov. Jerry Brown will be termed out in 2018, so the field to be the states next governor has the potential to be large, especially on the Democratic side. Other potential Democratic candidates include billionaire environmental activist Tom Steyer, who could easily self-fund a campaign, and Los Angeles Mayor Eric Garcetti. On the Republican side, speculation will swirl around San Diego Mayor Kevin Faulconer, who leads the largest city in the nation with a GOP leader, and Fresno Mayor Ashley Swearengin, who lost her state controller bid in 2014. Newsom, 47, gained national attention during his tenure as mayor San Francisco for his 2004 decision to have the city issue marriage licenses to same-sex couples. He also launched the countrys first universal healthcare initiative. But he also suffered scandal  an affair with his campaign manager and close friends wife. Newsom ran unsuccessfully for governor in 2010, but bowed out once it became clear that Brown would clinch the nomination. He has served as the states lieutenant governor since 2011 and has made little attempt to hide his boredom in the job, which he once derided as \"a largely ceremonial post  with no real authority and no real portfolio.\", Historically, it has not been a steppingstone to higher office. In Californias 165-year history, only twolieutenant governors have been elected to the top executive spot. In 2014, Newsoms GOP rival Ron Nehring said the incumbent treated the job as a taxpayer-funded gubernatorial exploratory committee for 2018. The job is low-profile, though Newsom has tried to use it as a platform, frequently appearing on national news programs. He also authored Citizenville, a book that drew praise from unlikely quarters, such as former House Speaker Newt Gingrich. Newsom has less name recognition than the states top Democratic leaders. About six in 10 registered California voters were able to identify him in an October poll by the USC and the Los Angeles Times. Thirty percent viewed him favorably, while 19% held an unfavorable opinion. His support was strongest in his Bay Area home base, where 59% held favorable views, and he is less well known in other parts of the state. Follow@LATSeemafor political news. seema.mehta@latimes.com, 9:43 a.m.: This post was updated with a statement from Gavin Newsom. ]", "Date": "20150211", "Author": "[Seema Mehta]", "Link": "http://www.latimes.com/local/political/la-me-pc-newsom-governor-20150210-story.html", "Title": "[Gavin Newsom starts fundraising for 2018 gubernatorial bid]"}