{"Content": "[ Novelist and longtime Scotland resident J.K. Rowling did not mention national security issues when she recently donated 1 million pounds ($1.71 million) to the Better Together Campaign, which wants Scottish voters to reject the independence option in the Sept. 18 referendum. Rowling  creator of Harry Potter and Hogwarts School of Witchcraft  did emphasize the economic downsides of a divorce from the rest of the United Kingdom. But if her funds and celebrity status help \"no\" voters carry the day, she will share the credit for a real-life geo-strategic feat: saving Britains nuclear deterrent. The pro-independence leaders of the ruling Scottish National Party have pledged to terminate arrangements, dating from the 1960s, for basing British ballistic missile submarines and their nuclear warheads at Faslane and Coulport on Scotlands west coast. In June, they unveiled an interim constitution that would obligate a newly independent Scottish government to \"pursue negotiations with a view to securing nuclear disarmament  and the safe and expeditious removal from the territory of Scotland of nuclear weapons based there.\" The proposed constitution does not specify a deadline, but if the referendum passes, the nationalists hope to see the submarines and warheads removed by 2020. At the same time, the British governments case for replacing, beginning in 2028, the aging force of four Vanguard-class submarines (which carry U.S.-built Trident missiles) with a \"like-for-like\" fleet of four new boats has scored political gains over the last year. In July 2013, the British Cabinet Office published its assessment of potential alternatives to the \"like-for-like\" plan. These include building only two or three submarines, replacing some or all of the Trident systems with yet-to-be developed nuclear-armed and stealthy cruise missiles, and abandoning the Royal Navys \"continuous at sea deterrence\" posture, which requires one sub to be on patrol at all times. Conservative Prime Minister David Camerons coalition partners, the Liberal Democrats, had insisted on the study, claiming that nuclear cutbacks would save money and that ending the continuous patrols (a \"hangover from the Cold War,\" according to one Liberal Democrat leader) would speed progress toward disarmament. But the assessment found that none of those alternatives offered the overall deterrence and operational advantages of the \"like-for-like\" approach. Moreover, some would cost more than the roughly $34-billion life-cycle price of the \"like-for-like\" plan. And this month, an independent experts commission, including prominent figures linked to the coalition parties and the Labor opposition, concluded unanimously that Britain should retain and deploy a nuclear arsenal. According to the commissions report, \"We cannot expect the United States to shoulder indefinitely the awesome responsibilities that lie in providing extended nuclear deterrence to Europe, particularly if the United Kingdom were to abandon its own nuclear force.\" Ironically, the commission had been assembled by BASIC, a small but influential British-American think tank whose stated goal is a nuclear weapon-free world. The debate over the successor deterrent remains unsettled and might flare up during Britains parliamentary elections campaign next spring. Even within the countrys defense community, some argue that funds would be better spent for conventional military capabilities. Ultimately, the next government would decide, in 2016, how many new subs to buy. However, if Scottish voters opt for independence, that picture will change radically. A defense ministry report to Parliament warns that any other arrangement for basing the deterrent force would involve \"huge\" costs. George Robertson, a former British defense minister and NATO secretary general, believes the costs of moving the nuclear force out of Scotland could be prohibitive. \"Effectively, it might mean the unilateral nuclear disarming of the remainder of the United Kingdom,\" he told a Washington audience in April. That would be a tough blow for Britains two nuclear allies and the North Atlantic Treaty Organization as a whole. For decades, the special nuclear relationship between the United States and Britain, underpinned by their 1958 Mutual Defense Agreement, has ensured that their respective strategies, weapons systems and operational concepts are well coordinated and mutually supportive. As is the case in the United States with the president, only the prime minister can authorize the use of his nations nuclear forces. This complicates the planning of any potential aggressor, strengthening NATOs deterrence and collective defense pillars. The two governments also work very closely on sensitive nuclear proliferation issues, including Iran. British-French nuclear cooperation is more recent and restricted. Under the 2010 Lancaster House treaty, the countries share two laboratories related to nuclear weapons safety and reliability. Yet, beyond the cost savings of such arrangements, the French have a strategic stake in keeping Britain in the nuclear weapons business. As retired Gen. Henri Bentegeat, a former chief of defense, told French Parliament members in April, \"By helping the British  we are also protecting our own nuclear deterrent. Imagine the intense pressures that France would confront if they were forced to abandon their deterrent.\", But for now, theres little that Washington or Paris can do to help London keep Scotland in the fold. President Obamas mention last month of Americas \"deep interest\" in Britain remaining a \"strong, robust, united, and effective partner\" was an implicit rebuke to Scottish independence leaders. Recent opinion polls show a lead for the \"no\" vote, but a significant number of likely voters are undecided. And as the Economist notes, the nationalists \"have fire in their bellies.\" Hence, louder expressions of concern by American or French officials may be counterproductive. If the nationalists in Scotland win, however, British, American and French strategists will need all the wizardry they can muster. Leo Michel is a research fellow at the National Defense University in Washington. These are his personal views. Follow the Opinion section on Twitter @latimesopinion]", "Date": "20140724", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0725-michel-scotland-independence-nuclear-fo-20140725-story.html", "Title": "[ A vote for Scotland's independence could reverberate through NATO]"}