{"Content": "[ The San Francisco Bay Area, one of the nations biggest Democratic strongholds, has emerged with an unlikely distinction this year: It is Californias biggest source of campaign money for GOP presidential candidates. Republicans and their super PACs have collected $13.4 million in the Bay Area, much of it from Silicon Valley tech moguls, records show. The disconnect between the regions liberal voters and its wealthy, conservative donors was one of the most striking findings from a Times analysisof the more than $44 million that presidential candidates in both major parties and their super PACs collected in California in the first six months of the year. Its largely the result of a handful of contributors writing seven-figure checks to super PACs that support the Republican they want to succeed President Obama. Get more national political newsand the latest from Campaign 2016 >>, Larry Ellison, co-founder of Oracle Corp. gave $3 million to a committee promoting Sen. Marco Rubio of Florida. Scott Banister, co-founder of the computer security company IronPort, gave $1.25 million to one backing Sen. Rand Paul of Kentucky. \"More and more money is coming from fewer and fewer people,\" said John Wonderlich, policy director of the Sunlight Foundation, a nonpartisan group that promotes transparency in campaign financing. Another surprise this year has been Orange County, which for decades has been a reliable source of donations for Republican candidates. So far, wealthy donors there appear to be holding back. California was Americas top source of campaign money for the 2012 election, with Obama raising $62.8 million here for his reelection and his GOP rival, Mitt Romney, $41.3 million. Other Republicans in the 2012 White House contest raised nearly $8 million here. See the most-read stories this hour >>, On the eve of Wednesdays Republican presidential debate at the Reagan Libraryin Simi Valley, Columba and Jeb Bush Jr. the wife and son of candidate Jeb Bush, were raising money for the former Florida governor at a Brentwood luncheon. Bush himself is scheduled to attend a breakfast fundraising reception Thursday in Bakersfield, a longtime center of Republican agriculture and oil money. Private equity investor Bradford M. Freeman, who hosted the Brentwood event at his home and gave $1 million to Bushs Right to Rise USA super PAC, was a major fundraiser for former Presidents George W. Bush and George H.W. Bush. Freeman said hed forsworn fundraising, but when Jeb Bush got in the race, he \"sort of didnt have a choice to get back into the saddle.\", Bush and his super PACs have raised $13.6 million in California this year, more than any candidate other than Democrat Hillary Rodham Clinton, who  with her super PACs  has collected $17.3 million. About $7.6 million in donations Bush collected in the state came from the Bay Area. His biggest California donors, at $1.5 million apiece, are both from San Francisco: investment executive William Oberndorf and Helen Schwab, wife of brokerage firm founder Charles Schwab. Bush fundraiser Bill Draper, a Silicon Valley venture capitalist, said the reason for the candidates support in the area was simple: \"Hes going to be good for business.\", GOP hopeful Carly Fiorina, the former Hewlett-Packard chief executive, is also heavily reliant on California money. She has pulled in more than $2.7 million from the state  more than half her overall total  with most of the donations coming from Los Angeles County. Charles Munger Jr. a Palo Alto physicist who gave $100,000 to a Fiorina super PAC, said he hoped Republican voters would soon tire of Donald Trump and retired neurosurgeon Ben Carson, who lead in the polls, and see Fiorina as a better alternative to politics as usual. \"They are looking for someone who is not part of the Washington establishment to come in and set things right,\" Munger said. Clinton also received most of her money from Los Angeles County, where contributors slightly favored Democrats. Her biggest donors include Hollywood entertainment tycoons Steven Spielberg, Jeffrey Katzenberg and Haim Saban, each of whom gave $1 million to her Priorities USA Action super PAC. This analysis only covers donations of $200 or more. A so-called super PAC is a type of political action committee allowed to raise unlimited sums of money in support of a candidate but forbidden from making direct contributions or coordinating with the campaign. After the Bay Area, which accounted for $20.7 million in giving to all presidential candidates this year, Los Angeles County was a close second with $18.7 million. Orange Countys $1.6 million made it a distant third, with most of that money going to Republicans. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, Fred Smoller, a political science professor at Chapman University in Orange, said wealthy donors in Orange County appeared to be waiting to see if an establishment candidate, such as Bush, can pull ahead of Trump in opinion polls. \"I cant imagine too many people here from the wealthiest groups supporting Donald Trump, primarily because he wants to raise taxes on the wealthy,\" Smoller said. Mark Chapin Johnson of Ladera Ranch, a top California fundraiser for Mitt Romney and George W. Bush, said hed met with many of the Republicans running for president, but was waiting \"to see who gets through the process\" before picking one to support. \"Id rather sit back and be somewhat thoughtful about it  and targeted and focused,\" he said. michael.finnegan@latimes.com, Twitter: @finneganLAT, anthony.pesce@latimes.com, Twitter: @anthonyjpesce, melanie.mason@latimes.com, Twitter: @melmason, Times staff writers Ben Welsh and Maloy Moore contributed to this report. MORE POLITICS COVERAGE, Trump, taunted by protesters, delivers barbs on immigration in L.A. Harbor speech, Republican presidential rivals poised to pile on Donald Trump in feistier second debate, Debate primer: Nine things you didnt know about Simi Valley]", "Date": "20150916", "Author": "[Michael Finnegan, Anthony Pesce, Melanie Mason]", "Link": "http://www.latimes.com/nation/la-na-money-california-20150916-story.html", "Title": "[In Democratic California, which 2016 candidates get the most money? You'll be surprised]"}