{"Content": "[ The window for President Obama to add another liberal justice to the Supreme Court probably closed last week when Republicans took control of the Senate. Over the last 10 years, the Senates vote on high court nominees has increasingly followed party lines. Republican senators lined up against Obamas first two nominees  Justices Sonia Sotomayor and Elena Kagan  but lacked the votes to block them. Now, they will have the majority to stop any nominee, particularly one with a liberal record. The shift in power is likely to persuade 81-year-old Justice Ruth Bader Ginsburg  if she needed further persuading  that she should stay on the job at least until 2017. She had come under strong pressure to retire by next year so Obama would have time to have a replacement confirmed. But a Senate controlled by Republicans makes it highly unlikely the president could replace her with an equally strong advocate for womens rights and civil liberties. Ginsburg, the courts leading liberal voice, has said she has no plans to retire, even questioning why some liberals want her to leave. \"I asked some people, particularly the academics who said I should have stepped down last year: Who do you think the president could nominate and get through the current Senate that you would rather see on the court than me?\" she said in a recent interview in the New Republic. \"No one has given me an answer to that question.\", The new Republican majority in the Senate will also ease conservatives worries that Obama might have the chance to shift the Supreme Courts ideological balance. The nightmare scenario of some Republicans is to wake up to news that either Justice Antonin Scalia or Anthony M. Kennedy, both 78, is leaving the court due to an illness or death. Both were appointed by President Reagan in the mid-1980s. Scalia has been the courts most outspoken conservative, and Kennedy has supplied the key votes for a conservative majority to free campaign spending, strike down part of the Voting Rights Act and expand support for religious claims. Both justices also voted, in dissent, to strike down the entire Affordable Care Act. If one of them had retired in the last few years, Obama could have chosen a liberal jurist as a replacement, confident the nominee would be confirmed in a Senate controlled by Democrats. Scalia and Kennedy have voiced no hints about retiring. But if one of them were forced to leave due to health reasons, Obama would have to choose a successor who is acceptable to the new Republican majority in the Senate. The last time a Supreme Court justice nominated by a Democratic president was confirmed by a Senate Republican majority was Rufus Peckham in 1895. Thats largely because over the last century when Democrats controlled the White House they usually had a Senate majority. Most legal experts doubt there will be another vacancy on the court before the next president moves into the White House. \"None of the current members of the court seem eager to step down,\" said Todd Gaziano, who heads the Washington office of Pacific Legal Foundation, a conservative public-interest law firm. Gaziano predicts that if a seat becomes vacant in 2016 during the election campaign, the GOP-led Senate will attempt to delay a confirmation until after a new president takes office, hoping that person would be a Republican. \"I can see the Republican majority running out the clock,\" he said. The result is that the ideological balance on the court is likely to carry forward through 2016. Five of the justices were appointed by Republicans and four by Democrats. When the court is closely split, the conservatives usually have a majority, but Kennedy has joined with the liberals on several major issues, including support for gay rights. If a surprise vacancy were to come up in the next two years, Obama would have little choice but to select a nominee with a moderate and nonpartisan record. One possible candidate is Judge Sri Srinivasan, 47, who was named last year to the U.S. Court of Appeals for the District of Columbia. Srinivasan worked as a lawyer in both Republican and Democratic administrations, and even won plaudits in his Senate hearing from Sen. Ted Cruz (R-Texas). The two were Supreme Court clerks during the same year. Another possibility is Chief Judge Merrick Garland, 61, also of the D.C. Circuit Court of Appeals  a Clinton appointee who was the supervising prosecutor in the Oklahoma City bombing case. But some Democrats consider him too old to have a long-term impact on the court. And if Ginsburg were to leave, she almost certainly would be replaced by a woman. Nominating a minority of some kind may make it more difficult for Republicans to oppose, experts said. Liberal legal groups say that Obama, if he gets the chance to nominate another justice, should not restrict himself to only moderate choices. \"Neither the White House nor Senate Democrats should yield to the narrative of an inevitable confirmation shutdown,\" said Nan Aron, president of the Alliance for Justice, a national association of advocacy groups. Others predicted Americans would frown on a GOP campaign to reject a qualified Supreme Court candidate for purely partisan reasons. \"Efforts to block a Supreme Court nominee with excessive partisanship will be damning for the party,\" said Caroline Fredrickson, president of the liberal legal group American Constitution Society. david.savage@latimes.com, tim.phelps@latimes.com, Twitter: @DavidGSavage, @timphelpsLAT]", "Date": "20141108", "Author": "[David G. Savage, Timothy M. Phelps]", "Link": "http://www.latimes.com/nation/politics/la-na-court-gop-20141109-story.html", "Title": "[Obama unlikely to alter Supreme Court ideology with Republican Senate]"}