{"Content": "[ To a cheering crowd, Republican presidential contender Donald Trump continued to rail against illegal immigration Saturday, pointedly criticizing the Mexican government and pledging to build a fence along the U.S.-Mexico border, while also taking stabs other Republican presidential contenders, Democrats and the media. Mexico -- I respect the country, Trump said in Phoenix. Theyre taking our jobs, theyre taking our manufacturing, theyre taking our money, theyre taking everything, and theyre killing us at the border. Trump, who recently called Mexican immigrants rapists and drug dealers, acknowledged: The Mexican government is not happy with me, to put it mildly. As he has repeatedly since the making the comments forcefully criticized by members of his own party, Trump said he respected Mexico and the Mexican people. But their leaders are too smart for our leaders, because we have stupid leaders, OK? he said, to cheers and chants of U-S-A!, He added, Dont worry, well take our country back. Very soon. His pledge to erect a wall along the entire southern border prompted shouts of, Build the wall!, Trumps unapologetic and at times perplexing campaign (he says he can win the Latino vote) has thrust the issue of immigration to the forefront of the 2016 campaign. Saturdays event in Phoenix was originally scheduled to be held at a nearby hotel, but, according to local Republican officials, demand soared in recent days, prompting the move to the larger venue. Also appearing was Maricopa County Sheriff Joe Arpaio, a firebrand on the issue. Jim Wines and his sister-in-law waited in 100-degree heat outside the convention center Saturday morning to see Trump. He calls a spade a spade and is the only one willing to say it like it is, said Wines, a registered Republican and ardent Arpaio supporter from Surprise, Ariz. Id vote for him to be president today, he said of Trump. Standing a few feet behind Wines in a line that stretched nearly a city block stood Diane Sapiro, who wore a Trump button that read Make America great again. Sapiro said shes an unaffiliated voter, disenchanted by both Democrats and Republicans. Hes arrogant and a little cocky, but when he talks, hes saying stuff I agree with, said the Chandler, Ariz. resident. Illegals coming across the border are an issue here. Were a border state and its a real issue. Trump didnt limit his talk to immigration. At various points he took on President Obama (You know I dont use teleprompters like the president; I speak from the heart), Caroline Kennedy, Hillary Rodham Clinton, Jeb Bush, NBC and Macys. Who would you rather have negotiating a really good deal with China, Mexico, Japan. Trump or Jeb Bush? he asked. Earlier Saturday, Trump spoke at FreedomFest, a libertarian-oriented event in Las Vegas. Again, Mexico was a target. You remember the old days with Castro, when he emptied his jails and sent them to the United States? he asked. Well, Mexico does similar things. For a few unscripted minutes, Trump strayed from his prepared remarks and invited Jamiel Shaw Sr. to the podium to relate the story of his son, who was fatally shot in 2008 in South Los Angeles by an immigrant in the country illegally. I see him almost like a dad, Shaw said of Trump. Hes the kind of man that you would want to be your dad. Toward the end of the Las Vegas speech, Trump took questions from the audience. One attendee from Mexico said he was incredibly insulted by Trumps remarks and asked whether the presidential hopeful would build walls around every state to prevent criminals from entering the United States. I was waiting for this, Trump said. Did the government of Mexico ask you to come up here and say this?, Trump said he would build a wall between the United States and Mexico, and that he encouraged legal immigration. But what I dont encourage is people coming into our country illegally, he said, to the applause and whistling of audience members. In recent weeks, several companies, including NBCUniversal and Macys, have severed ties with the real estate mogul. Moreover, some Republicans have denounced Trumps comments and sought to distance themselves as the party looks to make inroads with Latino voters  a crucial voting bloc  ahead of the 2016 election. Top Republicans in Arizona, including Sens. John McCain and Jeff Flake and Gov. Doug Ducey, did not attend Trumps convention center rally. Both McCain and Flake supported a bipartisan comprehensive immigration proposal that passed the Senate in 2013 but ultimately stalled in the Republican-controlled House. At its core, the bill would have increased the number of agents patrolling the border while allowing some immigrants living in the country illegally to obtain registered provisional immigrant status if they entered the country before 2011. In cable television interviews this week, McCain lambasted Trumps remarks as offensive, saying a majority of Arizonans would disagree with his views. The recent death of Kathryn Steinle, a 32-year-old shot while walking along San Franciscos Embarcadero, has amplified Trumps tough stance on illegal immigration. Accused gunman Juan Francisco Lopez-Sanchez was in the country illegally and previously had been deported. On Friday, Trump sought to hammer home his calls for stricter immigration reforms by meeting in Los Angeles with family members whose loved ones were killed in accidents and crimes by assailants alleged to be in the country illegally. People came into the country illegally and killed their children, Trump said, referring to the families who stood alongside him in Los Angeles. The illegals come in, and the illegals kill their children. Times staff writerNatalie Schachar contributed to this report. Follow@kurtisaleefor political news. 4:52 p.m.: Updated with changes throughout. 2:17 p.m.: This articlehas been updated with additional background on Sheriff Joe Arpaio. 1:08 p.m.: This articlehas been updated with additional background and comments from Donald Trump in Las Vegas. This article wasoriginally published at 12:41 p.m.]", "Date": "20150711", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/politics/la-na-trump-arizona-rally-20150710-story.html", "Title": "[Arizona crowd welcomes Donald Trump's tough stance on immigration]"}