{"Content": "[ With the nations political discourse seemingly as polarized as ever here in the early going of the 2016 presidential campaign, a new Gallup poll finds that people who self-describe their attitudes on social issues as liberal or conservative have reached parity at 31% each. Its the first time self-described social conservatives havent outnumbered social liberals since Gallup began asking the question in 1999. What that means as a practical matter is a bit unclear. Gallup says that as part of a years-long trend, more Democrats now self-identify as liberal on social issues, and fewer Republicans consider themselves to be social conservatives. The total percentage of Americans on the left and right on social issues remained stable over time at about 60%, which means the moderate middle stayed the same size. Some of it could reflect a softening of rhetoric more than a change in beliefs. It wasnt that long ago that the right hurled liberal as an insult, much as the left now says social conservative with a sneer. So, a change in self-definition may have less to do with personal beliefs than with self-perception. As in, people who once were nervous identifying themselves as liberal now may not feel so embarrassed, and some social conservatives may no longer feel comfortable claiming that mantle. But its interesting that another recent Gallup poll found that, for the first time, a majority of Americans believe that people are born gay, rather than adopt it as a choice or are formed by environmental factors (30% still cling to that). And yet another survey found a record 60% of Americans support same-sex marriage. If we take changes in attitudes toward gays as a barometer, maybe the leftward shift in self-identification does reflect broader changes in beliefs. Gallup also notes that the conservative-liberal divide on economic issues remains wide, which may suggest that general philosophies arent changing, just attitudes tied to the culture war. Which unfortunately, still drives our political campaigns. From the most recent Gallup report:, Americans growing social liberalism is evident not only in how they describe their views on social issues but also in changes in specific attitudes, such as increased support for same-sex marriage and legalizing marijuana. These longer-term trends may be attributable to changing attitudes among Americans of all ages, but they also may be a result of population changes, with younger, more liberal Americans entering adulthood while older, more conservative adults pass on. Gallup found evidence that population replacement is a factor in explaining changes in overall ideology using an analysis of birth cohorts over time. The 2016 presidential election will thus be contested in a more socially liberal electorate -- and a less economically conservative one -- than was true of prior elections. Economically and socially conservative candidates may still appeal to the Republican Party base in the primaries, but it may be more important now than in the past for the GOP nominee to be a bit less conservative on social issues in order to appeal to the broader general electorate. Of course, its way too soon to try to figure out how that might play out in the 2016 election, particularly since the electoral college landscape trumps broad societal trends and a national vote. As Paul Starr explored in the American Prospect last year, the nation over time has self-sorted into clusters of like-mindedness (not exclusively, but predominately), and the red-blue divide also reflects our pre-Civil War history, a nation dividedamong slave states and free-labor states (with intertwined economies). The current political map, to be sure, does not divide exactly along North-South lines, Starr wrote. Some rural areas in the North are socially and politically more like the South, while some urban areas in the South are more like the North. The West has its own divisions. But the regional and racial continuities are unmistakable. The South continues to be the principal base of support for a party favoring harsher policies toward labor and the poor and drawing its support almost entirely from whites. The Souths culture and religion pervade the version of conservatism that dominates the Republican Party. An electoral college map of the 2012 results, when President Obama fought off a challenge from Mitt Romney, reflects the split, with the added clarifying point that the Great Plains states as far north as the Canadian border (except for Colorado and New Mexico) joined the Southern states in voting Republican. Scientific American has a slide show of some interesting map variations that try to capture some of the subtlety inherent in the typical red-blue divide. But with the winner-take-all, state-by-state electoral college system*, subtle changes in national attitudes on social issues dont necessarily mean much for a presidential election. But they could affect who wins the party nominations, particularly for the Republicans. Regardless, from my perspective a political shift toward tolerance and inclusiveness is something to be welcomed and nurtured. -----, * Except for Maine and Nebraska, which divvy up their electoral votes by giving two to the statewide winner and one to the winner in each congressional district (Maine has two, Nebraska has three). Follow Scott Martelle on Twitter @smartelle.]", "Date": "20150522", "Author": "[Scott Martelle]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-liberals-conservatives-gay-rights-presdiential-election-20150522-story.html", "Title": "[A look at the nation's leftward shift on social issues]"}