{"Content": "[ Billionaire environmental activist Tom Steyer is aggressively exploring a run for the U.S. Senate seat being vacated by Barbara Boxer and is expected to make a decision within days, according to multiple sources close to Steyer. The former hedge fund titan has been huddling with advisors, polling California voters, buying website addresses and meeting with political and labor leaders as he weighs a bid, the sources said. Boxers announcement Thursday that she would leave her post in 2016 set off a frenzy of speculation about who would run for the first open U.S. Senate seat in California in more than 20 years. If Steyer opts in, with the ability to fund a race expected to cost tens of millions of dollars, he could upend a field that would otherwise be crowded with other ambitious Democrats. \"Steyer has the greatest incentive to plant his flag early,\" said Dan Schnur, head of the Jesse M. Unruh Institute of Politics at USC. He \"has the capacity to scare other people out of the race.\", But California has a political graveyard full of neophyte millionaires and billionaires who spent large chunks of their fortunes only to be rejected by voters. Among them: former business executives Meg Whitman, Carly Fiorina, Al Checchi, Michael Huffington and Bill Simon. \"Theres a first time for everything. But California voters have not historically looked very kindly on first-time self-financing candidates,\" said Democratic operative Garry South, who led former Gov. Gray Davis to victory over Checchi in the Democratic primary in 1998, and over Simon in the general election in 2002. South said wealthy but inexperienced candidates tended to have three critical flaws  free-spending but unfocused campaigns, large and undisciplined staffs and a lack of respect for people with professional experience in politics. \"They think that because theyre worth a billion dollars, theyre basically better than everybody else in the political system,\" South said. \"Their disdain for people in the process is just obvious, and it makes them make a lot of mistakes.\", Steyer, a San Franciscan whose wealth is estimated at $1.6 billion, has had both successes and failures in electoral politics. He was the nations biggest individual donor in the 2014 elections, spending more than $74 million on congressional and gubernatorial contests across the nation and pledging to make climate change a top issue in hotly contested races. Candidates backed by Steyer and his organization, NextGen Climate, won races for U.S. Senate in Michigan and New Hampshire; governor in Pennsylvania and some state legislatures. But they lost Senate contests in Colorado and Iowa, and governors races in Florida and Maine. In California, Steyer successfully spent millions fighting a 2010 ballot measure that would have rolled back the states landmark climate change law. In 2012, he backed a voter-approved proposition to close a loophole that allowed multistate companies to pay out-of-state taxes. Steyer left Farallon Capital Management, the hedge fund he ran, in 2012, saying he wanted to focus his work on alternative energy. As he became increasingly engaged in politics, his business record has come under growing scrutiny. News reports detailed his longtime investments in coal and other fossil fuels, for example, and the slow pace at which he shed those investments. Farallon Capital Management pumped hundreds of millions of dollars into companies running coal mines and coal-fired power plants overseas, the New York Times reported. The fund was profiting from mining companies that produced more coal each year than the entire amount of coal consumed annually by Britain. The inquiries would surely magnify if he launched a Senate run; opponents would scour his two-decade hedge-fund history for vulnerabilities to exploit. Deals that seem routine in the world of finance can be poisonous in politics. GOP presidential nominee Mitt Romney was portrayed as a corporate scoundrel in 2012. Steyers polling, conducted in late December, found another obstacle  few people had heard of him. But that could be easily remedied with advertising. In addition to veteran Democratic pollster Paul Maslin, Steyer is also working with Jim Margolis, who was President Obamas media strategist, and Chris Lehane, a longtime adviser to President Clinton. Steyer has begun purchasing \"Steyer for Senate\" websites and planned to meet with advisors at his home this weekend. Steyers moves are expected to narrow the window for other candidates to make their own announcements, given that anyone hoping to compete with him needs to start raising funds immediately. California Atty. Gen. Kamala Harris and Lt. Gov. Gavin Newsom remain the most widely discussed as candidates to replace Boxer, and they have been the most secretive about their plans. Advisors to both, who dont want to see them run against one another, were silent about their decision-making processes or timelines. Meanwhile, other potential candidates, such as Democratic Reps. John Garamendi, Loretta Sanchez and Jackie Speier, are increasingly vocal about exploring a bid. On Saturday, former Los Angeles Mayor Antonio Villaraigosa broke his silence, issuing a statement confirming that he may run. As for Steyer, \"The daunting fact for anyone else is, Oh my gosh, he can come in and potentially dominate in terms of communications \" with voters, said a source who requested anonymity because he could not openly discuss Steyers affairs. Times staff writer Evan Halper in Washington contributed to this report. Twitter: @LATSeema, @finneganLAT, 9:58 a.m. Jan. 10: This post has been updated to reflect former Los Angeles Mayor Antonio Villaraigoss announcement that he may run for Sen. Barbara Boxers seat. This post was originally published at 7:41 p.m. Jan. 9.]", "Date": "20150110", "Author": "[Seema Mehta, Michael Finnegan]", "Link": "http://www.latimes.com/local/politics/la-me-pol-boxer-steyer-20150110-story.html", "Title": "[Billionaire Tom Steyer mulls run for Sen. Boxer's seat]"}