{"Content": "[ 2016 looks remarkably like 1992: an election with a Bush, a Clinton and an uncontrollable billionaire. The last time around the unscripted business mogul changed the nature of the campaign; this time he could cost the Republican Party the presidency. Ross Perot entered the race in February 1992, taking on two unpopular opponents: Bill Clinton and George H.W. Bush. After leading through the entire month of June, he dropped out, dropped back in, and ultimately received the highest third-party vote share since 1912: a stunning 18.9%. Perots traction with the electorate led Clinton and Bush to address issues  including the federal budget deficit  they might not have otherwise. His success also led then-Rep. Newt Gingrich to propose his Contract With America, a policy platform that ignored social issues in favor of political reform, including the sweeping changes to congressional process that have played a large part in the current gridlock. But, contrary to popular belief, Perot was not responsible for Clintons victory. On election day, Perot supporters split right down the middle in their second choice. This fact shouldnt really surprise anyone, because Perots appeal was nonpartisan. He promised to fix the mess both major parties had gotten the country into: unbalanced budgets, lost manufacturing jobs, a political process reserved for wealthy lobbyists. Sound familiar? Sound, specifically, like Donald Trump?, Trump, like Perot, is an equal-opportunity critic. But if he decides to run as an independent  a possibility he refused to rule out at the first Republican debate  he probably wont have a Perot-like balanced effect on the contest. A recent Washington Post/ABC poll shows that in a three-way race, Trump increases Hillary Rodham Clintons edge over Jeb Bush to 16 percentage points from 6 percentage points in a two-way race. And according to a recent Rasmussen poll, 1 in 5 Republicans say they are \"very likely\" to vote for a Trump-led third-party effort, while less than 10% of Democrats say the same. There is good reason, beyond polling data, to expect a Trump independent candidacy to hurt Republicans more than Democrats: his agenda. Trumps signature issue is immigration. He, of course, favors a hard-line approach, insisting without evidence that the Mexican government is sending criminals across the border. Unlike Perots emphasis on trade and the deficit, which drew support from both Republicans and Democrats, Trumps talking points exploit a deep division specific to the Republican Party. A recent Pew survey found that a third of Republicans, and half of the most active Republicans, do not support any path to citizenship. A comprehensive immigration reform bill (which has passed in the Senate and which Speaker John Boehner says is a top priority for the House) would further alienate anti-immigration Republicans from their party and further reinforce Trumps appeal to the conservative base. With eight to 10 states up for grabs, and the Republican candidate quite possibly tethered to a comprehensive immigration reform bill  either Jeb Bush or Marco Rubio would have trouble shedding a pro-immigration reform reputation  a Trump independent candidacy could do real damage to the GOP. If Trump attracted even 5% of the vote, he could decide the election in Clintons favor. No wonder Republicans are worried. Ronald B. Rapoport and Walter J. Stone are professors of political science at the College of William & Mary and UC Davis, respectively. They are the authors of \"Threes a Crowd: The Dynamic of Third Parties, Ross Perot, and Republican Resurgence.\", Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150817", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0817-rapoport-stone-trump-perot-20150817-story.html", "Title": "[Donald Trump: Like Ross Perot, but worse for the GOP]"}