{"Content": "[ SomeRepublicanswant to put hot-button social issues on the backburner  part of their quest for moderate femalevoters  but events on Thursday served asa reminder that doing so wont be that easy. White House hopeful Sen.Lindsey Grahamformally introduced thePain-Capable Unborn Child Protection Act, a measure that would ban most abortions after 20 weeks. America is at her best when shes standing up for the least among us, and the sooner we pass this legislation into law, the better. We are on the right side of history, Graham said Thursday in a statement. I look forward to leading this long-overdue effort and pushing for a roll-call vote in theSenate. Graham, a staunch anti-abortion advocate, has long backed the ban. The chance to push for a vote on the issue will no doubt help him appeal to the core Republican voters hes courting in the primaries. But Grahams proposal highlighted a divide between the interests of the presidential contenders as they claw through the primary season and those of their Senate colleagues looking at tough elections in swing states next year. Democrats are eager to see Republicans focus on so-called culture war issues, rather than the economy. They quickly cast Grahams legislation as evidence of the partys extreme views and pounced on the handful of swing-state Republican senators, sending out newsreleases accusing the GOP majority of attacking womens health. In 2016, voters in Ohio  men and women alike  will remember thatRob Portmanwas more interested in playing politics with womens health than in moving our country forward, strengthening our economy, and working to end the dysfunction in Washington, Sadie Weiner, spokeswoman for the Democratic Senatorial Campaign Committee, declared in one such statement. Some polling shows that a ban on abortions after 20 weeks of pregnancy isnt an idea that Americans regard as extreme. A 2013 Washington Post poll found56% of Americans would support such a measure. Other polls have seen similar results. At the same time, polls have shown a shift to a more socially liberal electorate in recent years. Gallup last month found that50% of Americans identify as advocates of abortion rights,while 44% of Americans call themselves abortion foes. It was the first time since 2008 that support for abortion rights had a statistically significant advantage, the pollster said. Thats the sort of data thatmake some Republicans worry about elevating the issue at all in a general election  particularly in swing states like Ohio or New Hampshire, where incumbent Republican Sen.Kelly Ayottecould face a strong challenge. Time spent on the stump explaining the details of a vote on banning some abortions may play into the Democrats agenda, they fear. Its not clear whetherGOP senators will face a vote on the ban. Senate Majority LeaderMitch McConnell(R-Ky.), a co-sponsor of the bill, said last year that he would bring it up for a vote, but he has not mentioned timing since the House passed a version of the bill last month. McConnell spokesman Don Stewart said Thursday he did not have an update. For more on politics, follow@khennesseyon Twitter.]", "Date": "20150611", "Author": "[Kathleen Hennessey]", "Link": "http://www.latimes.com/nation/la-na-abortion-bill-20150611-story.html", "Title": "[Abortion ban proposal could help in GOP primaries but hurt in Senate]"}