{"Content": "[ In its third editorial endorsing Republican congressional candidate Carl DeMaio over Democratic incumbent Scott Peters, the U-T San Diego newspaper had one description of DeMaio that not even his many critics could dispute: \"One of a kind.\", DeMaios hard-charging style, combined with his anti-Washington pledge to \"Fix Congress First,\" has turned the 52nd Congressional District race into one of the tightest and costliest in the country, with spending by the campaigns and independent committees expected to top $10 million. It might also be among the nastiest, with the candidates complaining of distortions and smear tactics, and a former DeMaio campaign worker accusing him of sexual misconduct. Nonpartisan analysts rate the 52nd as one of the few \"toss-up\" congressional races in the country  one that could help the GOP strengthen its House majority by ousting a one-term Democrat. If elected, DeMaio, 40, would be a rarity in Washington: an openly gay Republican member of Congress. The former San Diego City Council member tells voters that he is a \"new generation Republican\" and a \"proud gay American,\" determined to make government efficient and keep it out of issues such as abortion and marriage. He has openly criticized his party for using social causes as \"wedge issues\" and for its role in pushing the government to a near shutdown. Peters, 56, an environmental lawyer and former City Council member, portrays DeMaio as a follower of the tea party. Political action committees backed by the conservative billionaire Koch brothers have contributed to DeMaio. Peters commercials warn that DeMaio would vote to cut Medicare and student loans; one commercial has a video of DeMaio speaking to a tea party gathering about \"our collective movement.\", At a debate at KGTV-Channel 10, DeMaio blamed Peters for the budget showdown last year that threatened to close the government, telling him: \"It was the wrong thing to do.\", Peters responded by accusing DeMaio of taking credit for projects in the city  including a homeless shelter  \"even though he voted against them.\", Each paints the other as being on the political extremes. \"When youre to the left of Jimmy Carter, youre out of step with San Diego,\" DeMaio said as he fixed Peters with a stare. When DeMaio noted the lack of comprehensive immigration legislation, Peters shot back, \"Your tea party wont let it happen.\", Issues aside, the race has become a kind of referendum not on the incumbent but on DeMaio and the controversies that often surround him. In a routine midterm election season, the Peters-DeMaio fight has taken center stage locally and attracted national media attention. In Washington, Peters, known for a cautious, understated demeanor, has supported the interests of San Diegos high-tech businesses and funding for its military bases. He is supported by Planned Parenthood, the Sierra Club and the U.S. Chamber of Commerce. To his supporters, DeMaio is the kind of passionate reformer needed to shake up Washington just as he did City Hall, where he attacked government workers salaries and pensions as bloated. When then-Mayor Jerry Sanders, a fellow Republican, and other officials thought it was time to ask voters for a half-cent sales tax to bolster city services, DeMaio led the opposition. He said voters should not be asked for more money until the city further reduced spending on employees; voters agreed with DeMaio. The conservative U-T editorial page finds him a smart and insightful person who \"burns inside with a desire to change things for the better.\" The liberal weekly San Diego CityBeat labels him self-centered and \"utterly detestable\" and has pleaded with voters to support Peters. \"Scott Peters big disadvantage is being a Democrat in a year the president isnt popular,\" said Carl Luna, political science professor at San Diego Mesa College. \"Carl DeMaios big disadvantage is being Carl DeMaio  he was a divisive figure on the council, lost for mayor and simply isnt a cuddly politician.\", In the final weeks of the current campaign, a new element has been added: what the moderator at a Conservative Order of Good Guys debate last week called the \"800-pound gorilla in the room.\", A 28-year-old former campaign worker said he told police in June that DeMaio touched him inappropriately, masturbated in front of him and then offered him $50,000 to keep quiet. DeMaio, speaking at a news conference, accused the ex-campaign worker of fabricating the allegations after he was fired for plagiarism, and claimed that the ex-worker is a prime suspect in a break-in at the campaign office. DeMaio said police sex-crime detectives had interviewed him and other campaign workers. He also said Police Chief Shelley Zimmerman called him in August to say the investigation was complete and that he had been cleared. Zimmerman has declined to confirm or deny DeMaios version of the phone call. Dist. Atty. Bonnie Dumanis, a Republican, has rejected calls from Democratic officials to recuse her office from the sexual misconduct and burglary cases. She endorsed DeMaio for mayor in 2012 and DeMaio held fundraisers for her in her successful bid for a fourth term. DeMaio has faced accusations of sexual misconduct in the past. State Sen. Ben Hueso (D-San Diego), a former council member, told a reporter in 2013 that he saw DeMaio masturbating in a City Hall bathroom during a break in a council meeting. DeMaio denied Huesos allegation and the issue faded from headlines with no official action or police inquiry. A U-T and KGTV poll before the recent allegations broke showed DeMaio with a slim lead within the margin of error. It is not just Democrats who have questioned whether DeMaio would be effective in Washington. Eleven former chairmen of the local Chamber of Commerce  10 of them Republicans  have endorsed Peters. And when Democrat Bob Filner resigned as mayor last year amid allegations of sexual harassment, Republican kingmakers met privately in La Jolla to choose a GOP candidate to back for mayor. Over the objections of U-T publisher and owner Douglas Manchester, who favored DeMaio, the group chose mild-mannered Councilman Kevin Faulconer. DeMaio, who lost to Filner in the 2012 mayors race, had already begun campaigning for Congress and says he never intended to switch to the mayors race. Peters unseated Republican Brian Bilbray two years ago when Democratic turnout was bolstered by a presidential election. The 52nd District includes Coronado, Poway and a northern swath of the city of San Diego. Registration is 34% Republican, 32% Democrat, 29% independent. Local television is filled with attack ads. Peters warns that DeMaio plans to cut student loans. DeMaio says he is a big supporter of student loans and Medicare and that Peters represents everything that is wrong with politics: officeholders who are too comfortable with the status quo. Asked by a reporter to name three of its most important endorsements, the DeMaio campaign listed the Howard Jarvis Taxpayers Assn. the National Federation of Independent Business and the Latino American Political Assn. On Friday during a joint appearance on KNSD, Peters said that his campaign received information about DeMaios campaign plan after the spring break-in of the DeMaio campaign office but that he never looked at it and instead had it turned over to police. DeMaio responded that Peters admission is proof that the break-in was \"politically motivated.\", Jess Durfee, chairman emeritus of the county Democratic Party, led a protest outside a DeMaio fundraiser where the headliner was House Speaker John Boehner. Protesters waved signs, including one that read \"Dirty DeMaio.\", Local Republican leader Tony Krvaric said he is confident that voters will reject the sex allegations against DeMaio as a vile smear campaign against a proven reformer. tony.perry@latimes.comTwitter: @LATsandiego, 3:10 p.m. PST: This post has been updated with a new quote from Republican leader Tony Krvaric. This post was originally published Oct. 18 at 10 a.m.]", "Date": "20141018", "Author": "[Tony Perry]", "Link": "http://www.latimes.com/local/politics/la-me-pol-52nd-congress-san-diego-20141019-story.html", "Title": "[Costly, nasty battle rages in San Diego race for Congress]"}