{"Content": "[ More than 9 million people nationwide already have voted in the midterm elections that will come to a close next Tuesday, and efforts to analyze the early vote trends have opened a whole new field for political spin. The prime example comes from Florida, a state known for its extremely close elections as well as extensive efforts by both sides to turn out early voters. Both major parties love getting voters to the polls early, which greatly reduces the number of people who need to be canvassed on election day. Voters may like it too. Casting a ballot early generally brings an end to robo-calls and campaign mailers to the voters home, leaving only the constant television commercials as reminders of a particularly nasty and intense campaign. The marquee race in Florida is the contest for governor between the incumbent Gov. Rick Scott (R) and his predecessor, Charlie Crist, a former Republican running as a Democrat. Scott beat his Democratic opponent four years ago by about 61,500 votes out of nearly 5.5 million cast. Polls show the current contest razor-thin. About 2 million Floridians already have cast ballots. Thats more than a third of the total who voted in the 2010 midterm elections. The state allows two methods of early voting  mail-in ballots, which Republicans have tended to dominate in recent elections, and in-person early voting, which tends to bring out Democrats. Both Democrats and Republicans agree on that much. After that the spin begins. Republicans point to the raw vote totals. As of Tuesday morning, according to an analysis by the Miami Herald, registered Republicans casting early ballots outnumbered registered Democrats by 142,787. No one knows for whom those people voted, of course, since the ballots wont be counted until election night. But given partisan patterns, its a fair bet that nearly all voted the party line. Advantage Rick Scott, the Republicans say. Democrats scoff: Republicans in Florida always lead in the initial early vote, they say, pointing to statistics from previous midterm elections, many of which the GOP went on to lose despite leading in the early vote. The real indicator, according to the Democrats, is the shrinking size of the GOPs lead. In an analysis Monday, Steve Schale, the Democratic strategist who helped guide President Obamas two victories in the state, noted that the Republican lead of just over 7% was far below the 17% margin the GOP held at this point in 2010. \"Democratic turnout is definitely better than 2010  and the gap continues to close,\" Schale wrote. All those prognostications should be taken with a grain or two of salt, notes Michael McDonald, associate professor at the University of Florida, whose Elections Project is the countrys leading site for voting statistics. Florida adopted rules in 2012 that allowed people to gain semi-permanent status as absentee voters. That may have changed voting behavior enough to invalidate comparisons with previous elections, McDonald noted in a Twitter message. So to find out who wins this one, Florida voters and the legions of political analysts nationwide may just have to wait until the votes are counted Tuesday night. Or, given Floridas history with close races, maybe even later. For more on politics and policy, follow @DavidLauter on Twitter. ]", "Date": "20141028", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-early-vote-20141028-story.html", "Title": "[9-million-plus votes cast already; statistics create new field for spin]"}