{"Content": "[ To call it a profitable year for Bill and Hillary Rodham Clinton would be an understatement. The couple has banked more than $25 million since the start of 2014 through giving speeches alone, a federal disclosure shows. They traveled the world, from Los Angeles to Edmonton to Orlando, collecting an average of $250,000 per appearance. They collected their speaking fees from buttoned-down companies like GE and Bank of America, the lesser-known Institute of Scrap RecyclingIndustries and a firm called Salesforce.com. The former president and his wife, a candidate for the 2016 Democratic presidential nomination, hit the speaking circuit hard, appearing before audiences to deliver remarks 100 times in 17 months. Sometimes they could not even be at the event in person. But that did not stop the sought-after political heavyweights from capturing a windfall in speaking fees. Novo Nordisk in Mexico City paid a $125,000 honorarium to watch Hillary Clinton over satellite. The California Medical Assn. gave her $100,000 for an appearance beamed in electronically to San Diego. Clinton revealed the payments Friday night, as part of a campaign disclosure candidates must file with 30 days of launching their run for office. The filing also showed that sales of her newest book, \"Hard Choices,\" are adding considerably to the Clinton fortune. She reported collecting more than $5 million in royalties. But it is the speaking fees that threaten to make things awkward for her on the campaign trail. The eye-popping amounts the Clintons have collected -- mostly from companies with considerable business before the federal government -- drew rebukes from political opponents. Republicans were quick to roll out the recent footage of Bill Clinton telling an NBC News reporter that collecting the fees was necessary because the family needs to pay its bills. \"The Clintons claim that staggering amounts of income from paid speaking fees that raise ethical questions and potential conflicts of interest is simply to pay our bills shows how out of touch theyve truly become, said Republican National Committee Chairman Reince Priebus. The disclosure is sure to be another distraction for Hillary Clinton, who is focusing her run on everyday Americans and has made campaign finance reform a key part of her platform. Republicans are delighting in the contrast between the ultra-wealthy Clinton and the struggling middle-class workers her campaign invites to roundtables with the candidate. The steep speaking fees have been a source of unwanted attention for the Clintons in the past, which they have deflected by noting that much of the money went to their family foundation. But lately, the foundation itself has become a magnet for controversy. Clintons campaign has had to mount a spirited defense against allegations that the millions of dollars in foreign donations the foundation accepted while she was secretary of State reflect a conflict of interest. The transactions are detailed in the recently released book \"Clinton Cash,\" by conservative author Peter Schweizer. He acknowledges that he did not uncover the Clintons engaging in any criminal activity. Staff writer Kurtis Lee in Los Angeles contributed to this report. @evanhalper, 7:15 p.m.: This story has been updated with background on the Clinton familys foundation. This story was originally published at 6:55 p.m.]", "Date": "20150515", "Author": "[Evan Halper]", "Link": "http://www.latimes.com/nation/la-na-hillary-clinton-financial-disclosures-20150515-story.html", "Title": "[Clintons made $25 million in year of giving speeches, filing shows]"}