{"Content": "[ Abraham Lincolns Emancipation Proclamation provides the foundational precedent for President Obamas executive order on immigrants in the country illegally. Before Lincoln issued his pronouncement in September 1862, congressional majorities had expressly affirmed that the war effort only aimed to preserve the Union without overthrowing  established institutions in the rebel states. The proclamation was an act of executive unilateralism, and as Obama has done in his order, Lincoln limited its scope in recognition of this fact. As a result, both proclamations serve only to initiate, rather than preempt, further democratic debate and decision. Lincoln did not try to free any blacks in the four slave states that remained loyal to the Union. Nor did he even liberate slaves in the Southern areas under federal control. Instead, the proclamation only affected those areas that remained in active rebellion on New Years Day 1863. Even where it applied, it did not commit the country to unconditional emancipation. Lincoln acted only in the name of military necessity, leaving it unclear whether Southern states could constitutionally reinstate slavery once the fighting came to an end. As the war wound down, many wanted to defer this issue for at least five years. But the proclamation prevented this evasion, forcing the question to the center of public attention. Congress first moment of truth came before the 1864 elections, when the 13th Amendment, which would authoritatively free the slaves, came to the floor. But in April 1864, the House rejected the measure. By voting no, Democrats sympathetic to the South deprived the initiative of the requisite two-thirds majority. The Democrats decision made the emancipation amendment a central issue in the November elections  with their presidential candidate, Gen. George McClellan, supporting his partys congressional position throughout the fall campaign. The Democrats changed their tune only after their decisive defeat at the polls by Lincolns Republicans. When the 13th Amendment returned for consideration during the lame duck session of Congress, enough Democrats changed their votes to give the initiative the two-thirds majority required to send it onward to the states. The subsequent enactment of the amendment, however, did not conclude the debate that Lincoln had begun. In his proclamation, he promised to recommend that all loyal citizens be compensated for all losses including the loss of slaves. This recommendation provoked a further round of argument that only ended in 1868 when the 14th Amendment rejected Lincolns proposal, expressly denying all compensation to slaveholders for their newly emancipated freedmen. Particulars in Obamas proclamation may well be changed by Americans over time. But like Lincolns, its provisional and limited character will have a democracy-forcing effect  spurring officials and citizens to more actively engage in a constitutional dialogue. Rather than refusing to follow the Constitution and take care that the laws be faithfully executed, the president emphasizes that he will continue deportations, using all the budgetary resources Congress has provided. But those appropriations cover the annual removal of only 400,000 of the 11.3 million immigrants in the country illegally. Given this fact, Obamas initiative has a constitutionally legitimate purpose: to prevent Homeland Security from wasting its scarce resources on breaking up innocent families when it could be targeting immigrants who deserve expeditious removal. This constrained exercise of constitutional and statutory discretion will force both political parties down Lincolns path, requiring tough decisions they might otherwise evade: Will the Republican candidates for president and Congress, like the Democrats in 1864, run their next campaign on a platform repudiating Obamas proclamation? If so, will the Democrats of 2016 defend it? If so, how will voters respond?, The democracy-forcing aspect of Obamas initiative distinguishes it from other recent exercises in executive unilateralism. The presidents decision to begin an open-ended war against Islamic State, for example, represents the imperial presidency at its worst. It is neither conditional nor provisional. To the contrary, Obama is ignoring the War Power Acts explicit requirement that presidents gain congressional assent to their initiation of hostilities within 60 days. Rather than provoking debate, his assertion of power allows Congress to defer a considered decision on the war to the indefinite future. Serious constitutionalists should oppose such unilateralist assertions as a breach of fundamental principle. But they should not confuse the issue by denouncing the president as imperial when he is engaging in democracy-enhancing actions fully consistent with his obligation to take care that the laws be faithfully executed. Bruce Ackerman, a professor of law and political science at Yale, is the author of \"We the People: The Civil Rights Revolution.\", Follow the Opinion section on Twitter @latimesopinion]", "Date": "20141121", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-ackerman-obama-immigration-20141123-story.html", "Title": "[Like the Emancipation Proclamation, Obama's order forces democracy]"}