{"Content": "[ President Obama inserted himself deeply into the election season from this remote locale on Monday, blasting the political rhetoric of Republican presidential candidates and what he called a culture of outrageous attacks tolerated by the GOP. He singled out the weekend charge from White House hopeful and former Arkansas Gov. Mike Huckabee, who said that through the proposed international nuclear deal with Iran, Obama will take the Israelis and basically march them to the door of the oven. The president called Huckabees stark comparison to the Holocaust part of a general patternthat would be considered ridiculous if it werent so sad. Weve had a sitting senator call John Kerry Pontius Pilate. Weve had a sitting senator who also happens to be running for president suggest that Im the leading state sponsor of terrorism, Obama said, referring to Sens. Tom Cotton of Arkansas and Ted Cruz of Texas, respectively. These are leaders in the Republican Party. TRAIL GUIDE: Daily tour through the wilds of the 2016 presidential campaign >>, Obama has remained tight-lipped about the back-and-forth within the Republican presidential field until now, but the question about Huckabee during a news conference here unleashed a flood of sentiment that made clear he has been closely following this early stage of next years election. With his indictment of candidates and party leaders in the middle of his five-day trip to Africa, he waded into the campaign conversation and suggested that he is doing so out of concern about who will succeed him. Republican leaders are shocked, Obama said, when tycoon Donald Trump, whos leading the GOP field in polls, questions the heroism of Republican Sen. John McCain, a prisoner of war in Vietnam. Yet that arises out of a culture where those kinds of outrageous attacks have become far too commonplace and get circulated nonstop through the Internet and talk radio and news outlets, the president said. But, the president said, when he is attacked, the people who were outraged on McCains behalf are pretty quiet. Huckabee may have simply been trying to push Trump out of the headlines, Obama said, adding that that doesnt reflect positively on his leadership. The rumination was part of an Obama pattern of late. He has shown more comfort in speaking frankly, whether it be reflections on his own performance in office, or the controversy surrounding Bill Cosby as dozens of women have come forward with rape accusations. Just a week ago, at a news conference to discuss the Iran deal, Obama flatly refused to respond to a question about Trump. The uptick in rhetoric from the crowded Republican field of 16 candidates, who have in recent days sought to draw attention through viral videos and other stunts, perhaps prompted a change of heart. Huckabee seized on Obamas comments, replying in a statement from his campaign that Obama underestimates Iran. \"Whats ridiculous and sad is that President Obama does not take Irans repeated threats seriously, Huckabee said. Personal attacks dont help voters, Obama said at the news conference. Part of what has made America great, he said, is a recognition that these issues are too serious, that issues of war and peace are of such grave concern and consequence ... that we dont play fast and loose that way. ... We have robust debates ... but we just dont fling out ad hominem attacks that way, because it doesnt help inform the American people. In 18 months, he said, Im turning over the keys, and would like to make sure Im turning over the keys to somebody who is serious. That requires on both sides, Democratic and Republican, a sense of seriousness and decorum and honesty. For more White House coverage, follow@cparsons, ALSO:, Clinton says she did not send classified information over private email system, Question for governors: Why should you be president when your own constituents dont like you?, At Texas-Mexico border, Donald Trump cites great danger from immigrants, 7:54 a.m.: This article has been updated with Huckabees response. This article was originally published at 6:31 a.m.]", "Date": "20150727", "Author": "[Christi Parsons]", "Link": "http://www.latimes.com/nation/la-na-obama-huckabee-republicans-20150727-story.html", "Title": "[Obama: Huckabee's 'oven' comment shows pattern of GOP's 'outrageous attacks']"}