{"Content": "[ SACRAMENTO  Four years after calling for \"courage and sacrifice\" to dig California out of the depths of recession, Jerry Brown begins an unprecedented fourth term as governor Monday amid an economic rebound that has delivered near-record job growth and a state budget surplus. Ironically, those good fortunes are among many forces that could undercut, or certainly test, the Democratic governors ability to accomplish a series of goals that have been years in the making. Brown has pledged to avoid the temptation of launching costly new programs and to march forward on those already underway: building a bullet-train network, retooling state waterworks, reducing carbon emissions and addressing the towering costs of retirement benefits for public employees. The day after his November reelection, Brown said he was \"not going to get inhibited from doing great things.\", But new legislative leaders have vowed to restore services for the needy that were decimated during the recession, potentially diverting effort and money from other causes, and have their own ideas for reducing pollution and enhancing transportation. The University of California regents drew Brown into a firefight over higher education funding when they voted recently to increase tuition. And President Obamas executive action on immigration could lead to hundreds of millions of dollars in unanticipated state spending. \"The problem always is there are a lot of hungry birds in the nest that want to get fed,\" said outgoing state Treasurer Bill Lockyer, a Democrat, who has also served as state attorney general and leader of the state Senate. In the twilight of a political career that has spanned nearly half a century, Brown knows his agenda also could be at the mercy of unforeseen events. During his first stint as governor, in the 1970s and 80s, California voters passed Proposition 13, which changed the states financial structure by limiting property tax revenue, and a Mediterranean fruit fly infestation threatened the $43-billion-a-year agricultural industry. \"Ive learned that second terms can surprise,\" Brown told reporters last month. After being sworn in Monday, he will address a joint session of the Legislature. The unexpected surfaced soon after the election. The UC regents announced a plan to raise tuition up to 28% over the next five years. Preventing the increase, which they say is needed to cover retirement benefits, hire new instructors and expand enrollment, would cost $100 million in the next state budget. The outcry from students could increase pressure on Brown to boost funding more than he planned. He has said he doesnt want tuition to go up, and he notes that he gave the UC $142 million more in the current budget year than in the last. \"Hes looking at a potentially disruptive issue,\" said Barbara OConnor, professor emeritus of political communication at Cal State Sacramento, \"because students are irate, and hes concerned about legacy items like a strong education system.\", Another development, Obamas new immigration policy, could lead to a rapid expansion of the states healthcare program for the poor. Brown touts Californias laws limiting deportations and enabling people in the country illegally to have drivers licenses, but the associated costs have been relatively modest and did not hamper the governors efforts to bridle spending. That would not be the case if his administration determines it should extend Medi-Cal to immigrants protected from deportation under Obamas action. Under current law, those lacking legal residency are not eligible for Medi-Cal, which is funded by the federal and state governments. More than a million immigrants in California could remain in the country under the presidents action. But it is unclear how many might be eligible for Medi-Cal; some may have health insurance from their employers or earn too much to qualify. Because of the uncertainties, the potential cost of a Medi-Cal expansion has not been calculated, according to H.D. Palmer, spokesman for Browns Department of Finance. The administration has not \"affixed a specific number to the proposal, either in dollars or the number of individuals that may be affected,\" pending further guidance from Washington, he said. In addition, leaders of the Democrat-controlled Legislature want to raise reimbursement rates to healthcare providers in the Medi-Cal program, which could cost roughly $300 million. The issue is likely to persist as a flashpoint between Brown and members of his own party. Some Democrats have also been pressing for more social services since the economy began to recover. Now that it has rebounded, the state has the money and the obligation to help Californias most vulnerable  children living in poverty  said state Sen. Holly Mitchell (D-Los Angeles). \"The governor cant keep singing the same song\" about belt-tightening, said Mitchell, who before being elected to the Legislature directed an organization that helped children and families. \"Weve got to address the 2 million kids who live in poverty. If we dont, they wont get out.\", Brown and the Legislature should devote more money to early childhood care and education for newborns to 5-year-olds, because \"they dont get do-overs,\" she said. Democrats are also making plans to extend the temporary tax increase voters approved in 2012, when Brown told them it would help to avoid yet another round of cuts in education funding and other needs. The governor has put a spike though the idea of extending the taxes, which are slated to begin expiring in 2016, even though legislative analysts have noted the possibility of a downturn in coming years. \"It will be tight,\" Brown said. Although deficits have faded, California is still in the grip of a drought. The recent rains and a $7.5-billion water bond approved by voters in the fall have done little to alleviate the damage sustained by farmers and water-poor towns in the states midsection, and the ultimate price tag for helping them is unclear. Browns final term may be his last chance to modernize the system that sends some Northern California water to thirsty farms and cities farther south. But his proposal to build enormous twin tunnels under the Sacramento-San Joaquin River Delta faces resistance. Some farmers worry that construction could damage their lands and the south could more easily help itself to delta water. Some environmentalists fear the project would further degrade the deltas ecology. The fate of the project, enabled by state lawmakers in 2009, now rests in the hands of federal and state regulators. Federal cooperation is also key to the $68-billion high-speed rail system. A groundbreaking ceremony is scheduled for Tuesday in Fresno, and billions of dollars in state and federal money have been lined up to begin construction. But finishing the rail line from Los Angeles to San Francisco is expected to require more money from Congress, where Republican leaders oppose the project. Brown has described the opposition as \"small-minded\" and has repeatedly asked Californians to trust that he has the skill to navigate the issue after many decades in public life. \"Youve got to be tough, youve got to be persistent, and I didnt get to my fourth term by being hesitant or weak-willed,\" he said the day after his reelection. He added, \"A fresh face can often be exhilarating. But theres no substitute for experience.\", Twitter: @chrismegerian, @melmason, Times staff writer Phil Willon contributed to this report.]", "Date": "20150104", "Author": "[Chris Megerian, Melanie Mason]", "Link": "http://www.latimes.com/local/education/la-me-pol-brown-agenda-20150104-story.html", "Title": "[Potential hurdles loom for Gov. Jerry Brown's fourth-term goals]"}