{"Content": "[ Large numbers of Democrats key to a Hillary Rodham Clinton victory in the 2016 presidential election will take to the streets this weekend to protest a sweeping Pacific free-trade pact that has newfound momentum in Congress  but dont look for the candidate to be marching with them. Less than a week after Clinton launched her candidacy, her effort to run a campaign with populist appeal is hitting an awkward patch. The bipartisan deal on Capitol Hill that would give President Obama authority to cement a long-delayed Trans-Pacific Partnership puts the spotlight on an uncomfortable issue for the candidate. Clintons record of promoting the trade pact is a source of bitterness on the left. The congressional support for the deal is stirring up long-held resentment among labor leaders over President Clintons signing of the landmark North American Free Trade Agreement, which Hillary Clinton supported at the time. The labor unions and environmental groups opposed to the Pacific deal do not take the issue lightly. The AFL-CIO has suspended all giving to federal candidates to focus its political activity on stopping it. \"The politics around trade has always been tough, particularly in the Democratic Party, because people have memories of outsourcing and job loss,\" Obama said Friday when asked by a reporter about the deal and whether he needed Clintons support to complete it. Obama offered a lengthy and detailed response, but he did not answer the part of the question about Clinton. For her part, Clinton is treading cautiously. \"The goal is greater prosperity and security for American families, not trade for trades sake,\" said Clinton spokesman Nick Merrill. \"She will be watching closely to see what is being done to crack down on currency manipulation, improve labor rights, protect the environment and health, promote transparency and open new opportunities for our small businesses to export overseas.\", The assurances are unlikely to calm restive liberals seeking to block the legislation moving through Congress. Congress could be asked to approve a final deal just as Democratic primary voting is getting underway next year. If Clinton were to embrace the pact, it would go against the tide of Democrats aligning themselves with labor on this issue and leave potential challengers an opening for attack  but it could also give Clinton a boost. It may ultimately be her opportunity to show independence from big Democratic special interests while keeping them close through core issues such as minimum wage and climate change. Though the Trans-Pacific Partnership is hardly bright on the radar of most Americans, Democrats seeking to disrupt Clintons march to the nomination and win it themselves are doing their best to put it there. \"My strong hope is that Secretary Clinton and all candidates, Republicans and Democrats, will make it clear that the Trans-Pacific Partnership should be rejected and that we must develop trade policies that benefit working families, not just Wall Street and multinational corporations,\" said Sen. Bernie Sanders, the independent liberal Vermonter positioning himself for a run. Former Maryland Gov. Martin OMalley built a fundraising pitch around his effort to stop the agreement. Union members plan to hold dozens of protests against the pact across the country Saturday. The events follow the 86,000 calls to members of Congress they have logged and petitions with tens of thousands of signatures. Defeating the trade pact is a signature cause of progressive standard-bearer Elizabeth Warren, the Democratic senator from Massachusetts. In a playful YouTube video, former Secretary of Labor Robert Reich, who helped President Clinton negotiate NAFTA, uses an easel, drawing paper and a magic marker to explain why the Pacific agreement is \"the worst trade deal youve never heard of.\", Clintons allies argue her wait-and-see approach is reasonable. \"She and I  and her husband  have been talking about these issues for well over 20 years,\" a leading Democratic proponent of the trade pact, Sen. Ron Wyden of Oregon, said at a breakfast Friday hosted by the Christian Science Monitor. \"Shes been a candidate for five days.\", The candidate has a nuanced history with free trade. During the 2008 Democratic primary, both she and then-Sen. Barack Obama campaigned as trade skeptics. But their positions changed once Obama was in the White House and Clinton was his secretary of State. There, the two worked together to advance the Pacific trade pact. \"She was very closely associated with this,\" said Scott Miller, an international trade expert at the Center for Strategic and International Studies. Clinton championed the pact in a long piece she wrote for Foreign Policy magazine in 2011, saying it would \"bring together economies from across the Pacific. Our goal is to create not just more growth, but better growth.\", A retreat would be a major pivot away from her own legacy and her husbands. But the Democratic appetite for free trade has diminished along with the number of centrists in the party. That much was clear Friday morning in the way Wyden pitched the Pacific pact. He said it looks nothing like the agreements negotiated under President Clinton. \"We produced a proposal that is very different than trade policy in the 1990s,\" he said. \"The reference point for Democrats is really the 90s and NAFTA and the Clinton deals. This is very different.\", evan.halper@latimes.com, Twitter: @evanhalper, Times staff writer Lisa Mascaro contributed to this report.]", "Date": "20150418", "Author": "[Evan Halper]", "Link": "http://www.latimes.com/nation/politics/la-na-trade-clinton-20150418-story.html", "Title": "[Pacific trade pact a tricky issue for Hillary Clinton's candidacy]"}