{"Content": "[ As congressional Republicans find themselves tangled over their newly introduced spending plans, President Obama tried Wednesday to seize the moment to talk about government spending on his terms, namely a focus on opportunities for the middle class. Noting that Republican House Speaker John A. Boehner of Ohio often asks, \"Where are the jobs?,\" Obama told a crowd in Cleveland he was there to \"not only answer that question\" but also to renew a central debate over the two major parties economic visions. Obama said that his administrations policies, such as investing in manufacturing and the landmark Affordable Care Act, have helped the nation emerge from a deep recession but that the Republican budget would \"double down\" on the theory that wealth trickles down from the rich to the rest. \"Reality has rendered its judgment,\" Obama said in a speech to the City Club of Cleveland. \"Trickle-down economics doesnt work and middle-class economics does,\" he said, using the White Houses umbrella term for its fiscal policies. Meanwhile, Republicans who have the majority in both chambers of Congress are bogged down in trying to make their budgets workable as well as palatable to the partys competing factions. More than two months into the new Congress, they are grasping for legislative victories and looking to the House and Senate budgets unveiled this week as chances for a win in Washington. The chambers are expected to approve the budgets next week. \"Hopefully that will be an opportunity for us to show some success,\" said GOP Sen. Bob Corker of Tennessee. Republicans are trying to present a unified front in their budget proposals, as internal debates have spilled out publicly between defense hawks, who want to bolster military coffers, and deficit-minded conservatives, who prefer to hold the line on new spending. Although both of the partys budgets largely boost military spending at the expense of domestic social programs, House and Senate Republicans are at odds over how to accomplish that goal while still adhering to strict budget caps agreed to in a 2011 deal with the White House. Senate Republicans made clear Wednesday that they view the House approach as essentially a gimmick. It calls for hiking defense spending by increasing money for an account used for wars that was not subject to the so-called sequester limits established in the 2011 deal. Senate Republicans prefer establishing a separate, new defense account funded with unspecified savings elsewhere, but it also would not be held to the 2011 caps. Either way, those cause \"real heartburn for conservatives\" because they maneuver around the limits, Rep. Tim Huelskamp (R-Kan.) said. Those differences and others  including the Houses proposed Medicare overhaul that the Senate rejects  risk leaving the GOP unable to pass one budget. Such a setback would derail not only the goal of increasing Pentagon spending, but also other priorities, including the effort to repeal Obamas healthcare law. \"Im absolutely confident well do our duty,\" said Sen. Roger Wicker of Mississippi, head of the Republican Senates campaign committee. \"Its one of the most important votes well have this year.\", The GOPs scramble to make the numbers add up with concrete legislative proposals while Obama spoke in broad, aspirational terms further illustrated the contrast between the White House and Republicans who control Congress. Obama no longer has to worry about being reelected, and since the November midterm election has made full use of the presidential bully pulpit to present his vision for the country without necessarily fretting over the short-term political consequences for him or his party. On Wednesday, he said he wanted to \"take a little credit\" for the nations economic recovery. Republicans have been loath to acknowledge any role Obamas policies might have had in the nations improved economic picture, with deficits on the wane and rising confidence among voters. \"Republicans are proud to take credit for helping force some fiscal responsibility on the Obama administration,\" Senate Majority Leader Mitch McConnell (R-Ky.) said Wednesday as his partys Senate majority released its budget for the fiscal year that begins in October. The White House countered that the House GOP is trying to balance the budget in part by further slashing investments that would benefit the middle class. \"House Republicans start their deficit reduction plan by promising large, expensive new tax cuts to high-income households,\" White House spokesman Josh Earnest said. \"In fact, the only specific tax proposals in the House Republican budget are tax proposals that benefit the wealthy.\", White House officials are eager to promote the notion that Obama has kept Republicans on their heels with a vigorous start to what he calls the \"fourth quarter\" of his term, a time when presidents often see their influence wane. Obama began the year with campaign-style trips in the run-up to a State of the Union address that challenged Congress new Republican majorities on a host of domestic issues. Democrats who shied away from the president before the midterm election now praise Obamas approach. Some, including Sen. Bernie Sanders (I-Vt.), who is the Democrats ranking member on the Senate Budget Committee, have more leeway to push the party toward even more liberal policies. \"The president feels liberated,\" said Sen. Richard J. Durbin of Illinois, the assistant Democratic leader in the chamber. \"He doesnt have to measure his actions against the impact on a campaign, and there are many things that he wants to say to the American people in the last two years of his presidency.\", michael.memoli@latimes.com, lisa.mascaro@latimes.com, Memoli reported from Cleveland and Mascaro from Washington. Staff writer Christi Parsons in Washington contributed to this report.]", "Date": "20150318", "Author": "[Michael A. Memoli, Lisa Mascaro]", "Link": "http://www.latimes.com/nation/la-na-competing-budgets-20150319-story.html", "Title": "[Obama touts economic policies as Republicans fight internally over budget]"}