{"Content": "[ In the aftermath of their crushing defeats in Tuesdays election, Democratic elected officials and strategists have grown increasingly vocal in their complaints about President Obama. The latest salvo comes from Stan Greenberg, the prominent Democratic pollster who conducts surveys for, and is politically close to, the House Democratic leadership. On the central issue of the economy, Greenberg said, Obama was \"out of touch\" and \"tone deaf\" in his insistence on talking about a recovery that many voters dont feel. Middle-class and working-class voters, whose support the Democrats need, \"are living in a different economy than hes speaking of,\" Greenberg said in a briefing for reporters on an election day poll he had conducted. \"He isnt speaking to the main economic problem,\" Greenberg said, adding that the lack of an economic message directed at the anxieties of average families had contributed heavily to low turnout of Democratic voters. Obamas speeches on the economy always include a line about more progress being needed, but they tend to stress the progress the economy already has made. \"The country as a whole has made real progress,\" he declared at a campaign event in Bridgeport, Conn. on Sunday, two days before the election -- a speech much like others he made in the last couple of months. \"When I came into office, we were seeing the worst economic crisis in our lifetimes. Unemployment was about 800,000 per month, we were losing jobs,\" Obama said. \"And over the past 4 1/2years, America has created more than 10 million new jobs. Weve created more jobs than Japan, Europe and all the advanced countries combined,\" he said. \"Theres almost no economic measure where we are not doing better now.\", Greenberg contends that remarks of that sort turn voters off. He made a similar critique in late 2011 and early 2012 when he thought Obamas insistence on talking about recovery was endangering the presidents reelection. During the subsequent campaign, Obama shifted his language, talking less about the nascent recovery and more about the struggles to make ends meet that many families continued to face. This year, however, as the job market has continued to improve -- the unemployment rate fell to 5.8% on Friday -- Obama has moved back toward a sunnier view of the economy. White House advisors have argued that at this point, six years into his presidency, Obamas political standing rises or falls on how the public views the economy. Because of that, the president is right to emphasize the improving numbers, they say. Moreover, polling experts and political strategists alike have wondered why Obama doesnt get more credit for the economic expansion that is now well into its fifth year and showing some signs of accelerating. Polls continue to show large majorities believe that the country is headed in the wrong direction and that the next generation will have a lower standard of living than the current one. One theory has been that after the deep shock of the worst recession since the 1930s, public opinion will not adjust until people have seen several years of steady economic growth. Another school of thought focuses on incomes, which have remained stagnant for most people ever since the late 1990s even as the unemployment rate has dropped. Although the economy has gained ground in recent years, nearly all the income and wealth gains have gone to those at the top of the economic ladder. The argument over how to talk about the economy -- and more importantly what to do about it -- has a strong bearing on the 2016 presidential campaign. The Democratic nominee, whether it beHillary Rodham Clinton or someone else, will need to \"differentiate ... from the president on the economy,\" Greenberg said. For more on politics and policy, follow @DavidLauter on Twitter.]", "Date": "20141108", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-blaming-obama-20141108-story.html", "Title": "[Obama was 'tone deaf' on economic message, Democratic strategist says]"}