{"Content": "[ As he searches for his fourth Defense secretary in six years, President Obama appears to be looking for a more forceful, articulate military leader to navigate the tough but limited wars that are likely to consume much of his final two years in office. Finding a candidate with deep Pentagon experience who can help set a coherent strategy and defend it to the public and Congress wont be easy. Only a day after the job came open, two leading prospects  former Undersecretary of Defense for Policy Michele Flournoy and Sen. Jack Reed (D-R.I.)  took themselves out of the running to replace Chuck Hagel, whose departure Obama announced at the White House on Monday. That leaves Ashton Carter, who was deputy secretary of Defense from 2011 to 2013, as one of the few contenders with the qualifications Obama appears to be seeking. In his previous two nominees, Obama placed little priority on Defense Department experience, focusing on someone who could oversee the withdrawal of troops from Iraq and Afghanistan. Hagel was a retired Republican senator from Nebraska who was critical of the wars of the last decade, while Leon E. Panetta, who preceded him, had been director of the CIA and had little background in military affairs. Obama is now facing a different environment. With U.S. forces engaged in military operations in Iraq and Syria, and an incoming Republican majority in the Senate already questioning the administrations handling of the conflicts, he needs a Defense secretary who can explain the strategy to Congress and better direct the military, current and former officials say. \"The president clearly wants someone who can be more forceful and win a public debate defending his policies,\" said Lawrence J. Korb, a former assistant secretary of Defense whos currently a senior fellow at the Center for American Progress. \"He wants someone who looks good on the Sunday talk shows.\", Flournoy, who has long been considered a contender for the post, said in a letter Tuesday to the board of the Center for a New American Security, the think tank she heads, that she asked Obama not to consider her for the post, citing \"family considerations,\" according to a person familiar with the matter who asked for anonymity to discuss the private communication. With Flournoy out of the running, a top White House staffer said that Obama was still considering \"a number of well-qualified candidates.\", White House Press Secretary Josh Earnest emphasized that Obama was not looking for someone to take the Pentagon in a new direction, but rather to carry out \"the strategy that the president has selected.\" A top priority is dealing with Islamic State militants who have seized control of large parts of Iraq and Syria, Earnest said. Carter, 60, a theoretical physicist and former Harvard University professor, spent years in the Pentagon through two administrations, rising to deputy Defense secretary before leaving last year. He is known as a bold thinker who understands the Pentagon well and would not likely run into trouble winning Senate confirmation. He was confirmed unanimously by the Senate for both the No. 2 and No. 3. Pentagon positions. When Carter resigned from the Pentagon in 2013, Sen. John McCain (R-Ariz.) praised him lavishly. Now McCain is the incoming chairman of the Senate Armed Services Committee, which will hold hearings on the next Pentagon nominee. \"On many issues relating to defense and national security, Ash and I have had our differences,\" McCain said at the time. \"Some have been profound. But Ash has always conducted himself in a manner that appreciated the valid concerns underlying opposing views.\", Obama could also look outside to a candidate like retiring Sen. Carl Levin (D-Mich.), chairman of the Senate Armed Services Committee, who isnt as likely to challenge the administrations current policies and is well respected in Congress. Jeh Johnson, the current Homeland Security secretary and former general counsel for the Pentagon, is also said to be under consideration. Whoever is tapped for the job will need to be comfortable working closely with the presidents national security staff. Panetta and another former Defense secretary, Robert M. Gates, both complained in autobiographies about what they saw as White House micromanagement of the military. \"Whats most needed is a secretary who will challenge assumptions and ask tough questions about policies for issues like [Islamic State] and Afghanistan, and help avert group-think,\" said Stephen D. Biddle, a military expert with the nonpartisan Council on Foreign Relations. \"Im not sure thats what the White House wants, though.\", It can be hard to predict how a new Defense secretary will affect policy decisions in the administration. When former President George W. Bush chose Gates to head the Pentagon during the height of the Iraq war, it was widely assumed Gates would push quickly to scale down the U.S. troop presence in Iraq. Gates instead became a strong advocate for sending more troops to Iraq. After staying on under Obama, he backed the militarys request to send more troops to Afghanistan, persuading Obama to back the increase, a decision Obama later came to regret. Rear Adm. John Kirby, a Pentagon spokesman, rebuffed questions at a news conference Tuesday about whether Hagel had been forced out because of policy disputes. Among other things, the White House was said to be impatient about the slow pace of prisoner transfers from the U.S. military prison at Guantanamo Bay. In October, a rift emerged after Hagel penned a two-page memo  leaked to the press  criticizing the administrations approach to Syria. \"This was a mutual decision arrived at between the president and the secretary of Defense after a series of discussions that they had about the next two years,\" Kirby said, declining to say more about the discussions. Hagels departure is not a sign of coming changes to the U.S. strategy for fighting Islamic militants in Iraq and Syria, Kirby added. If Obama chooses Carter, he comes into office with far more recent Pentagon experience than Hagel had and close ties with senior military commanders. Carter, who has a doctorate from Oxford University, joined the Pentagon during President Clintons first term as assistant secretary of Defense for international security policy, an influential position following the collapse of the Soviet Union. Carter worked to ensure the Soviets nuclear weapon stockpile did not fall into foreign hands. Carter came back to the Pentagon in 2009, serving as chief weapons buyer overseeing projects like the $400-billion F-35 Joint Strike Fighter program. He rose to deputy Defense secretary, but left for Harvard after being passed over for the top spot. Carter could prove to be more aggressive than the often self-effacing Hagel was in defending the administrations policies in public and at pushing back against White House attempts to keep tight limits on military operations. Inside the Pentagon, other choices include Navy Secretary Ray Mabus, who has been discussed as a candidate in the past. Robert O. Work, the current deputy Defense secretary, is also a contender. \"The White House has shown they want someone who is onboard with their current policies,\" said Mackenzie Eaglen, a defense analyst with the American Enterprise Institute. \"They might not know exactly who they want for the job at this point, but theyre just sure they dont want Chuck Hagel.\", william.hennigan@latimes.com, david.cloud@latimes.com, Christi Parsons and Michael A. Memoli in Washington contributed to this report.]", "Date": "20141125", "Author": "[W.J. Hennigan, David S. Cloud]", "Link": "http://www.latimes.com/nation/la-na-defense-pick-20141126-story.html", "Title": "[Obama appears to be seeking a more forceful Defense secretary]"}