{"Content": "[ Secretary of State John F. Kerry, in his first remarks on the controversial prisoner swap involving American soldier Bowe Bergdahl, said if the five released Taliban leaders reenter the fight, they would risk being killed by the U.S. He spoke as reports emerged that Bergdahl, held for five years and released May 31, had been locked in a metal cage for long periods as punishment for trying to escape his captors. ------------, FOR THE RECORD, June 9, 1:54 p.m.: An earlier version of this post incorrectly identified Mike D. Rogers (R-Ala.) as the chair of the House Intelligence Committee. Mike Rogers (R-Mich.) is the chair of the House Intelligence Committee. All remarks attributed to Rogers in this post were made by the Michigan congressman. ------------, His release in exchange for fiveGuantanamo Bay detainees dominated the Sunday talk shows amid reports the FBI is investigating death threats against Bergdahls family. Kerry, talking about the prospect of the former Guantanamo Bay detainees returning to the battlefield, said: Im not telling you that they dont have some ability at some point to go back and get involved, but they also have an ability to get killed doing that. He said Qatar, where the Taliban leaders will live for one year, would be monitoring the men and that the U.S. would also keep an eye on them. Nobody, no one should doubt the capacity of America to protect Americans, he added. Kerry, the top U.S. diplomat and a Vietnam veteran, was interviewed on CNNs State of the Union. Sen. John McCain, who was held captive in Vietnam for more than five years, took issue with Kerry in a separate interview on the same program by saying that 30% of the detainees released from Guantanamo Bay had reentered the fight and we certainly havent been able to kill of all them. So what were doing here is  reconstituting the Taliban government, the same guys that are mass murderers, said McCain, an Arizona Republican who was the 2008 GOP presidential nominee. McCain said he had in the past signed off on the outlines of a prisoner swap to retrieve Bergdahl, but not specifically the top five picked by the Taliban. He said those held at Guantanamo Bay were the hardest of the hard-core who became a lot harder after their years in Guantanamo. Others have raised questions about how potentially dangerous the men were. When asked whether reports that Bergdahldeserted his Army unit made him less worthy of rescue, McCain said no. But he added that the obligation to bring back captured military personnel had to be weighed against whether the effort would put the lives of other American men and women who are serving in danger. And in my view, this clearly would, he said. Republican Rep. Mike Rogers of Michigan, who chairs the House Intelligence Committee, decried the prisoner swap that freed Bergdahl, saying he was absolutely convinced some or all of the freed Taliban leaders would join the fight against Americans left in Afghanistan. The released Taliban leaders now are subject to a year-long travel ban intended to prevent them from leaving Qatar. Not all five, but I do believe three for sure, likely four  will probably play some role in active operations, said Rogers, describing the fifth Taliban leader as being on the fence. Rogers, appearing on ABCs This Week With George Stephanopoulos, warned of other dire consequences. This is a huge regional and geopolitical problem for the United States moving forward, he said. Hostages are now currency in this war on terror. Thats always dangerous for both diplomats, air workers, soldiers on the battlefield. He criticized the Obama administration for not doing more to apply pressure on Pakistan to assist in winning the release of Bergdahl, who was reportedly held for a time in Pakistan. \"We never went at Pakistan with any level of pressure to say youre going to have to help us solve this problem,\" Rogers said. \"There were other options on the table.\", Top Senate Intelligence Committee officials, including Sen. Dianne Feinstein, D-Calif. said they had not been briefed by the Obama administration on Bergdahl being tortured or kept in a cage. She chairs the committee, and its top Republican lawmaker, Sen. Saxby Chambliss, R-Georgia, echoed on that. Both said they had heard rumors that Bergdahl had tried to flee and both had concerns about the prisoner swap and the administrations lack of openness with congressional leaders. They spoke on Face the Nation on CBS. Whats unfortunate is that I see no sign of the Taliban relenting, Feinstein said. And so some of us worry very much when we pull out (of Afghanistan) the Taliban finds its way back into power. And that would be tragic. Chambliss said that Bergdahl  who is now being treated in a military hospital in Germany  was released on a Saturday and he and Feinstein were called by the administration the following Monday night. So this administrations acted very strangely about this  and its kind of puzzling as to why they did not let us know in advance that this was going to happen. David Rohde, a Reuters reporter who while working for the New York Times was abducted more than five years ago near the Afghan capital, Kabul, said news reports about Bergdahl enduring harsh treatment sounded very credible to him as he was captured by the same Taliban faction. Rohde, also speaking on Face the Nation, escaped after being held hostage for eight months. He said Bergdahl needs to explain why he left his Army outpost, but cautioned that many rumors surrounded his own kidnapping in 2008. The journalist said he still regrets going to an interview with a Taliban official because of how his abduction affected his family. Talking about Bergdahl, Rohde noted: He will regret this for the rest of his life, I guarantee you. Rohde said he had spoken recently to Bergdahls parents, who are getting death threats and are heartbroken about whats been happening. If any U.S. troops died in the search for Bergdahl, that would break their hearts as well, he said. Also on This Week, Hillary Rodham Clinton said she would not decide whether to run for president in 2016 until the end of this year. The program previewed an interview she gave to Diane Sawyer in advance of the release of Clintons new memoir, Hard Choices, on Tuesday. Clinton said she wanted to take time to travel, sign books and help with midterm elections and then take a deep breath and weigh the pluses and minuses of a White House run. Clinton, former secretary of State, senator and first lady, left open the possibility of testifying before a new House committee gearing up for hearings on the Sept. 11, 2012 attacks in Benghazi, Libya, that left the U.S. ambassador and three others dead. Multiple hearings already have probed the killings, which occurred when she led the State Department. Asked if she would testify before the new panel, Clinton said it would be up to the people running the hearing and whether the review was in the best tradition of Congress, an effort to try to figure out what we can do better. 1:18p.m.: The story was updated to include comments from Hillary Clinton.]", "Date": "20140608", "Author": "[Katherine Skiba]", "Link": "http://www.latimes.com/nation/nationnow/la-na-nn-bergdahl-kerry-taliban-20140608-story.html", "Title": "[Bergdahl case: Kerry says U.S. may kill Taliban 5 if they fight again ]"}