{"Content": "[ Once an afterthought, Latino voters have moved to the center of the 2016 presidential campaign, the object of early and unprecedented courtship by candidates on both sides. The efforts, both substantive and symbolic, reflect a political map that has changed dramatically with the transformation of states such as Nevada, Colorado and others that are no longer the white, Republican bastions of old. President Obama twice carried Nevada, Colorado, Virginia and Florida, thanks in good part to strong support among their growing Latino populations; in Nevada, the Latino share of the vote has tripled in the last 20 years. All four are once more expected to be among the few competitive states in 2016. A key question is whether the eventual Democratic nominee can cement those gains for elections to come, or Republicans can reverse their dismal performance of the last two presidential contests and, by doing so, expand their narrow path to the White House. Republicans seem to stand their best chance in years of harvesting Latino support with the candidacy of Florida Sen. Marco Rubio, the son of Cuban immigrants; and the expected run by the states former governor, Jeb Bush, whose wife is Mexican-born and who is fluent in both the Spanish language and Latino culture. Every week seemingly brings a new Bush appearance before Latino voters  a town hall in Puerto Rico, a speech to evangelical leaders in Houston  where he delivers, in English and Spanish, a message unlike any heard from previous Republican presidential hopefuls. First, though, he and Rubio have to navigate their partys nominating process, a course dominated by white conservatives who favor a hard-line approach to immigration reform, the very issue that has driven so many Latinos into the arms of Democrats. \"In essence, Hispanic voters tell us our partys position  has become a litmus test, measuring whether we are meeting them with a welcome mat or a closed door,\" members of a Republican task force wrote in a postmortem after the partys nominee, Mitt Romney, won fewer than 3 in 10 Latino votes in 2012. The most specific policy recommendation in the 97-page autopsy was support for comprehensive immigration reform, which, translated, means going beyond the law enforcement remedies favored by the partys bedrock supporters. Of the top-tier candidates, only Bush and Rubio have embraced that approach. It was hardly coincidental that Democrat Hillary Rodham Clinton last week unveiled her immigration policy in Las Vegas or that, in doing so, she checked off much of the wish list of Latino activists, including a path to citizenship for millions of people in the country illegally and more compassionate enforcement of the countrys border laws. Nevada enjoys a prominent place on the nominating calendar, now slotted as the third to vote after contests in Iowa and New Hampshire. But more than that, the state mirrors the broad demographic changes that are reshaping politics across the country by the day. In 1994, more than 90% of Nevada voters were white, a number that shrank to 67% in 2012. Over the same period, the Latino share of voters grew from 5% to 15%, a percentage expected to increase further by 2016. (Nationally, Latinos accounted for 10% of the vote in the last presidential race. They are expected to account for nearly half of the growth in the eligible electorate between now and 2030, according to research by the nonpartisan Pew Hispanic Center.), If a Democrat hopes to be president, he or she must not only reassemble Obamas winning coalition, which included Latinos and other minorities, but ensure that those voters turn out in robust numbers. Clintons immigration proposals seem calculated to do just that, leaving Republicans the unpalatable choice of seconding her views  and alienating their conservative base  or rejecting them and risking further estrangement from Latino voters. Nevada offers an object lesson. Last year, with a virtually uncontested governors race and little effort by state Democrats to spur turnout, Latino voters stayed home in droves. As a result, Republicans not only swept every statewide constitutional office, they knocked off a supposedly safe Democratic House member here in Las Vegas and seized control of the state Legislature for the first time since the 1920s. \"Democrats cant take those voters for granted,\" said David Damore, a University of Nevada, Las Vegas, expert on Latino political participation. \"They need to spend money on outreach, get-out-the-vote, Spanish-language advertising. Without them, Democrats dont win.\", Clinton apparently got the message: Two of her first Nevada hires, campaign director Emmy Ruiz and organizing director Jorge Neri, helped Obama win 70% of the states Latino vote in 2012. For Republicans, the imperative is less urgent, given their overwhelming support among white male voters. But their nominee cant afford a Romney-style blowout. Whit Ayres, a veteran GOP pollster working for Rubio, believes the partys eventual nominee will need to win more than 40% of the Latino vote to carry the White House, a performance only two Republicans  Ronald Reagan and George W. Bush  have approached in the last 35 years. (Obama won 67% of the Latino vote in 2008 and 71% in 2012.), This time Bushs brother, Jeb, has been most conspicuous in his courtship of Latino support. \"Were an immigrant nation and we should be proud,\" he recently told supporters during a stop in Puerto Rico. \"I know about the immigrant experience because I married a beautiful girl from Mexico. My children are bicultural and bilingual.\", Rubio, of course, neednt reach to make that cultural connection. If anything, he seems to downplay his Latino heritage as he appeals to white conservative audiences. But implicit in his very candidacy is the chance for Republicans to make history by nominating their first-ever minority standard-bearer, who, as a youthful Latino, reflects the demographic wave inexorably remaking the country, state by state. For decades, Latinos were characterized  patronized, some said  as a slumbering giant: large in number, potentially powerful but largely apathetic and politically impotent. No more. Now voters such as Santos Garcia have become highly sought-after. \"Theyre going to want our support,\" said Garcia, a 59-year-old kitchen worker at Harrahs casino on the Las Vegas Strip. \"Without the Spanish vote they know they cant win. So theyre going to come look for us.\", mark.barabak@latimes.com, Twitter: @markzbarabak]", "Date": "20150510", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/politics/la-na-adv-latinos-presidential-race-20150510-story.html", "Title": "[Can Rubio or Bush help Republicans finally win Latino vote in 2016?]"}