{"Content": "[ The backlash against the Obama administration prisoner exchange (five high-ranking Taliban prisoners at Guantanamo Bay for one American Army sergeant who has been shuttled between Afghanistan and Pakistan) appears to be unfolding on two fronts: the personal and the political. The personal attack is aimed at 28-year-old Sgt. Bowe Bergdahl by fellow soldiers who, free to speak now that Bergdahl has been released, say the soldier, who was then a private first class, voluntarily walked off his post in 2009, indirectly causing the deaths of at least six soldiers who tried to retrieve him. Bergdahl was a deserter and soldiers from his own unit died trying to track him down, writes Nathan Bradley Bethea, who served in the same battalion as Bergdahl and participated in some of those rescue efforts. Bergdahl should not, Bethea insists, be treated as a hero. That assault dovetails with the political assault against the prisoner swap that is picking up steam among conservatives, especially among Congressional Republicans. They say the Obama administration did not give Congress a required 30-day notice before transferring prisoners from Guantanamo Bay. Secretary of Defense Chuck Hagel said Sunday on Meet the Press that the swap had to take place quickly, as Bergdahls safety and health were at risk. While politicians of both parties express joy and relief that Americans only known prisoner of war is coming home, Republicans insist the swap will only embolden terrorists and endanger American lives. House Republicans have already announced they will investigate. Republican Sen. John McCain, the only member of Congress to have been a prisoner of war, has been an especially harsh critic. On Sunday, on \"Face the Nation, the Arizona senator criticized the swap, describing the five Guantanamo prisoners as \"the hardest of the hard core\" and \"the highest high-risk people,\" warning that they could \"re-enter the fight.\", But McCains outrage is somewhat disingenuous. He has known for more than two years that the United States was negotiating a swap. (The freed prisoners are to live under some form of house arrest in Qatar for a year.), According to the late Michael Hastings, who wrote a long profile of Bergdahl for Rolling Stone in June 2012, administration officials had briefed a handful of senators, including McCain, on their efforts to trade five Taliban prisoners for Bergdahl in January 2012. McCain reluctantly came around on the prisoner exchange, according to those present at the meeting, wrote Hastings, but he has continued to speak out against negotiating with the Taliban. (The 2012 swap fell through, Hastings reported, after the Taliban balked at some of the conditions of the release.), Well be learning more about the circumstances of Bergdahls capture in the coming days and weeks. Clearly, there is confusion about how to think about him. The Drudge Report on Monday morning captured the ambivalence with a banner headline accompanying a photo of Bergdahl: Hero Deserter?, The Taliban, and Bergdahl, have an obvious interest in portraying his disappearance in Afghanistan as involuntary. In a 2009 video of Bergdahl released by the Taliban, the then-23-year-old soldier says I was lagging behind a patrol when I was captured. The Army, of course, has every interest in dispelling the idea that one of its own was kidnapped. Hastings described Bergdahls 2009 disappearance as voluntary flight by a soldier disillusioned with the American mission in Afghanistan, and the callous way he felt U.S. soldiers treated Afghani civilians. As Hastings wrote:, \"In the early morning hours of June 30, according to soldiers in the unit, Bowe approached his team leader not long after he got off guard duty and asked his superior a simple question: If I were to leave the base, would it cause problems if I took my sensitive equipment?, \"Yes, his team leader responded -- if you took your rifle and night-vision goggles, that would cause problems. \"Bowe returned to his barracks, a roughly built bunker of plywood and sandbags. He gathered up water, a knife, his digital camera and his diary. Then he slipped off the outpost.\", In his remarkably prescient piece, Hastings noted Bowes tour of duty \"mirrored\" the American experience in Afghanistan. Both, he wrote, were \"marked by tragedy, confusion, misplaced idealism, deluded thinking and, perhaps, a moment of insanity. And it is with Bowe that the war will likely come to an end.\", On Tuesday, President Obama detailed how, after 12 years, the American military effort in Afghanistan is drawing to a close. Four days later, he stood with Bergdahls parents at the White House to announced the swap. Republicans who predict that the release of the five Taliban prisoners will result in a \"Willie Horton moment\" for Obama ignore the fact that the president will never run for office again. As an election issue, Afghanistan will fade. Its hard to imagine the prisoner swap will have much of an impact on the upcoming Congressional mid-term elections, or even the presidential race in 2016. After all, Hillary Clinton, who was secretary of state during most of Bergdahls captivity, was said to be wary of any prisoner swap. And since she has been out of office since February 2013, no one can blame her for it now. As for the personal attacks on Bergdahl, they should fade, too. Five years in captivity, living in fear of beheading or some other gruesome death, is a severe penalty for what may have been a rash, immature act. Lets not get caught up in debating his patriotism or courage. That is now beside the point. He has surely suffered enough. [For The Record, 5:14 p.m. June 3: An earlier version of this post said the five prisoners freed from Guantanamo would live under a form of house arrest in Qatar rather than be returned to Afghanistan. The agreement calls for them to stay in Qatar for a year.]]", "Date": "20140602", "Author": "NULL", "Link": "http://www.latimes.com/nation/nationnow/la-me-ra-attacking-bowe-bergdahl-20140602-column.html", "Title": "[The backlash against Bowe Bergdahl and the Guantanamo prisoner swap]"}