{"Content": "[ In the battle for control of the Senate, Republicans have built their campaigns on a promise to block President Obamas policies and ease Washingtons gridlock. But accomplishing that may prove tougher than winning next weeks election. A GOP Congress would almost certainly pick a quick fight with the White House over Obamacare, immigration and what Republicans see as the administrations anti-coal policies. Problem is, even if Republicans take the Senate, their majority would likely fall short of the 60 votes needed to break a Democratic filibuster, or the 67 votes needed to overcome a presidential veto. Furthermore, many predict that GOP control of both chambers would only heighten long-standing internal divisions. Fiery tea party conservatives would push for sweeping changes, while cooler heads would advocate a more strategic, modest agenda. Party officials, including Kentuckys Sen. Mitch McConnell, who would become Senate majority leader, are already trying to temper expectations. Last week McConnell warned that repealing Obamacare in its entirety may be unrealistic. \"Remember whos in the White House for two more years,\" he cautioned. But tea party activists immediately forced him to backtrack, and he vowed to do his best for full repeal, perhaps by using the upcoming budget process. After years of playing opposition to the White House and Democratic-controlled Senate, Republicans  if they win Congress  will need to step up with credible, workable legislative solutions. Critics note that despite GOP demands to repeal the Affordable Care Act, they have yet to offer a viable alternative. They want to end Obamas temporary deportation reprieve for some immigrants, but cant agree on their own reform plan. GOP leaders know it will be important to prove to voters that Republicans can govern effectively, especially if they want any chance of capturing the White House in 2016. That means avoiding a repeat of last years government-shutdown politics, which drove approval ratings for Congress to all-time lows. If Republicans control both chambers, theyll inherit a dismal record, and the next Republican presidential nominee is counting on them to turn it around. \"What every party does  its just human nature  when they come out of a big victory they take it as a mandate and they take it as a sign that everything theyve done is right,\" said Amy Walter, national editor of the nonpartisan Cook Political Report, at a recent Bipartisan Policy Center forum. \"That path is not one that is going to benefit Republicans in 2016. Looking like a party that can govern, looking like a party that has a message, that is the much bigger challenge for the Republican Party right now.\", So while there may be a few symbolic, far-reaching legislative proposals at first, perhaps the best that a GOP-controlled Congress can hope for is to pass a string of relatively modest measures that could garner enough Democratic votes to avoid a filibuster. One possible bipartisan proposal would be a bill to legalize over-the-counter birth control, something several Republicans have mentioned in their campaigns. Others involve trade or business tax reforms. On thornier issues, Republicans will try to pass narrow bills with help from a handful of moderate Democrats, and then dare Obama to veto them. Heres how a GOP-controlled Congress is likely to approach several key issues:,  Obamacare: No issue has motivated conservatives more than Obamas signature healthcare law. Its repeal continues to be a top goal of most Republican candidates. But pulling out the law by \"root and branch,\" as McConnell has promised, seems all but impossible without a veto-proof majority. There would also be questions about what happens to the more than 11 million Americans now receiving coverage under the program. Instead, watch for an early attempt at repeal  essentially a \"show vote\"  followed by the slow grind of Congress trying to undo certain parts of the law. Among the provisions targeted are those that key Democrats have indicated they, too, dont like: A tax on medical device manufacturers, the requirement the employers with more than 50 workers offer insurance, and the cuts the law made to high-end Medicare Advantage policies. In his agenda for the new Congress, Sen. Ted Cruz (R-Texas) said the chamber should \"pass bill after bill\" to gradually undo Obamacare. \"Perhaps President Obama vetoes every one,\" Cruz said. \"But each has powerful appeal.\", The conservative Heritage Action frowns on this piecemeal approach. \"Were going to be pointing out that Obamacare cant be fixed,\" said Heritage spokesman Dan Holler.  Budget: Passing a federal budget would be perhaps the earliest, and toughest, fight for the new Congress, especially after Republicans badgered Democrats for having failed to pass budgets in recent years. But approving a budget is no easy task when Republican spending priorities dont always align. Republicans will likely double-down on the House-passed blueprint by Rep. Paul D. Ryan (R-Wis.), an ambitious plan from the former vice presidential nominee to cut taxes and government spending while creating a Medicare voucher option for the next generation of senior citizens. But Pentagon spending, once sacrosanct within the GOP, is now fair game among fiscal hard-liners, especially after the 2013 \"sequester\" cuts slashed government budgets across the board. Defense hawks want to restore Pentagon money, but budget hawks dont. Budgeting would be further complicated if Republicans use the budget reconciliation process as a back door to try to pass legislation to repeal Obamacare. The reconciliation process is long and cumbersome, requiring months of Senate floor time. But theres one big payoff: It allows for simple majority passage of the bills that accompany it, rather than the 60 needed to overcome a filibuster. Democrats used budget reconciliation to give final approval to the Affordable Care Act in 2010. Now Republicans are drafting reconciliation instructions to repeal it. Knowing that path would still likely end with an Obama veto, McConnells team has indicated he would take a more direct route by attaching GOP goals to must-pass spending bills that, if vetoed, would threaten a government shutdown.  Immigration: As happened earlier this year, the immigration battle could lead to impeachment chatter. Republicans have repeatedly vowed to stop Obama if he tries to use his executive power to allow some immigrants who entered the country illegally to remain without fear of deportation, something the president has hinted hell do by years end. \"Acting by executive order on an issue of this magnitude would be the most divisive action you could take,\" Republican Sens. John McCain of Arizona, Lindsey Graham of South Carolina and Marco Rubio of Florida wrote in a letter to the president this week. But Republicans are unlikely to agree on how to change immigration laws, or whether to even try. About the only thing they agree upon is the need to beef up border security. But thats a vote that could create more political problems than it resolves. Many Latino voters  who will be crucial to the GOPs future presidential chances  are likely to view such a move as insufficient, even hostile. The last time a Republican Congress passed a border-only immigration bill, Latinos protested in the streets, helping Democrats regain control of both chambers in the 2006 election. The upshot: Republicans will probably punt on the issue.  Energy and Keystone XL pipeline: One of the easiest potential votes for a new Republican Congress will be to approve the Keystone XL pipeline. The oil pipeline project, which would connect the tar sands of Canada to the Gulf of Mexico, appears to have enough Democratic support to overcome a filibuster and swiftly land on Obamas desk. The White House has not indicated whether it would veto legislation to greenlight the stalled project, and has repeatedly postponed a decision now that the pipeline is tied up in a court battle. Smaller energy-related measures  to undo the Environmental Protection Agencys regulations on coal-fired power plants  are also likely to find broad-based support and, if tacked onto spending bills, could force the president into veto-versus-shutdown battles with Congress.  Nominations: Nothing angered Senate Republicans more than the Democratic majoritys decision last year to deploy the so-called \"nuclear option\" to change long-standing Senate rules that required 60 votes to advance most nominations. Though McConnell has said publicly that he might reinstate the rule, it really doesnt matter. The reality is, with Republicans in charge, they can defeat any potential presidential nomination  controversial or otherwise  by simply refusing to schedule the vote, always the prerogative of the majority. The Obama administration has prepared for the possibility that confirmations might grind to a halt. It is planning to confirm 25 new judges before the end of the year, while Democrats still control the Senate. With the announced departure of Atty. Gen. Eric H. Holder Jr. it remains unclear whether his replacement  whom the White House has yet to name  will be confirmed during the lame-duck session or next year, giving Republicans a chance to use the confirmation battle to launch a broad critique of the Justice Department. If the White House nominates a less polarizing figure than Holder, such as Solicitor General Donald Verrilli Jr. a GOP Senate would have a more difficult time objecting. The rule change did not apply to legislation or the Supreme Court, which means if a vacancy were to arise on the high court, 60 votes would still be needed to confirm a new justice. That would give Republicans a stronger hand in preventing Obama from adding to the court in his final years. michael.memoli@latimes.com , lisa.mascaro@latimes.com, Twitter: @mikememoli, @lisamascaro]", "Date": "20141031", "Author": "[Michael A. Memoli, Lisa Mascaro]", "Link": "http://www.latimes.com/nation/politics/la-na-senate-gop-agenda-20141101-story.html", "Title": "[For Republicans, election victory won't end struggles]"}