{"Content": "[ Republican presidential candidates continued to struggle Sunday over how to respond to last weeksmass shooting of nine black parishioners at a historic Charleston, S.C. church,particularlyover the issue of whether the state should remove the Confederate battle flag from its Capitol. Former Arkansas Gov. Mike Huckabee toldNBCs Meet the Press\" thathis fellow GOP presidential candidates were being baited with a question that a future commander-in-chief should not have to address. Worshipers enter Emanuel A.M.E. Church in Charleston, S.C. four days after a mass shooting that claimed the lives of its pastor and eight others. Worshipers enter Emanuel A.M.E. Church in Charleston, S.C. four days after a mass shooting that claimed the lives of its pastor and eight others. People arrive for services at the Emanuel AME Church on Sunday in Charleston, S.C. People arrive for services at the Emanuel AME Church on Sunday in Charleston, S.C. People want their president to be focused on the economy, keeping America safe, some really big issues for the nation, he said. I dont think they want us to weigh in on every little issue in all 50 states that might be an important issue to the people of that state but not on the desk of the president. ... Idont personally display it anywhere. So its not an issue for me. His comments were echoed by two other 2016 GOP hopefuls, Sens. Ted Cruz of Texas and Marco Rubio of Florida, who both said the issue should be left to South Carolinians. The killingWednesdayof nine people in Charleston rekindled the longstanding disgust many feel about the flag being officially flown on state property. South Carolinas Republican primary comes early in the presidential election cycle and the Confederate flag has been an issue in previous primaries. Sen. Tim Scott (R-S.C.), one of two blacks to serve in the Senate, said Sunday that the issue needs to be debated. There will be an ongoing conversation, a real debate and discussion about next steps, he said on CBSs Face the Nation, though he did not take a position. So that will be coming soon. And after the funerals, we look forward to participating in it. But other Republicans, including former Florida Gov. Jeb Bushand the GOPs 2012 nominee,Mitt Romney, both called Saturday for the Confederate battle flag to be removed from the grounds of the South Carolina statehouse, pushing debate over the divisive symbol to the forefront of the Republican primary. Romney wrote on Twitter that many see the Confederate flag as a \"symbol of racial hatred\" and called for itsimmediate removal. \"Remove it now to honor #Charleston victims,\" Romney wrote. Bush, who formally announced his candidacy last week, was more measured, notingin a Facebook postthat in his home state of Florida, the Confederate flag was moved from state grounds \"to a museum where it belonged.\"Bush appeared to favor the same approach for South Carolina. \"This is obviously a very sensitive time in South Carolina,\" Bush wrote, adding that after a \"period of mourning\" for those killed at the Emanuel African Methodist Episcopal Church, there will \"rightly be a discussion among leaders in the state about how South Carolina should move forward and Im confident they will do the right thing.\", South Carolina Sen.LindseyGraham, who is also running in the Republican primary and serves alongside Scott, said the focus on the flag was misplaced. Graham told CNN that the focus should be on alleged gunman DylannRoofand that the Confederate flag should not be used as an excuse for the killings. \"Were not going to give this a guy an excuse about a book he might have read or a movie he watched or a song he listened to or a symbol out anywhere. Its him ... not the flag,\" Graham said. The issue came to the forefront in the 2000 primary when Arizona Sen. John McCain and then-Texas Gov. George W. Bush both took the stance of the flag being a states rights issue for the people of South Carolina to decide. After the primary, McCain expressed regret, saying he had compromised his beliefs while seeking the nomination. Last week, civil rights leaders and President Obama renewed calls toremovethe flag, which flies at the top of a 30-foot flagpole near the South Carolina Capitol. The 21-year-old shooting suspect,Dylann Roof, posed with a Confederate flag and a pistol in a photo posted online before the shooting. Twitter:@ByBrianBennett, Twitter: @kurtisalee, June 21, 11:28 a.m. This article was updated with additional comments from 2016 presidential hopefuls. The first version of this article was published on June 20 at 5:24 p.m.]", "Date": "20150621", "Author": "[Brian Bennett, Kurtis Lee]", "Link": "http://www.latimes.com/nation/la-na-confederate-flag-election-20150620-story.html", "Title": "[Confederate flag debate heats up in Republican presidential race]"}