{"Content": "[ Could Taiwan have its first female president in 2016?, Taiwans chief opposition party on Wednesday nominated Tsai Ing-wen, a 58-year-old law scholar, as its candidate for the January presidential election, and opinion polls show the Cornell University Law School graduate who has sketched out a moderate stance toward mainland China as an early favorite in the race. Tsai advocates dialogue with Beijing, rather than pursuing formal independence for Taiwan as her Democratic Progressive Party did when it governed from 2000 to 2008. Still, if elected, she wants Beijing to treat the island of 23 million people as a separate entity, not part of China, when the two sides sit down for talks. She will not do something perceived as unnecessarily provocative, said Lai I-chung, the partys former China point person and now vice president of the Taiwan Think Tank. I dont think Taiwan independence will be her priority as a president. China has claimed sovereignty over self-ruled Taiwan since the civil war of the 1940s, threatening to use force if the island declares de jure independence. Taiwan has long been regarded as a potential military flashpoint in Asia, but since the Nationalist Party took office in 2008, tension has eased as talks have built trust and allowed for the signing of 21 trade, tourism and investment agreements that have boosted the Taiwanese economy. But the Nationalists have increasingly been criticized as too cozy with the mainland and inattentive to domestic issues, and the party lost nine city and county elections in November. Tsais party won seven, a vote that analysts say foreshadows the January 2016 presidential election. Local media polls give Tsai a lead of at least 10 percentage points over two prospective Nationalist Party candidates, though that party has not made a nomination. Current President Ma Ying-jeou, also a Nationalist, must step down due to term limits. Former Democratic Progressive Party President Chen Shui-bian advocated formal Taiwan independence from China, and some senior party members still share his view. But the party said in a statement last week it would maintain the status quo in relations with China, meaning more development of relations and an effort to keep peace. Tsai was born in small town in southern Taiwan and received a law degree from National Taiwan University in 1978. She went on to Cornell University Law School and the London School of Economics for her PhD. The fluent English speaker taught in Taiwan until the Nationalist government of Lee Teng-hui, who irritated China with suggestions the two sides form a state-to-state relationship, hired her in the late 1980s for several government jobs. During Chens administration, she rose to the rank of vice premier in 2006. Fifteen years ago Tsai began taking leadership positions in the DPP, becoming chairwoman for the first time in 2008. In 2012, she ran as the first female nominee for the Taiwanese presidency but lost to Ma by a margin of 51% to 45%. Tsai would be the first woman to lead Taiwan. Voters elected a female vice president from 2000 to 2008 and have elected numerous female legislators. Tsai has struggled this year to make her China policies clear as voters want to know what deals she would sign and how she could establish dialogue with Beijing without agreeing to be treated as part of China, as Communist Party leaders in Beijing demand. Some of the tens of thousands of anti-Beijing activists who occupied Parliament last year to stop ratification of a service trade liberalization agreement with China would not say whether they will support her. They call the Nationalist governments engagement with China dangerous as long as Beijing aims to unify with a reluctant Taiwan. We think what shes come up with is not that clear, sort of opaque, said Lai Yu-fen, spokesperson for the Taipei activist group Black Island National Youth Front. Tsais party says it is calibrating its China policy with the U.S. government in mind. Scholars in Taipei believe Washington wants the two sides to get along but hopes Taiwan retains its autonomy to offset the mainlands increasing projection of power in Asia both militarily and economically. Its hard for even the mainland to know how to react, said Ross Feingold, Taipei-based senior advisor with American political risk manager DC International Advisory. She hasnt given us enough to really judge. Still, he said. Shes ahead in polls. Its her race to lose. Jennings is a special correspondent.]", "Date": "20150415", "Author": "NULL", "Link": "http://www.latimes.com/world/asia/la-fg-law-scholar-nominated-taiwan-presidency-woman-20150415-story.html", "Title": "[Law scholar nominated for Taiwan presidency, could be 1st woman to lead island]"}