{"Content": "[ High school students have their hands full worrying about passing core math, science and English classes to graduate. In Arizona, a new requirement has been added to their load, a civics test with questions like this one: Who was president during the Great Depression and World War II?, Beginning in the 2016-17 school year, students must pass the equivalent of the U.S. citizenship test to achieve their high school diploma under a new law the Republican-controlled state Legislature approved. The first such law in the nation was supported by all 53 Republicans in the state House and Senate and 10 of 27 Democrats. Republican Gov. Doug Ducey, who had called for the bill to be the first measure to hit his desk, signed it into law Thursday. To pass, high school students must correctly answer at least 60% of the 100 questions from the civics portion of the exam that new immigrants take. The test includes questions about basic U.S. history matters such as the Revolutionary War and the Founding Fathers, powers and rights as defined by the Constitution, and American political figures. QUIZ: Questions from Arizonas civics test for high school students, We are asserting and promoting the idea that our high school students should at a minimum be able to pass the test that immigrants must also pass, said Frank Riggs, president and chief executive of the Scottsdale-based Joe Foss Institute, which has been pushing for the testing requirement around the country. It is a common-sense thing to have a base line for everyone, the former congressman from California and unsuccessful gubernatorial candidate in Arizona said Friday. The institute  which is named for the former governor of South Dakota who was awarded the Medal of Honor for his service as a World War II pilot  is hoping to persuade all states to adopt the same requirement by 2017, the 230th anniversary of the U.S. Constitution. It said 15 states were expected to consider the measure this year, including North Dakota, Utah and Louisiana. Riggs, who ran a sharply conservative campaign in his governors bid last year, said the testing campaign is part of the institutes long-standing mission to spread education and freedom. We have strong conservative backing, there is no question about that, Riggs said of the testing initiative. But he pointed to the bipartisan coalition that helped pass the measure in Arizona, including prominent Democrats. He said he didnt see how anyone could possibly assert that young people should not have a basic knowledge of government. There is no higher priority for secondary education than fundamental knowledge, no greater responsibility of the taxpayer-funded system than to insure there are informed, active and engaged citizens leaving our high schools, Riggs said. Some Democrats did not quite agree, said state Sen. Steve Farley (D-Tucson), the assistant minority leader. For those opponents the issue isnt so much the content of what is being taught, but other factors such as the rush by Republicans to get the measure passed even in the face of other educational needs. The biggest problem with this thing is that nothing is said about dealing with our educational funding crisis, Farley told The Times. It was brought up as an emergency measure and was pushed through in one day. Thats not how a bill becomes a law. Bills take a longer time so they can be carefully studied and not be half-baked. Farley also said it was ironic that conservative lawmakers, who generally oppose federal testing, embraced a civics testing program that is based on questions used by the federal government for determining immigrants qualifications. This was rushed to the governor to be more of a political talking point than a policy, he said. Ducey strongly backed the bill. These are our children, and not long from now, it will be for them to vote on who sits in your chairs and who stands at this podium, Ducey said in his State of the State address Monday. How can we expect them to protect the principles on which this country was founded, if we are not preparing them for that task right now?, The academic argument for civics education also holds that a better-informed electorate will eventually be better for democracy. A 2010 Harvard study by Jennifer Bachner found that students who completed a year of course work in American government/civics are 3 to 6 percentage points more likely to vote in an election following high school than those without exposure to civics education. Farley said that during the debate over the testing bill, he had pushed for an amendment requiring lawmakers to take the same test they were requiring high school students to pass. That amendment failed, he said. michael.muskal@latimes.com, Twitter: @latimesmuskal, , , 4:32 p.m.: This report has been revised throughout for additional details and updates. This was orginally posted at1:21 p.m.]", "Date": "20150116", "Author": "[Michael Muskal]", "Link": "http://www.latimes.com/nation/la-na-arizona-civics-test-citizenship-20150116-story.html", "Title": "[Arizona swiftly adopts law mandating high school civics test ]"}