{"Content": "[ The Supreme Court term that ended this week will be remembered for the landmark ruling that legalized same-sex marriage nationwide, but it will also go down as a year when a fractured conservative bloc resulted in a surprising number of liberal wins. That doesnt mean the court has shifted left, as some have suggested. Instead, perhaps the biggest dynamic driving this term was overreaching by the courts most conservative justices. Under the courts rules, the votes of four justices are needed to add a case to the docket, but a decision requires a majority of at least five. On one case after another, four conservatives are believed to have teed up cases that had the potential to move the law to the right, only to fall short when the time came to vote. Although liberals won, their victories, except for the marriage case, largely kept the status quo in place. \"The lineup of cases this term explains the results, and not a shift in anyones general legal philosophy,\" said Irving Gornstein, who directs the Supreme Court Institute at Georgetown Universitys law school. Last week saw three examples. In close votes, the high court rejected conservative-driven lawsuits that sought to scale back President Obamas healthcare law, limit the scope of a housing anti-discrimination law and reverse voter initiatives in California and Arizona that created independent commissions to draw election districts. As usual, Justice Anthony M. Kennedy, a Californian, was instrumental. He joined his four liberal colleagues to uphold the Arizona and California commissions aimed at ending gerrymandering and wrote the 5-4 opinion to preserve the broad reach of the federal Fair Housing Act. In the healthcare case, it was Chief Justice John G. Roberts Jr. who spoke for a 6-3 majority, including Kennedy, holding it was \"implausible\" to read the 900-page Affordable Care Act as barring insurance subsidies in most of the nation, as conservatives claimed it had. The term ended with Justice Antonin Scalia  and many right-leaning pundits  sputtering in anger, accusing Roberts and Kennedy of having betrayed the conservative cause. But court scholars on the right and left cautioned against reading too much into the recent outcomes. \"Sure, the liberals are a bit happier about this term than the conservatives, but its really about two big cases: healthcare and marriage,\" said Ilya Shapiro, a lawyer for the libertarian Cato Institute. On the current court, \"the liberals vote in lockstep. So if the conservatives are aggressive [in accepting far-reaching cases] and they dont get a fifth vote, the liberals win.\", In high-profile or sensitive cases, both conservatives and liberals on the court usually vote to hear a case only when they are confident they have the support needed to win. So why are the conservatives more aggressive in granting new cases?, One explanation is they expected to win with Kennedys vote but misjudged. Others have speculated that the conservative justices fear Democrats will win the White House in 2016 and move the court to the left. By this logic, the next two years might be the last chance to make progress on conservative priorities, even if it means risking a loss. More often than not this term, the gamble did not pay off. Though Republican-appointed justices hold a narrow 5-4 majority over Democratic-appointed ones, liberals prevailed more often in the 5-4 decisions this term, winning 12 out of 19 of such cases, according to figures by Supreme Court watcher ScotusBlog. Even so, conservatives scored several big wins this year, including the most important environmental case. They voted last fall to hear an appeal brought by the coal industry and a coalition of Republican-led states that opposed the Obama administrations plan to strictly limit toxic air pollution from power plants. The Clean Air Act looked to be on the governments side, because it said the Environmental Protection Agency should act to protect the publics health when it was \"appropriate and necessary.\", But in a 5-4 ruling, Scalia and the court said the EPA failed to weigh the high cost of its regulations. Although the courts rulings sometimes gain wide attention, the process of setting the legal agenda is often obscured. Before the 1980s, groups such as the NAACP Legal Defense Fund, the American Civil Liberties Union and womens rights advocates routinely appealed cases to the Supreme Court, seeking rulings that would move the law in a liberal direction. But in recent decades, those groups  fearing an appeal would backfire by giving the courts conservatives a chance to rein in liberal programs  have tried to steer clear of the high court whenever possible. In their place, an array of small conservative groups is helping to set the agenda. For example, in 2008, several conservative activists sought to sell and broadcast a video mocking then-Sen. Hillary Rodham Clinton as she ran for president. When they ran afoul of the federal election laws, the advocacy group Citizens United appealed the matter to the Supreme Court. Two years later, they won a 5-4 ruling that struck down laws that limit campaign spending by corporations and unions and by wealthy donors who banded together in \"super PACs.\", This fall, the court has agreed to hear more appeals brought by conservative groups, including a lawsuit against the affirmative action policy at the University of Texas and a challenge to a Texas voting law that counts the full population, not just the U.S. citizens, when determining how legislative districts are drawn. Both suits were brought by conservative advocate Edward Blum. Two years ago, the Center for Individual Rights, a small conservative group in Washington, spotted an opinion by Justice Samuel A. Alito Jr. that questioned the constitutionality of the union fees paid by public school teachers. It decided to launch a challenge to the policies. This fall, its lawyers will argue on behalf of Rebecca Friedrichs, an Orange County teacher who is not a union member and objects to paying \"fair share\" union fees to the California Teachers Assn. With cases slated for the next term on affirmative action, voting districts and union fees, the stage is set for a replay of this terms dynamic. The court is also likely to rule on strict abortion regulations from Texas. If conservatives are more successful in keeping their bloc together, complaints about this years \"liberal\" lurch could quickly fade. \"After next terms expected rulings on affirmative action, abortion, teachers unions and immigration, the liberals may be calling the Roberts court the most conservative in a generation,\" UCLA law professor Adam Winkler said. david.savage@latimes.com, Twitter:@DavidGSavage]", "Date": "20150702", "Author": "[David G. Savage]", "Link": "http://www.latimes.com/nation/la-na-scotus-wrapup-20150702-story.html", "Title": "[Conservative overreach may explain liberal victories in Supreme Court]"}