{"Content": "[ Its initiative season in California. Time to start circulating those petitions in front of grocery stores in the hopes of passing new laws or taxes (or tax cuts) or rights or special carve-outs for your company in the November 2016 election. And guess what? Its going to be easier than ever, thanks to perennially plunging voter-turnout numbers in the state. Thats because the number of signatures required to turn an idea into a ballot proposition is based on the number of votes cast in the previous gubernatorial election. Since Novembers governors race had the lowest voter turnout in more than 100 years  well, you do the math. Its a cruel twist that the fewer people who vote, the longer and more complicated the ballots may become. For the last election, it took 504,760 signatures from registered California voters to qualify a citizen initiative for the ballot and 807,615 to qualify a constitutional amendment. This time around, it will take just 365,880 signatures for an initiative and 585,407 for a constitutional amendment. That may sound like a lot of John Hancocks, especially to the people standing in 90-degree heat outside Trader Joes with a clipboard. But it is an extremely small slice of the states 39.5 million residents. To the special interests that pay signature gatherers to do the work, it will mean giant savings  money that can be spent instead on more of those irritating slick, color mailers and ubiquitous radio ads that inundate (and often mislead) voters in the days before an election. If thats not enough to keep you up at night contemplating initiative reform, heres another sobering thought: With 20 months to go before the next general election, there are already three qualified ballot measures, including a referendum on the states single-use plastic bag ban, and 13 citizen initiatives  some silly, some serious, some insane  pending but not yet qualified. One would start the process for California to secede from the United States. Another states mysteriously that \"Innocent human life is inviolable. It cannot be terminated, defiled, or destroyed with impunity under any circumstances.\" One particularly horrible (though unlikely to succeed) proposal is the \"Sodomite Suppression Act,\" which would criminalize sodomy and require that gay people be put to death. And there will be more. Californias initiative system was designed more than 100 years ago to wrest control of the state out of the hands of the railroad barons. But today, it is too often a force for self-interest rather than public interest. Any industry  even a single company or billionaire with the desire and financial means  can bypass legislators with a self-serving proposal. Like democracy itself, the states initiative process is the worst form of lawmaking, except for all the others. Thanks tolegislation pushed through by former Senate President Pro Tem Darrell Steinberg, the process should be slightly improved in the coming election cycle. Among other things, public hearings on proposed initiatives will be held earlier, after just a quarter of the signatures have been gathered. A commenting period has been added early in the process, so that anyone can lodge opinions about the proposal  and proponents will then have an opportunity to amend their proposals. As of last Monday, more than 130 comments had been received for initiatives that are either pending or have been cleared for signature gathering. Major donors will be named and fiscal effects will be clearly outlined online. These changes wont necessarily block all bad ideas from getting onto the ballot. There is, however, one simple thing that Californians can do to push back against initiative mischief without rewriting the state Constitution. Before signing any petition, for heavens sake, read it carefully. Dont rely on the word of paid signature gatherers, who are paid per signature and are notorious for saying anything to get people to sign. Pull out your smartphone and check it out yourself on the secretary of states website: www.sos.ca.gov. Blindly signing petitions could result in a harsh awakening one November morning to discover that a narrow margin of Californias voters had just decided to secede from the United States. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150323", "Author": "[The Times Editorial Board]", "Link": "http://www.latimes.com/opinion/editorials/la-ed-initiatives-20150323-story.html", "Title": "[Take the initiative to read the petitions before you sign]"}