{"Content": "[ Gov. Jerry Brown wont be running for president. Dont be silly. He has already run the course. And now hes a geezer. Anyway, his chief advisor, wife Anne Gust Brown, would kill him. So its not worth asking about. But thats too bad, in a way. Because, age aside, he never has been in better position to run. Brown has a record he can crow about as governor of the most populous, most diverse state, with the worlds eighth-largest economy. He has steered the state budget from a crippling deficit to a healthy surplus. Hes still a Washington outsider. Hes usually articulate and interesting. And hes driven, more than any presidential contender, by a cause thats far bigger than any one state: saving the planet by turning down the heat on global warming. The presidential field is in flux and flimsy. Democratic front-runner Hillary Rodham Clinton is limping badly. Republican front-runner Donald Trump is a circus barker. \"In the current context, especially when you look at the Republican field, it cries out for someone who can be the grown-up in the room and has some gravitas,\" says veteran Democratic consultant Bill Carrick. Maybe  probably  Brown couldnt get elected president in 2016. But there has never been a wider opening for him. Its the opportunity of his lifetime. If only. If only he hadnt foolishly run those other times. In 1976, for crying out loud, he had been governor for only a year, repeating Ronald Reagans mistake of 1968. Moreover, Brown entered the Democratic primaries very late. He still carried three states and attracted 14% of the total popular vote. But Jimmy Carter won easily. \"When he first got in and won in Maryland, he was the most exciting candidate Id ever seen,\" says Carrick, who was working then in Washington. \"He was hot as a firecracker.\", It was a careless waste of potential. In 1980, Brown challenged Carter again. Only this time Carter was the incumbent president. And Sen. Ted Kennedy  Democratic royalty  also was competing. Brown bombed and dropped out early. Brown was asked by a reporter earlier this year whether there had been anything in his career hed like to change. \"There are a lot of things I could second-guess,\" he replied. \"The only thing that seems pretty clear was continuing to run for president in 1980 after Kennedy got in against Carter. That was a very dumb move on my part.\", And in 1992, what was that about? Brown had been out of office nine years. He ran like a crazy man  no discipline, poor planning, dumb moves. \"We are not disorganized. Our campaign transcends understanding,\" Jacques Barzaghi, Browns \"field director\" and longtime aide-de-camp, said then. One stupid move: Brown naming the Rev. Jesse Jackson as his potential running mate  the man who had angered New Yorks many Jewish voters by calling their city \"Hymietown.\", Brown ran as a populist, the \"voice for the voiceless,\" refusing to accept campaign contributions that exceeded $100. He later abandoned that notion while rebooting his political career in California. In 1992, however, he also campaigned as a Wall Streeter, advocating the \"flat tax\"  everyone pay the same income tax rate. As governor in 2012, he turned in the extreme opposite direction, selling voters a \"soak-the-rich\" tax hike that hit only Californias wealthiest. The \"prince of sleaze\"  Browns name for Arkansas Gov. Bill Clinton  walloped the Californian in the decisive New York primary. Still, Brown won six states. If Brown hadnt been so politically antsy in 1976 and 1980, he just might already have been president. California voters wouldnt have been so sick of him in 1982. They probably would have elected him U.S. senator over the San Diego mayor, Pete Wilson. Then he would have been in great position to whip the Arkansas governor in 1992. You know that Brown would love to be back running again, especially with the \"princes\" wife stumbling. If he were 10 years younger, Brown told reporters a few months ago, \"yes\" he would be back on the presidential trail. But he quickly added: \"If I could go back in a time machine  I might jump in. But thats counterfactual, so you dont need to speculate.\", Brown is 77. If he ran and won, hed be older entering the White House than Reagan was leaving it. Thats not a selling point. But also like Reagan and Trump  excuse this one comparison  Brown has an appealing ring of authenticity. Hes pretty healthy and not that much older than the leading Democratic contenders. Hillary Clinton is 67. Sen. Bernie Sanders (I-Vt.) is 73. And Vice President Joe Biden, whos edging toward the race, is 72. \"Never count Jerry out,\" Carrick says. \"Many people have written his political eulogy who no longer are involved in politics.\", Asked on NBCs \"Meet the Press\" Sunday why he didnt jump into the race, Brown replied: \"Ive got a lot to do in California. I find it completely absorbing and challenging. And Ive given myself to this job and Im going to be fully engaged there.\", Too bad Brown didnt say that the first time he was governor. Now, given his passion for fighting global warming, Brown should consider running for the U.S. Senate in 2018 if Sen. Dianne Feinstein retires. Shes 82. Washington is where global warming needs to be fought. george.skelton@latimes.com]", "Date": "20150827", "Author": "NULL", "Link": "http://www.latimes.com/local/politics/la-me-cap-brown-president-20150827-column.html", "Title": "[Brown blew his best chance for president]"}