{"Content": "[ This spring, Republican presidential hopeful Jeb Bush had difficulty answering a question about how he viewed the invasion of Iraq that defined  and ultimately consumed  his brothers presidency. On Tuesday, however, Bush plunged directly into the wars political wake. In what his campaign billed as a major speech at the Ronald Reagan Presidential Library, Bush highlighted the continued instability in Iraq and its neighbor, Syria, as a central focus of his foreign policy. He vowed to use military force more aggressively than President Obama has done and blamed the administration  and its former secretary of State, Hillary Rodham Clinton  for the rise of the Islamic State militant group, also known as ISIS. It is not true, and was wishful thinking by the administration to claim, that the tide of war is receding, Bush said. Radical Islam has been spreading like a pandemic, he said, vowing to be resolute  in the defeat of radical Islamic terrorism wherever it appears. Bush called for a no-fly zone over parts of Syria, expanded safe zones for the persecuted within Syria, and embedding some U.S. ground forces with Iraqi units  all significant steps the administration has opposed.He said that while a major commitment of American ground forces was not necessary, the nation may need to expand the number of soldiers and Marines in Iraq. He also called for providing Iraqi forces with American air support. In proposing more aggressive American involvement in the region, Bush addressed the concerns of many Republican voters who have told pollsters and interviewers that they see Obama as weak and believe foreign policy  and specifically the threat of militant Islam  is a key issue for the next election. But the approach, particularly the emphasis on the military, carries considerable risk for Bush, heir to a name that is closely connected in the minds of many voters with a deeply unpopular war. After Bushs campaign had released excerpts ahead of the speech, Clintons campaign went on the attack Tuesday morning, suggesting that Bushs policies would once again lead to U.S. combat forces on the ground in a Mideast war. On Tuesday night, before a crowd of 1,000 in Simi Valley, Bush said Obama and Clintons foreign policy was based on grandiose talk and little action. Clintons record  including a failed attempt to reset relations with Russia and the death of four Americans in attacks on U.S. compoundsin Benghazi, Libya  is one of failure, he said. Bush spent the bulk of his 30-minute speech layingout an account of the Iraq wars aftermath in which Islamic State grew because of what he called Obamas hasty troop withdrawal from Iraq and overall American abandonmentof the region. That premature withdrawal was the fatal error, creating the void that ISIS moved in to fill  and that Iran has exploited to the full as well, Bush said. And where was  Secretary of State Clinton in all of this? he asked. In all of her record-setting travels, she stopped by Iraq exactly once, said Bush, 62, the former governor of Florida. Who can seriously argue that America and our friends are safer today than in 2009, when the president and Secretary Clinton  the storied team of rivals  took office?, Clintons campaign accused him of trying to rewrite history in his effort to blame the rise of Islamic State on the Obama administration. Republicans cannot be allowed to escape responsibility for the problems caused by former President George W. Bushs invasion of Iraq, said Jake Sullivan, the campaigns senior policy advisor, to reporters on a conference call. Islamic State emerged in no small part as a result of President Bushs failed strategy, said Sullivan, who served as a top aide to Clinton when she was secretary of State. He pointed to the Bush administrations decision in the early days of the U.S. occupation to disband the Iraqi army, which left many military personnel, mostly Sunnis, unemployed, embittered and armed. Its curious that Gov. Bush is choosing Iraq as the place he wants to engage the foreign policy debate, Sullivan said. In June, Jeb Bush ventured on a five-day European tour in which he called for the restoration of Americas leadership in world affairs and argued that the Obama administrations approach had emboldened enemies and weakened allies. Its a theme Bush highlightedduring his speech. The threat of global jihad, and of the Islamic State in particular, requires all the strength, unity and confidence that only American leadership can provide, Bush said Tuesday night. He focused on the wars end, which occurred under Obama, rather than on the wars beginning. So why was the success of the surge followed by a withdrawal from Iraq, leaving not even the residual force that commanders and the joint chiefs knew was necessary?  Like the president himself, [Clinton] had opposed the surge, then joined in claiming credit for its success, then stood by as that hard-won victory by American and allied forces was thrown away, Bush said. Bushs jibe that Clinton had only traveled to Iraq once during her tenure at the State Department poses a more difficult problem for the former secretary of States campaign. During Obamas first term, it was Vice President Joe Biden, not Clinton, who played the lead role in executing U.S. policy toward Iraq. The key issue is not how many times the plane touches down at the airport, Sullivan said; its how effective an official is. Clinton, he said, had played an important role in Iraqs transition from U.S. occupation to civilian rule. Bush did not call for significantly increasing the number of ground troops in Iraq, which someof his GOP rivals, most notably Sen. Lindsey Graham of South Carolina, have called for. Polls show that a significant majority of Republican voters support the idea of U.S. troops returning to the Mideast. The concept is very unpopular among Democrats. In a poll last month, for example, the nonpartisan Pew Research Center found that self-identified Republicans by a 2-1 margin supported sending U.S. ground troops to fight Islamic State. Democrats opposed the idea by the same margin. Independents were closely divided. seema.mehta@latimes.com, david.lauter@latimes.com, Times staff writer Mehta reported from Simi Valley and Lauter from Washington. MORE ON 2016 CAMPAIGN:, Hillary Clinton: All bets are off if Congress rejects Iran nuclear deal, Trump sticks by his explanation of comment about Megyn Kelly, Marco Rubio takes tough stand against abortion, with no exceptions for rape or incest, 9:35 p.m.: The story was updated throughout with new details. The story was first published at 2:23 p.m. ]", "Date": "20150811", "Author": "[Seema Mehta, David Lauter]", "Link": "http://www.latimes.com/nation/politics/la-na-bush-speech-20150811-story.html", "Title": "[Jeb Bush says Hillary Clinton played crucial role in Iraq's decline]"}