{"Content": "[ A petition drive by San Diego business leaders hoping to repeal a planned boost in the local minimum wage has qualified the issue for the ballot. The City Council approved the increase by a 6-3 vote in July and then voted to override a veto by Mayor Kevin Faulconer. The Democrat-controlled council is set to meet Monday with two choices under the city charter: repeal the increase or order an election. Whichever choice the council makes, a planned increase for Jan. 1 will not occur. Under the council action approved in July, the minimum wage would increase in stages to $11.50 an hour on Jan. 1, 2017. Statewide, the minimum wage rose to $9 an hour on July 1. The Chamber of Commerce, led by former Mayor Jerry Sanders, contends the increase would hurt small businesses and possibly force businesses to lay off workers or leave San Diego. But Council President Todd Gloria and other proponents say the increase will help an estimated 172,000 residents struggling to live in an expensive city. Opponents gathered more than the 33,866 signatures necessary to force a public vote unless the council rescinds its action, City Clerk Elizabeth Maland reported Thursday. The business-backed group was successful despite an aggressive campaign by Gloria and others urging people not to sign the petitions and to rescind their signatures if they had already signed. Gloria said he will ask the council to put the measure on the June 2016 ballot and that he is confident that voters \"will approve this necessary and common-sense increase.\", Sanders said the council \"has an opportunity to step up and protect the jobs and businesses in our city\" by rescinding the minimum-wage increase. The measure also includes a provision allowing for five paid sick days. Follow the reporter on Twitter: @LATsandiego]", "Date": "20141017", "Author": "[Tony Perry]", "Link": "http://www.latimes.com/local/lanow/la-me-ln-minimum-wage-repeal-san-diego-20141017-story.html", "Title": "[Repeal of San Diego's planned minimum wage boost qualifies for ballot]"}