{"Content": "[ By all accounts, the Central Valley is a place where Latino candidates should win elections. Latino political activism here dates back to the farmworker movement of the 1960s. In one congressional district that stretches up through the valley from Kern County to Fresno County, nearly 3 out of 4 residents are Latino. Yet Latino candidates election losses have piled up here in recent years  in large part because Latinos arent turning out to vote. For all the talk of the growing Latino electorate and the pivotal role it is expected to play in the 2016 presidential race, there is another often overlooked demographic reality: Latinos, along with Asian Americans, remain dramatically underrepresented in most U.S. elections. Half a century after passage of the Voting Rights Act, which ended legal barriers to voting for blacks across the South, blacks and whites now vote at roughly equal rates, especially in presidential elections. But Latinos and Asians lag far behind in all races, even when noncitizen immigrants are accounted for. As a result, the U.S. electorate may be less reflective of the nations ethnic and racial diversity today than it was in the 1950s, when the country was 90% white, according to political scientist Bernard Fraga of Indiana University, who studies minority voting trends. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, In the 2014 midterm election, only 27% of eligible Latinos voted, compared with 46% of whites and 41% of African Americans, according to U.S. census data. While the Latino vote is big and growing -- 40 million Latinos will be eligible to vote in 2030, up from about 25 million in 2014 -- its nowhere near as big as it could be. Theres more Latinos and more eligible Latino voters in the United States than ever before, Fraga said. They should have even greater voting strength than they do. They should be even more of a force in politics. But a lot of them arent turning out to vote. Understanding why Latinos arent voting at a higher rate is an urgent question for candidates and parties who depend on Latino votes to win. Democrats say they will need a big Latino turnout to carry swing states such as Nevada, Colorado and probably Florida in the 2016 presidential race. In next years Senate race in California, U.S. Rep. Loretta Sanchez(D-Santa Ana) will depend on Latino votes in her race against state Atty. Gen.Kamala Harris. But there are many hurdles to improving turnout. Latinos on average are younger than other groups, and young people of all races tend to vote less than their elders. Last year, 33% of Latinos eligible to vote were 18 to 29, according to the nonpartisan Pew Research Center, compared with 18% of whites, 25% of African Americans and 21% of Asian Americans. The Latino population is also heavily concentrated in two places, Texas and California, that have not been swing states in presidential elections for decades. Nearly half the countrys Latino eligible voters live in those two states. Because Democrats can usually count on winning statewide races in California and Republicans in Texas, neither party in those states has had an incentive to invest the huge sums necessary to register and turn out lots more Latino voters. By contrast, a large percentage of the black population lives in swing states that have been a heavy focus of voter registration efforts. Organizations and political parties arent focused enough on this segment of the population, said Marcela Ruiz, deputy director of California Rural Legal Assistance, which provides legal assistance to the states rural poor. Last year, only 17% of eligible Latinos and 18% of eligible Asian Americans in California voted, according to an analysis by the UC Davis Center for Regional Change. Turnout among all other racial groups was 40%. Antonio Gonzalez, president of the Southwest Voter Registration Education Project, said rapid population growth among Latinos and limited funds for registration makes it hard to keep up. His organization will register about20,000 new Latino voters this year in several states, he said. With more money, it could do much more. Its a good market, a growing market, he said. Nationally, about 800,000 Latinos turn 18 and become eligible to vote each year. Flavia Jimenez, a senior attorney with the Advancement Project, a civil rights advocacy organization, said Latinos would have more representation if the roughly 5million Latinos who are legal permanent residents became citizens. Reducing the cost of the naturalization process would be a good first step, Jimenez said. There are also cultural theories about why Latinos vote at lower rates. Many Latino voters are immigrants or the children of immigrants, and many have not grown up in families in whichvoting was common practice. Unlike African Americans, whose civil rights struggles in the 1960s were intensely focused on winning the right to vote, some Latino immigrants may not have positive associations with electoral politics. Adelina Sanchez, 32, who grew up in this Central Valley town southeast of Bakersfield, said some of her Mexican immigrant relatives refuse to vote because they dont trust the political system. Theyre so traumatized by politics in Mexico, she said. Fredi Castrejon, 30, a Lamont resident who sits on the board of the local Recreation and Parks District, said some immigrant voters dont believethey have a voice. Sometimes we become citizens, but were still afraid to fully come out of the shadows, said Castrejon, a Mexican immigrant who became a U.S. citizen several years ago. Last fall, Castrejon went door to door seeking votes for Amanda Renteria, a Democrat who lost to Republican incumbent Rep. David Valadao in the 21st Congressional District and who now is political director for Hillary Rodham Clintons presidential campaign. Latinos are a majority of registered voters in the district, but only a third of themvoted, compared with half of non-Latinos, according an analysis of exit polls by Political Data Inc. a bipartisan data vendor. We had the numbers for her to win, Castrejon said. But turnout was so low. Renterias loss was one of several Latino defeats in recent years. In 2013, Democratic Kern County Supervisor Leticia Perez lost to Republican cherry farmer Andy Vidak in a special state Senate election, despite the fact that the district is two-thirds Latino. There have been victories at the local level, Castrejon said, including the election of several young Latinos to the City Council in the nearby town of Arvin. Latinos have also led campaigns in several Central Valley towns, including Visalia, to change elections from at-large ballotingto voting by geographic district  a model that tends to favor minorities. Several organizations that work with voters in the region say theyre learning what works to boost turnout. A statewide nonprofit organization called California Calls identifies registered voters who arent turning out for elections and targets them with in-person and telephone voter education campaigns. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, We go back to these people again and again and again, said Karla Zombro, field director for the group, and were changing their voting behavior over time. In 2014, Latino voters that the group targeted turned out at a rate nearly 20% higher than other Latino voters, Zombro said. For years, many groups focused simply on getting Latinos registered to vote. But just registering voters is not enough, said Camila Chavez, executive director of the Dolores Huerta Foundation, a nonprofit civic engagement group cofounded by Huerta, the famed farmworker organizer. Now theorganization hosts house parties where neighbors can talk to neighbors about important ballot measures and other community initiatives, Chavez said. Canvassers ask for cellphone numbers and email addresses so they can follow up and remind people to vote on election day. Leticia Prado, 48, who runs a secondhand clothing store in Lamont, said the longer Latinos live in their communities, the more invested they will be in electoral politics. Several years ago, Prado helped lead the fight for a small tax increase that paid for a new gymnasium at a school in a nearby town. Now she sits on local school and water boards. The experience taught her a lesson that she often shares with voters while canvassing for community initiatives or candidates. Nothing is going to change in this community, she tells them, unless we change it. kate.linthicum@latimes.com, Twitter:@katelinthicum, MORE POLITICAL COVERAGE, Uproar among House GOP conservatives forces new strategy on Iran vote, Some Republicans see Ben Carson as Trump minus bluster plus faith, Jeb Bush unveils tax plan to slash rates for corporations and top earners, ]", "Date": "20150910", "Author": "[Kate Linthicum]", "Link": "http://www.latimes.com/nation/politics/la-na-latino-voters-20150910-story.html", "Title": "[The Latino vote is growing -- but it could be much bigger]"}