{"Content": "[ The Republican candidates for U.S. Senate walked the halls at the state partys semi-annual convention in Anaheim on Friday, floating essentially the same message to supporters and reporters: It is time to unite the party, and Im the guy to do it. The party will likely need to coalesce behind a single candidate if it wants to see a Republican advance to the November 2016 general election to succeed retiring Sen. Barbara Boxer. Thats because the top two primary contestants, regardless of party, advance to the runoff. Among the hopefuls working the halls was Assemblyman Rocky Chavez (R-Oceanside). The former Marine colonel said he felt confident about the competition from other party members when addressing a clutch of reporters in the convention center. \"I dont see a threat from any of the other Republican candidates,\" he said. None of the others, he said, have won an election. He won his Assembly seat in 2012 and was reelected last year. Get more national political newsand the latest from Campaign 2016 >>, Chavez, who supports same-sex marriage and favors a path to legalization for those in the country illegally, claimed 9% of the vote in a USC Dornsife/Los Angeles Times poll this month. Former state Republican Party leader Tom Del Beccaro, who pulled 10% of the vote in the same poll, signed a \"no new taxes\" pledge at a news conference Friday. He challenged Chavez and former state Republican Party leader George \"Duf\" Sundheim, who also is running, to do the same. \"Republicans need to get behind a single candidate,\" he said. Del Beccaro said he supported a seasonal guest worker program for immigrants but would not rule out building a wall along parts of the U.S.-Mexico border. He also said he would vote to defund Planned Parenthood if he were in the Senate. Despite a bare-bones booth at the convention, Sundheim, a Silicon Valley lawyer who entered the race earlier this month, said he had the chops to make it to the general election. He led the state Republican Party during the recall of Democratic Gov. Gray Davis and election of Arnold Schwarzenegger. \"The goal is to win the game, not just to get on the field. But I know how to win, I know how to raise money,\" he said. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, Republicans face an uphill battle in the race for the Senate seat. State Atty. Gen. Kamala Harris leads Rep. Loretta Sanchez of Orange County 26% to 17% among registered voters, according to a USC Dornsife College of Letters, Arts and Sciences/Los Angeles Times poll of 1,500 registered state voters. At the convention, Republican presidential candidate Mike Huckabee offered a few words of encouragement for party members, who dont hold a single statewide office and are badly outnumbered by Democrats in the Legislature. Huckabee said the party is in better shape in California than it was in Arkansas when he became governor in 1996. \"Our numbers were more lopsided than yours,\" he told members. javier.panzar@latimes.com, Twitter:@jpanzar, Times staff writer Chris Megerian contributed to this report. MORE POLITICAL COVERAGE, Democratic clash: Assembly Speaker Toni Atkins to challenge Sen. Marty Block, Sen. Barbara Boxer lashes out at Carly Fiorina as mean-spirited face of corporate greed, With Trump absent, conservative voters provide zingers at South Carolina forum, ]", "Date": "20150919", "Author": "[Javier Panzar ]", "Link": "http://www.latimes.com/local/politics/la-me-0919-gop-convention-20150919-story.html", "Title": "[California Republican candidates for U.S. Senate tout unity at party convention]"}