{"Content": "[ A little-known pact that for years has spared Walt Disney Co. from paying entertainment tax on its Anaheim amusement parks may be extended for three decades if the entertainment giant agrees to invest at least $1 billion in its resort properties in the coming years. While supporters say they are encouraged that Disney will continue to expand in a city where Disneyland opened 60 years ago, critics say Disney is getting a special break that could put residents at risk if the citys financial circumstances take a downturn. The current agreement that exempts Disney from paying an entertainment tax expires in 2016. The City Council will hold a hearing on the new pact July 7. The issue arises as the city prepares to switch next year to a district-based council election, which could dramatically change the face of a council that has typically had a cozy relationship with Disney. Under the new pact, the resort would be guaranteed reimbursement for any future entertainment tax levied in the next 30 years, so long as Disney invests at least $1 billion in the resort by 2024. If Disney invests an additional $500 million, the agreement could be extended 15 years. No institution in Anaheim currently pays an entertainment tax, but the agreement would provide an economic certainty for Disney as it weighs how and where to make its investments around the world, said Kristine Ridge, the citys interim assistant city manager. The company is preparing to open a $4.4-billion Disneyland in Shanghai next year. Disney officials said they approached Anaheim about extending the tax break so that executives could begin to discuss the future of Disneyland and California Adventure. Potential investments include traffic-flow improvements, a new 5,000-space parking garage and added attractions at the parks. The move does not signify immediate plans for an expansion of either park, nor the arrival of a hoped-for third theme park in Anaheims resort district. Since Disney acquired Marvel Entertainment Inc. in 2009 and Lucasfilm in 2012, fans have speculated that an expansion may include Marvel superheroes or Star Wars characters. But Disney officials have remained tight-lipped about their plans. Anaheim has been an economic success story thanks to its policies and initiatives that allow businesses to invest and thrive, said Michael Colglazier, president of Disneyland Resort. We are asking city leaders to continue with a policy set two decades ago that has driven unprecedented job creation, growth and prosperity and enabled the city to invest in vital services that benefit every Anaheim resident. Ridge said Disneys investment would generate more revenue long-term for the city than a tax, though the city did not have a estimate of what an entertainment tax might generate. Mayor Tom Tait said Disney shouldnt get a break at the expense of residents future financial security. Making a deal with Disney, the mayor said, would prevent future city leaders from imposing an entertainment tax, even if the city faced financial desperation. This is more than the City Council binding future City Councils, Tait said. It is the City Council binding future generations from even voting for a tax. Tait served on the City Council in 1996 when the original agreement was struck. He said he was wary of it then, and finds if even harder to swallow now. In its statement, the city said that that agreement provided Disney the confidence to undertake significant investment by opening California Adventure, the Grand Californian Hotel and Spa and Downtown Disney. Following Disneys expansion beginning the late 1990s, the citys revenue from hotel stays nearly tripled, according to the citys statement. Since 1996, the resort also doubled its workforce, and attendance increased by nearly 60%. In the coming fiscal year, city officials estimate that more than half of its gross general fund revenue will come from the resorts hotel, sales, property and business license taxes. The resort accounts for 4% of the citys total acreage, but Disney businesses there are expected to provide $148 million to the citys general fund revenue, according to the citys budget for its 2016 fiscal year, starting Wednesday. Excluding city services provided, the budget expects $67 million will be left over. They already are the largest tax provider in the city, Councilwoman Kris Murray said. Not to tax them further in exchange for more than $1 billion in new investment is a good deal for the city. There is probably no doubt that Disney plans to spend $1 billion on its theme parks in the near future, so the tax exemption is simply a way for the city to show its support for Disney, said Dennis Speigel, president of International Theme Park Services in Cincinnati. emily.foxhall@latimes.com, hugo.martin@latimes.com, 6:30 p.m.: Updates with additional details, Originally posted at 12:35 p.m.]", "Date": "20150626", "Author": "[Hugo Martin]", "Link": "http://www.latimes.com/local/lanow/la-me-disney-tax-break-20150626-story.html", "Title": "[For $1-billion investment, Disney would be spared Anaheim tax for 30 years ]"}