{"Content": "[ In other times, maybe even fairly recently, the religious freedom law signed last week in Indiana could have allowed Republican lawmakers to appeal to their core conservative supporters without attracting much notice from the general public. But the blowback against it that has upended the states business and political culture offers a vivid example of the unprecedented speed with which public opinion over gay rights has shifted. The change, stunning to public opinion researchers, has been downright befuddling to politicians and left many out of step with their constituents. \"Was I expecting this kind of backlash? Heavens no,\" Gov. Mike Pence told reporters Tuesday during a televised news conference in Indianapolis. The Republican, a former House member with presidential aspirations, promised to \"work around the clock\" to fix a law that critics contend could allow businesses to refuse service to gays based on a store owners religious beliefs. Pence, who as late as Sunday indicated no change was needed, on Tuesday pledged new legislation \"that makes it clear that this law does not give businesses the right to deny services to anyone.\", Pence stopped short of agreeing to repeal the law as many critics have demanded, and offered no specific suggestions for a fix. And he may have particular trouble squaring his twin promises to prevent discrimination against gays while protecting religious freedom for those who believe serving gay couples goes against their faith. His effort to contain the blossoming political problem came as a growing list of politicians, businesses and celebrities threatened to boycott the state. Angies List, a home-state company with close ties to the Republican political establishment, was among businesses criticizing the law, a sign that some traditional allies have veered away from the party on gay rights in response to changing consumer and employee attitudes. Apples chief executive, Tim Cook, solicited other businesses to join his in fighting such measures. Mark Emmert, president of the NCAA, which is based in Indiana and holds its Final Four college basketball championship in the state this weekend, said on CNBC on Tuesday that the law went against his organizations core values. The NCAA also suggested in a statement that future events in Indiana could be in jeopardy. The most dramatic statement against the states Republican leadership may have come from the Indianapolis Star, which ran a starkly worded editorial on its front page, with more than half the space devoted to the headline \"Fix This Now.\", \"Certainly, right now, theyve lost the message,\" said Patrick Kiely, a Republican who formerly served in the Indiana Legislature and now heads the Indiana Manufacturers Assn. \"On something like this, its hard to get it back, in the world we live in.\", The national divide over the law highlights a conflict between establishment Republicans, who had hoped to shift the partys emphasis away from social issues, and the conservative Republicans who still hold seats in state Legislatures and fuel much of the partys energy as the next presidential election nears. Though 19 other states and the federal government have laws similar to Indianas, the timing of that states religious freedom act has propelled the issue to national prominence. When Bill Clinton signed a less expansive law two decades ago, gay marriage was not legal anywhere. President Obama ran as a gay marriage opponent in 2008, before shifting his support in 2012. Now, the Democratic Party is almost uniformly in favor, but many Republicans still forcefully oppose it, because of religious beliefs or a quest for political advantage. The public campaign against the Indiana law has forced Pence and other potential presidential candidates to confront questions over gay rights that still split the GOP. Despite the fallout in Indiana, lawmakers in Arkansas passed a similar measure Tuesday, a reminder that the issue will continue to reverberate elsewhere even if tempers in Indiana calm. Whit Ayres, a prominent Republican pollster and strategist who is advising Sen. Marco Rubio of Florida, said it was urgent that the party figure out how to deal with gay rights, as their acceptance becomes more widespread. \"This is where were headed as a country,\" he said during a breakfast with reporters Tuesday, \"to the point where a political candidate who is perceived as anti-gay  at the presidential level  will never connect with people under 30 years old.\", Still, Rubio was among several potential 2016 candidates in the GOP, including former Florida Gov. Jeb Bush, to stand by Pence and the law. But they expressed their support in terms they hoped would not alienate voters who supported gay rights. \"This is simply allowing people of faith space to be able to express their beliefs. To be able to be people of conscience,\" Bush said in an interview with conservative radio host Hugh Hewitt, noting his home state has a similar law. \"I think once the facts are established, people arent going to see this as discriminatory at all.\", Rubio went a half-step further toward courting social conservatives. \"When youre asking someone who provides professional services to do something, or be punished by law, that violates their faith,\" he said in a Fox News interview. \"Youre violating that religious liberty they have.\", Part of the problem for Republicans is that a majority in their party disagrees with most other Americans on the issue of how to balance the rights of same-sex couples and business owners who might object to their marriages. In a survey last fall by the nonpartisan Pew Research Center, Americans were closely divided on the question of whether business owners should be allowed to refuse to serve same-sex couples because of a religious objection, with 49% saying they should be required to serve all customers and 47% saying they should be given a religious exemption. Among self-identified Republicans, there was lopsided support for a religious exemption, 68% to 28%. Americans older than 65 supported a religious exemption, 60% to 36%, and those younger than 30 opposed it, 62% to 35%. \"Equal treatment for gays is really not a left-wing issue anymore, certainly not for our students, and we have a very conservative student body,\" said Gerald Wright, a political scientist at Indiana University. Wright said the Indiana law was seen as particularly hostile to gays because it was passed to appease conservatives after an effort to put an amendment outlawing gay marriage on the ballot stalled in the Legislature. Gay marriage became legal in the state last year as a result of a federal court ruling. Democrats have been looking at the same poll numbers as Republicans, smiling gleefully at the conundrum facing Pence and his party. The Democratic National Committee has been sending reporters a compendium of supportive quotes from GOP candidates along with newspaper editorials condemning Indianas law. \"Being on the wrong side of history is rarely a good thing in politics,\" said Mo Elleithee, a spokesman for the DNC. \"I think thats where most of the Republicans find themselves right now.\", noah.bierman@latimes.com, Twitter: @noahbierman, mark.barabak@latimes.com, Twitter: @markzbarabak, Bierman reported from Washington and Barabak from San Francisco. Times staff writers David Lauter in Washington and Michael Muskal in Los Angeles contributed to this report.]", "Date": "20150331", "Author": "[Noah Bierman , Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/politics/la-na-indiana-law-20150401-story.html", "Title": "[Uproar over Indiana religious freedom law shows shift in gay rights fight]"}