{"Content": "[ More than a dozen Republicans eyeing the White House gathered here to make their case to hundreds of party activists, drawing out areas of disagreement in the expansive field that will likely emerge as contentious fault lines in the 2016 nominating process. The most potent conflict at thetwo-day conference came in the area of foreign policy, with hawks such as Sens. Lindsey Graham of South Carolina and Ted Cruz of Texas calling for a muscular posture to defeat Islamic State. \"People taking this stage, telling you to leave them alone, stay away from those people, dont get involved. Well, that wont work, because they are not going to leave you alone,\" Graham said Saturday afternoon at asession in a hotel ballroom. \"They want one thing  they want to destroy your way of life.\", The statement was a thinly veiled criticism of Kentucky Sen. Rand Paul, who has questioned the wisdom of broad U.S. intervention overseas. Earlier in the day, Paul pushed back at the notion that he was an isolationist. Paul, who is seeking to activate the New Hampshire voters who helped his father, Ron, to a second place finish in the 2012 primary, pledged to \"do everything it takes to defend the country against radical Islam.\" But, he asked, \"Why the hell did we ever go to Libya in the first place?\", \"This is something, if you watch closely, that separates me from other Republicans,\" he said. \"Other Republicans will criticize the president and Hillary Clinton for their foreign policy, but they would have done the same thing 10 times over.\", Graham and Paul spoke on the second day of the Republican Leadership Summit in the state that holds the first presidential primary. Much of their criticism was aimed at policies favored by President Obama and the Democratic presidential front-runner, Hillary Rodham Clinton; they generally steered clear of direct attacks by name on one another. Each candidate spoke and answered audience questions for a half-hour. At times, the gathering had a circus-like air, which became most pronounced with the arrival of businessman and perennial celebrity candidate Donald Trump. After entering the room to the theme song from the television show he hosts, NBCs \"The Apprentice,\" Trump said he could be engaging in more enjoyable pursuits but was considering a presidential run because politicians could not fix the nations problem. \"I know how to bring [the country] back. I wrote a book, The Art of the Deal, said to be the number one selling business book of all time. Great book  Thats why youre here,\" Trump said. \" All the people youre listening to, you can forget it because politicians are all talk, theyre no action.\", Trump and former Hewlett-Packard chief Carly Fiorina were the two potential candidates at the event who have never held elected office. Fiorina, hitting many of the same themes she focused on during her unsuccessful 2010 U.S. Senate run in California, tried to turn the lack of elected experience into a strength. \"While there are many public servants who are fine public servants, the truth is politics is only one experience. I have lots of experiences [and] I have a different perspective because of those experiences,\" she said. \"...Sometimes people who have been inside a system for so long -- they cannot see it for what it is anymore.\", The experience theme rose throughout the gathering, as candidates made arguments that their background, or their generation, was superior. Wisconsin Gov. Scott Walker touted his record of cutting taxes and boosting the states economy. And he attributed his success  in a state that votes Democratic in presidential elections  to standing by his convictions. What people want more than anything, they dont just want a fighter. They want someone who fights and wins, he said Saturday night. There are a lot of great fighters out there that dont win. There are a lot of winners out there; they dont fight. Former Florida Gov. Jeb Bush, for his part, focused his Friday remarks on the depth of experience that a candidate needs in order to serve as president, comments that were taken as a criticism of, among others, Cruz and a senator from his home state, Marco Rubio. I think one of the differences for the presidency than other positions is that someone sitting behind that big desk has to make decisions. You cant just be an empty slate, said Bush, who is expected to run for president but has not yet formally announced his candidacy. He added that Obama was in the U.S. Senate for two years before announcing his presidential bid, and previously in a state legislature with very little record of accomplishment. So I hope Ill be able to share the belief that accomplishment matters and leadership matters, Bush said. Who sits behind the big desk as it relates to the presidency is different than perhaps the United States Senate or another job. Rubio, who announced his presidential bid on Monday, has been in the Senate for a little more thanfour years and was previously a state legislator. (He offered his own gibes against older candidates, a field that would include Bush.) Cruz has been a senator for two years and was previously the Texas solicitor general. Common Core, the set of national education standards viewed by many conservatives as an unwarranted federal intrusion into schools, was another area of disagreement explored during the gathering. Bush strongly supports the standards, and has tried to rebuff criticism by arguing that the standards are voluntary. Several potential rivals, including Louisiana Gov. Bobby Jindal and Texas Cruz, just as strongly disagreed. Cruz, who announced his presidential run in late March, said Common Core is a violation of the 10thAmendment and declared that education is an area \"where the federal government has no business sticking its nose. We need to repeal every word of Common Core!\" (Because states choose to adopt the guidelines, any revocation would have to be done state by state.), Former Arkansas Gov. Mike Huckabee, who said he would announce his presidential plans on May 5, warned against Republicans damaging themselves in a savage primary. \"We can have a free-for-all, fratricide, a demolition derby,\" Huckabee said. \"The result will be we will make the Democrats work easier for them.\", He then pointed to his experience fighting the Clintons in his successful elections in Arkansas. \"I know the Clintons all too well. They play to win, they do anything necessary to win,\" he said. \"I faced them time and time again [and] I lived to tell about it.\", Potential frontrunner or little known, each would-be candidate used the opportunity to try to connect with party activists in a state that successfully selected the last two GOP nominees. Ohio Gov. John Kasich urged the crowd to not commit to other candidates too quickly; he said he was still deciding whether to run. \"Think about me, will you?\" he asked. Twitter: @LATSeema, , , , , , , , , , , , , , 5:44 p.m.: This article was updated with new quotes from Wisconsin Gov. Scott Walker. It was originally published at 4:40 p.m. ]", "Date": "20150418", "Author": "[Seema Mehta]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-republicans-new-hampshire-20150418-story.html", "Title": "[In New Hampshire, Republicans squabble over foreign policy, experience]"}