{"Content": "[ Newport Beach businessman Dale Dykema is a highly sought-after guest when potential Republican presidential candidates visit California. He recently attended an intimate dinner with former Florida Gov. Jeb Bush, a cocktail party headlined by Wisconsin Gov. Scott Walker and a half-hour tete-a-tete with New Jersey Gov. Chris Christie. In the last quarter of a century, Dykema, 85, has donated hundreds of thousands of dollars to GOP candidates, party organizations and political action committees. He has yet to make up his mind on whom to back  and more importantly, whom to raise money for  in the 2016 presidential campaign. \"There are just so many candidates in the race. Im completely on the fence,\" said Dykema, founder of TD Service Financial Corp. a company that provides foreclosure services for the mortgage industry. In 2012, he said, he settled quickly on former Massachusetts Gov. Mitt Romney, but for the upcoming election he may wait until after the first couple of primaries before deciding. The size of the field  well over a dozen likely candidates  coupled with the lack of a clear favorite mean many Republican donors in California share Dykemas reluctance to commit. \"Normally, theres a candidate that the entire establishment is behind and theres this huge fundraising juggernaut for one person,\" said Jon Fleischman, a state GOP official from Anaheim Hills and publisher of an influential conservative blog. \"This year, no one has the brass ring already in hand. Were seeing a lot more listening and a lot less giving early.\", On the Democratic side, state donors are already uniting behind former Secretary of State Hillary Rodham Clinton, the partys overwhelming favorite. She raised millions for her nascent campaign at events hosted earlier this month by entertainment and business leaders. As Republican donors weigh their choices, theyre grilling the 2016 candidates on a range of issues, including immigration, religious freedom and net neutrality. Theyre doing so in homes in Bel-Air, boardrooms in the Silicon Valley, parties in Orange County and GOP functions all over the state  a nod to Californias primacy in what is known in political circles as the \"invisible primary.\", California probably doesnt matter in the nominating fight. Its June 7, 2016, presidential primary is almost certainly too late to affect the GOPs process. The state is also too Democratic to put it in play in next years general election. But California is the biggest source of campaign cash in the nation. In the 2012 election, presidential candidates directly raised more than $112 million from Californias deep-pocketed donors. Thats almost the combined total raised in the next two most-generous states, Texas and New York, according to the Center for Responsive Politics. These figures do not include the millions donated to party committees and outside groups such as \"super PACs\" that are not controlled by a candidate. Not surprisingly, given Californias tilt toward Democrats, President Obama was the biggest beneficiary then, raising $62.8 million here for his reelection bid, according to the center. But GOP candidates also filled their campaign coffers here  Romney collected $41.3 million, and the rest of the Republican field raised nearly $8 million. Romneys extensive fundraising network in California, which he cultivated over nearly a decade, became available to others when he decided in January not to run again. \"Were talking a lot about it, but no ones committing to anyone right now,\" said Bret de St. Jeor, a Modesto businessman and Romney fundraiser in 2012. \"Its just flat-out too early. Lets hear a little bit more. Lets hear the opening statements from the other candidates before we start jumping on somebodys bandwagon.\", Donors \"love the courting process,\" said Shawn Steel, a Republican National Committee member from Surfside in Orange County. \"Most of the serious candidates are coming to California repeatedly, and their mission is to establish a rapport as early as possible  and to try to meet as many folks as possible.\", Steel, who is undecided, recently co-hosted a meet-and-greet and intimate dinner for Walker at the tony Pacific Club in Newport Beach. He noted that the field includes multiple candidates who appeal to the same GOP faction, whether its establishment voters, social conservatives or tea party groups. Many potential candidates, he added, have connections to California, or have the opportunity to grow support. Former Hewlett-Packard Chief Executive Carly Fiorina retains backers from her unsuccessful run against Sen. Barbara Boxer in 2010, Steel said. Former Texas Gov. Rick Perry developed ties to the state during his unsuccessful 2012 presidential bid, in part because one of his top strategists is a longtime and well-respected California GOP fundraiser. Walker is a familiar face in Californias donor community, as he is across the nation, because of his fierce fight against unions in Wisconsin. Kentucky Sen. Rand Paul has spent considerable time wooing the libertarian streak that runs through Silicon Valley. Florida Sen. Marco Rubio has blown away audiences with his oratory, Steel said. And Bushs family has long-standing alliances in the state. Jeb Bushs brother, former President George W. Bush, was a prodigious fundraiser here, performing a \"cash-ectomy on the California donor community\" whenever he visited, Fleischman said. \"It was staggering.\", Those relationships havent sealed the deal for Jeb Bush here, but they do provide an edge for the yet-undeclared candidate that was visible during a recent, lucrative fundraising swing through the state. \"I really wanted to see him run before his brother ran,\" said venture capitalist William H. Draper III, who went to Yale with their father, President George H.W. Bush, and served as his finance chair in his unsuccessful 1980 presidential run. Draper, a former president of the Export-Import Bank of the United States, co-hosted an East Palo Alto fundraiser for Jeb Bushs committee. Susan McCaw, a major fundraiser for George W. Bush who served as his ambassador to Austria, said she was impressed by Jeb Bushs record as governor of Florida and his support for education and immigration reform. She and her husband held a fundraiser for his political action committee at their Bel-Air home. \"I think he has the best chance of beating Hillary in the general,\" she said. Electability was the one quality nearly every donor  committed or not  mentioned as a priority. John Jordan, a tech entrepreneur and vintner who has spent millions on Republican causes, plans to make a decision over the summer. He is hosting a dinner for Walker at his Healdsburg vineyard and expects to huddle with Paul soon. His sole focus, he said, is backing the candidate who could win the White House in 2016 by attracting the various factions of GOP voters as well as less ideologically driven general-election voters. \"In a pretty cold-blooded way,\" Jordan said, \"it has got to be someone that can unite the base, that they will like enough to turn out for  but at the same time isnt someone thats obnoxious.\", seema.mehta@latimes.com, Twitter: @LATSeema]", "Date": "20150517", "Author": "[Seema Mehta]", "Link": "http://www.latimes.com/nation/politics/la-na-gop-fundraising-20150517-story.html", "Title": "[California donors wait for a favorite to emerge from big GOP presidential field]"}