{"Content": "[ Heeding the call of his own voice, celebrity developer Donald Trump announced Wednesday the formation of a presidential exploratory committee, flirting  again  with a contest he stands no chance of winning. His declaration, with a grandiosity that has become a Trump trademark, did nothing to change the dynamic of a quickening and increasingly competitive race for the 2016 Republican nomination. But in his loud, blunderbuss fashion, the attention-hungry Trump has underscored a growing phenomenon: Where long-shot candidates once ran to promote a cause  Eugene McCarthy, for instance, seeking to end the Vietnam War, or Steve Forbes pitching the flat tax  these days the pursuit of the White House has become a self-promotional ploy for some, exercised for fun and profit. Herman Cain, a pizza chain executive, parlayed his snappy performances in the 2012 debates into a national following and a syndicated radio program. Mike Huckabee, a former Arkansas governor and diet guru, landed his own Fox News show after an unsuccessful 2008 bid; even as he mulls another presidential run in 2016, Huckabee has mined his support network for commercial prospects. Others in the current Republican field  Ben Carson, a retired neurosurgeon, and Carly Fiorina, the fired Hewlett-Packard chief executive and 2010 California candidate for U.S. Senate  seem to have little chance of winning their partys nomination. Each has done extraordinarily well, however, raising their profile across the country, boosting lecture fees and raising the prospect of other lucrative opportunities. Sarah Palin, the 2008 Republican vice presidential nominee, and George E. Pataki, a former New York governor, have done nothing to discourage far-fetched talk of winning the White House; their trips to the early states of Iowa and New Hampshire have only drummed up attention. Trump, for his part, has publicly contemplated a presidential bid in each of the last four election cycles, presumably less for the financial benefit than for the satisfaction of his ego. In 1999, he formed an exploratory committee that went nowhere. In 2011, he spent weeks weighing a candidacy with extravagant fanfare before saying he would not run. In recent months, he began publicly musing once more about a possible run, wangling invitations to several candidate forums. Announcing his newly formed committee on Wednesday, Trump declared, \"I am the only one who can make America truly great again.\", The general response was a combination of eye-rolling and derision. \"If Donald Trump is a candidate, why not anyone who made it to the finals of The Bachelor?\" asked Marty Kaplan, a former Democratic speechwriter who now teaches at USCs Annenberg School for Communication and Journalism. Polls suggest there is little appetite for a Trump candidacy, his assertions notwithstanding. A recent Wall Street Journal/NBC News survey found nearly three-quarters of Republican primary voters could not see themselves supporting the New York City real estate mogul and reality-TV personality, the worst showing of any GOP prospect. But the nature of presidential politics has changed drastically over the last several decades  especially in the last few years  giving people like Trump the incentive and wherewithal to run even if they cannot seriously compete, much less win the White House. Candidates once had to pass muster with party bosses, governors or other elected officials who decided which prospects had the combination of experience, savvy and potential to make them strong contenders. \"To be taken seriously,\" said Stuart Rothenberg, publisher of a nonpartisan campaign newsletter, \"you needed political credentials.\", But the parties have shriveled as power brokers, especially in light of recent court rulings that have given wealthy donors considerably more clout. The round-the-clock news cycle, perpetuated by cable TV and social media and their endless appetite for fresh material, have also made it easier to gain exposure and build a political following absent any political accomplishments. \"A candidate thinks, What the hell, Ill announce and get on Sean Hannity or Ed Schultz or some talk-radio program,\" Rothenberg said, referring to two of cables political show hosts. \"It seems to have diluted the importance of what would traditionally be thought of as markers for credible candidates.\", The result can be entertaining, for those who enjoy campaign theater, but damaging to the more serious presidential contenders. To gain notice, long-shot candidates have every incentive to stake flamboyant or extreme positions, forcing others in the field to respond. (In the 2012 campaign, Trump gave prominent voice to those who falsely claimed President Obama was born in Kenya and was therefore not a U.S. citizen.) That, in turn, can color broader perceptions of the party. There is also the matter of taking up space, both physically and in the minds of voters; the upcoming presidential debates are a particular concern, said Scott Reed, a veteran GOP strategist. \"Republicans learned a lesson in the last cycle about letting the debates get out of control,\" said Reed, who suggested the inclusion of several less-plausible candidates overshadowed \"the seriousness of the event\" and created \"a caricature that was negative for the party.\", The Republican Party has taken steps to exert greater control over the 2016 GOP debate regimen, limiting their number and giving conservative media a greater voice in questioning the candidates. But a decision on who will participate  and, specifically, whether Trump will be invited, should he run  will be left to others. Allison Moore, a spokeswoman for the Republican National Committee, said \"the networks will announce the debate parameters well in advance of the first debate,\" tentatively set for August. Trump  and others angling for attention  will doubtless be heard from many times before then. mark.barabak@latimes.com, Twitter: @markzbarabak]", "Date": "20150319", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/politics/la-na-presidential-chaos-20150319-story.html", "Title": "[Presidential long shots often win big after losing election]"}