{"Content": "[ When activists from the Black Lives Matter movement arrived at a campaign rally for Hillary Rodham Clinton last month with plans to disrupt the event, they were blocked at the door by Secret Service agents and herded into an overflow room. No room, they were told. A noisy spectacle was averted, but the news spread quickly on social media, and Clinton staffers had to scramble. The Democratic presidential front-runner agreed to meet privately with the protesters, who wanted to challenge her on  among other racially charged issues  her past support for tough sentencing measures that they argued had resulted in unduly long periods of incarceration for black men. \"What in your heart has changed, that is going to change the direction of this country?\" one activist wanted to know. \"There has to be a reckoning, I agree with that,\" Clinton replied, according to a video of the closed-door encounter. She pointed to work she has done to improve the lives of minority children. \"But I think there also has to be some positive vision and plan that you can move people toward,\" she said. The confrontation  public or not  may have produced results. A week later, facing an audience of mainly African Americans at a town hall in North Las Vegas, Clinton changed her standard stump speech to include several points about blacks and the criminal justice system  heading off potential protests before anyone had a chance to stand up and shout. Raucous demonstrators have always been part of the theater of presidential electioneering, but as the 2016 campaign gets underway, the turbulent protests over social justice, police violence and immigration reform that have sent citizens into the streets across America over the last year are becoming increasingly visible on the campaign trail. Candidates are finding themselves being shouted down at events as seemingly innocuous as announcement speeches  often facing protesters not from another political camp, but from groups that might be seen as their allies. U.S. Sen. Bernie Sanders, the Vermont independent who is arguably the most liberal of any in the field so far, has been targeted a handful of times by Black Lives Matter protesters  at one point having to exit the stage and abandon an event in what should have been friendly territory in Seattle. Jeb Bush was 20 minutes into his presidential campaign kickoff speech at Miami Dade College in June when a group of protesters stood, unveiled neon green T-shirts spelling out \"Legal status is not enough,\" and began shouting. The interruption, a rebuke of Bushs refusal to support citizenship for the estimated 11 million people in the country illegally, caused the Republican candidate to pause and look at the rafters. \"So that our friends know,\" he said finally, his voice rising, \"the next president of the United States will pass meaningful immigration reforms.\", Bush, whose campaign has boasted that he will go anywhere and speak to anyone, was later shouted down by activists at a Nevada town hall in the same area where Clinton held her event the week before. Jamie Hall of the group Unity Vegas, formed last year during the outcry over police shooting deaths of unarmed black men, questioned Bush about the treatment of minorities in the criminal justice system. Later, she called his response \"vague.\", More effective, she said, was the group shouting \"Black lives matter!\" at him, forcing Bush to end the town hall abruptly. \"It made headlines and became an issue for him,\" Hall said. \"Sometimes you have to kick in the door by interrupting. Then it opens new opportunities and conversations.\", The energetic activism has pressured candidates from both parties to grapple with how to address concerns from blacks and Latinos that have been amplified in the wake of high-profile police shootings and no action on immigration reform in Congress. From hiring activists as campaign staffers to holding private meetings, White House hopefuls are adjusting their campaigns in an effort to not only address concerns of the groups, but also to keep a focus on their own message without facing disruptions. Interruptions cant be dismissed, said Stephanie Cutter, a Democratic strategist who worked as President Obamas 2012 deputy campaign manager. During that election cycle, Latino activists upset that Obama did not make immigration reform a central platform in his first term repeatedly protested during campaign rallies. In response, he would point to his executive actions and meet privately with protesters. \"Candidates have to find a way to communicate\" with protesters and let them \"know their issues matter,\" Cutter said. Sanders, who has amassed large crowds while pursuing the Democratic nomination  including an estimated 27,500 in Los Angeles in August  hired campaign staffers who have worked with the Black Lives Matter movement. Faced with protesters, he has sometimes gone off script to tout his record on civil rights dating to the 1960s. \"We see it as an opportunity for him to speak about key issues that people are raising and let them know what his proposals are,\" said campaign spokesman Michael Briggs. \"Its not bad at all.\", Tia Oso was among those who interrupted an event with both Sanders and former Maryland Gov. Martin OMalley in Phoenix in July. Oso  national coordinator for Black Alliance for Just Immigration, which works with Black Lives Matter activists  called on OMalley to recognize high-profile deaths of blacks at the hands of police. His response, \"All lives matter,\" drew further protests, and he later apologized. \"Disruptions and direct confrontations are all a part of strategies and are all tactics for getting the message heard and igniting a movement,\" Oso said in an interview. \"Electoral politics is not our primary focus, though presidential elections are a huge focus in American life. And what were talking about is American life.\", In August activists with the movement released proposals calling for limiting police use of force and increasing oversight of departments. During a recent interview in San Francisco, OMalley said running for president is partly about opening the door to contentious issues. \"Even if sometimes that conversation takes the form of anger and grief and suffering and hurt, its important to be present at the center of that conversation if youre truly offering yourself as a leader,\" said OMalley, who served two terms as mayor of Baltimore before becoming governor. \"When youre a big-city mayor, particularly if youre a minority mayor as I was in a majority African-American city, there was never a night when I wasnt out in public and always very intentionally making myself vulnerable by being present,\" he said. \"You just stop thinking of it in terms of vulnerability and, instead, you think of it in terms of being present and serving.\", One of those seemingly unruffled by interruptions has been GOP front-runner Donald Trump. The billionaire businessman was interrupted at a campaign rally in Phoenix this summer by Latino activists who said his inflammatory rhetoric about Mexicans was racist, but Trump brushed them aside as they were escorted out of the convention hall. His parting words drew applause from supporters. \"Dont worry,\" he said, grinning. \"Well take our country back. Very soon.\", Times staff writer Mark Z. Barabak contributed to this report. Twitter: @kurtisalee, ALSO:, Democrats defend Hillary Clintons use of private email server, How one big promise Jeb Bush made to Floridas economy has yet to deliver, Scott Walker sides with Trump on immigration and offers alternative to Obamacare, Sept. 2, 7:01 p.m.: This article was updated throughout. This article was first published at 3 a.m. Aug. 25.]", "Date": "20150902", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/politics/la-na-campaign-protests-20150825-story.html", "Title": "[Candidates interrupted: Why presidential hopefuls are getting heckled by allies]"}