{"Content": "[ At the end of President Obamas sixth year in office, the commander in chief who once vowed to end Americas longest period of war still maintains thousands of troops in Afghanistan and Iraq  conflicts that refuse to conform to neat White House timetables. The end of this year marks an end to the official combat role for the U.S. in Afghanistan. As 2015 dawns, U.S. troops transition to a training and support role, even as the Taliban is increasing its attacks. And in Iraq, more U.S. troops will be on the way to a war that was supposed to be over, at least as far as the U.S. goes. Obama long ago recognized, at least privately, that in seeking to extricate American troops from wars abroad, he was not ending those conflicts, only Americas involvement in them. But even that goal has proved stubbornly elusive. Heres a primer on what lies ahead in 2015 for the Pentagon in both places:, Hasnt Obama succeeded in shrinking the U.S. military presence?, Yes. In Afghanistan, the U.S. has carried out a major withdrawal over the last two years, shrinking its troop presence from about 100,000 at the height of the war to 10,800 today. Thats the level authorized by the White House through early next spring, when it is due to drop again, to 9,800. All U.S. troops are due to leave by the end of 2016, except a small contingent attached to the U.S. Embassy. But Iraq has shown how hard it is to follow such timetables. The U.S. pulled all its troops out in December 2011. But last August, Obama announced plans to send about 1,500 troops back when Islamic State militants swept in from Syria and took control of large parts of the country. Obama recently decided to roughly double the U.S. troop level to 3,100. Thousands more are supporting the effort from bases in the region. What are the troops doing?, A mix of missions. In Afghanistan, they work with military advisors from other countries to help train Afghan security forces, especially the nations still primitive air force. The goal is to professionalize a force that has shown a capability to fight but remains far from capable of sustaining itself over the long term. Most U.S. troops work at large bases in the countrys east and south, not at combat outposts. Despite White House insistence that the U.S. combat role is over, the troops could be forced to help defend the bases from insurgent attacks. About 4,000 special operations troops will continue to carry out raids against the remnants of Al Qaeda and their supporters. And U.S. forces will have authority to assist the Afghan military with airstrikes, supplies and even ground forces if it is in danger of a major defeat by insurgents. What about in Iraq?, The White House has put strict limits on the U.S. role there. No troops are supposed to be in ground combat. Special operations troops are advising Iraqi and Kurdish commanders from joint operations centers, where they coordinate airstrikes against Islamic State positions and convoys. U.S. officers are finalizing plans to begin retraining Iraqi ground forces, many of which collapsed last summer when the militants attacked, or are hindered by sectarian officers, poor equipment and large numbers of so-called ghost soldiers, who are on the payroll but dont show up. U.S. troops also coordinate delivery of U.S.-supplied weapons and equipment. So the U.S. wants to shift to a support mission and prevent U.S. casualties?, Mostly, yes. But carrying out such a shift isnt likely to go smoothly. Already in Afghanistan, as U.S. troops have withdrawn, Taliban insurgents have stepped up attacks, even in Kabul, the capital. Afghanistans new president, Ashraf Ghani, is worried about the ability of his troops to withstand the insurgents next year and is already lobbying U.S. officials to consider slowing down the timetable for withdrawing remaining U.S. forces. In Iraq, the timetable is more open-ended. U.S. officials warn that American troops may be needed for three years or more to help Iraq regain control of its territory and to keep pressure on Islamic State forces in neighboring Syria. How does the Pentagon feel about the White House strategy?, Many in uniform are glad to see the costly wars come to an end. On the other hand, some privately complain that Obamas goal of disengaging militarily, and his fondness for withdrawal deadlines, sacrificed many of the gains they fought for in Iraq and risks doing the same in Afghanistan. Having seen Iraq fall back into chaos after U.S troops left, they hope Obama will prove more flexible about keeping forces in Afghanistan if security there remains precarious. What are the stakes for Obama?, Politically, the White House is hoping that by shrinking the militarys mission and presence overseas, the public will give him credit for getting close enough to his goal of ending the wars without disengaging from the national security threats emanating from the region. But there is another scenario: If the Afghan Taliban shows continuing resurgence, Obama may face growing pressure from his commanders, Afghan officials and Republicans in control of Congress to expand the mission there. The same dynamic could arise in Iraq and Syria, where signs already suggest the U.S.-led airstrikes are reaching the limits of their ability to inflict damage on Islamic State militants. Before he leaves office in 2017, Obama may face a decision about whether he wants to be remembered as the president who brought the troops home or the one who left too quickly.]", "Date": "20141229", "Author": "[David S. Cloud]", "Link": "http://www.latimes.com/world/afghanistan-pakistan/la-fg-year-ahead-military-20141229-story.html", "Title": "[What lies ahead for U.S. military in Afghanistan, Iraq]"}