{"Content": "[ Inching closer to a second try for president, Republican Mike Huckabee said Friday he would announce his intentions next month in Hope, Ark. the hometown he shares with former President Clinton. I think it will be worth tuning in for, Huckabee, a former Arkansas governor and 2008 candidate, said in a brief Fox News interview. The event is scheduled for May 5. Earlier, speaking to reporters in Washington, Huckabee signaled his likely candidacy, boasting of his continued support in early-voting Iowa and suggesting he was the best candidate to face the Democratic front-runner, Hillary Rodham Clinton. Theres only one person I know in the Republican field that has consistently run against the Clinton political machine, the Clinton political money,\" Huckabee said. \"Most all of my races, both Bill and Hillary Clinton came back to Arkansas to campaign for my opponents. So I know the process quite well -- and the good news for me is that Ive defeated that political machine. Huckabee, who served more than 10 years as governor, was a surprise winner of the 2008 Iowa caucuses, riding a strong wave of support among socially conservative voters. He went on to win seven other contests, most in his native South, before ceding the GOP nomination to Arizona Sen. John McCain. Huckabee acknowledged Friday he would have a tough time repeating his Iowa performance given the larger, more competitive field, but he told reporters he believed most of the people who were there with me eight years ago are still with me. Huckabees 2008 performance turned the former Baptist minister into a national political celebrity, launching a lucrative career for him as an author, speaker and contributor to Fox News, where he hosted a weekly program. It also made Huckabee one of the early front-runners for the 2012 GOP nomination. But in May 2011 Huckabee ruled out a second consecutive try for the White House, saying on his Fox program, All the factors say go, but my heart says no. He had come to enjoy his millionaire status, associates said, and Huckabee loathed the aggressive and incessant fundraising that has become required of todays serious presidential hopefuls. While both factors remain true, Huckabee signaled a change of heart this year. In January, he left his Fox program, saying he would give thought to another presidential run in 2016. He promised a decision by late spring, though his early steps have signaled an affirmative verdict; this month he formed an exploratory committee, which allows him to finance his travels and pay for staffers without facing the legal restrictions or other obligations facing an officially declared White House hopeful. As a candidate, Huckabee would most likely vie with former Texas Gov. Rick Perry, Sen. Rick Santorumthe narrow winner of the 2012 Iowa caucusesand others aiming for the support of Christian conservative voters. mark.barabak@latimes.com, Follow  @markzbarabak fornational & California politics]", "Date": "20150417", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-mike-huckabee-2016-20150417-story.html", "Title": "[Mike Huckabee edges toward 2016 run; May 5 announcement planned]"}