{"Content": "[ SACRAMENTO  Reeling from embarrassing bribery, corruption and voter fraud scandals, the state Senate took the unprecedented action Friday of voting to suspend three Democratic lawmakers from office pending the resolution of criminal charges against them. The paid suspensions of Sens. Leland Yee, Ronald S. Calderon and Roderick Wright all but guarantee Democrats will not regain their supermajority in the Senate this session. And the controversies are expected to become anti-incumbent campaign fodder in other districts in this years elections. The bipartisan 28-1 vote came two days after Yee was arrested in his hometown of San Francisco and charged by federal authorities with conspiracy to traffic in firearms without a license and accepting campaign funds in exchange for political favors. Calderon, of Montebello, was indicted last month and charged with accepting nearly $100,000 in bribes for official favors, and Wright has been convicted of lying about living in Inglewood in his Senate district. They had both previously been allowed to take voluntary leaves of absence to fight their separate criminal cases. \"I think this is a black mark on the institution,\" said Senate Republican leader Bob Huff about the spate of scandals. \"The Senate took needed and decisive action today to help restore the publics trust in this great institution.\", The Senate has never before suspended one of its members, according to Senate President Pro Tem Darrell Steinberg (D-Sacramento), who called Yees alleged actions \"sordid.\", In previous weeks, Steinberg had blocked Republican attempts to oust Calderon and Wright, but on Friday he said the allegations against Yee \"changed my point of view.\" He said having three such cases required firmer and equal action. \"An affirmative suspension puts this house on formal record that we unequivocally distance ourselves and the Senate from the unfathomable allegations contained in the Yee indictment as well as the other cases,\" Steinberg said. Steinberg has seen Wrights case as different because he says residency laws are ambiguous. But he saw more serious crimes alleged in Calderons bribery indictment and the case alleging that Yee accepted payments to help arrange an illegal arms deal and influence marijuana laws. As a result, Steinberg had called on Yee and Calderon to resign, but they refused. Gov. Jerry Brown on Friday called on all three lawmakers to resign. Steinberg could have called a vote to expel the members permanently, but he decided not to do that. \"The satisfying thing would be to expel them immediately,\" Steinberg told his colleagues. \"But I reluctantly conclude that what would be satisfying and popular would also run afoul of the most basic American principle of due process and the idea that people are presumed innocent unless and until proven guilty.\", Sen. Joel Anderson (R-San Diego) cast the only vote against the suspensions, saying he thinks the three senators should be expelled. \"I dont believe they deserve a paid vacation,\" Anderson said. The state Constitution does not allow the Senate to withhold pay from a suspended lawmaker, so the trio will continue to draw their $95,291 annual salaries. Steinberg said he will introduce a constitutional amendment, to be put before the voters, that would allow the Senate to withhold pay when it suspends lawmakers. The Senate leader also said he would cancel a future floor session and hire trainers to spend the day meeting one-on-one with each senator and each of their staffers to review the ethics rules. He said there would be confidential conversations with each member and aide about whether they have concerns about specific actions taking place at the Capitol. \"I call on our entire body to take a deeper look at our culture,\" Steinberg told his colleagues in an impassioned speech in which he defended the Senate. Calderon declined to comment on his suspension through a spokesman, and representatives of Yee and Wright did not return calls seeking responses. Yee has been released on $500,000 bond but was not present for the Senate vote. A 137-page FBI affidavit alleges that Yee offered to help an undercover agent buy automatic weapons and to assist another undercover agent, who posed as a medical marijuana businessman, to meet influential legislators who could affect regulation of marijuana. Sen. Kevin de Len (D-Los Angeles) said the affidavit reads like a \"bad Hollywood script,\" adding: \"All of us collectively are shocked, we are dismayed by the allegations.\" But he said having criminal cases at the same time against three senators is an \"anomaly.\", Sen. Steve Knight (R-Paldmale) said that the allegations are \"embarrassing\" to the Senate, and that Wright should be expelled because a jury has found him guilty of eight felonies. \"Its never too late to do the right thing,\" he said. Yee and Calderon are prevented by term limits from running for reelection when their terms expire at the end of this year. Wrights term ends in 2016. If a judge overturns the jury verdict at a May 16 hearing, Wright could return to office. If the verdict is upheld and he resigns, a special election would be called by the governor, with mid-August being the earliest the seat could be filled, right before the end of the legislative session. The political fallout from the scandals could prevent Democrats in this years elections from regaining their two-thirds majority, which allows them to raise taxes and veto bills without Republican support. They lost it when Calderon took a leave on March 2, and are now down two votes with Yee also on suspension. Mark Baldassare, president of the Public Policy Institute of California, said hell be watching to see if the trio of scandals \"becomes an issue in those competitive seats around the state, as Democrats seek to get back their two-thirds majority in the Senate and Republicans look for ways to be competitive.\", With the controversies capturing the publics attention, \"it puts the stress on the incumbents to demonstrate to voters that they are doing the peoples business with the highest level of ethics and integrity that people expect,\" he said. patrick.mcgreevy@latimes.com, Times staff writer Melanie Mason in Sacramento contributed to this report.]", "Date": "20140328", "Author": "NULL", "Link": "http://www.latimes.com/local/la-me-yee-capitol-20140329-story.html", "Title": "[In unprecedented move, state Senate votes to suspend three lawmakers]"}