{"Content": "[ SACRAMENTO  Its quiet at the California Capitol. While activity traditionally lags in the first few months of a legislative session, its downright sleepy at the statehouse. ------------FOR THE RECORD:  Capitol scene: On the Monday Business page of the March 2 Section A, a Capitol Business Beat column about the relative quiet in Sacramento said that revised term limits gave elected officials more time in the Legislature, up to 12 years. The law allows lawmakers to spend a maximum of 12 years in one house of the Legislature, either the Senate or the Assembly. But it also reduced from 14 years to 12 years the total combined time that can be served in both houses.   ------------, Lawmakers including scores of freshmen are still proposing plenty of bills  2,297 as of Fridays deadline for new legislation. But the usually camera-hungry politicians are holding fewer news conferences to tout proposals such as protecting consumer privacy and banning chewing tobacco at baseball games. And Gov. Jerry Brown, who was handily reelected to a fourth and final term, is spending most of his time in his office working on the agenda he set in his state of the state speech in January. The governor wants more renewable energy projects, a controversial high-speed rail line and a replumbing of water facilities to ship water from Northern to Southern California. Brown is no flashy politician. He has little taste for the Hollywood-style media events favored by his action-hero predecessor, Arnold Schwarzenegger. Veteran state politics watchers say theyre dumbfounded by the Sacramento slo-mo. The lack of electricity in the air around the Capitol is \"eerie,\" says Barbara OConnor, a professor emeritus of political science and communications at Cal State Sacramento. OConnor said she was amazed last week at the few people she saw at a restaurant popular with legislators and lobbyists. The stillness, she said, \"could be good or could be bad, nobody knows. But its not normal.\", The Capitols quiet atmosphere perhaps is the result of Browns philosophic style of governing and a certain contemplativeness that borrows from his time at a Jesuit seminary and his studies of Zen Buddhism in Japan in later years. \"The governor sets the tone in Sacramento, not the Legislature,\" said Bill Whalen, a research fellow at the Hoover Institution at Stanford University and a speech writer for Gov. Pete Wilson in the early 1990s. Brown, he said, \"spends a lot of his time off the radar screen and underground, which is not to say that hes not doing his job.\", Whats more, California now has a small budget surplus, Whalen pointed out, resulting in fewer noisy protests from teachers, nurses and other groups complaining about slashed spending. The upshot is the public and voters dont feel threatened by any huge crisis, he said. \"They dont feel like a sword of Damocles is hanging over them.\" , Democratic political strategist Darry Sragow said he senses a change in voter attitudes. Many are worried about big-picture issues, such as drought, climate change, education and jobs, and less about \"nanny\" bills that appeal to certain causes or constituent groups, he said. \"You cant push some magic button and make something happen right away,\" he said. \"They are big, complex issues and have to play out over time.\", And now that voters have revised term limits and given elected officials more time in the Legislature, up to 12 years, Sragow said. \"They are not going to be in the rush ... to make their mark in their first 20 seconds in Sacramento.\", marc.lifsher@latimes.com, Twitter: @MarcLifsher]", "Date": "20150301", "Author": "[Marc Lifsher]", "Link": "http://www.latimes.com/business/la-fi-capitol-business-beat-20150302-story.html", "Title": "[California Legislature hits a lull]"}