{"Content": "[ When I was living in Chile in 1968, my Chilean friends often explained to me proudly that their country was different from other Latin American countries. Chile had a long democratic tradition. Its armed forces had rarely and only briefly meddled in the government, and not at all since 1932. Chile was blessed by a strong cultural identity and a big middle class. It had a diversified economy that combined the worlds largest copper mines with manufacturing and agriculture. Chileans were better educated than other Latin Americans, and they based their universities and agriculture on European models. Most of all, they explained, Chileans knew how to govern themselves, as summarized in the saying \"We Chileans will never be extremists.\", My friends then didnt foresee what would happen five years later. In 1973, after decades of democratic elections, Chiles armed forces overthrew then-President Salvador Allende. The resulting Chilean military government, under General Augusto Pinochet, set modern world records for inventing sadistic sexual tortures too revolting to describe in print. It aimed to exterminate its opponents, \"disappearing\" and killing thousands of Chileans and driving a hundred thousand more into exile. Pinochet held on to power for 17 years. In retrospect, there had been abundant signs of trouble brewing in Chile for years before the coup. The countrys left, right and center political parties, which drew roughly equal numbers of votes, couldnt agree on how to address Chiles chronic economic and social problems, which kept the Congress in a state of gridlock. Allende had been elected by a narrow 36% plurality of voters, and his party coalition controlled neither house of Congress, yet he nevertheless tried to introduce radical political and economic changes. When the armed forces finally launched their coup and imposed a right-wing dictatorship, it initially received broad support from centrist Chileans, frustrated by years of government gridlock and the declining Chilean economy. Moderate Chileans reasoned that the military dictatorship would be just a brief transitional stage necessary to restore functional democracy to Chile. Chile is by no means the only place where government gridlock and breakdown of political compromise led ultimately to military dictatorship, the end of democracy and (in some cases) civil war. Examples include Egypt today, Indonesia in 1957, Spain in the late 1930s and Austria just before the Nazi era. So, should we worry about possible parallels between Chile in 1968 and the U.S. today? On the one hand, it seems unthinkable that the U.S. could drift into dictatorship. Like my Chilean friends then, we Americans are proud of our long democratic tradition and our political stability. We are blessed by a strong national identity and a large middle class. Our highly diversified economy, the biggest in the world, includes resource extraction (especially of oil), manufacturing, agriculture, and technological innovation. Our citizens are highly educated, and we can boast of the worlds best universities. Ever since our nations independence in 1783, we have known how to govern ourselves. But, on the other hand, like Chileans before and under Allende, we have become stuck in political gridlock. Our citizens are split by deep disagreements about basic economic, social and political issues, including government interventions, immigration, investment in education and infrastructure, and inequality of income and opportunity. Our economy is decidedly sluggish. Meanwhile, our politicians have been increasingly unwilling or unable to craft compromises. The most recent Congress passed fewer laws than any Congress in decades. Democrats and Republicans on Capitol Hill couldnt agree even on matters that should have been noncontroversial, such as funding the Federal Aviation Administration and confirming the nominations of judges and second-level government officers. And American democracy is being eroded by partisan measures aimed at preventing registration or voting by citizens likely to prefer the other party, and by massive distortion of elections by big money. You may object that the American armed forces, unlike those in Chile or Indonesia or Spain, have no precedent at all for interfering in American politics. Thats true. But consider what happened in 1933 in Austria, where private citizens had increasingly been arming themselves and forming private militias. When Austrias Chancellor Engelbert Dollfuss abolished the countrys legislature and established an authoritarian right-wing government, he didnt use an Austrian army to crush his left-wing political opponents. He did it with a militia of his own armed supporters. Could that be possible here? Already, plenty of Americans are asserting the right to carry guns in previously unlikely places (such as in schools and government offices). Already, they are forming private militias for purposes such as patrolling the Mexican border and protecting a claimed right to graze cattle on federal lands. Again, when private citizen militias already carry guns for those purposes, its \"just\" a matter of expanding the scope of an established principle to use guns for other purposes. We Americans today are focused on the wrong threats to American democracy. We are obsessed with threats from overseas: from terrorists and Islamist extremists, and from other countries. But realistically, while terrorists and Islamists and other countries will continue to cause trouble for us, the chance of their ending American democracy is nil. The only real threat to American democracy comes from Americans themselves. If our politicians continue to yield to pressure from extremists not to compromise and remain mired in gridlock, the majority of decent Americans may in frustration come to view an authoritarian government as the only solution to political gridlock  as a lesser evil that has to be tolerated. That said, Im not claiming that all political differences can be resolved by compromise, especially when one side or another believes it can prevail without concessions. In Chile in 1973, the armed forces calculated, correctly, that they would quickly win an armed conflict. But Allende and his supporters also believed, incorrectly, that they could prevail, and so saw no need to compromise. Compromise is also unlikely when the opposing parties consider their ideals nonnegotiable, and worth dying for. In 1940, after Hitlers defeat of France placed Britain at great military disadvantage in the face of an expected German invasion, the British Cabinet debated whether to attempt a compromise with Hitler by giving up Malta and Gibraltar in exchange for a peace agreement. Winston Churchill eventually convinced his Cabinet not to compromise. In retrospect, we consider that Churchill was correct in that refusal to compromise. But neither of those impediments to compromise applies to the U.S. today. Americans are divided almost equally between liberals and conservatives; neither side has any reasonable hope of a quick victory if events turn violent. None of the issues about which Americans are now divided seems to me to approach in importance the survival of American democracy. Our issues arent worth dying for, whereas, to the British of 1940, the consequences of a Nazi takeover were indeed worth dying for. Decent Americans should learn from recent history. Compromising cherished political beliefs will be painful, for both Republicans and Democrats. But the alternative, as Chileans and Spaniards can attest, might be something far more painful than compromise. Jared Diamond is a UCLA geography professor and author of \"The World Until Yesterday,\" \"Collapse\" and the Pulitzer Prize-winning \"Guns, Germs and Steel.\", Follow the Opinion section on Twitter @latimesopinion, ]", "Date": "20141226", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-diamond-chile-america-democracy-20141228-story.html", "Title": "[America needs to study the enemy within]"}