{"Content": "[ After Mitt Romney lost the 2012 presidential election, Republican Party Chairman Reince Priebus commissioned an autopsy to determine what had gone wrong. High on the list: a yawning gender gap. Romney won the votes of most men but lost among female voters by 11 percentage points; among single women, the margin was a daunting 36 points. \"Our candidates  need to use language that addresses concerns that are on womens minds in order to let them know we are fighting for them,\" the Republican National Committee recommended. So Priebus must not be terribly happy that the partys (temporary) front-runner, Donald Trump, said Fox News anchor Megyn Kelly had \"blood coming out of her wherever\" when she asked him tough questions in last weeks debate. Trumps boorishness, however, isnt the GOPs biggest obstacle on the way to gender parity. A good chunk of last weeks debate focused on abortion. In an attempt to appeal to social conservatives, several candidates steered right into what most voters will see as fringe territory. Florida Sen. Marco Rubio said he thinks abortion should be illegal even when a pregnancy results from rape or incest, although he said he would support legislation including those exceptions if that was the only way to reduce abortions. Wisconsin Gov. Scott Walker reaffirmed his view that abortion should be illegal with no exceptions, not even to save a mothers life. \"There are many other alternatives that can also protect the life of that mother,\" he said. And former Arkansas Gov. Mike Huckabee said he favored legislation to confer constitutional rights on the unborn, an action that could undo the Roe vs. Wade decision. Polls have consistently found that no more than one-quarter of Americans think abortion should be illegal without any exceptions. A 2012 CNN poll, for example, found that 83% of voters believed that abortion should be legal in cases of rape or incest, including 76% of Republicans. The last three GOP presidential candidates  Romney, John McCain and George W. Bush  all campaigned on antiabortion platforms but agreed to those exceptions. If Rubio, Walker or Huckabee win the nomination  and all three are in the top tier in national polls  Democrats will seize on their hard-line positions to widen the gender gap. Indeed, Democratic front-runner Hillary Rodham Clinton has already pounced on GOP antiabortion rhetoric. \"These women that I have fought for, worked for, stood up for  may lose the right to exercise a personal choice if certain Republicans were to be successful,\" Clinton said Monday. \"What Marco Rubio said has as much of an impact [as Trumps comments], and it is deeply troubling.\", In case you missed it, Clinton is running explicitly as a champion of women  a role she shied away from during her first presidential run in 2008. All this talk about abortion (not to mention menstruation) raises another problem for the GOP: Those arent the issues Republican strategists think can carry their candidate into the White House. \"This election, like most elections, is going to be about jobs and the economy,\" Republican pollster David Winston told me. \"If youre off talking about another topic, unless its really pressing, youre not focusing where you need to.\", Winston analyzed the Fox News debate and found that only five of the moderators 48 questions were about the economy  about 10%. \"Its the voters No. 1 concern, but it tied for fourth in the debate,\" he said, after questions about the candidates electability, foreign policy and social issues. Republican candidates have tried to discuss the economy  Jeb Bush has said hell aim for a 4% growth rate; Rubio has proposed a controversial tax reform  but theyve been drowned out by arguments over abortion, immigration and Trump. Clinton, meanwhile, has been able to focus her campaign on economic proposals, including financial reform and college loans. \"You can agree or disagree with what shes saying, but at least she can drive what the discourse is about,\" Winston said. The one consolation for Republicans is that Clinton hasnt been able to turn that advantage into a gain in the polls. As NBCs Chuck Todd has noted, so far this campaign has mostly been an unpopularity contest  on both sides. Six months before the first primary, theres still plenty of time for Trumps lead to evaporate and for other candidates to turn the debate toward the economy. For now, though, the GOP still has a woman problem. doyle.mcmanus@latimes.com, Twitter: @DoyleMcManus, Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150812", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0812-mcmanus-gop-woman-problem-20150812-column.html", "Title": "[The GOP's woman problem goes beyond Trump]"}