{"Content": "[ The U.S. has become notably less Christian in the last few years, but the shift has come unevenly, with New England and the Pacific Northwest at the leading edge of the social transformation and the South holding fast to more traditional religious beliefs. Among the 10 states with the largest percentage of adults who profess no religion, New England has four -- Maine, New Hampshire, Vermont and Massachusetts -- and the other six are in the West, according to amajor new study by the Pew Research Center. Alaska, Washington, Oregon, Montana, Colorado and Nevada round out the list of states with the largest share of secular adults. By comparison, the states with the lowest percentage of \"nones,\" as the study labels them, and the highest percentage of Christians, are mostly in the traditional Southern Bible Belt, from South Carolina and Georgia west to Texas and Oklahoma. South Dakota and West Virginia round out the list of the top 10. In 2007, when Pew last conducted a major survey of Americas religious beliefs, no state had more than about one in four adult residents who described themselves as either atheists, agnostics or religiously \"nothing in particular.\", The current study, conducted last summer and released Tuesday, found several states where the share has climbed to roughly one in three adults, including the four in New England as well as Oregon, Washington and Alaska. In Vermont and New Hampshire, almost four in 10 adults are \"nones.\", The shift has been dramatic in some states. In Massachusetts, the share of adults without a religion increased 15 percentage points in the seven years between the two surveys, the largest increase of any state. In Idaho, the share of secular adults grew 11 points. New York state saw a 10-point increase. At the other end of the spectrum, only one state, West Virginia, saw an actual decrease in the percentage of secular residents, a one-point decline. Mississippi, Louisiana and Alabama, the three states with the largest share of Christian adults, were also at the top of that list in 2007. In all three, the share of adults with no religion grew, although from a low level. Mississippi went from 6% \"none\" to 14%, while Alabama and Louisiana increased from 8% each to 12% and 13% respectively. The study, which surveyed 35,000 adult Americans, has a margin of error of +/- 0.6% for the full national sample. The margin of error is larger for the individual state samples, varying according to the size of the state. For more on politics and policy, follow@DavidLauter on Twitter.]", "Date": "20150513", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/la-na-religion-region-20150513-story.html", "Title": "[New England and the Northwest are the least Christian parts of U.S.]"}