{"Content": "[ Hillary Rodham Clinton outlined a plan Monday to slash student loan interest rates while aiming to guarantee students could attend college without needing to take out loans in the first place, tapping into an issue that has risen in prominence among Democrats. Under Clintons plan, state governments, higher education institutions and students would play roles alongside the federal government in addressing the affordability of higher education and the debt that can come from it. We need to make a quality education affordable and available to everyone willing to work for it without saddling them with decades of debt, she said. The $350-billion plan Clinton outlined at a New Hampshire town hall meeting was the most expensive and expansive policy proposal of her campaign thus far. And as she tries to calibrate her approach to campaigning during a primary with a restive, liberal electorate while presenting herself as a pragmatic leader with an eye to the general election, Clinton won praise from both progressive groups and a centrist Democratic think tank that have been at odds at times. States that agree to increase spending on higher education would be eligible for federal grants to help reduce the gap between what families can afford to pay and full tuition. Families will also be required to meet what the campaign says would be a realistic contribution to tuition, and students would also be required to work 10 hours a week in return for being freed from borrowing money. We cant expect the federal government just to pay the bill for free. Thats not how America works, Clinton said. In addition, students from low-income families would also be eligible to use Pell grants to pay for room and board. The option would also be available to other students who commit to a form of public service, which could include a newly expanded AmeriCorps. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, The plan aims to give incentives to colleges and universities to control costs and assume a share of the responsibility for rising debt. A fact sheet points to a proposal co-sponsored by New Hampshires Democratic senator, Jeanne Shaheen, that would change the formula for determining eligibility for certain federal funds based on the proportion of students who are paying back loans, and require risk-sharing payments to the Department of Education for loans not being repaid. Clinton would also reduce the interest rate that the federal government charges for Stafford loans, to a point where the program would break even, rather than generate a profit to the Treasury. Students would also be able to refinance their outstanding loans at current lower rates, and future graduates would be eligible for an income-based repayment program, capping debt payments at 10% of their income. The campaign says the total cost of her proposal would be $350 billion over 10 years, with more than half of the cost going to grants for states and colleges to reduce tuition. It would be paid for by closing tax loopholes on higher earners. The Progressive Change Campaign Committee, which promotes liberal policies, called the plan very big and ambitious and a sign of rising economic populist tide in American politics.\" Third Way, a centrist Democratic think tank that has been a target of groups like the PCCC, also praised the plan while saying it opens up a whole new conversation on the Democratic side of the aisle, recognizing the problem goes beyond the amount of debt being accrued to the question of whether degrees are worth the cost. Sandy Baum, a senior fellow at the Urban Institute who was consulted by the campaign as it drafted the plan, said there was reason to be optimistic some elements could be adopted, either as part of the debate over a new Higher Education Act reauthorization now underway in Congress, or through separate legislation. Baum cited a number of factors that have led to the explosion of student debt, starting with the severity of the Great Recession and the rise of for-profit colleges. Managing student debt is not a problem if you can get a job. But too many people havent been able to get jobs; they havent been able to get good jobs. So that makes the amount that students borrow look worse, Baum said. The most important thing we can do is strengthen the economy. Clintons leading Democratic rivals have already outlined proposals to make college more affordable. Sen. Bernie Sanders of Vermont has called for free tuition at public colleges and universities, at a cost of $70 billion a year. Former Maryland Gov. Martin OMalley would provide for refinancing at lower interest rates and an income-based repayment plan, while requiring states to ramp up higher education spending and base tuition at a percentage of the states median income. Clintons solution to every pressing policy issue is to expand government and raise taxes, and this plan is no different, Republican spokeswoman Allison Moore said in a statement. For more campaigncoverage, follow@mikememoli, ALSO:, Trump sticks by his explanation of comment about Megyn Kelly, As GOP candidates debate, Clinton aides cheer Trump show, Bernie Sanders is drawing big crowds -- but how long will they stick around?, Aug. 10, 12:36 p.m.: This article has been updated with Clintons announcement. This article was originally published on Aug. 9 at 9 p.m.]", "Date": "20150810", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/politics/la-na-clinton-college-affordability-20150809-story.html", "Title": "[Hillary Clinton unveils $350-billion plan to make college more affordable]"}