{"Content": "[ Police in the tumultuous northwestern Chinese region of Xinjiang killed 11 assailants who had launched an attack along a street packed with restaurants and food vendors that left four people dead and 14 injured, Chinese state media said Saturday. The attackers, described as mobsters, lobbed explosives from at least one vehicle before slashing people in Shache County on Friday afternoon, according to the official New China News Agency. Police officers on patrol killed the attackers and later recovered detonators, knives and axes at the scene. Xinjiang has seen a wave of violence over the last six months that has left more than 175 people dead, with many killed by security forces. The government for the most part has blamed the attacks on Uighur separatist groups, which it claims are seeking to create a new homeland called East Turkestan. Uighurs, an Islamic minority, maintain that official policies restricting religious activity and local customs have increased tensions between them and the Han Chinese majority. Advocates for the ethnic group say police have used indiscriminate force against protesters, with the U.S.-based Uighur American Assn. saying police opened fire on a protest against a security crackdown on Muslims during the most recent Ramadan celebrations, killing over 20. Uighurs makes up about 45% of the population in Xinjiang, but vastly outnumber Han Chinese in Shache County, where there is strong resentment against government policies and a growing wave of Chinese migrants. Shache, known as Yarkand in Uighur, was the location of attacks in July that state media said killed 37 people and left 59 identified as assailants dead. Last month, a Xinjiang court sentenced 12 people to death for the July attacks and handed out death sentences with two-year reprieves to 15 others. The government has tightened controls in the region as violence has become more frequent. Starting Jan. 1, local authorities can prevent people from wearing clothes or logos linked to extremist groups and ban people from practicing religion in public schools, businesses or institutions, the state newspaper China Daily reported Saturday. Chinese authorities say their crackdown in Xinjiang broke up 115 terrorist groups before they could carry out further violence. More than 300 people have been arrested on suspicion of terrorism in the past six months. But death tallies have suggested that the violence in the region has continued, and may have even intensified. Strict restrictions on journalists, limiting access and information flow, have made verifying claims about terrorism incidents difficult. Silbert is a special correspondent. 10:40 a.m.: This post has been updated throughout with additional details and background. The story was first published at 3:15 a.m.]", "Date": "20141129", "Author": "NULL", "Link": "http://www.latimes.com/world/asia/la-fg-west-china-attack-20141129-story.html", "Title": "[Attack blamed on 'mobsters' leaves 15 dead in China's Xinjiang region]"}