{"Content": "[ With Republican majorities now assured in both houses of Congress, Pentagon spending is likely to grow to cope with national security threats around the globe. The White House announced Friday that it would request $5.6 billion in additional funds from Congress for airstrikes and other operations against Islamic State fighters in Iraq and Syria. The total includes $1.6 billion to develop and train Iraqi security forces, which were routed by the Sunni militants last summer. But that figure may be dwarfed if Republican hawks follow through on promises to roll back mandatory defense spending cuts imposed by a government-wide budget cut known as sequestration. Pentagon officials certainly hope so. \"We need Congress support to get done so many of the things that were trying to get done, not the least of which is taking sequestration off our backs,\" said Rear Adm. John Kirby, a Pentagon spokesman. The Republican sweep in Tuesdays election puts Sen. John McCain (R-Ariz.), a strong critic of defense cuts, on track to take over the powerful Senate Armed Services Committee. McCain already has called for stepping up the campaign against Islamic State, doing more to defeat Syrian President Bashar Assad and providing arms to Ukraine to fend off Russian forces, among other actions. That could mean federal funding will flow more freely to defense contractors in aerospace-rich places like Southern California, which suffered waves of layoffs over fears related to Pentagon spending cuts. \"National security was a big issue during the elections; it was out front,\" said Cord Sterling, vice president for legislative affairs at the Aerospace Industries Assn. a trade and lobbying organization in Arlington, Va. \"Theres likely to be an attempt to redraft budgets.\", With U.S. combat troops out of Iraq and being withdrawn from Afghanistan, the Pentagon was under pressure to lower war-related spending in the last round of budget requests for fiscal 2015. The overseas contingency operations request, which still must be voted on by Congress, now is likely to be increased, analysts say. At the time, the Pentagon requested $58.6 billion  about $20 billion less than the 2014 request. But that was before Islamic State fighters seized major cities in Iraq and publicly beheaded Western journalists, sparking a sharp uptick in public concern. Now American bombers, fighter jets and drones flying missions over Iraq and Syria will need maintenance and spare parts. Hundreds of smart bombs dropped on militant strongholds will need to be replaced. Intelligence gathering technology will be required for what the White House has warned will be a drawn-out fight. Already aerospace giants Raytheon Co. and Boeing Co. have won lucrative contracts for high-tech weapons that were used in the battle against Islamic State. \"There is a chance for big change coming out of these elections,\" said Ryan Crotty, budget analyst with the nonpartisan Center for Strategic and International Studies. \"Lawmakers seem to be speaking with a more united voice, which is good news for defense.\", Defense contractors also are playing a role in the U.S. effort to combat the Ebola outbreak in West Africa. Some 1,030 U.S. troops are building isolation wards, training healthcare workers, processing laboratory samples and providing other assistance in Liberia, the hardest-hit country, and in neighboring Senegal, where the military has set up a staging area to move supplies. Earlier this week, defense firm Northrop Grumman Corp. announced a contract worth up to $27 million with the National Institute of Allergy and Infectious Diseases to maintain a database for pathogenic viruses such as Ebola. william.hennigan@latimes.com]", "Date": "20141108", "Author": "[W.J. Hennigan]", "Link": "http://www.latimes.com/business/la-fi-defense-spending-20141108-story.html", "Title": "[Republican control of Congress could mean more military spending ]"}