{"Content": "[ As a proposal over a major trade deal reached a critical point in the Senate last week, lawmakers reported a rare occurrence: last-minute calls from President Obama. His calls ultimately helped ensure that the pact, a key item of his agenda, remained on track. The landmark trade deal being negotiated among 12 Pacific Rim nations presents Obama with the most significant test of his clout on Capitol Hill since his push half a decade ago for what would become known as Obamacare. Standing in his way are not Republicans, who have an unusual partnership with Obama on trade, but the presidents fellow Democrats, who are concerned that the proposed pact would hurt the U.S. middle class. The Republican-led Senate ultimately approved the measure granting Obama authority to negotiate the deal, but a fiercer battle awaits him in the House, where Republicans also need the votes of at least some of the minority-party Democrats to pass the bill. The presidents attempt to get Democrats to back the trade deal has required a reboot of their relationship, which Democrats have complained ranges from strained to nonexistent. The White House said the president and other top members of the administration are trying to persuade Democrats to come around. Obama and key officials have focused on two key blocs of potential support  the moderate New Democrat Coalition and the Congressional Black Caucus  in an extended courtship thats included rare White House invitations and promises to help them respond to any political fallout in their reelection campaigns next year. Party leaders on Capitol Hill, even those likely to oppose the legislation, also have helped with the pitch, facilitating trade deal briefings for lawmakers by Cabinet officials and others. The case Obama makes to Democrats privately is similar to what the White House argues publicly, focused on the substance of what the president has called the most progressive trade deal in history. The compact would set the terms for international trade among the participating nations, potentially creating markets for U.S. products, particularly in Japan. When we talk about the opportunity that exists for creating jobs and expanding economic opportunity for middle-class families by opening up more overseas markets to U.S. goods and services  thats a message that resonates with Democrats, White House Press Secretary Josh Earnest said. By the accounts of those whove been on the receiving end, Obama is having some success. Ive known the president since he was a state senator. Ive never seen him this strong, this emphatic, said Rep. Mike Quigley (D-Ill.), who attended an April gathering with about 30 Democrats at the White House. But at that 90-minute meeting in the Cabinet Room, the conversation turned to what has been another vexing issue for the party: healthcare reform. Democrats 2010 votes in support of the presidents healthcare overhaul were a main factor in driving them out of the House en masse that year, taking his party from a substantial majority in the chamber to their lowest total in nearly seven decades. The administration argued that, despite the political risks, the Pacific Rim trade pact would ultimately be a consequential achievement, as the healthcare law has proved to be. For many of us who came in just as the president came in, our first tough vote was the healthcare law, said Rep. Gerry Connolly (D-Va.). There were parallels drawn [in the meeting] about why it mattered and what it meant for history. It was a tough vote then, but its proven to be very important to our country. Obama has warmed to the debate, according to staffers who are involved in the efforts to advance the trade measures. One aide said it reminded him of the healthcare debates, back before Republicans hardened in their refusal to even consider the presidents arguments. Obamas meetings with Democrats have run long, the aide said, mainly because the president likes the conversation. Its a difficult issue but the persuadable Democrats are coming to him open-minded and torn  willing to be moved by the best arguments, one senior administration official said, requesting anonymity to talk about the closed-door sessions. He loves this sort of debate. The White House then brings in Vice President Joe Biden to follow up with Democrats who got the hard sell from Obama. Biden, largely silent on the issue publicly, acts as something of a good cop by relating to lawmakers as a former senator himself on how difficult such votes can be. As the White House pushes Democrats to line up, the trade agreement  and the odd coalition backing it in the U.S.  hangs in the balance. What Republicans wanted to see on Capitol Hill was that the president was going to make a concerted effort to bring along many of these Democrats, said Kevin Madden, a GOP strategist engaged in the lobbying effort on the deal. As theyve seen him make it a priority, I think that has actually helped with some Republicans. Obama also has something to offer Democrats that he doesnt for Republicans: a commitment to support them politically if they face primary challenges next spring over their trade votes. Recent history, though, invites skepticism about whether Democrats will be receptive to the offer. Most of them took pains to shed the Obama brand in midterm elections after the healthcare law was passed in 2010 and again in 2014 after its implementation was bungled. And as labor groups threaten political retribution, it remains to be seen whether Democrats will accept Obamas help in 2016 in exchange for their vote now. The White House is reminding lawmakers of the presidents unmatched appeal to the broad segment of Democrats that helped carry him to victory in presidential election years, when voter turnout is larger. Its no accident that one of Obamas major public speeches on trade came in a summit of Organizing for America, his former campaign operation that has morphed into a group that builds support for his policies, where he referred to critics of the trade deal who say it could harm the middle class. They dont know what theyre talking about. I take that personally, he said. Some of these folks are friends of mine. I love them to death. But in the same way that when I was arguing for healthcare reform I asked people to look at the facts  somebody comes up with a slogan like death panel, doesnt mean its true. Look at the facts. For more White House coverage, follow @cparsonsand@mikememoli, 6:04 p.m.: Updates with additional details, Originally posted at 1:45 p.m.]", "Date": "20150527", "Author": "[Michael A. Memoli, Christi Parsons]", "Link": "http://www.latimes.com/nation/la-na-obama-trade-democrats-20150527-story.html", "Title": "[Obama pursues Democrats on trade in test of his clout on Capitol Hill]"}