{"Content": "[ Venturing to the heart of Silicon Valley, Hillary Rodham Clinton gently scolded the high-tech industry Tuesday for its male-dominated culture and warned of the downside of its world-changing innovation. While automation has made lives better, created new industries and increased productivity  to the great benefit of the global economy  it has also dislocated workers and contributed mightily to the economic anxiety that grips many Americans, she said. The old jobs and careers are either gone or unrecognizable, Clinton said. The old rules just dont seem to apply, and, frankly, the new rules just arent that clear. [If] we want to find our balance again, we have to figure out how to make this new economy work for everyone, she said. Appearing as a keynote speaker at a daylong networking conference for women  following weeks of relative reclusiveness  Clinton shed no new light on her expected presidential bid. During a question-and-answer session, she passed on an invitation to launch her candidacy before the adoring audience, which cheered every coy reference to 2016. All in good time, Clinton said. Theres a lot to think about, let me tell you. That said, the Democrats remarks were a forthright appeal to a pair of vital constituencies she would need to win the White House: the high-achieving professional women thrilled at the prospect of shattering the countrys ultimate glass ceiling, and the less-skilled, low-wage workers who fear technology is rendering them obsolete. Speaking at the Santa Clara Convention Center, in hailing distance from the headquarters of several tech giants, she lamented the industrys poor track record hiring and promoting women, seizing on Apples famous slogan to urge Silicon Valley leaders to think different. The numbers are sobering, Clinton said, and she reeled off several: Just 11% of Silicon Valley executives and 20% of software developers are women. A man with a bachelors degree tends to make 60% more than his female counterpart. On the Forbes list of 100 leading tech investors, just four are women. We can literally count on one hand the number of women who have actually been able to come here and turn their dreams into billion-dollar businesses, Clinton said. Were going backward in a field that is supposed to be all about moving forward. The former first lady and secretary of State has been largely absent from public view this year, after an extensive  and extensively chronicled  book tour and series of campaign-style appearances leading up to the 2014 midterm election. She delivered a pair of paid speeches last month in Canada, but her last domestic appearance was in December, at a New York City philanthropic event. While a squadron of Republican presidential prospects has scrapped over foreign policy, vaccinations and whether President Obama loves America  the latter assumption challenged by former New York Mayor Rudolph W. Giuliani  Clinton has quietly worked behind the scenes building the framework for her expected White House run. She has been something of a Silicon Valley regular  Tuesdays appearance was her fourth high-tech-themed event in the area in the last year  and the response was rapturous. More than 5,000 people turned out for the conference, billed as the first annual Lead On Watermark Silicon Valley Conference for Women, paying $245 for a day of motivational speeches and workshops and a box lunch of grilled chicken and organic greens. After her speech, in a conversation with tech columnist Kara Swisher, Clinton offered a broad outline of the themes she would probably sound in a presidential campaign. Whoever runs, she said, must make it a priority to restore economic growth with rising wages for the vast majority of Americans, and we have to restore trust and cooperation within our political system. Asked what a supposed president could do to deliver that economic vision, Clinton called for a higher minimum wage, pay equity for women and paid family leave. She suggested finding a way to help the good guys in business by eliminating the pressure they say they face for short-term profits so they can invest for the longer-term good of the economy and their workers. Touching briefly on others issues, Clinton endorsed the concept of net neutrality  ensuring all content on the Web is treated equally by service providers  and condemned former National Security Agency contractor Edward Snowden for his voluminous leaking of classified information. Though there need to be limits on the sort of domestic surveillance revealed by Snowden, Clinton said, she could never condone what he did. The front-runner for the Democratic nomination, who receives hundreds of thousands of dollars for her appearances, has another paid speech scheduled March 19 at a conference organized by the New York and New Jersey chapter of the American Camp Assn. That suggests a formal announcement of a presidential bid will be put off for at least several more weeks. mark.barabak@latimes.com, Twitter: @markzbarabak, , , 8:12 p.m.: The story was updated throughout with new details. 3:05 p.m.: The story was updated with comments from Hillary Rodham Clinton. The story was originally posted at 12:54 p.m.]", "Date": "20150224", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/business/healthcare/la-pn-hillary-clinton-speech-silicon-valley-20150224-story.html", "Title": "[Hillary Clinton, in Silicon Valley, notes downsides of high-tech industry]"}