{"Content": "[ Sen. Ted Cruz jumped into the 2016 presidential race Monday in the same way he intends to run his campaign: upstaging rival Republicans with a splashy, impassioned speech that sought to drag the national conversation further to the right than many in his party want to go. The Texas senators chances of winning the White House are narrow, polls suggest. And his aggressive tactics and brash style during two years in the Senate  including nudging the GOP toward the 2013 government shutdown  have alienated many of the Republican leaders whose support he probably needs to become the nominee. But in addition to raising his political profile, Cruzs candidacy is certain to play a role in the GOP primaries as he becomes a spoiler and potential kingmaker, forcing establishment favorites  such as former Florida Gov. Jeb Bush and Wisconsin Gov. Scott Walker  to confront tea party preferences on immigration, same-sex marriage and social welfare programs. Cruzs zeal for small government and a muscular national defense reflects the views of many Republicans. But GOP strategists acknowledge the divisive firebrand may drive the debate too far to the right for mainstream political tastes  just as many party leaders say he has done during his short time in Congress. He could force his 2016 opponents to embrace positions in the primary that they might regret when facing the Democratic nominee. Hes going to raise important questions that other candidates are going to have to answer, especially on social issues, said Alfonso Aguilar, executive director of Latino Partnership for Conservative Principles. Are you pro-life? Pro-marriage? Ted Cruz has been very bold and he sort of puts pressure on people like Jeb and Rand [Paul] to speak about the issues. But Aguilar warned that Cruzs stances, such as his opposition to President Obamas program to defer deportation for millions of immigrants in the U.S. illegally, could alienate voters in the general election if embraced by other candidates. Cruz, the son of a Cuban immigrant, makes no apologies for his goal to shake up the mainstream. He has said repeatedly that he wants to be seen as the disruptive app of GOP politics. It is the time for truth, Cruz told an enthusiastic crowd of Liberty University students Monday. It is the time for liberty. It is the time to reclaim the Constitution of the United States. It was no accident that he chose to launch his presidential bid at the religious campus founded by the late pastor Jerry Falwell. Not far from the historic Civil War site of Appomattox, Liberty University has been a popular destination for Republicans seeking to bolster their conservative credentials. It also boasts an alumni and donor network that extends far from the campus, nestled near the scenic Blue Ridge Mountains. Cruz appeared onstage in a massive sports arena amid waving American flags and Christian rock music. He emphasized his familys personal struggles and Christian faith, calling on courageous conservatives to join him as he seeks to ignite the same grass-roots movement that propelled him to the Senate in 2012. The answer will not come from Washington, he said. It will come only from men and women across this country, the people of faith, the lovers of liberty. Student attendance was mandatory. The young audience appeared receptive to his repeated calls to imagine a president who would repeal the healthcare law, reverse Obamas recent immigration actions, shutter the Internal Revenue Service and champion a small-government, socially conservative agenda. When he finished, he was joined onstage by his wife, Heidi, and their two young daughters. Crucial to his underdog campaign will be Cruzs ability to court and energize this new generation of young evangelicals and social conservatives, not unlike what former Sen. Barack Obama did with young progressives in 2008. Tapping into millennial culture, Cruz tweeted his announcement early Monday, then asked the students in the arena to send text messages to his campaign  a strategy for building a database of potential supporters that was also reminiscent of Obamas tech-savvy presidential run. Many students obliged. Seeing the values he has, for his country, his family, hes a great candidate, said Justin Taubensee, 18, who said he was seriously considering casting his first presidential primary vote for the senator. Whether that message resonates with all Americans has yet to be seen. The Texas senator trails Bush and Walker in the most recent CNN poll. Cruz becomes the first major candidate to declare his candidacy for 2016. His strategists hope the head start will provide an edge in garnering media attention and donations. This is a chance to consolidate the conservative movement, said one senior advisor, who requested anonymity to discuss the campaign, which decided to forgo the traditional exploratory committee and jump straight into the race. Cruz expects to announce he will have more than $1 million on hand by the end of the month, and plans to raise $40 million to $50 million for the primary campaign. He headed to New York later Monday, with a return trip planned at the end of the week to New Hampshire, which holds the nations first primary. Cruz faces risks in launching a White House bid just two years after winning his first elective office. Presidential campaigns rarely leave candidates unscathed, and a poor showing could damage his brand. Previous GOP aspirants like former Texas Gov. Rick Perry in 2012 learned that high-profile stumbles on the national stage can damage careers. This is the thing all candidates risk: rejection, said David Winston, a veteran Republican pollster and strategist unaffiliated with any of the potential candidates. Cruz is perhaps best known for his fight against the Affordable Care Act, which led to the 2013 federal government shutdown and boosted him as a conservative favorite. That renegade approach excites the partys most ardent activists, but it has increasingly pained Republican Party leaders and turned Cruz into an outsider on Capitol Hill. The shutdown hurt the Republican Partys image overall but helped Cruz, at least among his core supporters. A Pew Research Center survey showed his standing soared at the time among Republicans who identified with the tea party. At the same time, public approval ratings for the GOP sank to new lows. Democrats portray Cruz as an extremist. As the de facto leader of the Republican Party in recent years, it is only fitting that Ted Cruz would position himself in front of the GOPs 2016 presidential field, said Debbie Wasserman Schultz, chairwoman of the Democratic National Committee. His reckless approach to governing would make life worse, not better, for Americans, and he isnt the type of fighter that Americas middle-class families need. As a freshman senator and tea party favorite, the Harvard-educated Cruz, 44, pulled off a stunning victory in 2012 when he toppled an establishment-backed Republican to win the party nomination for the Senate seat from Texas. Because he was born in Canada to an American mother, questions have been raised on whether Cruz is eligible for the presidency. Cruz has argued that he fulfills the requirement because his mother was a U.S. citizen. The Constitution requires the president to be a natural born citizen, but courts have never clarified what that means. Cruzs advisors envision a path to the presidential nomination that continues to draw tea party voters who backed his first campaign while peeling away libertarian support from another tea party favorite, Sen. Rand Paul (R-Ky.), and attracting evangelical conservatives from more overtly religious candidates. Such a coalition could form the foundation of what Cruzs team hopes will put him in second place during the primaries  poised to confront the establishment-backed front-runner, whether Bush or Walker. With Paul expected to announce his run soon, perhaps in early April, Cruzs advisors acknowledge that they have work to do introducing their candidate to a broader audience. But for the next few days at least, Cruz appears to have the stage he wants  to himself. lisa.mascaro@latimes.com, , 7:21 p.m.: The story was updated throughout with new details. 3:26 p.m.: The story was updated with more analysis and reaction, 9:10 a.m.: The story was updated to include quotes from Cruzs speech. The story was first published at 8:36 a.m.]", "Date": "20150323", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-cruz-announcement-20150323-story.html", "Title": "[Ted Cruz's entry into 2016 race puts pressure on Republicans]"}