{"Content": "[ A labor organization that represents nurses nationwide -- composed predominantly of women -- endorsed Vermont Sen. Bernie Sanders on Monday, the first union support hes received in his long-shot quest to capture the Democratic presidential nomination over Hillary Rodham Clinton. National Nurses United praised Sanders for his uncompromised activism in its endorsement at an Oakland gathering, ahead of his trip to Los Angeles where hes set to hold a nighttime rally at Memorial Sports Arena. We believe the next president should represent the people from all steps in life, RoseAnn DeMoro, the unions executive director, said in an interview. Hes real. Hes authentic. Thats why were supporting him. DeMoro said the 2016 Democratic primary should not be a coronation of Clinton, who in an average of several national polls holds a substantial lead over Sanders. He has a proven legislative record when it comes to progressive causes, DeMoro said of Sanders, an independent who has served in Congress since 1991. TRAIL GUIDE: After Black Lives Matter activists shut him down, Sandersheads to L.A. Sanders and Clinton are vying for support from big labor unions. Each appeared before the executive council of the AFL-CIO in Washington, D.C. last month to court support. In July, Clinton won support from the American Federation of Teachers, which was the first national union to back a candidate in the 2016 primary. Sanders has traveled the country much of the summer tapping into liberal grass-roots support. From Madison, Wis. to Seattle, staunchly liberal crowds intrigued by an alternative toClinton have arrived by the thousands to hearSandersspeak. Sanders,a self-described Democratic socialist, has put forth a populist message that would raise the federal minimum wage. He also proposed free tuition at public colleges and universities, at a cost of $70 billion.  The Los Angeles rally comes on the heels of a weekend swing through Seattle and Portland, Ore. where record crowds gathered inside sports arenas. In recent months hes amassed the largest crowds of any candidate this election cycle -- 10,000 in Madison, 12,000 in Seattle on Saturday and a record 28,000 in Portland on Sunday, according to the campaign. Still, Clinton has focused little attention on him.Her status as a front-runneris solid in the Democratic primary, where an average of several national polls show her outpacing Sanders by 36 percentage points. Instead, she has focused her message on similar issues, expressing the need to uplift the middle class and address income inequality while jabbing top-tier Republicans such as former Florida Gov.Jeb Bush and Florida Sen. Marco Rubio-- candidates she could face in the 2016 general election.  Sanders, for the most part, has not directly criticized Clinton. But he has alluded to voters being weary of establishment politics, an indirect poke at the former secretary of State, who also served in the Senate and is a former first lady.  \"All across this country, people are sick and tired of establishment politics, establishment economics, and they want real change, Sanders said in Seattle. The people ofAmerica understand that corporate greed is destroying our country.\", Lynn Vavreck, a professor of political science at UCLA, noted that its early in the election cycle. Just because people are interested, it does not mean people will give money and actually cast a ballot in support, Vavreck said. People showing up for these rallies have a strong interest in politics. Theyre not average voters, who are barely tuned into the election at this point.  For Curtis Chin, the Vermont senator is appealing to progressives because he represents fundamental change. Chin lives in Los Angeles and is a member of Asian Americans for Bernie Sanders, an informal grass-roots group that is separate from the campaign. \"Hes really trying to change the system,\" Chin said. \"We need a government that works for the people, and I really think hell do it.\", Follow @kurtisalee for political news, , 12:12 p.m. This article was updated with information about an endorsement Sanders received. This article was originally published at 3 a.m.]", "Date": "20150810", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/politics/la-na-bernie-sanders-los-angeles-20150810-story.html", "Title": "[Ahead of L.A. visit, Sanders captures support of National Nurses United]"}