{"Content": "[ The mother arrived at the hospital last week in need of an emergency caesarean section, saying she had crossed the border to run an errand in town, not so her baby would be born an American citizen. She assured the doctor that she arrived at the hospital just \"because [she] was here.\", Dr. Rolando Guerrero listened skeptically. \"They always have a story,\" he said after delivering her 8-pound boy, Dylan. Doctors here at Starr County Memorial Hospital deliver about 30 babies a month, including those of mothers in the country illegally, hospital officials said. In this county in the heart of the impoverished Rio Grande Valley, so-called anchor babies have been delivered for decades, some to women who have already settled in Texas, others to those who crossed the river expressly to give birth on U.S. soil. \"About six months ago I got one who was literally still wet from the river,\" Guerrero said. Sometimes pregnant Mexican women arrive at the nearby border bridge. \"Theyll find a Border Patrol agent on the banks and say, I need help, because they know theyre going to get the care,\" said Dr. Javier \"Jake\" Margo Jr. president of the local medical society. \"Its a strain on the physicians and the smaller hospitals.\", The phenomenon has become a focus of the Republican presidential battle, with both Jeb Bush and Donald Trump questioning the motives of immigrant mothers who give birth after traveling to the U.S. And some residents complain that the children are a drain on taxpayer-supported social services. But the issue is often not so black-and-white here. Many families have relatives scattered on both sides of the border, and people often live and work across the mostly unmarked line as if it werent there. \"Theyre part of our community,\" Guerrero said of the expectant mothers he sees. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, Starr County Memorial is a modest red-and-gray brick building with 44 beds, a family clinic and an emergency room, taxpayer-funded through a hospital district. Just how many Mexican mothers come to give birth to the babies and the cost of caring for them are unclear. \"They do come on purpose,\" said Thalia Munoz, chief executive of Starr County Memorial. \"We have to absorb the costs. Its a persistent problem. Its a fact: They come over here for the anchor baby, they come over for the benefits.\", The doctors dont ask whether patients are in the country legally, though they do ask expectant mothers to provide a local address, in part because they are required by state law to test newborns for genetic diseases and follow up. \"Most of them do have an address. Whether its a real address or not, who knows,\" Guerrero said. Expectant mothers who live in Texas  whether they are legal residents or not  qualify for a state program providing prenatal care. If the mothers cant pay for deliveries, Medicaid pays doctors and the hospital a portion of the cost. Mothers lacking documentation do not qualify for Medicaid afterward, but their babies usually do, doctors say. Medicaid payments to doctors here have declined by half in the last decade, they say  to about $550 for a vaginal delivery; $600 for a caesarean section. Medicaid compensated the hospital about 40 cents on the dollar, Chief Financial Officer Rafael Olivares said. As a result, the hospital picks up more of the cost of the care of people in the country illegally. Rio Grande Valley hospitals reported more than $131 million in uncollected medical bills as of 2013, the most recent year available, according to the Texas Hospital Assn. They dont tally how much of that is for people in the country illegally. Margo pointed to a map on their office computer showing the Rio Grande River, which lies just across the nearby highway. When Mexican drug cartel and gang violence escalated across the border about a decade ago, he could hear automatic gunfire from his home. Pregnant women would arrive at the bridge at night, complaining that they couldnt find a doctor willing to see them after hours because of the violence. \"Those werent technically anchor babies  they tried to deliver over there,\" Margo said. The doctors said they saw fewer women coming to have babies after Texas officials ordered a surge of law enforcement and National Guard troops to the border last summer in response to an influx of Central American immigrants. Instead of gunfire at night, Margo heard U.S. Customs and Border Protection and Department of Public Safety helicopters. But since then, \"slowly, its been going back up,\" Guerrero said. Many of the women that he and other doctors see are poor, but others are not, and some of them have crossed the border legally. Professionals from Mexico  doctors, dentists and graduate students  will schedule caesarean sections at a U.S. hospital, paying for the services, sometimes in cash, the doctors said. Guerrero recalled a Mexican dentist who crossed the border so her delivery would be paid by Medicaid, which she qualified for because she was born in the U.S. \"She should have paid for it. You work for a living, you have the money. I guess it goes to character,\" he said. The political battle over the babies has grown more intense. In May, a group of immigrant parents illegally in the Rio Grande Valley filed a federal lawsuit against Texas officials who they allege refused birth certificates to their U.S.-born children. The suit is pending. At Starr County Memorial, most of the mothers the doctors see do not cross intentionally to give birth, they said  they were already living on the U.S. side of the border with families of mixed status. \"I have families where Ive delivered three or four\" U.S.-born babies, Guerrero said. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, For Mexican Americans living in the region, many with relatives on both sides of the border, the phenomenon creates mixed emotions  sympathy but also resentment of people they believe are taking advantage of the system. Guerrero grew up working at a tortilleria and produce-packing shed. He has worked at the hospital for 15 years. His colleague Margo has worked here 11 years. Both say they have stayed because they are dedicated to the community. Both are fourth-generation sons of Tejano families who lived here back when it was Mexico. They didnt cross the border  it crossed them. They attended school with U.S.-born children whose parents lived in Mexico and asked only for one benefit from the U.S. government: their childrens education. \"Thats how it used to be. They were over there and they werent taking advantage,\" Guerrero said. But over the decades, government benefits have grown for American-born children, including Medicaid, the Women, Infants and Children program, and food stamps. After Guerrero delivered Dylan, his mother received formula at the hospital supplied by WIC. Both doctors say they would like to see the border better secured, although Guerrero noted that deporting families already living on the Texas side of the border would probably lead to \"upheavals\" and \"ill will.\", Nothing about the border is as simple as it seems. When Guerrero went to check on Dylans mother  who asked to be identified by only her first name, Crystal  she repeated the story of how she ended up accidentally giving birth in the U.S. She had dropped off her children with her husband, who works legally in Texas. Crystal, 32, had intended to drive east on the U.S. side of the border  as many do to avoid dangerous Mexican highways frequented by smugglers  before crossing to see a doctor in Reynosa. She had her medical paperwork with her. The birth of her baby in the U.S. was unintentional, she said. The doctor  originally skeptical  believed her. Securing the border, Guerrero said, is \"bigger than the anchor babies. The problem is more complex.\", Twitter: @mollyhf, ALSO, She did it again: Kentucky clerk refuses marriage license to gay couple, Obama in Alaska: Climate-change deniers are on their own shrinking island, Philadelphia plans intense security for Pope Francis visit -- some say too intense]", "Date": "20150903", "Author": "[Molly Hennessy-Fiske]", "Link": "http://www.latimes.com/nation/immigration/la-na-texas-anchor-babies-20150903-story.html", "Title": "[Along the border, who's an 'anchor baby' is a guessing game]"}