{"Content": "[ U.S. employers hired at a stellar pace last month, wages rose by the most in six years, and Americans responded by streaming into the job market to find work. The Labor Department said Friday that the economy gained a seasonally adjusted 257,000 jobs in January, and added far more in previous months than originally estimated. Businesses added 414,000 jobs in November, the government now says, the most in 17 years. Total job gains in December were also revised higher, to 329,000, up from 252,000. Average hourly wages, meanwhile, jumped 12 cents to $24.75, the biggest gain since September 2008. In the past year, hourly pay has increased 2.2 percent. The unemployment rate rose to 5.7 percent from 5.6 percent. But thats not necessarily a bad thing. More Americans began looking for jobs, though not all found work. Their job hunting suggests they are more confident about their prospects. That is ahead of inflation, which rose just 0.7 percent in 2014. The sharp drop in gas prices in the past year has held down inflation and boosted Americans spending power. Still, wages typically increase at a 3.5 percent pace in a fully healthy economy. Strong hiring pushes up wages as employers compete for fewer workers. Job gains have now averaged 336,000 a month for the past three months, the best three-month pace in 17 years. Just a year ago, the three-month average was only 197,000. The Federal Reserve is closely monitoring wages and other job market data as it considers when to begin raising the short-term interest rate it controls from a record low near zero. The Fed has kept rates at record lows for more than six years to help stimulate growth. Most economists think the central bank will start boosting rates as early as June. Steady economic growth has encouraged companies to keep hiring. The economy expanded at a 4.8 percent annual rate during spring and summer, the fastest six-month pace in a decade, before slowing to a still-decent 2.6 percent pace in the final three months of 2014. There are now 3.2 million more Americans earning paychecks than there were 12 months ago. That lifts consumer spending, which drives about 70 percent of economic growth. More hiring, along with sharply lower gasoline prices, has boosted Americans confidence and spending power. Consumer confidence jumped in January to its highest level in a decade, according to a survey by the University of Michigan. And Americans increased their spending during the final three months of last year at the fastest pace in nearly nine years. ]", "Date": "20150206", "Author": "NULL", "Link": "http://www.latimes.com/business/la-fi-jobs-report-january-20150206-story.html", "Title": "[U.S. economy adds a robust 257,000 jobs in January]"}