{"Content": "[ The Los Angeles Unified Board of Education voted unanimously Tuesday to back a tentative labor agreement that would give teachers a 10% raise over two years  their first pay increase in eight years. The agreement would fund smaller classes and more counselors and soothe several months of labor tensions  including talk of a strike in the nations second-largest school system. \"This is a family in LAUSD. Sometimes, as a family does, they fight,\" said board President Richard Vladovic as he stood with board colleagues and union leaders to announce the vote. \"But we have come together as one.\", Alex Caputo-Pearl, president of United Teachers Los Angeles, hailed the agreement as a victory for students, educators and the community. \"This is a fair agreement that brings us closer to the schools that L.A. students deserve,\" he said. The tentative three-year deal would cost $875.3 million for all employees, about $285.6 million more than the districts original offer, according to a memo from Supt. Ramon C. Cortines to board members. Included in the increased amount is an additional $31.6 million for other employee groups, such as administrators, whose contracts entitle them to more money if other bargaining units negotiate better deals than their own. The memo estimated that the agreement, along with a multibillion-dollar plan for districtwide health benefits the board approved last week, would create a deficit of $559 million by 2016-17. Board members said they were relying, in part, on more state education dollars to bridge that projected gap. The states recovering economy and surging tax revenues are likely to bring \"several billions more\" than projected to California schools, a state legislative analyst told a district budget committee this month. L.A. Unified generally receives about 11% of all state school dollars, Vladovic said. \"We absolutely can pay for this,\" said board member Steve Zimmer, adding that district savings and near-certain increased state revenues would cover at least the first two years of raises. But board member Monica Ratliff said program cuts and layoffs would need to be considered if state funding falls short. The agreement comes after months of escalating union actions under the leadership of Caputo-Pearl. The union staged rallies, faculty meeting boycotts and even set aside millions for a strike fund  to push the district to improve its original offer of a 2% increase for 2014-15 and a onetime payment of 2% for the previous year. The union had initially asked for a 17.6% raise over an unspecified time period. Caputo-Pearl said the union actions \"changed the dynamics\" of the bargaining process by energizing his members and strengthening their position. Other highlights of the tentative agreement:,  $13 million to reduce class sizes in eighth and ninth grades.  $13 million for new counselors to reach a ratio of 500-1 next school year.  A Health Services Task Force to seek ways to increase nurses, counselors and social workers.  A revised teacher evaluation system to be jointly developed by the district and union.  Caps on class sizes. The board vote sends the agreement to the unions 35,000 members for action; if they ratify it, the board will move to approve it. teresa.watanabe@latimes.com]", "Date": "20150421", "Author": "[Teresa Watanabe]", "Link": "http://www.latimes.com/local/education/la-me-lausd-settlement-20150422-story.html", "Title": "[L.A. school board backs tentative teachers pact with 10% raise]"}