{"Content": "[ President Obama and Senate Republican leader Mitch McConnell talked of cooperation Wednesday in the aftermath of the huge GOP election victory, but the two sides prepared for renewed conflict on issues that have dominated the campaign and national debate for the last two years. On immigration, healthcare and global warming, the initial public statements from the two sides, while polite, indicated little flexibility and presaged intense new battles that could begin within weeks. JOIN OUR LIVE DISCUSSION AT NOON PACIFIC TIME, Obama reiterated his promise of executive action this year to protect potentially millions of unauthorized immigrants from deportation; McConnell likened the move, for Republicans, to \"waving a red flag in front of a bull.\", McConnell pledged to undo major parts of Obamas healthcare reform law; the president promised to veto those efforts. And the two sides prepared for confrontation on the proposed Keystone XL pipeline from Canada. That could lead Obama to face an early decision on whether to use his veto or acquiesce and anger a major Democratic constituency  in this case, environmental activists. Speaking to reporters in the East Room of the White House, Obama gave minimal concession to the widespread Republican gains in Tuesdays election, which included winning majority control of the Senate for the first time since 2006. \"Obviously Republicans had a good night,\" he said. Otherwise, he repeatedly deflected suggestions that he bore any personal responsibility for his partys defeat, or that voters had passed a negative judgment on his policies. Obamas words contrasted with his response to the Democrats midterm defeat four years ago. At the time, he described that loss as a \"shellacking.\", The 2010 losses led to a new White House emphasis on deficit reduction and a long, ultimately fruitless effort to reach a \"grand bargain\" with Republicans on taxes and spending. This time, the president gave no sign that he planned any significant change in his priorities or approach during his final two years in office. Both sides sought to convey an air of cordiality, playing down the partisan contentiousness that voters have repeatedly told pollsters they deplore. McConnell, at his own news conference in Louisville, Ky. held shortly before Obamas, repeatedly ruled out two tactics that have proved especially unpopular, saying that Republicans will not engage in brinkmanship over the federal debt ceiling, as they did in 2011, or force another government shutdown, as they did in 2013. Both leaders said they thought they could agree on expanding global trade and cutting corporate taxes, two issues that have been priorities for business groups. Trade policy has pitted the White House against many Democratic members of Congress and interest groups, making it one of the rare areas where the switch to GOP control could help the Obama agenda. But those are comparatively small-bore topics, a fact Obama tacitly conceded, describing them as areas where talks, if successful, might open the way to broader deals. Meantime, the two sides quickly squared off over the same issues they have argued about for years, starting with immigration. \"Its time for us to take care of business,\" Obama said, referring to his vow to issue executive orders if Congress doesnt act. \"I cant wait another two years.\", McConnell warned against unilateral action that \"poisons the well\" for cooperation with Republicans. \"I hope he wont do that,\" he said. Administration officials are preparing a broad package of changes to immigration policy aimed for late November or early December, according to two senior administration officials who spoke on the condition of anonymity to discuss internal deliberations. They are likely to create a program that would allow people in the country illegally to come forward, pay a fee and submit to a background check to apply for a work permit and a temporary reprieve from deportation. It would be similar to the Deferred Action for Childhood Arrivals program created in 2012. As many as 5 million people could be eligible for the new program, although the scope of the new deferred action program is still being decided, the officials said. Some officials are pushing to include all parents of children who are U.S. citizens, as well as parents of DACA recipients who have been in the country for several years. Obamas order will also probably narrow the rules given to immigration officials about who should be held for immigration violations and expand the definition of who is eligible for employment visas, the officials said. After initially saying he would act on immigration by the end of the summer, Obama announced in September that he would wait until after this weeks election. At the time, White House officials said they were holding off in deference to Democratic Senate candidates who feared executive action on immigration could imperil their campaigns. In the end, nearly all those embattled Democrats lost their seats anyway, and Obama absorbed the wrath of Latino activists who have denounced him for deporting too many people. McConnell also said the Republican Senate would move to undo at least parts of the 2010 healthcare law, although he also sought to quiet expectations of conservatives that the GOP could achieve total repeal. \"The veto pen is a pretty big thing,\" he said. Republicans will, at minimum, try to repeal the laws new tax on certain medical devices, he said, and will try to strike down the requirement that individuals buy health insurance or pay a fine, which \"people hate.\", Obama said he would veto any effort to repeal the insurance requirement, calling it \"a line I cant cross\" because it would \"undermine the structure of the law.\", But he pointedly did not repeat that statement about the device tax, which several Democratic senators also want to eliminate. As if those two fights arent enough, the two parties also seemed headed for a clash over global warming. Several Republican officials said they would push shortly after the new Congress convenes in January for legislation to end the administrations long-running deliberations over the Keystone pipeline, which is designed to carry oil from the tar sands under Canadas prairies to refineries along the Gulf Coast. Enough Democratic senators support the proposed pipeline that a bill to order it approved would stand a good chance of garnering the 60 votes needed to avoid a filibuster. Obama sidestepped a question on whether he would veto it. But McConnell made it clear that Keystone was only part of a broader agenda. During his campaign in Kentucky, a state that has a long tradition of coal mining, he repeatedly denounced the administrations policies on global warming, which Republicans have labeled a \"war on coal.\", In a not-very-veiled reference to the Environmental Protection Agency, he said Republicans would seek to use budget bills to cut back on \"the bureaucratic strangulation of our economy\" through regulation. \"Look for us to go after those kinds of things through the spending process,\" he said. christi.parsons@latimes.com, david.lauter@latimes.com, Twitter: @cparsons, @DavidLauter, Times staff writer Brian Bennett contributed to this report.]", "Date": "20141105", "Author": "[Christi Parsons, David Lauter]", "Link": "http://www.latimes.com/nation/politics/la-na-washington-whats-next-20141106-story.html", "Title": "[Obama, McConnell speak of cooperation, but conflict is apparent]"}