{"Content": "[ Congressional action to raise the minimum wage may have stalled, but a grass-roots campaign to lift basic pay is picking up steam at city halls and state legislatures  and probably heading to ballot boxes in the Bay Area. Cities nationwide, including San Diego and Seattle, are considering passing ordinances or facing ballot measures that would raise the minimum wage to $10 to $15 an hour, well above the federal rate of $7.25. The efforts mark an important strategic shift in the campaign to raise the minimum wage. Though efforts in Congress to boost the federal minimum wage to $10.10 havent died, they have faced fierce lobbying by opponents. So labor leaders and community advocates are instead turning their attention to cities and states that have the power to raise wages on a local level. \"Urban areas tend to be more sympathetic\" to raising the minimum wage, said Ken Jacobs, director of the Institute for Research on Labor and Employment at UC Berkeley. \"What we have seen are cities and counties work as laboratories of democracy.\", On Friday, labor and progressive groups said they turned in enough signatures in Oakland to put an initiative on the November ballot to raise that citys minimum wage to $12.25 an hour. Organizers plan to do the same in nearby Berkeley and Richmond as they push the latest twist in their strategy of going local. Richmond had been on the verge of approving a hike this year to $12.30 an hour, but the local chamber of commerce slowed the process, arguing that the ordinance would kill jobs and force businesses to move. Such a boost in the minimum wage could raise living standards in the industrial city of 100,000, where nearly 1 in 5 of the predominantly minority residents live in poverty. Richmonds proposed ordinance now includes several exemptions  for waiters and other tipped workers, those under 18 and nonprofit employees. The last-minute changes have irked labor and community activists, sparking their decision to take the fight to the voters. They plan to seek signatures for a ballot measure this fall that would raise the minimum wage to $12.25 an hour by next spring, index the rate to rise with inflation and require employers to provide paid sick leave. Labor groups also plan a similar ballot initiative in Berkeley, even though its city council last week approved a minimum wage of $12.53 that would be phased in over two years. The rate, though, is below $15 an hour that activists were pursuing. \"In conversations with our community groups, we learned they werent happy with those watered-down versions,\" said Gary Jimenez, East Bay regional vice president for the Service Employees International Union, Local 1021. \"They took a look at our measure in Oakland and liked that.\", Just across the Bay, San Francisco is considering raising its $10.74 minimum wage to $15 an hour. Other California cities, including Davis and San Diego, are not far behind. Outside of the Golden State, Seattle and Las Cruces, N.M. also are poised to adopt higher basic pay levels. Connecticut in March voted to approve a $10.10 minimum wage, the same amount President Obama is seeking for the federal rate. Minnesota this month approved a $7.75 minimum wage, up 50 cents from the prior rate. The proposals at municipal levels allow for some customization, advocates said. A one-size-fits-all minimum wage  whether at the state or federal level  often falls short in cities with high costs of living, such as San Francisco. Organizers also are using ballot initiatives and targeting key cities, such as the Bay Areas three biggest Alameda County cities, to build momentum for raising base wages in broader metropolitan areas. \"It makes better policy,\" Jimenez said. \"At this point, it looks like our elected officials dont have the wherewithal to put that forward.... Were pretty confident the voters are going to do the right thing.\", In the minimum wage battle, proponents for a higher rate say a hike will help boost consumer spending, which is the biggest driver of the economy. Opponents say wage hikes would cause job losses as business owners look for ways to automate entry-level jobs. Nationally, polling by Gallup found that business support for a higher minimum wage was split. Americans overwhelmingly supported a higher rate, with 76% saying in November that they approved a minimum wage of $9 an hour. In Richmond, business owners initially seemed to support the idea of raising the minimum wage, but later reversed course. Richmond Councilman Tom Butt helped draft some of the changes to help soften the blow to businesses. \"While [the changes] may be attacked as weakening the protection of low-wage workers, significant job loss is the worst thing for low-wage workers,\" Butt wrote for the Richmond Standard, a local news site funded by Chevron Richmond, the refinery in the city. The California Restaurant Assn. one of the trade groups that oppose minimum wage hikes, cites a study that found that a hike in minimum wages would harm the local economy. The research came from the conservative Employment Policies Institute, a group led by a public relations executive with ties to the restaurant industry. \"Local efforts are amplifying,\" said Angie Pappas, a spokeswoman for the restaurant trade group. \"Richmond is not really considering the effect on businesses and jobs.\", Lifelong resident Lenora Brown, 58, said an increase would help her and others tremendously. \"Its way overdue,\" said Brown, who earns $8 an hour in a part-time job at a nonprofit organization. With higher pay, she said, she could finally begin to save enough money to buy a car instead of relying on public transportation to get to her job. Thats a far cry from the steady work she had in customer service at Washington Mutual Bank. She lost her job after JPMorgan Chase & Co. acquired WaMu in 2008. Richmond Mayor Gayle McLaughlin, who was elected with the help of the Richmond Progressive Alliance, which supports a minimum wage increase, has spearheaded the minimum-wage effort. Three other Richmond council members won their seats with the groups backing. \"Richmond is saying loud and clear that we have suffered from years of social and economic injustice,\" said McLaughlin, who is running for a council seat after her mayoral term expires. \"Its not right.\", Mike Parker, editor for the alliances newsletter, hopes to succeed McLaughlin as mayor and holds similar views. \"Were proud that were leading the process, but we recognize that we live in a regional economy,\" he said. \"We want to see all the wages in the Bay Area move up to a living wage level.\", ricardo.lopez@latimes.com, Twitter: @rljourno]", "Date": "20140527", "Author": "[Ricardo Lopez]", "Link": "http://www.latimes.com/business/la-fi-richmond-minimum-wage-20140527-story.html", "Title": "[Focus of campaign to boost the minimum wage shifts to the local level]"}