{"Content": "[ If you were plotting the epicenter of a daring trend or gathering the vanguard for a revolutionary charge, San Benito County might not be the first place youd start. One of the states smallest counties, its a retro snapshot of turn-of-the-century rural California: agrarian, stoic, striving. But after a stunning election victory, residents of this farming region find themselves on the sharp edge of a growing movement to ban hydraulic fracturing via local voter initiatives. Fracking opponents here were vastly outspent by oil companies that fought a measure to ban well stimulation techniques such as fracking, acidizing and steam injection, along with conventional drilling in some areas. With just $130,000, the homegrown campaign managed to draw 57% of San Benito County voters to the polls in a low-excitement midterm election. They held off oil companies that spent nearly $2 million opposing the initiative. \"This little, tiny county managed to give big oil a black eye,\" said Kate Woods, a local landowner who supported the ban, which takes effect Jan. 1. \"This is going to be something that spreads.\", Some would argue it already is spreading. Mendocino County approved a fracking ban earlier this month. And in Santa Barbara, opponents of a ban poured $6 million into a successful effort that turned back a similar initiative. The bare-knuckle campaign in San Benito County opened divisions here, pitting neighbors and friends against one another. Election shenanigans reportedly ranged from midnight runs to tear down opponents signs to alleged voter intimidation and physical altercations. Supporters of the ban said energy industrialization would indelibly alter the regions bucolic way of life and imperil water sources. Opponents argued that fracking wasnt even occurring in the county, and they worried that outlawing other extraction techniques would forever restrict economic growth in the financially depressed county. Despite pending state fracking regulations that California officials say are the nations toughest, analysts expect other municipalities to fashion their own rules under the framework of zoning. Santa Cruz County already has a ban, as does Beverly Hills. The L.A. City Council approved a moratorium on fracking but has yet to draft an ordinance. A measure banning fracking in the city of La Habra Heights has qualified for the March 2015 ballot, and Butte County will take up the question in the 2016 elections. The strategy of outlawing fracking by enacting local ordinances has been working its way west from New York, where 200 local governments in the midst of a shale oil and gas boom have instituted bans. This month, Denton, Texas  the birthplace of hydraulic fracturing  imposed a ban on the practice inside city limits, as did Athens, Ohio. Supporters of the ban in San Benito and elsewhere cast it as an issue of self-determination. \"Im concerned about quality-of-life issues,\" said Robert Rivas, a county supervisor. \"We need to be in control of our growth, not the oil and gas industry.\", Some energy companies, though, consider the spate of ordinances an annoying fad. Craig Moyer, a lawyer with Manatt, Phelps & Phillips and counsel for the California Independent Petroleum Assn. said the initiatives are unnecessary because of comprehensive fracking regulations that lawmakers approved earlier this year, which are expected to be fully implemented in 2015. \"The state has addressed it,\" Moyer said. \"Im kind of amazed that it has gotten to be as much of an issue as it has. Im hopeful that it will fade away and people will move on.\", Judging by the passions still roiling here, there seems little chance of that. ::, San Benito County is on the edge of alluring places  the lush Monterey Peninsula is 40 miles to the west, and the wealth centers of San Francisco Bay and Silicon Valley are little more than an hours drive north. But the rural way of life perseveres here. More than 80% of land in the county is devoted to farming or ranching, numbers that have held steady even as subdivisions spill across the town of Hollister and big-box stores crowd out local shops. The county, home to 56,000 residents, sees its future in agritourism driven by destination wineries, organic farms and quaint inns overlooking pasturing cattle. Bustling oil and gas operations dont fit in the picture. In the 1950s, hundreds of pump jacks and drilling rigs dotted this rolling landscape that sits astride the Monterey Shale formation. Today, fewer than 50 are operating, and only two companies are actively seeking to explore. The Farm Bureau recently commissioned an analysis of the economic benefits to the county from the energy industry. At the moment, San Benito Countys annual tax revenue from oil operations totals $1,162. Those revenues could have skyrocketed if energy companies resurrected old wells by employing modern well stimulation methods: fracking, injecting a slurry of water and chemicals into subterranean formations to free oil and gas; acidizing, shooting a mix of highly caustic chemicals down a well bore to dissolve rock or other debris; and cyclic steam injection, pumping superheated steam into underground seams to loosen and liquefy viscous crude oil. Concerns about Citadel Explorations \"Project Indian\" steam injection well near Pinnacles National Park prompted the San Benito ballot measure. The exploratory well went in on a working ranch where the mineral rights were held by Occidental Petroleum. Newport Beach-based Citadel leased the site from Occidental, and the county approved the work. The Center for Biological Diversity sued, alleging there was insufficient environmental review and bringing work at the site to a halt. Armin Nahabedian, Citadels CEO and a fourth-generation oil driller, lashed out against the ban, known as Measure J, and at \"outsiders,\" who he said were agitating county residents. \"In a fair world, these people would be dragged out into the courtyard and dealt with accordingly,\" Nahabedian told the Santa Cruz Sentinel newspaper. \"These people are stirring up a lot of bad publicity, and theyre causing some decisions to be made by using tactics of fear-mongering.\", The countys Farm Bureau and Cattlemens Assn. called the ban unnecessary, extreme and \"hatched by activists and lawyers from outside San Benito to serve their own political agendas.\", In what became a superheated campaign, ban supporters were called \"jihadists\" and environmental extremists. One Hollister man detected a more nefarious agenda behind the ban, concluding in a letter to the local newspaper that a vote for the measure was a vote for terrorism. \"If Measure J passes, jobs will be lost, people will suffer, and revenue to the county and to the state will be reduced. Further, ISIS will revel in the knowledge that they have achieved a foothold in their quest for additional funds to do their dirty work,\" wrote Philip Schipsi. Nahabedian of Citadel Exploration declined an interview request but in an email statement said he considered the ordinance an illegal \"taking\" that prevents him from using his property. Three days after the election, Nahabedian sent a letter to county supervisors demanding $1.2 billion in restitution for loss of future income he could have derived from the land. Supporters of the ban rejected the notion that their campaign was led by interlopers from outside San Benito County. The real outsiders, they said, were the oil companies fighting the ban. The campaign was successful, locals said, because it was spearheaded by teachers, farmers and ranchers with roots in the community. Third-generation cattle rancher Joe Morris is a longtime member of the Farm Bureau, the Cattlemens Assn. and the Chamber of Commerce. He split with all those groups in his support of Measure J. \"They were pounding away with lie after lie after lie about the initiative itself. That seemed unconscionable,\" Morris said. Paul Hain, an organic farmer and a Republican, said he has been in the Farm Bureau for years, but he didnt agree with its support for drilling. \"I told the board, You guys are a bunch of stooges for big oil. Im not real popular right now. They hitched their horse to the wrong wagon here.\", Catherine Engberg, a San Francisco lawyer who had a hand in crafting Measure J, said she will be surprised if it isnt challenged in court. But she doesnt think those lawsuits will be successful. If this is the template for how future anti-fracking campaigns play out across California, local officials here warn that other counties should prepare for battle. \"We are not going to be pushed around by oil companies,\" said County Supervisor Anthony Botelho, a Republican. \"The fights just begun.\", julie.cart@latimes.com, @julie_cart]", "Date": "20141129", "Author": "[Julie Cart]", "Link": "http://www.latimes.com/local/california/la-me-san-benito-fracking-20141129-story.html", "Title": "[Election win puts rural San Benito County on anti-fracking map]"}