{"Content": "[ After investing millions of dollars in data, analytics and their ground game in an attempt to avoid the bruising losses of the 2012 election cycle, Republicans faced a key test Tuesday: Could they match the Democrats vaunted turnout operation?, The answer Wednesday was mixed. The GOP made significant gains in getting its voters to turn in ballots early and got its most loyal voters to the polls in force on election day, trouncing Democrats in Senate contests across the country. But they shouldnt be popping the champagne for 2016s contests just yet. In an electorate that overwhelmingly favored Republicans, Democrats said they managed to boost the number of ballots cast over 2010 in key states like New Hampshire, North Carolina and Colorado. And there is little evidence that the GOP made major inroads among women, minorities and young voters, who will be key to winning the White House in 2016. The turnout picture in Tuesdays election was complex. Ballots were still being counted Wednesday and the final numbers will not be certified for some time, but the preliminary figures showed an uneven picture across the country. There was a huge variance among the states based on whether they had hotly contested statewide races. \"Were probably going to have the lowest-turnout election [nationally] since 1942. Its that bad. And that was in the midst of World War II when people couldnt vote because they were off at war,\" said Michael McDonald, a political science professor at the University of Florida who specializes in voter turnout. But in the competitive races, \"we actually had fairly robust turnout,\" he said. \"If we look at where the campaigns were spending money and trying to encourage their supporters to vote, we do see higher turnout in those states  and we also see that the Republicans have stepped up their ground game and it does seem to be having an effect.\", Early numbers, McDonald said, indicate that turnout was up over 2010 in some parts of the fiercely fought battlegrounds of Colorado, Alaska, Iowa and North Carolina, pointing to a strong effort by both parties. In Iowa, Republican Joni Ernst vanquished Democrat Bruce Braley, winning an open Senate seat by 8.5 percentage points. But in Johnson County, the states most Democratic county, Braley appears to have done as well as Obama did in 2012, McDonald noted. But Ernst ended up performing particularly well in many swing counties, helping tilt the state in her favor after two presidential cycles in which Obama won the Hawkeye State. In Georgia and Louisiana, Democratic Senate candidates Michelle Nunn and Mary L. Landrieu actually performed better than Obama in some of the redder, and more rural, counties. But Democrats did not get large enough independents and presidential-year voters (those who generally do not vote in midterm elections) to counteract GOP enthusiasm. \"The data shows us that in the most Republican areas, the Democratic candidates in Louisiana, Georgia and Kentucky were outperforming Obama,\" McDonald said. \"And it tells us something about why those campaigns were hesitant to bring Obama in.\", The outlier in the more robust turnout picture, McDonald said, was Virginia, where the Senate race between Democratic incumbent Mark R. Warner and Republican challenger Ed Gillespie was surprisingly close. There, in the absence of a nationally driven effort by either side, many Democrats stayed home. The more troubling picture for Republicans as they look ahead to the presidential race in 2016 is this: Although they won in what some are calling a red tsunami, the long-standing rules about midterm elections held true. They won largely because the voters who turn out tend to be more white and more conservative than those who turn out in presidential years. A Wednesday analysis of exit poll data by the Pew Research Center found that men and older Americans were central to the GOP gains, and that there was little evidence that the party made progress closing its deficits among women or young voters. Exit polls showed that men cast their ballots for Republicans by a 16-percentage-point margin and women favored Democrats by a 4-percentage-point margin, similar to margins in the 2010 midterm election. Republicans also held a 16-percentage-point lead over their Democratic opponents among voters who were 65 and older, who made up 22% of the 2014 electorate compared with just 16% in 2012. By contrast, voters younger than 30  who favor Democrats  handed in 13% of the ballots cast, compared with 12% in 2010. In 2012, they made up nearly 19% of the electorate. Turnout was abysmally low across the board in states such as California and Texas. Texas, historically a low turnout state, stayed true to form Tuesday as Democratic efforts to hasten the states shift from red to blue came up well short. Even with celebrity Democrat Wendy Davis topping the ticket and close to $40 million in her campaign bank account, fewer than 30% of eligible Texans cast ballots in the marquee race. maeve.reston@latimes.com]", "Date": "20141105", "Author": "[Maeve Reston]", "Link": "http://www.latimes.com/nation/politics/la-na-election-turnout-20141106-story.html", "Title": "[A look at voter turnout suggests 2016 won't be easy for Republicans]"}