{"Content": "[ Congress ended the crisis over funding for the Homeland Security Department on Tuesday after House Speaker John A. Boehner abandoned the GOPs strategy of trying to tack on restrictions to President Obamas immigration plan. House conservatives were outraged that the speaker declined to continue their fight against the presidents actions on immigration, which many Republicans view as an overreach of executive authority. They staged a series of procedural votes to prevent final approval. But the bill secured passage, allowing the Republican leadership to move away from a prolonged standoff that threatened the partys image as Homeland Security funds were set to expire at the end of the week. Obama is expected to swiftly sign the bill, which funds the departments vast domestic security and anti-terrorism apparatus through Sept. 30, the end of the fiscal year. The vote was 257 to 167. Boehner was forced to leave his conservative flank behind and reach across the aisle for support from Democrats led by House Minority Leader Nancy Pelosi of San Francisco, something he has been repeatedly forced to do, though reluctantly, on major legislation. I am as outraged and frustrated as you at the lawless and unconstitutional actions of this president, Boehner told his majority as he announced his decision at a private meeting early Tuesday, according to a person in the room not authorized to discuss the session on the record. But facing a midnight Friday deadline for a second consecutive week to fund the department or risk its shutdown, giving in was the best course of action, he said. This decision  considering where we are  is the right one for this team, and the right one for this country, Boehner said. Just 75 Republicans voted to approve the measure; no Democrats opposed it. The Senate, under Majority Leader Mitch McConnell (R-Ky.), approved the measure last week in a bipartisan vote, leaving Boehner few options. The sudden change of course arrived none too soon for Republican leaders who endured criticism for failing to manage their majority now that the party has control of Congress for the first time in eight years. The strategy of using the funding bill to force Obama to back down on his immigration plan has consumed the first two months of the new Congress, escalating Republicans tough rhetoric that has alienated Latinos and other minority groups the party is trying to court in the run-up to the 2016 presidential election. That approach failed in the Senate, where Democrats blocked repeated attempts by McConnell to advance the legislation with restrictions on Obamas plan to protect from deportation up to 5 million immigrants who are in the U.S. illegally. Unfortunately, the fight was never won in the other chamber, Boehner said. Democrats stayed united and blocked our bill, and our Republican colleagues in the Senate never found a way to win this fight. Boehner tried to persuade his rank-and-file to turn its attention to the court fight over Obamas action on immigration, which was temporarily halted last month by a federal judge in Texas. The administration is challenging the judges order. The good news is that the presidents executive action has been stopped, for now, Boehner told Republicans in the closed session. This matter will continue to be litigated in the courts, where we have our best chance of winning this fight. That offered no salve to House conservatives, who have been dissatisfied with Boehners tenure as speaker. They staged a series of procedural maneuvers, including forcing a partial reading of the bill, as a floor fight broke out between Republicans. Some have grumbled that another leader may be better, though they have been unable to coalesce around an alternative choice. We need to stand up, use the power of the purse, said Rep. Thomas Massie (R-Ky.), who led the floor challenge. Its disappointing, said Rep. Luke Messer (R-Ind.). I hoped wed be able to continue the fight. We just have to keep fighting on all levels to prevent illegal executive amnesty, added another Republican, Rep. John Fleming of Louisiana. A funding cutoff would have furloughed some Homeland Security employees but forced most others to work without pay. The department oversees the Border Patrol, airport screenings and other crucial security programs, and Homeland Security Secretary Jeh Johnson had pleaded with Congress to provide stable funding. More pragmatic Republicans appeared relieved that the potentially damaging episode was over, for now, allowing the party to return to other parts of its agenda. Having a clean DHS bill will allow us move forward on not only this issue but other issues here in the future, said Rep. Jeff Denham (R-Turlock). My thought has always been that we do not think what the president has done is constitutional, but that is something we should address in an immigration bill. But those Republicans were clearly in the minority, forcing Boehner to rely on Pelosi for passage. The two leaders had been in several conversations since last weeks showdown, which culminated with a one-week funding extension the House approved just hours before the deadline Friday night. The Democratic leader suggested procedural options that could help Boehner bring a straightforward funding bill up for a vote, and Pelosi believed it was best to take up the issue as soon as possible, according to people familiar with the private conversations. On Monday evening, Boehner told her he planned to hold the vote the next day, after Israeli Prime Minister Benjamin Netanyahus speech to a joint meeting of Congress, the sources said. At a private meeting Tuesday morning, she urged her Democratic colleagues to be on the floor as soon as the vote was called as a show of force. So that we can end this thing, Pelosi said. lisa.mascaro@latimes.com, Twitter: @lisamascaro, , 9:16 p.m.: The story was updated throughout with new information. 12:17 p.m.: The story was updated with the House vote. The story was originally published at 7:05 a.m.]", "Date": "20150303", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/la-na-house-homeland-security-funding-20150303-story.html", "Title": "[House OKs Homeland Security funds as GOP gives up tactic on immigration]"}