{"Content": "[ In the long, and often weird, history of political debates, this may have been a first: A gubernatorial debate stalled for six minutes because of a fight over whether one candidate could bring a fan. No, not the cheering kind of fan -- although both sides had plenty in the audience -- but the blowing type. To be precise, a roughly 1-foot-in-diameter, dark plastic portable fan tucked under the lectern used by Charlie Crist, Floridas former Republican governor who is seeking a repeat term as a Democrat. Crist, known for his immaculate silver hair, flawless tan and obsessive attention to his appearance, doesnt go anywhere without his fan. On the campaign trail, an aide always has one at the ready so that no one ever need see the once and perhaps future governor sweat. But Crists rival, incumbent Republican Gov. Rick Scott, insisted that the debate rules prohibited the fan. His aides pointed to a clause that barred the candidates from using electronic devices. As Crist walked onto the stage at Broward College, the debate moderator, Eliott Rodriguez, the anchor of CBS Miami affiliate, told the crowd and the viewing audience that Scott was \"also in the building\" but that \"we have been told that Gov. Scott will not be participating in this debate\" because of Crists fan. Members of the audience hooted and booed. Crist, looking much like a schoolboy who has been told he could have an extra 45 minutes of recess, did his best to take advantage of the moment, as Rodriguez and his two fellow panelists struggled to decide what to do. \"Are we really going to debate a fan?\" Crist asked. About six minutes into the scheduled debate time, Scott finally walked onto the stage. He later sought to explain his initial absence by saying he hadnt been sure Crist would show up. Crist, for his part, said simply, \"Is there anything wrong with being comfortable?\", For the rest of the allotted hour, the two men proved once more how heartily they dislike each other as well as how completely they disagree on issues including global warming, raising the minimum wage, expanding Medicaid, high-stakes testing in schools, the states \"stand your ground\" law on self-defense, and same-sex marriage. Scott, repeatedly referring to his predecessor as \"Charlie,\" accused Crist of not attending to the details of the job while he was governor, saying that Crist had spent his time trying to become vice president and run for the Senate. The Republican incumbent also repeated a charge aired in his television ads, saying that Florida had lost more than 800,000 jobs during Crists tenure as governor, which began in January 2007. \"Charlie is a lot of talk,\" Scott said, \"not a lot of action.\", \"The people of Florida know I didnt cause the global economic meltdown,\" Crist responded. Often after a debate, both sides battle over what voters will remember. No one asked that question after this encounter. By the time the debate ended, #FanGate was already trending on Twitter. For more on politics and policy, follow @DavidLauter on Twitter.]", "Date": "20141015", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-florida-governor-debate-20141015-story.html", "Title": "[Governor's debate in Florida stalls over a fan]"}