{"Content": "[ In 2011, a draft-Chris Christie movement rippled across the country, fueled by Republicans dissatisfied with their presidential field and captivated by the brash personality of New Jerseys combative governor. After a splashy trip to early-voting Iowa, however, Christie begged off. Now is not my time, he said. The question this year is whether his time has come and gone. On Tuesday, Christie formally launched an uphill bid for president with a forceful attack on the two major political parties, blaming them for Washingtons chronic polarization and promising to deliver unvarnished straight talk. New Jersey Gov. Chris Christie announces his candidacy for president Tuesday at Livingston High School in Livingston, N.J. Christie, who went to the school, joins the 2016 Republican field for president. New Jersey Gov. Chris Christie announces his candidacy for president Tuesday at Livingston High School in Livingston, N.J. Christie, who went to the school, joins the 2016 Republican field for president. Gov. Chris Christie announces his candidacy for president at Livingston High SChool in New Jersey. Gov. Chris Christie announces his candidacy for president at Livingston High SChool in New Jersey. Were going to tell it like it is today, so we can create greater opportunity for every American tomorrow, Christie told a raucous crowd stuffed into the gymnasium at Livingston High School, where he served as class president. The truth will set us free, everybody. He spoke without notes, roaming the stage with a handheld microphone in a scene reminiscent of the town hall meetings that have yielded some of the most colorful and confrontational moments of his political career. There were no hecklers, but Christie suggested he was prepared to make some voters uncomfortable with his blunt-spoken style. Youre gonna get what I think, whether you like it or not, he said, and whether it makes you cringe every once in awhile or not. For all the characteristic brashness, however, Christie enters the Republican field as a distinct longshot among the 14 major declared candidates. A relative moderate in a party that has grown increasingly conservative, unpopular at home and trailing far behind other Republicans in both fundraising and opinion polls, Christie has seen his political star badly fade since the heady days four years ago. Perhaps most damaging, the assertive style that once so animated audiences is no longer an unalloyed asset. A scandal involving political payback and a now-famous traffic tie-up on the George Washington Bridge reinforced the image of Christie as something of a bully, even as the governor steadfastly has denied involvement in any wrongdoing. Rather than shrink from his aggressive nature, campaign strategists hope to turn Christies persona back to his advantage, portraying him as a truth-teller and someone willing to take on politically difficult issues, including overhauling Social Security, that more timid rivals wont touch. The governor emphasized that theme repeatedly as he spoke for nearly half an hour without notes or prepared text. His off-the-cuff approach led to some disjointed passages  The horse is out of the barn, he said regarding federal spending  we got to get it back, and we can only do it by force. But his command of his message and policy proposals offered a strong contrast with his more scripted opponents. Joining him onstage throughout were his wife and the couples four children, as fans waved blue signs with Christies campaign slogan: Telling it like it is. Christie first gained wide notice as New Jerseys top federal prosecutor. Appointed in 2001, he made his name fighting the states deep-seated political corruption, going after lawmakers without regard to party. He resigned soon after President Obamas 2008 election and a year later beat incumbent Democrat Jon Corzine to become New Jerseys governor. In his first term, Christie worked with Democrats to pass a tighter property tax cap and a pension-reform plan that he touts as a model of bipartisan consensus  something, he said Tuesday, that is lacking in Washington. Both parties have failed our country by refusing to work together, he said. If Washington and Adams and Jefferson had believed compromise was a dirty word, wed still be under the crown of England. When Hurricane Sandy walloped the Jersey Shore in 2012, Christie set aside political differences and linked arms with Obama to address the disaster; some partisans have never forgiven him. (He had little good to say about the president on Tuesday, however, describing him as weak and indecisive, among other criticisms.), In 2013, Christie won overwhelming reelection, with strong support from Latinos and other Democratic-leaning constituencies. But soon after, news broke that aides had engineered a series of massive traffic jams in Fort Lee, N.J. across the Hudson River from New York City, to punish the citys Democratic mayor for refusing to endorse Christie. The governors political stock plunged, at home and across the country, and has yet to recover. One of Christies appointees to the Port Authority of New York and New Jersey  a former high school classmate  has pleaded guilty to criminal charges for his role in tying up the bridge. Two other Christie allies also have been charged. A federal investigation continues, suggesting the case will remain in the news for some time. Christie has tried to move on. Asked about the scandal, he told a New Hampshire audience last month that prosecutors already would have acted if they could have gotten something on me, I suspect. After his announcement, Christie headed to New Hampshire for several days of campaigning. He is counting heavily on the state, which holds the first presidential primary and traditionally has looked kindly on less-conservative Republicans. His campaign hopes Christies take-all-comers approach to campaigning will boost him the way it helped Arizona Sen. John McCain, the 2008 GOP nominee, when his candidacy was all but written off. Barabak reported from Washington and Susman from Livingston. For more on campaign 2016, follow@markzbarabak, 12:48 p.m.: This story was updated with a new version. 8:43 a.m.: This story was updated with quotes from Christies speech. 8:01 a.m.: This story was updated with color from the scene of Christies announcement. 7:51 a.m.: This story was updated to reflect Christies announcement.]", "Date": "20150630", "Author": "[Mark Z. Barabak, Tina Susman]", "Link": "http://www.latimes.com/nation/la-na-chris-christie-announcement-20150629-story.html", "Title": "[Chris Christie launches presidential campaign, but has his time passed?]"}