{"Content": "[ The dryly titled report released last week  \"The Status of Latinos in California\"  was either uplifting or unnerving for the Latino political establishment, depending on whether the viewer was looking backward or ahead. Latinos represent 1 in 5 registered voters, said the report prepared for the Latino legislative caucus and other groups. They hold 1 in 4 Assembly seats, and sit on city councils in 27 of the states 58 counties. That is undeniable progress from the days when Latinos were shut out, often by a gerrymandering hand. But their voting strength is only half their proportion of Californias population, the report said. They hold 1 in 8 state Senate seats and an even smaller percentage of supervisorial chairs. Thats symptomatic of a troubling turn for Latino politicians and voters. Together with other data, it suggests the possibility of a ceiling forming over a group that, until recently, thought it had limitless upward mobility. Put bluntly, the caucus report showed that the best chances for Latino politicians come in small towns populated by Latinos. The higher up the political food chain the job, or the less Latino the political district, the worse their odds of success. It was enough to feed fears that the desire for historic firsts  a first Latino U.S. senator, a first Latino California governor  will be thwarted in 2016 and 2018. \"When is California ripe for a Latino senator or governor? The time couldnt be more ripe than right now,\" said Roger Salazar, a Clinton administration veteran who is a spokesman for the Latino caucus. \"But now the question is: How do you get that to happen?\", Concern about their future has blossomed as Latinos, long the most politically important minority group in the state  even though, yes, its now the largest in population  have found themselves somewhat eclipsed by Asians. The worry is an uncomfortable one, given that the groups are political twins, working together on many issues and backing the same national candidates, which is to say Democrats. Asians, powered by highly organized networks of donors and voters, have pulled off bipartisan surprises in recent regional elections that have raised eyebrows among Latinos. And at the state level, Asians have been even more dominant, claiming as representatives Treasurer John Chiang, Controller Betty Yee and Atty. Gen. Kamala Harris, whose mother was Indian. \"Theres a reason why three of the 10 statewide officeholders are Asian,\" said Mike Madrid, a Republican strategist and Latino voting specialist who praised the political acumen of the Asian community. For Latinos, upward movement is complicated by problems connected to the poor turnout of Latinos in their geographic base, Southern California, and the difficulty of raising money when home districts lack abundant wealth. Statewide candidates cast a wary eye about whether to run when their own voters are undependable, for example, yet an exciting candidacy is the surest way to get voters to turn out, making for something of a stalemate. Some problems are self-fulfilling: Statewide campaigns spend their money where they have the best chance of good return, and that means focusing on those more likely to vote, not less. Rarely is there enough left over to cultivate long-shot voters, which many Latinos have become, but the disinterest by campaigns can perpetuate disinterest by voters. Money remains a big issue. Hilda Solis, a former congresswoman and Labor secretary elected last year to the Los Angeles County Board of Supervisors, contrasted how Latinos and Asians have approached campaigns. \"They are very disciplined and thats a good trait. Thats something any campaign needs to have. Im not saying it cant be done by Latinos  we also have to be a lot more disciplined. I think thats something you learn,\" she said. \"Its almost like maturity. Ive had to go through it myself. At first you think its distasteful getting on the phone and asking for money  well, thats part of life.\", State Senate President Pro Tem Kevin de Len, from Los Angeles, said he was discussing measures to shift election days to the weekend to boost turnout, a move he said would be bipartisan but which, in practice, would potentially be a boon to Latino voters and, by extension, candidates. (Although four Latinos have served as Assembly speaker in the last 19 years, De Len is the first Latino Senate president pro tempore, and the number of Latinos in the Legislature has flatlined in the last 10 years.), Latinos running in the states upcoming U.S. Senate race are long shots, at this point. Assemblyman Rocky Chavez of Oceanside is barely known and a Republican in a state that hasnt elected one statewide in a decade. U.S. Rep. Loretta Sanchez of Santa Ana, a Democrat, may be better known but has had a troublesome campaign start compared to Harris, the San Franciscan who benefits from being a statewide officeholder. (Former Los Angeles Mayor Antonio Villaraigosa briefly considered a Senate run and is now pondering the 2018 governors race.), Sanchez has overtly played the history card, asserting at her May announcement that \"I would be the first Latina ever elected to the United States Senate.\", Others remain in the wings. De Len said that he was \"not going to rule out any potential run for future office at the statewide level.\" Labor leader Maria Elena Durazo touted Solis as a potential statewide or Senate candidate before Solis had even announced her run for supervisor. Asked whether shes interested, Solis brushed the notion aside. \"I have seven months under my belt right now,\" she said, referring to the board position, \"and I love what Im doing ... Im not interested right now, to be quite honest.\", But, she said, \"I want to see more women, Latinas and Latinos running for higher office. And it will come.\", cathleen.decker@latimes.comTwitter: @cathleendecker, Hoy: La esta historia en espaol]", "Date": "20150712", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-politics-latinos-20150712-story.html", "Title": "[Report shows a troubling turn for Latino politicians and voters  ]"}