{"Content": "[ For years, President Obama had a singular problem: convincing Americans who were not feeling the economic recovery that it was real and a cause for optimism, not to mention for electing fellow Democrats. Now Republicans seeking to capture the White House find themselves on the brink of the reverse dilemma: how to dismiss the economic revival that many Americans seem finally to be embracing. For the party out of power, better economic times always pose strategic difficulties. In 2016, Republicans must argue that Democrats have so fumbled their handling of the nations economy  the No. 1 issue for voters  that they should be booted from power. But that requires a huge dose of pessimism that runs the risk of making Republicans seem out of touch with the nations increasingly upbeat mood. As top Republican White House prospects gathered this weekend for a forum in Des Moines, they seemed to have come to a temporary solution: talk about foreign policy, or immigration, or the power of a mothers love  anything but a deep dive into the issue that has overarched the last two presidential campaigns. New Jersey Gov. Chris Christie and former Pennsylvania Sen. Rick Santorum made brief stabs at the discomfort that persists beneath the budding optimism, particularly among financially stressed Americans. Former Arkansas Gov. Mike Huckabee dismissed the improving jobless numbers as ephemeral and blamed Obamas healthcare measure for forcing full-time workers into part-time jobs. But there was little on the order of solutions, other than the Republican standbys of shrinking the size and sway of government and lowering taxes. Former Florida Gov. Jeb Bush, who skipped the Iowa event, framed what probably will be the GOP argument if the economy stays as it is through the November 2016 election. \"Sixty percent of Americans believe that were still in a recession,\" Bush said in part of a broader critique of Obamas tenure during a Friday speech in San Francisco. \"Theyre not dumb. Its because they are in a recession. Theyre frustrated, and they see a small portion of the population on the economys up escalator. Portfolios are strong, but paychecks are weak. Millions of Americans want to move forward in their lives, they want to rise, but theyre losing hope.\", That approach is complicated: Republicans are seen by many voters, particularly those who turn out in greater numbers in presidential cycles, as the party of the people with portfolios, so arguing the underclass case requires an image adjustment. And the argument could lose potency if the economy continues to improve in the 22 months before presidential ballots are cast. The recovery could also fall apart, but in recent months Americans seem less inclined to expect so. A Gallup poll last week found 41% of Americans satisfied with the economy; a year earlier the figure was 28%. Consumer confidence is riding higher than it has since the 2008 economic collapse. The percentage of people who believe the country is on the right track has risen sharply. Obamas approval ratings likewise are higher, offering a potential leg up for his partys chosen successor. There are two precedents, with different outcomes, for how economic recovery can play out as a party seeks the historically rare third successive term, as Democrats will in 2016. Both involved candidates named Bush. In 1988, as vice president, George H.W. Bush argued that the countrys fiscal position at the end of the Reagan administration should persuade voters to side with him over Democrat Michael Dukakis. As Bush argued when he accepted the Republican nomination, \"When you have to change horses in midstream, doesnt it make sense to switch to the one whos going the same way?\", Twelve years later, Bushs son  and Jeb Bushs brother  George W. Bush faced a similar set of circumstances from the opposite side, challenging Vice President Al Gore during a time of economic prosperity and general optimism. Bush won, exploiting fatigue over the personal escapades of President Clinton and adopting a wildly optimistic tone himself. \"We will use these good times for great goals,\" he said in his first convention speech. \"And we will extend the promise of prosperity to every forgotten corner of this country.\", That tone has largely been missing from the Republican conversation so far, in part because anger is a far better propellant for the party out of power. David Bossie of the Citizens United political group, which cosponsored the Iowa event, was practically apocalyptic onstage, declaring that \"our country is mired in darkness.\", Christie and Santorum took different approaches when they spoke. In a manner reminiscent of Jeb Bush, the New Jersey governor outlined the \"anxiety\" he said he found in voters before the 2014 midterm election, which he blamed on income stagnation. No proposals for solving it were forthcoming, and Christie then moved to a long discourse about his antiabortion position and his relationship with his mother  an extended anecdote meant to assure Iowans that he would always tell them the truth. Santorum took more aggressive aim  at his own party. \"You want to show that were relating to folks who are working in America? Then we have to go out and prove it,\" said Santorum, who has positioned himself as the partys blue-collar champion. He noted that the party had allied itself with business owners, rather than the far larger pool of employees. \"We dont win because too many people dont think we care about them,\" he said. \"Weve got to show them  not just by saying we do but by having policies and a message where they can see it and they can feel it in us.\", Craig Robinson, a former Iowa Republican Party operative and founder of the Iowa Republican political website, said that so far none of the candidates appeared to have hit on a solution for how to manage optimism. \"The Republicans need to start talking about it as: Imagine what the economy would be if we did X, Y and Z,\" he said. \"They need to make the argument that it could be even better.\", cathleen.decker@latimes.com, Twitter: @cathleendecker, Times staff writer Mark Z. Barabak in San Francisco contributed to this report.]", "Date": "20150125", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/nation/politics/la-na-republicans-economy-20150126-story.html", "Title": "[Rosier views on economy pose a challenge for Republicans]"}