{"Content": "[ Donald Trump arrived in Mobile, Ala. for his biggest rally yet in typically bombastic style: in a private jet that had just flown several laps around the football stadium where thousands of his supporters were waiting. Wearing a red baseball cap emblazoned with his campaign slogan -- \"Make America Great Again -- Trump entered the stadium Friday night asLynyrd Skynyrds Sweet Home Alabama boomed. In an energetic, if meandering speech, the businessman, reality television star and Republican presidential front-runnercriticized Americas leaders as stupid, complained about children born to immigrants in the country illegally, and bragged about his personal wealth. He vowed that if elected president, he would put his business interests aside and devote his acumen to improving the lives of the American people. \"I wont care about that company,\" Trump said. \"My whole energy, my whole being is going to be to make this country rich. In order to make this country great, I have to make it rich again. Dismissed at first as a long-shotcandidate, Trump has soared in the polls since declaring his candidacy in June. His off-the-cuff style and outspokencritiqueofthe Washington political establishment clearly resonated with many members of the crowd, who at one point interrupted him with chants of Trump and U.S.A. Trump, not known for his attention span in speeches, interrupted himself many times, at one pointto highlight a sign being waved in the audience and at anotherto point out a plane flying overhead. A recent telephone survey found a majority of likely Republican voters think Trump will be their partys nominee for president of the United States in 2016. A Rasmussen survey found 57% of likely Republican voters thought Trump was likely to be the partys nominee, while 25% thought it was very likely. Trump said he he was ready to capitalize on that momentum. Id like to have the election tomorrow, he said to laughter. I dont want to wait. He talked at length about illegal immigration, the issue that many believe has gotten him here. Trump began his speech by recitingthe namesof several victims of crimes committed by immigrants in the country illegally, and repeated his call to end birthright citizenship for children born in the U.S. to immigrants in the country without legal status. That policy, enshrinedin the 14th Amendment, encourages immigrants to enter the country unlawfully to have children, Trump said. He pointed out that many other countries have different policies. Were the only place just about thats stupid enough to do it, he said. Trump said 300,000 children each year are born to women in the country illegally. Those are children, he told the audience, that you have to take care of, we have to take care of. Several thousand people attended the rally at the University of South Alabamas football stadium. Althoughnot a typical primary campaign stop, Alabama is one of eight Southern states that will hold its presidential primary March 1, 2016. The crowd is believed to be the largest yet to turn out for a Republican presidential candidate. Still, the more than 40,000-seat stadium was far from full. With considerable fanfare this week, Trumps campaign moved the rally from a smaller venue after it said it received more than 40,000 RSVPs. In recent days, Trump has bragged about the tens of thousands of supporters he said would come. Still, Trump did not seem disappointed by the turnout. He gleefully poked fun at his Republican rival Jeb Bush, U.S. Ambassador to Japan Carolyn Kennedy -- and at one point, his own hair. Gesturing to the darkening skies, Trumpmade a joke about his goldencoif, long the target of jokes. If it rains,\" Trump said, \"Ill take off my hat, and Ill prove once and for all that its mine.\"]", "Date": "20150821", "Author": "[Kate Linthicum]", "Link": "http://www.latimes.com/nation/la-na-trump-alabama-20150821-story.html", "Title": "[Donald Trump tells Alabama crowd: 'I'd like to have the election tomorrow']"}