{"Content": "[ As the two political parties begin to gear up for next years presidential election, the public has a more positive general image of the Democrats but trust Republicans more on specifics, a newly released survey shows. The survey released Thursday by the nonpartisan Pew Research Center suggests an important underlying dynamic for the presidential contest:, A Republican nominee may be able to count on a presumption that he or she will be able to handle major issues, but will be challenged on empathy and tolerance, as Mitt Romney was in 2012. The Democratic nominee may be able to take those attributes for granted, at least to some extent, but will need to reassure the public about his or her abilities on managing issues. Large segments of the public believe each party has strong principles. Asked if either has \"good policy ideas,\" just over half say the Democrats do and just under half say Republicans do. But the overall images of the parties differ markedly. About six in 10 American adults say the Democratic party cares about the middle class and is tolerant and open to all groups of people, the poll found. By contrast, only about one-third of Americans say Republicans are tolerant and open to all, and just over four in 10 say they care about the middle class. Half say the Republicans are too extreme, considerably more than the share -- just over one-third -- who say that about the Democrats. But asked which party could do a better job on seven major issues, the public gives Republicans the edge on three and the Democrats on only one, the survey showed. Republicans run ahead of Democrats on handling terrorism and taxes, two traditional areas of strength for them. The poll also found a large Republican advantage on making wise decisions about foreign policy. Thats the first significant advantage for the GOP on that question since the 2003 U.S.-led invasion of Iraq soured the public more than a decade ago on the GOPs leadership overseas. The GOP edge on foreign policy developed suddenly after a long period of rough parity between the parties on that subject, apparently reflecting a spate of foreign problems that have troubled the Obama administration in the last few months. As recently as October, the two parties were even on foreign affairs in Pews surveys. Now, the public prefers the GOP by 13 points, 48% to 35%. Republicans enjoy a 21-point lead on foreign policy among men, 52%-31%, while women divide much more closely, with 44% giving the edge to the GOP and 39% to the Democrats. Much of the shift since October has involved self-identified independents, who have moved toward the GOP on foreign policy, the poll found. Typically, a large percentage of independents do not follow news as closely as partisans on either side, and their opinions on major issues sometimes shift more slowly than those of more engaged voters. The only issue on which the Democrats had a significant edge was handling healthcare, the poll found. Democrats have a 7-point margin on that issue, 47% to 40%. The Democrats advantage on healthcare persists even though a majority remain unimpressed with their signature achievement on the issue, the Affordable Care Act. By 53%-45%, the public has a negative view of the law. On the other hand, by 50%-45%, Americans say they believe the laws major provisions are probably here to stay. Democrats and independents both say the law is probably permanent. Only among Republicans do a majority say that the laws major provisions will probably be eliminated. The public divides roughly evenly between the two parties on the three other issues tested -- handling the economy, immigration, and abortion and contraception, the poll found. On some of those issues, however, notable gaps appear among certain groups. On immigration, for example, Latinos favor the Democrats by about 3-1, while white Americans favor the GOP, 52%-36%. On abortion and contraception, men divide equally between the two parties, while women favor the Democrats, 45%-38%. On the economy, men lean toward the GOP by a small margin, while women narrowly favor the Democrats. As with other surveys, the new poll found that President Obamas job approval has ticked up since last fall. The Pew survey shows 48% of the public approving the presidents job performance and 46% disapproving. Obama is considerably more popular than the leaders of the Republican Congress, who receive approval from 26%. But asked who should take the lead in solving the nations problems, the public is far more closely divided, with 40% saying Obama while 38% pick the GOP leaders. That division has not changed significantly from the period around last Novembers mid-term election, which led to a Republican takeover of Congress and many statehouses around the country. Part of the discrepancy between the answers to those two questions  popularity and which should lead -- comes about because the GOP leadership is relatively unpopular even within the GOP. Only half of Republicans say they approve of the job that their congressional leaders are doing. By contrast, about two thirds of Democrats approve of their partys congressional leadership. But those same Republicans who disapprove of the GOP leadership disapprove of Obama even more and are inclined to want the GOP to lead on issues. The Pew survey was conducted last Feb. 18 through Sunday, questioning 1,504 adults by cellphone and landline. The findings have a margin of error of +/- 2.9 percentage points. For more on politics and policy, follow@DavidLauter on Twitter. 11:40 a.m.: This article has been updated with additional data on the attitudes of some subgroups in the electorate. This article was originally published at 7 a.m.]", "Date": "20150226", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-party-images-20150226-story.html", "Title": "[Americans have more positive view of Democrats, trust GOP on issues]"}