{"Content": "[ President Obama released a $4-trillion budget Monday with liberal priorities that have little chance of passage but will serve as an initial foray in negotiations with the new Republican Congress and help define the Democratic Party in the run-up to the 2016 presidential race. The administrations annual federal budget, like those that will follow from the House and Senate, is a largely aspirational blueprint, even more so in Obamas final term. This budget, ending in September 2016, is the last one the president will still be in office to fully execute. There are several factors working in his favor this year, including a strengthening economy, a falling deficit and rising public approval of the administration. The presidents budget focuses on bolstering the federal governments role in shaping opportunities for ordinary Americans, an effort hes dubbed middle-class economics. With deficits projected to be the lowest since he took office, Obama proposes reversing $74 billion in so-called sequestration cuts to government programs that the White House and Congress reluctantly agreed to almost four years ago. The White House also announced a $478-billion public-works program to fund new roads, bridges and highways, paid for by a one-time tax on corporate profits held overseas. That idea has some bipartisan support. More broadly, however, the president intends to champion liberal ideas that are designed to narrow the nations income inequality, asking the biggest financial corporations and wealthiest Americans to shoulder a larger tax burden to help the government provide basics like universal preschool and free community college. Revenue would be raised from new taxes, including one on the nations 50 largest financial firms and others aimed at inheritance and trust funds. That would help pay for tax breaks for middle-class households, including a $500 second-earner tax credit, expansions of both the college tuition credit and the Earned Income Tax Credit, and additional tax credits of up to $3,000 per child. An administration official said 44 million households would see their taxes cut by an average of $600 a year. We believe that this budget shows how we can implement the presidents vision for middle-class economics and put the good of middle-class families and our economy front and center, while also continuing progress on restoring fiscal discipline, the official said. You dont have to choose between those two things. You can in fact accomplish both. Obamas budget details $3.99 trillion in spending and collects $3.52 trillion in revenue, running a deficit of $474 billion, the official said. Even before the budgets release, its contours were quickly dismissed by Republicans in Congress, who see little reason to yield to the White House after expanding their ranks in the last election to control both chambers of Congress. What I think the president is trying to do here is to, again, exploit envy economics, said Rep. Paul D. Ryan (R-Wis.) on NBCs Meet the Press on Sunday. This top-down redistribution doesnt work. Weve been doing it for six years. For Republicans, new taxes are generally a nonstarter, even as a trade-off for reversing Pentagon cuts that many GOP defense hawks warn are hurting military readiness at a time of increased threats from abroad. Sen. John McCain (R-Ariz.), chairman of the Senate Armed Services Committee, calls the sequestration cuts mindlessness  a word the White House also uses. But he also declared Obamas proposed tax increases DOA. The president defended his plan in an interview with NBC before the Super Bowl. My job is to present the right ideas, and if the Republicans think they have better ideas, then they should present them. But my job is not to trim my sails, he said. The Republican preference is for continued austerity and lower taxes, which will probably be reflected in their own budget plans expected next month. To boost Pentagon spending as defense hawks want, their budgets are expected to slash more deeply into food stamps, healthcare and other safety-net programs. Rep. Tom Price (R-Ga.), the House Budget Committee chairman, promised Sunday on Fox News that a Republican budget would re-imagine Medicare, Medicaid and Social Security, and will do what the American people have to do with their homes and in their businesses every single day  and thats not spend more money than what comes in. Republicans contend this combination of lower taxes and reduced spending will cut the nations still-climbing $18-trillion debt load and trigger greater growth through private investment. The president thinks that we get economic growth from an ever-bigger government, and thats exactly backward, said Sen. Patrick J. Toomey (R-Pa.), who led the conservative Club for Growth before joining the Senate. We cannot abandon fiscal discipline. There are individual areas that we need to look at very closely, but overall we need to maintain the fiscal discipline we have. It is the way weve managed to make some progress on deficits, but we are not out of the woods by any stretch of the imagination. At some point, though, the heady debates will bump into the practical reality of governing. Built-in deadlines will force both sides to the negotiating table this year, or set the federal government on a trajectory of shutdown threats that have permeated the last few years. On May 31, the authority to spend the Highway Trust Fund expires, which could leave countless road and highway projects in the lurch. Obamas proposal would extend the fund for the next six years by imposing a one-time tax on some $2 trillion in corporate overseas earnings that now largely escape taxation. His proposed 14% tax on foreign profits would be much lower than the standard 35% corporate rate  among the highest of the worlds major economies  and would raise $238 billion, the administration official said, about half the money needed to pay for the infrastructure program. The remainder would be covered by gasoline taxes currently in the trust fund. A similar overseas profits tax, at 6.5%, has been proposed by an unusual bipartisan alliance of Sens. Barbara Boxer (D-Calif.) and Rand Paul (R-Ky.), showing the potential for an eventual compromise. With the start of the new fiscal year on Oct. 1, the full force of the sequestration cuts will begin, and Obamas proposal to prevent them from slicing across domestic and defense accounts will be attractive to Republicans who want to beef up military spending. Another pressure point, coming later this year, will be the need for Congress to raise the federal debt limit. Although deficits have declined steadily, Obamas budget projects a shortfall thats up slightly from current deficit projections. But at roughly 2.5% of gross domestic product, the shortfall is just below the 50-year average for deficits as a share of the economy. That deficit-reduction package nevertheless contained some wishful thinking from the White House. Much of it comes from three areas  lower healthcare spending, higher revenue from closing loopholes and changes to the tax system, and an overhaul of the immigration system. Prospects for the latter two passing the Republican-controlled Congress remain grim. The budget does not reflect the effects of Obamas recent executive actions on deferring deportation for some immigrants, officials said, arguing that the presidents preferred policy was to pass broader immigration legislation. Likewise, the presidents budget makes only a modest dent in the debt. Overall debt is now $18 trillion, and officials said the publicly held portion would come in at 75% of gross domestic product in 2016. Thats more than double what it was in 2007. As they have in the past, Republicans in Congress are likely to demand something in exchange from the White House for their votes to raise the debt limit. That may open the door to talks as a way to avert a crisis. lisa.mascaro@latimes.com, kathleen.hennessey@latimes.com, Twitter: @lisamascaro, Twitter: @khennessey, 9:29 a.m.: This article was updated with more details on the budget. 3 a.m.: This article was updated throughout with new information. 2:30 p.m. Sunday: This article has been updated throughout with additional details and background concerning the budget proposal. This article was originally published at 11:10 a.m. Sunday.]", "Date": "20150202", "Author": "[Lisa Mascaro, Kathleen Hennessey]", "Link": "http://www.latimes.com/nation/la-na-obama-budget-infrastructure-20150201-story.html", "Title": "[Obama's $4-trillion budget champions liberal priorities]"}