{"Content": "[ DENVER -- It turns out John Hickenlooper is not only a Democrat but mortal after all. The first-term Colorado governor enjoyed transcendent popularity in this purple state as he lightly wore his partisanship, pleasing businesses, riling environmentalists and generally avoiding the combustible issues that inflame party passions. \"Hicks brand was that he was above politics,\" said Colorado Colleges Tom Cronin, a longtime student of campaigns at the state and national levels. But governing has forced Hickenlooper to choose, and choosing has defined him in a way that could leave him politically vulnerable next year as he seeks a second term in what could be a difficult year for Democrats. If only Colorado Republicans could scare up a serious opponent. Democrats harbored years of pent-up desires when they captured full control of the Capitol last November, and their recently completed legislative session was like their Valhalla beneath Denvers gold dome. Among the items passed and signed into law by Hickenlooper were bills cracking down on guns, legalizing gay civil unions, enhancing labor rights, mandating new green-energy requirements, allowing in-state tuition and drivers licenses for immigrants in the country illegally, and putting forth a $1-billion tax hike to pay for education reform, subject to voter approval this November. Republicans cried overreach, to which Hickenlooper responded, \"Overreach implies that your ambitions exceed common sense. If you look at the list, its not an excessive agenda.\", Perhaps not in his estimation, but it certainly left no doubt where on the political spectrum the once-hard-to-pin down Hickenlooper stands. Worse politically was the governors widely disparaged handling of the death penalty case involving Nathan Dunlap. Dunlap faced execution in August for killing four people, a mother and three teenagers, in a 1993 rampage at a Chuck E. Cheese restaurant in Aurora. Dunlaps attorneys sought commutation of his sentence to life in prison without parole, saying the killer had been abused as a child and was mentally ill at the time of the slayings. After lengthy deliberation, Hickenlooper announced in May he would split the difference, sort of. He granted Dunlap a \"temporary reprieve,\" in effect ensuring he would stay alive at least through the end of Hickenloopers first term. Opponents of capital punishment were disappointed. Prosecutors and the families of Dunlaps victims were furious. To many observers, Hickenlooper did not seem thoughtful so much as weak and indecisive. Up to now his political career has been a charmed one, starting with his delightfully unconventional back story as a knockabout who founded a Denver brew pub and first gained wide notice fighting to preserve the name of the citys legendary Mile High Stadium. He served two well-regarded terms as Denver mayor before being elected governor in 2010. To the extent Hickenlooper is known nationally, it is mainly for his quirky campaign commercials -- one featured him showering, fully clothed, as he eschewed negative advertising -- andspeculation about a possible spot on the Democrats national ticket in 2016. Now, though, Republicans catch a whiff of opportunity. Declaring his outrage over the Dunlap decision, former congressman and one-time presidential hopeful Tom Tancredo announced he would run a second time against Hickenlooper, who beat him in 2010. Republican strategists, however, roll their eyes at the mere mention of Tancredos name, mindful that his heat-seeking statements on immigration and Islam, among other topics, thrill some conservatives but repel a great many other voters. While a recent poll by Connecticuts Quinnipiac University showed Hickenlooper and Tancredo running neck and neck, the survey offered, more than anything, a pair of cautionary lessons: on the dangers of relying on a single survey to gauge the political state of play, and on the wisdom of listening to local pollsters and campaign professionals who know their state best -- several of them dismissed the poll results out of hand. A second high-profile Republican mulling a 2014 bid for governor, Secretary of State Scott Gessler, was recently hit with a state ethics fine for misusing his offices discretionary fund -- hardly the most propitious launch to a campaign. A handful of others have also been mentioned as prospective gubernatorial candidates, but none of them is a top-shelf contender. There is a political adage so oldit could have come West via wagon train: You dont beat somebody with nobody, and right now Republicans seemingly have no one with the heft and credentials to beat Hickenlooper. Unless that changes, the governor seems a shoo-in for a second term, notwithstanding his recent signs of political mortality. He may not even break a sweat.  mark.barabak@latimes.com Twitter: @markzbarabak ]", "Date": "20130624", "Author": "NULL", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-colorado-governor-reelection-20130621-story.html", "Title": "[Colorado's governor has Republicans sensing an opportunity]"}