{"Content": "[ When the nations largest Spanish-language television network cut ties just over a week ago with Donald Trump, Univision executives said they were acting out of \"a responsibility to speak up for the community we serve.\", \"We see firsthand the work ethic, love for family, strong religious values and the important role Mexican immigrants ... have in building the future of our country,\" the network said in response to Trumps derogatory comments about Mexican immigrants. It was a characteristic move for Univision, which, like many Spanish-language media outlets in the U.S. defines itself not just as a media company but as an advocate and defender of the Latino community. \"They openly acknowledge their bias in acting in the interest of Hispanic America,\" said Fernand Amandi, a Democratic pollster based in Florida. That self-assigned role could have big consequences for next years presidential election. With a record 28 million Latinos eligible to vote, Spanish-language media companies are set to have their greatest impact yet in shaping a presidential race. Their advocacy stance has been on display as the campaign heats up, with reporters grilling candidates on issues of special importance to the Latino community, especially immigration. \"If the Spanish-language media has five minutes to talk to a presidential candidate about anything, they will talk about immigration,\" said Gabriela Domenzain, a former Univision producer who is now advising Democratic presidential hopeful Martin OMalley. Thats partly because reporters for English-language outlets often touch on the issue in less detail, if at all, she said. In a recent interview on a Spanish-language show, OMalley focused entirely on his proposals to help the estimated 11 million immigrants in the country illegally. The topic didnt come up at all in an interview OMalley did that same day with ABCs George Stephanopoulos. \"We try to amplify the issues that maybe the mainstream media is not covering,\" said Juan Varela, vice president for content at ImpreMedia, which publishes many of the nations leading Spanish-language newspapers, including La Opinion in Los Angeles. \"We have more responsibility than other journalists,\" he said. \"We are a part of this community, and we have a responsibility to support our people and to help to integrate them.\", That approach has provoked objections from some in both parties, but especially Republicans who see the focus on immigration and the activist stance of many Latino journalists as helpful to Democrats. Univision anchor Jorge Ramos, probably the best-known Latino journalist in the country, has been a particular target. He recently defended the focus on immigration in an open letter to Republicans. \"The Republican Party has been complaining lately about how some Latino journalists, including me, only ask them about immigration,\" he said. \"That is correct, but what Republicans dont understand is that for us, the immigration issue is the most pressing symbolically and emotionally, and the stance a politician takes on this defines whether he is with us or against us.\", Ramos, who is one of the most trusted public figures among American Latinos, according to polls, has been an outspoken supporter of federal legislation that would pave a path to citizenship for those living in the country illegally. He has pressed candidates from both parties on the issue. In the 2012 campaign, he hammered President Obama, who had promised but failed to deliver an immigration bill during his first term. More recently, he has criticized Republican presidential candidate Marco Rubio, who as a senator from Florida helped write an immigration reform bill but dropped support for it after it drew conservative anger. Conservatives stepped up their critique of Ramos last month after the news anchor announced that his daughter was working for Hillary Rodham Clintons campaign for the Democratic nomination. Other criticism has focused on the close relationship between Clinton and Haim Saban, one of the owners of Univision and a longtime Clinton fundraiser. Conservatives say excessive attention to immigration overshadows other issues that matter to Latino voters. \"Immigration shouldnt be the sole prism\" through which campaigns are covered, said Ken Oliver-Mendez, director of Media Resource Center Latino, a conservative group that monitors Spanish-language news for perceived political bias. ------------, FOR THE RECORD, The correct name of the group headed by Ken Oliver-Mendez is MRC Latino. -------------, According to polls, candidates plans for the economy, healthcare and education are more important to Latino voters than immigration, he said. Those issues deserve more play, he added, along with candidates views on social issues like abortion and gay marriage. But some criticism also comes from the liberal end of the spectrum. After Jeb Bush announced his candidacy for the GOP nomination last month, many newscasts noted the Latino musicians who performed, Bushs fluent Spanish and his wifes Mexican heritage. \"This focus on biographical details has come at the expense of reporting on Bushs positions on healthcare and climate change  issues on which his positions are at odds with the interests of most Latinos,\" wrote Jessica Torres, a researcher at Media Matters, a liberal media-watchdog group. Her organization found that immigration was discussed nearly nine times more than jobs and the economy and 26 times more than education on several Spanish-language newscasts during a recent five-month period. Healthcare was never discussed on those shows during that period, according to the report. When candidates dont address Latinos specifically, Spanish-language reporters are apt to take note. When Univision covered Kentucky Sen. Rand Pauls announcement that he was seeking the GOP nomination, for example, a reporter mentioned a few highlights of the speech and one thing the senator had left out. \"In an important detail, Rand Paul didnt mention the theme of immigration  or the term Hispanic,\" journalist Pablo Gato reported. So several candidates are already courting Latinos via Spanish-language media outlets in heavily Hispanic swing states. Bush, a former governor of Florida, has appeared on local Spanish-language television affiliates in that state. In a recent swing through Nevada, he used a Spanish-language interview to criticize Trump, several days before he commented about the controversy in English. Last month, Clinton published an op-ed translated into Spanish in a small Latino newspaper in Nevada. In the piece, Clinton reiterated a pledge to do more than Obama to protect immigrants in the country illegally from deportation. Ibra Morales, president of MundoFox, a Spanish-language TV company, said his network planned to expand its campaign coverage to focus on education, housing and the war in Iraq, along with immigration. \"The Latino agenda is the American agenda,\" he said. But as Univision News president Isaac Lee explained at a forum at the University of Texas at Austin earlier this year, reporters for Spanish-language stations will continue to define themselves as both journalists and advocates. \"Univisions audience knows that Jorge is representing them,\" Lee said, referring to Ramos. \"He is not asking the questions to be celebrated as a fair and balanced journalist. Hes asking the questions to represent them. Hes going to ask the person whatever is necessary to push the agenda for a more fair society, for a more inclusive society and for the Hispanic community to be better.\", kate.linthicum@latimes.com, Twitter:@katelinthicum]", "Date": "20150706", "Author": "[Kate Linthicum]", "Link": "http://www.latimes.com/nation/immigration/la-na-latino-media-20150704-story.html", "Title": "[Latino media double down on immigration advocacy, and GOP candidates aren't pleased]"}