{"Content": "[ To the editor: The U. S. Supreme Court has countenanced Republicans partisan dismantling of the Voting Rights Act, and Andrew Cohen rightly excoriates the justices specious reasoning. (\"Shame on Texas and the U.S. Supreme Court,\" Op-Ed, Oct. 22), The high courts refusal to halt implementation of Texas voter identification law, like its decision in last years Shelby County vs. Holder case, flouts venerable constitutional precepts. But those rulings are consistent with the courts denial of relief sought by Al Gore in Floridas 2000 election debacle, which in effect handed George W. Bush the presidency. Theres little question but that the courts conservative majority sees no problem with rigging voting procedures to disenfranchise those inclined to vote against Republican candidates. Thats quite a judicial legacy, one that history will judge harshly. Gloria Martel, Los Angeles, .. To the editor: Cohen says the Texas voter ID law \"runs afoul of constitutional norms and reasonable standards of justice\" and disenfranchises \"poor voters, or ill ones, or the elderly or blacks or Latinos  all likely Democratic voters,\" and is \"blatantly discriminatory,\" but he fails to show why this is so. Ive practiced law for more than 30 years, taught constitutional law for 10 and even served on the board of the American Civil Liberties Union, and I fail to understand why obtaining a simple government-issued photo ID, which I and everyone must show to use for everyday tasks, is disenfranchising. In California, even illegal immigrants can get drivers licenses, and elderly voters can get ID cards at the DMV. Why is this so especially difficult for people in Texas? If the Democratic Party is worried, it should assist needy voters in getting IDs. There is no constitutional norm saying that a state may not require a person voting to present a modicum of evidence that they are who they say they are. Carl Pearlston, Torrance, Follow the Opinion section on Twitter @latimesopinion]", "Date": "20141026", "Author": "NULL", "Link": "http://www.latimes.com/opinion/readersreact/la-le-1026-sunday-texas-voting-20141026-story.html", "Title": "[Voting rights decisions threaten the Roberts court's legacy]"}