{"Content": "[ Leading candidates for the Republican presidential nomination split sharply Sunday on the same question that tripped up Jeb Bush last week: Was invading Iraq a mistake?, No, said Sen. Marco Rubio (R-Fla.): The 2003 invasion was the right decision because President George W. Bush had intelligence findings indicating that Iraq had weapons of mass destruction. Bush wasnt dealing with a Nobel Prize winner. He was dealing with Saddam Hussein, Rubio said. And he made the right decision based on the information he had at that time. At the other end of the GOP spectrum, Kentucky Sen. Rand Paul stopped just short of saying that the U.S. would have done better to leave Hussein in power. He questioned whether toppling secular dictators in the Mideast had helped or hurt U.S. interests. I think when Hussein was toppled, we got chaos, Paul said. We still have chaos in Iraq. I think it emboldened Iran, he added. We now have the rise of radical Islam in Iraq as well. A third potential candidate, Wisconsin Gov. Scott Walker, took a position closer to Rubio than Paul. I think any president, regardless of party, probably would have made a similar decision to what President Bush did at the time with the information that he had available, Walker said. Knowing what we know now, I think its safe for many of us, myself included, to say we probably wouldnt have taken that tack to launch an invasion, he said. Jeb Bush, the former Florida governor, spent much of last week revising answers to the question of whether he agreed with his older brothers decision in 2003 to invade Iraq. After first saying yes, then calling the question hypothetical, he eventually settled on this answer:, If were all supposed to answer hypothetical questions knowing what we know now, what would you have done, I would have not engaged, I would not have gone into Iraq. Bushs shifting responses drew dismayed comments from Republican activists who said he seemed unprepared for an obvious question. While most of the potential candidates have focused on what they characterize as an intelligence failure in the prewar assessments of Iraqs weapons program, Pauls question about whether overthrowing dictators is a good idea involves a deeper disagreement with longtime GOP foreign policy. He has raised similar questions about U.S. policy toward Syria, where the Obama administration is, at least officially, committed to seeing President Bashar Assad removed from power. Paul has several times made the point that although Assad is a dictator, he has fought against Islamic radicals and defended the interests of Syrian Christians. Rubio, by contrast, has joined many other Republicans in chastising the administration for not doing more to overthrow Assad. On Sunday, he repeated his call for the U.S. to take a more muscular approach, saying the administration should find a group on the ground in Syria that we could work with. Rubio made his remarks on Fox News Sunday; Paul was interviewed on NBCs Meet the Press; Walker was interviewed on CBS Face the Nation. The three also differed in how they analyzed negotiations with Iran over its nuclear program. Paul, asked if he would consider using military force against a country trying to develop a nuclear weapons program, said the U.S. always should have the threat of military force behind diplomacy. But I would prefer diplomacy. I think we can still have negotiations, he said. We negotiated with the Soviets for 70 years, and we ended up coming to a peaceful outcome. My hope is really that negotiations continue, he said. There are some in my party who say, Oh, I dont want any negotiations. Theyre ready to be done with it, he added. But once youre done with negotiations, the choices are war, or they get a weapon, and I dont wanna have just those two binary choices. Rubio disagreed. The outlines of negotiations to contain Irans nuclear programs are much worse than anybody anticipated, he said. And, in fact, every time theres a new revelation about the deal, it gets worse and worse and worse. Walker said that any agreement with Iran must include full dismantling of what he characterized as its illicit nuclear infrastructure, which he said was a real threat to Israel as well as the U.S. allies among the Arab states of the Persian Gulf. The deal the administration has been negotiating with Iran would put new limits on what Iran can do with its nuclear facilities and would impose new inspections on them, but would not dismantle them. Not surprisingly, the one area on which all three would-be nominees agreed was in criticizing former Secretary of State Hillary Rodham Clinton, the likely Democratic candidate. If she ever takes questions, reporters should ask Clinton, Was it a good idea to invade Libya? during Obamas first term, Paul said. Did that make us less safe? Did it make it more chaotic? Did it allow radical Islam and ISIS to grow stronger?, I think the war in Iraq is a good question, he said, but so is the question of Should we have gone into Libya? , Rubio criticized Clinton for her position on Iraq during the latter part of the Bush presidency. We dont know how she justifies, for example, not supporting the surge in Iraq and these sorts of other things, he said. Clinton, who was a senator from New York at the time, opposed the 2007 surge. Paul, asked about surveillance provision of the Patriot Act, which is scheduled to expire at the end of this month, noted that a federal appeals court in New York earlier this month had ruled that the governments collection of records of U.S. telephone calls was illegal. So really, it oughta stop. You can catch terrorists, he said. Judges will grant warrants when investigators have a specific person they want to pursue, he said. The Senate is to take up the Patriot Act this week. Senate Majority Leader Mitch McConnell has called for an extension of the surveillance provisions through the end of July to give Congress more time to work on replacement legislation. Paul did not say whether he would attempt to block such an extension by a filibuster.]", "Date": "20150517", "Author": "[Katherine Skiba]", "Link": "http://www.latimes.com/nation/la-na-gop-iraq-20150517-story.html", "Title": "[GOP hopefuls debate: Was Iraq a mistake?]"}