{"Content": "[ Former Los Angeles Mayor Antonio Villaraigosa is not yet a candidate for U.S. Senate, and he might still skip the race altogether. But state Atty. Gen. Kamala Harris made clear Monday that her Senate campaign team sees Villaraigosa, at least for now, as her chief rival in the June 2016 primary. Villaraigosas candidacy, should he decide to run, would be premised on strong support from Latinos in Southern California to offset Harriss support in the Bay Area. She is a former San Francisco district attorney. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... On Monday, Harris turned her focus to immigration, with some help from the White House. Unlike Villaraigosa, who was a key supporter ofHillary Rodham Clintonin the 2008 presidential race, Harris was one of President Obamas earliest California supporters. That might help explain why the White House invited Harris to participate Monday in a conference call with reporters to promote Obamas immigration agenda -- and in the process try to buttress her standing among Latinos. Many immigrants who are in the country illegally fear reporting crime to law enforcement, she said, and Obamas plans would strengthen trust between police and the public. She criticizedRepublicans for resisting his effort to legalize the status of millions of immigrants. Congressional Republicans should stop playing politics with our national security, said Harris, who proclaimed in Spanish on Twitter a while later that immigration reform was a key civil rights issue. Harris helped Obama raise money in San Francisco when he ran for U.S. Senate in 2004. She was a California co-chair of his 2008 campaign and national co-chair of his 2012 campaign. White House spokesman Eric Schultz declined to comment on the political dimension of picking Harris to promote Obamas plans. Were not going to have anything to say on the politics here, he said. The latest endorsement of Harris candidacy also appeared aimed at Villaraigosa: It came from Los Angeles City Council President Herb Wesson, a longtime political ally of the former mayor who worked closely with him at City Hall. Wesson and Villaraigosa are both former state Assembly speakers. In an interview on Monday, Wesson said Villaraigosa would make a very good senator, but hed known Harris for about 15 years and thought she was best for the Senate. Part of the appeal, he said, is that Harris would be Californias first African American senator. Her mother was from India, her father from Jamaica. I have a track record of supporting things that eliminate barriers, and I think this would be another historic first,\" Wesson said. Left unmentioned: Villaraigosa would be Californias first Latino in the U.S. Senate. When Villaraigosa was elected mayor in 2005, black voters were a key source of support. If other African American political leaders in Los Angeles follow Wessons lead in backing Harris, that could spell trouble for the former mayor. Twitter: @finneganLAT]", "Date": "20150126", "Author": "[Michael Finnegan]", "Link": "http://www.latimes.com/local/political/la-me-pc-harris-villaraigosa-20150126-story.html", "Title": "[Harris shadow-boxing Villaraigosa in Senate race]"}