{"Content": "[ Former Florida Gov. Jeb Bush announced Tuesday that he has decided to \"actively explore\" a 2016 presidential run and will create a political action committee next month to help \"facilitate conversations with citizens across America.\", \"The PACs purpose will be to support leaders, ideas and policies that will expand opportunity and prosperity for all Americans,\" Bush wrote in a Facebook post. \"In the coming months, I hope to visit with many of you and have a conversation about restoring the promise of America.\", For several months, Bush,the brother of former President George W. Bush and son of former President George H.W. Bush, has said hes been weighing a run for the Republican presidential nomination in 2016. Tuesdays announcement, which was also published by the 61-year-old Bush on Twitter, comes a day after he spoke at the commencement ceremony for the University of South Carolina -- located in an early presidential primary state. Bush has made a host of other moves to make a potential candidacy more visible, such as a television interview last weekend in which he announced that he planned to write an e-book on his governorship. He also recently announced that he would release 250,000 emails from his tenure as Floridas chief executive. Although the establishment GOP considers Bush a top-tier candidate, he has drawn ire from others in the party for supporting comprehensive immigration reform and Common Core, the national education standards for K-12 students that are being implemented in dozens of states. New Jersey Gov. Chris Christie, who has also expressed interest in a presidential run, is another favorite of establishment Republicans. Throughout the 2014 election cycle, Bush headlined fundraisers for Republicans and made several campaign appearances. Earlier this month, Ohio Sen. Rob Portman, a close Bush ally, announced that he would not run for president. Bushs announcement prompted an immediate response from Democrats: This what hes been doing all along? I dont know what the difference is between thinking about running and actively exploring running, but I suspect it has a lot to do with keeping his name in the news, Democratic National Committee spokesman Mo Elleithee said in a statement. Follow @kurtisaleeand emailkurtis.lee@latimes.com, 8:57 a.m. This article has been updated with additional background on Bush. 8:07 a.m.: This article has been updated with a comment from the Democratic National Committee. This article was originally published at 7:39 a.m.]", "Date": "20141216", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-jeb-bush-2016-presidential-run-20141216-story.html", "Title": "[Jeb Bush to 'actively explore' presidential run ]"}