{"Content": "[ A second Democrat has joined the race to succeed Rep. Janice Hahn (D-San Pedro), who will give up her House seat next year to run for Los Angeles County supervisor. The new entrant into what is now a two-person field is Hermosa Beach City Councilwoman Nanette Barragan. Barragan, an attorney, was elected to the City Council in 2013 in the midst of a nasty battle over a local oil-drilling proposal that voters ultimately defeated. She does not live in the district she seeks to represent--allowable in House races--but said in announcing her campaign Tuesday that she grew up in the district, the 44th. Also running to succeed Hahn is state Sen. Isadore Hall (D-Compton), who announced his candidacy as soon as Hahn said she wouldnt seek reelection. Hall, 43, has collectedscores of endorsements from local elected officials--including that of Hahn-- and from labor and community activists. Barragan, 38, made her announcement on \"equal pay day,\" which she said \"clearly illustrates how much more work needs to be done to make sure that everyone is treated fairly.\", She added that \"ensuring women get paid the same as men who do the same work will be a pillar of my campaign.\", Born in the U.S. to immigrants from Mexico, Barragan was raised in the Carson area and emphasized her district roots in her campaign announcement. The 44th District stretches north from the port communities near the Los Angeles Harbor through Walnut Park and Southgate and includes Compton and Willowbrook. Latinos make up about half of district voters and African Americans about a quarter, according to the nonpartisan California Target Book, which tracks races for the House and Legislature. Democrats hold a 62% to 11% registration edge over Republicans, andmore than a fifthof voters are not registered with a political party.  Follow @jeanmerl for the latest in Southern California politics news.]", "Date": "20150414", "Author": "[Jean Merl]", "Link": "http://www.latimes.com/local/political/la-me-pc-nanette-barragan-congress-20150414-story.html", "Title": "[Hermosa Beach official joins 2016 race to succeed Rep. Janice Hahn]"}