{"Content": "[ The 2016 presidential election is attracting an unusually large number of hopefuls. The Republicans will probably field more than a dozen candidates and the Democrats, as many as five. Presently, very few of these supposed contenders have a real chance of becoming president. Republicans Ben Carson, Carly Fiorina and Ted Cruz are long shots. On the Democratic side, that term applies to everyone but Hillary Rodham Clinton. But the size of the crowd isnt terribly surprising; if anything I thought it might be even larger. The barriers to entry are low, and all a candidate needs to keep going, at least in this preliminary stage, is money. That isnt so hard to find anymore given Internet fundraising and the seemingly endless supply of mega-rich patrons who funnel their wealth through super PACs. Money breeds media attention breeds more money. For registered Democrats and Republicans, it is easy to get on primary ballots and easy to succumb to flattery. Why, Sen. Rubio, you are a youthful fresh face, possessing humble immigrant beginnings. You are the embodiment of the American dream, and you come across well on television. You attract rich patrons. You could go all the way. No one in his circle of admirers would call him a rookie. On the Democratic side, Clinton is way ahead in the polls, leaving Sen. Bernie Sanders, former Gov. Martin OMalley, former Sen. Jim Webb and former Gov. Lincoln Chafee in the low single digits. If you tell them in private, You do not have a chance to be president, they will point to underdogs who won, such as Jimmy Carter or Ronald Reagan, or front-runners who faltered  such as Clinton herself in 2008. They all harbor the belief that they can catch fire, especially during the primary debates. They know that Clinton could falter yet again; if so, they will be ready. Short of winning the presidency, however, there are many other rewards for running. You can fatten your mailing list and your Rolodex for future opportunities. These can include lucrative jobs, retainers, paid speeches or book advances. After 2008, former Gov. Mike Huckabee made it to Fox News and, by staying in the limelight, set himself up for a second run. Of course, these candidates will claim, some truthfully, that what they really want is for daily audiences to absorb their strongly held convictions and policy ideas. What better way to make yourself heard than a presidential candidacy? All you have to do is show up and talk every day. The media will listen  at least if you have the money and belong to one of the major parties. If these candidates had distinct agendas challenging entrenched crony corporate power or citizen-disempowerment policies, they could enrich immeasurably the campaigns and bring out more demanding voters with higher expectation levels. Alas, Sanders may be the only major-party candidate who actually advances Main Street over Wall Street. The others do little more than replicate their partys line, albeit garnished with different slogans and labels. Fiorina has run a big business, poorly. Carson is known as a pioneering surgeon on a surgical Washington mission. Jeb Bush, Rick Perry and Scott Walker want to lead America as they have governed Florida, Texas and Wisconsin, respectively, leaving no powerful corporations behind. Rick Santorum is freedoms tribune (though he favors a slightly higher minimum wage), and beleaguered Chris Christie is trying to re-create the image of a governor who gets things done. At least Rand Paul offers something a little different, but hes already showing signs of backtracking. Hes a conservative pulling back on empire, averse to corporate welfare and the defense of civil liberties  at least for now. Meanwhile, Clinton, the Democratic flag-bearer, spouts thinly veiled progressive rhetoric while keeping intact her core credentials as a corporatist and militarist. Thus far, the media is covering the candidates personal stories and will continue to mine biographical details, while waiting for gaffes, a self-destructive lapse or supposed scandal. The media will pretend that minor policy differences amount to different visions for how to lead the country. Taken as a whole, it is all so rancid. All this dreariness comes down to who is more likable with the most TV ads and superior campaign staff. The voters see themselves as mere spectators, grumbling along the way. They cant seem to make the candidates react to their needs. Theyre bored, and boredom often turns into cynicism and withdrawal (voters become nonvoters). When people have low expectations of politicians, the politicians will oblige them. Is there a way out of the cycle? Certainly the media could do better. The media love to cover horse races, especially when there is no clear front-runner in the polls. It loves patsy interviews filled with tactical questions that invite tactical answers. It hates to cover third-party candidates. Reporters think thats pointless, because those candidates have no chance. But as long as the media are covering candidates within the two major parties who will not be president, such as Fiorina, why not also cover candidates outside the duopoly who will not be president, such as Jill Stein of the Green Party? Third-party candidates can advance important agendas ignored by the mainstream  but which may have majoritarian support, either now or in the future  as they did in the 19th and early 20th centuries. Who first put forth issues such as the abolition of slavery, womens right to vote, social security, farm and labor reforms? Little third parties, of course, that never won a national election. Ralph Nader, a four-time candidate for president of the United States, is the author of \"Unstoppable: The Emerging Left-Right Alliance to Dismantle the Corporate State.\", Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150515", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0517-nader-longshot-candidates-20150515-story.html", "Title": "[ Ralph Nader: Why run for president if you don't have a real chance?]"}