{"Content": "[ Everyone has a favorite Vincent Bugliosi book, especially those who dont like George W. Bush. That best sums up the reader reaction to the legendary Manson family prosecutors death last Saturday at the age of 80. That trial, which took place in Los Angeles, made Bugliosi an outsized figure in the history of crime in L.A. so The Times obituary rightly made extensive mention of his book \"Helter Skelter.\", Several readers, one of whose letters was published Thursday, wrote to say that The Times should have focused more closely on Bugliosis later works, especially his two books that judge the Bush presidency harshly. Others praised his tomes on the assassination of President Kennedy and the existence of God. Gerald P. Lunderville of Long Beach wanted to see Bugliosi and Bush in court:, Im pleased The Times obituary mentioned Bugliosis insightful book, \"Divinity of Doubt: The God Question.\", However, nothing was said about Bugliosis 2008 masterful expose, \"The Prosecution of George W. Bush For Murder,\" a book as well-written as \"Helter Skelter\" and his questioning of God. Unfortunately, we never got to see Bugliosi prosecute Bush in court. San Diego resident Neal Matthews praises Bugliosis work on the Kennedy assassination: , Your obituary neglected to mention not only Bugliosis incisive book on the 2000 presidential \"election,\" but it also made only a brief reference to his magnum opus, \"Reclaiming History: The Assassination of President John F. Kennedy.\", Your own reviewer called it a masterpiece. The book took 20 years for Bugliosi to research and write, and its 1,600-plus pages once and for all put to rest the question of whether Lee Harvey Oswald acted alone. Milton Chapman of Palm Desert also goes after Bush:, Reader Cort Casady writes in the June 11 edition that Vincent Bugliosis book \"The Betrayal of America\" was not mentioned in the obituary. Another book not mentioned was \"The Prosecution of George W. Bush for Murder.\" Both books needed to be more popular than they were. Not only have we lost a great American but we didnt pay enough attention to him when he was here. Ironically, the letter to the editor following Casadys was about the idiocy of still being in Iraq. Bugliosi was my hero. Ill always have his books. Los Angeles resident Harold G. Schick Jr weighs in on Bushs behalf:, I must demur on the letter writers statement that Bush stole the 2000 presidential election. An independent, nonpartisan government commission found no fraud in Bushs winning, and later investigations showed that he would have won anyway had the limited recount gone forward. Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150612", "Author": "[Paul Thornton]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-0613-bugliosi-bush-books-20150613-story.html", "Title": "[Don't forget Vincent Bugliosi's works on the George W. Bush presidency, readers say]"}