{"Content": "[ On paper, Jeb Bush is the perfect establishment candidate for the Republican presidential nomination:, A two-term governor of a crucial swing state who oversaw economic expansion and spearheaded education reform. A conservative, but with a cerebral, optimistic tone that probably wont enrage moderate voters, unlike the unabashed social-issue warriors in the GOP field. A prolific fundraiser whose advantage stems from the powerful donor networks of his brother, former President George W. Bush, and his father, former President George H.W. Bush. Yet the former Florida governor  for all his might on paper  has failed to catch on with Republican voters. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, In recent weeks, his strongest showing was in the low double digits in polls both nationally and in the states that hold the first contests in the 2016 race for the White House. A CNN/ORC poll taken in Iowa and released Wednesday showed Bush with 5% support compared with front-runner Donald Trumps 22%. Bush and his campaign profess to be unconcerned, and are convinced that Trumps front-runner status will be as ephemeral as the early leads enjoyed by Newt Gingrich, Michele Bachmann and Herman Cain in the 2012 cycle. Bush, who has referred to himself as the \"joyful tortoise\" in the race for the GOP nomination, brushed aside recent polls as irrelevant. \"Ill remind you that my dad in 1980 was probably an asterisk at this point,\" Bush said at the Iowa State Fair on Friday. The elder Bush won the Iowa caucuses in 1980 but ultimately lost the nomination. \"And last time around, there were candidates that were winning at this point that never even made it to the starting line,\" Bush said. Several factors are contributing to Bushs inability to break out: the crowded field of 17 candidates. The unexpected and sustained rise of Trump. Bushs positions on immigration and Common Core education standards, which are at odds with the most conservative voters. The double-edged sword of his last name. And a lack of heavy stumping in the early states, where voters demand numerous intimate meetings. Dennis Albaugh, an Iowa billionaire who has donated to Bush, said the candidate needed to be more aggressive. \"It doesnt look good right now,\" said Albaugh, who hosted an event  set amid his massive collection of classic Chevrolets  that Bush headlined Thursday in Ankeny, Iowa. \"I think that hes got to get on track.\", Al Cardenas, a longtime Bush advisor and fundraiser, said Bushs natural advantages would ultimately propel him forward once the election gets closer. \"During this curiosity stage, outsiders, newer faces in the national scene are an attractive option till voters start getting very serious,\" he said. \"This very serious stage will probably begin in late October, November.\", Bush has the resources to sustain a long, multi-state strategy. Many of his rivals do not. \"Its a long haul,\" Bush said. \"Were just at the beginning of this.\", The former governor has also raised concerns because he has faltered in venues where he should shine, most recently the first Republican debate in Cleveland. Critics blame his lackluster performance on rustiness from not campaigning for more than a decade; supporters argue it is driven by his introverted nature and will improve with practice. \"He didnt stand out,\" said Doug Gross, a Des Moines attorney who was the Iowa finance chairman for George W. Bushs 2004 reelection campaign. Most of his responses \"were relatively ineffective and not memorable.\", Bush, who has largely spent this year fundraising, and a super PAC backing his candidacy are ramping up their wooing of voters. The Right to Rise USA Super PAC, which can accept unlimited donations, will buy $10 million of ad time in Iowa, New Hampshire and South Carolina on Monday, according to the Associated Press. Bushs staff says his increased presence on the campaign trail is not in response to the low poll numbers, but instead is dictated by the natural contours of the electoral cycle. \"The closer you get to the voting contests, the more time you spend talking to voters,\" said a top Bush advisor who soughtanonymity before agreeing to speak about the campaigns strategy. \"We had an early fundraising push. Now were focused on trying to strike a balance between the early states, the big delegate states and finance events.\", The advisor added: \"Hes going to be campaigning to win, and that means you have got to go everywhere and go hard at it.\", To that end, Bush crammed in six appearances in three states over four days last week:, On Tuesday, he delivered a foreign policy speech at the Ronald Reagan Presidential Library, arguing that the withdrawal of troops from Iraq led to the rise of Islamic State. The next day he rolled out endorsements from Sens. Dean Heller of Nevada and Orrin G. Hatch of Utah at a rally in Reno, followed by a town hall meeting in North Las Vegas. On Thursday, Bush spoke about national security at a forum in Davenport, Iowa, and then at a county GOP fundraiser in Ankeny. On Friday, wearing cowboy boots embroidered with his name, Bush hit the Iowa State Fair. He ditched his Paleo diet and nibbled on a deep-fried Snickers bar, sipped mid-morning beer and flipped pork chops at a grill. Bush has spent much of his time on the campaign trail trying to establish an identity separate from his father and brother. But his brothers shadow  and the unpopular Iraq war he launched in 2003  looms everywhere. At the Des Moines Register Soapbox at the fair, where candidates traditionally take the stage and talk to voters for 20 minutes, someone reminded Bush on Friday that his brother signed the agreement for combat troops to leave Iraq by the end of 2011. Bush responded that the agreement was expected to be modified. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, Supporters, such as Ronald Fodor, the mayor of Slippery Rock, Pa. worry that voters may be wary of a third Bush presidency. Fodor had reason to be upbeat after seeing Bushs appearance at the Soapbox, where the candidate stood near bales of hay taking questions from voters. \"He was more enthusiastic than he was in the debate, and I thought he had some very good answers to the questions, and he seemed very prepared and he seemed very presidential,\" Fodor said. Such retail politicking is key if Bush wants to improve his standing in Iowa, said Sen. Joni Ernst (R-Iowa), who is neutral in the race and accompanied Bush at the fair. \"Get out across the state and meet the voters and really show what his ideas are and that he can be a leader. He should do the full Grassley!\" Ernst said, referring to senior Iowa Sen. Charles E. Grassleys tradition of visiting each of the states 99 counties every year. Bush hasnt shied away from taking a jab at his standing in Iowa. As he wrapped up his speech at the Reagan Library in Simi Valley, the audience warmly applauded his proposal to fight Islamic State and his sharp attacks on Democratic front-runner Hillary Rodham Clinton. Bush asked the crowd of 1,000: \"Can you all move to Iowa?\", Twitter: @LATSeema, MORE POLITICS COVERAGE:, Trump details immigration plan, including mass deportation, and backs ground troops in Iraq, Democratic candidates sound off at Wing Ding in Iowa, The populist sentiment fueling both the Bernie Sanders and Donald Trump campaigns]", "Date": "20150817", "Author": "[Seema Mehta]", "Link": "http://www.latimes.com/nation/politics/la-na-jeb-bush-20150817-story.html", "Title": "[Jeb Bush, seemingly perfect on paper, just hasn't caught on with GOP voters]"}