{"Content": "[ Illegal immigration is always a sizzling topic on Tony Beams conservative call-in radio show in this small Bible Belt city. \"Usually all I have to do is say the word and the phones start ringing,\" Beam said. Sure enough, the lines lighted up on a recent morning when he mentioned a proposal by Republican presidential candidate Ben Carson to offer work permits to immigrants in the country illegally. \"You have to deport them,\" seethed a caller named Alex, who dubbed Carsons proposal weak. \"Theyre changing our country.\", As Wednesday nights debate showed, such hard-line views among conservative voters have created a stark divide among GOP presidential candidates, most of whom will head here Friday for a forum sponsored by the conservative group Heritage Action. Many Republican leaders had moved to the right on immigration even before Donald Trump made the issue the centerpiece of his campaign. Those who opt for more moderate approaches have faced backlash from the party base. But while Republicans must answer to far-right voters now, they also face a future electoral force  one just coming into focus in parts of Greenville, a city of about 60,000 nestled in the foothills of the Blue Ridge Mountains. In some neighborhoods here, strip malls have been transformed by cafes, carnicerias (meat markets) and hair salons catering to the regions rapidly growing Latino population, which increased 866% between 1990 and 2013. South Carolinas upstate region, where Greenville is located, is a microcosm of the dramatic demographic shift happening across the country, where an estimated 28 million Latinos will be eligible to vote in next years presidential election. Although Latinos here and elsewhere share many conservative social values with Republicans, their support for a fix to an immigration system widely viewed as broken is in conflict with a conservative constituency that largely opposes citizenship for immigrants in the country illegally. How Republicans negotiate the competing pressures could determine the outcome of the partys primary and the 2016 general election. The conflict was visible during the Republican debate, in which Carson, Jeb Bush and Marco Rubio cautiously sought to put some distance between the harsh immigration proposals that have dominated Trumps presidential campaign and their own softer approaches. \"I want to build a wall  a wall that works,\" said Trump, who has called for mass deportations and vowed to stop issuing birthright citizenship to children born to mothers in the country without legal status. \"To build a wall, and to deport people ... would cost hundreds of billions of dollars,\" Bush countered. \"It would destroy community life; it would tear families apart.\", It was the kind of overture that Republicans like the Rev. Jim Goodroe, the missions director for a network of Southern Baptist churches in upstate South Carolina, would like to hear more of. \"The Republican Party cannot continue to be seen as anti-Hispanic, or itll eventually be voted out of here,\" said Goodroe, whose network includes dozens of Latino churches and who supports a path to citizenship for the estimated 11 million immigrants in the country illegally. But moderate proposals on immigration  including Bushs plan to offer legal status but not citizenship to many in the U.S. illegally  turn off conservative party activists like Kerry Wood, who helped found a tea party group in nearby Spartanburg. \"If somebodys not willing to support our border, theres no way Im voting for them,\" said Wood, who is leaning toward voting for Trump in South Carolinas important early primary in March. Wood, who supported a state law that allowed police officers to check the immigration status of people they stopped, said conservatives wouldnt need to worry about the Latino vote if they took a stronger position on immigration. \"If they were to give the base what they wanted, theyd turn out in huge numbers,\" Wood said. After Republican nominee Mitt Romney lost the 2012 election to President Obama, Republican leaders wrote a postmortem that called for broadening the partys appeal to Latinos, many of whom are religious and embrace conservative social beliefs. In upstate South Carolina, where many Latinos speak English with a Southern drawl, both parties have reached out to Latino leaders about grooming future candidates, even though Latinos still make up only 2% of the states eligible voters. But polls show Republicans intransigence on immigration has turned many Latinos away from the GOP. Its a dilemma faced by 28-year-old Eric Guerrero. An evangelical Christian who plays the guitar at a weekly Spanish-language worship service, Guerrero says he shares many Republican values. He voted for John McCain in 2008 and Romney in 2012 largely because he disagrees with Democrats on abortion and gay marriage. But Trumps anti-immigrant rhetoric this summer has Guerrero, who was born in Mexico and became a U.S. citizen as a teenager, in a state of limbo. \"I have family who is not legal,\" he said. \"Its hard if youre Hispanic, because you dont want to go against your people.\", Ivan Segura, president of the Council of Mexicans in the Carolinas, an advocacy group, says he believes immigrants are being scapegoated by Republicans like Trump in order to win votes. \"Theyre trying to secure their base, even if that means theyre going to have to get out and make the immigrants look like the devil,\" Segura said. In this conservative part of the country, where as of this summer the Confederate flag no longer flies outside the State House but \"American-owned\" signs hang in store windows, anyone seen as sympathetic to immigrants in the country without legal status faces potential blowback. Just ask Lindsey Graham, the South Carolina senator and presidential candidate who faced six challengers for his reelection last year and taunts of \"Grahamnesty\" after he helped write a bill that would have provided a path to citizenship for some of those in the country illegally. \"Theres definitely anxiety,\" said Beam, the conservative talk show host. \"Hispanics coming into America are willing to work for less and Americans are threatened by that.\", But, as Beam acknowledged, Latinos are a demographic that Republicans may not be able to ignore, with some 800,000 Latinos turning 18 every year. \"If we end up as a political party with single digits of the Hispanic vote ... going forward, thats going to have a huge impact on electability,\" he said. Yolanda Pardo, a legal permanent resident from Colombia who runs a small store in Greenville, one of 6,000 Latino-owned businesses in the state, said her 17-year-old U.S. citizen daughter will be eligible to vote for the first time next year. \"Shes already said shes voting for Hillary,\" said Pardo, who hopes to become a naturalized citizen so she can also vote for Clinton, the Democratic front-runner. Although Latinos may not have the ear of candidates now, that will change in time, she said: \"Were going to have a bigger voice.\"]", "Date": "20150918", "Author": "[Kate Linthicum]", "Link": "http://www.latimes.com/nation/politics/la-na-latinos-gop-20150918-story.html", "Title": "[GOP's immigration dilemma comes to South Carolina: Hard line now may cost Latino votes later]"}