{"Content": "[ Despite promises that it wouldnt come to this, Congress and the White House are charging toward another government shutdown. The next fiscal crisis could come as soon as Oct. 1 unless a new government spending plan is approved. But with House members having left Wednesday for summer recess and senators soon to follow, that leaves only about 10 legislative days next month to fix the problem, and there are no viable solutions in sight. President Obama has signaled his intention to bust, once and for all, the severe 2011 spending caps known as sequestration. Hes vowed to reject any GOP-backed appropriation bills that increase government funding for the military without also boosting domestic programs important to Democrats such as Head Start for preschoolers. The Republican-controlled Congress is also digging in. Since taking control in January, GOP leaders had promised to run Congress responsibly and prevent another shutdown like the one in 2013, but their spending proposals are defying the presidents veto threat by bolstering defense accounts and leaving social-welfare programs to be slashed. The 2016 presidential race is compounding the problem. Several Republican senators vying for the party nomination are hoping to use the budget process to grab headlines and push their agendas, including Kentucky Sen. Rand Pauls campaign to defund Planned Parenthood and Texas Sen. Ted Cruzs attempt to stop the nuclear deal with Iran. House Republicans want to overturn Obamas immigration actions. Any such policy rider attached to a budget would be deal-breakers. Republican leaders are resigned to a showdown. House Speaker John A. Boehner (R-Ohio) on Wednesday allowed his majority to leave a day early for the long August recess, predicting Congress would have little choice next month but to pass a short-term budget extension to keep the government open. Well deal with it in September, he said. And its not just the budget. A major highway-funding program is on a temporary fix that runs out Oct. 29. And the nations debt ceiling will need to be lifted by late fall to avoid a damaging credit default. The confluence of these deadlines raises the prospects for an all-encompassing year-end accord that could resolve all or most of the issues, but it also increases the risk of a crisis; there has been no visible progress toward any big budget deal. We know its coming, said Sen. John Cornyn (R-Texas), the majority whip. Were going to leave that fight until September, October, November, December. Obama, in a private meeting with Democrats at the White House in early July, called on the partys senators to filibuster the GOPs spending bills and prevent him from having to veto them. While many of the Republican bills have passed the House, they have not yet been put fully to the test in the Senate. Only a defense spending bill has come up for a Senate vote, and it was filibustered. Democrats are portraying Republicans as skirting their responsibilities, recalling the highly unpopular 16-day government shutdown in 2013 when Cruz led Republicans in a failed attempt to repeal the Affordable Care Act. We know that Republicans are experienced in shutting down the government, said Senate Minority Leader Harry Reid (D-Nev.). It has been clear for months that the only way Congress will arrive at a responsible budget is by Republicans and Democrats, Senate and House, sitting down together and finding a path forward. Now is the time to negotiate. Not in September, not in October  now. The fiscal impasse is infuriating to some lawmakers because it is preventable. It has been long understood that at the end of the fiscal year on Sept. 30, a fresh round of sequester cuts is due to take effect, cutting into virtually all areas of government spending. The cuts were reluctantly agreed to as a last-ditch solution to the 2011 budget impasse between Obama and Boehner after Republicans took control of the House. A subsequent bipartisan deal in 2013 staved off the most painful reductions until this fall, but lawmakers have waited until the last minute to address the problem. Thats the way everything around here works, said Sen. Jim Risch (R-Idaho). Its like a marriage or a business or anything else  money is always an issue. Republicans and Democrats are hard-wired differently when it comes to money. With new Republican majorities, the House and Senate passed budget blueprints this year, but the appropriation bills required to put those fiscal goals into action are nowhere near becoming law because of the parties differing priorities. Boehner was forced to halt consideration of his partys bills after the shooting of nine black churchgoers in South Carolina sparked a national debate over public displays of the Confederate battle flag. Southern-state Republicans tried to add protections for the flag to the spending bills, but other lawmakers objected. The speaker announced last week that the best option would be for Congress to pursue a stopgap resolution to keep the government running from Oct. 1 until a broader agreement could be reached. But even approving a temporary spending measure could prove difficult if lawmakers try to use it as a vehicle for other pursuits. Rep. Tim Huelskamp (R-Kan.), a conservative lawmaker who often bucks Republican leadership, said passing a short-term measure was going to be really difficult without votes on other issues. And the longer the government shutdown threat lingers, the more it becomes tangled in other year-end deadlines. The Treasury Department has said that Congress will need to raise the nations debt limit to continue paying the bills  always a controversial vote for lawmakers in recent years, especially as the debt load now tops $18 trillion. At the same time, lawmakers face a vote next month on the multinational nuclear agreement with Iran, and in September they will host Pope Francis, who will be the first pontiff to address Congress. Asked what lawmakers were doing to avoid fiscal stalemate, House Majority Leader Kevin McCarthy (R-Bakersfield) blamed the minority party, saying that the Democrats want to shut the government down, but thats not the place were going. Pressed on whether there was a plan to prevent that outcome, McCarthy demurred. I dont know of any talks, he said. lisa.mascaro@latimes.com, Twitter: @lisamascaro, 8:40 p.m.: This report has been revised throughout for additional details and for clarity. The original version posted at9:10 a.m.]", "Date": "20150730", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/la-na-budget-standoff-20150730-story.html", "Title": "[Washington's fight over the budget might shut down the government again]"}