{"Content": "[ Maybe its time the state Legislature took a page from the courts, which dont waste their time on disputes that have already been settled. On Monday, a group of Republican legislators said they planned to propose an amendment to the state Constitution this week to bar state-funded community colleges, colleges and universities from banning the U.S. flag on their property. The ripped-from-the-headlines proposal was prompted by an ill-considered move by half a dozen UC Irvine students to take down the flag displayed in a small lobby the student government shares with a few other student organizations, such as the yearbook staff. According to the campus newspaper, the move was prompted by complaints from students who were somehow discomfited by the presence of the flag in the lobby. Dont get distracted, just keep reading. The students, who serve on a student legislative body at UCI, didnt have final say on how their offices would be decorated, however. Their initiative was quickly vetoed by an even smaller group of student officials who oversee them, including the president of the Associated Students of UC Irvine. So, to sum up, you had a handful of UCI students making a decision that had the potential to rile alumni and taxpayers across the state, only to have cooler heads prevail. End of story, right?, Not according to Sen. Janet Nguyen (R-Garden Grove), Senate Republican leader Robert Huff of Diamond Bar and a cadre of other Orange County pols. They want to put a measure in front of voters in the next general election -- November 2016 -- that would make sure American flags that are put up on campus stay up. California voters will face a full slate of presidential, congressional and state legislative elections next year, not to mention whatever ballot measures the Legislature and deep-pocketed special interests throw the voters way. Is the threat posed by would-be flag banners on campus serious enough to earn a place on the ballot too? Take our woefully unscientific poll, leave a comment or do both!, Follow Healeys intermittent Twitter feed: @jcahealey Copyright                       2015, Los Angeles Times  ]", "Date": "20150310", "Author": "[Jon Healey]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-poll-uc-irvine-flag-ban-constitutional-amendment-20150310-htmlstory.html", "Title": "[Poll: Should state voters weigh in on the UC Irvine flag fiasco?]"}