{"Content": "[ Rep. Anna Eshoo (D-Menlo Park) lost her bid to serve as the top Democrat on a key House committee next year in what was also a rare setback for Minority Leader Nancy Pelosi (D-San Francisco) in an internal party contest. New Jersey Democrat Frank Pallone defeated Eshoo, 100-90, in a vote of the full Democratic caucus Wednesday morning on who will serve as ranking member of the House Energy and Commerce Committee, after a bitter race that brought to the fore some dissatisfaction over party leadership. Pelosi had hoped to secure the position for her fellow Californian and close ally after Rep. Henry A. Waxman (D-Beverly Hills) retires this year. But Pallone had in his corner Rep. Steny Hoyer (D-Md.), the minority whip, and members of influential constituencies such as the Congressional Black Caucus. On Tuesday, Pelosi was reelected to the top leadership post in the party without any public dissent. But later in the meeting a tense debate erupted over Pelosis insistence that Rep. Tammy Duckworth (D-Ill.), a junior member who is due to give birth to her first child any day, not be allowed to cast a vote in the race by proxy. Some saw it as an effort by Pelosi to influence the vote. Eshoo had won an initial vote for the position Tuesday night in the Democratic Steering and Policy Committee, a party body with more loyalty to Pelosi. However, she failed to secure enough votes to avoid triggering a vote of the full party membership. A primary question in the race is what role a members length of service should play in deciding committee leadership positions. Pallone was first elected in 1988, four years before Eshoo. Pelosi nonetheless publicly endorsed Eshoo, saying that seniority was an important factor but should not be determinative, citing precedent where other more senior members were passed over. But seniority is an important concern, particularly for members of the Congressional Black Caucus, whose members tend to represent safer districts that allow them to build up an advantage over other members. In an interview with The Times on Monday, Pelosi said Eshoos elevation to the top Democratic spot on the powerful committee would be important for the party, allowing her to tap into lucrative fundraising interests in Silicon Valley and elsewhere that the committee has jurisdiction over, and enabling Pelosi to spend more on party building and messaging -- a priority if Democrats hope to reclaim the House in the near future. However, Pelosi denied at the time that she had invested significant personal capital in the effort beyond sending several letters to the caucus as a whole. \"I dont think Ive spoken to 20 people about Annas race,\" she said. \"Time is money for me. I gotta be doing something else in an election year than making calls about an internal [fight].\", In a statement after Wednesdays vote, Pelosi congratulated Pallone on his \"hard-fought campaign.\", Determining committee seats is one of the most difficult internal fights a party has after each election, pitting colleagues against one another and testing internal loyalties. Other Democratic leadership posts remain to be determined, but Pelosi also announced Wednesday that Rep. Maxine Waters (D-Los Angeles) will retain her post as ranking member of the Financial Services Committee. Republican Rep. Devin Nunes of Tulare won a party caucus vote Tuesday to serve as the new chairman of the House Intelligence Committee, replacing Rep. Mike Rogers of Michigan, who is retiring from Congress. Follow @mikememoli for more news out of Washington]", "Date": "20141119", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-eshoo-pelosi-20141119-story.html", "Title": "[Pelosi ally Anna Eshoo loses party vote for key committee post]"}