{"Content": "[ Rick Perrys Cameron Todd Willingham problem wont go away. In fact, it got worse this week. Until recently, much of the outrage over the killing of Willingham  the convicted murderer-arsonist who was very likely innocent but executed by Texas anyway in 2004  has been over the states and Gov. Rick Perrys conduct after Willingham was sent to death row in 1992 for setting the fire that killed his three children. Perry wasnt governor during Willinghams prosecution, which relied heavily on the testimony of a jailhouse informant and forensic evidence produced by arson investigators. But he was governor in 2004, when a noted arson expert and scientist sent him a report concluding there was no evidence that the fire was set intentionally and that the evidence used to convict Willingham amounted to junk science. Despite the report, Perry refused to grant a stay, and Willingham was put to death by lethal injection on Feb. 17, 2004. Five years later, with a Texas commission working inexorably toward a formal acknowledgment that the state had executed an innocent man  surely a watershed in the history of American capital punishment  Perry pulled a bureaucratic maneuver that effectively stopped the investigation in its tracks. (The seminal work of journalism on this subject appeared in the New Yorker in 2009. Its a depressing tale of Texas total indifference to the truth once Willingham landed on death row.), When Perry first ran for president in 2011, there were a few grumblings among pundits (myself included) about the Willingham case and what it said about Perrys ability to govern. Back then, I wrote that Texas may let Perry off the hook for executing an innocent man but the rest of the nation may not be so forgiving. How wrong (or naive) I was: Perrys campaign drew more attention for his memory slips and bizarre behavior than anything he did as governor of Texas. It seemed as if Perry  and Texas  had shaken off Willinghams ghost. Comes now a new report by the Washington Post that thoroughly discredits the final remaining piece of evidence used to convict Willingham: testimony by jailhouse informant Johnny Webb, who had said Willingham admitted his guilt while behind bars. The prosecutor who secured Willinghams conviction had insisted that he made no deal to persuade the informant to testify. But, according to a lengthy paper trail and the informant himself, Webb was indeed coaxed to testify against Willingham. We already knew the deck was stacked against Willingham after his conviction; what the Posts chilling report reveals is that the fix was in beforehand. None of the evidence used to send Willingham to the lethal injection gurney was credible; the longer Perry and his state continue to deny this, the more the case against Willingham will continue to unravel without their help. Perry is not running for reelection as governor of Texas, raising the likelihood that hes preparing a 2016 campaign for the White House. Judging by his finger-in-the-ears reaction to the questions over Willinghams guilt so far, either Perry is amorally unconcerned about sending an innocent man to his death, or hes so unsettled by the implications of a posthumous exoneration that he resorts to denial in the face of overwhelming evidence. I hope its the latter, which at least leaves open the possibility that some prolonged media exposure in parts of the country less at ease with capital punishment  and disgusted by the botched killings of late that have soiled lethal injections sterility  might make Perrys candidacy historic in ways he never intended. Follow Paul Thorntons Twitter feed @PaulMThornton, ]", "Date": "20140806", "Author": "[Paul Thornton]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-cameron-todd-willingham-rick-perry-execution-20140806-story.html", "Title": "[Cameron Todd Willingham's ghost won't stop haunting Rick Perry]"}