{"Content": "[ Few if any of the domestic policy proposals President Obama talked about in his sixth State of the Union speech stand much chance of landing on his desk to be signed into law, but theyve already begun to have an impact in another arena: shaping the race to succeed him. From executive actions he can take on his own to policy initiatives that draw sharp contrasts with the Republican majority in Congress, Obama has set a large chunk of the issue agenda for the 2016 presidential campaign, long before either party has picked a nominee. Whether its Hillary Rodham Clinton or someone else, the Democratic nominee, for example, almost certainly will feel a need to endorse Obamas move to shield millions of immigrants in the country illegally from deportation  a step that has proved extremely popular with Latinos, a core part of the Democratic coalition. And as the House demonstrated this month by voting to order deportations of young people whom Obama already has shielded, Republicans almost certainly will demand that their nominee oppose Obamas policy, even at the cost of alienating Latino voters. Obamas effort to combat global warming by reducing the amount of coal the U.S. burns has created a similar divide. That gap probably will widen this year as Republicans try to undo the presidents environmental policies. Those actions changed the status quo, forcing political figures on both sides of the partisan divide to take firm positions on issues they might have preferred to elide. Tuesday nights speech and its two-week lead-up period demonstrated another way a president can shape the political agenda: by focusing attention on proposals of his choosing. \"Republicans arent going to be excited about putting Obamas agenda into law,\" said Brendan Nyhan, an assistant professor of government at Dartmouth College. History offers very few examples of a president actually changing the publics views on major issues. But, Nyhan said, by talking about an issue, a president can raise its profile. \"People may not agree with what he proposes,\" Nyhan said. \"But they may think the issue is more important\" because of the presidential spotlight. The idea of making community college free for most American students, for example, has received a boost from the attention Obama has given it. Similarly, his call for a middle-class tax cut paid for largely by raising taxes on inherited wealth sets a marker that both parties nominees will need to take into account as they vie over that key voter group. Obamas effort to influence the campaign ahead, however, went beyond specific issues. The tenor of the speech, his sunny optimism about the nations condition and its future, and his effort to associate his party with \"rising incomes and chances for everyone\" set the stage for the theme every incumbent party hopes to be able to wield: Dont mess with success. The stakes are high for Obama, who, according to his aides, is acutely aware that the next president can cement in place or try to dislodge some of his key policy accomplishments, including his healthcare law, new regulations aimed at combating climate change and the policy on deportations. On each of those issues, Democrats, and some outside analysts, believe that Obamas positions put his party on the winning side of the debate, energizing parts of its electoral coalition, including Latinos on immigration and younger voters on global warming, and forcing Republicans to defend positions held by a minority of voters. \"He wants to put Republicans in a box, put them in the position where they have to choose between taking an unpopular position in the general election or one that hurts in a primary,\" said John G. Geer, a political science professor at Vanderbilt University. Republican strategists scoff at that, pointing to their success in Novembers midterm election. If anything, they argue, Obama is boxing in Clinton, taking positions that could force her to run further to the left than Democratic strategists might wish. So far, there is little evidence of a big gap between the Obama and Clinton positions on major topics. One of the main tax breaks that Obama would curtail, for example, the so-called stepped-up basis for inherited capital gains  which White House aides have newly dubbed the \"trust fund loophole\"  is also targeted in a major economic policy plan released last week by a group with close ties to Clinton. The two have numerous channels that they can use to avoid policy conflicts. White House senior advisor John Podesta, for example, is expected to leave Obamas staff soon to take up a position running Clintons campaign. Officially, the White House insists none of what he is doing is about the next election. \"The president said hes run his last campaign,\" White House Chief of Staff Denis McDonough said on National Public Radio on Tuesday morning, a line Obama reiterated to Congress. \"This has nothing to do with the campaign.\", Such protestations aside, Obama does have \"another election in front of him,\" said Michael Waldman, a former speechwriter to President Clinton and now president of the Brennan Center for Justice at New York University. \"If he doesnt think his legacy is going to be shaped by who wins the presidency, Id be surprised.\", Indeed, Geer said, Obamas \"legacy will depend in part on getting a successor elected.\", In the eight decades since the Great Depression and the New Deal reshaped American politics, only two presidents, Franklin D. Roosevelt and Ronald Reagan, successfully built and nurtured political coalitions that were able to survive three elections. For Obama, Geer said, adding a third name to that list, particularly after the Democrats stinging defeat this fall, \"would be a vindication of his second term.\", david.lauter@latimes.com, Twitter: @davidlauter, Times staff writer Kathleen Hennessey contributed to this report.]", "Date": "20150121", "Author": "[David Lauter]", "Link": "http://www.latimes.com/nation/politics/la-na-obama-analysis-20150121-story.html", "Title": "[With State of the Union, Obama sets agenda ... for 2016 election]"}