{"Content": "[ Foreign policy is traditionally not a hot topic for presidential primary candidates this early in the game, so I was surprised to receive a request recently to talk about Russia from one of the often-mentioned candidates. But, of course, it is not too early. The United States no longer has the luxury of ignoring Russia. For the first time since the mid-1980s, it has become one of the most pressing national security concerns, and presidential contenders will be asked what they plan to do about it. So what  in the traditional \"two-pages-or-less\" campaign format  should a putative candidate know?, First and most important: The Russia the next U.S. president will have to engage with for four or eight years will be Vladimir Putins Russia. Having just turned 62, Putin, his periodic denials notwithstanding, is well on his way to a presidency-for-life, with or without elections. Reportedly swimming two hours in the morning, lifting weights, playing hockey, Putin is fit and trim. His personal control over Russia is the most complete by any leader since Josef Stalin. What, then, does Putin want? What is his overarching agenda? What does he aspire to for his country and himself  the two undoubtedly merged inexorably in his mind? What makes Putin tick?, The ultimate goal, which has motivated and guided him since he took over the presidency 14 years ago and which he has pursued with remarkable consistency and persistence, is to recover most, if not all, key assets  political, economic and geostrategic  lost in the collapse of the Soviet state. I call this overarching agenda the Putin Doctrine. Translated into policies, it has meant a gradual but relentless restoration of the states control, or outright ownership, of national politics, the courts, the media and, most important, national television channels. It also includes most institutions of civil society. In economic terms, the doctrine dictates the re-occupation and control of what Vladimir Lenin called the \"commanding heights of the economy,\" particularly the oil and gas industry. Outside the country, the Putin Doctrine aims at Moscows de facto veto power over domestic regimes and foreign and defense orientations of most post-Soviet states, with swift and unyielding pressure applied to those that attempt to resist. Globally, the doctrine has guided Putins efforts to restore Russia to the status of a great power  defined in the quasi-Soviet way seen in much of Putins thinking  mostly in opposition to the United States. Finally, his Russia must continue as the worlds other nuclear superpower, which, in Putins mind, is incompatible with any kind of European strategic missile defense. Putin has been very successful in all of these objectives, and there is no doubt that he will stick with them. These are the cornerstones, the starting points, of any future U.S.-Russia bilateral agenda that the next American president will have to engage with. Does this mean that the U.S. president cannot modify Putins goals? Of course not. Although unflinching in his convictions and ultimate objectives, Putin is not a great strategist. He is instead a clever tactician. His sport and passion is judo, where you win by watching your opponent like a hawk, probing for a weakness in order to catch your adversary off balance  then going for it at lightning speed with all you have. Although he is dangerous, and could be lethal, Putin is not invincible. He is stubborn but not mad. His mind and his policies can be changed  not by sweet talk or by shaming him as a 19th century throwback, but rather by a White House that is firm and consistent, but also open-minded, alert and flexible. The most effective model might be the way President Reagan handled the Soviet Union: a combination of patience and resolution, but also flexibility and attention to any potential opening for cooperation that would genuinely advance U.S. national interests. Most of all, the next American president should be guided by Reagans unshakable conviction that the only way to fundamentally change Russias policies is to create an inducement for domestic reforms. And that can be done only by increasing the cost of domestic repression and foreign aggression. Under Reagan, this approach resulted in an unprecedented elimination of an entire class of dangerous nuclear weapons (medium range missiles), laying the groundwork for equally unparalleled conventional and strategic nuclear cuts, and the 1988 Moscow summit that profoundly altered the tenor of U.S.-Russia bilateral relations for almost two decades . It will be neither easy nor quick. But as with the Soviet Union, time is on the side of reform  that is, on the side of the Russian people. Oil, the lifeblood of the Russian economy, is below $80 a barrel, which means that Russia is almost certain to slip into a recession. Capital flight out of the country will probably reach a record $100 billion to $150 billion this year. The ruble is at a historic low against the dollar and the euro, and inflation will probably be 8% for the year. As of September, the price for staples, such as chicken and pork, is up 19% or more compared with January. The Kremlin is no longer capable of securing both guns and butter. The billion-dollar price tags for Crimea, Putins pet new state of \"Novorossiya,\" and a mammoth military modernization are coming due, not to mention the costs from Western sanctions. Russian cannot deal with these expenses without slashing budgets for healthcare and education, freezing pensions and salaries; that is, he cant deal with them without hitting his political base by reducing the incomes of tens of millions of pensioners and state employees. The choice grows starker by the day: Go for deep institutional, decentralizing and liberalizing reforms that drastically improve the investment climate? Or, opt for the re-Stalinization of Russia in a reign of mass impoverishment and repression, inevitably leading to a collapse. Leon Aron is a resident scholar and director of Russian studies at the American Enterprise Institute. Follow the Opinion section on Twitter @latimesopinion]", "Date": "20141203", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-aron-russia-2016-contenders-20141204-story.html", "Title": "[ What makes Putin tick? A primer for presidential candidates]"}