{"Content": "[ The news that delivered the biggest jolt to the 2016 presidential campaign this week wasnt anything the candidates said or did. It was an offhand comment from a billionaire, David H. Koch, at a dinner of wealthy Republicans in New York. \"Scott Walker is terrific,\" Koch told a reporter for the New York Observer. \"Hes a tremendous candidate.\", The New York Times reported that Koch was essentially endorsing the Wisconsin governor as his favorite in the GOP race. It sounded as if the Koch primary, in which Republicans compete to unlock billions of dollars from a network of conservative donors, was over. Until Koch walked it back, that is. \"I am not endorsing or supporting any candidate for president at this point in time,\" he said. Koch says he and his brother, Charles G. Koch, still intend to remain neutral in the GOP primaries  although they do intend to summon candidates to a round of auditions this summer. Thats where the action is right now in the not-very-majestic process by which we are choosing our next president. The most important players arent the candidates; theyre the mega-donors. In American politics, money talks. Thats always been true, of course. But this year, were reaching new lows: The Republican race has devolved into a battle among headstrong billionaires, each with a pet candidate. David Koch, whose family made its money in coal, has Walker. (For all his protestations of neutrality, Koch sounded pretty smitten.) Norman Braman, who owns 23 car dealerships, has Marco Rubio. Robert Mercer, a New York hedge fund manager, has Ted Cruz. Foster Friess, an investment manager, has Rick Santorum. (Yes, Santorum is still in the running  thanks in large part to the generosity of Friess.), The biggest mega-donor of them all, Las Vegas casino mogul Sheldon Adelson, is still playing hard to get. All the candidates, including former Florida Gov. Jeb Bush, are courting him. Theres something grotesque about a process that requires serious politicians to hover anxiously around a few donors who can make or break a campaign at whim. And no, this isnt a rant about the Republican Party. I have no doubt that plenty of Democratic candidates would do pretty much the same thing. It just happens that theres not much of a contest yet on the Democratic side this year  but a wide-open race on the GOP side, and that has brought the .01% out to play. The race for big money is bigger this year than in previous cycles for another reason: Campaigns are still discovering how they can exploit the freedom from regulation that the Supreme Court has granted since its Citizens United decision in 2010. Most of the new money is being funneled through single-candidate \"super PACs\": fundraising committees set up to promote individual candidates. That was a new and experimental idea when President Obama and Mitt Romney first tried it in 2012, but now everybody has one. Cruz has four, each one directed by an individual mega-donor. Hillary Rodham Clinton has at least two. On paper, a super PAC, which can take unlimited donations, cant coordinate what it does with a candidates official campaign committee. In practice, there are plenty of ways around that rule. Bush, for example, just put his super PAC in the hands of Mark Murphy, who has worked for him in past elections; Murphy wont have much difficulty figuring out what his television commercials should say, even if he cant attend meetings at campaign headquarters. But super PACs wont just help a candidate amplify his message; theyll also help determine who gets to be a candidate in the first place. A candidate with a billionaire in hand has a guaranteed place in early primaries even if he has neither grass-roots nor party support. (Think Newt Gingrich in 2012.) On the other hand, a candidate without billionaires may not be able to run a viable campaign at all. (Sen. Bernie Sanders, the independent Vermont socialist, said that problem is weighing on him as he considers whether to run.), Campaign finance reform has historically been a low priority for most Americans. When the Pew Research Center asked voters in 2012 to rank their concerns, campaign finance was near the bottom. This year could be different. Democratic pollster Stan Greenberg says public alarm is rising, and hes advised candidates to put reform on their list of promises (as Clinton did last week). Its too late for significant changes this cycle. A constitutional amendment to reimpose contribution limits, which Clinton suggested she favors, would take years to pass. Democrats have proposed legislation to increase disclosure and provide federal matching funds for small donations, but their bills have stalled. Republicans have said theyd support more disclosure if all contribution limits were abolished, but that proposal isnt moving either. If, however, voters demand change from the candidates, its just possible that 2016 could be remembered as the year the tide of money crested, instead of just another campaign that saw the dollars rise. Meanwhile, maybe we should ask for an interim measure. Instead of debates among the candidates, lets go straight to the top  and ask for debates among their donors instead. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150421", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0422-mcmanus-politics-megadonors-koch-20150422-column.html", "Title": "[For the GOP, it's the billionaires' primary]"}