{"Content": "[ With Antonio Villaraigosa no longer a threat to her campaign for U.S. Senate, some Democratic leaders see state Atty. Gen. Kamala Harris as Barbara Boxers inevitable successor. \"I think she is a prohibitive favorite,\" said Eric Bauman, the partys Los Angeles County chairman. But uncertainties abound as Harris trudges toward the June 2016 primary and, should she finish first or second, the runoff that November. Potential rivals have more than a year to declare their candidacies. A significant faction of the state Democratic Party is still yearning for another Latino to get in the race, now that Villaraigosa has declined to run. Several members of Congress, all of whom have more federal policy experience than Harris, are exploring whether to join the race. And as the first major candidate, Harris will face a prolonged period of scrutiny of her record by the media and political adversaries. Bill Carrick, a longtime campaign advisor to Sen. Dianne Feinstein, said it was unlikely that Harris would glide into the Senate without vigorous opposition. \"I think its very hard to get a free pass in American politics,\" he said. \"Politics abhors a vacuum.\", Both Boxer and Feinstein faced fiercely contested Democratic primaries before winning their Senate seats in 1992. The election next year will be Californias first since then with an open Senate seat. On Tuesday, Villaraigosa, a former Los Angeles mayor, became the latest in a string of big-name Democrats to decline to run for Boxers seat since the four-term senator announced last month she would not seek reelection. For Harris, a former San Francisco district attorney, early positioning as a presumed front-runner is not entirely an asset, even if it allows her to get a jump on the tedious but crucial task of fundraising. \"She has as much of a lock on this as Hillary Clinton had on the Democratic nomination for president in 2007 and 2008,\" said Antonio Gonzalez, president of the William C. Velasquez Institute, a Latino think tank. Gonzalez said efforts by Harris supporters to clear the field for her \"wont be successful.\", In Napa Valley on Wednesday, Villaraigosa spoke at a private lunch of the California Legislative Latino Caucus, which commissioned a poll last month to gauge voter interest in a Latino candidate for Senate. Asked whether he hoped another Latino would enter the race, Villaraigosa said, \"Theres a lot of talent in this state. \"Its always good to have a debate of ideas,\" he added. Some Latino lawmakers were openly unenthused by the prospect of Harris facing minimal opposition. \"Im hoping that more people enter the fray,\" said state Sen. Ben Hueso (D-San Diego). Harris was raising campaign money Wednesday in Washington, where she was also attending a meeting of the National Assn. of Attorneys General. Several of her would-be rivals have substantial sums of federal election money already in the bank, including Rep. Adam B. Schiff (D-Burbank), who started the year with more than $2.1 million. Schiff said Wednesday that Villaraigosas exit \"means that there is a profound opportunity for a strong Southern California candidate.\", \"I think theres a real hunger to have a representative from the south, and so thats wide open,\" he said in an interview at the Capitol. \"Im certainly giving it a lot of thought.\", House members face the tough choice of whether to abandon relatively safe seats for what would be an uphill statewide race. Schiff was just installed as the top Democrat on the House Intelligence Committee. Rep. Xavier Becerra (D-Los Angeles), who in two decades has climbed to the upper ranks of the partys House leadership, said Wednesday that he still had \"a lot of work and a lot of listening to do\" before he decided whether to run for Senate. Another uncertainty for Harris is the potential emergence of a rich candidate who could fund a campaign. Also unknown is whether any individuals or interest groups will take advantage of the unlimited independent spending allowed in a Senate race. \"Its the outside spending, I think, thats going to make a critical difference this time around,\" said Sherry Bebitch Jeffe, a USC public policy professor and veteran analyst of California politics. How deftly Harris will respond to politically sensitive issues also remains unclear. In an interview last week, for example, she declined to say whether, if she were a senator, she would attend Israeli Prime Minister Benjamin Netanyahus upcoming address to a joint session of Congress. Netanyahu was invited by House Speaker John Boehner (R-Ohio) without consulting the White House, drawing a rebuke from President Obama and leading some Democrats to vow to boycott the speech. A senior Harris advisor, Brian Brokaw, said Harris position now was that she would not boycott the speech. Brokaw did not respond to repeated inquiries about whether Harris agreed with Obamas national security advisor, Susan Rice, that Netanyahus decision to give the speech was \"destructive of the fabric of the relationship\" between Israel and the United States. michael.finnegan@latimes.comTwitter: @finneganLAT, patrick.mcgreevy@latimes.comTwitter: @mcgreevy99, Times staff writer Michael A. Memoli in Washington contributed to this report.]", "Date": "20150225", "Author": "[Michael Finnegan, Patrick McGreevy]", "Link": "http://www.latimes.com/local/politics/la-me-pol-senate-villaraigosa-20150226-story.html", "Title": "[Kamala Harris the 'prohibitive favorite' for Senate, which has drawbacks]"}