{"Content": "[ Former Massachusetts Gov. Mitt Romney announced Friday that he will not run for president in 2016, catching even some of his closest supporters by surprise and scrambling the race for the Republican Party nomination. Two weeks after he publicly announced his interest in a third run at the White House, Romney told donors, former staffers and other supporters in a conference call that he believed he had the fundraising and political base to win the nomination, and cited positive recent polls. But he conceded that it would be a tough fight, and said that one of the next generation of GOP leaders could be more capable of defeating the Democratic nominee in 2016. After putting considerable thought into making another run for president, Ive decided it is best to give other leaders in the party the opportunity to become our next nominee, said Romney. I feel that it is critical that America elect a conservative leader to become our next president. You know that I have wanted to be that president, he said. But I do not want to make it more difficult for someone else to emerge who may have a better chance of becoming that president. There was an air of passing the torch in Romneys departure, which opens up the race for the nomination to more establishment-oriented candidates such as former Florida Gov. Jeb Bush, Sen. Marco Rubio of Florida and New Jersey Gov. Chris Christie. More conservative contenders, including Texas Sen. Ted Cruz and Kentucky Sen. Rand Paul, have also been positioning themselves, as have lesser-known figures such as Wisconsin Gov. Scott Walker. I believe that one of our next generation of Republican leaders, one who may not be as well-known as I am today, one who has not yet taken their message across the country, one who is just getting started, may well emerge as being better able to defeat the Democrat nominee, Romney said. In fact, I expect and hope that to be the case. Romneys comments about generational change seemed to imply that Jeb Bush might not be the best choice for the GOP. The son of one president and the brother of another, Jeb Bush is the candidate carrying the weight of a dynasty in his race for the GOP nomination. After Romney told donors that he was thinking about mounting a third presidential bid, he really spent time studying whether to do it, said one longtime close advisor who had urged him to run again. Thats what hes been doing the last three weeks  making a lot of phone calls to people he respects and admires. Not only people in the campaign  grass-roots leaders, trying to take everyones sense of this thing. Romney and his wife, Ann, decided over the weekend not to mount a campaign, but delayed an announcement to see how comfortable they were with that decision, the advisor said. Mitt said both he and Ann struggled with the decision. It was not an easy decision. It was a hard decision. I think thats simply because he would have started off with some obvious advantages and he was passing this opportunity to other leaders in the party. Thats hard to do. As I said, he has a strong sense of duty and obligation to his party and thats what ultimately prevailed, the advisor said. Recently, some of Romneys donors and campaign staffers had begun to make public their commitments to other candidates, but insiders minimized the impact of those changes on the current campaign. Among Romney staffers, including those who questioned the wisdom of a third run, there was a palpable sadness, a feeling that maybe a chapter is over, one source said. Even for people who felt like it wasnt the right thing or felt like it wouldnt be in his interest or in the interest of the party, its bittersweet. Rich Beeson, Romney 2012 political director, said the senior staff would have been solidly behind Romney had he chosen to run. While others expressed sadness, Beeson said there was also a sense of relief that Romney and his wife and family would not go through the grueling process of another presidential campaign. There is such a sense of respect and admiration for him and Ann. As much as people might have wanted to do another campaign, the thought of them not getting dragged through it again  theres a little bit of a sense of relief, Beeson said. Craig Robinson, a former Iowa GOP official and founder of the influential Iowa Republican website, said he was completely surprised, in part because Romney had been making moves in that state indicating he was serious about a third run. He said Romneys decision dramatically changes the race in Iowa and in other early states, by easing the path for establishment candidates while making it tougher for the hard-right conservatives. I think for the last month, month and a half, conservatives were kind of licking their chops at the prospect of Mitt, Bush and Christie all running and slicing up that establishment pie. Its funny because you would think that taking out someone as formidable as Mitt Romney would make it easier for them. It makes it much harder for them, and it will be interesting to see how they approach it. This kind of upsets the apple cart. Had Romney run, it would have been almost impossible for Jeb Bush to create a foothold in Iowa and now, I think with Romney out it allows Bush and Chris Christie and Scott Walker a little more room to operate. Romneys decision also set off a scramble among the donors and bundlers who began shifting their plays. Bobbie Kilberg, a major GOP donor and bundler who with her husband has raised millions for Romney in the past, said they were going for Christie. It is clear to me that people are working the phones furiously today with donors, and even more importantly, with bundlers, she said. The group of bundlers who get money and raise money is finite so there will be a lot of competition for those people. Bush and Romney had been competing for commitments from the same donors and campaign strategists. Friday morning, Bush lauded Romney in a statement posted on Facebook. Though Im sure todays decision was not easy, I know that Mitt Romney will never stop advocating for renewing Americas promise through upward mobility, encouraging free enterprise and strengthening our national defense, Bush said. Mitt is a patriot and I join many in hoping his days of serving our nation and our party are not over. Rubio also praised Romney. Over the past two years, there hasnt been a day when I didnt think that Mitt Romney would have been a better president than Barack Obama, Rubio said in a prepared statement. I know what a difficult decision this must be given his love of our country. He certainly earned the right to consider running, so I deeply respect his decision to give the next generation a chance to lead. I wish him, Ann and his entire family the best and hope he will continue to serve our country and his community as hes done throughout his life, Rubio said. In a post on Facebook, Cruz praised Romney: His announcement today that he will not be not running in 2016 surely came after much prayer, and it cannot have been easy. Regardless of whether he is a candidate, Gov. Romney will continue to be a respected leader having a positive impact on our national discourse. House Democrats holding a retreat in Philadelphia greeted the news with a touch of sadness that a candidate who had lost twice before would not be trying again. I think Republicans are happier that hes not running, said Rep. Ben Ray Lujan of New Mexico, the new chairman of the House Democrats campaign committee. Minority Leader Nancy Pelosi (D-San Francisco) said Romney probably concluded the prospect of success was not there. Look, theyre a lovely family, hes a wonderful American. Hes been a governor. Hes served our country in many ways, Pelosi said. I dont want to make a joke about his candidacy, but ... I said he was the preferred candidate, so that tells you how much strength I thought he would have in the general election. Romneys first public comments about a possible third race came Jan. 16 during a gathering of Republican National Committee members on the aircraft carrier Midway exhibit in San Diego Harbor. He said then that if he ran again he would change his focus to poverty, income inequality and foreign policy. He took after Obama and likely 2016 Democratic candidate Hillary Rodham Clinton. He also alluded to the 10 years he spent as a Mormon bishop, an experience he rarely discussed in his two earlier campaigns. On Wednesday night, Romney spoke at Mississippi State University, where he again criticized the president and Clinton. After Obama made an oblique reference Thursday to Romneys new poverty focus, Romney tweeted out a response: Mr. Obama, wonder why my concern about poverty? The record number of poor in your term, and your record of failure to remedy. But even some former aides said the new focus was a difficult one for Romney, whose 2012 campaign was riddled with comments seen as less than supportive of the needy. seema.mehta@latimes.com, mark.barabak@latimes.com,  Times staff writer Michael Muskal contributed to this story from Los Angeles; Lisa Mascaro from Washington, D.C. 1:26 p.m.: This article was updated with more comments from politicians and poltical advisors. 12:30 p.m.: This article was updated throughout and republished. 9:57 a.m: This article was updated with comments from Marco Rubio and a campaign insider. 9:30 a.m.: This article was updated with additional information about Romneys decision and comments by Jeb Bush. 8:33 a.m.: This article was updated with additional comments from Romneys call to supporters. 8:25 a.m. This artice was updated with comments from Mitt Romney. This article was originally published at 8:07 a.m.]", "Date": "20150130", "Author": "[Seema Mehta, Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-romney-president-20150130-story.html", "Title": "[Romney a no-go in 2016; GOP newcomer 'may have a better chance' ]"}