{"Content": "[ Opponents of a new state law requiring more children to be vaccinated are moving to stop it from taking effect next year as scheduled. The California secretary of state announced Tuesday that the opponents have been cleared to begin collecting petition signatures for a referendum on the law. Their measure would appear on the November 2016 state ballot. A majority of voters would have to say yes to the referendum, in favor of the new vaccination law, or it would not go into effect. If the petitions for a referendum qualify for the ballot by Sept. 28 with the signatures of 365,000 registered voters, the law will be put on hold until voters decide the issue. The laws critics, led by former assemblyman and Republican gubernatorial candidate Tim Donnelly of Twin Peaks, said petitions will begin circulating later this week. He expressed confidence that the proposed referendum would make the ballot. \"I think the chances are as good as anything Ive ever seen in terms of a referendum, and we can do it with volunteers because there are so many motivated people who are already organized around the state,\" Donnelly said. He noted that within 72 hours of putting up a Facebook page and website, it already had 8,400 \"likes\" and about 5,000 people had volunteered to circulate petitions and contributed money to the effort. On Tuesday, the leaders of a group of thousands of parents that organized against the law as Our Kids Our Choice endorsed the referendum move. The new law, which Gov. Jerry Brown signed June 30, eliminates the personal belief and religious exemptions that parents have used in the past to seek waivers from state vaccination requirements for their children. State lawmakers and public health officials said the law was needed because a decline in vaccinations had contributed to the spread of disease, including a measles outbreak in California this year that was traced to Disneyland. Opponents of vaccines question their safety and say it should be up to parents, not the government, to decide what medical treatment their children receive. \"This is about a parents right to make an informed decision for their children,\" Donnelly said. Allan Hoffenblum, a Republican consultant who publishes the California Target Book, which handicaps elections, predicted the referendum would qualify for the ballot. Its supporters are \"a minority of people, but its a sizable minority of people,\" Hoffenblum said. \"I would be surprised if it didnt quality. There is a lot of intensity.\", Hoffenblum also predicted that voters would uphold the new law. In a national Harris Poll commissioned by the medical news website HealthDay in March, 82% of respondents said vaccinations should be mandatory for children, and 87% said vaccines are safe. \"I think the majority of California voters would want to make sure any kids in the room with their kids have been vaccinated,\" Hoffenblum said. Sen. Richard Pan (D-Sacramento), a co-author of the new law, agreed. \"My bill was thoroughly vetted in the Legislature with about 20 hours of debate and testimony analyzing every aspect of the law,\" Pan said in a statement, \"and Californians will support protecting our schools and communities over promoting anti-science myths that endanger our children.\", Hoy: La esta historia en espaol, patrick.mcgreevy@latimes.comTwitter: @mcgreevy99, 11:30 a.m. July 15: Article updated throughout. 12:18 p.m. July 14:Articleupdated to include comments by Tim Donnelly and Allan Hoffenblum, This articlewas originally published at 10:02 a.m. July 14.]", "Date": "20150715", "Author": "[Patrick McGreevy]", "Link": "http://www.latimes.com/local/political/la-me-pc-referendum-drive-begins-against-vaccination-law-20150714-story.html", "Title": "[Opponents of new California vaccination law begin referendum drive]"}