{"Content": "[ With the economy limping but no obvious contenders offering a more compelling fiscal strategy, Japanese voters on Sunday gave Prime Minister Shinzo Abes Liberal Democratic Party a fresh mandate to forge on with his reforms, known as Abenomics. Japans national broadcaster, NHK, predicted late Sunday that the Liberal Democrats and their coalition partner, the New Komeito Party, would together win at least 324 of the 475 seats in the lower house of parliament, a two-thirds majority. Abe called the snap elections last month even though his approval ratings were faltering amid several scandals and news that the country had officially tipped into recession. But turnout was just 52%  the lowest in the postwar era  and political scientists, economists and foreign diplomacy experts say the Abe win didnt necessarily mean the ruling party had stellar support among the public. The Liberal Democrats are the lesser evil, said Yoshihisa Hara, a political scientist and professor emeritus at Tokyo International University. There are seven opposition parties and they are splintered, noted Hara. In contrast, the Liberal Democrats have held together. Voter Miho Kobayashi, 20, a Tokyo office worker, agreed. She voted for the Liberal Democrats, she said, because they seem better than the other parties and appear stable. The most formidable opposition party is the Democratic Party of Japan, but it fell out of public favor two years ago. Then there is the Japan Innovation Party, which aims to decentralize Japans current government structure and give municipalities more power. Others have hopeful names such as the New Renaissance Party, Peoples Life Party and the Party for Future Generations, which counts former Tokyo governor and nationalist Shintaro Ishihara as a member. The Happiness Realization Party, a religious political group, is part of the mix, along with the Japanese Communist Party and Social Democratic Party. Hideo Kumano, executive chief economist at Dai-ichi Life Research Institute in Tokyo, said the timing of the election was a result of problems with Abes Cabinet. In October, scandals erupted involving three ministers. First, there was a funding scandal with then-Trade Minister Yuko Obuchi. Next came a campaign fund-use scandal by then-Minister of Justice Midori Matsushima. The uproar prompted both women to quickly resign. These were followed by a third incident. Office staff for the new trade minister, Yoichi Miyazawa, were found to be submitting government expense reports for trips to an S&M sex bar. Noriko Hama, economics professor at the Graduate School of Business at Doshisha University in Kyoto, said the Abe administration probably wanted to have elections before the public could render a more definitive verdict on Abenomics. The prime minister has pledged to revive Japans economy with a mix of measures including monetary easing and efforts to weaken the yen, making exports more competitive. In April, Abe raised the nations consumption tax from 5% to 8% in a bid to help reduce the national debt, but was forced to delay plans for another hike planned next year amid news that Japans gross domestic product dropped at an annualized 7.3% rate in the second quarter and 1.9% in the third quarter. Hama said the Abe administration has an outdated view of the economy and that the depreciation of the yen hasnt helped boost the economy. Japan, she said, has become an import-dependent economy and produces value-added products, so the mechanism that worked in the past isnt going to work as well now. People voted for Abe in hope born out of desperation, said Hama. Keiichiro Kobayashi, economics professor at Keio University in Tokyo, said the cheaper yen has been helping Japanese manufacturers. But the structural reforms Abe has hoped to implement  such as creating national strategic economic zones and introducing healthcare system reforms  havent been progressing as planned, Kobayashi said. One U.S. dollar currently buys about 120 Japanese yen, up 20% since early 2014. That shift has hurt households and small- and medium-sized businesses in the short term and may result in a policy failure unless it lasts for a few years and starts bringing manufacturing jobs  many of which have gone overseas  back to Japan, he said. The Japanese economy may improve in 2015 as effects from the April consumption-tax hike begin to dissipate and global oil price declines trickle down to cheaper prices for consumers, said Kobayashi. This could result in a rebound in Abes approval ratings, Kobayashi suggested. The most recent opinion poll by the local press gave Abe an approval rating of around 42%, with his disapproval rating being the same. Takashi Horie, associate professor of political science at Tokyo Metropolitan University, said a portion of the Japanese public supports Abe because the stock market has been rallying and that has led to many thinking the economy may be doing better. But not much has changed since Abe became prime minister two years ago, said Horie. Actual wages, he noted, have been falling for 16 months straight. One area Abe may be improving in lately is diplomatic relations with China, said Ichiro Korogi, professor of contemporary Chinese Studies at the Kanda University of International Studies in Chiba. The Asia-Pacific Economic Cooperation meeting in Beijing in November brought together Chinese President Xi Jinping and Abe for a brief meeting. After a few years of conflict over a disputed group of islands and lingering historical issues from World War II, the terse and tense interchange was nevertheless seen as a small step forward. Both sides agreed on a few measures aimed at reducing the chance of any military confrontation caused by misunderstandings over such issues. With Sundays election win, Abe is likely to try to win two-thirds of the upper house seats in elections in 2016, said Hara. If he were to succeed in getting two-thirds majorities in both chambers, Abe could decide to renew his efforts to modify Japans pacifist constitutional restrictions to allow for a greater range of military activities, said Hara, the scholar. Abe wants to amend Article Nine of the Japanese Constitution, which restricts Japans military capabilities, said Hara. Abe, he added, is taking a page from his grandfather, Nobusuke Kishi (who was Japans prime minister from 1957 to 1960). Abe wants to carry out Kishis wishes to amend Article Nine, said Hara. Some Tokyo voters, including retiree Kazumi Urakami, 85, expressed concerns over Abes military aspirations as well as a new state secrets act that just kicked in; she voted for the Democratic Party. Other voters are skeptical about the governments policy to restart nuclear power reactors in the aftermath of the Fukushima Daiichi nuclear power plant meltdown in 2011. The majority though, said they were willing to give Abe more time to prove himself. Id like to see how the economic reforms by Abe will turn out, said Tokyo office worker Kazumi Usuda, 40, who voted for Abes Liberal Democrats. Nagano is a special correspondent.]", "Date": "20141214", "Author": "NULL", "Link": "http://www.latimes.com/world/asia/la-fg-japan-abe-wins-downbeat-election-20141214-story.html", "Title": "[Japan's Abe wins mandate in downbeat election]"}