{"Content": "[ Sorry to break the bad news to all you dreamy-eyed liberals, but its time to stop wishin and hopin: Elizabeth Warren isnt running for president. Really and truly. Progressive Democrats have bombarded her office with postcards, signed online petitions and stood in the snow waving signs to get the junior senator from Massachusetts to run. Warren didnt do much to encourage all this attention. Last fall when People magazine asked whether she would run, the senator wrinkled her nose, the magazine reported, and said, nondefinitively: I dont think so.... She then added, If theres any lesson Ive learned in the last five years, its dont be so sure about what lies ahead.... There are amazing doors that could open. Since then, though, Warren repeatedly has slammed one door shut. I am not running for president, shes said over and over. Shes pledged to serve her full term in the Senate through 2018. Of course, hardly anybody believes what a politician says, especially on the subject of career ambition. When Barack Obama arrived in the Senate in 2005, he too said he had no plans to run for president. But over the last few months, Democrats who do politics for a living have concluded Warren really means it based not on what shes said, but on what shes done  or, more precisely, left undone. She isnt traveling to Iowa or New Hampshire, Democratic strategist Tad Devine noted. She isnt putting together a team of people to build an organization. This is a case where no means no. Why wont Warren run?, A challenge to Hillary Rodham Clinton would be a grueling battle against tall odds. In national polls, Clinton wins the support of about 60% of Democrats, against only 11% for Warren. A face-off also would pit the Democrats two most prominent women against each other. It would be a bad day for Emilys List, said one Democratic operative. Warren is fiery about her favorite causes  such as reducing the influence of Wall Street banks  and yet thats not the same fire in the belly required to run for president. She describes herself as an outside agitator, not a deal-maker, and you cant be an outsider in the Oval Office. Last year she fought the Obama administration and her own partys Senate leadership to block the nomination of a former investment banker as undersecretary of the Treasury, and won  although the nominee, Antonio Weiss, got a job that didnt require Senate confirmation. Shes already signaled her opposition to President Obamas desired trade agreement with 11 countries around the Pacific. Thats why Warren is not running. But why has she been less than definitive? I suspect its because being considered a potential presidential candidate is a surefire way to get attention from the media for her causes and ideas. When Warren gave a speech to the AFL-CIO last month demanding legislation to break up the Wall Street banks, it won far more coverage because she might some day run for president. Theres one quick way to stop all the speculation: Warren could formally endorse Hillary Clinton. On Tuesday, the New York Times reported that a secret meeting happened between the two in December. Clintons aim, the paper said, was to cultivate the increasingly influential senator  but she didnt ask explicitly for Warrens endorsement. Its going to be an interesting courtship given their prickly history. A 2003 book Warren co-wrote tartly denounced Clinton for failing to oppose bankruptcy legislation promoted by big banks: As First Lady, Mrs. Clinton had been persuaded that the bill was bad for families. As New Yorks newest senator, however, it seems that Hillary Clinton could not afford such a principled position. For Clinton, the price of an enthusiastic endorsement from Elizabeth Warren could be high. Warren may not expect Clinton to embrace her call to break up big banks, but shed like her to move more in that direction. Warren has been invited into the Senate leadership. Shes become one of the most influential Democrats in the country. Now she has the unofficial front-runner for her partys presidential nomination asking for her help. Not bad for a law professor who just completed her second year in office. Besides, she hasnt closed the door on running in 2020. doyle.mcmanus@latimes.com, Twitter: @DoyleMcManus, Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150217", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0218-mcmanus-elizabeth-warren-2016-20150218-column.html", "Title": "[Forget it, liberals: Elizabeth Warren is not running for president]"}