{"Content": "[ The U.S. attorney for has subpoenaed all of the states electronic records concerning Oregon Gov. John Kitzhaber and his fiancee, Cylvia Hayes, issued the day Kitzhaber announced his resignation. The subpoena, issued Friday, demands production of a massive trove of data and makes it clear that the four-term governors troubles will not necessarily end with his departure from office. MORE:Oregon Gov. John Kitzhabers resignation caps months of growing concerns, ------------, FOR THE RECORD, An earlier version of this post referred to Kitzhabers 2010 inauguration. After being elected to a third term in 2010, he was inaugurated in 2011. ------------, The demand for records was issued to the Oregon Department of Administrative Services and seeks all information, records, and documents for both Hayes and Kitzhaber. Kitzhaber announced his resignation Friday, ending weeks of speculation about whether he could lead Oregon with at least two investigations into possible ethical breaches hanging over his head. Questions about Hayes, 47, a clean energy consultant, have dogged the couple for months, but only over the past week did it become clear that they would bring a swift and agonizing end to Kitzhabers 35-year career in public service. The federal subpoena also seeks emails sent or received by Hayes, Kitzhaber, Kitzhaber government attorney Liani Reeves and the head of the Department of Administrative Services. Email records were requested from 13 others who were either employed by or had dealings with the state, including a woman who worked for a short time as a communications staffer for the governor and was fired, in part, for questioning Hayes role in the administration. The federal probe had been rumored for weeks. It joins a state ethics investigation and a third inquiry led by the Oregon Department of Justice. The subpoena seeks information about Hayes dealings with energy contracts, and also demands information between state employees and several non-governmental bodies including Demos, a New York-based research and policy center that paid Hayes to serve as its advocate while Hayes also pushed its agenda forward as the governors energy advisor. Kitzhabers resignation, which is effective Wednesday, was sent in a letter submitted to Secretary of State Kate Brown, who is expected to succeed him. I am announcing today that I will resign as governor of the state of Oregon, he wrote in a statement released just after noon. It is not in my nature to walk away from a job I have undertaken - it is to stand and fight for the cause. For that reason I apologize to all those people who gave of their faith, time, energy and resources to elect me to a fourth term last year and who have supported me over the past three decades. Poised to become the next governor, Brown called for unity amid the turmoil of recent weeks. \"This is a sad day for Oregon. But I am confident that legislators are ready to come together to move Oregon forward,\" Brown said. \"I know you all have a lot of questions, and I will answer them as soon as possible. As you can imagine, there is a lot of work to be done between now and Wednesday,\" she said. The embattled governor faces allegations that his fiancee used their relationship to win contracts for her consulting business and failed to report income on her taxes. The states two top legislative leaders and the state treasurer -- all Democrats, as is the 67-year-old governor -- had called on Kitzhaber on Thursday to resign. Brown was poised to move to the governors office, but will have to run in 2016. In a statement, Treasurer Ted Wheeler noted the looming election. I have been around long enough to know that the resignation of Gov. Kitzhaber and the constitutional mandate for an election in 2016 will set off a flurry of speculation about what happens next,\" he said. \"There will be a time for politics, but now is not that time. In the coming days, Oregonians should pull together to support Gov. Brown and her team in their efforts to bring stability to the governors office.\", Wheeler went on to thank Kitzhaber for his service. \"I wish him the very best in the years ahead. Oregonians are a resilient people, and I am certain that we will emerge from this difficult period as a stronger and more unified state, he said. The associations representing Democratic and Republican governors agreed that Kitzhaber was right to step down, but differed sharply on what happens next. The Democratic group praised Brown while the Republicans called for new leadership in 2016. Washington Gov. Jay Inslee, a fellow Democrat, praised Kitzhaber, a medical doctor, for his service, particularly in the area of public health. \"Gov. Kitzhaber had an incredible career of public service in Oregon. His work in particular on healthcare helped lead the transformation of our nations healthcare system,\" Inslee said. \"This is a sad end to Gov. Kitzhabers tenure, but his strong record of leadership and vision is worthy of respect. On Monday, state Atty. Gen. Ellen F. Rosenblum announced in a three-sentence letter to Kitzhaber that she had begun a criminal investigation into the troubled first couple. The state Ethics Commission was already investigating whether Hayes had falsified tax forms and been paid consulting fees to influence her future husband, and just what Kitzhabers involvement had been. In a statement, Rosenblum too thanked Kitzhaber for his service but noted that the resignation will not end the inquiries. The governors decision to resign will not affect our ongoing criminal investigation into allegations of his and Ms. Hayes conduct,\" Rosenblum said. \"Oregonians deserve nothing less than a full and fair investigation of all the facts, as well as the opportunity to reach a resolution that will truly allow our state to move forward. On Tuesday, Kitzhaber sat down with Peter Courtney, president of the state Senate and a longtime friend and colleague, and said he planned to step down, ending his historic fourth term after just a month. He also called Secretary of State Kate Brown, who was in Washington, D.C. for a conference, and summoned her back to Oregon for an emergency, private meeting. On Wednesday, Brown hopped on a plane. But when she was escorted into the governors office, Kitzhaber asked her why she was there. He later announced, emphatically and for the third time in less than two weeks, that he had no plans to resign. Thursday came the political bombshells. Courtney and Tina Kotek, speaker of the state House of Representatives, had met late into the evening Wednesday and finally decided that they had no choice but to demand Kitzhabers resignation. The chaos in the Capitol had been threatening the workings of the Beaver State, where the legislature was in session, executive appointments had to be made, Courtney said, and the \"disruption\" was agonizing. \"Thats what makes this so significant,\" Courtney said Thursday. Beyond asking for Kitzhabers resignation, \"we have no powers. What am I going to do? Im not going to stop committees from meeting. Im not going to stop the session. And then on Thursday, Courtney read the statement that he had written for the day Kitzhaber would resign. The emotional state Senate president and longtime Kitzhaber friend didnt know it at the time, but he was a day premature. \"No public servant has given more to Oregon,\" Courtney said after cataloging the former emergency room doctors long history in public service -- as a state representative, a state senator, president of the state Senate and 12 years in the governors office, \"longer than anyone else.\", \"There is another side,\" Courtney continued. \"He is a friend. He is a son. He is a brother. He is a father. He is a human being. It is all these things for which I hope that he is remembered. I hope all these things are his legacy. He deserves that. Gov. John Albert Kitzhaber MD, Im sorry. I know that together Oregon and her people will get through this.\", State House Republican Leader Mike McLane said it was a sad day for Oregon. I take no delight in John Kitzhabers resignation but understand his decision, McLane said in a statement. The Capitol was a strange mix of somber and festive in the hours leading up to Kitzhabers Friday the 13th announcement. On Saturday, Oregon would be celebrating statehood, and the Oregon Wheat Commission had brought big sheetcakes that proclaimed, \"Happy Birthday Oregon 156.\", State Archivist Mary Beth Herkert had set up shop under the rotunda, one floor below the beleaguered governors ceremonial offices. She flipped the pages of the original Oregon Constitution, a supple document that prepared the state for days just like this one. Article V, Section 8a sets out the line of succession should a sitting governor resign: Secretary of state. State treasurer. President of the state Senate. Several governors before Kitzhaber had resigned, but none did so under a cloud. \"Its amazing all the stuff that they covered in it,\" Herkert said of the constitutional convention and its end result. \"Good and bad.\", Kitzhaber had managed to survive the 11th-hour revelation that his fiancee and decade-long companion had entered into a fraudulent green-card marriage in 1997, receiving $5,000 to wed an Ethiopian national so that he could stay in the country. But he could not survive the deepening scandal. maria.laganga@latimes.com, Follow @marialagangaon Twitter, , 6:42 p.m. This story has been updated with information about the federal subpoena, 2:38 p.m.: This story has been updated with comments from Kate Brown, set to become Oregons next governor. 2:02 p.m.: This story has been updated with comments from the governor of Washington. 1:34 p.m.: This story has been updated with a statement that the governors resignation will not end ethics investigations. 1:16 p.m.: This story has been updated with reaction from political figures. 12:57 p.m.: This story has been updated with reaction from the minority leader. 12:32 p.m.: This story has been updated with additional details about actions leading up to the governors resignation. 12:27 p.m.: This story has been updated with details of the governors resignation. It was initially published at 10:20 a.m.]", "Date": "20150213", "Author": "[Maria L. La Ganga, Nigel Duara]", "Link": "http://www.latimes.com/nation/la-na-oregon-governor-20150213-story.html", "Title": "[Federal subpoena seeks Oregon state records concerning Gov. John Kitzhaber]"}