{"Content": "[ Bernie Sanders, the socialist-leaning senator from Vermont, raised an accurate and depressing point recently about the Koch brothers efforts to expand their de facto new political party of the 1% by pledging to spend $889 million in the next federal election cycle. It is, of course, an outrageous move, though entirely legal under recent Supreme Court decisions that give the rich a bigger bullhorn than the rest of us. Progressives fumed and social media trilled with the usual ineffectual outrage, but the story quickly faded. And that could well be the biggest problem: A cynicism-weighted apathy by voters whose only faith in the political process is that it will be gamed by the wealthy. The anger is there, Sanders told The Washington Post, but its an anger that turns into saying, Go to hell, Im not going to participate in your charade. Im not voting. So its a weird kind of anger. Its not people getting out in the streets.... Were at the stage of demoralization. That about sums it up. We tend to focus on the left-right divide in politics but the deeper threat to a functioning democracy is the numbers who stay out of the process completely. That leaves it to the passionate, and the rich. We are a democracy of the few, not a democracy of the many. As the Post reported in another piece, the $889 million comes close to the $1 billion that each of the two major parties presidential nominees are expected to spend in 2016, and it cements the networks standing as one of the countrys most potent political forces. With its resources and capabilities -- including a national field operation and cutting-edge technology -- it is challenging the primacy of the official parties. So with the Koch brothers Freedom Partners (technically a tax-exempt business lobbying group that promotes the benefits of free markets and a free society), we get a third political party -- just not the kind many people, left or right, might have anticipated emerging. And not the kind that will help improve Americans sense that the political system, and the government, works. A recent survey from Suffolk University found a majority \"expressed dissatisfaction with the two-party system\" while 32% favored a potential third party. And an earlier Suffolk University/USA Today poll taken just before the 2012 presidential election found that while 8 in 10 believethe government plays an important role in their lives (it didnt ask whether that was good or bad), tens of millions of eligible voters dont bother to cast ballots. \"The long-term trend tends to be awful,\" Curtis Gans, director of the non-partisan Center for the Study of the American Electorate, told USA Todayin the lead up to the last presidential election.\"Theres a lot of lack of trust in our leaders, a lack of positive feelings about political institutions, a lack of quality education for large segments of the public, a lack of civic education, the fragmenting effects of waves of communications technology, the cynicism of the coverage of politics -- I could go on with a long litany.\", This is where the real political crisis resides, and what makes it so easy for powerful interests to prevail. That demoralization Sanders mentioned is a downward spiral. The question is, how do we reverse it?, Follow Scott Martelle on Twitter @smartelle.]", "Date": "20150202", "Author": "[Scott Martelle]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-koch-brothers-elections-pacs-20150202-story.html", "Title": "[Are Americans too jaded about politics to care anymore?]"}