{"Content": "[ Joe Biden was not the only one who found himself in crisis when a videotape emerged during the 1988 presidential primary exposing him as a plagiarist. The political operatives who had secretly distributed footage of Sen. Biden passing off the words of a British politician as his own also had a big problem on their hands. Their disclosure nearly derailed the candidacy of the rival the operatives worked for, Michael S. Dukakis. He fired them and issued a major mea culpa. Dont expect any such apologies in this years presidential race. Political opposition research, once a mostly unmentioned dark art, has turned into a garish, multimillion-dollar enterprise complete with logos, marketing strategies and indiscriminate, real-time streaming of the work product onto social media. Changes in the way voters consume information, a numbness to the negative politicking that once so offended them and the emergence of new research and data distribution technologies are driving once-shadowy operatives into the sunlight. The prominence of super PACs and campaign-oriented nonprofits also plays a role. The research machines have emerged from the back office of party headquarters and into the high-stakes world of political fundraising. Our focus is driving negative news narratives against [Hillary Rodham] Clinton, said Colin Reed, executive director of America Rising PAC, a formidable Republican operation with scores of staffers scouring campaign events, public filings, social media and any other resource they can find for nuggets that might harm the Democratic candidate. This self-styled new generation of Republican research and rapid response is split into two organizations. The PAC distributes material generated by a much bigger private company staffed with researchers. The higher the profile the PAC creates, the more clients the business side reels in. Things once considered taboo just arent taboo anymore, said Alan Huffman, an opposition researcher who co-wrote a book about the craft, Were with Nobody. He attributes the ability of groups like America Rising to distribute attack after attack with little risk of voter backlash to the Monica Lewinsky scandal, when so many tawdry details were unearthed that the public became jaded to the airing of a politicians dirty laundry. Others point to the modern news cycle, which is filled with outlets  many of them partisan  constantly trolling for content. Operatives who once valued discretion above all else now focus on mass disbursement, as items placed with even the most fringe websites can gain traction and dominate a news cycle. Never before have there been so many hit jobs peddled to the media, to gadflies, to swing voters  to anyone who might notice  so openly and swiftly. Its reached the point where you have trackers tracking other trackers, said GOP strategist Kevin Madden, referring to low-level operatives who follow candidates around and record their every public utterance. This used to be guerrilla warfare. Now it is out in the open. Just how little discretion there is anymore was clear this month in New Hampshire during a bizarre encounter in which a Rand Paul staffer expressed his irritation with a Democratic tracker by licking his camera. The video went viral on Twitter. Back at America Rising, Reed proudly ticks off the damage his group has inflicted on a range of candidates. He guides a reporter through the process of finding and then leaking an embarrassing internal memo from the campaign of Michelle Nunn, a Democrat from Georgia who lost her bid for Senate last year. It mostly involved clever use of Google. The method was not that different in 2006 when Democratic operatives stumbled on an embarrassing audiotape of California Gov. Arnold Schwarzenegger  only then, nobody was rushing to take credit for finding the material. The governor launched a state police investigation to find out who slipped the audio to the Los Angeles Times. No wrongdoing was discovered, just some poor file management by the Schwarzenegger administration. The veil over such research tactics lifted in 2011, when Democrats created a group called American Bridge. The founders of American Bridge, the first super PAC devoted exclusively to researching damaging information on GOP candidates, leveraged big donations from labor unions and donors such as George Soros to fund an army of campaign trackers and data miners. The outfit repeatedly frazzled the campaign of GOP presidential nominee Mitt Romney in 2012, taking aim at his voluminous tax returns and his comments to donors that 47% of the electorate are dependent on government and believe that they are victims. It was American Bridge that doomed the Senate candidacy that year of Missouri Republican Todd Akin, seizing on his comments about what constitutes legitimate rape to dash GOP hopes in what was supposed to be a winnable race. Now, American Bridges leaders have formed another super PAC, called Correct the Record, that will push the boundaries of campaign finance law by directly coordinating its research efforts with Clintons presidential campaign. The burgeoning oppo industry is an example oft-cited by those who warn big money is corroding democracy. They are raising these pools of unlimited money, and none of it is going toward elevating the political debate, said Robert Maguire, an investigator with the Center for Responsive Politics. The aim of these groups is to embarrass the candidates they dont like, whether it is by publishing books full of opposition research or this creepy tracker element. Maguire finds it particularly distasteful that an organization like American Bridge has been granted tax-exempt status by the IRS, a designation set aside for charities  and specifically not allowed for political campaigns. The goal of American Bridge is, We want Democrats to win, so here is all the slime we can heap on Republican candidates, he said. Brad Woodhouse, a former president of American Bridge who now runs Correct the Record, takes exception. If you are getting more info out there about candidates that fills in their biography, fills in their thinking, fills in their policy proposals, their philosophy or their inconsistencies, or their pandering or whatever it is, it has to be better than not having that information out there, he said. Woodhouse points to the Akin example. But for every example like that, dozens more are far less heady. American Bridge has equipped its trackers with technology to live-stream events, enabling headquarters to blast gaffes in the field onto social media before an event even ends. It boasts of a recent success involving a Jeb Bush misstep getting posted online in less than 20 minutes. The candidates error: mispronouncing Nevada. evan.halper@latimes.com, Twitter: @evanhalper, 6:55 p.m.: The story was updated throughout with new details. The story was originally published at 3 a.m. on May 21. ]", "Date": "20150527", "Author": "[Evan Halper]", "Link": "http://www.latimes.com/nation/la-na-opposition-research-presidential-election-20150521-story.html", "Title": "[Once a dark art, opposition research comes out of the shadows for 2016 campaigns]"}