{"Content": "[ For most of the year, it seemed almost certain that Republicans would win the six additional U.S. Senate seats they need to oust the Democrats from their majority and take control of Congress. But the outlook has turned murkier in recent weeks. While a GOP majority is still the most likely outcome, its no longer as sure a bet. Endangered Democratic incumbents in North Carolina and Alaska are waging surprisingly strong campaigns, and a Republican incumbent in Kansas is in unexpected trouble. \"We dont have a lock on this thing at all,\" one GOP strategist told me recently. It even seems possible that Senate elections could end in a draw, with a 50-50 split, in which case Vice President Joe Biden would cast votes as a tiebreaker. And thats not even the most exotic possibility. One scenario is a Senate in which neither major party wins 50 seats. The next Senate will include two, maybe three independents. Incumbents Bernie Sanders of Vermont and Angus King of Maine, whose seats arent up this year, may be joined by Greg Orman, a newcomer who leads the polls in Kansas. Sanders, a socialist, would continue to vote with Democrats, but King and Orman, both centrists, would be wooed by both parties  and could instantly become two of the most powerful politicians on Capitol Hill. We could see senators switching sides. Republicans are talking hopefully about persuading Sen. Joe Manchin III (D-W.Va.), the Senates most conservative Democrat, to cross the aisle and sit with them. Manchin has so far dismissed the idea, but that wont stop the GOP from trying. And the Senates makeup could be in doubt for months after the election. In Louisiana, if no candidate wins 50%, the state holds a runoff on Dec. 6  and thats likely to happen, since the \"jungle ballot\" includes three Republicans running against incumbent Democrat Mary L. Landrieu. In Georgia, if no candidate wins 50%, the state holds a runoff on Jan. 6  one day after the new Senate convenes. In other tight races, recounts could take months; Sen. Al Franken (D-Minn.) waged an eight-month recount battle before claiming his seat in 2009. But the most intriguing scenario for next years Senate, paradoxically, is the least exotic one: What happens if Republicans win a slim majority of 51 or 52 seats?, The party would then be like the dog who caught the car and has to figure out what to do with it. When the two houses of Congress have been held by different parties, gridlock has made governance almost impossible. But if the GOP controls both the Senate and the House, its members will be under pressure to govern. At least in the Senate, where 60 votes are needed to move major legislation, theyll even have an incentive to compromise to rescue their wholly owned legislative branch from the dank cellar of public esteem. \"To elect a president in 2016, were going to have to show in 2015 and 16 that the American people can trust Republicans with the government,\" Sen. Lamar Alexander (R-Tenn.), a leading GOP deal-maker, said recently. But that wont be easy. For one thing, the Senate GOP is deeply divided. On one side are pragmatic conservatives such as Alexander and Ohios Rob Portman, who want to pass a budget, rein in federal regulations and maybe even tackle tax reform  and are willing to work with Democrats to do it. Portman even sounds enthusiastic about the prospect, pointing to earlier eras when Presidents Reagan and Clinton negotiated successfully with opposition majorities. \"I know I may sound naive,\" he said, but \"when we have divided government, thats when weve done tax reform; thats when weve done entitlement reform.\", Opposing them from within the party, however, is the take-no-prisoners caucus of Sen. Ted Cruz (R-Texas), conservatives who want to send uncompromising bills to the White House (beginning with the repeal of Obamacare) and force President Obama to veto them. The man in the middle is Sen. Mitch McConnell of Kentucky, the GOP leader, who wants to do a little of each. When he talks to conservative donors and voters, McConnell sounds as ferocious as any tea party militant. Obama \"needs to be challenged, and the best way to do that is through the funding process,\" McConnell told Politico last month. \"Were going to pass spending bills, and theyre going to have a lot of restrictions on the activities of the bureaucracy.\", But when he realized that sounded as if he were threatening a government shutdown, McConnell told reporters that wasnt what he meant. \"Im the guy who gets us out of government shutdowns,\" he insisted. Can the GOPs pragmatists resist their partys swing to the right, strike alliances with centrist Democrats and actually pass important legislation next year?, The odds appear stacked against them. But its worth a try  and at least would offer a new, more interesting form of gridlock. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus]", "Date": "20140916", "Author": "[Doyle McManus]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-mcmanus-column-senate-makeup-20140917-story.html", "Title": "[What happens if Republicans win the Senate?]"}