{"Content": "[ Im Davan Maharaj, editor of the Los Angeles Times. Here are some story lines I dont want you to miss today.     Subscribe to the newsletter , TOP STORIES, Round 2, Ten men and one woman stood before an audience Wednesday night at the Reagan Library in Simi Valley in the second televised debate for Republican Party presidential candidates. At the end, they were all still standing. But this time Carly Fiorina got to duke it out with the others on the main stage, and Donald Trump took some lumps. Heres what they said about immigration, foreign policy and a threatened government shutdown. Los Angeles Times, Rivals Get Revved Up, Our politics team was out in force at the debate. Political analyst Cathleen Decker writes about how Trumps foes dished it right back to him. Read also television critic Mary McNamaras take on the hours-long CNN broadcast. Follow our complete coverage of the debate at our Trail Guide campaign blog and sign up for our free Essential Politics newsletter. All Roads Lead to Germany, Syrian refugees fleeing their countrys civil war arent the only ones beating a path to Germany through other European countries.Iraqis, Afghans, Pakistanis, Somalis and residents of the Balkan states trying to improve their circumstances also have joined the mass exodus of migrants. European authorities are establishing new restrictions at their borders to prioritize the asylum seekers and quell the tide. Shake, Shake, Shake, The division between renters and landlords is sometimes described as a gulf. Soon it could be an earthquake fault. Since Los Angeles Mayor Eric Garcetti called for comprehensive earthquake-retrofitting laws, tenant advocates, owners and city housing officials have debated how to pay for the renovations to apartment buildings. A compromise to split the costs is in the works. Los Angeles Times, Service With a Smile, No admission fee. No central information desk. No on-site restaurant. The Broad museum, which has itsopening-night gala this evening in downtown L.A. and opens to the public on Sunday, will have something else. Black-clad visitor service associates who will act as combination security guards/art guides/concierges, to help improve the gallery experience for the viewing public. Untraditional, to be sure. Just like the art inside. Los Angeles Times, CALIFORNIA, -- Magnitude 8.3 Chile earthquake bringstsunami advisory for California coastline. -- Steady rains aid firefighters battling devastating fires. --LAUSD cannot blame a 14-year-old girl for her own sexual assault, appellate court rules. -- What is El Nio bringing besides rain? Hammerhead sharks, experts say. -- UC regents chair defends proposed principles against intolerance. NATION-WORLD, -- Seattles aerospace and tech worlds prepare to welcome Chinese President Xi Jinping next week. -- No bomb charges will be filed againstMuslim boy who brought homemade clock to Texas high school. --Yemens exiled prime minister returns to Aden to re-establish government. -- Argentina remembers the future Pope Francis as a man of the people. -- Cuban PresidentRaul Castro will address the United Nations this month. --Magnitude 8.3 earthquake strikes near Chiles capital, prompting strong aftershocks. BUSINESS, --U.S. poverty rate and incomes remained stagnant in 2014, Census Bureau report says. --Beer takeover offer could put Budweiser, Corona, Miller under one roof. -- Honda unveils the 2016 Civic, the 10th generation of its venerable, bestselling sedan. SPORTS, -- Records set duringDodgers-Rockies marathon game might never be broken. -- Bill Plaschkes Wakeup Call video: Should Dodgers outfielder Yasiel Puig play in the postseason?, --2024 Olympic bid process kicks into next gear. -- Chris Erskine catches up to Tommy John and his famous elbow. ENTERTAINMENT, -- Backup singer Darlene Love steps into the limelight with a new album. -- At Toronto, film adaptation ofEmma Donoghues Room looks to break out. --Matt Damon apologizes forProject Greenlight diversity flap. WHAT OUR EDITORS ARE READING, -- The Atlantics CityLab looks at how schools are run in London. -- Zcalo Public Square invites scholars to discuss whether Hawaii is a racial paradise. -- These trading cards feature art photographers, instead of baseball players. (Smithsonian magazine), ONLY IN CALIFORNIA, Baseball fans know Tommy John. Or they know his elbow, at least, and the surgery Dr. Frank Jobe performed to repair it. After believing his career was shot, the Dodgers pitcher went on to play until he was 46 and racked up 288 wins on the mound. Baseball fans might not know about his son, Tommy John III, who learned something from his dads crisis. Now hes a chiropractor in the sports medicine field. Thanks, Dad. Please send comments and ideas to Davan Maharaj.]", "Date": "20150916", "Author": "NULL", "Link": "http://www.latimes.com/la-me-todays-headlines-20150917-story.html", "Title": "[Today: Dump on Trump. Watching for Big Waves.]"}