{"Content": "[ Fewer than 50 days before an election that may give Republicans control of the Senate as well as the House, Sen. Rand Paul (R-Ky.) on Saturday skipped past those contests entirely to focus on one in which he may play a more central role  the 2016 presidential race. Paul, the featured speaker at the California Republican convention, made no mention of the partys national advantages this year. He blasted President Obama and potential Democratic nominee Hillary Rodham Clinton as insufficient present or future commanders-in-chief. He insisted that the GOP must dramatically expand its reach in order to win presidential contests  a strategy that coincides with his pre-presidential efforts. He accused Obama of confounding the Constitution when he expanded Obamacare, moved against overseas targets without specific congressional authorization, and announced plans  since delayed  to use executive action to change the nations immigration laws. It is a terrible tragedy, it is a danger to us as a country, and we need to do everything we can to stop him from abusing our laws, Paul said. He said later, \"We have a president who basically has created a lawless atmosphere in Washington. Speaking about Clinton, he used her famous 2008 primary ad, which argued that she more than Obama would be the president capable of answering a phone call about a middle-of-the-night crisis:, I think she had a 3 a.m. moment. She didnt answer the phone, and I think it absolutely should preclude her from being [president], he said after detailing what he termed her failings leading up to the 2012 attack on the U.S. mission in Benghazi, Libya. (His final word was obscured by applause from the strongly anti-Clinton crowd.), Those were the easy targets, however. Pauls more passionate appeal was one that he has forwarded across the country in such unlikely venues as UC Berkeley. Pauls argument  that the party needs to expand from its older and white base, groups amply represented among the delegates  was framed as one that could reverse the partys long record of thumpings in California and its national presidential losses. When our party looks like America  with earrings and without earrings, with ponytails and without ponytails, with tattoos and without tattoos  when we look like the rest of America  white, black, brown  were going to win again, he told an audience gathered near LAX. Weve got to go out and weve got to broaden our party, and when we do, well be a national party again. We will win again. Paul suggested a freshening of the GOP message  he did not, he said, mean to suggest that the party dilute its principles and be more like Democrats  in order to attract young voters and the Latino and African American voters who have spurned the party in California and elsewhere. He specifically cited issues he has pressed for months, including the NSAs mining of data from cell phones, what he termed excessive sentences for drug use and expanding the ability of voters to cast ballots. What you say or do on your cell phone is none of the governments damn business, he said. But as he made his argument there was a bit of a reality check in the room  Neel Kashkari, the partys nominee for governor. The child of immigrants from India, Kashkari has conducted an unusual campaign: He spent time posing as a homeless person to underscore his criticism of Democratic policies on poverty, and he marched in a gay rights parade in San Diego. And he remains the longest of long shots in November, trailing Democratic incumbent Jerry Brown by 21 points among likely voters in a recent USC Dornsife/Los Angeles Times poll. The same poll found that state Republicans were the antithesis of Pauls vision of a diverse party: 74% were white and only 25% either Latino, African American or Asian. (Among Democrats, half were non-white, far more similar to the state overall.) Almost 6 in 10 state Republicans were 50 or older, meaning that the party serves to suffer as its members are replaced by younger voters who are far more likely to be Democratic or nonpartisan. In an interview after his speech, Paul lauded Kashkaris candidacy and described him as someone who could be the face of a new GOP. But when reminded of Kashkaris distant second-place standing, he acknowledged that change could be slow in coming, even if the Republican party follows his advice. We became the minority party in California over, what, 20 years? he asked. It didnt happen overnight. To reverse it takes a while, but I think hes saying and doing all the right things. Without trying, he added, well never win. For political news and analysis, follow me on Twitter: @cathleendecker , , , , , , , , , , , , , , , ]", "Date": "20140920", "Author": "[Cathleen Decker]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rand-paul-blisters-obama-and-clinton-calls-for-gop-diversity-20140920-story.html", "Title": "[Rand Paul blisters Obama and Clinton, calls for GOP diversity ]"}