{"Content": "[ On her second trip to Iowa since her presidential caucus loss in 2008, Hillary Rodham Clinton got a piece of Iowa swag that could prove useful for her new grandchild -- and for Clinton herself if she runs in 2016: a black and gold University of Iowa sleeper emblazoned with the Hawkeye logo. It was a nod to Clintons plans from Rep. Bruce Braley, the Democratic candidate for Senate here, who proclaimed that the most important birthday in America in 2014 was when sweet Charlotte\" -- the first grandchild of Hillary and Bill Clinton -- \"was born. So I decided it would be appropriate for Charlotte to have a memento of this trip  since this is the Hawkeye State, he said. Of course, Clinton was here in Iowa not to discuss her own future but to campaign for Braley, who handed over the baby pajamas just before ceding the microphone at a preelection rally held at the headquarters of the local ironworkers union. Though President Obama carried Iowa in 2012, Braley is locked in one of the tightest races for U.S. Senate in the country, with Republican State Sen. Joni Ernst, a lieutenant colonel in the Iowa Army National Guard who is running on a promise that she would bring Iowa ways to Washington, D.C. Braley and his fellow Democrats have tried to paint Ernst as too extreme for Iowa, particularly given its increasingly blue tinge. As with Senate candidate Cory Gardner of Colorado, Democrats have argued that Ernst is far more conservative than most Iowa women on issues such as abortion and personhood. On Wednesday, both Braley and Clinton spent a good deal of time discussing those issues, as well as their support for raising the minimum wage and wage equality for men and women. It is not enough to be a woman. You have to be committed to expanding rights and opportunities for all women, Clinton said in a dig at Ernst, made without mentioning her name. She laid out a series of questions for Ernst and other GOP candidates on personhood measures -- which would give full human rights from the moment of conception -- and access to affordable contraception coverage. Theres a big difference between these two candidates,\" she said. Clinton also touted the nations improving economy  You can see Americas comeback  but quickly noted that the economy had not improved for everyone and that it was increasingly hard to maintain a middle-class lifestyle. We have more work to do, and thats whats going to be on the agenda of your next senator, she said. She also reminded the crowd of her husbands record as president. Millions of new jobs were created, more families made it into the middle class, and more families got lifted out of poverty, she said to applause. Clinton acknowledged that she was preaching to the choir, by urging members of the audience to get out and vote, but she encouraged them to nudge their friends and neighbors to the polls. Campaign staff kept the event intimate, using tickets to cap the crowd at a couple of hundred people, who filled the front third of the hall between barricades that separated the crowd from the stage on one end and the press area on the other. There is a path that can lead you to a better world, Clinton said, joking that she was taking on the role of preacher. And that path leads to the kind of senator that Iowa deserves. If you want a senator who doesnt believe that Iowa is for sale to the highest bidder, please do everything you can for the next six days. \"You dont want to wake up a day after the election and wish you had done more, Clinton said. Dig deep. Knock on those doors, make those phone calls. Twitter: @MaeveReston]", "Date": "20141029", "Author": "[Maeve Reston]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-hillary-clinton-bruce-braley-iowa-20141029-story.html", "Title": "[Hillary Clinton to Iowa voters: 'Dig deep' for Democrat Bruce Braley]"}