{"Content": "[ Afterthe 2012 presidential election, when the Republican Party lost Latino and minority voters by wide margins, the GOP decided it needed to do a better job attracting those groups. But despite several years of outreach, the effort has run into limitations. Congress, in particular, has stumbled as Republicans repeatedly voted against immigrant-friendly measures that many Latino and minority voters support. The effort hit another rough patch Thursday. House Republicans voted to block a measure that would have allowed the Pentagon to consider allowingyoung immigrants who are in the country illegally -- but were given temporary legal status under a program startedby President Obama-- to enlist in the military. The measure had already won bipartisan support in the House Armed Services Committee when several Republicans joined Democrats toadd it toabig defense spending package. Passage would have meanta sizable shift in Republican thinking on immigration-related matters. But the provision ran into trouble when the House Republican majority decried it as a back-door \"amnesty\" for immigrants here illegally. Most Republicans oppose Obamas immigration actions. Rep. Mo Brooks (R-Ala.) led the effort to strip the measure from the defense bill, arguing that every immigrant allowed to enlist would take away a military spot for a U.S. citizen or lawful immigrant. \"This Congress should support and represent Americans by voting to stop military service opportunities from being taken from struggling Americanfamiliesin order to give them to illegal aliens,\" Brooks said. The Armed Services Committee chairman, Rep. Mac Thornberry (R-Texas), said the measure distracted from the essential purpose of the defense bill. In the end, the House voted 221 to 202 to remove the measure. Democrats called the Republican effort \"xenophobic,\" \"extremist\" and \"un-American.\", \"This is yet another example of anti-immigrant attitude on the part of the House Republicans,\" said Rep. Nancy Pelosi (D-San Francisco), the minority leader. \"The dreamers in this country are deeply patriotic,\" said Rep. Ruben Gallego (D-Ariz.), the measures author, referring to the name the young immigrants call themselves. \"Many of them want nothing more than to serve the United States in uniform.\", More than 100,000 foreign-born people were serving in the military as of 2009, according to the Immigration Policy Center. Thoughmost of them were naturalized citizens, about 12% were not -- some of them having entered the military illegally, probablyusing false papers. After the Sept. 11, 2001, attacks, President Bush enabled expedited citizenship to military personnel who had served. Under the measuredebated Thursday, the Pentagon would have been authorized to review whether young people who had been in the country since childhood and qualified for temporary legal status under Obamas Deferred Action for Childhood Arrivals program could enlist. The immigrantswould not have been given a specific citizenship path under the House measure, which was was backed by leading immigrant advocacy organizations, as well as FWD.us -- the large organization backed by tech industry leaders including representatives from Microsoft, YouTube, Yahoo and Instagram. The presidential campaign of Hillary Rodham Clinton, who has backed immigration reform, weighed in from the trail. \"If these courageous young men and women want to serve, they should be honored and celebrated, not discriminated against,\" said Amanda Renteria, Hillary for Americas national political director. Several Republican lawmakers broke ranks with their party to speak in support of the effort, and about 20 of them voted with the Democrats. But in the end, their efforts were not enough to change the GOP course on immigration policy. For the latest from Congress follow @LisaMascaro]", "Date": "20150514", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/la-pn-immigrants-military-20150514-story.html", "Title": "[Republicans block young immigrant 'dreamers' from military ]"}