{"Content": "[ The mission on Saturday was simple: Appeal to some of the wealthiest Republican Jewish donors in the country. The method was direct: Heap lavish praise on Israel, with an ample serving of disparagement for President Obama. And so they did -- two GOP presidential hopefuls, a third possible White House contender and an Ohio senator facing a potentially tough reelection fight back home. Texas Sen. Ted Cruz: \"Sadly, the American friendship and alliance with Israel has never been more imperiled than it is right now today under this administration.\", Former Texas Gov. Rick Perry: \"Ignoring the lessons of history, our president aims to sign an agreement with a nation that is the worlds largest state sponsor of terrorism, the Islamic Republic of Iran.\", Indiana Gov. Mike Pence: \"Im a Christian, a conservative and a Republican and I support the Jewish state of Israel.\", Ohio Sen. Rob Portman: \"I see a world that is more dangerous than anytime since 9/11 . I also see a president unwilling to lead.\", The setting was a chandeliered ballroom at the Venetian Resort, an Italianate edifice on the Las Vegas Strip and the business headquarters of gambling magnate Sheldon Adelson. The audience was nearly 800 members of the Republican Jewish Coalition, who responded lustily to the serial attacks on Obama and on a proposed nuclear deal with Iran and to repeated, avid pledges of devotion to Israel. \"The love for Israel, the passion for defending and standing with Israel: That goes through the heartland and every corner of this country and cities large and small,\" said Pence, drawing one of the days several standing ovations. The three-day annual gathering, which began Thursday, has become something of a command performance for GOP presidential hopefuls, not least because Adelson, a major benefactor and one of the worlds richest men, is also one of the most prodigious donors in American politics. (He was absent from Saturday mornings session, the only one open to media coverage, choosing to sample the visiting political luminaries behind closed doors.), Adelson spent about $100 million in the 2012 election and has indicated plans to issue a blizzard of checks again in 2016; the $15 million alone he spent on Newt Gingrichs failed presidential bid was enough to keep the former House speaker running long after his political viability had passed. For that reason, Adelsons support is among the most coveted prizes sought by Republicans eyeing the White House. Cruz, who spoke first, winkingly acknowledged the expectations placed on the courting candidates. \"It is not complicated for Republican politicians to come to the RJC and say, We should stand with Israel. Unless youre a blithering idiot, thats what you say when you come here,\" Cruz said to knowing laughter and a smattering of applause. \"For anyone that doesnt get that, we have medical treatment available.\", Each of the speakers was scathing in assessing a preliminary deal that would lift economic sanctions on Iran in exchange for limits on the countrys nuclear program, an effort to stop development of a nuclear weapon. \"A terrible, terrible deal,\" Cruz called it. The struggle, then, was how to stand out in a field of White House prospects all saying, essentially, the same thing. Cruz, a Senate freshman who declared his presidential candidacy last month, said the test was past performance. He cited a litany of pro-Israel legislation he helped enact. \"I joined with New York Sen. Kirsten Gillibrand in offering a resolutioncondemning Hamas use of human shields, women and children, as a war crime,\" he said, referring to the Islamist movement. \"And it passed both houses of Congress unanimously.\", Perry, who iseying his second try at the White House, outlined a hawkish foreign policy that included vows to move the U.S. Embassy in Israel from Tel Aviv to Jerusalem and a pledge to support added construction within settlements on the disputed West Bank. Pence, a former House member who has been mentioned as a long shot prospect for 2016, touted his friendship with Eric Cantor, a Jewish Republican and favorite of the organization, who rose to the second-ranking position in the House before his upset defeat in a primary last year. Although the harshest rhetoric was reserved for Obama, the Democrats 2016 front-runner, former Secretary of State Hillary Rodham Clinton, did not go unscathed. Cruz at one point attacked the \"Obama-Clinton foreign policy.\" Perry mentioned Clintons March 2009 presentation of a reset button to Russias foreign minister, a gift-wrapped token jokingly intended to symbolize new and better relations between the two longtime adversaries. \"If only we had known she was going to reset us back to the Cold War,\" Perry scoffed, vowing to make Obamas policy toward Russia and the aggression of President Vladimir Putin an issue in 2016. There was no obvious crowd favorite, though Cruz received perhaps the most enthusiastic response when he addressed a moderators question about the difference between himself and Obama, who also ran for president as a freshman senator. \"President Obama is not a lousy president because he was a senator,\" Cruz said tolaughter and applause. \"President Obama is a lousy president because he is a radical ideologue and zealot, and the ideas he believes have been profoundly dangerous to the United States and the world.\", Last year, former Florida Gov. Jeb Bush and Govs. Chris Christie of New Jersey, John Kasich of Ohio and Scott Walker of Wisconsin made the trek to this desert metropolis to audition before Adelson and others ranking among the GOPs biggest political givers. This year, Perry and Cruz spoke during the public part of the gathering while two other prospective White House contestants were welcomed to try out in closed sessions: South Carolina Sen. Lindsey Graham and former New York Gov. George Pataki. Also speaking behind closed doors were House Speaker John Boehner; the 2012 GOP nominee, Mitt Romney, and former President George W. Bush. Follow  @markzbarabak fornational and California politics, 2:30 p.m.: This post was updated with additional quotes. It was originally posted at 1:24 p.m.]", "Date": "20150425", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-republican-jewish-donors-20150425-story.html", "Title": "[In Las Vegas, GOP candidates court Jewish donors by supporting Israel]"}