{"Content": "[ Not many people can prompt New Jersey Gov. Chris Christie to apologize for his word choices or get former Florida Gov. Jeb Bush to distance himself from a family loyalist. But Sheldon Adelson, the billionaire casino magnate, has done both. The octogenarians power is in his money  and a demonstrated willingness to spend it freely to make or break political campaigns. He is among a growing, but still elite, group of very-big-dollar donors who can spend enough to keep an entire presidential campaign viable, even in the face of voter rejection. Competition for the high rollers is so fierce among this years unusually large Republican field that it has created a race within the race: the wealthy donors primary, a model that has eclipsed the traditional presidential campaign structure. Now, presidential hopefuls vie for the backing of millionaires and billionaires long before a primary vote is cast  and that money and support will empower them to stay in the race more deeply into primary season, perhaps right up to the national conventions. Theres the Adelson Primary  not to be confused with the so-called Koch Brothers Primary, the Norman Braman Caucus or the Larry Ellison Event, named for the industrialist brothers, the South Florida car dealer and the tech entrepreneur, respectively, each of whom have all but guaranteed big payoffs to one or more candidates. The race for the billionaires  its changed everything, said Sen. Lindsey Graham (R-S.C.), who announced his own presidential bid last week in a still-growing field. In previous presidential campaigns, before the age of the mega-donor, money tended to track results, said Tom Rath, a longtime Republican strategist in the early primary state of New Hampshire. A victory or a strong showing in an early primary or caucus would indicate legitimacy, drawing donors and media attention, he said. Then, in 2012, Adelson spent $15 million through a super PAC to keep former House Speaker Newt Gingrich in the race for the Republican nomination for president long after other backers and voters had moved on. Such political patronage was novel then, as the implications of rapidly weakened enforcement of campaign finance rules were still being explored. Now big-money backers are almost required for political survival. This year nearly every candidate in the GOP field, which could exceed 20 people, is seeking a patron. And they have shown little shame in groveling. Send some my way! said Graham, only partly in jest. For his own long-shot bid, Graham drew the backing of billionaire investor Ronald Perelman. Candidates have been regularly parading in front of Adelson, often at forums hosted for a small group of like-minded donors at one of his Vegas resorts. Christie apologized to Adelson after referring during one of those meetings to the occupied territories  a commonly used reference to the West Bank and East Jerusalem, but one that conservative supporters of Israel like Adelson abhor. Likewise, Jeb Bush moved to distance himself from a longtime family friend, former Secretary of State James A. Baker III, who criticized Israeli Prime Minister Benjamin Netanyahu. Adelson has yet to pick a candidate this year. Sen. Ted Cruz (R-Texas) won positive reviews from attendees at one of the events, according to those familiar with the gathering, though others say Adelson has been eyeing Sen. Marco Rubio of Florida. That would be a coup for Rubio, who already has the backing of Braman, a longtime supporter who has indicated he is likely to spend millions. Im committed to provide very substantial support, Braman, the former Philadelphia Eagles owner, said in an interview days before Rubio announced his candidacy. Braman has been close to Rubio for years and hired the senators wife, Jeanette, to handle his familys charitable giving. Backers of Sen. Rand Paul (R-Ky.), who has yet to sign up a mega-donor, are hopeful his recent filibuster-like attempt to shut down government surveillance operations will land him a billionaire. He shouldnt have much trouble. The one thing I can tell you is there are more billionaires than you think, Graham said. Still, he believes no candidate can win the nomination without shaking the hands of voters and attending house parties in the early primary states. Foster Friess, a conservative businessman, spent more than $2 million to help keep the threadbare campaign of former Sen. Rick Santorum (R-Pa.) afloat and has said he will contribute again but at a lower profile. I have decided to keep the amount of my political giving to myself. Im sure folks can find it out, somehow, but Im going to be a little more circumspect this go-round, Friess said by email. Is it fair or not for big donors to be giving so much? Does it create some kind of inherent unfairness? he went on. I guess Id have to ask, is it fair to put limits on how people spend their money? We are supposed to be a free country, but as I open the paper each day, I see more and more of our freedoms eroding. For Democrats, big donors include California environmental activist Tom Steyer, who spent $69.2 million on the 2014 midterm elections and is spending money in early primary states ahead of 2016. But the dominance of Hillary Rodham Clinton in the polls will mean Steyer and other liberals are less likely to influence the primary contest. The power to bring relevance to candidates or push them into the top tier gives big GOP donors unrivaled clout. You have a sense of, shall we say, a certain amount of debt, obligation, to one or two or three people who are your reason why you existed, said Sen. John McCain of Arizona, the 2008 Republican presidential nominee who also co-wrote the campaign finance rules that have since been gutted by court decisions. McCain, like many Republicans, blames President Obamas rejection of public matching money in 2008  when he seriously outspent McCain on his way to defeating him  for unleashing much of the flood of money. But it was court decisions and the 2012 election that showed the potential for big donors to spend unlimited dollars and blunt early primary results. Witness Iowa, where Republicans long risked near banishment from the state if they failed to support a federal requirement to use corn-based ethanol and other renewable fuels in gasoline  a boost to the states farm economy. No more. Charles and David Koch, the energy billionaires who have become the leading donors in Republican politics, oppose the requirement, calling it unwarranted government intrusion in the free market. Bush said in March that he wants to phase it out. Wisconsin Gov. Scott Walker has hedged his position, saying he might do the same. Cruz has sponsored a bill to eliminate it. Those three candidates, along with Rubio and Paul, were named by Charles Koch as being on a shortlist of candidates he might support, though that is unlikely to discourage others from courting the Kochs. Louisiana Gov. Bobby Jindal recently reversed his support for the Export-Import Bank, a government-backed credit agency that lends to foreign buyers of American products. The Kochs oppose the bank, putting them at odds with many conservative allies, including the U.S. Chamber of Commerce. Former Texas Gov. Rick Perry, who once evangelized in the banks favor, recently penned an op-ed in the Wall Street Journal explaining his newfound opposition to it. Although the age of the mega-donor may transform the nominating process, it remains to be seen whether it will lead to an election day victory. John Weaver, who served as McCains political advisor for his presidential runs in 2000 and 2008, noted that the influence of such donors in 2012 made Mitt Romney, the eventual Republican nominee, believe he had to take more conservative positions during the primary, hurting him in the general election. If a candidate doesnt really have grass-roots support, financial support, and cant raise money broadly  then what the hell are they doing? Weaver said. Nonetheless, like others, he expects more candidates to stay in the race longer this year. They may be able to survive a poor showing in Iowa, New Hampshire, South Carolina or Nevada and continue campaigning, even if they are long shots to get the nomination. The decider, Rath said, becomes something other than the ballot box. @lisamascaro, @noahbierman]", "Date": "20150609", "Author": "[Lisa Mascaro, Noah Bierman ]", "Link": "http://www.latimes.com/nation/politics/la-na-battle-for-the-billionaires-20150609-story.html", "Title": "[Forget voters: Presidential rivals battle to win over billionaires]"}