{"Content": "[ Mitch McConnell, the Senates top Republican, has never been closer to snaring the job hes dreamed about for years: majority leader. Let me set the agenda, McConnell told supporters recently at a coal processing plant in this central Kentucky town, using a little football lingo to remind voters that he stands to lead Congress upper chamber if he and the GOP win in Novembers midterm elections. Make me the offensive coordinator. Less than a year after a widely unpopular government shutdown dealt the GOP a political hit, McConnell and his fellow Republicans -- who already hold the majority in the House -- see total control of Congress within their grasp. On Tuesday, McConnell easily dispatched his GOP challenger in the midterm primary. But even as he celebrated victory, there was a growing fear inside the party that the GOP-establishment-versus-tea party battles that have vexed House Speaker John A. Boehner for four years will simply spread to the other side of the Capitol. Much of the Washington gridlock in recent years has come not only from partisan bickering, but from GOP infighting. Deep divisions remain among Republicans about how to address issues such as immigration and the deficit, and such struggles could only intensify with a new Senate majority that includes centrists such as Maines Susan Collins and small-government, libertarian-minded conservatives such as Sens. Ted Cruz of Texas and Rand Paul in Kentucky. The success of a Republican Congress would rest largely on McConnell, an veteran lawmaker who worked his way up from being a Capitol intern to serving in President Fords Justice Department, before returning to Kentucky to start his own political career. Fellow Republican and former Majority Leader Trent Lott called McConnell a creature of the Senate, and said the leadership post is one McConnell has long aspired to. He views it as a historic event, and a chance to make a difference, Lott said. I dont think hes just looking for the glory of it. But Lott added thatsucceeding in the role wouldnt just be a test of McConnells skills, its also going to take a different attitude among his troops. That might explain why McConnell, 72, and other Republicans are already working to lower expectations about what is achievable. When youre in the majority, you have more responsibility, McConnell said in a recent interview. And it is challenging. Even a Republican wave this fall would likely give the GOP only a razor-thin majority, perhaps just the 51 votes they would need to end six years of Democratic control of the upper chamber. But thats not enough in a body where any major legislative action requires a filibuster-proof 60 votes. Were not going to have 60 votes, said McConnell, who has developed a reputation as a shrewd political strategist and master of arcane Senate procedure. It is important to remember Barack Obama will still be president for two more years, and the veto pen is a powerful thing. So we need to be realistic. McConnells task would be a daunting one, trying to attract the Democratic votes hell likely need to advance bills without having defections from his own camp. Hard-line conservatives are likely to insist on a renewed fight to repeal the presidents healthcare law and to make spending cuts to balance the budget. Social conservatives would push for new legislation to restrict abortion and benefits to same-sex couples. As majority leader, McConnell would command significant authority in setting the agenda. But in a speech in January he indicated that he would aim to focus on areas of consensus, not solely conservative priorities -- like repeated votes to repeal Obamacare. Theres a time for making a political point, even scoring a few points. I know that as well as anybody, he said then. But it cant be the only thing we do here. Senior lawmakers cite tax reform as an example of the type of legislation that could draw bipartisan support and be harder for Obama to veto. But McConnells stated goal of restoring the Senate to its role as a moderating institution doesnt sit well with tea party conservatives, who have used their position in the House to dominate the agenda, often to the frustration of Boehner. Conservative leaders met quietly outside Washington last week to plot a strategy for reasserting their influence within the Republican Party, concerned that mainstream GOP leaders will abandon core principles and move to the center in order to position the party for the 2016 presidential race. An effort in the next two years to keep our heads down ... will probably end with disappointing election results, warned Michael Needham, who heads the conservative advocacy group Heritage Action for America and attended the strategy meeting. Needham said the party should stick to the conservative ideals that appeal to its core supporters. If youre not providing a contrast to the left, you shouldnt be surprised that the American people embrace the people who are providing the agenda, he said. This notion that the left and the right just need to sit down and come up with compromises does disservice to vast philosophical differences in this country. McConnell allies stress that the Kentuckian isnt planning to shy away from political battles with the president when they are called for. But hes also keenly aware that just as quickly as Republicans might take the Senate majority, they could lose it in 2016 when a slate of first-term GOP lawmakers face reelection in swing and Democratic-leaning states. A fully Republican Congress would have an obligation to the partys would-be 2016 presidential hopeful to avoid extreme positions that would damage GOP presidential chances, analysts say. At the same time, Republicans would bear full responsibility for an institution that is highly unpopular with the public and has been notoriously unproductive in recent years. In order to elect a president in 2016, were going to have to show in 2015 and 16 that the American people can trust Republicans with the government, said Sen. Lamar Alexander (R-Tenn.). That means that well have to come up with changes that go in a conservative direction, but changes that command support of independent voters as well as our conservative base. McConnells most immediate challenge is winning his own race, which is proving difficult even in a state that handed Obama one of his largest margins of defeat in 2012. After defeating Matt Bevin in the GOP primary Tuesday, McConnell faces a stronger challenge in November from Kentuckys Democratic secretary of state, Alison Lundergan Grimes. On a 50-county bus tour in recent weeks, the 35-year-old Grimes has hammered McConnell for not focusing enough on the states economy. She launched the fall campaign by painting McConnell as a key driver of Washington dysfunction, calling him Senator Gridlock. An NBC/Marist poll released this month showed McConnell with 46% support to Grimes 45%; only 42% of the registered voters surveyed said they had a favorable opinion of the states senior senator. Speaking at a senior center in the town of Booneville last month, McConnell predicted a bruising campaign, claiming that he was the only Republican running this year that every crazy liberal in the countrys heard of. ... Theyll be sending their money -- they already are -- to my opponent. But in the interview, McConnell raised the idea that more centrist Democrats, such as West Virginias Joe Manchin III, would be willing to cross the aisle on some issues. And he argued that a Republican Congress might draw Obama to the political center and lead to greater cooperation in Washington. I know it sounds kind of counterintuitive, he said, but I think the single biggest chance for the president to finally address some of the bigger problems that are confronting the country would come about if he had a 100% opposition Congress. , , , , , , , , , , , , , ]", "Date": "20140521", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-gop-senate-majority-control-infighting-20140521-story.html", "Title": "[GOP conundrum: Would control of Senate spawn House-like infighting?]"}