{"Content": "[ Texas Gov. Rick Perry and Kentucky Sen. Rand Paul, already sounding like announced presidential candidates, appeared before several thousand conservative activists in Dallas on Friday to attack President Obama and Hillary Clinton while laying out their respective platforms. Perry derided what he called Obamas era of lawlessness, comparing it  in a nod to Tea Party activists  to British rule over American colonists. We need to make Washington as inconsequential in our lives as we can, he said to more applause. He added with a chuckle, In Texas, we actually do pretty well without Washingtons advice. Perry, who has made a well-publicized practice of luring businesses from other states, particularly California, noted that Texas leads the nation in high-tech exports, passing up California, home of the famous Silicon Valley, a statement that drew laughs. He praised fellow Republican governors in swing and early-primary states that he recently visited, including Florida, Iowa and South Carolina, for increasing jobs and cutting taxes. Washington hasnt gotten the message yet, he said. They intrude where they dont belong. They ignore their basic responsibilities, such as the crisis on our southern border. Perry noted that he had asked Obama to visit the border earlier this summer when thousands of immigrants, many of them children, were streaming north from Central America. He turned me down, saying he doesnt do photo ops, Perry said. A man in the audience shouted, Shame!, Faced with the specter of coyotes, smugglers, gang members and other lowlifes who are taking advantage of these children, Perry said, he did what Obama refused to do: Deploy the National Guard. (Obama administration officials have insisted that the border could be better protected by congressional approval of a multibillion-dollar proposal.), If Washington, D.C. will not do its job to secure that border, Texas will! the governor shouted, and the crowd rose to its feet, whooping and clapping. When Kentucky Sen. Paul appeared before the attendees at the summit sponsored by Americans for Prosperity, the political organization connected to GOP donors Charles and David Koch, he cut into Obamas handling of the threat posed by Islamic State militants overseas. Paul specifically took issue with Obamas statement Thursday that he did not yet have a comprehensive strategy to root out the group in Iraq and Syria. If the president has no strategy, maybe its time for a new president, he said to cheers, before urging the crowd to consider whether the people making decisions have the ability to be commander in chief. He faulted Clinton for failing to provide adequate security two years ago at the U.S. mission in Benghazi, Libya, when Islamic militants killed U.S. Ambassador J. Christopher Stevens and a staff member. (Two others were killed elsewhere in the city.), There will be a discussion over the next four years about whether Hillary Clinton is fit to be commander in chief. Is Hillary Clinton fit? Paul asked. The crowd shouted, No!, Had Hillary Clinton worked for Bill Clinton, shed probably be fired, he quipped. Paul also urged Republicans in the audience to help diversify their party and reach out to unlikely Republicans as he has  to minorities in urban areas, at historically black colleges and, yes, even Berkeley. If were going to be the party that wins, we have to be a bigger party, he said, We dont need to be Democrat lite  we need to reach out to new people. Among the audience both men were seeking to reach, few indicated they were put off by Perrys recent indictment on two felony charges that stemmed from his threat to withdraw funding for an integrity unit that probed state officials. Perry has insisted that the charges are political payback. Brandon Rogers, 30, a filmmaker from Los Angeles, said he found Perry inspiring. He considers himself somewhat libertarian, he said, but not enough to vote for Paul. Perry could mobilize a movement and inspire a nation, Rogers said. Gaye and Ted Hubble, both 63, of Fort Worth, left feeling concerned about Pauls foreign policy views and inspired by Perrys border talk, which she described as a call to arms. We need somebody who understands Americas role in the world, said Gaye Hubble, an education professor at nearby Tarleton State University, dismissing Perrys indictment as frivolous. They were looking forward to seeing another Republican presidential hopeful speak here Saturday: Texas junior senator, Ted Cruz. On Twitter: @mollyhf]", "Date": "20140829", "Author": "[Molly Hennessy-Fiske]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rick-perry-rand-paul-koch-brothers-20140829-story.html", "Title": "[Rick Perry, Rand Paul take aim at Obama, Hillary Clinton at Koch event]"}