{"Content": "[ Democratic Rep. Adam B. Schiff said Tuesday he would decide by the end of May whether to jump into the 2016 race for the open Senate seat from California, setting up a possible challenge to the front-runner, California Atty. Gen.Kamala Harris. To run, the Burbank congressman would need to give up his House seat, including his new position as the top Democrat on the House Intelligence Committee, where he has honed a specialty on national security issues. \"Bringing a national security background to the Senate race would be a way to distinguish myself in the field, and it would be a great asset in the Senate,\" Schiff said in an interview with Los Angeles Times reporters and editors at the papersWashington bureau. \"Ive given myself to the end of next month, and Im continuing to do my due diligence with people in California and to figure out if theres a pathway and if the timing makes sense.\", So far, Harris has emerged as the only Democrat to formally announce a run for the seat, which will be opened by the retirement of four-term Democratic Sen. Barbara Boxer. The one announced Republican candidate, state Assemblyman Rocky Chavez from Oceanside, will certainly pull support from GOP primary voters, but he is not expected to easily amass the multimillion-dollar war chest needed for a strong campaign. Schiff and two other House Democrats who are considering the race -- Rep. Xavier Becerra of Los Angeles and Rep. Loretta Sanchez of Santa Ana -- must determine whether one of them could push the Republican candidate aside in the states open \"jungle\" primary system, and confront Harris with a Democratic challenge from Southern California. \"Theres a real hunger in the southern half of the state to have a representative in the Senate, which we havent had in a very long time,\" Schiff said. \"Theres certainly a hunger within the Latino community to have a Latino representative from California in the Senate.\", The congressman, who is serving his eighth term in the House, is a strong fundraiser, with $2.1 million cash on hand -- comparable to the $2.5 million Harris raisedin the first quarter since she announced her candidacy. \"For a House member running for a Senate seat, you have to realize youre going to be running against the odds, and the question is whether thats a manageableproposition or whether its pie in the sky,\" said Schiff, a Harvard-educated lawyer with two children, ages 12 and 16. \"At this point, I think its manageable.\", Sanchez also has strong national security credentials as a member of the House Armed Services Committee and was testing themes for her possible campaign during an event Monday in Irvine. An opening for a Senate seat is rare and has sent the seasoned lawmakers scrambling to determine their chances -- and when they might have another opportunity to move up in California politics. Boxer won the seat in 1992, a year that swept both her and Democratic Sen. Dianne Feinstein into office -- the landmark \"Year of the Woman\" that broughtthe number of female senatorsto six. For the latest from Congress follow @LisaMascaro]", "Date": "20150421", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-schiff-senate-20150421-story.html", "Title": "[Democratic Rep. Adam Schiff will decide on Senate run by end of next month]"}