{"Content": "[ Senate Democrats have dropped a key demand that led them to filibuster President Obamas request for expedited consideration of a major trade deal, quickly resolving a rare internal battle between the president and his party. The decision makes it more likely that the Senate will pass legislation that gives Obama the authority he said he needs to help complete negotiations with 11 Pacific Rim nations over the free trade agreement. On Tuesday, a group of lawmakers opposed to the trade agreement persuaded most of their fellow Democrats to join them in blocking a vote on the presidents request. The Democrats blocking of Obamas priority magnified the difficulty that the president has had in persuading his allies to support the trade agreement, which he calls the most progressive such deal in American history. Key Democratic constituencies, though, fear the pact could hurt American manufacturing. The deal is one of Obamas top remaining legislative concerns, requiring a sustained lobbying campaign that included last weeks visit to Nikes headquarters to highlight potential benefits to the U.S. economy of increased exports and lower tariffs on goods produced by American companies. He also met Tuesday after the filibuster with a group of 10 pro-trade Democrats at the White House to discuss the path forward. As a result of that and other negotiations, Senate Majority Leader Mitch McConnell (R-Ky.) said the Senate will again attempt to vote on the trade measure in coming days. Democrats, led by Sen. Charles E. Schumer of New York, the No. 3 Senate Democrat, had pushed to use the trade authority bill as leverage to force a vote on a measure penalizing countries that manipulate their currency. Schumer has long accused China of deliberately devaluing its currency to gain an unfair advantage in trade, and more recently critics have complained about Japan using its depreciated yen to do the same. China isnt part of the trade negotiations, but Japan is, and American car manufacturers, labor unions and some others want the pact to include sanctions for countries found to be manipulating their currencies. The Obama administration has refused to seek tough currency provisions in trade negotiations, saying it would kill the deal, and Obama is likely to veto such legislation if it should clear both chambers and reach his desk. Though Democrats dropped the demand to package the currency bill with the measure to give Obama negotiating power on trade, a leadership aide said that if it were to pass the Senate, the House could still link the two. McConnell called it a reasonable solution that would guarantee Democrats had up-or-down votes on the currency bill in a way that \"will not imperil the increased American exports and American trade jobs we need. Senate Minority Leader Harry Reid (D-Nev.) also called it a fair outcome. This is a complex issue, one that deserves a full and robust debate, he said. The White House continued Wednesday to insist that Tuesdays failed vote was only a procedural snafu, and expressed optimism that the legislation would move forward on a second attempt. Press Secretary Josh Earnest also downplayed an increasingly personal battle between Obama and Sen. Elizabeth Warren (D-Mass.), a top critic of the proposed trade deal, while acknowledging the robust debate. The president and Sen. Warren both believe that its important for our government to be putting in place policies that will expand economic opportunity for middle-class families, he said. They do have a pretty stark difference of opinion about the best way to do that in this case. Follow @mikememoli for more news out of Washington.]", "Date": "20150513", "Author": "[Michael A. Memoli]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-na-senate-trade-agreement-20150513-story.html", "Title": "[Deal reached in Senate that could advance Obama's trade push]"}