{"Content": "[ Hundreds of millions of dollars flowing to the 2016 presidential candidates go to \"super PACs,\" the political groups that can raise unlimited sums as long as they dont coordinate directly with campaigns. The groups were required to report the names of donors and other information to federal election officials Friday. The biggest donors so far to major presidential candidates:, JEB BUSH, $3 million: Miguel Fernandez, founder of MBF Healthcare Partners, a private equity firm based in Miami, $2 million: Rooney Holdings, a private investment firm based in Tulsa, Okla. and headed by Francis Rooney, U.S. ambassador to the Vatican during the George W. Bush administration, TED CRUZ, $15 million: Dan and Farris Wilks, cofounders of Frac Tech, which provides equipment and services for hydraulic fracturing of oil and gas wells, $11.3 million: Robert Mercer, hedge fund executive based in New York, $10 million: Toby Neugebauer, founder of a private equity firm and son of Rep. Randy Neugebauer (R-Texas), CHRIS CHRISTIE, $2 million: Steven and Alexandra Cohen; he is a financier and chairman of a private equity firm, RICK PERRY, $6.3 million: Kelcy L. Warren, chief executive of Energy Transfer Equity, based in Dallas, $5 million: Darwin Deason, founder of Affiliated Computer Services, based in Dallas, MARCO RUBIO, $5 million: Norman Braman, longtime benefactor of Rubios who made a fortune as an auto dealer, and former owner of the Philadelphia Eagles, $3 million: Larry Ellison, former chief executive of Oracle Corp. SCOTT WALKER, $5 million: Diane Hendricks, a longtime backer of Walkers who owns a Wisconsin-based roofing and construction supply company, $5 million: Marlene Ricketts, wife of Joe Ricketts, founder of online brokerage TD Ameritrade and co-owner of the Chicago Cubs, RAND PAUL, $2.3 million: Jeffrey Yass, investment company executive and member of the board of the Cato Institute, a libertarian think tank based in Washington, $1.3 million: Scott Banister, technology entrepreneur, HILLARY RODHAM CLINTON, $2 million: Haim and Cheryl Saban; he is an entertainment industry mogul, $1 million each: Steven Spielberg, movie director and producer; Jeffrey Katzenberg, film studio executive; Herbert Sandler, retired banker and philanthropist; George Soros, investor and philanthropist long known for backing liberal causes; and S. Donald Sussman, prominent figure in the hedge fund industry, Source: Federal campaign disclosure filings]", "Date": "20150802", "Author": "NULL", "Link": "http://www.latimes.com/nation/politics/la-na-super-pac-donors-20150802-story.html", "Title": "[The big spenders behind the 2016 presidential candidates]"}