{"Content": "[ In response to the Russian threat, Western leaders at the recent NATO summit reiterated their commitment to defending alliance members in the Baltic and Eastern Europe from aggression. This reaffirmation of NATOs core promise is essential in the short term. But it requires fundamental reconsideration over the next decade. In the long run, it should be up to Europeans to assure the integrity of their eastern frontier without a legal guarantee of U.S. assistance. The United States is overcommitted, confronting ongoing crises in the Middle East and Afghanistan. At the same time, it is undertaking a \"pivot toward Asia,\" which will include a massive shift of military resources to the Pacific. While such a buildup is not a sufficient response to Chinas rise, it is a necessary part of a larger strategy that will provide space for the regions democracies to prosper. Within this global context, it makes sense to require Europe to take on the principal burden of its own defense. When NATO was established in 1949, it was beyond the capacity of a devastated Western Europe to defend itself against the looming Soviet threat. But the continent has come a long way since then. Creating a credible European deterrent is an entirely realistic option, especially since Russias military capacities are limited by its demographic decline and its failure to develop a dynamic market economy. Nevertheless, the European Union wont happily accept this burden, since present arrangements allow it to free-ride on American military expenditure. The United States currently contributes between a quarter and a fifth of NATOs budget, but that figure doesnt include the costs of deploying U.S. personnel on NATO missions. Total U.S. defense spending is 73% of the total spent by all NATO members on defense. As a consequence, Europes leaders have no incentive to consider fundamental changes. Yet it would be in Europes larger interest for them to do so. At present, increasing numbers of ordinary Europeans view the EU as a poorly disguised machine for imposing German austerity on the rest of the continent. Popular support is in sharp decline. Even Euro-stalwarts like France show signs of profound alienation, with the left wing of President Francois Hollandes Socialist Party generating a Cabinet crisis in protest against EU austerity measures while right-wing nationalist Marine Le Pen has become a leading candidate for the presidency in 2017. Rethinking NATO, however, would catalyze a fundamental shift in European politics. Germany, which has a compelling interest in keeping the eastern frontier as far east as possible, would be obliged to make concessions and share much more power with others, generating a renewed sense of genuine collaboration across borders. For obvious historical reasons, German generals could not play a highly visible role in the European army of the future. Much of the high command would probably come from France and Britain. But countries such as Italy, Poland and Spain would also play important roles. The overall appearance would express the EUs collaborative character. Even more important, a focus on European defense would invite politicians and the general public to emphasize the shared commitments to democratic values that link Estonians and Portuguese, Bulgarians and Norwegians in the EU. As President Vladimir Putin has made plain, it is this great enlightenment project, not only principles of territorial integrity, that is threatened when Russian tanks move across borders. If the citizens of the EU make the sacrifices required to rely on themselves rather than America to counter Russian aggression, they will reinforce the sense that Europe is indeed an independently valuable political community. The defense imperative will also drive the EU in more democratic directions. As it accepts responsibility for war and peace, one thing will become clear: Europeans cannot go to war without democratic consent. This common-sense point will create new pressures to reorganize the EUs complex technocratic institutions to become more responsive to the political views of ordinary citizens. Institutional reconstruction is a daunting constitutional task, but it is better confronted sooner than later. Though NATO has been a fixture of American foreign policy for two generations, its future is problematic. In 2016, Rand Paul might be the Republican candidate for the presidency, generating an unprecedented debate on foreign policy fundamentals. Even if he loses, his campaign will set the stage for further challenges to military interventionism from the left as well as the right in future elections. Over time, the credibility of Americas NATO commitment will become increasingly doubtful. Yet so long as the United States bears the principal fiscal burden, it will be tempting for the EU leadership to take NATO for granted until it is too late. Instead of sleepwalking into a disaster, the two sides should set a realistic timetable for a transition. Even after the transfer date arrives  say in 2025  the United States should, of course, continue to cooperate with Europe in its defense. But it should be prepared to put American boots on the ground only as a last resort. Bruce Ackerman, a professor of law and political science at Yale, is spending the academic year as a fellow at the American Academy in Berlin. Follow the Opinion section on Twitter @latimesopinion]", "Date": "20140908", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-ackerman-nato-20140909-story.html", "Title": "[Europe needs to provide for its own defense]"}