{"Content": "[ When Jeb Bush completed two terms as governor of Florida in 2007, he reported his net worth at $1.3 million, about $700,000 less than when he took office. Today, nearly eight years later, he is a wealthier man. He has plunged into business and entrepreneurial ventures involving consulting, the paid lecture circuit and energy development. He has developed real estate, advised international investment banks and joined high-paying corporate boards. ------------FOR THE RECORD: Jeb Bush: An article in Section A on Dec. 26 about former Florida Gov. Jeb Bushs financial affairs quoted a spokeswoman, Kristy Campbell, as saying that an investment fund, BH Global Aviation, was set up overseas to protect it from having to comply with U.S. business regulations. Actually, Campbell said the fund was structured that way because its only investment, Hawker Pacific, has no operations in the United States and therefore does not need to make U.S. corporate filings.   ------------, But as he considers a run for president in 2016, Bush has begun to unwind some of his financial affairs, apparently to avoid the kind of criticism that hobbled fellow Republican Mitt Romney in his unsuccessful bid for the White House in 2012. Bush is quitting Tenet Healthcare Corp.  a company that has profited from Obamacare  and is ending a consulting contract with Barclays Bank to focus on his political future. Aides say he also has stopped giving highly paid speeches to focus on traveling America, meeting with potential donors and testing what a friend calls a visionary brand of campaigning. But Bushs business record, enmeshed in international finance and some troubled former ventures in south Florida, could end up complicating his return to politics and his hopes to follow his father, George H.W. Bush, and his older brother, George W. Bush, into the Oval Office. Last year, he took a step into the rarefied world of private equity and offshore investments, joining with former banking executives and a Chinese airline company to make bets on natural gas exploration and shipping. One of the funds was set up in the United Kingdom, a structure that allows the company to shield overseas investors from U.S. taxes. During the 2012 race, Romney drew ceaseless attacks from Democrats for his lucrative work at Bain Capital, a pioneering venture capital company that bought scores of troubled companies, took over their management and sometimes laid off employees while garnering huge fees and payouts. But Bush and his aides argue that his investments and entrepreneurial ventures are different because he isnt taking control of companies and restructuring them. These are all growth investments that the governor has worked on, said Bushs spokeswoman, Kristy Campbell. Bushs latest undertaking is as a partner in three privately held funds that have raised a total of $127 million for investments in domestic and foreign companies. Bill Parish, an investment advisor in Portland, Ore. says the funds are fairly small in the private equity world. But in the heat of a political campaign, Parish said, opaque investment vehicles, especially involving overseas accounts, inevitably will raise questions about the identities of his investors and the nature of their businesses. If hes smart, hes going to take care of it and shut them down, Parish said. Campbell said the 61-year-old former governor is reviewing all his engagements and his business commitments now that hes begun to focus on a potential race. Thats a natural next step, she said. Born and raised in Texas, Bush moved in 1981 to Miami, where his wifes family lived, and went to work for a wealthy Cuban-born businessman, Armando Codina. Both had worked on George H.W. Bushs failed bid for the Republican Partys 1980 presidential nomination, and Codina ultimately made the younger Bush a partner in a south Florida real estate development firm. In 1986, Bush got into politics when he was named Floridas commerce secretary. He quit in 1988 to help his father, then the vice president, win the White House. In 1994, the younger Bush lost his first race for the governors mansion, but four years later he won, and ultimately became Floridas first two-term Republican governor. After leaving office in 2007, he set up Jeb Bush and Associates, a management consulting firm. His son, Jeb Bush Jr. serves as managing partner. Bush has said the firms clients range from Fortune 500 companies to small tech startups, but Campbell declined to discuss the companys business or identify its clients. That same year, Bush also was hired as an advisor to Lehman Brothers, the New York investment bank and financial services firm. When Lehman collapsed in bankruptcy in 2008 amid the global financial crisis, Bush shifted to Barclays, the London-based multinational banking and financial services giant that bought Lehman Brothers North American divisions. He got involved in a venture that provides disaster response services. He and two partners also set up another company, Maghicle Driverless, that is trying to develop self-driving vehicles for passengers and cargo. He was grabbing at a lot of things to make money quickly, said Susan MacManus, a political science professor at the University of South Florida. Now Bush has begun to pull back. Campbell, the Bush spokeswoman, said he will leave Barclays by Dec. 31 to focus on a possible presidential run. She said his work for Lehman Brothers and Barclays was mostly offering clients his perspective on the impact of economic trends, regulations and policies. And on Wednesday, Bush resigned from the board of directors of Tenet Healthcare Corp. also effective Dec. 31, according to a corporate filing. The Dallas-based company actively supported the 2010 Affordable Care Act, and has seen its revenue rise from it, an issue that could draw fire in Republican primaries. Bush earned cash and stock awards worth nearly $300,000 from Tenet in 2013, according to corporate filings. He also sold Tenet stock worth $1.1 million that year, the records show. Mr. Bush is not resigning on account of any disagreement with Tenet, the company said. Bush remains on the board of directors of a Florida-based timberland owner, Rayonier, which paid him about $200,000 last year, according to the companys proxy statement. Some of Bushs business ventures have gone badly. In 2007, Bush joined InnoVida, a Miami manufacturer of composite building materials, winning a seat on the board and a $15,000-a-month consulting contract. At the time, company president Claudio Osorio was a big player in Miamis glitzy social and political world, hosting fundraisers at his Star Island mansion for Democratic politicians like Hillary Rodham Clinton and, in 2008, for then-Sen. Barack Obama. In March 2010, InnoVida obtained a $10-million federal loan to build homes and a factory in earthquake-wrecked Haiti. But Osorio scammed millions from that loan and from investors, according to a federal indictment filed in Miami. A Securities and Exchange Commission complaint in 2012 said Osorio had recruited Bush and other high-profile figures to lend an air of legitimacy to InnoVida and help him raise money. In 2013, Osorio pleaded guilty to fraud charges and was sentenced to 121/2 years in prison. Bush was paid a total of $468,901 before leaving InnoVida in September 2010. A court-approved settlement agreement in the companys bankruptcy case says he provided substantial assistance to investigations into the companys finances, and he agreed to pay back $270,000 to the bankruptcy court. His foray into private equity began last year with three banking industry veterans: Amar Bajpai, formerly of Lehman Brothers; Ross Rodrigues, a former Credit Suisse analyst and hedge fund principal; and David Savett, a former energy trader at Credit Suisse. Details were first reported by Bloomberg News. Their firm, Britton Hill Holdings, named after the highest point in Florida, raised $40.4 million from investors and put it in Inflection Energy, a Denver-based company that has been investing in hydraulic fracturing, or fracking  specifically, in natural gas wells in the Marcellus shale region in Pennsylvania and New York. Bush and his partners also set up two other funds. BH Logistics raised $26 million and invested it in Dorian LPG Ltd. a shipping company incorporated last year in the Marshall Islands to transport propane gas. BH Global Aviation, based in the United Kingdom, raised $60.8 million. That money was invested in Hawker Pacific, an aviation sales and services firm based in Hong Kong that mainly does business in Asia and Australia. Hawker Pacific has no operations in the United States, and the investment fund was set up overseas to protect the company from having to comply with U.S. business regulations, Campbell said. Nearly all of the money for Dorian LPG Ltd. and BH Global Aviation came from investors outside the United States, according to Security and Exchange Commission filings. The biggest investor was a Chinese firm called HNA Group, a conglomerate that includes an airline and other businesses. In a news release, HNA said its investment in Dorian was part of a plan to build a distribution network in China to take advantage of the significant opportunities for growth in propane. Al Cardenas, former Republican Party chairman in Florida and a longtime friend of Bush, says he doesnt think the former governors involvement with international finance will hurt his appeal should he run for president. I think hes always been an honest man in business and in politics, Cardenas said. Hes comfortable with his actions and what hes done. All the public wants to know is that you behaved honorably and that you care for them. MacManus, the political science professor, isnt so sure. Some of Bushs business dealings might draw heat during a campaign, particularly from unbridled outside political groups. The thing with investments, she said, is that theres always something to criticize. Twitter: @jtanfani]", "Date": "20141225", "Author": "[Joseph Tanfani]", "Link": "http://www.latimes.com/nation/la-na-jeb-bush-money-20141225-story.html", "Title": "[Jeb Bush eases out of some businesses, such as firm helped by Obamacare]"}