{"Content": "[ Vermont Sen. Bernie Sanders, a self-avowed socialist and the longest-serving independent in congressional history, plans to announce Thursday a long-shot bid for the Democratic presidential nomination. His decision would make him the first announced challenger to the partys overwhelming 2016 front-runner, Hillary Rodham Clinton, but Sanders wont necessarily be the last. Former Maryland Gov. Martin OMalley has been edging toward a run, and former Virginia Sen. Jim Webb has also been actively pursuing a possible White House bid. Sanders plans to issue a statement Thursday signaling his intent to run and shortly after will file the needed paperwork with the Federal Election Commission, according to a campaign advisor. A formal election kickoff is set for the end of May in Vermont. Sanders, who has a history of running uphill races, is expected to make economic issues and, specifically, the anxieties of the working- and middle-class a focal point of his campaign, if only to press Clinton to more forcefully address them. In his extensive travels around the country, part of the soundings he took before deciding to run, Sanders has struck an uncompromisingly liberal stance, an antidoteas some on the left see itto Clintons more centrist approach. Among his proposals, Sanders calls for free college tuition, a $1-trillion program to rebuild the nations roads and bridges, government-run healthcare, higher taxes on the wealthy and publicly funded elections to reduce the influence of the countrys rich donors. He would break up the nations big financial institutions, and he opposes trade agreements, like the Trans-Pacific Partnership that President Obama is pushing, which Sanders says have punished workers by shipping jobs overseas. A former mayor of Burlington, Vt. the 73-year-old Sanders was elected to the House in 1990. After eight terms, Sanders was elected to the Senate in 2006. A self-described Democratic socialist, Sanders mainly votes with the Democrats in Congress and is considered a part of their caucus on Capitol Hill. In an interview last month, during a campaign swing through Iowa, Sanders was asked how he would describe himself, eschewing political labels. \"Setting aside labels, I am somebody who believes that government in a democratic society should be representing the needs of the vast majority of the people, who are middle-class and working families,\" he said. \"That at the current point, we are living in a society which is moving more and more toward an oligarchic form of society, where government is dominated heavily by big-money interests.\", If he ran, he said, he would not wage a negative campaign, or heedlessly attack Clinton, who was an undeclared candidate at the time. \"I dont run against Hillary Clinton,\" he said. \"I run on the most important issues facing America. I state my views. And if Hillary Clinton runs, Im sure she will state her views. And if she runs and if I run, there will be a contrast of views.... I dont believe in trashing my opponents. Ive never run a negative ad in my life.\", Clinton formally announced her candidacy this month. Twitter: @markzbarabak, 3:50 p.m.: This post was updated with additional information. It was originally published at 2:41 p.m.]", "Date": "20150428", "Author": "[Mark Z. Barabak]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-na-pn-bernie-sanders-runs-for-president-20150428-story.html", "Title": "[Vermont Sen. Bernie Sanders to announce run for president]"}