{"Content": "[ Tax reform is revving up again on Capitol Hill, with the heads of key committees pledging to work toward a simpler and fairer tax code, possibly one with lower tax rates. Sounds intriguing. But what might that mean for homeowners? Many benefit from tax breaks such as mortgage interest and property tax deductions, plus tax-free write-offs of up to $250,000 or $500,000 of home sale capital gains, depending on whether they file returns as singles or married couples. Renters get none of these. Homeowner write-offs become targets for cutbacks or elimination whenever tax code reforms get serious attention because of their costs in uncollected federal revenue. The mortgage interest deduction alone will cost the Treasury $113.4 billion in fiscal 2015, and property tax write-offs will cost $27.8 billion, according to estimates by the congressional Joint Committee on Taxation. President Obama kicked off the tax legislative season with a budget proposal that would limit mortgage interest and other deductions for upper-income taxpayers. No surprise there. He called for essentially the same change last year, and this years version was widely viewed as dead on arrival in a Congress controlled by Republicans. But what might Republican tax reformers themselves have up their sleeves? Last February the top Republican tax writer, Rep. Dave Camp of Michigan, then chairman of the Ways and Means Committee, came out with a massive tax code overhaul blueprint that would offer lower tax rates and a big increase in the standard deduction in exchange for drastic cutbacks in special-interest deductions and credits, including the benefits traditionally enjoyed by homeowners. Camps plan would have shrunk marginal rates for most taxpayers to just two brackets, 10% and 25%; phased down mortgage interest deductions from the current $1-million limit on eligible mortgage amounts to $500,000; eliminated deductions on home equity loans and credit lines; and stretched out the time period needed to qualify for tax-free capital gains exclusions from the present two years out of the preceding five years to five years out of the preceding eight years. Camps plan also would have eliminated homeowners write-offs of local property tax payments and ended penalty-free withdrawals from individual retirement accounts to assist with first-time home purchases. Camp retired from Congress at the end of the last session. His reform plans  considered too controversial to pass in an election year  never moved out of committee. But the impetus for some sort of wholesale reform of the sprawling Internal Revenue Code remains alive and well. Is anything likely or even possible this year, and if so, could it create problems for current or future homeowners?, Conversations with tax experts and Capitol Hill legislative analysts suggest a couple of things: There is bipartisan support for the broad concept of streamlining the tax code. The new Ways and Means Committee chairman, Rep. Paul D. Ryan (R-Wis.), said on NBCs \"Meet the Press\" that he is prepared to work on reforms with the White House  even compromise on some issues  \"if we can find common ground.\" Sen. Orrin G. Hatch (R-Utah), Senate Finance Committee chairman, has created working groups tasked with coming up with tax reform plans with the objective of introducing a bill, probably by late this spring. And there is already common ground to build on: bipartisan support, including at the White House, for a broad package of tax changes affecting businesses. Treasury Secretary Jacob J. Lew recently said the administration could support reforms that lower top tax rates for big corporations, eliminate unfair loopholes and simplify the entire system for businesses. Republicans generally are on board but insist that small businesses be part of the solution. So theres a chance that a bipartisan corporate tax reform bill could be cobbled together this year, provided that negotiations are completed before the start of the next presidential campaign season this fall. What about comprehensive tax reforms for individuals of the type that inevitably would involve significant changes in current preferences for homeowners and tax increases for higher-income households? Highly unlikely. Congressional Republicans and the White House have such conflicting views of the tax system  Obama wants to raise taxes on the wealthy, Republicans vehemently oppose any net new taxes  that coming together on a major reform package covering individuals would be nothing short of miraculous. Bottom line: Homeowner tax breaks are safe for the time being, probably until 2017 at the earliest. kenharney@earthlink.net, Distributed by Washington Post Writers Group.]", "Date": "20150215", "Author": "NULL", "Link": "http://www.latimes.com/business/realestate/la-fi-harney-20150215-story.html", "Title": "[Homeowner tax breaks are probably safe despite moves in Congress]"}