{"Content": "[ Is it possible to create a \"super PAC\" that would end the power of super PACs by drawing enough Americans into the system to limit the influence of big money in politics? And is it possible to get voters excited about a subject as dry as campaign finance?, Harvard law professor Lawrence Lessig is leading a crusade to answer both those questions with a yes. On May 1, Lessig launched the Mayday PAC, asking for contributions from Americans across the political spectrum who believe the current political system is legally corrupt--with members of Congress spending much of their time dialing for dollars, as outside groups flood each election cycle with hundreds of millions of dollars through super PACs and other devices, with little disclosure of their donors. The result, Lessig said, has been a government that is not responsive to what the average American cares about, but is incredibly responsive to the people who are in that funding class. The conventional wisdom is that the public doesnt like the system, but the public is not going to do anything about it, Lessig said in an interview in Santa Monica on Thursday during a West Coast swing that included stops to build support for the effort. But the public is not doing anything about it because they dont think theres anything we can do about it. The goal of the Mayday PAC is to get enough Americans involved to dilute the dominance of big money. Small donations from average citizens in each phase will be matched by largercontributions raised by Lessig from high-dollar and even billionaire donors, whom he declined to name. In the first 13 days of the effortwhich was announced simply, with a blog post, a Twitter message and a Web pagethe group raised more than $1.1 million, with an average contribution of $75. Lessig is now raising funds to match that first million, while launching the second phase to raise $5 million in June (which he again hopes to match with bigger donations). If the group succeeds in raising its goal of $12 million by the end of June, it intends to use the 2014 campaign cycle as a testing ground  targeting five House races to demonstrate whether it can propel candidates who are committed toa system in which small donors have a much greater influence.(The group will announce its targets later this summer.), Lessig and his advisors at the Global Strategy Group, including Bill Burton, the onetime White House aide who cofounded the main super PAC dedicated to helping President Obamas campaign in 2012, have been trying to calculate what it would cost to elect enough members of Congress committed to reform. But for now the goal is simply to convince candidates and voters alike in 2014 that this issue matters to people, Lessig said. If the Mayday PAC is able to take out five members of Congress this cycle who are on the wrong side of this issue, Lessig said, then when 2016 comes around, magically a whole bunch of members of Congress would be on the right side of this issue, and we would have a narrower range of people that we would have to be going after, and we would have very good data from how much it would cost. The Mayday PAC supports five legislative proposals for changinghow elections are funded. Two are Democratic proposals, two are Republican proposals, and one is bipartisan. One proposal would create a $200 voucher forevery American to put toward the candidates of their choice; another would create a tax credit for small donors. Lessig also favors a constitutional amendment that would protect the ability of Congress to make reasonable regulations around election spending from Supreme Court interference. Lessig acknowledged the difficulties--the Supreme Court has steadily loosened campaign finance restrictions and would seem unpersuaded by a contrary super PAC--but he said victory would mean that \"at a minimum we will have changed the way elections are funded. Lessig said he drew his inspiration from two sources: the late Internet activist Aaron Swartz and Doris Haddock, the citizen activist who walked from Los Angeles to Washington in her late 80s with a sign on her chest that said campaign finance reform. In a 2006 conversation, Swartz challenged Lessigs approach to addressing laws that choke creativity in his field of copyright law and Internet policy. How are you ever going to address those problems so long as theres this fundamental corruption in the way our government works? Swartz had asked. Before launching the super PAC this year, Lessig began a companion effort called the \"New Hampshire Rebellion. Lessig and about 200 other people walked nearly the length of New Hampshire, from Dixville Notch to Nashua. They stopped at coffee shops and small events along the way to get people talking about the influence of money in politics. The group will embark on another walk along the New Hampshire coast on July 5, followed by larger walks in 2015 and 2016. By the time the 2016 presidential candidates arrive in earnest next year, Lessig hopes to have legions of New Hampshire voters forcing them to talk about how they would curb the influence of money in politics. The challenge of capturing peoples attention isnt lost on Lessig. When asked if anyone has told him that his idea is ludicrous and unlikely to work, he answers with a smile: Yeah, like everybody. But they were the same people who said you couldnt possibly raise $1 million in 30 days, he adds.\"They were wrong about that too.]", "Date": "20140523", "Author": "[Maeve Reston]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-harvard-professor-super-pac-big-money-politics-20140523-story.html", "Title": "[Harvard professor's 'super PAC' aims to end power of 'super PACs']"}