{"Content": "[ Congress returns this week to a changed atmosphere after the Republican midterm election sweep  but before any new agenda is launched, old business must be finished. Lawmakers have just four weeks to approve must-pass bills to fund the government, extend business tax breaks and consider President Obamas requests for $6 billion in emergency funds for the fight against Ebola in West Africa and nearly as much to battle Islamic State militants in Iraq and Syria. Lame-duck sessions can be oddly productive, especially when the party that just lost the election uses its final days in power to push last-ditch legislative priorities. Both Democrats and Republicans want to use this session to clear the way for the new Republican Congress in January. But achieving common ground can be elusive in the aftermath of a brutal election. Political wounds will be on display as newly elected members arrive to pick out office space and drapery colors, while just-defeated ones are relegated to makeshift desks, often in the basements of Capitol Hill. With emotions running high  leadership elections in the House and Senate also will be underway  finding bipartisan compromise can be tough. \"Theres going to be some specific work that has to get done during the next several weeks,\" Obama said before a Friday lunch with congressional leaders at the White House. \"And my hope ... is that even as we enter into a new Congress, the previous Congress has the opportunity still to make progress on a whole bunch of fronts, and Im confident we can get that done.\", A top order of business for Democrats before they relinquish control of the Senate to Republicans will be the speedy confirmation of Obamas remaining nominees for judicial and executive branch posts. That doesnt include his new pick for attorney general, U.S. Atty. Loretta Lynch, whose path to confirmation is complicated by whether a Senate vote to approve her will be taken before or after Republicans take control of the chamber. It is likely to push into the new year. Senate Majority Leader Harry Reid (D-Nev.) quickened the pace of judicial confirmations after changing the rules last year to bypass Republican filibusters. Knowing that Republicans probably will be less inclined to support Obamas nominees once in charge, Democrats will try to finish the job. Obama also wants Congress to step into the foreign policy debate. Lawmakers will be asked not only to continue arming Syrian rebels who are fighting Islamic State extremists  authority for that program expires in mid-December  but also to authorize the administrations use of military force against the group. The war powers debate is one that has stymied Congress, with lawmakers at first reluctant to wade into the politically difficult issue, then abruptly switching course and demanding that Obama seek their approval for airstrikes against militants. Obama also reversed course, first saying he had authority under the 2001 and 2002 congressional authorizations for the Afghanistan and Iraq wars. But even Democrats who backed him are insisting that Congress should vote. \"We should be doing it now,\" said Rep. Nancy Pelosi of San Francisco, the Democratic minority leader. House Speaker John A. Boehners office said Friday that \"House Republicans will be ready to work with him to get it approved.\" A final vote would not be expected until the new year. An undercurrent that could derail the lame-duck session will be Obamas planned executive action to allow up to 5 million immigrants in the U.S. illegally to stay without fear of deportation. Republicans warned the president at Fridays meeting that he would \"poison the well\" by going it alone on immigration policy. But they have been unwilling to commit to tackling the issue when they take control of Congress next year. If Obama moves ahead, conservative senators, including Texas Republican Ted Cruz, have pledged to use \"all procedural means necessary\" during the lame-duck session to stop what they view as executive overreach. That could gum up the effort required by Congress to fund the government beyond Dec. 11, when the current stopgap spending bill expires. Negotiators have been at work for months hammering out the details of a package that could keep the government running until the end of the fiscal year, Sept. 30. Spending levels were set by previous bipartisan budget accords, but some conservative lawmakers will resist sticking to that agreement when Republicans control Congress. They prefer a stopgap measure until the new Congress takes over. Congress is also debating a range of other issues that have stalled this session, such as expiring tax breaks for specialty businesses, including the film industry, and proposals for terrorism risk insurance and an Internet sales tax. \"Theres a whole lot of unfinished business sitting there, some of which it might be advantageous to get out of the way,\" said Sen. Mitch McConnell (R-Ky.), who is set to become the majority leader in the new Senate. One motivating factor for lawmakers to avoid lame-duck political drama and finish their work: Christmas and the winter holidays, which many hope to spend not in the chilly halls of the Capitol but with family and friends at home. lisa.mascaro@latimes.com, Twitter: @lisamascaro ]", "Date": "20141111", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/politics/la-na-lameduck-congress-20141112-story.html", "Title": "[Lame-duck Congress faces a full agenda, and many obstacles]"}