{"Content": "[ Democrats have never been more confident that their chances of hanging onto the White House hinge on black voters, who helped tip key states toward President Obama  but they have never been less confident, it seems, about how to talk to them. The Black Lives Matter campaign is seeing to it that the rules they relied on for courting the vote no longer apply. The potent social media-driven movement, sparked in the aftermath of Florida teen Trayvon Martins 2012 shooting death and reignited in the racial unrest in response to the deaths of other unarmed African Americans at the hands of police over the last year, has 2016 contenders scrambling to adjust their strategies. The protesters involved are proving masterful at refocusing the spotlight. Candidates who might otherwise have been complacent, given their high marks on legislative report cards from the National Assn. for the Advancement of Colored People and endorsements from an older generation of black leaders, have had to more directly confront uncomfortable questions of racial inequality and the mistreatment of blacks by the criminal justice system. We want to ensure that these candidates will actually deal with the issues that black people face, said Patrisse Cullors, a movement cofounder from Los Angeles. The reality is that its still not legal to be black in this country. The groups demands weighed heavily on discussions Friday at a major conference of the National Urban League in Fort Lauderdale, where candidates of both parties sparred over the best approach for improving the lives of African Americans. Democrat Hillary Rodham Clinton dived deep into the challenges of being black in America and the structural racism embedded in the countrys culture and economy. Jeb Bush, a Florida Republican, tried to relate his conservative growth agenda to minority empowerment. Both heavyweights had found themselves pushed off balance by Black Lives Matter before the conference. The movement inserted itself into the race through a few well-timed and highly publicized confrontations with candidates  several of which exposed politicians tone-deafness on racial issues. Often it was through a simple impromptu action, during which activists would demand that candidates repeat the words Black lives matter. Many candidates flubbed it. Their frequent response that all lives matter was perceived by many blacks as a refusal to acknowledge the particular risks faced by those with black skin. Republicans generally pushed back, accusing the activists of stoking racial division. Bush emphasized to the Urban League convention that his economic plan would prove beneficial to urban communities. Four percent growth is more enterprise in urban areas, more people moving in, a higher tax base and more revenues  in other words, a better chance to save our cities, Bush said. We can do this as a country. We can grow at a pace that lifts up everybody, and there is no excuse for not trying. Democrats, in contrast, are aggressively positioning themselves as empathetic to the outrage into which Black Lives Matter has tapped. They are reeducating themselves on how to talk to black voters. They are sending surrogates to meet with activists, shifting their rhetoric and  in some cases  issuing apologies. They fear more stumbles could erode the bloc of black voters that was key to Obamas victories in Florida, Virginia, Ohio and Pennsylvania. This is not just about statistics, as damning as they can be, Clinton said at the Urban League event. This is about Americans doing some soul-searching and holding ourselves to account. Cullors says the group wants candidates to address poverty, racial profiling by police, incarceration and homelessness. What we are seeing is a group of voters that are getting their political legs up under them and beginning to define what politics are going to be like for them post-Obama, said Cornell Belcher, who was a pollster for the Obama campaign. You will have a hard time getting to the White House as a Democrat without speaking to them and including them in your coalition. The activists at the forefront are sidestepping the usual brokers whom Democrats  especially white Democrats  go through to reach black voters. There is a sense that the traditional civil rights organizations have been far too cozy with whoever and not making clear enough demands, said Fredrick Cornelius Harris, director of the Center on African-American Politics and Society at Columbia University. They see these people as having failed them. Its a point of concern with some of the older groups, like the Urban League, which embrace the attention Black Lives Matter has managed to direct toward racial disparity and injustice but express frustration that their own work is overlooked. We have been talking police accountability since before these incidents occurred, Urban League President Marc Morial said of the events that spawned the Black Lives Matter movement. The new generation, though, is decidedly more confrontational. Until we hear from candidates, beyond just saying, Black lives matter  until we hear them really address how we are continuously cut out of the American democracy, were going to continue to shut debates down, Cullors vowed. Were going to continue to call elected officials out. I mean, weve tried to set up meetings with elected officials, weve tried to send them emails  it does not work. Now some candidates are going to them. Clintons director for black outreach was on hand when the activists gathered at their inaugural Movement for Black Lives Convening last weekend in Cleveland. The campaign said the aide was there to listen. The progressive grass-roots behemoth Democracy for America announced it was upending its advocacy model amid demands from the black activists that the overwhelmingly white group diversify and more aggressively confront racial injustice. The African American activists, though, remain unimpressed. They say the candidates fall back on tired talking points without delivering a concrete agenda. Sometimes this country wants to keep its head in the sand and say, We dont have race issues, said Pastor Karen Anderson of Ward Chapel African Methodist Episcopal Church in Florissant, Mo. not far from where rioting took place in Ferguson after Michael Browns fatal shooting by a police officer last year. Anderson recently sat in on a round table Clinton held on racial justice. The movement is emerging as a force in electoral politics, despite the spontaneous nature of many of its actions and its loose structure. Black activists have more strongly emphasized elections in the aftermath of events in Ferguson, where they led a push to vote out local officials, and organizers with experience mobilizing voters are building coalitions around Black Lives Matter. The candidates are finding themselves constantly tested, even in states where there is little African American presence. Kareem Jordan, a criminal justice professor in Lowell, Mass. drove to Clintons town hall Tuesday in Nashua, N.H. where he was one of few blacks in an audience of 250. He questioned the candidate on mass incarceration. Clinton, who decried racism in sentencing and emphasized the need to build trust between police and local communities, provided an answer Jordan found mostly adequate, though a little vague. Jordan plans to vote for Clinton. But he says turning out the black vote the way Obama did is going to be tough for her. Its hard, he said, for whites to talk about racial justice issues in a way that blacks find genuine. There are gaffes. evan.halper@latimes.com, kurtis.lee@latimes.com, Halper reported from Fort Lauderdale and Lee from Los Angeles. Times staff writer David Lauter contributed to this report from Nashua. 4:16 p.m.:This report has been revised throughout for additional details and for clarity. 9:59 a.m: This articlehas been updated with details from the Urban League convention. This articlewas originally published at 3 a.m.]", "Date": "20150731", "Author": "[Evan Halper, Kurtis Lee]", "Link": "http://www.latimes.com/nation/la-na-campaign-black-lives-20150731-story.html", "Title": "[How Black Lives Matter forced campaigns to toss their strategies on black voters]"}