{"Content": "[ Hes been described as the \"Buddhist Bin Laden,\" but Ashin Wirathu thinks he has more in common with the worlds most famous fictional spy. \"James Bond is a nationalist,\" the cherub-faced monk said in a recent interview. Flashing a smile, he offered a vague recollection of a movie in which 007, in order to extract information from a woman, took her to bed. \"While he did not take much pleasure in the act,\" Wirathu said, \"he did it for his country.\", His questionable reading of Bond aside, the firebrand Wirathu firmly says he is defending Myanmar against the people he views as the countrys main enemy: its Muslims. Wirathu, 46, might bear as much responsibility as any individual for the desperate exodus of Muslims from Myanmar aboard overcrowded fishing boats bound for Thailand and Malaysia. In speeches and Facebook posts, he has warned of an impending \"jihad\" against the huge Buddhist majority, spread rumors of Muslims systematically raping Buddhist women and called for boycotts of Muslim-owned businesses. Good Buddhists, he argues, shouldnt mix socially with Muslims, who he says are \"snakes\" and \"mad dogs.\", \"Most Muslims destroy our country, our people and the Buddhist religion,\" Wirathu said. He represents the blunt edge of systematic religious discrimination in Myanmar that has driven about 1 million Rohingyas, a Muslim minority group, to the farthest margins of society. Human rights groups say Wirathu and the radical movement he leads, called 969, stoked sectarian riots that have killed scores since 2012. About 100,000 Rohingyas have been forced into internment camps ridden with disease and malnutrition in the western state of Rakhine, deprived of outside assistance since the government expelled foreign aid groups in 2014. Wirathus militant Buddhist nationalism is fed by official propaganda that portrays the Rohingya as people from Bangladesh who entered Myanmar illegally and have encroached on native lands, although many Rohingya families have lived in Myanmar for generations. Government policies deny the Rohingya citizenship or the right to vote and subject them to severe restrictions on movement, marriage and procreation. \"Wirathu plays a central role with his hate speech and the Islamophobia that it creates, given that the Rohingya are surrounded by a hostile community that can be whipped into violence very quickly,\" said Penny Green, director of the International State Crime Initiative at Queen Mary University of London and author of a forthcoming report on Myanmar. \"Why are these people leaving on boats? Why would people risk certain death on the high seas? Because the existence they have, and the lack of a future, is worse.\", This fall, Myanmar, also known as Burma, will hold its first nationwide elections since five decades of military rule ended in 2011. The Obama administration eased major economic sanctions in 2012 and has broadly viewed Myanmar as a diplomatic success story. But the Myanmar governments treatment of the Rohingya has cast a heavy shadow over the democratic transition. It is difficult to see how Muslims, or any group, could pose a threat to Myanmars dominant religion. In this country of 51 million, 9 of 10 people are Buddhist. The Rohingya are believed to account for barely 2%, though exact figures arent known because they were excluded from last years national census. Wirathu offers scant evidence for his claims, saying only that he reviews websites each morning and receives reports \"directly from the people.\" Yet his rhetoric has built support for government policies that critics compare to those of apartheid-era South Africa. The parliament is considering a package of laws that would regulate interfaith marriages and require government approval to change religions, thus feeding into Wirathus narrative that Muslims are trying to coerce Buddhist women into converting to Islam. He vocally supported a law that obliges women to wait three years between having children because it would \"stop the Bengalis,\" a derogatory term for the Rohingya. The Obama administration and human rights groups have called the law  which President Thein Sein approved last week, according to state-run media which parliament approved this month, an assault on womens rights and warned that it could be used to target minority groups. By the end of the month, the Rohingya must surrender the temporary \"white cards\" that constitute their only official identification, which will make it all but impossible for most to move between villages, start a small business or attend school. \"Freedom of movement is very important,\" said Shwe Maung, one of only two ethnic Rohingya members of parliament. \"No movement means no business, no chance for a better life, no money. People will become more and more vulnerable, and want to escape.\", Wirathus venomous tirades are at odds with the common Western conception of a Buddhist monk: a gentle, saffron-robed ascetic in the mold of the Dalai Lama. In a nearly two-hour meeting with three journalists from The Times at the home of one of his associates in Yangon, he was genial and relaxed, snacking on yogurt and fruit as young male aides orbited around him, but his demeanor soured when the subject turned to Islam. \"I read the Koran,\" he said, his eyes narrowing. \"To tell you the truth, I didnt find anything I liked.\", Wirathu served eight years in prison on charges of inciting religious violence, and was released in 2011 under a general amnesty. Since then, while the interim government cracks down on journalists and student protesters, Wirathu has been allowed to spread his message freely across the country, often with police officers sent in to clear the roads for his arrival. In July, after Wirathu wrote in a Facebook post that two Muslim brothers had raped their Buddhist maid in Mandalay, the second-largest city, an organized mob rampaged through Muslim neighborhoods. Two Muslims were killed. The maid later confessed to fabricating her story, but the swiftness of the violence and the fact that hundreds of riot police officers did not intervene led many to believe that it had been orchestrated. Justice Trust, a U.S.-based human rights group, said in a March report that \"almost every major outbreak of communal violence since October 2012  has been preceded by a 969-sponsored preaching tour in the area, usually by Wirathu himself.\", Powerful politicians frequently visit Wirathu at his monastery in Mandalay, leading to speculation that hard-liners from the former military government are backing him secretly. As ex-military leaders try to remodel themselves into a political party  and fend off an opposition led by democracy activist Aung San Suu Kyi in the upcoming elections  analysts say Wirathus message serves conservative forces well. \"Nothing is better for them than to get the country focused not on the failures of the government to move toward democracy, but on the threat to the countrys dominant religion,\" said Roger Normand, founder of Justice Trust. Wirathu denies links to the government or advocating mob violence, saying the attacks in Mandalay were \"a setup by the Muslims so the world would see me as a terrorist.\", \"I dont work based on grudges. I work based on data,\" he said. \"Look at my face. I dont have any hatred at all.\", shashank.bengali@latimes.com, Twitter: @SBengali]", "Date": "20150524", "Author": "[Shashank Bengali]", "Link": "http://www.latimes.com/world/asia/la-fg-ff-myanmar-monk-20150524-story.html", "Title": "[Monk dubbed 'Buddhist Bin Laden' targets Myanmar's persecuted Muslims ]"}