{"Content": "[ The Democratic National Committee on Thursday selected Philadelphia as the site of the partys 2016 national convention, citing the citys experience in hosting large-scale events. Philadelphia, renowned for attractions such as Independence Hall and the Liberty Bell, edged out Columbus, Ohio, and New York City for the opportunity to host delegates from across the country for a presidential nominating convention to be held much earlier in the election year than in previous cycles. Last month, Democrats announced the convention would be held the week of July 25, 2016, several days after the Republican National Committee is scheduled to hold its convention in Cleveland. The Democrats choice to schedule a convention so close to the Republicans is viewed by some as an effort to slow any momentum the new GOP nominee will have coming out of the convention as they look to benefit from the committees general election funds. The Republicans choice of Cleveland renewed a debate over whether placing a partys convention in a swing state, such as Ohio, can help tilt the vote in that state, though the theory hasnt held up in past election cycles. Pennsylvanias 20 electoral votes are coveted in presidential elections. President Obama won the state in 2008 and 2012. Logistics are also a factor in convention site choices: In a conference call with reporters Thursday, Democratic officials lauded Philadelphia for its public transportation and 18,500 downtown hotel rooms that are close to Wells Fargo Center, the conventions venue. Delegate experience is important. We want our delegates to leave the convention energized, said Rep. Debbie Wasserman Schultz (D-Fla.), the DNCs chairwoman. Republicans held their 2000 convention in Philadelphia, which Democratic Party and local officials said put the city in a strong position to host next years convention. We do big events well, said Mayor Michael Nutter. The convention adds to the roster of big events in Philadelphias future: In September, the city will host Pope Francis, who will take part in the World Meeting of Families conference and will celebrate a Mass on the Benjamin Franklin Parkway that is expected to draw 2 million people. The DNC signed the final contract with Philadelphia on Thursday, and Philadelphia has committed to raising $85 million to host the convention. Cleveland committed to raising about $70 million to handle security and other expenses to host the Republican convention. Pennsylvania Democrats who backed the citys wooing of the DNC included former Gov. Ed Rendell, Sen.Bob Caseyand Gov. Tom Wolf. Well replicate some stuff from 2000, Rendell said of the GOP convention, which gave an estimated $345-million boost to the local economy. Like the mayor said, we do big events well. Follow@kurtisaleeand emailkurtis.lee@latimes.com, 10:46 a.m. This article has been updated with additional comments. 7:25 a.m. This article was updated with additional information. This article was published at 6:49 a.m.]", "Date": "20150212", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-2016-philly-democratic-convention-2020150212-story.html", "Title": "[Philadelphia will host 2016 Democratic National Convention ]"}