{"Content": "[ Daniel Donovan Jr. the district attorney who oversaw the investigation of the police-involved death of Eric Garner in New York City, handily won a seat in Congress on Tuesday. The Republican was beating his Democratic opponent, Vincent J. Gentile, 59% to 39%, unofficial results of the special election show. The seat, which serves Staten Island and part of Brooklyn, was vacated in January by Michael G. Grimm, a Republican who resigned from Congress after pleading guilty to federal tax evasion. In celebratory remarks Tuesday night, Donovan vowed to try to raise the employment rate, lower taxes on the middle class and reduce government spending. He also promised to fight Islamic extremism and voiced firm opposition to a nuclear deal with Iran. New Yorks 11th Congressional District would appear tailor-made for Donovan: Staten Island is a conservative borough that is home to many police officers and firefighters. But Donovan was on the receiving end of nationwide criticism for his handling of the Garner case. In November, a grand jury declined to indict New York Police Officer Daniel Pantaleo after he used what appeared to be a chokehold, a prohibited police tactic, to subdue Garner during an arrest in July. Medical examiners found Garners death to be a homicide and called the officers actions a major factor. Donovan told the Associated Press that he had to fight the misconception that he had control over the grand jurys decision. I always try to correct people when they say, You failed to get an indictment, he told the AP. That means that our goal should have been to get one. And our goal is to present fair and impartial evidence to 23 members of our community. Donovan also was criticized for releasing little information about the grand jury proceedings. In New York, only district attorneys or prosecutors can request the release of grand jury information. Donovan requested, and was granted permission, to release only the number of witnesses who testified and the type of evidence they reviewed. He did not ask for a release of witness transcripts, surveillance video or autopsy reports,a stark contrast to St. Louis County prosecutor Robert McCullochs decision to release all the evidence presented to a grand jury that considered charges against Darren Wilson, the Ferguson, Mo. police officer who fatally shot Michael Brown. For more news, follow@JamesQueallyLAT and @raablauren on Twitter.]", "Date": "20150505", "Author": "[James Queally, Lauren Raab]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-dan-donovan-congress-20150505-story.html", "Title": "[Dan Donovan, prosecutor in Eric Garner death case, wins House seat]"}