{"Content": "[ Vanilla is the most popular ice cream flavor in America, not because it is the best (that would be coffee) but because it is the least objectionable. Put another way, vanilla is the most acceptable to the most people; its not many peoples favorite, but nobody hates it. And thats why Wisconsin Gov. Scott Walker is the vanilla candidate. A new Des Moines Register poll has Walker in first place  narrowly  among likely Republican caucus-goers. With Mitt Romney included in the poll, he was the respondents first choice with 15 percentage points. Kentucky Sen. Rand Paul was second with 14 percentage points and Romney with 13. With Romney out, Walkers lead rose to 16 percentage points and Pauls to 15. First place in a tightly packed field is better than any of the alternatives, but its not that big a deal this far out. The big deal is the vanilla factor. According to Jennifer Jacobs of the Des Moines Register, 51% of caucus-goers want an anti-establishment candidate without a lot of ties to Washington or Wall Street who would change the way things are done and challenge conventional thinking. Meanwhile, 43% prefer a more establishment figure with executive experience who understands business and how to execute ideas. Walker is in the golden spot. He can, like Bill Murray in the movie Groundhog Day listening to Andie MacDowell explain the perfect man, reply thats me to almost everything Republicans want. Executive experience? Challenge conventional thinking? Anti-establishment fighter? Me, me, me. Respondents looking for an establishment candidate said Romney was their first choice. Those preferring an outsider said Paul was their first choice. But both groups said their second choice was a big scoop of Walker. Of course, this can all change. No matter how palatable it is, people can still grow weary of vanilla, and Walker may melt under the pressure. Though having won three statewide elections in four years  in liberal Wisconsin!  thats unlikely. If youre Jeb Bush, Paul, Ted Cruz or nearly all the other candidates  official and unofficial  Walker should have you worried. Right now, most of field is made up of boutique flavors, intensely popular among some, intensely unpopular among others. Pundits talk of the establishment versus tea parties rift in the GOP as a recent development. The truth is this schism is more like a permanent feature of Republican politics. Robert Taft, Barry Goldwater, Ronald Reagan and Newt Gingrich fought the forces of Thomas Dewey, Nelson Rockefeller, Bob Dole and George H.W. Bush with hammers and tongs for decades, losing many early battles and winning later ones. Richard Nixon brilliantly played both sides against the other, alternating between establishmentarian noblesse oblige and populist hostility to the Georgetown set whenever it served his purposes. These squabbles often took an ideological color, but they were sometimes simply bare-knuckle fights over who got control of the levers of power within the party. Even today, the ideological differences between the anti-establishment Cruz and that supposedly wan vassal of entrenched power, Senate Majority Leader Mitch McConnell, are quite small. Bush is doing a phenomenal job securing support from big GOP donors. As a result, the Beltway news corps has dubbed him the front-runner. Republicans have a tradition of picking an anointed one early, Karen Tumulty and Matea Gold of the Washington Post write. That establishment candidate almost always ends up with the nomination, although not without a fight and some speed bumps along the way. Yes and no. The anointed one and the establishment candidate are not necessarily the same person. And what counts as the establishment is often a moving target. Just consider the Bushes. George H.W. Bush ran as the establishment candidate and lost to the anointed candidate in 1980. George W. Bush thought he was anointed in 2000 but ended up having to run as an anti-establishment candidate. Ultimately both got elected, but only after finding peak vanilla. Jeb Bush is a long way from that. jgoldberg@latimescolumnists.com, Follow the Opinion section on Twitter @latimesopinion and Facebook, MORE FROM OPINION: , Are Americans too jaded about politics to care anymore?, Vaccine skeptics and Chris Christie say its about choice. Theyre wrong, Remember political correctness? Its back, frothing at the mouth and at hurricane force]", "Date": "20150202", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0203-goldberg-scott-walker-2016-race-20150203-column.html", "Title": "[The vanilla power of Republican Scott Walker]"}