{"Content": "[ For Mark Ulatowski, the opportunity to see Donald Trump  brash, fiery and unapologetic as ever  was well worth the three-hour drive north from his home near the U.S.-Mexico border. \"He speaks to me. He speaks to a lot of us, because he speaks the truth,\" said Ulatowski, a U.S. Army veteran who made the trek Saturday to see the real estate mogul turned reality television star, and now GOP presidential hopeful, denounce illegal immigration and castigate Democrats and fellow Republicans alike. \"Its not just about him actually standing up and fighting against illegal immigration,\" said Ulatowski as he stood in 100-degree heat alongside thousands waiting to enter the sprawling downtown convention center. \"He says what politicians would never say, and thats refreshing.\", A blunt-spoken hero to fans like Ulatowski, an exasperating blowhard to his many critics, Trump seized the spotlight in the Republican presidential campaign with his inflammatory comments about Mexican immigrants, and for more than two weeks has refused to relinquish center stage despite increasingly frantic pleas from GOP officials. His denunciations of illegal immigrants and foreign competitors, from China to Mexico, have struck a chord with millions of voters  particularly older, white conservatives, polls indicate  who feel that most politicians have ignored their concerns. Their backing has propelled Trump to the front rank of the splintered GOP field. At the same time, Trumps words have harmed the partys already tenuous efforts to attract minority voters, particularly Latinos, whom a Republican presidential nominee would need to win key states in the 2016 election. And the cautious and tentative comments that most of the other GOP candidates have made in response have highlighted how narrow a path the party must tread if it hopes to win the presidency  trying to reach out to minority voters while fearing to alienate the conservative whites who have formed the GOPs base of support in recent elections. In an appearance here that coupled fiery rhetoric with over-the-top displays of self-love  \"I went to the Wharton School of Finance; Im, like, a really smart person,\" he declared at one point  Trump reinforced both parts of his image. He served up the sort of blunt talk that his supporters praise along with lines that critics cite when they label him an overweening narcissist. His supporters, he said, were a \"silent majority\" who would be able to tilt the Republican presidential primaries, which will begin seven months from now, in his favor. Appearing with Maricopa County Sheriff Joe Arpaio, a fierce foe of illegal immigration, Trump did not limit himself to immigration issues. At various points, he took on President Obama (\"You know I dont use teleprompters like the president  I speak from the heart\"), Caroline Kennedy, Hillary Rodham Clinton, Jeb Bush, NBC and Univision. He offered few specifics for a campaign, other than to insist hed do a better job than either Clinton or Bush  two candidates on opposite sides of the aisle who come from political dynasties that many of his backers see as symbols of an unresponsive political establishment. Thats been enough to push Trump forward. In a Reuters-Ipsos poll released Saturday, Bush and Trump were tied at 15% for the lead nationwide in the Republican field. The Reuters survey was the second national poll in recent days showing Trump with about 15% of the GOP vote and in the top tier of the crowded field. An Economist/YouGov survey showed Trump was one of the Republican front-runners and simultaneously its most widely disliked candidate. Almost half of voters surveyed had a \"very unfavorable\" view of Trump, the survey found, including almost 1 in 3 registered Republicans  far more than for any other GOP candidate. The poll also indicated that many of his backers didnt necessarily expect Trump to win. Only 7% of those surveyed called Trump the \"most likely\" to gain the nomination. At one point in his speech, protesters began to shout at Trump as they held signs, assailing him as a racist. \"I wonder if the Mexican government sent them over here,\" Trump said as the protesters, many of them Latino, were escorted from the convention hall by security. \"Dont worry, well take our country back,\" he said as the crowd cheered. That was one of several times the crowd responded with cheers, sometimes of \"U-S-A!\"  sometimes with \"Build the wall!\" when he pledged to erect a wall along the entire length of the southern border. Trump frequently criticized the Mexican government, although he insisted he had no conflict with the country or the Mexican people. \"I respect Mexico, but their leaders are too smart for our leaders, because we have stupid leaders, OK?\" Trump said, to more cheers and chants of \"U-S-A!\", Supporters here said they admired what they saw as Trumps honesty. \"He calls a spade a spade and is the only one willing to say it like it is,\" said Jim Wines, a registered Republican from Surprise, Ariz. \"Id vote for him to be president today.\", Diane Sapiro stood few feet behind Wines in a line that snaked several city blocks before Trumps arrival. She wore a button that read \"Make America great again,\" adorned with a picture of a scowling Trump. Sapiro said she was an unaffiliated voter, disenchanted by both Democrats and Republicans. \"Hes arrogant and a little cocky, but when he talks, hes saying stuff I agree with,\" said the Chandler, Ariz. resident. \"Illegals coming across the border are an issue here.\", By contrast, top Republicans in Arizona, including Sens. John McCain and Jeff Flake and Gov. Doug Ducey, did not attend. Both McCain and Flake supported a bipartisan comprehensive immigration proposal that passed the Senate in 2013 but ultimately stalled in the Republican-controlled House. In interviews last week, McCain, the GOPs 2008 presidential nominee, lambasted Trumps remarks as \"offensive,\" saying that a majority of Arizonans would disagree with his views. Trump shot back, telling reporters that McCain was \"very weak on immigration.\", Stan Barnes, a Republican strategist based in Phoenix, said there was \"a large and important segment of the electorate not just here in Arizona, but nationally, who view illegal immigration as the top problem facing the federal government.\", \"Trumps willingness to approach this issue directly has electrified that voter, and were seeing it play a role in the race.\", Angel McConnell, who traveled from her ranch in a rural development outside of Scottsdale, Ariz. agreed. \"He has the momentum,\" she said. \"If we stay with him, the sky is the limit. We dont need any more career politicians; we need someone who will speak bluntly  whether you like it or not.\", Twitter: @kurtisalee, Times Staff Writers David Lauter in Washington and Natalie Schachar in Los Angeles contributed to this report.]", "Date": "20150712", "Author": "[Kurtis Lee]", "Link": "http://www.latimes.com/nation/immigration/la-na-trump-immigration-20150712-story.html", "Title": "[Donald Trump's immigration stance divides, inflames and inspires ]"}