{"Content": "[ The mood among Democrats on Capitol Hill soured as details of a $1.1-trillion spending bill confronted them Wednesday with the reality of their eroding political leverage. Elections have consequences, Democratic negotiators said as they spent much of the day defending the deals they cut with Republicans, saying it was the best they could do. \"I say to my colleagues: Stay steady; stay strong,\" said Sen. Barbara Mikulski (D-Md.), the chief Democratic negotiator on the huge bill that will fund most government departments through the end of September. \"You know, sometimes you give a little, you take a little,\" she said. As is typically the case with must-pass money bills, the current appropriations measure, which is necessary to prevent a government shutdown, not only sets spending levels but also includes a host of substantive provisions tacked on by influential lawmakers. Democratic leaders said they had stopped dozens of Republican proposals -- to restrict abortions, loosen rules on mountain-top coal mining, enable ivory imports and expand gun rights -- in return for the ones they did agree to. They said that compromise was tough, but that leaving decisions to next year, when Republicans will have a majority in both houses, would have been worse for Democratic priorities. Those arguments did not soothe critics of the 1,603-page bill that is making its way toward a House vote on Thursday, with the Senate expected to follow by weeks end. A coalition of liberal lawmakers, led by Sen. Elizabeth Warren (D-Mass.), made a last-minute pitch to change a provision of the bill that would weaken financial regulations. The measure would loosen rules on certain types of financial swaps by banks -- deals that were at the heart of the 2008 financial meltdown. The rules were adopted under the Dodd-Frank financial reform law and have been a major target for Republicans. \"The American people did not send us here to work for Wall Street banks,\" said Warren, a potential 2016 presidential contender. \"They sent us here to work for them.\", Warren and Rep. Maxine Waters (D-Los Angeles), the top Democrat on the House Financial Services Committee, urged the House to delete the provision before Thursdays vote. But changes at this stage, with just days remaining before Congress is set to recess for the holidays, seem unlikely. Democrats arent the only ones upset. The bill fails to stop Obamacare or the presidents move to shield from deportation up to 5 million immigrants in the U.S. illegally. As a result, some conservative Republicans will not vote for it, meaning that House Speaker John A. Boehner (R-Ohio) will need some Democratic votes to pass the package. That gives Democrats some leverage, but only a limited amount. Minority Leader Nancy Pelosi (D-San Francisco) called two provisions of the package \"deeply troubling\": the effort to weaken the financial swaps rule and a separate provision that would triple the amount of money donors can contribute to political parties. \"We must get them out,\" she said. But it was unclear whether Pelosi would try to block any Democrats from supporting the bill. Last summer, 70 House Democrats voted for a separate piece of legislation that would have weakened the swaps rule. What may have been more alarming for Democrats than the provisions in the bill was the preview it offered of GOP priorities for next year. Sen. Mitch McConnell of Kentucky, the incoming Republican majority leader, has made it clear he hopes to fight the Environmental Protection Agencys regulations on coal and the Dodd-Frank financial services overhaul, as well as Obamacare and the administrations recent move to shield up to 5 million immigrants from deportations. Democratic leaders realized this was their best chance to cut a deal before Republicans take control. Republicans underscored that point. Had he been at the negotiating table, \"it would have been open season on Dodd-Frank,\" said Rep. Jeb Hensarling (R-Texas), chairman of the House Financial Services Committee. Still, the deal is a tough one for Democrats to accept. Half of the package goes to military spending, under previously agreed-to spending caps, with the remainder for other domestic accounts. New money goes largely overseas -- to fight the Ebola crisis and Islamic State militants. Many domestic programs will see cuts -- including a $60-million reduction to the EPAs budget, which will cut funds by 21% since 2010, when Republicans took control of the House. The package guts some other Democratic priorities: Regulations to limit sodium in school kids lunches were blocked; money to pursue endangered status for the sage grouse was scrapped; and there will be no funds for high-speed rail, including the line being developed between San Francisco and Los Angeles. Still, said an aide to Mikulski, whatever the Republican Congress would have produced next year would be \"10 times worse\" for Democrats. \"We knocked so many bad things out of this,\" the aide said, speaking on condition of anonymity to discuss the negotiations. For the latest from Congress follow @LisaMascaro]", "Date": "20141210", "Author": "[Lisa Mascaro]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-congress-money-20141210-story.html", "Title": "[Democrats sour over government funding bill with Republican priorities]"}