{"Content": "[ Gay marriage may be a settled issue in as many as 30 states after Mondays Supreme Court decision, but it still poses an existential threat to many Republican candidates, especially as the calendar turns to the 2016 presidential contest. As public opinion has sailed toward greater acceptance of same sex unions, Republicans have struggled to finesse the issue, caught between pressure from powerful conservative groups and younger voters who hold more liberal views. ------------, FOR THE RECORD, An earlier version of this post misspelled the first name of Penny Nance, the chief executive and president of Concerned Women for America. ------------, The GOP presidential candidates face a particularly delicate dance in early primary states such as Iowa and South Carolina: They must appease theconservative foot soldiers who control those early contests while not alienating middle-of-the-road and younger voters key to their general election hopes. When the Supreme Court cleared the way Monday for same-sex marriage in 11 states, there was no evidence that conservative groups were backing away from the fight, even if fewcandidates in Novembers closely contested races and beyond were looking to jump into the middle of it. Leaders such as Ralph Reed of the Coalition for Faith & Freedom and Penny Nance of Concerned Women for America insisted that the decision would serve as a rallying cry for conservatives in November. We cannot overemphasize the importance of the upcoming elections, Nance said after the decision. Conservatives must come out to the polls in the upcoming elections in overwhelming numbers and make sure that our elected officials, and the next president of the United States, respect and appreciate the right of the people to define marriage as it has always been throughout our history -- the union between one man and one woman. Language like that serves to turn up the heat not only on 2014 Republicans but also on the would-becandidates who are beginning their courtship of voters. Every cycle, candidates spend a significant amount of time attempting to curry favor with influential social conservative leaders -- making stops at Bob Jones University in South Carolina, for example -- to affirm their faith in traditionalparty principles. With same-sex marriage back on the agenda, some potential candidates are likely to face a rougher road than others. Ohio Sen. Rob Portman could face a backlash from conservative groups for speaking publicly about his personal evolution on the issue after learning his son was gay. New Jersey Gov. Chris Christie, who opposes gay marriage, has already faced criticism from social conservatives after he chose to not pursue a legal fight to block same-sex marriages in his state in 2013. On Monday, Christie declined to give an opinion on the Supreme Court ruling, according to the Star-Ledger, because he said he was not familiar with the details. That will not hold for long. They are going to have to talk about it, said Bob Vander Plaats, president and chief executive of Iowa-based Family Leader. Vander Plaats said his group and others would press the contenders on whether children deserve to be raised by a mom and a dad, and what they will do if a court oversteps its authority. This is a time to double down, Vander Plaats said after the Supreme Court decision. Americans, and for sure Iowans, are fed up with the courts injecting themselves in making marriage law. Those who did express their views were generally those who stand firmly in the anti-gay-marriage camp and who are not immediately on the ballot. Potential 2016 candidate Ted Cruz, the Texas senator and tea party darling who is trying to galvanize conservatives,called the Supreme Court decision tragic and indefensible and said itamounted to judicial activism at its worst. Texas Gov. Rick Perry, who also is seriously considering a run for president, said in a statement that marriage laws should be left to the states to determine. The Supreme Courts refusal to address these cases further places a courts judgment above the judgment of people who live in states like Oklahoma, Utah, Virginia, Wisconsin and Indiana, who have made their collective voices heard on this issue, Perry said. This is, unfortunately, another instance of overreach by the federal government. , Contrast that with the reaction inmore narrowly divided states such as Florida and Georgia, two states with increasing numbers of younger voters. Several political analysts noted that gay marriage has hardly come up at all in the Florida governors race, where Republican incumbent Rick Scott is fending off a challenge from Democrat Charlie Crist, or in the race for U.S. Senate in Georgia, where Republican David Perdue is running against Democrat Michelle Nunn. Gay marriage in Georgia is so far on the back burner that its probably out in the pantry. It just hasnt been mentioned this year, said University of Georgia political science professor Charles Bullock. You have a generational divide now within the Republican Party -- for young Republicans, and even some activists out there working for candidates -- its not a big issue anymore for them, Bullock said. In Florida, much sought after in presidential years, 48% of registered voters are younger than 50, said Susan MacManus, a politics and government professor at the University of South Florida. And an additional 26% of voters declined to register either as Democrats or Republicans. Facing those numbers, there are a lot of Republicans who are looking ahead, and not looking back, and so the whole attitude about [about gay marriage] has changed considerably just in the last four or five years, she said. Young Republicans have made it very clear that [the party] needs to move away from these social issues. Florida Atty. Gen. Pam Bondi, a Republican, has been far more outspoken than Scott on the issue as she seeks reelection, MacManus said, but even she has backed away somewhat as the general election has drawn closer. In this final stretch of the midterm elections in those states, staying quiet on the issue simply may be smart politics, as Republicans put off a debate likely to escalate as 2016 nears. Twitter: @MaeveReston]", "Date": "20141007", "Author": "[Maeve Reston]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-gay-marriage-supreme-court-republicans-20141007-story.html", "Title": "[Gay marriage poses a dilemma for many Republican candidates]"}