{"Content": "[ In his first public remarks since telling GOP donors that he is weighing a third bid for the White House, Mitt Romney suggested Friday that if he does run he would alter the focus that led to his loss in 2012 to President Obama. I believe in the post-Obama era we need to stand for safety, and for opportunity for all people, and we have to stand for helping lift people out of poverty, Romney told hundreds of Republican National Committee members and their guests at a dinner aboard the aircraft carrier Midway, berthed in San Diego Harbor. He specifically cited income inequality and the scourge of poverty  elements he rarely discussed in 2012. A familiar note was his emphasis on a muscular foreign policy; in a new twist, Romney sought to tie likely Democratic candidate Hillary Rodham Clinton to Obamas overseas policies he criticizes. I am giving some serious consideration for the future, he said. But this I know  we can win in 2016 ... if we communicate a clear vision of where were taking this country. Romneys change of emphasis was apparent not only in his choice of issues but in his remarks about the 10 years he spent as a Mormon bishop. He rarely discussed those experiences during his 2012 or 2008 campaigns, instead focusing on his business career. The former Massachusetts governor said his wife, Ann, understood his heart, and indicated she supported another campaign. She believes that people get better with experience, he joked as the crowd applauded, and heaven knows that I have experience running for president. Romney and his wife had been emphatic that he would not run again. He began reconsidering recently and made it public after former Florida Gov. Jeb Bush announced in December that he might run. In choosing to address the RNC, Romney placed himself in front of influential party leaders from across the nation. Speaking in interviews, several committee members expressed surprise at his renewed interest and warned that he would be starting from scratch like other potential candidates in a crowded 2016 field. Three other possible presidential candidates spoke at the RNC winter meeting at the historic Hotel del Coronado. Texas Gov. Rick Perry, who ran and lost in 2012, has been working to change the image created by his poor debate performance and stumbling campaign. Perry, who leaves office Tuesday after 14 years, acknowledged that he was deciding whether to run but offered little in his speech other than familiar praise for job creation in Texas and strong criticism of Obamas immigration and foreign policy. What is at stake is the preservation of Western values, he said at one point. What is required is not moral confusion but moral clarity. Wisconsin Gov. Scott Walker, in a poke at Romney and other veteran candidates, told Republicans on Thursday night that the party needed a new fresh leader with big bold ideas and a proven track record. Walker lacks the name recognition and fundraising base of Romney, Bush or New Jersey Gov. Chris Christie. But he received a warm response from the crowd as he argued that he implemented a conservative agenda in his state that could serve as a template for the presidency. Common-sense reforms  a phrase he used repeatedly  can work not just in Wisconsin, but they can work all across America, he said. Dr. Ben Carson, a neurosurgeon popular among conservatives who also is flirting with a presidential run, warned that Republicans must avoid being cowed by political correctness. We must be willing to stand up for what we believe in, he said. Bush was in Southern California raising money for his political action committee and greeting influential Republicans, but he did not make an appearance at the four-day gathering. The 2016 field has the potential to be the most crowded in decades, which Republicans tried to spin as a positive, with many choices for voters. Democrats are almost certain to nominate Clinton if she decides to run, a scenario that Republican Party Chairman Reince Priebus contrasted with the spirited contest the GOP expects. Theres intrigue, theres drama, its interesting. I think thats all great for our party. I think the other side is boring, stale, day-old bread that weve all seen before, Priebus told reporters shortly after being elected to a historic third term as the partys chief. The question and the challenge for our party, and its very honest I think, given that drama, intrigue and interest: what we can we do as a national party to make sure that process doesnt get out of control. During the gathering, the party announced moves to compress its nomination process, a move aimed at avoiding a repeat of 2012. Many Republicans believe Romney was badly damaged during that years primaries by nearly two dozen debates and a prolonged selection process. This week, the party announced that its nominating convention would take place in July 2016, more than a month earlier than years past. It also announced nine sanctioned debates  fewer than half the number of last time  with the warning that candidates who participate in unofficial debates would be barred from participating in RNC forums. seema.mehta@latimes.com, cathleen.decker@latimes.com, Twitter: @latseema; @cathleendecker, , ]", "Date": "20150116", "Author": "[Seema Mehta, Cathleen Decker]", "Link": "http://www.latimes.com/local/politics/la-me-republicans-romney-20150117-story.html", "Title": "[Mitt Romney returns to stage with vow to fight 'scourge of poverty']"}