{"Content": "[ The fervent Republicans who throng the Conservative Political Action Conference every year arent representative of the American electorate. They arent even representative of the GOP electorate. For four of the last five years, their straw poll for president has chosen Rand Paul or Ron Paul. These are not everyday Republicans. Yet the conference, which took place Thursday through Saturday, is still an important event  the starting gun of the Republican primary campaign, in the words of one veteran GOP strategist. Its the first real national audition for potential Republican candidates, all on the same stage, one after the other  even if the TV audience is only on C-SPAN. And a good performance can help recruit conservative foot soldiers across the country. So almost everyone whos considering a run showed up, from CPAC favorites Rand Paul and Ted Cruz all the way to Jeb Bush, whos fighting off an unwanted label as the most moderate Republican in the race. Heres what we learned: Bush has staying power, despite conservatives suspicion that hes a closet moderate. Scott Walker, the governor of Wisconsin, is hot  the new more-conservative hope to stop the Bush juggernaut. Sens. Cruz (R-Texas) and Marco Rubio (R-Fla.) could rise if Walker stumbles. Chris Christie looks like a spent force. And Rand Paul is still Rand Paul. Yes, its still early; none of these proto-candidates has even announced formally that hes running. But it wasnt too early for each to deploy campaign buttons and T-shirts in CPACs big convention hall. And that means it isnt too early to describe the rough shape of the 2016 GOP field: no single front-runner, but four or five candidates who are most likely to succeed. Bush didnt have the attendees on his side. There was a smattering of catcalls when he took the stage; a flag-waving activist in a Revolutionary War uniform led a decorous walkout of about two dozen. But Bushs organization had salted the room with supporters  a page from Practical Politics 101  and their cheers beat back the boos. Bush sensibly tackled the two issues on which he has diverged from his party orthodoxy  immigration and education  and while he attempted to make his positions sound as conservative as possible, he didnt trim them much. He repeated his support for legislation that would create a path to legal status for immigrants who are in the country illegally, although he agreed that enforcing border controls should come first. On education, he defended the Common Core system of standards, which many conservatives loathe, insisting it was never intended to remove authority from state and local governments. Its fine to oppose the bad things, Bush said. We need to start being for things again. It was a solid, steady performance before a tough audience, and a step Bush needed, to remind GOP voters that hes a conservative too. But the real winner of the event may have been Walker, the usually taciturn governor of Wisconsin, who brought the audience to its feet with an animated speech full of red meat. Theres a reason we celebrate July 4 and not April 15, Walker said. We celebrate our independence from government, not dependence on it.... Get government out of the way. He listed his actions as governor  confronting public employee unions, lowering taxes, pushing anti-abortion legislation, lowering restrictions on concealed firearms  and said they showed that he is someone whos going to fight. He stumbled when, asked how he would handle Islamic terrorists, he suggested his experience as governor covered that, too. If I could take on 100,000 protesters [in Wisconsin], I can do the same across the world, he said  a parallel that doesnt hold up long. But his audience hardly noticed. Hes the one, said Ruth Willis of Syracuse, N.Y. Hes already won more fights than any of the others. Cruz and Rubio were more polished  but as senators, neither could match Walkers executive experience far away from Washington. One more lesson: Republicans will be talking a lot about foreign policy in this campaign. Our allies no longer trust us and our enemies no longer fear us, Rubio warned. He charged that President Obama treats the ayatollah of Iran better than the prime minister of Israel. Rubio and others skipped ahead to criticize former Secretary of State Hillary Rodham Clinton, whom they excoriated as no different from Obama in foreign affairs. She actually gave a reset button to the Russians, exclaimed Walker, to whoops from the audience. A reset button!, The growing hawkishness in conservative ranks is a bad sign for Rand Paul, who has broken with most of his colleagues to urge restraint in U.S. foreign policy. But its in keeping with recent polls that show most voters holding more confidence in Republicans than Democrats on foreign policy  a reversal of a GOP slump after the 2003 invasion of Iraq. What was missing from CPAC? Any sign of the intellectual ferment in conservative think tanks about how to address the stagnant incomes of the American middle class. Most speakers stuck to more traditional fare: smaller government, lower taxes, less regulation. There are new ideas in the Republican Party, but this, it seems, was neither the time nor the place. But Election Day 2016 is still a year and a half away. On the Republican side, theyre off  and (almost) running. doyle.mcmanus@latimes.com, Twitter: @DoyleMcManus, Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150227", "Author": "NULL", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-mcmanus-cpac-20150301-column.html", "Title": "[Who killed at CPAC, the GOP's red meat 2016 auditions?]"}