{"Content": "[ The Supreme Court led by Chief Justice John G. Roberts Jr. hasnt been friendly to legislative attempts to reduce the corrupting influence of money in election campaigns. But on Wednesday the court finally found a campaign finance regulation it could support. With Roberts joining four liberal justices, the court upheld a Florida ethics rule prohibiting judicial candidates from personally seeking campaign contributions. It was the right decision. The prohibition at issue is admittedly a modest one: Although judicial candidates in Florida may not personally ask for contributions, their surrogates can, and the candidates are allowed to write thank-you notes to contributors. But the courts holding could lay the groundwork for additional restrictions on the role of money in judicial races. That is important because such races, especially for state supreme courts, increasingly have attracted special-interest money. As Justice Ruth Bader Ginsburg wrote in a concurring opinion, \"issue-oriented organizations and political action committees have spent millions of dollars opposing the reelection of judges whose decisions do not [toe] a party line or are alleged to be out of step with public opinion.\", The linchpin of the decision was the difference between elections for judicial office and those for political offices. \"Judges are not politicians, even when they come to the bench by way of the ballot,\" Roberts wrote in the majority opinion. \"And a states decision to elect its judiciary does not compel it to treat judicial candidates like campaigners for political office. A state may assure its people that judges will apply the law without fear or favor  and without having personally asked anyone for money.\", The court was right to distinguish between judicial and other candidates. After all, candidates for political office are expected to make campaign promises. Thats how democracy works. But the only promise judges should make is to interpret the law evenhandedly and to the best of their ability. Yet, even allowing for that distinction, special-interest money can corrode public confidence in government whether it is expended to support the election of a judge or that of a legislator. Welcome as this decision is, it doesnt undo recent rulings that struck down reasonable controls on money in politics designed to minimize not only the reality of corruption but also its appearance. Last year, for example, the court  with Roberts writing the lead opinion  struck down overall limits on how much an individual could contribute to candidates for federal office. The public needs to have confidence in the integrity of all of its elected officials, not just judges. That will be impossible if the court continues its pattern of dismantling reasonable campaign finance laws in the name of the 1st Amendment. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150430", "Author": "[The Times Editorial Board]", "Link": "http://www.latimes.com/opinion/editorials/la-ed-judges-seeking-campaign-contributions-supreme-court-20150430-story.html", "Title": "[A wise ruling on judicial elections and campaign finance ]"}