{"Content": "[ Attention, political shoppers: There are only 457 days until the next election. Have you made up your mind yet?, This far out, after the first GOP candidates debate on Thursday, were already in horse race mode, guessing whose quips and gaffes will inch which candidates higher in the polls and whos jockeying for that coveted front-runner position. We have 65 more weeks of this, so one can only hope the candidates have enough money, er, energy, to make it to November 2016. In the meantime, feast on some of the early reaction by our letter writers to the earliest debate. But not too much  theres surely more to come. Matt Singerman of Newbury Park makes a prediction:, So a classless, tasteless, loudmouth reality star of questionable real accomplishment is leading in the polls as the GOP candidate? Assuming he wins, we as U.S. citizens will have made the following sentence plausible within the next election cycle:, Time for you to give your State of the Union address, President Kardashian. Janet Weaver ofHuntington Beachwanted the Canadian-born Ted Cruz to answera pertinent question:, I was disappointed when the moderators of the speed-dating event known as a debate neglected to ask Sen. Ted Cruz why his birth in Canada to an American mother doesnt disqualify him for the office mandated to be filled by a natural-born citizen. After all, Fox News has devoted hours of airtime to solemn bloviation in which Republican birthers (including The Donald himself) insist that President Obamas birth to an American mother in Kenya (where it didnt even take place) rendered him ineligible to occupy the Oval Office. Eugene Sison of SanDimas warns voters to expect more of the same:, The hidden little secret of this first debate is this: Whomever the Republican nominee, expect a return to Bush administration economic and foreign policy. More job creating tax cuts for the rich? Sure. More military intervention, less diplomacy? Worked for Bush. Phase out Medicare? Vouchers are cool. Privatize Social Security? Wall Street can be trusted. Climate change? Were not scientists. Criminalize abortion? For women and doctors. And let a Democrat deal with the aftermath. Valley Glen residentRichard Raffalow picks up on a curious dynamic: , I hadnt realized that the candidates would be debating the moderators rather than each other. Thousand Oaks resident Ernest A. Canning cites Sen. Bernie Sanders:, The most striking feature of what passed for a GOP debate was a total failure to address issues that matter to the vast majority of Americans. Sanders summed it up in a tweet: Its over. Not one word about economic inequality, climate change, Citizens United or student debt. Thats why the Rs are so out of touch. Follow the Opinion section on Twitter @latimesopinion and Facebook, ]", "Date": "20150808", "Author": "[Paul Thornton]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-0808-saturday-republican-debate-20150808-story.html", "Title": "[16 months until Election Day, readers have already had enough]"}