{"Content": "[ Even though the GOP caucus in Congress stepped away months ago from its years-long assault on Obamacare, the top contenders for the Republican presidential nod appear to be doubling down. Almost immediately after the Supreme Court issued its decision to uphold the Affordable Care Act on Thursday, every major Republican presidential candidate decried the ruling and called for the healthcare law to be repealed, replaced or both. Heres a sampling of the showdown Republican candidates are promising:, , Despite the Courts decision, ObamaCare is still a bad law that is having a negative impact on our country and on millions of Americans. , I remain committed to repealing this bad law and replacing it... , Any candidate not willing to make 2016 a referendum on Repealing Obamacare should step aside https://t.co/6i4WzLFzKR #FullRepeal, , I remain fully committed to the repeal of Obamacareevery single word of it. And, in 2017, we will do exactly that https://t.co/6i4WzLFzKR, , We need to repeal and replace Obamacare  empowering individuals to make their own health care decisions. http://t.co/je0KD03PJq, , Americans deserve better than what were getting with Obamacare. Its time we repealed and replaced it! http://t.co/1EHfbVKBMa, , #ObamaCare ruling is judicial tyranny. http://t.co/Di6WjxOc3y, , The solution is for Congress to admit they screwed up, repeal the \"nightmare of #Obamacare\" & let states road-test real health care reforms. , It is outrageous that the Supreme Court once again rewrote ObamaCare to save this deeply flawed law https://t.co/NBAnohFTW7, , Repeal Obamacare and let the free marketnot more crony capitalismimprove access and care for all Americans. http://t.co/qaAR7pNVQJ, , RT if you agree we need to elect a conservative President in #2016 so we can repeal and replace #Obamacare #RICK2016, , President Obama and Hillary Clinton would like this to be the end of the debate on Obamacare, but it isnt:\\rhttp://t.co/XpY9HtxFQO, For more breaking news, follow me @cmaiduc, READ MORE , Column: Supreme Court saves Obamacare, the GOP and itself, Obamacare appears to be about as established as a law can be in divided U.S. Supreme Court upholds Obamacare subsidies, a victory for the president]", "Date": "20150625", "Author": "[Christine Mai-Duc]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-obamacare-republican-candidates-repeal-replace-20150625-htmlstory.html", "Title": "[GOP presidential candidates double down on anti-Obamacare rhetoric]"}