{"Content": "[ When Pope Francis visits New York, he is not likely to take the subway, but Gene Russianoff wishes he would. Specifically, Russianoff would like the pontiff to take a ride on the Lexington Avenue line, whose 4, 5 and 6 trains are frequently delayed as riders stuff themselves into the crowded cars that are the only ones serving Manhattans east side. \"Its unbearable,\" said Russianoff, executive director of New Yorks Straphangers Campaign, a watchdog group that since 1979 has badgered the nations largest public transportation system to improve. \"Youve just got to steel yourself.\", Pope Francis is a great advocate of public transportation, and in a spring encyclical he urged cities to prioritize public transportation to help the environment and to alleviate \"undignified conditions\" endured by riders. The pontiff speaks from experience. When he was a cardinal in Buenos Aires, he regularly rode the subways and buses. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, Russianoff speaks from experience too. A native New Yorker and a Harvard-educated lawyer, he has never owned a car. The subway stations closest to where he lived and worked over the years became as familiar as a home driveway is to most Californians. Subway riders know where on the platform to stand if they want to get into the best car for launching them on a quick exit at their destination. They know which metro card machines work well and which ones spit out their credit or debit cards. They know how late the news stands, bodegas and shoe repair shops inside their stations stay open. They get familiar with their stations regular characters, from the homeless people to the religious zealots handing out leaflets. When the subways work well, they are a riders best friend, in sync like a perfect dance partner. But any hiccup, whether caused by kittens on the tracks, a sick passenger or a looming hurricane or blizzard, can throw off the entire city. That is where the Straphangers Campaign, part of the nonprofit New York Public Interest Research Group, comes in. \"We show tough love,\" Russianoff said of the Straphangers, named for the leather loops that used to hang inside subway cars, offering standing riders something to hang onto as they rumbled beneath the city. The group obsessively monitors the lines linking the five boroughs, noting which are most crowded, dirtiest, slowest or plagued by sound systems whose announcements sound more like anguished squawks than helpful messages. In its annual subway report card, released last week, the campaign also notes the best subway lines. This year, the 7 train, which runs from Manhattans west side into Queens, won top honors. The 5 train and the B, which goes from Brooklyn up Manhattans west side, tied for last place. The campaign regularly battles fare increases and fights for communities, most of them in poor and underserved areas, facing service shortfalls. It has advocated for modern features like digital clocks advising riders how long they have to wait for the next train, and cards to replace the tokens that were phased out in 2003. The high-profile fights have brought Russianoff, 62, a measure of fame. Once he was recognized while riding on the much-maligned C train. The only other person in his car was an \"extremely large gentleman,\" Russianoff said during an interview in his Brooklyn home. \"He got up and started to walk  I would say stagger  toward me,\" Russianoff said. \"I thought, This is it. Im gonna buy it on the C train. He came over to me and says, Are you the subway guy?\", Instead of mugging him, the fellow rider praised his activism, something Russianoff says happens two or three times a week. For all his criticism of the subways, Russianoff calls it a \"great system\" that is far better than in the 1980s, when a friend used to joke that he had a strict ridership rule: Never board a car with the chalk outline of a body on the floor. Back then, subway muggings were rife. Stations were dimly lit with 37-watt bulbs, whose eerie glows added to the subways menacing feel. Cars were splattered with graffiti, and air conditioning was not the norm. Cars broke down every few thousand miles; todays cars go more than 150,000 miles between breakdowns. \"Things were bad. Now theyre better,\" Russianoff said, praising the system for offering New Yorkers 24-hour subway service seven days a week. You wont find that in London, Paris, Moscow, Los Angeles, Chicago, Boston or Washington. The subways also offer one flat fare  $2.75, with various discounts available  keeping transportation costs relatively low for New Yorkers who travel long distances to work. There are free subway-to-bus transfers, a development in 1996 that Russianoff joked was akin to the fall of the Berlin Wall. \"Nobody ever believed it would happen,\" he said. But Russianoff says things have slipped in recent years, mainly because of rising ridership and delays in major extensions. The system averages 5.6 million rides per day. An extension of the 7 line just opened, nearly two years after it had been envisioned for completion. The first phase of a new line on Manhattans east side, initially proposed in 1919, wont open until the end of 2016. The entire line is not expected to be finished until 2029. \"You gotta hope. Its desperately needed,\" said Russianoff, who admits being skeptical. In recent years, the Straphangers Campaign has pushed to improve bus service to lighten the load on the subways. But unlike Los Angeles and other cities with wide, bus-friendly avenues, New York City is laced with narrow streets jammed with delivery trucks, taxis, private vehicles and, in recent years, bicycle lanes, all competing for space and guaranteeing traffic jams. Last year, the Straphangers gave its annual Pokey Award, for the citys slowest bus route, to a 79th Street line, which it said moved at 3.2 mph, slower than lava oozing from Hawaiis Kilauea volcano. SIGN UP for the free Great Reads newsletter >>, That leaves underground travel the best option for getting somewhere fast, and ensures that every battle Russianoff takes on will be closely watched by millions of riders. \"It takes a lot of chutzpah,\" he said of his job. \"New York is a tough audience.\", As for Pope Francis, if he were to ride the subway, chances are hed be on the Lexington Avenue line part of the time because of his itinerary. The Secret Service, which is overseeing security for Francis visit, was asked at a recent briefing if the pontiff had indicated a desire to use public transportation. \"We hope not,\" said Robert J. Sica, head of the Secret Services New York office. The citys police commissioner, William J. Bratton, chimed in. \"And if he does, he better pay the fare.\", However he gets around, Francis appeal for better public transport has struck a chord in New York. \"He cares about the public and whats on the publics mind, and this is one of those key things,\" Russianoff said. \"He could be a member of the Straphangers Campaign.\", tina.susman@latimes.com , Twitter:@tinasusman, MORE ON THE POPE IN THE U.S. Pope Francis, whose vision has captivated the world, brings it to North America, Pope Francis U.S. visit may have political value for President Obama, who shares some views, Awaiting Pope Francis visit, LGBT Catholics and supporters in U.S. are hopeful]", "Date": "20150921", "Author": "[Tina Susman]", "Link": "http://www.latimes.com/nation/la-na-pope-visit-subways-20150921-story.html", "Title": "[New York subway watchdog hopes Pope Francis climbs aboard]"}