{"Content": "[ Until last week, no Democratic state legislator running for reelection had lost to a Republican in 20 years. Then suddenly three did. When incumbents start losing their legislative seats, it means something is happening. The national Republican wave? Sure. Some of that washed into California. But it wasnt just that. Also credit  or blame  voter-approved reforms that are starting to affect Californias legislative elections. First, voters stripped the Legislature of its power to shamelessly gerrymander districts to protect incumbents. The remapping duty was handed to an independent citizens commission. The first effect was felt in the 2012 elections. The idea was to make redistricting less partisan and the seats more competitive. And its happening. Second, voters adopted the \"top two\" open primary. Starting in 2012, candidates didnt seek party nominations. They sought to finish in the top two, regardless of party, and qualify for the November election. That meant they needed to attract voters outside their own party bases. In theory, this would result in the election of more moderates and fewer party extremists. That also is happening. \"If youre looking for a functional Legislature,\" says Republican consultant Rob Stutzman, \"theres good reason to be optimistic more than at any time in the last decade.\", Democrat consultant David Townsend, who advises an unofficial moderate caucus in the Legislature, says that 15 years ago only six Assembly Democrats were considered moderates. In the next legislative session, he says, half the Assembly Democrats will be. Whats the definition of a moderate? Townsend says Gov. Jerry Brown, a Democrat, asked him that a couple of years ago. \"I said, Jerry, youre a moderate.\", \"The whole mission of moderates,\" Townsend continues, \"is economic growth. If youre out there trying to regulate everything, youre not a moderate.\", Of course, Republicans also can be considered moderates if theyre laissez-faire on social issues such as abortion and gay marriage. Allan Hoffenblum, a former GOP consultant who publishes the California Target Book, which handicaps legislative races, resists using the word moderate. \"I refer to them as representative of their district,\" he says. Hoffenblum dug into the data and found that the last time a Republican legislative candidate had defeated a Democratic incumbent in California was 1994, amidst a national GOP tidal wave. For many years, it was exceedingly rare for a legislative or congressional seat to change parties at all, let alone if held by an incumbent. That is now happening more and more. The three Assembly Democrats who got beaten last week  Steve Fox of Palmdale, Sharon Quirk-Silva of Fullerton and Al Muratsuchi of Torrance  all were initially elected during the 2012 presidential election when the voter turnout was significantly higher. Thats almost always a Democratic advantage. They lost during a ho-hum gubernatorial election when the turnout was abysmally low. The scant turnout helped the Republican winners: Tom Lackey, Young Kim and David Hadley. But they triumphed largely because of the honest redistricting that made the seats competitive. During the 2016 presidential election, its a good bet those three GOP incumbents will be vulnerable to Democratic challenges. \"If the Democratic Legislature had drawn the district lines,\" Hoffenblum says, \"it probably would have decimated the Republican Party.\", The top-two primary is having a moderating influence on politics. One good example is in the Napa-Sonoma wine country. There, Napa County Supervisor Bill Dodd, a Republican-turned-Democrat, was the business-backed moderate in the Assembly primary. He beat out two liberal Democrats to finish in the top two. Dodd easily beat his Republican opponent on Nov. 4 and will replace a more liberal, termed-out Democrat in Sacramento. In many races, \"liberal\" is a matter of degree. Example: In a Democrat versus Democrat race, the less liberal Tony Thurmond, a Richmond City councilman, got business backing to beat the far-left Elizabeth Echols for a traditionally leftist Assembly seat. \"Both labor and business had their wins and losses,\" Hoffenblum says. \"It was mixed. Thats the way it should be. But labor used to win 90% of the time.\", Democrats will continue to dominate the Legislature and be elected from safely Democratic seats, Hoffenblum says, but their ideologies are being diversified because of a need to attract Republican votes  both in the primaries and in same-party general election races. But why is California remaining deep blue while so much of America is turning Republican red?, Pollster Mark DiCamillo of the nonpartisan Field Poll tried to answer that Wednesday. Addressing the Sacramento Press Club, he noted that California had proportionately more minority voters than the rest of the country, and they voted 2-to-1 Democratic. \"But an even bigger factor,\" he added, is that white Californians  unlike white Americans generally  are evenly divided between Democrats and Republicans. Why? Its the coast, he told me. \"Seventy percent of the states population lives in a coastal county. The inland  the Central Valley  looks like much of the rest of the country. \"Whites who live on the coast are more tolerant, more open-minded.\", Again, why? DiCamillo wouldnt guess. My guess: The balmy breezes, soothing temperatures and gorgeous sunsets relax people. But why the low turnout? Pollster Mark Baldassare of the Public Policy Institute of California, speaking to the Press Club, blamed not only the virtually nonexistent gubernatorial race, but the boring ballot propositions. Its ironic that while the legislative races have become more interesting  at least for junkies  the voters have become less interested. george.skelton@latimes.com, Twitter: @LATimesSkelton]", "Date": "20141112", "Author": "NULL", "Link": "http://www.latimes.com/local/politics/la-me-cap-moderates-20141113-column.html", "Title": "[California Legislature is looking more moderate due to voting reforms]"}