{"Content": "[ Democratic Atty. Gen. Kamala Harris, the sole major candidate thus far in the 2016 U.S. Senate race to replace the retiring Barbara Boxer, made her first public remarks about her bid at a campaign-style event Tuesday night  2,300 miles away, in Washington, D.C. Speaking at fundraising gala marking the 30-year anniversary of Emilys List, Harris pledged to defend the voiceless and vulnerable. She noted that in the courts, when a defendant is charged with a crime, the plaintiff is the people rather than the victim. Our beautiful democracy and system of justice has said that when any one of us has been harmed, it is a harm against all of us. A crime against any one of us is a crime against all of us, said Harris, a former San Francisco district attorney. And so I think about that and bring that to bear in the work that I have done as district attorney of San Francisco, now as attorney general of California, and with my intention to become the next United States senator from the state of California. Harris said she would stand up for the poor, children, the environment, immigrants, veterans and women. Harris made her remarks in front of more than 1,600 people at a sold-out fundraiser for Emilys List that raised more than $2 million. The group, which is dedicated to electing Democratic women who support access to abortion, has not made an endorsement in the Senate race yet, though it did trumpet the news that Harris had entered the contest to its members. Harris has yet to do anything similar in California. Though she has been aggressively fundraising for her campaign and securing endorsements, she has not held any public political events in the state forher bid, which she announced days after Boxer said in January that she would not seek reelection in 2016. Tom Del Beccaro, a former state GOP chairman who is considering running against Harris, said her entire tenure as attorney general has been about her seeking higher office. \"California is No. 1 in the nation in child poverty and has among the worst employment rates in the country, he said. Despite being in office for years I dont recall Kamala Harris doing anything about it outside of campaigning.\", The race is the first open Senate contest in more than two decades. Harris recalled1992, when she stood in a hotel ballroom as Boxer and Sen. Dianne Feinstein celebrated their victories in an era that came to be known as the Year of the Woman because of the record number of women elected to the Senate. Harris said every campaign she has run has been fueled by women, and she looked forward to the likely 2016 presidential bid of Hillary Clinton, who was the keynote speaker at the event and is expected announce her White House run in April. Harris, who spoke from notes after her teleprompter malfunctioned, tied their candidacies together. I think about the real possibility that for the first time in our nation, we might have a woman as president of these United States , Harris said. And so I say, as we celebrate these past 30 years, lets rededicate ourselves to the next 30 years. And lets take heed of Coretta Scott King, who famously said:Freedom is never really won. You earn it and win it in each generation. And folks, we are that generation. Lets win in 2016. Follow@LATSeemafor political news. seema.mehta@latimes.com]", "Date": "20150303", "Author": "[Seema Mehta]", "Link": "http://www.latimes.com/local/political/la-me-pc-kamala-harris-speaks-about-us-senate-bid-in-washington-dc-20150303-story.html", "Title": "[Kamala Harris speaks about U.S. Senate bid -- in Washington, D.C.]"}