{"Content": "[ North Carolina can enforce new voting restrictions adopted by the states Republican leaders and opposed by civil rights advocates, the U.S. Supreme Court said Wednesday. The justices lifted a lower court order by a 7-2 vote. The state can end same-day registration for new voters and bar the counting of ballots cast in the wrong precinct, even if they involve statewide races. A third provision of the law, which was not under challenge this week, will reduce the days for early voting from 17 to 10. In dissent, Justices Ruth Bader Ginsburg and Sonia Sotomayor said these measures are likely to have a discriminatory effect on black voters. Ginsburg said the Voting Rights Act of 1965 had \"worked to safeguard long-obstructed access to the ballot by African Americans\" by blocking such election-law changes in the South. But the court voided that \"pre-clearance\" rule\" last year in a 5-4 decision. North Carolinas GOP-controlled Legislature had adopted a series of changes to the election rules, but until Wednesday it was unclear whether they would take effect this fall. On Oct. 1, a federal appeals court had objected to changes involving same-day registration and out-of-precinct voting. The two judges in the majority, both appointees of President Obama, said the new rules could not be enforced in this election because they were likely to have a harsher effect on black voters. North Carolinas attorneys filed an emergency appeal with the Supreme Court, saying the appellate ruling was \"deeply flawed\" and would cause \"even more confusion.\", In the conflicting appeals, both sides accused the other of trying to change the rules on the eve of an election. The high court set aside the appellate courts decision. The North Carolina law also will require voters to show a photo identification at the polls, but that provision will not take effect until 2016. Two weeks ago, the high court issued a similar order for Ohio, clearing the way for the state to reduce the time for early voting from 35 days to 28. North Carolina Gov. Pat McCrory, a Republican, hailed the ruling. In a statement, he said, \"I am pleased that the U.S. Supreme Court has ensured this popular and common-sense bill will apply to the upcoming election. We respect the legal process and thank the Supreme Court justices for protecting the integrity of our elections.\", The Rev. William J. Barber II, president of the North Carolina State Conference of the NAACP, disagreed. We are disappointed with the Supreme Courts ruling today. Tens of thousands of North Carolina voters, especially African American voters, have relied on same-day registration, as well as the counting of ballots that were cast out of precinct, for years.\", On Twitter: @DavidGSavage, 8:47 p.m.: This post has been updated with comments from the governor and the NAACP. This post was originally published at 4:39 p.m.]", "Date": "20141008", "Author": "[David G. Savage]", "Link": "http://www.latimes.com/nation/la-na-supreme-court-upholds-north-carolina-voting-20141008-story.html", "Title": "[Supreme Court upholds North Carolina's new limits on voting ]"}