{"Content": "[ For much of her 17 years as a financial planner, Molly Vogt never imagined shed become a political activist. But she was outraged by the financial crisis, launching an economy-focused womens group called \"My Purse Politics\" and ultimately taking a full-time job with Americans for Prosperity. She calls it a role she will fill \"until I can get government out of my way.\", As a field director in Colorado, Vogt is one of more than 500 paid foot soldiers across the country for the conservative nonprofit group, funded in part by the Koch brothers, that advocates for limited government. For much of this year, she and nearly three dozen other staffers in the state have helped build Americans for Prosperitys data-driven effort: amassing teams of volunteers who go door to door collecting information on voters and the national and local issues that matter to them  such as the presidents healthcare law and school choice. Now, Vogts days are centered on turning that data into votes for Republican Rep. Cory Gardner, who is trying to unseat Democratic Sen. Mark Udall in one of Novembers tightest and most important races. In a year when Democrats have focused on issues such as abortion and birth control, Vogt feels a personal responsibility to get women fired up about the governments role in healthcare, and the financial and housing markets. \"This year was the first time I knocked on a door, because I just got so fed up with what was going on,\" she said. The art of political persuasion can be complex. Television ads  whether uplifting or testily negative  have long been the key vehicle for defining candidates to voters. But the second necessity  getting them to cast their votes  has increasingly rested on meticulously organized, technologically powered, repetitive contact by people like Vogt who identify prospective voters and help close the deal. In Colorado and other states, the two national parties and their allies are sweeping through the suburbs with the dedication of advancing armies. Americans for Prosperity alone has knocked on 140,000 doors since June. Such conservative groups are both ascendant and playing catchup to Democratic field operations in key states. Their efforts this year are meant to deliver results in November and create the template for the presidential race in 2016. Americans for Prosperity President Tim Phillips says emphatically that the group is in the field to stay in competitive states including Colorado, Iowa, New Hampshire and Florida  the mightiest of swing states, where the group has 50 full- and part-time staffers. He notes that for years, the left had the advantage of \"a powerful force on the ground that was outside the Democratic Party\": government employee unions, environmental groups and community groups. \"They had an army,\" Phillips said. But on the right, \"there really was not a permanent infrastructure with professional staff, the ability to mobilize activists on a large scale, with a consistent stream of funding. So at Americans for Prosperity, weve spent a decade now working to build just that.\", But they are facing fierce competition, not only from outside Democratic groups. In Colorado, Democrats say their field team is about three times the size it was in 2010 when it helped notch a narrow victory for the states other Democratic senator, Michael Bennet, with an average margin of one vote per precinct. Bennets effort that election was so successful in boosting turnout among sporadic Democratic voters that the Democratic Senatorial Campaign Committee invested $60 million to replicate it across the country this year as the so-called Bannock Street Project, which takes its name from the Denver street where Bennets campaign office was located. With Republicans outmatched in 2012 by the Democrats wealth of data and precise turnout operation, the national GOP this cycle has invested $105 million in improving its ability to track voters interests and willingness to go to the polls  or in Colorados case, the mailbox, since this year every voter will be able to cast a ballot by mail for the first time. The GOP efforts in states such as Colorado are bolstered by outside groups like Americans for Prosperity. But the group operates independently and has built its own database of voters. \"You want to be able to hold the party that is your erstwhile ally accountable,\" Phillips said. Because it was set up as a \"social welfare\" nonprofit organization, Americans for Prosperity does not have to disclose its donors, and did not have to detail its spending to the Federal Election Commission until 60 days before the election. But the group financed by the Koch brothers, the billionaire backers of conservative political causes, demonstrated its deep pockets in 2012, when it spent $122 million attempting to defeat President Obama and other Democrats, according to an analysis by the Center for Public Integrity. In that race, Americans for Prosperity plowed most of its money into advertising. It is still one of the biggest spenders on advertising this year  approaching more than $50 million. But it has made a far greater investment this year in canvassing and related endeavors than in 2012. Its most recent mailing in Colorado was a report card detailing how often each recipient had voted compared with four neighbors with a perfect voting history  a gentle, data-driven nudge to return their ballots. Follow-up comes in the form of people like Vogt. IPad in hand, her red curly hair tucked in a ponytail, Vogt and three of her part-time \"field associates\"  in the groups corporate lingo  made quick work of the dozens of houses that appeared in that days \"walk-books,\" which are assigned by operatives at the field office and transmitted to the associates iPads in real time. Carefully trained on technology and door etiquette during a several-day seminar in Wisconsin this year, Vogt  in jeans, sneakers, and a blue T-shirt bearing the image of Ronald Reagan and the Americans for Prosperity logo  stands back at a respectful distance from the door. At one point this year, Vogt was asking voters questions about their beliefs on taxes, healthcare and education  voter identification scripts that Americans for Prosperity often tried to keep under a minute to maximize the willingness of people to respond. Now, Vogt cheerfully thanks them for voting in 2012 and asks whether they plan to return their ballot. She enters the data on her iPad  lighting up houses where she has gotten a \"commitment\" in green, and houses where no one was home in red. She will return a few days later with a different script to gauge candidate preference. Once she has determined that a vote has been cast  based on data from the secretary of state  those voters will be cleared from the organizations list so Vogt and her colleagues can move on to other targets. She can see which homes her team has hit along the block in real time. There is a brief stop late in the day for chocolate milkshakes  \"We get a little punch drunk,\" Vogt says with a laugh  but they keep up a brisk pace before heading to the office. Every canvasser gets a progress report at the end of each day, creating friendly competition among the teams across the state. Less than six miles from where Vogts team was canvassing, the Democratic competition  staff and volunteers from Udalls team and the Democratic Senatorial Campaign Committee  were massing at their campaign headquarters in Aurora. Launching their own intensive ground effort as ballots began arriving at voters homes, as many as 100 Democratic volunteers and staffers packed into the field office, decorated with red, white and blue streamers and colorful hand-painted signs with slogans including \"Keep Colorado Blue.\", Bennet served as the warmup act for Udall as the two senators rallied volunteers before an evening of canvassing. He notes that Udalls team has recruited four times as many active volunteers  those who have completed a shift in the last three weeks  as his team did in 2010 and that the field staff is nearly three times as large. (A Republican National Committee spokeswoman said it had tripled its field team in Colorado since 2012, but she would not offer details.), After a cheer, volunteers disperse to the neighborhoods, much as their Republican counterparts had. In near darkness, Dave Lightowler and Michael Briefs work off their illuminated iPads  stopping to review the voter data that they have for each house before approaching the door. At one, they catch a Democrat who registered recently  but admits hes had little time to figure out who is running. They leave a packet of information and mark the house as one to which they will return. Half a block down, an independent voter is less receptive. As soon as the volunteers mention the names of Democratic candidates, he slams the door with a curt \"forget it.\", Lightowler enters him as a \"refusal,\" but notes that they still dont know his wifes voting plans. He vows to return. \"We dont skip anyone,\" he said. \"As a canvasser, I want to be sure. This is the playoffs.\", That Democratic relentlessness helped Obama win in Colorado and other swing states. The question is whether Republicans and allied groups like Americans for Prosperity now have the muscle to catch up. maeve.reston@latimes.com, Twitter: @maevereston]", "Date": "20141025", "Author": "[Maeve Reston]", "Link": "http://www.latimes.com/nation/politics/la-na-afp-data-wars-20141026-story.html", "Title": "[In key election states, conservative groups build a ground game]"}