{"Content": "[A split federal appeals court on Tuesday let stand a lower courts ruling that has stymied Obama administration plans to shield up to 5 million people - including young immigrants known as \"Dreamers\"  from deportation. At issue was President Obamas proposed extension of the Deferred Action for Childhood Arrivals program, or DACA, created in 2012, and the Deferred Action for Parents of Americans and Legal Permanent Residents, or DAPA, which was scheduled to start in May. Although the programs do not create a path to citizenship, critics have labeled them amnesty, and on Tuesday they praised the 2-1 ruling from the New Orleans-based appellate court. Texas just won the executive amnesty case at the 5th Circuit Court of Appeals. The Constitution wins, Texas Gov. Greg Abbott, a vocal critic of Obamas immigration policies, wrote in a tweet. Twenty-six states, led by Texas, had sued to stop the programs, arguing that the president had overstepped his constitutional authority. Judges Jerry E. Smith and Jennifer Walker Elrod agreed. They also found that Texas officials could suffer a cognizable injury from the cost of having to issue drivers licenses to at least 500,000 people that might be covered under the executive action. Smith was appointed by President Reagan and Elrod by President George W. Bush. Judge Stephen A. Higginson, who dissented, was appointed by Obama. The White House noted his dissent Tuesday. Today, two judges of the 5th Circuit chose to misinterpret the facts and the law in denying the governments request for a stay, said Brandi Hoffine, a White House spokeswoman. As the powerful dissent from Judge Higginson recognizes, President Obamas immigration executive actions are fully consistent with the law. She insisted that Obamas actions were within his authority and cited the 15 states, the District of Columbia and other constituencies that have joined the administration in asking the courts that Obamas immigration programs be allowed to move ahead. The Justice Department is evaluating the ruling and will consider its next steps while its appeal of the preliminary injunction proceeds on an expedited basis in the 5th Circuit, administration officials said. Obama announced last fall that he was using his executive power to grant three-year work permits and temporary protection from deportation to about 4 million adults who are parents of U.S. citizens and have lived in the country for at least five years. He said the DAPA program was an extension of his authority to prioritize immigration enforcement. DACA allows young people brought into the United States illegally as children to apply for deportation deferrals and work permits. The case will probably end up before the U.S. Supreme Court, immigrant rights advocates told the media during a news conference Tuesday. The legal wrangling means that immigration officials would probably have just a few months to launch and implement the programs before the 2016 elections if the courts approve it. Presidential candidates may be placed in the dicey position of having to answer whether they would keep and extend the programs if elected, said Marielena Hincapie, executive director of the Los Angeles-based National Immigration Law Center. We know that U.S. citizen family members, neighbors and friends will vote with that in mind, she said. Will [the candidate] be supportive of extending this executive action?\", If the programs survive the courts and are implemented, a question still looms: Will immigrants who qualify be willing to apply and identify themselves to federal officials if there is the potential that the next person in the White House might scrap Obamas efforts and take an enforcement-only approach to illegal immigration?, In February, U.S. District Judge Andrew S. Hanen, sitting in Brownsville, Texas, issued an injunction putting the programs on hold. His action came in response to the suit filed by the 26 states. Tuesdays ruling comes after the appeals court panel held an unusual 2-hour hearing April 17 on the administrations request to stay the injunction. The panels action drew praise and scorn. \"U.S. immigration laws should be respected and enforced,\" Robin Hvidston, executive director of We The People Rising, said in a statement. President Obama should focus his energy upon the needs of U.S. citizens, and assist Americans who are unemployed, homeless, families in poverty, veterans and the disabled, not individuals in the USA illegally.\", Lee Gelernt, an ACLU attorney, said in an interview that the ruling would \"cause needless hardship to thousands of law-abiding families. The federal program is consistent with congressional intent and the Constitution and the states have no business trying to enjoin this program. Fifteen states, including California, had filed briefs arguing on behalf of Obamas executive actions. Appearing on behalf of the federal government before the panel in New Orleans, Benjamin C. Mizer, acting assistant U.S. attorney general and a former Ohio solicitor general, failed to persuade the justices that states lacked standing to challenge the federal programs. The panel appeared to have been swayed by Scott Keller, Texas solicitor general, who argued that Obama bypassed Congress to create a policy of deferred action that the states were forced to follow without proper administrative notice. Nora Preciado, staff attorney with the National Immigration Law Center in Los Angeles, which filed a brief in support of the federal governments case, had hoped the panel would rule in their favor. Were disappointed, but we will continue to make sure this matter moves forward, she said. We are calling for the administration to continue to fight for the implementation of the initiatives. We look forward to the full hearing by the 5th Circuit on the preliminary injunction, she said. That hearing is scheduled for the week of July 6. Times staff writers James Queally in Los Angeles, Christi Parsons in Washington and Nigel Duara in Tucson contributed to this report.  Hennessy-Fiske reported from Houston and Carcamo from Los Angeles. 4:29 p.m.: The story was updated to include reaction from the White House and Marielena Hincapie. 12:58 p.m.: The story was updated to include additional background and comments from Robin Hvidston, Lee Gelernt and Nora Preciado. The story was originally published at 11:50 a.m.]", "Date": "20150526", "Title": "[Obama immigration overhaul and 'Dreamers' handed another legal setback]", "Link": "http://www.latimes.com/nation/la-na-obama-immigration-executive-action-20150526-story.html\n", "Author": "[Molly Hennessy-Fiske, Cindy Carcamo]"}
