{"Content": "[He hasnt used it much. But President Obama says he suspects his veto pen will get far more use in the next two years with Republicans in control of Congress. Still, the president said in an interview released Monday, he remains hopeful that the goodwill shown by Republican leaders in the recent lame-duck session will carry over into the new year  optimism that doubles as a challenge. Youve got Republicans in a position where its not enough for them simply to grind the wheels of Congress to a halt and then blame me, Obama told National Public Radio in the interview, conducted before he left for Christmas vacation in Hawaii. They are going to be in a position in which they have to show that they can responsibly govern, given that they have significant majorities in both chambers. Incoming Senate Majority Leader Mitch McConnell (R-Ky.) and House Speaker John A. Boehner (R-Ohio) have been plotting the course for a GOP-led Congress since before Novembers sweeping election wins for the party. Top Senate Republicans, in particular, have said how important it is for the partys eventual presidential nominee that Congress avoid self-inflicted wounds in 2015 as the primary process begins to unfold. But both Republicans and the president know that any serious work to find compromise will invite criticism from their respective bases that they have given in to the other side. So in the weeks since the midterm election, both sides have played a delicate game by promising to do business with the opposite party while also vowing to hold firm when necessary. Since the election, McConnell has vowed to show that the Senate can function and has ruled out new government shutdowns. But he also has promised a new effort to undercut the presidents healthcare law and to set a vote on the Keystone XL pipeline as the Senates first order of business in January. In the NPR interview, Obama said there were areas of agreement that would be priorities come January, particularly finding ways to further the economic recovery. But he acknowledged that the Democrats midterm losses would put him in more direct confrontation with congressional Republicans. I havent used the veto pen very often since Ive been in office, partly because legislation that I objected to was typically blocked in the Senate, which was in Democrats hands. Now I suspect there are going to be some times where Ive got to pull that pen out. And Im going to defend gains that weve made in healthcare; Im going to defend gains that weve made on environment and clean air and clean water. Michael Steel, a spokesman for Boehner, said the interview indicated that Obama was doubling down on his go-it-alone strategy, rather than listening to the American people, who want us to work together to get things done for the country. The president said immigration was an area in which Republicans might change their approach as they face a new political reality heading into 2016  even though many in the GOP want to roll back recent executive actions he took to defer deportation for as many as 5 million more immigrants in the U.S. illegally. Some Republicans voted for a comprehensive bill in the Senate that in many ways was more generous than I was able to offer through executive action, he said. So, the question then becomes, by me having taken these actions, does that spur those voices in the Republican Party who I think genuinely believe immigration is good for our country? Does it spur them to work once again with Democrats and my administration to get a reasonable piece of legislation done? Or does it simply solidify what I do think is ... a nativist trend in parts of the Republican Party?, Obama addressed a range of other topics in the interview, including Cuba, Iran and the renewed debate over race relations following the deaths of black men  Michael Brown in Ferguson, Mo. and Eric Garner in New York  in confrontations with white police officers. Grand juries have declined to indict either officer, triggering protests and unrest. The president said he did not believe that the nation was more racially divided now than before he took office, but that the recent discussions about the relationship of minority communities and law enforcement is healthy. When its in the news and you see something like Ferguson or the Garner case in New York, then it attracts attention, he said. But I assure you, from the perspective of African Americans or Latinos in poor communities who have been dealing with this all their lives, they wouldnt suggest somehow that its worse now than it was 10, 15 or 20 years ago. The president said he was confident that his recently created task force on police practices would lead to tangible progress on the issue, as opposed to simply stewing in the hopelessness of race relations in this country. michael.memoli@latimes.com, Twitter: @mikememoli, , , 5:59 p.m.: The story was updated throughout with new information. The story was originally published at 2 a.m.]", "Date": "20141229", "Title": "[Obama hopes to work with Republicans, but he has his veto pen ready]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-obama-npr-interview-20141229-story.html\n", "Author": "[Michael A. Memoli]"}
