{"Content": "[As the luster has faded from New Jersey Gov. Chris Christies potential White House bid, he told California Republicans on Saturday to ignore those who want to anoint the partys 2016 presidential nominee. I can promise you that over the next few months, there will be article after article arguing that our party cant afford a long nomination battle. That we need to pick a nominee as soon as possible, that we have to unite around whichever candidate appears to have the most money or the most endorsements or the best press coverage, Christie told a sold-out luncheon crowd at the state GOPs biannual convention here. Take a deep breath, everybody, Christie said. We are 21 months away from electing our next president. So dont be afraid! The nomination will be decided by you and people like you all over this country. Not by the pollsters and the pundits. Not by the talking heads on the TV or the focus groups in some shopping mall  by you!, \"Not by some donors or, God forbid, the media in New York and Washington D.C. he added to loud applause. Christie strode on stage accompanied by Bon Jovis Living on a Prayer, and delivered a 25-minute speech to 500 delegates that was heavily laced with the words of President Reagan and interspersed with stories about Christies parents and upbringing. Christie teed off on President Obama, saying he has failed to deliver the economic recovery he promised and his foreign policy has weakened American influence around the world. Our adversaries dont fear our resolve; our allies are no longer confident in us, Christie said, pointing to the recent flap over a speech by Israeli Prime Minister Benjamin Netanyahu to a joint session of Congress next week. The White House was displeased that House Speaker John Boehner invited Netanyahu without consulting the administration, and some Democrats plan to boycott the speech -- a response that Christie called a national disgrace. Christies appearance comes at a critical time for his potential presidential run. Initially considered a top-tier candidate, he has seen GOP rivals scoop up major donors and exhibit popularity in opinion polls, and he has been buffeted by a series of controversies. Overhauling New Jerseys public pension system had been one of Christies signature acts, but earlier this week, a judge found that Christie had violated the law and ordered him to reverse a $1.57-billion cut in the pension program. Federal authorities are investigating Bridgegate  the closure of traffic lanes on the George Washington Bridge as political payback by a Christie aide against a mayor who didnt endorse Christies reelection. Christie has come under scrutiny for lavish travel and the amount of time he spends outside of his state, and his approval ratings have sunk to historic lows among New Jersey voters. He did not mention these matters, instead touting his election -- twice -- in a blue state, five balanced budgets and tax cuts for businesses. He highlighted a healthcare and pension agreement with teachers unions last week as a way opposing forces can work together, an area where he said President Obama has failed. We announced in New Jersey that we have signed a road map of reform with the teachers union to try to fundamentally change the way our pension and health systems work, Christie said, to gasps of incredulity from the audience. \"If you can believe it, Ive been negotiating with the teachers union, Ive been negotiating with the teachers union for five months -- quietly, quietly  to solve our pension and health benefit problems for once and for all. Now I ask you, if we can work with the teachers union, an organization that has been one of our biggest political adversaries, dont you think that President Obama can do a little bit more than ask the Republican leaders out to a round of golf?\", The New Jersey Education Assn. earlier this week disputed Christies characterization of the agreement. Follow@LATSeemafor political news. seema.mehta@latimes.com]", "Date": "20150228", "Title": "[Christie tells California GOP to let presidential race   play out]", "Link": "http://www.latimes.com/local/political/la-me-pc-christie-california-republicans-20150228-story.html\n", "Author": "[Seema Mehta, Melanie Mason]"}
