{"Content": "[Wisconsin Gov. Scott Walkers emergence as a top presidential contender may provide the most serious challenge to the Republican Partys post-2012 self-admonition that it change its focus to bring in more women, minorities and young people. Walker, 47, became on Monday the 15th Republican to enter the 2016 presidential race, defining himself as the one candidate who is both a warrior for conservative causes and a winner who can turn them into policy. If our reforms can work in a blue state like Wisconsin, they can work anywhere in America, Walker said, sleeves rolled up, to a crowd of flag-waving supporters. My record shows that I know how to fight and win. Now, more than ever, we need a president who will fight and win for America. He pitched himself as new fresh leadership, but he has depended on an old-school coalition in his rise to the top. Walker, who used the word fight 13 times during Mondays 37-minute speech, has built his career galvanizing core conservative voters in a relatively homogeneous state, losing by huge margins among Democrats and Wisconsins small minority population, and tipping the scales with a modest majority of independent voters. Walker made his name nationally by stripping power from public employee unions, and emerging triumphantly from an attempt by unions and Democrats to recall him from office. Mondays announcement event included several reminders of the brutal battle, including a few shouting matches between sign-waving protesters andsome of Walkers supporters as they entered the Waukesha County Exposition Center outside Milwaukee. Speakers introducing Walker all invoked his resolve in the face of national protests, or what Lt. Gov. Rebecca Kleefisch characterized as a movement out of control on the left. Another speaker, Rachel Campos-Duffy, made a particularly visceral appeal to the Republican base, joking that 24 was not only the number of years Walker has been married to his wife, Tonette, but also Bill Clintons favorite age. As Walker prepared to launch his presidential campaign, he has shifted his positions and rhetoric further to the right in order to court cultural conservatives and immigration hard-liners. His speech Monday included several nods to cultural conservatives, including a promise to stand up for the right to life, liberty and the pursuit of happiness and to stand up for our religious rights and all of our other constitutional rights. He also pledged a more assertive foreign policy that would terminate the bad deal with Iran on day one, a reference to the looming agreement between world powers and Iran over its nuclear program, and stop the aggression of Russia into sovereign nations. Our goal is peace, but there will be times when America must fight, he said, invoking his domestic policy theme as a foreign policy principle. If Walker continues to be viewed as a top contender for the nomination, the question of whether his Wisconsin electoral blueprint will work at the national level -- among a far more diverse electorate during a higher-turnout election -- will loom larger. You have to take him seriously because hes succeeded in a Democratic state, said Paul Maslin, a political consultant based in Madison, Wis. who worked with Democrats on the unsuccessful attempt to recall Walker in 2012. Ive given up underestimating him. To win the nomination, Walker is banking on defeating a crowded GOP field as the only candidate who can appeal to the partys business establishment, its religious conservative faction and its tea party voters. The son of a minister who took on labor unions, he has had a lock on all three of those groups in Wisconsin. Iowa, the first caucus state with a powerful bloc of social conservatives, is crucial to Walkers primary strategy. His prime competition there includes some of the most conservative candidates in the field, including Texas Sen. Ted Cruz and former Arkansas Gov. Mike Huckabee. Walker can be seen as completely acceptable to the right within the party and yet still not threatening to business interests, said Charles Franklin, director of the Marquette Law School Poll. Franklins polling shows Walker has been successful in that strategy at home, gaining favorable impressions from 78% of self-described moderate voters, 91% of conservatives, 95% of very conservative voters and 96% of tea party voters, who overlap with some of the other groups. Though all of the top Republican presidential aspirants are conservative, there are differences in their tones. Former Gov. Jeb Bush and Sen. Marco Rubio of Florida as well as Sen. Rand Paul of Kentucky have made overt attempts through personal stories, campaign events and policy positions to court African American, Latino or younger voters. Bush, for example, recently went beyond other candidates in condemning the Confederate flag, highlighting his effort to remove it in Florida and labeling it a racist symbol. He dropped his previous support for a constitutional amendment to outlaw same-sex marriage, despite frustration among conservatives with last months Supreme Court ruling that gave gays the right to wed. Walker, on the other hand, called for a constitutional amendment to overturn the gay-marriage decision immediately. He has also sharpened his rhetoric on changing immigration laws in recent months, saying hes against amnesty, a reversal from his earlier support for granting citizenship to some people in the U.S. illegally. Waukesha County, where he held his announcement Monday, mirrors his homogenous appeal. Unlike Milwaukee, the relatively diverse county that Walker led before he became governor, neighboring Waukesha is overwhelmingly Republican and 94% white. He has highlighted his strong anti-abortion record and beliefs, even though he claimed in a 2014 ad that one such measure intended to curb abortions leaves the final decision to a woman and her doctor. Abortion-rights groups said the ad was misleading. Walker has promised to sign a measure approved by the Wisconsin Assembly last week that would ban abortions after 20 weeks. In the Republican primaries, Bushs challenge is: Will he be seen as conservative enough? He certainly has moderate temperament, said Ari Fleischer, the former spokesman to President George W. Bush who is not supporting a candidate in the GOP primary. Walkers challenge is, will he go too far in ideological conservatism? But he also has the right temperament. Walker has argued that if he wins the nomination, he can help Republicans win in other Midwestern swing states that often vote Democratic in presidential elections. But the challenge elsewhere will be far different. Nationally, minorities make up nearly 40% of the population, more than double the proportion in Wisconsin. These voters, as well as younger voters of all ethnicities who tend to be more liberal on social issues, show up in much greater numbers in general elections. The party argued in a detailed and blunt postmortem, issued four months after Mitt Romneys stinging defeat in the last presidential election, that it must move beyond its base of older conservative white men by presenting a more tolerant face and passing an immigration overhaul that would position the party to compete for Latinos, the fastest-growing segment of the electorate. Walker enters the race amid feverish positioning on immigration forced by sharp rhetoric from Donald Trump, the real-estate magnate and reality television star who has done well in some primary polls. Henry Barbour, an Republican National Committee member from Mississippi who helped write the partys 2012 postmortem, said not every candidate will have the same connections to minority communities that the party is trying to attract. He cited Bush, a longtime Miami-area resident with a Mexican-born wife, as an example of someone who has a history that other candidates lack. ------------, For the record:, 2:15 p.m. July 13:An earlier version of this story incorrectly referred to former Florida Gov. Jeb Bush as a Miami native. He is a longtime resident of the Miami area. ------------, Everybodys going to run a little different campaign, said Barbour, who is supporting former Texas Gov. Rick Perry. Hes not Jeb. Hes Scott Walker. Maslin said he believes Walker that will come flying back to the middle in a heartbeat if thats what it takes to win. Barbour said most candidates are now focusing on the voters they need to win: primary voters in early states. But he said he believes that whoever the party nominates will need to find a way to reach minority communities -- not by changing their principles but by engaging with voters on conservative issues that will resonate with them. We dont have to solve everything in a day, he said. We dont have to solve it all in 2016. We just have to make significant progress since 2012. Secter reported from Waukesha and Bierman from Washington. Twitter:@noahbierman, 4:29 p.m.: This story was updated with Walkers remarks from his announcement. 4:23 a.m.: This article has been updated with Walkers announcement that he is running for president. This article was originally published at 3 a.m.]", "Date": "20150713", "Title": "[Entering presidential race, Scott Walker challenges GOP's desire to diversify]", "Link": "http://www.latimes.com/nation/la-na-scott-walker-announce-20150713-story.html\n", "Author": "[Bob Secter, Noah Bierman ]"}
