{"Content": "[Hundreds of people gathered in West Hollywood Park on Friday night to celebrate the Supreme Courts ruling on gay marriage. The crowd held up rainbow flags and American flags. One couple clutched a sign that said, \"A supreme day to be gay in the USA\" with a picture of wedding rings and a rainbow. As Lady Gagas \"Born This Way\" blared over a loudspeaker, a woman screamed, \"Were making history!\", The crowd at one point chanted, \"Love rules! Love rules!\", Employees of Facebook march down Market Street for the 45th Annual San Francisco Pride Parade on Sunday, two days after the Supreme Court ruled that same-sex couples have a constitutional right to marriage that cant be denied by state law. Employees of Facebook march down Market Street for the 45th Annual San Francisco Pride Parade on Sunday, two days after the Supreme Court ruled that same-sex couples have a constitutional right to marriage that cant be denied by state law. A flag bearer marchesin the San Francisco Pride Celebration and Parade. A flag bearer marchesin the San Francisco Pride Celebration and Parade. View photos of peopleacross California expressing joy over the U.S. Supreme Courts same-sex marriage ruling. View photos of peopleacross California expressing joy over the U.S. Supreme Courts same-sex marriage ruling. Everlyn Hunter of Los Angeles wore a rainbow flag with a Star of David on it like a cape, tied around her neck with rainbow-colored ribbon. Hunter said she was in West Hollywood the night of both President Obamas election and the passage of Prop. 8. She reflected on the wild up-and-down emotion of that night -- she is an African American lesbian who cheered Obama and mourned Prop. 8 -- and compared it with the happiness of Friday night. \"That night they announced Obama first, and it was an intense joy, a high. Not an hour later they announced Prop. 8. I was already crying when they announced Obama, but the tears changed.\", There was a high and that epic low, she said. \"Tonight, that low isnt coming.\", \"When I came out (nearly 30 years ago), I didnt even think of marriage,\" she said. \"It just wasnt even in my radar.\" She smiled. North Hollywood residents Edward Danfifer, 51, and Stacy Johnson, 46, wore T-shirts that said, \"Mr. & Mr. - April 9, 2016\"  the date of the mens upcoming wedding in Topanga. Danfifer came out in 1981, amid the devastation of AIDS. He had tears in his eyes as he talked, looking around at the rainbow flag-toting crowd around him. When he came out, \"we were concerned with living. Everyone was dying. We were fighting for the right to live, fighting for medication. I didnt think Id live to be 25, let alone 50. Today is just  its an amazing day.\", Johnson came out in 1992 when he was in the Navy in spite of policies against gays serving in the military. He saw the news of the Supreme Court decision Friday morning on Facebook. Then his phone died because so many congratulatory texts came in, the most touching of which came from straight friends in his small, conservative hometown in West Virginia. \"Oh my God, I cried,\" Johnson said as \"Thats the Power of Love\" blared over the loudspeakers. Attendees commented on the contrast between the joy of Fridays news and the sadness of the news in Charleston. Rally-goers observed a moment of silence for the nine people killed in Charleston last week in a historically black church. People in the crowd held up peace signs with their fingers and raised small rainbow flags. Los Angeles LGBT Center CEO Lorri L. Jean, in a speech, said that since she was a young attorney, she has carried a copy of the U.S. Constitution in her briefcase. \"Today, it finally includes us.\", \"As the confederate flag is falling, the rainbow flag is raising,\" she said. \"If God is with someone, she is with us.\", Tamika Butler, spokeswoman for National Center for Lesbian Rights, said in a speech that there is still more work to be done for civil rights. \"Lets keep fighting,\" she said. West Hollywood politicians also spoke at the rally, including West Hollywood councilman John DAmico, who came with his husband Keith Rand. DAmico said they had been together 23 years, got a domestic partnership in West Hollywood in 1992 and got married in 2008 when marriage was legal before Prop 8. \"Today, we celebrate,\" DAmico said. \"Today, we wanted to come up here and show you what our gay marriage looks like.\", He put his arms around his husband and they shared a long kiss as the crowd cheered. An emotional West Hollywood councilman John Duran said \"Tonight, in West Hollywood, we celebrate with open hearts and a broad vision of love.\", He, too, brought up the struggles of the AIDS crisis and said this night was for those who fought and died in this same location, West Hollywood. Duran is HIV-positive and openly gay and lost numerous friends to the disease. \"And now here we are. The price we have paid is high, but the victory is so sweet.\"]", "Date": "20150626", "Title": "[West Hollywood Decision Day celebration is emotion-filled]", "Link": "http://www.latimes.com/local/lanow/la-west-hollywood-decision-day-celebration-20150626-story.html", "Author": "[Hailey Branson-Potts]"}