{"Content": "[The national Republican Party has awarded one of its sanctioned presidential primary debates to California. Well, hot Huckabee! Better enjoy. Its likely to be the closest this state gets to the 2016 presidential race. In presidential politics, were a spectator state in the nosebleed seats. Even if California does offer up more voters than any other state, were mired in the backwater, far off the main ship channel to the White House. Theres an exception, of course, for the relatively wealthy few capable of donating generously to a candidate. These bankrollers are coddled and charmed. But the millions of ordinary folks are snubbed and taken for granted. Im not even talking here about California being shut out of the nominating process because the national parties allow spoiled and pipsqueak states  Iowa, New Hampshire and other brats  to begin voting ridiculously early. The nominees are decided long before Californians are permitted to choose sides in June. But so be it. Were hopelessly stuck at the back of the primary line. What Im griping about is the undemocratic general election winner-take-all system used by all but two states  Nebraska and Maine  of awarding electoral votes. The Founding Fathers never set it up this way. The Constitution doesnt even mention the words Electoral College. The Founders, in fact, were skittish about direct democracy. They didnt trust all the people. Women and slaves werent allowed to vote. Senators originally were chosen by state legislatures. The constitutional framers merely decreed that the president be chosen by state \"electors.\" Legislatures could appoint electors by any method they chose. What we have today evolved sordidly from states  especially slave states  jockeying for power leading up to the Civil War. Theres nothing at all holy about it. The winner-take-all system is bad for two reasons. First, as weve seen, a candidate can receive the most votes nationally and still lose in the Electoral College. Democrat Al Gore was supported by 544,000 more voters than Republican George W. Bush in 2000. And if there was ever proof that whoever wins the most votes should become president, the Bush administration provided it. But lets not get into that here. In all, four presidential candidates have won the most votes but lost the presidency. Second, under a winner-take-all system, the vast majority of states are shunted to the sidelines, forced to watch from afar as the candidates fight it out in a few battleground states. Thats because candidates wont waste their time or money campaigning in states where theyre a cinch to win everything anyway or are sure to be shut out. In California, since 1992, no Democrat can lose, and no Republican has a prayer. So you can already add Californias 55 electoral votes  20% of the number needed to win the presidency  to the Democratic column in November 2016. The GOP, however, is throwing us a bone. The party has sanctioned nine primary debates, and the second will be held at the Reagan Library in Simi Valley next Sept. 16. You can watch it on CNN. State Republican Chairman Jim Brulte, in a prepared statement, called it \"a testament to the role California will play in the upcoming 2016 election.\", Nice try, Jim. Brulte knows better than most that the only real role California will be playing is as a money exporter. In 2012, President Obama and Republican Mitt Romney bagged $137.8 million in California. And the grand total they spent on advertising here: $320. Thats no typo. Neither candidate held one general election campaign event in California  or in 37 other states. Only 12 states saw any events. And 96% of the 253 events were held in eight battleground states. Nevada, with only six electoral votes, had 13 campaign stops and $55 million spent on it for ads. For three-fourths of the states, it was a total snub. These figures come from Fair Vote, a nonpartisan group trying to reform the system so that every vote counts. Its a simple idea that doesnt require a constitutional amendment. States form a compact that obligates each to cast all its electoral votes for the candidate who wins the national popular vote. The compact wouldnt go into effect until signed by enough states to make up a majority of the Electoral College votes. People must get over the notion that states should elect a president. Citizens should elect their national leader, as they do governors and members of Congress. So far, 11 states have inked the compact. They possess 165  or 61%  of the necessary 270 electoral votes. These states come in all sizes  small, medium and large. California signed up in 2011. New York was the latest last April. The focus now is on Oregon, Connecticut and Delaware. Theres hope of electing by popular vote in 2020. \"Early on, legislatures didnt want to spend time on something that seemed pie in the sky,\" says John Koza, a Silicon Valley computer wizard who came up with the idea. \"Now were getting closer and approaching another presidential election, and thats generating interest.\", When Gov. Jerry Brown signed the compact bill, he commented: \"It seems logical that the occupant of the White House should be the candidate who wins the most votes. That is basic, fair democracy.\", Yes, and none of us should be kissed off by the candidates. One debate hardly suffices. george.skelton@latimes.comTwitter: @LATimesSkelton]", "Date": "20150121", "Title": "[Winner-take-all electoral system is a loser for democracy]", "Link": "http://www.latimes.com/local/politics/la-me-cap-elections-20150122-column.html\n", "Author": "NULL"}
