{"Content": "[Lawmakers on Wednesday approved new campaign rules in response to a controversy involving the political activities of suspended Sen. Ronald S. Calderon and his brother, former Assemblyman Tom Calderon, both Democrats from Montebello. The legislation, which now goes to the governor, would bar elected water board members throughout California from accepting campaign contributions of more than $250 from donors with business pending before their boards. The bill also would require board members to abstain from voting if they have accepted such a donation in the previous year. Assemblywoman Cristina Garcia (D-Bell Gardens) proposed the rules in response to reports by The Times that the Calderons had made large campaign donations to most members of the Central Basin Municipal Water District board before it approved a consulting contract for Tom Calderon. \"Given the scandals in my backyard with the Central Basin, this was important to me,\" Garcia said. Her bill is AB 1728. The U.S. attorneys office has subpoenaed records from the Central Basin district involving a contract with Tom Calderon. The Times reported last year that the district had paid Calderon more than $750,000 in consulting fees since 2004 for political and legislative advice. Less than three months before an August 2012 vote to extend his last contract, a Tom Calderon campaign group gave $10,000 to the reelection committee of water board member Phil Hawkins. Ed Vasquez, Rudy Montalvo and Art Chacon, who were then on the board, also voted for the extension. Vasquezs reelection committee received $6,433 in three contributions from Tom Calderon from February through May 2012. He also took in $4,400 from Sen. Ron Calderon that year. Montalvos reelection campaign received $6,262 from Tom Calderon in early 2012. Chacons campaign for the water board had a $3,000 contribution from Sen. Calderon in 2010. The state Senate suspended Sen. Calderon in March, after he was indicted on federal charges including bribery. Democratic Sens. Leland Yee of San Francisco and Roderick Wright of Los Angeles County were also suspended; Yee was indicted on public corruption charges and Wright was found guilty of perjury and voter fraud for lying about living in his district. All three have pleaded not guilty and are being paid because Senate President Pro Tem Darrell Steinberg (D-Sacramento) said the state Constitution does not allow salaries to be withheld from suspended lawmakers. On Wednesday, the Assembly approved a proposal (SCA 17 by Steinberg) for voters to consider in 2016 that would allow pay and benefits to be stripped from suspended legislators. The deadline for placing proposals on this years state ballot has passed. Lawmakers on Wednesday also gave final legislative approval to a measure that would prohibit elected officials and candidates from using their campaign funds to pay a spouse to work on the campaign. The bill is AB 2320 by Assemblyman Paul Fong (D-Cupertino). Other measures sent to the governor would:, Require that, beginning with the 2016 school year, all students complete one year of kindergarten  now optional  before being admitted to first grade. Assemblywoman Joan Buchanan (D-Alamo) created the bill, AB 1444. Create a one-year \"innovation awards\" contest in which three state departments would each provide prizes of $25,000 to Californians who have ideas for cutting the cost of state government and making it more effective. The measure is AB 2138 by Assemblyman Mike Gatto (D-Los Angeles). Require the California State University system to develop guidelines to allow high school computer science classes to be counted toward math credits required for admission to the universities. Sen. Alex Padilla (D-Pacoima) introduced SB 1200. patrick.mcgreevy@latimes.comTwitter: @mcgreevy99, melanie.mason@latimes.comTwitter: @melmason]", "Date": "20140820", "Title": "[California lawmakers OK new campaign rules for water board members ]", "Link": "http://www.latimes.com/local/politics/la-me-pol-calderon-ethics-20140821-story.html\n", "Author": "[Patrick McGreevy, Melanie Mason]"}
