{"Content": "[Oregon Gov. Kate Brown has declared drought emergencies in 23 of the states 36 counties and ordered state agencies to conserve water as another parched year threatens fish and forests, limits agriculture and recreation, and worsens the risk of wildfire. By California terms, however, Oregons goal appears modest: to reduce nonessential water use by an average of 15% across all state-owned facilities by the end of 2020. (Californias governor has ordered a 25% reduction in urban water use from 2013 levels through February 2016.), In an executive order issued Monday, the Oregon governor directed state agencies to curtail or end the nonessential use of water for landscaping  including but not limited to lawn watering, fountains that do not recirculate water and window washing. She ordered a moratorium (where allowed) on the installation of new nonessential landscaping projects that require irrigation at state-owned buildings. State agencies must report on their progress by Nov. 1 and each year thereafter. Drought conditions may persist or grow worse in future years, Browns executive order says. Now is the time to get ahead of our water resource challenges and improve our resiliency to drought to prevent much more serous problems. In 2014, just 10 of Oregons counties were under drought declarations. Brown warned that parched conditions could persist for theforeseeable future, threatening the economy and the quality of life. \"Water is the foundation for our economies, communities, ecosystems and quality of life,\" Brown said in a statement. \"State governments efforts to address climate change must include reduced consumption and other conservation measures as water shortages become the new normal. natalie.schachar@latimes.com, Twitter: @natalieschachar]", "Date": "20150729", "Title": "[Oregon state agencies told to conserve water as drought worsens]", "Link": "http://www.latimes.com/nation/nationnow/la-na-nn-oregon-executive-order-20150729-story.html", "Author": "NULL"}