{"Content": "[Hillary Rodham Clinton had been to town the night before to energize voters, and just that morning another good report on the economy had been released in Washington. But as Jay Johnson emptied cardboard boxes into a trash bin outside Ace Hardware  hes the guy you see about tools  he had little to say about either one. Hell vote Tuesday. Probably. But if he does, this two-time Obama voter, a Democrat, says hes leaning toward Republican Senate candidate Joni Ernst, not her Democratic opponent, Bruce Braley, because \"being from here, you can kind of relate to Joni.\" Beyond that, he doesnt think that anything that occurs Tuesday in the national midterm elections will affect what still matters most to him, six years after the crash: the economy. \"They say its good  that it has turned around,\" Johnson said, as he shifted one flattened box after another from a shopping cart into the bin. \"I guess most people just dont feel it.\", Johnson, 37, recently lost his second job as a carpenter at a nonprofit that helps rehabilitate houses for first-time buyers. Things were good for a while; they were doing 10 to 15 houses a month, but then the groups money dried up. His wife, a foreclosure counselor, is swamped: \"She has a lot of job security.\", Continuing unease about the economy and disappointment in the president remain the strongest head winds for Democrats across the country in Tuesdays election. Sentiments like Johnsons are why Republicans are within reach of taking over the Senate, possibly even picking up a seat here in the state with an increasingly blue tinge that launched Barack Obama on his path to the White House in 2008, and voted to elect him twice. Voters in Iowa and other closely contested states like Colorado and Louisiana say trauma from the nations economic decline is foremost in mind as the election nears. Prosperity has returned for some, but not all, and many live in fear that any gains they achieve will vanish. Undergirding their uncertainty is the discomfiting sense that no one  not the president nor members of Congress  has much control over events around the world. Each week leading up to the election seemed to bring a new crisis: Islamic militants beheading Americans, a dreaded virus finding its way to American shores, a troubled man scrambling into the White House before being stopped. And there is a palpable distrust of governments ability to handle those situations and keep Americans secure. But that unease is playing out differently among different groups of voters. Some plan to sit out the election despite the get-out-the-vote armies from the two parties and outside groups deploying across the swing states to coax sporadic voters to the polls. Yet among hard partisans on the right and left, it seems to be having the opposite affect driving them to cast ballots early, most often for what amounts to an up-or-down vote on Obama. Here in Iowa, Suzanne Ortiz, 54, said she voted early for Braley because she fears Republican control of the Senate would lead to a stripping-away of the safety net and evisceration of the new healthcare law. \"We lost everything,\" said Ortiz, a former 911 operator who said she and her engineer husband were forced to rely on Medicaid and food stamps after the economic collapse. When her husbands work picked up after two years of unemployment, they found their income was too high to qualify for help, but because of health problems, Ortiz said, \"no insurance company would touch\" her. Now they are both covered by Obamacare, and their sons are moving beyond minimum-wage jobs to a place \"where they finally can keep their head above water.\", If Republicans control both houses of Congress, Ortiz said, shes afraid \"that everything goes back to where we were.\", \"At least now we can pay the bills,\" she said. \"Maybe not on time, but we can pay them.\", Feeling that same uncertainty  but emerging on the other end of the electoral spectrum  were Wayne and Karen Gray, retired farmers who came to hear Ernst over breakfast at Big T Maid-Rite, a Toledo, Iowa, diner, during Ernsts recent swing through in an RV emblazoned with the encouragement to \"Honk if you think Washingtons broken.\", \"Its a disaster  this Ebola mess  we just dont have any leadership right now,\" said Karen Gray, 74, of Tama, who described the Obama administration as \"very reactive\" on issues from Ebola to terrorism. She and her husband both felt reassured by Ernsts promise to bring \"Iowa ways\" to Washington, and the part of her talk when she noted that she had served in Kuwait and southern Iraq with the Iowa Army National Guard. \"We could have kept ISIS from spreading,\" Ernst told the crowd at the Maid-Rite, chiding Obamas early description of Islamic State militants as a \"junior varsity\" force. \"We just want everything back to normal, for our grandchildren,\" Gray said. \"Everything she says is exactly how we feel inside about what is going on in our country.\", But the sharp partisan divide over who is to blame for those feelings of instability is driving away other voters, like 30-year-old Leo Yerington of Davenport. In his telling the fear-mongering  whether about threats to Social Security and abortion rights by the left or hysteria about Ebola patients and terrorists coming across the border from the right  has led him to tune out the election. \"You cant blame it all totally\" on the president, said Yerington, a crane operator who voted for Obama in 2008, but \"didnt like what he did.\" He is frustrated by the dearth of ideas from Ernst and Braley on how to handle those problems, adding that the Senate campaigns had amounted to \"more bashing than anything else.\", \"I cant stand that,\" he said, as he unloaded groceries while his children clambered inside the familys SUV. \"Neither one of them can hit me in the middle.\", Kelly Roth, a hairdresser who is also worried that America is losing its influence over events abroad, said she too was unlikely to turn out Tuesday because the Senate candidates had offered \"no clarity about what they would do\" to address unsettling events around the world. Roth, who was shopping the crafts aisle at a Wal-Mart in Delaware County  which split in 2012, with 49.4% for Obama and 49.6% for Mitt Romney  voted for Obama twice. \"He talked a really good talk,\" she said, but shes disappointed. While the economy has stabilized, she says many people she knows \"still want better-paying jobs.\" And she has been disgusted by candidates feeding on fears about terrorism and Ebola  helped along by \"media that likes to scare the crap out of people.\", Even at the Hamburg Inn No. 2 diner in Iowa City, a perennial stop of political candidates from Ronald Reagan to Bill Clinton in one of Iowas bluest counties, the relentless get-out-the-vote efforts here didnt motivate waitress Heather Molyneux to register (though she didnt admit that to Hillary Clinton when the potential 2016 candidate popped in for a chocolate bourbon pecan pie shake with Braley on Wednesday). \"Really, theyre both so extreme,\" she said of the two major parties, \"that I just cant really thumb down one way or the other.\", \"Why cant I have a gun and get an abortion?\" she asked, adding that she would never want an abortion, but that people should \"make their own choices.\" As she sat at the counter during a break, she predicted that Tuesdays outcome would have little impact on her life. \"Im just getting by, by the seat of my pants. I live check to check, but the checks seem to be making do,\" said Molyneux, who has a 6-year-old son. Whichever way the election goes, she said, \"the world is just going to keep going on and working the way its working.\", maeve.reston@latimes.com, Twitter: @maevereston]", "Date": "20141102", "Title": "[Unease over economy, Obama may turn Iowans redder  if they vote at all]", "Link": "http://www.latimes.com/nation/politics/la-na-election-atmosphere-20141102-story.html\n", "Author": "[Maeve Reston]"}
