{"Content": "[The case that comes before the Supreme Court on Wednesday with the potential to unravel President Obamas landmark healthcare law began in a conference room at the American Enterprise Institute, a few blocks from the White House and the K Street corridor. It was December 2010, and voters had recently elected a new crop of Republicans, many of whom had ridden to victory on their objections to Obamacare. GOP attorneys general in several states, along with a major business group, had headed to court in Florida, arguing the entire law was unconstitutional. With the counterattack gaining strength, conservative lawyers and activists gathered at AEI, a conservative think tank, to look for flaws in the massive Affordable Care Act and to devise a legal strategy for destroying it. \"This bastard has to be killed as a matter of political hygiene,\" Michael Greve, an AEI scholar, declared. \"I dont care how this is done, whether its dismembered, whether we drive a stake through its heart. Any dollar spent on that goal is worth spending.\", Those remarks got the most attention at the time. But the comments that may turn out to have been the most important came from a soft-spoken former Reagan administration lawyer who had closely studied the 900-page law. Thomas Christina said he had \"noticed something peculiar in the tax-credit section.\", A key part of the law is the creation of exchanges  online marketplaces where consumers can buy insurance and receive subsidies to help with the cost. California and 12 other states run their own marketplaces; the rest rely on the federal government fully or partially for their marketplace. The exchanges are crucial to the laws success, but one provision, Christina said, seemed to him to say that \"there will be no tax credits for taxpayers who live in non-capitulating states,\" as he called the states that decided not to set up their own exchanges. That \"is really quite extraordinary,\" he said. So began the case now known as King vs. Burwell, a legal challenge that argues the healthcare law denies tax subsidies for about 7 million Americans who live in the states that use the federal HealthCare.gov marketplace, rather than setting up their own exchange. The path the case has followed  from a conference room at a Washington think tank to a nearby federal courthouse to the Supreme Court  illustrates one way that high-profile litigation can land in front of the justices. Its course forms a sharp contrast with the same-sex marriage cases the court is scheduled to hear next month. In those latter cases, beginning first in New England and then across the country, gay and lesbian couples came forward in one state after another seeking a right to marry. Slowly over a decade, their legal claims rose toward the high court. Although legal advocacy groups were involved in selecting cases to push, no one denies that the individual plaintiffs came first. By contrast, in the healthcare case, the lawyers spotted a possible flaw in the statute and then sought out a few plaintiffs whose names could carry a lawsuit. The litigation has moved rapidly, but questions about whether the plaintiffs meet the legal standards to be in court could still upend the case. The law says taxpayers must have health insurance, and it offers subsidies to those with low and moderate incomes. But as Christina noted, the section on tax credits says these subsidies will be provided through an \"exchange established by the state.\", The Obama administration argues that the federal exchanges serve in place of the state exchanges. But those who have challenged the law disagree, and if the justices side with them, the ruling would deal the law a severe blow. Conservatives were disappointed in June 2012 when Chief Justice John G. Roberts, speaking for a 5-4 majority, said the requirement that individuals have insurance could be enforced through a tax penalty. But the laws opponents were not about to give up. \"We got to talking after the Supreme Court upheld Obamacare and looked seriously into whether a case could be structured based on Tom Christinas discovery,\" said Sam Kazman, general counsel for the Competitive Enterprise Institute. His small libertarian group, like nearby AEI, champions free-market principles, but unlike the think tank, it also files lawsuits. It has about 30 employees and a budget of $6 million, the sources of which are unpublicized. \"We dont disclose our donors,\" Kazman said. Kazmans group decided to fund a challenge to the tax subsidies. The group hired Michael Carvin, a conservative and Reagan-era veteran who had led the challenge to the law in 2012. They filed suit close to home, first in the District of Columbia and later in nearby Virginia. They found several people who objected to the healthcare law and were willing to act as plaintiffs. One was David Klemencic, who said he ran a flooring business in West Virginia and expected to earn $20,000 a year. He said he did not wish to buy health insurance, even if the subsidy reduced the cost to \"less than $21 a year,\" according to the U.S. court of appeals in Washington. Citing that potential injury to Klemencic, the appeals court here, by a 2-1 vote, said the legal challenge could go forward. On July 22, it ruled that the tax subsidies were illegal in states that had not set up their own exchanges. A few hours later, the U.S. appeals court in Richmond, Va. came to the opposite conclusion. Kazmans group had sued there on behalf of David King, a publicity-shy 64-year-old who had served in the Army in Vietnam and also said he objected to being required to buy health insurance even if it was highly subsidized. The 4th Circuit Court of Appeals ruled for the Obama administration, saying the law made tax subsidies available nationwide. Because King is a military veteran and may be eligible for veterans healthcare, the Wall Street Journal and other news outlets have raised questions about whether he is covered by the requirement to buy insurance. If not, he might lack the legal status, known as standing, necessary to pursue a case. Similar questions have been raised about the other plaintiffs. So far, however, that has not proved an impediment. On Nov. 7, the justices announced they would hear King vs. Burwell. The journey from the conference room at AEI to the Supreme Court had turned out to be surprisingly short. david.savage@latimes.com]", "Date": "20150303", "Title": "[Obamacare case began when conservative lawyer saw possible flaw in law]", "Link": "http://www.latimes.com/business/la-fi-court-case-origins-20150304-story.html\n", "Author": "[David G. Savage]"}
