{"Content": "[In any other campaign, a labor union backing a Democrat for U.S. Senate would be routine. But the first to line up publicly behind state Atty. Gen. Kamala D. Harris turns out to be the Los Angeles Police Protective League. Her announcement Wednesday of the unions support underscored that a paramount goal for Harris in the opening phase of her Senate run is to keep former Los Angeles Mayor Antonio Villaraigosa from joining the race -- or at least to make the contest more difficult for him should he decide to jump in. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Indeed, for Harris, the ritual of rolling out endorsements appears more and more to be largely about Villaraigosa, a fellow Democrat whose allies say he is likely to announce his candidacy any day. First, she announced the support of two prominent Los Angeles African Americans: City Council President Herb Wesson, a longtime Villaraigosa ally, and county District Atty. Jackie Lacey. Their support for Harris, who is black, suggested Villaraigosas historically strong support among African Americans could be in peril. Next came a series of Latino endorsements of Harris: Long Beach Mayor Robert Garcia, Assemblyman Jose Medina (D-Riverside), San Francisco City Atty. Dennis Herrera and former state Democratic Chairman Art Torres. Villaraigosa, who would be Californias first Latino senator, would need strong Latino support in the June 2016 primary to help offset Harris Bay Area stronghold. Now, the police unions support of Harris serves as a reminder that Villaraigosa would face a serious risk that organized labor would rally behind the attorney general -- a formidable threat in any statewide campaign. The education agenda that Villaraigosa pursued as mayor turned powerful teachers unions into staunch adversaries. Aggravating the natural tensions that any mayor faces with municipal unions, Villaraigosa had the misfortune of governing Los Angeles when the 2008 economic crisis struck, ravaging the citys finances. The police unions nearly 10,000 officers went without raises for three years on his watch. Law enforcement unions were no friend of Harris when she first ran for attorney general in 2010. Statewide, nearly all of them opposed her after she refused, as San Franciscos D.A. to seek the death penalty in prosecuting the killer of city Police Officer Isaac Espinoza. During her first four years as attorney general, Harris worked hard to win the unions support for her reelection -- and most of them indeed endorsed her. Craig Lally, president of the Los Angeles Police Protective League, said he was especially moved that Harris had traveled far and wide to attend the funerals of slain officers. Shes amazing with that, Lally said. If many other law enforcement unions follow the leagues lead in backing Harris for Senate, it would bolster her law-and-order credentials. That could prove particularly useful in a race against Villaraigosa, who often boasted of expanding the Police Departments ranks by hundreds of officers when he was mayor. Twitter: @finneganLAT]", "Date": "20150211", "Title": "[Police support for Harris: A warning sign to Villaraigosa]", "Link": "http://www.latimes.com/local/political/la-me-pc-harris-villaraigosa-police-union-20150211-story.html\n", "Author": "[Michael Finnegan]"}
