{"Content": "[After the Supreme Court handed down a landmark decision last month sanctioning same-sex marriage in all 50 states, a longtime friend and former staffer to Vice President Joe Biden sent a text message to congratulate him: Your legacy. 28 years ago, the aide wrote. The reference was to the titanic battle Biden had waged as a senator in 1987 to deny a Supreme Court appointment to Robert Bork, the conservative jurist whose defeat led to the high court appointment of Anthony M. Kennedy. On same-sex marriage and the courts, the stimulus and the economy, Iraq and foreign policy, Biden has been an integral but occasionally overlooked force throughout his career, particularly in the White House. ------------, FOR THE RECORD, Biden legacy: In the July 12 Section A, an article about Vice President Joe Biden incorrectly described an aspect of the debate over Robert Borks nomination to the U.S. Supreme Court in 1987. The article described Borks nomination as posing a threat to civil rights and abortion rights. The article should have made clear that this was the view of those opposed to Borks confirmation. ------------, Now, in what may be the closing chapter of his career, Bidens close circle of friends and former aides see the political landscape shifting toward him. And with an open presidential election looming, some wonder why he should surrender the spotlight. Hes the only person that would be in the race thats spent the last eight years helping make decisions from gay marriage to Obamacare to Iraq and Afghanistan, and understands how difficult it is, said Dick Harpootlian, former South Carolina Democratic Party chairman and one of the most vocal proponents of a third Biden presidential bid. This is the perfect environment for him. Whether Biden will embark on one last runfor the presidency is one of the remaining major questions of the opening stage of the 2016 campaign. The May 30 death of Bidens eldest son, Beau, has largely put the question on hold for Biden himself. His focus in recent weeks has been on his family, as was evident as he and his wife doted on their grandchildren during a trip to Vancouver this weekend for the womens World Cup final. A decision on whether to make a run is expected by September, though that timetable has already slid. The presence of an incumbent vice president who is not his partys expected nominee is an anomaly in most recent U.S. presidential elections. Yet those who might question why Biden would take on Hillary Rodham Clinton, widely seen as the heavy favorite in the Democratic contest, only need be reminded that he ran against her in 2008 under a similar circumstance. And as Vermont Sen. Bernie Sanders continues to show that some Democrats are open to a Clinton alternative, Biden might see a path to combine Sanders populist zeal with his own more establishment-friendly heft. On a number of issues that are likely to come to the forefront on the campaign trail, a close examination shows Biden had a significant role in shaping policy. The Supreme Courts historic ruling was one example. As the senator overseeing Borks confirmation hearing in 1987, Biden opted against an approach favored by many in the civil rights community: to focus on the threat Bork posed both to civil rights and to abortion rights. Instead, he opted for an examination of the nominees views on the right to privacy and the broader question of whether to recognize so-called unenumerated rights -- those not specified in the Constitution but upheld in court decisions. The fundamental rights notion  is the doctrinal basis for protecting gays and lesbians under the Constitution. Thats why what Biden did that summer was so important, said Mark Gitenstein, Bidens chief counsel at the Judiciary Committee at the time and the aide who sent him the recent text. What he did that summer was not only intellectually understand it. He articulated it in a way that average Americans could understand it and embrace it, too. Defeating President Reagans nomination of Bork ultimately brought about the confirmation of Kennedy, arguably the LGBT rights movements main judicial ally as the swing vote on the Supreme Court and the writer of the majority opinion legalizing same-sex marriage. Gitenstein also argues that Biden helped change the way Supreme Court nominees are considered, requiring them to address the question of fundamental rights that would shape jurisprudence on the Supreme Court for 30 years. Decades later, Biden had a more direct contribution to the same-sex marriage effort. In a 2012 television appearance, he plainly answered yes to the question of whether he supported the right of gays to marry, before President Obama had done so. Bidens affirmation, followed by the presidents, needs to be seen as one important powerful moment that absolutely gave permission to millions of Americans to rethink their decision and move in support of freedom to marry, said Evan Wolfson, himself a former Biden intern and founder and president of Freedom to Marry, a group Biden will speakto Thursday night at an event celebrating the court ruling. Bidens contributions to the fight for marriage equality grew out of the causes he championed in his earliest days in politics, which he has said were inspired by the civil rights movement of the 1960s. When you see him at his most passionate, its usually when hes addressing a situation where an institution or a person or a situation gives a more powerful person the ability to defeat the less powerful person, said Ted Kaufman, a longtime Biden confidant who briefly replaced him in the Senate when he became vice president. Kaufman cited the Violence Against Women Act of 1994, which Biden wrote, as a prime example. There was not much interest in doing this at the time when he presented it. But its had an incredible impact in terms of the lives of so many people, and attitudes, too, Kaufman said. If he were to run, a campaign focused on economic issues could be enticing to the vice president, who often evokes his working-class roots. Hes thought a lot about the extent to which the economy is reaching or is not reaching people in the middle class, said Jared Bernstein, Bidens chief economic advisor during the Obama administrations first term. Biden was talking about these issues very pointedly in the campaign in 2008. Now you have everyone from Bernie Sanders to Ted Cruz talking about that. Biden has done little publicly to tip his hand as hes resumed his public schedule in recent weeks, and during his trip to Vancouver last weekend for the Womens World Cup final, the death of his son was clearly still at the front of his mind. When asked during the final minutes of the match about whether hed played soccer as a child he quickly recalled watching Beau, a team captain, play as a child. In a largely overlooked speech in May, just a week before his son died, the vice president came as close as he has to laying out what could be the planks of a Biden campaign, cloaked in a defense of the Obama administrations record. The economic stimulus was really very unpopular -- even among some Democrats it was unpopular. Well, guess what? I executed it -- we executed it precisely, he said. What is the mantra of the Republican Party? Government spending is wasteful. We dont know how to do it. We do. And it worked. The administrations auto-industry rescue? I know I get blamed for being the guy who pushed that, he said. I was proud to push it. In fighting for the Affordable Care Act, we settled the fight that Ive been involved in since I was a 29-year-old kid running for Senate -- healthcare is now a right, not a privilege, Biden told the audience at a Center for American Progress event. Were now in a situation where we cant back up, he said. I get criticized for being too straightforward, but, damn it, we ought to stand up and say what we believe and stand by it. Whoever is running, Biden added, should also talk about ... what weve done. For more White House coverage, follow@mikememoli]", "Date": "20150709", "Title": "[Biden's quiet role in same-sex marriage ruling fuels speculation about 2016 run]", "Link": "http://www.latimes.com/nation/la-na-biden-campaign-question-20150709-story.html\n", "Author": "[Michael A. Memoli]"}
