{"Content": "[To the editor: The 2014 Pew Research Center report on political polarization in the American public indicated that many Americans prefer to live near and associate with those who share their religious and political beliefs  in other words, people just like them. How boring to be surrounded all the time by people just like you, with little variety or intellectual stimulation. Thank you for publishing the uplifting storyabout the friendship between Supreme Court Justices Ruth Bader Ginsburg and Antonin Scalia. Although separated by religion, sex, political beliefs and interpretations of the Constitution, they have developed and maintained a strong friendship based on mutual respect and a love of opera. This is more than just a good news story; it is a wonderful example for Americans to consider during the increasing nastiness of the 2016 election season. Judith Fenton,Costa Mesa, .. To the editor: It always amuses me when I read that Scalia insists the Constitution should be interpreted the way its original writers would have understood it. Over the years he has been on the court, Scalia has twisted the plain meaning of numerous words of the Constitution whenever it would suit his ultra-conservatism, such as when he simply dismisses the well-regulated militia language as imposing no qualifier whatsoever on the right to bear arms, or when he concludes that empowering billionaires to buy elections and corrupt the democratic process in the most profound way is simply an exercise in free speech. Both of those positions, in addition to being contrary to many years of Supreme Court precedent, would no doubt astound the framers. Scalia may be many things, but a strict constructionist hes not. Gordon J. Louttit,Manhattan Beach, .. To the editor: The uncommon bond of Scalia and Ginsburg, who disagree so often on the law, is refreshing. Far too often these days those in government with differing views fight regularly and with acrimony, behaving in such a manner as to suggest they have very little regard for we , the people. What the two Supreme Court justices have for each other is respect  a trait that, sad to say, has become all too rare in government and, indeed, in American society. Jon White,Monrovia]", "Date": "20150624", "Title": "[The Scalia-Ginsburg friendship bodes well for America]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-0624-wednesday-scalia-ginsburg-friends-20150624-story.html", "Author": "NULL"}