{"Content": "[The commissioner was adamant. She urged a drastic change in Los Angeles County budget priorities and reorganizing county government to better serve abused and neglected children. The entire task force is really insisting that childrens services be given the highest priority in the county budget, she said, and that means on a level with other protective services like the Police Department. Our children deserve no less than that kind of priority. The words could easily have come from the transcript of the April 22 presentation to the Board of Supervisors of the final report of the Blue Ribbon Commission on Child Protection, which is calling for a new office to transcend departmental lines to bring services to children at risk of abuse or neglect. They could have. But they didnt. They were delivered on a different April morning  30 years ago, as part of a series of hearings on a proposal to create a new county department of childrens services. The speaker was Celeste Strack Kaplan, a faculty member of the USC School of Social Work and president of the Los Angeles Round Table for Children, which led the fight to create the department. Other experts testified in those 1984 hearings, as did a host of celebrities. TVs Henry Winkler noted that everyone else had their own department  there was even a department for trees, he said  but not children. The testimony of Kaplan, Winkler and others was depicted as part of The Passions & Politics of Ed Edelman, a 2013 film about the county supervisor who served from 1974 to 1994. The film, by Edelmans wife, Mari, is celebratory, enlightening and, to be honest, somewhat depressing. Why depressing? Because in highlighting the difficult and heroic actions that Edelman took to improve the lives of thousands of people, its a stinging reminder that some problems seem to remain exactly where they were decades ago. Consider, for example, the resistance of a combative sheriff  in this case, Sherman Block to the notion that there was anything at all wrong in his department, Edelmans role in creating a commission under Judge James Kolts to ferret out problems and recommend an oversight structure, and the creation of a new Office of Independent Review to provide a measure of civilian oversight. The film features a television reporters summary of the Kolts Commissions findings: Disturbing evidence of excessive force and lax discipline. Thats a line that could easily apply to the 2012 report of the Citizens Commission on Jail Violence. Despite the Kolts Commission, the Sheriffs Department spun out of control. Although separated by 20 years, the two commissions found many of the same problems, many recommendations from the earlier report unimplemented, and others  like the Office of Independent review  inadequate to the task. The OIR is now being phased out, at least as an oversight body for the sheriff. And, of course, there is the task force consisting of Kaplan and others that compelled the Board of Supervisors to remove oversight of abused and neglected children from the countys welfare department and to create what is now the Department of Children and Family Services. DCFS has burned through, on average, one director every year and a half, leaving unstable leadership and constantly shifting policies and priorities. The department has been roundly criticized for the quality of its service to children and to their families. This years Blue Ribbon Commission is calling for deep, systemic change. So its easy to walk away exasperated and conclude that problems with jail beatings, child services and other areas in which county government intersects with human misery are with us always, like poverty, and that it is pointless wheel-spinning to try to do much about them. That certainly would be a lesson. But its the wrong lesson. To see why, its helpful to return to the Edelman film, to be reminded of all of the things this county supervisor did accomplish in his 20 years on the board from the mid-1970s to the mid-1990s and his decade before that on the L.A. City Council. His work on homelessness, mental illness, AIDS, creating a new childrens court  all of it made peoples lives better. Of course the county still flounders with homelessness, mental illness and other problems. Government cant simply put in place a structure  for example, a Department of Children and Family Services  and expect that service will improve forever or problems will evaporate without constant attention, organizational maintenance, monitoring of progress and tracking of changing conditions in society. A lot can happen, good and bad, in three decades. The trick is to put in place structures and programs that are sound, and to correct the kinks over time. And every now and then it may be time for a revamp, or at least a reevaluation of programs put in place to solve the problems of previous decades. With the June 3 county elections and the looming replacement of two county supervisors  the most sweeping change on the board since 1980, and with two more changes to come in 2016  could there be a better time than now for such a revamp?]", "Date": "20140505", "Title": "[A 30-year time warp for L.A. County child welfare?]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-child-welfare-los-angeles-county-20140502-story.html", "Author": "[Robert Greene]"}