{"Content": "[In a rulingthat could have reverberations around the country, a federal judge on Thursday struck down an Ohio law thatbars individuals from knowingly making false statements about political candidates. Thedecision from District Court Judge Timothy Black follows the U.S. Supreme Courts unanimous ruling in June that a political groupcould proceed with a 1st Amendment challenge against the Ohio law that criminalizes \"false\" political speech. Calling the law unconstitutional, Black wrote in his 25-page ruling that \"the answer to false statements in politics is not to force silence, but to encourage truthful speech in response, and to let the voters, not the government, decide what the political truth is.\", He also ordered the states Elections Commission to cease enforcing the law and noted that its up to lawmakers -- and not a court -- to rewrite the statute. \"There is no reason,\" Black said, to believe that the commission is positioned to determine what is true and what is false when it comes to literature and advertisements against candidates. At its core, the case stems from a 2010 criminal complaint filed by former U.S.Rep. Steve Driehaus (D-Ohio) against theSusan B. Anthony List, an antiabortion group. That year, as Driehaus faced a tight reelection race,the group planned to post billboard ads that said the Democrats support of President Obamas healthcare law was in essence support for abortion. Driehaus, who opposes abortion, cited the Ohio law in his complaint against the Susan B. Anthony List, prompting the owner of the billboards where the ads were set to go on display to not put them up. Marjorie Dannenfelser, president of the Susan B. Anthony List, applauded Blacks decision. After four years and a trip to the U.S. Supreme Court, today we finally have a victory for free speech,Dannenfelser said in a statement. She also said that over the summermore than 20 groups from \"across the political spectrum\" submitted amicus briefs to the U.S. Supreme Court on behalf of the Susan B. Anthony List prior to its ruling that allowed the federal court to hear the case. The statute in Ohio has been in effect since 1995. Other states, including Minnesota, have similar laws. Follow @kurtisaleeand emailkurtis.lee@latimes.com]", "Date": "20140911", "Title": "[Federal judge strikes down Ohio's campaign statements law]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-ohio-law-false-statements-20140911-story.html\n", "Author": "[Kurtis Lee]"}
