{"Content": "[Gov. Jerry Brown, speaking at a conference hosted by Pope Francis, on Tuesday denounced climate change skeptics as well-financed troglodytes determined to bamboozle local leaders. Brown said he has no faith in Congress to act on global warming, and urged the 60 mayors from around the world attending the event to take action to cut greenhouse gas emissions. Its up to you guys, Brown said. Brown threw his weight behind Pope Franciss encyclical, Laudato Si, issued in May, in which the pope linked poverty to creeping climate change and urged action to alleviate both. Human trafficking also will be discussed at the two-day conference. Speaking at the conference, Pope Francis urged the United Nations to step up its campaign against climate change. I have great hopes for the Paris summit in December and hope a fundamental agreement is reached, Francis said, referring to a key meeting at which a new United Nations climate deal should be signed.  The U.N. needs to take a strong position on this, he added.  For their part, Brown and the other local leaders signed a declaration stating thathuman-induced climate change is a scientific reality, and its effective control is a moral imperative for humanity.\", Speakers at the event highlighted the role mayors can play fighting climate change, given that half the worlds population now lives in cities, which are in turn responsible for nearly three quarters of the planets greenhouse gas emissions. With mayors from San Francisco, San Jose and eight other U.S. cities in the audience, Brown gave a glowing review of his own achievements in cutting emissions in California, offering it as a template for mayors around the world to follow. California is now deriving 25% of its energy from renewable sources and has the most efficient buildings in the U.S. as well as 40% of the countrys electric cars, he said. But we are not stopping there, he said, adding he wanted renewable energy to reach 50% and gasoline use in cars and trucks to drop by 50% in 15 years. For Brown, a former Jesuit seminary student with a political career now in its fifth decade, has repeatedly said that California cannot fight global warming alone but that the state can set an example for the nation and the world. Backing up his call to action, Brown quoted Saint Paul on man reaping what he sows, but sounded a positive note by citing Italian communist leader Antonio Gramsci, who described the pessimism of the intellect, optimism of the will. He called for a campaign against the fierce opposition and blind inertia of well-financed climate change skeptics. With national leaders proving unwilling to act, the governor called on mayors to light a fire, if I may use that metaphor  in terms of climate change, its probably the wrong one. We have very powerful opposition that, in at least my country, spends billions on trying to keep from office people such as yourselves and elect troglodytes and other deniers of the obvious science, Brown said at the conference. New York Mayor Bill De Blasio, speaking after Brown, thanked the California governor for being the leading voice in the nation on climate change, and announced his intention to cut greenhouse gas emissions in New York by 40% by 2030, following Californias example. After flying to Rome at the weekend, ahead of the conference, Brown stayed at the Rome residence of the U.S. ambassador to Italy and met with Father Adolfo Nicols, superior general of the Jesuits. In an interview on Monday, Brown said he backed Pope Francis treatment of nature as part of Gods creation, to be safeguarded as carefully as humanity itself. He talks about the web of life and sums up the encyclical as stating everything in nature is an expression of the divine and therefore we have to take it seriously, Brown said. The pope is dealing with the biggest threat of our time. If you discount nuclear annihilation, this is the next one. If we dont annihilate ourselves with nuclear bombs then its climate change. Its a big deal and hes on it. In the encyclical, the pope criticized the concept of buying the right to emit greenhouse gases, so-called cap-and-trade policy, which is a major component of Browns green policy for California. The strategy of buying and selling carbon credits can lead to a new form of speculation, which would not help reduce the emission of polluting gases worldwide, the pope wrote. Brown said he felt the criticism did not apply to California. California has a uniquely constructed cap and trade. It is very tightly regulated and it is not the only thing. I get the impression that [Pope Francis] thinks a market solution is not enough. We have a renewable energy standard, building standards, we have research and development, subsidized electric cars, he said. Cap and trade is designed to cut greenhouse emissions, but also to minimize any disturbances to our way of living, said Ann Carlson, a professor of environmental law at UCLA and co-director of its Emmett Institute on Climate Change and the Environment. But in the encyclical, the pope is asking a fundamental question about whether people  specifically in the West, who on a per capita basis omit many more greenhouse emissions than those in developing countries  ought to be consuming as many resources as they do, Carlson said. Times Staff Writer Kurt Chirbas contributed to this report. ALSO, Ohios John Kasich brings heat, intrigue to 2016 GOP race, Bush and Clinton highlight sharp contrast in dueling policy speeches, Hillary Clintons political director brings key lessons from her own (losing) campaign, 9:11 a.m.: This article was updated to include comments from Pope Francis. This article was originally published at 7:11 a.m.]", "Date": "20150721", "Title": "[Gov. Brown blasts climate change 'deniers' during Vatican conference]", "Link": "http://www.latimes.com/local/political/la-me-pc-gov-brown-blasts-climate-change-critics-during-vatican-conference-20150721-story.html\n", "Author": "NULL"}
