{"Content": "[House Republicans on Friday conducted a series of largely symbolic votes against the nuclear deal with Iran, following the collapse of their effort to send a congressional resolution of disapproval to President Obamas desk. Instead the GOP-led House called up a resolution to approve the deal, defeating it 162-269. No Republicans voted in favor of the deal, though one voted present. Twenty-five Democrats joined the Republican majority against it, showing the influence of Minority Leader Nancy Pelosi (D-San Francisco) in holding her partys support for President Obama. The House also voted 247-186 to suspend the lifting of economic sanctions until Jan. 21, 2017, after the next president is seated in the White House. That bill is unlikely to pass the Senate. The boisterous House debate unfolded on an otherwise somber day in Washington and nationwide as lawmakers incorporatedremembrances of the Sept. 11, 2001, terrorist attacks. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, After Democrats in the Senate delivered a decisive victory to the White House earlier this week by blocking the Republican-led resolution of disapproval against the deal, the GOP majority in the House was left with few options for stopping it. Without congressional roadblocks, the U.S. and its partners can proceed with implementing the accord, reached with Iran and five leading nations: Britain, Germany, France, Russia and China. The deal aims to halt Irans nuclear program in exchange for a lifting of international economic sanctions. \"I know the president may have already lined up enough support to save his deal,\" said Rep. Paul Ryan (R-Wisc.), the partys former vice presidential nominee. \"But with this vote we need to send a message to both Iran and the world. The regime might have bamboozled this administration, but the American people know this is a rotten deal.\", Foreshadowing the expected campaign attacks that lie ahead in the 2016 election, lawmakers spoke in partisan, and at times deeply personal, terms about what for many became a painstaking decision. While many Republicans argued that the White House should have negotiated a better deal, Democrats largely saw the accord as the best alternative to military action to prevent Iran from developing a nuclear bomb. \"I dont think any of us have any idea if this agreement is going to hold,\" said Rep. Charles E. Rangel (D-N.Y.), an Army veteran of the Korean War. \"I know the horrors of war. We should always give diplomacy a chance before we put any Americans into harms way.\", Republican leaders, including House Speaker John A. Boehner (R-Ohio) and Senate Majority Leader Mitch McConnell (R-Ky.), have promised the fight is not over. More votes are expected next week. But with most Democrats in both the House and Senate forming a line of defense backing Obama, Congress has almost no ability to change the outcome before its self-imposed Sept. 17 deadline. Instead, Republicans are expected to try to chisel away at the deal in both legislative action and in public opinion during the campaigns ahead. For the latest from Congress and 2016 campaign follow @LisaMascaro, ALSO:, Uproar among House GOP conservatives forces new strategy on Iran vote, Secure in Iran deal victory, White House is gently mocking its opponents, Hillary Clinton makes case for Iran deal, and a more hawkish approach in Middle East]", "Date": "20150911", "Title": "[After failing to block Iran deal, GOP conducts symbolic votes against it]", "Link": "http://www.latimes.com/nation/politics/la-na-house-iran-vote-20150911-story.html", "Author": "[Lisa Mascaro]"}