{"Content": "[Have you heard that Hillary Rodham Clinton is now a grandmother? Surely you have. But did you know that as a young girl she wanted to be an astronaut? Or that she played on a softball team called the Good & Plenties, with pink and white uniforms?, The source of all that information is Clinton herself. And actually, just call her by her first name. \"Hillary is fine by me,\" she recently told a New Hampshire voter who asked how he should address her. After more than two decades in the public eye, Clinton entered her second presidential race this spring with nearly universal name recognition. But her campaign staff viewed the situation differently, calling her the least-known famous person in the world; the public view is of the former first lady, senator and secretary of State, but not the woman herself. So as Clinton tours early primary states and holds intimate gatherings with voters, she seems to go out of her way to share the kinds of details voters may not have known. Her effort to be relatable has been mocked by \"Saturday Night Live,\" among others, but it is vital to her election chances: Polls have shown the public taking an ever-more-dim view of her since she left the State Department. \"Americans dont know the first 35 years of her life. And thats not what happens with most candidates,\" said Jennifer Palmieri, the campaigns communications director. \"They dont emerge on the national scene without you understanding where they came from. So we thought it was important: Lets go all the way back to what originally motivated her.\", In her campaign kickoff rally, she shared her mothers searing personal story  abandoned by her parents, shipped to California and forced to work difficult jobs to get by  to explain how she learned the importance of perseverance and hard work, and how \"everyone needs a chance and a champion.\" In an economic speech in New York on Friday, she recalled \"watching my father sweat over the printing table in his small fabric shop in Chicago.\", And yes, it means talking a lot about her first grandchild, Charlotte Clinton Mezvinsky, as she explains her vision for the future. Insisting Sunday on the importance of acting on climate change, she told supporters at a campaign stop in western Iowa that \"Im just a grandmother with two eyes and a brain and I know that this is an issue that we have to address.\", TRAIL GUIDE: Daily tour through the wilds of the 2016 presidential campaign >>, Its often said that elections can boil down to a contest of who would a voter rather have a beer with  a cliche centered on the importance that campaigns and political press ascribe to a candidates approval ratings. And a string of recent polls has shown that Clintons standing among the public has tumbled since she reentered the political arena. Gallup published data Friday showing that more voters viewed her unfavorably than favorably for the first time since 2008. Her 43% favorable rating was down from a peak of 66% in 2012 when she still served as secretary of State. Quinnipiac polling from key swing states released earlier in the week found her standing was even worse in key potential general election battleground states, including Iowa. Campaign officials have minimized the importance of those poll numbers, while noting that Clinton had higher favorable ratings than any other presidential candidate. But they say one of the first hurdles they recognized in the early stage of this campaign was showing voters how the issues that Clinton says she is fighting for are grounded in her own experiences, many of which might still be unfamiliar to them. \"No matter what that [favorability] number is, we would be doing this effort now to explain what drives her and why shes doing this,\" Palmieri said. \"Thats just a fundamental question that I think is very revealing about the kind of president somebody is going to be.\", Clintons personal approach is a marked contrast from how she campaigned in 2008, when her focus at the outset was highlighting her experience, said Mo Elleithee, a Democratic strategist who now serves as executive director of the Georgetown Institute of Politics and Public Service. \"She deserves a lot of the blame for that for not opening up and letting people see who she was as much as she should have over the years. Because when they do, they like her,\" said Elleithee, who was a spokesman for Clintons 2008 campaign. He said the candidate he sees now is more like the Clinton who emerged late in the 2008 campaign, when she won a string of late primaries even after then-Sen. Barack Obama had essentially locked up the Democratic nomination for president. \"She started to do it, but it was too late, mathematically. But when she did it, man, did she catch fire,\" he said. \"I think she understands this time that one, it helps people understand why she gets them, why she will fight for them, why they should trust her. And two, its who she is.\", The Clinton campaigns initial approach in 2008 was guided in part by the hurdle her team believed she needed to overcome as a female candidate. Clinton addressed that Thursday at an event in South Carolina. \"I really had a lot to prove because people had to think that a woman could be president,\" she said. \"This time it seems easier, that people are much more open.\", Amy Walter, a national political analyst for the nonpartisan Cook Political Report, said some of the concern about Clintons likability is overstated at this early phase of the campaign. \"It could be a problem or could not be a problem depending on who her opponent is. And we dont know what voters are going to be emphasizing in the fall of 2016,\" she said. But there is value in Clinton sharing more about her personal story. \"I dont think you can be reintroduced to someone that youve met before and youve known for 25 years. But if I find out something about someone I didnt know, that maybe helps me get greater insight about who they are, then I would be willing to put that into consideration,\" Walter said. \"The real challenge for her, though, will be that it has to look honest and authentic and not staged. Thats always difficult to do in the midst of the campaign.\", Clinton appears most at ease in discussing Charlotte, sometimes in passing, but often in connection to policy, such as her focus on early childhood education. At one recent event she painted a picture of herself, a potential future president, and her former president husband sitting with their granddaughter, sometimes talking, sometimes reading, sometimes singing. \"She does have some Clinton genes,\" she said of Charlotte. Then she joked, \"Her problem is probably shes talking too much.\", michael.memoli@latimes.com, ALSO:, In Alhambra, an Asian market replaces a Ralphs and stirs cultural anxiety, Chinas stock market drops 8.5%, its biggest single-day fall since 2007, Mexico is cracking down on U.S. boaters who venture into its waters]", "Date": "20150727", "Title": "[Facing unfavorable ratings, Clinton shares personal details to be more relatable]", "Link": "http://www.latimes.com/nation/la-na-clinton-likability-20150727-story.html\n", "Author": "[Michael A. Memoli]"}
