{"Content": "[As we turn to the new year, the members of this board traditionally offer our hopes for the future and reflect on the status of our wishes for the last 12 months. Thats a sobering process  reminding us that we often wish for more than we get. This year is no different, though a few did come true. Congress, for instance, granted one of our wishes, going the entire year without a manufactured crisis that wrecked, or threatened to wreck, the economy. It says something about the nations elected leadership, however, that one has to wish for it not to do harm, as if hoping it would actually help is too much to consider. Congress also almost granted a second wish from our list, as lawmakers came up with a bipartisan plan to improve the payment system for Medicare doctors. That fell short, however, as did efforts to come to a deal on immigration, leading President Obama to issue another controversial  but welcome  executive order setting clearer priorities for deportations. The Supreme Court, meanwhile, elected not to make its hearings more readily available on audio to the public, and conservatives kept up their dopey insistence that gay marriage somehow undermines religious liberty  denying us our wishes in both areas. Closer to home, Los Angeles voters shrugged off important elections despite our plea to participate; low turnout continues to undermine elections at all levels. And Hollywood laughed off our wish for a superhero movie in which a woman stars rather than appearing as a love interest. On the other hand, some people may have taken our wishes too seriously. Though we supported and admired Los Angeles Unified School Supt. John Deasy, we urged him to calm down a bit in his fights with the school board. Instead, he resigned. And we asked Sheriff Lee Baca to shape up his department; he too opted to quit, but at least his department now stands ready to improve under its new chief, Sheriff Jim McDonnell. So it is with heartfelt hope and some trepidation that we once again enter this field. In 2015, we wish for:, Faster growth in the U.S. and California economies. As 2014 drew to a close and the national unemployment rate fell below 6%, we saw the first tentative signs that wages were starting to grow. Thats a trend worth nurturing, considering how long wages have stagnated for low- and middle-income Americans. A concerted effort by the Legislature and the Los Angeles City Council to make it as easy to start a business here as it is to move to Texas. Pope Francis to give the news media a break by preaching the occasional boring sermon. Rain. Lots of it. An overhaul of the federal tax code that broadens the tax base by winnowing the thicket of tax breaks, allowing lawmakers to lower rates without driving up the deficit. An end to the impasse between Time Warner Cable and other local pay-TV operators that kept Los Angeles Dodgers games off most of their fans TVs. The Supreme Court to stop hinting and issue a definitive ruling that bans on same-sex marriage violate the Constitutions guarantee of due process of law and equal protection of the laws. Critics of Obamacare to stop trying to repeal the law or render it unworkable through the courts. Instead, Republicans should use their newfound control of Congress to address the acts shortcomings and do more to slow the growth of healthcare costs. One bug that needs fixing right away: the lack of premium subsidies for those who have access to affordable individual policies at work, but not affordable family coverage. It would be especially gratifying  though probably unlikely  if Republicans would use their clout in general to govern responsibly rather than to engage in pointless confrontation with the president. Did we mention rain?, Funding in the state budget for the nascent earthquake early-warning system. Now that Congress has kicked in $5 million, its time for Sacramento to ante up. Los Angeles City Council races that are full of substance and bold ideas and that are so engaging that voters flock to the polls and the city can reverse its pitiful trend of low-turnout elections. Admittedly, this is a long shot, but after a 2013 mayors race that drew just 23% of registered voters, candidates need to do their part to persuade the electorate that these campaigns matter. A whole roster full of Clayton Kershaws. Congress to finally pass legislation to prohibit discrimination in private employment on the basis of sexual orientation and gender identity. College students who burn with righteousness indignation  which is to say, college students  to recognize that opposing views should be challenged, not censored. New regulations by the Federal Communications Commission that protect the open Internet from interference by broadband service providers, without discouraging the investments in broadband needed to meet the growing demands of an increasingly connected world. Snow. Metro and Caltrans to finally finish the last remnants of construction  the \"punch list\"  on the half-decade 405 Freeway project and liberate every onramp and offramp from intermittent closures. A spirit of innovation and cooperation among our four new elected county leaders to help meet the most daunting challenges that fall into the countys lap: homelessness, mental health, poverty, child abuse and neglect, health. And as they address those pressing problems, heres to hoping they also maintain the budget discipline that in recent years has distinguished the county from city government and left the county in a stronger fiscal position. Some aggressive critiquing of Los Angeles city government by Controller Ron Galperin. The cooperation among top city leaders is a welcome change from the customary sniping, but theres a place for scrutiny and oversight, and Galperins the person to carry out that job. A continuing drop in gasoline prices to allow people to put more money into the economy. Or, wait  an increase in gasoline prices to keep the incentive intact for developing cleaner fuels and encouraging businesses and residents to cluster in walkable, livable neighborhoods? We cant decide. Can we have both?, More support from TV networks for online alternatives to the ever-more-expensive offerings of cable and satellite TV operators. Hollywood to realize that not every movie has to be a sequel, a prequel or a knockoff. A new commitment to intelligent leadership at the Los Angeles Unified School District. As noted above, in 2014, members of the school board squabbled with their superintendent, John Deasy, and he ultimately left. That deprives the board and district of an intelligent and devoted leader, but also offers the opportunity for a fresh start. The board should make the most of it. President Obama to make good on his 6-year-old promise to close the detention center at Guantanamo. Weve wished for this before. Hope dies hard. Los Angeles to end veteran homelessness by 2016. Mayor Eric Garcetti pledged to find homes for the estimated 2,600 homeless veterans living within the city limits by the end of this year, as part of an Obama administration push to end veteran homelessness nationwide. This will require funding, private partnerships and a fully engaged Veterans Affairs Administration. Its an ambitious and worthy goal. The Los Angeles City Council to approve the mayors proposal for long-overdue mandatory retrofitting of thousands of soft-story wood buildings and brittle concrete ones that could suffer devastating destruction in a major earthquake. Airlines to get the message that diminishing legroom and shrinking seats are making travelers go crazy. Last year, at least three planes made unplanned landings after passengers got into fights over the ability to recline their seats. Its either more room or more fights. An end to the death penalty in the United States. This past year the nation saw the fewest executions in two decades amid persistent reports of the wrongly convicted being exonerated  there were seven such cases in 2014. With Californias death penalty on hold over two constitutional issues  the method of execution, and lengthy delays that a judge ruled make it too arbitrary to be legally applied  the state maintains the nations largest death row. The death penalty does not significantly deter violent crime, and it engages the government in the machinery of killing. Most modern nations have rejected it. Its time for the United States to do so as well. Follow the Opinion section on Twitter @latimesopinion]", "Date": "20150101", "Title": "[Our wishes for 2015]", "Link": "http://www.latimes.com/opinion/editorials/la-ed-new-year-wishes-20150101-story.html\n", "Author": "[The Times Editorial Board]"}
