{"Content": "[When he flies home from here Saturday, Jeb Bush can boast that his ripple-free trip to three European nations this week proved he is capable of striding without stumbling on a global stage. But that may not provide much political benefit to the former Florida governor when he launches his presidential campaign Monday in Miami. Republicans probably will remain skeptical of his conservative credentials, especially since he essentially endorsed President Obamas foreign policy on several major issues, including the conflict in Ukraine and the NATO security alliance. Bushs five-day trip to Germany, Poland and Estonia was an exercise in political caution and moderation. He called for a more robust American military presence in Eastern Europe but repeatedly declined to offer specifics. \"Look, Im here to learn  to listen and learn and get a better sense of all this,\" Bush told reporters in Berlin. \"I dont come to offer five-point plans.\", Most important, he avoided the kind of overseas blunders that tripped up Mitt Romney when he was the presumptive 2012 GOP nominee, and that hurt several rivals in this years large and growing Republican field. By that standard, Bushs trip can be judged a success, said Tom Rath, a New Hampshire GOP advisor and Bush family friend who is unaligned so far for 2016. \"These are trips where youre not supposed to make news,\" Rath said. \"Theyre basically flying photo ops, and the most important thing is to do no harm.\", Over the last six months, Bush has raised vast amounts of money for his campaign-in-waiting, and he still leads some polls. But he has failed to break away in a race that many had expected him to dominate from the start. Imagery from his European tour aligned with the persona his aides hope will resonate with voters, not just in the GOP nominating fight but beyond: sober-minded, steady-handed, a self-described policy wonk comfortable discussing world affairs. He made a few public appearances  speaking at a conference in Berlin, laying wreaths at revered sites around Warsaw, meeting cybersecurity experts in Tallinn. He also met privately with the presidents of Poland and Estonia, with the Bush name serving as a high-profile calling card and providing the instant credibility his lesser-known rivals lack. Although Bush has never served in federal office, he had a front-row seat to the presidencies of his father, President George H.W. Bush, and his older brother, President George W. Bush. In Europe, Bush publicly lauded his father, who turned 91 on Friday, as \"the greatest man alive.\" He never once brought up his brother, who is not highly regarded abroad. He and his wife, Columba, even played tourist at times, something his brother famously disdained. Still, Bush hasnt run for office since 2002, and he left the Florida governors mansion in 2007  and its clear after six months back in the public eye that he is still trying to get his sea legs. The starkest example was his stumbling, for several days last month, on what should have been a political softball question: whether, in retrospect, his brother was justified in starting the unpopular war with Iraq. Bush finally said no. On this trip at least, he stayed relentlessly on message  positive and temperate. He hopes to do the same when he takes the stage Monday at a community college in Miami. \"I hope the message will be a hopeful, optimistic one,\" he said here Friday. \"It wont dwell too much in the past. I will talk about why its important to change directions.\", Still, Bush said the trip \"hadnt changed\" his thinking about Americas role in the world, outlining a gauzy view that would fit into the mainstream of either party. \"We cant be all things to all people; we cant be the worlds policeman,\" he said in Warsaw. \"But we can be clear and consistent and engaged  politically and diplomatically and in terms of military, we need to be engaged.\", Bush followed the tradition that it is unseemly to criticize political opponents on foreign soil, offering only mild rebukes of the Obama administration. On Friday, he declined to overtly disparage Democratic presidential favorite Hillary Rodham Clinton. Even his put-down of Russian President Vladimir Putin as a \"bully\" echoed Obamas language. In June 2014, Obama said Russia had acted as a \"bully\" by imposing its \"will at the barrel of a gun\" in Ukraine. Part of Bushs trip was eclipsed back home by reports of a 1995 book he co-wrote, called \"Profiles in Character,\" that called for a return to public shaming to discourage out-of-wedlock births and other behavior he considered immoral or inappropriate. Its a ticklish topic for a party that says it champions \"family values\" but is bitterly divided over the publics growing support for same-sex marriage and other gay rights. Bush spoke carefully when he was asked about the book. \"My views have evolved over time, but my views about the importance of dads being involved in the lives of their children hasnt changed at all,\" he said. He also shrugged off reports of turmoil and squabbling on his staff after he replaced his campaign manager early in the week. With eight months before the first caucus and primary votes are cast, he took the long view. \"It doesnt really matter,\" Bush said in Berlin. \"Its June, for crying out loud, so weve got a long way to go.\", Politicians have been known to travel abroad to get away from their problems at home. To the extent Bush needed a whiff of fresh air and a chance to reset his campaign ahead of his kick-off speech in Miami, his overseas jaunt may prove just the political tonic he needed. seema.mehta@latimes.com, Twitter: @LATSeema, Times staff writer Mark Z. Barabak in San Francisco contributed to this report.]", "Date": "20150612", "Title": "[Jeb Bush makes it through Europe unscathed, if not more popular at home]", "Link": "http://www.latimes.com/nation/politics/la-na-jeb-bush-20150613-story.html\n", "Author": "[Seema Mehta]"}
