{"Content": "[For those of us who predicted the inevitable, watching Donald Trump verbally wander into a field of face-whacking garden rakes like Sideshow Bob fills one with a mixture of schadenfreude and affirmation. We knew it was coming, but it still feels good to be proven right. Of course Trump wouldnt hesitate to attack John McCains war-hero status. Trumps bottomless insecurity cannot countenance the idea that his critics have any legitimacy. Of course Trump wont apologize  because his dog-and-pony show is predicated on the idea that he \"tells it like it is\" and \"fights.\" Hes the omniscient master of \"The Apprentice.\" He cant behave like the Biggest Loser. The Trump squall is not over, alas. But its nonetheless obvious that we will someday soon look back on this as the beginning of the end of Trumpmania. The reason his demise is all so predictable is that personality eventually shines through. A few politicians are capable of hiding their truly unpleasant personal qualities, but it takes enormous effort, and sooner or later the mask slips. In general, what you see is what you get in politics, which is why the most successful politicians have personalities suited for the profession: They are basically likable; they can and want to connect with voters; they can act natural because they are natural politicians. Donald Trump, meanwhile, isnt even a politician. Hes a low-rent carnival barker who made it big on the high-rent circuit. An honest political consultant would put his fees in jeopardy by giving it to him straight: \"For the love of all that is holy, dont be yourself.\", Back in the real campaign, theres an interesting lesson in Trumps ineluctable fate. For months Ive argued that Jeb Bush is the weakest of the top-tier candidates to take on Hillary Rodham Clinton. When you have a competition between two brands, the better brand tends to win. The Clinton brand is simply much more popular than the Bush brand, for reasons we all know. And thats still true. But a brand is also strongest in the abstract. A Clinton may beat a Bush, but voters wont be asked to vote for \"a Clinton,\" theyll be asked to vote for a specific Clinton, namely Hillary. Jebs last name is a problem he can transcend by being himself. Hillarys last name is an asset she damages whenever shes herself. We saw something similar with John F. Kerry in 2004. People liked Kerry in the abstract  military veteran, long-serving senator, etc.  but as a person, not so much. His state poll numbers would often go down when he campaigned and go up when he went on vacation. Clinton is extremely popular when she is an abstraction. The polls show that the more voters see the real person, the less they like her  or trust her. Shes still an obvious favorite for the nomination, but its telling that the Clinton campaign is already trying to lower expectations for the New Hampshire primary and Iowa caucuses, suggesting that Bernie Sanders might win some early bouts. The point is that personality matters a lot, and no won would confuse Clintons personality as a secret weapon. Its been a cliche for three decades for Clintons defenders to say, \"If only you could know the Hillary I know.\" Thats an unintentionally damning defense. It may be true that shes a wonderful friend to her friends, but as a candidate, she is a remarkably uninspiring, un-charming and un-compelling woman who has every bit as much of a problem connecting to ordinary people as Mitt Romney did. Indeed, like Romney, she has polled poorly (June, CNN) on the question of whether she \"cares about people like you.\", In truth, Bush is not a contender for the role of \"the Most Interesting Man in the World\" in those Dos Equis commercials either. But he is showing himself to be a grown-up who is neither easily rattled nor interested in pandering to the crowd. He can get ahead of his family name in a way Clinton clearly cannot. Moreover, nearly all of the other GOP contenders have transparently better retail political skills than Clinton. Donald Trump stakes much of his fortune on the alleged value of the Trump brand. Hillary Clintons candidacy rests on a similar assumption about the Clinton name. Both fail to take into account the fact that personality trumps brand. jgoldberg@latimescolumnists.com, Follow the Opinion section on Twitter@latimesopinion and Facebook]", "Date": "20150721", "Title": "[The Trump lesson that Bush and Clinton should heed]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-goldberg-personality-trumps-brand-in-politics-20150721-column.html\n", "Author": "NULL"}
