{"Content": "[Hillary Rodham Clinton put early childhood education at the front of her agenda Monday, pledging that as president she would work to make preschool available and affordable for every American child. Clinton, who started her career as an advocate for the Childrens Defense Fund, has long lobbied for expanding the availability of child care and preschool. At a day-care center here, she outlined proposals, including a substantial boost in federal spending to help cover the cost of schooling for 4-year-olds from low-income families. In backing expanded preschool, Clinton is advocating a policy that is popular with liberal Democrats even though some experts warn that the benefits have been oversold. President Obama rolled out a similar proposal in 2013, and Clinton said she would build on that plan if voters sent her to the White House. \"Its time we realize once and for all that investing in our children is one of the best investments our country can make,\" Clinton said, according to a transcript of her remarks released by the campaign. The event was partially closed to reporters. \"Its hard enough to pay for any preschool or child care at all, let alone the quality programs that help kids develop and flourish. Funding for these opportunities has not kept up with changing times and rising demand.\", In addition to its attraction to the liberal voters Clinton is wooing in the Democratic primaries, expanding preschool potentially has bipartisan appeal. Many states that have taken the lead in funding universal preschool have Republican governors, with Oklahoma being one of the most cited nationally. That state is \"about as red a state as you can get,\" Clinton said. \"But they have figured it out, the government and business leaders and families  that this is a smart investment for them.\", As she praised GOP governors who have expanded such programs, Clinton took a swipe at congressional Republicans who have defeated proposals for expanding federal support. \"Republicans arent just missing the boat on early childhood education, theyre trying to sink it,\" she said. \"Their budget puts at risk one of the most effective investments for our youngest children, Early Head Start.\", In their budget, \"the Republicans took care of those at the top and went after the kids,\" she said. Like Obama, Clinton pointed to research she says concludes preschool has long-enduring benefits. \"Most of us kind of intuitively have known that, but now research is telling us how much early learning in the first five years of life can impact lifelong success,\" she said. Experts are divided on how much such programs really give children a lasting jump-start in learning. Obamas claim, for example, that every dollar spent on high-quality early education would \"save more than $7 later on\" was dismissed by Russ Whitehurst, director of the Brown Center for Education Policy at Washingtons Brookings Institution. During a congressional hearing last year, he advised lawmakers when they hear that number to \"swallow with a grain of salt, or not at all.\", Whitehurst, a former Head Start official who generally supports preschool, said in a blog post that supporters of the Obama program, \"including some academics who are way out in front of what the evidence says and know it, have turned a blind eye to the mixed and conflicting nature of research findings on the impact of pre-K for 4-year-olds.\", Studies that have shown a positive effect from the publicly funded efforts generally involve intensive, committed programs that are hard to duplicate on a mass scale, skeptics say. Studies of recent efforts to expand preschool more broadly have shown some results that disappointed advocates. In some cases, the programs are simply too new to substantiate supporters claims that graduates are more likely to finish high school and be employed later in life. In other cases, the benefits of preschool appear to wear off quickly. Clinton frames the issue as one of common sense. She talks frequently on the campaign trail about working parents she meets who dont have access to high-quality programs for their children. On Monday, the parents she cited as an example were the nurses who helped deliver her granddaughter, Charlotte Clinton Mezvinsky. In some cases, she noted, a nurturing early childhood program can cost more than college. evan.halper@latimes.com]", "Date": "20150615", "Title": "[Hillary Clinton calls for preschool for all children]", "Link": "http://www.latimes.com/nation/la-na-clinton-preschool-20150616-story.html\n", "Author": "[Evan Halper]"}
