{"Content": "[When it comes to Californias roller-coaster finances, Gov. Jerry Brown has bent lawmakers and voters to his will, rejecting new spending programs, passing a temporary tax hike and strengthening the states rainy-day fund. But now a series of tax-related proposals, some backed by powerful interest groups or a rich benefactor, could loosen his tight grip on the budget. Unions and grass-roots organizers are considering an effort to, over Browns objections, extend the higher taxes that the governor persuaded voters to go along with in 2012. They are also pondering a proposal to alter the states landmark restrictions on property taxes, to raise more revenue from commercial interests. In addition, billionaire environmentalist Tom Steyer is laying the groundwork for a possible oil extraction tax, medical groups want to raise the levy on cigarettes, and Sen. Bob Hertzberg (D-Van Nuys) is crafting a controversial bid to overhaul the state tax code. The proposals are not aimed at rescuing California from financial disaster  in fact, revenue is surging with the rebounding economy and strong stock market. Rather, they are attempts to gain new funding, press a political agenda or shield against a future recession. \"Now is the time to be bold,\" Hertzberg said. \"Now is the time to figure out the fix. Lets not have another crisis.\", Since taking office in 2011, Brown has been able to avoid any tax hikes he didnt propose. Measures that would have raised tobacco taxes and created new levies on bullets, soda and even strip clubs have died in the Legislature. Although Hertzbergs bill could meet the same fate, a number of the other proposals could end up on the November 2016 ballot if supporters gather enough petition signatures, allowing them to sidestep Browns veto pen and leaving the issue in voters mercurial hands. Tax hikes are usually a tough sell at the ballot box. But next year there will be a presidential election, when more voters typically turn out, especially those who are young, minorities or low-income, and could benefit most from additional government spending. If you want to raise taxes, \"you have one chance every four years,\" said Mark Baldassare, president of the Public Policy Institute of California. Anthony Thigpenn, president of California Calls, a group that advocates for low-income families, cautioned against stuffing the ballot with tax proposals. \"Voters will be overwhelmed and confused and just say no to anything,\" he said. \"Or they compete against each other, and siphon support away so none of them are able to succeed.\", Advocates for the various tax causes are already conducting focus groups, polling voters and tweaking the details of their potential proposals. Brown, who did not include any tax changes in the updated budget plans he released this month, has largely declined to comment on their efforts. \"Im not going to opine on proposals that are just beginning to be formulated,\" he said at the California Democratic Partys recent convention in Anaheim. However, he has publicly opposed an extension of Proposition 30, the 2012 measure that temporarily increased the sales tax by a quarter-cent and raised levies on high earners. Its scheduled to expire in two parts  the higher sales tax at the end of next year and the higher income tax at the end of 2018. Brown is \"not going to break faith with the voters on that,\" Nancy McFadden, a top advisor to the governor, said last year. The revenue boost was pitched to voters as being necessary to pull the state out of its persistent budget crises. But unions and other advocates are unnerved by the prospect of state income slipping away. \"Wed go back to seeing cuts,\" said Estelle Lemieux, a lobbyist for the California Teachers Assn. Although the powerful teachers union is typically allied with Brown, its members are nevertheless discussing a possible extension proposal. Lemieux said a final decision could be made in the next few months. Analysts said that continuing Proposition 30 could be difficult without the governors support. In addition, state finances are healthier. When its time to cast ballots, said Aaron McLear, a Republican strategist who worked against Proposition 30 in 2012, there will probably be \"a giant surplus, a balanced budget and a rainy-day fund. It would be very difficult to convince [voters] that we need more money.\", The other major union-backed measure under consideration would modify Proposition 13, the landmark restriction on property taxes that voters passed in 1978, to impose higher levies on commercial buildings with more frequent reassessments of their value. Supporters of the idea said it would raise $9 billion a year for local governments and schools. Proposition 13, long the third rail of California politics, represents a contentious time in Browns first two terms as governor, from 1975 to 1983. He has expressed regret for not offering an alternative plan that might have prevented the measure from passing, but he has also called it a \"sacred doctrine that should never be questioned.\", A battle over the issue would surely be expensive, with business interests able to mount a sizable opposition effort. Rex Hime, president of the California Business Properties Assn. has said such a fight would be \"Armageddon.\", Other potential measures could also attract big money. Steyer is considering a bid to create a 10% tax on oil extraction, which his organization, NextGen Climate, says could provide up to $2 billion for higher education. If he pushed forward with a campaign, he wouldnt be the first rich donor to give it a try. Hollywood producer Steve Bing provided most of the $60 million for a 2006 ballot measure, which was defeated after oil companies spent $90 million in opposition and raised the specter of higher gas prices. Its unclear how much Steyer would be willing to spend. He put $74 million behind candidates around the country last year. Tobacco companies would certainly spend heavily to stop a $2-per-pack increase in cigarette taxes, if such a proposal failed in the Legislature this year and landed on the ballot. Voters rejected a similar measure in June 2012, but advocates want to give it another try in order to restore some money to public healthcare that was lost during the recession. \"We view this initiative as a wonderful opportunity to reduce smoking in California and at the same time bolster healthcare services,\" said Dustin Corcoran, executive director of the California Medical Assn. which lobbies for doctors. In his own legislation, Hertzberg is taking aim at the states notoriously volatile finances. In recent years, the budget has drawn about half of its income tax revenue from the top 1% of earners, whose income is unpredictable because they rely heavily on stock market performance. Although Hertzberg is still drafting his proposal, he has expressed interest in applying the sales tax to services and weaning the state off its dependence on income taxes. Brown has been skeptical because proposals to stabilize revenue collection generally involve requiring people who make less money to pay a greater share of the taxes  a tough sell in a largely Democratic state. \"I dont know from the political point of view thats very viable,\" Brown said. Hertzberg is undeterred. \"Were still working out the details,\" he said. chris.megerian@latimes.com, Twitter: @chrismegerian]", "Date": "20150525", "Title": "[Tax proposals by unions, activists may loosen Brown's grip on budget ]", "Link": "http://www.latimes.com/local/politics/la-me-pol-state-taxes-20150526-story.html\n", "Author": "[Chris Megerian]"}
