{"Content": "[\"Kevin, Kevin, come see us!\" yelled a man pushing a stroller. \"Yo, K.J. stop by the community garden!\" urged a friend from the old neighborhood. Sacramento Mayor Kevin Johnson beamed as he walked through the heart of Oak Park, a long-struggling community now in the middle of a renaissance, thanks in large part to him. Once home to gangsters, addicts and the local Black Panthers, it now has new condos, cafes, a bookstore and an art gallery. A brew pub is being built; a historic theater has been restored. \"This work is what makes me proudest,\" said Johnson, 48, scanning the neighborhood to point at the highlights. It was in Oak Park that Johnson had his first taste of celebrity, leading the state in scoring for Sacramento High Schools basketball team. His star grew brighter when he played basketball at UC Berkeley and then in the NBA. Today hes back home, where he is the citys first African American mayor. His popularity has soared  even his critics acknowledge that  since the biggest political coup of his career: his successful effort last year to keep the Sacramento Kings basketball team from leaving town. This year, he pushed through approval for a new basketball arena. He also took over as head of the U.S. Conference of Mayors and became a spokesman for the NBA players union as the league drew up its response to Clippers owner Donald Sterlings racially charged comments. \"I hope that every bigot in this country sees what happened to Mr. Sterling and recognizes that if he can fall, so can you!\" said Johnson as his image was beamed across the nation from the steps of Los Angeles City Hall shortly after the NBA banned Sterling for life. That triumphant moment also elevated his political standing across California, where he is among a number of younger-generation Democrats widely discussed as prospective candidates for governor and the U.S. Senate. A jump to higher office would not be easy, though. For all his newfound political celebrity, Johnson is not the typical Democrat who wins statewide elections. Hes a corporate-friendly, pro-business centrist who has fought teachers unions and tax increases. There would also be the past to beat back: the taint of old scandal and allegations of sexual impropriety. But he has defied expectations before. ::, Born to a 16-year-old schoolgirl, Johnson was 3 when his father drowned in the Sacramento River. Since his mother wasnt ready for the responsibility, he ended up being raised by his maternal grandparents, George and Georgia Peat, who were among the few whites in a predominantly African American neighborhood. His grandparents taught him to be opened-minded when it comes to race, Johnson said. And nobody had more to do with the man he would become than his grandfather, a sheet-metal worker who rose each workday at 4:30 a.m. and always had a soft spot for the underdog. \"You know in the Bible, the good Samaritan? My grandfather was a modern-day version of that,\" Johnson said. \"I want to follow those footsteps.\", After graduating from high school in 1983, he headed to Cal. He found instant success on the basketball court but had trouble keeping up in the classroom. He channeled his grandfathers work ethic, becoming a regular at the library as well as the gym. One of the biggest sports stars in school history, he steered away from the campus social scene, surrounding himself instead with studious friends who werent athletes. He is a devout Christian, and his two closest confidants in college were a prayerful Somali Muslim and a roommate who was an observant Jew. Theyd often stay up late, their study sessions turning into long talks about faith and solving the worlds problems. The 6-foot-1 Johnson was the seventh pick in the 1987 NBA draft. He would become an All-Star whose determined aggression led to a famous dunk over Hakeem Olajuwon and an ejection from a game after a shoving match with Magic Johnson. Off the court he was a do-gooder, so controlled that he didnt drink, smoke or curse, so eager to give back that President George H.W. Bush honored him as one of the nations \"thousand points of light.\", After retiring from the NBA in 2000, he had a range of options: broadcasting, coaching, even running for office in Arizona, where both Democrats and Republicans wooed him. Instead he returned to Sacramento and focused on building up Oak Park. \"It just grabbed me, this idea that something had to be done to help my community,\" Johnson said, standing outside the single-story, three-bedroom home where he was raised. A pit bull barked nearby. A homeless couple guided a shopping cart down the street. \"My history is here.\", ::, Sacramentos mayor has rarely touched a basketball since leaving the NBA. The last time he did, three years ago on his 45th birthday, he quit after clanking a ball off a rim while trying to prove he could still dunk. The old spring in his legs may be gone, but he still retains a bit of the liquid strut common to professional athletes, a walk on full display as he toured Oak Park, excitedly describing life after returning home. He expanded St. HOPE Academy, the after-school program he started during his playing career with 12 kids  because Jesus had 12 disciples. Then, under his direction, St. HOPEs real estate development arm became the first in years to bet big on Oak Park, one of the citys poorest neighborhoods. Dressed in a sharp brown suit on a 90-degree day, Johnson walked past a dog collar boutique. A woman inside came out to chat. A disabled man in a wheelchair asked for help; not surprisingly, he was a familiar face to the mayor, who slipped a $20 bill into the mans hand. Down the street was his old high school. Johnson led a bruising fight in 2003 to push out the unionized teaching staff at \"Sac High\" because he was convinced that poor-quality public education was holding back waves of kids. St. HOPE took over. Now called Sacramento Charter High School, it has about half the number of students and dramatically higher test scores, arguably making it one of the best inner-city campuses in California. After his success in Oak Park, Johnson decided to make a bid for City Hall. Energized by Barack Obamas candidacy for president, he ran for mayor in 2008. The race was as heated and sensational as Sacramento has ever had. Unionized teachers, still smarting from the charter school battle, were harsh critics. The other candidates blasted Johnson for his political inexperience and worse. They chastised him for a string of code violations issued to properties he owned in Oak Park. They called voters attention to a federal inspector generals report that said St. HOPE had misused $847,700 in grant money meant for an inner-city program. The nonprofit was forced to return roughly half. Early in the campaign, the Sacramento Bee detailed a draft agreement that had Johnson paying a $230,000 settlement to a 16-year-old Phoenix girl he had mentored in the mid-1990s. Shed told police he fondled her. Hed denied it. The inspector general report had cited other allegations of sexual misconduct. One case alleged that Johnson had inappropriately touched a senior at the high school. Though the girl later denied the story, the federal report detailed similar allegations about advances toward two young women involved in the inner-city program. Investigations were conducted in Sacramento and Phoenix. No charges were filed. Johnson survived the onslaught, handily beating incumbent Heather Fargo in a runoff. He recently called the allegations \"old news with no merit.\", \"Politics is a dirty business, I understand that,\" he said. \"Its all I have to say.\", ::, Johnsons first four-year term was rocky. Sacramento, population 470,000, retains a small-town sensibility. In a framework set up during Prohibition, the city manager has more control than the mayor, whose vote counts the same as a City Council member. Johnson believed the election had been a mandate for him to remake Sacramento, and he angered many who were resistant to change. Critics were particularly put off when he proposed a referendum that would have given the mayor more executive power. A judge blocked it from the ballot. The new mayor was labeled imperious and power-hungry, and he was derisively called \"Boss Johnson.\", Looking back now, Johnson seemed chastened. \"I was just full of energy and wanted to just get things done. I was going 100 miles an hour,\" he said. \"I had to learn that in politics, it does not work like it does in sports.\", In 2011, after a bicoastal romance, he married Michelle Rhee, the former chancellor of public schools in Washington, D.C. and one of the more polarizing figures in the national debate over education reform. Rhee had made a name for herself with her efforts to limit union influence and her embrace of student test scores to measure teacher performance. As the mayor ran for another term in 2012, his marriage only reinforced the teachers unions opposition. Still, he won easily and his fortunes began to shift. The economy began to rebound and crime was falling. Luminaries including LeBron James, U.S. Secretary of Education Arne Duncan and chef Alice Waters came to Sacramento at Johnsons behest, partly to back his school reform and economic development work, and partly because Johnson is intent on bringing celebrity glitz to his hometown. He solidified support from the citys business elite with his stance against raising taxes and his willingness to make it easier for businesses like Wal-Mart to open mega-stores. \"We love the guy,\" said Roger Niello, a former Republican assemblyman and president of Sacramentos Metro Chamber of Commerce. \"He appeals to a broad range here. Frankly, with his views on business, hes a Democrat people on the right can get behind.\", Johnsons biggest success involved the Sacramento Kings, whose owners stunned the city last year by announcing they had sold the team to a group including the Clippers new owner, Microsoft billionaire Steve Ballmer, who planned to move the franchise to Seattle. The ownership transfer seemed like a done deal. But Johnson dug in. He put together a group of potential buyers led by Silicon Valley software magnate Vivek Ranadive. Sacramento developer Mark Friedman, part of Ranadives group, flew to Dallas with Johnson, who was going to make a final pitch to the NBA. Friedman was awed by Johnsons command of the issue, by his charisma and how he held sway when he stood before the leagues owners, emphasizing his citys deep connection with the team. \"Star power,\" Friedman recalled. \"Sacramento has it for the first time with him.\", Johnsons pitch beat Ballmers; the Kings stayed. In May, between cross-country trips for the mayors conference and the Sterling scandal, Johnson presided over a tense public meeting at City Hall. The council was considering a proposal he hailed as key to boosting the local economy: spending $255 million in public money  more than half the total cost  to build a basketball arena. When the deal was approved, the reception from the crowd was like a moment from the former point guards playing days. A standing-room-only audience rose to chant: \"Kevin Johnson, Kevin Johnson!\" The mayor leaped to his feet, clenched his fists and began doling out high-fives. ::, Its hard to say whether the past, particularly the sexual allegations, will haunt Johnson should he seek higher office. \"When a politician survives an attack like we put on him, it goes a long way to putting to rest the problem,\" said Mike Madrid, a conservative consultant who worked in 2008 on a series of aggressive anti-Johnson campaign ads. \"We threw everything at the guy we had, but he won.\", If the mayors reputation among Sacramento Democrats is any indication, he cant count on widespread support from progressives in a statewide election. Organized labor has extended its support warily. Johnson remains vilified by the city and statewide teachers unions. The Democratic Party of Sacramento County has never endorsed him, grumbling that he spends too much time hobnobbing out of town, that hes too close to corporations and that he gambled the citys fiscal health by spending millions on the basketball arena. In November, Sacramento voters will have a chance to consider the latest Johnson-backed proposal to give Sacramento mayors more power. Many observers believe that if the initiative wins, hell aim for a third and final term in 2016. He hasnt said so yet. Asked if he has designs on running for Congress, perhaps as a successor to Democratic Sens. Dianne Feinstein or Barbara Boxer, he answered firmly: \"Not interested.\", \"Not my personality,\" he said. \"Theyre legislators, and I would rather be an executive. Ive been fighting for six years to change governance in Sacramento so you can finally be an executive. I want the buck to stop somewhere and be held accountable.\", So what about governor?, Here, his eyes lighted up. Johnson said that when he thinks of holding the states highest office, he thinks first of changing the education system. The prospect excited him. \"But for now,\" he said, smiling broadly, \"Im happy where I am.\", kurt.streeter@latimes.comTwitter: @kurtstreeter]", "Date": "20141004", "Title": "[Ex-basketball star Kevin Johnson is back holding court in his hometown]", "Link": "http://www.latimes.com/local/politics/la-me-mayor-kevin-johnson-20141005-story.html", "Author": "[Kurt Streeter]"}