{"Content": "[With the rise of Islamic State extremists and growing instability overseas, national security is taking on greater prominence in the 2016 presidential race, theoretically giving Republicans an edge on an issue they have traditionally dominated. But as GOP presidential hopefuls try to appeal to their conservative base with familiar calls for a muscular military posture and increased Pentagon spending, the party is struggling to articulate a coherent message that strikes a contrast to President Obamas without alienating a war-weary populace or widening internal GOP divisions. Even more problematic, Democratic candidate Hillary Rodham Clinton presents an unusually formidable challenger for the ever-expanding list of Republicans: Most of them have thin resumes on national security compared with a former secretary of State already viewed by many in her own party as somewhat hawkish. The increasingly aggressive national security stance of Republican candidates was on full display this week, for example in former Florida Gov. Jeb Bushs misstep over questions about whether he would have invaded Iraq in 2003, and in Florida Sen. Marco Rubios policy speech Wednesday, which was long on promises but short on specific policies. In many ways, Republicans should welcome a discussion on national security, particularly because they are the party that voters frequently have depended upon to confront Americas enemies. At the same time, the U.S. economy, as a campaign issue, has slipped as a top concern among many voters amid an improving job market. Polls show that for Republican voters, national security ranks higher than pocketbook issues. Theres no doubt national security has risen on the most-important-issues list, said Whit Ayres, a Republican strategist who has worked with Rubios campaign. Its very clear that America wants a more muscular foreign policy than it has seen in the Obama years, and thats particularly true of Republican voters. But as Jeb Bush discovered, the issue is not as straightforward as it once was. President George W. Bushs prolonged wars in Iraq and Afghanistan heavily tarnished Republicans reputation on national security and foreign affairs. Despite lingering disapproval over the Iraq war, Jeb Bush said this week that even with the benefit of hindsight, he would have launched the 2003 invasion. Predictably, Democrats pounced, but so did many conservatives. There has to be something wrong with you. You cant think going into Iraq  as a sane human being, was the right thing to do, conservative radio host Laura Ingraham said. Its a sneak peek as to what Jeb is going to face come the general election should he win the nomination. Chris Christie, the New Jersey governor who, like Bush, has yet to officially announce his candidacy for the Republican nomination, piled on. I dont think you can honestly say that if we knew then that there were no [weapons of mass destruction], that the country should have gone to war, he told CNN. A spokesman for the Democratic National Committee, Mo Elleithee, simply said, Hes joking, right?, When asked his position, Rubio said, Not only would I not have been in favor of it, but President Bush would not have been in favor of it. Jeb Bush tried to walk back his remarks, saying he had misunderstood the question. But when offered another chance to answer the question, he seemed to make matters worse, saying he wasnt sure what he would have done in such a hypothetical. On Wednesday in Nevada, he suggested that even asking such a question was a disservice to those killed in the conflict. Bush isnt the only presidential hopeful struggling on national security. Sen. Rand Paul (R-Ky.) has been trying to downplay his previous image as an isolationist, which had put him at odds with an increasing number of Republican voters as well as the hawkish wing of his party. The divide was on display last month in Congress when Rubio and Paul squared off over defense spending in the annual budget. Rubio led efforts to increase Pentagon spending, but Paul and another presidential contender, Sen. Ted Cruz (R-Texas), voted against the bill, saying the military funding should have been offset by cuts elsewhere. Defense hawks won that battle against deficit hawks, perhaps a reflection of rising voter interest in a beefed-up national security stance. Hoping to burnish his military credentials, Paul staged a recent foreign policy address in front of the aircraft carrier Yorktown in South Carolina. Wisconsins Republican Gov. Scott Walker, meanwhile, has tried to increase his international experience with trips to Britain and Israel. Rubio, who claims to have more foreign policy experience than other candidates as a member of the Senate Foreign Relations Committee, displayed familiar Republican tough talk during his national security speech. American strength is a means of preventing war, not promoting it, he said at the Council on Foreign Relations in New York. Rubio portrayed himself as influenced by Presidents Kennedy and Reagan to set forth a doctrine for the exercise of American influence in the world, including protecting U.S. economic interests in a globally connected marketplace. I will use American power to oppose any violations of international waters, airspace, cyberspace or outer space, he said. This includes the economic disruption caused when one country invades another, as well as the chaos caused by disruptions in choke points, Rubio said, adding that any nation that attempts to block global commerce will know to expect a response from my administration. Rubio called Clinton a leader from yesterday whose tenure as secretary of State was ineffective at best and dangerously negligent at worst. But attacks against Democrats as too soft may not be enough, analysts say. To convince voters, Republican candidates will need to offer viable alternatives. Although public opinion of Obamas handling of national security hit a low point last year, polls show most Americans agree with his reluctance to commit U.S. military forces abroad and his willingness to engage in diplomacy, such as talks to rein in Irans nuclear program. Even though Americans have heightened national security concerns, Im not sure theyre ready to go back to this George W. Bush approach, said Brian Katulis, a national security analyst at the left-leaning Center for American Progress. A lot of Americans think: Been there, done that, he said. There is this deep chagrin and regret over all that was lost and squandered, especially after the Iraq war  even among those centrist, pragmatic Republicans, no matter what the polling says. For the latest from Congress follow @LisaMascaro. 4:56 p.m.: Updated throughout. This story was first published at 4 a.m.]", "Date": "20150513", "Title": "[As voters fret over national security, GOP candidates seek right message]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-republicans-national-security-20150513-story.html\n", "Author": "[Lisa Mascaro]"}
