{"Content": "[Rep. Xavier Becerra (D-Los Angeles) had a short California history lesson that doubled as a warning for the 15 Republican presidential candidates set to spar in a pair of debates Wednesday nightat the Ronald Reagan Presidential Library and Museum. \"[California] is the state of [Former Governor] Pete Wilson, who made the major mistake of personalizing the issue of immigration for so many of us and has made it possible for our state to become so blue,\" Becerra, chairman of the House Democratic caucus, said in a conference call with reporters Tuesday. Wilson rode to reelection in 1994 as the main proponent of Proposition 187, the notorious and successful 1994 ballot measure intended to deny public services to immigrants in the country illegally. The initiative was later ruled unconstitutional but not before it drove a generation of Latinos to the ballot box. Get more national political newsand the latest from Campaign 2016 >>, Becerra said Donald Trump needs to walk back from incendiaryremarks aboutMexican immigrants coming to the United States. \"If something is personal to you you are much more likely to act,\" saidBecerra, the son of Mexican immigrants. \"More and more, Republicans are making this presidential election personal for Latinos.\", He added he was surprised Trump not only remains at the top of the pack but alsois setting the tone for how the whole slate of candidates talks about immigration and Latinos. \"It stings but if you are smart you will let that sting teach you a lesson ... so that sting doesnt come back again,\" Becerrasaid. \"If you didnt like what Donald Trump said make sure he cant say it again after [election day] 2016.\", MORE POLITICAL NEWS:, Trumps the target for the showdown in Simi Valley, State politicians grab at Trumps coattails, seeking reflected attention, Debate primer: Nine things you didnt know about Simi Valley]", "Date": "20150916", "Title": "[Top Latino lawmaker has a warning for Trump, other Republicans]", "Link": "http://www.latimes.com/politics/la-pol-ca-becerra-warns-trump-story.html\n", "Author": "[Javier Panzar ]"}
