{"Content": "[Of all the contenders gearing up for the 2016 U.S. presidential election, only one can claim his own piata at the Hidalgo Market here. Donald Trumps papier mache likeness sells for $12 to $18, depending on the quality and details. The piatas typically feature a sweep of blond hair and a mouth frozen open. \"People have been asking for him a lot,\" said Esther Garca, a saleswoman at Dulcera Conchita, one of half a dozen piata and candy shops at the traditional market near the citys Ro Zone. Then she added: \"I dont like him.\", Vendors across the city have been capitalizing on the wave of animosity Trump engendered with remarks last month characterizing Mexican immigrants as rapists who bring drugs and crime to the U.S. Although Minnie Mouse, Spider-Man and Minions piatas remain popular for kids birthday parties, Trump effigies are drawing a different clientele: grown-ups. Many of Martn Saenzs clients at Dulcera El Chato are from north of the border. \"Sometimes, they say they want to grab him, before even buying,\" he said. Saenz makes the shops big-eyed piatas in his spare time and has crafted about 50 Trump likenesses since the Republican candidates controversial comments. But not everyone wants a smashable Trump. Shopper Edwin Ros Rubio said he had no interest in buying a Trump piata. \"He denigrates Mexicans and seems very despotic,\" said the 29-year-old merchant from Baja California Sur. \"Hes a racist. I wouldnt even buy one as a joke.\", Trump is by no means the first political figure to be portrayed in a piata. Mexican protesters for years have used the figures to lampoon their countrys politicians. And a few piata makers have been creating likenesses of drug cartel leader Joaquin \"El Chapo\" Guzmn since his escape this month from a Mexican prison. sandra.dibble@sduniontribune.com, Twitter:@sandradibble]", "Date": "20150729", "Title": "[Donald Trump piatas are a smash hit in Tijuana]", "Link": "http://www.latimes.com/local/california/la-me-0729-pinata-20150729-story.html\n", "Author": "NULL"}
