{"Content": "[Jeb Bush may be the establishment favorite for the Republican presidential nomination, but he still has a lot of work to do to persuade GOP voters to back him, a new poll finds. By contrast, Democrats seem overwhelmingly willing to support Hillary Rodham Clinton as their partys nominee, despite unhappiness on the part of some liberal activists and the current controversy over her use of a personal email account while she was secretary of State. The Wall Street Journal/NBC News poll, released Monday, found that 49% of likely Republican primary voters said they could see supporting Bush, the former governor of Florida, while 42% said they could not. Two of Bushs rivals, Sen. Marco Rubio of Florida and Gov. Scott Walker of Wisconsin, were more widely acceptable. Just over half (53%) of people who expect to vote in the GOP primaries said they could see backing Walker, compared with only 17% who said they could not. Rubio drew a similarly one-sided response, 56% to 26%. By contrast, the poll delivered harsh news to New Jersey Gov. Chris Christie: 57% of the likely GOP voters said they could not see supporting him, compared with 32% who said they could. Of 14 GOP figures polled, the only one who did worse than Christie was Donald Trump, the developer and casino owner, whose occasional declarations that he plans to run are usually dismissed as self-promotional stunts. Among other major GOP figures, former Texas Gov. Rick Perry and Kentucky Sen. Rand Paul had ratings similar to Bushs. On the Democratic side, 86% of likely primary voters said they could see supporting Clinton. The poll was conducted Sunday to Thursday of last week, as the controversy over her email use began to bubble. Voters overall had a positive image of Clinton, with 44% viewing her favorably and 36% negatively. Bush is less well known, with 23% seeing him positively and 34% negatively. The poll does point to one significant area of potential weakness for Clinton: By 51% to 44%, voters overall said she would represent \"a return to policies of the past\" rather than \"new ideas and vision for the future.\", That could be a liability at a time when 59% of voters say they would prefer to see a candidate \"who will bring greater changes\" than one who is \"more experienced and tested.\", But Clintons liability on that question is notably less than Bushs. In his case, 60% see him as representing the past, and 27% say he would represent the future. The poll, conducted by a team of pollsters from each party, Bill McInturff from the GOP and Fred Yang from the Democrats, has a margin of error of plus or minus 3.1 percentage points for the full sample. For more on politics and policy, follow@DavidLauter on Twitter.]", "Date": "20150309", "Title": "[2016 Republican race up for grabs, Democrats back Clinton, poll finds]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-nbc-wsj-poll-2016-clinton-20150309-story.html\n", "Author": "[David Lauter]"}
