{"Content": "[In this, the latest installment of the Veterans Kitchen Chronicles, Im happy to report that theres been some progress, although its way too soon to pull out the party hats. CalVet officials now tell me they think they can build a second kitchen in the West Los Angeles Veterans Home by next fall, improving on an earlier estimate of early 2016. Youll recall that the home, completed four years ago, sits half-empty because the kitchen is too small to feed more than 200 residents. Meanwhile, 297 vets are on a waiting list for long-term care. \"Now we have a finish line, and that finish line is October of 2015,\" said CalVet Secretary Peter J. Gravett, who didnt take office until after the kitchen fiasco had begun. \"I can tell you that by January 2016 well be admitting residents.\", Im putting it on my calendar, but Im not holding my breath. In my last column on the subject, I reported that state legislators were more than a little ticked off about the snails pace of the project after freeing up $770,000 in July to get things moving. But Gravett told me Thursday that the money is in fact \"going to allow us to speed up construction of the kitchen by six months.\", Speed, as you know, is a relative term. But as Gravett tells it, the economic crash several years ago, government cuts and the fact that CalVet had several other state homes to run made it difficult to resolve the kitchen issues. Plus, he said, its not as if CalVet hasnt made any progress. Several dozen of the empty beds have been given over temporarily to formerly homeless vets in the West L.A. home. If thats not a very satisfying explanation for the mess, its about as good as any Ive managed to get about why the home was built without an adequate kitchen in the first place. CalVet officials have been telling me their federal counterparts had agreed to provide food services at the $253-million state home but backed out at the last minute, and by 2011, efforts at a resolution had failed. But on Friday, I got ahold of Jeff Blake, a spokesman for the federal VA, who cast the problem in different terms. He said the plan got derailed when the state, in the midst of a budget impasse, couldnt guarantee payment to the feds for the meals, so officials for both agencies \"mutually\" decided to terminate the food agreement. The only thing thats perfectly clear from all this is that theres no bureaucracy like veterans affairs bureaucracies. And in the case of the Kitchen Chronicles, weve got a double dose, with a state CalVet home on federal VA land that has been the subject of controversy for years. \"Ive never seen an organization so weighted down by its own bureaucratic inertia in all my life,\" said L.A. County Supervisor Zev Yaroslavsky. Thats saying a lot, given that it comes from the representative of a county government that no one could accuse of award-winning efficiency. Now look, I understand the whole thing about different pots of money that can or cant be used for this or that. But in 2010, the U.S. military had a $683-billion budget and spent $171 billion on the wars in Iraq and Afghanistan, and the federal Department of Veterans Affairs had a $112-billion budget. Couldnt the feds have scraped together the money to either deliver a few meals to hungry veterans or build the kitchen on a layaway plan, with the state paying up when it was able? Its not as if the feds havent been flexible with other occupants of their 387-acre West L.A. campus. Two weeks ago, the Government Accountability Office ripped the West L.A. VA for mismanaging its property, improperly diverting funds and under-billing clients, leaving potentially millions of dollars uncollected. In one case, a private laundry service was allowed to stay on the property despite having missed payments totaling $300,000. Last year, you may recall, a federal judge slapped the VA for issuing commercial leases on the campus that were \"totally divorced from the provision of healthcare.\" And in 2012, a VA accountant pleaded guilty to theft in connection with a $681,000 embezzlement. That money alone could nearly have paid for the kitchen. \"By and large the people in the system are good people, and the vast majority of them are attracted to the mission and come with great intentions,\" said Dr. Jon Sherin, who once ran mental health operations on the West L.A. VA campus and is now executive vice president of veterans affairs for the nonprofit Volunteers of America. \"But the systems are so inefficient and misaligned and disconnected from their ultimate goal, which is to help people in the trenches.\", Sherin said he thinks the entire under-utilized West L.A. campus, including the CalVet home, should be re-imagined as a far more robust, full-service medical, residential and vocational recovery center to meet veteran needs that will only grow, given the seemingly endless conflicts in the Middle East. Sounds like a grand and ambitious vision. But knowing how slowly the wheels grind, Id settle for a kitchen by next fall. steve.lopez@latimes.com]", "Date": "20140927", "Title": "[Finally stirred to action in the Veterans Kitchen Chronicles]", "Link": "http://www.latimes.com/local/la-me-0928-lopez-va-20140928-column.html\n", "Author": "NULL"}
