{"Content": "[Assemblyman Rocky Chavez, a Republican from Oceanside, announced Tuesday that he is forming afund-raising committee to explore a run for the U.S. Senate seat being vacated by Barbara Boxer. The creation of a committee is the first formal step a candidate takes in such a race. Chavez is the best-known Republican to have done so in the Senate contest. \"Our nation suffers from a lack of clear leadership when it comes to issues of national security and looking out for California families who have seen stagnant wage growth for almost two decades,\" Chavez said in a statement. The self-described fiscal conservative and social moderate served in the U.S. Marine Corps and on the Oceanside City Council before being elected to the Assembly in 2012. He noted that as a child, he picked grapes in the fields, and went on to watch one of his children attend an Ivy League medical school. \"Thats the American Dream, and its what every parent hopes to see for their own children, Chavez said. But if we dont take steps to protect our nation and help create more opportunities for our children, we risk losing that dream.\", Given the states Democratic tilt, Republicans face an uphill challenge in the Senate race. In addition to Chavez, two former Republican state party chairmen are also considering the 2016 contest. The party has not elected a candidate statewide since 2006. And the Senate contest takes place simultaneously with the presidential race, which many expect to produce a voter turnout that is younger and more diverse, benefiting Democrats. Democratic Atty. Gen. Kamala Harris is the only major candidate in the race currently. She announced her bid and began raising money and securing endorsements within days of Boxers announcement last month that she would not seek another term. Former Los Angeles Mayor Antonio Villaraigosa and a handful of Democratic House members are also considering a run. Follow@LATSeemafor political news. ]", "Date": "20150217", "Title": "[GOP Assemblyman Rocky Chavez is exploring Senate bid]", "Link": "http://www.latimes.com/local/political/la-me-pc-gop-asemblyman-chavez-exploring-senate-bid-20150217-story.html\n", "Author": "[Seema Mehta]"}
