{"Content": "[Making plain what he has vaguely hinted, Jeb Bush instantly scrambled the still-early 2016 presidential race Tuesday by announcing he would form a political action committee allowing him to explore a possible White House bid. The PACs purposes will be to support leaders, ideas and policies that will expand opportunity and prosperity for all Americans, Bush, the son and younger brother of former presidents, wrote in posts on Twitter and his Facebook page. In the coming months, I hope to visit with many of you and have a conversation about restoring the promise of America. Practically speaking, Bushs announcement was just a tiny step down a path the former Florida governor had already seemed to be following. But it left a considerable footprint. The move banished any doubts about Bushs interest in running  doubts he himself had fanned by publicly equivocating about the personal toll and political difficulties of seeking the office. Can I do it where the sacrifice for my family is tolerable? Bush mused at a Wall Street Journal conference this month. Its a big sacrifice, because its a pretty ugly business right now. Indeed, the harsh reaction from some quarters signaled that Bush could face a grueling, divisive fight for the nomination. Another Bush versus another Clinton, L. Brent Bozell III, a longtime conservative activist, posted on Twitter, referring to a possible November 2016 matchup with former First Lady Hillary Rodham Clinton. Political vomit. Even those reacting with more restraint pointed up a hurdle that Bush, like Clinton, would have to overcome: Neither is exactly a fresh face. I dont think we need another Bush, period, Republican Sen. Tom Coburn of Oklahoma told reporters on Capitol Hill. I like them all, but I dont think we need another Bush. The most immediate effect of Tuesdays announcement fell on the many Republicans already engaged at various stages of seeking the presidency. Some, like Sens. Rand Paul of Kentucky and Marco Rubio of Florida, had formed their own leadership PACs, which function as the equivalent of a campaign organization in waiting. Rubio, who was mentored by Bush as he rose through the ranks of Florida politics, seems unlikely to challenge his former patron in a bid for the GOP nomination, though Rubio suggested Tuesday his decision would not be based on who else makes the race. I have a lot of respect for Gov. Bush and I think hell be a very formidable candidate if he decides to run, Rubio said. From my perspective, my decisions going to be based on where I can best advance my agenda for restoring the American dream. Bushs move also placed considerable pressure on other prospects who would most likely vie with him for support of the Republican establishment. The boomlet behind a third Mitt Romney bid is likely to lose a great deal of whatever momentum it had. Others vying for establishment support, including New Jersey Gov. Chris Christie and two Midwestern governors, Wisconsins Scott Walker and Ohios John Kasich, will suddenly have to rethink their plans  or, at the least, the timing of their decisions. Hes now gotten ahead of everyone else, said Bobbie Kilberg, a major Republican donor in Virginia who worked for both President Bushes. I think this may force the hand of other candidates in the center-right arena to move earlier than perhaps they wanted to. This puts some pressure on donors to also move more quickly than they thought they would. Donors and activists in Florida are now in a bit of a quandary, said GOP strategist Ana Navarro  though she made it fairly clear where she stood. I love Marco Rubio. I love Jeb Bush. I have loved Jeb longer, Navarro said. Paradoxically, there is much that remains unknown about the prospects of a Bush candidacy, notwithstanding his household name and dynastic status. The Republican Party is different than it was in 2000, when it nominated Bushs brother, George W. and vastly different than in 1988, when his father, George H.W. Bush, was the partys choice for president. During much of that time, Jeb Bush, who left the governorship in 2007 after two terms, was out of elective office. Many in the party have little use for the compassionate conservatism that George W. Bush promoted, or the pragmatism George H.W. Bush displayed. Jeb Bushs moderate position on immigration and support for Common Core, a set of recommended national education standards, places him at odds with many conservative activists, a bloc that holds considerable sway in the GOP nominating process. Lately, Bushs business dealings have also come under renewed scrutiny. In addition to serving on corporate boards and giving paid speeches, Bush holds leadership positions in offshore private equity funds that are partly financed by foreign investors, according to a Bloomberg report. If he runs for president, Bushs business ties and moneymaking ventures will doubtless be mined by his opponents, both Republican and Democrat, as were Romneys business dealings. Bush had taken several steps in recent weeks that pointed toward a White House bid. He huddled privately with some longtime advisors and sent personal emails to major GOP donors saying that if he ran in 2016 he hoped to have their support. Last weekend, in a television interview with Miamis WPLG, Bush announced he was writing an e-book and would release 250,000 emails from his years as governor  a level of transparency other candidates may be expected to follow. At the same time he has openly pondered whether he can find joy in the ruthless business of running for president, a process that has grown even more relentless and caustic with the advent of the never-ending news cycle and hyper-partisan media. Im not saying, Oh, woe is me. ... Dont get me wrong, Bush said at the Wall Street Journal event. Ive got to really do a lot of soul-searching. Presumably, his travels under the auspices of his new PAC will help answer his lingering questions. But Democrats werent waiting for a final decision to begin launching their attacks. Jeb Bush has fully embraced the failed economic agenda that benefits only a select few at the expense of the middle class, said Democratic National Committee spokesman Mo Elleithee. Thats not going to change no matter how many different ways he says he may run. mark.barabak@latimes.com, seema.mehta@latimes.com, Twitter: @markzbarabak, @latseema, Times staff writers Michael A. Memoli and Jim Puzzanghera contributed to this report. , 5:35 p.m.: The story was updated throughout with new details and information. 12:23 p.m.: The story was updated with reaction to Jeb Bushs announcement. The article was originally published at 10:06 a.m.]", "Date": "20141216", "Title": "[Jeb Bush shakes up GOP race for president, could face divisive fight]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-jeb-bush-2016-campaign-analysis-20141216-story.html\n", "Author": "[Mark Z. Barabak, Seema Mehta]"}
