{"Content": "[Kamala Harris has spent months on what looked like a glide path into the U.S. Senate, but the emergence of Loretta Sanchez as her chief rival puts Californias attorney general in a tough fight against a member of Congress with a history of defying low expectations. The contest between two liberal Democrats could split California along regional and ethnic lines. Harris, a former San Francisco district attorney, expects to dominate in the Bay Area while Sanchez, an Orange County native, would draw strength mainly from Southern California. Harris, whose ancestry is black and Indian, is widely seen as the favorite after four months of building political support and raising money, much of it from Hollywood. She coasted to reelection as attorney general in November. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sanchez is counting on the same force that vaulted her into the House more than 18 years ago to thrust her into the Senate next year: Latino voters growing clout in California, particularly in presidential election years. I would be the first Latina ever elected to the United States Senate, Sanchez said Thursday in announcing her candidacy outside the ornate Spanish Colonial train station in Santa Ana, her predominantly Latino hometown. A daughter of Mexican immigrants, Sanchez burst into national politics by ousting Republican firebrand Bob Dornan from Congress in 1996. It was a stunning setback for Republicans in the partys Orange County stronghold. It was also a pivotal moment in California politics, heralding Republicans nearly two-decade fall from power in a state where the partys hard line on immigration touched off a fierce Latino backlash. The race to succeed Democratic incumbent Barbara Boxer, who is not seeking reelection, will be the first statewide contest for Sanchez, a member of the House Armed Services and Homeland Security committees. In Santa Ana, where she was surrounded by friends and family, Sanchez played up her House experience on foreign policy, saying she had visited Iraq, Afghanistan and other war zones countless times. Im running for the Senate because I believe in fighting for whats right, and for whats in your heart, and thats why I voted against the Iraq war when everyone was beating the war drums, she said. Harris lack of experience in national and foreign policy, Sanchez said, will be a key point of contrast. Harris spokesman Nathan Click said, The attorney general looks forward to a lively discussion about who is best equipped to help change the culture of dysfunction in Washington, D.C. and make a difference in the lives of Californians. Sanchez, 55, grew up in Anaheim and graduated in 1982 from what is now Chapman University in Orange. She has an MBA in finance from American University in Washington, D.C. For nine years, she worked as a financial analyst for private companies and public agencies. A younger sister, Linda Snchez of Whittier, is also a Democratic member of Congress. A question facing Sanchez now is whether the kind of attention she has won while in Congress could weigh down her campaign. On occasion, she has made fellow Democrats wince. In 2000, she embarrassed party presidential nominee Al Gore by scheduling a fundraiser at the Playboy Mansion during the Democratic National Convention in Los Angeles. At Gores behest, the party took away Sanchezs convention speaking slot. Sanchez backed down and moved the event to Universal Studios CityWalk. Sanchez has also made headlines with cheeky Christmas cards. For years, they featured Gretzky, her white cat. One card showed Sanchez, wearing pink flannel pajamas, snuggling in bed with Gretzky. Another showed the congresswoman in a tank top on a motorcycle, with Gretzky perched on the handlebars. Sanchezs public image has left some party strategists skeptical of her prospects. Theres a genuine hunger for a history-making Latino candidate in this race, but Loretta Sanchez is probably not the answer to that hunger, said Democratic strategist Roy Behr, a former campaign advisor to Boxer. One could call her actions eccentric, or courageously charting her own path, or bad political judgment. But theyre not actions that enhance someones ability to run a credible Senate campaign. But Fernando Guerra, a political science professor at Loyola Marymount University, suggested that Sanchez fit Californias tradition of defying political conventions. He recalled the U.S. Senate victories of semanticist S.I. Hayakawa in 1976 and of Hollywood dancer and actor George Murphy in 1964. You need to capture the publics imagination, and I think her eccentricities will really help her, said Guerra, who nonetheless called Harris the favorite. Antonio Gonzalez, president of the Southwest Voter Registration Education Project, said Sanchez could inspire a surge in Latino voter turnout. She has long prepared for this race in both political and policy terms, he said. In Santa Ana, Sanchez said she did not believe she had a public-image problem. Im really a policy wonk at heart, she said. Sanchez cannot seek reelection to the House while running for Senate, so her departure sets off a scramble for her seat. The areas large Vietnamese community could be a key asset for Republicans as they try to recapture it. In the Senate race, Sanchez will need to raise money aggressively. At the end of March, she had less than $540,000 on hand, while Harris had more than $2.2 million, according to their most recent finance reports. Sanchez said she was not worried about money. Just think, she said. If every Latino in this state would send $1 today to our campaign, wed have more resources than we would need. Two other Latino Democrats are considering the race: Rep. Xavier Becerra and former Army Secretary Louis Caldera, both of Los Angeles. Republicans in the contest so far include former state party Chairman Tom Del Beccaro and Rocky Chavez, an Oceanside state assemblyman, but the states strong Democratic tilt gives them both long odds. Regardless of party, the candidates who finish first and second in the June 2016 primary will compete in a November 2016 runoff. Twitter: @finneganLAT, 7:18 p.m.: This article has been updated with additional details throughout. 1:06 p.m.: This article has been updated with additional remarks by Rep. Loretta Sanchez. This article was originally published at 11:09 a.m.]", "Date": "20150514", "Title": "[Rep. Loretta Sanchez enters race for Barbara Boxer's Senate seat]", "Link": "http://www.latimes.com/local/political/la-me-pc-loretta-sanchez-senate-campaign-20150414-story.html\n", "Author": "[Michael Finnegan]"}
