{"Content": "[The costliest midterm election in history draws to a bitter close with control of the Senate tilting toward Republicans even as governors, in red and blue states alike, face a well of anti-incumbent anger from New England to the Rocky Mountains. Growing GOP momentum has strengthened Republican challengers in tight Senate races  including Alaska, Colorado and Iowa  and bolstered the prospect of expanding the partys House majority, as the number of competitive contests pushes deeper into Democratic-held territory, including Las Vegas and California. But unlike a conventional wave election that swamps members of a single party, Tuesdays results could bring a more mixed showing, as Republicans fight to protect Senate seats in the strongholds of Kansas, Georgia and Kentucky and governorships in several states, including Maine, Georgia, Florida and Wisconsin. For their part, Democrats are battling to keep the governors office in the blue bastions of Connecticut, Illinois, Maryland, Massachusetts and here in Colorado, where John Hickenlooper easily won four years ago. Burdened by association with the deeply unpopular President Obama, Democrats have seen little political benefit from the steadily growing economy, which, for many voters, has failed to translate into a sense of greater well-being. \"Theres just a lot of folks, they can see that the economys coming back,\" Hickenlooper said in an interview at an office near the Capitol, where he ate chicken soup to fight a cold. \"But theyre not believers yet.\", In many ways, Colorado has become the epicenter of this midterm election, which will hit about $4 billion in spending and feature  if that is the word  well over 2 million TV advertisements, most of them negative. The Denver area has seen more of those commercials than anywhere else in the country: upward of 78,000 this year through mid-October, and counting. The Internet offers no respite, as websites and even streaming music services are filled with advertisements deploring the voting record of Rep. Cory Gardner, the GOP Senate nominee, or condemning Democratic Sen. Mark Udalls fealty to Obama. Adding to the onslaught has been a seemingly endless barrage of bad news  about Ebola, Russian hegemony, hostages beheaded in the Middle East  and a series of Washington missteps, including the botched rollout of the healthcare program and scandals at the Internal Revenue Service, the Secret Service and the Department of Veterans Affairs. The result is a surly electorate, and it goes beyond Colorado. Those not skipping the election in disgust are ready to lash out at lawmakers of both parties. \"I dont like any of the campaigns anymore,\" said Frank Riehl, a retired farmer in Iowa City, Iowa, another state inundated with a flood of scathing TV ads. Hell vote Tuesday for Democratic hopeful Bruce Braley in his white-hot Senate race with Republican Joni Ernst, but only out of a sense of civic duty. In House races across the country, the only thing that prevents significant turnover is the drawing of political lines that purposely limit competition and make it extremely difficult to oust most members. Only about three dozen seats out of 435 have the prospect of changing partisan hands after Tuesday. There will be much greater turnover in the 100-member Senate, with most of the new faces likely belonging to Republicans. The GOP needs to gain six seats to win control and the party seems halfway there, with near-certain victories in Montana, South Dakota and West Virginia. Elsewhere, the party has been on the offensive throughout this election year, as most competitive races are in states that Obama lost in 2012, including Alaska, Arkansas, Louisiana and, narrowly, North Carolina. In all, more than half a dozen Senate races remain too close to call, with history suggesting most will break Tuesday in favor of one party or the other. For Republicans, this election year has been driven by a single overarching message, which can be easily distilled: it is anti-Obama. For their part, Democrats have largely shunned the president, or at least his presence on stage or in their TV advertising, while insisting his policies have worked better than voters might think. Appearing alongside Udall last week at a roadside cafe outside Colorado Springs, the states junior senator, Democrat Michael Bennet, ticked off a litany of upbeat economic statistics: consecutive months of job growth, falling unemployment, a rejuvenated auto industry. After each, Bennet, the head of the partys Senate campaign committee, exclaimed, \"People forget that!\", \"We need to remind people of what really has happened,\" he told about 50 fleece-wrapped party faithful, who clapped and nodded. The rest of the Democratic message includes familiar standbys: accusations that Republicans want to gut Medicare and Social Security, a dose of economic populism  including calls for a higher minimum wage  and a renewal of the \"war on women\" attacks that helped Obama win reelection two years ago. Udall has been especially vociferous in assailing Gardner for his antiabortion stance, so much that he acquired the mocking nickname \"Mark Uterus\" and lost the endorsement of the Denver Post, which condemned his \"obnoxious one-issue campaign.\", The countrys gubernatorial races are, for the most part, being waged on issues more closely tailored to local concerns. In Connecticut, its tax hikes and slow economic growth under Democratic Gov. Dan Malloy. In Kansas, its tax cuts, under Republican Gov. Sam Brownback, which have imperiled education funding and hurt the states bond rating. Here in Colorado, Hickenlooper faces a backlash over new gun laws, his decision to grant a limited reprieve to a death row inmate and a reputation for vacillation. \"I wouldnt pretend that youre always going to agree with me,\" former Rep. Bob Beauprez, the GOP gubernatorial nominee, told a crowd last week outside Republican headquarters in Colorado Springs. \"There will probably be times when we have differences. But I can guarantee you one thing: I can make a decision and I will make decisions.\", Among the 150 or so cheering him on was Sharon Thompson, a city councilwoman from next-door Fountain. She stood in the headquarters parking lot, staring into the late-afternoon sun, for nearly two hours as well over half a dozen candidates worked their way through stock speeches. But even a party soldier like Thompson has her limits and, like many in this politically saturated state, she has adopted a strategy for her TV viewing. Around March, she said, she began taping \"19 Kids and Counting\" and the home-improvement shows she enjoys, so she can skip over the incessant campaign advertising from both sides. \"I was just watching a show last night when I thought, Gosh, next week I wont have to worry about this,\" Thompson said. She paused. \"But then they start the Christmas ads.\", mark.barabak@latimes.com, Twitter: @markzbarabak, Times staff writer Maeve Reston in Iowa City, Iowa, contributed to this report.]", "Date": "20141103", "Title": "[Midterm election rides wave of anger at incumbents]", "Link": "http://www.latimes.com/nation/politics/la-na-election-overview-20141103-story.html", "Author": "[Mark Z. Barabak]"}