{"Content": "[On Wednesday, we told you what the candidates were saying aboutthe Common Coreand why the big push to make education front and central in the 2016 presidential electionmight not pay off. Over at Trail Guide, the Los Angeles Times blog counting us down to the 2016 presidential election, theres a recap of something from Wednesdays education forum in New Hampshire that made fewer headlines: Republicans discussing their favorite teachers. Anexcerpt:, \"Scott Walker said he recently visited Plainfield, Iowa, where he met with his third-grade teacher, Betty Balsley. She really cared for me. She showed this emotional attachment, which is really important in elementary school -- that feeling that I like school because I like my teacher, and thats what Mrs. Balsley did to me. In doing that, it offered her the opportunity to inspire us, not just to want to do better in school but to want to do better in life., \"Chris Christie credited his fifth-grade teacher for teaching him how to write: In walked a fifth-grade Chris Christie who had gotten nothing but As from kindergarten through fourth grade. I walked in and gave my first essay to her and got my essay back and it was a C. Christie approached the teacher after class, saying, \"Ive never gotten a C on anything in my life, and so you need to reread this because its really good,\" to which she replied, \"You want to be an A student in this classroom, youre gonna have to stop talking and start working.\" She was tough but she was really smart, he said.\", For more coverage of the 2016 presidential campaign, check out Trail Guide. You can reach Joy Resmovits on Twitter @Joy_Resmovits and by email at joy.resmovits@latimes.com. Sign up for The Times Education Matters newsletter here.]", "Date": "20150820", "Title": "[Republicans discuss their favorite teachers]", "Link": "http://www.latimes.com/local/education/back-to-school/la-me-edu-republicans-discuss-their-favorite-teachers-20150820-story.html\n", "Author": "NULL"}
