{"Content": "[The contours of Californias U.S. Senate race sharpened Saturday, with Kamala Harris trying to keep stride as the leading contender while upstart Loretta Sanchez sought to knock her off balance. Their clashing ambitions dominated an Anaheim gathering of several thousand Democrats pondering who was best suited to capture the Senate seat that Barbara Boxer has occupied for more than 22 years. Harris, the state attorney general, outlined a broad federal agenda for the first time since entering the race in January. Highlights included a \"full pathway to citizenship\" for immigrants in the country illegally, a rise in the minimum wage and an end to the federal ban on medical marijuana. Speaking two days after Sanchez announced she was running, Harris referred only obliquely to the Orange County congresswoman, implying that her rivals 18 years in the House of Representatives should be no source of pride. \"I believe we can disrupt the dysfunction in D.C.,\" Harris told the convention delegates in a speech punctuated by tributes to such civil rights leaders as United Farm Workers icon Cesar Chavez and Supreme Court Justice Thurgood Marshall. California Senate candidates have until next March to decide whether to run in the June 2016 primary, so the Democratic field could expand. Rep. Xavier Becerra of Los Angeles, another possible contender who was working the convention, said he expects to decide by August whether to get in. Meanwhile, Sanchez leaped Saturday at the chance to attack Harris for a lack of legislative experience, saying she doesnt know \"how to get things done in Washington.\", \"She has no foreign-relations, military, homeland security experience,\" Sanchez told reporters. The annual party convention put Sanchezs feisty personality and freewheeling campaign style on vivid display, a counterpoint to her opponents more measured and risk-averse approach. \"So you get a little flavor of who I am, were having margaritas and mambo at 4 p.m.,\" Sanchez told the partys rural caucus with a sly grin. \"Come on by.\", On a visit to an assembly of Filipino Americans, Sanchez mentioned her affinity for ballroom dancing, especially the fox trot, then bemoaned rebel insurgencies in the Philippines. She stumbled, however, in telling the Indian American caucus about an occasion when she confused a Native American with an Indian American. Video shot by a convention delegate and circulated on Twitter showed Sanchez tapping her hand to her mouth in an imitation of a \"war cry.\", When Harris was asked about the remark, her eyebrows rose. \"I dont know what to say to that,\" said Harris, whose mother was an immigrant from India. \"That  that  thats shocking,\" Harris said. She repeated: \"Thats shocking.\", At Sanchezs \"mambos and margaritas\" event, the festive mood was undercut when Sanchez was asked if the gesture was appropriate. \"Well, I think Native Americans have an incredibly great history, and a great presence in our country, and many of them are supporting our election,\" she said. Harris threw her own party, a more staid \"Cookies with Kamala\" gathering, with no mambo. Earlier, Sanchez had weighed in on more serious events, telling reporters outside the convention hall that Congress would approve President Obamas proposed nuclear deal with Iran if the final terms are acceptable. \"As you know probably, my specialty in the Congress is nuclear proliferation and nonproliferation,\" she said. \"Ive been sitting in that Situation Room in the White House dealing with this issue for a while now.\", She dashed over to a line of several dozen carpenters in orange vests protesting Obamas proposed \"fast-track\" authority to negotiate a Pacific trade pact. Walking the line in heels, she high-fived the construction workers one by one and led a chant: \"No fast track!\", It was a popular stand among delegates. They roundly applauded lunchtime speaker Elizabeth Warren when the Massachusetts senator said Obamas planned Trans-Pacific Partnership would benefit multinational corporations and \"leave American workers in the dirt.\", Warrens presence was a reminder of the advantages that Harris has against Sanchez and other potential rivals. Warren and two other senators, Kirsten Gillibrand of New York and Cory Booker of New Jersey, are helping Harris raise money, as are a large cadre of Hollywood executives. Warren used the convention platform to tout Harris role in a national mortgage-fraud settlement. \"We were in the trenches together, and the big banks were fighting us tooth and nail,\" Warren said. \"That woman was fearless.\", In her own remarks to delegates, Harris drew attention to her offices high-profile lawsuit against the for-profit Corinthian Colleges, saying that \"diploma mills\" can saddle unwitting students with \"useless degrees and a lifetime of debt.\", She also denounced \"mass incarceration,\" describing the \"war on drugs\" as a failure, and vowed to fight economic inequities. \"The same way we know marriage equality is a civil right, we know income inequality is a civil wrong,\" she said. Later, she told reporters she would support repeal of the federal death penalty. Sanchez, who voted against the Iraq war, struck no policy contrasts with Harris. On a visit to the state partys LGBT caucus, she described herself as the first member of Congress to meet with transgender advocates. \"We have been in the forefront in the Congress working on everybodys rights  especially the LGBT community,\" she said. And at the environmental caucus, Sanchez recalled fighting in the 1990s to limit environmental harm caused by construction of the Highway 73 toll road in Orange County. michael.finnegan@latimes.com, peter.jamison@latimes.com, Twitter: @finneganLAT, @petejamison]", "Date": "20150516", "Title": "[Harris, Sanchez dominate Anaheim gathering of California Democrats]", "Link": "http://www.latimes.com/local/orangecounty/la-me-pol-california-democrats-20150517-story.html\n", "Author": "[Michael Finnegan, Peter Jamison]"}
