{"Content": "[When it passed legislation to fix the troubled Veterans Affairs Department, Congress managed to do two things lawmakers have often vowed to avoid: create a new benefit program and fail to pay for it. The $16.3-billion measure, which President Obama plans to sign into law Thursday, aims to solve the alarming backlog for care at VA facilities by allowing veterans to see private doctors at the governments expense. Veterans can use the new option if they face a wait of 30 days or more or live more than 40 miles from a VA facility. Creating that new benefit would allow many more veterans to get care, but would increase spending by $10 billion, added to the deficit. The rest of the money in the bill would go to expand existing VA programs, personnel and facilities and would be offset by reductions elsewhere in the budget. That could be just for starters. Congress limited the upfront cost of the new private-care option by creating it as a stop-gap  a temporary fix for three years or until the money runs out, whichever comes first. But temporary has a way of becoming permanent in Washington, especially when lawmakers face a group as sympathetic and politically potent as veterans. The money Congress allocated for private care would run out by the end of next year, the Congressional Budget Office estimates. That would be just as Washington gears up for another election. The odds of Congress pulling the plug on a popular benefit for veterans in an election year seem long, analysts in both parties say. Just as unlikely is the prospect of the two parties agreeing on tax increases or new spending cuts to fully cover the costs. If, as many expect, Congress extends the program past its current expiration date, the cost to taxpayers would be at least $7 billion a year and perhaps more, depending on how many veterans choose private care, budget office projections indicate. \"Its going to be treated like any of the other entitlements: Were going to pay for it,\" said Lawrence J. Korb, a former assistant secretary of Defense under President Reagan and now a senior fellow at the liberal-leaning Center for American Progress. \"You show up, were going to take care of it and pay the bill.\", The creation of a new benefit for veterans illustrates how even the budget-cutting fervor of House Republicans, who have made reducing federal spending their top priority, can be overturned by a big enough political push. Earlier this session, the House balked at providing funds for hurricane relief unless the expenditure was fully offset by budget cuts elsewhere. Last week, emergency funds to fight wildfires in the West were blocked in the Senate. But faced with enormous political pressure to respond to delays at VA medical centers after Veterans Affairs Secretary Eric K. Shinseki resigned, Congress passed the veterans bill with opposition from just five lawmakers in the House and three in the Senate. \"Forty dead veterans that died in line, that was enough for me,\" Rep. Steve King (R-Iowa), a conservative stalwart, told reporters last week about his reason for supporting the bill. Investigators have found long backlogs at VA hospitals across the country and several cases of veterans who died while waiting for appointments, but have not determined whether any veterans died as a result of delays. On the other side of the issue, Sen. Bob Corker of Tennessee, one of the three Republican senators who voted no, warned of putting in place \"yet another long-term unfunded liability.\", Congress \"rushed through a piece of legislation without thoroughly reviewing its full fiscal impact on future generations,\" Corker said in a statement after the vote. While deficit hawks fret about the long-term costs of the private-care option, leaders of many veterans groups worry about a different concern  that in the future, Congress might decide to pay for private care by siphoning off resources and eroding the VA system. Some members of Congress, primarily conservative Republicans, have for years argued the VA could be largely replaced by government payments to private doctors and hospitals. VA officials counter that surveys show most of the more than 8 million veterans who utilize VA healthcare are satisfied with the care they get, although they object to the long waits. Though the VAs medical budget has essentially doubled over the decade, VA facilities have been overwhelmed with new patients returning from the recent wars in Iraq and Afghanistan, along with the aging Vietnam War-era population. Liberalized rules, including expanded eligibility for claims of Agent Orange exposure, have also boosted the number of patients. The most severely disabled vets, including those with service-related brain and spinal cord injuries, say the VA provides specialty care that cannot easily be replicated in the private sector. \"Theres still a little of an ideological battle thats playing out here,\" said Carl Blake, director of government relations for Paralyzed Veterans of America, who was among those who fought for a sunset provision that would end the private-care option after three years. \"We dont want this to become the way healthcare is delivered in the VA,\" he said. \"Our focus has always been on strengthening VA.\", To that end, Sen. Bernie Sanders (I-Vt.), chairman of the Senate Veterans Affairs Committee, who negotiated the package with his Republican counterpart in the House, Rep. Jeff Miller of Florida, insisted on including $5 billion to allow the VA to hire more doctors, nurses and other medical personnel. Administration officials had said the VA needed almost twice that amount. And the final product was not the one he would have written, Sanders said. But, he added, \"very, very difficult\" talks with House Republicans had resulted in an acceptable compromise. \"We have people who have put their lives on the lines, people have come back with a whole lot of problems, and it would be an absolute disgrace to this country if we did not address their needs,\" Sanders said, noting that the wars in which the veterans fought also were paid for by increased deficits. For the next year, both the private and government paths for improving veterans medical care will be followed before the emergency funds run out and Congress must once again find a way to pay for the program or kick a decision into the future. \"It starts a conversation, I think, about VA for the future,\" said Miller, the House veterans committee chairman. \"The VA is not sacred. The veteran is.\", lisa.mascaro@latimes.com]", "Date": "20140806", "Title": "[Lawmakers' costly plan to fix Veterans Affairs is temporary, or not]", "Link": "http://www.latimes.com/business/healthcare/la-na-va-reform-20140807-story.html", "Author": "[Lisa Mascaro]"}