{"Content": "[Legislators and protesters have taken their positions, the stage in the state Capitolisset, and the curtain has drawn up on another labor drama in Wisconsin. Lawmakers in the Republican-dominated Legislature on Tuesday began debating legislation that would probably dramatically weaken Wisconsin unions if passed and approved by Gov. Scott Walker, a potential 2016 Republican presidential hopeful. The state Senates labor committee on Tuesday morning beganhearing an expected full day of testimony and public comment over a Republican proposal toban private sector unions from requiring nonmembers under their representation to pay dues. The five-member, Republican-led committee is expected to then vote on the bill and send it to the Senate for possible deliberation Wednesday. Conservativessay the legislation would make the statemore attractive for businesses. Critics say the so-called right-to-work legislation -- which exists in 24 states -- would inevitably decrease union membership in Wisconsin and further diminish thepower of unions, which tend to support Democrats. They mockingly call such proposals\"right to shirk\" or \"right to free-ride.\" , For Walker, who hassignaled he would sign such a bill into law, thefight offers another opportunity to burnish his conservative credentials for 2016 as he meets with Republican groups across the U.S. Union-supporting demonstrators led by the Wisconsin AFL-CIO gathered in Madison and in the Capitols rotunda Tuesday in protest. The battle has revived memories of the dramatic 2011 labor showdown at which protesters occupied the Capitol and Democratic lawmakers fled the state to block avote overlimiting collective bargaining for public workers. Walker eventually emerged victorious in that fight and with a high profile on the national stageafter signing the legislation into law in March 2011. The current battle centers on who has to pay union dues. Essentially, in workplaces where a majority of workers have elected a union to represent them in contract bargaining with employers, the union represents all members of that workplace regardless of whether they support the union, said Paul Secunda, professor of law and director of the labor and employment law program at the Marquette University Law School. The proposed law would ban unions from drawing dues from nonsupporting members, who would still nonetheless get the benefits of union bargaining for betterwages and benefits, Secunda told the Los Angeles Times. \"The union is stuck. They have to represent all employees in the bargaining unit, and if they dont, they can get sued for breach of duty of [fair] representation,\" Secunda said. But for those who dont want to pay dues, Secunda said, \"theyre not legally required to anymore ... so the union is out of business because theres no money to support what it does in the workplace. Republican lawmakers, led by Senate Majority Leader Scott L. Fitzgerald, argue that a right-to-work law would draw new jobsfrom other states and encourage current employers to stay. \"In order to see our economy continue to compete at a global level, we cannot remain mired in an antiquated system,\" Fitzgerald said Tuesday in prepared remarks. Observers sayWalker has flip-flopped his position on such legislation. After surviving thebruising 2011 legislative fight and an ensuing recall election, Walker made it clearhe would not support right-to-work bills. \"I have no interest in pursuing right-to-work legislation in this state,\" Walkertold reporters at the state Republican Partys annual convention in 2012, according to the Milwaukee Journal Sentinel. \"Im going to do everything in my power to make sure it [doesnt come to my desk]because my focal point [is] private sector unions have overwhelmingly come to the table to be my partner in economic development,\" he said. As recently as September, during his most recent gubernatorial campaign, Walker said that right-to-work legislation was not part of his agenda, but on Feb. 20, he told the Journal Sentinelhe would support Fitzgeraldsbill. The fact-checkingservice PolitiFact Wisconsin rated Walkers change of heart as a \"full flop.\", Follow @MattDPearce for national news.]", "Date": "20150224", "Title": "[Another labor showdown looming in Wisconsin, with Walker center stage]", "Link": "http://www.latimes.com/nation/la-na-wisconsin-labor-showdown-20150224-story.html", "Author": "[Matt Pearce]"}