{"Content": "[ To the editor: Messiah or mess? Nonsense. I agree that in previous administrations weve had some messes, but never a messiah. As for Barack Obama, he has done what I would want and expect from a competent president. (\"Obama: messiah or mess?,\" Op-Ed, Oct. 14), Consider what he faced in 2009: The state of American foreign affairs was no better than the tanking economy, with an ongoing disaster in Iraq and negligent handling of the war in Afghanistan. Obama steered us through and out militarily and gave the people of those countries a chance at democracy. I also give him high marks for closure on Al Qaeda terrorists and particularly Osama bin Laden. I consider Obama to be the best president of my lifetime. That still puts him considerably short of messiah, however. Patricia Casey, Fallbrook, .. To the editor: Although Timothy Garton Ashs incisive commentary summarizes Obamas presidency succinctly, there are areas of domestic policy that, despite their relative obscurity, are worthy of his attention. American hegemony in science, medicine and technology has been threatened by the \"hollowing out\" of our science infrastructure. Obama has perhaps inadvertently continued the policies of his predecessor by shrinking the National Institutes of Health budget, but more importantly by diverting funds away from individual research grants, which traditionally have been the cornerstone of American scientific innovation and prowess. Consequently, the number of trainee physicians choosing careers in academic medicine, in particular basic or fundamental science, has plummeted. There are also many other examples of how a culture of increasing regulation and oversight, combined with declining funding, has stifled growth in key areas. Since the consequences of these actions has yet to be fully felt, it is understandable that they have been largely ignored. I just hope Obamas successor takes steps to reverse these trends. Jonathan Kaunitz, MD, Santa Monica, The writer is a professor of medicine and surgery at the UCLA School of Medicine. Follow the Opinion section on Twitter @latimesopinion]", "Date": "20141018", "Title": "[Obama: not perfect, but better than we've had in a long time]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-1019-sunday-obama-20141019-story.html\n", "Author": "NULL"}
