{"Content": "[In Los Angeles, its hard to miss the signs of a city straining to meet its existing duties: broken pavement, illegally dumped furniture, rows of tents under freeway bridges. It took a discrimination lawsuit to persuade the citys leaders to start repairing sidewalks in a major way. Officials have just started to acknowledge that trash removal from city streets is a big problem. And from the latest estimates, homelessness, and the number of outdoor encampments, is on the rise. Now L.A. City Council members are poised to create a new office to enforce local wage laws, part of a larger push to require a $15-per-hour minimum wage by 2020. How much that office will cost, and whether it will experience the same funding woes that have befallen other city agencies, is an unresolved question. A UC Berkeley research team told the council that its new Wage Enforcement Division would need 25 investigators to match the efforts of San Francisco, which it views as having the best-developed program on enforcement. That would leave L.A. with one investigator for every 20,000 low-wage workers by the time the minimum wage reaches $15 an hour, the team said. What the council approved, for the time being at least, is $500,000  enough for five analyst positions for the fiscal year that starts July 1. For some, thats not enough to ensure the city gets off to a strong start in enforcing laws on wages, overtime, retaliation and other compensation issues. \"They approved whats basically a third of the need,\" said Elena Popp, executive director of the Eviction Defense Network, a backer of the recent wage hike. \"We need enforcement now. Theres wage theft now.\", Council members say they will have time to ramp up staffing as the wage increases start to take effect. Lawmakers are hoping to give the office at minimum an additional$200,000 by 2016, the year the first wage increase  $10.50 per hour  is in place. Advocates of the higher wage say more money is needed both for added enforcement efforts and to hire community groups to reach out to low-wage workers, particularly those who do not speak English. Meanwhile, critics question whether the city should take on additional oversight duties when it is struggling to get compliance with other laws. \"The city will readily tell you they already dont have enough personnel to enforce their building and safety regulations,\" said Richard Close, president of the Sherman Oaks Homeowners Assn. Neighborhoods groups already complain the city fails to confirm that real estate firms follow through on the promises they make when their development projects are approved. And Dennis Hathaway, president of the Coalition to Ban Billboard Blight, said the citys record of punishing companies with illegal outdoor advertising is \"abysmal.\", The city currently has two inspectors to patrol more than 5,700 existing \"off-site\" signs, such as billboards and supergraphics, which must be checked every other year. If those two inspectors work 40-hour weeks, with no sick days and two weeks of vacation each year, they would need to inspect 1.4 billboards every hour of every work day. That leaves little time to crack down on unpermitted signs popping up in Hollywood, the Westside and elsewhere, Hathaway said. \"I dont think its a matter of not wanting to do it. I think its a matter of not having the personnel to do it,\" he said. Building and Safety spokesman Luke Zamperini said his agency has \"an adequate number\" of sign inspectors. But he agreed that his department has too few inspectors to tackle code violations, such as unpermitted construction, garage conversions, trash-filled yards and nuisances created by hoarders in and outside of their homes. \"There is simply not enough funding,\" he said. Enforcement problems havent been confined to building safety. Larry Gross, who sits on the commission that oversees the Department of Animal Services, said there have been days when the San Fernando Valley  which makes up roughly 40% of the citys population  had only one animal control officer. Those officers are charged with handling reports of animal abuse, barking dogs and other violations. After years of neglect, the city approved enough money this year to hire an additional 24 animal control officers. But other agencies are facing budget dilemmas. The Ethics Commission, which enforces campaign contribution laws, has five people  three investigators and two managers  to look into major violations by politicians, campaign consultants, city contractors, lobbyists and donors. In the 2013 city election, there were 60,756 separate campaign contributions. Enforcement also is expected to be an issue when the City Council takes up a proposal to legalize street vending later this year. Council members are hoping to create a regulatory system that would allow vendors to obtain permits to sell on public sidewalks. But officials estimate there are as many as 50,000 vendors on the streets and more staff would probably be needed to ensure the new rules are followed. The least-expensive option would be to hire five investigators at a cost of $500,000, roughly one staffer every 10,000 vendors, city analysts reported recently. Under that approach, enforcement would only be triggered by complaints. To have active patrols looking for illegal vendors, the city would need to spend $1.7 million annually for 17 staff members, officials said. . On the issue of wage theft, the councils new enforcement office would have the power to interview workers and subpoena payroll records. Businesses would be required to post information on L.A.s wage law in 12 languages, including Tagalog, Armenian, Farsi and Chinese  both Cantonese and Mandarin. Employers would face fines if they fail to give investigators access to payroll documents and their workers. Some advocates for the minimum wage hike have been diplomatic in their comments on the early enforcement plan. Alexandra Suh, who heads the Koreatown Immigrant Workers Alliance and is part of the Raise the Wage Coalition, said five employees is a \"good start.\" But at least 15 more staffers will be needed to make the office effective, she said. Councilman Paul Koretz, who pushed for the creation of the wage theft office, said there is still time to determine how many staffers will be needed. He predicted at least five more employees will be hired during the coming budget year. \"We need to staff up to the point where we are nailing every single person  thats violating the law and stealing from their employees,\" he said. david.zahniser@latimes.com, Twitter:@davidzahniser]", "Date": "20150608", "Title": "[Will L.A. put money behind wage theft crackdown?]", "Link": "http://www.latimes.com/local/cityhall/la-me-wage-theft-funding-20150608-story.html\n", "Author": "[David Zahniser]"}
