{"Content": "[The battle for control of the Senate wont conclude until November 2016, but decisions made this year in a few key states could go a long way toward deciding the outcome. In contests in which open seats can be won or a vulnerable incumbent toppled, this is the period when parties focus on a single issue: recruitment of candidates. Republicans are searching to find candidates in two states -- Colorado and Nevada -- where they have hopes of picking up Senate seats. Democrats lost control of the Senate during the last midterm election but have an edge in regaining control in 2016. Theyre set to defend 10 seats this time around compared with 24 for Republicans. Seven of those seats Republicans must defend are in states that President Obama won twice. In a presidential election year, in which turnout will be larger and include more minorities and young people, who often tilt Democratic, several of those races likely will be difficult for the GOP. To offset potential losses in blue states -- GOP incumbents in Illinois and Wisconsin are particularly vulnerable -- Republicans hope to pick up Democratic seats in Colorado, where they defeated incumbent Sen. Mark Udall in 2014, and  Nevada, where Senate Democratic leader Harry Reid will be retiring. But recruitment problems could limit those efforts. In Colorado, Rep. Mike Coffmans recent announcement that he will not challenge incumbent Democratic Sen. Michael Bennet has left Republicans scrambling. Coffman, who hails from a diverse suburban Denver district and has won statewide office in the past, is a strong fundraiser and is well known within the state party. Republicans now must consider several lower-profile and untested candidates to challenge Bennet. COLORADO, Incumbent Sen. Michael Bennet (D) is seeking a second term. Coffman \"was the go-to candidate, now the party is left looking for a formidable contender on a thin list,\" said Eric Sondermann, a Denver-based political analyst. The list includes state Sen. Ellen Roberts, who represents a rural swath of southwestern Colorado, and Coffmans wife, Cynthia, the states attorney general. In 2014, Cynthia Coffman was the top GOP vote getter of any candidate in Colorado, but many of the states top strategists believe she will run for governor in 2018. Roberts could be a strong pick for a state thats never elected a woman senator, but her support of abortion rights will be a hurdle to overcome in a GOP primary. \"The big question is, can she make it out of a primary where there will certainly be really conservative candidates who hammer her on the issue,\" Sondermann said. Roberts said that if she decides to run, the theme for her candidacy will resemble a slogan used by Sen. Rand Paul of Kentucky: a \"different kind of Republican.\", \"We as a party need to find solutions and bring people together,\" Roberts said, describing herself as \"modestly libertarian.\", , NEVADA, The retirement of Senate Minority Leader Harry Reid (D) has left an open seat. In Nevada, where Reid has held his seat since 1987, Democrats have coalesced around his protg, former state Atty. Gen. Catherine Cortez Masto. Many Republicans had hoped that Gov. Brian Sandoval, who won reelection last year, would run for the seat. But Sandoval said this week he would not do so. Republican officials have been trying to persuade Rep. Joe Heck, a brigadier general, to enter the race although he has said that he would not run. Nathan L. Gonzales, editor of the nonpartisan Rothenberg & Gonzales Political Report, said at this early stage \"its tough to judge recruitment classes.\", \"The party committees have the polling and, for the candidates they want, are charting a path,\" he said. FLORIDA, As Sen. Marco Rubio (R) runs for president his seat becomes open. Florida Republicans will look to defend the seat of Sen. Marco Rubio as he seeks the Republican presidential nomination. The race, which is  ranked a \"pure tossup\" by the Political Report, is shaping up to have competitive primaries on both sides. Rep. Patrick Murphy represents a South Florida district and has been endorsed by the Democratic Senatorial Campaign Committee. The endorsement, however, hasnt deterred a likely challenge from Rep. Alan Grayson, who is notorious for making controversial comments. On the Republican side, state Lt. Gov. Carlos Lopez Cantera, who is of Cuban and Jewish descent, is the favorite of establishment Republicans. Hes set to be challenged by tea-party favorite Rep. Ron DeSantis, whose district is in the northern part of the state. \"I firmly believe -- firmly -- that a Floridian will be the Republican nominee for president,\" said Rick Wilson, a Florida GOP strategist, who is working for Cantera. In addition to Rubio, Floridas former governor Jeb Bush is seeking the nomination. \"That only helps the Republican Senate candidate in Florida, because it bumps up Republican turnout,\" Wilson said. WISCONSIN, Incumbent Sen. Ron Johnson (R) is seeking a second term. In Wisconsin, the decision by former Sen. Russ Feingold to seek a rematch with Sen. Ron Johnson, who beat him in 2010, has created a race that both sides will watch closely. Johnson is one of the most conservative members of the Senate, and almost certainly will have a harder road in a presidential election year. \"This is one of the premier races,\" said Gonzales. \"And one where both sides have their top recruit.\", kurtis.lee@latimes.com, Follow @kurtisalee for political news, MORE ON THE 2016 ELECTION, Whos running for president in 2016?, More people say theyre liberal, but the electorate might not follow, Is the GOP heartland ready to embrace Marco Rubio?]", "Date": "20150611", "Title": "[The battle for control of the Senate in 2016 could be won or lost this year]", "Link": "http://www.latimes.com/nation/politics/la-na-senate-recruit-20150609-htmlstory.html\n", "Author": "[Kurtis Lee]"}
