{"Content": "[In a relatively small state, Harry Reid loomed terrifically large, so his decision to exit the U.S. Senate after 2016 opens a massive void that left members of both parties scrambling. The description of Nevadas senior lawmaker was heard so often that it became a cliche, but one thoroughly grounded in truth: The wily Democrat was never beloved by Nevada voters, who sent him to Washington repeatedly over the decades, but he was greatly respected  even feared, at least by some he faced in political battle. If he couldnt convince you with a handshake, hed try it with a left jab, Michael Green, a state historian and professor at the University of Nevada, Las Vegas, said of the onetime amateur boxer. He was a street fighter for what he believed in and wanted. Reid, first elected to the Senate in 1986, almost single-handedly stopped federal plans to truck the nations nuclear waste to a dump at Yucca Mountain, in the desert 100 miles outside Las Vegas. He was indispensable in helping turn Nevada from a Republican stronghold into a competitive state that Democrat Barack Obama carried twice. He was also vital in creating the Nevada presidential caucuses, which started in 2008 as a way to include a Western voice in the early nominating process. As such, his exit marks an epic upheaval in state politics, and both parties on Friday were trying to divine the sudden opportunities and potential pitfalls. A 2016 race that was considered close but leaning in Reids direction, given his history of surviving near-death political experiences, has suddenly become a toss-up and will probably be among the most closely watched and hardest-fought in the country. Gov. Brian Sandoval is the overwhelming favorite of the Republican establishment to succeed Reid, even though he has regularly expressed no desire to move to Washington or serve in the Senate. Pointedly, Sandoval has also never issued a statement definitively ruling out a 2016 candidacy, although his actions  including a call for the largest tax increase in Nevada history  signaled the unlikelihood of a run. Do you really think  I would propose the things that I proposed last night, thinking I might be on a ballot? Sandoval asked Jon Ralston, a Reno Gazette-Journal columnist, after unveiling the tax proposal and an ambitious education overhaul plan in Januarys State of the State address. But Reids decision has given Sandoval reason to reconsider and led many to believe he will now give the race very serious thought. He offered no public statement on his plans Friday. Of course it has to change the dynamic, said one leading state Republican, who did not want to be identified speculating about the governors political future. I would imagine the next 48 to 96 hours will be filled with intensive contemplation. If Sandoval entered the Senate race, he would be a commanding front-runner. A former federal judge who stepped down to run for governor in 2010  when he beat Reids son, Rory  he is enormously popular, having won reelection in November with nearly 70% support. Should he opt out, two Republican Nevada congressmen who also passed on facing Reid, Reps. Joe Heck and Mark Amodei, might give the race another look, along with former Lt. Gov. Brian Krolicki. Other potential GOP contestants include Mark Hutchison, the states newly elected lieutenant governor, and Michael Roberson, the majority leader of the state Senate. At the very least, Sandoval is expected to play a large behind-the-scenes role working to rally Republicans behind a single candidate in hopes of avoiding a repeat of 2010. In that election, former state Assemblywoman Sharron Angle emerged as the winner of a free-for-all primary, but her extreme views and penchant for incendiary comments turned a once-close contest into a relative romp for Reid, who won by 5 percentage points. On the Democratic side, the field is much thinner, in part because Republicans swept every statewide office in November, devastating the partys bench. Possible Democratic candidates include Ross Miller, the former secretary of state; Catherine Cortez Masto, a former state attorney general now serving as executive vice chancellor of the Nevada System of Higher Education; and U.S. Rep. Dina Titus. ------------, FOR THE RECORD, March 28, 7:55 p.m.: An earlier version of this article incorrectly referred to Dina Titus as a former congresswoman. She is still in office. ------------, On Friday, Reid signaled his support for Masto, praising her resume and calling her a good person. For his part, Sandoval lavishly praised Reid and thanked him for his long service in public office, starting nearly 50 years ago when Reid was elected to the state Legislature. Despite their different parties, the two shared a strong working relationship and, even before Friday, had publicly spoken well of each other. He is one of Nevadas native sons, a pioneer of the West who has always worked tirelessly to fight for Nevadans with a gritty determination, Sandoval said in a written statement. His legacy will last for generations. As Sandoval suggested, Reids longevity  cited by critics who called him a leading cause of Washington dysfunction  was an important asset for his home state and something Nevadans may come to miss once he and his clout are gone. Lets face it, were a small Western state with a very powerful senator, said Eric Herzik, a longtime Reid watcher who teaches political science at the University of Nevada, Reno. When he goes away, we become invisible. If Sen. Dianne Feinstein were to step down, California would still be the biggest state in the country, Herzik went on. But for whoever replaces Harry Reid, it will be, Oh, who are you?, mark.barabak@latimes, Twitter: @markzbarabak, , 4:42 p.m.:This report has been revised throughout. 11:01 a.m.: This article has been updated with additional interviews. This article was originally published at 9:26 a.m.]", "Date": "20150327", "Title": "[Nevada after Sen. Harry Reid: Will Republican Gov. Brian Sandoval run?]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-harry-reid-retirement-2016-replacement-20150327-story.html\n", "Author": "[Mark Z. Barabak]"}
