{"Content": "[The New Year brings a great many revered traditions: fitness resolutions, \"Auld Lang Syne,\" the descent of the crystal ball in Times Square. That list does not include, at least for most people, the onrush of the next presidential campaign. Even so, with the dawning of 2015, the race for the White House moves into full swing, meaning a steady parade of candidates trooping through Iowa and New Hampshire, with only the occasional side trip to the Bay Area and Los Angeles to raise money to fly back to resume campaigning in Iowa and New Hampshire. This pattern elicits no end of outrage and unhappiness in California, almost entirely among lawmakers and political activists who wish they were the ones being coddled and stroked by those who would be the next Leader of the Free World. The argument  irrefutable from a mathematical standpoint  is that California is far more populous than early-voting Iowa and New Hampshire and, thus, deserves considerably more attention than those pint-sized states. (Throw in the two others granted a privileged place at the start of the election calendar, Nevada and South Carolina, and California still tops their combined populations by more than 25 million people.), For years, California tried to boost its clout by pushing its primary earlier in the nominating process. That, in turn, prompted other states to advance their elections, resulting in Iowa kicking off the last two presidential campaigns with caucuses held just three days into the New Year. Ho ho ho. In 2012, California finally gave up, moving its presidential primary all the way back to June. That ensures at least a year of griping about how shamefully overlooked the state has become  save for candidates coming to extract cash  and a good deal of hand-wringing over the vital California issues that are supposedly getting short shrift. Which doesnt really stand up to scrutiny. There are certainly a handful of parochial issues that receive inordinate attention thanks to the time lavished on the pampered people of Iowa and New Hampshire. Ethanol, a boon to Iowa farmers, is perhaps the best  and, from a taxpayer standpoint, most costly  example. And more than a few candidates have been known to prostrate themselves to please Iowa or New Hampshire audiences, the latest being New Jersey Gov. Chris Christie, who ignored overwhelming sentiment at home to please Iowa farmers by vetoing a bill regulating the care of pregnant pigs. But the truth is that modern presidential campaigns have become every bit as nationalized as the ubiquitous franchise restaurants that can be as readily found in Des Moines and Manchester, N.H. as Burbank, Reno or Columbia, S.C. The questions put to candidates in Iowa living rooms, New Hampshire town halls and, especially, in the debates nationally broadcast from the lead-off states tend to be ones that Californians and, for that matter, voters around the country care about most: jobs and the economy, education, immigration, foreign policy, the proper size and role of the federal government. Whenever theres a hot topic  the debate over police conduct, say, or cyber-harassment from North Korea  it is just as likely to come up in Laconia, N.H. as it is in Long Beach. Of course California, like every state, has its unique set of issues. The proposed bullet train through the Central Valley, to name one, or Gov. Jerry Browns bid to build massive water tunnels under the Sacramento-San Joaquin River Delta, to cite another. Good luck, though, getting any Democratic presidential hopeful to weigh in on either proposal. \"Thats a matter for Californians to decide,\" theyre likely to say, rather than risk offending the governor over his pet projects. (For Republicans, its easier  and more predictable  to simply tee off in opposition.), Theres a good case to be made for starting the presidential selection process in a set of smaller states, where any candidate with a strong constitution, personal appeal and compelling message can build support one intimate question-and-answer session at a time. California is simply too spread out and the cost of advertising too obscenely expensive for all but the most richly funded candidates, or those starting with the highest name-identification, to stand any chance of seriously competing. Its not a perfect system. But there are worse things than turning on the TV to watch a presidential debate without first having to burrow through a 10-foot wall of snow. Happy New Year. mark.barabak@latimes.comTwitter: @markzbarabak]", "Date": "20141228", "Title": "[Feeling left out in the Golden State as presidential campaign heats up]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-poliics-20141228-story.html", "Author": "[Mark Z. Barabak]"}