{"Content": "[Hillary Rodham Clinton used an economic policy speech Monday to make an early contrast with her potential Republican opponents, promising to \"rely on evidence more than ideology\" in an effort to restore financial security for Americans left behind in the recent economic recovery. Clinton, the front-runner for the Democratic nomination, said that boosting middle-class wages was the \"defining economic issue of our time\" and proposed to overhaul the tax code, promote corporate profit-sharing and advance paid family leave to build what she called a \"growth and fairness economy.\", \"I want to see our economy work for the struggling, the striving and the successful,\" Clinton said in her address at the New School in New York. \"Were not going to find all the answers we need today in the playbooks of the past, we cant go back to the old policies that failed us before, nor can we just replay the successes.\", Corporate profit-sharing was an example of the \"new ideas\" Clinton said shed promote as president, saying it would give workers a stake in the success of their employer as a way to \"boost productivity and put money directly in employees pockets.\", The emphasis on profit-sharing comes amid concerns by Clinton and the many economists advising her that too much of the American economy has become focused on fast earnings for those in top income brackets, to the detriment of rank-and-file workers. Clintons speech represented the first look at what aides say will be a detailed agenda, to be rolled out in the coming weeks, that seeks to push capital toward more durable growth, creating incentives forinvestments in infrastructure and research, for example, while closing what her advisors say are tax loopholes that promote excessive risk-taking in the markets. She also promoted familiar Democratic priorities such as pay equity for women, paid family leave and affordable childcare, something she said was not a \"luxury\" but a \"growth strategy.\", Her proposals take aim at a problem vexing economists: how to pull America out of a prolonged period of stagnant middle-class wages, even at a time when productivity is on the rise. Income disparity has become a central issue in the race for the White House, and Republican candidates have ideas that differ from Clintons. Former Florida Gov. Jeb Bush is building his economic agenda around a plan to boost growth of the countrys gross domestic product to a sustained 4% a year. Calling inequality a \"drag\" on the entire economy, Clinton targeted Bush directly for saying last week that Americans needed to \"work longer hours\" -- a portion of the former Florida governors discussion of economic solutions that his campaign said critics have taken out of context. Clinton said Bush \"must not have met very many American workers,\" and challenged him to repeat the claim to nurses, teachers and others who she said \"do not need a lecture. They need a raise.\", Discussing tax reform, Clinton called a plan from Sen. Marco Rubio of Florida that would slash taxes on top incomes a \"budget-busting giveaway to the super wealthy,\" the kind of plan that was typical of the \"bad economics\" Republicans would propose. And she attacked the newest GOP contender, Wisconsin Gov. Scott Walker, for \"stomping on workers rights\" by seeking to undermine the strength of public employee unions. \"I will fight back against these mean-spirited, misguided attacks,\" she vowed, saying the decline of unions was responsible for a third of the increase in income inequality. \"If we want to get serious about raising incomes, we have to get serious about supporting union workers.\", The attacks on potential general election foes mirrored a recent effort by President Obama to frame the general election debate on the economy on favorable terms for the party. But Clinton also went a step further as she seeks to boost her standing with liberal Democrats animated by the economic fairness debate, promising to go beyond the Dodd-Frank financial reforms to hold Wall Street accountable for abuses that have hurt the working class. \"While institutions have paid large fines and in some cases admitted guilt, too often it has seemed that the human beings responsible get off with limited consequences or none at all, even when they have already pocketed the gains,\" she said. \"This is wrong, and on my watch it will change.\", Bushs campaign responded that Clintons speech was just a collection of \"antiquated proposals\" to \"protect the special interests that want to stifle American ingenuity.\" The campaign of one of Clintons Democratic challengers, former Maryland Gov. Martin OMalley, argued that she didnt go far enough and cited his specific plans to target Wall Street in particular as an example of the \"fearless and progressive new leadership\" needed to fix Americas problems. @evanhalper, 9:24 a.m.: This story was updated with details and quotes from Clintons speech. This story was originally published at 3 a.m.]", "Date": "20150713", "Title": "[Hillary Clinton draws contrast with Republicans as she lays out economic plan]", "Link": "http://www.latimes.com/nation/la-na-hillary-clinton-economy-20150713-story.html\n", "Author": "[Evan Halper, Michael A. Memoli]"}
