{"Content": "[Rand Paul, the heretofore libertarian senator from Kentucky, gave a foreign policy speech to Republican grandees in New York last week with a clear message: Im not an isolationist like my dad. The senators peppery father, the thoroughly libertarian former Rep. Ron Paul of Texas, hardly ever saw a U.S. military intervention he liked. He said George W. Bushs war in Iraq was nuts, suggested that the United States could live with a nuclear Iran and thought stationing U.S. troops overseas was just an expensive way to invite trouble. On Thursday evening in a Manhattan ballroom, Sen. Paul, a probable GOP candidate for president in 2016, declared himself an advocate of conservative realism and named as his models Ronald Reagan, Dwight D. Eisenhower and even (on free trade, not military adventures) George W. Bush. The war on terror is not over, and America cannot disengage from the world, Paul said. Speaking in a way likely to make Dad shudder, he called military force indispensable  when vital American interests are attacked and threatened, and said he supports airstrikes against Islamic State in Iraq and Syria (but not arming Syrian rebels, whom he considers unreliable). But the most intriguing aspect of the speech wasnt Pauls attempt to distance himself from his father; it was his attempt to distance himself from himself. The old Rand, who ran for the Senate expressing strong libertarian views in 2010, is quite different from the new Rand, whos gearing up for a possible presidential campaign. Take the war on terror. A year ago, Paul gained national attention for his filibuster over drone strikes against U.S. members of Al Qaeda. And only a few months ago, Paul said he didnt see any need to act against Islamic State. Why should we choose a side? he asked in a June 19 column in the Wall Street Journal. But after the group beheaded two American journalists in Syria, the new Rand Paul abruptly turned 180 degrees. If I had been in President Obamas shoes, I would have acted more decisively and strongly against ISIS, he said. Then theres U.S. aid to Israel. When he arrived in the Senate in 2011, the old Rand Paul proposed eliminating all foreign aid, including the roughly $3 billion a year that goes to the Jewish state. Should we be giving free money or welfare to a wealthy nation? I dont think so, he told ABC News. But when that position provoked fury from pro-Israel Republicans, the new Rand Paul backed down, voted in favor of renewed military aid and insisted that his point had been misconstrued. In domestic affairs, the old Rand Paul, like his father, disliked federal civil rights laws barring racial discrimination by privately owned businesses such as rental apartments, hotels and restaurants. I abhor racism. I think its a bad business decision to ever exclude anybody from your restaurant. But at the same time, I do believe in private ownership, he said in a 2010 interview. When that kicked up a furor, the new Rand Paul issued a hasty clarification. I would have voted yes, he said, if he had been in Congress when the 1964 Civil Rights bill came up. More recently, the new Rand Paul has not only called for reforming federal drug sentencing laws, which he says discriminate against African Americans, he says he would plow some of the money now spent on prisons into federal job training programs. I was blown away because I was thinking, this doesnt sound like libertarianism to me, the Rev. Kevin Cosby, a Louisville, Ky. civil rights leader who has advised Paul, told the New Yorker. This sounds like big government. And on the social issues dear to a big chunk of the Republican electorate, Paul has been equally difficult to pin down. Like his father, he has vigorously opposed abortion rights, even in cases of rape or incest. Hes introduced the Life at Conception Act, which would guarantee federal civil rights to embryos beginning at the moment of fertilization. But the new Rand Paul roiled the waters by saying he didnt have a problem with Plan B, the day-after pill that may stop a fertilized egg from implanting in the womb. All those newfound nuances may make Paul more palatable to a broader cross-section of primary voters if he decides to seek the Republican nomination in 2016. But hes also created a problem for himself. Some of his original admirers arent sure they like him much anymore. Matt Welch, editor of the libertarian magazine Reason, wrote that Paul was guilty of slipperiness at best, flip-floppery at worst. Paul gets tetchy when reporters ask him about all those seeming changes in position, insisting that hes being willfully misunderstood. A politician can get away with that when its only reporters who are asking. But if he runs, the new Rand Paul will face real live opponents like Jeb Bush and Ted Cruz. They wont let him sidle away from the exotic positions once championed by the old Rand Paul; theyll insist that the new Rand Paul recant, rebut or reaffirm them. And that could mean a splendid debate, pitting the two Rand Pauls against each other  on live television, in split-screen. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus]", "Date": "20141024", "Title": "[The new Rand Paul vs. the old Rand Paul]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-mcmanus-column-rand-paul-20141026-column.html\n", "Author": "NULL"}
