{"Content": "[New Jersey Gov. Chris Christie, saying that the American people have the appetite for hard truths, called Tuesday for cutting Social Security benefits and raising Medicare premiums for future upper-income retirees and raising the retirement age. Although several other Republicans with presidential ambitions have called for changes in the nations giant retirement benefits programs, Christies proposals are more detailed and more likely to generate controversy. His plan would go considerably further, for example, than proposals made in 2010 and 2011 by Rep. Paul Ryan (R-Wis.), when he was House Budget Committee chairman. Republican leaders in Congress have not pushed for such changes in the last couple of years. Although budget hawks continue to warn about the long-term costs of the governments huge retirement programs, the GOP has become increasingly dependent on the votes of older Americans. Roughly half the voters in many GOP primaries in 2012 were 60 or older, according to exit polls. Some Democrats, meanwhile, have begun calling for increases in Social Security checks, particularly for lower-income beneficiaries. In addition to cuts in Social Security and Medicare, Christie also called for giving states more control over Medicaid, the joint federal-state health program for the poor, and for requiring the poor to pay some amount out-of-pocket for their care. He also proposed changes to the Social Security disability program that would limit access to benefits for some people. The proposals, delivered in a speech in New Hampshire, came as Christies presidential hopes have faded. Though he once enjoyed a position atop the potential GOP field, he has languished for the last year as rivals have gained attention. Christies allies have said that he hopes calls for changing popular entitlement programs, such as Social Security, will bolster his image as a truth-teller, unafraid to take bold stands. Some in both political parties will criticize these ideas, Christie said in his speech. Some will surrender to the divisiveness, the fear-mongering and the scare tactics that are generously served on the political menu in Washington, D.C. every day. These are the truths you all know in your gut -- I want to give voice to those common sense truths you already know, he said. I will not pander. I will not flip flop. I am not afraid to tell you the truth as I see it. Without significant changes, Social Security and Medicare will be bankrupt and insolvent by the time you retire, he said to the students in his audience at Saint Anselm College in Manchester. Thats a hotly debated forecast. Projections of the future cost of retirement programs depend a lot on assumptions about inflation, economic growth and, in the case of Medicare, the cost of medical care. In the last several years, medical costs have risen much less than projected, leading the Congressional Budget Office to lower its long-term forecasts of Medicares costs. And projections of Social Securitys long-term finances cover a wide range of possibilities; Christie emphasized the most dire scenarios. If adopted, Christies proposals would significantly reshape Social Security, in particular, changing it from a program that provides benefits for all retirees to one that levies taxes on all workers, but gives benefits primarily to middle- and lower-income retirees. Under his plan, benefits would be reduced for seniors with non-Social Security income of more than $80,000 and eliminated entirely for those with non-Social Security income of more than $200,000. Doing so would affect about 2% of retirees, he said. That idea, known as means testing, has been pushed for many years by those concerned about Social Securitys costs. Christie described the change as a matter of fairness, saying that Social Security exists to ensure that seniors will not grow old in back-breaking poverty, but that those who dont need the help, shouldnt get it. Do we really believe that the wealthiest Americans need to take from younger, hard-working Americans to receive what, for most of them, is a modest monthly Social Security check? he asked. Supporters of the current program have long argued that eliminating universal benefits would erode support for Social Security. Christie said that his proposals would not affect any current retirees or those close to retirement age, but his speech did not specify when the changes should take effect. A spokesman did not respond to a question on that point. For Medicare, Christie proposed a similar change, raising premiums for those with incomes above $85,000. Currently, seniors with incomes at that level pay Medicare Part B premiums equivalent to 25% of the cost of their medical insurance. Christie would raise that to 40%, with the amount increasing to 90% of the full cost for those with incomes above $196,000 per year. He would adopt an equivalent increase for Medicares prescription drug coverage. Christie also proposed increasing the retirement age. Starting in 2022, he would raise the age by two months each year until it hits 69. He would raise the Medicare eligibility age at a similar pace so that it would reach 67 in 2040 and 69 in 2064. He would also eliminate payroll taxes on wages earned by people older than 62. And he proposed switching how the government calculates inflation for determining cost-of-living increases, a proposal that President Obama has backed that would have the effect of reducing the growth of benefits over time. Like Obama, he would increase benefits for seniors 85 or older to offset the reduction in cost-of-living adjustments. Not surprisingly, Christies proposal drew immediate criticism from backers of the current program. Gov. Chris Christie today went after not only seniors earned Social Security benefits, but also their health coverage, in an attempt to further his own presidential ambitions, the Alliance for Retired Americans, a labor-backed group, said in a statement. Raising the Social Security age to 69, means-testing it and eliminating benefits for some is a way to get ones toe under the tent in order to destroy Social Security piece by piece. For more on politics and policy, follow@DavidLauter on Twitter.]", "Date": "20150414", "Title": "[Christie calls for cuts in Social Security, Medicare]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-christie-social-security-20150414-story.html\n", "Author": "[David Lauter]"}
