{"Content": "[Bernie Sanders may not have the big-money donors behind in him in the 2016 presidential race, but the liberal Vermont senator is showing he can raise plenty from regular people, who are lining in up in impressive numbers to give. Sanders campaign announced Thursdaythat it had raised roughly $15 million from 250,000 donorssince he entered the race two months ago. While the amount is dwarfed by the $45 million raised by Democratic frontrunner Hillary Rodham Clinton, it is substantially more thanSandershad been expected to raise and reflects the growing strength of his candidacy. The Sanders fundraising haul comes as polls show him continuing to cut into Clintons lead in the polls. A new survey from Quinnipiac University has Clinton 20 points ahead of Sanders in Iowa. Its a formidable gap, but much smaller than the 45-point lead Clinton hadin Iowa in the same poll in May. Sanders is also gaining ground in New Hampshire, and a rally Sanders held Wednesday night in Madison, Wis.,drew more people than any event Clinton has held so far. The Associated Press estimated the attendance at 10,000. The quarterly fundraising figures the Sanders campaign released Thursdayare typically used as a guide to measure enthusiasm for a candidate. In his case, they confirm his support is broad. The Clinton camp would not say how many individual donors gave to her, a figure that will be available in the federal report the campaigns must file by July 15. The $45 million Clinton raised, though, represents only part of whathascome in for her. Clinton supporters are also raising money from wealthy donors separately, through the Priorities USA \"super PAC.\" There is no limit to what donors can contribute to the group, unlike official campaign funds, which can accept no more than $2,700 per individual. Priorities officials announced Thursday that they had raised $15.6 million -- the bulk of it in just four weeks. Sanders has vowed not to raise money through super PACs, which he says are corrupting democracy. Twitter: @evanhalper]", "Date": "20150702", "Title": "[Bernie-mentum builds as Sanders raises $15 million for presidential run]", "Link": "http://www.latimes.com/nation/la-na-bernie-sanders-fundraising-20150702-story.html", "Author": "[Evan Halper]"}