{"Content": "[The relative comity of the race for the Democratic nomination for president was interrupted last week with an unexpectedly sharp attack video aimed in an unexpected direction. Bernie Sanders is no progressive when it comes to guns, said the narrator of a Web video produced by a \"super PAC\" supporting former Maryland Gov. Martin OMalley. That the first direct attack of the Democratic primary would focus on guns  a second-tier issue -- and Sanders  a long-shot candidate  would have been hard to predict in a race dominated by front-runner Hillary Rodham Clinton and the partys search for an economic message. But as Sanders, the Vermont senator and a self-described socialist, rises in the polls, hes also emerged as the top target  both for those wanting to supplant him as the liberal alternative to Clinton and those arguing that a liberal alternative isnt necessary. It is clear that Bernie Sanders is the most interesting character in the Democratic nomination play at the moment, said Jamal Simmons, a Democratic strategist. Its also clear how Sanders became the hot target. Fueled by his unpolished appeal and unvarnished attacks on moneyedinterests on Wall Street and in Washington, the Sanders campaign is gaining ground  particularly in all-important New Hampshire, where the Vermont senator is a well-known figure. A CNN/WMUR poll released last week found Sanders within 8 percentage points of Clinton. Although Sanders remains a distant challenger in other early-voting states, his status as the progressives protest to the Clinton candidacy is firming up  and the famously cautious Clinton appears unlikely to rely simply on her front-runner status to keep his challenge at bay. Sanders has begun to take hits on three major themes -- gun control, where his record veers some from Democratic party line, his support among African Americans and Latinos, and his broader viability among voters in the general election. Along with the OMalley backers broadside on guns, a close Clinton ally last week labeled Sanders views extreme. A fellow Democratic senator, Claire McCaskill of Missouri, said on MSNBCthat Bernie is too liberal to gather enough votes in this country to be president. She complained that journalists are giving Bernie a pass, particularly in comparison to Clinton, and called for his record to be more closely inspected. Hes against trade  hes against a whole lot of things that are unrealistic in this day and age, McCaskill insisted. The Clinton campaign has not launched any direct attacks on Sanders and largely has stuck to a message heavy on the sort of economic policies the campaign hopes will appease progressives  voting reforms, tax hikes on the wealthy, raising the minimum wage and expanded public preschool. But where Clinton has veered from that script, she has hit issues that strike a contrast to Sanders. In her response to the shooting two weeks ago at a black church in Charleston, S.C. she called for tougher gun laws and noted her husbands passage of a now-expired ban on assault weapons. Clinton went to a black church near Ferguson, Mo. last week and demanded common-sense gun reforms that keep our communities safe as she said more should be done to increase respect on both sides between communities and law enforcement. Sanders campaign has taken a different approach, emphasizing the racist motivations of the shooting suspect in Charleston over the role of stronger gun regulations. Hes happy to have that discussion, said Jeff Weaver, Sanders campaign manager, of Clintons comments. But at the end of the day, its not clear how gun control would have prevented this particular attack. What would have prevented this attack would have been this young man not having this racist hatred in his heart. On Sunday, Sanders argued he had a strong record supporting tougher gun laws  particularly because he comes from a rural state where many hunters are suspect of new gun regulations. Sanders reputation as soft on guns comes in part from his vote against the 1993 Brady Bill, which created mandatory background checks for gun buyers in many sales. Then a member of the House, Sanders argued that it was a matter that should be left to the states. Sanders also voted for the 2005 Protection of Lawful Commerce in Arms Act, a National Rifle Assn.-backed bill intended to protect gun manufacturers and dealers from being sued for negligence when their products are used to commit crimes. The law is opposed by some gun victims families who have sought to hold gun makers accountable for shooting deaths. But Sanders also has voted in favor of a ban on assault weapons and high-capacity magazines. And in 2013, in the wake of the Sandy Hook school massacre, he supported the amendment that would have expanded background checks to all gun sales in a commercial setting, closing whats known as the gun show loophole. That measure fell short of passage. Sandersargued in an interview on ABC News This Weekthat his record showed an understanding of how gun issues play in rural America and would make him a better leader on the effort. If we are finally going to have any serious success, what we need to do is bridge this cultural divide between rural America -- and I represent the very rural state -- and urban America and come up with some common-sense legislation which includes everything that Ive just voted for and maybe more, he said. But one thing we cant have, we cant have people demagoguing against folks just because they go out and hunt and they own guns. On the other hand, rural America has got to understand that guns in Vermont are not the same thing as guns in Chicago where theyre used to kill kids or shoot at police officers. Whether guns will emerge as the damaging weakness in Sanders case to progressives is unclear. Former Vermont Gov. Howard Dean faced similar questions during his bid for the Democratic nomination in the 2004 election. Dean also opposed some tougher gun laws then, breaking from his party. He says he was asked repeatedly about his positions on the campaign trail, but doesnt remember it playing much of a role in his eventual defeat. Sanders bigger challenge will be showing he can connect with African American and Latino voters, Dean noted. Coming from the overwhelmingly white Vermont, its likely new territory for the senator. Bernies coalition is very broad. It is the Ben and Jerry set, but its also white, working-class voters who feel nobody speak for them, Dean said. The only electorate Bernies not been tried against is the electorate of color. Sanders will have to show that he can persuade those voters that they share his economic populism. Thats his steep learning curve, Dean said. Dean, who backs Clinton, dismissed comparisons between his campaign and Sanders bid. Aside from their shared home state and plain-spoken styles, theres not much there, he said. His campaign was about pushing his party to the left, on the war in Iraq as well as healthcare and economic issues. I was really running against the Democratic Party and Bernie is not -- the Democratic Party has become much more populist. The Sanders campaign says it will step up its effort to make its case to African American and Latino voters. Sanders spoke at a conference of Latino officials in Las Vegas this month. Hes due to address the Southern Christian Leadership Conference in late July, where Sanders will probably note his work in the civil rights movement. Black voters just havent heard his message yet, he said. Given the disparity that were seeing in income and wealth in this country, it applies even more to the African American community and to the Hispanic community. And what we are going to do is make a major outreach effort to those communities, let people know my background, let people know my record, and I think were going to do just fine in those communities. For more politicscoverage, follow @khennessey. ALSO:, Chris Christie blasting both parties, enters 2016 race as a long shot, Next batch of Hillary Clintons emails will be released, Lack of clear front-runner in huge 2016 field highlights fractures within GOP]", "Date": "20150630", "Title": "[Bernie Sanders is hot enough on the campaign trail to be drawing attacks]", "Link": "http://www.latimes.com/nation/la-na-bernie-sanders-gun-control-20150629-story.html\n", "Author": "[Kathleen Hennessey]"}
