{"Content": "[The job: Bill Dombrowski is president of the California Retailers Assn. a trade group based in Sacramento that includes most of the countrys largest store chains, including 7-Eleven Inc. Safeway Inc. Macys Inc. Wal-Mart Stores Inc. and Home Depot Inc. For the last 20 years, hes crafted political and legislative strategies for the association, whose members generate more than $570 billion in annual sales and employ nearly 2.8 million people. The association has clout at the Capitol despite its small staff of five. Midwest upbringing: Dombrowski, 59, grew up the youngest of eight children in a Polish American family in Stevens Point, Wis. current population 27,000. His father, Leo, was a janitor at St. Peter Catholic Church. His mother, Philomen, worked at a baby furniture factory after his father died when Dombrowski was 16. \"There was no childhood left. We all had to chip in to cover the debts,\" he recalled. Higher education: Dombrowski graduated with a journalism degree from the University of Wisconsin in Madison in 1976. A year later, he and future wife Susan dumped their record collection in the back seat of a Dodge Dart and headed for Los Angeles. Time to work: Dombrowski found several jobs in Southern California before becoming a spokesman for Carter Hawley Hale, an L.A. retailing conglomerate, which owned the Broadway, Neiman-Marcus and Bergdorf Goodman, among other department and specialty stores. The company spent years fighting off takeover attempts before selling assets, seeking bankruptcy protection and eventually liquidating in the mid-1990s. As the company crumbled, Dombrowski, then 39, leveraged his connections with the retailers association to become the organizations president. The family with two sons, Chris, now 28 and a political campaign consultant, and Thomas, now 25, a law student, moved to Sacramento. Big issues: Dombrowski became the retailers political guide as California businesses struggled to cope with deregulation, immigration and globalization. One of the first challenges he faced was a scandal involving near-slavery conditions for Thai garment workers at an El Monte sweatshop in 1995. \"It was horrible,\" he said. \"We were also victims. We were deceived, but we assumed responsibility for a financial settlement.\" Dombrowski backed subsequent successful legislation tightening regulations on garment sewing operations. In 1996, the retailers supported a pioneering electricity deregulation bill that turned into a fiasco. The states biggest utilities nearly collapsed financially. Rolling blackouts in 2000 and 2001 contributed to the recall of then-Gov. Gray Davis. \"It all sounded great with the free market,\" he said. \"But electricity is very complicated.\", A decade later, Dombrowski and so-called bricks-and-mortar stores won one of their most important legislative victories: a deal that required Internet retail leader Amazon.com and many other major online sellers to collect sales taxes on purchases made by Californians. \"It had to be done,\" Dombrowski said. Amazon \"had grown to be so big.... It already destroyed the book industry and was going after home furnishings.\", In 2013, retailers lost a round, failing to stop the Legislature from hiking the minimum wage to $10 an hour by 2016. Biggest lesson: Dombrowski said he learned the sharp difference between right and wrong from the Sisters of Joseph, his teachers at a parochial school in Stevens Point. As a result, he said, he always tries to be honest, especially in the rough-and-tumble political world of the California statehouse. \"I tell people exactly what Im thinking and what I want to do,\" he said. \"Im stunned how many times people dont believe me.\", marc.lifsher@latimes.com, Twitter: @MarcLifsher]", "Date": "20140420", "Title": "[How I Made It: Bill Dombrowski, California Retailers Assn. president]", "Link": "http://www.latimes.com/business/la-fi-himi-dombrowski-20140420-story.html", "Author": "NULL"}