{"Content": "[Texas and California are like bookends, each bracing opposite ends of the political spectrum. Texas is solidly Republican, California deeply Democratic. They buttress the two major parties, as a vital source of campaign cash, as red and blue emblems and, in presidential races, as a big chunk of their Electoral College base. Democrats last carried Texas in 1976. Republicans havent won California since 1988. There have been attempts. In 1988, Democrat Michael Dukakis picked Texas Sen. Lloyd Bentsen as his running mate in a reach to win the Lone Star state. Dukakis ended up losing Texas by 13 points. In 2000, George W. Bush targeted California and boldly stumped in the state on the last weekend of the hairs-breadth campaign. He lost California by 11 points and might have better spent his time in Florida. Since then, no fall presidential candidate has expended serious effort in either Texas or California, each party effectively ceding one megastate to the other. (Here we discount fundraising stops and springtime platitudes about running a 50-state campaign on the theory that what matters is spending money and the appearances candidates make after Labor Day.), But change, partisans insist, is in the offing. Democrats will tell you Texas is growing more competitive, as Latino voters gain in numbers and political strength. Republicans say California is ripe for realignment, as Democrats overreach in Sacramento and divisions open between coastal liberals and more conservative voters inland. There will likely be little evidence of either occurring Tuesday. Both Texas and California are in the midst of attemped reclamation projects, an effort to rebuild struggling parties from the ground up, led by a pair of underdog candidates for governor, Democrat Wendy Davis and Republican Neel Kashkari. Davis catapulted to international celebrity after an 11-hour filibuster to block tough anti-abortion legislation from passing the Texas Senate. Kashkari, a businessman unknown even in parts of California, was the favorite of the GOP establishment over a tea party challenger who, party powers feared, would only further antagonize centrist Californians. Both have strived to distance themselves from the extremes associated with Washington and, more, their own parties. Kashkari has aligned himself with Californias live-and-let-live credo by endorsing same-sex marriage and legal abortion, and broken with GOP orthodoxy by, among other positions, supporting background checks for gun buyers and a path to citizenship for people in the country illegally. Davis, like the conservative Democrats who once prevailed in Texas, has run on a largely pro-business platform, endorsed \"open carry\" legislation allowing pistols to be worn in public view and even supported a 20-week limit on abortions, which was the aim of the bill she filibustered. (Though Davis qualifier that women and their doctors should have discretion in choosing abortion in cases beyond 20 weeks would effectively nullify that legal limit.), Changing the political complexion of states as big as Texas and California, however, seems too monumental for either candidate; both Davis and Kaskhari seem certain to lose Nov. 4. The only question is how badly. If Davis, for all her celebrity and formidable fundraising, suffers the same nearly 13-point margin of defeat as Houston Mayor Bill White in 2010  or loses even bigger  it would be hard to argue she made much of a Democratic dent in fortress Texas. (It would also be a blow to the savants behind President Obamas targeting-and-turnout operation, who launched the much-hyped Battleground Texas in a bid to hasten a red-to-blue conversion.), Similarly, if Kashkari finishes in the 38%-to-42% range of recent GOP gubernatorial hopefuls not named Arnold Schwarzenegger, he might have saved the wear and tear by spending the past year body-surfing at home in Orange County. True, Republicans might gain a California toehold if down-ballot candidates Ashley Swearengin or Pete Peterson win their competitive races for controller or secretary of state  though both conspicuously distanced themselves from the GOP, even going so far as to refuse to endorse Kashkari. In short, dont expect to see much of the Democratic presidential ticket in Texas or the Republicans in California after Labor Day 2016. Maybe in 2020. mark.barabak@latimes.com, Twitter: @markzbarabak]", "Date": "20141101", "Title": "[Partisan hurdles too high for Davis in Texas, Kashkari in California]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-politics-20141102-story.html\n", "Author": "[Mark Z. Barabak]"}
