{"Content": "[Hello. Im Davan Maharaj, the editor of the Los Angeles Times. Here are some story lines you shouldnt miss today.     Subscribe to the newsletter , TOP STORIES, Caught On Video, Then Murder Charge, It began with a traffic stop in South Carolina and ended with a murder charge against North Charleston Officer Michael Thomas Slager. The white officer claimed in a report Monday that Walter Lamer Scott, a black man, wrestled him for a police stun gun. Video released last nightshowed Slager chasing Scott and firing eight shots at him. The shooting reignited a debate on excessive police force and race relations,after killings of unarmed men in New York, Cleveland and Ferguson. \"Its not about race. Its about power,\" an attorney for the Scott family told The Times. \"That officer thought he could just shoot this man. He thought Mr. Scott was expendable.\", Mideast Nukes, Israel is hardly the only Mideast nation worried that Iran someday will have nukes. Thats why President Obama is offering firmer pledges to defend Saudi Arabiafrom possible attack in exchange for support for a deal to limit Irans nuclear program. Would that include a U.S. \"nuclear umbrella\"? That isnt clear. But if Iran gets a bomb, the Saudis will want one too. The Libertarian Way?, Sen. Rand Paul isnt sure the Republican tents big enough to elect a U.S. president.So hes charting a daring path, with un-GOP-like appeals to blacks, Latinos and people who hate foreign wars and the feds spying on their cellphones. Hes also trying to appeal to traditional Republicans, though, and thats the rub. Attacks from the right already have started. NFL in L.A.: Nine Scenarios, The question no longer is whether the NFL returns to L.A. but how. In play: the Rams, Chargers and Raiders; stadium plans well underway in Inglewood and Carson; and owners who seem ready to move in 2016. That adds up to nine possible outcomes, writes the Times Sam Farmer, who also handicaps them. In first place: Rams in Inglewood. In last place: No NFL moves. Kolkata Blues ... and White, To make a baseball comparison that would be lost on cricket-mad India, one of that countrys biggest cities has been done up a bit like Dodger Stadium on opening day. It started when a rabble-rousing politician came to power and decided that Kolkata needed a makeover. She decreed that everything be painted blue and white. And she meant everything: government buildings, police stations, curbs, overpasses, bus stops, food stalls, bridges, taxis, tree trunks, traffic cones and even trash compactors.Its todays Great Read by Shashank Bengali. Hard Water Rules, So far, the emphasis has been on gentle nudging and \"education.\" It has actually saved a lot of water in many areas, but it probably wont be enough. With the drought in its fourth year, some urban areas are being told to cut use by 35% in the next year. Read what water providers, under growing pressure from the state, could do to make people conserve more. Counting Calories and Gallons, Weight watchers count calories. In drought-stricken California, perhaps people should count how much water it takes to make their meals. My breakfast of eggs, potatoes, asparagus and grapefruit juice required 293 gallons! I know because the Times Graphics Department put together thiscool interactive graphic. See how much water your meal consumed. CALIFORNIA, -- Fire rips through part of a commercial building near downtown L.A. briefly trapping people until firefighters could evacuate them by ladder. -- Traffic court fines and escalating penalties lead to license suspensions for 1 in 6 drivers, a study finds. The poor are hit hardest. -- Some nonprofit charities in the area struggle with the idea of having to pay a higher minimum wage. -- How a firefighters union defendsthe L.A. county departments practice of hiring large number of relatives. -- L.A. Countyagrees to pay $5.3 million in a fatal shooting by deputies in Compton in 2012. NATION-WORLD, -- Gallup, N.M. -- \"Drunk Town USA\" -- fights a deadly winter combination of alcohol and freezing weather. -- Al Qaedas affiliate in Yemen appears to be capitalizing on the chaosthere to extend its reach. -- Assailants kill at least 16 Mexican police in an ambush in Jalisco state. BUSINESS, -- Pacific Gas & Electric Co. may face a record $1.6-billion penaltyfor negligence leading to the deadly natural gas explosion in San Bruno. -- Consumer groups ask the FCC whether phone companies can do more to block robocalls. -- California enlists Google and Microsoftin the war on unlicensed payday lenders. SPORTS, -- Bill Plaschke: Tiger Woods shows a kinder, gentler side on his return to the Masters. -- UConn beats Notre Damefor its third consecutive NCAA womens basketball title. -- The latest scores and stats. ENTERTAINMENT, -- Billy Crystal and Josh Gad are TVs newest odd couple in FXs The Comedians, which premieres Thursday. -- Don McLeans \"American Pie\" manuscriptsells for $1.2 million. Passings: Stan Freberg, 88, master of comedy parodies and commercials. James Best, 88, actor who played the sheriff in \"The Dukes of Hazzard.\", WHAT OUR EDITORS ARE READING, -- The politics behind Obamas coming visit to Kenya. -- Why Jamaicans wish Obama would visit more often. -- Grape expectations: Historic wineries in Northern California. -- Defeatsmay have made Shabab more disciplined -- and deadlier, ONLY IN L.A. Angelenos dont care much what outsiders say. Sometimes its worth a listen. Our SoCal Moments team took special note of the photos of a recent British transplant, Nicola Buck, a mother of two, and asked for some comments. (\"In England the tendency is to downplay your talents. ... In Los Angeles, you are who you say you are.\"). Check out a Britons take on L.A. Please send comments and ideas to Davan Maharaj.     Subscribe to the newsletter ]", "Date": "20150408", "Title": "[Today: Murder Charge for Cop. Mideast Nukes.]", "Link": "http://www.latimes.com/local/california/la-me-todays-headlines-20150408-story.html\n", "Author": "NULL"}
