{"Content": "[As Wisconsin Gov.Scott Walkerhas jumped into the front ranks of GOP presidential hopefuls over the last several weeks, he has shifted further to the right on such issues as abortion and immigration, closely aligning himself with the views of conservative activist voters he hopes will propel his candidacy. The latest example came Monday as Walker signed a bill that reduces the power of private-sector unions. The new law ends unions ability to collect mandatory fees from workers they represent who refuse to join and pay dues. Wisconsin is the 25th state, and the third in the industrial Midwest, to adopt such a law, which its supporters call right-to-work. Walker lost no time in trumpeting the move, sending a fundraising email predicting the law would have an \"immediate positive effect on our economy.\", \"Labor bosses will never forgive me for taking away their power,\" Walker told supporters, asking for money to \"continue our conservative reforms.\", Voters nationwide will probably see a lot more of that aggressive approach to conservative goals from Walker. As much as any politician this decade, he has built his career around the insight that in highly polarized times, the path to victory lies through mobilizing ones own partisans, not trying to appeal to sometimes-mythical centrists. His course on the union bill shows how Walker has sought to turn up the volume on his conservatism as he has pursued his still-unofficial drive for the 2016 Republican presidential nomination. Right-to-work laws have been a conservative goal since the 1940s, but Walker had distanced himself from them until recently. \"I dont have any interest in doing anything to private unions. I think the private unions are a key part to getting this states economy going,\" Walker said at a news conference early in 2011. That remark came during the bitter fight over his bill to strip Wisconsins government-worker unions of most collective bargaining powers. His successful battle with those unions defined Walkers first term and made him a national conservative hero. But Walker kept a hands-off position on private-sector unions. At one point, he said he would \"do everything in my power\" to keep a right-to-work bill from coming to his desk. Late last year, when Republicans who hold the majority in the state Legislature pushed the bill, Walker called it a \"distraction.\" That drew criticism from some prominent conservative voices, including the Wall St. Journals influential editorial page. Earlier this year, he changed course and said he would sign the bill. The pledge to stave it off, he now says, applied only to his first term. Walkers moves on right-to-work and other issues have bolstered his claim on becoming the main conservative alternative to former Florida Gov. JebBushin the GOP presidential race. Thats particularly crucial in Iowa, where conservatives play a big role in the caucuses that kick off the national nominating season. Recent polls have shown Walker with support from between one-fifth and one-quarter of potential caucus voters, putting him atop the field and well ahead of Bush. Mark Costello, 53, who grows corn and soybeans on about 500 acres outside Imogene, in western Iowa, is typical of the potential caucus goers who are giving Walker favorable reviews. \"Right now, I really like Gov. Walker,\" he said at a candidate forum over the weekend. \"I really like what Gov. Walker has done with some of his boldness.\", Boldness defines Walkers approach. After winning the governors job in 2010, he launched his collective bargaining bill as a surprise; it had not figured in his campaign. He won passage of the measure in 2011, defeated a recall campaign in the spring of 2012, then won reelection last year. His repeated victories in a state that has gone to the Democrats in every presidential election since 1984 have increased his attraction for national conservative groups, big donors and many Republican voters. \"Hes the only Republican in my lifetime who has actually beaten the Democrats at something  substantively defeated  at least since Reagan,\" said Steve Deace, a well-known Iowa conservative talk-radio host. Walkers ascent has drawn Democrats attention as well. President Obama issued a statement Monday night saying he was disappointed by what he called an \"anti-worker law\" that would harm \"hardworking middle-class families.\", With voters like those in Deaces audience key to Walkers political future, he has moved right on several other issues this winter. Until recently, for example, he tried to downplay abortion. Late in 2013, at a breakfast with reporters in Washington, Walker said Republicans should emphasize an economic message, not social issues. \"As governors, we focus on the things that matter most to people,\" he said, listing jobs and the economy. \"Im pro-life,\" he added. \"I dont apologize about it, but I dont focus on it.\", Nearly a year later, in his campaign for reelection, he faced Democrat Mary Burke, who did focus on abortion. Walker ranan adcalling the decision on whether to end a pregnancy an \"agonizing one\" on which \"reasonable people can disagree.\" Legislation he had backed as governor \"leaves the final decision to a woman and her doctor,\" the ad said. This month, he took a sharper-edged tone, saying inan open letterto a prominent antiabortion group that he would sign a bill in Wisconsin to ban all abortions after 20 weeks of pregnancy. On immigration, Walker had made a number of ambiguously worded statements over the last couple of years that suggested he could support a path to citizenship, or at least legal status, for the estimated 11 million immigrants in the U.S. illegally. \"My view has changed,\" Walker said in aFox News interviewthis month. A plan such as the one that passed the Senate in 2013, which allows unauthorized immigrants to pay fines, to go through a waiting period and then to qualify for citizenship, amounts to \"amnesty,\" he said, echoing the stand taken by conservative opponents. \"I dont believe in amnesty,\" he said. Those shifts reflect a strategic imperative Walker faces  the need to consolidate conservative support, particularly in Iowa. \"If he doesnt win Iowa, I dont see the path for him,\" a veteran GOP strategist in the state who is expected to support Bush said over the weekend, speaking on condition of anonymity to assess a potential rival. That statement reflects the Bush campaigns desire to set expectations high for Walker in Iowa. But most analysts would agree that if Walker cant win in a neighboring state with a large number of voters who share his conservative politics and evangelical faith, hes not likely clear of the field elsewhere. Playing to Iowa voters has extended to parochial issues as well as national ones. In the past, Walker had espoused a free-market position in expressing doubts about a federal law that mandates the use of ethanol in gasoline. But opposition to the ethanol rule, known as the Renewable Fuels Standard, would put him at odds with many Iowa corn and soybean farmers who have profited significantly from it. Over the weekend, at an Iowa candidate forum sponsored by supporters of the ethanol mandate, some GOP hopefuls stuck to the free-market stance. The two Texans likely to join the race, Sen. Ted Cruz and former Gov.Rick Perry, both criticized ethanol requirements. Walker did not. \"Its something Im willing to go forward on,\" he said. david.lauter@latimes.com, Twitter: @DavidLauter, seema.mehta@latimes.com, Twitter: @LATSeema, Lauter reported from Washington and Mehta from Des Moines. 8:01 p.m.: The story was updated throughout with new details. 12:27 p.m.: The story was updated with additional information about Gov. Scott Walkers positions on immigration, abortion and other issues and quotes from voters in Iowa and Republican strategists. The story was first published at 9:47 a.m.]", "Date": "20150309", "Title": "[GOP presidential hopeful Scott Walker shifting further to the right]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-walker-right-to-work-20150309-story.html\n", "Author": "[David Lauter, Seema Mehta]"}
