{"Content": "[Is Hillary Rodham Clinton a McDonalds Big Mac or a Chipotle burrito bowl? A can of Bud or a bottle of Blue Moon? JC Penney or J. Crew?\", That was the opening question of a front page Washington Post story on Clintons effort to figure out her \"brand.\" To that end, she has recruited a team of corporate marketing specialists to \"help imagine Hillary 5.0.\", \"Its exactly the same as selling an iPhone or a soft drink or a cereal,\" Peter Sealey, a longtime corporate marketing strategist, tells the Washington Post. \"She needs to use everything a brand has: a dominant color, a logo, a symbol.... The symbol of a Mercedes is a three-pointed star. The symbol of Coca-Cola is the contour bottle. The symbol of McDonalds is the golden arches. What is Clintons symbol?\", A columnist less charitable might be tempted to suggest some symbols for Bill Clinton. But for Hillary, thats a tougher question. Which is why the Hillary Industrial Complex is setting up a Manhattan Project to answer the question \"Who should Hillary be this time?\", Theyll have their work cut out for them. More than any other politician in American life today, Hillary Clinton is an ironic figure. When she does or says anything, friends and foes alike ask, \"Why did she do that?\" \"What was she thinking?\" No one takes Clinton at face value because it seems that, after decades of public life, even Clinton doesnt really know who she is  or at least who she should be this time around. Her fear of giving the wrong impression  before she can figure out what the right impression would be  has understandably encouraged risk aversion. Even friendly reviewers proclaimed that her book \"Hard Choices\" read like it was written by a subcommittee tasked with avoiding saying anything. Fortunately, that will all change soon, now that Clinton has enlisted the help of the Purpose Institute, whose co-founder Haley Rushing is known as the \"chief purposologist. Really. Alas, Rushing is not working on the Clinton campaign, but the institutes other co-founder, marketing guru Roy Spence, is onboard. By all accounts, Spence is great at what he does. Why, he conceived the \"Dont Mess With Texas\" anti-littering campaign. Risking the accusation of damning Clinton with faint praise, let me say Clinton isnt litter. Nor is she a Big Mac or an iPhone. Shes a human being who has been on the public stage for nearly four decades. And yet, according to the New York Times, she has a team of 200 policy advisors trying to figure out how to \"address the anger about income inequality without overly vilifying the wealthy.\", Brain trusts are fine, but this isnt merely that. Since her days trying to overhaul healthcare, Clinton has been the kind of wonk who thinks you can solve every problem by consulting enough experts and compiling enough data. There are some tasks that lend themselves to such approaches, but electoral politics isnt one of them. Her husband knew that. He may not be able to put the formula in a strategy memo, but Bill Clinton could riff off the cuff in a way that could thread such needles with ease. That natural talent didnt become community property when Bill and Hillary got married; she doesnt have the gift. And so she compensates by controlling the things that she can control: an ever-expanding retinue of consultants and advisors who tell her not to worry about the missing ingredient. Thats what theyre there for. The hitch is that the desperate quest to find a brand is itself a kind of branding. Former Republican Florida Gov. Charlie Crist tried to rebrand himself as a liberal Democrat in his bid to get back his old job. He lost in large part because the only image that stuck was his craven political opportunism, not Charlie Crist 2.0. No doubt many voters  and pundits  will happily buy whatever they come up with for Clinton. But others will focus not on whats new in Hillary 5.0, but what is a constant in all of the versions so far: a purpose defined by the pursuit of power. jgoldberg@latimescolumnists.com, Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150223", "Title": "[ Hillary Clinton's identity crisis]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0224-goldberg-hillary-clinton-5-0-20150224-column.html", "Author": "NULL"}