{"Content": "[Former New York Gov. George Pataki is the latest Republican to get into the race for president. In a video posted Thursday morning on YouTube, Pataki says America needs to recapture the spirit of unity that spread through the country in the wake of the 9/11 terrorist attacks. He was in his second of three terms as governor when the attacks struck New York and Washington, and Pataki highlights his role in New York and the countrys recovery in the video. \"We are all in this together. And let us all understand that what unites us is so much more important than what might seem superficially to divide us,\" Pataki says in the video which includes a logo that reads, \"Pataki for President.\", Pataki is expected to formally announce his candidacy later Thursday. Hes scheduled to speak in Exeter, N.H. which served as the state capital during the Revolutionary War and claims to be the birthplace of the Republican Party. After flirting with the idea of a White House run in both 2008 and 2012, Pataki starts the 2016 campaign as a long shot in a crowded Republican field that includes several current and former governors, sitting senators, business leaders and a renowned neurosurgeon. Pataki has cited his electoral success in a heavily Democratic state  he knocked off liberal icon Mario Cuomo to become governor in 1994  and ability to work with Democrats as among his strengths. He cast himself in bipartisan terms as he outlined his background in the video, which was set in a skyscraper in New York City. \"My vision was not a partisan vision, it was a vision about people, about what we could accomplish together,\" he says. Yet hes spent recent months promoting his conservative credentials, as those running for the Republican nomination invariably do. In an earlier trip to New Hampshire, he campaigned against President Obamas healthcare law, criticized Obamas executive order to offer protections against deportation to millions of immigrants living in the country illegally, and said the nation cant afford another Democratic president. He also has called for less government spending and limiting government power. \"Washington has grown too big, too powerful, too expensive, too intrusive,\" Pataki says in the video. \"We the people, not Washington, are equipped to lead this country.\", Pataki, 69, has worked as a lawyer and opened a consulting firm since leaving office in 2006. Hes been a frequent visitor to the early nominating states of Iowa and New Hampshire over the years, and has made more than half a dozen trips to New Hampshire this year alone as he explored a 2016 campaign. His earlier efforts never resulted in a full-fledged campaign, however.]", "Date": "20150528", "Title": "[George Pataki announces presidential bid]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-george-pataki-presidential-bid-20150528-story.html\n", "Author": "NULL"}
