{"Content": "[Evoking his youth and familys immigrant experience, Sen. Marco Rubio announced Monday that he is running for president, the third Republican to join a race he hopes to dominate by wrapping his conservative politics in an only-in-America story. Speaking at Freedom Tower in downtown Miami, known as the Ellis Island of the South for welcoming Cuban exiles, the young Florida senator displayed the skills that make him one of the partys more gifted communicators. \"Now, the time has come for our generation to lead the way toward a new American Century,\" he told the crowd. At risk of being overshadowed by the launch of Hillary Rodham Clintons campaign, Rubio, 43, emphasized the contrast he makes with the Democratic frontrunner and portrayed himself as a fresh voice from a new generation of tea party Republicans. While our people and economy are pushing the boundaries of the 21st century, too many of our leaders and their ideas are stuck in the 20th century, he said, adding that America wont succeed by going back to the leaders and ideas of the past. We must change the decisions we are making by changing the people who are making them. Rubios event was modest by contemporary campaign standards, an intimate introduction at the historic venue before a crowd of nearly 1,000, many of whom paid $3.05 for tickets -- a nod to youth culture that labels a city by its telephone code. It was broadcast on a large screen outside. Rubio leaned heavily on his upbringing as the American-born son of Cuban immigrants -- his father a bartender, his mother a maid -- who only later in life appreciated the success he could achieve in the United States. Surrounded by his wife and four young children, Rubio said he rebuffed advice from some to wait and run again when he is older and has more experience. \"But I cannot,\" he said. \"Because I believe our very identity as an exceptional nation is at stake, and I can make a difference as president.\", Central to Rubios struggle, particularly in Miami, is former Gov. Jeb Bush, the mentor turned rival, who can easily overpower Rubio for donors and support as the two Floridians divide party loyalties. Sen. Ted Cruz (R-Texas) and Sen. Rand Paul (R-Ky.) have also announced their candidacies for president. David Winston, a Republican pollster and strategist, said the challenge for Rubio, like all the Republican candidates, will be to deliver a compelling message. \"Hes got to decide who he is, lay out his principles and lay out a vision for the country that people can get behind, Winston said. In many ways, Rubios route to the partys nomination is similar to one that pushed President Obama from underdog status to the White House. Rubios backers see in him an inspirational figure able to tap an electorate hungry for a compelling candidate, one who can convey the partys conservative policy prescriptions with his boyish charm and uplifting personal story. Florida Republican strategist Rick Wilson said few candidates can deliver the \"pure, raw, wild talent that Marco Rubio has for communicating a big, optimistic vision.\", \"What I really like was his coming up from nothing to something,\" said Olga Golden, who immigrated to the United States as a young child with her parents from Cuba, and is now a speech therapist in Miami. A Republican, she voted for Rubio for Senate, but joined Mondays event to hear from him. \"Im hoping he can bring people together, she said. \"And hes very cute, too.\", Outside Freedom Tower, some immigration activists protested against Rubios announcement. After theMiami kickoff, Rubio plans to return to Washington for a Senate hearing about Iran sanctions, and then return to the campaign trail in New Hampshire on Friday. Twitter: @lisamascaro]", "Date": "20150413", "Title": "[In Miami, Sen. Marco Rubio calls 2016 election a 'generational choice']", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rubio-speech-20150413-story.html\n", "Author": "[Lisa Mascaro]"}
