{"Content": "[Donald Trump was the one taking flak Friday for appearing to condone a supporters inaccurate and anti-Muslim comments at a New Hampshire town hall, but the rest of the GOP field was taking note. Given the considerable share of Republican voters who tell pollsters they believe President Obama is Muslim and questions his birthplace, it may only be a matter of time before the other candidates find themselves in a similar spot. This is a defining moment for all of us, South Carolina Sen. Lindsey Graham said Friday on MSNBC.  At the end of the day, this is a defining moment for Mr. Trump. The man in that audience has to be put in his place by the person who is answering the question. I dont think it is going to be good for the Republican Party to elect somebody as their nominee, to make somebody the nominee, who doubts that President Obama was born in Hawaii. The birther strain in the partys base, which critics say feeds off a prejudice against Muslims, has caused problems for the Republican Party since Obama first ran for president. Democrats have used it to paint the whole party as racist and preoccupied with fringe conspiracies. Its reemergence comes as the party is already struggling with disparaging comments about Mexican immigrants made by Trump, the front-runner for the GOP presidential nomination. Although some prominent Republicans have publicly disavowed the theories over the years, others, including Trump, have validated the swirl of claims about the presidents birthplace and fed them with their own questioning or pointed silence. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, We have a problem in this country. Its called Muslims, an unidentified man said to Trump at a town hall in Rochester,N.H. onThursday night. You know our current president is one. You know hes not even an American. Trump appeared to nod. We need this question, he said, chuckling. This is the first question. When the man went on to inquire about training camps growing and asked When can we get rid of them? Trump only addressed that part of the question, saying: Were going to be looking at a lot of different things. The presidentis Christian and speaks often about his faith. He occasionally attends and contributes to St. Johns Episcopal Church across from the White House. He was born in Hawaii. His mother was a U.S. citizen from Kansas and his father was Kenyan. On Friday, Trump abruptly pulled out of a candidate forum in South Carolina, where heprobably wouldhave been asked about the exchange, citing a significant business transaction that was expected to close Thursday. The campaign declined to comment on the exchange, but Trump spokeswoman Hope Hicks said his decision to cancel the appearance in South Carolina had nothing to do with the encounter in New Hampshire. AlthoughGraham called on Trump to apologize on television, not all of Trumps rivals were as critical. Both New Jersey Gov. Chris Christie and former Arkansas Gov. Mike Huckabee said Friday that they would have handled the episode differently, but declined to criticize Trump. I dont know what Donald Trump heard, Huckabee told reporters at the California Republican Party Convention in Anaheim, where he was slated to speak. If Id have understood what the person said, I would have said, Look, there is no evidence whatsoever that Barack Obama is anything other that what he professes to be, which is a Christian. I take him at his word for that. Democrats were far less generous. In a tweet, former Secretary of State Hillary Rodham Clinton, who is seeking her partys nomination, called Trumps reaction disturbing and just plain wrong.\" On the stump on Friday, she told Trump to start acting like a president. The White House was more direct in linking such sentiments to the Republican Party. The people who hold these offensive views are part of Mr. Trumps base, White House Press Secretary Josh Earnest said, noting that he has the biggest base of any Republican politician these days. A spokesman for House Speaker John Boehner said Earnests comment had crossed the line. These types of disgusting, over-the-top attacks only divide Americans and make it that much harder to find common ground on the important issues facing our country, said Cory Fritz. AlthoughEarnests comment was politically motivated, there is some evidence that Republicans are more likely to acknowledge holding more negative views about Muslims. A Pew Research survey conducted last year found Republican and Republican-leaning respondents viewed Muslims more far more negatively than they viewed other religious groups, with the exception of atheists. Democrats and Democratic-leaning respondents said they held the least warm feelings about Mormons, although there was less difference in their feeling toward other groups. A less-recent Gallup study looked at data from 2007 through 2009 and found 50% of those who reported a great deal of prejudice toward Muslims identified as Republicans, while 17% identified as Democrats and 7% as independents. To be sure, it is difficult to determine whether these surveys are picking up a greater prevalence of prejudice among Republicans or just a greater willingness to acknowledge bias. On the question of the presidents religion and birthplace, the partisan divide is stark. In a CNN/ORC survey conducted this month, 43% of Republicans saidthey believe Obamais Muslim, compared with 29% of Americans overall. Among those who identified as Trump supporters, the number was 54%. Its not clear whether Trump would count himself in that group. But hehas continued to question the presidents birthplace, the issue that catapulted his political career four years ago. After demands from Trump and others, Obama in 2011 released his long-form birth certificate showing he was born in Hawaii. Asked in July whether he was still a birther, Trump said he no longer wants to focus on that topic. I dont know what the hell it was, but it doesnt matter, he said of the birth certificate. Honestly, I dont want to get into it. MORE IN POLITICS:, Sen. Barbara Boxer lashes out at Carly Fiorina as \"mean-spirited\" face of corporate greed, Podcast: Is Bernie Sanders off-limits for black reporters?, A peek inside the spin rooms chaos and characters]", "Date": "20150918", "Title": "[Republican rivals join in on assailing Trump for supporter's anti-Muslim remarks]", "Link": "http://www.latimes.com/nation/politics/la-na-politics-trump-muslims-20150918-story.html", "Author": "[Kathleen Hennessey]"}