{"Content": "[In her first extended public remarks about the recent deadly attacks in Paris, former Secretary of State Hillary Rodham Clinton said Wednesday that Americans \"cant close our eyes\" to the \"dangerous strain of extremism within the Muslim world.\", Speaking at a luncheon in Winnipeg, Canada, Clinton said that Western democracies are engaged in a \"contest of ideas and values\" that she characterized as a \"generational challenge.\", \"The slaughter of satire writers and Jews and police officers sharpened the true contours of this struggle,\" she said. \"Were not contesting against the vast majority of Muslims,\" who are \"peaceful and tolerant people,\" Clinton added. \"But we cant close our eyes to the fact that at this time in our world history, there is a distorted and dangerous strain of extremism within the Muslim world that continues to spread. Radical Islamistsare \"few in number\" but have \"the capacity to cause huge damage,\" Clinton said, adding that \"we are confronting an ideology of hate\" that is \"based on a claim to absolute truth and total intolerance for the beliefs and rights of their fellow human beings. In her remarks, Clinton, who is widely expected to make an announcement this spring that she is running for president, also talked of the need to reverse the trend of rising income inequality in the U.S. and other developed nations. She noted that Canada had adopted policies that have slowed the growth of inequality in that country. The proposals that President Obama outlined in his State of the Union speech Tuesday night were an \"important start for a critical debate,\" she said. In a question-and-answer session after the speech, which was sponsored by the Imperial Bank of Canada, Clinton declined to offer an opinion on the proposed Keystone XL pipeline, which would run from Canadas tar sands deposits to refineries on the U.S. Gulf Coast. The pipeline is under review by the State Department, and Clinton said that commenting on it while it is \"in our process\" would be inappropriate. She offered strong support forObama in his confrontation with Congress over further sanctions against Iran. The U.S. and five other world powers have been negotiating with Iran over the future of itsnuclear program, attempting to head off the possibility that Tehran is developing atomic weapons. With the negotiationsfacing a June deadline, many members of Congress in both parties have argued for new sanctions legislation that, they say, would put added pressure on Iran to come to terms. Obama argues that new legislation could cause the collapse of the talks. Clinton adopted that argument. Insofar as we know,\" she said, \"the Iranian nuclear program has been put on hold by the current interim agreement between Tehran and the other governments. Circumstances are moving in our direction, and what could blow it up would be for the United States to give an excuse for other countries to break ranks. If the U.S. Congress imposes sanctions now, she said, then I think its highly likely that Russia and China would break with the U.S. That would be a very serious strategic error. Why do we want to be the catalyst for the collapse of negotiations?, Clinton did differ from the administration on another foreign policy issue, however -- aid to Ukraine. The U.S. should give \"new equipment\" and training to allow Ukraine to defend its borders, she said. The administration has so far stopped short of that. For more on policy and politics, follow @DavidLauter on Twitter. ]", "Date": "20150121", "Title": "[Hillary Clinton warns U.S. 'can't close our eyes' to Muslim extremism]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-hillary-terrorism-20150121-story.html", "Author": "[David Lauter]"}