{"Content": "[Who will be Californias next U.S. senator, replacing the retiring Democrat Barbara Boxer?, Itll be another Democrat, bet on that. State Atty. Gen. Kamala Harris, 50, is the early front-runner. But well have to see how she performs running for a big-time office. Former Los Angeles Mayor Antonio Villaraigosa, 61, is sounding like a candidate. And he probably should be. He desires higher office, and this is likely his best shot. Billionaire climate-change activist Tom Steyer, 57, probably wont run. And he probably shouldnt. Theres a long history of failure in California for mega-rich political neophytes trying to start their elective careers at the top. But there are some wild-card members of Congress who could jump into the race and tilt it one way or the other. And thats just for 2016. Suddenly in the past week, the political picture for 2018 also has become a bit clearer. Who will succeed the finally termed-out Gov. Jerry Brown? It wont be Harris if she wins the Senate seat. And if she loses, shell be damaged goods. Lt. Gov. Gavin Newsom, 47, quickly took himself out of the Senate speculation, refreshingly asserting that \"its always better to be candid than coy.\" Hes obviously planning to run for governor, the job he covets, although you wont be hearing him say that publicly for a while. \"I dont want to get ahead of myself,\" Newsom told me. \"But Im here for the long haul. Hopefully, Im on a path.\", A path to the governors office. The former San Francisco mayor, a fifth-generation Californian, has a special interest in governing the state, where theres so much family history. The first California Newsom arrived here during the year of statehood, 1850. His grandfather developed Squaw Valley, site of the 1960 Winter Olympics, and was a pal of Gov. Pat Brown, Jerrys dad. \"My life is California,\" he says. \"Everything I care about is here.\", All this political jockeying of recent days has provided a wonderful spectator sport for us junkies. It had been expected that Boxer, 74, would announce shell retire after her term expires in 2016. It frees up a 24-year logjam that has held back ambitious politicians seeking upward mobility. If Sen. Dianne Feinstein, 81, also calls it quits in 2018, that  combined with Browns exit  will usher in a whole new generation of top political leadership in California. Newsom and Harris, a former San Francisco district attorney, had been at the center of replacement speculation. First Newsom bowed out. Then within hours, Harris leaped in. There was no deal, they insisted  wink, wink. But so what if there was? Thats smart politics and very civilized. Voters, I suspect, couldnt care less. This much is known: Harris and Newsom both had insider information about each other. They share the same highly successful campaign consulting team of Ace Smith, Sean Clegg and Dan Newman. It also manages Browns political ventures. Thats one reason Harris and Newsom never were going to run against each other. Another is that they share similar geographical, ideological and fundraising bases. In one way, Harris being willing to vacate a great job  second most powerful in state government  and Newsom choosing to hold onto his nonsensical post doesnt compute. But Harris has always seemed more suited for the broad-focused, palsy-walsy Senate. And lieutenant governor is a decent ballot title for a gubernatorial aspirant. Plus, the first and only certain Senate opening will be in 2016, a presidential election year when the voter turnout is bound to be higher than in 2018 and more favorable to a minority candidate. Harris, daughter of a Jamaican-born father and Indian-born mother, was smart in immediately announcing her candidacy rather than playing word games about \"exploring.\", It puts other Senate wannabes on notice that theyd face stiff competition. Harris will receive potent support from womens groups. In fact, on Wednesday she picked up the endorsement of some senators, including popular liberal Sen. Elizabeth Warren (D-Mass.). Also, shell need to raise at least $20 million, and time is short. Federal fundraising rules are much more stringent than Californias. Villaraigosa would enter the race as an underdog carting some old personal baggage. But theres a lot of baggage in politics. And voters tend to have more compelling priorities. Being an underdog opposed by the political establishment has never stopped Villaraigosa, a former state Assembly speaker, from running and winning. And this is his window. Steyers goal is less to become a prestigious senator than to promote his fight against global warming. Worth $1.6 billion from managing a hedge fund, he poured $74 million into various campaigns last year trying to make climate change a priority issue. But it just isnt for most voters. Rather than running a grueling race himself and likely losing, he should just buy a candidate. Then there are some U.S. House members mulling a race, including Loretta Sanchez, 55, of Garden Grove. Sanchez would draw Latino and Southern California votes from Villaraigosa. But shed also peel off womens votes from Harris. Unlike those two, however, shed be forced to surrender her current job. Thats probably too risky. Presumably, the candidates will give us better reasons to vote for them than gender or ethnicity. You could always count on Boxer to be there for the working stiff and the environment. Shell be missed, at least by Democrats. George.skelton@latimes.com, Twitter: @LATimesSkelton]", "Date": "20150114", "Title": "[Kamala Harris is front-runner for Boxer's seat  for the moment]", "Link": "http://www.latimes.com/local/politics/la-me-cap-senate-20150115-column.html", "Author": "NULL"}