{"Content": "[Jeb Bush carefully attempted to open up distance between himself and his brother, President George W. Bush, in a much-anticipated foreign policy speech Wednesday, suggesting that in the Mideast, he would value stability even if that meant supporting autocrats rather than democratic forces. In a speech to the Chicago Council on Global Affairs, Bush  widely viewed as the leading candidate for the Republican presidential nomination even though he has yet to formally announce his candidacy  also strongly defended the National Security Agencys collection of records on Americans telephone calls, saying it was hugely important to protect the country against terrorism. For the life of me, I dont understand why the debate has gotten off track about the program, he said. The defense of the NSA, and repeated references to the importance of engagement  a word he used in some form 22 times in a little more than an hour  drew a sharp line between the former Florida governor and potential rivals for the GOP nomination, particularly Sen. Rand Paul of Kentucky, who has denounced the NSA program and argued for reducing U.S. entanglements overseas. But it was the distinctions Bush drew with his brother that did the most to start defining what a Jeb Bush foreign policy might look like. Employing a line that his aides had widely advertised in advance, Bush said that while he admired his brother and their father, President George H.W. Bush, Im my own man, and my views are shaped by my own thinking and my own experiences. New circumstances require new approaches, he said. In the speech, he shed little light on what those new approaches might mean. Indeed, he completely avoided the most fraught part of his brothers legacy, barely mentioning the word Iraq, except in an initial stumble in which he meant to say Iran. In the question-and-answer session that followed, however, Bush broached the subject. He defended his brothers record on Iraq, saying that there were mistakes made in Iraq, for sure, but that the troop surge in the final two years of the Bush presidency was one of the most heroic acts of courage politically that  that any presidents done, because there was no support for it, and it was hugely successful. But he also drew a sharp distinction on the issue of promoting democracy overseas, which George W. Bush made a major theme of his presidency. Asked by the events moderator, former ambassador Ivo Daalder, about how to balance support for democracy with stability in the Middle East, Bush made clear that he favored the latter. Foreign policy is not about just one thing, he said. I do believe that American values and American liberty is a force for good in the world; that if we could create the freest world, that we would have less threats, less violence, less terrorism and many other things. But to get there, thats a long-term challenge. In the shorter term, we have to be practical, he said, delivering a strong defense of Egyptian President Abdel Fattah Sisi, whose government has been sharply criticized by human rights groups for crushing free speech and dissent. We have to balance our belief in liberty with a belief that security and engagement will eventually yield better societies, he said. U.S. officials have put too much emphasis on holding elections as a touchstone for which governments to support, he said, adding, Ive been critical of the president a lot here. This is a problem of presidents past as well. The remarks suggested that his foreign policy would more closely resemble that of his father, who put a high premium on stability and prudence, rather than that of his brother. As expected, Bush sharply criticized President Obama as having weak leadership and misplaced priorities, sounding a theme that Republicans hope to use in the campaign against the expected Democratic nominee, Hillary Rodham Clinton, who is Obamas former secretary of State. Under this administration, we are inconsistent and indecisive, he said. We have lost the trust and confidence of our friends. We definitely no longer inspire fear in our enemies. This administration talks, but the words fade, he added. They draw red lines, and then erase them. With grandiosity they announce re-sets, and then disengage. Hashtag campaigns replace actual diplomacy and engagement. Obamas failure to keep some U.S. troops in Iraq early in his first term created a void that set the stage for Islamic State militants to become a serious threat, Bush said. Although Bush criticized Obamas approach to Islamic State, also known as ISIS or ISIL, he said little about what he would do differently. He drew a sharp contrast, however, with the administrations criticism of Israel Prime Minister Benjamin Netanyahu, saying he supported Netanyahus plan to speak to Congress early next month about the negotiations over Irans nuclear program. I am surprised that the administration is upset to hear from a close and valuable ally on such a sensitive topic, Bush said. As Bush prepares for a likely presidential bid, dealing with foreign policy has loomed as a tricky topic, in part because Republican divides on foreign affairs have turned into a wide chasm in the years since his brother left the Oval Office. On one side, much of the Republican establishment favors a more activist, military-oriented policy than the Obama administration has pursued in trouble spots from Ukraine to the Middle East to East Asia. On the other side, libertarians, led by Paul, have called for reducing U.S. involvement overseas. The senator has tried to distance himself from the more isolationist extremes advocated by his father, former Rep. Ron Paul (R-Texas). But he has frequently tangled with Sens. John McCain of Arizona, Marco Rubio of Florida and other Republicans who advocate what he sees as excessive U.S. involvement in overseas crises. The rapid rise of Islamic State militants in Iraq and Syria appears to have strengthened the establishment position within the party. Republican voters, who had been warming to Pauls side of the debate, swung last year toward a more hawkish view of the world. david.lauter@latimes.com, Lauter reported from Washington and Bergen from Chicago. 6:07 p.m.:This post has been revised throughout for updates and additional details. 12:20 p.m.: This post was updated throughout, This post was originally published at 9:36 a.m.]", "Date": "20150218", "Title": "[Jeb Bush casts his foreign policy views as distinct from his brother's ]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-jeb-bush-foreign-policy-20150218-story.html\n", "Author": "[David Lauter, Kathy Bergen]"}
