{"Content": "[Hopes for a broad overhaul of the corporate tax system are fading as the 2016 elections draw closer, but momentum is building for one key change  the U.S. tax that companies would pay on overseas profits. A bipartisan proposal, to be introduced soon in Congress, would tax the estimated $2 trillion in foreign profits held by U.S. corporations in overseas accounts, but at a much lower rate than the current 35% levy. The tax would generate tens of billions of dollars for the federal Highway Trust Fund, which will run out of money at the end of the month. Lawmakers have been in a desperate scramble to replenish the fund, which helps pay for new roads, bridges and other transportation infrastructure. The trade-off that makes the proposal attractive to business groups is that multinational corporations would end up paying little to no U.S. taxes on future foreign profits. Sens. Rob Portman (R-Ohio) and Charles E. Schumer (D-N.Y.), who unveiled the set of international tax principles last week, didnt specify a new tax rate yet, but it is likely to be lower than the 14% that President Obama had proposed early this year. Supporters said the plan would reduce incentives for companies to reincorporate overseas, a controversial tax-reducing tactic known as inversion that has drawn the ire of Democrats. \"Our international tax system is upside down and inside out. It creates incentives to send jobs and stash profits overseas, rather than creating jobs and economic growth here in the United States,\" Schumer said. \"These proposals would right the ship, provide a potential funding source for transportation reauthorization and allow the United States to compete on a level playing field,\" he said. For companies to bring home overseas profits, they must pay corporate taxes at the U.S. rate of 35%  the highest among advanced economies  minus whatever tax was paid in the country where the money was earned. Most other advanced economies simply require companies to pay the taxes due wherever the money was earned, with little or no additional taxes levied to bring the money home. And as part of the U.S. transition from its current worldwide taxing system to a so-called international system, Portman and Schumer have proposed a \"one-time transition toll charge\" on existing foreign earnings. The tax would be levied regardless of whether the money is brought back to the U.S. a process known as repatriation. All foreign earnings now sitting offshore would be deemed to be repatriated even if they remained overseas. Rep. Paul D. Ryan (R-Wis.), chairman of the House Ways and Means Committee, said he welcomed the plan from Portman and Schumer. \"These ideas could serve as the basis for a bipartisan package to stem the tide of inversions and takeovers ... and potentially unlock a solution to our Highway Trust Fund shortfall,\" he said. The funds primary funding source is a federal tax on gasoline and diesel fuel. But the amount, 18.4 cents a gallon, hasnt been increased since 1993. And as vehicles have become more fuel efficient, the fund has developed shortfalls. Spending is expected to exceed revenue by about $167 billion over the next decade, according to the Congressional Budget Office. Many Democrats want to raise the gas tax to pay for the fund. But congressional Republican leaders oppose a tax increase. With bipartisan support for continued highway and infrastructure spending, anything that could provide the funding becomes attractive. \"In a perfect world, you wouldnt tie tax reform to the Highway Trust Fund,\" said Curtis S. Dubay, a tax expert at the conservative Heritage Foundation. But lawmakers see the need to find highway funding \"as a forcing mechanism to get something done\" on international taxes. The U.S. Chamber of Commerce and National Assn. of Manufacturers have said they opposed a forced repatriation of foreign earnings simply to replenish the Highway Trust Fund. But including it as part of a shift from the current international tax system  a move that would reduce corporate tax bills over the long term  changes the equation, said Dorothy Coleman, who handles tax policy for the manufacturers group. \"We understand that weve got a lot of assets overseas that have not been taxed and that some kind of transition from one system to another will be part of a tax reform effort,\" she said. \"The details are going to be very important to us.\", One crucial detail is the tax rate on foreign earnings. Obama wants a 14% rate, and Portman would like to see a much lower rate. Business groups also would like to see money they use for factories and other fixed assets taxed at a lower rate than uninvested profits, Coleman said. \"Some of our members have earned money overseas and have reinvested it in facilities and factories  to service local customers so they would have to come up with cash to pay a tax bill they had not anticipated,\" she said. Those details might not come until the fall, because Portman and Schumer still must draft legislation. Lawmakers could find a short-term source for highway money, as theyve done twice since last summer, that would keep the trust fund afloat for a few months to provide time for a detailed tax plan. Still, business groups want changes to the international tax system to be made as part of a broader overhaul that includes lowering the corporate tax rate for domestic earnings as well. Senate Majority Leader Mitch McConnell (R-Ky.) has indicated that he prefers a comprehensive tax overhaul. Some key lawmakers, however, have been trying to push broad business tax changes for a few years with no success. So an international tax shift, spurred by the need for highway funding money, has \"a real shot at potential enactment at year-end as the foundation of any large highway bill,\" said Chris Krueger, a policy analyst at financial services firm Guggenheim Partners. jim.puzzanghera@latimes.com]", "Date": "20150714", "Title": "[Bipartisan support grows for corporate tax change tied to Highway Trust Fund ]", "Link": "http://www.latimes.com/business/la-fi-corporate-tax-plan-20150714-story.html\n", "Author": "[Jim Puzzanghera]"}
