{"Content": "[Sen. Rand Paul got a vote of confidence from his fellow Kentucky Republicans on Saturday when the state party leadership agreed to let him run both for reelection to his Senate seat and for the GOP nomination for president in the 2016 election cycle. In voting to hold a party caucus separate from the traditional state primary, the state Republican central committee will allow Paul to technically avoid violating a state law that prohibits a candidate from running for two offices in one election. As a result, Paul can run for the presidential nomination in the special March 5 caucus and then for his U.S. Senate seat in the May 17 primary -- as long as he forks over $250,000 to help defray the increased costs. The decision moves the Kentucky nomination process to an earlier point in the Republican presidential schedule, potentially making the Bluegrass State more influential in the selection of the GOP nominee. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, A caucus will ensure that Kentucky is relevant in the process, Paul said after Saturdays vote, echoing the selling point that helped him lock in the change. Party leaders structured the caucus to play up Kentucky as an early caucus state and to entice more of the 17 Republican candidates to come make their case to Kentucky voters. Rather than a winner-takes-all windfall, the caucus will award delegates proportionally -- likely to be a compelling feature for some candidates. But the move also empowers Paul to keep alive his struggling presidential campaign without voluntarily giving up his seat in the U.S. Senate. He has until Sept. 18 to fully commit to the race for the Republican presidential nomination by transferring $250,000 to party coffers. If he doesnt transfer the money by mid-September, the party can revert to its single-primary plan. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, The party decision lessens the pressure on Paul to pull the plug on his campaign at a time when voter opinion polls show him in the bottom tier of Republican candidates. Recent national polls show businessman Donald Trump leading the GOP pack, drawing on some of the same anti-establishment voters who Paul had hoped would rally to his side. With Rands place on the ballot for Senate assured, he has more latitude to stay in the presidential race and try to improve his standing -- not to mention his attractiveness as a potential vice presidential running mate. Paul said Saturday that he was grateful for the Republican Partys trust\" in him. For news about 2016 politics, President Obama and the Obama administration, follow me on Twitter: @cparsons, ALSO:, Head of pro-Rand Paul super PAC charged with 2012 campaign violations, Donald Trump tells Alabama crowd: Id like to have the election tomorrow, House lawsuit against Obama is turning into a real problem for the president, , ]", "Date": "20150822", "Title": "[Rand Paul will be allowed to run for president and Senate at same time]", "Link": "http://www.latimes.com/nation/la-na-rand-paul-senate-20150822-story.html", "Author": "[Christi Parsons]"}