{"Content": "[Alarmed by the dismal voter turnout in this months Los Angeles city election, California lawmakers are considering a massive expansion of vote-by-mail balloting and legalizing pop-up polling stations at shopping malls to help increase the convenience and appeal of voting. Opening polling stations weeks early and allowing teenagers to vote in primaries if they turn 18 by the general election, strategies already being used in Colorado and Oregon respectively, also are being debated. Sen. Bob Hertzberg (D-Van Nuys) said he felt compelled to take action after California saw a record low turnout in the November 2014 state election. His commitment to change the system took on new urgency after only about 10% of eligible voters in Los Angeles participated in the March 3 municipal election. \"My heart sinks. Its just horrible. Its embarrassing,\" Hertzberg said. \"It just puts a lot less meaning on the democratic process. Weve got to do something to change the game.\", Hertzberg filed legislation to provide vote-by-mail ballots to all registered voters during elections, no longer requiring them to request one. Its among the nearly 20 bills that have been introduced to encourage greater turnout. State lawmakers began scrambling for answers after the November state election, in which a record low 42.2% of registered voters cast ballots. Among all those eligible to register, 30.9% voted. And then Los Angeles held its election. \"Here we were complaining about the 31% [statewide] turnout in November, and then just when we thought things couldnt get worse, it drops down\" to 10.3% for Los Angeles, said Sen. Benjamin Allen (D-Santa Monica). \"How sad.\", Experts believe some help will come for Los Angeles elections from a newly approved measure to align city votes with state and federal elections. But the state has been slow to respond to low voter turnout, said Kim Alexander, president of the non-profit California Voter Foundation, which advocates for the use of technology to promote the democratic process. A new computer system called VoteCal, which would allow voters to register at satellite polling stations on the same day they vote, was supposed to be operating in 2009 but has been delayed until 2017 by problems that include ballooning costs and the firing of the original contractor. In addition, the governor and Legislature have underfunded counties voter registration and vote-by-mail programs by up to $100 million, Alexander said. She said newly elected state officials, from Allen to Secretary of State Alex Padilla, appear to be bringing new energy and momentum to the issue. Many of the bills are likely to make it through the Democrat-controlled Legislature, but money could become an issue for some of the more expensive proposals. Padilla recently testified to lawmakers that the primary reasons people dont vote include apathy  such as the feeling that their vote wont make a difference  and a lack of knowledge that an election is being held. With people working long hours far from home, some dont find it convenient to get back to their neighborhoods in time to vote, Allen said. He has a bill that, once the VoteCal system is operating, would allow Californians to register to vote and cast ballots for two weeks before an election at satellite voting centers to be opened in schools, shopping centers, libraries and other public buildings. Allen, chairman of the Senate Elections and Redistricting Committee, said his panel is also looking at a proposal approved this month by the Oregon Legislature that would use drivers license data to automatically register all eligible people with licenses to vote. With 73% of eligible Californians currently registered to vote, a law such as Oregons could increase voter registration by 6.4 million people. Hertzbergs legislation, SB 163, would provide every registered voter with a mail-in ballot in the same envelope as their sample ballot so they would not have to go through the extra step of requesting a ballot. \"It takes down a barrier,\" Hertzberg said. \"Whether its poll taxes or literary tests or whether its your gender or your religion, weve always put up barriers, and its time to tear them all down.\", Counties where more voters participate by mail often have higher turnouts overall. Los Angeles County had the lowest turnout in the state in November and also the lowest percentage of votes by mail. The Hertzberg bill is modeled partly on the law in Colorado, where for the first time last year, all voters were given vote-by-mail ballots 22 days before the election and allowed to cast them by mail or in person during that three week period. Some 95% of voters in Colorados November election used their mail-in ballots, although some dropped them off in person, and the percentage of eligible voters who cast ballots increased to 54.5%, the third best in the country, said Tim Griesmer, a spokesman for the Colorado Secretary of States office. Assemblyman Kevin Mullin (D-South San Francisco) has proposed a constitutional amendment for the November 2016 ballot that would allow 17-year-olds to vote in a primary election if they are going to turn 18 by the general election. He noted that in the 2014 general election, turnout for eligible 18-year-olds was the lowest of all ages, at 5.2%. \"Most young peoples first contact with politics is in their mandatory high school civics class,\" Mullin said. \"This is the perfect time to get them involved and give them some ownership in the process by getting them to vote in primaries.\", The change would follow the lead of 20 other states, including Oregon, Connecticut, Hawaii, Indiana and Iowa, that allow 17-year-olds a chance to vote in primaries. Lawmakers are also looking at building on a pilot program approved for a few counties in which special elections could be held entirely with mail-in ballots. Turnout has also been a particularly difficult issue for special elections. When a special election was held Dec. 9 to fill a seat vacated by former Sen. Roderick Wright (D-Inglewood), only 7.2% of voters in the district cast ballots. Wright resigned after he was found guilty of lying about living in his district. Isadore Hall III won the 35th Senate District seat outright in the primary by garnering 17,951 votes in a district with 450,655 registered voters. Los Angeles County will spend $1.4 million to hold a special election on Tuesday for vacant state Senate seat in which the only candidate on the ballot is former Republican Sen. Sharon Runner. There are six write-in candidates, but Runner is likely to win the seat outright Tuesday. Allen said it was \"rather shocking\" that so much was being spent on what he called a \"coronation,\" when the county only allocates $250,000 for voter outreach programs. \"That says a lot about where our financial priorities are; we just dont invest enough,\" Allen said. Patrick.mcgreevy@latimes.com, Twitter: @mcgreevy99, Some of the bills aimed at increasing voter turnout that are being considered by the California Legislature:, ACA 2 is a constitutional amendment that would allow 17-year-olds to vote in a primary election if they will be 18 when the general election is held. AB 554 would allow high school students who are 16 or 17 years old to serve as poll workers with the aim of getting them excited about voting. SB 439 would allow Californians to register to vote and cast ballots for two weeks before an election at satellite voting centers to be opened in schools, shopping centers, libraries and other public buildings. SB 163 would require county elections officials to issue a vote-by-mail ballot to every registered voter in the county for statewide primary, special and general elections, no longer requiring voters to request the ballots. AB 1026 would require the secretary of state to meet with local registrars of voters, community groups and other people to develop strategies for improving Californias voter turnout and report recommendations to the Legislature. AB 1494 would tax campaign funds spent independently of candidates by special interest groups and use the money for programs to increase civic engagement, voter registration and turnout, among other things. SB 365 would allow elections officials to set up secure drop boxes throughout a community where people can leave vote-by-mail ballots. --Patrick McGreevy]", "Date": "20150314", "Title": "[ L.A.'s low voter numbers push state officials toward easing process]", "Link": "http://www.latimes.com/local/california/la-me-pol-election-turnout-20150315-story.html\n", "Author": "[Patrick McGreevy]"}
