{"Content": "[The GOP has added two more Californians to its list of House members it considers most vulnerable in next years elections. The National Republican Congressional Committee on Friday named Reps. Stephen Knight (R-Palmdale) and Jeff Denham (R-Turlock) to its Patriot Program. The program gives added attention, including fundraising help, to reelection campaigns in districts most likely to flip to the Democratic column in 2016. Knight and Denham join Rep. David Valadao (R-Hanford), who was the only Californian among the initial list of 12 vulnerable GOP representatives released earlier this year. All three represent former Republican strongholds where Democrats have made registration gains. But Democrats see the northern Los Angeles County district of Knight, a freshman, as a particularly strong prospect as they try to build their numbers in Congress. Knight recently was caught on a video, posted on YouTube, telling a protester he would \"drop your ass\" if the man, who patted the congressmans arm during an argument, touched him again. The Democratic Congressional Campaign Committee seized on the video to portray Knight as a hothead, and on Knights lackluster fundraising.  He raised just $40,800 between the November election and March 31, according to his campaign filings with the government. He reported $29,000 in his campaign treasury and owing more than $52,000. Contested House races can cost into the millions of dollars and incumbents anticipating a challenge usually begin raising money vigorously early in the election season. \"One-Term Wonder Congressman Knights election last year was a fluke, and now National Republicans are scrambling\" to save him, DCCC spokesman Matt Thornton said Friday in a news release highlighting Knights addition to the GOPs vulnerability list. Knights addition came a day after Democrat Lou Vince announced he was going to run for the seat. Vince, a Los Angeles Police Department lieutenant who lives in Agua Dulce, ran in last years primary for Los Angeles County Sheriff. Another Democrat, Maria Gutzeit, a Santa Clarita Water Board member and chemical engineer, also is considering enteringthe race, according to Roll Call. She told the online publication of the Congressional Quarterly recently that she has been speaking with potential supporters. Knight did not respond to requests for comment. Follow @jeanmerl for the latest in Southern California politics news.]", "Date": "20150501", "Title": "[Republicans add Californians to list of its vulnerable House members]", "Link": "http://www.latimes.com/local/political/la-me-pc-knight-denham-20150501-story.html\n", "Author": "[Jean Merl]"}
