{"Content": "[What was supposed to be a no-drama final session of Congress before the campaign season turned into anything but as President Obamas new strategy to combat the threat fromIslamic State resulted in a wrenching vote that is likely to reverberate through the midterm election and beyond. The intense foreign policy discussion of the last two weeks forced a pivotal vote -- whether or not the U.S. should arm and train moderate Syrian rebels -- that could define lawmakers for years to come. For most, it was the hardest vote theyd ever taken on a military strategy. On Friday, Obama signed the resolution, which was included in a broader funding bill to keep the government running into December. Heres what the September session may have told us about the state of the two parties heading into the midterm debate. 1. Senate candidates from both parties sided with the president , The key fight in the 2014 midterms is the battle for control of the Senate. And all but one of the most endangered Democratic incumbents voted in favor of Obamas request to arm the Syrian rebels. Sen. Kay Hagan of North Carolina, Sen. Mary L. Landrieu of Louisiana, Sen. Mark Pryor of Arkansas and Sen. Jeanne Shaheen of New Hampshire  all of whom have emphasized veterans issues -- voted yes, as did Sen. Mark Udall of Colorado, a critic of the administrations intelligence-gathering techniques. Perhaps as interesting was that their Republican challengers largely agreed with the incumbent senators. Udall, Pryor and Landrieu face Republicans currently serving in the House, and all of them -- Reps. Cory Gardnerof Colorado, Tom Cottonof Arkansas and Bill Cassidyof Louisiana --- supported the White Houses request to arm Syrian rebels. Reps. Bruce Braley (D-Iowa) and Gary Peters (D-Mich.), both running in close races for open Senate seats, also voted for it. The exception was Democratic Sen. Mark Begich of Alaska, who cast his opposition as a rebuke of the president and his own party, particularly because the measure was attached to a must-pass spending bill. He wanted a separate debate. In deep-red Alaska, such distancing from the national Democratic Party may help. But his Republican opponent said he would have supported the measure. The scuttling of typical partisan lines on an issue as weighty as war may make the topic less potent on the campaign trail, particularly in the conservative battleground states where voters may lean toward a tougher military stance. If military operations proceed well in the Mideast, those who voted in favor of the presidents strategy could benefit from the afterglow. Polls have shown the public largely supports Obamas new strategy. But if conditions in Syria and Iraq worsen in the fight against Islamic State, criticisms could mount that more  or different  actions should have been taken. 2. This years vote could ripple years later for lawmakers, In the House, the vote on Obamas request for authority to train and equip Syrian opposition fighters passed by a wide majority, 273-156, though not the overwhelming result the White House may have expected. Both opposition to and support for the amendment was bipartisan  and more Republicans than Democrats backed the effort. Control of the House is favored to stay with Republicans this November. But as lawmakers learned in 2006, when antiwar sentiment contributed to the Democratic sweep, old votes can resonate years later. Many Republicans who supported the 2002 authorization for the war in Iraq lost reelection that year. By and large, candidates in this years toughest races decided the safe vote was yes. Of 14 House incumbents running in races described as toss-up by the nonpartisan Cook Political Report, 12 voted yes. The only dissenting votes came from Democratic members whose political careers are rooted in antiwar activism: Carol Shea-Porter of New Hampshire, whose 2006 upset victory epitomized the rejection of President Bushs handling of the Iraq war, and Rick Nolan of Minnesota, who first came to Congress in the Vietnam War era. Rep. Chris Van Hollen (D-Md.), who served as the House Democrats campaign committee chairman in 2008 and 2010, said, \"This is one of those votes when you come to Congress that you want to make sure youve made the best decision that you can for the country.\", 3. With a 2016 White House run in mind, Republican senators showcased the party divide , Among Republicans considered possible presidential material in 2016, the different approaches to the Syrian question represented the broader divide between the GOPs traditional hawkish wing and its newly ascendant anti-interventionists. Conservative Sen. Rand Paulof Kentucky and Sen. Ted Cruzof Texas both declined to back Obamas approach, questioning the wisdom of a strategy that relies on arming Syrians whose allegiances may be difficult to discern. But Paul went to great lengths, in a nearly hourlong floor speech that echoed his recent \"I am not an isolationist\" headline in Time.com, to assert that he is not against all wars. Put another way, he opposes only what Obama once called \"dumb wars.\", \"There are valid reasons to go to war,\" Paul said, noting that he supported the 2001 authorization for war in Afghanistan. \"America should only go to war to win. ... War should occur only when America is attacked, when it is threatened or when our American interests are threatened or attacked.\", Taking a more traditionally hawkish role, Sen. Marco Rubio (R-Fla.) said the mistake would be not acting while the U.S. could play a role to stop the Islamic State. Also voting against Obamas approach were Democratic Party outliers who are liberal favorites for possible presidential runs. Sen. Elizabeth Warren (D-Mass.), who has said she is not running for president, and Sen. Bernie Sanders, the independent from Vermont who caucuses with Democrats, both voted no, as did rising Democratic star, Sen. Kirsten Gillibrandof New York  who holds the seat Hillary Rodham Clinton held for eight years before becoming secretary of State. Sen. Amy Klobuchar (D-Minn.), another ambitious Democrat who has made visits to early nominating states, voted to support Obamas plan. For Democrats, it was Obamas vote against the war in Iraq in 2002 as a young senator that helped make him a standout in the race against Clinton, who had voted for authorizing the action. 4. A midterm election wild card? , As much as Democratic and Republican party leaders closed ranks in support of the presidents request, both also seemed eager to turn the attention back to preferred campaign themes  jobs and the economy. House Speaker John A. Boehner (R-Ohio) delivered what was billed as a major address offering a \"five point\" blueprint for his partys congressional majority going forward, focused on lowering taxes, stopping onerous business regulations and other business- and pocketbook-friendly initiatives. House Majority Leader Harry Reid (D-Nev.) closed the session by highlighting the Democrats \"Fair Shot Agenda,\" which calls for boosting the minimum wage, lowering the cost of college and supporting equal pay for women. But try as they might, both leaders found their message drowned out by the end-of-session vote, at least for now  especially as rank-and-file lawmakers from both parties pressured them to hold a broader debate on military authorization for Obamas actions when they return after the election. The extent to which events in the Middle East continue to dominate the news lends uncertainty in an already turbulent November election, in which control of Congress will be decided. For the latest from Congress follow @LisaMascaroinDC and @MikeMemoli, ]", "Date": "20140919", "Title": "[Four takeaways from the vote in Congress to arm Syrian rebels]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-takeaways-congress-syria-20140919-story.html", "Author": "[Michael A. Memoli, Lisa Mascaro]"}