{"Content": "[Watching Carly Fiorina shine in the Republican debate, I began thinking she should forget the presidency and run again in California for the U.S. Senate. No way does she get elected president or even veep. Americans are going to insist on at least some experience  some track record  in public office. The last political rookie elected president was Dwight D. Eisenhower, who had just smashed Hitler and saved the free world. In the 1800s, three other generals rose to commander in chief. Only one vice president  Chester Arthur, a New York Republican chairman  never before held public office. But Fiorina, with her growing popularity and name ID, could be a savior for the crippled California GOP  just the strong candidate it needs to regain relevancy in this deep blue state. SIGN UP for the free Essential Politics newsletter >>, Then I kept on thinking. Foolish me. The odds on any Republican  especially a social conservative like her  winning a statewide race in California are practically zilch. Moreover, Fiorina doesnt even live here anymore. She has moved to Northern Virginia. Too bad for the California Republican Party. A good one got away. But who knows? Fiorina could play out her White House bid and see where it leads. If its to a dead end, the California filing deadline for a Senate candidacy is not until March 16. More than half the states will have voted in caucus or primaries by then. And she could reclaim her California residency. Fiorina ran for the Senate in 2010 against Democratic incumbent Barbara Boxer and didnt come close, losing by 10 points. But Boxer is retiring, presumably making the 2016 race more competitive. Last time, besides being burdened by the Republican label, Fiorina started out slowly because of two personal weights: She underwent breast cancer surgery, followed by hair-losing chemotherapy and radiation. And a stepdaughter who had struggled with alcoholism and drug abuse died. During the campaign, Boxer attacked Fiorinas rocky record as chief executive of Hewlett-Packard. She laid off more than 30,000 workers and shipped jobs overseas as HPs stock tumbled. Fiorina was fired. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, None of that history would disappear if she ran again in California, but itd be old news. \"In 2010, Carly was defined by Barbara Boxer. This year, she has already defined herself,\" says Republican consultant Ray McNally, who with partner Richard Temple ran moderate Tom Campbells losing campaign against Fiorina for the party nomination. \"If she were to drop out of the presidential race, shed be a formidable candidate in California,\" Temple says. \"But shed have to leave on an up note, which they never do.\", Fiorinas 2010 campaign strategist, Marty Wilson, says that \"shes smart, very glib and knows these issues cold. There arent many got ya questions you can throw at her.\", She learned the issues, Wilson says, while advising Republican presidential nominee John McCain in 2008. Fiorina definitely has brought her \"A\" game to the presidential race and scored big during the debate last week. She was impressive  agile and articulate  whether you agreed with her or not. Once was when she spoke from the heart in answering a question about legalizing so-called recreational use of marijuana. Noting she had \"buried a child to drug addiction,\" Fiorina called for more treatment and criminal justice reform. But she added: \"We are misleading young people when we tell them that marijuana is just like having a beer. Its not. And the marijuana that kids are smoking today is not the same as the marijuana Jeb Bush [admittedly] smoked 40 years ago. \"We need to tell young people the truth. Drug addiction is an epidemic.\", Another star moment for Fiorina  although apparently exaggerating  was when she dramatically criticized Planned Parenthood, spacing her words for emphasis: \"I dare Hillary Clinton, Barack Obama to watch these tapes. Watch a fully formed fetus on the table, its heart beating, its legs kicking while someone says we have to keep it alive to harvest its brain.\", Great performance, but Planned Parenthood said she fabricated. That scene was not part of the undercover videos recently released by anti-abortion crusaders, the organization said, and the fetus was stillborn. Fiorinas highlight moment was in responding to Donald Trumps previous sarcastic remark that her face was a turn-off and nonpresidential. But to fully appreciate the reply, her retort must be seen in full context. Interested in the stories shaping California? Sign up for the free Essential California newsletter >>, Trump had just attacked Bush for denying he had suggested too much tax money was being spent on womens health. \"I heard when he said [it],\" Trump insisted. When Fiorina next was asked about Trumps face slam and his later claim of being misinterpreted, she didnt miss a beat: \"You know, its interesting to me, Mr. Trump said that he heard Mr. Bush very clearly.... I think women all over this country heard very clearly what Mr. Trump said.\", Bulls-eye. Former California Republican Chairman George \"Duf\" Sundheim, the most promising GOP contender for Boxers seat next year  but still a distant long shot  told me he probably would not have run if Fiorina had. She didnt and she wont be, say insiders. \"That ship has left the port,\" says veteran GOP strategist Ken Khachigian, who has been advising Fiorina. If her star keeps rising, Fiorina could wind up in a Republican presidents cabinet. She could also run for governor or the Senate in her new home state. There, Fiorina is a better political fit anyway than in California. george.skelton@latimes.com, Follow @LATimesSkelton, MORE FROM SKELTON:, Labor needs to stop using environmental law to kill jobs, Reagan would be amused and troubled by this GOP field, The time is ripe for a tax on oil extraction to pay for California road repairs]", "Date": "20150921", "Title": "[State GOP lost an asset when Fiorina left]", "Link": "http://www.latimes.com/local/politics/la-me-cap-20150921-column.html\n", "Author": "NULL"}
