{"Content": "[Six months ago, President Obamas foreign policy looked stymied. Negotiations with Israel and the Palestinians were at a dead end. Russia was gaining ground in eastern Ukraine. U.S. efforts to end the war in Syria were ineffective. A new extremist army, Islamic State, was marching into Iraq. As misfortunes gathered, Obamas response was defensive  and earthy. His first principle, he said, was Dont do stupid shit. But as strategy, that was so inadequate that it drew a public rebuke from his former secretary of State. Great nations need organizing principles, and Dont do stupid stuff is not an organizing principle, Hillary Clinton told an interviewer. Today the picture looks different. Last week, Obama surprised the world by normalizing U.S. relations with Cuba after a half-century freeze. Before that, he struck significant deals with China on climate change and trade. He launched a new war in Iraq, the country from which he had long promised to extricate the United States. And in a little-noted but important move, he extended a limited U.S. combat role in Afghanistan for at least another year, stretching his 2014 deadline for a pullout. Only recently criticized as passive, Obama suddenly looks hyperactive. And theres more to come. Obama still hopes to conclude a nuclear deal with Iran, a diplomatic achievement that will produce major controversy. He plans to lift as many economic sanctions on Cuba as Congress will allow. And aides say they will consider yet another attempt at Middle East peace talks if Israels March election produces a receptive government. What happened?, My presidencys entering its fourth quarter, Obama said at his news conference on Friday. Interesting stuff happens in the fourth quarter. Has he undergone a conversion from a president bent on minimizing foreign entanglements to one whos actively seeking opportunities for diplomatic boldness? Is he admitting he was aiming too low and risking too little? , Not really. Obamas foreign policy was never quite as passive as its critics made it out to be  and today, its not quite as brilliant and visionary as administration officials try to make it sound. What were seeing, instead, is how circumstance, luck, plus a measure of diplomatic skill, can bring about a run of better-than-average results. Some of it is the slow ripening of efforts launched long ago. The talks with Cuba took 18 months, plus a push from Pope Francis. The climate deal with China was more than a year in the making. The nuclear talks with Iran have been under way even longer. U.S. diplomacy has benefited from one huge piece of luck: the increase in North American oil production and the drop in world oil prices. That has made the U.S. and its allies less vulnerable economically and has reduced the running room of adversaries such as Russia and Iran. The 2014 congressional election played a part, too. The fact that Obama has survived his last campaign has freed him to use his foreign policy powers more freely  as he did in normalizing relations with Havana. A Republican-controlled Senate wont make his life easy, but he no longer needs to worry as much about the electoral impact on Democrats if, for example, he concludes a nuclear deal with Iran. And part of Obamas recent activism hasnt, strictly speaking, been at his own initiative; hes been forced to react to unwanted events, including Russias invasion of Ukraine and the rise of Islamic State. In Afghanistan, he agreed to continue U.S. combat support for the Afghan armed forces after U.S. military officials warned that without American help, Kabuls forces could quickly crumble. In the end, the pillars of Obamas foreign policy havent changed. Hes still avoiding most invitations to employ U.S. military power in foreign conflicts; theres no appetite for getting more directly involved in Syria or for supplying weapons to Ukraine. Hes still persuaded that diplomatic engagement is most likely to bear fruit with adversaries  hence the talks with Cuba and the widening of discussions with Iran to include the future of Syria and Iraq. And even though he has revived the Clinton-era slogan of the U.S. as the indispensable nation, Obama is still trying to adjust the goals and means of U.S. diplomacy to a world in which the United States has less absolute power, less money and less appetite for military adventures. And his administration is still capable of diplomatic missteps. David Rothkopf, a former Clinton administration official and author of National Insecurity: American Leadership in an Age of Fear, wrote recently: It is hard to think of a recent president who has grown so little in office. I asked Rothkopf last week whether the administrations recent successes had caused him to revise his assessment. Not yet, he said. Obamas fourth-quarter foreign policy looks better than it did six months ago. But for good and ill, a lot can happen in two years  and it will. doyle.mcmanus@latimes.com, Twitter: @DoyleMcManus]", "Date": "20141220", "Title": "[Obama's fourth-quarter foreign policy surprises]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-mcmanus-obama-foreign-policy-turnaround-20141221-column.html\n", "Author": "NULL"}
