{"Content": "[Dont despair, political junkies. Theres still going to be a vigorous debate in the Democratic presidential primary campaign  even though it wont really be about who the nominee should be. Unless she stumbles, Hillary Rodham Clinton seems to have the nomination pretty well sewn up. Instead, the debate will be about something just as important: what it means to be a Democrat in 2016 and what message the party should take into the general election fight. And, for all you heartbroken liberals, heres good news: In that debate, Sen. Elizabeth Warren (D-Mass.) is still a full-fledged player  not as a candidate but as an insistent voice in Clintons left ear. Warren, the heroine of the partys progressive wing, met with Clinton a few months ago to urge her to run a populist campaign. The senator outlined some of the policies shed like to see: an increase in Social Security benefits, a much higher minimum wage and stronger financial regulation to force big banks to get smaller. And one more request: Warren urged Clinton to distance herself from the Wall Street fat cats who she thinks have amassed too much influence in Democratic administrations, including both Bill Clintons and Barack Obamas. Warren didnt get a solid commitment, Im told, so shes a long way from giving her blessing to Clintons campaign. \"I want to see who else gets in this race, and I want to see what the issues are that they push,\" she said in a CNN interview last week. Theres no shortage of candidates for the Elizabeth Warren Challenge. Sen. Bernie Sanders, the independent socialist from Vermont, is likely to join the Democratic Party and announce his candidacy soon. Former Maryland Gov. Martin OMalley has conspicuously sounded Warrens themes on visits to Iowa and New Hampshire. Former Virginia Sen. Jim Webb has tried to stake out populist ground to Warrens right, inveighing against a \"moneyed aristocracy\" but opposing higher income taxes. And former Rhode Island Gov. Lincoln Chafee, a Republican-turned-Democrat, says he may run because he thinks Clinton is too hawkish on foreign policy. As candidates, they all look a bit Quixotic. (Actually, Don Quixote probably has higher name recognition.) But in policy terms, they represent serious Democratic alternatives to Clintonland. Increasing Social Security benefits has suddenly become a progressive touchstone after a decade of debate over trimming the program. Warren, Sanders and OMalley are in favor; Clinton hasnt taken a position. Breaking up big banks and restoring the Glass-Steagall Act, which limited commercial banks activities until Bill Clinton helped repeal it, is on the same wish list. Warren, Sanders and OMalley are in favor; Clinton hasnt taken a position. Warren, Sanders and OMalley have said they oppose the Trans-Pacific Partnership, a big trade pact that Obama hopes to pass this year. Clinton supported it as secretary of State. And Warren, Sanders and OMalley oppose the Keystone XL pipeline, which would carry oil from Canadas tar sands to the U.S. Gulf Coast. As secretary of State, Clinton said she was \"inclined\" to approve the project, but more recently she has refused to take a position. On foreign policy, Clinton faces a different set of challenges. Shes long been more hawkish than Obama; she initially supported the 2003 U.S. invasion of Iraq, only to acknowledge later that it was a mistake, and she urged the president to intervene more forcefully in Syria. (He didnt.) Webb and Chafee have both said they think shes too quick to call for military action. \"Anybody who voted for the Iraq war should not be president,\" Chafee told Politico last week. Thats a range of views almost as diverse as in the bustling Republican campaign. While we dont know how things will shake out, the results matter. At stake is whether the Democratic nominee will continue in the center-left \"New Democratic\" tradition of Bill Clinton, the slightly more liberal vein of Barack Obama, or move further to the populist left. Clinton already knows what she thinks about most of those issues, of course; shes been in politics a long time. But shes avoided taking precise positions, a way of keeping her options open to see how the campaign develops. That cant last. Its not just pesky reporters who will be asking her questions; as soon as she starts talking with ordinary Democrats in Iowa and New Hampshire, whose voters are among the best informed in the country, theyre going to demand to know where she stands. Like many pundits, Ive written that it would be good for Clinton to have real debates with capable sparring partners, under the theory that she needs a tune-up before taking on the GOP nominee. Almost every professional campaign strategist Ive talked with says thats nuts. For a front-runner, they say, debates are mostly an opportunity to commit gaffes and lose support. But Clinton says shes going to work for every vote; shes not going to make the mistake she made in 2008, when she behaved as if she were the inescapable nominee. She needs to prove herself. In any case, primaries arent only about choosing a candidate. Equally important, theyre about refining the ideas that the nominee will take into the general election  and, if she wins, into the White House. doyle.mcmanus@latimes.com , Twitter: @doylemcmanus, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150414", "Title": "[ What are the Democrats' alternatives to Clintonland?]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0415-mcmanus-dems-20150415-column.html\n", "Author": "NULL"}
