{"Content": "[President Obama used Labor Day to announce a new step toward increased benefits for workers -- ordering companies that do business with the government to provide paid sick leave for their employees. The move, which Obama announced with labor leaders in Boston, adds to a series of executive actions Obama has taken and comes as Congress resists legislation to change labor conditions and pay to cover all private-sector workers. \"Right now, about 40% of private-sector workers -- 44 million people in America -- dont have access to paid sick leave,\" Obama said in announcing the order. \"Unfortunately, only Congress has the power to give this security to all Americans,\" he added, \"but where I can act, I will.\", Obama also sharply criticized Republicans in Congress and the GOP presidential candidates for what he said was a distorted view of how the economy works. \"In their world, the only way to help the country grow and help people get ahead is to cut taxes for millionaires and billionaires and loosen up rules on big banks and polluters, and then you just wait, and then you look up at the sky and prosperity will come raining down on us,\" he said. \"Thats not how the economy works.\", Obamas executive actions directed at the labor market, which many Republicans see as excessive use of presidential authority, have been designed to boost worker pay and benefits. White House economists say that will lead to higher productivity in an era of stagnant wages, while nudging private companies and Congress to join in updating work conditions. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, This latest order will require companies that have federal contracts to let workers accrue up to seven days of paid sick leave each year. The action will provide coverage for as many as 300,000 workers whose jobs do not currently provide paid sick leave and many others with limited paid time-off benefits. It will begin in 2017. The U.S. is the only industrialized nation without a federal family-leave law that guarantees workers can receive pay while taking time to care for themselves and loved ones. Some states have paid-leave laws. Current federal law mandates that companies provide leave, but does not require that it be paid. Over the last year, Obama has used his executive authority to raise the minimum wage to $10.10 for workers in companies that contract with the federal government, expand overtime pay protections for all private-sector workers, and guarantee federal employees up to six weeks of paid leave with the arrival of a new child. See the most-read stories this hour >>, Labor Secretary Tom Perez, previewing the order for reporters on Sunday, saidits time to shelve notions about Americas working families that were set in the \"Leave it to Beaver\" era and modernize the workplace to keep the United States competitive with other global powers. \"Other countries have done it, and they see the benefit,\" said Perez, who has toured the country collecting stories of workers who suffered hardships, including a bus driver who brought her sick child with her on the bus rather than risk losing pay with time spent at home. The administration would not provide an estimate of how much the newbenefit will cost companies. But officials cited studies showing costs can be outweighed by the benefits of employee retention and worker satisfaction. Business groups tend to contest such estimates. Obama used his speech to call on Congress to pass legislation that would require all companies with 15 employees or more to offer up to seven days a year of paid sick leave. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Congress is unlikely to budge. Both the House and Senate are controlled by Republican majorities that resist such workplace interventions in favor of a hands-off approach that allows wages and benefits to be set by the marketplace. Republicans are critical of Obamas use of executive actions and have not looked favorably on his efforts to work around the legislative branch on workplace matters and other issues. Instead, Republicans have passed bills, with support from some Democrats, to do away with regulations that businesses say hamper growth. Those have mostly been panned by the White House. Obama chose Massachusetts for the announcement after voters there overwhelmingly approved a measure that provides workers at sizable companies up to 40 hours a year of paid sick leave. It went into effect July 1. The White House has had strained relations with organized labor this year as Obama pushed a free-trade agreement with Pacific nations that most unions opposed out of concern it would cause U.S. jobs to be sent overseas. But Mondays announcement drew labor support. For the latest from Congress and 2016 campaign follow @LisaMascaro, ALSO, Colin Powell backs Iran deal as Congress prepares for a vote, Kentucky clerk Kim Davis appeals order putting her in jail, U.S. task force warns cities on efforts against homeless camps, 1:32 p.m.: This story was updated with quotes from the event. The story was first published at 6:49 a.m.]", "Date": "20150907", "Title": "[Obama orders paid sick leave for workers at federal contractors ]", "Link": "http://www.latimes.com/nation/politics/la-na-obama-paid-sick-leave-20150906-story.html", "Author": "[Lisa Mascaro]"}