{"Content": "[Heres an ironclad guarantee: Californias next state election will be tons more interesting than our just-concluded snoozer. Make that the next two elections  in 2016 and 2018. For starters, well be electing a new president in 2016. And Californians will be choosing another governor in 2018 when term limits finally nab Gov. Jerry Brown. Additionally, the odds are good that at least one coveted U.S. Senate seat will open up  and very possibly both of Californias. Democrats captured them in 1992 and have held on for nearly a quarter-century. Sen. Barbara Boxers term expires in 2016. And she is showing no sign of running for reelection. Shes mum publicly, but speaking loudly  many politicos believe  by not raising any money for a campaign. She has only about $150,000 banked for an effort that could cost tens of millions. In 2016, Boxer will be 75 and have suffered for two years as an oppressed member of the Senate minority. Sen. Dianne Feinstein will be up for reelection in 2018 at age 85. After many years exercising great influence, she also was relegated to minority party status last week. Will she really want to be traipsing all over California fighting for another term that would last into her 90s? Not likely. With both senators, it may depend on whether theres some impatient, ambitious Democrat out there bold enough to jump into the ring and challenge them. Would they face a grueling race or a cakewalk?, We can dismiss the notion of a Republican coming off the bench and running competitively for either governor or the Senate in this deep blue state. There isnt really a bench. So the next California governor and senators are likely again to be Democrats. But who? Heres the consensus list:,  State Atty. Gen. Kamala Harris, 50, a former San Francisco district attorney. Harris gets rapped by Sacramento insiders for being overly cautious and not taking full advantage of her high-profile office  for not exhibiting more leadership. Examples: Shes an ardent death penalty opponent but took no position on a 2012 ballot initiative that would have abolished capital punishment. It failed. This year, she didnt speak up about a landmark measure to greatly reduce penalties for narcotics and property crimes. It passed. Harris explanation was that its the attorney generals duty to write the ballot summary for each proposition. Taking a position, she says, could lead to accusations of bias. But that seems lame. Shes the states top cop, after all, and should be advising voters on complex criminal justice issues. She has led on other matters, however, including gun control and relief for homeowners victimized by improper bank foreclosures. Harris record is basically positive. Her reelection was a breeze and she really didnt need to spend $1.5 million on Los Angeles TV ads. The fact Harris did told political pros that she was increasing her name ID in Southern California to prepare for a future gubernatorial or Senate bid. She would be Californias first female and first black governor. But the best bet: Boxer will retire and Harris will run for her Senate seat in 2016. She seems more suited for that collegial, broad-focused office.  Lt. Gov. Gavin Newsom, 47, a former San Francisco mayor. Theres nothing shy about him. As mayor, he led the same-sex marriage movement, defying state law and issuing licenses. In the powerless job of lieutenant governor, Newsom angered Brown by writing his own sensible economic growth plan, but backed off promoting it when the governor kept casting dirty looks. He also has questioned the wisdom of Browns bullet train. Looking ahead, Newsom will be speaking out on two issues that should attract young voters. He favors marijuana legalization and strongly opposes the University of Californias plan to resume hefty tuition increases. Newsom tried to run for governor once, but got shoved aside by Brown. He clearly savors the job and, as a former mayor, prefers the executive branch to the legislative. He and Harris wont be running against each other. Bet on that. They share similar geographical, ideological and fundraising bases. Look for Newsom to run for governor in 2018.  Former Los Angeles Mayor Antonio Villaraigosa, 61, an ex-Assembly speaker. Hed love to be governor, but also would run for the Senate. Whatevers available. Hes charismatic. And if the only Latino in a race, hed have a shot.  Mayor Eric Garcetti, 43. Hes a potential governor, depending on his mayoral performance. The timing is lousy, however. Hed have to win reelection in 2017, then immediately start running toward Sacramento. L.A. voters might not take kindly.  Also add to the list state Controller John Chiang, 52, who was just elected treasurer. And State Sen. Alex Padilla, 41, the secretary of state-elect. Their noses are pressed against the window.  And Brown. Would he run for Feinsteins seat as his term expired? He tried for the Senate once and lost. Hell be 80 in 2018, but with him anythings possible. Anything? How about running for president in 2016  for the fourth time  if Hillary Rodham Clinton doesnt? Campaigning as a disciple of fiscal prudency and climate change?, Dont be silly. The odds on that arent any better than the San Francisco Giants winning the World Series. Let the games begin. george.skelton@latimes.com]", "Date": "20141110", "Title": "[Who will become California's next governor and U.S. senators?]", "Link": "http://www.latimes.com/local/politics/la-me-cap-democrats-20141110-column.html\n", "Author": "NULL"}
