{"Content": "[If anyone had any illusions that Hillary Clintons June book tour would feel like anything other than the launch of a presidential campaign, the furious debate over her depiction of her State Department tenure this week corrected that impression. In the slow rollout of Clintons latest memoir \"Hard Choices,\" the books promoters have released several excerpts. The first was to the women-friendly venue of Vogue magazine for Mothers Day. Then there were excerpts and several soft-focus videos featuring Clinton talking about the book posted on its Facebook page. But on Friday, Politico obtained the first harder-edged slice of the book, detailing Clintons account of the 2012 attack on a U.S. diplomatic post in Benghazi. Republicans predictably pounced, offering a preview of the debate that will unfold when the book is officially launched June 10. Those who exploit this tragedy over and over as a political tool minimize the sacrifice of those who served our country, Clinton wrote in the chapter Benghazi: Under Attack according to the Politico report. I will not be part of a political slugfest on the backs of dead Americans. Its just plain wrong, and its unworthy of our great country. Those who insist on politicizing the tragedy will have to do so without me. Clinton goes on to say that the attack on the diplomatic post in Benghazi, which killed J. Christopher Stevens, the U.S. ambassador to Libya, and three other Americans, has spurred a regrettable amount of misinformation, speculation, and flat-out deceit by some in politics and the media. But Republicans, who are trying to define Clintons tenure as secretary of state around the issue, brushed off her criticisms Friday. Republican National Committee Chairman Reince Priebus said the chapter showed Democrats were trying to sweep the issue under the rug and that Clinton would rather blame Republicans for asking questions than get answers for Americans. South Carolina Rep. Trey Gowdy, the Republican chairman of the House select committee that plans to investigate the attacks, seemed unfazed, telling CNN that there is a time and a place for everything and her book tour is neither for me. (House Minority Leader Nancy Pelosi has called the formation of the committee a diversionary tactic that amounts to subterfuge.) , America Rising, the super PAC conducting opposition research on Clinton in anticipation of her potential 2016 run, criticized her cherry-picked, finger pointing defense of the incident in the excerpts printed Friday. The group also challenged Clintons assertion that she shouldnt have had any reason to know about the cables requesting enhanced security at the diplomatic post in Libya, calling it a glaring failure in leadership. Clinton has repeatedly said she was responsible for the security of the diplomats in Benghazi, and she reiterates that in her new book, stating that as Secretary, I was the one ultimately responsible for my peoples safety. But in hearings last year, Clinton said she never saw any requests for additional security in Benghazi, because those cables would have gone to lower-level deputies at the State Department. In the new book, Clinton says the fact that the cables were addressed to her was a \"procedural quirk and that they were never given to her directly: Thats not how it works. It shouldnt. And it didnt. Clinton will have many opportunities in the weeks ahead to define the incident on her own terms, as well as helpful allies to defend her tenure at the State Department. She slipped in, unannounced, for lunch with the president at the White House on Thursday. Obama praised Clinton in an interview taped the same day with\"Live! With Kelly and Michael.\" , \"I know that if she were to run for president, I think she would be very effective at that,\" Obama said in the interview, which aired Friday. (Not playing favorites, Obama lunched Friday with another potential 2016 candidate, Vice President Joe Biden.), The former secretary of state has granted a first interview about Hard Choices to ABCs Diane Sawyer that will air in a prime-time special on the eve of publication, followed by a live appearance on \"Good Morning America\" on June 10. Clinton has also agreed to an interview airing June 17 with anchors at the Fox News Channel, which has focused relentlessly on questions about the Benghazi attacks and what Clinton knew.]", "Date": "20140530", "Title": "[Hillary Clinton on offense over Benghazi as book tour approaches]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-hillary-clinton-book-benghazi-20140530-story.html\n", "Author": "[Maeve Reston]"}
