{"Content": "[For discerning, super-wealthy donors looking for a distinctive way to advertise clout, the 2016 presidential election offers a new perk  their own specially tailored \"super PAC.\", Political professionals working on behalf of Texas Sen. Ted Cruz and for former Texas Gov. Rick Perry, both Republicans, have set up multiple super PACs with nearly identical names, all in the interest of catering to the wishes of the well-heeled, particularly the moguls willing to write seven-figure checks. The idea is to convince these donors they will have a measure of control over how their money is spent. \"Whether they have $5,000 or $5 million, they want to be able to participate in the process and give their thoughts and ideas,\" said Austin Barbour, main strategist for the three super PACs backing Perry  all bearing the name Opportunity and Freedom. \"When they tell you things in this business, you better respond positively to what they are saying,\" said Barbour, a Mississippi-based political consultant and veteran of Mitt Romneys 2012 campaign. The 2016 presidential race is already dominated by super PACs and other groups that under federal law can take unlimited checks. In Perrys case, for example, the trio of super PACs account for nearly all the money raised for his campaign so far, according to filings with the Federal Election Commission. More than 80% of the money came from just three donors, who put in a total of $15.3 million. The largest sum, $6.3 million, came from Kelcy Warren, an oil and gas pipeline billionaire from Dallas; an additional $5 million came from another Dallas billionaire, Darwin Deason. A $4-million contribution came in from a third donor whose name has not been released. Warren is not a typical, passive donor; he also serves as finance chairman of Perrys campaign. In February, Perry took a seat on the board of directors of Warrens firm, Energy Transfer Partners. Warren was at a Washington hotel recently when Perry, appearing at an Opportunity and Freedom event, gave a speech denouncing GOP rival Donald Trump as a \"barking carnival act\"  and saying that the nation needed to expand energy production and end a ban on energy exports. Warren and Deason declined requests for comment. Cruz has four affiliated PACs, all called Keep the Promise, that have together raised about $38 million, according to disclosure reports. One of the groups is the repository for contributions from Robert Mercer, a hedge fund billionaire from New York, who gave Cruz $11 million. Another was set up for Dan and Farris Wilks, brothers from Texas who made billions by selling equipment for fracking of oil and gas wells and gave $15 million with their spouses. The third took in $10 million from Toby Neugebauer, the founder of a private equity firm whose father, Randy, is a Republican congressman from Texas. The fourth brought in $1.8 million from several donors who are wealthy, but not rich enough to command their own PACs. Though super PACs can accept unlimited amounts of money to support candidates, they must disclose donors, and they cant coordinate activities with the candidates campaigns  although campaigns this year have increasingly pushed the boundaries when it comes to coordination. Turning such a PAC into an individualized accessory is one of the latest wrinkles in the money race. The tactic stems in part from a still-lingering hangover of 2012. Romneys defeat and the implosions of several GOP Senate candidates that year left some heavyweight Republican donors feeling they had not gotten good value for their money. \"A lot of people felt burned,\" said Edward Crane, a founder of the libertarian Cato Institute and president of Purple PAC, one of three super PACs supporting Sen. Rand Paul (R-Ky.). The tactic comes with some risk. One Republican operative who asked not to be identified because he is working for a rival candidates super PAC called the strategy \"head-scratching.\" Having multiple PACs will make for a lot of complications when the time comes to spend money, the operative said. Maybe one donor only wants his money spent on positive ads, he said, or another will want to see his dollars go to ads in his home state  even when research from the campaign suggests that the money should be spent differently. \"You now have to jump through hoops and spend money inefficiently, because of a commitment youve made to a donor to give them some level of control over the PAC,\" he said, adding that such obstacles may end up \"diluting the message.\", \"I have to imagine its driven by donors,\" he said. \"You wouldnt do it otherwise.\", In the case of the Perry campaign, Barbour said there wouldnt be clashing agendas from the super PACs because he will be running the operations for all three groups. Donors will be consulted but wont make the final decisions, he said. \"Well see if it works,\" he said. \"I see the way donors like it.\", The proliferation of super PACs comes as the outside groups assume higher profiles not only in fundraising, but in taking on more and more functions that once were run by the candidates own campaign organizations. A Republican campaign lawyer said he doubted that the outside-group operations would prove as effective as efforts run directly by the campaigns. \"Theres a marketing element going on here,\" he said, speaking on condition of anonymity because he is advising other candidates. \"A lot of these efforts are inefficient. Im a little old-school. I really think campaign money, in the end, will prove to be the most valuable.\", He was referring to the money donated directly to candidates. Such donations have tighter restrictions and are capped at $2,700 per person, but the dollars go further because candidates are by law given the lowest rates for buying television advertising, among other things. Another potential risk is tripping over the rules that ban coordination. David Keating, president of the Center for Competitive Politics, which advocates removing restrictions on campaign spending, says he thinks Warrens roles as Perrys finance chairman and mega-donor risk violating those rules. Violations could happen, he said, if Warren were privy to campaign information and then got involved in making decisions for the PAC. \"If hes someone whos a finance chair for the campaign, it wouldnt be a very good move for him to do anything else except give money,\" Keating said. \"He might not know of any intentions or plans for the campaign, but I think people might have a hard time believing that.\", Stefan C. Passantino, a campaign finance lawyer in Washington, set up the Cruz and Perry super PACs. Having donors to a super PAC be involved in raising money creates no problem, he said  so long as no one shares inside strategic information. \"The campaign cant tell the super PAC what their plans are on spending or on public communications,\" Passantino said. \"Being the finance director in the room isnt anywhere close to that. \"Its not an issue.\", The three groups backing Paul have set themselves apart by focusing on different tasks. One group, Concerned American Voters, is concentrating on grass-roots organizing and get-out-the-vote efforts, particularly in Iowa, which holds the nations first nominating contest. The group says it has raised close to $2million and, with 40 staff members, already has knocked on more than 235,000 doors in the state. Purple PAC, meanwhile, will spend money on social media, and Americas Liberty PAC will focus on advertising. \"Were able to leverage slightly different donor universes,\" said Jesse Benton, who runs Americas Liberty. \"We all realize its not a zero-sum game. There are some donors who really believe advertising is the way of the past, and the ground game is really the thing they want to see their money spent on. Then American Voters is the place for them.\", However the work gets divvied up, the era of multiple super PACs backing candidates is here to stay, Barbour predicted. \"Its sort of the wave of the future of fundraising at this level,\" he said. Twitter: @jtanfani, Staff writer David Lauter contributed to this report.]", "Date": "20150802", "Title": "[New 'super PACs' help 2016 mega-donors customize their political clout]", "Link": "http://www.latimes.com/nation/politics/la-na-personal-super-pacs-20150802-story.html\n", "Author": "[Joseph Tanfani]"}
