{"Content": "[The U.S. Supreme Court declined to hear a case challenging Wisconsins voter identification law Monday, making way for the state to require voters to show photo ID at the polls three years after the law was put on hold in a protracted legal battle. The law will not be enforced immediately: It is too late to implement the voter ID requirement for the states April 7 election, Wisconsin Atty. Gen. Brad Schimel said in a statement, because absentee ballots are already in the hands of voters. But, Schimel added, the voter ID law will be in place for future elections -- this decision is final. The law requires nearly all voters to have a state drivers license or U.S. passport with a current photo. This is great news for Wisconsin voters, Gov. Scott Walker said in a statement. As weve said, this is a common sense reform that protects the integrity of our voting process, making it easy to vote and hard to cheat. Walker, a Republican, backed the bills passage and signed it into law in 2011. Voting rights advocates, including the American Civil Liberties Union, have disagreed with the governors perspective, arguing that the requirement could disenfranchise hundreds of thousands of voters, including minorities and low-income and elderly voters who dont drive and may not have valid ID. Last year, state officials made it easier for residents without birth certificates to obtain an ID at little or no cost, Reid Magney, a spokesman for Wisconsins Government Accountability Board, told The Times on Monday. For now, the voters of Wisconsin will be able to cast their ballots free from the burdens placed on them by this law, said Dale Ho, director of the ACLUs Voting Rights Project, which filed a lawsuit challenging the law. But this should be the case for voters permanently, not just for one election, Ho said in a statement. We are evaluating our next steps in the fight for the right of all Americans to vote free from unnecessary barriers.\", In April 2014, U.S. District Judge Lynn Adelman ruled that the law was unconstitutional because it imposed an unfair burden on the poor and minorities, saying that as many as 300,000 Wisconsin voters could be deterred from casting ballots. In September, a three-judge panel of the 7th Circuit Court of Appeals reversed Adelmans ruling, noting that the U.S. Supreme Court had upheld a comparable Indiana law in 2008. In October, the full 7th Circuit Court deadlocked on the case in a 5-5 vote that allowed the three-judge panels ruling to stand. The Supreme Court weighed in a week later, saying it was too late to try to implement the law for the November election, and blocked state officials from implementing it while the high court pondered whether to take the case. Wisconsin already required citizens to submit their drivers license or state ID numbers -- or the last four digits of their Social Security number -- on voter registration forms. The state also already required voters to provide proof of residence at the polls, but it did not have to be photo ID: College identification, utility bills and residential leases were also acceptable for that purpose. After the April 7 election, voters will have to produce a valid state ID card or drivers license to pick up their ballot at the polls, or send in a photocopy of their ID when requesting an absentee ballot, said Magney, of the state Government Accountability Board. The board oversees state elections. The state has acknowledged that it may take weeks for residents who were born outside of Wisconsin to obtain a birth certificate needed to process an application for an ID. The ACLU and other activists have argued that for voters whose documents include clerical errors or other issues, it could take even longer. The process can take time, the Government Accountability Board said in a statement Monday, so it makes sense to get started early. Wisconsin election officials say there are likely to be special elections this year in which officials may enforce the law. The next statewide election requiring photo ID is scheduled for February 2016. 4:41 p.m.: This story has been updated throughout with Times staff reporting. The first version of this story was published at 2:04 p.m.]", "Date": "20150323", "Title": "[Wisconsin's voter ID law stands; Supreme Court rejects challenge]", "Link": "http://www.latimes.com/nation/nationnow/la-na-nn-wisconsin-voter-id-20150323-story.html", "Author": "[Christine Mai-Duc]"}