{"Content": "[The race for the 2016 Republican presidential nomination, already as jammed as a Tokyo subway car, has just gotten a lot more crowded with the announcement that Donald Trump and his enormous ego have entered the competition. David Horsey / Los Angeles Times, David Horsey / Los Angeles Times, On Tuesday, The Donald descended on an escalator from the higher reaches of Trump Tower in New York City to declare his candidacy in front of an audience that included a gaggle of passing tourists who were drafted into service by Trumps minions in an effort to pack the room. With his famous hyperbole in high gear, Trump described the crowd of hundreds as numbering in the thousands and beyond anybodys expectations. There have been no crowds like this, Trump declared. Well, actually, there have been, including the larger crowd that cheered for Jeb Bush on Monday in Florida as he finally stated the obvious and formally said he is running for president. Crowd counts aside, there were several distinct contrasts between the two men as they made their entries into the race. Bushs 90-year-old mother, former First Lady Barbara Bush, beamed at her son from the sidelines; Trump was flanked by a family that exuded Kardashian-level glamor and excess. Bush, sans jacket and tie, looked like an insurance office manager on casual Friday; Trump, dressed in a red power tie and expensive blue business suit, looked like the billionaire that he loudly proclaims himself. Bush downplayed any sense that he is entitled to the presidency because his father and brother are ex-presidents; Trump made it clear that he believes he is the only genius running while the rest of the nations political leaders are idiots and losers  including anyone named Bush. Mostly winging it, Trump delivered a political speech that fulfilled the hopes of comedians and cartoonists all across this great land. America, he said, is the worlds biggest sucker, but he is the guy to change that because he just sold a $15-million apartment to a Chinese guy. He curiously asserted that the U.S. has never beaten the Japanese at anything, overlooking Japans decade-long economic stagnation and a certain major war back in the 1940s. In the most noted passage of his remarks, he asserted that Mexican immigrants are a horde of criminals, drug dealers and rapists, except for a rare few that he assumes might possibly be good people. Trump said he would build a Great Wall on the southern border and make Mexico pay for it. There was really no sentence in his announcement that did not display his large ego and small grasp of political complexities. It is nearly impossible to imagine Trump winning the nomination, let alone the presidency. Nevertheless, after toying with the idea of running in past elections, this time he seems to be giving it a serious try. His chances of victory may be remote, but he could have a significant impact on the Republican nominating process. If Trump gets into the debates, he will be the guy willing to start a brawl. A mild-mannered, somewhat cerebral candidate like Bush could easily become Trumps favorite target. Just how Bush and other candidates handle confrontations with The Donald will be important. A flub, a gaffe, a sign of weakness can seriously wound a candidacy, and a stage-savvy bully like Trump could provoke the more credible but overly scripted candidates into doing or saying things they will quickly regret. Despite his stratospheric self-regard, Trump is not the best thing to happen to American democracy since 1776, but for outrageous political theater, the man is, undeniably, box office gold.]", "Date": "20150617", "Title": "[Jeb Bush beware: Donald Trump wants to pick a fight]", "Link": "http://www.latimes.com/opinion/topoftheticket/la-na-tt-donald-trump-wants-to-fight-20150617-story.html", "Author": "[David Horsey]"}