{"Content": "[Hillary Rodham Clinton knows her plan to stop big businesses from secretly funneling tranches of cash into politics may not fly with the Supreme Court and Congress, so she has a backup plan: publicly shame the companies. Clinton is embracing one of the few effective tactics for loosening the grip on big money in politics. The plan she announced Tuesday to force publicly traded companies to disclose all political giving comes as a growing chorus of academics and activists are finding new ways to expose companies that hide their political maneuvering. Many major companies are responding by coming clean. They are getting out of the game of giving so-called dark money, or funding from nonprofit groups that arent required to disclose the sources of their money. In many cases, the donations became a public relations nuisance and even a corporate liability. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Leaks and inadvertent disclosure of how the secret money was spent already had firms rethinking the giving schemes. Companies like Google Inc.  and even Shell Oil  touting environmental awareness have been exposed supporting shadowy organizations skeptical of climate change. Insurance giant Aetna Inc. which embraced Obamacare, was discovered in an alliance with political committees seeking to sink it. And a group of major pharmaceutical companies was found to be giving big money to nonprofits trying to stop government healthcare programs from covering the contraceptives they make. These developments were arguably not good for business, and more are sure to come, regardless of whether Clinton succeeds with her plan, as advocates grow increasingly sophisticated at rooting out the political alliances that corporations are forging. \"The public has a right to know about where money comes from for campaigns, and investors have a right to know how company resources are being spent,\" said David Donnelly, president of the advocacy group Every Voice. Clintons announcement comes as the Securities and Exchange Commission is under pressure to do exactly what she is demanding. About 1.2 million individuals and groups have commented on a proposal much like Clintons. The commission has balked on acting for years amid intense opposition to the proposal from the U.S. Chamber of Commerce and other industry groups, which argue it is a ploy to intimidate companies from making their voices heard in government. The fight headlined a major all-day conference the chamber held in Washington in December. The organization, which spent about $35 million on political advertising in the 2014 election cycle and has taken a lead in resisting government efforts to fight climate change, does not disclose the names of its 3 million members. \"This orchestrated disclosure campaign by opponents of the business community is meant to intimidate corporations from participating in important policy debates, either directly or through trade associations and organizations such as the U.S. Chamber,\" chamber spokeswoman Blair Latoff Holmes said in an email. Those joining the chamber in pushing back against the proposal say at the very least, it is not a matter that should be decided by financial regulators. \"Supporters of this say they want what is best for shareholders, but there is lots of information at firms that shareholders do not have access to,\" said David Primo, a professor of political science and business administration at the University of Rochester in New York. \"Shareholders cannot micromanage every decision a CEO or their team makes.\", Some prominent figures in the worlds of investment and corporate governance disagree. \"The commissions inaction is inexplicable,\" said a recent comment filed by three former SEC commissioners, including Arthur Levitt, who was chairman of the agency while Bill Clinton was president. \"Its failure to act offends not only us, who are alumni of this agency struggling to retain our deep pride of association, but investors and the professionals who serve them.\", Vanguard Group founder John Bogle urged the commission to go even further than requiring disclosure of corporate giving to political nonprofits. He suggested a rule that would bar companies from giving without the approval of the owners of at least 75% of its stock. Clintons embrace of the disclosure effort highlights an approach to campaign finance reform more aggressive than that of President Obama, who has spoken out about the ills of money in politics but has not made it a focal point of his agenda. \"Clintons endorsement of this rule at the SEC is a game-changer,\" said Bruce Freed, president of the nonprofit Center for Political Accountability. \"It is now part of the conversation for 2016.\", While advocates wait for the SEC to take action, they are making headway without it. The Zicklin Center for Business Ethics Research at the University of Pennsylvania works with Freeds group to publish an extensive survey of corporate disclosure of political giving. It scores hundreds of companies on 24 categories, ranking them in an annual report. The survey reflects a trend in corporate America away from secret giving. The next one will be published in October. The mandatory disclosure provision may be among the most politically feasible on Clintons campaign finance reform agenda. But it is not the most ambitious. The centerpiece of her plan is rolling back the Supreme Courts Citizens United decision, which allowed corporations and unions to pour unlimited amounts into independent political committees. In a video released Tuesday, the Clinton campaign notes that the push is personal for the candidate. The conservative lobbying group at the center of the case had gone to court to gain permission to pay for the broadcast of a movie attacking Clinton. If elected president, Clintons best hope of reversing that decision would probably come through the retirement or death of one of the conservative justices on the court, whom Clinton vows she would replace with a nominee committed to overturning Citizens United. Clintons agenda also includes a new system in which the federal government would match small campaign donations. Under it, contributions made by small donors would be matched up to an unspecified, modest amount. Candidates would be eligible for such funds only if they agree to new limits on the amount they receive from any individual donor. evan.halper@latimes.com, Twitter:@evanhalper, TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>]", "Date": "20150908", "Title": "[Hillary Clinton's secret weapon in campaign finance reform: Shame]", "Link": "http://www.latimes.com/nation/politics/la-na-clinton-dark-money-20150909-story.html\n", "Author": "[Evan Halper]"}
