{"Content": "[The pop-pop-pop of a white police officers gunshots. A black 18-year-old killed on a street in his own neighborhood. Angry black residents  tired of poverty, tired of getting pulled over, tired of being fined for frivolous traffic stops  finally hit their breaking point as Michael Brown lay in a pool of blood for hours in the summer sun. Officer Darren Wilsons shooting of Brown after a struggle in the street was only the first chapter of a saga with no end in sight. A year later, Browns death and the ensuing protests that engulfed the predominantly black St. Louis suburb of Ferguson, Mo. have changed hundreds of lives and unleashed a national debate on race and policing that continues to dominate headlines today, while Ferguson quietly struggles forward. \"Things have changed, a lot,\" said David Whitt, a 35-year-old father of three who lives in an apartment complex near where Brown was killed. But, Whitt said, \"the issue still remains that somebody was killed by police, and people say, We havent got justice.\", The shooting  and the clashes with riot police that followed for days  radicalized a cadre of millennials who have helped turned the slogan \"Black Lives Matter\" into a national movement that is now exerting pressure on the 2016 presidential campaign. A Department of Justice investigation found Fergusons municipal justice system functioned like a modern-day debtors prison, driven by racial profiling and ticketing and jailing poor residents. The findings led to statewide reforms and deeper national conversations about the effects of incarceration. \"We are making progress,\" said Jerryl Christmas, a St. Louis-based defense attorney who represents several activists arrested during demonstrations in Ferguson over the last year. \"A lot of issues have been raised and a lot of conversation is going on, but we still need more action.\", Lengthy federal and grand jury investigations found that Wilson had done nothing criminal. But now police shootings around the country receive intense scrutiny as public officials reevaluate policies and push for body cameras in hopes of keeping their community from becoming another Ferguson. The nation saw what happened in Ferguson and attitudes changed, with surveys showing a sharp increase in the number of whites who now agree with what black Americans have long been saying: Race is still a problem in America. But in Ferguson, as activists stage events to mark the anniversary of Browns death Sunday, ache mixes with optimism as the city has tried to stagger back to normal, or toward something better than normal, with mixed results. \"I think were going to come out of this, and eventually were going to come out of it even stronger, in my opinion,\" said Wesley Bell, one of two black members newly elected to the formerly white-dominated Ferguson City Council. The charred husks of businesses burned down by arsonists after the grand jurys decision in November not to indict Wilson have been swept away. Some shops on West Florissant Avenue, once the site of nightly clashes between demonstrators and police, have seen customers return along with the calm. \"Were starting to get back into the swing of things, people starting to come slowly but surely,\" says Antonio Henley, a barber and the owner of Prime Time Barber Shop, which experienced a \"tremendous\" loss of business when protests began. \"We were down 20, 40, 50% when it first happened. But we survived.\", Near the Canfield Green apartments, a memorial plaque has replaced a pile of signs and stuffed animals that marked the spot where Brown died. But Whitt said there are some in Ferguson who would just as soon forget what happened last August. \"Theyre trying to erase this memory of this tragedy that happened right here in Canfield,\" Whitt said. Change has also come to the city government, though nothing resembling the revolution many protesters sought. After a Justice Department report revealed racist emails sent by city officials, several resigned. Now Ferguson has a new interim police chief and a new interim city manager, but it still has the same mayor, James Knowles III, who is white, and who has resisted calls to step aside. The six-seat City Council had only one black member before Browns shooting. Now it has three, after an April election in which voter turnout more than doubled, but in which activist-backed candidates largely failed. City officials remain locked in negotiations with Department of Justice officials pushing for a consent decree that would probably reform the citys Police Department, a potentially pricey move at a time when city revenue has dropped because of the unrest. The city fell $3 million below its projected budget for the last fiscal year, largely due to $1 million in expenses related to the street protests and rioting and to a roughly $1.1-million drop in revenue from tickets handed out by officers, City Councilman Mark J. Byrne said. Unfair ticketing practices were a main focus of a Justice Department investigation. Byrne said the city had already implemented reforms to its municipal court system to cut down on the number of warrants and fines handed out. \"I think were on the right path on everything  we just have to get it done,\" Byrne said of justice reforms. Between January and June, the city handed out nearly $300,000 in fines, down dramatically from more than $900,000 over the same period last year, according to figures provided by the citys media office. \"We dont see as many traffic stops as we normally see all day every day,\" said Henley, the barber. Thomas Harvey, executive director of ArchCity Defenders, a nonprofit group that seeks an overhaul of St. Louis County municipal court systems, says that Fergusons new municipal judge, Judge Donald McCullin, has brought a more humane touch to the court, treating people with respect. Nonetheless, Harvey added, \"it doesnt change the fact the people are being pulled over and ticketed for essentially what amounts to being poor and black.\", Also, Ferguson is just one small town surrounded by other small towns with their own police departments and their own municipal courts and with many of the same problems. \"If you ask a person who lives in St. Louis County whats different, theyll say nothing,\" Harvey said. Browns parents have filed a lawsuit in hopes of holding Wilson accountable for the death of their son, and many activists remain angry at Wilson despite investigators doubts that Brown had his hands up when the officer killed him, as some Canfield residents said. In a recent interview with the New Yorker magazine, Wilson, who has since left the Police Department, said he was still careful where he ate dinner, and hinted that his own reality, like St. Louis County itself, had become informally segregated, for his own safety. \"We try to go somewhere  how do I say this correctly?  with like-minded individuals,\" Wilson told the magazine. \"You know. Where its not a mixing pot.\", matt.pearce@latimes.com, Twitter:@mattdpearce]", "Date": "20150809", "Title": "[A year later, Ferguson quietly struggles forward]", "Link": "http://www.latimes.com/nation/la-na-ferguson-anniversary-20150809-story.html", "Author": "[Matt Pearce]"}