{"Content": "[Gov. Jerry Browns inauguration speech this month was as green as the decor in the ornate Assembly chamber where he gave it. And it left Tom Steyer tickled pink. The philanthropist put millions into the 2014 elections, primarily through his NextGen Climate Action super PAC. His candidates mostly lost, but he has no regrets. Steyer has worked on political campaigns since the 1970s, including Democrat Walter Mondales 1984 presidential bid, but his formidable political voice comes from the billions he made as a hedge fund manager. Hes long invested in greener California politics, and making climate disaster a politically crucial national issue is his Cause One  like the TV spot NextGen ran during coverage of Tuesdays State of the Union speech. Your name has come up as a possible candidate for Barbara Boxers Senate seat. Are you going to run?, I havent made a decision yet. Either way, Ill be working full time to be part of the solution to the problems I care the most about. You spent nearly $75 million in the 2014 midterms. What did you get for that?, Our mission is to prevent climate disaster and preserve American prosperity. In the states we were in, we made climate a first-tier issue maybe for the first time ever. Candidates on both sides had to address the issue. It was in all the debates and all the papers. We believe turnout in places where we were on the ground was better than in 2010. Did you create single-issue climate voters?, We probably have 350,000 people across different states who said they would be climate voters. In addition we worked hard to explain why climate is a first-tier issue, both by going door to door and doing field work  presenting arguments in south Florida about why rising oceans affect people there. We tried to make it a local, human issue. Is an election campaign the best way to do that?, We believe the way social change occurs in the United States, over the last 200 years, is the democratic process. We want to be part of that process. This is the fifth anniversary of the Supreme Courts Citizens United ruling. Is outspending the other guy the sine qua non now? How do you reform money in politics if youre also a big part of it?, We agree that Citizens United is a very bad decision. We dont believe outspending your opponent is the way to go since we dont believe we will ever be outspending our opponents! If you see what the other side, the fossil fuel industry, spent to maintain the dirty energy status quo in Congress in the past two years, its a multiple of what we spent. We dont believe in hiding our heads in the sand. We have to figure out how to be effective within the process, even though there are parts of it we disagree with, Still, some critics call you a hypocrite about money in politics. What we are doing is very different from the so-called dark money groups. We are committed to using our resources openly and transparently. All of our electoral efforts are conducted through our super PAC, which discloses and reports its donors and expenditures, unlike some of the groups on the other side. Youre looked upon as the counter to the Koch brothers. Is that what you are?, We are very different from the Koch brothers. Were doing something we think is right and important. They may believe what theyre doing is right but it definitely redounds to their benefit. Second, were trying really hard to be transparent  theyre not transparent. We feel were going to win because we have the facts and right on our side. You dont have to outspend somebody if thats true. You want climate to be something every candidate has to address in the 2016 race. How do you do that?, Its important to show that it has resonance with voters they have to get. The people who care most about this statistically are the so-called rising American electorate and in particular young millennials. They have very low turnout patterns but care a lot about this issue. Other people in the so-called rising American electorate  people of color, single women  care disproportionately about this. To the extent you can reach those people, get them to be something that politicians need, thats really important. What did you learn in 2014 about making that happen?, The most powerful thing in politics is voter-to-voter contact. People take in ideas and formulate opinions by contact with other people they perceive to be trustworthy  other voters, people from their communities. Where does the public opinion battle stand?, Somewhere between two-thirds and 70% of the public agrees with us. I think the days of the climate deniers are over. To deny basic science is to risk the trust of the general public. People who used to be deniers are now what I call agnostics; theyre saying, \"Im not a scientist, Im not qualified to answer that question.\" However, that will be a very short-term answer because its kind of dopey. For example, youre not a doctor, but you have an opinion about the Affordable Care Act. Youre not a PhD in political science but you have an opinion about foreign affairs. The public is with us. The issue is not changing their minds, its making it important to them. So politicians minds have to be changed by the voters?, Yes. People can force them to move by voting, which is what I hope happens, or [climate change] events will change voting patterns and the behavior of elected officials. Im hoping we dont delay long enough that events happen that put us in a tough place. The Keystone XL pipeline is on Congress agenda. Wont someone extract the oil it would carry, regardless?, No. Whats really going on is a gigantic mining operation. They are trying to take that operation from the current 2 million barrels a day to 9 million a day. Keystone XL is 800,000 a day. Theyre trying to build five pipelines. There was never a point where they could go from 2 million to 9 million barrels without Keystone XL. If they could have, why didnt they just do it, and stop fighting in the United States?, You think that oil can stay in the ground?, That oil has to stay in the ground. Is there a prospect of some breakthrough in energy technology that will render fossil fuel obsolete, as fossil fuel itself did to, say, whale oil?, I sure as heck hope! I harken back to the AIDS crisis; we were looking for a silver bullet. We came up with a whole host of [treatments] in the \"cocktail.\" It may be that we never get the [climate] silver bullet, but we get the cocktail  innumerable advances in innumerable places that get us to a very prosperous society, and were not creating this catastrophe for ourselves. Whatever the U.S. may do, wont developing countries say, \"Fossil fuel is how you got rich; why cant we?\", Were going to have to walk the walk. Were not going to do this on our own, but I dont think they can do it without us. We can bring technology, finance, scientific credibility to all of this. [Its] the greatest opportunity of our lifetime as a country, to lead the world in doing the most important right thing. This interview was conducted by phone and email. It has been edited and condensed. patt.morrison@latimes.com, Twitter: @pattmlatimes]", "Date": "20150120", "Title": "[ Tom Steyer's green ambitions]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0121-morrison-steyer-20150121-column.html\n", "Author": "NULL"}
