{"Content": "[While not exactly motherhood or apple pie, stopping the spread of communicable diseases would seem to be the rare issue that transcends political differences, even in these fiercely partisan times. But the debate that arose this week over childhood vaccinations and the rights of parents underscored the way science has moved from the realm of objectivity and empirical study to a far more fractious and emotional battlefield. The vaccination issue, tied to an outbreak of measles at Disneyland, fails to cleave neatly along party lines. Some Republicans, including several possible 2016 candidates, were quick to join Democrats in urging parents to vaccinate their children  though they fell notably short of urging a government mandate. There is a lot of fear-mongering out there on this, said Republican Louisiana Gov. Bobby Jindal. I think it is irresponsible for leaders to undermine the publics confidence in vaccinations that have been tested and proven to protect public health. Others in the prospective Republican field echoed his statement, including Gov. Scott Walker of Wisconsin and Sens. Ted Cruz of Texas and Marco Rubio of Florida. Still, the issue opened up divisions within the GOP and among its White House hopefuls and played to an image Democrats are eager to promote, of the Republican Party and its candidates as divorced from reality, anti-science and, by extension, retrograde and anti-progress. The science is clear, Hillary Rodham Clinton, the front-runner for Democrats 2016 presidential nomination, sarcastically stated via Twitter. The earth is round, the sky is blue, and #vaccineswork. Lets protect all our kids. The debate began when President Obama, in a pre-Super Bowl interview, urged parents to vaccinate their children against measles, calling the supporting science pretty indisputable. Weve looked at this again and again, Obama told NBC News on Sunday. There is every reason to get vaccinated. The next day, two 2016 Republican prospects took issue with the president, appealing to the innate skepticism of many Republicans toward anything suggesting government control. New Jersey Gov. Chris Christie, who is seeking to broaden his appeal among conservatives, said parents need to have some measure of choice about vaccinating their children  though he quickly retracted the statement after sharp criticism. Kentucky Sen. Rand Paul, a champion of limited government, went further. Vaccinations should be a personal decision, he told conservative radio host Laura Ingraham. Later, when pressed on CNBC, Paul said that he believed the decision was a matter of individual liberty. More provocatively, the senator, who has a medical degree, said he heard of many tragic cases of walking, talking, normal children who wound up with profound mental disorders after vaccines. Similar assertions have been debunked by scientific research, and on Tuesday, Paul issued his own recantation, saying he supports vaccines; he also Tweeted a picture of himself getting a booster shot. Even so, the controversy suggests anew that the days of science as the publics impartial arbiter are tenuous, yielding to partisan impulses that have pushed the two parties and their elected leaders far apart. In 2009, when the science was less clear than today, Democrats and Republicans roughly agreed on the merits of vaccination, with more than 7 in 10 in both parties believing the shots should be mandatory, according to a Pew Research poll. A survey last year found that support had grown to 76% among Democrats and dropped to 65% among Republicans. A starker example of the partisan divide over science is global warming. A spring 2014 poll by Yale University found nearly 9 in 10 Democrats believe global warming is happening  a phenomenon supported by the overwhelming weight of scientific evidence  compared with fewer than 3 in 10 conservative Republicans, who hold considerable sway in the presidential nominating process. Anthony Leiserowitz, who directs the Yale Project on Climate Change Communication, said personal values greatly influence the way people perceive scientific issues. Those who believe strongly in individual autonomy  often conservatives  oppose the collective action needed to address global warming, so they question the science behind calls for personal sacrifice, Leiserowitz said. Similarly, those who are suspicious of big corporations  often liberals  oppose nuclear power generation and genetically modified food, even though extensive scientific research has concluded that both are safe when done properly. The messenger also drives political attitudes, Leiserowitz said, noting that the more closely the global warming issue was tied to Al Gore, the former Democratic vice president, the more Republican skepticism grew. The politicizing of science is nothing new, as Roger Pielke, an author and University of Colorado environmental studies professor, pointed out. President Nixon overrode the wishes of NASA experts and timed the Apollo 17 launch to boost his 1972 reelection bid. President Carter ignored his science advisors when he put solar panels on the roof of the White House, as a public relations move. (President Reagan removed them when he took office; President Obama put them back.), The vaccine controversy may soon pass. But more outbreaks of political posturing are expected. mark.barabak @latimes.com, ]", "Date": "20150203", "Title": "[Vaccine controversy latest collision of politics and science]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-republicans-vaccine-analysis-20150203-story.html", "Author": "[Mark Z. Barabak]"}