{"Content": "[California will have the nations first statewide ban on disposable plastic bags under a measure signed Tuesday by Gov. Jerry Brown, who also expanded gun controls and personal privacy protections in an eclectic final flurry of bill signings for the year. The governor rejected several new ethics proposals, passed in the wake of corruption scandals that have plagued the state Senate, saying the measures would have complicated political rules while having little effect. Many of the new laws were inspired by other headlines: Last springs slayings in Isla Vista, Calif. spurred a measure to allow the temporary seizure of firearms from people deemed to be a threat, and revelations about the federal governments spying programs led to fresh limits on data collection. The plastic bag ban, which set off one of the fiercest lobbying battles in the Capitol this year, requires grocery stores and pharmacies to stop dispensing single-use plastic bags beginning July 1. They must offer paper and reusable plastic bags instead, and charge at least 10 cents each. The ban will be extended to convenience and liquor stores in July 2016. The new law \"reduces the torrent of plastic polluting our beaches, parks and even the vast ocean itself,\" Brown said in a statement. \"Were the first to ban these bags, and we wont be the last.\", Hawaii has pursued a similar goal, with every county in that state adopting its own ban. Californias prohibition is the first statewide law passed by a legislature, although more than 125 local ordinances against plastic bags have been adopted in the state, including in the city of Los Angeles. The local laws are grandfathered in under the new overall measure, SB 270 by Sen. Alex Padilla (D-Pacoima), and the state will provide $2 million in loans to help plastic-bag businesses convert to the manufacture of reusable bags. Environmentalists pushed for the ban, arguing that the bags sully rivers and oceans and endanger wildlife, such as sea turtles, which mistake the litter for food. The activists, alongside grocers and employee unions, squared off against makers of plastic and paper bags, who said the prohibition would cost jobs and enrich grocers collecting fees for alternative bags. Lee Califf, executive director of the plastic-bag industry group American Progressive Bag Alliance, dismissed the bill as \"a backroom deal between the grocers and union bosses  under the guise of environmentalism.\", Califfs group has filed papers in an attempt to qualify a referendum to repeal SB 270 on the November 2016 ballot. If the group collects 504,760 petition signatures in the next 90 days, the new law will be suspended until the 2016 vote. Also on Tuesday  four months after a disturbed man killed six UC Santa Barbara students and wounded 13 other people  Brown approved the temporary seizure of guns from people determined by courts to be a threat to themselves or anyone else. The family of the killer, Elliot Rodger, had previously sought help because he was behaving strangely, but law enforcement officials took no action after questioning him. The new law permits law enforcement authorities or family members to ask a court to bar a dangerous person from possessing firearms for 21 days. Democratic Assembly members Das Williams of Santa Barbara and Nancy Skinner of Berkeley introduced the bill, AB 1014. \"Family members are often the first to spot the warning signs when someone is in crisis,\" Skinner said in a statement, adding that the bill \"provides an effective tool to get guns out of the hands of loved ones to avoid these tragedies.\", Elliot Rodgers father, Peter, issued a statement of thanks, saying, \"California today is a safer state because of this legislation. Lets hope other states follow.\", But several gun groups objected to the measure, noting that the gun owner may not receive a hearing before a restraining order is issued. A hearing must be held within 21 days of an order. \"Without a doubt, AB 1014 is one of the most egregious violations of civil liberties ever introduced in the California Legislature,\" Charles H. Cunningham, a director with the National Rifle Assn.s Institute for Legislative Action, wrote to lawmakers during the summer, before the bill passed. Brown also approved bills Tuesday that address Californians privacy, including a measure spurred by federal intelligence agencies acknowledgment that they have collected vast amounts of records on phone calls and Internet use by Americans. One is SB 828, by Sen. Ted Lieu (D-Torrance), which bars state agencies from cooperating with such efforts unless a warrant has been issued. Two others expand the states law against \"revenge porn,\" in which someone posts nude or sexually explicit photos of a former romantic partner online as retaliation for a breakup or other dispute. One, AB 2643 by Assemblyman Bob Wieckowski (D-Fremont), allows victims to seek court orders to have such photos taken down as well as to pursue damages. Another expands the revenge porn prohibition to \"selfies,\" or photos taken by the person in the picture. Sen. Anthony Cannella (R-Ceres) introduced that measure, SB 1255. Overall, Brown signed the vast majority of bills sent him by the Legislature this year, approving 930 and vetoing 143. His vetoes Tuesday included several proposals by legislative leaders seeking to regain public confidence after three Democratic senators were charged with crimes. One bill would have cut the value of gifts state lawmakers and others could receive and barred them from continuing to accept free tickets to sports events, concerts and theme parks and complimentary golf. The bill, SB 1443 by state Sen. Kevin de Len (D-Los Angeles), would be \"adding further complexity without commensurate benefit,\" Brown wrote. \"Proper disclosure, as already provided by the law, should be sufficient to guard against undue influence.\", Another bill would have required the state to develop a new, publicly accessible online campaign reporting system and require that candidates use it to file their financial information every calendar quarter, rather than semiannually. Brown said state technology could not yet accommodate the changes contained in the bill, SB 1442 by state Sen. Ricardo Lara (D-Bell Gardens). Senate President Pro Tem Darrell Steinberg (D-Sacramento) called the vetoes \"an opportunity missed.\", But Jessica Levinson, an election-law professor at Loyola Law School, disagreed, saying Brown was right to reject lawmakers \"knee-jerk reaction\" to the recent scandals, which included federal corruption charges as well as perjury and voter fraud convictions for the other. \"There was a lot of political will to propose ethics reform,\" she said, \"but Jerry Brown  understands that more regulation isnt always good regulation.\", The governor did not veto every ethics bill; he signed two measures barring lobbyists from hosting political fundraisers in their homes and offices. Those proposals were made after a prominent lobbyist was fined heavily for hosting events at his Sacramento home, where he lavished dozens of officials with expensive liquor and cigars. The bills are AB 1673 by Assemblywoman Cristina Garcia (D-Bell Gardens) and SB 1441 by Lara. patrick.mcgreevy@latimes.com, melanie.mason@latimes.com, Twitter: @mcgreevy99, @melmason]", "Date": "20140930", "Title": "[Statewide ban on disposable plastic bags is signed into law by Brown]", "Link": "http://www.latimes.com/local/politics/la-me-pol-brown-bills-20141001-story.html", "Author": "[Patrick McGreevy, Melanie Mason]"}