{"Content": "[In the first casualty of the 2016 presidential race, former Texas Gov. Rick Perry suspended his campaign Friday amid anemic fundraising and little traction in the polls. Perrys departure, coming days before the second GOP presidential debate, is unlikely to affect the contours of the race, given Perrys lack of support among Republican primary voters. But it appears to mark the end of a 30-year political career of a man once viewed as a swaggering star of the Republican Party. When I gave my life to Christ, I said, Your ways are greater than my ways. Your will is superior to mine, Perry told a conservative gathering in St. Louis. Today I submit that His will remains a mystery, but some things have become clear to me. That is why, today, I am suspending my campaign for the presidency of the United States. Perry did not immediately endorse a candidate in the GOP field, which still boasts 16 White House hopefuls, but he appeared to take multiple swipes at front-runner Donald Trump, whom earlier this year he declared a cancer on conservatism. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, The conservative movement has always been about principles, not about personalities, Perry said Friday. Our nominee should embody those principles. He  or she  must make the case for the cause of conservatism more than the cause of their own celebrity. Perrys efforts to break through in the sprawling GOP field never succeeded, and his fundraising grew so anemic that he had to stop paying campaign staff when he ran out of cash in August. His campaign only raised about $1 million through June 30. Nearly all the money supporting his effort was supplied by a cluster of linked super PACs, which together raised close to $17 million. Most of the super PAC money came from just three donors: The largest checks were written by two Dallas billionaires. Austin Barbour, the Mississippi-based main strategist for the three super PACs supporting the Perry campaign, said the groups still had close to $13 million available. He said he would consult with lawyers and donors this weekend before deciding whether to return the money  or turn their support to another candidate. Its just too early for us to think about that, he said. Barbour said some of the money was going toward organizing and surveying voters in Iowa. Until Friday afternoon, he said, he had remained upbeat about Perrys chances in winning over what he said were a big bloc of undecided voters. To be honest, we kind of thought we were seeing a little bit of light, he said. At this point four years ago, Perry was the front-runner in the GOP field in his first run for president. He had been governor of Texas since 2000, and his state had weathered the recession better than much of the country. He routinely went on hunting trips to states such as California where he would woo businesses to move to Texas because of its cheaper tax rates and laxer regulatory policies. He was charming on the stump and appealed both to business-minded and socially conservative voters. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, But that quickly eroded after a series of stumbles, notably a cringe-inducing debate performance. He could name only two of three federal agencies he said he would eliminate as president; \"Oops, he said. His campaign crumbled, and he dropped out before the South Carolina primary. His poor performances were later blamed on the aftermath of back surgery. Since then, Perry had sought to redeem himself. He prepared for the 2016 campaign by holding extensive meetings with conservative policy experts, working with speech coaches and courting donors. But he never recovered from the first impression he made on voters. Since launching his campaign, Perry blitzed the early states but failed to gain traction among voters. In an aggregate of recent national polls, Perry drew the support of less than 1% of Republicans. His low standings meant he never had a shot at making the prime-time debate stage last month in Cleveland or next week at the Reagan Library in Simi Valley. Perry sought to gain attention by being one of the first candidates to go after Trump, and Trump returned fire in signature fashion, suggesting that Perry ought to have to take an IQ test to appear on the debate stage. In his final moment on the presidential stage, Perry warned against falling for the cult of personality over durable life qualities, a clear slight at Trump. Perry said he was optimistic about the partys prospects in the presidential contest and that he had no regrets. We have a tremendous field  probably the greatest group of men and women, he said. I step aside knowing our party is in good hands, and as long as we listen to the grassroots, listen to that cause of conservatism, if we do that our party will be in good hands. I give you this news with no regrets, he added. It has been a privilege and it has been an honor to travel this country, to speak with the American people about their hopes and their dreams, to see a sense of optimism being prevalent despite this season of cynical politics. Times staff writer Joseph Tanfani contributed to this report. @LATseema, MORE POLITICS NEWS:, While GOP candidates gear up for Simi Valley debates, Joe Biden plans SoCal trip, The Latino vote is growing -- but it could be much bigger, Which presidential campaign is winning over Silicon Valley? None of them, 6:15 p.m.: This story has been updated with comments from Austin Barbour. This story originally published at 5:09 p.m.]", "Date": "20150911", "Title": "[Rick Perry becomes first candidate to drop out of presidential race]", "Link": "http://www.latimes.com/nation/politics/la-na-perry-campaign-20150911-story.html\n", "Author": "[Seema Mehta]"}
