{"Content": "[Its beginning to look as if the defining clich of the 2016 presidential campaign will be day one as in If elected, I will do X or Y on day one of my administration. Thursdays Republican debates offered some examples of this pledge. In the prime-timemain event, Wisconsin Gov. Scott Walker reiterated that he would tear up the nuclear deal with Iran on his first day in the Oval Office  but thats just the beginning!, To me, Walker said,you terminate the deal on day one, you reinstate the sanctions authorized by Congress, you go to Congress and put in place even more crippling sanctions in place, and then you convince our allies to do the same. At the late-afternoonkids tabledebate,Carly Fiorinasaid: On day one in the Oval Office, I would make two phone calls. The first one would be to my good friend, Bibi Netanyahu, to reassure him we will stand with the State of Israel. The second will be to the supreme leader of Iran. Fiorina admitted thathe might not take my phone call, but he would get the message, and the message is this: Until you open every nuclear and every military facility to full, open, anytime/anywhere, for real, inspections, we are going to make it as difficult as possible for you to move money around the global financial system. (She had better hope that the supreme leaders voice mail has a long running time.), In the same encounter, former Texas Gov. Rick Perry, dating himself, said: Itll be a pretty busy day, but that Iran negotiation is going to be torn up on day one. Were going to start the process of securing that border. Im also going to take a bottle ofWite-Outwith me to get started on all those executive orders that Mr. Obama has put his name to. Ted Cruz also plans a busy first day:, The first thing I intend to do is to rescind every illegal and unconstitutional executive action taken by Barack Obama. The next thing I intend to do is instruct the Department of Justice to open an investigation into these videos and to prosecute Planned Parenthood for any criminal violations. The next thing I intend to do is instruct the Department of Justice and the IRS to start persecutingpresumably he meant protectingreligious liberty, and then intend to cancel the Iran deal, and finally move the U.S. embassy in Israel to Jerusalem. Then ... lunch. Some of these first-day actions are perfectly feasible, such as the revocation or Wite-Outing of executive orders. But others promise more than they deliver, such as Cruzs suggestion that he could quickly sic the Justice Department on Planned Parenthood. The larger objection to day one promises is that they reflect a lack of humility. In some cases, it will be obvious that a new president will want to countermand the actions of a predecessor and no further research or consultation will be required. But in other areasespecially in foreign policyit would be rash to rush to action without sounding out allies and considering the consequences. Jeb Bush, to his credit, recognized this. He was widely criticized a few weeks ago when hesaid: One thing that I wont do is just say, as a candidate, Im going to tear up the agreement on the first day. Thats great. That sounds great, but maybe you ought to check in with your allies first. Maybe you ought to appoint a secretary of state, maybe secretary of defense. You might want to have your team in place before you take an act like that. Even when a president can act on day oneor day two or day threeinking an executive order doesnt mean that change will actually occur. On Jan. 22, 2009, Obama signed anorderproviding for the closing of the detention center at Guantanamo as soon as practicable, and no later than oneyear from the date of this order. Its still open. The political appeal of promising to change course on day one is obvious; a first-day shakeup dramatizes the democratic principle that elections matter. But patience is also a political virtue. Would-be presidents need to learn itand before day one. Follow Michael McGough on Twitter@MichaelMcGough]", "Date": "20150807", "Title": "[For presidential candidates, it's always day one]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-day-one-gop-debates-presidency-20150807-story.html", "Author": "[Michael McGough]"}