{"Content": "[California State University trustees are expected to discuss spending priorities for the additional $216.6 million in funding approved in the 2015-16 state budget and will vote on a proposed pay hike for university executives during a meeting Tuesday in Long Beach. Part of the discussion will center on Cal States successful 18-month letter-writing, lobbying and Twitter campaign to persuade Gov. Jerry Brown and the Legislature to approve the systems full funding request as opposed to the governors initial $119.5 million proposal. The final budget agreement is the first time since 2006 that the state has fully funded the universitys annual plea for additionalsupport, officials said. Overall state spending for Cal State totals about $3 billion. The new funding will allow the 23-campus system to enroll an additional12,000 students for spring of 2016 and the following fall, as well as hire more full-time faculty, counselors and other staff. Another $65.5 million will be used to increase the pool for employee compensation by about 2%. On Tuesday, trustees will vote on a proposal to use some of those funds to increase salaries by 2% for the campus presidents, Chancellor Timothy P. White and six other executive vice chancellors and vice chancellors effective July 1. Top executives received a 3% pay hike in 2014-15. That was the first across-the-board increase since 2007, officials said. Besides their state-funded salary, White and six campus presidents also receive supplemental compensation from private campus foundations. The 2014-15 pay hikes were controversial because they were calculated on this total compensationwhile being paid for with state funds. Several trustees at the time expressed misgivings about using tax dollars to augment private money. The proposed 2% hike will also be based on total compensation, and executives hired after July 1 would receive the pay increase effective on the date of hire. Cal State has been criticized in the past for boosting salaries for newly hired presidents, especially during the recession amid a succession of tuition hikes. White is expected to propose new compensation policies in coming months. TWITTER:@CarlaRiveraLat, ]", "Date": "20150721", "Title": "[Cal State trustees set to discuss budget,  executive pay hikes]", "Link": "http://www.latimes.com/local/lanow/la-me-ln-trustees-20150720-story.html", "Author": "[Carla Rivera]"}