{"Content": "[The Republican presidential candidates will debate at the Ronald Reagan library Wednesday, and you cant help but wonder what the Gipper would think of this bunch. Would that sound you hear at the start of the debate be Reagan rolling over in his nearby grave as each candidate tries to cozy up?, Nobody knows. But as someone who covered him for 20 years in Sacramento and Washington, I can guess. Reagan probably would be enjoying the show  not just this event in Simi Valley, but the overall campaign circus  and be especially curious about the barker, Donald Trump. The former president and governor would also probably be wishing he could run in this scattered field. Its huge size  16  reflects a party leadership vacuum that hed quickly fill, chasing off all but a small handful of wannabes. Get more national political newsand the latest from Campaign 2016 >>, To some degree, he would admire Trumps projection of authenticity and appeal to the disaffected, the voters disgusted with government and politics. That was a Reagan route to election victories. It was Reagan who, after the GOPs post-Watergate drubbing in 1974, urged his party to offer voters \"a cause to believe in  raising a banner of no pale pastels, but bold colors.\", Front-runner Trump flies bold colors while many of the other candidates wrap themselves in pastels. But Reagans secret to success in office  something many in the party have never understood  is that he often governed in pastels, as a pragmatist. He raised taxes or lowered them as he felt was needed. He never hesitated to negotiate with Democrats  or commies. Hes the most environmental governor in California history  protecting wild rivers from dams, preserving a Sierra wilderness by blocking highway builders, creating an air resources board that led to the nations first auto smog controls. As governor, he signed legislation allowing collective bargaining for local government workers. Think about that, Gov. Scott Walker of Wisconsin. What Reagan would not admire about Trump  would be repulsed by are his bombast and insults. Reagan didnt care for blowhards. The Gipper used tough words  \"Tear down this wall\"  but was always dignified and gracious, especially in public. The Donald carries on like he needs anger management. If Reagan got a little personal, he did it with humor, as in gently jabbing his 1980 opponent, President Carter: \"Anyone who says he likes cold showers will lie about other things too.\", \"Reagan would have never called people stupid even if he thought they were,\" George Steffes, his legislative lobbyist in Sacramento, told me. Reagan, unlike Trump, definitely would not be calling any woman a fat pig, dog or slob. And unlike Trump, he would not question whether Sen. John McCain (R-Ariz.) was a war hero. He idolized McCains military service. Nor, unlike Trump, would he characterize Mexicans who migrated here illegally as rapists and drug runners, or vow to deport all 11 million. As president, after all, he signed an amnesty law. Reagan appealed to our better angels, offering inspiration and hope. Trump stirs our bitter juices and rouses our uglier instincts. Perhaps that reflects this cyberspace age of impersonal and caustic verbiage. See the most-read stories this hour >>, But there are other Republicans running, many of them civilly. One problem for them is that Trump has been sucking up most of the media oxygen and theyre gasping for air. I called some old Reagan hands and watchers to ask them how hed be sizing up the candidates. \"Ive always been hesitant to guess what Reagan would do or think,\" said Stu Spencer, chief strategist of his successful campaigns for governor and president. \"Heres a guy who went to Sacramento and signed the most liberal abortion law in America. He was a very tough guy to peg.\", That said, Spencer figured that concerning Trump, \"Reagan would just smile and shake his head.\", Reagan wouldnt be endorsing anyone, Spencer continued. \"Hed say, Let them fight it out.\" Still, the consultant guessed, hed have some favorites, such as former Florida Gov. Jeb Bush, Florida Sen. Marco Rubio, Ohio Gov. John Kasich, New Jersey Gov. Chris Christie and Walker. Political strategist Ken Khachigian, who wrote major presidential speeches for Reagan, said \"he would be alternately bemused and in some ways troubled. Hed chuckle at so many running. \"But hed be troubled that weve reached the stage where there are no logical five or six heavyweights who have worked their way up the ranks to run. Hed see this as a party not focused enough to keep some of these people out of the race.\", Khachigian added: \"Hed probably have some joke to deal with it. Hed come up with something like cheaper by the dozen, out of an old movie. Then hed go back and ride his horse.\", Journalist and biographer Lou Cannon, who has written several books about the GOP icon, said \"the Reagan library has become like a cathedral where these guys have to come to pay homage to the Gipper. Its kind of a secular shrine. \"But if you gave most of them a test on what Reagan did, they wouldnt have a clue.\", Cannon said hell go to the debate and \"count how many times they bring up Reagan. Anybody who does not compare themselves to Reagan, they win the prize.\", Ill be looking for intellectual honesty, knowledge and civility. But maybe all thats too high a bar. A good show will suffice for now. george.skelton@latimes.com, Twitter:@LATimesSkelton, MORE POLITICS NEWS:, Walker backs out of California GOP convention, Politics at the local level pointless? Thats what many Californians think, While GOP candidates gear up for Simi Valley debates, Joe Biden plans SoCal trip, ]", "Date": "20150914", "Title": "[Reagan would be amused and troubled by this GOP field]", "Link": "http://www.latimes.com/local/politics/la-me-pol-prez-cap-reagan-debate-20150914-column.html", "Author": "NULL"}