{"Content": "[As the author of a new book about the Clinton Foundation ramps up his publicity tour, Hillary Rodham Clintons presidential campaign believes it has already turned a corner in confronting his accusations of cozy connections between the organizations donors and Clintons State Department. Given the dearth of challengers for the Democratic nomination for president, its not surprising that Clintons most formidable opponent in her two weeks as an announced candidate has been herself. Her biggest hurdle hasproved to be her husbands post-presidential foundation, in which she recently added her name. On Sunday, the Clinton Foundation sought to address the many questions raised about the donations that help fuel its work, just as Clinton Cash author Peter Schweizer appeared on network news shows. The New York Times, based in part on Schweizers work, reported on a flow of cash to the Clinton Foundation for five years from people with ties to a uranium-mining company that controlled some U.S. production capacity. The firm was later sold to a Russian state-owned agency, a transaction approved by a U.S. government committee that Hillary Clinton sat on as secretary of State. \"The fundamental question is, with this deal and the others we cite in this book, is it coincidence in a pattern we see repeated dozens of times where large Clinton supporters have business before the State Department, they make large payments, and favorable actions are taken, Schweizer said in an interview on Fox News Sunday. \"I dont think that coincidences occur that frequently. But when pressed in another interview on ABCs This Week, Schweizer conceded he did not have direct evidence linking the financial transactions to any actions Clinton may have been able to influence while running the State Department. Still, he insisted his work warranted further investigation. In a memo addressed to friends and allies, Clinton campaign spokesman Brian Fallon said Schweizers innuendo hasnt withstood scrutiny. Today, we believe we turned a corner as the author himself  conceded multiple times on national TV that his conspiracy theories lack any evidence and that he omitted key facts from his own reporting, Fallon wrote. The campaign had previously maintained that the Clintons were rightfully proud of the foundations work, calling it a world-class philanthropy that has helped millions through its work on such issues as AIDS and climate change. The campaign had sought to bring attention to Schweizers own past connections to Republican donors. One of the first questions Clinton responded to from a reporter on the campaign trail was about the claims made in Clinton Cash.\", Were back into the political season, and therefore we will be subjected to all kinds of distractions and attacks, she said in New Hampshire last week. Im ready for that. Maura Pally, the Clinton Foundations acting chief executive, acknowledged Sunday that mistakes were made in recent tax filings that included government grants with other donations, and that steps were being taken to quickly remedy them. She also rejected claims that the foundation, which includes 11 initiatives with their own organizational structures, had sought to avoid transparency. Today, our donor disclosure and foreign government contributor policy is stronger than ever, Pally wrote. After Clinton announced her candidacy April 12, the foundation  rebranded the Bill, Hillary and Chelsea Clinton Foundation in 2013 after Clintons time at the State Department came to an end  said it would disclose its donors four times a year instead of once. It also narrowed to six the number of foreign governments from which it would accept funding  nations that had preexisting partnerships for foundation programs. Pallys statement notes that the Clinton Giustra Enterprise Partnership has come under heightened scrutiny but does not specifically address Schweizers suggestion of a potential quid pro quo, a task left to Clintons campaign and an outside Democratic group that also issued a lengthy reality check. 3:21 p.m.: The story was updated throughout.]", "Date": "20150427", "Title": "[Hillary Clinton's campaign fights accusations against family foundation]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-clinton-foundation-mistakes-20150426-story.html\n", "Author": "[Michael A. Memoli]"}
