{"Content": "[They stood in a line that stretched for blocks around the Los Angeles Memorial Sports Arena, eager for a glimpse of the star attraction: a sometimes cantankerous 73-year-old with unruly white hair and a populist message. \"Feel the Bern!\" they chanted. \"Bernie! Bernie!\", The object of their desire was Bernie Sanders, a presidential candidate whom pundits give no chance of winning the nomination but who has touched a nerve in what has otherwise been a low-key Democratic contest. See the most-read stories this hour >>, The crowd boomed in agreement as Sanders took the stage for an hour. He talked about criminal justice reform, income inequality and immigration. He railed against Wall Street greed and laid out his plan to raise the federal minimum wage and make public universities tuition-free. Supporters of Presidential candidate Bernie Sanders cheer as he addresses the crowd during his campaign event in Los Angeles on Monday. Supporters of Presidential candidate Bernie Sanders cheer as he addresses the crowd during his campaign event in Los Angeles on Monday. Democratic presidential candidate Bernie Sanders speaks at the Los Angeles Memorial Sports Arena on Monday night. Democratic presidential candidate Bernie Sanders speaks at the Los Angeles Memorial Sports Arena on Monday night. Many audience members waved handmade signs and wore T-shirts that said, \"Join the political revolution today.\", Sanders, an independent and self-described socialist, has brought a surge of energy into a Democratic presidential primary where Hillary Rodham Clinton is the clear front-runner. Sanders has drawn huge crowds across the country in recent days, with 28,000 people turning out to hear him speak at a rally in Portland, Ore. over the weekend. \"The reason were doing so well in this campaign is were telling the truth,\" Sanders told the L.A. crowd, which his campaign estimated at 27,500, both inside the arena and in an overflow area outside watching on giant television screens. \"This is an economy that is rigged and meant to benefit those on top,\" Sanders said in a raspy voice strained by several days of back-to-back campaign rallies. \"We need an economy that works for all people.\", Although Sanders message is resonating with liberals intrigued by an alternative to Clinton, many political analysts and even some of his supporters say his chances of winning the Democratic nomination are slim. Polls suggest that most of his supporters would back a Clinton candidacy if she becomes the nominee. Still, he has a passionate following among left-leaning voters for whom Clinton seems too moderate. \"Bernie Sanders is sticking his head out of the window and saying, Im mad as hell and Im not going to take it anymore. Hes giving voice to the frustration that many progressives feel,\" said Rose Kapolczynski, a Democratic political strategist who has worked on several presidential campaigns. \"But I dont believe that translates into winning caucuses or primaries.\", Earlier Monday, Sanders picked up an endorsement from a labor organization that represents 185,000 nursesnationwide. \"We believe the next president should represent the people from all steps in life,\" said RoseAnn DeMoro, executive director of National Nurses United. \"Hes real. Hes authentic. Thats why were supporting him.\", TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Those sentiments were voiced repeatedly in L.A. on Monday night. \"Bernie Sanders is for the people,\" said Tanya Streety, 55, of Orange County. \"He has the heart to deal with stuff others wont address,\" said 17-year-old Tanith Ledbetter, who drove from Thousand Oaks with her mother. Ledbetter will turn 18 in time to vote in the 2016 presidential election. \"Bernie Sanders is one of the few politicians that is voicing what needs to be said for the common man,\" said Walter Gaines of Pasadena. Lynn Vavreck, a professor of political science at UCLA, noted that it was early in the election cycle and that support for Sanders may not translate to votes. \"Just because people are interested, it does not mean people will give money and actually cast a ballot in support,\" Vavreck said. \"People showing up for these rallies have a strong interest in politics. Theyre not average voters, who are barely tuned in to the election at this point.\", Sanders, who has been interrupted several times at previous rallies by Black Lives Matter demonstrators calling on him to address police shootings, invited the group to open his rally in Los Angeles. \"There is no president that will fight harder to end institutional racism,\" he told the crowd. He also gave time to an immigrant rights activist, and pledged to bring the millions of immigrants living in the U.S. illegally \"out of the shadows.\", \"Eleven million people cannot continue to live in fear,\" Sanders said. The Vermont senator faces serious challenges in his long-shot bid for the presidency, including poor name recognition and low levels of support from minority voters. Nonwhite voters make up a third or more of Democratic primary voters in most states, according to exit polls. Sanders, who represents a state that is 94% white, has made few inroads in the Latino and African American communities. Clinton, on the other hand, has broad support among those groups. She did better among Latinos than Barack Obama in the 2008 primary, and a new Gallup poll shows she is viewed favorably by 80% of African Americans. Only 23% of blacks polled in that survey said they had favorable views of Sanders, with two-thirds saying they didnt know enough about Sanders to have an opinion. Marilynn Manderscheid is a retired elementary school teacher who drove from Orange County to hear Sanders speak Monday night. She said that despite polls that show Sanders trailing Clinton, she believes hes a serious challenger. \"I remember when John F. Kennedy won when everyone said a Catholic couldnt possibly be elected. I walked precincts for Barack Obama when people said a mixed-race man could not win but he did,\" Manderscheid said. \"So, yes, I think Bernie  if he sticks to his message  will have a strong chance at winning the primary.\", Ledbetter, the 17-year-old, said she thought Sanders was taking the right approach to womens rights issues and income inequality. \"Hes the first candidate Ive really felt a resonance with,\" added Ledbetter, who said she had followed politics since she was 10. Streety, of Orange County, said she had been discouraged by politics and had stopped voting. She didnt cast a ballot during the last presidential election. \"I was politically stagnant,\" she said. \"I felt like my vote didnt count.\", But she said Sanders had resurrected her faith in elections. She was also moved by the young faces in the crowd. \"These kids are elated. I can feel it,\" Streety said. \"These kids are going to vote.\", kurtis.lee@latimes.com,sarah.parvini@latimes.com,kate.linthicum@latimes.com, MORE FROM POLITICS:, Who are Sanders supporters?, Ahead of L.A. visit, Sanders captures support of National Nurses United, Hillary Clinton unveils $350-billion plan to make college more affordable, ]", "Date": "20150811", "Title": "[Why a huge Los Angeles crowd turned out for Bernie Sanders]", "Link": "http://www.latimes.com/nation/la-na-sanders-california-20150811-story.html\n", "Author": "[Kurtis Lee, Sarah Parvini, Kate Linthicum]"}
