{"Content": "[Costcos deal to replace American Express with Visa as its exclusive credit-card company highlights an economic principle that should surprise no one. Consumers benefit when a business uses its market power to negotiate lower prices and passes along the savings to customers. Conservatives have championed such market forces for decades, arguing that if government regulators just got out of the way of businesses, consumers would be the big winners. That is, unless were talking about drug prices. Medicare, the federal healthcare program, is prohibited by law from haggling with makers of prescription drugs over the prices paid by its 54 million beneficiaries. That bizarre stipulation was put in place in 2003 by the administration of former President George W. Bush. It was part of a sweeping plan for Medicare to cover prescription drugs. Republican lawmakers, backed by the powerful pharmaceutical industry, argued at the time that the private sector was in a better position to ensure fair pricing of prescription meds. In subsequent years, Republicans have repeatedly beaten back attempts by Democratic lawmakers to lift this prohibition. \"Private competition works,\" Sen. Charles Grassley, an Iowa Republican and a principal author of the 2003 law, declared in 2007. \"The government has very little experience and a dismal track record figuring out what to pay for drugs.\", Sen. Harry Reid, the Nevada Democrat who was then the Senate majority leader, had a prudent response to this sentiment. \"The Department of Veterans Affairs is able to negotiate for lower-priced drugs,\" he said. \"HMOs can negotiate. Wal-Mart can negotiate. Why in the world shouldnt Medicare be able to do that?\", Surely that had nothing to do with the almost $240,000 Grassley received from pharmaceutical interests in the 2002 election cycle, prior to his leadership role in drafting the Medicare legislation, according to the Center for Responsive Politics. He was the Senates No. 2 recipient of pharmaceutical-industry money that year, after New Jersey Democrat Sen. Robert Torricelli, who received about $302,000 before quitting amid unrelated allegations of ethical misconduct. And its probably just a coincidence that no industry spends more lobbying lawmakers than the drug industry. From 1998 to last year, the industry shelled out more than $3 billion, according to the center. The reality, of course, is that conservative politicians and their profit-minded business allies have subverted market forces to ensure that Americans pay some of the highest drug prices in the world. The United States spends almost $1,000 a person annually on prescription meds, according to the Organization for Economic Cooperation and Development. Thats about twice as much as the likes of Canada, Japan, Germany and France, which permit their state-run insurance plans to negotiate the best possible terms with drug companies. Now step back and admire the elegant simplicity of what Costco accomplished. The buy-it-by-the-pallet discount retailer has been in bed with AmEx for 16 years. It was a sweet deal for Costco members. The Costco AmEx card offered 3% cash back for gas purchases, 2% for restaurants and travel, and 1% back for everything else. There was no annual fee as long as you remained a Costco member. The retailer clearly believed that accounting for about 10% of all AmEx cards in circulation was a big deal and worthy of special consideration from American Express. Presumably that meant seeking a lower fee to process credit card transactions. But Costco wanted more than AmEx wanted to give up. Ken Chenault, the card issuers chief executive, said he was unable to come to terms with Costco \"that would have made economic sense\" for the company. \"Its not easy to see a long-standing partnership end,\" he told financial analysts. \"But when the numbers no longer add up, its the only sensible outcome.\", Visa crunched the numbers and reached a different conclusion. Few details of Visas agreement with Costco were released when the deal was announced Monday, but its a safe bet that Visa made an aggressive bid to top rivals MasterCard and Discover. Costcos relationship with AmEx ends March 31, 2016. The Costco-branded Visa card will be issued by Citigroup and will feature its own rewards. Other Visa cards, however, also will be accepted. Needless to say, this is how capitalism is supposed to work. Costcos arrangement with Citi and Visa is a win-win-win-win for the companies and consumers. Meantime, the 2003 Medicare drug program costs about $80 billion a year and is projected to cost twice that amount by 2022 as aging baby boomers place an increasing strain on health benefits. Medicaid, the insurance program for low-income people, is allowed to negotiate discounts for members. The Congressional Budget Office estimates that if Medicare had the same bargaining power, it could save $116 billion over 10 years. Thats serious money, and its your money were talking about. These are taxpayer dollars at stake. But in the eyes of conservatives, a private company like Costco has more right than a government program like Medicare to reap the benefits of a free market. It makes no sense. And the biggest losers are the American people. David Lazarus column runs Tuesdays and Fridays. He also can be seen daily on KTLA-TV Channel 5 and followed on Twitter @Davidlaz. Send your tips or feedback to david.lazarus@latimes.com.]", "Date": "20150302", "Title": "[Costco-Visa deal shows why Medicare should negotiate drug prices]", "Link": "http://www.latimes.com/business/la-fi-lazarus-20150303-column.html", "Author": "NULL"}