{"Content": "[Sen. Rand Pauls jump into the 2016 presidential contest underscored the challenges ahead for the Kentucky Republican as he tries to move beyond his libertarian niche to find a foothold in the campaign for the White House. In the months-long unofficial part of his campaign, Paul has burnished his image as an unusual candidate for his party, visiting inner cities and college campuses and talking about issues such as reducing penalties for drug use as he courts the young and minority voters. But to succeed Paul will have to shore up his appeal among the Republican base of older white voters  a dual need that carries the risk of forcing him into a more conventional posture. Already his efforts have raised the question of whether he is canting his long-held views to feed his presidential ambition  and whether that will attract more supporters or fewer. Sen. Rand Paul made it official Tuesday morning, announcing on his campaign website that he is running for president, becoming the second major GOP candidate to formalize his plans to seek the White House in 2016. Sen. Rand Paul made it official Tuesday morning, announcing on his campaign website that he is running for president, becoming the second major GOP candidate to formalize his plans to seek the White House in 2016. Much of the early attention he has received, particularly from voters who usually spurn Republicans, stemmed from his noninterventionist foreign policy positions and opposition to defense spending. But he recently advocated a broad, $190-billion expansion of the Defense Department budget and has planned a South Carolina campaign visit this week that will feature an aircraft carrier as his backdrop. He attempted to appeal to both his target audience and traditional Republicans on Tuesday with an announcement that emphasized his outsider credentials  he has been a practicing eye surgeon  and de-emphasized his term as senator. He also called for congressional term limits and broad changes to the way Washington operates. I have a vision for America, he told hundreds of supporters. I want to be part of a return to prosperity  a return to a government restrained by the Constitution, a return to privacy, opportunity, liberty. Although he criticized the Obama administrations spending, he did not spare criticism of his own party. Too often when Republicans have won, we have squandered our opportunity by becoming part of the Washington machine, he said. That is not who I am. The staging of Pauls announcement reflected his effort to expand the Republican base: introducing him were former Oklahoma Rep. J.C. Watts Jr. and the Rev. Jerry Stephenson, who are both African American; Kentucky state Sen. Ralph Alvarado, a Latino; and a young University of Kentucky student, Lauren Bosler. The slogan Defeat the Washington machine; unleash the American dream adorned the lectern at which they spoke. (Pauls father, three-time presidential candidate and former Texas Rep. Ron Paul, was present but did not speak.), A series of videos accented Sen. Pauls call for reducing drug conviction penalties and his objections to collection of telephone data by the nations spy agencies  issues that he plumbed as he neared his formal announcement and returned to emphatically on Tuesday. Absent was the red meat of vital importance to the Republican base: No mention was made of President Obamas healthcare overhaul, immigration or the religious freedom debate that has galvanized conservatives in recent days. Cato Institute scholar David Boaz said that to succeed, Paul will have to draw new participants into the nominating process in big numbers, particularly in states where Republican contests are open to non-GOP voters. Hes going to get hit hard from both the left and the neocon right, and he hasnt yet played politics at this stage, so I dont know how good hell be, said Boaz, author of The Libertarian Mind. In the primary, there clearly are groups of voters who are not going to be attracted to the message that hes offering, so one of his challenges is to get some of those independents to come into open primaries and to get young people to come into open primaries and especially the Iowa caucuses. The dual effort to appeal to traditional Republicans and those not allied with the party represents Pauls greatest challenge in the primaries, and potentially his greatest strength in a general election, said Stephen Voss, a political science professor at the University of Kentucky. Hes so far from a conventional Republican, in terms of both his behavior and ideological stance, Voss said. He hopes to appeal to people who are not the standard Republican constituency, people more skeptical of military spending or projecting American muscle abroad.... That will help him appeal to a general-election audience, but in the short term, thats a challenge. The attacks have already begun. Shortly before Paul announced his intentions, a group called the Foundation for a Secure and Prosperous America launched a $1-million ad buy in the early-voting states of Iowa, Nevada, New Hampshire and South Carolina that deemed Pauls foreign policy dangerous, according to the New York Times. Paul spent a substantial part of his speech defending his national security views. I envision an America with a national defense that is unparalleled, undefeatable and unencumbered by overseas nation-building, Paul said. Many political observers expect national security to be a more dominant theme in 2016 than in recent elections, due to the well-publicized brutality of Islamic State, the proposed nuclear deal with Iran, Russias behavior in Ukraine and other problems overseas. All of the other potential presidential candidates have demanded a more aggressive posture than has Paul. Clearly, many would argue that he is an isolationist, said former Rep. Mike Rogers, a Michigan Republican and chairman of a group called Americans for Peace Prosperity and Security. I think his challenge is can he keep his supporters and then move to a more peace-through-strength orientation. Tuesdays speech by Paul, whose 2010 election was fueled by the rise of the tea party, received solid marks from prominent libertarians. He hit all the right notes in terms of signaling that he is serious about the libertarian dimension of his policy. I dont consider him a hard-core libertarian. I consider him libertarian-ish. He brought that to Louisville today, said Nick Gillespie, editor in chief of Reason.com. In coming days, Paul plans to barnstorm the early-contest states, with events scheduled in New Hampshire, South Carolina, Iowa and Nevada. Paul entered the race eight days after his Republican colleague, Sen. Ted Cruz of Texas, became the first major candidate to announce that he would seek the White House. Cruz, a tea party favorite who gained fame for a nearly 22-hour filibuster urging the defunding of President Obamas healthcare overhaul, appeals to many of the same voters who would form Pauls base. Paul and Cruz have been overshadowed during the last few months by former Florida Gov. Jeb Bush, who has put on a fierce fundraising effort, and Wisconsin Gov. Scott Walker, whose anti-union and Midwestern sensibilities have found favor among many Republicans. Neither has formally announced, but both are expected to. Some political veterans expect Paul to make a splash in the GOP nominating contest, as his father did, but question whether voters could picture him as the leader of the free world. He does make people sit up and listen, said Kevin Madden, a Republican strategist who advised Mitt Romney in 2008 and 2012. But one of the big challenges that Rand Paul will have is answering the question, Is this a candidate that I can picture in the Oval Office?, Twitter: @LATSeema, , 7:05 p.m.: This article has been updated with changes througout. 11:44 a.m.: This article has been updated with additional comments. 9:53 a.m.: This article has been updated with additional comments. 8:46 a.m.: This article has been updated throughout with additional details and background. 6:20 a.m.: This article has been updated with Rand Pauls announcement of his candidacy on his campaign website. This article was originally published at 5 a.m.]", "Date": "20150407", "Title": "[Rand Paul's 2016 entry speech makes his presidential challenges clear]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rand-paul-presidential-campaign-2016-20150407-story.html\n", "Author": "[Seema Mehta]"}
