{"Content": "[Selecting a new leader for the nations second-largest school system is a high-stakes decision for a politically divided L.A. Board of Education. The next superintendent will have to take charge of a system that has long struggled to find a unified vision to focus on improving student achievement and teacher performance, and developing a palatable plan for adapting to more technology-focused classrooms. Business and community leaders say the future of Los Angeles economy hinges on how well the district educates its 650,000 students. Interested in the stories shaping California? Sign up for the free Essential California newsletter >>, Nine months after Los Angeles Supt. John Deasy resigned under pressure, the school board is beginning its search to find his long-term replacement. After meeting late into the evening Thursday behind closed doors, the seven-member board directed staff to seek out companies qualified to conduct the search. Selecting a firm to help identify potential candidates could take until mid-September, board President Steve Zimmer said. A timeline has not been set for the lengthy search process, which includes crafting the selection criteria for the new superintendent and gathering public input. But under a scenario posed by Zimmer, the Los Angeles Unified School Districts next long-term superintendent would not start until the 2016-17 school year. That schedule raises questions about the staying power of current Supt. Ramon Cortines, who came out of retirement in October to take the reins after Deasy stepped down. The 83-year-old Cortines agreed to a contract that runs through June 2016, but has said hed prefer to leave by the end of this year. The school board has largely relied on Cortines to quietly guide the district as it decides how to move forward after Deasys high-profile tenure. The board said it was waiting for newly elected members to take office before beginning the months-long search process. Zimmer said the delay was also part of an effort to get the district back on track. \"We had to approach this from a sense of stability,\" Zimmer said. Cortines helped the district mend a malfunctioning online student records system, balance the budget and work out a contract agreement with teachers that avoided a threatened strike, Zimmer said. Board members must rally several political factions and find common ground in selecting a leader who is not only a capable administrator but whose ideology reflects their goals for the district. Zimmer said differences among board members will not hinder the search because they agree on the broader issues of providing an equitable education and improving teacher performance, even if some disagree on the approaches to reach those goals. \"Some of the ways that we might address a particular issue around a labor contract or how we might approach a particular initiative around teacher accountability may be different,\" Zimmer said. \"But there is no daylight between us in terms of the overall mission, and when you have a decision and a process that has the weight of the superintendent search, the individual conflicts and approaches will be overwhelmed by the task before us.\", Deasy had the backing of some school board members and wealthy donors who wanted to overhaul public education through a set of priorities that included supporting the growth of charter schools and using test scores as a factor in teacher evaluations. United Teachers Los Angeles, which contributed to the election campaigns of some board members, led the charge against Deasys leadership style. The union sought a different set of changes, including smaller class sizes and better teacher training. \"We do not want another person cut from the same cloth as John Deasy,\" UTLA President Alex Caputo-Pearl said. \"The next superintendent has to be collaborative and connected.\", Deasys resignation last year followed a series of missteps including a failed $1.3-billion effort to provide iPads to all students that became the target of an FBI investigation, the troubled rollout of a new records system that put students at risk of not graduating on time and frequent conflicts with school board members and the teachers union. Cortines managed to work with ideologically different sides to find compromise, said Sarah Angel, a managing director with the California Charter Schools Assn. The group expects the same type of leadership from the districts next superintendent. \"We want a superintendent who wont let politics drive decisions and policy,\" Angel said. \"We want a superintendent who will help create more high-quality options for families. We want a superintendent who believes that families have the right to choose the best learning environment for their children.\", Board member Richard Vladovic said the board feels a sense of urgency but wants to conduct an extensive search thats transparent and gives a say to parents, teachers and others who have been clamoring for a chance to help select the next leader. But Vladovic said the board also has to do some soul searching of its own. \"We need to know where were steering the ship, have a destination in mind, before we hire a captain to get us there,\" Vladovic said. zahira.torres@latimes.comTwitter: @zahiratorres, MORE ON EDUCATION:, Has LAUSDs approach to teacher discipline gone too far?, Editorial:L.A. Unified embarrassed again by its act-fast habit, Op-Ed: The survival of public education is at risk. Heres what LAUSD needs to do. ]", "Date": "20150801", "Title": "[L.A. Unified begins search for next long-term superintendent]", "Link": "http://www.latimes.com/local/education/la-me-lausd-superintendent-20150801-story.html\n", "Author": "[Zahira Torres]"}
