{"Content": "[With nearly $47 million raised for the primaries, Hillary Rodham Clinton appeared likely to outpace her presidential rivals in the early race to fund their 2016 campaigns, though the Democratic front-runner has burned through a large portion of her contributions at this nascent stage. While Clinton raised a massive sum, her campaign also spent nearly $18 million, ending the fundraising quarter with about $28 million in cash on hand. Aides to Clinton said Wednesday much of that money was spent on purchasing voter lists in early primary states and other technology infrastructure. The crowded field of presidential hopefuls hasuntil a midnight deadline to file initial finance reports to the Federal Election Commission. Each campaign must raise money the old-fashioned way, painstakingly amassing checks from thousands of individual donors who can give no more than $2,700 each to support a candidate in a primary race. But those dollars stretch farther than money raised by independent committees like \"super PACs,\" since federal law requires that campaigns get the lowest available advertising rates. And the money is directly controlled by the campaigns, making it easier for candidates to focus their message and marshal get-out-the-vote efforts. Experts say the crowded field of candidates, and the relaxation of campaign finance rules since 2010, will probably drive the 2016 race to set new spending records. On the Republican side, Jeb Bush reported raising $11.4 million in the quarter ending June 30. The former Florida governor entered the race June 15 and on average raised about $714,000 per day until the end of the quarter, with a majority of donors giving the maximum contribution. He has about $8 million cash on hand. Still, Bush remains far and away the overall money leader in the early going, thanks to $103 million raised by the super PAC supporting his candidacy. Such political action committees, which can accept unlimited donations, dont have to report their donors until the end of the month. Bush reported fewer than 5,000 donors and an emphasis on bigger checks  more than $10 million of his haul came from people who gave the maximum amount. He said $228,000 was raised by lobbyist bundlers, a disclosure required by campaign law. Bush delayed formally opening his campaign until mid-June, a strategy that helped him pull in donations for his super PAC without violating FEC rules. But the strategy came with a price: Until he officially declared his candidacy, Bush personally paid for staff and consultants, the report shows, about $380,000 in all. The Bush campaign said it would report all bundlers raising money, not just lobbyists, by the next reporting deadline, Oct. 15. Bush is the first Republican candidate to pledge such a disclosure; Clinton has said she will also identify her bundlers. A Bush campaign spokeswoman said the disclosure was consistent with the candidatesrecord of transparency and, frankly, should be expected of public servants.\", Sen. Bernie Sanders (I-Vt.), who is challenging Clinton for the Democratic nomination, reported raising $15.2 million in two months. The largest share, $10.5 million, came from people who gave less than $200 each. The campaign said he had more than 284,000 donors, who gave an average of $35. Our campaign is a strong grass-roots movement supported by middle-class Americans from working families, not billionaires trying to buy elections, Sanders said. Clinton also reported Wednesday that 250,000 donors from all 50 states contributed to her campaign. Republican Ben Carson, a retired neurosurgeon, reported raising about $10.5 million from a broad base of donors. Sen. Rand Paul (R-Ky.) reported raising about $7 million, also relying heavily on small donors. And Donald Trump, who released a statement Wednesday asserting that he was worth $10 billion, filed a report that showed his campaign had received $1.9 million since he formally entered the race on June 16  nearly all of it in loans from Trump. But for most players in the Republican field, their campaign take was drowned by the size of the large checks landing in their super PACs. Sen. Ted Cruz of Texas, who joined the race in March, has reported raising $14.2 million in two quarters, a slower rate than some of his rivals. But the super PACs backing him pulled in far more, about $38 million, giving him more than $52 million overall and placing him second in the Republican field. Sen. Marco Rubio of Florida, with a campaign fund of $12 million, also has showed strong early backing from outside groups, with a combined $31.9 million. Former Texas Gov. Rick Perry pulled in just over $1 million for his campaign. But thanks to checks from three large donors to outside groups, Perry already can count on nearly $18 million for his second try at the White House. New Jersey Gov. Chris Christie announced his bid after the fundraising quarter had closed, but a super PAC backing him said this week it had raised $11 million. Allies of Wisconsin Gov. Scott Walker, who officially joined the race this week, told the Washington Post they hoped to raise about $20 million by the end of the month for committees backing him. Former business executive Carly Fiorinas campaign has said it has raised $1.4 million, with another $3.4 million from outside groups. Former Arkansas Gov. Mike Huckabee reportedly raised a total of about $8 million, including $2 million for his campaign committee. Former Sen. Rick Santorum of Pennsylvania, who ran unsuccessfully for the nomination in 2012, said he had raised $607,000. Louisiana Gov. Bobby Jindal reported raising $578,000. Times staff writers Evan Halper and Sahil Chinoy contributed to this report. joseph.tanfani@latimes.com, Twitter: @jtanfani, 7:42 p.m. This article was updated with additional information on Bushs campaign finances. 6:05 p.m. This article was updated with additional information on Clintons campaign finances. This post was originally published at 4:12 p.m.]", "Date": "20150715", "Title": "[Clinton and Bush lead in early campaign fundraising]", "Link": "http://www.latimes.com/nation/la-na-campaign-finance-20150715-story.html\n", "Author": "[Joseph Tanfani, Kurtis Lee]"}
