{"Content": "[Votes were being tallied in Afghanistan after a presidential runoff election on Saturday that saw scattered violence and a more subdued turnout among women than the first round of balloting two months ago. Reports from the provinces indicated that Taliban insurgents again tried to disrupt voting outside of Afghanistans heavily guarded cities, launching attacks that killed 14 civilians and 10 Afghan security personnel, officials said. A rocket slammed into a home in eastern Laghman province, killing four people, including two children, Afghanistans Tolo news channel reported. The Afghan Interior Ministry recorded 150 security incidents across the country, although most were small-scale attacks such as isolated roadside bombings and mine blasts. In much of Afghanistan, however, voters and officials reported a relatively smooth election day as the country again managed to avoid major chaos in the months-long contest to select President Hamid Karzais successor. Election officials said that turnout was about 7 million, close to that of the first round, although anecdotal reports suggested that fewer women cast ballots because of security concerns. The new president will guide Afghanistan through a crucial transition in which the remaining 32,000 U.S. troops will depart by 2016, leaving the countrys fledgling security forces to battle a weakened but determined Taliban insurgency. Former Foreign Minister Abdullah Abdullah was considered the front-runner based on his strong showing in the first round of voting in April, but ex-Finance Minister Ashraf Ghani was believed to have closed the gap in the final weeks with support from his Pashtun ethnic group, Afghanistans largest. Millions of ballots were being counted by hand, and results werent expected for several weeks. The Afghan people have once again shown their commitment to a peaceful and democratic future for Afghanistan, U.S. Ambassador James B. Cunningham, said in a statement. The Afghan security forces, well prepared and effective, again performed superbly in protecting the elections. Election officials opened more polling sites, deployed more observers and prepared more ballot papers in an attempt to address shortcomings from the first round, in which voting had to be extended in many areas because of long lines and several polling stations running out of ballots. At a polling center at a high school in Istalif, a district north of Kabul, election officials reported lower turnout than in April. Still, enthusiasm was high among those who did line up to cast ballots shortly after polls opened at 7 a.m. Abdul Raof Yaqobi, a bearded 25-year-old, said he came to vote for the future of my country. Yaqobi, a law student, said he was voting for Abdullah, a longtime opposition politician whom he described as a leader among the people. He understands the peoples problems in all over Afghanistan more than anyone else. Abdullah, a vocal Karzai critic who is associated with the Northern Alliance forces that battled the Taliban in the 1990s, won 45% of the vote in the first round compared with 31.6% for Ghani. He secured the endorsements of several top political figures, but Ghani, a technocrat and former World Bank economist, was counting on strong support from his southern Pashtun base. Both men are seen as relative moderates who would patch relations with the United States, which have badly deteriorated in the closing years of Karzais 13-year tenure. Each has pledged to sign a bilateral security pact that would provide for about 9,800 U.S. troops to remain in Afghanistan until 2016 under a plan recently announced by the Obama administration. We are hopeful that whoever wins the elections, he should serve the people, said Qari Noorulhaq, 62, who voted with his wife in Kabul. His wife, Fariba, said she urged him to bring her to vote after she saw people casting their ballots on TV. We voted for our children and we dont want war in this country again, said Fariba, who wore a burqa. We dont want to end up as refugees in Pakistan or any other country. Special correspondent Baktash reported from Kabul and Times staff writer Bengali from Mumbai, India. Follow news from South Asia on Twitter with @SBengali]", "Date": "20140614", "Title": "[Afghans vote in runoff election to choose Karzai's successor]", "Link": "http://www.latimes.com/world/afghanistan-pakistan/la-fg-afghanistan-runoff-election-20140614-story.html\n", "Author": "[Shashank Bengali]"}
