{"Content": "[President Obama launched an effort Thursday to frame the 2016 presidential election on his terms, urging voters to be wary of Republicans who would reverse economic progress that his administration has fought hard to achieve. Obama visited Wisconsin to tout his new rules on overtime pay and took several jabs at Republicans, including Gov. Scott Walker, one of what he called a bus full of aspirants for his office. Ive lost count how many Republicans are running for this job. Theyll have enough for an actual Hunger Games, he joked. Obamas remarks were his first extended public foray into next years election, a race that already has drawn 14 announced Republican candidates, with two more  including Walker  expected to join this month. Despite Republicans rhetoric intended to cast them as on the side of the middle class, Obama said, they support a return to the policies that led the nation into economic crisis. Recalling the Republican warnings that his administrations actions on healthcare, taxes and other issues would lead to economic misery, he cited Thursdays jobs report and its 5.3% unemployment rate as part of what he called a record streak of private-sector job growth. This is progress. Step by step, America is moving forward, Obama said. The question we have to keep asking ourselves is, where do we go from here? Because we still have choices. One thing that the bus full of people who are fighting to lead the Republican ticket all share is they keep on coming up with the same old trickle-down, youre-on-your-own economics that helped bring about the crisis back in 2007-2008 in the first place, he said. Obama and Walker exchanged a cordial greeting after the president stepped off Air Force One en route to his event in La Crosse, a small western Wisconsin city across the Mississippi River from Minnesota. The president has been sharply critical of the governors record, including releasing a pointed statement after the Wisconsin Legislature passed a so-called right-to-work bill in March. The legislation, which curbs the clout of private-sector unions, became a Walker priority four years after his successful drive to end collective bargaining rights for most public-sector unions. The earlier move triggered a failed recall campaign to oust Walker. On Thursday, Obama contrasted Wisconsins economic fortunes with those of Minnesota, where Democratic Gov. Mark Dayton takes a different approach. As Walker has fought organized labor and cut education funding, Obama said, Dayton has expanded Medicaid, raised the minimum wage, and raised tax rates for the highest earners. Now, according to the Republican theory, all of those steps would have been bad for the economy. But Minnesotas unemployment rate is lower than Wisconsin; Minnesotas median income is around $9,000 higher, Obama said. Its a pretty interesting experiment. Walker took a different tack in a recent op-ed. Wisconsin has enjoyed a dramatic recovery, he wrote, in spite of  not because of  the presidents big-government policies. Obama also spoke at length about his overtime proposal, which he says will give 5 million middle-class workers a raise. The president instructed the Labor Department last year  which he called his year of action  to rewrite the rules governing eligibility for overtime pay. The new rules seek to expand the pool of salaried workers who automatically are eligible for higher pay for overtime work. Under the authority already granted to the Labor Department through the Fair Labor Standards Act, the administration will more than double, to $50,440 a year, the minimum salary threshold that guarantees higher compensation for salaried employees who work more than 40 hours a week. The move is among the most significant Obama has made to address growing income inequality, which has become the driving force of his partys progressive wing. Its one of the single most important steps we can take to help grow middle-class wages, the president said. The action has cheered progressive allies who have bitterly opposed the president over trade in recent weeks. It also has served as a useful signal to Obamas fellow Democrats that for all the harsh words and bruised egos, theyre in agreement more often than not. It is a reminder to people in the labor movement that this president does have his eye on working families and does care about them, said Rep. Mark Takano (D-Riverside), who has been a leading advocate of the overtime change. This is a very unifying move the administration is taking. Such a change, Takano said, had become a cause celebre within the House Progressive Caucus, and he called it a very bold step. Im glad that he has discovered his footing on this issue, Takano said. And Im going to do all I can in Congress to make sure we provide the president with the support to make sure this happens. Republicans who helped secure Obamas trade victory last week criticized his move on overtime, saying the steps he was taking to try to boost middle-class pay would only hurt job creation. Democratic Rep. Ron Kind, who represents La Crosse and helped lead a group of moderate Democrats supporting the trade bill, said only that he was looking forward to working with the administration on this [overtime] proposal as it moves forward. michael.memoli@latimes.com, 6:41 p.m.: The story was updated throughout with new details. 2:19 p.m.: The story was updated with Obamas comments. The story was originally published at 6:02 a.m.]", "Date": "20150702", "Title": "[Obama warns against the 'you're-on-your-own economics' of 2016 Republican candidates]", "Link": "http://www.latimes.com/nation/la-na-obama-wisconsin-overtime-rules-20150702-story.html\n", "Author": "[Michael A. Memoli]"}
