{"Content": "[Hillary Rodham Clinton cast herself as a fighter for Americans who have yet to share in the nations economic recovery, drawing inspiration from a Democratic icon as well as her own roots in public service Saturday as she launched a new phase of her second bid for the White House. Speaking in a park dedicated to Franklin D. Roosevelt, on an island in New Yorks East River that offered sweeping views of the Manhattan skyline, Clinton said that FDRs legacy had inspired both President Obamas and her husband Bill Clintons administrations, and generations of families, including her own. Today, while the nation is \"standing again\" after the Great Recession, \"we all know were not yet running the way America should,\" she said, blaming the problems on Republicans \"trickle-down\" approach. Hilllary Rodham Clinton hails new era of prosperity. Hilllary Rodham Clinton hails new era of prosperity. Clinton sought to tap into the countrys still-nagging economic anxieties and the rising populism within her own party, declaring that the \"time has come\" for middle-class Americans who have wondered when their hard work would pay off. \"Prosperity cant be just for CEOs and hedge fund managers. Democracy cant be just for billionaires and corporations,\" she said. \"You brought our country back. Now its time, your time, to secure our gains and move ahead. And you know what? America cant succeed unless you succeed.\", The Republican \"choir,\" she said, had some \"new voices,\" but all of them were \"singing the same old song: a song called Yesterday.\", The line served both as an accusation that Republicans would return to the policies that Democrats blame for bringing about the financial crisis of 2008 and as a rejoinder to those in the GOP who have dubbed her a candidate of the past, seeking to run for a third Obama term. On issues such as climate change, economic fairness, immigration and equal rights for gays and lesbians, Clinton said it was Republicans who were out of step with the public. \"Fundamentally they reject what it takes to build an inclusive economy,\" she said. \"It takes an inclusive society -- what I once called a village -- that has a place for everyone,\" she said. She also offered a personal qualification, drawing loud applause when she reminded the crowd that while she might not be the youngest candidate in the race, she would be \"the youngest woman president in the history of the United States.\", Clinton used the high-profile speech to highlight other biographical details her campaign advisors believe many Americans continue to be unfamiliar with. Her vision of America was not one she learned from politics, she said, but from her family, specifically her late mother, Dorothy Rodham. Abandoned as a young child, her mother survived and was an example of the importance ofperseverance and hard work in the face of adversity, Clinton said. My mother taught me that everyone needs a chance and a champion. She knew what it was like not to have either one, she said. But, she added, her mothers life story also was a lesson in how simple acts of kindness -- a teacher bringing in extra food for lunch after seeing she had none, or an employer giving her time to pursue her education -- could make a difference in others lives. Because some people believed in her, she believed in me, she said. Clinton did not shy away from those characteristics that Americans are far more familiar with, including her status as a longtime target of Republican attacks. She vowed to seek partners in both parties to advance her vision, but emphasized her reputation for tenacity. \"Ill also stand my ground when I must, she said. \"Ive been called many things by many people. Quitter is not one of them. Republicans jabbed back. Clintons speech was \"chock full of hypocritical attacks, partisan rhetoric and ideas from the past,\" said Republican National Committee spokeswoman Allison Moore. Clinton launched her candidacy with an online video in April, as she had done when she began her first campaign in 2007. But she never did then what she did Saturday: hold a formal public campaign rally in which she could offer a more expansive rationale for a second Clinton presidency. Her new campaign team is largely composed of people who were not part of the last effort, but who have closely studied the mistakes that cost Clinton the nomination then, at a time when she was also the partys presumed front-runner. Thats not to say her new campaign has completely avoided pitfalls. Shes drawn criticism for taking only a handful of questions from reporters at tightly managed events in early nominating states. Questions about donations to the Clinton Foundation and her use of a private email server while secretary of State also competed for attention in the first weeks after she first announced her candidacy. While she remains the overwhelming favorite to win the Democratic nomination, enthusiasm for Vermont Sen. Bernie Sanders among progressive activists has illustrated the unease some of the partys core supporters have over her candidacy. Advisors bristle at the notion that Saturdays rally was part of an effort to reboot the still-young campaign, but said it was the start of a new phase of the campaign where shell begin to offer more details on the kind of presidency she envisions. Aides say that in coming weeks, shell continue to hold small-scale events, but mix in more public rallies and weekly policy addresses. Campaign officials said that Saturdays event was also a key moment in building the massive infrastructure needed to turn out Clinton supporters in the primaries and ultimately in the general election. The campaign says it is now organized in each of the nations 435 congressional districts, and Clinton will address her grass-roots team at a meeting in Iowa on Saturday night that will be simulcast at similar gatherings across the country. The campaign also launched its text-messaging program, offering those who signed up a reply with the viral photo of Clinton screening her BlackBerry messages. The Obama team excelled at building this type of infrastructure in 2008, a key to his success in amassing the delegates needed to defeat Clinton. Clinton campaign manager Robby Mook said Friday that this type of engagement is all the more important as voters tune out paid advertising on the ever-more-crowded airwaves, saying this election would be the \"cycle of the activist.\", Follow @mikememoli on Twitter for more 2016 campaign news. 11:24 a.m.: This post has been updated with additional remarks from the candidate and Republican response. This post was originally published at 10:50 a.m. ]", "Date": "20150613", "Title": "[Hillary Clinton portrays herself as a fighter at kickoff rally]", "Link": "http://www.latimes.com/nation/politics/la-pn-hillary-clinton-rally-20150613-story.html\n", "Author": "[Michael A. Memoli]"}
