{"Content": "[The most prized credential of Hillary Rodham Clintons political director may not be her connections on Capitol Hill, her experience courting the crucial Latino vote or the diversity she brings as the child of a Mexican immigrant, but her run for office  which she lost. Last year, Amanda Renteria returned home to Californias Central Valley to run for Congress and got crushed. The race in the heavily Latino district exposed blind spots in Democratic strategy with Latino voters, who largely stayed home. The message for Clinton in her 2016 presidential run was clear: The gains Democrats had been making among Latinos could stall anytime. Now, as Clintons political director, Renteria is putting the campaigns vast resources to work avenging the 2014 midterms, when Democrats were unable to mobilize the coalition of minority voters that had helped elect President Obama twice. \"It is really time for Latinos to understand who is with them and who is not,\" Renteria said during a break from the National Council of La Raza conference in Kansas City, where she was working the hallways before Clinton addressed a packed ballroom. \"One of the real opportunities in a presidential election is to truly have a message that can break through, even in the little towns where I grew up.\", Clintons massive Latino outreach machine is unprecedented for this stage in a primary. Most Latinos dont even know the name of Clintons closest challenger for the Democratic nomination, Vermont Sen. Bernie Sanders, according a new Univision poll. Yet about 500 days before the general election, the outreach effort overseen by Renteria is running on all cylinders. Some of it is clearly visible, with the candidates aggressive positioning on immigration, her much-talked-about Nevada round table with \"Dreamers\"  immigrants brought to the country illegally as children  and an economic agenda targeted at empowering minorities. But in an election in which the Latino vote is likely to be decisive, its the on-the-ground work that could pay the biggest dividends. \"You cant take it for granted,\" Clarissa Martinez de Castro, a deputy vice president at La Raza, warned attendees of a session at the conference. \"Some people are like, Hey, Im good, so they will vote for me even if I dont do anything. No. Youve got to get out there.\", Renteria, who grew up in the hardscrabble town of Woodlake, near Visalia, went on to become the first chief of staff of Latino descent for a U.S. senator, when she worked for Michigan Democrat Debbie Stabenow. Under Renterias direction, Clinton organizers are showing up in Latino and other minority communities in a variety of ways. Often its not even to talk much politics. Renteria, 40, recalls a recent networking event at a bar in Philadelphia where the millennials who showed up wanted to discuss career strategies, how to go about paying off student loans and what her family thinks of what she is doing with her life. So they did. \"It is not just about come vote for me, but  how can I help?\" said Renteria, who disarms with a rare mix of a candidates charm and an operatives urgency. \"We have the resources in this election to talk about it.\", Renteria talks without the pretension common in the inner circle of presidential campaigns. She can carry on a conversation with the apolitical. Many in Washington cant. Clintons campaign is burning through an eye-popping $230,000 per day in this stage of the campaign, and much of it is going toward making contact with voters more aggressively than is the norm so early on, whether it be through hiring field organizers with community ties, investing in the newest microtargeting technology or holding events like the one in Philadelphia. The Clinton team is scouting for consultants in every state with a large Latino presence to develop localized strategies for boosting turnout. Buzz-stirring events like the Dreamers gathering Clinton held in Nevada in early May are conceived with input from local activists. They are all the campaigning tasks Renteria was unable to do when she ran for Congress. \"With the hand she was dealt, she did the best she could,\" said Mark Salavaggio, a Central Valley political analyst. \"It did shock people that she lost by so much.\", Her opponent, Rep. David Valadao (R-Hanford), relentlessly pounded Renteria, then a staffer on Capitol Hill, as a carpetbagging Washingtonian. \"She is not one of us,\" several of his mailers shouted. Valadao, who was concluding his first term in Congress, benefited from a Latino-sounding last name, despite his Portuguese ancestry, which made his accusations that Renteria was the interloper in a district heavy with migrant farmworkers sting all the more to her. She recalls how her family would sometimes not get served at Dennys until after the white customers, how she sat in a chair for hours at a Border Patrol station as agents grilled her parents, how she proudly danced as a child in the traveling Ballet Folklorico. \"It means a lot to us in the Latino community to have someone like Amanda at the table making decisions  and making sure the community is at the table,\" Rep. Ben Ray Lujan (D-N.M.) said. Rep. Xavier Becerra of Los Angeles, also a Democrat, said Clintons appointments of Renteria to one the campaigns most senior jobs and of Lorella Praeli, a Dreamer, to be the director of Latino outreach, resonated deeply among Latino leaders. \"Those are the decisions that make you feel like [Clinton] is one of us,\" he said. GOP strategists say Renterias race in California was not a fluke, but a reflection of a wall Democrats are about to hit nationally with Latino voters. \"The idea that if you just bring out more Latinos to the polls you will win is a big mistake, and one I hope Democrats continue to make,\" said Mike Madrid, a Republican consultant in California. \"Amanda Renteria was running in an area where Latinos tend to be very conservative. They are similar to what the Latino voters will look like in Colorado, New Mexico, rural Virginia and a lot of battleground states.\", Republicans are hopeful that 2016 will be the year they achieve what they last did in 2000, when George W. Bush, a Texan with a knack for Spanglish and a firm grasp of border culture, was able to slow the surge of Latino support toward Democrats. He also attracted strong Latino support in his 2004 reelection. This year, Bushs brother Jeb, a former Florida governor, speaks even better Spanish and his wife is a native of Mexico. Another Floridian seeking the GOP nomination, Sen. Marco Rubio, is the child of Cuban immigrants. Even so, the Univision poll and others show neither of those contenders is gaining the kind of traction among Latinos that George W. Bush did when he ran against Al Gore, whose patrician demeanor did not play well. Hard as Republicans try to cast Clinton in the same mold, it is proving a tougher sell. When Clinton last ran for president, in 2008, two Latinos voted for her for every one who voted for Barack Obama in the Democratic primaries. \"Everyone has the abuela who ran the show when it came to dinner, giving you a hard time about school, or how you treated your parents,\" Renteria said, using the Spanish word for grandmother. \"That strong woman you look up to in the Latino community.... There is a lot in the community we see in her.\", evan.halper@latimes.com, Twitter: @evanhalper]", "Date": "20150719", "Title": "[Hillary Clinton's political director brings key lessons from her own (losing) campaign ]", "Link": "http://www.latimes.com/nation/politics/la-na-clinton-political-director-20150719-story.html\n", "Author": "[Evan Halper]"}
