{"Content": "[To the editor: The U.S. Supreme Courts distressingly improvident 5-4 decisions in this years religious rights cases should surprise no one. They are the price we have paid for suffering disproportionate conservative appointments to the high court from 1980 to 2008, when Republicans occupied the White House for 20 of those 28 years. (\"Supreme Court, citing religious liberty, limits contraceptive coverage in Obamacare,\" June 30), All who despair over the Supreme Courts unseemly bowing to religious zealots  especially when certain faiths tenets are allowed to trump enlightened medical care  should remember this in 2016: If a Republican is elected our next president, look for the courts conservative judicial activism to endure far beyond his or her term of office. Robin Groves, Pacific Palisades, .. To the editor: I am appalled to see how many journalists have been misleading people about what the Supreme Court decided Monday. As a result of this ruling, Hobby Lobby is not free of its obligation under the Affordable Care Act to provide insurance that covers contraception (the prevention of embryo fertilization); it is excused only from providing insurance that pays for medicines that produce abortions (the killing of a fertilized embryo). It is wrong to use this case to validate the imaginary \"war against women.\", This decision does not create a \"slippery slope\" for other religious employers to object to various medical procedures like blood transfusions or operations. First, it has long been settled law that parents may not endanger others by resisting established medical treatment. Second, to suggest that corporations might refuse to allow well-established medical procedures such as blood transfusions under their healthcare plans is too foolish to merit a response. Eddie Smith, San Diego, .. To the editor: I am losing confidence in our system of three branches of government. Two of them seem no longer to be working for us. The Supreme Court increasingly seems to be operating as a political body, rendering decisions that make questionable judicial sense unless one happens to be a corporation that has taken on \"person\" status or a religious group that wishes to impose its specific beliefs on its employees. These decisions are becoming more questionable as our do-nothing Congress functions less like an elected body responsible to the people and more like a robot body created and manipulated by wealthy donors. As long as our lethargic electorate keeps reelecting these legislators, our president is left to act alone and the court decides in an increasingly predictable way, we will see the continued eroding of our beloved constitutional form of government. Bette Mason, Corona del Mar, .. To the editor: If theres a silver lining to the Supreme Courts Hobby Lobby ruling, its that the decision will energize progressive voters to flood the polls for the foreseeable future as well as fuel boycotts against businesses that use religion as an excuse to discriminate. Jerry Weil, Seal Beach, .. To the editor: Will someone please explain to me how forcing your religious beliefs on others, who may or may not agree, is freedom of religion? Sounds more like tyranny to me. Barbara Buckner, Laguna Niguel, .. To the editor: Shouldnt the women affected by this ruling have freedom from religion?, Michael D. Mauer, Los Angeles]", "Date": "20140702", "Title": "[Don't want more Hobby Lobby decisions? Then don't elect conservative presidents.]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-0702-wednesday-hobby-lobby-supreme-court-20140702-story.html\n", "Author": "NULL"}
