{"Content": "[Graphic details of the CIAs brutal interrogation program came to light Tuesday when the Senate Intelligence Committee released a 499-page executive summary of its report on the agencys practices. Weve gathered excerpts, reactions and fallout from the documents controversial release. This marks our final update. Below, youll find compelling extracts from the Senate Intelligence Committees torture report summary, reaction to its release and context to give depth to our understanding of the governments practices after the Sept. 11, 2001, attacks. For more updates, go to our full coverage page. The CIAs chief of interrogations got the job even though he had been \"orally admonished for inappropriate use of interrogation techniques\" while conducting training in Latin America during the 1980s, the Senate report says. But that interrogations chief, whose name was redacted, became so disillusioned at the treatment of detainees that he sent an email to CIA colleagues in January 2003, calling the program a train wreck waiting to happen. \"I intend to get the hell off the train,\" he wrote, adding that he was \"retiring shortly\" because he no longer wanted to be associated with the program \"in any way.\", --David S. Cloud, Read more, , Its particularly frustrating that the Senate report didnt quite succeed in settling the debate over whether torture is ever effective. In part, thats because some of the detainees were subjected to coercive interrogations before their questioners got a chance to find out what they would have said under less draconian treatment. The CIA doesnt know the answer, either. In his response to the report, CIA Director John Brennan notes, remarkably, that the agency \"failed to perform a comprehensive and independent analysis on the effectiveness of enhanced interrogation techniques.\" As a result, he says, \"The agency takes no position on whether intelligence obtained from detainees who were subjected to enhanced interrogation techniques could have been obtained through other means or from other individuals. The answer to this question is and will forever remain unknowable.\", , \"I was hoping for an aha moment  that moment where wed get a definitive answer,\" said Zegart. \"That didnt happen.\", --Doyle McManus, Read more, Many things CIA Director Michael Hayden said while testifying before the Senate Intelligence Committee were not true, the report found. A lengthy appendix gives examples, quoting a day of Haydens testimony from 2007 and rebutting it. , In this snippet, Hayden says observers can call an immediate halt to any interrogation that uses enhanced techniques. The report cites a time that an objection was voiced, but CIA headquarters ordered that the enhanced interrogation continue and discouraged objections. --Lauren Raab, Read more, David J. Phillip/AP, Ted Cruz, a potential 2016 presidential hopeful, issued a statement late on Tuesday, striking a similar tone to many Republican lawmakers who have spoken about the terror report:, , Within 48 hours, President Obama has set Guantanamo Bay detainees free, and Senate Democrats have endangered Americans all over the world by releasing classified tactics, which have since rightly been outlawed, used by the intelligence community in the aftermath of the 9/11 terrorist attacks. The Democrats foreign policy  defined by a series of actions designed to appease our enemies and diminish the capability and morale of our military men and women  is profoundly dangerous.  , Every civilized nation agrees that torture is wrong. But todays partisan report will endanger lives, drive away our allies  who have never been more needed than now  and undermine the ability of our intelligence officers and soldiers to protect our national security. After six years, enough with saying everything is George W. Bushs fault. Its sad that, with all the threats we face across the globe, Senate Democrats are still more interested in scoring political points against the Bush Administration than in working together to keep America safe and our military strong. , --Julie Westfall, Associated Press, One of the most spectacular stories that became public in the period after the Sept. 11, 2001, attacks was the accusation that a Brooklyn, N.Y.-born convert to Islam named Jose Padilla had plotted to build a radioactive dirty bomb that would be detonated in the U.S. The charge was dropped long ago by the government, which successfully prosecuted Padilla on charges of conspiring to help foreign jihadist fighters. But vivid tales are hard to dispel, as even the CIA officers who helped pursue Padilla admitted in internal messages, according to the Senate report. The report quotes an October 2005 message from the head of the CIAs Chemical, Biological, Radiological and Nuclear Group under the heading Dont Put All Your Uranium in One Bucket. KSM refers to Khalid Sheikh Mohammed, the Al Qaeda operative who masterminded the Sept. 11 attacks. IND or RDD refers to nuclear devices. --Bob Drogin, Associated Press, Sen. Rand Paul of Kentucky, who has publicly accused both the Bush and Obama administrations of tramping on civil liberties in the name of national security, said he was reluctant to comment on the report until hed had time to read it, but initially he had mixed feelings. Its important to say were not going to do that [torture]. But the gruesomeness of the details may well inflame people, he said. Whether or not you have to go into all the gory details, whether thats good for the country, maybe not. Read more, AFP / Getty Images, Did torturing detainees actually produce intelligence that U.S. officials didnt already have or that couldnt have been obtained otherwise? The Senate report concludes that it did not. CIA officials say the evidence does not support such a sweeping conclusion, although they also no longer say that the interrogations clearly saved lives, as the agency routinely did during the Bush administration. The report and the CIA differ most clearly on the question of whether torture helped uncover Osama bin Ladens hideout in Pakistan by leading U.S. agents to Bin Ladens courier, a man known as Abu Ahmed al Kuwaiti. One of the main sources for Kuwaitis identity and importance was an Al Qaeda figure, Hassan Ghul, who was captured in Iraqs Kurdistan region. Ghul was initially interrogated with standard questioning techniques in January 2004. Later, he was transferred to a CIA prison where he was shaved, placed in a stress position and deprived of sleep for 59 hours until he began hallucinating and having irregular heartbeats. The Senate report concludes that Ghuls useful statements, in which he referred to Kuwaiti as one of Bin Ladens closest associates, came before he was tortured. It quotes a CIA officer who said he sang like a Tweety Bird in those initial sessions. The CIA says the later interrogations produced important information that corroborated Ghuls earlier statements and that was more concrete than what he had said earlier. The Senate report disputes that, citing CIA documents written at the time. -- David Lauter , The secretary of State might \"blow his stack if he were to be briefed on whats been going on,\" a CIA email said. , --Lauren Raab, As Americans processed the details of the CIAs brutal interrogation of terrorism suspects, President Obama defended Senate Democrats decision to make the information public. There was never going to be a perfect time to release this report, Obama said in an interview with Telemundo recorded Tuesday, according to a transcript. But, he said, one of the things that sets us apart from other countries is that when we make mistakes, we admit them. He said interrogation tactics the CIA used in the years following the Sept. 11, 2001, attacks amounted to torture. While acknowledging that the disclosure of the CIA programs details now has potential ramifications overseas, that risk is outweighed by a need for accountability, Obama said. It was important for us to release this so that we can account for it  and hopefully make sure that we dont make those mistakes again, Obama said. Whats clear is that the CIA set up something very fast without a lot of forethought to what the ramifications might be. Some of these techniques that were described were not only wrong, but also counterproductive because we know that often times when somebody is being subjected to these kinds of techniques, that theyre willing to say anything in order to alleviate the pain and the stress. Obama said he is confident that the CIA has reformed. Anybody who was doing the kinds of things that are described in the report  would be directly violating the orders that Ive issued, he said. --Evan Halper, The first detainee held in the old abandoned brick factory north of Kabul became the model for what would transpire in the cave-like halls of a CIA interrogation facility known as the Salt Pit. Ridha al-Najjar, an alleged former bodyguard for Osama bin Laden, often was left alone in the shadows, under a barrage of shrieking music, cold and shackled and hooded, handcuffed to an overhead bar for 22 hours a day, according to the Senate intelligence committee report released Tuesday. Later, another detainee, Gul Rahman, believed to have served in a security detail for an Afghan warlord, would die there. He was dragged through the dirt and grime of the corridors, his mouth taped, his clothes falling off. Guards slammed and punched him, and left him shackled to a concrete floor in a sweatshirt but no pants. Officials said he probably died of hypothermia, though his face, legs, shoulders and waist were cut and bruised. A few months later in March 2003, with the outside world still unaware of the facility, a lead CIA officer at the secret site was presented a $2,500 cash award for his consistently superior work, the report states, For two years, about 64 detainees filled the factory floor, the darkened hallways and small side rooms. The doors swung open in September 2002, a year after the hijacked airplanes of Sept. 11. Inside, the Senate report concludes, the CIA fostered a culture of brutal interrogation tactics and torture, often led by untrained and unsupervised officers. -- Richard A. Serrano, , The CIAs justifications for the often-brutal interrogations of prisoners shifted depending on circumstances, the Senate report found. A prime example is the case of a Pakistani man named Janat Gul. Gul was captured in June 2004, based in part on statements by a CIA informant identifying him as a facilitator for Al Qaeda who had knowledge of plans to conduct attacks in the U.S. in the weeks before the 2004 elections. Some CIA officers doubted the informants reliability, but CIA Director George J. Tenet requested special permission to use enhanced interrogation techniques on Gul, saying it could yield intelligence necessary to save American lives by disrupting the pre-election plot. The interrogations stretched from July through September, even though the personnel at the detention site said Gul seemed to have little information. In the fall, the informant admitted to fabricating Guls connection to Al Qaeda, the report says. In April 2005, the CIA justified interrogating Gul by saying it had enabled them to determine that the informant was unreliable. It still had Gul in custody. The CIA did not acknowledge that the assets fabricated reporting was the reason that Janat Gul was subjected to the techniques in the first place, the report notes. -- David Lauter, Read more, The CIA shaved the head and face of a detainee and exposed him to loud noise in a room while \"unclothed and subjected to uncomfortably cool temperatures.\" CIA officials have told Capitol Hill lawmakers that all detainees were offered the opportunity to cooperate before being subject to enhanced interrogation techniques. However, it was revealed that this detainee was subjected to the techniques prior to any sort of discussions. , --Kurtis Lee , \"We would be very happy to sit down with Director Brennan and go over specific names\"--@SenFeinstein re Brennans stmt that torture worked. Alex Wong / Getty Images, Former CIA officials have launched www.ciasavedlives.com to rebut the conclusions reached in the report on the agency interrogation tactics released Tuesday by the Senate Select Committee on Intelligence. , The website features a statement by former CIA Director George J. Tenet, who was head of the CIA during the time of most of the incidents detailed in the report by the committees Democratic majority staff. Tenet wrote that the report does damage to U.S. national security, to the men and women of the Central Intelligence Agency, and most of all to the truth. Tenet argues the documents being released in conjunction with the report make clear that the CIA acted legally and never misled Congress. At a time of grave threat to the United States the program was effective in saving American and allied lives and in preventing another mass casualty attack on American soil, he wrote. It is regrettable that the Committee consciously chose to denigrate the integrity and performance of men and women who gave their all to protect the country without interviewing any of them, or holding a single congressional hearing. --Evan Halper, Abu Zubaydah, a prisoner at Guantanamo Bay, spent 266 hours  about 11 days over a span of 20 days  in a coffin-size box as part of a CIA interrogation technique. Interrogators told Zubaydah that the only way he would leave the facility was in a coffin.   , , --Kurtis Lee , In the facility, referred to as COBALT in the Senate report but code-named Salt Pit by the CIA, conditions were so dungeon-like that interrogators wore headlamps to navigate pitch-dark passageways. Read more, CIA officials detained two former sources who spent 24 hours shackled in a standing sleep deprivation position. The two detainees had attempted to contact the CIA prior to their detention, but the message they sent was not translated by agency officials until after the detainees were subject to enhanced interrogation techniques.  , , --Kurtis Lee, Read more, Assoicated Press, Records indicate that President Bush was not briefed on interrogation techniques until April 2006. This briefing came nearly four years after the program began and Bush expressed discomfort from an image of a detainee chained to the ceiling and clothed in a diaper. , --Kurtis Lee , Revelations about Central Intelligence Agency mistreatment of captive terrorism suspects spurred worldwide revulsion Tuesday and provided ammunition to foreign critics who accuse the United States of a double standard on human rights at home and abroad. \"Winning the crown for Most Appalling Human Rights Record in the Western World could be a tough tournament\" following the release of the CIA torture report, wrote Sydney Morning Herald columnist Andrew P. Street. The Senate report not only confirmed abusive techniques like waterboarding and prolonged \"stress positions\" but that torture garnered no useful information, Street added. \"Now we know how bad things were, and how out of control the CIA was, as it leapt into action in the aftermath of the 9/11 attacks,\" Britains Independent newspaper began its report on the details released on interrogation practices that it lamented \"the CIA still refuses to acknowledge as torture.\" --Carol J. Williams, Read more, Republican Sen. Lindsey Graham, who disagreed with the release of the report, said on the Senate floor, \"What we are doing today is a not a sign of weakness. It is a sign of the ultimate strength. That you can self-correct, that you can reevaluate, and you can do some soul searching and you can come out with a better product.\", Another clue to political motive, partisan report offers zero recommendations for improving intelligence interrogation practices #dronesRus, The release of todays report will not make Americans safer. What it will do is almost certainly put our citizens... http://t.co/zcVZa8ZMkp, I regret that the Senate Intelligence Committee has publicly released this report: http://t.co/npRECnOSpY, The report released today contains no recommendations and offers only a partisan account of last decades counterterrorism efforts, Despite CIA officers voicing concerns over the interrogation program the report concludes that the agency failed to take action. Often times, the CIA allowed inaccurate information to remain as the CIAs official position, notes the report. , --Kurtis Lee, Khalid Sheikh Mohammed clammed up after interrogators used techniques that included subjecting him to nudity, sleep deprivation and rectal rehydration. Only after agents adopted a softer Mr. Rogers persona  did he become more cooperative with agents. In the report, they describe future interrogations as some of the best sessions. , --Kurtis Lee , ABC News, During interrogations of Abd al-Rahim al-Nashiri, a Saudi Arab believed to be associated with the 2000 USS Cole bombing, a CIA agent pointed a pistol near his head in an effort to obtain information. This incident occurred in 2002 and according to the report released Tuesday, al-Nashiri did not provide any additional threat information during, or after, these interrogations,\" according to the report. , --Kurtis Lee , In an op-ed published in The Times, Dianne Feinstein writes about the release of the report:, , \"In the wake of 9/11, we were desperate to bring those responsible for the brutal attacks to justice. But even that urgency did not justify torture. The United States must be held to a higher standard than our enemies, yet some of our actions did not clear that bar. It is time to publicly examine how that happened. The administration has known for months that this document would become public and has been making every effort to safeguard U.S. personnel and interests abroad. But the bottom line is, torture occurred, and we must own up to our actions and move forward.\", Read more, The CIA faced pushback from several nations about housing clandestine operations facilities. For the United States, this was a persistent challenge. It had to transfer prisoners from every country, the report says, , --Kurtis Lee , Many Republicans have been sharply critical of releasing the report at this time, warning it could exacerbate threats to the U.S. and its allies. , Sen. Richard Burr (R-N.C.), the incoming chairman of the Senate Intelligence Committee, called its findings \"a fiction,\" and urged the public to carefully review the Republicans official response. , Sen. Marco Rubio (R-Fla.), one of only three members of the committee who voted against releasing the report, said it was being published only for the \"partisan joy\" Democrats would feel \"trying to embarrass people in the Bush administration.\", , AFP/Getty Images, Sen. John McCain (R-Ariz.) said a new Senate report detailing abuses in the CIAs post-9/11 interrogation practices would strengthen Americas security and its standing in the world, breaking with others in his party who warned that its release put the U.S. at risk. In a Senate floor speech immediately following Sen. Dianne Feinsteins (D-Calif.) presentation of the Intelligence Committees report, McCain said releasing it empowered the American people to reach their own conclusions about CIA tactics and whether they made the nation safer. \"The truth is sometimes a hard pill to swallow,\" McCain said. \"It sometimes causes us difficulties at home and abroad. It is sometimes used by our enemies in attempts to hurt us. But the American people are entitled to it, nonetheless.\", , McCain made only passing reference to his own history as a prisoner of war in Vietnam as he condemned torture as inconsistent with U.S. values, saying he knew from \"personal experience that the abuse of prisoners will produce more bad than good intelligence.\" -- Michael A. Memoli, Associated Press, Virtually no one who has any familiarity with the Senate Intelligence Committees report on CIA interrogation practices is neutral, the Director of National Intelligence, James R. Clapper, said in a message to the staffs of the governments intelligence agencies. Proponents of publication ardently believe that the report must be issued to cleanse a stain on the pages of our history, and to ensure that the practices it describes are never repeated.  Others, with equal conviction, believe that the report is unfair and biased; fails to account for the immediate impact of the attacks on 9/11on American citizens and on those in government charged with protecting the country; and will result in greater jeopardy to American citizens, facilities and interests overseas, Clapper wrote. As President Obama has made clear, some things were done that should not have been done  and which transgressed our values, he said. We have since enacted laws, implemented Presidential orders and established internal policies to ensure that such things never happen again. At the same time, Clapper also sought to defend the CIA officials who were involved in the interrogations. The officers who participated in the program believed with certainty that they were engaged in a program devised by our government on behalf of the President that was necessary to protect the nation, that had appropriate legal authorization, and that was sanctioned by at least some in the Congress, Clapper wrote. I dont believe that any other nation would go to the lengths the United States does to bare its soul, admit mistakes when they are made and learn from those mistakes.  Certainly, no one can imagine such an effort by any of the adversaries we face today. -- David Lauter, The Obama administration sought Tuesday to paint the release of the reports executive summary as in the interest of transparency, pointing to the fact that 93% of the summary, which runs nearly 500 pages, is declassified. By being open about what happened, we resolve to never use these techniques again, a senior administration official said in a call with reporters. The report itself, more than 6,700 pages, will not be released. And the administration has, as recently as last week, tried to delay the release of the summary. It also has for years declined to pursue criminal charges against anyone associated with the brutal techniques described in the report. Administration officials would not discuss why. \"The release of this type of information and this type of transparency helps cement the notion that we should not do these things, the official said.-- Christi Parsons, Some detainees were subject to rectal rehydration without any noted medical necessity. The rehydration was used as a form of enhanced interrogation along with sleep deprivation and water boarding, the report says. --Kurtis Lee, Associated Press, The CIA quickly attacked the report, noting that the program was found to be legal by the Justice Department under the Bush administration, but acknowledging that the interrogations were ultimately flawed. The most serious problems occurred early on and stemmed from the fact that the agency was unprepared and lacked the core competencies required to carry out an unprecedented, worldwide program of detaining and interrogating suspected Al Qaeda and affiliated terrorists, CIA Director John Brennan, pictured, said in a statement.  In carrying out that program, we did not always live up to the high standards that we set for ourselves and that the American people expect of us. -- Christi Parsons , Read more, The CIA allowed individuals with histories of violence to become agents involved in the interrogation units, according to the report. , Jakub Kaminski / EPA, The White House said Tuesday that President Obama placed a call to the prime minister of Poland, home to one of the black sites referred to in the Senate committee report. The names of the countries are blacked out in the unclassified report. In their Monday call, Obama thanked Prime Minister Ewa Kopacz, pictured, for Polands \"significant contributions to the missions in Afghanistan and Iraq,\" according to a statement from the White House. The two leaders \"agreed on the need for continued international cooperation in support of these missions,\" the statement says. --Christi Parsons, Interrogation techniques used by the CIA were far worse than officials represented to lawmakers on Capitol Hill. Abu Zubaydah, the CIAs first detainee, who is currently housed in Guantanamo Bay, was the first to endure the torture techniques, the report says. But \"we fight also for an idea,\" & using torture undermines that  cause, McCain says. \"Our enemies fight without conscience, we must not.\", As many as 26 detainees were wrongly held and did not meet the detention standard in the Sept. 11 Memorandum of Notification, according to the report. Saying that the CIA engaged in activities that were \"a stain on our values and our history,\" Sen. Dianne Feinstein (D-Calif.) defended the release of a Intelligence Committee report exposing abuses of its interrogation program as an essential step to show the world that the U.S. \"is big enough to admit when it is wrong.\", , In a speech on the Senate floor detailing the work of the committee she chairs, Feinstein said the report was not intended to be a condemnation of the CIA as a whole. The report actually finds that \"surprisingly few people\" designed, carried out and managed the program. But such behavior occurred in part because of ineffective oversight of the program, and a failure to fully and factually brief senior officials and lawmakers. Feinsteins remarks on the Senate floor, which lasted nearly a full hour, injected added drama to the end of a congressional session otherwise devoted to a major spending package, and was a break from genial speeches of the past weeks bidding farewell to departing lawmakers. --Michael A. Memoli, \"My words give me no pleasure,\" @SenFeinstein speaking on #Senate floor on release of torture report.]", "Date": "20141209", "Title": "[Torture report: Excerpts, analysis and reactions to CIA brutality ]", "Link": "http://www.latimes.com/nation/politics/la-na-torture-document-live-updates-20141209-htmlstory.html\n", "Author": "NULL"}
