{"Content": "[As a native Californian who was born in Oakland, raised in the San Fernando Valley, schooled in Berkeley and now living in Venice, Id like to say one thing to Timothy Draper, the Silicon Valley kajillionaire pushing the idiotic breakup of the Golden State:, Please go away. Recently, Draper announced he is on track to gather enough signatures to get his mind-blowingly stupid measure on the November 2016 ballot. To that end, he has spent  well, wasted  $4.9 million of his own money, a sum that could certainly have been put to better use if he really cared about the welfare of Californians. Draper has proposed dividing California into six states: Jefferson (Redding, Eureka), North California (Sacramento, Marin County), Silicon Valley (San Jose, San Francisco), Central California (Fresno, Stockton, Bakersfield), West California (Los Angeles, Santa Barbara) and South California (Riverside, Anaheim, San Diego). Why?, California needs a reboot, Draper writes on his website, SixCalifornias.com. Our public schools have gone from the top in the nation to 47th. We are ranked 50th out of 50 for the worst business climate in the United States . Our state needs a massive investment in infrastructure and a streamlined process to help grow and keep business. Yes, our schools are a mess. But breaking up the state would not help. It would put a terrible burden on children in poor counties. Right now, school funding is equalized because of a court-ordered formula that redirects revenue from richer areas to poorer ones. Do you foresee a world in which the rich of one state voluntarily redirect their tax revenue to the poor in another?, Yeah, reboot this. Contrary to right-wing myths about Californias unbearable business climate, the state is not losing jobs to more business-friendly states like Texas. California adds jobs at roughly the same pace as the nation as a whole, according to the Sacramento Business Journal. Between November 2011 and November 2012, the Journal wrote, the state lost 12,000 manufacturing jobs, a decline of 1%. But the state added 26,000 information technology jobs, a 6% gain, during the same period. If you watch the animated video on the Six Californias site, you will hear a pleasant-sounding lady offer vague bromides about how smaller states would bring government closer and make it more responsive. California is too big, she says. Driving the state north to south takes 14 hours, she says, as if this is a bad thing. How can Draper, allegedly a native of the state, be so pitifully unaware that Californians take pride in the vast size of our state?, Anyway, calls to break California up are nothing new. They began in 1850, the year we achieved statehood, and have never stopped (or succeeded!). As recently as last September, supervisors in Modoc and Siskiyou counties voted to support breaking away to form Jefferson. I would be tempted to let them go, as they are contiguous with Oregon and/or Nevada and dont bring much to the party. In addition to their bad attitude, Jeffersonians rank dead last in personal income tax, the states greatest source of revenue. Nevertheless, their departure would have an adverse affect on our states lovely silhouette. It would create a weird little claw out of Del Norte, Humboldt and Trinity counties. For aesthetic reasons, if nothing else, they must stay. As for the actual nuts and bolts of a breakup, state Legislative Analyst Mac Taylors report on the proposal, available online, is enlightening. Taylor outlines a process that would require so much cooperation by local, state and federal politicians that its failure is a foregone conclusion. Among the highlights:, -- Congress would have to approve the plan, and the president would have to sign it into law. (Is it likely that Congress would give California 10 additional U.S. Senators? Three words: Har har har.), -- A board of 24 commissioners would be appointed by the Legislature and county boards of supervisors to oversee the breakup. The board would have two years to do its work. If it failed to resolve financial and property issues within that time, each new state would keep all state assets in its borders, and all of the states debts would be divided among the states. -- Counties not happy with their assigned states could appeal to be reassigned to other states, as long as they are contiguous. -- Disputes would be resolved in the courts. The analyst notes that disputes between Virginia and West Virginia  which declared independence from Virginia in 1861  lasted 50 years and included several lawsuits that went as far as the Supreme Court. What Drapers plan would really do, besides make him famous, is create winners and losers, rich states and poor states. Californias current per capita personal income is $46,477, 12th among the 50 states. But the proposed Silicon Valley would have a per capita personal income of about $63,000, making its residents the richest of them all. (And by all, I mean it would be the richest state in the country. Only the District of Columbia would surpass it, the place where our very best public servants toil at low wages for the betterment of the country  until they can cash out and become lobbyists. But I digress.), Our poorest state would be Central California with a per capita personal income of $33,510, which would also put it dead last in the country, $150 below Mississippi. The Draper plan would inflict decades of expensive litigation on a state that can ill afford a distraction whipped up by a venture capitalist with more money than good sense. (Draper makes Tom Perkins, who likened vandalism on Google buses in San Francisco to the Holocaust, look positively reasonable.), And it would create even more enmity and discord than usual: Who would own our far-flung public universities and state colleges? How would we handle the incredibly complex and divisive issue of water? What about the planned high-speed rail? How would we address unfunded liabilities of the states existing public employee retirement plan? And last but not least: What about prisons?, Some have speculated that Draper, who made news recently when he scooped up millions of dollars of Bitcoin seized from the Silk Road marketplace, is trying to vault himself to prominence for a political career. Or that hes trying to goose Republican voter registration in a state where Democrats outnumber Republicans 43.1% to 28.4%. I have no idea what his true motivations are. But I do know this. No one who truly loves California, and appreciates its pull on the American imagination, would ever want to break it apart. Tim Draper. Dude. You are totally uncool. Please follow me on Twitter: @robinabcarian]", "Date": "20140718", "Title": "[Break California into 6 states? How uncool]", "Link": "http://www.latimes.com/local/abcarian/la-me-ra-break-california-into-6-states-20140716-column.html\n", "Author": "NULL"}
