{"Content": "[There are weeks in which it feels like the past and present are collapsing into themselves. For those following California politics, this week was one of them. Donald Trump was bringing his road show to Wednesdays presidential debate at the Reagan library in Simi Valley, with a stop in Dallas before Tuesday nights visit to a former battleship in San Pedro. California politicians, meantime, were scrambling to grab onto Trump in whatever fashion possible, attaching themselves to the man who is utterly in control of the political ecosystem. Lt. Gov. Gavin Newsom uncorkeda witty animated video attacking Trumps immigration plan. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Mocking Trump as \"Mr. Make America Great Again\"the theme of the New York real estate magnates campaign--Newsom criticized Trumps demand that the United States build a wall along the southern border, deport 11 million or so immigrants here without proper papers, and restrict citizenship rights of children of those in the country illegally. \"Trumps plan will be a disaster and Ill debate that at any time,\" Newsom said. Of course he wouldhe couldnt pay enough money for the attention it would bring his 2018 campaign for governor. As would Isadore Hall, the state senator running for a South Bay congressional seat being given up by Democrat Janice Hahn. He announced Monday that he would demand on Tuesdayoutside the Trump event aboard the battleship Iowathat the state divest itself of any investments in anything Trump-related, including real estate in which hes involved. Not to be outflanked, Halls opponent, Nanette Barragan, floated a video of her own, dismissing Trumps \"offensive views and insults\" to women, immigrants \"and anyone else you happen to be thinking about at any particular time.\", In a nod to Trumps criticism of his competitor Jeb Bushs use of Spanish, she added: \"And one more thing. Aqu en California, muchos Americanos, como yo hablamos espaol. Si no te gusta eso, te invitamos a que te vayas. In case you didnt understand that, it means: Here in California, a lot of Americans speak Spanish. If you dont like that, youre welcome to leave.\", There is a political and media lesson here. Hall and Barragan and Newsom were fixed on Trump, of course, because he is where the cameras and the attention reside at this point in the campaign. (Newsoms attack on Trumps plans stood to get a lot more attention than his recent Twitter fight with another 2016 presidential candidate, former Arkansas Gov. Mike Huckabee, currently residing at the bottom of the presidential polls.), On Monday, two days before the debate, sponsor CNN added to its screen a to-the-second countdown clock, which ticked throughout the approximately one-hour-long speech by Trump in Dallas that the network also aired, almost in its entirety. It was that gift of free publicity, denied other candidates, that was enticing as could be to politicians like Hall and Barragan and Newsom. Trump may be an odd mash-up of carnival barker, siren of the economically threatened and stock car driver careening out of control, but he does have a precedent, at least in California. As a candidate, theres probably no better comparison than Arnold Schwarzenegger, who stepped away from Hollywood in 2003 to run for governor in the recall election. (In a casting epiphany, NBC announced Monday that Trumps replacement as host of TVs \"Celebrity Apprentice\" would be, ta da! Schwarzenegger.), When he ran in 2003, Schwarzenegger put together comicalbut politically effectivestagecraft. A giant spigot rained red water down to symbolize the free-flowing state budget. A crane dropped a nearly two-ton weight onto an unfortunate Oldsmobile Cutlass to demonstrate what Arnold would do to the car registrationtax. The two candidates share a certain visual similarity, both faces featuring skin of a peculiar orange sheentelevision make-up?and carefully constructed hairdos. Trump had Youre Fired, Arnold had Hasta la vista, baby. Trump maligned womenmost recently his competitor Carly Fiorina, whose face he mocked to a reporter for Rolling Stone. Schwarzenegger was accused by more than a dozen women, in Los Angeles Times stories published before the election, of having fondled or groped them over the years. Both men chose the same theme song: Twisted Sisters Were Not Gonna Take It. But more than that, they exuded other things: a defiant toughness against the worlds problems, and an in-your-face disgust toward establishment politics, disdained here then and nationally now by many of the same groups of people. Schwarzeneggers act grew oldwhat came across as bravado in the beginning began to look like bullying after a time. And that was for an entertainer-turned-politician with far more policy coherence and, stunningly, political gravitas than Trump has yet exhibited. But Arnold never lost his public confidence, the same kind of public confidence that Trump exudes now. As he said Tuesday in Dallas, during a rambling speech that, while off-the-rails narcissistic, was also applauded feverishly by a huge crowd, this is a movement thats happening. Were sick and tired of whats happening, and its going to change, he said. For political news and analysis, follow me on Twitter: @cathleendecker . For more on California politics, go tolatimes.com/decker and latimes.com/politics.]", "Date": "20150915", "Title": "[State politicians grab at Trump's coattails, seeking reflected attention]", "Link": "http://www.latimes.com/politics/la-pol-ca-trump-schwarzenegger-analysis-20150915-story.html", "Author": "[Cathleen Decker]"}