{"Content": "[Democrats have their problems: a lame-duck president whose popularity has slumped, just about zero chance of winning back the House, and a better-than-fair shot at losing the Senate as well. But Republicans were facing multiple sources of tension, in California and nationally, as they met this weekend at the state GOPs convention in Los Angeles. There was the overall split in the party between the strategies that have won success in midterm elections  satisfying the older, whiter, more religious party base  against the angles that the party must play to win presidential contests: to wit, broadening its reach to younger, more female and fewer white voters. Rand Paul, the Kentucky senator who is readying a presidential run, made a stab Saturday at trying to push the party in the latter direction. But when it came to specifics, he underscored contradictions in his argument that Democrats will be able to exploit were he, or anyone following his prescriptions for victory, to win the GOP nomination. In keeping with current GOP strategy, Paul did not so much as utter a word about the partys views on such combative issues as immigration reform or abortion rights, two threshold issues that have caused great numbers of Latinos, Asians and women to refuse to give a second glance to the partys candidates. (Nor, in an evening speech, did House Majority Leader Kevin McCarthy, a Republican from Bakersfield.), Though he would not acknowledge so, Paul suggested that he would simply turn the page and shift to issues less freighted, such as NSA spying. (He also cited criminal justice reform, the presidents use of the military overseas and voting rights, two areas where his more libertarian proposals are controversial within the Republican Party.), Strains in his logic were perhaps most evident when it came to the NSA issue. Paul, who has long vented about the agencys reach into private communications, argued that there was a constitutional right to privacy. People say theres no right to privacy in the Constitution. Heres the thing about the Constitution.Your rights are infinite and they are unenumerated, he said. You do have a right to privacy because they didnt give the government the right to look at your cellphone. Republicans can forward a message that were the party that will defend your right to privacy and frankly the Democrats havent been, he said later, in an interview. His choice of words was striking, since the right to privacy has been the argument forwarded by abortion rights advocates against antiabortion Republicans like Paul, for decades now. The Roe vs. Wade decision rested on the expectation of privacy in the 14th Amendment. While Paul is citing a different amendment  the 4th  his argument puts him in the position of contending that cellphones deserve privacy but women do not. A similar conflict was inherent in his argument that Latinos and African Americans will side with the Republican Party if it shows up in Americas cities to pitch its case. High unemployment and poverty have plagued our nations big cities, he said. All these big cities are run by Democrats. We need to go to the cities and say to those who are living in poverty, or working class and struggling, that the Republican Party does care about them and has a message thats better. He also said that African Americans and Latinos would appreciate Republican support for loosened criminal penalties for drug crimes that have imprisoned many for lengthy terms. But that would require Latinos and African Americans to see those issues as more important than, say, immigration reform, which the party has blocked on Capitol Hill, and actions by Republican legislatures to disenfranchise certain voters, an act that in many areas affects black voters more than others and echoes the civil rights battles of the past. The difficulty in trying to square the partys existing policies, which are popular among its present base, with those that might attract additional voters has bedeviled a generation of Republicans. New York Rep. Jack Kemp made a career of campaigning in the inner city  he was raised in Los Angeles  but even he was at a loss to find GOP support for policies with appeal to nonwhite voters. Rep. Paul D. Ryan, a Kemp acolyte, recently has talked about broadening the party only to come under fire for a budget proposal that would cut programs most to the people the party says it wants to attract. Some of this is sleight of hand; nationally, Republicans often talk about attracting minority voters as a way of appealing to whites who had been leaning Democratic, just as a generation ago Democrats talked up welfare reform to gain back white moderates who had leaned toward Republicans. But the demographic shift toward younger, nonwhite voters is real. It has defeated Republican hopes of a resurgence in states like California and is moving inexorably toward complicating the partys standing in other states as well. In an interview Saturday, Paul brushed aside a question of how he could sell a right to privacy for cellphones but not women. His answer -- I think the biggest thing is attitude more than policy -- suggested that much of what voters can expect is a better-phrased version of the policies that are the province of the Republican Party he wants to leave behind. For a generation, California Republicans have argued that their problem in broadening the party isnt their message, its the messenger. As they have found to their detriment  and other parts of the country may in the future discover -- its often both. For political news and analysis, follow me on Twitter: @cathleendecker , ]", "Date": "20140921", "Title": "[GOP at an anxious crossroads: Who are the Republicans of the future?]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-republicans-future-demographic-challenge-20140921-story.html\n", "Author": "[Cathleen Decker]"}
