{"Content": "[Hillary Rodham Clinton has a third underdog challenger for the Democratic presidential nomination. Former Rhode Island Gov. Lincoln Chafee entered the race Wednesday, casting himself as an antiwar candidate who opposed the invasion of Iraq back when Clinton supported it. We must deliberately and carefully extricate ourselves from expensive wars, Chafee told a half-full law school classroom at George Mason University in northern Virginia. We need to be very smart in these voluble times overseas. He said, Today Im formally entering the race for the Democratic nomination for president. With his announcement, Chafee became the biggest longshot among Clinton rivals who have a long way to go to avoid becoming historical footnotes in the 2016 campaign. Chafee, a former Republican turned independent who joined the Democratic Party two years ago, has made little effort to set up a competitive campaign operation, beyond a few visits and calls to activists in the early voting states of New Hampshire, Iowa and South Carolina. Longtime Chafee strategists and donors said they know little about his intentions  or even his rationale for running. Hes not done anything other than posture on some issues, said Mike Trainor, a former Chafee aide. The question hes going to have to answer is what credible indications can he give that he is at all ready to run a national campaign. Clinton has set a goal of raising $100 million for her primary bid. Sen. Bernie Sanders of Vermont, who entered the race last week, has said hes already raised at least $4 million. And allies of former Maryland Gov. Martin OMalley have established a super-PAC to support his efforts. All three have begun building robust campaign operations with staff across the country, a step Chafee has yet to take. He has, however, set up a campaign websitethat outlines his positions. In previous campaigns, Chafee has spent significant sums from his family fortune to further his political ambitions, for example dropping $1.8 million on his 2010 governors race. Running for president is significantly more expensive than seeking statewide office, with some pegging the estimated cost of a successful 2016 campaign at more than $1 billion. The other Democratic challengers have focused on pocketbook issues. Chafee says a strong middle class is vital, as is affordable healthcare and improved schools and public transportation. Chafee is underscoring his foreign policy stance. His opposition to Clinton, Chafee said, is driven by the belief that the next president should not be someone who supported the war in Iraq. Clinton, then a New York senator, voted to authorize the war, which became a major issue during her 2008 presidential primary campaign. Clinton now opposes putting U.S. soldiers on the ground in Iraq except as advisors to the Iraqi forces. In 2002, Chafee was a Republican and the lone GOP senator to vote against the invasion. In all, 23 of the 100 U.S. senators opposed the war then. \"I voted against the Iraq war. I knew it was based on lies,\" Chafee said in his presidential announcement. Now, he said, he is alarmed about international instability in the Middle East and in North Africa. \"Chaos ... threatens our collective future,\" he said. Chafee left the Republican Party in 2007 to become an independent and supported President Obama in both his presidential campaigns. After winning election as governor, Chafee became a Democrat in 2013 but opted against seeking reelection. His approval ratings were low. On Wednesday, he vowed to do what he believes to be right. \"I stand on my principles and I always fight for what I think is Americas long-term best interests,\" he said. Times staff writer Connie Stewart contributed to this report. ]", "Date": "20150603", "Title": "[Lincoln Chafee says he'll seek Democratic presidential nomination]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-lincoln-chafee-presidential-campaign-20150603-story.html\n", "Author": "NULL"}
