{"Content": "[George Duf Sundheim, a Silicon Valley lawyer who led the state Republican Party during the recall of Democratic Gov. Gray Davis and election of Arnold Schwarzenegger, will announce his candidacy for U.S. Senate on Wednesday. Sundheim, 62, is the second former state GOP chairman to enter the race for the Senate seat that Democrat Barbara Boxer plans to vacate next year. The first, Tom Del Beccaro, announced his candidacy in April. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Both are running in a state that has not elected a Republican to the Senate in more than a quarter-century; where no Republican has won a statewide general election since 2006; and where Democrats hold a 15% advantage over the GOP in voter registration. Sundheim says he confident he can persevere. Although he is a fiscal conservative and highly critical of President Obamas nuclear deal with Iran, he diverges from party orthodoxy on many core issues. He supports abortion rights and a pathway to citizenship for some immigrants living here illegally, and he believes climate change has been caused, in part, by human behavior. Our country is going in the wrong direction. You have to have a vision that is different than strictly right versus left, said Sundheim. He said Californians, regardless of party allegiance, will look beyond the fact the hes a \"balding white guy and a Republican\" because they want change. Sundheim said he decided to run for Senate because he was concerned that many Californians had given up hope about politics, with low voter turnout reflecting unhappiness about the lack of action on stagnant wages and underperforming schools. Along with Sundheim and Del Beccaro, the field of Republican candidates includes state Assemblyman Rocky Chavez of Oceanside. The two major Democrats in the race so far are state Atty. Gen. Kamala Harris and Rep. Loretta Sanchez of Santa Ana. Interested in the stories shaping California? Sign up for the free Essential California newsletter >>, Regardless of party, the candidates who finish first and second in the June 2016 primary will advance to a November 2016 runoff election. They have until March to declare their candidacies. Sundheim, who lives in Los Altos Hills near San Jose, led the state party from 2003 to 2007, a period that included the recall of Davis and the election of Schwarzenegger, a Republican, as his replacement. On Sundheims watch, Schwarzenegger won a second term in 2006, and Republican Steve Poizner was elected state insurance commissioner -- the partys last two statewide victories. Sundheim has a bachelors degree in economics from Stanford University and a law degree from Northwestern University. He practiced business law from 1980 to 2002. Some of his clients manufactured theme-park rides and sold video games, he said. Some were very generous, and he hasnt had a real job since he left the firm, he said. Recently he has served as a court-appointed mediator as well as a private mediator for adversaries trying to avoid litigation -- experience he said could prove useful in partisan Washington. I think theres some skills I could bring to the table, he said. MORE CALIFORNIA POLITICS, California lawmakers approve ban on plastic microbeads, Assembly approves measure to restrict police searches of email, Governor, top lawmakers ready to modify climate change measure as negotiations continue]", "Date": "20150909", "Title": "[Duf Sundheim enters race for Barbara Boxer's Senate seat]", "Link": "http://www.latimes.com/local/political/la-me-pc-sundheim-senate-campaign-boxer-20150520-story.html\n", "Author": "[Michael Finnegan, Phil Willon]"}
