{"Content": "[It is hard to say when it will come, but our democracy faces a tipping point in the not-to-distant future when a fearful, ticked-off generation of conservative white voters will have passed on and a multiracial, socially liberal generation finally gets the voting habit. When that happens, the Republican Party risks going the way of the 19th century Whigs because, year after year, the GOPs constituency has been growing older and even more white. For the campaign of 2016, though, the demographic advantage still could go to either party. David Horsey / Los Angeles Times, David Horsey / Los Angeles Times, Inspired by the chance to elect and then reelect the first nonwhite president of the United States, young people, blacks, Latinos and Asians joined with white liberals to give Barack Obama solid victories in 2008 and 2012. But, in the midterm elections, the story was different. Determined to defend the conservative hold on the American agenda that was established by Ronald Reagan in the 1980s and solidified by the GOP capture of the House of Representatives engineered by Newt Gingrich in the 1990s, older white voters marched to the polls in 2010 and 2014 to dramatically reinforce Republican power in Congress. The Republican voting advantage in nonpresidential election years is reinforced by a number of factors, including blatant gerrymandering in some states, as well the clustering of Democratic voters in cities, a phenomenon that causes the liberal vote to pack far less punch than its size would warrant. The biggest plus for the GOP, though, may be thatDemocratshave failed to gettheir young, nonwhite voting contingent to show up at the polls when the presidency is not at stake. Backed by their dependable cohort of angry, pale-faced senior citizens, Republicans have grabbed the biggest share of state legislatures and elected the majority of governors in the 50 states. Young Democratic voters, meanwhile, would be hard-pressed to name a single state legislator, even if they were offered a free iPhone and a $500 gift certificate at Urban Outfitters. By a significant margin, Democrats are the more popular party, according to polls, but popularity counts for nothing if it cannot be translated into political victories. So, the central question for 2016 is this: Will the Obama coalition turn out to vote for the first woman to have an inside track to becoming president? Hillary Rodham Clinton, the likely Democratic nominee, has many advantages. She bears one of the most famous names in American politics. She has far more experience at the national and international level than any of her likely Republican opponents. Her gender will be a draw for many female voters eager to see history made. But, will the voters who were little kids when she was the young, dynamic first lady be excited about her candidacy or will they look at Clinton and see a white, rich grandmother who has nothing close to Obamas cool, multiracial vibe?, If Clinton can rev up enthusiasm among nonwhite voters and Millennials the way Obama did, she cannot lose. Demographics will simply dictate the outcome. However, if the enthusiasm is simply not there for her  and if the Republicans manage to avoid nominating the kind of gay-baiting, immigrant-bashing, prayer-spouting candidate their primary election electorate would adore, but who would scare off Latino voters and young libertarians  then Clinton could lose and Republicans could sweep the field, from Congress to the White House. If that should come about, Republicans ought to enjoy it while they can. In the long run, the numbers are against them.]", "Date": "20150423", "Title": "[Demographic trends favor Democrats, but GOP could still win in 2016]", "Link": "http://www.latimes.com/opinion/topoftheticket/la-na-tt-demographics-favor-democrats-2016-20150422-story.html\n", "Author": "[David Horsey]"}
