{"Content": "[Former CNN host Campbell Brown wants to make education a key issue of the 2016 presidential election. And shes not alone. Save the Childrenplansto spend $16 million to make early childhood education a campaign issue. Easier said than done. While it may be true that six GOP presidential hopefuls spent the better part of Wednesday discussing education with Brown at a forumin Londonderry, N.H. and theevents hashtag, #edsummit15, was a toptrending topic on Twitter, education has far more hurdles to jump over beyond money and publicity to top the campaigning charts. Parents tend to think of education as an issue about theirschools, which is not under direct presidential control. Education debates can often sound negative, and are filled with political minefields around teachers and their unions. And previous attempts to raise the issues profile have fallen short. Still, Brown invited all of the candidates. Ultimately, Louisiana Gov. Bobby Jindal, former HP executive Carly Fiorina, Wisconsin Gov. Scott Walker, Ohio Gov. John Kasich, New Jersey Gov. Chris Christie and former Florida Gov. Jeb Bush participated in a series of 45-minute chats with Brown. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, They touched on the usual hot-button issues in education: teacher tenure (mostly against it), the Common Core (they disagreed), charter schools (highly supportive) and teachers unions (their influence should be tempered.), Despite this initial blip of high-profile publicity, though, proponents of making 2016 an ed-lection, so to speak, have a long road ahead of them. Whose schools?, Schools in the United States are run by local school boards or mayors, several layers removed from the federal government and the politicians who vie to run it  only 8% of school funding comes from Washington, D.C. American parents are deeply connected with their own schools, but have less of a tie to the national education system as a whole, an interest that could translate into presidential voting preferences. This dissonance can be seen in parents attitudes toward different sets of schools. Fifty-five percent of parents said they would give their neighborhood public schools an A or B rating, whereas 28% of parents said they would give Americas public schools the same top grades, according to a recent poll from Education Next. If people like their local schools, regardless of what they think about schools nationally, theyre not going to be very likely to vote based on that issue, says Matt Chingos, a senior fellow at the UrbanInstitute. Theyre not going to vote for someone just because that candidate is going to fix a problem with someone elses schools. Parents can more likely relate to issues around higher education, such as student debt and the regulation of for-profit colleges -- its more personal, and more clearly influenced by the federal government. Former Sen. Hillary Rodham Clinton took note of this, and last week released a campaign proposal on college affordability. Additionally, it takes time for changes to education systems to have real, measurable effects on student performance. The shelf life of a politician and his and her whims is often much shorter than this lag, a fact that results in instability both at the national policy level and within school districts. The Obama administration, for example, has tried to remedy the faults of the punitive No Child Left Behind Act by allowing states to get out from under its most stringent requirements by issuing waiversthat trade in the laws strings for a states buy-in to certain preferred reforms, such as tying teachers evaluations partially tostudent test scores. Now, Congress is trying to reconcile two very different billsthat would update the law, but if that doesnt happen, those waivers can be pulled as soon as the next president steps into office. So a parent might not look to the presidential election and wonder how the candidates might affect their own childs education in the long term. A Debbie Downer issue?, Jack Jennings has seen so-called education candidates come and go, during the almost 30 years he spent as the House Education Committees general counsel. He observed that previous presidents Bill Clinton and George W. Bush were able to tap into voters hopes by running on platforms heavy with education policy. But the trajectory of education law since then has made it harder to do, because the federal governments role became punitive with the passage of Bushs No Child Left Behind Act, Jennings said. No Child Left Behind tied federal funding for schools with regular standardized testing, and has an escalating set of fixes for schools that are deemed to be failing by those metrics. That switch, Jennings says, makes it harder to run on education like Clinton or Bush did. Obama has kept many of No Child Left Behinds stringencies. Because of George W. Bush and Barack Obama, education has changed from being a positive national issue to being a negative national issue, Jennings said. All Congress is doing, theyre revising a bill that is removing requirements from Bushs law and restraining the education secretary from taking action. Theres no positive vision in Congress or in politics about what education can do.\", Hillary Rodham Clinton, Jennings noted, probably chose to focus on higher education last week for that reason. Teachers are tired, and they dont see anything positive coming from the federal level that is going to support them, he said. And even if the issues might sound negative, Chingos added that education tends to be an issue of major bipartisan agreement, something that might prevent it from rising to the level of a presidential campaign. Weve seen some attention from the Republican side on Common Core, because the candidates dont agree, but more generally, theres less disagreement between the political parties on K-12 education than there used to be, Chingos said. Past problem, People have tried to do this before. In 2008, the Bill & Melinda Gates Foundation and the Eli & Edythe Broad Foundation sponsored the $25 million Ed in 08 campaign to elevate education in the 2008 presidential election. They picked former Colorado Gov. Roy Romer, a Democrat, to run the effort. But it didnt quite work. A recent case studyfrom the conservative think tank the American Enterprise Institute found that nominees werent too receptive to Ed in 08s overtures, and that it was difficult to get education questions asked at debates. A few years after the campaign ended, the paper notes, its website was shut down, and by July 2009 it was as if Ed in 08 had never existed. Brown herself conceded that the history of attempts to get people to vote on national education isnt on her side. \"Education should have been a huge part of the conversation in the last several presidential elections,\" Brown said in an interview. \"Last cycle you had Obama and Romney who agreed on a lot of stuff, so it wasnt controversial enough to rise to the level to be a part of the debate.\", Even the American Enterprise Institute paper noted that while Ed in 08 failed, it laid the groundwork for future education campaigns. And Brown thinks this time will be different. This cycle, theres a lot happening that puts it front and center, she said. This election has the potential to be much more about education than previous ones, because you have candidates who understand the influence it has. FOR THE RECORD:An earlier version of this article stated that Chingos works at the Manhattan Institute. He works at the Urban Institute. You can reach Joy Resmovits on Twitter @Joy_Resmovits and by email at joy.resmovits@latimes.com. Sign up for The Times Education Matters newsletter here. ALSO:, Scott Walker sides with Trump on immigration and offers alternative to Obamacare, Trump plan: Make immigrants pay for permanent border wall and deport millions, Jeb Bush, seemingly perfect on paper, just hasnt caught on with GOP voters]", "Date": "20150819", "Title": "[The problem with making education a campaign issue]", "Link": "http://www.latimes.com/nation/politics/la-me-edu-the-problem-with-making-education-a-campaign-issue-20150819-story.html\n", "Author": "[Joy Resmovits ]"}
