{"Content": "[Rick Santorum launched a 2016 White House bid on Wednesday, vowing to fight for working-class Americans in a new election season that will test his influence  and focus on social issues  in a changing Republican Party. The former Pennsylvania senator may have exceeded his own expectations by scoring a second-place finish in the race for the Republican presidential nomination four years ago. Yet as he enters a more powerful and diverse 2016 field, he may struggle even to qualify for the debate stage. I am proud to stand here, among you and for you, the American workers who have sacrificed so much, to announce that I am running for president of the United States, the 57-year-old senator said, flanked by factory workers and six of his seven children in a cinder-block warehouse inwestern Pennsylvania. The last race, we changed the debate. This race, with your help and Gods grace, we can change this nation. Santorum opens this political season as a heavy underdog in a race expected to feature more than a dozen high-profile Republicans  most of them newcomers to presidential politics. He is among the nations most prominent social conservatives, having dedicated much of his political career to opposing same-sex marriage and abortion rights, while advocating for conservative Christian \"family values.\", He mentioned cultural issues only briefly Wednesday, however, in remarks designed to broaden his appeal to working-class Americans. As president, I will stand for the principle that every life matters  the poor, the disabled and the unborn, said Santorum, a Catholic. He ultimately won 11 states in the GOPs 2012 primaries after an unexpected and narrow victory in the opening contest in Iowa, where he emerged as a conservative favorite after touring the states 99 counties in a pickup truck. His road to relevancy this time wont be easy. Its going to be much more competitive, said Foster Friess, a prominent donor who was standing near the podium during Wednesdays announcement. Santorum has acknowledged his challenges in 2016, but says his experience could pay dividends the second time around. Most of the GOPs presidential nominees in recent decades, Mitt Romney and Ronald Reagan among them, needed more than one campaign to win the nomination. He faces considerable competition for his partys social conservatives in particular. The list of Republicans already courting religious voters includes former Arkansas Gov. Mike Huckabee, a Baptist ministerwho won the Iowa caucuses in 2008; former Texas Gov. Rick Perry;Louisiana Gov. Bobby Jindal and Texas Sen. Ted Cruz. And, like Santorum, former Florida Gov. Jeb Bush is a Catholic. Polling suggests a shift in voter attitudes about the importance of social issues, particularly gay marriage, which has long been a defining issue for Santorum. Like others in his party, he has appealed to religious voters recently by criticizing what he calls President Obamas war on religious freedom, which includes the broader debate over whether private businesses can deny services to same-sex couples. Santorums long-shot status may keep him out of presidential debates altogether. Only those who place in the top 10 of national polls will be allowed to participate in the first Republican presidential debate in August, according to guidelines released by network host Fox News. Santorum is on the bubble. While advisors suggest he will benefit from a donor network that has grown in recent years, questions remain about Santorums ability to raise money. Friess, who gave more than $2 million to a pro-Santorum \"super PAC\" in 2012, said he would continue to support Santorums White House ambitions, although he plans to avoid donating large amounts directly to the campaign or a supportive super PAC, both of which would disclose their donors. Any giving Im doing is going to be lower-profile and less noticed, Friess told the Associated Press. Santorum immediately launches a rollout tour that begins in Iowa on Thursday and Friday and moves to South Carolina on Saturday and Sunday. He is not scheduled to appear in New Hampshire, where voters typically dont favor candidates who focus on social issues. A crowd of hundreds watched Santorums announcement at Penn United Technologies, an employee-owned manufacturing company based in the western Pennsylvania county where Santorum grew up. Wallace Cypher, 54, who lives half a mile away, said hes backing Santorum because he wants a true conservative to win the GOP presidential nomination. I think hed be a whole lot better than what weve got in there right now, Cypher said. , 3:32 p.m.: This story was updated with details of Santorums official announcement. This story was originally published at 8:16 a.m.]", "Date": "20150527", "Title": "[Rick Santorum, announcing run for president, vows to fight for working class]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rick-santorum-white-house-run-20150527-story.html", "Author": "NULL"}