{"Content": "[Bruce Bartlett has 24-karat conservative credentials. He worked in the Reagan White House, the George H.W. Bush Treasury Department, for former Texas Rep. Ron Paul and the Heritage Foundation. So when he saw Republicans doing things he believed damaged the brand, he said so, and was surprised to find himself first ignored, then struck from the rolls of the GOP talk-ocracy, and even fired from his think tank job. And that, he says, is the problem. Bartlett, who is now an independent, made headlines recently with a scholarly paper about Fox News. In it, he describes a media \"bubble\" that imperils the GOP by screening out ideas that challenge Republican orthodoxy  in other words, those inconvenient truths. What was the genesis of the Fox paper?, In 2004, I was extensively quoted in a New York Times magazine article [critical of President George W. Bushs decision-making]. I assumed my conservative friends would give me a lot of trouble, but nobody said a word. I finally started asking, \"What did you think?\" Every single one gave me the same answer: \"I dont read the New York Times.\" Many were mildly insulted that I would think they would read what from their point of view was the equivalent of Pravda. This was the first indication I had of the bubble conservatives now live in. The fact that they would consciously close themselves off to this key source of information came as a revelation. Its gotten much worse in the last 10 years as conservative media have become more available; Fox is just the biggest. Inside the bubble, certain facts are never heard because theyre inconvenient to the conservative worldview. Global warming is probably the biggest but hardly the only one. Youre no longer a Republican yet youre concerned that bubble-think could damage GOP electability. A lot of conservatives are a bit worried about this. They understand this isnt good for the party. Its going to hurt us in 2016 because if we have people who are not serious candidates, making ridiculous arguments about Obamas invasion of Texas and other crackpot issues, all Hillary has to do is nothing. Yet Republicans control Congress and many state legislatures, so how is this bubble damaging the GOP?, [For example,] the 2012 drumbeat on Fox that polls showing [Mitt] Romney losing were wrong; this was considered gospel in the conservative world: \"Of course Romney is ahead because our ideas are so popular.\" To the extent that it affected Republican strategy, they may have deluded themselves into a defeat. If you think your guy is behind, you work a little harder. A Kentucky state GOP senator told a legislative hearing, \"We all agree that the temperature on Mars is exactly as it is here.\" But Mars is much colder than Earth. What happened to being entitled to your own opinions but not your own facts?, This is a severe problem for democracy itself. We cant go back to the old days of half-hour news broadcasts on the three major networks, when people were forced to have a common source of information, at least on a few issues. [Now] its a rare day that somebody doesnt go into business with some new conservative news site. These people are good at worming their way into the system. There seems to be a kind of nonaggression pact among non-bubble media not to say the emperor is wearing no clothes  that Fox is not a legitimate news source, its a propaganda source. What do you think is Foxs end game?, So far they have not been confronted by any contradiction between their support for a conservative worldview and making money and getting ratings. They tell themselves nobody is forced to watch; that if someone wants a different point of view, all they have to do is change the channel. The path for Republican presidential hopefuls seems to run through Fox. I think thats right. One consequence [is] the huge number of candidates. Historically, the way the Republican Party has operated, theres one guy that everybody agrees: \"Its your turn.\" That was true for [John] McCain, for Romney, for Bob Dole before that. Now its easy for [candidates] to overcome the threshold of name ID because theres so much conservative media out there that they will legitimize candidates for their own purpose of gaining audiences. In the old days, the news media had a winnowing effect that prevented crackpots and people with no chance from getting any traction. Many of these candidates have very close connections to Fox News. [Mike] Huckabee had a show for years, building his audience and in the process building an organization for his campaign. Nobody in his right mind would defend child sexual molestation unless theyre so deep in the bubble that the first reaction is, I have to defend these people because theyre part of my constituency. That Huckabee would do something like that [Huckabee defended the repentance of reality show personality Josh Duggar, who has admitted to wrongdoing related to molestation \"mistakes\" he made as a teenager] seems patently absurd, without reference to the bubble. How has Fox news changed since it started in 1996?, Right after 9/11, whether it was market-driven or ideological, Fox made a decision to move further to the right. When Fox first came on the air, they were to the right of most other major media by virtue of being in the center because the others tilted a bit to the left. They could honestly say, \"Were fair and balanced.\" Fox moved to the right at a time the whole country moved to the right. One commentator said [that] in many ways Fox is not so much conservative as it is anti-liberal. [Fox News Chairman and Chief Executive] Roger Ailes cut his teeth during the Nixon years. Remember the \"silent majority\" and the hard-hats? A lot of this is simply hippie-bashing brought up to the modern era; Ailes is smart enough to redefine that generational cultural debate and keep it relevant. Theres a study in the Journal of Public Economics that suggests its possible to track Foxs effect on voters. Fox had to go through a long process of getting [local] cable systems to carry Fox News. You can study when a particular cable system made Fox available, by the exact date, and you can look at voting data before and after by congressional district. Its a wonderful data source for all kinds of phenomena. You can see it increased votes for Republican candidates and for Republican policies in Congress. You used the term \"self-brainwashing\" to describe how the bubble affects policymaking. [Here are] two examples: One is Benghazi, an issue about which nobody outside the Fox universe cares. Yet [congressional] Republicans keep holding one investigation after another, and when their investigation proves theres nothing wrong, they ignore it and start a new investigation. The other is the obsession with Obamacare. Fox has given forums to Obamacares critics to a far greater extent than other media. Congress is up to, what, 60 votes to repeal this thing? Now it looks like the dog may have caught the bus; if the Supreme Court gives the Republicans what they want, this could be a complete disaster for them. To what extent has President Obama himself become the fuel for conservative obsessions?, I hate to play up the race angle, but I dont see how you can avoid it. Republican conservatives deny Obamas legitimacy: Thats the basis for this thing about his birth certificate. In a poll after the 2012 election, 58% of Republicans said the election was stolen. I dont want to make too much of a sociological argument, but this does date back historically to the denial of humanity to slaves because the only way whites could rationalize treating them as slaves was to deny theyre actual human beings. What other changes have Fox wrought on the GOP?, The key thing is the development of the tea party in 2009, which I dont really view as conservative but as populist. A member of Congress who may be genuinely moderate doesnt dare vote [that way] for fear he will be attacked [from the right]; they have no choice but to do what the tea party wants. [They] need a real-time fix on what issues animate the tea party. Where are you going to get that? Very easy  you turn on Fox News. Do Democrats have a bubble too?, There are people who only watch MSNBC or [listen to] Stephanie Miller, but thats a very small number compared to people [in the bubble] on the right. Pew [Research Center] polling data [shows] Democrats get their news from more varied sources. A lot of the Democratic coalition are not really liberal, theyre good-government people, they want government to work; whereas vast numbers of Republicans are essentially operational anarchists  they hate government, they use every opportunity to destroy government, because in their warped view that is per se good. [In the conservative bubble] you never find anyone willing to say government does something right unless youre talking about killing Muslims. You only hear about government screw-ups; you never hear about corporate screw-ups. So theres an imbalance that gets back to echo-chamber brainwashing. When government does something right, its simply not reported; that leads people to think, we might as well get rid of government or slash it willy-nilly. This interview has been condensed and edited. patt.morrison@latimes.com, Twitter: @pattmlatimes, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150603", "Title": "[ Can Bruce Bartlett save the GOP by bursting its 'bubble'?]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-morrison-bartlett-20150603-column.html\n", "Author": "NULL"}
