{"Content": "[Three potential Republican presidential contenders parried on issues including Cuba policy and the qualities necessary to win the White House during a Sunday night panel discussion that also afforded an unprecedented, if limited, peek into the workings of influential band of conservative donors. Freedom Partners, part of the web of political organizations financed by Charles and David Koch and other wealthy donors, broke with its tradition of privacy to allow a live stream of a debate of sorts among Sens. Marco Rubio of Florida, Ted Cruz of Texas and Rand Paul of Kentucky. It was held at a resort in Palm Springs after days of closed meetings. The result was a detailed discussion of issues that at this early stage of the campaign have largely been explored only in broad brushstrokes. And it illustrated differences that will be discussed at length in the Republican primaries should the three men -- currently all exploring the 2016 race -- jump in. Stark disagreement came in the area of Cuban policy, with Paul supporting President Obamas recent overtures to ease tensions with the island, and Rubio and Cruz -- both of whom have familial ties to Cuba -- emphatically disagreeing. Weve tried an embargo for 50 years; it hasnt worked, said Paul, who added that he thought trade actually would benefit the people of Cuba. There isnt a single contemporary example of that happening, Rubio replied. He cited the opening of U.S. relations with China and its continued human rights violations. China today is a more prosperous country but it is not a free country, the Florida senator said. What it is is the richest tyranny in all of human history. Paul replied that there are more than two dozen Muslim nations that punish Christians, and that applying Rubios standard would mean not trading with them. Im not a real big fan of a lot of these regimes, but I guess I dont want to isolate ourselves and say we are not going to trade with people who arent perfect Western-type democracies, he said. Cruz called the Obama administrations Cuba move a terrible mistake that would extend communist power there. This will result in billions of dollars more for the Castro regime, he said. A similar schism arose over the Western sanctions against Iran, with Paul concerned about pursuing diplomatic options and Cruz arguing that a harsh hand would reap benefits. The language employed by the Texas senator was the furthest from diplomatic, as he contrasted what he said were better chances that the U.S. could bend North Korea to its will than Iran. In North Korea, both father and son [referring to leader Kim Jong Un and his father and predecessor, the late Kim Jong Il] are fundamentally megalomaniacal narcissists, he said, which means some degree of rational deterrence is possible. ... The problem with Iran is [its supreme leader, Ayatollah Ali] Khamenei and the mullahs are radical religious Islamic nutcases. And thats the technical term. When you have religious leaders who glorify death and suicide, ordinary cost/benefit doesnt work. One area of complete agreement was the role of the sort of wealthy donors who invited the senators to the Palm Springs retreat. Asked by the moderator, ABC news correspondent Jon Karl, whether the super-wealthy political donors had too much influence, Rubio replied mockingly. As opposed to Hollywood or the mainstream media, you mean, or other multibillion-dollar entities that try to influence American politics every day? he asked, drawing cheers from the audience. He defended the rights of all donors -- left or right -- to engage in political financing. I believe in freedom of speech and I believe spending money on political campaigns is a form of political speech that is protected under the Constitution, and the people who seem to have a problem with it are the ones who only want unions to be able to do it, their friends in Hollywood to be able to do it and their friends in the media to be able to do it. Cruz said that Senate Minority Leader Harry Reid had embarked on a campaign against the Koch brothers because they cannot defend the Obama economy which is a disaster. ... They want to scare people. I think that is grotesque and offensive, he said. The Palm Springs event came on a busy weekend in a presidential contest that, without a single declared candidate, is roaring to life 22 months before the election. On Friday, former Florida Gov. Jeb Bush spoke in San Francisco. On Saturday, more than a half dozen potential candidates took part in a speech-making marathon in Des Moines. Cruz was the only candidate to appear in Iowa, site of the first 2016 voting, and Palm Springs. Karl also asked the three about the recent pronouncement by 2012 nominee Mitt Romney that he was considering a 2016 run, with a new focus on poverty and related issues. None of the three openly embraced his return. Mitt Romney, I think, is an extraordinary person, said Rubio, one of those Romney considered as his running mate before selecting Rep. Paul Ryan of Wisconsin. Hes someone whos earned the right to decide what it is he wants to do. But Paul indicated far greater reservations. Im kind of with Ann Romney on this one, he joked, referring to past opposition by Romneys wife to another race. No no no no never. He called Romney a good man, a generous man but one whose attraction was limited. To win the presidency, you have to reach out and appeal to new constituencies and I just dont think its possible, he said, and if he thinks, Well just change a few themes and reach out to people, ... I think its a little more visceral than that -- how you connect with people ... I just dont think that visceral connection is there with enough people to win a general election. As to who should be the next nominee, the senators unsurprisingly pushed back against the notion forwarded by some Republican governors that the GOP would be better off with a state leader than one tied to Washington. Once again it was Rubio who most forcefully made the case, arguing that the next president had to be well versed in the multiple facets challenging the nation. It is important for the next president of the United States to understand the diversity of these challenges, to have a global strategic vision and an understanding of what the U.S. role is, he said. Does that mean a governor cant acquire that? Of course they could. But Id also say that taking a trip to a foreign city for two days does not make you Henry Kissinger either. Youve got to spend some time on those issues. But Gov. Scott Walker of Wisconsin, who seems aimed at a presidential run, made a strong case for a governor on the ticket, ABCs Karl said. If I was a governor, Rubio replied, Id say the same thing. For political news and analysis, follow me on Twitter: @cathleendecker]", "Date": "20150126", "Title": "[GOP senators, and possible 2016 rivals, vie at Koch brothers retreat]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-koch-brothers-retreat-senators-20150126-story.html", "Author": "[Cathleen Decker]"}