{"Content": "[Did I detect a bit of snark about Sen. Barbara Boxers retirement, after reporters noted that Californias top trio of politicians  our two long-serving U.S. senators and our four-term governor are all well past 70 years old?, The trio has a combined age of 231. If you toss in U.S. Rep Nancy Pelosi, 74, the cumulative age rises to 305. In California, where youth worship is a major industry, its kind of a relief to see men and women working in high-profile jobs well past the traditional age of retirement. Golden State? How about Golden Girls State?, The 74-year-old Boxers decision has opened the field to various good-looking California whippersnappers -- former Los Angeles Mayor Antonio Villaraigosa, 61; Atty. Gen. Kamala Harris, 50; and Lt. Gov. Gavin Newsom, 47 -- whose aspirations to higher office have been stymied by the career longevity of their Democratic elders. A year ago, in a piece about the retirement of then-74-year-old Rep. Henry Waxman, my colleague Cathleen Decker explored the political aspect of the \"party gridlock\" that has kept a new generation of California politicians wondering when theyll get their closeups. Its all well and good to finally give the kids their shot, but Id like to suggest that our chronologically gifted politicians have done more in their sunset years than others have done in what is supposed to be their prime -- especially Feinstein and Brown. Lets start with Feinstein, the Senate Intelligence Committee chairwoman, who turned 81 in June. Last month, after years of tussling with the CIA and the Obama administration, Feinstein decided to release the groundbreaking report that put the lie to claims that torture is an effective interrogation tool, or that torture led us to Osama bin Laden. It was an extraordinarily bold move, taken at a kind of now-or-never moment since Democrats are about to lose control of the Senate. Republicans on the committee, most of whom objected to the reports release, probably would have buried it faster than you can say enhanced interrogation technique. In that moment, Feinstein, a moderate whose hawkishness has often ticked off the progressive left, made what is arguably her most valuable and heroic contribution to her country. For that, she was vilified, and continues to be. But she did the right thing. And now we know exactly what was done in our name, and why it was so wrong. Read the report, said said during her Washington press conference, and you tell me if you think this is how you want the country to behave. Boxer, who has long rankled conservatives because she has been such a pugnaciously liberal voice, has been a steadfast supporter of womens rights, abortion rights, gun control and environmental protections. To her enduring credit, she voted in 2002 against authorizing the war in Iraq. Three years later, she spoke for many who opposed the war when she challenged Secretary of State nominee Condoleezza Rice at her confirmation hearing, telling Rice that her loyalty to the mission you were given, to sell this war, overwhelmed your respect for the truth.\", After easily trouncing Republican U.S. Senate candidate Carly Fiorina in 2010, its pretty clear the Senate seat was Boxers to keep as long as she wanted. Californias enlightened voters do not hold a candidates age against her. Or him. Brown, 76, also seems to improve with age. In May 2013, about halfway through his third term, the Atlantics James Fallows took note of the governors vitality: He moves, talks, reacts, and laughs like someone who is in no mood, and feels no need, to slow down. He is nearly a decade older than Bill Clinton but comes across as younger and bouncier. And while Brown has never lacked confidence, his string of political victories in the last few years have imbued him with the kind of political glow that leads ordinarily cynical reporters to speculate about what his next political move will be. On Friday, Jerry Roberts and Phil Trounstine of the Calbuzz blog suggested that Brown, who theyve dubbed \"Governor Gandalf\" could replace Boxer. His good genes plus good exercise and diet habits, would make the age issue a non-starter for him,\" they wrote. Some have even urged him to run for president again. If he did, hed almost certainly be the oldest candidate in the race -- older even than Joe Biden, 72, and Bernie Sanders, 73. How fun would those debates be?, Maybe Brown could even recycle that great line delivered by President Reagan during a presidential debate with 56-year-old Walter Mondale in 1984. \"I will not make age an issue of this campaign,\" said Reagan, 73. \"I am not going to exploit, for political purposes, my opponents youth and inexperience.\", Please follow me on Twitter: @robinabcarian]", "Date": "20150110", "Title": "[The older the better; let's hear it for California's geriatric pols! ]", "Link": "http://www.latimes.com/local/abcarian/la-me-ra-old-california-politicians-20150109-column.html\n", "Author": "NULL"}
