{"Content": "[After launching his 2016 presidential campaign by declaring \"yesterday is over, Sen. Marco Rubio began filling in some of the policy details behind his lofty rhetoric in a round of media interviews. The 43-year-old brushed off comparisons to President Obama, another young senator who after just a few years in office rode voters desire for inspirational change into a bid for the White House. \"I wasnt a legislative backbencher,\" Rubio told Fox News Sean Hannity, citing his nearly decade in the Florida statehouse and first term in the Senate. \"Im a free enterprise, limited government conservative, he said. Im a strong America conservative. Im an exceptional America conservative. I believe that the government has a role to play, but its a limited one. The familys more important. The private sectors more important.\", Among other things, he said he wants to reverse Obamas move to reestablish ties with Cuba, allow businesses to refuse gay wedding services and tax some wealthier households to provide bigger child tax credits. So far, Rubio has mostly aimed his criticism at Democrats, namely front-runner Hillary Rodham Clinton, rather than the robust field of Republican rivals he will confront in the primaries. But his attack against \"yesterday\" candidates also served as a not-so-tacit swipe at likely Republican presidential hopeful Jeb Bush. Obama, he continued, \"has been a failure because his ideas are bad. I dont care if he had been in the Senate for 50 years. If he had done what hes done now, he would have failed too. His ideas dont work.\", Rubio catapulted to the Senate as a tea party favorite in 2010, but has strayed from deficit hawks with his support for beefed-up military spending. His tax plan, unveiled earlier this year, was praised for lowering corporate rates and bringing the top individual tax bracket down to 35%, but panned by conservatives for pushing some households earning $75,000, or $150,000 for couples, into a higher tax bracket. He told Hannity that Medicare would need to be changed if it is to remain solvent, a nod to a GOP plan that would give future seniors -- people now in their mid-50s and younger -- a lump sum to buy insurance or apply to Medicare. The one issue, though, where Rubio has played a leading role -- immigration reform -- continues to complicate his presidential ambitions. Rubio backed away from the overhaul bill he helped pass through the Senate, primarily because the 13-year citizenship pathway it offered was criticized by conservatives as \"amnesty\" for immigrants here illegally. \"I dont know about the others, but Ive done more immigration than Hillary Clinton ever did,\" Rubio said on NPRs Morning Edition. \"I mean, I helped pass an immigration bill in a Senate dominated by Democrats. And thats more than shes ever done. Shes given speeches on it, but shes never done anything on it.\", When pressed by Hannity during the Fox interview, Rubio signaled a willingness to shift away from his long-held position that the United States should not create a class of permanent residents who have legal status to work here, but no chance at citizenship. \"I know that there are people out there that say, no, they should only have the work permit for the rest of their lives. I dont think thats necessarily a good idea, but if thats the only way we can move forward on it, I would explore it,\" Rubio said. That position may win over conservatives who continue to view the U.S.-born son of Cuban immigrants with skepticism over his attempt to change immigration law. But it is likely to only further distance him from the Latino and minority voters that Rubio hopes to attract with his familys inspirational story of immigrant struggles and success. Rubio was headed back to Washington on Tuesday, but will hit the campaign trail later this week to the early primary state of New Hampshire. For the latest from Congress follow @LisaMascaro]", "Date": "20150414", "Title": "[After soaring rhetoric, Rubio begins to outline policy positions]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rubio-policies-20150414-story.html", "Author": "[Lisa Mascaro]"}