{"Content": "[In the dead of night, his eyes fixed on the ceiling, does Larry Lessig really think: \"It could be me standing on the steps of the Capitol on a frigid January 20th of 2017, being sworn in as president of the United States\"?, Does this Harvard law professor really believe that he can persuade Americans that the only thing that matters is obliterating money from the political system, and once that giant hurdle is leaped, Americans will turn to him to do it?, Well, maybe. \"Obviously from this perspective I think its a long shot,\" he said, \"but I actually think that if we can make a number of steps happen its plausible.\", Plausible in the way that all nutty concepts sound a lot more achievable if broken down into small digestible pieces. What he means is: raising a million dollars by Labor Day to kick off his Democratic presidential campaign. Using that to boost his poll numbers, which in turn would give him a place on the debate stage with the more conventional candidates. Using the debates to romp over the professional politicians and swing America to his side. And managing, somehow, to not get plowed under by the very moneyed political campaign system he is trying to dismantle. The first of those goals may indeed be plausible; Lessig had about half the total in hand as of Thursday, with about three weeks to go. But the others seem a little  no, a lot, no, completely  less so. Lessig is not, after all, Donald Trump, able to promote his non-politician candidacy with the help of billions stashed in his mattress. He is not Ben Carson, the neurosurgeon turned Republican presidential candidate whos moved into the higher ranks with his outsider appeals to parts of the GOP coalition. He is definitely not Carly Fiorina, the former Hewlett-Packard chief executivewhose bloody firing from that post has received far less notice than her piquant barbs at Hillary Rodham Clinton. And he is certainly not Clinton or Jeb Bush, this years earned-money champions of the two major political parties. He is, instead, a man few people know, outside of academic and Internet circlesat 54, he is director of the Edmond J. Safra Center for Ethics at Harvard, and has worked to free restrictions on Internet interests. Hes also sought to diminish the power of money in politics, most recently with the 2014 Mayday PAC, which raised money to elect like-minded members of Congress. (In eight races the group targeted, two candidates won.), Still, Lessig has his hook  that bright and shiny thing meant to convincevoters of the seriousness with which he is approaching this campaign for president. Hes promising that, were he to defy universal expectations to win the presidency and push through the campaign finance-inflected Citizen Equality Act of 2017, he would resign and leave the rest of the nations worries to his vice president. Campaign promises toserve onlyone term always seem a little daffy. And promises to serve less than a term, after all the trouble of getting there? Daffy doesnt cover it. But that is precisely what Lessig is vowing, were he to destroy precedent and get himself elected in the first place. \"I think the only way to have a strong enough mandate is to make clear I will be there for one reason,\" he said in an interview. Were he a traditional candidate, he said, hed have to grind out positions and \"talk about 10 to 12 issues.\", With attention on them, \"the hardest thing we have to do is what we wouldnt accomplish,\" he said. Ergo, he would \"sacrifice the full presidential term.\", Presidential campaigns these days are giant start-ups, requiring a national staff and hundreds of millions of dollars, and more for the nominees. Lessig is running what his campaign calls a \"decentralized virtual campaign team\" out of San Francisco. Hes also opened an online poll to help choose his vice presidential running mate  in other words, tossing much of the campaign to volunteers. If he doesnt raise enough money by Labor Day, he says, hell return it. Politics has its share of egocentrics and narcissists, so it can seem puppy-kicking cruel to dump on a do-gooder like Lessig, who seems likely not to personally benefit from this effort unless hes a masochist. But, reality intrudes. The craziness of the summer before the presidential year can convince people that anything is possible  Trump is leading in all national Republican polls, after all  but almost all of the time, things presidential are impossible. And Lessigs candidacy  if there ultimately is one  falls squarely into that category. His sole effort, the previously mentioned equality measure, would push through advances to the Voting Rights Act, which has been chipped at by courts and Congress. It would force electoral districts to be drawn fairly and open up more space for non-incumbents using methods that have so far been spurned. It would spur public financing of campaigns, another effort long tried, mostly without success. He insists that all the roadblocks would tumble under the force of his giant mandate. He cites a Wall Street Journal poll from earlier this summer that he said proved changes like he is espousing were \"the No. 1issue\" among Americans. \"This is historically completely anomalous,\" he said. \"It has not been that important to people before. What you typically find is that people are so skeptical  they dont believe the politicians when they talk about it. My bet is when we give a clear way to fix the system it would be easy to fix the system.\", But its not clear that attitudes have changed all that much. Indeed, the poll he cited showed that a third of Americans said their top concern was the power of moneyed interests in politics. But the question measured only a few options, including concern about negative campaigning and whether anything would change regardless of who was elected. The options did not include matters like the economy  the top-ranking issue for most of the last decade  foreign affairs or more concrete issues that the candidates already are brawling over. Oddly enough, given his concern about money, Lessig finds that billionaire Trump is doing a pretty fair job of advancing Lessigs point. At almost every turn of the race, Trump is blasting all the other candidates for soliciting money from donors whose desires they then work to fulfill  the kind of thing Lessig calls \"corruption.\", \"To be in a world where the leading Republican candidate is calling everyone corrupt because of the way they are financing campaigns? What better year is there?\" Lessig asked. \"Now its fair game in the Republican Party  and then why couldnt it be in the Democratic Party?\", He dismisses Clinton and Bernie Sanders, the independent Vermont senator running in the Democratic primary, for not having vowed to make campaign finance and Lessigs other issues their primary focus. Either optimistic or delusional, he thinks there still might just be a chance for him to do what he says they will not. \"I do actually think that if people can see this as a real option, then they might embrace it,\" he said. \"The consolation prize of raising the salience of that for the Democratic Party is worth all the scorn and derision and sleepless nights.\", For political news and analysis, follow me on Twitter: @cathleendecker . For more on California politics, go to latimes.com/decker.]", "Date": "20150821", "Title": "[Larry Lessig's latest long shot: A presidential campaign in 2016? ]", "Link": "http://www.latimes.com/local/politics/la-me-pol-larry-lessig-presidential-campaign-20150821-story.html", "Author": "[Cathleen Decker]"}