{"Content": "[After 14 years in Congress, Rep. Adam Schiff of Burbank is finally getting the kind of coverage that ambitious politicians crave: CBS, NBC, Fox, CNN, MSNBC and NPR have all come calling in recent weeks. Schiffs newly acquired media platform  he was named ranking Democrat on the House Intelligence Committee in January  could serve him well if he runs for the U.S. Senate seat that fellow Democrat Barbara Boxer plans to vacate. But Schiffs high profile on foreign affairs, if not his whole career in elective office, is exactly what he would be forced to relinquish if he runs for the Senate and loses. Hes trying to decide whether its worth it. Two other Democrats, Reps. Xavier Becerra of Los Angeles and Loretta Sanchez of Garden Grove, are making similar calculations as they weigh whether to enter the race for a rare open Senate post in California. House members cannot seek reelection and run for another office at the same time. \"Theyre all on the cusp of fairly significant seniority in the House, and they would be giving that up,\" said John Lawrence, a retired chief of staff for Minority Leader Nancy Pelosi who spent 38 years on Capitol Hill. \"The question is: Would they be giving that up for a reasonable shot in the Senate?\", Schiff, 54; Becerra, 57; and Sanchez, 55, have collectively spent 54 years elbowing their way to higher standing in the House. Theyve been waiting for colleagues to retire so they can move up, and they still face the constant threat that even after biding their time, rivals could outmaneuver them. But with scant hope that Democrats could seize control of the House next year, they are also stuck in the relatively powerless minority. Democrats stand a better chance of retaking the Senate, so the potential leap may be that much more tempting. For now, the leading rival for anyone who enters the Senate race would be state Atty. Gen. Kamala Harris, a Democrat who launched her campaign in January. Harris may be tough to beat. She has won two statewide elections. Her job as the states top prosecutor keeps her in the news on topics that she can hand-pick to maximize political gain. She might end up being the only prominent woman in the race, a significant edge in a state where women tend to vote in bigger numbers than men. And her support is especially strong in the Bay Area, where she was San Francisco district attorney from 2004 to 2011. Yet many Californians still have little or no impression of Harris  she is unknown by more than half the states registered voters, according to a recent USC Dornsife/Los Angeles Times poll. That leaves an opening for any opponent who can afford large-scale advertising. Harris \"early start might give her an edge,\" said Larry Tramutola, a Democratic strategist in Oakland. But \"it kind of has more to do with your ability to connect with voters and to articulate your vision of why you ought to be elected.\", Rocky Chavez, a Republican state assemblyman from Oceanside, also is running for Senate. But hell be fighting Californias strong Democratic tilt, which makes it hard for any Republican to raise money for a statewide campaign. Schiff, who had more than $2.1 million in the bank at the end of December, was appointed by Pelosi to the intelligence post on Jan. 8, the same day Boxer announced she would retire. Its an unusually powerful spot for a Democrat in the House because of the committees bipartisan tradition. Schiff is also a leading Democrat on the committee investigating the attack in Benghazi, Libya, giving him a perch on what is likely to be a flashpoint issue in the 2016 presidential race. In an interview, Schiff said he would decide by the end of May whether to run for the Senate. \"Thats a bit of a dilemma,\" he said. \"I love the intel work on the one hand. But on the other hand, these opportunities dont come up very often. And the fields wide open for a candidate from the southern half of the state.\", Becerra holds the No. 4 position among Democrats in the House, making him a viable contender to succeed Pelosi, or one of her top two deputies, should they retire. All three leaders above him are in their 70s. At the Capitol in Washington this week, Becerra stood before a row of flags to introduce Pelosi at a news briefing. Pelosi would not say whether she wanted Becerra or any other House members to seek Boxers seat. Becerra, who finished 2014 with $1.3 million in campaign cash, said he would decide on the Senate contest in the next few months. \"For me its an interesting question because, being  high-ranking in leadership, I have an opportunity to make a difference for my state of California and my city of Los Angeles already,\" he said. Sanchez, who ended the year with about $392,000, is the second ranking Democrat on two key committees, Armed Services and Homeland Security. \"Its not really about, Oh gosh, Im losing something,\" Sanchez said. \"Its really about the opportunity to gain more ability to work on the issues I care about.\", Sanchez said she expects to make a decision in four to six weeks. One added pressure for her: She said House Democratic leaders are concerned that her Orange County House seat would be the toughest among the three to defend if she stepped aside. But Sanchez said she believes shed do better than House colleagues looking at the Senate contest. \"They can kid themselves as much as they like,\" she said. \"Then its about: Can you raise the money? Can you do the work? Will you catch fire?\", She, Becerra or Chavez would be Californias first Latino in the Senate, a potentially major asset. Still, like Schiff, the two Democrats would face serious obstacles in a vast state with 53 House members, most of them unfamiliar to voters outside their districts. \"Each of us is relatively well-known in 1/53 of the state,\" said Rep. Brad Sherman (D-Sherman Oaks). \"Thats what you start with.\", The House members also would have to balance their Washington duties with the rigors of campaigning in a state five hours away by plane. Henry Waxman, who retired in January after 40 years representing the Westside in the House, said the demands of raising money and traveling around California make a Senate campaign a full-time job, and that means giving up on policy goals in the House. \"In a state like California, its like running for president of the United States,\" he said. \"And thats very different for all three of them than legislating and being active in the policy area.\", Whatever the challenges, a competitive Senate contest remains possible for candidates who can raise money and develop an effective message, said Bill Carrick, a longtime strategist for Democratic Sen. Dianne Feinstein. \"Early reads on these races can be very misleading,\" he said. michael.finnegan@latimes.com, Twitter: @finneganLAT, noah.bierman@latimes.com, Twitter: @Noahbierman, Finnegan reported from Los Angeles, Bierman from Washington.]", "Date": "20150320", "Title": "[State's congressional leaders weigh risking their power for Senate run]", "Link": "http://www.latimes.com/local/politics/la-me-pol-senate-candidates-20150320-story.html", "Author": "[Michael Finnegan, Noah Bierman ]"}