{"Content": "[Carly Fiorina, the only woman to announce her candidacy for the Republican presidential nomination, is no Sarah Palin. Shes no Michele Bachmann, either. And the GOP should be thankful. She isnt a quitter like Palin, whostepped down as Alaska governor barely half way through her first term. She is not given to nutty pronouncements like former U.S. Rep. Bachmann, wholinked the HPV vaccine to mental retardation on national television based on something a mom once told her. Unlike Palin, who was plucked from obscurity by a desperate John McCain, Fiorina earned her place at the top of the corporate heap. And unlike Bachmann, who recently warned that PresidentObamas policies on gay marriage and Iran are hastening the rapture, she appears to have all her marbles. Finally, the Republican Party is fielding a woman who is up to the challenge of running for president. Unfortunately, she seems to have forgotten theres a primary going on right now. She has skipped over all that, and is waging her own general election against presumptive Democratic nominee Hillary Rodham Clinton. \"If Hillary Clinton faces a woman opponent,\" Fiorina said earlier this year, \"she will get a hitch in her swing.\", For that, Fiorina, who is tough and smart, has become a favorite speaker at conservative gatherings. On Wednesday, she will be among the featured speakers at the Republican National Committees spring meeting in Scottsdale, Ariz. As the first woman to run a Fortune 20 American company, she is a bona fide American feminist pioneer. Her edges can be a little sharp, but it appears that she is starting to develop a sense of playfulness, a quality not always evident in her public appearances. Last week, late night talk show host Seth Meyers ribbed her for failing to purchase the domain name carlyfiorina.org, which was bought by a detractor who posted 30,000 frownie face emoticons representing the number of layoffs she engineered as Hewlett-Packards first female CEO. Do you know who owns SethMeyers.org? she asked Meyers. I do. I just bought it in the green room. So you better be really nice to me. Later, she told Meet the Press host Chuck Todd that she purchased chucktodd.org. (Both URLs redirect to carlyforpresident.com.), Still, all the humor in the world will not offset the parts of her record that could haunt her as she seeks her partys nomination for president. Though she broke the ultimate corporate glass ceiling as HPs CEO, she flamed out in spectacular fashion when the board of directors canned her some 5 1/2 years into the job. She had upended HPs famously collegial culture, killed off its beloved profit-sharing program and hung her own portrait between those of the companys two sainted founders, affectionately known as Bill and Dave. She fought a bitter proxy battle against the founders grown children over a merger with Compaq. And though the merger was approved, she was wounded by the battle and never really recovered. Under Fiorina, HPs stock plummeted by 50%. On the campaign trail, she appears undaunted by her reputation as one of the worst tech CEOs of all time. Last Sunday onMeet the Press, host Todd asked her why HPs board fired her. It is an excellent question. In interviews, board members have said that she had big vision but was unable to execute it. Some of her detractors have said she was too distracted by her growing fame to steward the company in its new incarnation. She told Todd she was the victim of a \"boardroom brawl.\", What people fail to comment on is the fact we doubled the size of the company, took the growth rate from 2% to 9%, Fiorina said. We tripled the rate of innovation to 11 patents a day and went from lagging behind to leading in every product category. We grew jobs here in the U.S. and all over the world. Thats not exactly true. As I documented in a2010 story examining Fiorinas business career, Hewlett-Packard did indeed grow under her leadership. But that was mostly because she acquired other businesses at a breathtaking rate, not because she grew jobs from scratch. In fact, she was also responsible for laying off an estimated 33,000 American workers, and was well known for her enthusiastic deportation of their jobs, which she described with the cringe-inducing phrase right shoring. In 2004, she told Congress, There is no job that is Americas God-given right anymore. She will also undoubtedly have to deal with questions about her companys dealings with Iran. When she ran Hewlett-Packard, the company was able to skirt a U.S. trade embargo against Iran by selling products through an intermediary. Strictly speaking, HP broke no laws, but the company certainly violated the spirit of the embargo and has since amended its practice. As polished as she is from her years in the corporate spotlight, Fiorina has fumbled in her previous forays into politics. In 2008, as a surrogate for Republican presidential nominee John McCain, she got into trouble when she suggested that neither the senator nor his running mate, Palin, was capable of running a corporation. The McCain campaign yanked her from public view. Two years later, in 2010, she ran against Democratic U.S. Sen. Barbara Boxerand lost by a whopping 10 points. Many political observers described Boxer as a vulnerable incumbent, but given Californias demographics, lopsided voter registration rolls and Boxers financial advantage, I think people were trying to make an uncompetitive race sound more interesting that it actually was. Fiorina never really stood a chance. Sort of like now. In the end, it probably doesnt matter how Fiorina spins her career, since her campaign  like that of former neurosurgeon Ben Carson  is probably more strategic than serious. She has spent far more of her time attacking presumed Democratic nominee Clinton than trying to differentiate herself from her numerous Republican opponents. This lends credence to the theory that her most important role in the 2016 campaign will be as a Clinton antagonist, helping inoculate her male counterparts against charges of sexism. Her CEOs self-assurance, always on abundant display, has already come in handy. Unlike Hillary Clinton, she said last weekend, I am not afraid to answer questions about my track record or my accomplishments or my principles. That may be. But the problem for Fiorina is that she isnt running against Hillary Clinton. And in all probability, she never will. Twitter: @AbcarianLAT, robin.abcarian@latimes.com]", "Date": "20150512", "Title": "[Carly Fiorina's imaginary race against Hillary Clinton ]", "Link": "http://www.latimes.com/local/abcarian/la-me-ra-carly-fiorina-against-hillary-20150512-column.html\n", "Author": "NULL"}
