{"Content": "[Los Angeles County officials and business leaders rose to the defense of a Japanese company Monday that has all but given up plans to build a $60-million manufacturing facility in the Antelope Valley because of a dispute with local labor leaders. UPDATE:Japanese firm is ready to scrap plans for Palmdale rail-car factory, Two years ago, Osaka-based Kinkisharyo International won an $890-million contract to build 175 light-rail cars for the Metropolitan Transportation Authority. Most of the parts will be built in Japan, but the firm agreed to perform final assembly, including painting and wiring the cars, in Los Angeles County. It has been doing that from a temporary facility in Palmdale. Kinkisharyo leaders said they hoped to build a permanent plant that would allow them to also move some heavy rail car manufacturing from Japan to the United States. The 60-acre Palmdale site that Kinkisharyo chose, however, came under fire this summer when local activistsincluding members of the International Brotherhood of Electrical Workers Local 11presented the city with a 588-page appeal claiming violations of state environmental law. The document says the factory has not secured proper water rights, and that construction could kick up spores that carry Valley fever. At a news conference Monday, Los Angeles County Supervisor Michael D. Antonovich, a Metro board member,accused labor leaders of greenmail tacticsusing the environmental law as leverage to convince Kinkisharyo to promise that its workforce would be unionized. Kinkisharyo recently refused a request for a card check agreement, in which a company agrees to recognize a union if a majority of workers sign cards asking for one. The optional process is favored by labor leaders because it avoids the riskier alternative, holding an election on the factory floor. We offer good salaries and good benefits, and weve never had a labor issue, Donald Boss, Kinkisharyos general manager of program management, told The Times. If our employees want to organize, they can. But we arent going to organize for them. The appeal has already delayed the factorys construction by four months and has cost Kinkisharyo at least $2 million, Boss said. He added that Metros ambitious schedule for the rail car deliveryan average of four new vehicles a monthleaves little room for delay. All final assembly of the Metro cars will stay in Palmdale, and the 134 people who have been hired will keep their jobs, Boss said. But the heavy manufacturing work will probably leave California. The company is touring factories in Arizona, Arkansas, Nevada, Texas, Idaho and Oregon. People need to know what these scorched-earth politics are really going to bring, said Carol Schatz, the president of the Central City Assn. of Los Angeles. Elected officials urged Gov. Jerry Brown to convince the law firm that authored the environmental appeal to withdraw it and let construction on the factory begin. IBEWs goal is to chase this plant and these jobs out of California, said Gary Toebben, the president and chief executive of the Los Angeles Area Chamber of Commerce. He said losing the plant would give the state a scarlet letter and signal to investors that doing business in California isnt worth it. The IBEW did not return requests for comment. Maria Elena Durazo, who heads the Los Angeles County Federation of Labor, the regions largest union voice, said in an interview that Kinkisharyo will violate its contract with Metro if it takes any jobs out of state. She added that the firm has done nothing but treat [labor] as if we were outsiders. Theyre behind schedule, and now theyre going to use this as an excuse to not deliver on what they were supposed to do, Durazo said. Anything else they mention is a distraction of the fundamental issue. In a statement, Madeline Janis, the director of a coalition of labor and community groups, said public officials ought to hold Kinkisharyo to its obligations to taxpayers, rather than blaming labor unions. Metros deputy executive officer for procurement, Victor Ramirez, said the first car, a test model, was delivered a week ahead of schedule and that Kinkisharyo is in full compliance with their contract. Palmdale Mayor James C. Ledford Jr. said he hoped the new factory could become a permanent source of skilled labor for Kinkisharyo after the Metro contract ends. Metro has struggled for years to acquire enough rail cars for the countys rapidly growing transit network. A $300-million deal with the Italian firm AnsaldoBreda to build 100 light-rail vehicles fell apart in late 2009, putting Metro more than two years behind its original schedule. The agency needs a major shipment of new vehicles for two new light-rail routes to Santa Monica and Azusa, which are scheduled to open in 2016. For more Los Angeles transportation news, follow@laura_nelsonon Twitter.]", "Date": "20141020", "Title": "[Business leaders say labor is pushing rail car plant from L.A. County]", "Link": "http://www.latimes.com/local/lanow/la-me-ln-palmdale-plant-union-dispute-20141020-story.html\n", "Author": "[Laura J. Nelson]"}
