{"Content": "[Organized labor suffered an embarrassing loss in California last month when a defiant Democrat it had targeted for years easily won a state Senate seat over a union-preferred candidate. So it reveled in Fridays victory over President Obama on a trade measure that inspired a battle for the votes of Democratic House members. The trade fight was an epic intraparty mudfest. Unions, the partys biggest source of pavement-pounders and money, barraged undecided House members with phone calls, ads and protests. Obama gathered local television newscasters to the White House to praise the members he hoped would side with him and traveled to Capitol Hill for some last-minute, and ultimately unsuccessful, arm-twisting. The ferocity was still being felt post-vote by the few California Democrats who thwarted labor amid clear threats of retribution. \"Its disappointing that we had a few members vote in a way that we would say was against the interests of working people in California,\" said Steve Smith of the state labor federation. \"And this is something were going to remember.\", Retaliation is always difficult to game out, but in California it would come with a twist: The members labor is angriest at are Democrats who barely won their seats against strong Republican challenges. Damaging a candidate who disagreed on one issue  even a big one  runs a real risk of turning a seat over to a party labor disagrees with almost all the time. In theory, labor could back candidacies by competing Democrats, but theyd have to run against incumbents who have spent years building fundraising networks and potentially alienate fellow Democrats for whom the trade bill is not the most important marker. The tough decisions ahead will come at a dicey time for unions. Historically their fights have been waged with Republicans, but in recent years Democrats have taken them on as well. In Los Angeles, former Mayor Antonio Villaraigosa earned enmity with his budget proposals; current Mayor Eric Garcetti won election in 2013 by slaying his opponent for her ties to a public employee union. A statewide Field Poll taken at the end of 2013 found labors popularity slumping, with 45% of Californians saying unions were a force for harm more than good, to 40% defending them. More trouble lies ahead: Unions anticipate a 2016 ballot measure that would give decision-making power on new employee pensions to voters, not the elected officials who have remained more loyal to labor than have rank-and-file residents. The fight between labor and Obama was in one way lopsided. Trade rarely inspires rapt supporters; those who care about it are more apt to be those threatened by labor agreements, like the North American Free Trade Agreement of the 1990s. It is blamed by unions today for the loss of almost 90,000 California jobs. Echoing the argument made then, Obama insisted that new and better-paying jobs would follow if he was given authority to craft a Pacific Rim trade deal. California, he said, would see its exports skyrocket and its ports grow flush with business. But his partys leaders did not fall into line. State Democratic Party Chairman John Burton said the notion of the treaty \"stinks to high heaven.\" Atty. Gen. Kamala D. Harris asked supporters to add their names to a list of those objecting to \"a reckless rubber stamp\" for Obama  a list that she presumably can use for her U.S. Senate campaign. In the end, only seven California Democrats out of 32 in the House agreed to a preliminary vote that was part of the trade deal. Only five  Reps. Ami Bera of the Sacramento suburbs, Scott Peters and Susan Davis of San Diego, Jim Costa of the Central Valley and the Central Coasts Sam Farr  voted to give the president swift authority to make a trade deal. The first one failed and the second one passed, and the House will take the matter up again this week. The members of Congress who flouted labors wishes said they were voting their districts needs. \"I came to Congress to put people before politics,\" Bera said in a statement, adding that the trade act will include labor and environmental protections \"not seen in any previous trade authority bills.\", Peters emphasized that Fridays votes were on procedural matters, not on a treaty itself. \"Our biotech and hi-tech companies depend on exporting their goods, and as a port city, San Diego depends on access to foreign markets,\" his statement said. \"But trade only works if we set the rules. If we dont step up, someone else like China will.\", Both men won narrowly in 2014 and are targeted by Republicans in 2016. Now Democrats will have to decide whether to aim at them as well. Smith, the labor federation spokesman, said unions understand that they need to persuade Californians about their heft on issues like minimum wage increases and sick-day pay that accrue to \"millions of people across the state.\", And at the same time, labor wants to remind politicians that they need to toe the line. \"Look, were again pleased that the vast majority of congressional Democrats did the right thing today,\" Smith said, just after Fridays vote. \"Well worry about the others later.\", On Twitter: @cathleendecker]", "Date": "20150614", "Title": "[Labor ponders how hard to punish Democrats who back trade measures ]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-politics-20150614-story.html\n", "Author": "[Cathleen Decker]"}
