{"Content": "[I spent part of August on vacation in Canada, only to find myself on what was once called a busmans holiday: Canadians are in the throes of a national election campaign, just like us. And, just like us, theyre grouchy about the state of their democracy. They say their campaign goes on too long  \"a marathon,\" one broadcaster complained. They fret that its awash in money. By election day, candidates, parties and political action committees will spend the equivalent of more than $40 million U.S. And they worry that the democratic process has turned angry and uncivil. At one campaign event, a supporter of the incumbent prime minister, the conservative Stephen Harper, told the assembled media that they were \"lying pieces of [ordure].\", Canadians dont know how lucky they are. Their \"marathon\" lasts less than three months; ours takes almost two years. Their $40 million in campaign spending is dwarfed by the $7 billion we spent in 2012, and well spend more than that in 2016. Canadians do have one complaint that we cant share. \"Canadian politics is so boring,\" my friend Susan told me over lunch in a Toronto restaurant. \"Yours is much more entertaining.\", On Aug. 6, when Canadas party leaders debated on television, Susan and her husband skipped it  and watched Fox News Republican debate instead. \"What a show!\" she said. For an American, Canadas way of politics is like a reverse fun-house mirror: A glimpse of how our democracy might look if it were normal, without the grotesque distortions of reality show personalities and unlimited donations. The issues are big, the stakes are high, and the outcome matters for Americans too. Harper is running for the fourth time after nine years in office. (No term limits!) But Harper, who cruised to reelection in 2011 after steering Canada through the Great Recession, is facing stiff head winds this time. He made Albertas tar-sands oil his favored engine of economic growth, but oil prices have collapsed, sending Canada into a modest recession. Hes got a political scandal on his hands too. His chief of staff secretly reimbursed the government for $90,000 in illegal expenses racked up by a conservative senator, raising the question of what the prime minister knew and when he knew it. Harpers toughest challenger was supposed to be Justin Trudeau, the leader of Canadas Liberal Party, which is actually the countrys centrist party. Trudeau, the glamour boy of Canadian politics, is the son of Pierre Elliott Trudeau, who reigned as prime minister for most of the 16 years from 1968 to 1984. The younger Trudeau is 43 but looks about 35. The good news: A poll found that hes the candidate Canadians would most enjoy going on vacation with. The bad news: The same poll found that voters would rather hire Harper to run a large enterprise. Instead, the surprise front-runner is the leader of Canadas leftish third party, the New Democrats. Tom Mulcairs campaign has boiled down to two arguments: Its time for a change, and the NDP is the only party that can credibly deliver that. At the same time, Mulcair has worked to dispel his partys image as a bunch of free-spending socialists, promising to balance the federal budget in his first year. If Mulcair becomes prime minister after the Oct. 19 election, heres what that would mean for Canada-U.S. relations: Mulcair says hes opposed to the Keystone XL pipeline, which would carry tar-sands oil to refineries in Texas. If he canceled the project, that would remove Keystone from the U.S. presidential campaign  a relief for Hillary Rodham Clinton, who has refused to take a position on it. Mulcair would move Canada closer to the U.S. position on climate change; under Harper, Canada has increased its emissions of greenhouse gases. But Mulcair says hed withdraw Canadian forces from Iraq, where they have joined U.S. forces in the air war against Islamic State. More interesting than the candidates (for Americans, at least) is how Canadians run their democracy: Its so civilized its almost quaint. Canada has campaign finance laws that work: Each donor can give up to $1,500 to a political party and up to $1,500 to a candidate. There are also independent committees, like our \"super PACs\"  but unlike ours, which can spend an unlimited amount, the Canadian groups must keep to a pitiful $206,000 in advertising expenditures. Another difference: Once a Canadian election is over, the parliamentary system normally guarantees the winner a chance to enact his or her program  since the winner usually has a working majority in Parliament. Divided government and gridlock arent built into the system. As columnist Terry Glavin wrote in Torontos conservative National Post this month: \"All of this makes for the dullest, most boring sort of country, comparatively and politically speaking. And we would be wise not to want it any other way.\", Theres a lesson here for Americans: Democracy comes in different shapes and sizes. Canadians have shown that free speech can flourish under strict limits on campaign spending  and Harper, whatever his shortcomings, has proved that conservatives can win under spending limits too. Our version of democracy may be more entertaining. But thats hardly cause for pride. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus, Follow the Opinion section on Twitter@latimesopinion and Facebook]", "Date": "20150830", "Title": "[The hip dullness of Canada's politics]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0830-mcmanus-canadian-election-20150830-column.html\n", "Author": "NULL"}
