{"Content": "[In the two weeks since he launched his 2018 gubernatorial bid, Democratic Lt. Gov. Gavin Newsom has raised nearly $727,000 for the contest, according to a financial disclosure statement filed with the California secretary of states office. Prominent Democratic donors were among those who contributed, including Salesforce.com founder Marc Benioff, Yahoo Chief Executive Marissa Mayer and Esprit clothing company cofounder Susie Tompkins Buell. Newsoms early launch for a primary election that is still more than three years away was seen as a shot across the bow of other candidates eyeing the race. Gov. Jerry Brown will be termed out of office in 2018. Depending on the field of candidates, the gubernatorial contest has the potential to cost tens of millions of dollars or more. The last time the governors seat was open, in 2010, the race cost more than $200 million, most of it from billionaire former EBay Chairwoman Meg Whitmans personal bank account in an unsuccessful effort. Newsoms fundraising committee allows donors to contribute up to $56,400 each. The former San Francisco mayor also has $3 million left in his 2014 reelection account that he can use. In an interview this month, Newsom said his early start was not intended to scare other candidates out of the race. He noted the potential of a candidate rich enough to fund his or her own campaign and the unlimited spending ability of \"super PACs.\", If youre going to be serious about this and approach it seriously and methodically, at leastI concluded from my vantage point that this is best approached now as opposed to later, he said. Other Democrats who may run for governor include former Los Angeles Mayor Antonio Villaraigosa and billionaire former hedge-fund manager Tom Steyer, both of whom recently took a pass on the 2016 U.S. Senate contest to replace Barbara Boxer. Steyer easily has the wealth to fund his own campaign. Follow@LATSeemafor political news. ]", "Date": "20150227", "Title": "[Gavin Newsom banks more than $700,000 for 2018 gubernatorial bid]", "Link": "http://www.latimes.com/local/political/la-me-pc-newsom-banks-more-than-700000-for-2018-gubernatorial-bid-20150227-story.html", "Author": "[Seema Mehta]"}