{"Content": "[Fox News and CNN plan to use an average of recent polls to pick the candidates for the first two Republican presidential debates, with the top 10 making the cut for the main event. TV producers and Republican Party officials agree that having a dozen or more candidates crowded onto a debate stage would make for bad television and a fairly unenlightening discussion. Candidates would get only a few minutes each to respond to one or two questions. Republican officials have shied away from setting criteria about which candidates to invite. So, the networks hosting the debates apparently will take on the unpopular task of telling some number of ambitious politicians that they cant reap the benefit of exposure on the national debate stage. Fox is the first up. The network is scheduled to host a debate from Cleveland in mid-August. According to a statement by the network, first reported by the Washington Post, participation in the debate will be determined by an average of the five most recent nationwide public polls. \"We support and respect the decision Fox has made, which will match the greatest number of candidates we have ever had on a debate stage,\" saidRepublican National Committee Chairman Reince Priebus. Later in the day, CNN, which is scheduled to host a debate in September at the Ronald Reagan Presidential Library in Simi Valley, released its criteria, which added another twist. Its debate will have two segments: a main forum amongthe 10 candidates with the highest average poll ratings, and an earlier session with second-tier candidates. Neither approach is quite as straightforward as it might seem. With candidates bunched close together, polling averages easily can produce different results, depending on which surveys are counted. Moreover, not all polls include the same list of candidates. Some recent ones, for example, have included Donald Trump among the options. After Fox released its statement, a spokesperson added a caveat: If a couple of candidates are tied in the polls, the number on stage could go higher than 10. CNN spelled out an elaborate tie-breaker procedure to avoid that situation in its debate, employing the most recent polls to determine the winner or, if that fails, turning to polls of the four earliest voting states -- Iowa, New Hampshire, Nevada and South Carolina. If the criteria were applied today, the candidates for the first debate would probably be Jeb Bush, Marco Rubio, Scott Walker, Rand Paul, Ted Cruz, Mike Huckabee, Ben Carson, Chris Christie, Rick Perry and John Kasich. That would leave out the only woman in the field, Carly Fiorina, a result that many Republican officials have hoped to avoid. Former Sen. Rick Santorum of Pennsylvania, who won Iowas caucus voting in 2012, but who has drawn much less support so far this year, would also not make the cut. Nor would Louisiana Gov. Bobby Jindal. Fiorinas \"super PAC\" issued a statement late Wednesday saying it was \"confident that Carlys growing momentum and support will meet and exceed\" the debate criteria. But since only a few percentage points separate the bottom several candidates on the list, the lineup could easily change by August. For more on politics and policy, follow@DavidLauter on Twitter. 5:20 p.m.: This story was updated with a statement from Carly Fiorinas super-PAC. 4:54 p.m.: This story was updated with information about the CNN debate. 3:51 p.m.: Thestory was updated with additional information about how Fox would handle the situation if candidates were tied in polling. The story was first published at 3:08 p.m.]", "Date": "20150520", "Title": "[Fox, CNN to pick top 10 in polls for GOP presidential debates]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-gop-debate-20150520-story.html\n", "Author": "[David Lauter]"}
