{"Content": "[I keep thinking were done with George Pataki  but like an order of bad clams, he keeps coming back up on me. The three-term Republican governor of a famously blue state seems like a serious 2016 presidential contender on paper  until you read the fine print. Pataki had a promising start as New York governor. He beat Democratic icon Mario Cuomo in 1994. He cut income taxes 25% and trimmed others as well. In his first two years in office, spending went down 2.5%. If you had stopped the Pataki show there, everything would be great. Similarly, if Napoleon had quit before invading Russia, hed be remembered very differently too. Its a journalistic cliche to say that when a Republican lurches left hes \"growing in office.\" Woodrow Wilson once said that every politician either grows or swells when he enters office. Pataki did both and for so long, conservatives felt he should have come with a Viagra-like warning label: If this apostasy lasts for more than one campaign, consult a physician. In advance of his 1998 reelection bid, he asked the state legislature to increase spending 8%. He flip-flopped on ending rent control in New York City, on blocking the state takeover of Long Island Lighting Co. and on sending his kids to public school. The defenestration of his principles was so spectacular, even the editors of the New York Times were impressed. They endorsed him for reelection in 1998, praising his \"inclusive and progressive attitude.\" The Cato Institutes fiscal report card dubbed Pataki a \"liberal big spender.\", \"Pataki-land has become a place that sells out on everything,\" George Marlin, a Pataki appointee to the Port Authority of New York and New Jersey, told National Reviews John Miller in 2005. \"The governor is going to leave the Republican Party intellectually bankrupt and the state fiscally bankrupt.\", When Pataki finally left office, New York Post state editor Fred Dicker wrote that \"Pataki broke virtually every political promise he ever made.\" He also noted how incredibly lazy Pataki was. According to friends, Pataki worked about 15 hours a week. \"He held no more than three Cabinet meetings during his entire 12 years in office,\" Dicker wrote. It would be normal for a three-term governor to downplay his last two years as a lame duck in office. Pataki plays the movie backward. The first two years are all he talks about, as if the final 10 never happened. Thats why his populist shtick rings so false. In his announcement speech last week, he said that if elected president, \"The first thing I would do is ban members of Congress from ever lobbying. If you serve one day, you are banned, go home.\" That sounds great, though how a president has the power to do anything of the sort is beyond me. He barked at Washington politicians, \"From now on, you will live under the same rules and laws we do  no special rules for the powerful.\" Again great stuff, but a bit hard to take from the guy who vowed to sell off New York states fleet of planes and then, once elected, used them as his private airline. I am trying hard not rule out anyone in the GOP field prematurely. So far, only Donald Trump has been too heavy a lift. Trump sees the presidential race as self-marketing opportunity, a way to extend his run as a reality TV star. Hes a more plausible candidate than, say, Honey Boo Boo, but thats mostly because of constitutional age limits. Pataki vexes me for similar reasons. The pro-choice, liberal Republican has virtually no chance of getting the nomination. But lots of people run as vanity projects. I wish they wouldnt, but itd be unfair to single Pataki out for it. But most vanity candidates also tend to run to promote their core convictions. For instance, many believe South Carolina Sen. Lindsey Graham is running so he can debate foreign policy. Pataki is flipping that on its head too. Hes pretending to have core convictions just so he can run for the sake of running. jgoldberg@latimescolumnists.com, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150602", "Title": "[ The false populism of George Pataki]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0602-goldberg-pataki-2016-20150602-column.html\n", "Author": "NULL"}
