{"Content": "[Calling Tuesdays election a defining political moment, Rep. Cory Gardner swept to victory in a closely watched race, ousting Democratic Sen. Mark Udall and becoming the first Republican Colorado has sent to the Senate in more than a decade. \"The people of Colorado, voters around this state, had their voices heard. They are not red, they are not blue, but they are crystal clear. Crystal clear in their message to Washington, D.C.: Get your job done and get the heck out of the way,\" Gardner said, flanked onstage in a packed Denver hotel ballroom by a host of local Republicans who also claimed victory. Gardner won after a furious campaign that drew a blizzard of money from candidates, parties and deep-pocketed outside groups. \"Colorado indeed became the fulcrum in the balance of power,\" he said to roaring applause. \"Tonight we commit ourselves to building a government we can be proud of again.\", Not since 2002 has a Colorado Republican won a U.S. Senate seat or the governors mansion. Moreover, not since 1978 had an incumbent senator lost reelection in the state. The governors race remained too close to call late Tuesday. With nearly 87% of precincts reporting, Gov. John Hickenlooper narrowly trailed, with 47.6% to Republican Bob Beauprezs 48.0%. The Senate race had featured Democrats argument that Republicans were waging war on women with their views on contraception, abortion rights and personhood. Gardner blunted the assault by reversing his views on personhood measures  which hold that human rights begin at conception  and calling for dispensing birth control pills over the counter. In an effort to appeal to women voters from all-important Jefferson and Arapahoe counties -- which often tilt statewide elections here -- Udall pushed the reproductive rights issues so hard that he lost endorsements and drew criticism from some supporters for banking on a single issue in the campaign. The Denver Post dubbed him \"Mark Uterus.\" , Tuesdays results were a clear rebuke of Udalls message. Like other Republicans across the country, Gardner assailed the Democrat as an ally of President Obama, whose popularity has fallen here despite two successive Colorado victories in presidential years. For several months, polls had shown the Senate race mostly tied, though in the final weeks Gardner began to pull ahead. He stayed on message while Udall teetered in the waning days from a focusing on reproductive rights to urging Latinos and young voters to support his candidacy. Many political observers had thought the state was transforming from a purple toss-up to more blue, especially after Obama won the state in 2008 and 2012. But strong statewide discontent with Obama gave Colorado Republicans confidence. Udall, who was seeking a second term, grew emotional when thanking constituents for allowing him to serve as senator for the past six years. Invoking his late father, former Rep. Morris Udall of Arizona, Udall said its important in life to laugh and live life to the fullest. \"So that whenever you lose youre ahead. As long as Ive had the privilege to serve the people of Colorado, all of the times Ive come out ahead, tonight is no exception,\" Udall said. Gardner gave up a safe House seat in eastern Colorado to challenge Udall. He will join Republicans in taking control of the Senate. Marty Neilson, a Republican from Boulder County, attended the GOP gathering at a hotel in south Denver. \"Im jubilant. This is great for our country to have Republicans in control of Congress and leading in Colorado, because Im a Coloradan and Ive seen this state headed down the wrong path these years,\" Neilson said. As for the governors race, contentious battles over gun control in 2013 and renewable energy gave Republicans ammunition to attack Hickenlooper and Democrats as overplaying their hand. The governor touted his work in lowering Colorados jobless rate, as well as the job his administration did helping open dozens of roads after last years epic flooding. We made a lot of tough decisions in these past few years and Im proud of the work weve done, Hickenlooper said Tuesday. Twitter: @kurtisalee, 10:44 p.m.: This post was updated throughout. 8:48 p.m.: This post was updated with vote totals and with the last time that a U.S. senator lost reelection in Colorado. 8:13 p.m.: This post was updated with details. This post was first published at 7:26 p.m.]", "Date": "20141104", "Title": "[Colorado Senate: Republican Cory Gardner defeats incumbent Udall]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-colorado-20141104-story.html", "Author": "[Kurtis Lee]"}