{"Content": "[After months of failed negotiations, Los Angeles city officials on Friday struck a tentative agreement with the union representing the citys police officers, sources close to the deal said. The agreement would grant raises in the last three years of a four-year contract, the sources said. In July 2016, officers would see a 4% pay increase, followed by 2% increases in 2017 and 2018. It would also increase officers healthcare subsidies. The full details of the proposed contract were not available Friday morning. While the deal brings L.A. Mayor Eric Garcetti a step closer to ending a contentious stalemate with one of the citys influential public labor forces, it must still be ratified by a majority of the Los Angeles Police Departments roughly 9,900 rank-and-file officers, as well as the City Council. In a joint statement, Garcetti, Council President Herb Wesson and the police unions president, Craig Lally, called the agreement a fair and responsible contract that would enable the city to continue to recruit and retain the very best police officers.\", In the statement, Lally said the proposed contract includes a number of terms that reconcile the impasse and is a positive outcome for both the city and the officers who protect it. Union officials turned immediately to the next task of getting members to approve the deal. In a message to officers sent moments after the deal was struck, union leaders said: This has no doubt been a long time coming and we appreciate your patience as weve worked through this process. ... We are confident that if the terms agreed upon are ratified by our membership, it will boost internal morale and go a long way in the retention and recruitment of LAPD officers. Next Thursday, the union will hold the first of four meetings at which officers can cast their ballots on whether to accept the deal. The proposed pay increases are modest by the standards of past public-safety contracts, but could be crucial to securing the support of the unions rank-and-file. Officers voted to reject a previous deal negotiators hammered out in July, in large part because it included no increases in pay except to a slice of officers who were working at a lower salary than others. Emboldened by their members stance, Police Protective League officials returned to the negotiating table insisting that any new offer include a pay hike. That position left little room to negotiate as Garcetti and other city officials said the city could not afford raises as it struggled to close a long-running budget deficit by 2018. A contract last year with the powerful union that represents city Department of Water and Power workers included no pay increases. Throughout the talks, league officials have argued that the mayor should treat police officers differently from other city workers when it came to raises. They drew attention to what they said were stark disparities in pay between LAPD officers and those working for smaller, often safer departments in the region. We want to be first, Officer Peter Repovich, who serves on the unions board, told City Council members in July, in arguing LAPD officers should be paid more than other officers. Were No. 1 and we deserve it. After trading proposals, counter-proposals, and some testy barbs, union officials in September declared contract talks had failed and called for an outside mediator to try to broker a deal. At the time, the two sides were far from a deal. League officials wanted raises over three years totaling 8%, while the city was offering a two-year deal with no pay increase until a 2% hike on the last day of the contract. Tyler Izen, then-league president, dismissed the citys proposal as insulting. Fridays handshake came after three days of mediation. If officers vote again to turn down the proposal, the two sides could opt to return to the negotiating table. Ultimately, the City Council can elect to impose a one-year deal on the union. Despite holding the purse strings, city officials had to contend with some disadvantages when negotiating. Since the start of July, when a three-year contract between the league and city expired, a clause in that agreement has allowed officers to once again be paid cash for overtime work. The return of overtime funds, which were all but eliminated from the LAPDs budget several years ago as part of the citys cost-cutting measures, can increase officers pay substantially, making it easier for them to dig in their heels in the contract dispute. And faced with a worrisome drop in the number of people applying to join the LAPD and heightened discontent among young officers, city officials opted to increase pay for new officers and several hundred others hired in recent years at a reduced salary. Under the proposed contract, the city will continue to pay overtime, which marks a significant change from previous years in which LAPD officers racked up hundreds of thousands of overtime hours, only to have payment postponed years into the future. Deferred overtime hours must be paid when an officer retires, typically at a much higher salary. Budget officials had grown increasingly concerned about the looming cost of the unpaid overtime, which has ballooned from around $27 million in 2007 to $122 million this year. City Administrative Officer Miguel Santana had called on the City Council to move away from its reliance on unpaid overtime, comparing the practice to spending on a credit card. A return to a pay-as-you-go approach would also be welcomed by LAPD brass, who have forced hundreds of officers to take time off each month in an effort to rein in the growth of unpaid overtime. For more news on the city and LAPD, follow@petejamisonand@joelrubin on Twitter. 11:26 a.m.: This article was updated to include a joint statement by the L.A. mayor, City Council president and president of the police union, as well as quotes from the Police Protective League to its members. The first version of this article was published at 10:59 a.m.]", "Date": "20150306", "Title": "[L.A. reaches tentative contract agreement with police union]", "Link": "http://www.latimes.com/local/lanow/la-me-ln-police-union-contract-20150306-story.html\n", "Author": "[Joel Rubin, Peter Jamison]"}
