{"Content": "[The email came with a simple subject line: Our Flag. \"Well, you finally did something that I dont agree with,\" wroteGlenn Langford, a constituentof then-Florida Gov. Jeb Bush in February 2001. \"My Southern-Florida heritage is important to me.\", Langfords correspondence was one of many that arrived shortly after Bush decided to take down the Confederate flag from its perch outside the west entrance of the state Capitol in Tallahassee. It had flown there since 1978. The debate over the Confederate flag, to some a symbol of racial hatred and to others a prided symbol of the South, has again come to the forefront after the shooting of nine black parishioners at a historic church in Charleston, S.C. It has forced the 2016 GOP presidential field to address questions on both race and states rights at a time when the party is grappling with how to become more inclusive of minority voters. In a show of solidarity, many GOP presidential candidates have lauded the decision by Republican South Carolina Gov. Nikki Haley to call for the Confederate flag to betaken downfrom a monument outside the state Capitol. For two GOP candidates, Bush and Florida Sen. Marco Rubio, the issue is one that theyve had to deal with first hand. Bush decided in 2001 -- with little public discussion -- that it was time to retire the Confederate flag. \"Regardless of our views about the symbolism of the ... flags -- and people of goodwill can disagree on the subject -- the governor believes that most Floridians would agree that the symbols of Floridas past should not be displayed in a manner that may divide Floridians today,\" said Bushs spokeswoman at the time. His decision followed the bitter 2000 presidential election between his brother George W. Bush and Al Gore, which hinged on Floridas 25 electoral votes. Some blacks felt marginalized by the disputed election and complained that their votes were not accurately tallied for Gore. In 1999, Bush upset many blacks and Latinos by signing an executive order that barred state schools from using racial preference in determining admission. \"Minority voters -- in particular black voters -- were upset,\" said Susan MacManus, a political science professor at University of South Florida in Tampa. \"That came more from Bushs actions on affirmative action. No one was really raising a big issue about the flag at the time.\", Compared with other Southern governors, Bush was on the cutting edge of the issue, MacManus noted. The debate is now underway in the Tampa area, where a massive Confederate flag flies along Interstate 75 at a memorial. Tampas mayor said it needs to be taken down. Neither Bush nor Rubio have spoken publicly on the issue. In 2001, Rubio, the son of Cuban immigrants, was a fresh-faced state lawmaker. He co-sponsored legislation in the weeks after Bushs decision, which stated that no \"historic flag commemorating or memorializing the American Revolutionary War, the War of 1812, the Mexican War, the Civil War ... displayed on public property of the state or any of its political subdivisions may be relocated, removed, disturbed or altered.\", The legislation, a rebuttal of sorts to Bushs decision, ultimately failed. ------------,  FOR THE RECORD June 25, 3:53 p.m.:An earlier version of this article attributed a quote from Ben Carson to Marco Rubio.  ------------, In comments this week, Rubio has said the issue of the flag is one for SouthCarolinians to decide. Ultimately the people of South Carolina will make the right decision for South Carolina, and I believe in their capacity to make that decision, he told reporters in Miami last week. When asked, Bush has been slightly more direct, alluding to his decisionin Florida, where the flag is now in\"a museum where it belonged.\", MacManus said that in Florida -- outside of the I-75 dispute -- the controversy is largely settled, adding that it will have little bearing in next years GOP primary in the state. \"But its most certainlygoing to come up and [Bush and Rubio] will have to discuss it in the coming months, especially with the importance of South Carolina as an early voting state,\" she said. Follow @kurtisalee on Twitter for political news.]", "Date": "20150625", "Title": "[Jeb Bush, Marco Rubio are no strangers to Confederate flag debate]", "Link": "http://www.latimes.com/nation/politics/la-na-bush-rubio-florida-confederate-flag-20150624-story.html\n", "Author": "[Kurtis Lee]"}
