{"Content": "[Hillary Rodham Clinton positioned herself as a crusader for voting rights Thursday, calling for an overhaul of election laws so that every citizen would automatically be registered to vote on their 18th birthday. In a speech at Texas Southern University in Houston, a historically black college, Clinton blistered Republicans, accusing them of \"systemically and deliberately\" seeking to disenfranchise voters throughout the nation with laws that make it harder to cast ballots. Calling out potential Republican rivals by name, she pointed to measures embraced by Govs. Scott Walker of Wisconsin and Chris Christie of New Jersey and former Govs. Rick Perry of Texas and Jeb Bush of Florida that she said had made voting more difficult in their states. \"Republicans are systematically and deliberately trying to stop millions of Americans from voting. What part of democracy are they afraid of?\" Clinton said. The GOP, she said, needs to \"start explaining why theyre so scared of letting citizens have their say.\", Although systems similar to Clintons proposal are widely used in other countries, they would face formidable obstacles in the U.S. particularly in a Republican-controlled Congress. Republicans have long warned that Democratic-sponsored measures to expand the voting rolls would invite fraud. \"Hillary Clintons rhetoric is misleading and divisive,\" said Orlando Watson, a Republican National Committee spokesman. \"In reality, the vast majority of Americans  including minority voters  support common-sense measures to prevent voter fraud.\", Even if the measures never become law, they serve an important political purpose for the former secretary of State turned presidential candidate. Around the country, Democrats have been pushing back against Republican-sponsored state laws that they say are aimed at restricting voters. Democrats have countered with litigation in conservative states and laws in states they control that seek to expand the voter rolls. The effort to expand voting rights is particularly popular among minority voters, especially African Americans, a crucial part of the Democratic electoral coalition. If Clinton becomes the Democratic nominee, she will need a large minority turnout to win several key swing states. Clintons plan for universal voter registration is modeled after a new law in Oregon that automatically adds residents to voting rolls when they get a drivers license, unless they opt out. A law that would implement such a system in California was approved by the state Assembly in late April. Every citizen in every state in the union, everyone, every young man or young woman, should be automatically registered to vote when they turn 18, unless they choose to opt out, Clinton said after receiving the Barbara Jordan Public-Private Leadership Award, named for the late civil rights leader and congresswoman. I think this would have a profound impact on our elections and our democracy, she said. While Clinton is taking little risk politically in calling for expanded voting rights, her spotlight on the issue is notable. Democrats have pushed similar proposals before, but were unable to muster enough support in Congress, even when they controlled both houses in 2008. Some moderates in the party joined with conservatives, warning that such a system would be vulnerable to fraud. Since then, however, the issue of voting rights has become a rallying point for the Democratic Party. Republican victories in 2010 were followed by a wave of new voter restrictions in red states. Feelings about the issue have grown more intense after a Supreme Court decision two years ago struck down a key provision of the Voting Rights Act that had required states with a historic pattern of restricting minorities from voting to get federal approval before making changes in their election laws. Clinton ticked off new laws in some of those states that have rolled back programs to encourage voting. She suggested the Supreme Court decision made them possible and vowed to nominate justices to the court who share her view on voting rights. We should be clearing the way for more people to vote, not putting up every roadblock anyone can imagine, Clinton said. In addition to the automatic registration proposal, Clinton also called for requiring every state to provide at least 20 days of early in-person voting, saying doing so would reduce long lines at the polls and allow people who have other obligations on election day to cast ballots. About of a third of the states do not offer any early voting. If families coming out of church on Sunday are inspired to go vote, they should be free to do just that, Clinton said. Voting law experts noted that universal registration would not be considered radical in most major democracies. It is the way most elections are run in other countries, said Rick Hasen, a law professor at UC Irvine. Everyone is automatically registered by the government. It is not so crazy, if you are outside the United States. But there is little bipartisan support for such a system here, where more than a quarter of people eligible to vote are not registered. While many Democrats see expanded voting as a moral issue, practical politics are involved, too: laws that make voting difficult tend to disproportionately affect groups that typically vote for Democrats, especially low-income Americans. Experts caution, however, that the impact of changes in voting laws can be hard to gauge. In some cases, new restrictions that appear targeted at suppressing minority turnout may have the opposite effect, galvanizing voters in protest. But looking at whether turnout goes up or down immediately after voting laws are made more restrictive misses the point, said Myrna Perez, who directs the voting rights and elections program at the Brennan Center for Justice at New York University Law School. \"Just because some people were upset and galvanized to go out to vote doesnt mean other people who would have voted were not blocked,\" she said. For more on the Clinton campaign, follow @EvanHalper. 3:22 p.m.: The story was updated with reaction from the Republican National Committee and comment from experts. The story was first published at 2:48 p.m.]", "Date": "20150604", "Title": "[Hillary Clinton attacks Republicans over voting restrictions]", "Link": "http://www.latimes.com/nation/la-na-clinton-voting-rights-20150604-story.html\n", "Author": "[Evan Halper]"}
