{"Content": "[The 2016 presidential contest descended upon Iowa on Saturday in a marathon bout of political speed-dating that did little to clarify the vast choices likely to face Republican voters over the next year. In 20-minute bursts of staccato flirting, more than half a dozen more-or-less top-tier Republican presidential possibilities paraded across a stage in a historic theater near downtown Des Moines, their appearances interspersed with those from Iowa elected officials. The blandishments  over more than nine hours and from a cast that ranged from serious contenders to Sarah Palin and Donald Trump  came about a year before Iowans will cast the first votes on the road to the White House, a road that will take most candidates through nearly all of this states 99 counties. By the end Saturday night, two themes were evident: the persistent cleavages in the party as it seeks to unify control over Washington by seizing the White House in 2016, and the gravitational pull to the right that will tempt or torment all top candidates in this state, which includes loud ranks of tea party and religious voters. The two themes coalesced with repeated criticism, both blunt and shaded, of the most prominent potential candidates not in attendance: Mitt Romney and Jeb Bush. Both are viewed with differing levels of suspicion for different reasons  Romney for his failure to win the race as the partys 2012 nominee, and Bush for his embrace of education standards and immigration changes that drew repeated rebukes from the stage. The sharpest criticism, which drew hoots of support from the audience, came from Trump, reprising his quadrennial will-he-or-wont-he-run high jinks. It cant be Mitt because Mitt ran and failed. You cant have Romney; he choked, said Trump, who endorsed Romney in 2012. And, he went on, You cant have Bush. The last thing we need is another Bush. Trump blamed Bushs brother, President George W. Bush, for being the man who gave us Obama, and he criticized the former Florida governors support for Common Core education standards and legal protection for immigrants in the country illegally. Remember his statement: They came for love, Trump said as he mocked a comment Jeb Bush made about immigrants entering the U.S. illegally. Half of them are criminals; theyre coming for love?, Trump was here as entertainment  few if any believe he would actually run  but the applause greeting his remarks suggested his sentiments were broadly shared. The Iowa gathering came on a busy weekend for a contest that has flared to life with Bushs announcement in December that he was considering running, and Romneys subsequent disclosure of his interest in a third presidential campaign. This weekend in Palm Springs, conservative donors are gathering for a regular meeting organized by billionaires Charles and David Koch; three prospective candidates  Sens. Ted Cruz of Texas, Rand Paul of Kentucky and Marco Rubio of Florida  are scheduled to appear. While joining in on criticism of Romney and Bush, the audience for the Iowa event, organized by the Citizens United political group and conservative U.S. Rep. Steve King of Iowa, saved its most vocal support for Cruz and Wisconsin Gov. Scott Walker. Tonally and in emphasis, they represent vastly different approaches. That alone portends clashes as GOP voters try to come to some agreement about what type of candidate they find most attractive. Walker, who won Republican loyalty for facing down public employee unions in his state, said he and some other governors had enacted common sense policies at the state level that provided a template for a national run. Enthusiastic but reasoned, he pointed to measures that protected gun rights, defunded Planned Parenthood, limited lawsuits and cut regulations on farms and small business. A roar arose when he noted that we require in our state, by law, a photo ID to vote. Thats the difference between the Wisconsin way and the Washington way, he said. Cruz, a first-term senator who was a major force in shutting down the government in his first months in office, was far more fiery as he repeatedly demanded what amounted to litmus tests on conservative issues. If a candidate says he opposes President Obamas executive actions on immigration policy, show me where you stood up and fought, he said. Conservatives need to send the locusts of the EPA back to Washington from the states, he said, and to abolish the IRS  a frequent target Saturday. There are 110,000 employees at the IRS, he joked. We need to padlock that building and put all of those 110,000 on our southern border. A third approach was forwarded by New Jersey Gov. Chris Christie, who Iowa political observers say has cultivated the state for years and built a team of supporters ready to jump in when he makes a presidential announcement. He spoke at length about his antiabortion views in what appeared to be an effort to blunt assertions that a blue-state governor was wiggly on a bedrock issue for conservative Iowa voters. He also noted the anxiety he found in Americans as he crossed the country before the 2014 election. He tied it to stagnant incomes that have left voters uneasy about the future. There is uncertainty in our country, and it is a product of the failure of leadership, he said. And that failure has happened at 1600 Pennsylvania Avenue. The event made evident the pressure on candidates to hew to the conservative line or, presumably, suffer when the caucuses come around. Party leaders have long sought to lower the volume on discussions that might further distance women, Latinos and young people from Republicans, a problem that haunted Romney and promises more trouble as those voter groups grow. But from the stage, there were multiple discussions of abortion. Carly Fiorina, the 2010 California Senate candidate who is pondering a run, castigated House Republicans for tripping last week when they sought a ban on abortions for pregnancies over 20 weeks. Rep. Kings presence meant that immigration was a certain topic; after last weeks State of the Union address, he had criticized the president for inviting someone King called a deportable to the event. Several people bearing signs emblazoned with the word stood during speeches by Christie and Texas Gov. Rick Perry and denounced the speakers association with King. The protesters were taken out of the theater by police. Before that, however, the tone had been set by the emcee, radio host Jan Mickelson, when he said that immigration would not be a big element of the campaign. But, he said, What we do care about is illegal gate-crashers. For political news and analysis, follow me on Twitter: @cathleendecker , 9:44 p.m.: This post has been updated throughout. This post was originally published at 6:30 p.m.]", "Date": "20150124", "Title": "[Cruz, Christie, Walker, other Republicans land in Iowa. But no Romney or Bush]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-iowa-republicans-20150124-story.html", "Author": "[Cathleen Decker]"}