{"Content": "[The entertainment empire Rupert Murdoch is turning over to his sons James and Lachlan will face far different challenges from the ones he encountered during the last 60 years. Murdochs media companies, 21st Century Fox and News Corp. were built on news, television and film. All three of those areas are confronting generational and technological changes that are upending traditional business models. Young people are increasingly getting their news and entertainment from the Internet and social media sites  and less from television channels and multiplex cinemas, which have seen persistent declines in viewership and attendance. The audience of one beachhead, Fox News Channel, is growing older, and the companys Los Angeles-based Fox broadcast network has struggled to find a new generation of hits beyond this years sensation Empire. Rupert Murdoch is reportedly preparing to step down as chief executive of 21st Century Fox and hand the role over to his youngest son, James. Rupert Murdoch is reportedly preparing to step down as chief executive of 21st Century Fox and hand the role over to his youngest son, James. The 84-year-old Murdoch plans to soon relinquish his title of chief executive of 21st Century Fox to his younger son, 42-year-old James Murdoch, according to people familiar with the changes who were not authorized to discuss them publicly. Older son Lachlan Murdoch, 43, also is expected to assume a larger corporate role by becoming executive co-chairman of the company, working with his father, who will maintain his title as executive chairman. Lachlan Murdoch is expected to work in partnership with his younger brother but fill a more strategic, big-picture role. This transfer of power to a younger generation should make Fox more sensitive to the needs of millennials and more responsive to changing consumer habits, said Needham & Co. media analyst Laura Martin. Wall Street is going to need to be shown that [the sons] deserve the seat, and that its not just because of their daddys name. Wall Street is going to be very suspicious at first, because theres not much of a track record there. Some analysts said the younger Murdochs might be best equipped to navigate the changes facing media today. Its time, said Jeffrey Cole, chief executive of the Center for the Digital Future at the USC Annenberg School. This move positions things so that the money-making part of the empire  Fox  is on a steady and forward path. But Rupert is not going anywhere. He seems to be entering the Don Corleone stage of his life after he turned the business over to Michael. James Murdoch has been rising through the ranks for more than a decade. In recent years, he has served as the No. 3 executive, co-chief operating officer, behind his father and longtime President and Chief Operating Officer Chase Carey. Carey, who is well regarded on Wall Street, is expected to step down from the organizational structure to take on an advisory role. Wall Street analysts on Thursday noted they would be sorry to see Carey leave Fox because he provided a steady hand through a challenging era for the company. The Murdochs have weathered a spin-off of the Wall Street Journal, New York Post and other newspaper holdings into a stand-alone company, News Corp. and the devastating British phone hacking scandal. Carey also was a forceful and welcome presence last summer when Fox abandoned its proposed takeover of rival Time Warner when Fox shareholders began selling shares. For James Murdoch, the proposed new structure firmly establishes him as the day-to-day leader of the company  no longer the apprentice to Carey. It significantly clarifies the question of management succession and corporate governance, Tuna Amobi, media analyst with S&P Capital IQ, said in an interview. Lachlan Murdoch is expected to spend much of his time at the companys West Coast headquarters in Los Angeles, while James Murdoch is expected to continue to be based in New York. The Murdoch sons will have to figure out how to best position the company for the digital age, a realm that Fox has struggled with  a notable example being the $580-million acquisition and later sale of Myspace. The companys cable networks  its largest source of profit  will have to find ways to remain relevant amid cord-cutting by younger consumers and pay-TV providers who want to trim their programming packages. Its going to be about their ability to produce high-quality, differentiated content that is going to determine how well they make it through this, said Cowen & Co. media analyst Doug Creutz. Its not going to be easy for anybody, but the guys who have good content are going to make it through. The proposed new structure, which concentrates power among three family members, is unusual in todays corporate world. It is almost unheard of for publicly traded companies. Theres not one clear leader, and thats a big challenge, Martin said. Ruperts going to be in charge of some things, Lachlans in charge of some things, and James is in charge of some things. Thats a huge challenge that almost no other big media company faces. Investors seemed unmoved by the news. Fox shares closed down just 6 cents, to $32.90. Theyre facing the same tough environment as are all the other media companies, Creutz said. I would say Fox is relatively on the better side because they do have a fair amount of good content. They have a very strong international footprint, which a lot of their peers dont have. Theyve got something to work with. The Murdochs and Carey, through a spokesperson, declined interview requests. The matter of succession is on the agenda at our upcoming, regularly scheduled board meeting, a Fox spokesman said in a statement. The board meeting is expected to be held next week. The Murdoch family controls 39% of the voting shares of Fox. Creutz, the Cowen & Co. analyst, noted that Foxs earnings this year havent met Wall Streets expectations, and that the company might have another downward revision. A CEO transition at the same time would give James a chance to start with expectations having been reset to a presumably low bar, he said. In addition, Careys contract that was signed a year ago was short-term in nature, which prompted speculation that Murdoch was preparing to hand over his media empire to his sons sooner rather than later. Should Mr. Carey elect to conclude the term of employment, he agrees to provide non-exclusive consulting services to 21st Century Fox through June 30, 2016, Careys contract says, according to a regulatory filing. Twitter:@MegJamesLAT; , Twitter: @rfaughnder, Times staff writer Richard Verrier contributed to this report. 5:56 p.m.: This article has been updated with new information throughout. 3:18 p.m. This article has been updated with closing stock information, 12:49 p.m.: This article has been updated with stock information. 8:33 a.m.: This article has been updated with background information on Murdoch succession planning and commentary from an analyst. The first version of this article was published at 7:48 a.m.]", "Date": "20150611", "Title": "[Rupert Murdoch's sons, taking charge of Fox media empire, will face new digital realities]", "Link": "http://www.latimes.com/business/la-et-ct-fox-shake-up-james-lachlan-rupert-murdoch-20150611-story.html", "Author": "[Meg James, Ryan Faughnder]"}