{"Content": "[Imagine three presidents. The first sold a moderate message to win a three-way race with 49% of the vote. The second sold a conservative one and won with just under 51% of the vote. And the third ran a liberal campaign and won with just over 51% of the vote. Of the three presidents, who had the broad campaign of wide appeal? And who had the narrow one of partisan mobilization?, If you know your politics, you know these campaigns. The first is Bill Clintons 1996 run, the second is George W. Bushs in 2004, and the third is Barack Obamas 2012 reelection bid. And of them, Obamas was the most successful: Not only did he win an outright majority, but he won the most votes  as a share of the total  in a presidential election since George H.W. Bush, and became the first Democratic president since Franklin Roosevelt to win two national majorities. Looking to 2016, Hillary Rodham Clinton wants to achieve what Obama did, and so shes running a version of his campaign, openly appealing to the groups that supported him. In the last two months, shes endorsed criminal justice reform, pushed expansive immigration reform and called for an overhaul of voting laws to improve access. But Washington pundits, and mainstream reporters, are disturbed. Hillary Rodham Clinton appears to be dispensing with the nationwide electoral strategy that won her husband two terms in the White House and brought white working-class voters and great stretches of what is now red-state America back to Democrats, wrote Jonathan Martin and Maggie Haberman of the New York Times. My problem with this approach, wrote Ron Fournier of National Journal, of Clintons strategy, is that it works only until election day, when a polarizing, opportunistic candidate assumes the presidency with no standing to convert campaign promises into results. Likewise, again in the New York Times, David Brooks bemoaned the Clinton approach as bad for the country. If Clinton decides to be just another unimaginative base-mobilizing politician, she will make our broken politics even worse, he argued. Each critique comes to the same place: Mobilizing individual groups, instead of using a broad message, will polarize the country, make it harder to win, and make it harder to govern. But this argument has a problem: reality. Despite his inclusive, centrist message, Bill Clinton never won a majority of the vote. And when he entered office in 1993, he faced a polarized Republican minority that blocked his core programs, from a small stimulus package to healthcare reform. At no point did this change; instead, Clinton abandoned liberal legislation and co-opted Republican ideas, softening them for Democrats. Arguably, Republicans never accepted Clintons presidency; its why a sex scandal culminated in the first impeachment proceedings since the 1860s. This same dynamic was at work in 2009, after Barack Obama won 53% of the vote with an inspirational campaign of post-partisan change. Despite his huge vote totals, Republicans refused to work with him, rejecting the stimulus package (and any negotiations over its substance), abstaining from the healthcare debate (and any negotiations over its substance), and openly pledging constant opposition. The single most important thing we want to achieve is for President Obama to be a one-term president, said Sen. Mitch McConnell, ahead of the midterm election in 2010. In 2011, after the GOP landslide, McConnell  and John A. Boehner in the House of Representatives  would try to make good on the promise, slowing Congress to a halt and forcing confrontations over routine measures, such as lifting the debt ceiling. Obama was only able to accomplish what he did in his first two years because of the large Democratic majorities in the House and Senate. Liberal mobilization, part of Obamas strategy, had worked. Indeed, it worked again in 2012 and 2013, when Democrats energized their voters, reelected Obama, elected a larger Senate majority, and made headway on appointments and executive branch actions the following year. Beyond the facts of this Democratic administration and the last one, the biggest blow to the argument over Hillary Clintons narrow campaign comes from public opinion. Since 2000, Americans have moved to the left on gay rights, immigration, climate change, and criminal justice  issues on which Clinton is allegedly polarizing the public. If Washington pundits cant see that, its because theyre looking in the wrong place. The rural and suburban whites who brought Bill Clinton to victory in 1992 and 1996 arent the center of American politics anymore. That belongs to the Latinos, African Americans, Asian Americans, single women, union members, young people and college students who gave Obama his victories. The electorate is younger and browner, and more liberal as a result. Put differently, Clinton is mobilizing the base, but shes also speaking to the center. It just looks different than it did. To insist otherwise, to describe this as narrow, is to delegitimize the Democratic majorities of 2008 and 2012 and suggest, openly, that a presidential candidate isnt broad unless he (or she) is focused on white Americans. Jamelle Bouie is a staff writer for Slate. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150613", "Title": "[The changing face of centrist campaigning]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0614-bouie-clinton-appeal-20150614-story.html", "Author": "NULL"}