{"Content": "[Finally, conservatives have a real socialist to go crazy about. Instead of concoctingdark fairytales about how Barack Obama, a very conventional liberal Democrat, is a secret Marxist who wants to destroy the American way of life, they can shriek about Bernie Sanders, the independent Vermont senator who has never shied away from the socialist label. Sanders is now the first person to challenge Hillary Rodham Clinton in the race to win the 2016 Democratic Party presidential nomination. Clinton, though, is not his real adversary, Sanders says. He refuses to make disparaging comments about Clinton and insists he has never run an attack ad in any campaign and will not do so against her. Sanders wants to take on the billionaires, not Hillary. Nobody gives the 73-year-old Sanders a chance of stopping the Clinton political juggernaut, but some think he could make it veer to the left. If the Vermonter gets traction in debates and primaries with his unabashedly progressive positions, Clinton might be forced to match at least some of his rhetoric. Would that be a bad thing for Democrats? Not if enough beleaguered middle class voters get a chance to consider what Sanders version of socialism entails and like what they see. Lets consider some of Sanders wild ideas:, Free college tuition. This is something that students can count on in many European countries and that once was not uncommon in the United States. In what many consider the most golden era of the Golden State, Californias great public university system was tuition-free. In many other states, students paid only a few hundred dollars per year to go to top state colleges. Now, of course, American students are graduating with crushing student loan debts while many others cannot afford to pay in the first place. Sanders idea seems radical only in that it makes radically good sense. A $1-trillion program to rebuild the nations roads and bridges. This would not only create thousands of jobs, it would finally address the countrys glaring infrastructure crisis that threatens freight mobility and interstate commerce. This sounds pretty pro-business  in a good way. Break up giant financial institutions. If they are too big to fail, they are too big to exist, Sanders says. Unless you enjoyed the economic crash of 2008, this probably sounds like a pretty reasonable idea. Publicly funded elections. Instead of seeing the spectacle of candidates for president and Congress taking turns begging for money at gatherings of billionaires and corporate lobbyists, public funding for campaigns might encourage politicians to pay attention to those of us who dont have the ability to buy influence in our government. This feels vaguely un-American only because it has been so long since money did not rule American politics. Higher taxes on the wealthy. Well, obviously, the schemes Sanders wants to enact would not be free. The money has to come from somewhere. The United States is a very rich country and should be able to do things like rebuild bridges, fix highways and insure thatthe next generation gets an education without being loaded with debt. The problem is that the vast majority of that wealth is held by a tiny few and a huge share of the new dollars coming into the economy is derived from the financial sector. Those financiers are really bad at creating middle-class jobs, but they are experts at avoiding taxes. Getting more of the wealth spun from elaborate financial trickery to spend on the common good rather than on more mansions in the Hamptons may be a radical idea, but its not necessarily a bad idea. Government-run healthcare. Yup, this one really is socialism. Its what they have in hellish commie wastelands like Germany, Denmark, Japan, Canada and the rest of the industrialized world. Its also what Americans over the age of 64 have. We call it Medicare. Sanders is never going to be president. Most voters are not ready to approve his full program. Still, he will have done this country a great service if, through his blunttalk and grandfatherly presence, he gets more citizens to stop being distracted by scare stories and political labels and to start considering ideas on their merits. A 40-hour work week, a minimum wage and restrictions on child labor were once thought of as subversive, socialist doctrines, but they have turned out to be pretty good ideas for Americans  except maybe for the billionaires.]", "Date": "20150506", "Title": "[Bernie Sanders' 'socialism' may have mainstream appeal]", "Link": "http://www.latimes.com/opinion/topoftheticket/la-na-tt-bernie-sanders-socialism-20150505-story.html\n", "Author": "[David Horsey]"}
