{"Content": "[Atty. Gen. Kamala Harris on Wednesday defended her aggressive young U.S. Senate campaign, which some of her fellow Democrats have complained is aimed at keeping others, notably a Latino candidate, out of the race. \"I have always entered races early and run hard, and thats what Ive done in this race,\" Harris said in an interview with The Times. \"I make no apologies for it.\", But she did disagree with a sentiment expressed by one of her supporters, former Assembly Speaker Willie Brown, who urged former Los Angeles Mayor Antonio Villaraigosa to skip the contest out of respect for Harris. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... \"I think that anything that suggests anyone should not run for any reason is not appropriate,\" Harris said, adding that she had \"great respect\" for Villaraigosa. Harris formally launched her campaign on Jan. 13, days after U.S. Sen. Barbara Boxer announced she would not seek reelection in 2016. In the five weeks since then, Harris has been raising money and securing endorsements  some from former allies of Villaraigosa  but did no media interviews about her bid until Wednesday. Harris said she had been focused on her duties as the states top law enforcement official. \"Im 100% focused on doing my job as Californias attorney general,\" Harris said, citing her launch last week of a childrens justice bureau. Harris has also been raising campaign money. She declined to discuss her fundraising strategy. In addition to Villaraigosa, some Democratic members of Congress are weighing whether to enter the race. Among Republicans, Assemblyman Rocky Chavez of Oceanside and two former state party chairmen are pondering a run. Harris said she expected multiple debates with her opponents, whoever they are. She pointed to her resume as attorney general and San Francisco district attorney as rationales for her Senate bid. \"I think that California wants and needs a tough, practical and results-oriented approach and leader in the Senate,\" Harris said, \"especially, frankly, given the atmosphere in Washington today.\", Harris said she decided to run for Boxers seat because many of the priorities she has had as attorney general  consumer protection, veterans, immigration, the environment  are issues she would like to tackle at the federal level. \"All, I think, are very connected, directly connected to the work that Ive been doing and want to see through,\" Harris said. Harris acknowledged that she had not worked on foreign policy or national security  two critical areas of concern to the U.S. Senate  in her elected posts. \"Its something that is relatively new in terms of my professional work. Ive always had an interest in it, but theres a learning curve,\" Harris said, adding that she planned to spend the next several months studying, reading, consulting experts and \"really feeding my brain.\", On a critical foreign policy matter of the moment  fighting the Islamic State  Harris said she supported President Obamas approach. The president, in seeking authorization for the use of military force from Congress last week, proposed permitting airstrikes and U.S. training for Iraqi and Syrian ground forces for three years. The plan would forbid the use of ground troops for extended combat operations but would place no geographic limits on the effort. Some Republicans are concerned that the restrictions in the proposal would hamstring the military. Some Democrats fear that the authority Obama seeks is too broad and vague, a concern that Harris said she does not share \"at this point.\", \"As a general principle, I think it would be a great mistake for us to enter another ground war, and I support the presidents approach, which is that that is an area of last resort,\" Harris said. Duration limits and the need for Congress to authorize any further moves are a smart way to go, she said: \"We have learned without that, we may have unintended consequences.\", Harris sidestepped the current controversy over Israeli Prime Minister Benjamin Netanyahus address to a joint session of Congress next month. Netanyahu was invited by House Speaker John Boehner without consulting the White House, leading some Democrats to vow to boycott the speech. Harris declined to say whether she would attend if she were a senator. \"I cant speculate about that at this point,\" Harris said, before emphasizing the importance of the United States relationship with Israel and the tiny nations ability to defend itself. seema.mehta@latimes.comTwitter: @LATSeema]", "Date": "20150218", "Title": "[Kamala Harris 'makes no apologies' for fast start to Senate race]", "Link": "http://www.latimes.com/local/politics/la-me-pol-senate-harris-20150219-story.html", "Author": "[Seema Mehta]"}