{"Content": "[A proposed state constitutional amendment is the latest in a long line of attempts to expand the five-member Los Angeles County Board of Supervisors and potentially add a second Latino seat. Some observers are skeptical of the prospects for the bill offered by state Sen. Tony Mendoza (D-Artesia). And one board incumbent, Don Knabe, accused the lawmaker of trying to carve a landing spot for himself when hes termed out of state office. Tonys always looking for a job, said Knabe, whose district overlaps with Mendozas. \"Theres no question in my mind that he would like that handpicked seat for himself.\", Mendoza defended his proposal, saying expanded supervisorial representation is long overdue in L.A. and several other large counties. This is not about me; this should have been done a long time ago, he said. \"Supervisor Knabe had the opportunity to do the right thing over and over again. Mendoza pointed out thatthe population of Los Angeles County has grown from about 3,500 to more than 10 million since the 1850s, but the number of board seats has remained the same. Latinos make up nearly half of the countys population. It took a voting rights lawsuit to create the first Latino-majority district on the board more than 20 years ago. That seat is now held by former U.S. Secretary of Labor Hilda Solis, who declined to comment on Mendozas proposal. Because of term limits, only twoof the sitting Los Angeles County supervisors -- Solis and Sheila Kuehl -- could potentially still be in officewhen the proposed expansion took effect. Kuehl also declined to comment on the proposal. According to a spokesman, Supervisor Michael D. Antonovich opposes the idea, and Supervisor Mark Ridley-Thomas could not be reached. Los Angeles County voters have several times rejected proposals to expand the number of seats on the board, which could potentially create a better opportunity to elect a second Latino member and a first Asian American member. Federal officials have so far not heeded calls byactivists seeking a second Latino seat to sue the county over alleged voting rights violations. Last year, Gov. Jerry Brown vetoed a proposalthat would have allowed courts to order an expansion of the number of county seats as a result of state voting rights lawsuits. Mendozas proposed constitutional amendment would expand the boards of all counties with a population of 2 million or more -- including the Southern California counties of Los Angeles, San Diego, Orange, Riverside and San Bernardino -- from five to seven members beginning in 2021. The counties redistricting processes would remain unchanged, and theirspending on supervisors staff and office operations would be capped at the same level as when they had five seats. State legislators would have to vote to place the proposal on the ballot and then California residents would vote on it in 2016. Redistricting expert Douglas Johnson said he thought the bills prospects of passing were slim. But it might pick up support from Republicans concerned about losing the two existing conservative seats on the Los Angeles County board in next years election, he said.Mendozas bill has one Republican co-author, state Sen. Sharon Runner of Lancaster, along with several Democrats. Maybe Republicans would join with Latinos in hopes that if we go to seven, we might preserve one Republican seat and get two Latino seats, Johnsonsaid. Mendoza said he had been in talks with advocacy organizations such as the Mexican American Legal Defense and Educational Fund -- one of the groups that successfully sued Los Angeles County to create a first Latino district -- and was hopeful of garnering their support for his proposal. MALDEF President and General Counsel Thomas Saenz did not respond to a request for comment. Twitter: @sewella ]", "Date": "20150514", "Title": "[Lawmaker's push to expand L.A. County board could add a Latino supervisor]", "Link": "http://www.latimes.com/local/lanow/la-me-ln-county-supervisor-seats-20150514-story.html\n", "Author": "[Abby Sewell]"}
