{"Content": "[Many Republican tears have been shed over the partys inability to win over Latino voters in California. And many more have been shed over the partys inability to win over the states Asian voters, at least in big ticket races. And now theres another, more surprising reason for Republicans to fret. Are they losing white voters too?, Nationally, as well as in California, white voters  specifically, older white voters  have been the backbone of the Republican Party. That worked, as long as older white voters were the backbone of the states politics. Not so much any more. Now, when it comes to voters, formerly homogenous California is an amalgam of races: 24% Latino, 9% Asian, 6% African American. More than 4 in 10 voters are non-white, according to a new USC Dornsife/Los Angeles Times poll. And of the white voters, fewer are Republican than in decades past: Little more than a third of white voters were registered as Democrats, almost precisely the number registered as Republicans. (Two in 10 white voters were registered independents.), Interested in the stories shaping California? Sign up for the free Essential California newsletter >>, The Republican figures among whites were good, however, compared with their numbers among non-whites. Republicans were under-represented among African American, Latino and Asian voters; their largest bloc was the 18% of Latinos who were Republican. When minority voters were taken together, only 17% were registered Republicans, while 52% were Democrats and 27% independents, who in California side hugely with the Democratic Party. The reasons for the fading Republican presence are many. The Latino portion of the puzzle rests on 1994s Proposition 187, the effort to ban the use of state services byimmigrants in the country illegally. Pushed by a Republican governor, Pete Wilson, it was seen by Latinos of all statuses as an attack on close family and community members. The response? To flee to the Democratic Party, or become an independent, effectively Democratic voter. As white voters objections to illegal immigration have eased over the decades, more white voters here recoiled at the partys stance. And there was more: Women felt alienated by a party that blocked workplace protections for them and campaigned against abortion rights and contraception. Young voters, white or otherwise, looked askance at GOP opposition to gay rights and, later, same-sex marriage. A state with religious affiliations that are lower than the national average bridled at the increasing evangelical dominance of the party. \"It has been a perfect storm over the years,\" said Allan Hoffenblum, a former Republican strategist who runs the California Target Book, a nonpartisan compendium of state political races. And there is more than a slight chance that it could spread to other states as they work through similar demographic changes, he said: \"This is something Ive been warning about.\", In recent California elections, the combination of increasing numbers of minority voters and whites slumping allegiance has been toxic for Republicans. As Hoffenblum noted, through 1998 Republicans owned statewide offices; since then the wins have petered out. As recently as the 2010 election, exit polls showed, whites were 61% of the states voters; Sen. Barbara Boxer lost them by 10 points and Gov. Jerry Brown lost them by 5 points. In 2012s presidential contest, whites were down to 55% of the vote, and President Obama lost them by 8 points. No California exit polls were taken in 2014,  the price of holding a gubernatorial contest whose result was a foregone conclusion  but a USC Dornsife/Los Angeles Times poll taken a week before the election showed Brown winning white voters by 9 points. Lt. Gov. Gavin Newsom was winning whites by 7 points, and two other candidates  Atty. Gen. Kamala Harris and Treasurer John Chiang  also were winning whites handily. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, State Republicans have worked for years to redefine their brand, electing more women and minority members to the Legislature and grooming them for leadership positions. Their candidate for controller last year was the well-regarded Fresno Mayor Ashley Swearengin, who, were she a Democrat, would be among the top ranks for statewide office. But redefining the party has been problematic in a state generally disinterested in politics and whose Capitol is outside a big media market. The presidential campaign, which arrives here in earnest for Wednesdays presidential debate in Simi Valley, has done little to bolster the partys brand here, replete as it has been with fights over immigration, Planned Parenthood and same-sex marriage, the kinds of issues that alienated rising voters in the first place. The combination of a contentious and sharply conservative presidential campaign, and no countering brand definition by California Republicans, threatens more retrenchment, many Republicans say. \"One of the big problems in California is there really is no California Republican voice,\" said one party veteran, who spoke anonymously to preserve business relationships. \"What voters hear is the national party. There really isnt anyone helping California voters  understand that Republicans in D.C. and Republicans in the South dont necessarily speak for Republicans in California.\", There are the California Republicans struggling for notice, he said, and then there are the loud and braying voices on the presidential campaign, reinforcing an image that many Republicans here would like to leave in the dust. \"If you think about it, the mayor of Fresno is trying to have a louder conversation than Donald Trump and Ted Cruz,\" he said. \"That is a nearly impossible task.\", cathleen.decker@latimes.comTwitter: @cathleendecker, For more on politics, go to www.latimes.com/decker and www.latimes.com/politics. MORE INCALIFORNIA POLITICS:, Legislature leaves anti-tobacco measures and health plan tax on the table, The inside story of how power struggles doomed Jerry Browns top priority, Politics at the local level pointless? Thats what many Californians think]", "Date": "20150913", "Title": "[Are Republicans losing white voters too?]", "Link": "http://www.latimes.com/local/politics/la-me-pol-ca-california-politics-republicans-20150913-story.html\n", "Author": "[Cathleen Decker]"}
