{"Content": "[Presidents from Harry Truman to Bill Clinton have turned to foreign policy in their final months in office when their domestic agendas have been stymied. For Barack Obama, that overseas pivot may offer little relief. As he landed in Beijing on Monday morning as part of a weeklong trip to China, Myanmar and Australia, the stinging repudiation Obama suffered in last weeks midterm elections is likely to dishearten friends and embolden foreign adversaries, analysts say. Come January, he will face a Republican-dominated Congress whose leaders appear determined to take foreign policy in a more hawkish, more interventionist direction. \"The pummeling hes taking is creating the perception abroad that a president who was headed for lame-duck status is even less relevant,\" said Aaron David Miller, a U.S. diplomat from 1978 to 2003, and author of \"The End of Greatness,\" a book about the limits of presidential power. White House aides, in internal meetings, are mapping out plans to expand Obamas efforts abroad in his final two years in office. They say his authority as chief executive allows him to act without a specific congressional mandate in several sensitive areas, such as easing some sanctions on Iran. The White House has set challenging policy goals: sealing a nuclear deal with Iran, strengthening an unproven government in Afghanistan, mobilizing an international coalition against Islamic State militants, reaching regional trade deals in Asia and Europe, and turning Russia from adversary to ally. Foreign leaders, always keenly sensitive to the political strength of U.S. presidents, took note of the White House losses last week. Obama has evolved \"from the president of hope to the president of disappointment,\" Alexei Pushkov, an ally of Russian President Vladimir Putin and chairman of the foreign affairs committee in the State Duma, or lower house of the parliament, told the Tass news agency. Putin, angry that the United States and Europe have imposed sanctions on Russia over Ukraine, has shown no sign of backing down. In recent weeks, Moscow has sent a series of provocative military flights into European airspace. The Kremlin also said last week that it wont take part in the 2016 Nuclear Security Summit, which seeks to strengthen international controls to prevent terrorists from gaining access to nuclear materials. Obama initiated the summits in 2010. Because Russia is one of the largest potential sources of such material, Moscows boycott is a blow to the nonproliferation effort Obama hoped would be an important part of his legacy. The election setback also did not go unnoticed in Beijing, where Obama will meet this week with Chinese President Xi Jinping. The two leaders have sparred over cybersecurity, trade and Chinas growing military assertiveness in the South China Sea, and China has criticized Obamas efforts to boost Americas military presence in the western Pacific in a \"rebalance\" of U.S. forces. The GOP success means \"the lame-duck president will be further crippled,\" wrote the pro-government Global Times newspaper in Beijing. \"U.S. public opinion has downgraded Obama.\", The Republican sweep also could bolster Israeli Prime Minister Benjamin Netanyahu, who has clashed with Obama over White House efforts to ease Israeli-Palestinian tension. Robert Danin, a former U.S. diplomat in the Middle East, said that domestic American politics isnt the crucial factor in Netanyahus calculations, but the shift in Washingtons political landscape \"could embolden him.\", Republican control of the Senate also could complicate Obamas efforts to complete a nuclear deal with Iran this month, a foreign policy goal his aides consider as important to his White House legacy as his 2010 healthcare initiative. Obama has considerable leeway to work around Congress in implementing a nuclear deal, which would ease economic sanctions on Tehran in exchange for systems to ensure that Iran cannot build a nuclear bomb. But if Congress believes the deal is a poor one, it could mobilize to block it. Republican skeptics, including Sens. Mark Kirk of Illinois and Bob Corker of Tennessee, who is to take over the Senate Foreign Relations Committee, already are planning legislation that could threaten the negotiating effort by adding new sanctions on Iran or giving Congress more leverage over the deal. Republican hawks also will be ascendant. Sen. John McCain (R-Ariz), who is expected to lead the Senate Armed Services Committee, is likely to push the White House to step up the military campaign against Islamic State, and to begin providing arms and ammunition to the government in Ukraine, among other issues. Obama may still have the upper hand in those disputes. But theres likely to be an ugly fight over Obamas request, which he announced at a news conference Wednesday, to seek congressional authorization for the bombing campaign against Islamic State militants in Syria and Iraq. As a result, he may find it harder to persuade Turkey, Qatar and other members of the coalition battling the Sunni militants to provide money or military help. And he doesnt have some of the assets of previous presidents, such as strong personal relationships with world leaders, analysts say. \"The problem is with him [is] hes just not strong on that,\" said David Rothkopf, a former Clinton administration official who has written extensively on the National Security Council. Still, Obama will have it easier in some areas. One is the proposed Trans-Pacific Partnership regional free trade agreement, another White House priority. The accord, which is still being negotiated, faces Democratic opposition in Congress. Republican leaders say they will give the deal a major push if negotiations succeed. And analysts note that Obamas fortunes could shift abruptly if he successfully manages a sudden terrorist danger, or manages to seal a good nuclear deal with Iran, thus neutralizing a major security threat. That \"would make a real difference for him,\" said Miller, the former U.S. diplomat, who is a vice president with the Woodrow Wilson International Center for Scholars, a think tank in Washington. 6:24 p.m.: This post has been updated with President Obamas arrival in Beijing. It was originally published at 4:16 p.m. ]", "Date": "20141109", "Title": "[Election setbacks for Obama may embolden foreign adversaries]", "Link": "http://www.latimes.com/world/asia/la-fg-obama-foreign-20141110-story.html\n", "Author": "[Paul Richter]"}
