{"Content": "[Democrat Lou Vince, a police lieutenant and member of the Agua Dulce Town Council, said Thursday that he will challenge freshman Rep. Stephen Knight (R-Palmdale) in next years election. \"As a veteran, a law enforcement officer and a local elected official, I know first-hand the positive results that can be attained through hard work and determination,\" Vince said in a statement announcing his candidacy. A California native and Marine Corps veteran who has served with the Los Angeles Police Department since 1995, Vince, 41, ran in the primary election for Los Angeles County sheriff last year. He finished last among the seven candidates on the ballot. Knight, 48, succeeded Rep. Howard P. \"Buck\" McKeon (R-Santa Clarita), who did not seek reelection, in 2014. Registration in the district is evenly split between Democrats and Republicans in this former GOP stronghold. But voters still tend to choose Republican candidates, albeit narrowly. Democrats have tried repeatedly to take this district, the 25th, which includes Simi Valley, Santa Clarita, Palmdale, Lancaster and Agua Dulce, among others. But in the 2014 election, neither of their party candidates qualified for the general election ballot and Knight defeated fellow Republican Tony Strickland to win the House seat that November. The Democratic Congressional Campaign Committee recently added Knight to its list of House freshman Republicans it believes to be most vulnerable to losing their reelection bids next year. Knight was recently caught on video telling a protester he would \"drop your ass\" if the man, who patted the congressman on the arm during an argument, touched him again. Democrats also looked at Knights anemic fundraising -- he brought in $40,800 during the first campaign finance reporting period of the election season and owed $52,000 -- as a sign of vulnerability. Knight could not be reached for comment Thursday but he earlier told the Signal, a local newspaper, that his fundraising has picked up considerably. Another Democrat is said to be considering taking on Knight. Maria Gutzeit, a Santa Clarita Water Board member and a chemical engineer, recently told Roll Call, an online publication of the Congressional Quarterly, that she has been speaking with potential supporters about making a run. [For the Record, 10:35 a.m. PST May 1: An earlier version of this post incorrectly stated that Knight had raised $48,800. The correct amount is $40,800.], , Follow @jeanmerl for the latest in Southern California politics news.]", "Date": "20150430", "Title": "[Democrat Lou Vince says he will challenge Rep. Stephen Knight ]", "Link": "http://www.latimes.com/local/political/la-me-pc-knight-challenger-20150430-story.html\n", "Author": "[Jean Merl]"}
