{"Content": "[The surprise retirement of Sen. Harry Reid, the gritty top Democrat in Congress, risks unraveling perhaps the biggest accomplishment of his combative decade in leadership: keeping unruly Democrats united in support of President Obamas agenda and rebuffing an overtly divided GOP. As recently as a few weeks ago, the former amateur boxer gave every indication he would seek reelection in 2016, despite a New Years exercise mishap that left him nearly blinded in one eye. On Friday, the Capitol Hill veteran called it quits, suggesting he preferred to leave a legacy while still in his prime rather than overstay his effectiveness. Somebody should go when theyre still pretty good, Reid said in an interview Friday morning at his home near the Georgetown neighborhood. The 75-year-old Nevadan made it clear that he was leaving on his own terms  not because of his accident, Senate Democrats new minority status or worries about his upcoming reelection campaign. I want to be remembered for when I was able to bat third or cleanup a lot of the time, he said, sitting on a comfortable couch dressed in khakis, a gray cardigan and uncharacteristically colorful striped socks  his special sunglasses still protecting his injured eye. For Democrats, the challenge ahead is whether the post-Reid party can tamp down the growing ideological differences between liberal and more centrist Democrats, navigate a rare transfer of party leadership, and avoid the kind of infighting that has all but paralyzed their Republican colleagues. The timing is particularly sensitive as Democrats look toward the 2016 election, when they have a chance to regain the Senate majority after the Republican takeover this year. There hasnt been an active campaign for the top Democratic leadership position in either the House or Senate since Reid won his current post in 2005. Eager to avoid a leadership fight, Reid promptly anointed the No. 3 Democrat, Sen. Charles E. Schumer of New York, as his successor. Schumer, in 22 months  if he plays his cards right  should be able to do it, Reid said. I said, If you need my help, you got it. If Im going to be in your way, Ill get out of your way., Admired for his Wall Street fundraising skills and political savvy, Schumer has made no secret of his desire for the job. But the New Yorkers bold personality is more polarizing among Democrats than Reids. The long-running joke in Washington is that the most dangerous place to be is between Schumer and a television camera  leaving some wary of elevating a leader who could be seen as an East Coast version of another divisive Democrat, House Minority Leader Nancy Pelosi of San Francisco. On the other hand, Schumer could be a natural bridge for Democrats if Hillary Rodham Clinton were to occupy the White House after 2016. She and Schumer served together for eight years when Clinton was the junior New York senator. Reids choice jumps over the partys current No. 2, Assistant Minority Leader Sen. Richard J. Durbin of Illinois. But an aide to Durbin said he threw his support to Schumer. Reids endorsement is important, but may not resolve the matter. Activists immediately began drafting liberal Sen. Elizabeth Warren (D-Mass.) for the post. Though her ascent seems to be a long shot, her influence will continue to register in the party. Reid told Obama of his decision during a long conversation late Thursday. He said the men recounted their political battles together and reflected on what still needed to be accomplished before both leave office after next years election. There are things we need to do, Reid said, pointing to the military campaign against Islamic State militants, climate change and other issues. Obama has leaned heavily on Reid to implement his policies, most notably with the passage of the Affordable Care Act in 2010. Even when Reid at times disagreed on strategy or tactics, he frequently served as a buffer for the president, protecting him from Republican attempts to undercut the administrations policies. Harry has become not only an ally, but a friend, Obama said Friday in a statement. Im proud of all we have accomplished together, and I know the Senate will not be the same without him. With Reid now positioned as a lame duck for the next two years, Obama may be losing a trusted ally if the minority leaders political influence begins to wane. At the same time, Reids decision to bow out in 2016 could leave other senators feeling less inclined to stick to a unified party position. For Obama, that could help advance some of his priorities, such as providing the few Democratic votes he needs to pass the 12-nation Asian trade pact. The accord is opposed by most Democratic lawmakers but supported by most Republicans. Republicans are certain to try to capitalize on the moment of potential Democratic disarray. Hit the road, Harry, cheered a fundraising appeal from Tea Party Express, a political action committee. Conservative groups had made Reid their No. 1 target last time he ran, in 2010, and intended to do so again. News of his retirement brings us great pleasure, the PAC said. Reids retirement provides Republicans with what is likely to be their best opportunity to pick up an additional Senate seat in 2016. A race that was considered close but leaning in Reids direction suddenly has become a toss-up and will be among the most closely watched and probably hardest-fought in the country. Nevada Gov. Brian Sandoval is the overwhelming favorite of the Republican establishment to succeed Reid, though he seems to have all but taken himself out of the race. Reid has endorsed Catherine Cortez Masto, a former state attorney general now serving as executive vice chancellor of the Nevada System of Higher Education. Senate Majority Leader Mitch McConnell (R-Ky.) said that Reid was underestimated often, noting that his distinctive grit and determined focus  continue to make him a formidable opponent today. Even some Democrats have bristled at Reids tight-fisted style as Senate majority leader from 2007 to 2015, including his refusal to allow amendment votes. Reid had been increasingly blamed for Senate gridlock and dysfunction, which some Democrats said may have contributed to the partys losses in the November election. In Washington, Reid may be most remembered for changing Senate filibuster rules to allow approval of Obamas nominees. In the end, a man who pulled himself up from the forlorn little mining town of Searchlight, Nev. said he felt he had done all he could do. The senator had made a preliminary decision over the Christmas holiday that he was ready to retire, an aide said, but then the accident brought out his fighting instinct. He wanted to regain his footing before moving forward with such a momentous decision. Even with its many gray-haired statesmen, the Senate can be unkind to lawmakers who cling to office. Reid would be in his mid-80s by the time another term came to a close, and the senator, who grew up listening to radio broadcasts of baseball games and always imagined himself playing the outfield, said he didnt want to finish his career as a designated hitter. In Nevada, Reid has left his imprint  not just on the few buildings bearing his name, but on policies to develop renewable energy resources that have sometimes caused controversy. Some credit  or blame  him for single-handedly stopping the nuclear waste dump at Yucca Mountain outside Las Vegas. The senator said that he had no interest in becoming a lobbyist or a high-powered lawyer, but that he might write another book. The one thing thats not on my to-do list is: Im not going to spend more time with my kids, said Reid, who is known for his crusty way of saying what others may think but not express. He said he and his wife, Landra, talk to their children every day and have a pet peeve about citing that reason for retirement. We just think thats obnoxious. lisa.mascaro@latimes.com, michael.memoli@latimes.com, mark.barabak@latimes.com, , 6:57 p.m.:This report has been revised throughout for additional details, updates and clarity. 11:53 a.m.: This article was updated with comments from a Los Angeles Times interview with Harry Reid. 9:20 a.m.: This article has been updated with Harry Reids comments about informing President Obama of his retirement plans. 9:04 a.m.: This article has been updated with Harry Reids endorsement of Sen. Charles Schumer as the next Democratic leader. 8:18 a.m.: This article has been updated with remarks from President Obama. 6:08 a.m.: The article has been was updated throughout with additional details and background. This article was originally posted at 5:08 a.m.]", "Date": "20150327", "Title": "[Sen. Harry Reid's retirement poses challenge for Democratic unity]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-na-pn-harry-reid-wont-seek-reelection-20150327-story.html\n", "Author": "[Lisa Mascaro, Michael A. Memoli, Mark Z. Barabak]"}
