{"Content": "[California has stood as a bright-blue bulwark against conservative political surges for years now, blocking at its border a series of national Republican sweeps and giving President Obama historically huge victories. So it was with no little optimism that Republicans here gathered Saturday under the slogan Bringing the conservative wave to California. Their faith was rewarded by a rarity  multiple presidential hopefuls in California prospecting for actual votes, not money. It was not exactly the first string, though former Texas Gov. Rick Perry, Louisiana Gov. Bobby Jindal and former Hewlett-Packard Chief Executive Carly Fiorina all delivered spirited denunciations of Obama, of liberals and occasionally of California, as they labored mightily to heighten their profiles. They accused Obama of cowering in the face of international threats and gazing elsewhere as the nations middle class suffered in the backwash of the fiscal crisis he inherited. They castigated his former secretary of State and leading Democratic presidential contender Hillary Rodham Clinton as like-minded. After a decade of discontent  a period that included part of the last Republican presidents tenure  the American people are looking for a new direction, Perry declared as he co-opted Obamas 2008 slogan: They want real hope, real change and real leadership. Fiorina took aim at the dominance of Californias Democrats, blaming them for the states economic woes and the gap between its billionaires and the poverty-stricken. California is the test case; it is the proof positive of what happens when liberals are in charge for too long, she said. The daylong event at the historic Fox Performing Arts Center in Riverside drew more than 850 attendees, and was formed by two components: a drive by conservative groups to coalesce their strength, and the faint hope that with a huge and fluctuating Republican field, the 2016 race could be undecided as the campaign roars into the states late primary. California could become the kingmaker on the Republican side in June of 2016, and the people here are going to remember who came and asked for their vote instead of treating the state like an ATM, said John Berry, statewide co-coordinator for the Tea Party Patriots group. Although Berry acknowledged that the chance of California going Republican in a general election is a long shot, he said conservative groups were working to influence elections large and small. The Unite Inland Empire coalition that sponsored the conservative gathering represented two dozen groups that previously operated separately. The Inland Empire itself is not exactly Republican-red any more; Obama won Riverside and San Bernardino counties in 2008 and 2012. But in the political gradations of the state, inland areas still remain a deeper well of potential support for Republican candidates. The bent of the events sponsors, speakers and attendees was evident  from references to Barack Hussein Obama to discussions of the attack on the U.S. compound in Benghazi, Libya, and other issues that have formed the backbone of conservative criticism of the president. But it was also a group hostile to what it saw as more establishment Republicans. A video airing on a loop throughout the day mocked both Obama and 2012 Republican nominee Mitt Romney. Several caustic references were made to a prospective candidate  they did not mention former Florida Gov. Jeb Bush by name  who one speaker said is very, very, very supportive of Common Core. Boos ensued. Jindal added to the fervor by citing the education standards as one of the countrys three biggest problems  along with terrorism and Obamas healthcare program. In a lengthy denunciation, he did not mention his past support for the standards but contended that, in lieu of government involvement, the best way to fix education in America is to trust moms and dads. Foreign policy served as a common cudgel for all three speakers. For too long this administration has led from behind, lurched from crisis to crisis guided by moral and strategic ambivalence, Perry said. We need to summon up that spirit of old that led us to vanquish the communists and the fascists in the last century. The only thing that these tyrants respect are strength and resolve, he said of leaders in Russia, Iran and elsewhere. We need to rebuild our military; we need to reassert our moral authority at home and overseas. Now is the time for moral clarity, not moral confusion. Fiorina mocked Clintons 2009 presentation of a faux reset button to Sergei Lavrov, the Russian foreign minister. Ive sat across a table from Vladimir Putin. You dont have to spend very much time with that man to understand that his ambition will not be changed by a gimmicky red reset button, she said. Jindal described Obamas tenure in near-apocalyptic terms; the crowd whooped and repeatedly rewarded him with standing ovations. I hate to say this, but we have a president right now who is not qualified to be our commander in chief, Jindal said. He added later: It is important we win for the future, for the sake of the United States of America. We have a president who is bankrupting us financially, morally, internationally; we have a president intent on redefining what it is America stands for, intent on redefining the American dream. Despite the rare occasion of a multi-candidate event in California, the candidates spent little time on issues that are particularly salient here. An exception came when Fiorina, who unsuccessfully ran for the U.S. Senate from California in 2010, blamed Democratic regulations for denuding the Central Valley. It is not just the agricultural land that has been ruined  its that lives and livelihoods have been destroyed at the altar of liberal ideology, she said. Perry forwarded the subject of illegal immigration to cement his conservative bona fides. (When he ran for president in 2012, he suffered for Texas policies deemed too liberal by other Republicans, including support for in-state tuition for college students lacking official papers.), Fiorina, answering questions from reporters after her speech, blamed Obama for the immigration impasse in Washington. (An immigration measure has stalled in the Republican-controlled House.), To solve this problem we have to get serious about security at the border, she said. We have to get serious about fixing the legal immigration system, which has been broken for decades. Of course we have to get serious about how we handle the people who are already here. She did not, however, say how. cathleen.decker@latimes.com, Twitter: @cathleendecker, , 8:23 p.m.: This story has been updated throughout. This story was originally published at 2:58 p.m.]", "Date": "20150221", "Title": "[A rare sighting: Republican presidential prospects come to California]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-republicans-presidential-2016-20150221-story.html\n", "Author": "[Cathleen Decker]"}
