{"Content": "[With Lt. Gov. Gavin Newsom termed out in 2018, seven current and former state legislators, including Senate President Pro Tem Kevin de Leon (D-Los Angeles), have opened committees to raise money for possible campaigns for lieutenant governor. De Leon has begun fundraising in the last month for a possible candidacy, bringing in $42,000 from three Indian casino operators, a law enforcement group and the California Assn. of Health Underwriters PAC. De Leon held a fundraiser on March 19 at Donovans Steakhouse in La Jolla, according to Jason Kinney, a spokesman for the senator. \"Senator De Leon is currently and completely focused on leading the State Senate, Kinney said. This is however his final term in the Senate and he has opened a Lieutenant Governor 2018 Committee to explore his future political options.\", Assemblyman Mike Gatto (D-Glendale) has scheduled an April 9th fundraising dinner at the Kokkari Estiatorio Greek restaurant in San Francisco for his 2018 lieutenant governor committee and his 2016 state Senate campaign committee. He has raised more than $58,000 for the 2018 contest. Gatto is committed to running for state Senate in 2016, said Parke Skelton, his political consultant. But if he loses the Senate race he could run for lieutenant governor two years later, Skelton said. Sen. Mark Leno (D-San Francisco) reports having raised $88,000 for a campaign committee for lieutenant governor in 2018. Others who have formed committees include Sen. Anthony Cannella (R-Ceres), Sen. Ed Hernandez (D-West Covina), former Senate leader Darrell Steinberg (D-Sacramento) and GOP Rep. Jeff Denham of the Central Valley. Some of those who have filed statements of intention to run for lieutenant governor will not be on the ballot, saidAllan Hoffenblum, who publishes a nonpartisan election analysis called the California Target Book. They often do that (open committees) just to park their money, he said, noting that state law allows candidates to raise funds for seats for which they end up not running. In some cases, a candidate raising money for lieutenant governor might switch to running for secretary of state or some other statewide office and still be able to use the money raised, he said. Twitter: @McGreevy99]", "Date": "20150327", "Title": "[Seven lawmakers have committees for 2018 lieutenant governor's race]", "Link": "http://www.latimes.com/local/political/la-me-pc-seven-lawmakers-have-committees-for-2018-lt-gov-contest-20150327-story.html\n", "Author": "[Patrick McGreevy]"}
