{"Content": "[If youre looking for what to expect next year, look no further than the seeds planted in 2014. It was a year when the country talked more about race and power than it did the year it elected its first black president; when police became a bigger story than crime; when the economy improved and hardly anybody noticed; when the U.S. officially ended its combat mission in Afghanistan and dispatched new troops to Iraq. It was a year when words like \"beheading,\" \"quarantine,\" \"botched execution\" and \"rectal feeding\" became disconcertingly familiar. Robin Williams died. So did Pete Seeger and Gabriel Garcia Marquez. The democracy of umbrellas erupted in Hong Kong then got extinguished with stern court judgments and tear gas. The Veterans Administration went into meltdown but Healthcare.gov became navigable. Colorado and Washington mellowed. Vladimir Putin rebuilt the Russian Empire and almost got named Man of the Year. No one came up with a single useful clue to the fate of Malaysia Airlines Flight 370 or to what Donald Sterling could possibly have been thinking. By years end, 2014 seemed to be summed up in a collective national utterance: \"I cant breathe.\", Some of the years highlights, and a look at whats ahead:, POLITICS: Congress suffered through its least-productive session since the 1940s, enacting only 296 laws, and just one in six Americans could say that they were happy with the institution. With control of both chambers starting in January, Republicans will have to prove that they can make the federal government work better. In Iowa, New Hampshire and other early voting states, a dozen or so contenders will step up to the race to succeed President Obama, with Hillary Clinton the prohibitive Democrat front-runner and Republicans scrambling in a wide-open bid for their nomination. POLICE SHOOTINGS: Michael Brown, a young unarmed black man, was shot to death by a white police officer in Ferguson, Mo. on Aug. 9, triggering a cascade of protests across the country. Similar demonstrations erupted from the death of another black man, Eric Garner, caught in a grappling hold by New York police in July. \"I cant breathe!\" Garner gasped as he died. Grand juries in both cases elected not to indict and in the swirling public outrage, what many have called a new civil rights movement was born. The backlash soon turned violent: Two New York police officers were shot to death Dec. 20 by a man who invoked Garners name in anti-police messages he had posted online. In the coming year, the Justice Department will complete its investigations into whether any civil rights laws were broken. CONFLICT ABROAD: It was a year of violence on Earth, ill will toward man. This was especially true in the Middle East, where the Syrian civil war by the end of the year had claimed more than 190,000 lives, displaced 6.5 million people and forced 3 million more to flee the country  with no end in sight for a resolution. Terrorism was directed to an astonishing degree at children; more than 145 students and teachers died in an attack Dec. 16 by the Pakistani Taliban on an Army school in Pakistan. Islamist militants waged similar attacks at schools in Nigeria while also kidnapping hundreds of girls. Girls struck back: Malala Yousafzai, a Pakistani schoolgirl shot by the Pakistani Taliban, became an activist for female education and won the Nobel Peace Prize. The United States continued to unwind its military role in Afghanistan, though new troops were dispatched to Iraq, and the use of drones continued to rise. At years end, the U.S. moved to reopen relations with Cuba after a cutoff of more than 50 years. EBOLA: The West finally had to deal with Ebola, which has killed more than 7,500 people in Africa in the current, and worst, outbreak in history. The virus spread panic in parts of the United States where a handful of cases were diagnosed among travelers and healthcare workers who did not have the proper protection. But the numbers were far short of the 1.4 million cases some had projected by years end. The outbreak will be contained, health officials continue to say, but they wont say when. Expect further flare-ups across West Africa in 2015, and additional cases in the U.S. too. \"Im hopeful about stopping the epidemic, but this is going to be a long, hard fight,\" said Thomas Frieden, head of the federal Centers for Disease Control and Prevention. TECHNOLOGY AND HACKTIVISM: Internet usage on mobile devices exceeded personal computer usage for the first time. As of January 2014, 90% of American adults had a cellphone and 58% had a smartphone. Polls found that 67% of adults said they found themselves checking their phone for messages, alerts, or calls  even when they dont notice their phone ringing or vibrating. It was the year when Jennifer Lawrence and Sony Pictures Entertainment went naked  neither by choice. Lawrences nude photos were stolen by hackers and Sonys deepest secrets were uncovered and made public by other computer guerrillas purportedly furious over the movie \"The Interview,\" which imagines a plot to kill the leader of North Korea. The FBI accused North Korea of being responsible for the attack that embarrassingly disgorged private details about employees, former workers, top officials and even A-listers like Angelina Jolie. Next year, expect what Obama has vowed will be a \"proportional\" response. BORDER SURGE: Tens of thousands of new immigrants, a large number of them children, flooded across the Southwest border. Many were fleeing violence in Central America, many also were hoping for a chance at legal residence in the U.S. Shelters were inundated and the immigration courts were overwhelmed. \"Si se puede,\" the slogan made famous by Cesar Chavez in his fasts on behalf of farmworkers, returned as the watchword for those seeking comprehensive immigration reform. But as hopes for congressional action waned, Obama announced in November that he was taking executive action in a controversial move to protect more than 4 million undocumented immigrants from being deported. At least 24 states sued, arguing that the president had overstepped his authority. SAME-SEX MARRIAGE: If race and ethnic relations were under pressure in 2014, it was nothing like the changes wrought by the evolution in same-sex marriage laws. For the first time, a majority of Americans were living someplace where marriage between partners of the same sex was legal, either through legislation or court action. By the end of the year, 35 states and the District of Columbia had legalized gay marriage and the rest were somewhere in the legal process. The issue is expected to go to the U.S. Supreme Court next year as it tries to resolve a split in the lower courts. OBAMACARE: The presidents signature domestic achievement, the Affordable Care and Patient Protection Act, enters its second year facing a surprising Supreme Court test. The court next year will hear oral arguments in the suit  King vs. Burwell  that alleges the Internal Revenue Service acted improperly in how it set up regulations for subsidies that are important for how the program works. Conservatives, continuing their campaign to try to reverse Obamacare, argue that Congress only allowed for subsidies on state-run exchanges, while the regulations as written allow subsidies for both state-run and federal exchanges. Meanwhile, the latest government figures show that 6.4 million people signed up for Obamacare next year, far better than a year ago, when computer glitches weighed heavily on rollout. Of the current enrollees, 1.9 million are new customers. The Obama administrations goal for 2015 is to get 9.1 million customers in plans sold under the law.]", "Date": "20141225", "Title": "[The U.S. is ending 2014 with a collective 'I can't breathe']", "Link": "http://www.latimes.com/nation/la-na-year-ahead-opener-20141226-story.html", "Author": "[Michael Muskal]"}