{"Content": "[House leaders announced Thursday that their planned lawsuit against President Obamawould focus on his failure to enforce provisions of the Affordable Care Act, renewing a fight over his landmark health law. Speaker John A. Boehner had previously announced plans to sue the president over what he said was Obamas failure to fulfill his constitutional duties, but Boehner did not specify what the challenge would be based on. ------------, FOR THE RECORD, July 11, 8:46 a.m.: An earlier version of this post misattributed to House Minority Leader Nancy Pelosi a quote that was delivered by her spokesman, Drew Hammill. Hammill said, \"This lawsuit is just another distraction from House Republicans desperate to distract the American people from their own spectacular obstruction and dysfunction.\", ------------, A draft resolution posted Thursday afternoon singles out the Obama administrations decision to delay enforcement of a requirement that employers provide health benefits for their employees or face a fine. Enforcement of the so-called employer mandate was put off twice, once from 2014 to 2015, and then again to phase it in by 2016. \"In 2013, the president changed the healthcare law without a vote of Congress, effectively creating his own law by literally waiving the employer mandate and the penalties for failing to comply with it,\" Boehner said in a statement. \"Thats not the way our system of government was designed to work. No president should have the power to make laws on his or her own.\", The resolution will be considered July 16 by the House Rules Committee. A vote by the full House could come the following week. Democrats have decried Boehners plans to sue Obama as an election-year stunt to motivate conservatives in the midterm election. The same Republicans who have threatened to repeal Obamacare are now suing because they claim it was not properly enforced, Democrats complain. \"This lawsuit is just another distraction from House Republicans desperate to distract the American people from their own spectacular obstruction and dysfunction,\" Drew Hammill, spokesman for House Minority Leader Nancy Pelosi (D-San Francisco), said. Notably, House Republicans chose not to target Obama for his actions on immigration, including the deferred action program for children who came to the U.S. illegally, known as DACA. Republicans have accused the president of ignoring immigration law. Some conservative media figures have criticized the suit as insufficient. Former vice presidential nominee Sarah Palin said this week that the only true remedy was to impeach Obama. Boehner has defended the suit as necessary to restore balance between the executive and legislative branches of government, and ruled out impeachment. \"I believe that the path that were going is the right one to defend our institution against the encroachment from the executive branch and to preserve the Constitution of our country as it was written and as it was intended,\" Boehner told reporters earlier Thursday. Follow @mikememoli for more news out of Washington.]", "Date": "20140710", "Title": "[House lawsuit over Obamacare to focus on employer mandate delay]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-house-lawsuit-obamacare-20140710-story.html", "Author": "[Michael A. Memoli]"}