{"Content": "[The crowded field of prospective Republican presidential hopefuls focused their animus on Hillary Rodham Clinton on Sunday, throwing a volley of jabs at the Democrat as she entered the 2016 presidential race. Her much-anticipated announcement, which came in a two-minute video, set off a flurry of fundraising emails from likely GOP presidential candidates looking to raise money off Clintons entry into the race and to assail her record in Washington. Former Florida Gov. Jeb Bush, in an online videoposted through his political action committee several hours before Clintons Sunday announcement, focused on her ties to President Obama. \"We must to do better than the Obama-Clinton foreign policy that has damaged relationships with our allies and emboldened our enemies,\" said Bush, who is expected to formally announce his candidacy this summer. Clintons tenure as secretary of State under Obama will be central to the criticism she receives from Republicans during the 2016 presidential race. She already has been scrutinized for security lapses surrounding the 2012 attack on the U.S. Consulate in Benghazi, Libya, in which Ambassador J. Christopher Stevens was killed. Sen. Rand Paul of Kentucky, who announced his candidacy for president last week, released his first television ad Sunday, calling the former first lady the \"worst of the Washington machine.\", \"The arrogance of power, corruption and cover-up, conflicts of interest and failed leadership with tragic consequences,\" said the narrator in the minute-long TV spot, which is set to run in the early voting states of Iowa, New Hampshire, South Carolina and Nevada. The first-term senator also attacked Clinton on foreign policy as he made the rounds on several Sunday TV news shows. Paul has called for limited military interventionoverseas, and on Sunday he seemed to be castigating not only Clinton and Obama but some within his own party for supporting United Nations airstrikes in Libya prior to the consulate attack. \"Interestingly, many of the hawks in my party line right up with President Obama. Think about the big issues weve had in the couple -- the last couple of years. The war that Hillary prominently promoted in Libya, many of the hawks in my party were right there with her,\" Paul said on CNNs \"State of the Union.\" \"Their only difference was in degrees. They wanted to go into Libya as well; they just always want boots on the ground. Some of the hawks in my party, you cant find a place on the globe they dont want boots on the ground. The symbolic 3 a.m. phone call that all presidents should be ready to handle in a crisis -- one that Clinton used in advertising for her 2008 presidential campaign -- was a \"phone call she never picked up,\" Paul said of Clinton. Clinton, who could face primary challenges from former Maryland Gov. Martin OMalley and former Sen. Jim Webb of Virginia, is scheduled to soon travel to meet with voters in to Iowa, the state that holds the nations first presidential caucus -- a contest she lost to then-Sen. Obama in 2008. Her entry into the race drew a jab from Iowa Republicans: We welcome Mrs. Clinton to her long expected Democratic coronation, Jeff Kaufmann, the states GOP chairman, said in a statement. The Republican National Committee has also released an ad in recent days that seeks to cast doubt on Clintons candidacy. The ad uses various sound bites from news reports to target Clinton on issues such as her use of a private email server to conduct business as secretary of State and her effort to \"reset\" U.S.-Russia relations. \"This is just par for the course for the Clintons, theyre always a little bit secretive,\" says the narrator in a reference to the email controversy that engulfed Clinton last month. The final onscreen text is simple in its message: Stop Hillary. \"Voters want to elect someone they can trust and Hillarys record proves that she cannot be trusted,\" RNC Chairman Reince Priebus said in a statement. \"We must Stop Hillary.\", Twitter: @kurtisalee, 12:51 p.m. This post has been updated with additional details and background. This post was originally published at 10:46 a.m.]", "Date": "20150412", "Title": "[As Hillary Clinton enters race, Republicans are ready with potshots]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-republicans-react-hillary-presidential-bid-20150412-story.html\n", "Author": "[Kurtis Lee]"}
