{"Content": "[The Treasury Department has started taking steps to extend the federal governments borrowing ability as the U.S. hits its debt limit again Monday, Treasury Secretary Jacob J. Lew told lawmakers Friday. In a letter to congressional leaders, Lew urged them to raise the limit \"as soon as possible\" to avoid potential damage to the governments credit rating. \"Protecting the full faith and credit of the United States is the responsibility of Congress, because only Congress can extend the nations borrowing authority,\" Lew wrote. \"No Congress in our history has failed to meet that responsibility.\", Republicans in Congress have used the limit as leverage to seek spending and other concessions from President Obama in recent years. A high-profile standoff in 2011 led Standard & Poors to downgrade the U.S. credit rating for the first time and caused turmoil in financial markets. Congress voted last year to suspend the $17.2-trillion debt limit through Sunday. On Monday, the limit will reset to the U.S. debt at that point, about $18.1 trillion. Treasury can take a number of what it calls \"extraordinary measures\" to continue borrowing for several months without going over the limit. The first step took place Friday as Treasury suspended the sale of state and local government series securities, which count against the debt limit, Lew said. On Monday, Treasury will suspend issuing new debt for the Civil Service Retirement and Disability Fund and the daily reinvestment of securities in a federal employees pension plan. Last week, the Congressional Budget Office estimated that the Treasury would run out of cash about October or November. If Congress waits until the last minute, as it has done the past several times, that means the debate over raising the limit would take place around the same time lawmakers must pass funding bills for the new fiscal year that begins on Oct. 1. On Sunday, Senate Majority Leader Mitch McConnell (R-Ky.) reiterated his promise that he would not let the U.S. breach the debt limit. But he also indicated that Republicans would try to attach conditions to an increase. \"I made it very clear after the November election that were certainly not going to shut down the government or default on the national debt,\" McConnell said on CBSs \"Face the Nation.\" \"We will figure some way to handle that. And, hopefully, it might carry some other important legislation that we can agree on in connection with it.\", Follow @JimPuzzanghera on Twitter, ]", "Date": "20150313", "Title": "[As U.S. hits debt limit, Treasury takes steps to extend borrowing]", "Link": "http://www.latimes.com/business/la-fi-debt-limit-treasury-lew-letter-20150313-story.html\n", "Author": "[Jim Puzzanghera]"}
