{"Content": "[Edward Morfin, a 57-year-old maintenance worker, speaks fluent Spanish. His surname is common in Mexico. But when Donald Trump made headlines last month for saying that Mexico sends immigrants to this country who are criminals, including rapists, Morfin wasnt outraged  he was glad. \"Finally somebody got up there and said what needed to be said,\" said Morfin, who was relaxing on a recent night at an Albuquerque festival that featured cumbia and salsa bands and a parade of classic cars. \"He said what everybodys thinking but is afraid to say out loud.\", SIGN UPfor the free Todays Headlines newsletter >>, Morfin is hardly typical of Latino public opinion. Nationwide, nearly 80% of Latino voters consider Trumps comments offensive, according to a recent survey commissioned by Univision, the Spanish-language entertainment and news network. But his views highlight a reality thats often overlooked in political debate. Even on a topic as emotionally charged as immigration, Latino opinion spans a broad spectrum. Among the record 28 million Latinos who will be eligible to vote in next years presidential election are groups with distinct cultural and political identities, including Cuban immigrants in Florida and generations-old Latino families in New Mexico and Colorado, many of whom embrace conservative views on key issues. That complexity of opinion is one reason why Republican strategists hope that with the right candidate  and a little bit of luck  they can reverse the pattern of Latinos voting overwhelmingly for Democrats. In New Mexico, where Latinos make up more than 40% of voters  more than any other state  Latino Republicans have made considerable gains, even though the state voted for President Obama in the last two elections. Republican Gov. Susana Martinez has taken a hard line on immigration issues. Among her top priorities is to repeal a law that gave drivers licenses to immigrants who are in the country illegally. She has had the support of many Latinos, including a large percentage who trace their roots not to recent immigrants but to the Spanish explorers who settled here in the 16th century. ------------, FOR THE RECORD, 11:55 a.m.: An earlier version of this article stated that New Mexico Gov. Susana Martinezs grandfather came to the U.S. illegally. Martinez has said that in the past, but the Associated Press more recently discovered documents showing her grandfather came to the U.S. legally. ------------, Martinez and her lieutenant governor, another Latino Republican, have condemned Trumps comments, which she called \"horrible things to say about anyone or any culture.\", TRAIL GUIDE: Daily tour through the wilds of the 2016 presidential campaign >>, When Trump announced his presidential candidacy in June, he said: \"When Mexico sends its people, theyre not sending their best. ... Theyre bringing drugs. Theyre bringing crime. Theyre rapists. And some, I assume, are good people.\", About two weeks later, Trump said he had been targeting the Mexican government, not its \"fabulous people.\", In an interview, Lt. Gov. John Sanchez said Trumps rhetoric was \"inaccurate and really divisive,\" but acknowledged that the comments might resonate with some Latinos. \"I dont think Hispanics respond in a monolithic way,\" Sanchez said, noting that some Latino immigrants who gained citizenship legally \"feel it is unfair that illegals would come here and cut the line.\", That diversity of views and limited polling make it hard to know whether Trumps comments have seriously damaged the GOPs standing among Latinos. For some, the remarks sparked fear of a growing anti-immigrant movement. In recent years, polls have shown that almost 3 out of 4 Latino voters believe an anti-Latino and anti-immigrant environment exists in the U.S. today. Albuquerque resident Teresa Guevara brushed off Trumps withering comments at first. A U.S. citizen who was born in Mexico, Guevara said many of her friends responded by making fun of Trump on Facebook. But her concern grew when she saw Trumps rise in the polls and the large crowds he was drawing to rallies, including one this month with Sheriff Joe Arpaio of Arizona, whom many Latinos see as anti-immigrant. \"Its scary, not just what he says, but in terms of people supporting that,\" said Guevara, who works for a nonprofit organization and who will be voting in her first presidential election next year. But whether reactions like that affect the GOP as a whole remains unknown. In the Univision survey that found large numbers taking offense at Trumps words, only 14% of Latino voters said his comments represented the views of the Republican Party, and 61% saying his comments represented only his own views. Gabriel Sanchez, a political scientist at the University of New Mexico, noted that the Republican brand had already been badly damaged among Latinos, especially those who favor a path to citizenship for the estimated 11 million people in the country illegally. In recent years, congressional Republicans have refused to take up an immigration overhaul bill favored by Democrats, saying increased border security must come first. \"Were at the basement in terms of the party brand among Latinos,\" Sanchez said. \"There isnt much lower to go.\", Republicans will probably need a large percentage of the Latino vote if they hope to win the White House. In 2012, Republican nominee Mitt Romney won nearly 6 in 10 white voters but lost the election because African Americans, Latinos, Asians and other racial minorities overwhelmingly voted for President Obama. Romney drew roughly 27% of the Latino vote, according to exit polls. With the country steadily growing less white, most Republican strategists believe their party needs to significantly improve on Romneys showing among Latinos to have a shot at the presidency. New Mexico Atty. Gen. Hector Balderas, a Democrat, said he didnt think the controversy around Trump was a death knell for Republicans. \"I think Latinos will evaluate each individual candidate on their merits and how they treat us,\" said Balderas, the son of a Mexican immigrant. \"I think the Latino community will be fair.\", Balderas said he, and many other Latinos, may be more offended by Trumps recent comments disputing the heroism of Sen. John McCain (R-Ariz.), who was held for more than five years as a North Vietnam prisoner of war and refused an early offer to be freed because other American prisoners had been held longer. \"This isnt the first time weve been disparaged,\" Balderas said. \"We may hold [Trump] more accountable for how he treats others.\", That was the view of David Vigil, 60, a retiree who said he is a registered independent. Trumps comments about immigrants did not bother him, he said. \"I disagree with them coming here illegally.\", But the comments about McCain made Vigil mad. Trump, Vigil said, is \"a lunatic.\", kate.linthicum@latimes.com, Twitter:@katelinthicum, ALSO:, Donald Trump says John McCain not a war hero; Republican rivals denounce him, Arizona crowd welcomes Donald Trumps tough stance on immigration, State GOP worries Donald Trumps trash talk could hurt its image]", "Date": "20150723", "Title": "[Donald Trump's comments offend many U.S. Latinos, but not all]", "Link": "http://www.latimes.com/nation/politics/la-na-trump-latinos-20150723-story.html\n", "Author": "[Kate Linthicum]"}
