{"Content": "[Joints, pot brownies, cannabisdosed sodas and other marijuana products will soon be sold in retail shops to any adult who wants them throughout a large chunk of the West, after voters in Oregon and Alaska approved legalization measures Tuesday. And an initiative approved overwhelmingly by Washington, D.C. voters legalizes the use and cultivation of marijuana there, but stops short of allowing retail sales. The states join Colorado and Washington, which legalized recreational pot sales only two years ago, in a remarkable change of fortune for legalization advocates who had been toiling for decades to lift the prohibition on the drug. Proponents this week overcame voter concerns surrounding the bumpy roll out of the taxing and regulatory plans for cannabis in the states where it was legalized in 2012  as well as many unwelcome headlines  in a sign that voter unease with the drug is rapidly fading. The outcome also was a clear sign that opinions on marijuana no longer fall neatly along partisan lines. The narrow passage of legalization in GOP-dominated Alaska, where 52% of voters cast ballots in favor, was considered a symbolic victory among cannabis advocates. The vote in the capital also had political significance, playing out in the backyard of federal government as advocates try to persuade Congress to soften drug laws. The Washington, D.C. measure was driven in large part by racial justice concerns, in a city where African Americans accounted for 91% of those arrested for drug possession, even though statistics show they are no more likely to use the drug than whites. Organizers are now setting their sights on California for 2016, where they are confident the states liberal-leaning electorate will opt to legalize sales for recreational use. Such an outcome would create a bulwark for marijuana permissiveness in the West, which proponents hope to bolster by targeting large states to the east for legalization measures in 2016 and shortly thereafter. This Election Day was an extraordinary one for the marijuana and criminal justice reform movements, Ethan Nadelmann, executive director of the Drug Policy Alliance, said in a statement. The alliance, a nonprofit bankrolled by billionaire George Soros, invested heavily in the Oregon measure through its political action affiliate, and it also provided advice and financial support to the Alaska initiative. These victories are even more notable for having happened in a year when Democrats were trounced at the polls, Nadelmann wrote. Reform of marijuana and criminal justice policies is no longer just a liberal cause but a conservative and bipartisan one as well. On these issues at least, the nation is at last coming to its senses. This election season was also notable for the opposition the marijuana movement attracted. Billionaire casino magnate Sheldon Adelson stepped up with $5 million to help defeat a fairly routine measure in Florida to legalize marijuana for medical use only. But the measure, which had a majority of support from voters, would have passed in most other states. It was done in by a Florida state law that requires 60% approval for constitutional measures to pass. It fell just a few percentage points short. Still, Adelsons involvement in the campaign marked the first time a mega-donor has gotten so deeply involved in fighting such a measure. Opponents of pot said they had never before been able to afford television time, and in Florida they had the resources to mount a sophisticated multimedia effort. Adelsons political advisor said the billionaire will be looking for other opportunities to fight legalization. Smart Approaches to Marijuana, a national anti-pot group, is vowing to step up its efforts. This was not the complete slam-dunk the legalization groups expected, said a statement from Kevin Sabet, president of the group. Alaska barely voted to legalize, and several cities rejected marijuana retail stores outright. We are confident the more people know the truth about marijuana and the Big Tobacco-like marijuana industry, the more opposition to marijuana legalization will continue to grow. For more on the politics of marijuana, follow me on Twtitter: @evanhalper]", "Date": "20141105", "Title": "[Pot legalization spreads through the West and into D.C.]", "Link": "http://www.latimes.com/nation/la-pn-pot-legalization-20141105-story.html\n", "Author": "[Evan Halper]"}
