{"Content": "[Former California Republican Party chairman Tom Del Beccaro has formed a fundraising committee to explore a run for the U.S. Senate seat being vacated by Barbara Boxer. Our country -- and our state -- is in serious need of new leadership, Del Beccaro said in a statement. Even though California has been the leader in the number of children living in poverty, government handouts and the victim of do-nothing politicians, our state can be prosperous with the right person in Washington. I believe we can and will turn our country around once and for all. The 53-year-old said in an interview this month that he was considering running because he believes it is critical for Republicans to have a credible candidate in the race. But he acknowledged the difficulty a GOP candidate has in a state where Democrats have a 15-point edge in voter registration. No Republican has been elected statewide in California since 2006, and many political observers predict that 2016 will create an additional hurdle for a GOP candidate. It is the same year as the presidential race, which tends to draw younger and more diverse voters who lean Democratic. Everyone is clear-eyed about the fact that it would be a tough, uphill climb, Del Beccaro said. But Del Beccaro also pointed to Californias top two primary system for nonpresidential contests, in which the top two vote getters move onto the general election regardless of party affiliation. Depending on the makeup of the primary field, there is a chance that two Republicans could wind up competing for the seat in the general election. It is also possible that two Democrats, or a Democrat and a Republican, would end up on the fall ballot. Del Beccaro is the second Republican to make a formal move toward a run. Assemblyman Rocky Chavez (R-Oceanside) announced last week that he was forming an exploratory committee. Another former state GOP chairman, Duf Sundheim, is also considering entering the contest. Atty. Gen. Kamala D. Harris, a Democrat, is the sole major candidate in the race so far. Former Los Angeles Mayor Antonio Villaraigosa and a handful of members of Congress are also considering bids. Follow@LATSeemafor political news. seema.mehta@latimes.com]", "Date": "20150224", "Title": "[Tom Del Beccaro forms Senate exploratory committee]", "Link": "http://www.latimes.com/local/political/la-me-pc-del-beccaro-forms-senate-exploratory-committee-20150224-story.html", "Author": "[Seema Mehta]"}