{"Content": "[Lt. Gov. Gavin Newsom said Monday morning that he will not run for the U.S. Senate seat being vacated by Barbara Boxer. Its always better to be candid than coy. While I am humbled by the widespread encouragement of so many and hold in the highest esteem those who serve us in federal office, I know that my head and my heart, my young familys future, and our unfinished work all remain firmly in the state of California --- not Washington, D.C. Therefore I will not seek election to the U.S. Senate in 2016, Newsom said. The former mayor of San Francisco has long expressed a desire to run for governor. He briefly ran the states top executive post in 2010 until it became clear that Jerry Brown would be the Democratic nominee, at which point Newsom successfully ran for lieutenant governor instead. Newsom also has three young children, and he and his wife are said to be reluctant to move their family from Marin County to Washington, D.C. But Newsom, like many prominent Democrats in California, had been urged to seriously consider a run for Boxers seat after she announced last week that she would not seek another term. The state last had an open U.S. Senate seat in 1992, and given Californias Democratic tilt, whichever candidate wins the post is nearly assured the job for as long as he or she wants it, barring scandal. Newsoms announcement intensifies the focus on Atty. Gen. Kamala Harris, who is also weighing a run. Harris and Newsom share many of the same supporters, have national profiles, are both from the Bay Area and are popular among the liberal wing of the Democratic Party. Their backers have long hoped that the pair would avoid running against each other in what would be an ugly battle. The unanswered question is whether Harris also wants to be governor. On Sunday, she demurred when asked by a reporter at an event in Los Angeles whether she would run for Boxers seat. I am just enjoying this day, thank you, she told The Times after giving a short speech at the City Club about her goals in her second term as the states top law-enforcement officer. Newsom, 47, joins Los Angeles Mayor Eric Garcetti in taking himself out of the running for the Senate seat. Former Los Angeles Mayor Antonio Villaraigosa and billionaire environmental activist Tom Steyer are seriously considering bids, as are several members of Congress. On the Republican side, Assemblyman Rocky Chavez and two former state GOP chairmen are weighing runs. Follow@LATSeemafor political news. seema.mehta@latimes.com]", "Date": "20150112", "Title": "[Lt. Gov. Newsom passes on Senate run for Boxer seat]", "Link": "http://www.latimes.com/local/political/la-me-pc-lt-gov-newsom-passes-on-senate-run-20150112-story.html\n", "Author": "[Seema Mehta]"}
