{"Content": "[Kevin Drum, whosepenetratingblog postsatMother Jones aremust-reading for anyone with a serious interest in economics and public policy, was diagnosed last yearwith multiple myeloma, a cancer of the blood plasma cells. Since then, he has allowed his readers to traversethe healthcare landscapewith him via regular updates. This week heconnected the dots between his medical condition and the Republican Partys oft-expressed determination to repeal the AffordableCare Act. Drum wrote that, because of his condition, Republican healthcare policy sharply raises the stakesof the 2016 election for people in his position. By undoing the Affordable Care Act, he observed, a Republican Congress and Republican president could leave millions of Americans without access to affordable coverage:, \"This is more personal for me than usual. Scary, too. There are no guarantees in life, and theres no guarantee that MoJo will employ me forever. If I lose my job, and Republicans repeal Obamacare, I will be left with a very serious and very expensive medical condition and no insurance to pay for it. And I feel quite certain that Republicans will do nothing to help me out.\", Thats all true. Among the most important provisions of the ACA isa prohibition against refusing insurance to individuals with preexisting medical conditions, or even pricing it higher for them than for healthy individuals. This eliminates the risk that people could become uninsurable if they fallsick -- a verycommon riskin the pre-Obamacare days. As we reported a couple of weeks ago, the Congressional GOP does not have a coherent plan for healthcare reform ifthey repeal Obamacare. That was made even clearer this week when they released their proposed budget resolutionfor the coming year. The budget plan includes repealingObamacare. But it presents not a whit of rationale for doing so, while utterly ignoring the mounting pile of documentation that the Affordable Care Act works extremelywell. \"Repeal Obamacare\" is a Republican shibboleth, a litmus test for showing your right-wing credentials. Its not a healthcare reform policy but a nihilistic absence of one. As Richard Mayhew, the health insurance blogger at Balloon-Juice.com (like me one of Kevins fans), wrote succinctly of the stakes: \"Cancer can hit anyone, and under the Republican plan, a one time cancer diagnosis and recovery screws a person for life. Under the Democratic current law and future policy plans, that person is not screwed for life.\", You should send Kevin your best wishes, whether via his blogs comment thread, tweeting @kdrum, or ESP. And you should keep in mind that the Affordable Care Act is more than just a political football; its a policy reform on which flesh-and-bloodpeoples lives depend. Keep up to date with the Economy Hub. Follow@hiltzikmon Twitter, see ourFacebook page, or emailmhiltzik@latimes.com.]", "Date": "20150320", "Title": "[A look at the real-life consequences of repealing Obamacare]", "Link": "http://www.latimes.com/business/hiltzik/la-fi-mh-obamacare-repeal-can-have-reallife-consequences-20150319-column.html", "Author": "NULL"}