{"Content": "[Emilys List announced its endorsement of California Atty. Gen. Kamala Harris bid for the U.S. Senate on Thursday -- another nod for her candidacy from the Democratic establishment. The group, which has a network of donors across the nation, is dedicated to electing Democratic women who support access to abortion. But the move is unusual, because Emilys List often stays clear ofcontests in whichthere are other potential candidates who fit its criteria. The field for the seat being vacated by Sen. Barbara Boxer is far from set, with the filing deadline still a year away. In the 2013 Los Angeles mayors race, for example, the group made no endorsementin the primary, which featured two Democratic women among the contestants. Emilys List waited till then-City Controller Wendy Greuel emerged as the sole female candidate in the runoff before backing her. Harris is so far the only major Democratic candidate in the race, but others, including Rep. Loretta Sanchez, are considering a run. Emilys List President Stephanie Schriock pointed to Harris track record as attorney general in explaining why the group was backing her. Kamala Harris is a battle-tested progressive champion, she said. As Californias top cop, she has fought to give women, children, seniors and immigrants a fair shot . Kamala Harris is continuing Barbara Boxers legacy of standing up for all women and families. Schriock also noted that Harris made history when she was elected Californias attorney general -- as the first African American, Asian American and woman to hold the post -- and noted that she would be the second African American woman elected to the U.S. Senate. Carol Moseley Braun was the first female African American senator when she represented Illinois in the nations upper legislative chamber from 1993 to 1999. Harris pointed to Emilys List three-decade history supporting women for elected office, notably Sen. Dianne Feinstein and Boxer in 1992, which she described as \"an election that stunned the nation.\", \"I am so grateful today to now have the support of EMILYs List in my campaign and look forward to continuing their proud legacy,\" Harris said. Emilys List has previously signaled support for Harris, sending out messages to its 3 million members when she announced her bid. The group alsohad her speak at its 30th anniversary gala this month, shortly before an address by former Secretary of State Hillary Rodham Clinton. Harmeet Dhillion, the vicechairman of the California Republican Party, said that while the groups decision to endorse Harris before the field was set was a clear break fromits traditions, it was not surprising given the level of Democratic rallying around Harris. This is part of the coronation process, she said. But Dhillon added that she did not believe Harris was unbeatable, and that the general election is 20 months away, in November 2016. I do not think shes inevitable by any stretch of the imagination, Dhillon said. Its a big state and its a big office and theres a long time between now and the election. Nothing is certain in politics. Harris primary competition in the race so faris GOP Assemblyman Rocky Chavez of Oceanside. He faces a challengebecause he is far less known than Harris, whommore than half of California voters could not identifyin a recent USC Dornsife/Los Angeles Times poll, and because of the demographic tilt of the state. Harris, who entered the contest within days of Boxers January announcement that she would retire, has been fundraising and lining up endorsements ever since, leading to criticism by some that she was being anointed by party leaders in California and the nations Capitol. If Harris bid runs into trouble, Emilys List has the potential to help her significantly. The group raised $60 million for contenders in last years electionsand for its political action committee that can support candidates independently. Its independent expenditure arm spent $14 million to help 2014 contestants. Follow@LATSeemafor political news. 3:30 p.m.:This post has been updated with comments byHarmeet Dhillion, the vicechairman of the California Republican Party. 11:05 a.m.: This post has been updated with the announcement by Emilys List of its endorsement of Kamala Harris. This post was originally published at 5 a.m.]", "Date": "20150319", "Title": "[Emily's List backs Kamala Harris' Senate bid]", "Link": "http://www.latimes.com/local/political/la-me-pc-emilys-list-backs-kamala-harris-senate-bid-20150318-story.html\n", "Author": "[Seema Mehta]"}
