{"Content": "[Sen. Bernie Sanders, the self-described socialist who kicked off his presidential campaign on Tuesday with a characteristically fiery speech, isnt going to win the 2016 Democratic nomination unless lightning strikes. To be really effective, in any case, the lightning would have to strike Hillary Rodham Clinton, who holds a prohibitive lead in every poll. But Sanders will still have a major impact on the Democratic race, and that could, paradoxically, be good for Clinton. The Vermont senator preaches a bracing populist message thats likely to thrill millions of voters on the left, the ones who sometimes dub themselves \"the democratic wing of the Democratic Party.\" A lot of those progressives are democratic socialists, whether they realize it or not; the only unusual thing about Sanders is that he actually uses the \"S-word.\", \"There is something profoundly wrong when the top one-tenth of 1% owns almost as much wealth as the bottom 90%,\" Sanders said at a raucous lakefront rally in Vermont. \"This type of rigged economy is not what America is supposed to be about.\", He said he hopes to \"begin a political revolution to transform our country economically, politically, socially and environmentally.\" And he has a detailed program to do it. Sanders wants to raise taxes on the rich not only to limit the flow of income to the upper crust but also to redistribute some of their accumulated wealth. He wants to impose a federal sales tax on stock trades and other financial transactions to pay for free tuition at every public college. He wants to open Medicare to everyone, young or old, creating a European-style single-payer healthcare system. He wants to break up big banks, clamp more regulation on Wall Street and outlaw massive donations to political campaigns. Even without a full-blown national campaign, those ideas have been enough to vault Sanders into second place in surveys of Democrats in early primary states. Well, perhaps \"vault\" is an overstatement: He draws 15% in Iowa and 18% in New Hampshire, still far behind Clintons 60% or so. Heres the key to those poll numbers: Sanders is winning almost exactly the same levels of support that Sen. Elizabeth Warren (D-Mass.) drew in early surveys. Now that shes made it clear she isnt running, pollsters are leaving her name off, and Sanders appears to be inheriting her support. The Vermont socialist, who once chafed at comparisons with his progressive colleague, now readily embraces the role of her stand-in. \"I think our views are parallel on many, many issues,\" he told a reporter this week. So why is this challenge good for Clinton?, First, as Sanders himself acknowledges, hes \"a major underdog\"; hes not likely to win. Second, until now most of the media coverage of Clintons campaign has focused on secret emails, entanglements with uranium moguls and outlandish speaking fees. If Sanders forces a robust debate on issues such as healthcare, taxes and trade, the media will have to pay attention to that instead. Sanders entry into the race will allow Clinton, who has already veered left, to call for vaguely similar policies and still say: \"Hes a socialist; Im not.\", On a superficial level, moreover, Sanders presence on the stage will make Clinton, 67, seem relatively young. Sanders is 73; if he won the presidency, hed be 75 at his inauguration, more than five years older than Ronald Reagan in 1981. Finally, Sanders will give voters a reason to watch the Democratic debates  and maybe even get excited about the partys ideas, an emotion thats been missing until now. \"There are signs that Democratic voters are demoralized,\" Andrew Kohut, a pollster at the independent Pew Research Center, told me. \"If that persists, it can depress their turnout on election day.\", A recent Pew poll, for example, found that only 58% of Democrats said they had given a lot of thought to the presidential campaign, down from 71% eight years ago. Meanwhile, the Ipsos polling organization projected that voter turnout next year could drop to 50%, down from 55% in 2012  a trend thats especially bad for Democrats, since Republicans turn out more reliably. A Sanders campaign wont be all sweetness for Clinton, to be sure. He isnt a forgiving soul; he has already come close to calling the likely nominee a plutocrat. \"Its not just the Clintons,\" he told CNBC last week. \"When you hustle money like that  you sit in restaurants where youre spending  I dont know what they spend  hundreds of dollars for dinner and so forth. Thats the world that youre accustomed to, and thats the worldview that you adopt.\", But Clinton already knew she had that vulnerability, and so did her voters; its already reflected in her poll numbers. At this stage, Sanders cant beat Clinton; only Hillary and Bill Clinton can beat Hillary Clinton  in the form of new problems with emails or finances or other peccadilloes as yet undiscovered. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150527", "Title": "[Bernie Sanders: Why the guy who won't win matters]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0527-mcmanus-bernie-sanders-20150527-column.html\n", "Author": "NULL"}
