{"Content": "[After a lengthy debate, the Senate approved a contentious bill on Friday that would grant President Obama the power to speed up passage of trade deals, but a tougher battle is expected in the House. The 62-37 vote to give the president so-called fast-track authority is a big boost for his top economic priority, bringing him closer to his goal of forging an ambitious Pacific free-trade accord known as the Trans-Pacific Partnership. Todays bipartisan Senate vote is an important step toward ensuring the United States can negotiate and enforce strong, high-standards trade agreements, Obama said. I want to thank senators of both parties for sticking up for American workers by supporting smart trade and strong enforcement, and I encourage the House of Representatives to follow suit.\", The hard-fought legislation, which Senate Democrats initially blocked in an unusual rebuke of the president, now moves to the House where there appears to be considerably greater resistance from both Democratic leaders and some conservative Republicans. Many Democratic lawmakers face enormous pressure to vote against fast-track, from constituents in their districts, organized labor and a hodgepodge of consumer groups representing doctors, the environment and an open Internet, among others. The Republican leadership, while traditionally favoring free trade, has found itself in a rare position of cooperating with Obama, but some GOP members are still loath to give the president a greater hand on anything, let alone one that would help him seal Americas biggest-ever trade deal. The real game is in the House, said Bill Reinsch, president of the National Foreign Trade Council, which like other business associations is strongly behind fast-track and the Trans-Pacific Partnership. Frankly, the bigger problem is how many Republicans were going to lose than how many Democrats we get. At this point, congressional insiders and analysts trying to handicap the House vote -- which could come as soon as early June -- say 17 Democrats have firmly come out in favor of fast-track. About 190 Republicans, meanwhile, are known to be backing it, but where the remaining 55 House Republicans stand on the issue isnt entirely clear. If all of the latter vote against fast-track and Obama doesnt win about a dozen more Democrats to his side, the president will fall short of the majority vote needed to succeed. Fast-track, more formally known as trade promotion authority, is seen as essential to concluding the TPP. The authority would allow the president to submit a negotiated pact knowing that Congress must vote it up or down with no amendments. The White House says trading partners have been reluctant to show their final hand when theres risk the deal could be changed by American lawmakers. The Pacific trade negotiations involve the U.S. Japan and 10 other nations that combined make up 40% of the world economy. Their purported aim is to craft a comprehensive package that would not only remove tariffs but also devise rules and standards on things like intellectual property and cross-border data flows. Obama has argued that expanding trade and investment opportunities in the Pacific Rim is crucial to American economic and geopolitical interests, especially in the face of a rising China. But many Democrats are concerned that freer trade will hurt U.S. industries and jobs, and some high-profile opponents such as Sen. Elizabeth Warren (D-Mass.) have sharply criticized the Trans-Pacific Partnership for both the secrecy in which negotiations have been conducted and certain elements of the proposed pact that have been shared with lawmakers under strict confidentiality rules. Obamas fast-track victory in the Senate was practically assured after a bloc of pro-trade Democrats ended a one-day filibuster earlier this month after bipartisan leaders agreed to add expanded worker retraining assistance to the bill and take up separately a measure to punish nations that manipulate currency values to boost trade. The Senate earlier easily passed the currency manipulation bill, but experts agree it was largely a symbolic action as it has almost no chance of clearing the House. A separate currency measure, offered Friday as an amendment to the fast-track bill, brought a veto threat from the White House and prompted Obama to personally lobby senators against it. It was narrowly rejected. How quickly the House will act on the fast-track legislation depends on when the GOP leadership thinks it has enough votes for passage. With control of both chambers of Congress, Republican leaders will have little trouble moving things along speedily. Time is pressing on Obama. Assuming fast-track is approved in June, analysts say, negotiators could wrap up the Pacific trade deal in July. The fast-track legislation calls for the president to wait 90 days for people to review the agreement before he signs it. Then it could take another two to three months for U.S. trade officials to prepare an economic-impact assessment of the deal, pushing a vote on the trade agreement by Congress into late this year at the earliest. The longer it takes, the more it will bump up against the 2016 presidential campaign and election-year politics, when sensitive issues like trade can complicate legislation. So while getting fast-track through Congress may be the biggest hurdle for Obama in his bid to finish the trade pact, analysts say, a successful House vote doesnt necessarily mean a smooth path ahead. On Thursday, some last-minute drama nearly blocked the fast-track bill from advancing at all. A few lawmakers threatened to withhold their vote because of an unrelated dispute over the future of the U.S. Export-Import Bank, which is in jeopardy of shutting down next month if Congress fails to reauthorize it. The bank helps major U.S. corporations finance their business overseas, but it has become derided by tea party Republicans as a form of corporate welfare. Republicans in the House have said that they would prefer to allow the bank to wind down, rather than continue it. But several lawmakers from both parties have businesses in their states that depend on the bank and have pressed for it to continue. After hurried negotiations on the Senate floor, a deal was reached to allow a separate vote on extending the banks authority, removing the final hurdle standing in the way of advancing the trade bill. , , , 6:46p.m.: The story was updated with Obamas comment.]", "Date": "20150522", "Title": "[ Senate passes fast-track trade authority for Obama, but House fight looms]", "Link": "http://www.latimes.com/nation/la-na-senate-fasttrack-tpp-vote-20150522-story.html\n", "Author": "[Don Lee, Lisa Mascaro]"}
