{"Content": "[When Donald Trump disparaged Mexican immigrants as rapists and drug-runners during his presidential announcement, the slurs were initially dismissed as just another outrageous pronouncement from the blustery billionaire. But as Latinos reel in anger and celebrities and corporate sponsors drop their associations with Trump, the Republican Partys other presidential hopefuls face an increasingly uncomfortable choice: engage with Trump and elevate his already high visibility, or stay silent and risk appearing to condone his statements. So far, most have said little, hoping the controversy will fade. Its the latest Latino problem for the GOP, which will have great difficulty winning the White House if it fails to expand its overwhelmingly white base to include minorities. The problem will only worsen if Trump continues to do well enough in polls to qualify for the partys televised debates. On Wednesday, the controversy mounted as retailer Macys announced it was severing ties with Trump, joining broadcasters Univision and NBC. The moves reflected the growing clout of Latino consumers as well as corporate Americas declining tolerance for racially inflammatory remarks. Trump fired back characteristically, saying that Macys and NBC had totally caved, and that their moves show they support illegal immigration. Republican strategist Ana Navarro said most Republicans viewed Trumps remarks as cringe-worthy, but were reluctant to speak out. Its like getting into an argument with your crazy, distant uncle at Thanksgiving, she said. Why do it when you know hes crazy and you only see him once a year? Most Republicans would prefer to close their eyes and hope that when we open them again, Trump will be gone. Problem is, hes surging in polls and the backlash to his comments is getting bigger and longer. He is the toothache you cant get rid of. Frank Sharry, executive director of the immigration advocacy group Americas Voice, said he was surprised that GOP leaders had not come out more strongly against Trump. Can you imagine if he was talking about Jews? African Americans? Sharry said. Would the GOP stand up? Of course they would. ... But the silence of the GOP on this is defining the party. The flare-up could be a foretaste of what the GOP can expect when the partys presidential debates start next month. With 14 major GOP contenders in the race already and two more on the way, the publicity-loving Trump may have every incentive to interject something inflammatory as a way to stand out. Trump now ranks second after former Florida Gov. Jeb Bush among Republicans nationally, according to a CNN/ORC poll released Wednesday, and he ties for second in the early nominating states of Iowa and New Hampshire, according to other surveys. Thats well above the threshold Trump would need to participate in the first debate in August on Fox News. Having him on stage would be a nightmare scenario for the GOP, said Republican strategist Rick Wilson. Trump is like a trap for us. Theres a segment of people in my party who find this sort of spittle-flecked populism appealing  the bluster of a bellowing, screaming loudmouth  because they think thats the way to win, Wilson said. Theyre frustrated about a lot of things in the Republican Party. But this is not a solution to their problem. This is a solution to [Democratic front-runner] Hillary Clintons problem. Trump has refused to back down or apologize, telling Fox News this week that his June 16 remarks  in which he characterized those crossing the U.S.-Mexico border as mostly criminals, drug-runners and rapists  are totally accurate. He filed a $500-million lawsuit against Univision for announcing it would drop coverage of the Miss USA pageant, which Trump co-owns. Trumps comments have ricocheted across Latino communities in the United States and abroad, reminding many of past GOP attitudes  including 2012 Republican presidential nominee Mitt Romneys suggestion that immigrants in the United States illegally should simply self-deport, and Rep. Steve Kings (R-Iowa) assertion that young people coming to the United States had calves the size of cantaloupes from carrying drugs across the border. Among the GOP candidates, Sen. Ted Cruz (R-Texas) defended Trump, calling him terrific and saying, He speaks the truth. Bush, whose wife is Mexican American and who has openly courted Latinos, has said little publicly beyond a response he gave in Spanish over the weekend to a reporters question after a town hall meeting in Nevada. I do not agree with his remarks, Bush said, according to a translation provided by the campaign. They do not represent the values of the Republican Party and they do not represent my values. The man is wrong. Sen. Marco Rubio (R-Fla.), whose parents are from Cuba, has not directly weighed in but appeared last week to downplay the importance of Trumps remarks, calling Trump an incredibly entertaining person. Gov. Scott Walker of Wisconsin, another leading Republican candidate, though undeclared, said the controversy highlights the need to tighten border security. People want to come here because America is a country full of opportunity  good people and bad are coming across our border, Walker said. A spokesman for the Republican National Committee dismissed Trumps comments as last weeks news. But privately, GOP officials are deeply concerned that the controversy will expose the partys bitter divisions over what to do about the nations immigration problem. The Republican Party has worked so hard to try to be inclusive, and to have someone like this spout hate, it just turns everything backward, said Abel Maldonado, a Republican former lieutenant governor of California. Him out there giving hate speech and calling himself a Republican is music to Hillary Clintons ears. Bush and Rubio are widely considered to be the partys strongest candidates for fixing its strained relationship with the fast-growing Latino electorate. Rubio supports some sort of pathway to citizenship for those here illegally, but after a conservative backlash he backed away from a comprehensive immigration overhaul he helped craft in Congress in 2013. Bush said in 2014 that illegal immigration should be seen not as a felony but as an act of love by families seeking to reunite. But his views have shifted over the years on a path to citizenship, leaving his current approach uncertain. Most of the rest of the crowded GOP field, with the exception of immigration-reform supporter and long-shot candidate Sen. Lindsey Graham of South Carolina, are running to the right in a way that may appeal to conservative primary voters but not necessarily to the broader electorate. Cruz wants to undo President Obamas executive actions that are helping millions of immigrants temporarily stay in the country without threat of deportation. Walker, who once voiced support for a pathway to citizenship, now has called for those here illegally to go back to their country of origin and apply to reenter legally. Ruben Barrales, the director of Grow Elect, a political committee that supports Latino Republican candidates in California, said Trumps remarks may provide an opening for other GOP candidates, notably Bush and Rubio, who are actually talking about hope and opportunity and reaching out to Latino voters. The eventual GOP nominee will probably need to capture more than 40% of Latino voters to reach the White House, strategists say, a mark not hit by a Republican since George W. Bushs 2004 reelection. That becomes increasingly difficult if the party is seen as hostile to immigrants, especially as Clinton has promised to uphold Obamas executive actions and to create a citizenship pathway. Most Americans, including Republicans, back that approach to citizenship. Democrats have pounced on the opportunity to use Trumps comments against the GOP. As long as Republicans fail to denounce the hateful and divisive comments made by Donald Trump, it will only confirm the GOPs hostility toward the immigrant and Latino community, said Rep. Linda T. Sanchez (D-Whittier), the chairwoman of the Congressional Hispanic Caucus. lisa.mascaro@latimes.com, Times staff writer Kate Linthicum in Los Angeles contributed to this report. 6:23 p.m.:This article has been updated for additional details. 4:39 p.m.:This story has been revised throughout. 3:55 p.m.: This story was updated with more reaction and background. 12:35 p.m.: This article was updated to add comments from Republican strategist Ana Navarro.]", "Date": "20150701", "Title": "[Donald Trump's comments on immigration complicate GOP's 'Latino problem']", "Link": "http://www.latimes.com/nation/la-na-trump-latinos-gop-20150701-story.html\n", "Author": "[Lisa Mascaro]"}
