{"Content": "[The federal government will embrace a much more active role in shaping efforts to integrate neighborhoods by race and class under new rules announced Wednesday. The rules, to be detailed by Housing and Urban Development Secretary Julian Castro at a speech in Chicago, require somecommunities around the country to study patterns of segregation and make plans to reduce itor to more evenly spread government resources. The rules clarify how grant recipients must meet a standard that was set in the Fair Housing Act of 1968 but has been inconsistently enforced. Supporters hope HUDs new plans  another instance of the Obama administration using its executive power to take on an entrenched issue  will create more low-income housing in neighborhoods with access to jobs and good schools, while detractors say the Obama administration is meddling in an issue best left to local communities. Too many Americans find their dreams limited by where they come from, and a ZIP code should never determine a childs future, Castro said in a statement. This important step will give local leaders the tools they need to provide all Americans with access to safe, affordable housing in communities that are rich with opportunity. The rules come on the heels of a major win for proponents of more integrated housing at the Supreme Court and an announcement that HUD is considering amending its calculations for low-income vouchers to attempt to allow more of their recipients to move into areas with increased access to jobs, transportation or education. Conservative critics call it federal overreach. HUD bureaucrats will be in a position to decide on their own whether your particular town meets their ideal of racial and income distribution, said Hans von Sankovsky of the Heritage Foundation. And if you dont meet their ideal of that mix, youre not going to get any money. But supporters hope the rules will help to reverse long-standing segregation they say has contributed to the persistence of racial and socioeconomic inequality. The point of the Fair Housing Act is racial integration in our residential situation, said University of Kentucky Law School Professor Robert Schwemm. All you have to do is look out at Baltimore or Ferguson or South Carolina and realize we havent made wonderful progress in the last 45 years. Research increasingly points to the idea that living in certain neighborhoods gives low-income families better opportunities. One study found that young children who moved from public housing to a low-poverty area would make an average of $302,000 more over the course of their lifetimes. In the same experiment, adults who moved to lower-poverty areas had better health outcomes. Bundled together with where you live is a whole bunch of other things like where your kids go to school, what kind of transportation is going to serve you, what kinds of jobs you have access to, whether you have a healthy environment, said Debby Goldberg of the National Fair Housing Alliance. The goal of this rule is to make sure we have greater equity and equality in terms of access to the opportunities that people need to succeed in life. The rules will require communities to identify segregation related to race and poverty and assess whether some areas have less access to resources such as public transportation and high-quality schools. Some who support the rules goals are nonetheless concerned that helping families move to higher-opportunity locations could drive some communities to move resources out of areas that need them the most. You dont want to further disinvest in neighborhoods that are challenged, former Assistant Secretary for Housing and Federal Housing Commissioner Carol Galante said in an interview before the final rules were announced. I would hope that at the end of the day were not talking about a zero sum game, but at the moment, its hard not to view it as that. Libby Starling, who piloted a similar planning process at the Metropolitan Council in the Twin Cities, said she found the process useful, but noted that it raised some concerns about the best policy prescriptions to deal with inequality among neighborhoods, especially when it comes to race. There are people of color who choose to live with other people of color. There are people of color who choose to live in predominantly white neighborhoods, she said. Both choices are viable. Both skeptics and supporters alike acknowledge that they are waiting to see how vigorously HUD enforces these rules to determine how significant their impact will be. In my view, its a very modest first step because theres no content in these rules about what HUD is going to do if jurisdictions dont do something to desegregate, Richard Rothstein, a research associate at the Economic Policy Institute, said ahead of Wednesdays announcement. But others are more optimistic that the planning process itself will lead communities to frank and productive conversations about residential segregation and access to resources. Americans really do care about broader society and broader community. I think that just by virtue of having that conversation were going to see a bunch of really innovative and really interesting things emerge, said Raphael Bostic, former assistant secretary for policy development and research at HUD. Marlene Nagel, who coordinated a similar analysis for the Mid-America Regional Council, said she thinks it raised awareness locally of issues related to affordable housing and access to resources. There has been an increased recognition of the need for greater housing choice throughout our community, she said. Twitter:@cdiersing]", "Date": "20150708", "Title": "[HUD chief on new housing rules: 'ZIP code should never determine a child's future']", "Link": "http://www.latimes.com/nation/la-na-fair-housing-rules-20150708-story.html\n", "Author": "NULL"}
