{"Content": "[President Obama acknowledged Wednesday that he was disappointed with the wave of losses that Democrats endured in the midterm elections but said he viewed the result as a sign that Americans want change in Washington and want elected officials to \"get stuff done,\" rather than as a repudiation of his policies.  Speaking at length to reporters, Obama resisted taking responsibility for the outcome, in contrast to his response to the last midterm elections in 2010, when he admitted his party suffered a \"shellacking. The American people sent a message, one that theyve sent for several elections now: They expect the people they elect to work as hard as they do, he said Wednesday. They expect us to focus on their ambitions and not ours. They want us to get the job done. All of us, in both parties, have a responsibility to address that sentiment. But Obama signaled that he wouldnt adopt a new strategy for dealing with Congress. He repeatedly invited Republicans to work with him but, short of that outcome, said he plans to march ahead on his own a range of issues including reform of the immigration system, climate change and the implementation of his landmark healthcare law. That likely means through executive actions rather than legislation. On immigration, he said he would act before the end of the year, though he would still rather see Congress pass a bill he can sign. If, in fact, there is a great eagerness on the part of Republicans to tackle a broken immigration system, then they have every opportunity to do it, he said. My executive actions not only do not prevent them from passing a law that supersedes those actions, but should be a spur for them to actually try to get something done. Obama has invited congressional leaders to meet with him Friday, and he outlined three issues where he saw a chance for Republicans and Democrats to work together in the lame-duck session of Congress before the year ends: passage of a federal budget, taking on Islamic State militants in the Middle East and the response to the deadly Ebola virus. To that end, he asked Congress on Wednesday for more than $6 billion in emergency funding to beef up the fight against Ebola in the three West African countries it is has ravaged and to monitor the U.S. system for preventing the spread of the deadly virus at home. The request included $4.5 billion for equipping healthcare workers and clinics to fight the Ebola outbreak, while some $1.5 billion would go into a contingency fund to cover future needs. The U.N. has said it will take at least $1 billion to fight the outbreak in West Africa. He also said he would have a top military official brief leading lawmakers about the fight against Islamic State militants, and that he would continue discussions about a new congressional authorization to attack the extremists that is \"right-sized and updated,\" rather than relying on legal authority that Congress granted the president more than a decade ago to fight Al Qaeda. Obama also mentioned certain amendments to his signature healthcare law that hed be willing to accept, possible peace offerings in the hours after Republicans swept key congressional races and set themselves up to take over both chambers of Congress early next year. He said he wouldnt consider major changes like a removal of the provision requiring every person to have health insurance. But he said he would be \"open and receptive\" to ideas for making \"responsible changes.\", The Republican wins in key states coincided with votes in support of raising the minimum wage, giving hope to Obama that he might be able to work on that issue with GOP leaders. White House officials also say Obama will raise the idea with congressional leaders of reforming the corporate tax structure to pay for infrastructure improvements, and that hes open to discussing all the options that might make such a thing palatable to Republicans. Still, hours after a sound defeat for Democrats in gubernatorial and congressional races around the country, the president didnt appear to be contemplating any personal change in response. \"Every election is a moment for reflection,\" he said. \"Everybody in this White House is going to look and say,\"What do we need to do differently? ...But the things that motivate me every single day ...those thingsarent going to change.\", Republicans read the results of the election differently, talking about the perils of overreach during Obamas remaining tenure. In his home state of Kentucky, Senate Republican leader Mitch McConnell said the presidents contemplated action would be like waving a red flag in front of a bull. But McConnell extended an offering of his own, insisting that Republicans would not engage in brinkmanship over the federal debt ceiling as they did in 2011 or consider another government shutdown as they did in 2012. For his part, Obama said he was savoring the possibilities of his remaining time in office, and vowed to work like he is playing the final period of a competitive basketball game. Obama said he wants to be able to say,\"We played that fourth quarter well. For more White House coverage, follow @cparsons]", "Date": "20141105", "Title": "[Obama acknowledges defeat but recommits to acting without Congress]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-obama-midterm-vote-reaction-20141105-story.html\n", "Author": "[Christi Parsons]"}
