{"Content": "[Vowing to quickly sign legislation that would lower taxes, New Jersey Gov. Chris Christie delivered a State of the State address Tuesday calling for bipartisanship and more economic stability in his state as he ponders a run for the White House. Christie, a Republican serving his second term, called New Jersey a state with \"assets that many other states just cannot match.\", \"A highly educated workforce. A world-class transportation network. Proximity to large markets. The shore,\" Christie listed. In his hourlong address before lawmakers, Christie hammered on key Republican pillars, chief among them lowering taxes and shrinking the size of government. Christie mentioned the recent departure of a Mercedes-Benz plant to Georgia because that state offered a more alluring tax credit package along with its lower state tax rates. \"Dont take my word for it -- the leaders of Mercedes said it themselves. Economic incentive laws help, but lower taxes are better,\" Christie said, notingthat since he took office hes vetoed four bills that sought to raise taxes. Christie said his administration \"believes today -- and has always believed -- that New Jersey and America will be a better place for middle-class families by shrinking the size of government,\" he said. As chairman of the Republican Governors Assn. last year, Christie received flak from constituents because he was often on the road stumping and raising cash for GOP candidates during the midterm election cycle. More recently, some have criticized Christie for cozying up to Dallas Cowboys owner Jerry Jones; the two were regularly spotted together at football games. Despite his focus on New Jersey, Christie did take aim at Washington, possibly nodding to a potential run for the presidency in 2016. \"During this time of uncertainty it seems our leaders in Washington would rather stoke division for their own political gain,\" Christie said. \"This culture of divisiveness and distrust has seeped into our communities and our neighborhoods.\", Before his address, Christie drew some criticism for holding an off-the-record session with a handful of national news outlets. No local media were allowed at the session, and the Democratic National Committee sent out an email to supporters alleging Christie is not truly focused on New Jersey residents. Last year, Christie was the focus of an investigation into a scheme perpetrated by his aides to snarl traffic leading to the George Washington Bridge. Democrats, who control both chambers of the state Legislature, held hearings that explored whether Christie had any knowledge of the bridge closure. A federal probe of the incident is ongoing. On Tuesday, Christie alluded to the scandal, saying its been \"ayear with plenty of politics from some overly partisan corners of this chamber.\", As speculation continuesto swirl around when he will make an official announcement about his 2016 intentions, Christie went off message from his prepared remarks and offered state lawmakers a peek into his intentions for next year. \"Ill be here in one year,\" he said to tepid applause from the chamber filled mostly with Democrats. \"Ill be here in one year.\", Follow @kurtisaleeand emailkurtis.lee@latimes.com]", "Date": "20150113", "Title": "[Chris Christie touts New Jersey, assails D.C. in State of the State speech]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-chris-christie-state-state-20150113-story.html\n", "Author": "[Kurtis Lee]"}
