{"Content": "[Donald Trump, whose bombastic statements have shot him to the top of Republican presidential primary polls, mocked Sen. John McCains war record as a POW in Vietnam on Saturday, crossing a line that triggered condemnations from previously quiet GOP leaders and rivals. They used their strongest terms to date  calling Trumps comments slanderous, declaring him unfit for office, and asserting that the Republican Party has no tolerance for disparaging statements about combat veterans. The question now is whether Trump, who saw his campaign take off after broadly denouncing Mexicans who cross the border illegally as rapists and drug dealers, will remain popular with segments of the GOP base who revere military service, prisoners of war and the 2008 presidential nominees connection to both. Hes not a war hero, Trump said at the Family Leadership Summit in Ames, Iowa, in response to a question about McCain, who has sharply criticized Trumps withering comments on immigrants. Hes a war hero because he was captured. I like people that werent captured, OK? I hate to tell you. Hes a war hero because he was captured, OK? And I believe  perhaps hes a war hero. But right now, hes said some very bad things about a lot of people, Trump said. McCain, a Navy aviator during the Vietnam War, suffered several broken bones and spent more than five years as a prisoner in North Vietnam, including two years in solitary confinement, after his Skyhawk was shot down during a bombing mission over Hanoi in 1967. McCain, the son of the U.S. Navy commander in the Pacific at the time, refused North Vietnamese offers for an early release because Americans captured before him remained prisoners of war. He was released in 1973, and has served Arizona in the Senate since 1987. The Republican now heads the Senate Armed Services Committee. Trump received four student deferments from the draft between 1964 and 1968 and a medical deferment that kept him out of the military, according to reports published in 2011. For all the expressions of indignation, the dust-up inevitably was a reminder of Republican-backed attacks on combat medals awarded to John F. Kerry, the former senator, 2004 Democratic presidential nominee and now secretary of State, for his service in Vietnam. The attacks, which hurt Kerrys 2004 campaign, ultimately were discredited as untrue. Since announcing his campaign on June 16, Trump has lost numerous commercial endorsements and business deals due to his harsh comments about Mexican immigrants. His rhetoric has worried Republican leaders, who are trying to broaden the partys support among women and minorities, especially the growing number of Latino voters, before the 2016 election. In a Univision poll, 71% of Latinos surveyed had an unfavorable view of Trump. Some GOP candidates have refrained from criticizing Trump until now because many core conservatives, who vote heavily in Republican primaries, support him. A Fox News poll released Friday found 68% of GOP voters said Trump was basically right about immigration. But by appearing to attack military veterans and POWs, a more powerful constituency among conservatives and other voters, Trump may finally have given party leaders a chance to pop his balloon, which has been eclipsing other candidates. The Republican National Committee immediately denounced Trumps comments Saturday, saying there is no place in our party or our country for comments that disparage those who have served honorably. Wisconsin Gov. Scott Walker, who had previously avoided discussing Trump, told reporters Saturday, I unequivocally denounce him, according to his campaign. Fellow leading candidates Sen. Marco Rubio, the Florida Republican whose parents were born in Cuba, and Jeb Bush, the former Florida governor whose wife is Mexican American, also criticized Trump. Enough with the slanderous attacks, Bush wrote on Twitter. Former Texas Gov. Rick Perry  who days ago condemned Trumps toxic mix of demagoguery and nonsense  on Saturday called upon him to end his campaign because of comments that have reached a new low in American politics. His attack on veterans make him unfit to be commander-in-chief of the U.S. armed forces, and he should immediately withdraw from the race for president, Perry said in a statement. Louisiana Gov. Bobby Jindal said on Twitter that after Donald Trump spends six years in a POW camp, he can weigh in on John McCains service. Texas Sen. Ted Cruz was a notable exception, calling McCain a friend and hero on Twitter but adding, Donald Trump is a friend of mine. Trump has clashed verbally with McCain, who supported a comprehensive immigration overhaul that passed the Senate but died in the House. While on a campaign swing in Phoenix last week, Trump slammed McCain in his home state, violating normal rules of party politics. Ive supported John McCain, but hes very weak on immigration, Trump said. He also questioned whether McCain, who is up for reelection in 2016, would hold onto his Senate seat. I think he will probably lose if somebody runs against him for the Republican nomination, Trump said. McCain told the New Yorker that Trumps comments were very hurtful ... because what he did was he fired up the crazies. On Saturday, his daughter Meghan McCain said on Twitter that she was horrified and disgusted by Trumps latest comments: There are no words. noah.bierman@latimes.com, Times staff writer Kurtis Lee in Los Angeles contributed to this report. 7:00 p.m.: This report has been revised throughout for additional details and for clarity. The original version of this article posted at12:22 p.m.]", "Date": "20150718", "Title": "[Donald Trump says John McCain 'not a war hero'; Republican rivals denounce him ]", "Link": "http://www.latimes.com/nation/la-na-trump-mccain-20150718-story.html", "Author": "[Noah Bierman ]"}