{"Content": "[Lt. Gov. Gavin Newsom said Wednesday that he is launching his 2018 gubernatorial campaign not only to get a head start on raising money, but also to craft a substantive plan to restore California to greatness. I have zero interest in becoming the next governor to become governor. I want to try to do something meaningful and purposeful and help people do extraordinary things in their lives, Newsom said in an interview with The Times. Ive got to make a case myself so I can make the case to  others and I really want to take advantage of this time and begin to process that in a deep, deep way. It begins with a question  what world are we living in, what are the trend lines that define this world, and how can California take advantage of the trend lines, he said. I need the time and I need the resources to organize a conversation over the next few years to put together a compelling response. Newsoms decision to begin fundraising for an election that is well over three years away comes at a time when former Los Angeles Mayor Antonio Villaraigosa is deciding whether to run for U.S. Senate in 2016 or for governor in 2018. Other potential Democratic candidates for governor include billionaire environmental activist Tom Steyer, who could easily self-fund a campaign, and Los Angeles Mayor Eric Garcetti. Newsom said his early launch was not to scare other candidates out of the race, but he noted the potential of a self-funded candidate and the unlimited spending ability of Super PACs. If youre going to be serious about this and approach it seriously and methodically, at least I concluded from my vantage point that this is best approached now as opposed to later, he said.  Its not because I want to be dismissive of other people and their processing. But you can only control your own decision-making. Newsom, the former mayor of San Francisco, said his campaign will focus on three areas  income inequality, workforce development and climate change. He said he is deeply concerned that while technology has allowed productivity and profits to increase, wages have stagnated, and he believes California is affected by this gap more than any other place in the nation. None of us are talking about it, Newsom said. None of us are focused on it. Newsom will also be busy in 2016 supporting Hillary Clintons presumed run for the White House, and potentially involved in a marijuana legalization measure on the California ballot. Newsom has long made plain his desire to be governor, and unsuccessfully ran for the post in 2010 before dropping out and running for lieutenant governor. His current post has relatively little power, and Newsom has made clear his boredom with it. On Wednesday, he said he tried to make the most out of the job, pointing to his efforts crafting economic growth plans and a higher-education framework, hosting economic development summits across the state, and his role on higher-education and state lands panels. I think Ive been the butt of my own jokes. The lieutenant governors office has been over the years,Newsom said, adding that he believes the office ought to be reformed. The position  it is what it is. Its not the mayor of a county like San Francisco. Follow@LATSeemafor political news. ]", "Date": "20150211", "Title": "[Newsom says launch to raise money, form plan to restore state's greatness]", "Link": "http://www.latimes.com/local/political/la-me-pc-newsom-governor-20150211-story.html\n", "Author": "[Seema Mehta]"}
