{"Content": "[As Rep. Janice Hahn weighs a run for the Los Angeles County Board of Supervisors  where her late father held a seat for four decades  the San Pedro Democrat faces a rapidly changing district and potentially strong competition for one of the most powerful local elected jobs in the nation. An advisor to Hahn said Wednesday that she will make up her mind soon whether to stay in Congress  where her party is out of power  or try to succeed Supervisor Don Knabe, who must leave office next year due to term limits. If Hahn enters the race, she would be a top contender due to her name recognition, fundraising prowess and ties to portions of the 4th District, which stretches from the South Bay through Long Beach and into several communities in the southeastern portion of the county. But she would likely be challenged by fellow Democrats as well as Republicans for a rare opening on the county board. \"Janice certainly is the front-runner by virtue of name ID and overlap of representation,\" said lobbyist Harvey Englander. \"But theres pluses and minuses to being from the city of L.A. when youre running outside of the city of L.A.\", Knabes senior deputy Steve Napolitano, a former Manhattan Beach councilman, is running for the seat. Other potential candidates include Rep. Linda Sanchez, state Senate GOP leader Bob Huff and former Redondo Beach Mayor Mike Gin. \"Ive been approached by about 18 individuals interested in running. Its going to be a wide-open field,\" Knabe said, adding that Hahn \"would probably be in the top tier of candidates because of her name recognition alone.\", \"I think the winner will be a much more moderate candidate of some sort  not a hardcore Republican or Democrat,\" Knabe said. A moderate Republican himself, Knabe was elected in 1996. The districts demographics have changed considerably since then. \"Its following the trend of the rest of Southern California and the state, becoming more ethnic and more Democratic as time goes by,\" said Eric Hacopian, a Democratic political consultant. In late 2014, the county Registrar of Voters reported that the district was home to 483,877 registered Democrats and 280,051 registered Republicans. The election to replace Knabe will take place in 2016  a presidential year  when voter turnout tends to be younger and more diverse, which typically benefits Democrats. The county board is among the most powerful local elected bodies in the nation, overseeing services such as law enforcement, healthcare delivery and land development for 10 million people. The five-member board spends $26 billion a year in public money, often with little oversight, and has executive, legislative and quasi-judicial powers. Hahns father, Kenneth, served on the county board from 1952 to 1992. The cavernous downtown Los Angeles fortress where the panel meets is named after him. Kenneth Hahn was a gregarious politician who knew how to keep himself in the headlines, a skill his daughter learned at his knee. She frequently appears in prime spots for television and picture appearances. \"Stand in the middle of the picture, then they cant crop you out,\" she said to The Times in a 2013 interview, remembering one of her fathers most important rules. Hahn, 62, served on the Los Angeles City Council for a decade before being elected to Congress in 2011. A junior member of the minority party, she has struggled to enact major policy. She has focused much of her energy on protecting the Port of Los Angeles, co-founding a ports caucus in 2011. She also serves on the Houses transportation committee, giving her some influence over port issues and other local priorities, including funding for Metro expansion. If Hahn enters the race, that will set off a chain reaction for the future of her congressional seat. City Councilman Joe Buscaino already has expressed interest in that contest. seema.mehta@latimes.com, Twitter: @LATSeema, Times staff writers Garrett Therolf in Los Angeles and Noah Bierman in Washington, D.C. contributed to this report.]", "Date": "20150204", "Title": "[L.A. County supervisor vacancy leaves Rep. Janice Hahn a choice to make]", "Link": "http://www.latimes.com/local/politics/la-me-0205-janice-hahn-20150205-story.html\n", "Author": "[Seema Mehta]"}
