{"Content": "[The federal Export-Import Bank, which was in danger of shutting down at months end because of strong conservative opposition, will live on after Congress approved a short-term extension of its charter. But on Friday businesses remained worried that the agencys days were numbered. \"Im very concerned,\" said Steven Wilburn, chief executive of FirmGreen Inc. a Newport Beach renewable energy company. The banks assistance has helped the company export its technology for extracting and cleaning biogas from landfills. The projects take about nine months to develop and Wilburn has to decide whether he wants to pursue aid if the bank might not be around. \"We have to make some decisions, and those are going to be a little bit like looking into a crystal ball,\" he said. \"Its going to be full of angst.\", Wilburn and other supporters of the bank, which provides loans and other assistance to foreign buyers of U.S. products, were relieved after lawmakers this week extended the banks charter until June 30. But that was much shorter than the five-year reauthorization sought by the Obama administration and leading business groups. \"Congress has left thousands of small, medium and large U.S. exporters and their workers in limbo until the middle of next year and this will likely negatively impact U.S. sales to foreign customers,\" said Boeing Co. the largest beneficiary of bank assistance. Chris Krueger, a senior analyst at financial services firm Guggenheim Partners, said the extension of the banks charter was only a temporary reprieve. \"Ex-Im received a stay of execution, but it remains on death row,\" he said. Krueger predicted that Congress would allow the bank to shut down next summer because its fate no longer would be helped by inclusion in legislation to avoid a government shutdown, as it was this week. \"Yes, Ex-Im lived to fight another day, but that day in June 2015 is likely its Waterloo,\" he said. The bank offers loans to foreign buyers of U.S. products, and insurance and other assistance to domestic exporters, at no annual taxpayer cost. The bank pays for its operations through interest and fees on its assistance. Last year, Ex-Im provided $27.7 billion in export assistance and sent a record $1.1 billion in profit to the Treasury. But taxpayers are on the hook for any losses on the banks $140 billion in outstanding assistance. Many conservatives, led by Rep. Jeb Hensarling (R-Texas), chairman of the House Financial Services Committee, criticize the aid as corporate welfare and complain that the bank mostly helps Boeing and other large companies. A strong conservative push to let the banks charter expire Sept. 30 gained steam over the summer after new House Majority Leader Kevin McCarthy (R-Bakersfield) said he favored closing the agency. But heavy lobbying by businesses, led by Boeing, and leading trade groups helped persuade House Speaker John A. Boehner (R-Ohio) to include an extension in a bill to temporarily fund the government for 10 weeks after the fiscal year ends Sept. 30. Conservative activist groups Heritage Action for America and the Club for Growth urged lawmakers to vote against the funding bill in part because it included the bank extension. But the bill, which also authorized President Obamas plan to arm Syrian rebels in their fight against Islamic State militants, easily passed the House on Wednesday and the Senate Thursday night. \"We think it was a huge missed opportunity,\" Dan Holler, spokesman for Heritage Action, said of the decision by Republican leaders to allow the bank to live. \"They had a chance to have a federal agency expire right before an election and go back home and campaign that they ended corporate welfare,\" he said. Bank President Fred Hochberg said he would continue to seek a long-term reauthorization from lawmakers. \"Businesses dont pursue overseas sales, invest in their operations or hire new employees on a month-to-month basis,\" he said after the Senate vote. \"Similarly, quality American goods shouldnt lose out to aggressive foreign competitors because of the Export-Import Banks still-uncertain future,\" said Hochberg, who has noted that about 60 other countries have similar export-assistance agencies to help their companies sell products abroad. Wilburn, of FirmGreen, said the uncertainty over the banks fate already has hurt his company. FirmGreen lost a $57-million project in the Philippines because a potential customer there, who was going to use Export-Import Bank assistance, opted for export financing from the South Korean government to import technology from that country instead, he said. \"My competitors technology is backed by the South Korean export bank  and what theyre using against me is this uncertainty,\" Wilburn said. Because of lost business, FirmGreen has been forced to reduce its permanent employees to six from 10  and might need to cut more, he said. The U.S. Chamber of Commerce, the National Assn. of Manufacturers and nine other business trade associations wrote to congressional leaders last week urging them to quickly provide a long-term extension of the banks charter. \"Without Ex-Im Bank acting as a lender of last resort to fill market gaps, many foreign customers may turn to non-U.S. suppliers that already have significant support from their own official export credit agencies,\" the groups wrote. jim.puzzanghera@latimes.com]", "Date": "20140919", "Title": "[Export-Import Bank gets reprieve, but supporters remain worried]", "Link": "http://www.latimes.com/business/la-fi-export-import-bank-20140920-story.html\n", "Author": "[Jim Puzzanghera]"}
