{"Content": "[When Rand Paul began charting his presidential run, the Ray-Ban-wearing senator and heir apparent to a libertarian legacy rebranded himself to suit more mainstream Republican tastes. He rejected his famous fathers isolationist foreign policy, voted for more military spending and even campaigned in front of an aircraft carrier. He invited a Christian broadcasting network into his home and spoke against gay marriage, famously pronouncing himself libertarian-ish. But it turned out that Rand Paul 2.0 had a glitch: Appeal was limited. After flatlining in the polls and lagging rivals in fundraising, Pauls campaign heeded a market lesson repeatedly applied in American politics. They brought back the original. The Kentucky senator has pivoted back to his familiar stomping grounds among the outliers of Republican politics. In May he infuriated some fellow Republicans by delivering a 10-hour speech to protest Patriot Act provisions on NSA domestic spying. Last month he became the first presidential candidate to openly court money from the legalized marijuana industry and shared a moment with Nevada rancher Cliven Bundy, known for his standoff with federal agents in 2014 and for his divisive comments about minorities. Out of necessity hes moving back to his base, which is a sign the strategy he adopted was the wrong strategy, said Aaron Day, chairman of the New Hampshire chapter of the Republican Liberty Caucus, a nationwide libertarian-leaning organization within the GOP. He needs the grass-roots and they know this now. Rands campaign denied any rebooting of his message or positions, and insisted that he never intended to replicate the campaigns of his father, the former Texas GOP congressman and presidential candidate Ron Paul. There has been no change, no pivot, said campaign manager Chip Englander. He has the same view hes always had. But as Paul tried to navigate a more crowd-pleasing course, he ended up in no-mans land, disappointing core activists while failing to generate enthusiasm from the partys mainstream. The result left him on an island, said one strategist from a rival Republican campaign who did not want to be identified speaking about Paul. Hes played this footsie game with  the establishment for so long and you can see him make this pivot back. The challenge now facing Paul in the crowded GOP field is whether he can reignite the spark among libertarians who feel betrayed by his shifts, without alienating those Republicans potentially receptive to his call for limited government. Thats the line he has to walk here, said Tom Rath, a Republican strategist in New Hampshire. He strays too far and you get people saying, Who are you?, The stakes are even higher as other candidates pile into the race, eager to portray Pauls libertarian-leaning views as extreme. New Jersey Gov. Chris Christie, in particular, is targeting Paul on the campaign trail, saying the senators filibuster-like maneuver, which temporarily prevented the National Security Agency from accessing Americans telephone records, resulted in a dangerous surveillance lapse that put the country at risk. Fundraising for Paul has been lackluster, especially because his team has not lassoed a big-dollar donor like the billionaires bankrolling other candidates. The campaign reported $7 million for the quarter ended June 30, compared with about $14 million for Sen. Ted Cruz (R-Texas), $12 million for Sen. Marco Rubio (R-Fla.) and $11 million for former Florida Gov. Jeb Bush. A \"super PAC\" backing Paul had hoped that his marathon Patriot Act speech would produce a high-value Silicon Valley donor, but one has failed to materialize. So, while outside groups for Bush pushed his overall second-quarter haul to more than $114 million, followed by Cruz at $52 million and Rubio at $44 million, the main super PAC supporting Paul has not yet released its fundraising totals. Pauls campaign acknowledges that his libertarian base is his top priority even as he tries to build a new coalition, much the way President Obama turned out first-time younger voters and minorities. That means that even as Paul popped into a West Michigan happy hour with tea party Congressman Justin Amash, he also spent time in Detroit with African American civic leaders, taking our message to places where the GOP usually doesnt go, said campaign spokesman Sergio Gor. With 15 GOP candidates already in the race, Pauls campaign is betting its better to be loved by a few than liked by many, particularly in a fractured field. But recapturing the imagination of libertarian-leaning voters who have grown skeptical of Paul is proving more difficult. In New Hampshire, a state that Pauls campaign hopes will catapult his bid, the liberty caucus leaders are openly fretting that celebrity candidate Donald Trump has emerged as a top of choice for many in their wing, a concern also raised by some in Nevada, once prime Paul territory. Pauls May talk-a-thon against the governments surveillance program went a long way toward restoring his appeal and reenergize fans, and his new flat-tax proposal could please both mainstream and tea party camps in the GOP. But his June marijuana industry fundraiser in Denver, where pot entrepreneurs paid a minimum of $2,700 to hear him speak, may not go over well with Republicans in Iowa, who tend to be more socially conservative. His friendly rapport with rancher Bundy who once speculated that the Negro was better off under slavery could give voters pause in other states. Theres going to be some trickiness in satisfying everyone who was your fathers supporter, said Craig Robinson, a former Iowa Republican Party political director who now runs a popular blog. When you start going down those libertarian rabbit trails too far, its going to be trouble. Polling shows that Paul still ranks in the top 10 among the Republican presidential hopefuls; he tied for second behind Trump earlier this month in an Economist/YouGov poll. His campaign points to other surveys showing him competitive with Democratic front-runner Hillary Rodham Clinton, beating her in Iowa in a Quinnipiac University poll shortly after he announced his candidacy in April. Nick Gillespie, editor of the libertarian Reason.com, said Paul does best when he stakes out classic libertarian positions to distinguish himself from the other candidates. All of the moments where he stands out where he captures not just the political imagination, but the public American imagination are the most libertarian,Gillespie said. Twitter: @lisamascaro, MORE ON NATIONAL POLITICS:, Scott Walker tries to prove hes a national contender for president, Jeb Bush, in San Francisco visit, says Trump is preying on immigration fears, How much money have presidential candidates raised in California?]", "Date": "20150717", "Title": "[After sagging in fundraising, Rand Paul 2.0 reboots campaign ]", "Link": "http://www.latimes.com/nation/la-na-rand-paul-2016-reboot-campaign-20150717-story.html", "Author": "[Lisa Mascaro]"}