{"Content": "[Promotions and policy decisions at the Justice Department have been put off. Announcements have slowed to a trickle. Congress is waiting for input on the agencys budget priorities. Amid the stalled Senate confirmation of attorney general nominee Loretta Lynch, the nations biggest law enforcement agency finds itself in partial limbo. Department officials havent even been able to decide whether they should participate in a major international meeting on cybersecurity this spring. \"There is a constant complication about committing to things,\" said Robert Raben, a former assistant attorney general who is advising Lynch on the nomination and remains in touch with department officials. \"For April and May, there are an enormous amount of things that are on hold. Its impossible for the leadership to know what to commit to, because they do not know if Ms. Lynch is going to have a different view.\", The Senate returns to session this week and the votes to approve Lynch to replace outgoing Atty. Gen. Eric H. Holder Jr. appear in place. But there is no clear indication from Senate Majority Leader Mitch McConnell (R-Ky.) as to when he will schedule a vote. Although Holder remains on the job, he has scheduled few public appearances. Colleagues say he has already had to postpone one vacation trip and is eager to get back to private practice without the constraints of government. Holder \"remains very engaged in high-level discussions about cases and policy matters,\" said Emily Pierce, acting director of public affairs. But administration officials acknowledged privately that non-urgent decisions are being held in abeyance. \"There are major policy decisions that are on hold,\" said one department official who was not authorized to speak publicly about internal matters. Lynchs record and experience are not the reasons shes been waiting five months since being nominated, the longest delay in recent memory and more than those of the previous seven attorney general nominees combined. Instead, her ascent has been embroiled in partisan politics. Democrats share part of the blame. First, they urged the White House to refrain from naming a successor to Holder  who announced in September hed step down  until after the congressional election in November because they feared a controversial choice might hurt their chances. Then after the election, the Democratic-controlled lame-duck Senate decided against moving forward on the confirmation when they had the chance, punting the nomination to the new GOP-led Senate. During her Senate Judiciary Committee hearing in January, Lynch generally made a favorable impression, eventually winning the support of three committee Republicans. She has backing from major law enforcement groups. But many Republicans voiced frustration with her refusal to disavow President Obamas executive actions on immigration, which would defer deportation for millions of immigrants in the U.S. illegally. Though the issue would mostly not fall under Lynchs direct purview, Republican critics see the presidents moves as exceeding his legal authority. Lynch appears to have secured the necessary 51 votes for confirmation, helped this month by the announcement of Sen. Mark Steven Kirk (R-Ill.) that he would vote for her. But now the vote has been held up by an unrelated battle over a human trafficking bill. Democrats, though supportive of the bills aims, are filibustering the legislation because it contains a provision that they say would expand existing restrictions on abortion. McConnell said he would not schedule a vote on Lynch until after the Senate approved the bill. \"The only thing holding up the Lynch vote is the Democrats filibuster of a human trafficking bill that would help prevent kids from being sold into sex slavery,\" McConnell spokesman Michael Brumas said. \"The sooner they allow the Senate to pass that bipartisan bill, the sooner the Senate can move to the Lynch nomination.\", Democrats have responded by accusing Republicans of blocking the first African American woman nominated to become the nations top law enforcement officer. Sen. Richard J. Durbin (D-Ill.) last month accused Republicans of asking Lynch \"to sit in the back of the bus when it comes to the Senate calendar.\", Confidentially, some administration officials acknowledge that it was a mistake for Holder to promise to stay on until his successor was confirmed. A vacancy at the top of what is now a key national security branch probably would have compelled Republicans to move faster and avoided the partial administrative paralysis now affecting the department. James M. Cole, a former deputy attorney general who left in January, said the lack of permanent leadership hindered the departments effectiveness. \"There are law enforcement matters, national security matters, civil rights issues, police department [investigations]  issues that you start to disrupt when you have somebody waiting in the wings who you know is going to get in, but they are not there yet,\" Cole said. \"In any major case, including organized crime or corruption or national security, you want somebody who is going to make the ultimate decisions who has been able to follow the case through from the beginning.\", tim.phelps@latimes.com, Twitter: timphelpsLAT, Times staff writer Lisa Mascaro contributed to this report.]", "Date": "20150413", "Title": "[Justice Department in partial limbo as Loretta Lynch awaits confirmation]", "Link": "http://www.latimes.com/nation/la-na-lynch-confirmation-20150413-story.html\n", "Author": "[Timothy M. Phelps]"}
