{"Content": "[Marine combat veteran Jacquie Atkinson has announced she will take on Rep. Scott Peters (D-San Diego) next year. Atkinson, a Republican, will try to take back the 52nd Congressional District seat that Peters, a former San Diego councilman, narrowly wrested from GOP Rep. Brian Bilbray in 2012. Republicans tried to oust Peters in 2014, in what became one of the hardest-fought and costliest House races in the nation that year. Peters defeated businessman Carl DeMaio 52% to 48%. Atkinson met with Republican leaders in Washington in February, according to a blog post on The Hill, which tracks congressional politics. It was unclear, however, whether the party will provide significant help to her or any other GOP challenger to Peters who might emerge in the coming weeks and months leading up to the June 2016 primary. Atkinson, who was wounded in Iraq, is employed by an organization that works to mitigate the effectsof improvised explosive devices, or roadside bombs. In its Feb. 26 blog post, The Hill noted that Atkinson is openly gay (as is DeMaio) and that her background \"could fit well in the socially liberal district, which has a number of large military bases and a huge population of military veterans.\", \"I have served my country in combat and I am prepared to serve my county in Congress,\"Atkinson said in a statement announcing her candidacy Wednesday. \"Whether it is wasting our money, failing to provide for our security or ignoring the struggles of working families, Congress is completely broken and career politician Scott Peters is the epitome of what is wrong with our Congress.\", If Republicans think they are going to have a better shot at this district in 2016 with Carl DeMaios handpicked candidate than 2014 when Democrats were facing a much stronger headwind, they are in for a surprise on election day,\" said Matt Thornton, a spokesman for the Democratic Congressional Campaign Committee. \"There is no doubt that voters in San Diego will want Rep. Scott Peters to continue his work to create jobs, fight for veterans and invest in the next generation,\" Thornton added. Follow @jeanmerl for the latest in Southern California politics news.]", "Date": "20150409", "Title": "[ GOP Marine veteran says she'll take on Rep. Scott Peters in 2016]", "Link": "http://www.latimes.com/local/political/la-me-pc-congress-challenger-to-peters-20150409-story.html\n", "Author": "[Jean Merl]"}
