{"Content": "[Richard Trumka mentioned no names as he vowed recently that labor would not endorse yet another presidential candidate who talks big about confronting inequality but offers an agenda that merely fiddles around the edges of the economy, meeting Wall Streets needs before throwing workers scraps. Yet it was a clear warning to Hillary Rodham Clinton. Trumka, the AFL-CIO president, had just summarized the collective progressive angst around her. Clintons agenda is largely a mystery, reflecting a candidate who has not been engaged in domestic policy since the country first plunged into the Great Recession, and who is in no rush to box herself into positions. But the left is not giving her the benefit of the doubt. A day has not gone by since she launched her run three weeks ago without some group of progressives calling on her to make a pledge. That she will oppose the big Pacific trade agreement. That she will support a debt-free college plan. That she will commit to raising the minimum wage to $15. They want promises that she would upend the tax system, guarantee child care for everyone, expand Social Security. America doesnt need relentlessly cautious half-measures, Trumka said at his speech this week in Washington. Then he spelled out the consequences of an uninspired base: the door-knocking, phone banking and other mobilizing efforts that labor can offer in the general election may just not materialize. The message was clear. The coalition that propelled Barack Obama to victory is disenchanted, and it will fray with every step Clinton takes toward the center to appeal to swing voters. Clintons long association with liberal causes, from Hillarycare to family leave, is cold comfort to progressive organizers. So are her words on the campaign trail, where she has gradually sought to assure restive liberals that she is one of them, lamenting that the deck is still stacked in favor of those at the top. One day her campaign hired Gary Gensler, a former regulator who is a nemesis of big banks, and another, as the Supreme Court considered gay marriage, it refashioned her avatar on Twitter as a rainbow flag. She also wrote the tribute when Time magazine named Clinton frenemy Sen. Elizabeth Warren (D-Mass.), the lefty standard-bearer and constant source of heartburn to Clintons campaign, one of its 100 most influential people. After Sen. Bernie Sanders, the Vermont socialist, announced Thursday that he was running against her in the Democratic primary, Clinton tweeted that she agreed with him that the focus must be on helping Americas middle class. Clinton is running in a very different Democratic Party than she was eight years ago, and its base expects much more from her. Activists are angry that even the end of the recession is doing little to stem economic inequality. They resent her husbands legacy on the economy, saying Clintonian policies that emphasized creating opportunity over structurally lifting those workers at the bottom have resulted in chronically low wages and a deteriorating quality of life for too much of America. The problems have become so big that it feels to many of us like systemic solutions are required, said Deepak Bhargava, executive director of the Center for Community Change, which advocates for low-income Americans. Whether she is prepared to go there is an open question. It is all irritating to the Clinton campaign. Her advisors argue that the groups unfairly gloss over her lengthy record of pursuing liberal legislation and instead harp on Bill Clintons association with the Democratic Leadership Council, the pro-growth think tank that helped shape his economic agenda as president. The council shut down on the verge of bankruptcy in 2011, and the currency of its ideas in the Democratic party has withered. The idea generators likely to have the biggest effect in driving Hillary Clintons agenda now are at a very different group, the Center for American Progress. The think tank is an incubator for many of the policies that progressive organizations are pushing Clinton to adopt. Its founder, John Podesta, is Clintons campaign chairman. The current president of the center, Neera Tanden, was Clintons policy director in the last campaign. Just because Bill Clinton had some ideas in the 1990s, it doesnt mean Hillary Clinton is going to have the same ideas in 2015, Tanden said. I categorically reject that  these are new times with new challenges. A lengthy report that Tandens group released this year is putting some progressives at ease. It was notable not just because it acknowledges the growth-focused strategies pursued by Bill Clinton no longer adequately address stagnant wages and widening economic inequality, but also because of who wrote it. The co-author was Larry Summers, the relentlessly centrist Treasury secretary under Bill Clinton who played a key role in pushing the Democratic Party to the right in the 1990s. Now, Summers is warning of an erosion of democracy if unions are not strengthened and government does not pursue policies that force wage growth. Hillary Clinton could face a litmus test very soon. She is under pressure to take a position on a massive Pacific free-trade agreement sought by President Obama. Legislation supporting the pact is moving through Congress, and the left is mobilizing to fight it. This is a chance to separate herself from what people fear about her, which is a continuation of some of the Clintonian economic policies that did not work out so well, said Lawrence Mishel, president of the Economic Policy institute, a progressive think tank. For now, Mishel is reserving judgment. He said the candidate could yet delight liberal activists, noting that Clinton had the more progressive agenda when she ran unsuccessfully against Obama eight years ago. But he also pointed out that she would be spending a lot of time with Wall Street in the coming months, soliciting donations for her campaign. We just dont know where she is yet, he said. The unstated concern of some people, I think, is that she is too close to the financial center and needs to raise a lot of money. That can make someone shy about addressing the 1%. And it can push them into emphasizing opportunity over inequality. Twitter: @evanhalper]", "Date": "20150501", "Title": "[Liberals urge Clinton to go left, where she risks losing swing votes]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-hillary-clinton-liberals-conflict-20150501-story.html", "Author": "[Evan Halper]"}