{"Content": "[The most important battle in politics today is the one within the Republican Party, and the tea party movement didnt start it. The GOPs civil war began in 1912 when Teddy Roosevelt made progressivism the governing philosophy of the Republican establishment. For the 102 years since, the conflict has been between limited-government constitutional conservatives and the proponents of big government  and the big spending that goes with it. It has been waged with conservative Republicans, such as Sens. Robert A. Taft, Barry Goldwater and Jesse Helms, on one side, and big-government Republicans, such as Presidents Eisenhower, Nixon and Ford and New York Gov. Nelson Rockefeller, on the other. Many thought, wrongly, that the conservatives won with the election of Ronald Reagan and his coalition of economic, national defense and social conservatives. But todays Republican establishment frequently invokes Reagan while also pursuing a progressive agenda at odds with his principles. Big-government Republicans today include Senate Minority Leader Mitch McConnell, House Speaker John A. Boehner, House Majority Leader Eric Cantor and Republican National Committee Chairman Reince Priebus. Make no mistake, the establishment GOP is not the political home of conservatives. To understand todays battles, and the rise of the tea party movement, one must understand that the tea party is as much or more a rebellion against the entrenched leadership of the Republican Party as it is a reaction to specific policies of President Obama. Conservatives have learned that establishment Republican leaders are not merely incapable of stopping the progressive agenda but have been complicit in its expansion. GOP leaders have talked a good game when they are up for election, but they all too often vote for, or refuse to fight, the funding of most big-government programs. The lesson for conservatives? We have been pointing our political guns at the wrong target. Conservatives are not going to get to the political Promised Land and be able to govern America according to conservative principles until flawed, big-government Republican leaders are replaced with constitutional conservatives. And the people are with us. For example, Gallup reports that 72% of respondents to a 2013 poll said that \"big government is a greater threat to the U.S. in the future than is big business or big labor, a record high in the nearly 50-year history of this question.\", The place to stop the progressive agenda is first within the GOP. Conservatives have finally come to realize that the fate of the presidents agenda for his final two years will actually be decided in Republican primaries. The Obama agendas fate lies with conservatives such as Sens. Rand Paul, Ted Cruz and Mike Lee, and Reps. Tom McClintock, Justin Amash and Tim Huelskamp, who have defeated Republicans of a progressive bent in the primaries and gone on to win general elections. We are already seeing an alliance of big-government interests, such as the Republican Main Street Partnership, the U.S. Chamber of Commerce and Facebook billionaire Mark Zuckerberg, joining forces to tilt upcoming Republican primaries in favor of big-government GOP candidates. Long term, this alliance can be devastating to Republican political prospects. Through all the ebbs and flows of the GOPs 100-year civil war, the levers of power within the Republican Party have remained firmly in the hands of a progressive elite that sees big government as often inefficient but not wrong. The GOP establishment never seems to learn that going along with big-government policies is exactly what gets Republicans thrown out of office and relegated to the status of the powerless minority that they were for the better part of 50 years, from the New Deal until the election of Reagan in 1980. However, the election of young, principled constitutionalists to Congress and in state legislatures is a sign that this civil war for the soul of the Republican Party is about to turn. The alternative is that the GOP will slide ever deeper into irrelevance as the party of \"dime-store Democrats\" that President Truman derided so accurately in the 1950s. Richard A. Viguerie is chairman of ConservativeHQ.com and the author of \"Takeover: the 100-Year War for the Soul of the GOP and How Conservatives Can Finally Win It.\"]", "Date": "20140430", "Title": "[ The establishment GOP is not the political home of conservatives, and that needs to change]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-viguerie-gop-civil-war-within-20140501-story.html", "Author": "NULL"}