{"Content": "[Hillary Rodham Clinton, addressing events in Ferguson, Mo. for the first time, said Thursday she was heartbroken by the police shooting of Michael Brown and called for the country to address the racial inequalities that skew the criminal justice system. We can do better, she said in lengthy remarks closing a speech at a technology conference in San Francisco. We cant ignore the inequalities that persist in our justice system that undermine our most deeply held values of fairness and equality. She expressed horror at the TV images of heavily armed police officers confronting protesters in Ferguson, a St. Louis suburb. Nobody wants to see our streets like a war zone, Clinton said. Not in America. We are better than that. But she leavened the criticism with praise for the many decent and respectful law enforcement officers who showed what quality law enforcement looks like and lauded President Obama for dispatching Atty. Gen. Eric Holder to Ferguson as part of a thorough and speedy investigation. Clinton, the overwhelming frontrunner for the 2016 Democratic presidential nomination, had been criticized for failing to weigh in on the events in Ferguson, where the shooting of the unarmed Brown sparked days of violent protests. The still-disputed circumstances of Browns death and the heavily armed police response to the subsequent demonstrations have sparked a nationwide debate on race and the use of police force. Most of the prospective 2016 presidential contenders have avoided comment on the events in Ferguson, or been circumspect. A notable exception was Kentucky Sen. Rand Paul, who broke with Republicans traditional hard line on law and order by publishing a Time magazine essay  while protesters were still in the street  mixing a condemnation of heavy-handed policing with criticism of how the justice system treats minorities. Anyone who thinks that race does not still, even if inadvertently, skew the application of criminal justice in this country is just not paying close enough attention, Paul wrote. More typical was the response of Republican Rep. Paul Ryan, who counseled caution before making any judgments. We should take a deep breath, sit back and let law enforcement do their job, the Wisconsin Republican said in an interview on SiriusXM during a tour to promote his new book. Let the investigation take place so that the facts can be taken as the facts, and let justice be done appropriately. In her remarks Thursday, Clinton echoed many of the sentiments that Paul expressed. \"Imagine what we would feel and what we would do if white drivers were three times as likely to be searched by police during a traffic stop as black drivers, instead of the other way around,\" she said. If white offenders received prison sentences 10 times longer than black offenders for the same crime. She urged members of the audience to look around and, considering the high rate of incarceration for black males, imagine that one-third of those attending were locked away. That is the reality, she said, of so many of our fellow Americans and so many of the communities in which they live. Clinton did not address the controversy surrounding the police release of a videotape showing Brown apparently shoplifting cigarillos before his confrontation with Officer Darren Wilson. Rather, she spoke of the emotions she felt as a mother and a human being watching Browns funeral earlier this week. My heart just broke for his family, she said, because losing a child is every parents greatest fear and an unimaginable loss. mark.barabak@latimes.com, Follow @markzbarabak for more political news and analysis]", "Date": "20140828", "Title": "[Clinton breaks silence on Ferguson, calls for fixing justice system]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-clinton-breaks-silence-on-ferguson-20140828-story.html\n", "Author": "NULL"}
