{"Content": "[Shavar Jeffries, the new president of Democrats for Education Reform, used a hotel in Los Angeles this week to explain how school choice could work. He arrived here Tuesday night, one of his first stops on a tour of the groups 14 state affiliates. The place was a \"dump,\" so he checked into the Omni in downtown Los Angeles. The ability to choose a new hotel, Jeffries says, is a privilege  as is the ability for parents to choose a new school when they believe theyre in the educational equivalent of a hotel in squalor. Similarly, just like hotels, schools should work to keep their clientele, he said. \"I know its not the best metaphor, but I believe school choice is the same thing,\" Jeffries said, speaking from a couch in the Omnis glossy lobby. \"You should have to work hard for babies. You should be changing babies lives.\", Thats how Jeffries describes the need for alternatives to low-performing public schools, such as charter schools, which are publicly funded but can be privately run. Enrollment at independent charter schools in Los Angeles has grown dramatically from 60,643 in the 2009-10 school year to 101,060 in 2015-16, and philanthropists have embarked on a new effort to accelerate their growth. Jeffries is taking the helm of Democrats for Education Reform, a politically influential group that has emerged as a counter to teacher unions, a historical stalwart of the Democratic Party. The groups California affiliate has sparred with the party. DFER has backed many successful candidates who have boosted the groups agenda, which includes expanding charter schools and evaluating teachers in a tougher way. Mayors from Los Angeles to New York have embraced the groups priorities, but recent occurrences show that the pendulum is moving: In New York, much of Mayor Bill de Blasios campaign hinged on bashing former Mayor Michael R. Bloomberg  an education reform philanthropist  for his schools agenda. In Los Angeles, after the tenure of Supt. John Deasy, much of current Supt. Ramon Cortines rhetoric has focused on repairing the district and rebuilding trust with the community. So far, on the 2016 presidential campaign trail, Democratic candidates have steered away from discussing K-12 education, which can be divisive. Instead, they have focused on the softer issues of preschool and higher education. In tapping Jeffries, reform advocates sought a fresh voice, one that is more in sync with the children it aims to uplift. Jeffries is black, raised by his grandmother in Newark, N.J. after his mother was murdered. After attending Newark public schools, he went to a private, preparatory school on a scholarship, and then Duke University, Columbia Law School and a series of prestigious law firms. Jeffries said he is ready to jump back into the fray. Schools that dont serve parents well, Jeffries said, dont deserve to be in business. The process of creating better options, though, is \"going to be painful,\" he said. And he would know. He was talking about the pain communities feel when low-performing schools are shuttered and teachers lose their jobs to make way for charter schools. But he too has scars from that process. Jeffries is a civil rights attorney who lost the 2014 race to become Newarks mayor to Ras Baraka, a critic of reform policies. Baraka won with the support of unions, which ran ads such as: \"Theyre coming. From Wall Street. From Trenton. To sell us Shavar Jeffries.\", As a result, he is aware of the mistakes his own movement has made. Distrust crops up, he said, \"when you have a bunch of white folks who arent in these communities who are disconnected, coming in, out of the blue, announcing what theyre going to do, and then just starting to do it.\" Approaches like this, in addition to a lack of diversity, he said, have caused \"unforced errors.\", As Jeffries continues fighting for DFERs priorities, the unions are ready to swing back. In response to his appointment, American Federation of Teachers President Randi Weingarten released a statement that called out \"East Coast DFERs\" for promoting \"ideological policies\" that \"have not helped all kids succeed.\", Jeffries succeeds Joe Williams, who guided the organization through the election of Barack Obama and his appointment of Secretary of Education Arne Duncan. Williams left DFER this summer to do political work related to education for members of the Walton family, which controls Wal-Mart. DFER board member Mary L. Landrieu, a former U.S. senator from Louisiana, recently met Jeffries at a fundraiser at political consultant James Carvilles house. \"As an African American leader, he brings a very authentic voice to this debate,\" she said. \"Its clear that the passion he has for equity isnt something he read in a book somewhere. It was written on his own heart.\", You can reach Joy Resmovits on Twitter @Joy_Resmovits and by email at joy.resmovits@LATimes.com.]", "Date": "20150904", "Title": "[How a dumpy Los Angeles hotel room became a metaphor for school choice]", "Link": "http://www.latimes.com/local/education/la-na-education-reform-20150904-story.html\n", "Author": "NULL"}
