{"Content": "[President Obama declared America ready to turn the page on years of hardship and economic insecurity in a State of the Union address Tuesday night that offered a sprawling, post-recession domestic agenda aimed at appealing to the middle class  and at revitalizing his presidency in its final two years. America, for all that weve endured; for all the grit and hard work required to come back; for all the tasks that lie ahead, know this: The shadow of crisis has passed, and the state of the union is strong, Obama said. It was the first time Obama used the familiar phrase so directly, without qualification or condition, in a State of the Union speech. At times boastful, confident and even cocky, Obama appeared unfazed by his partys electoral pounding in the midterm election less than three months ago or his year of slouching approval ratings. He offered few overtures to the opposition, even interrupting his rhetoric about bipartisan harmony to shoot back a zinger at Republicans. When he noted he has no more campaigns to run, some Republicans cheered. Obama responded with his own dig. I know cause I won both of them, he ad-libbed. Obama declared 2014 a breakthrough year for America, a dramatic shift for a president who has spent his time in office either slogging through grim economic news or pleading for patience for better times ahead. But White House aides argued that the president was ready to move the economic debate past fights over austerity into what he labeled middle-class economics. He outlined a wide-ranging platform to define the term. Obama proposed free community college, expanded child-care tax credits, a new tax benefit for two-income families, a push for paid family leave, and a proposed tax increase on the wealthy to pay for programs the White House says will help a battered middle class participate in the economic turnaround. Obama vowed to improve job training programs, advocated a free and open Internet and issued a blunt challenge to lawmakers who oppose raising the minimum wage. If you truly believe you could work full time and support a family on less than $15,000 a year, go try it, he said, with a smile. If not, vote to give millions of the hardest-working people in America a raise. Obamas remarks drew a contrast to his political opponents, who are aiming to turn the page from the Obama era to a new one of Republican dominance in Congress. Delivering the partys rebuttal, freshman Republican Sen. Joni Ernst of Iowa described Americans as still rattled from the aftershocks of the Great Recession. She squarely blamed the presidents policies, including his landmark healthcare law. We see our neighbors agonize over stagnant wages and lost jobs. We see the hurt caused by canceled healthcare plans and higher monthly insurance bills, she said. Americans have been hurting, but when we demanded solutions, too often Washington responded with the same stale mind-set that led to failed policies like Obamacare. Its a mind-set that gave us political talking points, not serious solutions. Ernst reiterated Republicans promise to repeal and replace Obamacare, known formally as the Affordable Care Act. Obama looked out on a House chamber filled with the first entirely GOP-controlled Congress in nearly a decade and more Republican opponents than at any point in his time in office. Still, he saved his gestures toward compromise and bipartisan outreach for well into his speech  and did not offer any specific olive branch to new Senate Majority Leader Mitch McConnell of Kentucky, who could determine whether Obama chalks up any more major legislative victories before leaving office. McConnell had little to applaud. The biggest problem is the president made a speech that made it look like hes going to run for office again. His time for running is over. His time for governing is here. And in order to accomplish things over the last two years of the Obama administration, he needs to work with the Republican Congress, McConnell said in a statement. Obama made a broad appeal for a better politics and criticized partisan gotcha moments and fake controversies, but he seemed to do little else to ease the tensions. His speech was not aimed at political centrism. Buoyed by his rising public approval and an improving economy, the president was eager to use the moment to show the public  and Washington  that he wouldnt go quietly, aides said. Obama pledged to veto any measures that would undo his sweeping immigration executive actions or his healthcare law. His tax proposals, which would raise $320 billion in new revenue over a decade, were more likely to frame the upcoming debate than start negotiations on tax reform. After a year of being whipsawed by foreign crises, Obama defended his policies overseas against those who have pushed for more aggressive responses. He cast his choices as a smarter kind of American leadership. The phrase echoed a catchphrase the White House has used before to encapsulate his foreign policy: Dont do stupid stuff. When we make rash decisions, reacting to the headlines instead of using our heads, when the first response to a challenge is to send in our military  then we risk getting drawn into unnecessary conflicts and neglect the broader strategy we need for a safer, more prosperous world, Obama said in his address. Thats what our enemies want us to do. He defended the ongoing multinational nuclear negotiations with Iran and restated his promise to veto proposed legislation that threatened additional sanctions against Tehran. He touted his plans to open up U.S. policy toward Cuba, urging Congress to end the half-century trade embargo as Alan Gross, the imprisoned American aid worker freed recently after five years in a Cuban prison, looked on from the balcony. Some Republicans answered the White Houses symbolism with their own, inviting Cuban democracy activists as guests. Even as Republicans in Congress refuse to allow the transfer of Guantanamo Bay detainees to prisons inside the U.S. Obama affirmed his belief that the United States should go beyond its dramatic reduction in the number of detainees at the U.S. military prison in Cuba and close it altogether, as he promised he would do shortly after he took office in 2009. Obama cast the U.S.-led coalition battling Islamic State extremists in Iraq and Syria as strong and urged patience. He vowed to work with Congress to rewrite the law for use of force that has authorized the air campaign already underway. Senior administration officials described updating that law as the presidents top legislative priority. Another focus is likely to be passing a key trade deal, which would require Obama to persuade his own party to join the effort. To that end, he made a rare appeal aimed at the Democratic base. Look, Im the first one to admit that past trade deals havent always lived up to the hype, and thats why weve gone after countries that break the rules at our expense. But 95% of the worlds customers live outside our borders, and we cant close ourselves off from those opportunities, he said. Obama offered measured remarks on two of the controversies that consumed part of the last year. First, he made a plea for criminal justice reform in the wake of the debate over race and policing that followed the unrest in Ferguson, Mo. and in New York City after white police officers killed unarmed black men, and grand juries declined to indict either officer. People may have different takes on the events, but surely we can understand a father who fears his son cant walk home without being harassed, he said. Surely we can understand the wife who wont rest until the police officer she married walks through the front door at the end of his shift. Similarly, on the debate over the balance between free speech and anti-Semitic and anti-Muslim messages that erupted after the terrorist attacks this month on the French magazine Charlie Hebdo, Obama appealed for understanding. As Americans, we respect human dignity, even when were threatened, he said. In the end, though, he returned to the heart of his message, an economic policy aimed at strengthening the middle class. The country has recovered from hardship, he said, remaking itself like a family that suffers but works toward a better day. Weve laid a new foundation, he said. A brighter future is ours to write. kathleen.hennessey@latimes.com, christi.parsons@latimes.com, Twitter: @khennessey, @cparsons, Michael A. Memoli in the Washington bureau contributed to this report. 9:47 p.m.:This story has been revised throughout. 7:34 p.m.:This story has been updated with the speech ending and more quotes from President Obama. 6:14 p.m.: This story has been updated with the State of the Union speech beginning and quotes from President Obama. 3:34 p.m.: This story has been updated with excerpts from Obamas State of the Union address distributed in advance.]", "Date": "20150120", "Title": "['State of the union is strong,' Obama declares in address]", "Link": "http://www.latimes.com/nation/la-na-obama-state-of-union-20150120-story.html\n", "Author": "[Kathleen Hennessey, Christi Parsons]"}
