{"Content": "[For four years, Rep. Darrell Issa presided over one of the highest-profile oversight committees in Congress, becoming a fixture in the national news as he took the Obama administration to task for everything from bank bailouts to corruption in Afghanistan. Only three months ago, the California congressman unveiled a portrait of himself to hang proudly in the committee hearing room. \"Click LIKE to thank Chairman Issa for his tireless commitment to transparency and for his dedicated service to the American people,\" the oversight committee Facebook page suggested as the portrait was hung. Just days after his successor took over at the helm in January, though, the new painting vanished from the hearing room. It now hangs in a private committee anteroom, beside a coat rack and a television screen. Its journey echoes the waning influence of the Vista Republican, whose confrontational style managed to wear not only on Democrats, but on members of his own party. Issa used his position atop the House Oversight and Government Reform Committee to relentlessly poke at President Obama over Benghazi, the Internal Revenue Service, the \"Fast and Furious\" failed gun sting, and any number of topics that made for high theater and cable cameos. But Issas investigations often failed to show direct culpability on the part of the White House or Obama, whom he once called \"one of the most corrupt presidents in modern times.\", Issas influence began to wane last year, when party leaders diverted attention from his high-drama investigation of the deadly 2012 attack against U.S. personnel in Benghazi, Libya, by establishing a new committee to focus on the incident. Then they thwarted his attempt to secure a rare exception to the limit on how long he could lead the oversight committee. (He served one term as the committees top Republican, when Democrats held the majority, and then a pair of two-year terms as its chairman.), His successor, fellow Republican Rep. Jason Chaffetz of Utah, campaigned to succeed Issa on a promise to run the committee differently. When he took over in January, Chaffetz replaced many of Issas staff members and engineered the move of portraits of Issa and other former chairmen. \"Darrell Issa didnt do many reports,\" Chaffetz told reporters in December, after Republican leaders tapped him, according to Roll Call. \"[He] did big press releases.\", \"Its not the Jason Chaffetz Show,\" he said at another point. Issa, now beginning his eighth term in Congress, finds himself at a crossroads. Despite a personal fortune that gives him a huge advantage in elections, there was little clamoring among California Republicans for him to reprise a run for the Senate seat that Democrat Barbara Boxer will relinquish after the 2016 election. Issa spent $10 million trying to unseat her in 1998 but failed to win the Republican nomination. He appears unlikely to follow the path of one of his predecessors in the post, former Rep. Henry A. Waxman of Beverly Hills, a Democrat who left Congress this year after four decades with a legacy as a legislative titan. Two factors get in Issas way: The Republican Party imposes term limits on its chairmen, and many members of the party philosophically oppose the type of sweeping legislation championed by Waxman and other liberals. Issas allies say he retains leverage; he is a key ally to Silicon Valley, leading a subcommittee that oversees patents. And Issa has succeeded before in surprising ways, even as he took on a highly partisan role: He worked with Democrats to oppose anti-piracy measures that opponents said would undermine free speech on the Internet. His new committee assignments  he was also named to the House Foreign Affairs Committee in December  will put him in the middle of compelling issues. \"Hes very much going to be active and robust in policy and intellectual property issues, which is really in his wheelhouse,\" said Kurt Bardella, a former aide to Issa who is now a private media consultant. Issa, who made his fortune manufacturing anti-theft devices for cars, has held 37 patents, according to his office. Issa declined a request to discuss his plans or past performance. When a reporter approached him in a House hallway to request an interview, he refused and said that the result would be a \"hit piece.\", Just a few minutes later, the committee Issa used to lead met for the first time since he handed over the gavel to Chaffetz. The top Democrat on the committee, Maryland Rep. Elijah E. Cummings, opened his remarks with a call for a \"new beginning.\", \"The last four years were filled with acrimony, partisanship and sometimes vulgar displays,\" Cummings said. \"They were a stain on this committees integrity and an embarrassment to the House of Representatives.\", Cummings was a principal figure in one of Issas most controversial moves, which occurred during a hearing last year that was devoted to IRS scrutiny given to some conservative groups tax-exempt status. Issa, angry after former IRS Director Lois Lerner pleaded the 5th Amendment to avoid answering questions, called the meeting adjourned even as Cummings tried to speak. Cummings protested that it was a \"one-sided investigation\" as Issa shut down the Democrats microphone and began to leave. \"I am a member of the Congress of the United States of America. I am tired of this,\" Cummings said, his arm shaking and his words echoing through the large chamber even without amplification. The dispute, caught on video, spread widely over social media. For many, the incident illustrated how decorum had fallen in Congress, as genteel formalities have given way to unvarnished contempt among partisans. But it specifically tarnished Issa and contributed to Republicans distancing themselves from him. In a 348-page report, Issa cited a number of accomplishments from his four years at the helm of the oversight committee. They include 23 laws passed, including the Digital Accountability and Transparency Act, which required federal agencies to put more detailed budget information online for public scrutiny. Issa also pointed to more than 100 subpoenas he issued  a tactic that critics have assailed as excessive  and to nearly 60 reports released. But some of the highest-profile investigations have failed to live up to the initial hype. For example, his final investigation on the IRS targeting conservative groups failed to show evidence of White House involvement, despite Issas statement in 2013 that \"this was a targeting of the presidents political enemies\" that was discovered only after Obamas reelection. His statement last year that he suspected former Secretary of State Hillary Rodham Clinton had told former Defense Secretary Leon E. Panetta to \"stand down\" during the attack on Americans in Benghazi was not substantiated by two separate congressional reports. Yet even some Democrats say that Issa helped Republicans make significant gains in the November election. \"Theres no question he accomplished part of his mission, which was to do damage to the president,\" said Rep. Gerald E. Connolly, a Virginia Democrat who serves on the oversight committee. \"The relentless headline-grabbing, breathless subpoenas and hearings and charges certainly served a purpose, even though there was very little there there, it turns out.\", For Republicans wishing to put the Issa years behind them, Chaffetz  with a youthful perma-smile and a tangle of dark hair that conjures membership in a boy band  was a logical choice to replace him. Chaffetz made a deliberate show of unity with Cummings when he campaigned for the job among his colleagues, traveling with Cummings to his Baltimore district and inviting the Democrat to dine on cheesy potatoes with Chaffetzs constituents in Utah. \"Were going to be equally as aggressive,\" Chaffetz said in a recent interview. \"I just want to make sure it doesnt get too personal with other members of the committee.\", Chaffetz has insisted his removal of Issas portrait from the committee room was not personal. He removed other portraits, replacing them with tributes to postal workers, coal miners, civil rights marchers and other iconic American images. \"I think we should be inspired by those that we serve, not necessarily the other former committee chairmen,\" Chaffetz said. But even as Chaffetz has tried to move on, his colleagues cant resist chuckling. One of them, Rep. Mick Mulvaney, walked by while Chaffetz was speaking with a Times reporter for this story. \"So, has he asked you about the portraits yet?\" Mulvaney, a South Carolina Republican, asked Chaffetz with a grin. Former Rep. Tom Davis, a Virginia Republican who led the committee from 2003 to 2007, said Issa was a \"pretty good chairman\" in a tough spot  caught among partisans who demanded that he go after Obama, party leaders who worried that his overreaching could hurt Republicans among swing voters and Democrats who defended the president by demonizing Issa. Davis, who chaired the committee under Republican President George W. Bush, often pursued a less partisan agenda, including an examination of the response to mad cow disease, the implementation of the Department of Homeland Security, and private contracts related to the war in Iraq. Davis says Issa is in a strong position to remain influential. \"This is a guy whos landed well,\" he said. \"Hes got still a great role to play and hes very strong with the party base.\", noah.bierman@latimes.com, Twitter:@noahbierman, ALSO:, Obama gave no secret instructions to FCC on net neutrality: Wheeler, Secret Service director pledges commitment to fixing agencys ills, Obamacare advisor apologizes to lawmakers for controversial comments]", "Date": "20150320", "Title": "[California's Darrell Issa loses power along with House oversight committee post]", "Link": "http://www.latimes.com/nation/politics/la-na-darrell-issa-20150321-story.html\n", "Author": "[Noah Bierman ]"}
