{"Content": "[The so-called sharing economy is fast emerging as a 2016 presidential battleground, exposing fundamentally different approaches over how to embrace new technologies without hurting American workers. Eager to court millennial voters and deep-pocketed tech executives, Republicans have almost universally praised smartphone apps that allow consumers to hire drivers, rent apartments and buy or sell just about any service online, latching onto them as prime examples of free-market entrepreneurship and workplace deregulation. But in what is shaping up to be the first Uber election, Democrats have been more cautious, struggling to avoid appearing resistant to the popular new ventures while highlighting their potential negative effect on workers pay and benefits. Democratic candidate Hillary Rodham Clinton sparked the Uber debate last week by pointing to the risks such new business models posed for workers. \"This on demand or so-called gig economy is creating exciting opportunities and unleashing innovation,\" Clinton said, \"but its also raising hard questions about workplace protections and what a good job will look like in the future.\", Top Republican opponents pounced on her skepticism, portraying her as out of touch. Within days, former Florida Gov. Jeb Bush made a public show of ordering up an Uber car to deliver him to a tech firm in San Francisco. Sen. Marco Rubio (R-Fla.), whose 2015 book \"American Dreams\" included a chapter called \"Making America Safe for Uber,\" focused on the generational divide, saying Clinton was \"trapped in the past, and cannot understand how the world is changing.\", Rand Paul, the libertarian-leaning Republican senator from Kentucky, wrote dismissively on Twitter that voters shouldnt listen to a candidate whos been driven in a limousine for the last 30 years. Clinton risks alienating Americans who are increasingly enamored of the convenience and efficiency of the \"gig\" economy, or aligning herself too closely with labor-backed liberals, such as New York Mayor Bill de Blasio, who is fighting Ubers push into his city. \"Progressive politicians are making a major error by positioning against the sharing economy,\" Dan Pfeiffer, a former senior advisor to President Obama, said in a tweet. \"We need to be shaping the future, not opposing it.\", Veteran Republican digital strategist Mindy Finn called Clintons comments a \"huge misstep\" that could backfire. \"When I see Hillary Clinton kind of pushing back on the sharing economy  theres nothing about that that I think will be appealing to younger voters.\", But the risks dont flow only one way. With some economists predicting the sharing economy could be as disruptive as the Industrial Revolution, Republicans also may suffer with voters if they present too rosy or simplistic a view. Just as the 19th century backlash against industrialization and worker exploitation led to many of the labor rights and safety protections enjoyed today, a similar movement is building in support of \"gig\" workers forced to scrape together a hodgepodge of jobs that barely pay the bills and lack security, pensions and other workplace benefits. \"This happened during the Gilded Age,\" said labor historian Nelson Lichtenstein, a professor at UC Santa Barbara, comparing the vast wealth of the startups  5-year-old Uber is now estimated to be valued at a stunning $50 billion  to that of the 19th century industrialists. \"That creates the inequality we talk about.\", Its a conversation playing out not only on the campaign trail but in legal battles against the companies in states across the country, including California. At issue is how to reap the economic benefits of the new technologies without losing the hard-fought protections and benefits for U.S. workers. Some policy experts envision a new category of workers, falling between independent contractors and traditional full-time employees. Clintons team downplayed the partisan debate and emphasized that she had \"no beef\" with Uber or other aspects of the sharing economy. At the same time, Clinton anticipates engaging in a broader policy discussion about the changing workplace environment. \"What shes trying to do is start a very serious conversation about this important and growing part of our economy that is adding innovation and opportunity and excitement, frankly, but is also raising challenges and questions,\" Jake Sullivan, a top Clinton policy advisor, told a group of journalists last week. David Plouffe, Obamas former top campaign strategist who now works as a chief advisor to Uber, said the reaction to Clintons July 13 speech was \"overblown,\" noting that she also said \"very positive things\" about the sharing economy. \"My suspicion over time is you will see her embrace what this means,\" Plouffe said Monday on \"CBS This Morning.\", The bigger peril for Clinton, according to her partys progressive wing, would be to retreat from Republican critics and fail to tackle the looming workplace issues raised in the new economy. \"Its a phenomenal opportunity for Democrats to make clear they stand on the side of working people, even when they support innovation,\" said Neil Sroka, communications director for Democracy for America, the organization founded by former Democratic presidential candidate Howard Dean. At the same time, Republican candidates may find their Uber-loving stances get them only so far. Their positions on other issues  including immigration reform and net neutrality  are at odds with much of the tech-savvy and millennial audience theyre trying to attract. When Bush spoke last week in San Francisco, for example, some in the audience were more interested in his opposition to gay marriage. \"It looks so phony,\" said one tech industry professional in Washington who was granted anonymity to frankly discuss the campaign. \"If theyre trying to cater to Silicon Valley and people like me, we see right through this.... Its a dangerous place to put yourself out there as the new economy guy.\", While Uber and other startups have been careful to build bipartisan support for their budding industries and some leaders skew toward libertarianism, leading Silicon Valley-based executives have also made no secret of their reliance on Democratic mainstays. Uber Chief Executive Travis Kalanick, for example, recently praised Obamacare, saying that allowing people to obtain health insurance benefits outside of their job made it possible for people to adopt \"more flexible ways to make a living.\", Uber is also well aware that the current debate is only the beginning of a long discussion about labor policy that will extend beyond the campaign trail. \"Layered on top of all of this is the important question: Whats at stake here?\" said Benjamin Sachs, a professor of labor and industry at Harvard Law School. \"Are the forms of protection and social welfare that weve provided since 1935  are people going to just lose all of that because we have technological change? ... How do we make sure that workers share in the sharing economy?\", lisa.mascaro@latimes.com, Times staff writers Seema Mehta in San Francisco and Michael A. Memoli in Washington contributed to this report. ALSO:, New York City strikes Uber deal, Equal access at issue in PUC battle with Uber over data disclosure, Uber, Lyft carpooling bill stalls in Senate committee ahead of deadline]", "Date": "20150722", "Title": "[2016 presidential race emerging as the first Uber election ]", "Link": "http://www.latimes.com/nation/politics/la-na-uber-election-20150722-story.html\n", "Author": "[Lisa Mascaro]"}
