{"Content": "[Like so many political events, the U.S. Supreme Court decision on Monday that upheld the right of independent citizen commissions to draw district lines inspired a different reaction in California than elsewhere in the nation. Here, it was a victory for Republicans, spared the alternative of having the strongly Democratic Legislature draw lines that would have carved into the GOPs already paltry number of elected officials. Elsewhere, it was a defeat for Republicans, who control legislatures in places like Arizona, where the case originated, and wanted the restoration of the legislatures power to draw lines beneficial to their party. \"In Arizona, the Republicans are upset today, but in California the Democrats might be a little less happy than they might have been otherwise,\" said Jessica A. Levinson, clinical professor of law at Loyola Law School, who specializes in election law. \"Redistricting can sometimes make for strange bedfellows.\", The partisan benefits were not terribly clear in the public reactions of elected officials, many of whom skipped over the political fallout to emphasize their support for the Mom-and-apple-pie notion of citizen involvement, enshrined by two ballot measures. \"Todays decision by the nations highest court supporting redistricting commissions is a victory for Californias open and publicly accessible redistricting process,\" state Senate President Pro Tem Kevin de Lenof Los Angeles and Assembly Speaker Toni G. Atkins of San Diego, both Democrats, said in a statement. \"We hope other states will follow suit now that the court has removed any question about its constitutionality.\", \"California voters overwhelmingly approved Propositions 11 and 20 to take the redistricting process out of the hands of elected officials and give it to an independent body,\" Senate GOP leader Bob Huff of San Dimas said in his statement. \"The courts decision will ensure that Californians will continue to have an open and fair redistricting process.\", The measured nature of the responses reflected the limited effect of the Arizona case on California  at most a few seats would have been affected had the court gone the other way. But waiting in the wings is a far more consequential case that will be heard by the high court next year. That case, Evenwel vs. Abbott, will determine whether district lines are drawn to accommodate a number of residents or a number of eligible voters. The latter category would exclude noncitizens and the young. Many of Californias most powerful Democrats represent districts whose outlines would change dramatically were the court to upend tradition in the Texas case. A court decision to change the defining number from residents to those eligible to vote \"would have a massive impact on national redistricting and specifically on the ability to create districts that empower minority groups  Latinos, Asians, even African Americans,\" said Paul Mitchell, a California redistricting expert. If applied to congressional elections, Mitchell said, a Texas decision could force the combining of urban districts as they now exist in places like metro Los Angeles and the Bay Area and, apart from California, in states like Texas, Florida and New York. (The same would be true at the legislative level, which are specifically included in the case.), The result, he said, would be \"a major shift in voting power\" of Latinos and African Americans. A work-up by Mitchell of the nations congressional districts demonstrated how dramatic the effect would be of a Texas ruling citing the need for eligible voters. Rep. Lucille Roybal-Allards eastside Los Angeles district, for example, would suddenly need an influx of nearly 150,000 eligible voters, as the district would be about half the size it needs to be if those not eligible to vote are brushed aside. Nearby districts are in a similar situation, and thus candidates for combining. (One complication of the Texas case is that its not clear exactly what would make up an eligible voter; the case refers only to \"voters or potential voters\" compared to the population at large.), The winners in the Arizona case announced Monday were Republicans representing districts for which the independent commission drew less-partisan lines than the Democratic Legislature otherwise would have. Among members of Congress, they included Reps. David Valadao of Hanford, Jeff Denham of Turlock and Stephen Knight of Palmdale. All three already are on the GOPs endangered incumbents list for 2016. Democrats also lost an opportunity to strengthen some of their weakest incumbents, including Rep. Ami Bera of Elk Groveand Scott Peters of San Diego. Both survived strong challenges in 2014. Peters district has a one-point Republican registration edge, and Beras a two-point Democratic advantage. Each has a substantial number of nonpartisan voters as well. Before the independent commission was created, those seats would have been redrawn by Democrats in the Legislature to benefit their party incumbents. Opposition to such gerrymandering was the chief argument of the two ballot measures to put control in the hands of the commissionone in 2008, which controlled legislative line-drawing, and a second in 2010 that extended its power to congressional lines. \"The independent redistricting commissions typically do make life and elections harder for incumbents,\" Levinson said. \"The losers today are self-interested incumbents.\", cathleen.decker@latimes.com, Twitter: @cathleendecker. For more on politics go to www.latimes.com/decker. , , , , , , , , , , , , , ]", "Date": "20150629", "Title": "[California GOP benefits from redistricting decision as bigger case looms]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-politics-redistricting-20150629-story.html\n", "Author": "[Cathleen Decker]"}
