{"Content": "[Donald Trump, as expected, stole the show at Thursdays Republican presidential debate. Less dramatic, but more profound, observers believe, was that Facebook co-sponsored the event with Fox News. The social networks high-profile participation spotlights a trend that has been building for years: the ascendancy of social media in electoral politics and the decreasing relevance of traditional television. Videos of Trump dissing people including Rosie ODonnell and his fellow candidates while calling politicians \"stupid\" quickly spread to millions of Facebook users and other social channels online, foreshadowing social medias critical role in the long road to Election Day. As the campaign season builds momentum, those posts will be accompanied by paid political video advertising, providing a healthy boost to the bottom line at Facebook, Snapchat and other social networks that stand to benefit from the new trend in campaign spending. \"It is becoming increasingly difficult for campaigns and political advertisers to reach audiences through traditional methods,\" said Brian Donahue, chief executive of Craft Media/Digital, a Washington, D.C. agency that does traditional and digital advertising for political campaigns. \"The most rapid area of growth is in digital and social media. It has been extremely effective.\", Social medias importance to political campaigning isnt new. Then-Sen. Barack Obama famously leveraged Facebook to help him win the presidency in 2008. About a third of a million more people showed up at the ballot box in the U.S. in 2010 after seeing a \"get out the vote\" message at the top of their news feed on Election Day, according to a UC San Diego-led study. But social media are getting even more influential. Social networks have ballooned since the last presidential election. Candidates are smarter about using them. The platforms are almost ubiquitous among millennials, who pundits believe could be key to winning the election. And as the use of online video has exploded in recent years, campaigners are beginning to combine the targeting power of rich data analytics with videos attention-getting emotional appeal, creating a hybrid form of campaigning tailor-made for the digital age. Many candidates are using the medium to project a more relatable image than what they put out over television ads. With social networks like Facebook, \"campaigns can reach the right slice of voters at the right time with the right message to direct the right outcome,\" Facebook spokesman Andy Stone said. The Menlo Park, Calif. firm doesnt release campaign ad spending figures. Traditional television ad spending will remain dominant  a record 24 million viewers tuned in for the debate  but its centrality has begun to wane. These days candidates are allotting more ad dollars than ever to digital platforms as they recognize the power of social media to connect with potential supporters. Online political spending is estimated to reach more than $1 billion in 2016, according to Borrell Associates, a research firm that monitors ad spending. In 2012, that figure was a mere $159 million. \"An entire wall of TVs blasting candidate-approved messages wont hold back the digital tsunami forever,\" said Corey Elliott, director of research at Borrell. \"In 2016, broadcast TV will still get about 1 out of every 2 political ad dollars, but by 2020, it will drop to almost 1 out of 3.\", Thursdays debate played out in a huge way on Facebook. The companys logo was predominantly displayed throughout the debate. More than 40,000 people responded via Facebook to Fox News call for candidate questions, and 7.5 million Facebook users in the U.S. made 20 million interactions in the form of posts, shares, likes and comments about the debate. \"Facebook is reasserting itself as the place where dialogue happens,\" said Jason Cieslak, Pacific Rim president at global branding firm Siegel+Gale. But rival social networks are also jostling to be part of the election conversation. This year, Snapchat hired Googles U.S. politics ad sales lead Rob Saliterman to make inroads with the political advertising community. The app on Thursday ran a handful of political ads, including one by a PAC supporting Ohio Gov. John Kasich and another from billionaire Tom Steyers NextGen Climate Action Committee. The Venice start-up also compiled a mix of photos and videos into a six-minute feature that included the landing of a plane with \"Trump\" emblazoned on it, Kasich eating a steak before the debate and sound bites from candidate interviews. Snapchat said it didnt yet have viewership figures to share for the feature, but tells advertisers that eight times more people in the U.S. from 13 to 34 view Snapchats overview of big events than watch similar programming on TV. Twitters government team has begun briefing candidates campaigns and political groups on how to use new tools to engage with specific audiences. One of these is the Tailored Audiences feature, which allows candidates to tailor tweets to specific ZIP Codes, ages and other demographic information, spokesman Nick Pacilio said. Samuel Popkin, professor of political science at UC San Diego, said digital advertising is a way for candidates to try to target as many people as possible in the medium they use most frequently. Social media in particular are especially important at this early point in the presidential campaign. \"This is when the people know the least about the candidates and you can plant relevant material.\", andrea.chang@latimes.com, Twitter: @byandreachang, samantha.masunaga@latimes.com, Twitter: @smasunaga, Times staff writer Paresh Dave contributed to this report.]", "Date": "20150808", "Title": "[ From Fox to Facebook: Campaign influence shifts toward social media]", "Link": "http://www.latimes.com/business/la-fi-social-media-politics-20150808-story.html\n", "Author": "[Andrea Chang, Samantha Masunaga]"}
