{"Content": "[The immigration debate in the 2016 presidential campaign unfolded along familiar lines: Republicans called for greater border security and Democrats called for expanded rights for those in the country illegally. All that changed one blue-sky day at Pier 14 on San Franciscos world-famous Embarcadero. A 32-year-old woman was killed July 1 while strolling with her father near the Bay Bridge, allegedly by an immigrant with a lengthy rap sheet who was back in the country despite repeated deportations. The death of Kathryn Steinle scrambled the political equation overnight, throwing immigration reform advocates on the defensive, fueling the anger of hard-liners and causing even supporters of San Franciscos liberal politics to pause and consider its status as a \"sanctuary city\" that generally refuses to turn over immigrants to federal law enforcement officials. Republican presidential candidate Donald Trump gestures to supporters before his campaign tripto Laredo, Texas.He has been among the most vocal critics in denouncing the Obama administrations immigration policy in the wake of the San Francisco shooting death. Republican presidential candidate Donald Trump gestures to supporters before his campaign tripto Laredo, Texas.He has been among the most vocal critics in denouncing the Obama administrations immigration policy in the wake of the San Francisco shooting death. Democrats, notably Hillary Rodham Clinton, sought to strike a delicate balance, continuing to embrace a liberal immigration policy that is a top priority for their base while acknowledging that something went terribly awry in San Francisco. Republicans seized upon the tragedy as visceral proof of their contention that the Obama administrations failure to secure the border has left Americans unsafe. The topic is fraught for the GOP, which needs to improve its standing with Latinos  a crucial and fast-growing bloc of voters  who have been alienated in the past by harsh rhetoric about immigrants living in this country illegally. At the same time, it also offers an opportunity to make inroads with moderate voters who may support the legalization of some immigrants but cannot fathom how a man with the suspects record was ever freed to wander this citys streets. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, \"Its a powder keg,\" said Republican consultant Rob Stutzman. \"People who are very sympathetic to Dreamers, to people being treated fairly, are confounded by why the hell we cant keep criminals either in prison or the other side of the border.\" (Dreamers refer to people brought to the country illegally as minors.), Theres considerable finger-pointing over who bears responsibility for the release of Juan Francisco Lopez-Sanchez, the felon who has been charged with killing Steinle. But political discourse  in the nations capital, on talk radio and cable television, and on the campaign trail  has mostly focused on what responsibility San Franciscos status as a sanctuary city bears in the tragedy. Several Republican candidates called for the federal government to punish the more than 200 jurisdictions that have declared themselves sanctuaries, which were created in part so that immigrants could cooperate with law enforcement without fear they would be deported. Describing Steinle as a \"precious young woman\" who was failed by the system, former Florida Gov. Jeb Bush said that certain federal funds should be denied to jurisdictions that refuse to cooperate with immigration authorities. \"If its an act of defiance against the federal government, then they shouldnt take federal law enforcement money,\" Bush told reporters Thursday after visiting an online firm in San Francisco. Former Arkansas Gov. Mike Huckabee said that, if elected, he would reverse President Obamas executive orders that allow some who are in the country illegally to remain here, while former Texas Gov. Rick Perry called for using either executive order or congressional action to force sanctuary cities to provide immigration officials access to their prisons and holding facilities. Last week, Sen. Rand Paul (R-Ky.) introduced legislation that would require state and local agencies to notify immigration authorities when they arrest and detain anyone in the country illegally. Federal prison officials would also be required to give precedence to transfer requests from Immigration and Customs Enforcement over state and local authorities. Agencies that do not comply would forfeit some federal funding. The House of Representatives voted Thursday, largely along party lines, to approve similar legislation. Donald Trump, the businessman who kicked off his presidential bid last month with rhetoric labeling Mexican immigrants rapists and drug dealers, has seen his standing in the polls rise as he has hammered the issue. He has also been among the most vocal about Steinles killing. \"This man, or this animal, that shot that wonderful, that beautiful woman in San Francisco, this guy was pushed back by Mexico,\" Trump told CNN this month. \"Mexico pushes back people across the border that are criminals, that are drug dealers.\", Some Republicans fear that Trumps inflammatory words are hijacking what could have been a productive dialogue about immigration policy. \"There could have been a very nice, thoughtful discussion,\" said Hector Barajas, a GOP operative in Sacramento who recently acquired half a dozen piatas that look like Trump. \"Now what it has become is a sideshow.\", On the Democratic side, Clinton voiced support for the concept of sanctuary cities while blaming San Francisco officials for not cooperating with the federal government. \"Heres a case where weve deported, weve deported, weve deported,\" she said on CNN. \"He ends back up in our country, and I think the city made a mistake.\", The following day, her campaign released a statement reiterating the candidates support for sanctuary cities and comprehensive immigration reform. Former Maryland Gov. Martin OMalley appeared to criticize Clintons stance but did not mention her by name. \"Local governments should not be blamed for the federal governments inability to fix our broken immigration system, nor should they be held responsible for doing the federal governments job,\" he said. Homeless at the time of his arrest, Lopez-Sanchez pleaded not guilty to murder in the shooting and is being held in lieu of $5-million bail. He is a seven-time felon who has been deported to his native Mexico five times. When Lopez-Sanchez, 52, finished serving a federal prison sentence in March, he was turned over to San Francisco on a 20-year-old bench warrant for a $20 marijuana sale. Prosecutors declined to file charges. Immigration and Customs Enforcement asked to be notified prior to his release, but city officials did not comply because Lopez-Sanchez did not meet their criteria, set in 2013, for turning over people to immigration officials. He was freed. In a jailhouse interview with KGO-TV, Lopez-Sanchez admitted to accidentally shooting a gun he found. He also said \"he knew San Francisco was a sanctuary city where he would not be pursued by immigration officials,\" according to KGO. In California, the matter could affect two of the states top Democrats  Atty. Gen. Kamala Harris and Lt. Gov. Gavin Newsom, who both support sanctuary cities. Newsom was mayor of San Francisco and Harris the citys district attorney in 2008 when an immigrant, who was in the country illegally and had felony juvenile convictions, killed three people. Harris is a candidate for the states open U.S. Senate seat next year, and Newsom is running for governor in 2018. Several San Francisco residents interviewed near the site of the shooting said they were sympathetic to people living in the U.S. illegally, but they couldnt understand how Lopez-Sanchez was released. \"He came in the country five times illegally. Something obviously needs to be changed there,\" said Jeffrey Yip, a 32-year-old Democrat. The software developer walks to Pier 14 and sits gazing at the bay during work breaks. On a recent day, he sat near the flower-strewn memorial at the spot where Steinle was shot. \"I come here every day,\" he said. \"I expect it to be safe.\", seema.mehta@latimes.com, Twitter:@LATSeema, MORE:, Sanctuary cities: How Kathryn Steinles death intensified the immigration debate, House passes bill to curb funding for sanctuary cities, At Texas-Mexico border, Donald Trump cites great danger from immigrants, ]", "Date": "20150724", "Title": "[San Francisco slaying upends immigration debate in 2016 presidential race]", "Link": "http://www.latimes.com/nation/la-na-politics-immigration-20150724-story.html\n", "Author": "[Seema Mehta]"}
