{"Content": "[The field of candidates to replace retiring U.S. Sen. Barbara Boxer began to take shape Monday, with Atty. Gen. Kamala Harris deciding to run for the seat and Lt. Gov. Gavin Newsom taking a pass. Harris plans to formally announce her bid for the 2016 contest today. \"Shes charting the course. Shes in with both feet,\" said an advisor who requested anonymity to discuss Harris plans. Boxers announcement last week that she would not seek reelection prompted immediate jostling among politicians in California, where there has not been an open U.S. Senate seat in more than two decades. Harris and Newsom, charismatic Democrats, were widely viewed as the top candidates for the post. Their decisions avert an ugly battle between the pair, who share many of the same supporters, have national profiles, are both from the Bay Area and are popular in the liberal wing of the Democratic Party. Newsom, in announcing that he would not seek Boxers seat, nodded to the notion that he plans to run for governor in 2018, when Gov. Jerry Brown cannot run again. \"Its always better to be candid than coy. While I am humbled by the widespread encouragement of so many and hold in the highest esteem those who serve us in federal office, I know that my head and my heart, my young familys future, and our unfinished work all remain firmly in the state of California  not Washington, D.C.,\" Newsom said in a statement. Newsom briefly ran for the post in 2010 before bowing out as it became clear that Brown would clinch the Democratic nomination. He did not deny that he remained interested. \"I think it would be a stretch to suggest that someone who was in the race briefly a few years back would not be considering something along those lines. I dont want to mislead folks,\" Newsom told The Times in an interview as he left Mayahuel, a Mexican restaurant a block from the Capitol, where he had lunch with California Secretary of State Alex Padilla. He denied that he and Harris cut a deal for each to run for different offices, as some have suggested they would do. It is \"nonsense that there is some kind of understanding,\" Newsom said, while hinting that he would support a Harris bid for Senate. Newsoms move was unsurprising in that he has made his desire to run for governor clear in recent years. He also has three young children, and he and his wife were reluctant to leave their Marin County home. Some had speculated that Harris, who is newly married to a Los Angeles-area attorney, would also be reluctant to move from California. But her husbands law firm has an office in Washington, D.C. and she has close relatives on the East Coast. If she is unsuccessful in her Senate run, she will remain attorney general, a top perch from which to seek higher office in the future. Other top Democrats weighing bids are former Los Angeles Mayor Antonio Villaraigosa and billionaire environmental activist Tom Steyer. Several members of Congress are contemplating entering the race, as well as at least three little-known Republicans. Among the top Democrats, Harris, 50, has a highly visible public platform as a second-term attorney general who gained fame for winning settlements from banks over misconduct in how they wrote mortgages. She would probably attract support from groups that want to increase the number of women in office, and from minority voters. She was barely elected to her post in 2010 among concerns that she was soft on crime, but she has since consolidated support among law enforcement. Her challenge is to create a credible, compelling reason for her candidacy, notably among voters who remain concerned about the states economy. Some view her as overly cautious. And her career will be picked apart, in particular her decision as district attorney in San Francisco not to pursue the death penalty against a cop killer. Her former personal relationship with former Assembly Speaker and San Francisco Mayor Willie Brown would also probably come under scrutiny. Villaraigosa was a two-term mayor of the largest city in the state and would draw the support of Latinos, a growing voter bloc that is likely to turn out in high numbers in 2016, the same year as the presidential election. But he too has personal baggage: adultery that led to the dissolution of his marriage and business decisions he has made since leaving office. In addition, he has been out of the public eye since 2013. Steyer, for his part, has an estimated fortune of $1.6 billion, giving him the ability to fund his own bid  significant in a state as large as California, where a Senate run will cost at least tens of millions of dollars. But the former hedge fund managers business record and investments will be scrubbed by his rivals, and he is vulnerable to charges of hypocrisy because although he is now a clean-energy crusader, he has made money on coal investments. Rose Kapolczynski, Boxers longtime campaign manager, said Harris decision to enter the race makes her the current front-runner to replace the senator, but she also pointed out that its early. \"Kamala Harris is a very strong candidate,\" Kapolczynski said, \"but I dont think we can say the race is over 17 months before the primary.\", seema.mehta@latimes.com, Twitter: @LATSeema, Times staff writer Patrick McGreevy in Sacramento contributed to this report.]", "Date": "20150112", "Title": "[Race to replace Sen. Boxer: Kamala Harris is in, Gavin Newsom is out]", "Link": "http://www.latimes.com/local/politics/la-me-pol-boxer-senate-20150113-story.html", "Author": "[Seema Mehta]"}