{"Content": "[After being the focus of Hillary Rodham Clintons criticismof voter registration laws, Republicans shot back on Sunday, lambasting the former secretary of State and front-runner for the Democratic presidential nomination as out of touch with states rights. \"She doesnt know what shes talking about,\" said New Jersey Gov. Chris Christie in an interview on CBSs \"Face the Nation.\"\"In New Jersey, we have early voting that are available to people.\", In a speech last week, Clinton castigatedChristie, former Govs. Jeb Bush of Florida and Rick Perry of Texas, and Wisconsin Gov. Scott Walker for \"deliberately\" seeking to disenfranchise voters throughout the nation with laws that make it harder to cast ballots. Christie, who will decide this month if he will run for the GOP presidential nomination, vetoed a Democratic bill in 2013 that would have expanded in-person early voting in the state. Speaking on \"Face the Nation,\" Christie said he doesntwant to expand early voting and \"increase the opportunities for fraud.\", \"And maybe thats what Mrs. Clinton wants to do. I dont know. But the fact is that the folks in New Jersey have plenty of an opportunity to vote,\" he said. Perry, the longest-serving governor in Texas history who last week announced his second bid for the Republican nomination, dismissed Clintons comments as \"ridiculous.\", \"Its way outside the norm of ridiculous, if you want to know the truth of the matter, to call out the people of the state of Texas, because thats what she did,\" Perry said onCNNs\"State of the Union.\", In Texas, Perry signed into law a controversial GOP measure thatrequires the states estimated 14 million registered voters to show photo identification to cast a ballot. The law, which has faced several legal battles, was allowed to take effect last fall by the Supreme Court. Republican-led legislatures from North Carolina to Texas have in recent years passedmeasures, including voter-identification requirements and limits on early voting, which have been widely criticized by Democrats as moves to disenfranchise minority voters. Clinton, in her Houston speech, called forautomatic voter registration, which would register every American citizen at 18 -- similar to a recently passed state law in Oregon. Moreover, she called on the GOP-led Congress to reinstateakey provision of the Voting Rights Act that had required states with a historic pattern of restricting minorities from voting to get federal approval before making changes to election laws. The Supreme Court in 2013 struck down the provision. I think this would have a profound impact on our elections and our democracy, she said. kurtis.lee@latimes.com, Follow @kurtisalee for political news]", "Date": "20150607", "Title": "[Republicans: Hillary Clinton's attacks on voter registration laws 'ridiculous']", "Link": "http://www.latimes.com/nation/politics/la-pn-perry-christie-on-voter-laws-20150607-story.html\n", "Author": "[Kurtis Lee]"}
