{"Content": "[Buried in debt, Centinela hospital of Inglewood was on the verge of bankruptcy in 2007. It had lost $50 million in four years, and local officials worried that it might close  following the path of several other South Los Angeles hospitals. But where others saw risk, cardiologist Prem Reddy saw opportunity. Reddys company, Prime Healthcare Services Inc. bought Centinela and quickly turned it around, cutting expenses and increasing revenue. Centinela lost $63 million in 2007. Six years later, it made $39 million. Today its rated among the better-performing hospitals in the state. The Ontario company has followed the same model over and again, growing from a single hospital in 2001 to the 30 it now operates in nine states. Reddy has become one of the most powerful  and polarizing  figures in healthcare. Critics say he reduces important but unprofitable services. Supporters say hes rescued hospitals that otherwise would have failed, improved services and provided an impressive amount of care to indigent patients. In his boldest move yet, Reddy is now trying buy a chain of six nonprofit Catholic hospitals across California, including St. Francis and St. Vincent medical centers in Los Angeles County. Acquiring the Daughters of Charity Health System hospitals, which are also on the verge of bankruptcy, would be a major step for his growing company. But the $843-million deal needs the blessing of California Atty. Gen. Kamala Harris, who must approve sales of nonprofit hospitals. The deals biggest opponent is a union that was among her biggest political contributors in her 2010 and 2014 campaigns. As Harris campaigns for Barbara Boxers U.S. Senate seat, she is likely to need union votes and money. A decision is expected by Feb. 20. \"Saving these six hospitals is very dear to me,\" Reddy told The Times. \"I hope and pray the attorney general looks into what went into this decision-making process and, more importantly, what will be the consequences if she denies this: Six hospitals will go into bankruptcy.\", In Prime Healthcares early years, Reddy was attacked for his ruthless drive to cut costs. He canceled contracts with insurance companies and used emergency rooms to replace lost revenue. He was repeatedly accused of trying to avoid caring for those unable to pay, allegations that he strongly denied. In a lawsuit, Kaiser Permanente contended that Prime Healthcare hospitals needlessly admitted emergency room patients, rather than transfer them to Kaiser facilities. Reddy denies wrongdoing, and his company is suing Kaiser for tens of millions of dollars in unpaid bills. Both lawsuits are pending. Reddy was arrested in 1999 and charged with threatening a doctor at a San Bernardino County hospital, but the case was dismissed after the doctor recanted his allegations. A judge later declared Reddy factually innocent. The chains biggest adversary has been the SEIU-United Healthcare Workers West, a union that represents about 150,000 healthcare workers in California, including about 2,600 at the Daughters of Charity hospitals. The group has run a five-year, highly public campaign aimed at exposing alleged violations by Prime Healthcare. Among the more serious allegations: Prime has been accused of overbilling Medicare, the subject of an ongoing Justice Department investigation. The company also paid $275,000 in 2013 to resolve a federal investigation into the improper release of a patients records. In 2011, the union helped persuade Harris to reject Prime Healthcare Foundations proposed purchase of Victor Valley Community Hospital in Victorville. The sale was \"not in the public interest and will likely create a significant effect on the availability or accessibility of healthcare services to the affected community,\" she said. In all, the attorney generals office has approved two past purchases by Prime and rejected two others. The unions research helped spur an ongoing Justice Department investigation of Prime Healthcares billing practices. It has issued dozens of news releases critical of the hospital company and built a coalition of state and federal lawmakers opposing the proposed Daughters of Charity sale. \"Their entire strategy is based on extracting as much money as possible,\" said Dave Regan, president of the SEIU-United Healthcare Workers West. \"I just think this is a company thats bad for healthcare, bad for patients.\", Despite the unions campaign, many in the healthcare industry say Reddy has learned to play nice, to his companys benefit. The California Nurses Assn. for instance, supports the Daughters of Charity sale to Prime Healthcare. Robert Issai, chief executive of the Daughters of Charity chain, said Reddy  and his companys track record  won him over. In his yearlong effort to find a buyer, Issai said he reached out to more than 100 potential buyers and received six offers for the system before picking Prime. \"The Prime Healthcare of six years ago is different than Prime Healthcare today,\" Issai said. \"I think what motivates [Reddy] is to make a difference. He goes after hospitals that are almost in bankruptcy. He takes that as a challenge and he feels pretty good about himself that he was able to save these hospitals.\", Issai said the Daughters of Charity board chose the chain because it promised to assume more than $300 million in pension liability and keep the hospitals open for at least five years, while keeping most of its 7,600 employees. As Prime Healthcare grew, Reddy was able to negotiate favorable contracts with the biggest names in health insurance: Aetna, Blue Cross, Blue Shield, UnitedHealthcare, Health Net. Many of them have contracts at all 30 Prime Healthcare hospitals. \"Its not that our business philosophy changed, its that we became so big  the health plans started recognizing and having to deal with us,\" he said. The Prime Healthcare hospitals have received numerous honors for their quality of care. Last year, the Leapfrog Group, a nonprofit that rates hospital safety, gave the Prime Healthcare hospitals in California an average safety score that exceeded the statewide average. Steve Valentine, a healthcare finance consultant and president of the Camden Group in El Segundo, said Reddy used an unusual approach to building his company in the early days. His hardball approach alienated labor unions, insurers and patients who ended up with high out-of-pocket costs, Valentine said. \"But much to Prime Healthcares credit, they took hospitals that otherwise were going to go out of business and they kept them afloat, invested in them and now they make money,\" Valentine said. \"He has done things very unorthodox compared to the rest of the industry, but hes done it under the law.\", Reddy, 65, was born and raised in India, the eldest of four children from a farming family. Their home had no electricity, no potable drinking water. He was the first in the family to receive any formal education. While attending medical school, Reddy met his wife, Venkamma. The couple moved to the United States in 1976 to begin a residency program at Downstate Medical Center in Brooklyn, N.Y. While attending a medical conference in Anaheim, Reddy learned about an opening for a cardiologist at St. Marys Medical Center in San Bernardino County. He liked the Apple Valley suburbs quiet pace. \"It was like coming back to the village where I came from,\" he said. \"A lot of tumbleweeds.\", He learned a quick lesson about living in the desert community, which he still calls home: When tumbleweeds drift onto the road, \"You need to be careful not to swerve your car. You need to hit them straight on.\", Its how he approaches business too. Through the years, Prime Healthcare has developed a model to help turn money-losing hospitals profitable, Reddy said. It slashes middle management, which reduces costs and speeds decision-making. And if insurance contracts pay too little, he negotiates new ones. The turnaround of Centinela hospital was key to a region that had been hit by the closures of Daniel Freeman in Inglewood, Robert F. Kennedy Hospital in Hawthorne and Martin Luther King Jr./Drew Medical Center near Watts. \"Centinela was in danger of closing,\" Inglewood Mayor James T. Butts Jr. said. \"It now flourishes.\", Still, many people have asked Reddy whether acquiring the Daughters of Charity hospitals is worth the fight. \"I have more than enough money to satisfy me and my family, but thats not whats important to me,\" he said. \"Its the mission: saving hospital companies, saving lives. That fire wont die, until I die.\", stuart.pfeifer@latimes.com, Twitter: @spfeifer22]", "Date": "20150201", "Title": "[ Hospital chain Prime Healthcare faces a fight to grow]", "Link": "http://www.latimes.com/business/la-fi-prem-reddy-20150201-story.html\n", "Author": "[Stuart Pfeifer]"}
