{"Content": "[Sen. Bernie Sanders (I-Vt.) is calling upon President Obama to cancel his plans to visit Nikes corporate headquarters this week as part of the White Houses push to drum up support for a major new trade agreement. Sanders said the shoe giant, which has moved many of its manufacturing jobs to cheaper markets overseas, only epitomizes how previous trade deals \"have failed American workers.\", In a letter sent to ObamaWednesday afternoon and obtained by the Los Angeles Times, the self-identified socialist, who is now running for president as a Democrat, says the proposed Trans-Pacific Partnership, or TPP, would only boost Nikes profits while doing nothing to increase manufacturing jobs here. \"While manufacturing may not be the most glamorous job, Im sure that there are workers across America, from Baltimore to Los Angeles to Vermont to Ferguson, who would be more than happy to be paid $15-$20 an hour to manufacture the Nike products they buy,\" Sanders wrote. Obama plans to visit Nikes Portland-area headquarters Friday morning as he takes his sales pitch outside Washington for both the 12-nation Pacific trade deal and the so-called \"fast track\" authority he has said is vital to finalizing negotiations with Japan and other partners. Obamas fellow Democrats are proving to be the main obstacle to passing both in Congress, but he has been ramping up his appeals in recent weeks. White House Press Secretary Josh Earnest told reporters Wednesday that the president would use his visit Friday \"to illustrate how a responsible trade agreement that includes enforceable labor and environmental standards would strongly benefit middle-class families and the American economy.\", Many Democrats point to past trade agreements like the North American Free Trade Agreement, or NAFTA, as a factor in Americas manufacturing decline. But Earnest said the president envisions a final trade agreement that includes enforceable labor and environmental provisions. \"The view of the president is that if the United States is not the one that is engaging in this economically dynamic region of the world, then we are essentially ceding ground to China,\" Earnest said. \"And China will most assuredly try to write rules of the road that further disadvantage American companies who are trying to do business in this region of the world.\", But Sanders said TPP would \"do nothing to encourage Nike to create one manufacturing job in this country,\" and would only boost its executives compensation. He cited a study that Nike employs more than 300,000 workers in Vietnam, where the minimum wage is just 56 cents an hour and labor unions are banned. \"If Nike can sell a pair of LeBron XII Elite iD shoes online for $320 in this country, it should be making these shoes and other products here, not in Vietnam or China.\", Acknowledging that Obama was likely to press ahead with the trip, Sanders called upon the president to raise the issue with Nike Chief Executive Phil Knight. Follow @mikememoli for more news out of Washington.]", "Date": "20150506", "Title": "[Bernie Sanders criticizes Obama's planned Nike visit to promote trade deal]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-sanders-obama-nike-20150506-story.html\n", "Author": "[Michael A. Memoli]"}
