{"Content": "[Kristina Schake had built a solid reputation among political operatives for driving the shift in voter opinion on gay marriage, foiling Big Tobacco forces and helping Michelle Obama transcend the traditional role of first lady -- but the State Department was not her wheelhouse. So when Schake was about to interview this year for a big job on the campaign of Hillary Rodham Clinton, the former secretary of State, she needed a crash course in foreign affairs. The tutor she chose had a surprising background: a confidante of Condoleezza Rice who helped the administration of George W. Bush craft national security policy and schooled Sarah Palin in diplomacy. The two were a political mismatch. But they were aligned on more important things. They were sisters. Every time one of us has something big we are looking at, it is the other one we want to talk to, said Schakes sister, Kori. Get more national political newsand the latest from Campaign 2016 >>, The sisters from Sonoma inhabit opposite ends of the California political divide. Kori Schake operates out of Stanfords Hoover Institution, the West Coast spawning ground for conservative thought. Prominent Republicans seek her guidance on such matters as State Department management and the intricacies of NATO politics. Her younger sister by eight years, Kristina, a former LOreal executive and voracious consumer of all things pop culture, is one of the lefts most sought-after image advisors. Rob Reiner, Maria Shriver, Michelle Obama and now Clinton have all looked to Kristina Schake to build campaigns fueled by whats trending back in the real world. Californians are rightfully grumpy about how little attention presidential candidates seem to pay voters in their noncompetitive state. But the Schake sisters underscore how big California ideas and movements  on the right and the left  are guiding presidential politics. Serving as deputy communications director at the sprawling Clinton campaign, Kristina Schake has one of the most formidable tasks in Clintons Brooklyn headquarters: softening the battle-hardened candidates image and making her more relatable to the everyday Americans that Clinton talks about often. Schake has spent considerable time in Washington, but unlike so many others on that staff, she is not of Washington. She clings to her California sensibility. What I bring to it really is the ability to say, If I were in California right now, is this something I would be thinking about? Are we breaking through? Schake said. Perhaps its predictable a Democrat would use California as a guidepost. But Schakes hawkish sister -- who served as a senior campaign advisor to John McCain because, as she puts it, McCain believed in actually winning the wars we fight -- is also particularly fond of West Coast thinking. There is a much bigger-sky approach out here, Kori Schake said. In Washington, people start every policy conversation with the limitations. Here there is a vibrancy and tolerance for failure. You dont fail; you just dust yourself off and start over. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, California serendipity guided Kori Schakes career. It presented itself when she was a Stanford undergrad short on course credits for her major. The only remedy was a tedious-looking class on Soviet political elites. As happens at Stanford, it was taught by a professor able to open all manner of career doors. In this case, it was Rice. When Rice led the National Security Council, she made Schake her director of defense strategy. While Rice was secretary of State, she brought Schake in to explore how the agency could be shaken up to run more effectively. Rudy Giuliani recruited Schake as a senior advisor for his presidential bid in 2008. When his candidacy flamed out, McCain came knocking. Veterans of the campaign say Schake was a moderating counterbalance to some of the aggressive neoconservatives who dominated McCains inner circle. When Kori Schake later left Washington to take the position at Stanford, Kristina Schake gave her a copy of California, Kevin Starrs sweeping history. She wanted to make a thoughtful Californian out of me, Kori Schake said. The sisters grew up bound by few limits, with an airline pilot father who encouraged them to explore the world (they did) and a fiery community activist mother always pushing them to take a stand (they did). Kristina Schakes imprint is evident throughout the Clinton campaign, from the campy Snapchat photos to the emphasis on the candidates experiences as a grandmother. Campaign officials are adamant that the quaint van trip across the Midwest that Clinton took when she launched her bid was all the candidates idea, but even if Schake didnt have a hand in it, the event speaks to why Clinton hired her. It is exactly the kind of thing Schake would cook up. It was under Schakes guidance that First Lady Michelle Obama cultivated an image as a pop culture icon, yet a relatable one. Schake encouraged the undercover shopping trip by Obama to Target, Obamas recruitment of Wal-Mart as a partner in a landmark nutrition crusade, and the mom dance the first lady performed with Jimmy Fallon. It was on Schakes watch that Obama presented the best picture prize at the Academy Awards. The strategists methods were shaped in some notable California battles, involving notable California personalities. Maria Shriver consulted with Schake while creating her annual womens forum, which has become a massive event attracting speakers as diverse as the Dalai Lama and Billie Jean King. She has this great sense of how someone is presenting herself, said Rob Reiner, the Hollywood director. Not just whether the person is saying the right things, but how they are coming off. He leaned heavily on Schake to pass Proposition 10, Reiners successful crusade to fund early childhood education with a tobacco tax, approved in 1998. The cigarette companies were pummeling the campaign with negative advertising. Schake confronted it by coming up with endless story angles for local newspapers and television news crews to pursue that raised suspicions about tobacco company motives. NEWSLETTER: Get essential California headlines delivered daily >>, A decade later, in 2008, Schake would find herself again plotting with Reiner and her then-business partner, Chad Griffin, on another historic California campaign. The way they went about reversing the states ban on gay marriage is the stuff of a Hollywood script  in fact, it eventually became the focus of the HBO documentary The Case Against 8. Like so many schemes of that time involving Hollywood players and money, it sprouted from a conversation at the Polo Lounge, where Reiner often held court. A Reiner acquaintance joined the conversation, urging the group to call her sisters ex-husband, who was a lawyer. It was a forgettable moment. Everyone at the table already knew lots of capable lawyers. Later, though, the woman followed up. Her sisters ex was Ted Olson, the prominent conservative who represented George W. Bush in the Supreme Court amid the contested presidential election of 2000. The darling of the right wing, it turned out, was deeply troubled by the gay marriage ban in his native state. This is the same guy who put me in bed for two days after Bush vs. Gore, said Reiner. But if it was true he was on our side, we had a chance of winning. The legendary legal bid that Olson would mount in partnership with David Boies, his Bush vs. Gore rival, was successful in persuading the courts. Schakes role was arguably tougher. She had to help persuade the public, which was key to creating an environment in which judges would be comfortable jettisoning a law approved by voters. We needed to make this issue real to people who were not gay, and get them to feel some empathy and connection to it, Schake said. The work she and Griffin did took many paths, but one of the most successful was through People magazine. It reached millions of Americans who were on the fence. Schake reads about 40 magazines a month, but she pays particular attention to People, which has huge reach among the moderate middle. She said, Think of all the other mothers who will read that magazine and see you there with kids, said Kris Perry, one of the plaintiffs profiled in the People article Schake pitched. Just that photo will change how they view the fight. Kori Schake marvels at her sisters pop culture IQ. It is not, she said, in the family DNA. Kori Schakes own fondness for periodicals tends to run toward academic journals. We compete for the aunt of the year award in the Schake tribe, she said. There is no question that while my nephews may consider me the adventurous one, she is the cool one. She sends them music that 18 months later they begin to hear played on the radio. evan.halper@latimes.com, Twitter: @evanhalper, ALSO, Are Republicans losing white voters too?, California Republicans echo U.S. trends, favoring outsiders Donald Trump and Ben Carson, Which presidential campaign is winning over Silicon Valley? None of them]", "Date": "20150914", "Title": "[Sisters, top advisors with opposing views, bring California influence to campaign trail]", "Link": "http://www.latimes.com/politics/la-pol-prez-california-sisters-presidential-politics-20150914-story.html", "Author": "[Evan Halper]"}