{"Content": "[Hillary Rodham Clintonis on track to raise a record $45 million in contributions during her first quarter as a 2016 presidential candidate, building a formidable campaign fund that further solidifies her position as the prohibitive Democratic front-runner, according to numbers released by her campaign Wednesday morning. In a sign of the growing dominance of money in politics, the staggering amount of cash far exceeds what Clinton raised during her first quarter as a candidate eight years ago, when officials from her campaign reported they were ecstatic with her $26-million haul. It also dwarfs the amount her next-closest rival, Vermont Sen. Bernie Sanders, is likely to raise. The fundraising quarter that ended Tuesday is traditionally used as a barometer to gauge the strength of campaigns. Clinton officials boasted that they bested the previous record for a first-quarter candidate, which was set by President Obama in 2011 as he embarked on his reelection campaign. Obama raised $41.9 million during that period. But the large bank account by no means clears the field for Clinton. Sanders, who has not yet released his fundraising figures, has enough in the bank to mount a competitive challenge in at least the early states. Earlier in the quarter, he had already raised $8 million from more than 200,000 donors. At this stage in the campaign, the number of donors can be as important as the total amount raised, as it reflects grass-roots support and enthusiasm. The Clinton campaign did not reveal how many people contributed in a background memo sent to reporters. But it noted that 91% of the contributions were $100 or less. In the final days of the quarter, the campaign had blitzed supporters with emails, imploring them to give as little as $1  a clear sign of Clintons eagerness to show broad-based interest. The pitches set a goal of 50,000 contributions. Campaign officials have said they need $100 million to win the primary. They are clearly well on their way. Should Clinton win, however, she will need ramp up her fundraising substantially. A successful general election campaign fund would likely exceed $1 billion. Much of that money wont be directed to the official campaign account, which cannot accept contributions exceeding $2,700 per donor. The funds will be sent to Clintons super PAC, which evades federal fundraising rules by operating independent of the campaign. Donors are free to give unlimited amounts to that fund. Sanders has made a point of not permitting his supporters to form a super PAC, saying such solicitation of unlimited cash is corrupting democracy. For more campaigncoverage, follow@evanhalper]", "Date": "20150701", "Title": "[Clinton on track to raise $45 million to build campaign juggernaut]", "Link": "http://www.latimes.com/nation/la-na-hillary-clinton-fundraising-20150701-story.html", "Author": "[Evan Halper]"}