{"Content": "[Supporters of a state ban on single-use plastic grocery bags filed a complaint Monday, calling for the secretary of state to investigate allegations that opponents seeking to overturn the measure are misleading voters to get them to sign petitions that would place the matter on the ballot. Gov. Jerry Brown in September signed the legislation that requires grocery stores and pharmacies to stop dispensing single-use plastic bags in July and instead offer paper and reusable plastic bags, and charge at least 10 cents each for those alternatives. The bag-makers group, the American Progressive Bag Alliance, is seeking to overturn the law, arguing it will not improve the environment but will enrich stores charging 10 cents for alternative bags. The bag makers face a Dec. 29 deadline to file 504,760 signatures in order to qualify a referendum that would put the new law on hold until Californians can vote on the measure in November 2016. In a written complaint, the group California vs. Big Plastic, which supports the law and opposes the drive for the referendum, said that several voters were misled by signature gatherers who told them they needed to sign the petitions to save the law or to make it statewide or nationwide. The law would take effect statewide in July if the referendum does not qualify. \"To ensure the integrity of the state referendum process is not tarnished by criminal behavior, we request an immediate investigation into these disturbing reports of voter fraud during circulation of the Referendum to Overturn Ban on Single-Use Plastic Bags petition,\" wrote attorney Lance Olson, representing the group supporting the ban. He submitted the names of 50 voters who felt they were not given an accurate description of the referendum by the signature gatherers. Some voters, including Anita Simons of La Jolla, said that petition gatherers told them the referendum was to get rid of the 10-cent charge for alternative bags, but if voters defeat the referendum it will repeal the entire law. \"Its become clear that signature gatherers are saying and doing anything to trick voters into signing these petitions,\" said Mark Murray, a spokesman for Californians Against Waste. \"Given the overwhelming strong support for the law, its not surprising that this turkey of a referendum attempt issuch a hard sell.\", Representatives of the bag makers did not immediately have a response to the complaint. However, Lee Califf, the alliances executive director, said his group is on track to qualify the referendum. The APBA is confident the required number of signatures will be submitted by the deadline and the referendum against SB 270 will be qualified, Califf said in a statement. California voters will have an opportunity to make their voice heard at the ballot box in 2016. The bag makers have so far spent $2.7 million on the referendum drive, $1.7 million of which has come from Hilex Poly Co. a bag maker from Hartsville, S.C. Nicole Winger, a spokeswoman for the Secretary of States Office, said it does not confirm or deny the existence of complaints and investigations. \"I can tell you that secretary of state staff take every allegation seriously and look into issues that are brought to their attention,\" she said.]", "Date": "20141215", "Title": "[Plastic bag-ban supporters complain referendum drive is misleading]", "Link": "http://www.latimes.com/local/political/la-me-pc-plastic-bag-ban-referendum-misleading-20141215-story.html\n", "Author": "[Patrick McGreevy]"}
