{"Content": "[In a season of rough campaign attack ads, the one aimed at a North Carolina judge was among the roughest. \"Justice Robin Hudson sided with the predators,\" viewers were told. \"Justice Robin Hudson  not tough on child molesters, not fair to victims.\", Hudson, a Democrat on the North Carolina Supreme Court, was one of the state-level judges targeted this year by the Republican State Leadership Committee, which spent $4 million nationwide on an effort to tilt state courts in a conservative direction. Though Republicans took control of the Senate and many governors mansions in the midterm election, the committees courthouse campaigns fell short of unseating Hudson and judges it targeted in Montana, Tennessee and Missouri. Judicial campaigns once were typically sedate affairs, little noticed outside of bar association dinners, but that is changing rapidly under a new wave of campaign spending driven by outside political groups and unlimited donations. Court campaigns in several states set spending records, according to a study that counted about $14 million in television advertising in state Supreme Court races  about $2 million more than in 2010. \"Special-interest groups are seeing that with a small amount of money, relative to what they spend on a governors race, they can have a big impact,\" said Barbara Pariente, a Supreme Court justice in Florida who in 2012 fended off the state Republican Party and Americans for Prosperity, an outside organization funded largely by the billionaire conservative Koch brothers. \"Even if they dont succeed in removing a justice, they believe they have succeeded in sending a message: When you make a ruling against public opinion, you do it at your peril,\" she said. Taking the lead are conservative organizations often looking for judges who will make business-friendly decisions or support their social causes. The big money on the Democratic side has traditionally come from trial lawyers, who see a vested interest in protecting judges sympathetic to victims suing for negligence. The rising tide of money in judicial elections can undermine judges independence by forcing them to seek campaign dollars. Reform groups argue that judges, unlike legislators, need insulation from the swings of public opinion. \"We expect judges to do things differently,\" said Bert Brandenburg, executive director of Justice at Stake, a group that opposes special-interest pressure on courts. \"The more we ask judges to take off the black robes and put on politicians three-piece suits, the greater the risk those politicians will intrude in courtrooms.\", American methods of picking judges reflect an unease with allowing them to be tainted by politics. In 24 states, governors choose candidates screened by bipartisan committees. But voters usually decide whether judges can keep their jobs, and some of the nastiest attacks have come in those elections. State courts hear 100 million cases a year, many on important issues: death row appeals, voter ID laws, the drawing of legislative districts, how much money accident victims can recover. For outside groups, trying to turn a judicial race is still a bargain. A $750,000 ad buy, a fraction of whats spent in a campaign for governor or Senate, can sometimes affect the outcome of a race in which voters are barely acquainted with whos running. Some state courts have seen pitched ideological battles. Courts in Texas and Alabama were considered sympathetic venues for plaintiffs and big judgments before political consultant Karl Rove helped engineer years-long fights to elect conservative judges in both states in the 1990s. Watchdog groups say such outside spending on judicial campaigns has become more widespread and aggressive since the Supreme Courts 2010 Citizens United decision, which removed limits on how much corporations could contribute to political causes. The influx of money, some of it from undisclosed sources, has trickled down into statehouse and judicial campaigns. \"The sad part of this is, this has become the new normal,\" Brandenburg said. \"This is really far beyond what anybody has ever seen.\", The head of the Republican State Leadership Committee said the groups campaign took shape last year in response to complaints from statehouse Republicans. \"They were passing legislation and they were finding courts were out of step with the views from voters about where they wanted the state to go,\" said Matt Walter, the committees president. \"These good policies were running into the buzz saw of a liberal judiciary.\", In North Carolina, Republicans who took over the states General Assembly in 2010 passed a law ending public financing of court elections. Thats where the leadership committee made its biggest play this year, sending $1.3 million to a conservative group called Justice for All NC. In 2012, the North Carolina group spent heavily against the state Supreme Court bid of Sam Ervin IV, grandson of the senator who led the Watergate investigation. Ervin won a seat on the court this month. Justice Hudson, a Democrat first elected to the North Carolina court in 2006, said her consultants warned her to expect the same treatment. But she wasnt anticipating an ad saying she supported child molesters; she said it began airing about 10 days before the May primary and seemed to be \"run nonstop on every TV outlet in the state.\", \"I was, of course, horrified,\" she said. The ad refers to a dissent Hudson wrote in which she said it was unfair that a law requiring sex offenders to wear electronic-monitoring devices should apply to a man who was convicted before the law was passed. She said the ad distorted her position and prompted a strong backlash from voters and the media. \"It backfired big-time,\" she said. Walter said his committee \"didnt have a say\" in the content of the ad, and he declined to offer an opinion on it. A Justice for All director did not return requests for comment. There is some evidence that the ads can sway rulings. In states with more spending, judges were found to be 7% to 8% less likely to vote in favor of defendants appeals, according to a recent study. The biggest donors to the Republican State Leadership Committee were corporations and businessmen. Tobacco company RJ Reynolds, the Chamber of Commerce, Blue Cross/Blue Shield and the Koch brothers were among the largest donors, according to data gathered by the Center for Responsive Politics. But the committees ads often said little about economic issues, instead hammering judges as soft on criminals; such gut appeals are often more effective, say experts on judicial elections. \"People dont care about business interests for the most part,\" said Joanna Shepherd, an Emory University law professor who co-wrote the study. One of the most expensive and contentious races this year was in Illinois, where Justice Lloyd Karmeier ran for a second 10-year term. His first campaign, in 2004, cost a record $6.8 million; he was one of the judges who set aside a $10.1-billion verdict against tobacco giant Philip Morris. This year, lawyers appealing that decision demanded Karmeier recuse himself from the case, citing millions in campaign donations from the chamber and other groups supporting Philip Morris. But Karmeier declined, saying that he got no money directly from the tobacco giant and that there was no evidence he couldnt be impartial. \"The choice we were confronted with was: Do you do something about this, or do you roll over?\" said George Zelcs, one of the lawyers. He wrote two $300,000 checks to a group called the Campaign for 2016, which ran commercials attacking Karmeier. \"Predators abusing children,\" one of those ads said. \"Rapists, murderers let off easily.\", The Republican leadership committee  which received $230,000 from Altria, the parent company of Philip Morris  spent $960,000 to support the judge. Karmeier won, but barely. Walter says its misguided to try to take money and politics out of the process. \"When you have an election, youre already in the political realm,\" he said, adding that the spending is a \"good and healthy thing\" that helps educate voters. Walter said leadership committee efforts were useful even when they failed. In Tennessee, the committee spent $340,000 to oppose the retention of three state Supreme Court justices. All three kept their seats, but the court, which chooses the states attorney general, later picked a Republican for the office for the first time. \"We helped [the judges] get in better touch with their voters,\" Walter said. \"I would not say we scared them into anything.\", joseph.tanfani@latimes.com]", "Date": "20141123", "Title": "[Judicial elections getting more political with new campaign spending]", "Link": "http://www.latimes.com/nation/politics/la-na-judicial-elections-20141123-story.html\n", "Author": "[Joseph Tanfani]"}
