{"Content": "[A parade of companies has borrowed Donald Trumps own trademark to tell him \"youre fired\" after the aspiring presidential candidate called some Mexican immigrants \"rapists\" and \"killers.\", And its costing him. Trumps immediate bottom line is reeling, and the fallout could dent his brand for years to come, experts said. Macys said it would stop selling Trump-branded clothing at its stores. NBCUniversal and Univision will stop airing the Trump-owned Miss U.S.A. and Miss Universe pageants. And the PGA of America pulled the 2015 Grand Slam of Golf from Trumps golf course in Rancho Palos Verdes. The damage has widened as the business mogul, perhaps best known for dismissing competitors on the reality TV show \"The Celebrity Apprentice\" with a pointed finger and his \"Youre fired!\" line, has repeated his claims that many undocumented Mexican immigrants are criminals. \"Its going to hurt him and hurt him badly,\" said Howard Belk, co-chief executive of branding agency Siegel+Gale in New York. \"His ticket to notoriety has always been these flamboyant, outrageous kinds of statements, but he massively underestimated the public revulsion to that comment.\", Trump has claimed his net worth at $8.7 billion, but Forbes has pegged it at a more modest $4.1 billion. His brand value was estimated to be more than $200 million, largely dependent on how much companies were willing to pay to license the Trump name, Belk said. But now few corporations, he said, will want to be associated with \"a tarnished and dented\" brand. The loss of partnerships could have dropped Trumps brand value 10% to 25%, said David Johnson, chief executive of Strategic Vision. But the long-term effects could prove more costly for Trumps pocketbook, analysts said. Trump has long been known for incendiary remarks, including persistent suggestions during the 2008 presidential elections that Barack Obama was not born in the U.S. But with his latest remarks, hes insulted a large and growing demographic of Americans with increasing economic might, analysts said. California has become the third U.S. state where the Latino population outnumbers whites, according to U.S. Census data. \"There is a segment of people that will be attracted to Trump because of those comments,\" said Ira Kalb, assistant professor of clinical marketing at USCs business school. \"That segment is relatively small compared with the larger segment that will be offended by his comments or feel empathetic to those offended.\", His TV career is already hurting. Unless Trump apologizes, he can no longer appear on a TV series dependent on advertising dollars, like the reality show \"The Celebrity Apprentice,\" according to an NBC executive familiar with Trumps deal with the network. \"Hes toxic to NBC for sure,\" said the executive, pointing out that sponsors are quick to distance themselves from the kind of controversy Trump has generated. \"Every minority coalition in the world would be pounding on the doors of any network that would be in business with him,\" the executive added. \"Its just not worth it.\", NBC said Trump would no longer host \"The Celebrity Apprentice,\" for which he got paid around $250,000 to $300,000 an episode, the executive said. But Trump will continue making some money from TV, even if he never gets another second of screen time. Hes still a profit participant in \"The Celebrity Apprentice,\" so hell get paid if NBC produces another season. Through the Miss Universe Organization, Trump shares ownership of the pageant business with NBC. But the pageants were a break-even operation for Trump, netting him only several hundred thousand dollars a year, the NBC executive said. Trumps golf business is also in trouble. Trump National Golf Club Los Angeles in Rancho Palos Verdes will lose valuable TV exposure by losing PGAs Grand Slam of Golf in October. Golf courses open to the public such as the Trump National Golf Club are often able to command a hefty increase in fees after holding a major PGA event, according to one TV sports consultant, who wished to stay anonymous because he works for broadcast companies that carry PGA events. \"Golfers want to play the courses that they see on television,\" the consultant said. The PGA could also pull future events held on Trump golf courses, including the 2017 Senior PGA Championship and 2022 PGA Championship. Aside from sports, Trumps signature real estate could continue suffering aftershocks for years to come, analysts said. Luxury properties bearing his name, such as Trump Tower in New York City, have long been considered \"badges of arrival\" for those who could afford to live there, Belk of Siegel+Gale said. In the short term, Trump is protected by leases, but he will lose well-heeled tenants if he keeps sticking by his words, Belk said. \"Sophisticated and premium brands cant coexist with bigotry and racism,\" he said. \"Wealthy people who have a choice of where theyre going to live will remember.\", But other branding experts say that once the outrage blows over, Trump could bounce back with few permanent scars. Celebrities such as Michael Vick and Martha Stewart have all recovered  at least somewhat  from past scandals, said Johnson of Strategic Vision. \"The people who bought into his brand already know who he is,\" Johnson said. \"Hes loud and abrasive and obnoxious. These comments play into his brand.\", shan.li@latimes.com, stephen.battaglio@latimes.com, Twitter: @ByShanLi,@SteveBattaglio, ALSO:, L.A. Unified cancels golf tournament at Trump-owned course, Oscar De La Hoya becomes latest to speak out against Donald Trump, Senate Democrats introduce measure condemning Donald Trump, Ted Cruz]", "Date": "20150710", "Title": "[Trump's losses mount after incendiary remarks]", "Link": "http://www.latimes.com/business/la-fi-trump-woes-20150710-story.html\n", "Author": "[Shan Li, Stephen Battaglio]"}
