{"Content": "[Have a plan, she said. On Aug. 11, Democratic presidential hopeful Hillary Rodham Clinton spoke privately with a group of Black Lives Matter protesters who had tried to disrupt one of her campaign events in New Hampshire. Clinton saidraising awareness about inequality would not be enough-- there should bea specific vision to improve the lives of black Americans. \"Youre gonna have to come together as a movement and say, Heres what we want done about it, \" Clintonsaid, according to a video of the encounter, adding: \"Thats what I would love tohave your thoughts about, because thats what Im trying to figure out.\", Interested in the stories shaping California? Sign up for the free Essential California newsletter >>, On Friday, prominent black activists offered an answer that has been in the works for months,introducing a comprehensive policy platform to end killings by the police in the U.S. and said they will track and hold2016 candidates accountable for their stances. \"Campaign Zero,\" marks the most sweeping and detailed policy platform to emerge along withthe Black Lives Matter movement. On a slickly produced website, itproposes10 reform tenets, manybacked with specific policy proposals to end the hundreds of police killings that happen annually in the U.S. The campaignspillarsinclude limiting police use of force, beefing up oversight of police departments with civilian reviewboards and equipping officers withbody cameras. The activistscall for an end to aggressive police tactics and heavy fines when it comes to minor infractions thattend tofall disproportionatelyon black Americans. The group also adopted model police programs and proposals from around the country. A call to end police ticket quotas points toIllinois law as a reference. A proposal to restrict the use of SWAT teams except for crisis situations cites Cincinnati police policy. One proposal to strengthen oversight suggests supporting an existing congressional billthat would incentivizeindependent investigations of police misconduct. Campaign Zero was created by DeRay Mckesson, Johnetta Elzie, Brittany Packnett -- three of the most prominent activists to emerge during last yearsunrest in Ferguson, Mo. --andSamuel Sinyangwe, a San Francisco-based policy expert. Weve always had demands,\" said Mckesson, who shared the proposals with the hundreds of thousands of Twitter followers he has amassed since the protests in Ferguson. He said Campaign Zero has collected thosedemands made by various activists around the U.S. as police use of force has become a fixture of public debate. Now that theres this awareness,we have an opportunity to end police violence, and this is a blueprint for how we can do it,\" Mckesson said. Protesters associated with the national movement that emerged after the protests inFerguson have been criticizedin recent months for carrying out disruptive demonstrationsbut not engaging as much with the less dramatic processes of policymaking. Other modern, social-media driven movements in the U.S. and abroad have come under similar criticisms. There wereOccupy Wall Streets leaderless, often directionless protest encampments and the Tahrir Square activists in Egypt who proved influential on Twitter butpowerless at the ballot box. The term \"Black Lives Matter\" has alsodrawn some confusion because it is a decentralized organization that also serves as a rallying cry and a hashtag -- and now a quick media shorthand to collectively refer to the new generationof black activists. The founders of Campaign Zero, although they do not call themselves leaders and dont claim to speak for others, include activists who have accumulatedpower and influencein the form of large social media followings and I-was-there credibility. As a result, they have drawn the attention of presidential campaigns undoubtedly hoping to secure votes from African Americans in the next election. On Monday, Mckesson tweeted at U.S. Sen. Bernie Sanders official account to ask, \"The first draft of your racial justice platform has promise. When will you be available to discuss enhancements w/ folks?\", Sanders account responded, \"Lets do it. We will [private message] you this week to arrange.\", \"Weve spoken to staffers on [former Maryland Gov. Martin] OMalleys campaign, on Hillarys campaign, and Sanders, maybe all within the last two weeks or so,\" said Elzie, who has 71,000 Twitter followers. The lines of communication are open for sure. The activists behind Campaign Zero were quick to say that they were not representative of the whole movement but that they had also solicitedsuggestions from other activists and would be open to changes in their platform. Elzie added, \"The four of us cant speak for every black person in America.\" However, she added, As clich as the phrase is, knowledge really is power in this case. I want people to make the best-informed decisions for themselvesand their community, and I think Campaign Zero definitely helps. For instance, Elzie said, she scrolled over the Campaign Zero tableshowing presidential candidatesand whether theyd taken a specific stand on the activists 10 core issues. The Democratic candidates had many boxes filled in with positions, but the Republicans were empty. It maps out plain as day who has spoken on what,\" Elzie said. Just looking at this chart, the Republicans have said nothing about anything that remotelyaffects whats happening in America right now. Its a tool, Packnett added, to ultimately hold the 2016 candidates accountable.\", Follow @MattDPearce for national news, ALSO:, Analysis: Shaun King is no Rachel Dolezal: Look whos calling him white, House lawsuit against Obama is turning into a real problem for the president, Police chief says autopsy shows black Missouri 18-year-old was shot in the back, ]", "Date": "20150821", "Title": "[Activists come up with a plan to end police killings. Here it is.]", "Link": "http://www.latimes.com/nation/la-na-police-campaign-zero-20150821-story.html", "Author": "[Matt Pearce]"}