{"Content": "[The historic agreement on Irans nuclear program announced Tuesday virtually guarantees that the 2016 election will be fought over conflicting views of the outgoing presidents record, since the pacts endurance depends on the willingness of future U.S. presidents to see it through. Like the environment, immigration and Cuba policy before it, the deal is another major endeavor in which President Obama used his executive-branch authority to act unilaterally  meaning the change he put in place could be rolled back by any future president. However, the international nature of the multilateral accord could bind Obamas successors, particularly Republicans. It leaves them with the unenviable choice of implementing and enforcing a deal they had little or no hand in drafting and publicly opposed, or snubbing it and thus re-escalating tensions in the region or with U.S. allies who were partners in the talks. I see a lot of upside for candidates from the Republican Party to campaign on this deal and even to make brash promises to disavow it if they are elected. I see almost no upside for any successor to President Obama coming into office and, on Day One, scuttling an arrangement that would likely lead to an international crisis, said Suzanne Maloney, an Iran expert at the Brookings Institution. The intensity of disagreement on the campaign trail over Obamas record rivals the differing evaluations of the Reagan administration. The path the next president takes will depend, of course, on who it is. Republican presidential hopefuls have become fond of noting on the campaign trail which Obama policies they would reverse on Day One, whether on healthcare, the economy, immigration or the environment. Wisconsin Gov. Scott Walker vowed in his speech announcing his candidacy Monday that he would terminate the Iran agreement on his first day in the Oval Office. Former Texas Gov. Rick Perry made a similar pledge Tuesday. Other candidates criticized the terms of the deal but gave little indication of how they would address them if they became president. Former Florida Gov. Jeb Bush said a comprehensive agreement should require Iran to verifiably abandon, not simply delay, its pursuit of a nuclear weapons program. The people of Iran, the region, Israel, America and the world deserve better than a deal that consolidates the grip on power of the violent revolutionary clerics who rule Tehran with an iron fist, Bush said, labeling the deal appeasement. As Obamas own example shows, though, reversing course on established foreign policy could prove the most difficult path for any of them. Obamas first executive order sought to close the Guantanamo Bay detention camp within a year, a task that remains incomplete more than six years later. For Obamas White House, a Hillary Rodham Clinton administration would clearly represent the best hope for continuity in mission. Speaking with reporters in between meetings at the Capitol with congressional Democrats, Clinton, Obamas former secretary of State, called the agreement an important step that puts the lid on Irans nuclear program. We have to treat this as an ongoing enforcement effort, which I certainly strongly support and, as president, would be absolutely devoted to ensuring that the agreement is followed, she said. Republicans sought to add Clintons fingerprints to the pact, noting its roots in her tenure in Obamas Cabinet. Republican National Committee Chairman Reince Priebus said in a statement that the agreement will cement the Obama-Clinton foreign policy legacy: a richer, more powerful, more dangerous, legitimized Iran. Clinton said she still had concerns about Irans trustworthiness, noting that it remained a state sponsor of terrorism and poses an existential threat to Israel, among other concerns. That bad behavior is something we have to address, she said. Under the deal, Iran will accept restrictions on its nuclear activities, including inspections to verify that it is following the terms of the accord. In exchange, the U.S. Europe and the United Nations will agree to lift sanctions that have had a crushing effect on Irans economy. Jake Sullivan, a top policy advisor to her campaign and at the State Department, focused during a breakfast with reporters Tuesday on what he said was Clintons central role in building the global sanctions coalition that created the negotiating leverage to bring Iran to the table, and in starting the diplomacy that has resulted in what happened today. Sullivan, who was sent after Obamas reelection to begin back-channel talks with Iran, also said it was up to any potential presidential candidate to lay out a strategy on Irans nuclear program that will make the United States safer, reduce risk and increase the likelihood that all of this plays out in a positive way. Obama acknowledged the role a future president would play as he presented the deal Tuesday morning from the White House, arguing that the absence of a deal would mean a greater chance of more war in the Middle East and that the agreement would improve U.S. standing in the region. I have no doubt that 10 or 15 years from now, the person who holds this office will be in a far stronger position with Iran, further away from a [nuclear] weapon and with the inspections and transparency that allow us to monitor the Iranian program, he said. The presidents ambitious policy changes late in his administration, combined with conservatives deep animosity toward him, have made it difficult for Republican presidential candidates to distinguish their visions as anything other than reactions to the Democratic incumbent. James Carafano, vice president of foreign and defense policy studies for the conservative Heritage Foundation, said Obama put Republicans in a difficult position. The president implemented a deal that, Carafano said, posed major long-term risks for Middle East stability while suggesting for now that he had tackled a major problem. Republicans have little to gain by making definitive statements about how they would address the Iran deal while in office, Carafano added. This is the danger of running for president, he said. Talking about what youre going to do in 18 months, not knowing what the world is going to look like in 18 months, is not the smartest thing. michael.memoli@latimes.com, , 7:47 p.m.: The story was updated throughout with new details. The story was first published at 3:44 p.m.]", "Date": "20150714", "Title": "[Obama's deal with Iran could hinder his successors, particularly Republicans]", "Link": "http://www.latimes.com/nation/la-na-iran-presidential-politics-20150714-story.html\n", "Author": "[Michael A. Memoli]"}
