{"Content": "[If I were Consumer Financial Protection Bureau Director Richard Cordray, I might be rethinking my retirement plans. Cordray is only 55, so itll be a few years before the AARP inundates him with solicitations. But he may be the last director to win confirmation for quite some time, if Republicans take and hold the Senate while Democrats occupy the White House. The Supreme Courts decision Thursday on recess appointments barred the president  correctly, in the view of The Times editorial board  from taking advantage of Congress weekend breaks to usher appointees into office without the required Senate confirmation. According to the court, the presidents recess appointment power can be used only during an honest-to-goodness recess, which history suggests would be a break of at least 10 days. The ruling stops gamesmanship by the White House but not by members of Congress. And thats where things get interesting. The result could be a shift in the balance of power in divided government, with the White House losing some of its leverage in negotiations with the Senate. To understand the implications of the ruling, it helps to look at recent history. After they won control of the Senate during President George W. Bushs second term, Democrats came up with the seemed-like-a-good-idea-at-the-time innovation of convening bogus (or more technically, \"pro forma\") sessions to prevent the body from going into recess even though all but a handful of its members had left the Capitol. That stopped Bush from making recess appointments in his final two years. When President Obama took office, he had a filibuster-proof majority of Democrats and sympathetic independents in the Senate. So recess appointments were a nonissue until Democrats lost the special election in 2010 to replace the late Sen. Edward M. Kennedy, at which point Republicans could filibuster effectively  which they did. After Republicans took the House in 2010, they upped the ante with another seemed-like-a-good-idea-at-the-time tactic: remaining in session every day, even when no votes were scheduled, to keep the Senate from going on recess. The only breaks were short ones for weekends and holidays, which Republicans believed would be too abbreviated to allow a recess appointment. Obama disagreed, appointing Cordray and three members of the National Labor Relations Board during one such break in January 2012. Two appeals courts ruled the NLRB appointments illegal in 2013. Recognizing the writing on the wall, Democrats took the logical next step, voting to change Senate rules and bar filibusters on nominees for the executive branch and judgeships below the Supreme Court. This move eliminated the need for recess appointments when the White House and the Senate are controlled by the same party. Thats not likely to persist for long. Chances are good that Republicans will retake the Senate after Novembers elections. Make that better than good, considering that Nate Silver continues to predict a (narrow) GOP majority come January 2015. That means two years of pro forma sessions and few confirmations, particularly not for agencies that Republicans are determined to rein in or even neuter. That would include the NLRB and the CFPB. If Republicans want to cripple the NLRB, they merely have to run out the clock on the current board members terms; one expires in August 2016, the other four expire two years after that. Without a quorum of three members, the board cant act. The agencys regional directors would continue deciding cases (for example, one of them granted Northwestern Universitys football players the right to unionize), but the NLRB would cease to exist as a policymaking body. Proponents of recess appointments had cited this possibility as a rationale for giving the president an escape valve. But Thursdays ruling, combined with the tactics introduced by Senate Democrats and House Republicans, close off that valve. If theres a Democratic president in 2017 and a Republican Senate, the former would appear to be at the latters mercy when it comes to filling the NLRBs vacancies. Meanwhile, Republicans oppose the CFPB in a fundamental way, objecting to the wide latitude that the 2010 Dodd-Frank Act gave the bureau to adopt and enforce its rules. In exchange for allowing a vote on Cordrays nomination, they wanted Congress to put the bureau under the direct control of other federal bank regulators and made its budget subject to annual appropriations  two moves that consumer advocates said would leave the bureau toothless. A compromise designed to preserve the filibuster rule allowed the Senate to vote on Cordrays appointment in 2013 without defanging the CFPB. Although his five-year term expires in 2018, the law allows the director to continue serving until a successor is confirmed. With the bureau unable to adopt new rules without a director, Cordray may want to stay on as long as the White House needs to find a replacement the Senate will accept. Otherwise, the president may have little choice but to agree to the changes Republicans seek in the CFPBs governance. Again, these issues would arise only with the White House and the Senate being held by different parties. But thats sure to happen someday  and probably soon. Follow Healeys intermittent Twitter feed: @jcahealey]", "Date": "20140627", "Title": "[The Supreme Court shifts the balance of power in divided government]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-obama-recess-appointments-nlrb-cfpb-20140627-story.html\n", "Author": "[Jon Healey]"}
