{"Content": "[The Republican presidential campaign came to California en masse last week for the debate at the Ronald Reagan Presidential Library, and when it ended the candidates largely beat it for more productive environs. Many took off for South Carolina, an early voting state and the site of a conservative confab Friday. Donald Trump headed to New Hampshire, the first primary state, where he drew criticism Thursday for failing to correct a supporter who asserted President Obama is a Muslim. Among the presidential candidates, only Mike Huckabee, the former Arkansas governor, stuck around for this weekends state Republican convention in Anaheim. Huckabee has been ranked seventh among the candidates, with an average national poll share of under 6%. So the fact that only Huckabee bothered to show up at the convention said everything about Republicans presidential prospects here. As the old song goes: \"Turn out the lights, the partys over.\", While that is true at the presidential level, however, the convention opens at a time of bolstered optimism among Republicans for some recent state victories. From the outside some of them may seem small, but they are important. In hard-fought elections, Republicans have blocked Democrats from holding a supermajority of the Legislature, which would have allowed Democrats to rule at will because the party also controls the governors office. The GOP success mattered when Gov. Jerry Brown recently tried to raise taxes, including some that would have helped finance $3.6 billion in repairs to the states roads. The plan was quashed when Republicans announced their opposition and remained united  a result not always accomplished in past years. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, If that signaled why Republicans have worked hard to eke out wins in as many seats as possible, a presentation at the state party convention showed just how tough accomplishing that will be. The session dissected the unexpected 2014 Assembly victory of Catharine Baker. Consultants key to the victory, including Duane Dichiara from her campaign and James Fisfis from the independent effort that backed her, outlined a road map that, they suggested, might also work for other Republican candidates. Of great help to her was the states relatively new rule that sends the top two finishers, regardless of party, into the general election. In a few districts, like hers, that has altered the electoral strategy in complex ways. The incumbent was termed out, meaning that no one had an unassailable advantage. The other main candidates, besides Republican Baker, were Democrats, chief among them Steve Glazer, a former Brown aide who has run afoul of organized labor, and Tim Sbranti, a teacher and teachers union official. With everyone assuming a Democrat would ultimately prevail in the strongly Democratic Bay Area district, neither the labor interests who backed Sbranti nor the business and education reform forces who backed Glazer would give an inch, warring to the tune of millions of dollars. Bakers allies essentially fed the Democratic civil war by sending mailers critical of Glazer, helping to accomplish their goal of knocking out the candidate they considered their biggest threat in the general election. During the general election campaign, Bakers team  the campaign and her independent backers  then went at Sbranti, accusing him and his labor allies of a \"smear\" of Glazer in the primary. They also excoriated him as a defender of the unions who had gone out on strike against the Bay Area Rapid Transit district. The strike had hit the commuter-heavy district hard and proved to be a dramatic player in the race. \"I dont think we would have won without that, and we had nothing to do with it,\" said Fisfis, the consultant for the independent committee, largely financed by Republican donor Charles Munger Jr. He noted that the lineup of the primary, with multiple Democratic candidates and Baker, forced all of them to seek the support of all types of voters. As a moderate Republican, Baker had an appeal that no conservative Republican would have had. In the end she defied the Democratic registration edge to win by three points. \"All we had to do was sow doubts and give them permission to vote for a Republican,\" said Baker strategist Dichiara. The question for Republicans is how to replicate it. Few expect it would be possible to do so in a statewide race; although there are significant splits among Democrats on such issues as education and state employee pension policy, its hard to imagine that the winner of any party warfare would lose to a Republican. \"You cant have a statewide BART strike,\" as Fisfis said. In distinct districts, however, Republicans might be able to find an issue that allows them to break through the normal partisan frame, particularly if Democrats are fighting themselves. But Republicans also would have to find candidates who reflect not the highly conservative national face of the party but a more moderate California one; they would have to have enough money  or moneyed outside allies  to finance those candidates efforts; and they would have to persuade California voters to cast ballots for the representative of a party that is growing smaller by the year. The odds that Republicans dramatically alter their standing in Californias statewide races seem long. The odds that they win incrementally, in ways that may occasionally produce the outsized results seen in the road tax battle, seem not as long at all. Cathleen.decker@latimes.com, Twitter:@cathleendecker, For more on politics, go to www.latimes.com/decker and www.latimes.com/politics. ALSO, Democratic clash: Assembly Speaker Toni Atkins to challenge Sen. Marty Block, California Republican candidates for U.S. Senate tout unity at party convention, California Republicans confront long odds in race to fill Sen. Barbara Boxers seat]", "Date": "20150920", "Title": "[GOP victories in California may be small, but they still count ]", "Link": "http://www.latimes.com/local/politics/la-me-pol-ca-california-politics-20150920-story.html", "Author": "[Cathleen Decker]"}