{"Content": "[For many in this slice of the West, the presidential campaign is little more than a vague notion, distant as a faint speck on the horizon. The candidates, to hear them tell it, include Huckleberry (that would be Mike Huckabee), the black doctor (Ben Carson), some guy from Texas (actually, there are two of them) and Mitt Romney (no, not this time). Theres all this yakking on TV, said Stephen Bellack, a Democrat, but not a whole lot has captured the attention of the 68-year-old veteran of the merchant marine. The exception, naturally, is Donald Trump, whose loud, bumptious, mad bull of a presidential campaign cant help but be noticed. He is the only candidate, other than Hillary Rodham Clinton on the Democratic side, whom everyone can name and who elicits no shortage of strong opinions. A buffoon. A joke. A bigoted racist. A maverick. A truth-teller. Not your typical say-anything-to-get-elected politician. I dont like guys like him, said Bellack, pausing as he left Sparks public library. Hes just kind of a rich TV star saying inflammatory things. Linda Hartley, a correctional officer who works with the mentally ill, sees things differently. I like that he speaks his mind, said the 56-year-old political independent. Sometimes hes stupid in what he says, but hes not afraid to say it. What few interviewed here and in neighboring Reno see is the next president of the United States; even the handful who suggest Trump could win the White House base that opinion on the theory that, well, you never know. Hes not really a proper speaker [but] you learn as you go, said Jeff Shelburg, 59, a libertarian-leaning independent, who trains birds of prey for movies and other display. Along with Hartley, he was strolling around Sparks Marina Park, their vanilla ice cream cones melting under a broiling sun. The good thing is he doesnt know that much about politics, Shelburg said. But he knows business, and our country should be run like a business. Nevada enjoys a privileged place on the 2016 presidential calendar, designated by the two major parties as one of the earliest-voting states: third for Democrats and fourth for Republicans. So voters here could play an important role in helping cull the field on both sides. But the state is not exactly crawling with White House contestants, especially compared with Iowa and New Hampshire, the earliest-voting states, where the presidential hopefuls have lavished the majority of their time and resources. Nevada voters mainly know what they read about the candidates or learn from television. And since the real estate moguls sledgehammer entry into the race, the TV coverage has been virtually all Trump, all the time. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Whether the steady diet of outrage, insults and hyperbole -- his healthcare plan, Trump said on CNN, was to repeal Obamacare and replace it with something terrific -- is good or bad can depend on ones party loyalties. Trump! exclaimed a grinning Bud Guy. He just never stops!, Guy, a chemical salesman and Democrat who supports Clinton, figures Trumps incendiary comments on illegal immigration that have antagonized many Latino voters, and his disparagement of other GOP hopefuls -- labeling Rick Perry a hypocrite, John Kasich a typical pol, Scott Walker a flip-flopper -- can only help the eventual Democratic nominee. I hope he keeps it up, said Guy, 73, toting his gym bag as he headed to an afternoon workout. I just love to see all the controversy!, Thats precisely what worries Ken Stoehrmann. The 65-year-old retired Air Force veteran, a Republican, is a long way from picking a candidate for president. But it wont be Trump, Stoehrmann said, dismissing his campaign as smoke and mirrors. The problem is \"its hurting the Republican Party,\" Stoehrmann said, \"because whoever gets the nomination, theyre going to try to pin Trumps words on to\" that person. For some critics, the antagonism goes beyond partisan considerations. They liken Trump to a gaseous cloud, expanding to block out other, more viable candidates and smothering serious discussion. Keith Lee, 72, a longtime lobbyist and political operative in Reno, scowled from a barbers chair as Shelly Whitehead worked an electric shaver over his close-cropped scalp. Trump, he said, has no more business running for president than my hunting dog. Hes in there sucking all the air out of legitimate debate, sucking all the air out of legitimate media coverage of the issues and the other candidates, said Lee, who is a Democrat by registration but independent by inclination. Whitehead, 52 and a faithful Democrat, nodded her assent. He seems like hes in there for his own ego, redirecting from more important issues, she said. But just down the street from her Scissors & Comb barbershop, outside Washoe Countys justice building, retired FBI agent Michael Jack credited Trump with single-handedly bringing substance to the campaign by raising issues, such as problems on the U.S.-Mexico border, that others are too timid to mention. Hes loud, yes. He does take up a lot of air in the room, said Jack, 61, a Republican who now runs a private investigative firm. But hes calling it like it really is and theres a lot of [politically correct] people out there who say, Thats racism. Its not racism. Its reality. For some, its tiresome. Allison Judge, a bookkeeper and self-described tree-hugging liberal, used an expletive to dismiss the voluble billionaire. \"Hes just got hateful things to say,\" said Judge, 60, and a fan of Democratic hopeful Bernie Sanders, Vermonts socialist senator. \"I dont think [Trump has] got constructive solutions.\", So she has laid down the law: Anyone posting anything on her Facebook page having to do with Trump -- positive or negative -- will be immediately blocked until he leaves the race. Which she suggested, cant happen soon enough. Twitter:@markzbarabak, MORE PRESIDENTIAL CAMPAIGN COVERAGE:, 5 experts reveal how to win a debate with Donald Trump, Republicans wonder: How do you debate Donald Trump?, Presidential long shots often win big after losing election]", "Date": "20150804", "Title": "[Trump is the candidate everyone can name, and everyone has a name for him]", "Link": "http://www.latimes.com/nation/la-na-trump-voters-nevada-20150804-story.html\n", "Author": "[Mark Z. Barabak]"}
