{"Content": "[Mitt Romney, once the presidential nominee Republicans hoped would unseat President Obama, is now nothing more than a Netflix Original, the star of the recent political redemption documentary Mitt. Following Romney from his first family meeting in 2006 to his defeat in November 2012, the 90-minute inside look isnt without its share of expected silliness and self-aggrandizement. There are intimate moments seen at his many homes. Jokes are made about private planes. Romney interrupts an otherwise resonant anecdote to mention his friendship with Papa John, you know, of Papa Johns. In the whole documentary, only two black people are seen speaking on screen. One is the president. Footage of the candidate bumping a hot iron into his arm while mumbling ouch over and over has become an online hit and an apt metaphor for the whole Mitt Romney experience. No doubt: If Mitt were a drinking game for cynical leftists, 47% ABV shots might prove fatal. PHOTOS: How the Democrats can win back the House and keep the Senate -- in 6 steps, But liberal bias confirmation isnt the animating spirit of Mitt. True to the hype, filmmaker Greg Whiteley humanizes Romney, showing the family man in a softer light than the glare of campaign flashbulbs could ever allow the candidate. The result is an if only kind of movie that encourages viewers to look at Romney through a new lens -- not the flipping Mormon of 2008 or the robotic aristocrat of 2012 -- and ask what could have been if wed elected him president instead of Obama. After watching Mitt, it is impossible to doubt that Romney has a profound love for his family, one reflected in their equally charming love for him. It is impossible to doubt -- however gratuitous the endless prayer scenes may be -- that Romneys Mormonism is humble and sincere. Most striking, it is impossible to deny that Romney is a shockingly self-aware man, one far more perceptive of nuance -- in public life, in others, in himself -- than he ever appeared to voters. From Romney summing up the political landscape more shrewdly than most pundits to a sequence in which he honestly interrogates his own privilege relative to his father, one comes away with the unshakable feeling that we as a country underestimated Romneys empathy and curiosity. If provoking that sentiment was the goal here -- and Im guessing it was -- then Ill concede: point proven. But if the larger goal of Mitt was to make viewers regret their harsh judgments, to second-guess the votes they cast, then Whiteleys effort fails. If anything, it underscores for me that the right candidate won in 2012. Thats not in spite of the movies humanizing effort but because of it. This behind-the-scenes look at Romney still does not totally undo the man we saw on the campaign trail. It does not erase the tone-deaf plutocrat whose apparent political instincts would make Michael Dukakis weep. Remember: Romney advocated for the austere Paul Ryan budget, and his position that undocumented immigrants should self-deport was, he explained, a compassionate approach. And he did make those 47% comments. It turns out he was self-aware the whole time? That he knew his limitations? He was able to articulate his own privilege, acknowledging that everything in life was handed to him in a way that makes even his relatively lucky father seem disadvantaged by comparison?, And yet he still ran that campaign?, At least out-of-touch Romney was a victim of his own blindness. Now youre telling us he knew the score, but he just couldnt help himself? That deserves pity, sure, but not if-we-could-go-back votes. Ignorance is one thing, but somebody who cant help their ineptitude despite being able to correctly identify the problem is the last person you want in the White House. Mitt humanizes Romney, but it shows us more clearly than ever why he was not fit to be president. For that, it is valuable. It also reminds us of something deeper. In dispelling our sense of Robot Romney, Heartless Corporate Criminal Mastermind, Mitt shows us that the greatest danger to a more perfect union doesnt come from caricatures of cackling villains. It comes from good men. It comes from family men, the kind who love their wives and kids and dogs. It comes from honest men, who are persuaded of their own intentions, who do not lack in wit or self-awareness, and yet despite all this are so blinded by privilege and corrosive ideology that -- if given power -- they would inflict a brutal austerity upon the body politic, most punishing to the very least among us. Danger comes from human frailty and error. The heroes look just like the villains -- thats the scary part of democratic life. Romney is human. He always was. Thats the lesson Mitt teaches us most clearly. [Update on Jan. 31 at 9:46 p.m.: An earlier version of this post stated that Mitt Romney only spoke to one black person during \"Mitt.\" He in fact speaks to two black people.], ALSO: , Edward Snowdens weasel ways , Another misguided GOP attack on Obamacare, Bristol Palins scathing critique of Wendy Davis is shameful, Emmett Rensin is an author, essayist and political activist in Chicago. His previous work has appeared in USA Today, Salon and the Los Angeles Review of Books. Follow him on Twitter @revemmettrensin.]", "Date": "20140131", "Title": "[Don't let 'Mitt' fool you into regretting your vote for Obama]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-mitt-romney-netflix-20140131-story.html\n", "Author": "NULL"}
