{"Content": "[Thousands of bills get introduced each legislative session, and most are sops to special interests or simply silly. But here are three no-brainers that should be passed. Theyre not Earth-shattering, just sensible. Not everyone will agree, naturally. Two are offered by Republicans, so dominant Democrats will be inclined to ignore them. The third is a proposed election change by a Democrat, so Republicans instinctively will be suspicious. The first is a gun-control bill, but not the ordinary sort. It would correct an ugly flaw in a ballot initiative passed overwhelmingly by voters in November. Proposition 47 was sold as a proposal to eliminate prison sentences for non-serious crimes. It reduced from a possible felony to always a misdemeanor the possession of narcotics and the theft of property valued under $950. No prison time. Probably a wrist-slap. Surely it was botched drafting, but that means stealing a gun worth less than $950, which practically all are, is a misdemeanor. So is knowingly possessing or selling such a stolen firearm. California has the nations toughest gun controls for citizens  and good for us  but were telling criminals its not a big deal to steal a weapon. \"People are not stealing guns to go duck hunting,\" says Assemblywoman Melissa Melendez (R-Lake Elsinore). \"Theyre stealing them to commit crime.\", Melendezs bill, AB 150, would restore the old penalties for gun thefts. Stealing one of any value would be a felony. Possessing a stolen firearm could be a felony or a misdemeanor, whats known as a \"wobbler.\", The bill would need to go on the ballot if passed by the Legislature and signed by the governor. \"Were empowering criminals to commit more crime,\" asserts Melendez, a retired Navy intelligence eavesdropper on the Russians during the Cold War. Its still a felony to burglarize a house and grab anything. But there are other places to heist a gun relatively penalty-free, including stores. \"Catch a guy on the street with a firearm and I cant prove he broke into a house, but I can prove from serial numbers that it was stolen,\" says San Bernardino County Sheriff John McMahon. \"If we cant put a person in jail for stealing a gun, were really missing the mark.\", The second bill gets into the battle of the bags. Several California cities  including Los Angeles and San Francisco  have banned single-use plastic bags at groceries and pharmacies. The Legislature last year extended that ban statewide. Fine. Get rid of them. Repeat: Its OK, at least for me. Just keep my newspapers wrapped in plastic on rainy days. But we wont get into that hypocrisy. My gripe is that big nanny Sacramento also ordered stores  and most of them love it  to charge at least 10 cents for each paper bag that used to be handed out free. OK, it was always built into the grocery price. But that was the stores decision, not the Legislatures. Now grocers can conveniently tell the consumer, \"Sacramento made me.\", And the money  were talking an estimated $600 million a year  doesnt go into environmental cleanup. It goes directly into the merchants pockets. Anyway, paper bags are environmentally friendly. They are biodegradable. Ocean creatures dont gag on them as they do plastic. In California, trees arent chopped down to make paper bags. Sawmill chips are swept up and combined with recycled paper. Defenders of the fee argue that without it, more consumers would use paper bags and not purchase sturdier reusable bags  usually composed of some petroleum-based material and water-guzzling cotton. So wheres the environmental benefit there?, Anyway, whats next? State government setting the price for paper towels? Toilet paper?, \"If retailers want to charge for bags, thats not a matter for heavy-handed government to decide for them,\" says Republican Assemblyman Matthew Harper, a former mayor of Huntington Beach, which recently repealed its plastic bag ban. Harpers bill, SB 190, would scrub just the paper bag fee. The plastic bag industry, however, is sponsoring a referendum to repeal the entire ban. That proposal appears headed for the November 2016 ballot. Meanwhile, the ban will be on hold. But the Legislature still could repeal the paper fee and get out of the business of price-setting for the private sector. The third no-brainer bill would make it easier to vote by requiring that every registered voter be mailed an absentee ballot. Now youve got to request one or be listed as a permanent absentee voter. OK, but how much would that cost?, Less, says Sen. Bob Hertzberg (D-Van Nuys), author of the bill, SB 163. \"Think about it.\", He would save money by combining the current sample ballot  already sent to everyone  with an absentee ballot. Just include a return envelope for the filled-out ballot. Eliminate the second mailing of a ballot to absentee voters. Anyone who wanted to vote at a polling place still could. Absentee voting has been rising rapidly in California. In 1962, fewer than 3% voted by mail. In 1982, only 6.5% did; 2002, 27%. Last November, 60.5% voted absentee. Who were they? They were fairly reflective of the states political makeup, according to Paul Mitchell, vice president of Political Data Inc. Hertzbergs bill, Mitchell says, \"is probably the most impactful election-law change you could do to increase voter turnout.\", It would make it easier to throw out legislators who dont support common-sense bills. twitter: @LATimesSkelton]", "Date": "20150208", "Title": "[Three common-sense bills worth supporting]", "Link": "http://www.latimes.com/local/politics/la-me-cap-bills-20150209-column.html", "Author": "NULL"}