{"Content": "[Talk about sucking all the air out of the room. Political junkieshomed in on Hillary Rodham Clintons every moveat Iowa Sen. Tom Harkins annualsteak fry Sunday, hoping she might foreshadow her presidential intentions. Meanwhile, possible rivals for the 2016 Democratic nomination sought ways to get a little share of the spotlight. Vice President Joe Biden-- who headlined the steak fry last year but did not come this year -- will travel to Des Moines on Wednesday to kick off a tour for Nuns on the Bus, a religious organization that focuses on social justice. At last years steak fry, Bidendelivered a fiery speech in which he calledsame-sex marriage a modern-daycivil rights issue -- revvingup Democrats andadding to speculation that he might embark on a third run for the White House. Bidens upcoming Iowa trip is billed as an official visit; as of Sunday, he has no political events scheduled. Maryland Gov. Martin OMalley, who has raised money andstumped several times this year for candidates in early-voting states such as Iowa and New Hampshire, remained in his home state over the weekend to celebrate the 200th anniversary of the Battle of Baltimore. During his two terms in office, OMalley has championed an agenda popular with the Democratic base. Maryland has abolished the death penalty, granted in-state tuition rates to undocumented students, and implemented legislation to gradually raise the states minimum wage to $10.10 by 2018, from the current $7.25. While visiting Iowa in July, OMalley made clear to The Times that hes weighing a run for president in 2016, saying that\"multiple conversations\" and \"a lot of listening\" will factor into his decision. On Sunday, hours before Clinton spoke at the retiring Harkins 37thand final steak fry, Vermont Sen. Bernie Sanders toldNBCs \"Meet the Press\"thathes considering a run for the White House in 2016 -- as a Democrat. Sanders is an independent who caucuses with Democrats. Sanders, who was in Iowa over the weekend, said he came to the Hawkeye State to \"get a sense of how people feel about\" his potential candidacy. The issue is not Hillary. Ive known Hillary Clinton for many years. I have a lot of respect for Hillary Clinton,\" he said. \"The question is, at a time when so many people have seen a decline in their standard of living, when the wealthiest people and the largest corporations are doing phenomenally well, the American people want change. Follow @kurtisaleeand emailkurtis.lee@latimes.com]", "Date": "20140914", "Title": "[With Hillary Clinton in Iowa, potential challengers seek spotlight]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-hillary-iowa-other-potential-challengers-20140914-story.html", "Author": "[Kurtis Lee]"}