{"Content": "[In a milestone accord, President Obama and Cuban President Raul Castro agreed Wednesday to swiftly reestablish diplomatic relations and reopen embassies in each others capitals, finally ending the half-century diplomatic freeze between the two Cold War adversaries. Standing in a sunny Rose Garden, Obama said many Americans and Cubans were making a choice between the future and the past and urged critics in Congress to do the same by lifting the decades-old U.S. trade embargo. Americans and Cubans alike are ready to move forward, he said. I believe its time for Congress to do the same. Restoring relations with Cuba after a 54-year rupture fulfills a major foreign policy goal for Obama, who called for improving ties when he first ran for the White House in 2008. It also removes one of the last vestiges of the Cold War more than a quarter of a century after it ended, although the U.S. economic embargo on Cuba remains in effect. Obama and Castro traded letters confirming plans to reopen permanent diplomatic missions on July 20. Both leaders wrote that they were encouraged by the reciprocal intention to develop respectful and cooperative relations between our two peoples and governments. Secretary of State John F. Kerry said that he would join the opening ceremony in Havana and that he looked forward to raising the Stars and Stripes over the embassy, noting that no U.S. envoy of his rank has visited there since 1945. This step has been long overdue, Kerry said in Vienna, where he is participating in nuclear talks with Iran. Aides said Obama also hopes to visit Cuba before he leaves office in 2017. Cuban TV took the unusual step of broadcasting Obamas Rose Garden remarks live. Local newspapers, which often wait for official government pronouncements, blasted front-page headlines about the embassy openings early Wednesday. Cubas acting foreign minister, Marcelino Medina, met with Jeffrey DeLaurentis, head of the U.S. Interests Section, to formally exchange documents. Both countries have operated lower-level diplomatic missions since the 1970s, but without full diplomatic ties. The State Department is expected to upgrade the Interests Section, part of a multistory seaside building that previously served as the U.S. Embassy, rather than move into a new building. This is not merely symbolic, Obama said. With this change, we will be able to substantially increase our contacts with the Cuban people. Well have more personnel at our embassy. And our diplomats will have the ability to engage more broadly across the island. That will include the Cuban government, civil society and ordinary Cubans who are reaching for a better life. After months of secret talks by their aides, Obama and Castro stunned much of the world in December when they simultaneously announced that they would move to normalize relations, including easing travel and trade restrictions. The two sides held four rounds of closed-door talks and last month the State Department removed Cuba from its list of state sponsors of terrorism, a key Cuban demand to restore diplomatic ties. The administration has rebuffed Cubas demand to close the U.S. naval station at Guantanamo Bay, which the U.S. military has occupied since 1903 and the Spanish-American War. Analysts described the resumption of ties as the most substantive step since the diplomatic thaw began, but said sharp differences remain. This will be a normal relationship between governments, where we dont necessarily see eye to eye, but where there is cooperation, thats where its going, said Philip Peters, an analyst with the nonpartisan Cuba Research Center in Alexandria, Va. We now begin the long and challenging process of normalization of relations far beyond just reopening embassies  building commercial, social, cultural and political ties, said Fulton Armstrong, a professor at American Universitys Center for Latin American and Latino Studies. If we do U.S.-Cuba relations right, it will set a new tone for U.S. ties throughout Latin America, to the benefit of the entire hemisphere, Armstrong said. Congress will have to do its part [and] unshackle the administration from legacy legislation. For now, Congress appears unlikely to lift the economic embargo, which was first imposed in the 1960s and stiffened several times, and allow U.S. businesses to invest freely in Cuba. Critics in both parties lined up Wednesday to emphasize their opposition. Rep. Ileana Ros-Lehtinen (R-Fla.), a member of the House Foreign Affairs Committee, said Congress may not approve money for the new embassy or confirm an ambassador after Obama nominates one. Sen. Robert Menendez (D-N.J.), former chairman of the Senate Foreign Relations Committee, also slammed the White House move. Once again the regime is being rewarded while they jail dissidents, silence political opponents, and harbor American fugitives and cop killers, he said in a statement. The foreign policy shift immediately became part of the 2016 presidential race, although its unclear whether the issue has resonance beyond parts of Florida where Cuban exiles are based. As Americans prepare to celebrate the anniversary of our freedom from tyranny and commit anew to the democratic principles on which our nation was founded, it is no small irony that President Obama prepares to open an embassy in Havana, further legitimizing the brutal Castro regime, former Florida Gov. Jeb Bush, who is seeking the Republican nomination, said in a statement. Obama acknowledged those concerns in his Rose Garden remarks, noting very real, profound differences between our governments. He said U.S. officials will not hesitate to speak out about the rights of Cubans to speak and assemble freely. But the best way to support U.S. values is through engagement, he argued. You cant hold the future of Cuba hostage to what happened in the past, he said. Parsons reported from Washington and Wilkinson from Mexico City. For news about President Obama and the Obama administration, follow me on Twitter: @cparsons, ALSO:, Unlocking Cuba: Visiting our long-forbidden neighbor, Cuba photos: Then and now, Young Cuban artists testing the boundaries of dissent, 4:07 p.m.: This article was updated with more information. 9:49 a.m.: This story was updated with details from Cuban President Raul Castros letter. 8:53 a.m.: This story was updated with details from President Obamas remarks. This story was originally published at 8:15 a.m.]", "Date": "20150701", "Title": "[With embassies to reopen, Obama urges Congress to 'move forward' on Cuba]", "Link": "http://www.latimes.com/world/mexico-americas/la-fg-obama-embassy-cuba-20150701-story.html\n", "Author": "[Christi Parsons, Tracy Wilkinson]"}
