{"Content": "[Kim Davis, the devout Christian who is fighting against issuing Kentucky marriage licenses to same-sex couples, is hardly the first to be caught in the battle between religious beliefsand civil laws. Modern social issues, including abortion rights and capital punishment, have hinged on the same fulcrum. The issue is centuries old. The Bible notes that Jesus, attempting to avoid being trapped in a treasonous statement, tried to separate church and state and explained: Render therefore unto Caesar the things which are Caesars; and unto God the things that are Gods. On Wednesday, Davis was again confronted with a request by a same-sex couple for a license to marry, and for the second day, she refused to grant the needed papers. The Rowan County clerk has maintained that her religious beliefs and Gods authority are superior to U.S. courts that have held there is a constitutional right for members of the same sexto marry. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Davis and six of her deputies have been ordered to appear before a federal judge Thursday to explain why they should not be held in contempt for failing to issue the licenses. After the Supreme Court in June ruled that same-sex marriage is a constitutional right, clerks in several Southern states refused to issue marriage licenses, citing a personal religious objection. In an attemptto avoid discrimination, the clerks,like Davis, refused to give a marriage license to any couple  homosexual or heterosexual. Two cases are technically still pending in Texas, though the clerks offices have been issuing licenses, according to the American Civil Liberties Union, which has brought such litigation. There also are a handful of Alabama counties where clerks have refused to issue licenses, and those cases are pending in the lower courts there. But the Kentucky case has drawn the most attention because it is the first to make it to the Supreme Court, said Carl Tobias, a law professor at the University of Richmond School of Law. None have gone so far along to the Supreme Court, he said Wednesday of the Davis case. None of the clerks have been so visible, and none have had such a high profile. It is has brought all the attention to this situation. After a life that included personal problems and several marriages, Davis said she became a devout Christian four years ago after the death of her mother-in-law. I went to church to fulfill her dying wish, Davis said in a statement, released through her lawyers, Liberty Counsel, which defends Christians in cases where religion clashes with civil society. In church, I heard a message of grace and forgiveness and surrendered my life to Jesus Christ. I am not perfect. No one is. But I am forgiven. Davis, in her court papers, argued that her religious beliefs mean that she cannot in good conscience sign or allow her name to be on a license that is given to same-sex couples. She cited the Constitutions 1st Amendment and the state Religious Freedom Restoration Act, designed to protect religious expression. The state law is modeled on a federal law of the same name. Those arguments didnt sway the lower courts, nor the U.S. Supreme Court, Tobias said. The clash between the 1st and 14th amendments is the nub of the issue, he said. The courts have said that religious arguments have to give way to the due process requirements under the 14th amendment. The Supreme Court rejected Davis claims, and though there were no opinions or dissents, the top court seemed clear, Tobias said. It probably felt that it had already dealt with the merits of the issue of same-sex marriage, and now clerks have to do their duty under the constitution. According to Douglas Laycock, a law professor at the University of Virginiawho specializes in religious freedom cases, the Kentucky case seems clear given federal laws on when a person can claim a religious exemption. Her office cannot claim a religious exemption, Laycock said. The county has no religion so it is not allowed to claim an exemption. She doesnt have to do it personally, but someone in her office has to issue the license. In an email, Mathew Staver, chairman and founder of Liberty Counsel, defended Davis, whom he said is merely requesting her right of conscience be accommodated. There are a number of alternative ways to do this, including removing her name and title from the marriage license. Staver also argued that there are other places to get a marriage license nearby so Kim Davis request for accommodation is reasonable and an easy fix. What comes next will depend on the contempt hearing Thursday and whether a penalty  a fineor imprisonment  is imposed. Davis is an elected official and has refused to resign despite calls from activists who have sought a state impeachment proceeding. Meanwhile, Davis tried to spend Wednesday morning out of the limelight in her private office. She did emerge to deny a marriage license sought by Robbie Blankenship and Jesse Cruz, a couple from Ohio. Their confrontation was caught on video broadcast by local and national outlets. What authority do you have under the United States Supreme Court? Blankenship called out as Davis leaves after rejecting the license request. None, he said. You are a disgrace, he continued. You are a disgrace. Davis continued to walk away. Follow @latimesmuskal for national news. See the most-read stories this hour >>, ALSO IN THE NEWS, Honk once if Obama: Alaska relishes extended visit by a president, L.A. homicides, after big jump in August, are up 7% for 2015, Dramatic rise in crime casts a shadow on downtown L.A.s gentrification]", "Date": "20150902", "Title": "[She did it again: Kentucky clerk refuses marriage license to gay couple]", "Link": "http://www.latimes.com/nation/la-na-same-sex-marriage-kentucky-20150902-story.html\n", "Author": "[Michael Muskal]"}
