{"Content": "[Soon after she announced that she was running for president, Hillary Rodham Clinton positioned herself as a critic of big money in politics, even suggesting that she might endorse a constitutional amendment to overturn the Supreme Courts Citizens United decision. Yet as The Times reported last week, Clinton is courting potential donors to Priorities USA Action, a \"super PAC\" that is not bound by the contribution limits that govern donations to candidates. Its not hypocritical to espouse new rules to govern election spending while taking advantage of existing laws. And its true that former Florida Gov. Jeb Bush is also aggressively priming the super PAC pump. The problem is that using super PACS to chase campaign cash violates the spirit if not the letter of the law. Super PACs, made possible by Citizens United and a subsequent appeals court decision, are supposed to be independent political action committees, not extensions of candidates official campaigns. Yet the Federal Election Commission has been timid  and politically stymied  in defining what constitutes forbidden coordination between candidates and independent groups. The result is a situation in which, as one legal expert puts it, super PACs function as \"alter egos\" for official campaign committees without being subject to the same contribution limits and other restrictions. That undermines the argument enunciated by the Supreme Court that independent political expenditures create less of a potential for corruption than direct contributions to a candidates campaign. Given the paralysis on the FEC, the only realistic way to rein in super PACs is for Congress to act. A bill sponsored by Reps. David Price (D-N.C.) and Chris Van Hollen (D-Md.) would put teeth into the ban on coordination, and effectively shut down \"alter ego\" PACs. For example, a super PACs activity would be considered \"coordinated\" if the group were founded or managed by a candidates former employees or consultants or if it communicated about campaign matters with a candidates relatives. And the bill would tighten up restrictions on candidates soliciting funds on behalf of Super PACs. These new rules would be a small step in the right direction. Cynics would argue that a Congress populated by politicians wont enact new restrictions on campaign fundraising. But in the past, Congress has done just that in response to public disgust at the corrosive effects of money on the democratic process, from Watergate to the use of the Lincoln bedroom as a hospitality suite for donors. It should act now before the super PAC loophole grows any larger. Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150510", "Title": "[Tightening up on super PACs]", "Link": "http://www.latimes.com/opinion/editorials/la-ed-clinton-20150510-story.html\n", "Author": "[The Times Editorial Board]"}
