{"Content": "[In 1983, Britains Queen Elizabeth II and Prince Philip paid an official visit to Los Angeles. I was then a city councilman. At a reception in their honor, I noticed the Duke of Edinburgh standing alone at the other end of the hall. So I walked over to him and introduced myself. He was perplexed by my title. \"Ive met the mayor, and I know who he is,\" he said. \"Ive met the supervisors, though I dont know what they supervise. Now Ive met you councilors, and I dont understand your system of government.\", So I took a moment to explain the state-local government relationship; the state and its 58 counties; the thousands of cities within the counties; the special districts, including flood control, schools, mosquito abatement and water, to mention just a few. To which the prince, peering over his glasses, retorted, \"I now understand the genius of your system  its designed not to govern.\", For those of us who have served in California local government, no observation could be more perceptive. Trying to satisfy constitutional and legislative prescriptions in order to get anything done can be like navigating a minefield. Decades-old laws and regulations needlessly stand in the way of progress. Based on nearly 40 years of experience as an elected official in Los Angeles, Ive put together a list of suggestions on how to improve governance in the county and in the state of California. An executive, not a board, With a population of more than 10 million people and an annual budget of more than $27 billion, Los Angeles is the largest county in the United States. If it were its own state, it would be the eighth-largest  bigger than North Carolina. Yet we are constrained by an old governing structure prescribed by the California Constitution: a five-member Board of Supervisors elected from geographic districts equal in population. A five-headed executive is simply not the most efficacious way to govern a county as big as ours. Can we imagine North Carolina dispensing with its governor in favor of a five-member board?, I believe that Los Angeles County needs an elected executive who would be accountable to the entire county, not just one-fifth of it. Such an executive would institutionally speak for all of us in conjunction with the Board of Supervisors. He or she would help set the countys fiscal and policy agendas, hire and fire its department heads and run the nations largest county as the governor of the eighth-largest state should do. Achieving such a reform would require the placement of a charter amendment on the county ballot and its approval by a majority of the voters. To get this done, the civic leadership and community stakeholders must be convinced of the wisdom of such a change, and they must take the lead in promoting and sponsoring such a measure. It cant come from politicians, whose motives would be instantly questioned by voters. Let the majority rule, Another part of the status quo that cries out for change is the requirement that local taxes be approved by a two-thirds vote. In recent years, several ballot measures were narrowly defeated. Measure J, an extension of the 2008 transit tax, garnered 66.15% of the vote, falling just 15,000 votes short of the required two-thirds. A bond measure in 2002 that would have funded the seismic retrofit of some of our most iconic cultural buildings, including the Natural History Museum and the County Museum of Art, fell less than 5 percentage points short. And a measure in 2014 to fund parks and recreation facilities countywide fell short by a similar margin, garnering 63% of the vote. In most other states, a 63% majority would be considered a landslide victory. Here its a losing campaign. The notion that crucial public safety, recreation, cultural or transit investments can be held hostage by 37% of the voters is frustrating in the extreme. A more achievable threshold is in order. School bonds, for example, now require 55% for approval, and a similar threshold should be considered for measures that would fund other vital services. Any change to the two-thirds requirement would necessitate an amendment to the state Constitution. Thats not inconceivable. The Legislature has been considering placing a proposal on the 2016 ballot that would do just that. Campaign finance reform, The U.S. Supreme Court decision in the Citizens United case, among others, has opened the spigot allowing unlimited special-interest money to flow into campaigns. Powerful interests can now spend vast sums to elect their preferred candidates through so-called independent expenditure committees, or I.E.s. while contributions to candidates controlled committees remain strictly limited. This puts the citizen candidate at a distinct disadvantage in his or her run for office. In local politics, as in state and national politics, candidates who are funded by these I.E.s have their message communicated to the voters via advertising, while those who are not so funded are drowned out. Moreover, when millions of dollars in I.E.s are spent to elect a legislator, a county supervisor, a mayor or city council member, politicians are expected to return the favor, and far too often they do. Indeed, the main casualty of these court decisions has been political independence. Neither the Supreme Court nor Congress is likely to change course anytime soon. In the meantime, something needs to be done. Public financing of campaigns, something I didnt always embrace, has clearly made a difference in Los Angeles city elections. It has given candidates who couldnt self-fund, or couldnt count on special interests to fund an \"independent expenditure\" campaign on their behalf, a chance to be heard. To broaden that opportunity, local jurisdictions should institute or expand public financing laws as much as their treasuries will allow. However, there arent enough funds in any city budget to completely level the playing field against special-interest campaigns. In Los Angeles alone, it would take tens of millions of dollars per election to adequately fund community candidates. So as long as Citizens United and its analogs are in force, fundraising limits on candidate-controlled committees should be lifted to give independent-minded or community-based candidates a credible chance to win. It is patently unfair for a candidate to be strictly limited in the amount he or she can raise from a supporter, while his opponent can benefit from massive, unlimited expenditures on his or her behalf. A community-based candidate does not have to match the spending of his better-funded opponent dollar for dollar, but he needs to have a sufficient war chest to be heard in the electoral competition. From a historical perspective, there is a method to our states madness. Like people, governments are the product of their environment. Many of Californias regulatory barriers stem from the late 19th and early 20th centuries, particularly the Hiram Johnson reforms of 1912. They were a reaction to the concentration of power that gave corporate interests undue influence over legislation and government policy. Compartmentalizing or decentralizing decision-making was viewed as the surest way to protect the state from a complete takeover by special interests. The world, however, has changed since 1912. The structures that once made government more independent now make it less so, and less able to confront challenges in a timely manner. Fundamental reforms are necessary to bring local government into the 21st century. Zev Yaroslavsky served on the Los Angeles City Council from 1975 to 1994 and was a member of the Los Angeles County Board of Supervisors from 1994 to 2014. This article was excerpted from the Bollens-Reiss-Hoffenberg lecture recently delivered at UCLA. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150620", "Title": "[Three steps to revamp California state and county government]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-yaroslavsky-fixing-government-20150621-story.html", "Author": "NULL"}