{"Content": "[Gov. Jerry Brown was sworn into a historic fourth term on Monday morning, and then delivered an address combining the normally separate inaugural and state of the state speeches. Below L.A. Times reporters and editors offer commentary and perspective. Will four terms be enough for Jerry Brown? Many of the goals he detailed today wont be reached until after he leaves office. Brown repeatedly has made it clear he believes the states criminal sentencing laws need attention. In 2013, as he vetoed a bill to make drug possession a potential misdemeanor, he said the state was about to examine in detail Californias criminal justice system, including the current sentencing structure. He has yet to follow up on calls to create a sentencing commission to standardize some 5,000 criminal penalties Brown blamed for current prison crowding problems. --Paige St. John , Worth noting that despite gibes in past decades, @JerryBrownGov has had acute sense of voters gut. High speed rail may test that. Whatever think of policies, @JerryBrownGov has achieved a remarkable and resilient career, esp given massive changes in state. \"Pragmatic caution\"--Jerry Brown offers his governing principle in a nutshell. And therein the rub with many of his fellow Demos. Onto 2015!, Jerry Brown reels off impressive stats on CA under his stewardship. One big one (unmentioned) keeps him from running in 2016: His age, 76, Jerry Brown inaugural reprises the take-the-long-view theme of his reelection campaign: California must build on rock, not sand, he says, so the house stands when the storm comes. --Michael Finnegan, \"Pragmatic caution\"--Jerry Brown offers his governing principle in a nutshell. And therein the rub with many of his fellow Demos. Onto 2015!, The history riff by @JerryBrownGov may seem hackneyed to outsiders but it is a central part of the CA mindset: flintly independence. .@JerryBrownGov name checks Gaspra de Portola in closing. No Latin phrases though. Sorry @LATSeema, @cathleendecker, \"The challenge is to build for the future not steal from it:\" Gov. Jerry Brown, saying CA needs vision and prudence. #JerryBrown, Laying out ambitious agenda to fight climate change, Brown says California must show the way. Browns 2030 climate change goals - 50% of electricity from renawables, reduce petrol use by up to 50%, dbl efficiency of buildings. Note that climate change has been a bipartisan thing among CA governors; @JerryBrownGov s moves preceeded by @Schwarzenegger actions. \"Members of the Legislature, the Judiciary, Constitutional Officers, the extended family of my pioneering ancestors and fellow Californians:, , An inauguration is always a special occasion but today it is particularly special as I think about that day 40 years ago when my father and mother watched me take the oath as Californias 34th governor. It is also special because of how far we have come in the last four years. Then, the state was deep in debt  $26 billion  and our unemployment rate was 12.1 percent. Now, the state budget, after a decade of fiscal turbulence, is finally balanced  more precariously than I would like  but balanced. California has seen more than 1.3 million new jobs created in just four years and the unemployment rate has dropped to 7.2 percent. Thanks goes to the Legislature for cutting spending, the economy for recovering and the people for voting for temporary taxes.\", Read more, Jerry Brown looking for more bipartisan cooperation along the lines of 2014 water and rainy-day-fund deals, calling for Republicans and Democrats to join forces on roads and highway upgrades. --Michael Finnegan, Theres a mixed financial report card from Gov. Jerry Brown in his inaugural address. He touted the $2.8 billion he said will be deposited in a rainy-day fund by the end of the year, and the upcoming final payment on $15 billion in borrowing needed to balance the budget during the recession. But he said the budget is balanced more precariously than I would like, and warned of rising costs for public healthcare and retirement benefits for state employees. --Chris Megerian, AP, Frequent invocations of dad a reminder how Jerry Brown has come around to the old man, whom he strived not to emulate early in career. Brown: issues father raised during his inaug 56 yrs ago still relevant today. \"We must dedicate ourselves to making what weve done work.\", Balancing act from Jerry Brown on education -- \"Teachers need to be held accountable, but never forget, they have a tough job to do.\", \"The tasks ahead are daunting\": @JerryBrownGov on education. Says teachers need support not \"micromanagement from afar.\", Loudest applause so far for Brown on UCs: \"I will not make the students of CA the default financiers of our colleges and universities\", @JerryBrownGov takes shot at UC Regents. Says will not make students \"default financiers of our colleges and universities\", Hoping @JerryBrownGov goes of prepped text again soon.boring when he sounds typical. Alas, no free-form Jerry Brown at inaugural/State of State. Head down, plows through scripted remarks. \"Ive learned to like it since then by the way\": @JerryBrownGov on jarring experience at fathers inaugural while he was a seminarian. Brown: issues father raised during his inaug 56 yrs ago still relevant today. \"We must dedicate ourselves to making what weve done work.\", Brown thanks voters for passing Props 1 and 2 -- water bond and rainy-day fund measures. Gov Brown says state budget is balanced but \"more precariously than I would like. \", \"And were not stopping there\": @JerryBrownGov setting tone for last term of \"bold\" moves to transform the state for the future. And its official: @JerryBrownGov sworn in for an unprecedented 4th term as CA governor. Honored to be here at the inauguration of @JerryBrownGov & @GavinNewsom. Looking forward to 4 more yrs of pathbreaking climate leadership. Of all CA pols, @JerryBrownGov probably represents greatest gap between image and reality. Image: profligate Dem (more), Reality: cheapskate governor with affinity for occasional out-there ambition. Now: high speed rail system. Then: state satellites/computers. Gov. Brown to propose reducing petroleum use in cars and trucks by up to 50 percent in 15 years. .@JerryBrownGov to make push on infrastructure improvements. Notes CA has est $59b in upkeep/maintenance needs. Calls for bipartisan action, @JerryBrownGov to make bid for infrastructure improvements. Former Treas. Bill Lockyer in Dec. said good time for that. Low interest rates. Long standing ovation for @JerryBrownGov and @annebgust as they walk to rostrum. Clapping has feel of a campaign rally (or sports game), \"Please silence your cell phones\" -- something that wasnt said at Jerry Browns first inauguration in 1975. Fun Fact: Jerry Browns first inaugural address, back in 1975, was all of 26 paragraphs. Presumably a bit more to say today. Word of the day, courtesy of Jerry Browns inauguration -- covetousness, adj. \"marked by inordinate desire for wealth or possessions\", Assembly chamber filling up 15 min out of @JerryBrownGovs inaugural. First statewide official spotted: schools chief @TomTorlakson, Also spotted in the chamber: Leondra Kruger, @JerryBrownGovs most recent appointee to the CA Supreme Court, Jerry Brown kicked off his first inaugural address in 1975 by bemoaning low voter turnout. Turnout was even lower in 2014 (31% of eligible voters) than in 1974 (46.5%). Heres the full text of his 1975 speech. , --Chris Megerian, Money quotes from 2014 @JerryBrownGov State of the State: \"Boom and bust is our lot\" Contd, Contd: \"and we must follow the ancient advice, recounted in the Book of Genesis, that Joseph gave to the Pharaoh...\", \"Put away your surplus during the years of great plenty so you will be ready for the lean years which are sure to follow.\", , Can we forget Jerry Brown -- during his first cycle as governor -- produced the best magazine cover ever? pic.twitter.com/doVB8hOgWO, , The (very) long arc of Jerry Browns career, courtesy of @LATimesGraphics pic.twitter.com/rR398IkFYs, Steve Brodner / For The Times, Illustrator Steve Brodner takes a comic look at Brown through the years. Read more, Los Angeles Times, Jerry Brown brought a laid-back approach to his first inaugural address. Just 36 at the time of his swearing in, Brown told those gathered on Jan. 6, 1975 that he wasnt going to make a \"formalistic address. I just want to tell you whats on my mind.\", , And he started by telling everyone \"we ought to put this whole thing into perspective.\", , \"We have all come through an election, and what have we learned? More than half the people who could have voted, refused, apparently believing that what we do here has so little impact on their lives that they need not pass judgment on it. In other words, the biggest vote of all in November was a vote of no confidence. So our first order of business is to regain the trust and confidence of the people we serve.\", Read more, In 1975, Jerry Brown vowed to put Californians back to work and bring collective bargaining to farmworkers. http://t.co/RtPxidHITv, In 75, @JerryBrownGov first term as Gov, All in the Family was top TV show. Jaws and One Flew Over the Cuckoos Nest were in movie theaters, Jerry Brown kicked off his first inaugural address in 1975 by bemoaning low voter turnout. http://t.co/RtPxidHITv, Were getting two-for-one today in the Capitol -- Browns speech will be his inaugural address and state of the state http://t.co/ewpZgOUwln, The governor has expressed interest in new pollution restrictions, expanding efforts to combat climate change and finding ways to continue stabilizing Californias notoriously unpredictable finances. Brown has also pushed forward with the $68-billion bullet train project, which was approved by voters before he returned to the governors office in 2011, but has suffered declining popularity and uncertain funding. --Chris Megerian, Read more, After being sworn into office, Brown will deliver a speech to both houses of the Legislature, which will serve as his inaugural address and state of the state speech. Brown will be in Fresno on Tuesday for a groundbreaking ceremony as construction begins in earnest on the first segment of the rail line, stretching 29 miles north to Madera. , On Friday, Brown is scheduled to unveil a new budget proposal. Californias finances have rebounded with the help of an improving economy, but there are still major, unresolved problems left. --Chris Megerian, Read more, Read more]", "Date": "20150105", "Title": "[Gov. Jerry Brown inaugurated for fourth term]", "Link": "http://www.latimes.com/local/political/la-me-jerry-brown-speech-20150105-htmlstory.html", "Author": "NULL"}