{"Content": "[The cowboy commissioner arrives late, barging into the night meeting like one of his prized rodeo bulls broken loose from its pen. His Clark County Commission staff has collected residents of this ranching community to hash out a disputed federal land-use plan. Yet Tom Collins doesnt join officials up front in the meeting hall. Clad in worn Wrangler jeans and a plaid western shirt, his black Stetson tilted back on his head, he eases his lumbering 6-foot-3, 250-pound frame onto a creaking folding chair in the back row. He takes his hat off his gray, balding head and sets it on the floor, and he leans back like a wise-cracking high school senior. He digs into a Big Mac and fries amid the smell of grease and burger. \"I havent eaten since breakfast,\" he explains in a rough rural twang, wiping his fingers on his jeans. The performance is vintage Collins. At age 64, the lifelong rodeo man continued to ride bulls until a few years ago and remains popular among voters who have religiously returned him to office  including five terms in the Legislature  despite personal peccadilloes that might have dynamited other political careers. For one, Collins likes to drink whiskey; his poison-of-choice is Pendleton, a Canadian blend. The one-time Mormon convert who later left the church has unapologetically professed to keep a bottle on his office desk, by his bed and by the TV. There have been alcohol-fueled mishaps, like being cited for excessive noise for shooting up a tree at his North Las Vegas home during a drunken 2012 holiday celebration. (Collins, who paid a fine, said he was mad at the tree. Voters reelected him four months later.), Tom Collins, some scoff: Even his name is a drink. To grasp Collins unflagging popularity is to understand politics in a state that has featured cocktail-swilling Las Vegas mayor and mob lawyer Oscar Goodman  a place where personal foibles and cheesy flamboyance are tolerated and even embraced, as long as a candidate delivers. Collins knows that all too well. At the night meeting, he playfully pokes a Boy Scout in the row ahead, giving a thumbs-up to the youths uniform. Like President Lyndon Johnson, he leans imposingly into a group of men, invading their space, telling a private joke that makes everyone laugh. He presses a wad of Copenhagen chewing tobacco into his mouth and fiddles with a smartphone video of his bellowing cattle. A staffer shoots him the slashed-throat sign to take it outside. He picks at his nails, sighing audibly at comments that displease him. A local activist and Collins critic asks if he can have the crowds attention. \"No,\" the commissioner says to himself. \"Shut up. Sit down.\", Then Collins limps to the microphone; his body battered by countless falls from angry bulls. He thanks people for their views and pledges to continue as their bridge with federal officials: \"Happy New Year. I love you all.\" He knows such feelings arent always mutual. \"People out here either love me or hate me,\" he says later. \"I can handle both.\", Collins comes from country roots. Raised in Las Vegas, he rode a horse named Dogger Red to school as a boy. Decades later, the gruff political maverick insists hes not a politician, but an elected official who gets the job done: After flash floods, Collins has distributed hay from his pickup to feed stray cattle and used his own tractor to clear debris. As a legislator, he intervened when officials refused to let residents use a county fair agricultural arena during off months. Collins snipped the lock with bolt cutters. Taxpayers had financed the building, he said; it was theirs to use. \"Tom steps on toes,\" said Glen Hardy, an 83-year-old rancher. \"If youre not a Democrat, youre not worth a crap  hell tell you right to your face.\", His public emails frequently launch the F-bomb; he leans over a trash-can-turned-spittoon at commission meetings, where he often addresses public speakers as \"Bubba\" and \"darling.\" Commissioners once sought to ban him from the seven-member board over his public behavior. (They cant; only voters can.), Last year, the board chastised Collins after offensive remarks in which he called Utah residents \"a bunch of inbred bastards.\" Collins admitted to battling some \"personal demons,\" including a divorce from his longtime wife, Kathy. But he did not apologize. \"He has such thick skin, he doesnt realize his words can be hurtful,\" said Clark County Commission Chairman Steve Sisolak. \"This is a government body. Were not out on the range.\", Collins says hes accountable only to his constituents: \"I have won elections by a landslide because Im honest and Ill tell you what I think. And if I tell you Im going to do something, you can take that to the bank.\", At home, he often watches the Western Channel, shows like \"Bat Masterson\" and \"Maverick.\" He espouses \"cowboy logic\" and his cellphone message tells callers to \"cowboy up.\" He tweets under the handle @CowboyCommish. And his diesel pickup  its vanity plate carrying his cattle brand, \"T Bar K\"  is such a behemoth he struggles to fit it into his county parking space. He says his guiding ethos comes from John Wayne in the 1976 movie \"The Shootist\": \"I wont be wronged; I wont be insulted; I wont be laid a hand on.\", He briefly attended Midwestern University in Texas on a rodeo scholarship and is an inductee in the National Senior Pro Rodeo Assn. Hall of Fame. He rode bulls until a bad fall five years ago and says he may yet ride them again. He has a house in North Las Vegas and a 40-acre spread farther north with 30 rodeo-stock cattle. Collins did construction and worked for a power company until he first ran for public office in the early 1990s, concerned over \"do nothing\" government. Campaigning as a \"union Democrat\" whos conservative on social issues, he was elected to the North Las Vegas City Council and then the Legislature, often capturing 60% of the vote. In 2004, he began his first term as a county commissioner. Hes termed out in 2016. The cowboy commissioner has also used social media to blast fellow officials. Last year, Darin Bushman, an official in Piute County, Utah, called Collins about a ranch issue. Thats when Collins made the \"inbred bastards\" remark. The comment floored Bushman: \"Im like, Really dude? Youre a public official?\", Collins says his sarcasm is misunderstood. When reminded of the Bushman fray, he smiles. \"That inbred bastard? Hes related to half the people in Piute County.\", But Collins can be contrite. At a meeting after his insults to Bushman, he dropped his bravado. \"Ive been in a downward spiral for a couple of years, I admit it. Ive done some rude things and some not pleasant things, and real friends come and talk to me,\" he said. \"A lot of it is when theres sarcasm or trying to turn pain to humor.\", Through it all, Collins remains a drinker; no excuses. He often boozes out of anger over politics and his personal life, including personal debt and estrangement from his two children and his eight grandkids. Recently, at a North Las Vegas watering hole, a staffer plays designated driver. Collins orders a bottle of Coors Light  his first of four  saying hes loyal to Coors and Pendleton for sponsoring rodeo shows. He spits tobacco juice into a Styrofoam cup, addressing his critics with the F-bomb, a salvo he fires often. He calls himself \"a binge drinker\" rather than alcoholic, saying he doesnt booze as often as people think. He admits hes come to public meetings with a buzz. But again, no apologies: \"Even drunk, I can do more by accident than many people can do on purpose.\" When his commission term ends, he may run for city council. Or governor. His close friends have forgiven his reckless behavior. Decades ago, Collins was out drinking when his truck struck a parked tractor-trailer. He was injured, but his passenger, local pig farmer Bob Combs, suffered serious head injuries that still slur his speech. \"I held Bobs head to keep him from bleeding,\" Collins recalls. \"That accident taught us something: that were both mortal.\", As Collins battles his demons, Combs still calls him a brother. So does Combs wife, Janet. \"I love Tom; he stands his ground,\" she said. \"All in all, hes a pretty darned good man. A mans man.\", ALSO:, A big Las Vegas kaboom with hotel-casino implosion, His home museum of oddities is weird even for Vegas, Utah uranium mine is more of a bad memory than a historic site for many, ]", "Date": "20150301", "Title": "[In Nevada, cowboy commissioner rides a career as a political maverick ]", "Link": "http://www.latimes.com/nation/la-na-tom-collins-20150301-story.html", "Author": "[John M. Glionna]"}