{"Content": "[When Rick Perry made a late entry into the 2012 presidential race, he quickly surged to the top of the crowded Republican field. It turned out to be the high point of his candidacy. Less than three weeks after the voting started, the Texas governor unceremoniously quit the contest, becoming an object of derision for a bumbling debate performance and the flailing exclamation -- \"Oops!\" -- that served as a punch line to his hapless campaign. As Perry officially launched another try for the White House on Thursday, he has become something of an afterthought, trailing another large pack of 2016 hopefuls even though, by most accounts, he is a much-improved candidate from four years ago. Rather than jumping headlong into the contest and swaggering his way through appearances, he has set about a serious course of study in domestic and foreign affairs. No longer peering down from atop opinion polls, he has waged a humbler, more accessible campaign, focused in particular on Iowa, where Perry has shaken hands and backslapped his way from one small town to the next, winning strong reviews in the process. \"This is a guy who honestly admits the mistakes of his last race,\" said Craig Robinson, whose website, the Iowa Republican, closely chronicles events in the state that will cast the first 2016 ballots. \"I think that goes a long way.\", On Thursday, Perry,a former Air Force pilot, used a C-130 as a backdrop inside an airport hangar in the suburbs north of Dallas as he touted the states economic expansion and cited his humble upbringing in rural Texas. Ive seen American life from the red dirt of a West Texas cotton field, from a campus in College Station, from the elevated view of a C-130 cockpit, and from the governors office of the Texas Capitol, said Perry, the longest serving governor in the states history. He was joined on stage by several military veterans, who before Perrys speech lauded his service and commitment to the armed forces. Perry avoided criticizing the wide field of GOP presidential candidates, but assailed President Obama on issues foreign and domestic. I want to share some important truths with my fellow Americans, starting with this truth -- we dont have to settle for a world in chaos or an America that shrinks from its responsibilities, Perry said. We dont have to apologize for American exceptionalism, or Western values. But there is one other significant and potentially more consequential difference from the last time Perry ran: Even as he took the stage outside Dallas to announce his candidacy, he remains under indictment here in the state capital, accused of abusing his power as governor to undermine Texas political ethics agency. Attorneys for Perry, who left office in January, have fought hard to have the two felony charges tossed out of court, saying they were politically motivated and wrongly seek to criminalize Perrys legitimate conduct. But the presiding judge  a Republican  has refused to dismiss the case, leaving the indictment to hang menacingly over Perrys campaign. \"Its not on peoples minds at this point,\" said Jim Henson, who directs the Texas Politics Project at the University of Texas at Austin. \"But the fact it hasnt been dismissed does suggest that the idea that it was frivolous and completely manufactured has not been persuasive in court thus far.\", The case revolves around Travis County Dist. Atty. Rosemary Lehmberg and stems from her April 2013 arrest on drunken driving charges. Lehmberg pleaded guilty to a misdemeanor, paid a $4,000 fine and served about half of a 45-day jail sentence. She said she would not seek reelection in 2016. But she refused Perrys demand that she immediately resign; he, in turn, followed through on a veto threat and slashed $7.5 million in funding for the states public integrity unit, which is housed in the Travis County district attorneys office. The office has a history of tense relations with Republicans who run the state  Lehmberg is a Democrat  and a number of politically sensitive investigations were eventually dropped for lack of funding. A government watchdog group, Texans for Public Justice, filed a complaint, and an independent prosecutor was appointed to investigate. Perry was indicted in August on charges of abuse of official power and coercion of a public servant. After a blaze of publicity  including a nationally broadcast news conference in which the governor defended his actions and fiercely denounced the charges  the case has settled into the workaday grind of the legal process. In January, state District Judge Bert Richardsonrejected a defense bid to dismiss the case on constitutional grounds, though he questioned some of the wording in the criminal charges. Attorneys for the former governor have appealed the decision. ------------, FOR THE RECORD, June 4, 10 a.m.: An earlier version of this articlemisidentified state District Judge Bert Richardson as U.S. District Judge Bert Robinson. ------------, The case rarely seems to come up as Perry campaigns before Republican audiences around the country. \"I havent heard two people mention it,\" said Tom Rath, a longtime GOP strategist in New Hampshire, which immediately follows Iowa on the 2016 election calendar. \"I think most consider it some kind of political tug of war and dont expect anything to come of it.\", That is not to say, however, the indictment has not exacted a toll; Perry has so far spent more than $1 million in campaign funds on his legal defense. Staff writer Kurtis Lee contributed to this report. Twitter: @markzbarabak, ALSO:, Local politicians profit from presidential hopefuls in early-voting states, State Senate OKs measures on immigrant healthcare, e-cigarettes, Mystery tar balls could affect Southern Californias beloved grunion, 10:22 a.m.: This article has been updated with comments from Perrys announcement. 7:16 a.m.: This article has been updated to reflect the launch of Perrys campaign. This article was originally published at 3 a.m.]", "Date": "20150604", "Title": "[Rick Perry, humble and under indictment, announces second White House run]", "Link": "http://www.latimes.com/nation/politics/la-na-rick-perry-2016-20150604-story.html\n", "Author": "[Mark Z. Barabak]"}
