{"Content": "[From his new perch in Washington, Ted Lieu has suffered through an East Coast winter and other confounding indignities of life as a freshman member of the House from the party out of power. No matter, he says; he learned from his predecessor, the 40-year member Henry Waxman, that influence will be marked in years and decades, not the three months Lieu has spent in the capital. For one of Lieus bases of support, however, a far swifter assertion of power is underway. The Torrance Democrats victory in Novembers election was only one sign of the surge in importance of Asian American voters and Asian American politicians. On the same night Lieu won Waxmans seat, John Chiang claimed the job of state treasurer after two terms as controller. Betty Yee, a member of the state Board of Equalization, took over as controller. Fiona Ma, a former member of the Assembly, won a seat on the tax board. Two months later in Orange County, the Board of Supervisors became majority Asian American after a special election. In San Francisco, state Atty. Gen. Kamala Harris is mounting her campaign for a U.S. Senate seat that will be open in 2016. Harris, the daughter of an Indian mother and Jamaican father, would be the first woman of Asian heritage  and the first African American  to serve as a senator from California. \"Weve steadily been making gains,\" Lieu said with a laugh about the growing numbers of Asian American representatives. \"Were not going backwards.\", Some of the power of Asian American voters stems from their growth spurt  they were the fastest-growing ethnic group in the last U.S. census. Like Latinos before them, they are rapidly diversifying the electorate in a state where the divisions used to be binary, between black and white. And their growth in California presages growth elsewhere in the nation. But they present a tantalizing prospect for both parties, because so far they have shown less tendency to formalize their political alliances than other racial or ethnic groups. A USC Dornsife/Los Angeles Times poll taken last month showed that 40% of Asian Americans were nonpartisan voters, 35% were Democrats and 17% Republicans. Among Latinos, by contrast, only 24% were registered as nonpartisans, while the majority were Democrats. (Only 21% of white voters were nonpartisan.), The rise of Asian American voters has spurred the same arguments that Republicans have long made about Latinos  that they are culturally conservative, share business-oriented values and should be our voters. But theyre not. In the 2012 election, exit polls showed 73% of Asian Americans nationally backed President Obama, a click higher than the 71% of Latinos who sided with him and more than double the percentage of Asian Americans who backed a Democrat for president 20 years earlier. Certainly there are differences within the complicated mix. Voters of Vietnamese heritage  like Cubans in the Latino mix  are more likely to be Republican. But the voters share far more similarities, according to Karthick Ramakrishnan, a UC Riverside professor of public policy who has researched and conducted polls about them. \"Theres language diversity, religious diversity. There are elements in which they are distinct from one another, but in terms of political orientation theres more commonality than you might think,\" he said. Asian American voters, for example, support the presidents healthcare plan and actions meant to protect immigrants in the country illegally  two issues that, as with Latino voters, distance them from many Republicans. Another element driving Asian American voters from the GOP is the partys vocal embrace of Christianity  which strikes the ears of some Hindus and others as exclusionary. \"All of this Christian conservative talk and morality politics alienates them,\" Ramakrishnan said. Neel Kashkari, the 2014 Republican gubernatorial nominee, who is of Indian heritage, served as an example that the party is trying to diversify. But he found a place on the ballot only because the party had no other establishment candidates to sacrifice to the expected reelection of Democrat Jerry Brown. To the extent that optimism breeds alliances, Browns tenure in Sacramento could prove a boon to Democrats. The USC Dornsife/ Los Angeles Times poll found that 71% of Asian American voters approved of Brown, higher than both Latinos and whites. (There were not enough black voters to separate out.), Asian American voters were also far more optimistic about the economy and about the odds facing their own generation and the next  providing grist for Democrats who will contend that gains under a Democratic president and governor would be extended under successors from the same party. (Hillary Rodham Clinton, like her husband, Bill, is widely popular among Asian Americans.), Lieu has already endorsed Clintons unannounced campaign. He is proud of the role that Asian American voters are playing: \"Diversity is what has made our country strong, and it will continue to make our country strong.\" But he also makes clear that he represents everyone in his district. \"The issues to me are not very different,\" he said. \"I believe when you move the American family forward, you also move the Asian American family forward. Issues such as job growth, education, healthcare  they are all very similar issues across the board.\", Twitter: @cathleendecker]", "Date": "20150329", "Title": "[Recent election gains show Asian American voters' power surge]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-politics-20150329-story.html\n", "Author": "[Cathleen Decker]"}
