{"Content": "[They could not be more different, but Chris Christie and Jerry Brown have found opposite paths to the elusive goal of political popularity. Christie, the Republican governor of New Jersey, has a long, public and largely unrequited love affair with Bruce Springsteen. Brown, the Democratic governor of California, has allowed that his favorite music is the Gregorian chant. (Or so he declared during his black turtleneck period, circa 1990s.), Christie physically dominates his surroundings, even in his lessened, post-bariatric-surgery state, insinuating that hed be happy to plow through any brick wall ahead of him if the need arose. Brown comes off as someone who would rather wisp through the mortar, avoiding the mess and jumble Christies approach leaves behind. PHOTOS: 2013s memorable political moments, Christie commands the television screens at home and nationally, as he did Thursday and Friday due to the conflagration on the Jersey shore boardwalk. He has become the mournful siren of a state with a perennial chip on its shoulder, exhorting his people to stand up, again, even if they are exhausted from the last time. Brown is a ghost, mostly invisible to tens of millions of Californians whose only connection would be via television, a medium he ignores regardless of its importance to other politicians. He is the personification of a state that takes pleasure in flouting the rules, knowing that playing by them wouldnt markedly improve its image among outsiders anyway. And it has worked for both of them. Browns popularity in California rivals President Obamas, and even Republicans give him great odds of winning reelection in 2014. Christie is running away with his reelection race, which concludes in November, and looking toward a possible presidential bid down the road. At the moment, their very different styles mesh with where their states are. Christies style wears well in crises, of which there have been an endless supply lately in New Jersey. There he was on Thursday night, near the flaming Seaside Park boardwalk, telling Jersey Shore residents that this is us  as soon as this is over well pick ourselves up, well dust ourselves off, and well get back to work. As for everyone else, he said firmly: Do not come here. Do not travel. Stay away. It was a muted version of his angry warning as Hurricane Irene aimed for the same coast in 2011: Get the hell off the beach!, Bombastic style can be what the populace wants in crises, when people relish being told what to do. But it can wear poorly over the long haul, which may be Christies challenge if he launches a bid for president. That has certainly been the case in California, where Arnold Schwarzeneggers similar approach got old fast. Brown, previously a two-term governor with mixed results, won in 2010 as voters were still recovering from the dramatic largesse of the Arnold years and were yearning for someone quieter who knew which buttons to push. It was not just a change of style that Brown promised, but something more profound for Californians  a state government back in control, a state that demonstrated that it was, after all, governable. Browns office reinforced that sentiment Friday when it touted a host of issues that he and the Legislature had plowed through this year: a balanced budget, healthcare reform, a minimum-wage hike, prison moves. It might have been the template for his reelection argument, not that anyone could hear Brown saying that. Twitter: @cathleendecker, cathleen.decker@latimes.com]", "Date": "20130913", "Title": "[Chris Christie, Jerry Brown: Clashing, successful political styles]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-chris-christie-jerry-brown-politics-20130913-story.html\n", "Author": "NULL"}
