{"Content": "[Twelve months before the voting is set to begin, the 2016 presidential race is shaping up as a fiercely competitive contest driven by two overriding forces that  candidates aside  will go a long way toward deciding the next occupant of the White House. Whoever Democrats nominate  Hillary Rodham Clinton being the heavy favorite  will face the inherently difficult task of winning the presidency for the party for the third time in a row. That has happened only once since Harry Truman was elected more than half a century ago: in 1988 when Republican George H.W. Bush succeeded President Reagan. \"People always choose, even if you have a popular president, the remedy [to] and not the replica of what they have,\" said David Axelrod, a Democratic strategist who twice helped Barack Obama win the White House. At the same time, Republicans face another wide-open contest for their nomination  and, with it, a gravitational pull from the right flank of the party. That wing of the GOP is far more conservative than the country as a whole, potentially making the winner less appealing to a broader November electorate. \"The stark reality that Republicans face is that the nation is younger and its more diverse ethnically,\" said Dick Wadhams, a Republican strategist in Colorado, a state expected to be among the hardest-fought in 2016. \"Weve got to have a Republican who can speak to that reality.\", With each side facing hurdles, the bottom line is a presidential contest that could be the most competitive since at least 2000, when the U.S. Supreme Court stepped in after weeks of legal jousting to break an effective tie and put Bushs son George W. in the White House. The Republican field is expected to be large and varied, including competing U.S. senators  Rand Paul of Kentucky, Ted Cruz of Texas and possibly Marco Rubio of Florida; governors, including New Jerseys Chris Christie and Wisconsins Scott Walker; some repeat candidates, including outgoing Texas Gov. Rick Perry, as well as Jeb Bush, a former governor of Florida. Bush starts out with a number of considerable advantages, not least an expansive nationwide network of donors and political loyalists dating from when his father and older brother ran for president and served in the White House. He is also the favorite of many establishment Republicans eager to avoid the sort of prolonged and acrimonious primary battle that undercut the partys 2012 nominee, Mitt Romney, by pushing him rightward on issues like contraception and immigration. But it is too soon to call Bush  or any candidate, for that matter  the Republican front-runner. The party remains deeply divided between its governing wing, which is eager to show voters that Washington can work to implement functional conservative policies, and insurgents like Paul and Cruz, who favor a more ideological and confrontational approach. \"This nomination is going to be a fight,\" said Scott Reed, a veteran GOP strategist who ran Bob Doles 1996 presidential campaign. \"Its not going to be a layup for anybody.\", Apart from their philosophical divide, Republicans face a country that is changing by the day, as Latinos and Asian Americans become a larger and increasingly potent share of the electorate. Many are first- and second-time voters who have spurned the GOP, due in good part to the harsh rhetoric and hard-line stance on immigration embraced by some in the party. Q. Whitfield Ayres, a longtime Republican pollster, says that Obama would have lost to Arizona Sen. John McCain in 2008 had the electorate been the same as 1980, when Ronald Reagan first won the White House. Whites made up 88% of the electorate then, compared with 74% in 2008; if the recent trend continues, the share of white voters may be 70% or less in November 2016. \"We need someone who can more appeal to working-class whites than Mitt Romney was able to do and more appeal to  Hispanics and Asians than Romney was able to do,\" said Ayres, who has worked with Rubio in his Florida campaigns. \"Then we will blunt the effect of those longer-term forces that favor the Democrats.\", In the short term, though, it is Democrats who must overcome one of the most elemental forces in politics: the hunger for change. An NBC/Wall Street Journal poll in December found that more than 7 in 10 voters wanted Obamas successor to take a different approach from the incumbent, a not-unusual level of fatigue with a president deep into his second term. After six tumultuous years, even Axelrod, the Obama strategist, sees voters wanting someone different from the president. \"Someone who knows how to navigate the inside game,\" Axelrod suggested. \"Someone whos a little less nuanced, less sensitive to the gray.\", If that sounds somewhat like Clinton, consider that Democrats often dont settle on their initial front-runner, or else embrace them only after an extended primary fight. Moreover, after two highly conspicuous decades in public life  as first lady, New York senator, presidential candidate and Obamas secretary of State  Clinton is hardly the fresh face that Democrats typically yearn for. Clinton does, though, hold out the prospect of becoming the first female president, which, in itself, represents a break from the past. \"If you want to seize the change mantle ... that would certainly be historic,\" said Don Sipple, a political ad man whose past clients include George W. Bush, Arnold Schwarzenegger and Jerry Brown. Although no serious Clinton challenger has yet emerged, several Democrats have taken at least preliminary steps toward a 2016 campaign. Outgoing Maryland Gov. Martin OMalley has been an abundant presence in early-voting states, and former Virginia Sen. James Webb has launched an exploratory effort. Vermont Sen. Bernard Sanders, an independent who usually aligns with Democrats, has also taken preliminary soundings, and Vice President Joe Biden has yet to definitively rule out a run. If Clinton were to stand down for any reason, the hugely competitive 2016 contest would grow even more so. \"Youd have the wildest race on both sides weve ever seen,\" said Democratic strategist Paul Maslin. mark.barabak@latimes.com, Twitter: @markzbarabak]", "Date": "20141229", "Title": "[Big obstacles await both parties in 2016 race for president]", "Link": "http://www.latimes.com/nation/politics/la-na-2016-presidential-race-analysis-20141229-story.html\n", "Author": "[Mark Z. Barabak]"}
