{"Content": "[Florida Democratic Rep. Patrick Murphy announced on Monday his candidacy for Senate in whats expected to be an open seat in next years general election. The Florida contest will be one of several key Senate races in 2016 as Democrats look to regaincontrol of the upper chamber of Congress after losing it in last years midterm elections. For several weeks Murphy, who has served in the House since being elected in 2012, has hinted he might run in the race and has beena top recruit of the Democratic Senatorial Campaign Committee. His entrance comes as incumbent Republican Sen. Marco Rubio is expected to launch a presidential bid in the coming weeks. Rubio has said that if he runs for president he will not seek reelectionto the Senate seat hes held since 2011. Last week, Rep. Debbie Wasserman Schultz (D-Fla.), chairwomanof the Democratic National Committee, and former Gov. Charlie Crist, who ran an unsuccessfulgubernatorial campaign last fall, both took their namesoff a possible candidates list. Still, Rep. Alan Grayson, whose districtspans the Orlando-area, is considering a bid and could present a formidable primary challenge to Murphy. Republicans have control of both chambers of the Florida Legislature and the governors mansion, and the party has dominated statewide races in recent years. But Democrats in the state are optimistic as they hope to garner support from a growing Latino electorate that includes Cuban Americans. In his campaign announcement, Murphy attacked Rubio, saying Floridas junior senator has \"put his presidential ambitions before the needs of the people of this state.\", \"We need a leader in the Senate whose eyes are firmly fixed on the people of Florida by working together to get things done,\" Murphy said. \"In the coming months, I look forward to meeting Floridians across the state to listen, earn their trust and ask for their support. Republicans who might look to succeedRubio should he run for president include the states Chief Financial Officer Jeff Atwater. Florida, a swing state in presidential elections, is also home to formerGov. Jeb Bush, whois widely expected to run for president along with Rubio. Twitter:@kurtisalee]", "Date": "20150323", "Title": "[Patrick Murphy to run for Marco Rubio's Florida Senate seat]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-patrick-murphy-florida-senate-bid-20150323-story.html\n", "Author": "[Kurtis Lee]"}
