{"Content": "[In a historic break with its past, the California Republican Party voted overwhelmingly Sunday to formally recognize a gay GOP group. The move, which drew the condemnation of some socially conservative GOP members, grants a charter to the Log Cabin Republicans California chapter, making it an official volunteer arm of the state party. It is among the first gay groups in the nation to be officially sanctioned by a state Republican party. Brandon Gesicki, a delegate from Carmel who supported the effort, said the 861-293 vote at the state GOP convention here showed how much that organization had changed in recent years. \"It would have been the complete opposite 15 years ago,\" said Gesicki, who also turned in a proxy vote from former Lt. Gov. Abel Maldonado supporting the recognition. \"The fringe does not control the party anymore. We truly are a big tent once again.\", The decision comes at a critical moment for gay-rights supporters. The U.S. Supreme Court is set to decide on the constitutionality of bans on same-sex marriage in June. The issue is likely to be prominent in the 2016 presidential campaign. And in California, where GOP voter registration is at a historic low of 28%, the party is desperately courting groups of voters, such as gays and ethnic minorities, who tend to favor Democrats. Charles Moran, chairman of Log Cabin California chapter, was visibly emotional Sunday. \"Im personally overwhelmed,\" he said, noting that he got his start in politics as a staffer in the state party in 1999. \"This is the culmination of a 15-year journey for me.\", Democrats were skeptical. \"Recognizing and acknowledging that everyone deserves a shot at representation, no matter their sexual orientation, is an important first step,\" said state Democratic Party spokesman Tenoch Flores. But \"Republicans are light-years behind\" in enacting policy that reflects such recognition \"and are likely to remain there,\" he said. Democrats have chartered an LGBT caucus since at least the mid-90s, Flores said. Republicans relationship with gays, once adversarial, has grown warmer in recent years, particularly in California. Last year, gubernatorial candidate Neel Kashkari marched in a gay-pride parade, the first Republican statewide candidate to do so. Assemblyman Rocky Chavez, who is considering a run for U.S. Senate, supports same-sex marriage. The Log Cabin Luau, featuring rainbow-colored leis and mai tais, is among the best attended parties at state GOP conventions. On Sunday, convention delegate Christopher Bowman, who became active in the gay Republican group in 1980, said he was gratified by the recognition decades after the group first sought it. \"I feel like Im channeling Thaddeus Stevens,\" he said, referring the Civil War-era abolitionist. \"Weve earned it. Weve been in the trenches for 30 years.\", Richard Grenell, a Los Angeles-based conservative strategist and commentator who is gay, said the formal approval was long overdue. \"Its embarrassing to be talking about this in 2015 as progress. But it is progress,\" he said. Grenell said theres a strategic benefit to the partys embrace of the group, whose name honors President Lincolns humble origins and dedication to equality. The GOP has not elected a candidate to statewide office since 2006. \"The California Republican Party understands that if theyre going to win elections  which theyve been very bad at lately  theyve got to add to their numbers, not subtract,\" Grenell said. \"It seems like a pretty basic concept.\", But areas of deep conflict remain, both in California and across the nation. The national Log Cabin group was once again turned down as a sponsor for last weeks Conservative Political Action Committee gathering in Maryland, although its executive director was invited to speak on a panel. In Texas last year, two gay Republicans groups were barred from having a booth at a state party convention. The California GOPs official platform says homosexuality is unacceptable. \"We believe public policy and education should not be exploited to present or teach homosexuality as an acceptable alternative lifestyle. We oppose same-sex partner benefits, child custody, and adoption,\" the platform says. Opponents of the recognition vote Sunday cited the platform, moral values and a bylaw that forbids the recognition of organizations focused on \"lifestyle preferences.\", John Briscoe, president of the socially conservative California Republican Assembly, pointed to Log Cabins support of same-sex marriage. \"I have a hard time understanding how were going to charter an organization thats in opposition to our platform,\" he said during the floor debate. Andrew Levy, a delegate from Sacramento, said the decision was an affront to his Jewish faith. \"People supported the Republican Party because theyre strong on family values,\" Levy said, adding that the embrace of the gay group undermined his trust in the GOP. Log Cabins effort received the imprimatur of influential GOP leaders, including national committee member Shawn Steel and former state party chairman Bob Naylor. They cited the groups volunteer work for the party in electoral battles across the decades to argue that it deserved a charter. \"The Log Cabin Republicans have given their time, money and resources to this party time and time again, and we have given them nothing in return,\" said Nathan Miller, chairman of the California Young Republican Federation, a group for young professionals that is chartered by the state party. \"This vote is not about orientation, its about participation.\", The Sunday morning proceedings took nearly an hour. Five people were allowed to speak in support of a charter and five in opposition. Though the debate was largely civil, there were a few testy outbursts, mostly on points of order, prompting state party Chairman Jim Brulte to admonish at one point: \"Everyone take a deep breath.\", seema.mehta@latimes.com, Twitter:@LATSeema, melanie.mason@latimes.com, Twitter: @melmason]", "Date": "20150301", "Title": "[ State GOP formally welcomes gays to the party]", "Link": "http://www.latimes.com/local/politics/la-me-california-republicans-20150302-story.html\n", "Author": "[Seema Mehta, Melanie Mason]"}
