{"Content": "[Women have long enjoyed a key advantage in Californias strong Democratic political ecosystem: Sheer numbers. Polling taken before last Novembers election underscored the obvious: 56% of Democrats were women, clocking men by 12 percentage points. Evidence of their power can be seen in the forms of Dianne Feinstein and Barbara Boxer, who 23 years ago became the nations first all-woman Senate team largely on a surge of support from women voters. But in an alarming turn for the states dominant political party, women are vanishing from its legislative ranks, traditionally the training ground for federal or statewide office. California in 2003 was fifth among states ranked by the percentage of its Legislators who were women, according to the Center for American Women and Politics at Rutgers University. But the state now finds itself mired in a surprising 20th place. All of the lost ground has come at the expense of Democratic women. At the high water mark a decade ago, 31 Democratic women served in the Legislature. Now, 19 do. At the same time, Republicans have doubled their strength from six women members a decade ago to 12 now. \"Its obvious to me theres something not exactly right,\" said Mary Hughes, a veteran political strategist. \"There are a lot of factors and they converged to create a backslide.\", The first factor is the pipeline. Studies nationally have found that fewer women than men consider running for political office. Thats generally blamed on the toxic environment that envelops many races these days, from beginning contests at the school board level to the presidential level. There is the tendency of women to require themselves to be perfectly matched to a task before embarking on it, and their desire to accomplish something  an ambition that they may not see as possible in a sharply partisan legislature. \"They look at this business of politics and think: Is it worth my time and energy?\" said Katie Merrill, a Bay Area Democratic consultant who has taken part in multiple gatherings meant to encourage women to run. As Merrill noted, there are other avenues of political exercise besides seeking office. (Hillary Rodham Clintons presidential campaign is relying heavily on women active on her behalf.), \"They can get involved in campaigns, they can raise money,\" she said. \"That may be enough for them.\", Although views differ, mechanical reasons may account for some of the slump in women Democrats. Term limits have forced out some pioneers. And the primary system, in which two candidates move on to the general election regardless of party, has occasionally pitted women against each other and paved the way for a mans election. But if those conditions were the cause, Republican women should be feeling the effects as well  and yet they are gaining ground rather than losing it. Another element may be in play: the potent ambitions that accompanied the \"Year of the Woman\" in 1992, in which Democratic women senators such as Feinstein and Boxer swept in, have eased as women politicians have become more common. (Among Republican women, who did not see their ranks grow in the 1990s, that fierce desire is evident now.), \"Women are establishment candidates now  look at the presidential race, where Hillary Clinton is the establishment candidate,\" Merrill said. \"There isnt that sense that theres an underrepresentation of women in politics, even though there is. There isnt an urgency like there used to be.\", Women voters, particularly Democrats, may look at their two senators, the plethora of women on their city councils and school boards, and see parity. But even in the House delegation, where 19 of 53 California seatsor 36%  are held by women, parity is an illusion. That is part of the problem, according to Hughes, who in 2013 founded a group called Close the Gap CA to press for the election of Democratic women. Sociologists, she said, say members need to account for 30% of an institution before they have a pivotal role  and that is a mark hit by few political entities. \"Yes, women are changing the institutions that they serve in, but there are not yet enough of them to really reshape the culture of those institutions,\" she said, in a way that might serve to attract more women candidates. Groups like Hughes are seeking to alter the calculus by recruiting women candidates, educating them about what they can accomplish, providing them a floor of support and preparing them for the rigors of a campaign. Of 20 seats targeted by her group in 2016, she said that at least 14 have promising candidates, though some remain unannounced. The ongoing presidential campaign features two women candidates  Clinton and Republican Carly Fiorina. The 2016 U.S. Senate race here features two Democratic women  Kamala Harris, the state attorney general, and Rep. Loretta Sanchez of Orange County. But beneath those marquee races, a struggle is ongoing to build numbers that once were far bigger than they are now. \"The Year of the Woman in 1992  we never finished that,\" Merrill said. \"Its ongoing, and its long term.\", cathleen.decker@latimes.com, Twitter: @cathleendecker, For more on politics, go to www.latimes.com/decker.]", "Date": "20150823", "Title": "[Democratic women seek to regain lost ground in Sacramento]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-politics-women-20150823-story.html", "Author": "[Cathleen Decker]"}