{"Content": "[The 2016 presidential election is more than two years away. Heck, the 2014 midterm election is still more than a month away. But its never too early to speculate about presidential nominations, especially for politicians who are thinking about running. Its no surprise that potential Republican candidates are already stumping around the country asking voters and contributors to take a look. Their field is wide open. But its a little more complicated for Democrats, with Hillary Rodham Clinton holding what looks like an unshakable lead in their polls. Still, at least four other Democrats are said to be thinking about jumping into the race  former Montana Gov. Brian Schweitzer, Maryland Gov. Martin OMalley, former Virginia Sen. Jim Webb and Vice President Joe Biden  as well as Vermont Sen. Bernie Sanders, an independent who caucuses with the party. Shes going to be challenged by at least two or three others, predicted Tad Devine, a Democratic strategist who helped manage three presidential campaigns (and advised Sanders when he ran for the Senate). Hillarys the prohibitive front-runner, absolutely, but that can change very quickly once you get into a primary campaign. Clinton would face two challenges from all those upstarts  one domestic, the other foreign. On economics, all the potential Democratic candidates cast themselves as firmly with the 99%. They are decrying the long-term stagnation in middle-class incomes and calling for an end to the long stretch of tax cuts that have helped the affluent. Clinton sometimes sounds as if shes right there with them. This spring, she gave a speech comparing the current economy to the Gilded Age of the robber barons. But she hasnt been specific about the remedies shed propose, and her would-be competitors have sounded tougher on Wall Street, a position sure to win favor from economic liberals. Sanders, a self-described democratic socialist, has said that if he runs, My job is to take on the billionaire class. And Schweitzer, a folksy, mercurial rancher turned politician, has publicly criticized Clintons reliance on high-finance contributors. If you can judge a persons character by the company they keep, in politics you can judge a person by the money they seek, he told the Wall Street Journal. On foreign policy, presumably one of Clintons selling points, she could find herself sandwiched between critics from the left and right. Sanders, to Clintons left on most issues, has frequently noted that he voted against the Iraq war in 2002 (Clinton voted for it), and last week he voted against authorizing the Obama administration to arm Syrian rebels. Webb, who has staked out domestic positions to Clintons right, is (to stretch an analogy) the Rand Paul of the Democratic Party  skeptical about most uses of military force. He opposed the 2011 U.S. intervention in Libya that Clinton championed. Last week he said that he thought President Obamas foreign policy, which Clinton helped shape, was a tangled mess. None of these upstarts, at this point, pose a serious threat to Clintons march to the Democratic nomination. The only one who has registered any consistent support in polling is Sanders  assuming he runs as a Democrat  and he shows up in fourth place, after Clinton, Biden and Massachusetts Sen. Elizabeth Warren, who insists she isnt running. But having little chance of winning isnt likely to stop them. Some of them, such as Sanders, will run in the hope of moving the party in their direction ideologically. Others  think OMalley and Schweitzer  will see running as at least a way to boost their name recognition, making it more likely they could land a future nomination  or be offered a place on the ticket as vice presidential nominee. Clinton would probably prefer not to have to spend time and money defending herself in the primaries. But, at least according to some campaign strategists, facing challengers might actually do her some good. Primary challenges will force Clinton to tune up her campaign organization. And they would enable her to make her pitch to a wider audience during the long primary season. I think shes absolutely better off with some opposition, said Devine. Otherwise youre in danger of spending six months in a black hole. You dont want to cede those six months to the other party while you sit there in your coronation robes. That wont play well. Still, contested primaries also offer a front-runner a chance to make mistakes. And Clintons history as a campaigner has been far from flawless. She started the 2008 Democratic presidential campaign as the prohibitive front-runner but lost to an upstart named Barack Obama. She launched her pre-campaign this year with a well-orchestrated book rollout, but made headlines by complaining that she and her husband were dead broke when they left the White House. And theres always a chance Clinton might decide not to run after all. Thats unlikely, but its still possible, a sometime Clinton advisor told me last week. In that case, all bets are off. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus]", "Date": "20140923", "Title": "[Clinton's lead among Democrats in 2016 is clear -- which is complicated]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-mcmanus-column-democrat-candidates-president-20140924-column.html", "Author": "NULL"}