{"Content": "[Throughout American history, Congress has often been at odds with the president. But so far, the legislative body has not turned to the third government branch  the judiciary  with a lawsuit claiming the chief executive violated the Constitution. That may change as House Republicans say they intend to sue President Obama for failing to \"take care that the laws be faithfully executed,\" as the Constitution requires. As evidence, the GOP will point to Obamas decision to delay enforcement of a provision of his signature healthcare law, the Affordable Care Act, which requires large employers to offer health insurance. According to the law passed by Congress, the mandate was to take effect \"beginning after December 31, 2013.\" But amid problems with the rollout, Obama delayed it until Jan. 1, 2015. Although House Speaker John A. Boehner (R-Ohio) opposes the \"employer mandate,\" he says the lawsuit  which would demand more stringent enforcement of the law he wants to overturn  is about \"protecting the Constitution.\" Democrats, not surprisingly, deride it as a political stunt. Politics aside, legal experts see four reasons a lawsuit is likely to fail:, Lack of standing, The Supreme Court has made it clear in recent decades that members of Congress have no standing to file constitutional lawsuits. The justices have insisted plaintiffs must show they suffered a \"personal injury\" and are not merely in court to argue an abstract point of law. They are often loath to be drawn into political battles better left to the legislative branch and president. In the 1970s, Sen. Edward M. Kennedy (D-Mass.) sued Republican President Nixon over his use of the \"pocket veto,\" and Sen. Barry Goldwater (R-Ariz.) sued President Carter, a Democrat, for dropping a defense treaty with Taiwan. Kennedy won in lower courts, but others failed upon reaching the high court. In the 1997 case of Raines vs. Byrd, the Supreme Court ruled broadly that lawmakers do not have standing to sue in their capacity as members of Congress. Just last year, the high court expounded on its views about lack of standing when it dismissed the defense of Californias Proposition 8. Sponsors of the ballot measure, which banned gay marriage, appealed after a federal judge invalidated the law and state officials refused to defend it. But the justices rejected the sponsors appeal. \"To have standing, a litigant must seek relief for an injury that affects him in a personal and individual way,\" said Chief Justice John G. Roberts Jr. \"This is an essential limit on our power: It ensures that we act as judges, and do not engage in policymaking properly left to elected representatives.\", Cornell Law professor Michael Dorf said the high courts insistence on personal standing means the House Republicans \"face an insuperable obstacle\" in getting their case before a judge. But Washington attorney David B. Rivkin, who helped launch the suit that challenged Obamas healthcare law as unconstitutional, dismissed the skeptics. Though the high court ruled individual lawmakers cannot sue, Rivkin and Elizabeth Price Foley, a law professor at Florida International University, predict the justices will allow the House to sue as a law-making body. Presidents are given leeway to enforce laws, Obamas supporters point out that he is not the first president to postpone enforcement of a law or to miss a deadline to issue new rules. Democratic lawyers note that the Clinton and George W. Bush administrations decided to phase in congressionally mandated changes to Medicare in the last 15 years. Most recently, Bushs health advisors delayed for a year enforcing a late-enrollment penalty for new prescription drug coverage. Simon Lazarus, a lawyer for the Constitutional Accountability Center, told a House committee recently that there was \"no material difference between these decisions by the Clinton and Bush administrations to postpone regulations and the Obama administrations approach to implementing\" the Affordable Care Act. This is \"not a refusal to enforce the law, but a phase-in, and thats different,\" he said. Moreover, lawyers say it is routine for agencies, such as the Environmental Protection Agency, to miss deadlines or order delays in issuing new rules established by Congress. Constitutional experts say it has been understood that the chief executive has some discretion in enforcing the law, just as police officers have discretion not to write a ticket for every driver who exceeds the posted speed limit. \"Courts are very reluctant to tell the executive how to enforce the law,\" said Tara Leigh Grove, a law professor at William & Mary Law School. \"We dont have a history of the House or Senate suing the president. And it would be very hard for a court to say a one-year delay means the president is refusing to enforce the law.\", Lazarus predicts judges \"will see this as a political maneuver,\" because it will be \"apparent to all that faithful execution of the Affordable Care Act is the last thing in the world that the proponents of the suit hope for.\", No easy legal remedy, Typically, a plaintiff sues and asks for compensation for his loss. In a constitutional suit, the proposed remedy may be a ruling that strikes down a law. But it is not clear what a judge could order as a remedy if he or she decided the president had wrongly delayed enforcement of the employer mandate. And the time for a decision is short. The insurance mandate for large employers is due to take effect in 2015, while the mandate for employers with 50 to 100 employees is due to take effect at the start of 2016. If the suit is still pending, it could be declared moot then. Impeachment the proper forum, While the Constitution does not authorize the legislative branch to sue the president, it says the House of Representatives may vote on articles of impeachment if it believes the president has committed \"high crimes and misdemeanors.\" If Republicans believe Obama has broken the law, impeachment is the appropriate vehicle, analysts say. But this process requires far more evidence of wrongdoing than a delayed phase-in of a new law. And impeachment can carry a high political cost. When House Republicans voted to impeach President Clinton in 1998, his popularity rose. Republicans lost seats in the fall election, and Speaker Newt Gingrich resigned. Last year, three of the Supreme Courts leading conservatives warned House Republicans against running to court. Justice Antonin Scalia, joined by Roberts and Justice Clarence Thomas, supported the Defense of Marriage Act, which banned federal recognition of same-sex marriages. Nonetheless, they said House Republicans did not have standing in their attempt to defend the law. This matter should have \"been left to a tug-of-war between the president and Congress, which has innumerable means (up to and including impeachment) of compelling the president to enforce the laws it has written,\" Scalia wrote. Allowing lawmakers to sue, he warned, would unwisely create a whole new \"system in which Congress and the executive can pop immediately into court, in their institutional capacity, whenever the president refuses to implement a statute he believes to be unconstitutional, and whenever he implements a law in a manner that is not to Congress liking.\", david.savage@latimes.com]", "Date": "20140719", "Title": "[Why experts see little hope for GOP plan to sue Obama over law's delay]", "Link": "http://www.latimes.com/nation/la-na-house-lawsuit-20140720-story.html\n", "Author": "[David G. Savage]"}
