{"Content": "[Wisconsin Gov. Scott Walker fell for Donald Trumps evil scheme. Trump came up with an immigration plan that is so preposterous it proves he must be an undercover Democratic Party saboteur tasked with ruining any chance for a Republican victory in the 2016 presidential race. David Horsey / Los Angeles Times, David Horsey / Los Angeles Times, Once upon a time, Walker favored a path to citizenship for the 11 million or so undocumented immigrants in the United States. That was before he got serious about running for president and felt the need to tap into the anti-immigrant anger on the right. This week, he endorsed major elements of Trumps plan. Walker said he, too, now wants to build a big wall along the border with Mexico and cancel the guarantee of citizenship for children born on American soil whose parents are in the country illegally. Walker did not specify if he also agrees with Trumps assertion that every undocumented person must be deported, along with their American-born kids, but he did tell radio host Glenn Beck that one of the things you cant ignore is that [Trumps] tapped into something very real. Or surreal. Just when Trump was starting to be taken more seriously as a candidate with staying power by both GOP voters and the media, he unveiled his immigration plan. Sure, it appeals to angry folks who like how he characterized the Mexicans slipping across the border as rapists and criminals steered to the U.S. by the Mexican government. But, as policy, it has no chance of working. Deporting 11 million people is an impossible task for the federal government, which has neither the manpower nor the financial resources. Tossing American citizens into the mix, even if they are children, would also be illegal. Eliminating the right to citizenship for children born on American soil would take a constitutional amendment that would never pass, while getting Mexico to pay for the border wall is another Trump pipe dream. Right-wing conspiracy theorists who have been suspicious of Trump all along can now argue even more fervently that he is a Democratic wolf in sheeps clothing (and a red billionaires tie!) who is deviously pushing the other Republican contenders to sign on to his crazy immigration plan. Walker is all in and Ted Cruz cannot be far behind, along with Bobby Jindal, Mike Huckabee and maybe other candidates. Why is this so good for Democrats? Because no one can become president of the United States without a large share of the Latino vote. George W. Bush was helped in the tight election of 2000 by winning a third of Latino voters and did even better in 2004, getting around 40%. In 2008, John McCain pulled in 31% of Latino votes and lost to Barack Obama. In 2012, loser Mitt Romney did worse with just 27%. During that time, the Latino vote has been increasing as a segment of the electorate, which means a Republican presidential nominee needs more, not less, Latino support. Latinos care about a variety of issues and many are religious, pro-business social conservatives. Republicans have opportunities among these voters, but not if the party is seen as bellicose in its policies on undocumented immigrants from Mexico and other parts of Latin America. Trumps plan qualifies as bellicose, and any GOP candidate who signs on in favor of it is only certifying that when a new president takes the oath of office on Jan. 20, 2017, that person will be a Democrat. Conspiracy theories aside, there really is no evidence that Donald Trump concocted his immigration plan with anything other than a sincere Republican heart. Still, the Democratic National Committee should at least send him a thank-you note.]", "Date": "20150820", "Title": "[Trump's immigration scheme kills Republican chances with Latinos]", "Link": "http://www.latimes.com/opinion/topoftheticket/la-na-tt-trump-immigration-scheme-20150819-story.html\n", "Author": "[David Horsey]"}
