{"Content": "[Mayor Eric Garcettis appearance last fall at an auditorium across the street from Los Angeles City Hall drew scant attention. It was a gathering of watershed protection specialists, and hed come with an ardent appeal: Join him the following week at a federal hearing on the L.A. River. The U.S. Army Corps of Engineers was weighing plans to tear apart some of the rivers \"concrete straitjacket,\" as the mayor put it, and restore wetlands along the banks. Garcetti was lobbying hard for the most expensive option, a $1-billion proposal that federal officials were resisting. \"Lets not go halfway on the heart and soul of a great city,\" he told the audience. \"Cancel whatever plans you have. Take your wife or husband out another night.\", The hearing was packed and the mayor went on to press his fight in Washington. Eight months later, the Army Corps  defying expectations  recommended the plan Garcetti wanted. Approval by Congress is still uncertain. But Garcettis campaign for a dramatic rehabilitation of an 11-mile stretch of the river stands as a rare case of the mayor taking a bold political gamble to reshape a broad swath of Los Angeles for future generations. In his first year as mayor, Garcetti has more often taken a low-risk approach to the job, avoiding potentially messy fights over taxes and spending on signature projects. His \"back-to-basics\" agenda  making City Hall more efficient and effective with up-to-date technology  is supposed to result in smoother streets and sidewalks, less hassle getting building permits and quicker 911 response times. Garcetti says hes strategically building a foundation to revitalize the citys economy and improve its quality of life. But his approach also raises the question of whether he is shying from confrontation and playing it too safe. Franklin D. Gilliam Jr. dean of UCLAs Luskin School of Public Affairs, said Garcettis emphasis on internal city operations is \"small ball\" at a time when Los Angeles faces large-scale challenges  substandard schools, high unemployment and an affordable housing shortage. \"Im just looking for a way to knit this all together,\" Gilliam said. \"You have people in large parts of South L.A. East L.A. and other parts, some in the north Valley, who are really up against it. What are they offering them? What are they doing for them?\", During Garcettis tenure on the City Council, two L.A. mayors took big political risks with mixed results. Mayor James K. Hahn replaced an African American police chief, Bernard C. Parks, with William J. Bratton, who was widely viewed as a success. But it undercut Hahns political base among African Americans, and he lost his 2005 campaign for reelection. Mayor Antonio Villaraigosa reaped dividends by pushing for a Westside subway and other transit lines. But he also spent nearly two years fighting to take over the Los Angeles Unified School District, only to see his plan struck down by a judge. Garcetti advisors say modernizing the citys lumbering bureaucracy is no small undertaking, and long overdue. Computer systems are outdated and incompatible, they say, and it takes an average of 432 days to award a contract. It matters, they add, that the city has sharply cut the length of time that callers are placed on hold when they phone 311, the hotline for reporting graffiti, illegal dumping and other nuisances. \"Eric Garcetti has much more ambitious goals for the city, but he wants to put first things first,\" said Rick Cole, the deputy mayor for budget and innovation. \"Those big goals cant be achieved if government isnt effective at achieving results.\", In an interview in his City Hall office, Garcetti said he had \"brought the sensibility of a CEO\" to his job, imposing annual performance reviews on all agency managers. He took credit for firing more than half a dozen department executives. \"It was a big, bold move to interview everybody, and by the end probably a third of them will have gone,\" he said. Garcetti cited steps hes taken to spur the citys economy, particularly his promotion of a summer jobs program for young people from low-income families. But he took a go-slow approach to a core item on his economic agenda: a 15-year phase-out of the citys tax on the gross receipts brought in by businesses  a levy that generates about $450 million annually for the city budget. His first budget assumes the first tax cut of $15 million would not occur until 2016. \"Wed be less than honest if we didnt say we were disappointed that the phase-out will not begin during the coming year,\" said Gary Toebben, president and chief executive of the Los Angeles Area Chamber of Commerce. Garcetti also declined to back a plan to put a sales tax hike on the November ballot to generate $4.5 billion to fix damaged streets and sidewalks, a source of constant citizen gripes and a crucial part of his back-to-basics program. Garcetti said the city should explore other options, such as tapping the states gas tax or fees companies pay for producing greenhouse gases, before asking voters for more money to tackle a decades-long backlog of roadway upkeep. \"It was pretty clear that this year, putting something on the ballot was probably putting the cart before the horse,\" he said. Garcetti has also been cautious about using his clout to influence local elections, diluting the value of his endorsements. In the race to replace L.A. County Supervisor Zev Yaroslavsky, Garcetti waited until less than a week before the June 3 primary to back West Hollywood Councilman John Duran  too late for the candidate to fully capitalize on the mayors support. \"Its just unfortunate that it came six days before the election and not sooner,\" said Duran, who lost. Garcetti said hes more focused on governing than on politics. \"Im not here to be the political mastermind of Southern California,\" he said. \"Im here to turn the city around.\", On public schools, a signature issue for his predecessor, Garcetti has also taken a low-key approach. Villaraigosa failed in his attempt to take control of the L.A. school system, but nonetheless exerted enormous influence over its leadership and direction. Garcetti, by contrast, has assumed the mayors more traditional role as an outsider on public education. So far, he has declined to weigh in on a special election for a South L.A. school board seat. And he issued no public statement on a judges landmark court ruling striking down Californias teacher tenure laws this month on the grounds that they disproportionately saddle poor and minority children with ineffective teachers  a cause championed by Villaraigosa. It was only in an interview with The Times weeks later that Garcetti, whose campaign was backed by teacher unions, called it \"a great decision.\", Garcetti has taken on some risk by challenging the union that represents most Department of Water and Power employees  a group known for pouring resources into its chosen candidates, including Garcettis opponent in last years election, former City Controller Wendy Greuel. And Garcettis high-profile role in calling for the ouster of Clippers owner Donald Sterling over his racially charged remarks won him wide praise. Garcettis focus on city operations hasnt troubled Hector Huezo, a Boyle Heights resident who heads an alliance of 14 neighborhood councils along the Los Angeles River. Huezo said Garcetti was striking the right balance between big-picture issues  such as restoration of the river  and the \"nitty-gritty\" of improving services like graffiti removal. \"It has been safe,\" Huezo said. \"It has been focused on the internal workings of City Hall. But thats what people want to see: change come from within City Hall.\", Twitter: @finneganLAT, Twitter: @DavidZahniser]", "Date": "20140629", "Title": "[Mayor Eric Garcetti took a low-risk approach in his first year]", "Link": "http://www.latimes.com/local/la-me-adv-garcetti-anniversary-20140630-story.html\n", "Author": "[Michael Finnegan, David Zahniser]"}
