{"Content": "[Former Massachusetts Gov. Mitt Romney has scheduled a call with staff members and supporters Friday morning, two weeks after he publicly announced his interest in launching a third presidential campaign. The topic of the call was not specified in an email to his allies other than its description as an \"update call\" but it will occur within the window that Romney had set for deciding whether to run. Romneys interest in the race was disclosed at a private gathering of former donors. His first public comments came Jan. 16, during a gathering of Republican National Committee members on the aircraft carrier Midway in San Diego. He said then that if he ran again, after an unsuccessful bid in 2008 and winning the nomination but losing the general election in 2012, he would change his focus to poverty, income inequality and foreign policy. I believe in the post-Obama era we need to stand for safety, and for opportunity for all people, and we have to stand for helping lift people out of poverty, Romney told hundreds of RNC members. He took after President Obama and likely 2016 Democratic candidate Hillary Rodham Clinton. He also alluded to the 10 years he spent as a Mormon bishop, an experience he rarely discussed in his two earlier campaigns. I am giving some serious consideration for the future, he said. But this I know  we can win in 2016 ... if we communicate a clear vision of where were taking this country. On Wednesday night, Romney spoke at Mississippi State University, where he again criticized the president and Clinton. After Obama made an oblique reference Thursday to Romneys new poverty focus, Romney tweeted out a response: Mr. Obama, wonder why my concern about poverty? The record number of poor in your term, and your record of failure to remedy. Romney ran in 2008 as the relatively moderate governor of Massachusetts, then emphasized his business career and conservative views when he ran in 2012. He was dogged by criticisms that he had flip-flopped, and his new interest in running a third time was greeted with half-hearted resignation by many Republican activists who blamed him for not being able to topple Obama in 2012. On Thursday, a longtime ally in Iowa, strategist David Kochel, signed on to the probable campaign of former Florida Gov. Jeb Bush. seema.mehta@latimes.com, Twitter: @LATSeema, ]", "Date": "20150129", "Title": "[Mitt Romney to update allies Friday about 2016 presidential bid]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-mitt-romney-announcement-20150129-story.html", "Author": "[Seema Mehta]"}