{"Content": "[Donald Trumps visit to the Iowa State Fair was a spectacle. A mob of fans wanted a handshake or a photo  a tableau reminiscent of a Hollywood premiere, albeit with horse manure on a dirt path rather than movie stars on a red carpet. Rob Stutzman, a GOP consultant from Sacramento who happened to be in Des Moines, witnessed the scene and experienced flashbacks to the hordes his client, actor Arnold Schwarzenegger, encountered during his unlikely bid for California governor during the 2003 recall election. \"Its celebrity appeal,\" Stutzman said. The mens decades in the spotlight reveal similarities between what propelled the action star into the governors office in 2003, and the force pushing the business mogul to the top of the polls in the 2016 race for the GOP presidential nomination. (In a fitting bit of symmetry, it was announced Monday that Schwarzenegger would replace Trump on \"Celebrity Apprentice,\" an NBC reality show.), \"Both of them are very skilled at using their celebrity to attract public and media attention,\" said Dan Schnur, director of USCs Jesse M. Unruh Institute of Politics. \"The difference is Schwarzenegger used his celebrity to leverage interest in his policy agenda. Trump, on the other hand, uses outlandish policy statements to leverage interest in himself.\", They are wealthy celebrities, so universally branded that they are known by their first names. Schwarzenegger and Trump have a flair for theatrics that play well on the evening news. Some examples: Schwarzenegger dropped a 3,600-pound wrecking ball on an Oldsmobile Cutlass to protest the tripling of a state car tax. Trump offered children free rides on a helicopter emblazoned with his last name at the Iowa fair. On Tuesday in Los Angeles, he will raise money for a veterans group, using the battleship Iowa as a backdrop. The two are confident, unabashed and self-promotional. \"I knew I was a winner, I knew I was destined for great things,\" Schwarzenegger wrote in a 1977 biography. \"Sorry losers and haters, but my IQ is one of the highest  and you all know it! Please dont feel so stupid or insecure, its not your fault,\" Trump tweeted in 2013. Both tapped a vein of discontent among disaffected voters: Schwarzenegger won over Californians who were angry at the energy crisis that resulted in rolling blackouts, and those with a growing distrust of Sacramento politicians ability to handle the states mounting fiscal problems. Trump has the support of voters frustrated by the status quo in Washington, and afraid that the United States global dominance is fading. Both also displayed an immunity to controversy that would have felled other politicians. Schwarzenegger batted away preelection day stories by the Los Angeles Times that he groped and humiliated woman. Trump has been unscathed by repeated insulting remarks about immigrants, veterans and women. That doesnt mean that the two share identical political backgrounds or approached their campaigns the same way. Trump, who is now espousing traditional conservative views on issues such as abortion, was once a registered Democrat. Schwarzenegger became a Republican upon his arrival in the country in 1968 and remained one while working in Democrat-dominated Hollywood and despite marrying Maria Shriver, a member of the Kennedy family. Still, conservative Republicans were skeptical of Schwarzenegger because of his liberal views on social issues such as abortion. But the recall offered circumstances that gave Schwarzeneggers political aspirations a boost  no primary, a condensed 60-day campaign window, and a weak field of rivals. Focus groups conducted at the start of the race found that voters did not take Schwarzenegger seriously, said Darry Sragow, a veteran consultant who was advising Democrat John Garamendi at the time. But Schwarzenegger grew to be viewed as a strong leader, he said, partly because of how the actor developed as a candidate. Schwarzenegger spent the first half of the campaign doing intense homework about issues such as the states economy, energy problems and political reform opportunities, said Joe Rodota, the campaigns policy director. Policy specialists were flown in to hold discussions with the candidate. \"Somebody in the campaign team called it Schwarzenegger University,\" Rodota said. There is little indication Trump has taken this route. On the campaign trail, he offers broad policy strokes  building a wall on the Mexican border, bombing \"the hell\" out of Iraqi oil fields held by Islamic State  and boasts of his negotiating skills rather than delivering detailed plans. His campaign emphasizes that he does not prepare for the debates. Asked during an interview where he gets his military policy advice, Trump said by watching \"the shows.\" One of the men he later named as a \"go-to\" national security advisor said he had never discussed policy with Trump. GOP primary voters show little sign of minding, with an ABC News/Washington Post poll released Monday showing him leading the field with 33%. \"The hurdle an Arnold Schwarzenegger had to clear or a Donald Trump has to clear is the jump from being a lightning rod for totally disaffected voters to being taken seriously,\" Sragow said, and thats \"one that is not easy to make.\", seema.mehta@latimes.com]", "Date": "20150915", "Title": "[Trump and Schwarzenegger: A political comparison]", "Link": "http://www.latimes.com/nation/la-na-trump-arnold-20150915-story.html\n", "Author": "[Seema Mehta]"}
