{"Content": "[Seemingly every Republican who has held high office in the last two decades is eager to jump into the presidential race. Whether its the new guys, such as Sens. Ted Cruz, Marco Rubio and Rand Paul and Govs. Chris Christie and Scott Walker, or old-timers who havent held office in years, such as Jeb Bush, Mike Huckabee, Robert Ehrlich and George Pataki, Republicans are hearing the presidential bell. Why are they all looking at 2016 longingly?, One of the major reasons is timing. The Republicans are coming off a great 2014 election, and theyre looking at an open presidential seat. Post-World War II, the two political parties have had great difficulty holding on to the presidency for more than two consecutive terms (the Ronald Reagan/George H.W. Bush administrations were the exception). The current potential candidates may believe that this is the perfect time to take a chance. The GOP also has no obvious front-runner. Since the dawn of the primary and caucus system, the Republican Party historically has looked to its second-place finishers in the last open GOP primary when a sitting Republican president is not running for reelection. Reagan, the first President Bush, Bob Dole, John McCain and Mitt Romney all got the nomination after losing in an earlier presidential run. But the second-place finisher in 2012, former Pennsylvania Sen. Rick Santorum, has not established a strong enough footprint in the upcoming presidential race to scare away any serious candidates. Age is a recurrent factor too. Several candidates may feel, because of their age, that this is their last opportunity for the top job. If a Republican wins in 2016, that person would presumably be seeking reelection in 2020. And, as weve repeatedly seen since the 1950s, that presidents vice president would be the most likely candidate in 2024. In the event of a 2016 Republican loss, there would be a whole new field of contenders, pushing the veteran politicians further into the past. Finally, a crucially important reason for the current rush to the stage is the change in how campaigns are financed. Previously, there was a relatively small amount of money available for presidential campaigns, and only those at the head of the field had a chance of getting any part of it. But as weve seen in recent years, money is flowing to serious  and not-so-serious  political candidates of all stripes. Media reports indicate that there was a plan to short-circuit the large list of candidates, with unnamed deep-pocketed donors coalescing early around a front-runner. The idea was that by marshaling their forces, this group would be able to anoint a candidate, and save money and political bloodshed, resulting in a stronger general election nominee. Yet weve seen the exact opposite so far. Why? The effective death of the campaign finance laws has allowed any stray billionaire to wade into the political process. This occurred in 2012, with Newt Gingrich and Santorum making serious efforts in the race thanks to heavy donations from independent backers. At the same time as the rise of the billionaires came social media and technological changes that allow candidates to amass large campaign pots from many small donors and quickly make a name for themselves among key target audiences. For example, Barack Obamas original campaign was bolstered by the growth of social media; Christie made a national name for himself with viral clips on YouTube. The Republican presidential primary is already looking like a greatest hits version of Republican candidates from the 1990s and early 2000s, with a sprinkling of new ones thrown in. But an open presidential seat combined with easy access to money means we shouldnt expect that crowded field of candidates to thin out any time soon. Joshua Spivak is a senior fellow at the Hugh L. Carey Institute for Government Reform at Wagner College in New York. He blogs at http://recallelections.blogspot.com. Follow the Opinion section on Twitter @latimesopinion]", "Date": "20150201", "Title": "[2016's field of Republican dreams]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0202-spivak-gop-contenders-2016-20150202-story.html\n", "Author": "NULL"}
