{"Content": "[Earlier than expected, there is a Biden-Clinton race underway  between Joe Biden and Bill Clinton, that is. In a year when an unpopular President Obama has been forced to scale back his campaigning to only the bluest states, former President Clinton has been the most visible and in-demand Democratic surrogate. Hillary Rodham Clinton has picked up the pace of late too, with her book tour behind her and a 2016 candidacy seemingly ahead. But the vice president quietly has kept up with  if not surpassed  the other Democratic luminaries, a fact that is all the more striking given the extent to which the partys candidates have tried to demonstrate independence from the administration. According to his offices tally, Biden  who has not said whether he would challenge Hillary Clinton for the 2016 Democratic nomination  has done more than 114 events for 66 different candidates, committees and parties. Biden has taken a personal interest in what might be viewed as a thankless endeavor, emerging as a patron saint of the embattled House Democrat. The vice president clearly revels in his time on the campaign trail. To follow Biden along a campaign rope line is to endure an endless number of selfie requests, bear hugs and kisses and close-talking. \"My turn! My turn!\" one giddy woman shouted to Biden as she got in position for a picture. \"Fire away!\" he answered. Biden predicts his party will perform better than expected Tuesday, but even the self-described \"White House optimist\" acknowledged the uphill fight. \"It feels better out there than it does in Washington,\" he said. \"But its still hard breaking through.\", Sunday marked the vice presidents final day on the campaign trail, headlining a pair of get-out-the-vote rallies for candidates locked in nail-biter races: incumbent Miami-area Rep. Joe Garcia and gubernatorial candidate Charlie Crist. Each event targeted a key Democratic constituency the party needs to turn out Tuesday: Latinos and African Americans. And each highlighted the vice presidents predilection for going out of his way to make a connection to his audience. \"Its presumptuous for an Irish Catholic kid to come down and tell you this, but guess what? Your vote matters,\" Biden, introduced as Jose Biden, told the Miami audience. \"The contributions of the Hispanic community are already enormous. But the potential is absolutely immense.\", Later Biden headlined a \"Souls to the Polls\" event at the Mt. Hermon AME church in Fort Lauderdale, where he recalled his early days in politics in similar settings. \"I got started in the AME church. You think Im joking  Im not,\" he said, noting Delaware had the nations eighth-largest African American population. \"I got a simple, basic message for you, and a message from the president of the United States: Hes had your back. Youve got to get his back,\" he said. Even though Biden has traveled to some places the president has avoided, his presence still invites attacks. Republicans pounced, for instance, when Biden went to Iowa to campaign with Senate candidate Bruce Braley two weeks ago. \"Congressman Braley is teaming up with the gaffe-prone vice president to see who else they can offend,\" Iowa GOP spokesman Jahan Wilcox said, referring to some of Braleys own missteps. \"Between their offensive statements and jokes, its clear Iowans cant trust Congressman Braley or Vice President Biden to tackle the tough problems facing our country.\", Biden has done more of his work for Democrats in a behind-the-scenes capacity. As he travels the country on official business, hes also made a point of squeezing in quick grip-and-grin events for local candidates. The tally maintained by his office doesnt include other assistance hes given, particularly for the Democratic Congressional Campaign Committee. Rep. Steve Israel (D-N.Y.), the committees chairman, said from an early stage Biden was helping recruit candidates, and then offering support in any way he could. \"There was no job that he was not interested in accepting,\" Israel said. \"Joe Biden just rolls up his sleeves, marches in and gets granular. Whenever I see him he wants to do a deep-dive into specific districts, candidates, media markets and polls.\", Bill Clinton has held more high-profile public events. A tally of his campaign activities maintained by the former presidents office includes more than three dozen public rallies this year, not including fundraisers. Hes also cut television ads for Democratic candidates and recorded automated phone messages  so-called robocalls  for 30 Democratic hopefuls. \"Every election season I feel like an old racehorse,\" Clinton said at a recent event in Kentucky. \"They come in and give me an extra bale of hay, somebody comes in and brushes my coat, then they drag me out to the track and they slap me on the rear to see if I can get around that track just one more time.\", For both men, the campaign work is primarily about increasing, or at least maintaining, the partys numbers in offices across the country. But there is obviously a potential payoff in 2016, either for Biden or Hillary Clinton. After the \"Souls to the Polls\" rally in Fort Lauderdale, Biden posed for pictures with a mix of local elected officials, volunteers and staff. \"I saw you out there in the audience  you looked like you were paying attention,\" Biden said to one, who quickly asked him about his 2016 plans. \"When am I going to announce? I dont know,\" Biden said. \"If I do, Im coming for you.\", michael.memoli@latimes.com, Twitter: @mikememoli]", "Date": "20141103", "Title": "[Joe Biden emerges as patron saint of the embattled House Democrat]", "Link": "http://www.latimes.com/nation/la-na-biden-20141104-story.html\n", "Author": "[Michael A. Memoli]"}
