{"Content": "[Public support for a more active U.S. foreign policy has grown sharply since last year as Americans see the world becoming more dangerous. Those findings, from a newly released Pew Research Center survey, provide an important backdrop for President Obamas decision-making regarding U.S. military action against Islamic militants in Iraq and Syria and possible steps to counter Russias invasion of Ukraine. The increased support for an active U.S. policy overseas could have a big effect on the race to succeed Obama in 2016, especially among Republicans. Nearly one-third of Americans now say that the U.S. does too little to address global problems. Thats almost as many as say the U.S. is too deeply involved overseas. A Pew poll in November found that those who wanted the United States to do less outnumbered those who wanted a more active policy by 51%-17%. Two-thirds of Americans say the world has grown more dangerous in the last several years, the poll found. Opinion has shifted toward activism across the political spectrum, but the change is most dramatic among conservative Republicans. Among Republicans who say they identify with the tea party, 54% now say the U.S. does too little to help solve world problems, and only 33% say the U.S. does too much. Thats almost a mirror image of opinions among that group last year, when 54% said the U.S. was doing too much and 22% said too little. That shift among conservative Republicans, if it persists, could pose a big challenge to Sen. Rand Paul (R-Ky.), whose advocacy of less overseas involvement by the U.S. forms a central part of his potential presidential campaign. Pauls foreign policy approach, which critics in the party have labeled isolationist, has appealed to many conservatives, but could now be out of sync with a major shift in public attitudes, the poll indicates. For Obama, growing support for a more active foreign policy offer a freer hand to respond militarily to the Islamic State militants who have captured a large swath of territory in northern and western Iraq and in neighboring Syria, if he chooses to do so. At the same time, however, the poll shows that a majority of the public, 54%, believes his foreign policy is not tough enough. Thats roughly the same as last years percentage, but is notably higher than during his re-election campaign in 2012, when 41% took that view. The 54% who said Obama is not tough enough on foreign affairs include a significant share of groups who otherwise support him. Four-in-ten blacks, for example, said Obamas approach was not tough enough. So did 45% of those younger than 30 and about one-third of Democrats. Former Secretary of State Hillary Clinton has recently criticized Obamas approach to some conflicts, suggesting that she would take a tougher line if she were president. The poll indicates that a significant percentage of Democrats are open to that view, although liberal Democrats, who dominate the partys nominating process, were the least likely to share it. Among self-identified liberal Democrats, only one-quarter said Obama was not tough enough, while 66% said his approach was about right. Among Republicans, by contrast, 77% said he was not tough enough and 16% said his approach was about right. Some liberal activists have accused Obama of following too militaristic a foreign policy, with too many lethal drone airstrikes on militant groups, for example, but that view is not widely shared. Only 3% in the survey said Obamas approach was too tough, including 6% of liberal Democrats. Asked what world problems pose a major threat to the U.S. the public continued to mention Islamic extremists most frequently, with both Al Qaeda and Islamic State ranking at the top of the list. Almost two-thirds of Americans said they believe militant Islam will grow in influence in the Mideast over the long term. About half of those surveyed listed tension between Russia and its neighbors as a major threat to the U.S. after Russias growing intervention in neighboring Ukraine. By contrast, concern about Chinas rise as a world power appears to have lessened since last year. More than two-thirds of Democrats list global climate change as a major threat, while only one-quarter of Republicans do so. Most Republicans say they see climate change as not a threat at all (40%) or as a minor threat (32%). About half of those surveyed said they believe the U.S. has a less powerful and important role as a world leader than it did 10 years ago, while about one-third said the U.S. role is about the same as it has been. And 15% said U.S. importance and power has grown in the last decade. The survey by the Pew Research Center for USA Today was conducted Aug. 20-24 among 1,501 adults. The margin of error is +/-2.9 percentage points. For more news on politics and policy, follow @DavidLauter on Twitter.]", "Date": "20140828", "Title": "[Support for U.S. overseas involvement jumps, poll finds]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-foreign-policy-poll-20140828-story.html\n", "Author": "[David Lauter]"}
