{"Content": "[Sen. Lindsey Graham, the South Carolina defense hawk, plans to enter the crowded Republican presidential primary field Monday with a campaign that probably wont deliver him to the White House, but will highlight the partys divide over national security. Graham lacks the big-money backing and name recognition thats likely to be needed to pull away from the partys increasingly unwieldy field. But for him, that may not matter. For the last several years, Graham, a former Air Force colonel and legal officer, has played a central role in a sometimes-bitter battle between the GOPs traditional defense advocates and newly emergent isolationist-leaning libertarians ledby Sen. Rand Paul of Kentucky, who is also seeking the partys presidential nomination. Graham enters the race at a time when Americans, particularly Republicans, are paying closer attention to national security concerns. As they do, Republicans are finding peril on the issue, one which they have dominated for most of the last half-century. Jeb Bush, the former Florida governor, repeatedly stumbled last month over his thoughts on the war in Iraq that his brother, President George W. Bush, ordered. Other Republican hopefulshave given uneven responses about how they would manage the campaign against Islamic State militants who have seized control over large parts of Syria and Iraq. Graham will almost certainly be a constant counterpoint to Paul, who advocates a less interventionist foreign policy. The South Carolina senator did not originate the \"wacko birds\" label for Paul and his allies -- that was coined by Grahams best friend in Congress, Sen. John McCain (R-Ariz.) -- but he might as well have. Last week Graham was caught on camera rolling his eyes as Paul objected to Senate efforts to continue the National Security Agencys once-secret collection of records of Americans telephone calls. Paul returned the favor by releasing a video denouncing the NSA program. It ridiculed both Graham and Sen. Ted Cruz of Texas for their support of NSA surveillance, depicting Graham as trying to read Americans emails while sitting in a 1997-era car. In an interview during the heat of the Senate debate, Paul also accused Graham, McCain and other Republicans who support arming insurgents in Syria of having contributed to the rise of Islamic State, also referred to as ISIS. \"ISIS exists and grew stronger because of the hawks in our party, who gave arms indiscriminately, and most of those arms were snatched up by ISIS,\" he said. Graham said in an email to supporters that his \"presidential announcement will be one of the biggest and most memorable moments of my life.\", A conservative lawmaker who gained prominence among conservatives by leading House impeachment proceedings against PresidentClinton, Graham won a third term in the Senate last fall. The election had been forecast to be a difficult race, but proved to be a rout. As he approaches the militarys mandatory retirement age and eyes the White House, Graham said last week he was retiring from the Air Force after nearly 30 years. He had continued to serve as a reserve officer, at times using his skills as a military lawyer to handle legal affairs in Iraq during breaks from the Senate. A Southern Baptist and conservative on social issues, Graham, who never married, is known as a deal-maker in Congress. In 2013, he led efforts with Democrats to reform immigration laws to allow a path to citizenship for those living illegally in the U.S. Graham, 59, was born in Seneca, S.C. and lived with his family behind their liquor store, restaurant and pool hall on Main Street in Central, S.C. where he plans to announce his campaign. His personal story has helped shape his policymaking. After his parents death, he helped raise his younger sister and has championed the Social Security survivors benefits they relied upon as young people. But it is his military service and alliance with McCain that have come to define much of Grahams work in Washington as the two tried to defend hawkish foreign and defense policies against attack from some in the partys new generation. Now, hell try to bolster those policies on the presidential campaign trail. For the latest from Congress and the 2016 campaign trail, follow @LisaMascaro, 12:56 p.m.: This story has been updated with a new headline. This is story was originally published at 3 a.m.]", "Date": "20150530", "Title": "[Lindsey Graham to enter GOP race with hawkish counterpoint to Rand Paul]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-graham-announcement-20150529-story.html", "Author": "[Lisa Mascaro]"}