{"Content": "[With Californians facing a possible vote next year on whether to legalize the recreational use of marijuana, supporters are scrambling to craft a measure that can win broad public support. So far, three groups have submitted proposed marijuana ballot measures to state election authorities. It will take months to sort out whether any of them  or others not yet proposed  gain final approval for next years ballot. To varying degrees, Colorado, Washington, Oregon and Alaska have already legalized recreational pot. But the scale of legalization in California would be far bigger, and it would affect a vast existing patchwork of marijuana crops and medical dispensaries. A forum Tuesday at UCLA laid out a panoply of challenges the sponsors face in addressing concerns about stoned drivers, pesticides in marijuana crops, the persistence of a black market for the drug and much more. There are a lot of questions that do need to be asked, said Lt. Gov. Gavin Newsom, who was presiding over the first public airing of the issues by a marijuana policy commission that he formed with the American Civil Liberties Union of California. Its not yet clear, Newsom said, whether competing groups of marijuana advocates can unite behind one November 2016 ballot measure that would address public safety concerns adequately enough to survive campaign attacks. At UCLA, one of the main concerns raised by law enforcement authorities was the lack of adequate technology to test drivers for marijuana impairment. With alcohol, they said, a precise gauge of blood-alcohol level corresponds directly to the risk of causing a traffic accident. But there is no accepted standard for measuring how much marijuana impairs driving skills. The science is not there yet with marijuana, said Ventura Police Chief Ken Corney, first vice president of the California Police Chiefs Assn. which opposes pot legalization. Medical marijuana advocate Kristin Nevedal of Americans for Safe Access said states need to take into account that impairment lasts longer after ingesting marijuana in food than it does after smoking it  and either way, traces remain in the body for days or weeks. Paul Gallegos, a former Humboldt County district attorney, raised concerns about environmental damage caused by marijuana growers diverting water from streams, as well as their unregulated use of pesticides and fertilizers that poison wildlife. Although the states multibillion-dollar marijuana industry does immense environmental harm, he said, state oversight could diminish the damage. We need to see this problem as an opportunity to develop a regulatory scheme, Gallegos said. Newsom himself raised concerns about marijuana taxes being set so high that they perpetuate the black market. Harlan Grossman, a former Superior Court judge in Contra Costa County, suggested a solution: tougher penalties for pot growers and dealers who circumvent the states new licensing system. Grossman also suggested state lawmakers, or authors of any marijuana ballot measure, address other questions: Would existing marijuana possession and sale cases be dismissed? Would arrest warrants be recalled? Would penalties from prior convictions still be due? Would old offenses be expunged?, In 2010, Californians rejected a ballot proposal to legalize marijuana, but public opinion has shifted since then. A recent Public Policy Institute of California poll found that 53% of state residents believe pot should be legal. One measure of the momentum for a new statewide vote on marijuana was a $1-million contribution made last week by Weedmaps Media to its election campaign committee, Californians for Sensible Reform. Weedmaps is a website with a guide to marijuana availability around the world. For Newsom, a candidate for governor in 2018, the run-up to another statewide marijuana vote has offered a platform for publicity that can be hard to come by for a lieutenant governor. His commission is planning three more hearings around the state. At UCLA, he said he hoped California doesnt wind up with marijuana stores on every street corner, pot smoke wafting across park playgrounds, and weed-laced gummy bears and jelly beans tempting children. To that end, he said, the panel will try to ensure that a stable legal structure is set up for recreational pot use. Im interested in evidence, Newsom said. Im not an ideologue about this. Twitter: @finneganLAT, 7:05 p.m.: This story has been updated with additional comments from Gavin Newsom and other information. This story was originally published at 5:01 p.m.]", "Date": "20150421", "Title": "[Backers of legal marijuana face challenges in crafting a ballot measure]", "Link": "http://www.latimes.com/local/political/la-me-pc-marijuana-california-election-newsom-20150421-story.html\n", "Author": "[Michael Finnegan]"}
