{"Content": "[Wisconsin Gov. Scott Walker is now officially in the race for the 2016 Republican presidential nomination and many folks in the GOP believe that he has the right combination of electability, experience and conservative appeal to be a major contender. Then, again, he may be justan overrated, pandering weasel. David Horsey / Los Angeles Times, David Horsey / Los Angeles Times, Walker has gone through contortions to change his positions on immigration and ethanol to please conservative voters in Iowa, where he currently holds a strong position in the polls. To appeal to those same voters, he has become a sudden champion of traditional marriage, declaring his support fora constitutional amendment that would allow states to ban same-sex marriages. He has avoided a straight answer about whether he believes in evolution, but has made it veryclear he does not think climate change is anything to worry about. He has also cozied up to the billionaire Koch brothers -- they have cozied up to him too -- gainingtheir blessing and their financial backing by subscribing to their long list of pro-corporate, anti-worker policies. None of this sets him apart from most of the crowded Republican pack. Still, he boasts of three principal attributes that supposedly make him the best choice for his party: Union-bashing, economic genius and voter appeal. Walker gained national attention by taking on public employee unions and scrapping their collective bargaining rights, and then followed up with an assault on private unions. He came away as a victor, but his claim that picking on teachers, firefighters, cops and the working class of Wisconsin has prepared him to face down Islamic State terrorists is more than a little overblown. Walker brags that his implementationof big tax breaks and cuts to state and local services has created a minor economic miracle in Wisconsin. Corporate lobbyists and the business wing of the GOP love him for it, but what he has achieved is less miracle than mediocrity. Here are a few facts about Wisconsins economic situation gleaned fromfactcheck.organd PolitiFact.com:,  In October 2014, during his reelection campaign, Walker declared that his reforms had created 8,400 new private-sector jobs the previous month. According to subsequent annual figures from the Bureau of Labor Statistics, however, it turns out the state lost a net 4,200 jobs in September 2014.  Walker also claimed that Wisconsin ranked in the top four among Midwestern states in private-sector job growth. Its not clear which Midwest he was talking about, but among the 12 states the U.S. Census Bureau counts as Midwest, Wisconsin actually ranked ninth with a 4.3% job-growth rate, well below the national average of 6.6% for the same period. The state is also below average in wage growth and, for much of Walkers time in office, was dead last in wage increases among the Midwestern states.  The state ranks near the bottom in the number of new businesses.  All this trimming of government has not guaranteed a sound state budget. Walker comes up with projections of future surpluses, but shortfalls are just as likely.  The people who are better off are the rich and big corporations who have gotten hefty tax cuts. The biggest losers are public employees, thousands of whom have lost their jobs, and schoolkids who had their funding cut. Finally, Walker claims to be a big vote-getter in a Democrat-leaning state, but his reelection victory in 2014 was not nearly as impressive as the big wins of Republican gubernatorial candidates in Michigan, Illinois, New Mexico, Maine, Massachusetts and Maryland -- all states with bigger percentages of Democrats. Walkers three victories have come in one recall election and two non-presidential-year elections when lower voter turnout generally favors Republicans. To his credit, Walker won three times, despite his attack on unions that should have energized Democrats. On the other hand, the battle with labor got him a lot of attention from conservative super-PACs that dumped money into his campaigns at a level unusual for a state race. That didnt hurt. Walker may not be a completely empty suit, but he may have peaked when he was Milwaukee County executive. So far, the man appears to be a fairlyaverage politician, not an heir to Lincoln or even Reagan.]", "Date": "20150714", "Title": "[Scott Walker presidential? Do not believe the hype]", "Link": "http://www.latimes.com/opinion/topoftheticket/la-na-tt-scott-walker-hype-20150714-story.html\n", "Author": "[David Horsey]"}
