{"Content": "[This week brought something familiar in the long-running investigation of the closure of roads leading to the George Washington Bridge by New Jersey Gov. Chris Christies advisors: more information but little additional clarity about who developed and directed four days of traffic tie-ups. Christies chief of staff, Kevin ODowd, says that as the bridge controversy heated up last year, the governor told him to ask one of ODowds deputies whether she knew anything about the scheme. Absolutely not, Bridget Kelly replied. ODowd said he saw no reason to doubt her  even though there were already allegations that someone in his office had signed off on the closure of Fort Lee, N.J. bridge access roads. I never conducted my own investigation to figure out what went on here, ODowd said during a marathon hearing Monday before the state legislative panel investigating the traffic scheme. I just didnt engage in it. Kelly sent an email just before the closures that read, \"Time for some traffic problems in Fort Lee.\", The leaders of the panel had high hopes for the testimony of ODowd, the highest-ranking Christie administration official to appear so far. But seven hours of questions failed to produce much of a reaction from the imperturbable former federal prosecutor, let alone any new information that would explain the bizarre plot to choke off traffic leading to the bridge for four days last September. ODowd, like other witnesses, said he knew nothing of the scheme before it happened  and didnt ask many questions about it afterward. William Pat Schuber, one of Christies appointees on the authority that operates the bridge, testified recently that he didnt either. I saw this very quickly becoming a political football, and I just didnt want to be involved in it, said Schuber, who professed a lack of memory about many of the details. The investigations are expected to extend for months and still pose a threat to any ambitions Christie has to run for president in 2016. Butwith polls showing that even New Jersey voters are paying less attention to the scandal, Christie has stepped up his national appearances, trying to regain momentum as he raises money for fellow Republicans around the country. He is scheduled to appear on NBCs \"Tonight Show\" on Thursday. Democrats on the committee have been sharp in pointing out what state Sen. Loretta Weinberg, the co-chair, has called a curious lack of curiosity. But with progress slowing, and even some Democrats grumbling about pulling the plug, the leaders of the investigation have been forced on the defensive. Its not the time to take the exit ramp. This is the time to keep plowing forward, Assemblyman John Wisniewski, the other co-chair, said in an op-ed in the Record newspaper. So far, just two people have been linked to the bridge plan: Kelly and her friend David Wildstein, the Christie appointee to the Port Authority who has insisted, at least in public, that he was conducting a traffic study. But that story took a beating after emails surfaced showing the two chortling over the chance to create headaches for the mayor of Fort Lee, the town on the New Jersey side of the bridge, who didnt endorse Christies reelection. Kelly and Wildstein arent talking, especially not with federal prosecutors conducting their own investigation. And the committee has had to put off its questions for the executive director of the Port Authority, Patrick J. Foye, at the request of federal prosecutors. The hearings are taking a hiatus until the state passes a budget this summer. In his rush to leave the controversy behind, Christie could find some encouragement in a recent poll that found his approval ratings in New Jersey have stabilized at about 44%  a steep drop from the pre-bridge levels but a fairly typical number for second-term governors, said Krista Jenkins, a political science professor at Fairleigh Dickinson University who conducted the poll. But she said the survey also found that Christie had lost a lot of support among independents and Democrats, weakening his claim as a candidate who could tempt voters to cross party lines. As for the bridge story, Jenkins said the poll showed voters might be ready to move on. Just 22% of the states voters say theyre still paying close attention. But she said that would quickly change if the investigations produced new revelations: 58% of voters still doubt Christies assertion that he didnt know about the lane closures  up 5 percentage points from January. Were sort of teetering right now because key witnesses arent willing to disclose anything, she said. Any kind of speculation on how its all going to play out is premature. Follow @jtanfani for national news.]", "Date": "20140610", "Title": "[Little clarity from Chris Christie team in New Jersey bridge inquiry ]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-chris-christie-george-washington-bridge-investigations-20140610-story.html\n", "Author": "[Joseph Tanfani]"}
