{"Content": "[Riding a surge of voter discontent, Republicans seized control of the Senate on Tuesday, giving the GOP full command of Congress and promising a contentious final two years of the Obama administration. After months of voter surveys suggested a close battle for the Senate, the GOP romped into the majority, gaining seven seats  one more than needed  even before the polls closed in Alaska, the last of the battleground states. If not a wave, the results suggested at least a strong Republican swell. With the exception of Pennsylvania, the party protected its threatened governors, batted away Senate challenges in Georgia and Kansas, and put the scare in Sen. Mark R. Warner of Virginia, who had been expected to coast to reelection but instead clung to a narrow lead. The party also bolstered its House majority and elected governors in the blue states of Maryland, Massachusetts and Illinois. As his partys defeats rolled in, President Obama invited congressional leaders from both parties to the White House on Friday afternoon. The incoming Senate majority leader, Kentuckys Mitch McConnell, sounded a conciliatory note in Louisville when he addressed supporters after his reelection victory Tuesday night. Tomorrow the papers will say I won this race. But the truth is, tonight we begin another one  one thats far more important than mine  and thats to turn this country around, McConnell told the crowd. I dont expect the president to wake up tomorrow and view the world any differently than he does now. He knows I wont either, McConnell said. But we do have an obligation to work together on the issues where we can agree. ... Just because we have a two-party system doesnt mean we have to be in perpetual conflict. The current Senate leader, Nevada Democrat Harry Reid, issued his own pledge of cooperation as he congratulated McConnell, a longtime adversary. The message from voters is clear, Reid said. They want us to work together. I look forward to working with Sen. McConnell to get things done for the middle class. McConnell also received a congratulatory phone call from Vice President Joe Biden, his former Senate colleague and a negotiating partner in recent years. With a few exceptions, most of election night was a coast-to-coast march of Republican victories, including a handful of breakthroughs for a party that has been tarred by Democrats as anti-woman. Voters in Iowa and West Virginia elected their first female senators, Joni Ernst and Shelley Moore Capito, and in Utah voters made incoming Rep. Mia Love the first black Republican woman ever elected to Congress. Republicans notched their first victories shortly after the polls closed in West Virginia. In Arkansas, Democratic Sen. Mark Pryor was quickly dispatched by GOP Rep. Tom Cotton. At 37, the Iraq combat veteran and Harvard Law School graduate will become the youngest member of the Senate. In Colorado, GOP Rep. Cory Gardner handily defeated first-term Sen. Mark Udall, signaling the partys vast improvement in the ground game that Democrats had perfected in Obamas two presidential victories. In two open-seat races, former Republican Gov. Mike Rounds was elected in South Dakota and Rep. Steve Daines won in Montana, easy pickups that Democrats had all but ceded by election day. The last incumbent to fall Tuesday night, giving Republicans Senate control, was Democrat Kay Hagan of North Carolina, who narrowly lost to state House Speaker Thom Tillis. In something of an anticlimax, Louisiana Rep. Bill Cassidy, a Republican, forced three-term Sen. Mary L. Landrieu into a Dec. 6 runoff. On an otherwise cheerless night, Democrats were buoyed by a victory in New Hampshire, where Sen. Jeanne Shaheen staved off a strong bid by Republican Scott Brown, a former Massachusetts senator who moved from the neighboring state expressly to challenge Shaheen. In contrast to 2010, when the GOP squandered a chance at retaking the Senate by nominating several gaffe-prone candidates seen as too extreme, this years crop for the most part managed to avoid fatal misstatements and pigeonholing on the far right  even if several were just as conservative as those earlier contestants. In House races across the country, the only question Tuesday was whether Republicans would pad their substantial majority. Most of the 435 contests on the ballot were devoid of competition, thanks to the artful drawing of congressional boundaries that protected most incumbents. There were exceptions, however, including contests in the Democratic strongholds of California and a race in Las Vegas, where the deteriorating national climate put the partys incumbents at serious risk. In West Virginia, Democratic Rep. Nick J. Rahall II lost his bid for a 20th term. In Georgia, Democratic Rep. John Barrow, a five-term conservative who had survived tougher cycles, was also defeated. Democrats picked up a key seat in the Florida panhandle when Gwen Graham, daughter of former Sen. Bob Graham, beat conservative Republican Rep. Steve Southerland II. But it was still a tough night overall for Democrats, as Rep. Joe Garcia lost in Florida and two Illinois Democrats, Bill Enyart and Brad Schneider, were also ousted by the GOP. In gubernatorial races, Texas Republican Greg Abbott easily defeated Wendy Davis, who became an overnight Democratic sensation after filibustering antiabortion legislation. Wisconsins GOP Gov. Scott Walker survived a tough challenge, positioning him for an expected 2016 run for president. Republican Kansas Gov. Sam Brownback also prevailed after a strong challenge. After a long night of counting, Floridas Republican Gov. Rick Scott edged past Republican-turned-independent-turned-Democrat Charlie Crist, and wealthy businessman Bruce Rauner toppled Democratic Illinois Gov. Pat Quinn, giving the state its first Republican governor in a decade. The voters who cast ballots Tuesday were a distinctly downbeat lot. Fewer than a third believed the country was on the right track. Fewer than half approved of the presidents job performance and fewer than 1 in 5 approved of the job Congress was doing, according to exit poll interviews. They cited the economy as their top concern and, despite months of favorable statistics, only 35% said they believed things were getting better. The unhappy mood matched  and perhaps partly grew out of  the ceaselessly negative tone of the campaign. Candidates and their super PAC supporters, freed by the courts from spending limits, poured nearly $4 billion into the election  a record  and flooded voters with more than 2 million television advertisements, most of them negative. In some bombarded states, commercial breaks were filled in the final campaign days with nothing but back-to-back political advertisements. But all of that did little to change the fundamentals this election season, which from the start tilted strongly in Republicans favor. The party out of power in the White House almost invariably wins congressional seats in a midterm election, when the contest becomes a referendum on the president and his policies. After nearly six tumultuous years  marked by recession, scandal, foreign crises, unceasing political warfare over healthcare and a string of disasters, natural and man-made  it was Obama whose unpopularity weighed heavily on fellow Democrats, to a point he was scarcely seen on the campaign trail. Also benefiting the GOP were the electoral math and the political map. Democrats started the year defending far more Senate seats than Republicans, and the hardest-fought contests were in states that Obama lost in 2012, several by double digits. In 2016, the two parties will find themselves on opposite footing. Of 34 Senate seats on the ballot, Republicans will be defending 24 and Democrats 10. mark.barabak@latimes.com, maeve.reston@latimes.com, Times staff writers Lisa Mascaro in Washington; Michael A. Memoli in Louisville, Ky.; Evan Halper in New Orleans; Kurtis Lee in Denver; Kathleen Hennessey in Topeka, Kan.; Maria L. La Ganga in Honolulu; Molly Hennessy-Fiske in Houston; John M. Glionna in Las Vegas; Joseph Tanfani in Charlotte, N.C.; and Michael Muskal in Los Angeles contributed to this report. 11:27 p.m.: This story has been updated throughout. 9:43 p. m.: This post was updated with results from the Kansas, Maryland and Illinois races for governor. 8:48 p.m.: This post was updated with results from North Carolina, 8:12 p.m.: This post was updated with results from Florida, Wisconsin and Colorado. 6:30 p.m.:This post was updated with additional results. 4:29 p.m.: This post was updated with results of the Arkansas, West Virginia, South Dakota Senate races. This story was originally posted at 4:16 p.m.]", "Date": "20141104", "Title": "[Republicans seize control of U.S. Senate]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-election-day-nation-20141104-story.html\n", "Author": "[Maeve Reston, Mark Z. Barabak]"}
