{"Content": "[The crisis in Iraq and broader unrest in the Middle East have exposed a growing rift among Republicans on foreign policy, as skeptics of military intervention have more openly challenged the partys hawkish posture in the post-Sept. 11 era. Unfolding events in the region could help shape the fight for the Republican presidential nomination in 2016 just as it did for Democrats in 2008, when Barack Obama capitalized on liberals distaste for the war in Iraq as he wrested the nomination from front-runner Hillary Rodham Clinton. Even as Americans take an increasingly dim view of President Obamas handling of foreign policy, however, they have generally supported his positions on the Middle East. Their disapproval of his leadership style rather than his policies has further complicated Republican divisions. Few Republicans in Congress have been willing to outline specific approaches to confront challenges in Iraq and elsewhere. House Speaker John A. Boehner (R-Ohio), who has accused the president of \"taking a nap\" as Islamic State forces gained strength in Syria and Iraq, has nonetheless resisted questions about specific steps the U.S. should take going forward. Those who have spoken out dont always agree, and their debate joins similar internal Republican spats over immigration reform and spending as issues likely to vex the party heading into 2016. Sen. Rand Paul of Kentucky, a likely presidential candidate, is a leading voice challenging hawkish colleagues who see recent developments in Iraq as a result of the Obama administrations efforts to wind down overseas conflicts. In a recent \"Meet the Press\" interview, he said some of the blame lay with his fellow Republicans who supported the U.S. wars during George W. Bushs tenure. \"Whats going on now I dont blame on President Obama,\" he said. \"Has he really got the solution? Maybe there is no solution. But I do blame the Iraq war on the chaos that is in the Middle East. I also blame those who are for the Iraq war for emboldening Iran.\", Pauls views put him in direct opposition with lawmakers such as Sens. John McCain (R-Ariz.) and Lindsey Graham (R-S.C.), who had consistently advocated that the U.S. maintain a military presence in Iraq, and now say their warnings have been proven correct. \"I predicted this fully and completely and did it time after time after time,\" McCain said last month. Though McCain has not called for sending in new ground forces, he has been one of the few in his party to publicly call for a more forceful military role, including arming Syrian rebels and conducting airstrikes in Iraq. He says many Republicans support his philosophy. \"I talk with them constantly; they understand what Sen. Graham and I are pushing,\" he said, while acknowledging that Paul is a notable exception. \"Most of them that I can see agree.\", McCain was a forceful proponent of the U.S. military \"surge\" in Iraq as he ran for the 2008 Republican presidential nomination. But few potential 2016 hopefuls have gone beyond making broad statements about the importance of projecting strength in the face of terrorist threats. \"Some of the presidential contenders, this is their moment,\" said Rep. Adam Kinzinger (R-Ill.), a major in the Air National Guard who flew missions in Iraq and Afghanistan and supports airstrikes against Islamic State forces, formerly known as the Islamic State of Iraq and Syria, or ISIS. \"Im not expecting everybody to take a hard position because some people, its just not in their wheelhouse. But I think that the people that are putting themselves up to lead the free world really need to take a position either way. Stand on it.\", The latest NBC News/Wall Street Journal poll showed that Americans view of Obama on foreign policy was at an all-time low, with just 37% approving. Among respondents who said the Obama administrations overall performance had worsened in the last year, foreign policy and the Bowe Bergdahl/Taliban prisoner exchange were among the leading reasons cited. But Republicans may find it hard to take advantage of Obamas woes without a unified foreign policy approach of their own. \"You havent seen a rallying of the public to the Republican alternative on foreign policy because its not obvious what the Republican alternative is,\" said Christopher Preble, a defense policy analyst for the Cato Institute. At an event last year where he offered his most extensive comments on foreign policy since becoming a senator, Texas Republican Ted Cruz was asked where he fit on the spectrum of Republican views on foreign policy, with Paul at one end and McCain at the other. \"I consider myself somewhere in between those two poles,\" he said. Republican Sen. Marco Rubio of Florida, another potential presidential candidate in 2016, has aligned with more hawkish elements of his party. His speech this year at the Conservative Political Action Conference, a major gathering of party activists, called for strong American engagement in the face of threats posed by totalitarian states such as North Korea, China and Russia. \"We do not have the luxury of seeing the world the way we hope it would be. We have to see the world the way it is. And we must address these issues before they grow unmanageable,\" he said. Rubio last week called Obamas decision to send 300 advisors to Iraq \"a good first step,\" but said U.S. involvement should ultimately include airstrikes targeting Islamic State leaders and supply lines used to transfer weapons. He also called for arming moderate Syrian rebels and further \"counter-terrorism measures\" in Syria as part of a broader strategy to promote regional stability. The potential Republican fault line over Iraq has lured former Vice President Dick Cheney, one of the architects of the most recent war there, to take a more prominent public role in trying to shape the foreign policy debate in favor of a more muscular approach. In a recent Wall Street Journal op-ed that mostly focused on Obama, he and daughter Liz Cheney argued that \"U.S. withdrawal from the world is disastrous and puts our own security at risk.\", In response to Pauls public criticism over Cheneys role in Iraq, Cheney fired back by telling ABC News that Paul was \"basically an isolationist.... That didnt work in the 1930s. It sure as heck wont work in the aftermath of 9/11, when 19 guys armed with airline tickets and box cutters came all the way from Afghanistan and killed 3,000 of our citizens.\", Steve Schmidt, a Republican strategist who worked for Cheney in the White House, said there was space for him because no potential Republican candidate had thus far outlined a comprehensive foreign policy strategy. \"The political genius of Dick Cheney has always been as a provocateur,\" he said. \"Hes going to play an enormous role in framing the debate in 2016.\", Republicans running in 2016 would be wise to develop a clear vision, he said. \"I think national security issues are underappreciated in general in the context of how important they are and how determinative they can be in a Republican nominating contest,\" Schmidt said. \"[The Middle East] is a caldron that is not on a trajectory to simmer down. So it is far more likely at this point that were going to see a world-on-fire scenario in a way that makes foreign policy a top-of-mind issue for voters.\", michael.memoli@latimes.com, Twitter: @mikememoli]", "Date": "20140706", "Title": "[Republicans can't seem to agree on Iraq and Middle East strategies]", "Link": "http://www.latimes.com/nation/la-na-gop-iraq-20140707-story.html\n", "Author": "[Michael A. Memoli]"}
