{"Content": "[Unless a surprise GOP candidate emerges, the U.S. Senate race in California will mark the third straight election with the partys top-of-the-ticket state candidate given virtually no chance of victory, even by fellow Republicans. The dearth of candidates able to raise enough money to fuel a competitive bid is a reminder of how far the party has fallen in the state that gave rise to Presidents Ronald Reagan and Richard Nixon. I would love to say a Republican has a really decent chance, said GOP strategist Beth Miller. But right now, given what the political landscape looks like in California, it will be an uphill battle for any Republican. The diminished prospects for GOP candidates are not new  former Gov. Arnold Schwarzenegger warned Republican leaders in 2007 that their party was dying at the box office. The state has grown increasingly liberal in recent years as it has grown more diverse. And a fast-growing segment of the electorate  Latinos  was alienated by GOP backing of Proposition 187, the 1994 ballot measure that would have denied taxpayer-funded services to people in the country illegally but was ultimately gutted by the courts. Today, the partys problem is acute, said Adam Mendelsohn, a former GOP political strategist and advisor to Schwarzenegger. Before, it was just a refusal to acknowledge losing voters, Mendelsohn said. Now its a broad understanding of losing voters and people not feeling motivated enough to run for office. Democratic Atty. Gen. Kamala Harris announced her candidacy within days of Sen. Barbara Boxers announcement that she would not seek reelection in 2016 and has been busy raising money and securing endorsements. Former Los Angeles Mayor Antonio Villaraigosa and a handful of the partys members of Congress are weighing bids. The Republicans have been most notable for those sitting the race out. They include Rep. Darrell Issa and major donor Charles Munger Jr. who could both easily fund a campaign themselves, and Kevin Faulconer, mayor of San Diego, the largest city in the nation led by a Republican. There appears to be little or no interest by the top GOP candidates in last years election, all of whom lost. Gubernatorial candidate Neel Kashkari and Pete Peterson, who ran for secretary of state, confirmed Friday that they are not running for the Senate seat. Fresno Mayor Ashley Swearengin, who ran for state controller in November, is more likely to run for an executive position in 2018, according to adviser Tim Clark. Former Assemblyman Tim Donnelly, who unsuccessfully ran in the gubernatorial primary last year, said Friday that he hadnt ruled out a Senate bid and was enjoying watching the field emerge. The Republicans who have said publicly that they are considering a run are little known and, like many others, would probably struggle to raise money.Assemblyman Rocky Chavez excites some in the GOP because hes a Latino Republican with a legislative track record. He was elected to the state Legislature in 2012 and previously served seven years on the Oceanside City Council. Chavez was in Washington, D.C. on Friday, meeting with national GOP officials about a potential bid. Two former chairmen of the state GOP, Duf Sundheim and Tom Del Beccaro, are also considering running. Sundheim said he had been talking to voters, who want to have a competitive election. He said he was encouraged by the response from both voters and donors but will run only if he believes he can raise enough money and see a path to victory. I wouldnt go if I didnt think I had a shot of winning, Sundheim said. Del Beccaro said he expects to make his decision within a month, and if he runs it will be because he believes it is critical for Republicans to have a credible candidate in the contest. Everyone is clear-eyed about the fact that it would be a tough, uphill climb, he said. Del Beccaro also pointed to the still relatively new top two primary system, in which the top two vote getters advance to the general election regardless of party affiliation. California favors Democratic candidates statewide. But if enough Democrats run, it is mathematically possible  though unlikely  that none would garner enough votes, and two Republicans could end up on the general-election ballot. Attempts to reach Chavez were unsuccessful. Democrats already have a steep advantage over Republicans in voter registration in California  43% to 28%. That edge could be magnified in 2016 because the ballot will feature a presidential contest, which typically attracts more young and minority voters who tend toward the Democratic Party. Republicans interested in higher office would have to wait only two years until 2018  when Sen. Dianne Feinstein is up for reelection and Gov. Jerry Brown is termed out  for a more favorable climate, said GOP strategist Rob Stutzman. The 2016 Senate contest is a tough pitch to [Republican] donors in California, Stutzman said. Donors are under a lot of pressure to contribute to Senate races elsewhere to maintain the majority and, of course, to the presidential nominee. seema.mehta@latimes.com, Twitter: @LATSeema]", "Date": "20150208", "Title": "[In California's U.S. Senate race, GOP again sees only slim chance ]", "Link": "http://www.latimes.com/local/politics/la-me-pol-senate-republicans-20150209-story.html", "Author": "[Seema Mehta]"}