{"Content": "[Ted Cruz may never be president of the United States. The Republican Texas senator may not seek the White House, although he sure seems interested. His undiluted tea party conservatism may prove too strong a brew for voters, although it has certainly made him popular with the GOP base. But one thing that wont stop Cruz from someday sitting in the Oval Office is his dual Canadian citizenship. On Tuesday, the Alberta-born lawmaker informed the Dallas Morning News that he had formally renounced his ties to the United States northern neighbor. Hes pleased to receive the notification and glad to have this process finalized, spokeswoman Catherine Frazier told the newspaper, which broke the story of Cruzs dual citizenship in August. Although born in Canada on Dec. 22, 1970, Cruz instantly became a U.S. citizen because his mother was American. At the same time, under Canadian law, he automatically became a citizen of that country as well. Cruz said he was unaware of his dual citizenship until informed by the newspaper and vowed to immediately take steps to change his status. Nothing against Canada, but Im an American by birth and as a U.S. senator, I believe I should be only an American, he said. Cruzs Canadian citizenship would not necessarily have been a legal impediment to a presidential bid, but it was a potential political liability. Opponents dubbed him Canadian Ted and some questioned his eligibility to serve as president, given the constitutional requirement the chief executive be a natural-born citizen. Cruzs renunciation of his Canadian citizenship became official on May 14; word arrived by mail at the senators Houston home Tuesday. Some will doubtless continue to challenge his legal standing if he seeks the presidency in 2016, as seems likely. Many critics still question President Obamas eligibility to serve, despite irrefutable proof he was born in Hawaii and not Kenya, as some of the conspiracy-minded suggest. Twitter: @markzbarabak]", "Date": "20140611", "Title": "[Texas Sen. Ted Cruz formally renounces Canadian citizenship]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-texas-ted-cruz-renounces-canadian-citizenship-20140611-story.html\n", "Author": "NULL"}
