{"Content": "[The sudden death of a candidate lagging in the polls and his replacement by a surging environmentalist has transformed Brazils presidential race and threatens President Dilma Rousseffs hope for a second term. Since a plane crash last month took the life of Eduardo Campos, his successor on the Socialist Party ticket, Marina Silva, has captured support from a diverse mix of voters. Some respond to her call to reject two-party politics as usual and to move environmental concerns to the fore. More conservative voters identify with her evangelical Christian faith or just want to eject the ruling Workers Party after 12 years in power. Whereas Campos was running third in polls, the latest surveys indicate that in the Oct. 5 election, Silva would take Rousseff to a second round and defeat her in the runoff that would come three weeks later. The candidates from the traditional parties will spend the next few weeks attacking Silva and her sometimes murky policies and plans. On Monday, during her first debate as the perceived front-runner, it was clear that the serene, soft-spoken senator and former environmental minister had moved into the cross hairs of Rousseff and Aecio Neves, the candidate for the center-right Social Democracy Party of Brazil, or PSDB. Silva fired back. \"You had promised that Brazil would keep growing. What went wrong?\" she asked Rousseff, referring to an economy that has slowed markedly since the president took over from Luiz Inacio Lula da Silva in 2011 and that is expected to perform poorly this year because of the costs associated with the recent World Cup soccer tournament. Though relatively well-known in Brazilian politics, Silva until recently appeared unlikely to participate in this years presidential election. The Socialist Party is the fourth she has been associated with in six years, and her involvement came at the last minute, after she was unable to found a party promoting sustainability. Her agreement to be Campos running mate was widely seen as a marriage of convenience that she would quickly abandon if he lost. Now, as the Socialists presidential candidate, she has gained support, though it also puts her at the head of a diverse and sometimes unlikely coalition. In Brazils complex political landscape, Silvas government might be more progressive than the center-left Workers Party, or PT, on some issues, such as the environment, and more conservative on others, such as social issues and gay rights, analysts say. She probably would be more market-friendly than Rousseff. \"Marina Silva has entered the race attacking the political system itself, even if she has often been part of it, and that has led to a quick upward trajectory for her in the polls,\" said Francisco Fonseca, a political scientist at the Getulio Vargas Foundation university in Sao Paulo. \"This kind of anti-political discourse has worked well here recently, especially with the young, who are unhappy with politics in general, and she is a natural fit for those who want to reject the PT or PSDB. \"But her candidacy may be vulnerable in that it is marked by contradiction,\" he said. \"Shes progressive on the environment but also socially conservative. And her own party is not the one she would have chosen and has programs very different than those she defended independently.\", After the highly popular Lula took office more just over a decade ago, Brazil powered forward economically, 40 million people rose from poverty and the country won the right to host the 2014 World Cup and 2016 Olympics. Rousseff easily won the 2010 election as Lulas hand-picked successor and enjoyed high approval ratings during her first year in office. But the economy slowed, and her popularity dropped after more than 1 million Brazilians took to the streets last year to protest inadequate public services and eventually the high cost of preparations for the World Cup. The soccer tournament, held in June and July, went more smoothly than expected. However, much of the economy shut down to accommodate the event, which will take its toll on GDP growth this year. Silva, in opposing two established parties, is seen as the candidate best placed to channel the energy that led some protesters into the streets last year, analysts say. Even if she does not win, they say, her recent surge has already transformed the landscape of politics in Latin Americas largest country. \"This is now the first election in the last 20 years that will be able to break the division of the country between the Workers Party and PSDB,\" said Joao Augusto de Castro Neves, a political analyst at Eurasia Group in Washington. \"Compared to them, Marina is more of a wild card, for better or worse.\", Supporters of Rousseff say that despite the claims that Silva is a progressive outsider, she has recently made questionable alliances with profitable banks, would have to form a governing coalition with the very parties she criticizes and may be beholden to the conservative views of the powerful evangelical churches that support her. In what was widely seen as the first slip-up of Silvas campaign, her platform was quickly revised to soften its support for gay marriage after the position was attacked by an evangelical pastor on Twitter. \"Her support for marriage equality didnt last more than four tweets,\" quipped Luciana Genro of the left-wing Socialism and Freedom Party during Mondays debate. Silvas camp said the platform revision stemmed from a publishing error. Silva served as a minister under Lula while a member of the Workers Party until 2008. She came in third as Green Party candidate for president in 2010. Silvas inspiring personal story of rising from poverty could help her take on the political establishment in what is still one of the worlds most economically unequal countries. If she wins, goes a quote from journalist and friend Altino Machado, she would be \"the first green president in history, Brazils first black president, and Brazils first president from the Amazon.\", Bevins is a special correspondent.]", "Date": "20140905", "Title": "[Rise of candidate Marina Silva transforms Brazil's presidential race]", "Link": "http://www.latimes.com/world/brazil/la-fg-ff-brazil-election-20140905-story.html\n", "Author": "NULL"}
