{"Content": "[Even in todays Republican Party theres such a thing as being too much of a long shot. On Thursday, John Bolton, the former ambassador to the U.N. under George W. Bush, who had flirted with entering the race for the GOP presidential nomination, announced he would not do so. I believe I can make the strongest contribution to our future by continuing as a clear and consistent advocate for a strong Reagan foreign policy that values peace through strength, he said. Even so, the Republican candidate tally seems likely to pass a dozen and could easily reach 20, leaving party officials and TV network executives to grapple with a question certain to bruise big egos: Who will be invited to Cleveland in early August for the first GOP primary debate?, For lower-tier candidates -- with little name identificationor fund-raising prowess -- an opportunityto tussle on a national stage with top-tier contenders like Sens. Rand Paul of Kentucky and Marco Rubio of Florida could offer a jump-startto a campaign. For those in the top tier, frequent debates in which theyre forced to share the stage with lesser-known figures provide many opportunities for trouble and little benefit. The Republican National Committee plans to sanction between nine and 12 debates this cycle, which will be hosted by various television networks. After the August debate, the next is planned for the Ronald Reagan Presidential Library near Simi Valley in September. Party officials and the TV hosts want some objective factors they can use to decide which candidates to invite. The list could include polling, fund-raising and the size of on-the-ground staffing in early voting states, among other factors. But right now, those metrics seem likely leave out some candidates whom many Republican strategists would like to showcase to a television audience, including Carly Fiorina, the lone woman in the GOP primary field. Ben Carson, who is the only African American, might also not make the cut. \"Its going to be a mess, no doubt,\" said Terry Casey, an Ohio Republican strategist, a former adviser to Gov. John Kasich, another possible 2016 contender. Having 15 to 20 candidateson stagefor a 90 minute debate is not productive, said Casey, who is not advising Kasich. \"You want a mix of good TV and actualdebate,\" Casey said. \"You dontget that with that many candidates,\" he added. \"Can a camera even captureall of them on stage?\", On the other hand, a big field of interesting candidates is in many ways a problem you want to have as a party, said Stuart Stevens, a senior advisor in 2012 to Mitt Romney. \"With a field so broad and of different viewpoints, it makes us a party of more ideas, Stevens said. A request for comment from the Republican National Committee and Fox News -- which will host the Aug. 6 debate in Cleveland -- was not immediately returned. Party leaders are expected to discuss debate criteria at their spring meeting in Arizona over the weekend. Unlike 2012, the GOP rules this cycle bar participants in the sanctioned debates from appearing in any non-sanctioned forums. During the last presidential cycle the party sanctioned nearly 20 debates. Party officials felt the frequent debates dragged along and battered Romney, the partys eventual nominee. An average of polling compiled by Real Clear Politicsshows no clear front-runnerat the moment. Former Florida Gov. Jeb Bush and Wisconsin Gov. Scott Walker -- who are both expected to formally announce their candidacies next month -- are joined in the top tier by Rubio and Paul, based on early polling. In those surveys, Fiorina, a former CEO of Hewlett-Packard, is polling near 1%. Other potential candidates who would enter in the lower-tier of the field include former Texas Gov. Rick Perry, former Pennsylvania Sen. Rick Santorum and Govs. Chris Christie of New Jersey and Bobby Jindal of Louisiana. Earlier this year, when the RNC announcedthe sanctioned debates, chairman Reince Priebusheralded the sessions as an opportunityfor the candidates \"to bring their ideas and vision to Americans in a timely and efficient way.\", \"It is exciting that Republicans will have such a large bench of candidates to choose from, and the sanctioned debate processensures voters will have a chance to gain a chance to hear from them,\" Priebus said at the time. But, for now, which candidates will get that chance remains to be determined. kurtis.lee@latimes.com, Follow @kurtisaleeon Twitter]", "Date": "20150514", "Title": "[Who gets a seat at GOP debates? 'It's going to be mess']", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-na-pn-bolton-presidential-run-20150514-story.html\n", "Author": "[Kurtis Lee]"}
