{"Content": "[Democrat Daniel T. Parra, a councilman in the Central Valley town of Fowler since 2008, announced Monday he will challenge Rep. David Valadao (R-Hanford) in next years congressional elections. Parra, a Central Valley native and Air Force veteran, promised to be \"a bold voice\" for families of the 21st District and said Valadao has \"consistently put politics and his own interests first.\", Within hours of his announcement, the chairman of the Fresno County Democratic Central Committee endorsed Parra. Michael Evans, in a statement released by the Parra campaign, cited Parras \"progressive values\" and his \"pro-jobs, pro-immigration reform\" views. Despite a 47%-31% registration edge over Republicans, Democrats were unable to take out dairy farmer Valadao, then a freshman congressman, last year. The party recruited rising political star Amanda Renteria, raised in the Central Valley, to challenge Valadao but spent little to help her and she lost 58%-42% in November. A GOP campaign spokesman dismissed Parra as a \"third tier candidate\" in a blog post for the National Republican Congressional Committee. Spokesman Zach Hunter said Democrats were \"effectively giving up\" on winning the district and cited Parras 24-point loss in his race for county supervisor last year. But Democrats believe their chances for winning the district are better in 2016, a presidential election year, when the partys voters typically turn out in much higher numbers than in a so-called \"off year\" contest. Parra has been a computer systems analyst for Northrop Grumman for more than 20 years and holds a bachelors degree in business administration and a masters degree in public administration, according to the candidacy announcement statement released by his campaign. Follow @jeanmerl for the latest in Southern California politics news.]", "Date": "20150406", "Title": "[Central Valley city councilman to take on Rep. Valadao in 2016 elections]", "Link": "http://www.latimes.com/local/political/la-me-pc-valadao-challenger-20150406-story.html\n", "Author": "[Jean Merl]"}
