{"Content": "[As Congress pursues its latest investigation of Hillary Rodham Clintons missing emails and the role they may have played in the security lapses in the terrorist attack in Benghazi, Libya, not every Republican is delighted by the prospect of dragging her to Capitol Hill for a skewering. Some see danger. The Clintons have proved adept over the years at turning allegations of misdeeds in their favor. Voter uneasiness with their conduct has, in the past, yielded to voter distaste for the zealousness with which Republicans exploited it. There are still memories of President Clintons approval rating soaring above 64% within months of his impeachment by the House in December 1998. Voters punished Republicans in the midterm election a month before the impeachment vote. \"Republicans have to be cautious and not look too overeager, politically, on this one thing,\" said Katie Gage, a GOP strategist focused on messaging that candidates might use against Hillary Clinton as she runs for president. \"Trying to turn this into a political issue and putting it all at her feet will allow her an opportunity to seem like she is being bullied,\" Gage said of the Benghazi investigation. The Clinton team appears to be doing everything it can to get Republicans overheated. Last week, a request by the House Select Committee on Benghazi for an interview with Clinton in a closed-door hearing was cast by her aides as a setup, timed so Republicans could leak parts of her testimony in the heat of the 2016 election. Clinton campaign Chairman John Podesta characterized news that the committee may not wrap up its work until next year  election year  as \"the latest example in a broad, concerted effort by Republicans and their allies to launch false attacks\" on Clinton. There have already been several government investigations into the 2012 attacks in Benghazi that killed U.S. Ambassador J. Christopher Stevens and three other Americans. The reports did not support allegations from some Republicans that mismanagement by Clinton precipitated the tragedy. But Republicans are focusing on Benghazi anew after Clinton acknowledged this year that she had conducted all of her government business on a personal email account while secretary of State, handpicking which messages to preserve for the public record. She erased other messages on the account, which was run from a server in her home. Those details are tempting to Republicans eager to embroil Clinton in a major scandal. And on the campaign trail, the situation is providing plenty of red meat for GOP contenders. But back in Washington, Republican lawmakers are being urged to keep their cool. Nobody wants to relive those days in the 1990s when a top Republican insisted that Clinton aide Vince Foster, whose death was ruled a suicide, was actually murdered. Then-Rep. Dan Burton (R-Ind.) suggested he disproved law enforcements finding that Foster shot himself in the head by launching his own forensics investigation, during which he shot a bullet into a melon. As Clintons email scandal emerged, Republican media strategist Rick Wilson cautioned Republicans not to blow it. \"Try for once to play the long game and help Hillary Clinton take on water,\" he wrote in Politico last month. \"They want you to jack the volume to 11.\", The chairman of the Benghazi committee, Rep. Trey Gowdy (R-S.C.), seems to be heeding the advice. \"I have made no presumption of right- or wrongdoing on anyones part with respect to the Benghazi terrorist attacks,\" he said Thursday. The remark came as he sent a detailed letter to Clintons attorney that calmly suggested it was not his committee, but Clinton herself and the Obama administration, that were dragging the process out. He accused them of refusing to turn over all the documents the committee was requesting. He said the hearing need not be behind closed doors. \"With her cooperation and that of the State Department and administration, Secretary Clinton could be done with the Benghazi committee before the Fourth of July,\" Gowdy said. He pointed out that the State Department initially failed to tell investigators that Clinton was routing her government email through a personal account and controlling which messages got preserved, suggesting that earlier investigations may have missed something as a result. Democrats quickly followed up with their own timelines, questioning Gowdys assurances that he was merely seeking to follow the facts wherever they led. They note his committees inquiry is on track to last longer than the investigations into President Kennedys assassination, Watergate and the terrorist attacks on Sept. 11, 2001. \"The Republicans multiyear search for evidence to back up their Benghazi conspiracy theories has turned up nothing,\" said Rep. Elijah E. Cummings of Maryland, the ranking Democrat on the select committee. He called the effort an attempt \"to drag out this taxpayer-funded search for anything they can use against Hillary Clinton, while their political arm raises campaign funds off the deaths of four Americans.\", evan.halper@latimes.com, Twitter:@evanhalper]", "Date": "20150426", "Title": "[GOP's latest Benghazi-related inquiry could benefit Hillary Clinton]", "Link": "http://www.latimes.com/nation/politics/la-na-clinton-benghazi-20150426-story.html", "Author": "[Evan Halper]"}