{"Content": "[California legislative leaders have put a hold on a bill by Secretary of State Alex Padilla that would overhaul California elections in response to last years dismal voter turnout. A bill introduced for Padilla by Sen. Ben Allen (D-Santa Monica) would allow counties, beginning in 2018, to mail all voters ballots that could be marked and then cast at any of several voting centers to be opened around the county. Ballots could be cast at the centers during a 10-day period that includes election day. They also could be dropped off in secure boxes available 24 hours per day. The measure was scheduled to be heard Wednesday by the Assembly Elections and Redistricting Committee, but legislative leaders have put it on hold until January 2016, according to an email by Darren Chesin, chief consultant for the Senate Committee on Elections and Constitutional Amendments. Both the Speaker and the President Pro Tem of the Senate expressed support for the approach SB 450 takes so I am confident that it will make it to the Governors desk soon thereafter, Chesin wrote. Senate President Pro Tem Kevin de Leon (D-Los Angeles) and Assembly Speaker Toni Atkins (D-San Diego) issued a joint statement in which they committed to working with Allen during the coming months to come up with something that would be ready for public hearings next year. Since SB 450 was just recently introduced in the Assembly, Californias diverse communities have not had sufficient time to analyze and comment on this historic change to our voting system, the statement said. We support policies to increase voter turnout, but more time is needed for all the stakeholders to weigh-in to make sure we get the policy right. Padilla, who has differed on occasion with De Leon on issues, said he was not giving up on the bill. We have an urgent need to strengthen our democracy, and we owe it to all California citizens to make our elections more voter friendly, Padilla said in a statement. Allen said he is not discouraged by the delay. \"Whenever we make this type of transformative change, we need to be sure we get the details right,\" he said. \"To that end, we will be taking the next few months to work with stakeholders and both houses of the legislature to confirm every detail in the bill is technically correct, and logistically feasible.\", Meanwhile, a separate bill sponsored by Padilla that would have the Department of Motor Vehicles register to vote every eligible applicant for a license, was approved by an 8-3 vote Tuesday by the Senate Transportation Committee. AB 1461 is by Assemblywoman Lorena Gonzalez (D-San Diego). Some civil rights groups including the ACLU opposed the measure, saying now that the state Department of Motor Vehicles is issuing licenses to immigrants in the country illegally, they are concerned some may be registered by mistake and vote, jeopardizing their ability to stay in the country. 3:55 p.m.: This post has been updated with comments by Sen. Ben Allen and legislative leaders. This post was originally published at 1:08 p.m.]", "Date": "20150714", "Title": "[Legislative leaders shelve bill overhauling elections until next year]", "Link": "http://www.latimes.com/local/political/la-me-pc-legislative-leaders-shelve-bill-overhauling-elections-until-next-year-20150714-story.html\n", "Author": "[Patrick McGreevy]"}
