{"Content": "[ To the editor: The Times correctly notes that the response from some state legislators to the UC Irvine \"flag ban\" proposal is \"foolishness.\" Missing is any discussion of the educational environment that produced such a \"silly\" proposal. (\"Legislators overreaction should suffer same fate as attempted flag ban,\" editorial, March 11), The language contained in the flag ban resolution provides some insight regarding the inspiration for the idea that such a proposal might be an acceptable course of action. Phrases such as: \"cultural mythologies and narratives,\" \"paradigms of conformity,\" \"homogenized standards\" and \"instances of colonialism and imperialism\" are used to make the case for the ban. This is what is being taught in our universities  it is the real \"foolishness\" on display in this instance. Scott Perley, Irvine, .. To the editor: Oh, the irony. As groups protest the removal of the American flag from a wall in a student lounge, minority groups are still fighting to gain equal access to the ballot box. With the 50th anniversary of \"Bloody Sunday\" in Selma, Ala. we are reminded that many Americans are still denied the right to vote. But then there is the recent L.A. city election in which fewer than 1 in 10 registered voters bothered to actually vote. For some the flag may represent freedom, but if there is anything that will actually cause the loss of our freedoms, it will be the cancer of voter apathy. In addition, there is the sin of state legislatures passing laws that prevent Americans from voting. So which is more destructive to a free society: removing a flag from a lounge wall, or failing to vote and taking away the right to vote?, Greg Starczak, Santa Barbara, .. To the editor: Like the self-imagined U.S.-flag-burning crisis of the 1980s, the UC Irvine student governments short-lived flag ban for its office lobby fueled the grandstanding proclivities of pious politicians eager to remedy a problem that doesnt exist. Now, state Sen. Janet Nguyen (R-Santa Ana) proclaims that shell seek a constitutional amendment to forbid publicly funded colleges from banning the U.S. flag on campus. This overheated controversy, if nothing else, provides a valuable teaching opportunity. UC Irvine students can draw on the wisdom of Samuel Johnson, who observed that \"patriotism is the last refuge of a scoundrel.\", Greg Gilbert, Cool, Calif. Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150314", "Title": "[What are schools like UC Irvine teaching their students?]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-0315-sunday-uc-irvine-american-flag-20150315-story.html\n", "Author": "NULL"}
