{"Content": "[House Republicans won the opening round in a lawsuit against President Obama over their claim that his administration spent money for health insurers under the Affordable Care Act without receivingneeded approval by Congress. U.S. District Judge Rosemary Collyer ruled Wednesday that the lawmakers have the legal standing to sue. The Constitution could not be more clear: No Money shall be drawn from the Treasury but in consequence of Appropriations made by Law, she said, quoting a key provision. Neither the president nor his officers can authorize appropriations; the assent of the House of Representatives is required before any public monies are spent. The judge rejected pleas by Obamas lawyers to dismiss the House lawsuit on the grounds it involved a political dispute, not a legal one. Collyer noted that the House claimed it would suffer an institutional injury if the president and his aides could spend money on their own authority. Her ruling is only the first step, however. She told lawyers she wouldhear arguments in the fall on whether the administrations action violated the Constitution. If Collyer, a judicial appointee of President George W. Bush, were to decide in favor of the House on the merits, Obamas lawyers would appeal to the U.S. Court of Appeals for the District of Columbia Circuit, where Democratic appointees are in the majority. From there, the case could move to the Supreme Court. Unless the dispute moves with unusual speed, a final decision might not come until after Obama has left office. Nonetheless, Collyers initial ruling is a victory for House Speaker John A. Boehner, and it is likely to be seen as endorsing the GOPs view that Obama overstepped his authority. In a statement, Boehner said he was grateful to the court for ruling that this historic overreach can be challenged by the coequal branch of government with the sole power to create or change the law. The presidents unilateral change to Obamacare was unprecedented and outside the powers granted to his office under our Constitution. The White House said it would seek an immediate appeal. The law is clear that Congress cannot try to settle garden variety disputes with the executive branch in court, said Deputy Press Secretary Jen Friedman. This case is just another partisan attack  this one, paid for by the taxpayers  and we believe the courts will ultimately dismiss it. Many lawyers saw the House suit as unprecedented. In the past, courts have regularly said lawmakers do not have standing to turn their political fights into legal battles. Last summer, when the House voted to sue Obama, many legal experts predicted the suit would be tossed at the first stage. Boehner had first alleged that Obamas aides had violated the law when they waived several deadlines under the Affordable Care Act. But more recently, the lawyers for the House focused on a little-known dispute over how to reimburse health insurers who take on more low-income policyholders. The Affordable Care Act said these insurers would be reimbursed for waiving copayments and other costs for these new policyholders, but it did not make clear whether this money would be provided automatically or instead would require an annual appropriation from Congress. So far, the administration has spent $4 billion, and the total spending is expected to reach $175 billion over a decade. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, After the Republican-led House refused to appropriate money, Health and Human Services Secretary Sylvia Mathews Burwell decided the reimbursements were mandatory under the law and could be provided despite the lack of an appropriation. Law professor Jonathan Turley, the lead counsel for the House, said the judges ruling means the court will decide an issue that drives to the very heart of our constitutional system: the control of the legislative branch over the power of the purse. Despite the setback, health law experts do not see this case as posing a major challenge to the future of Obamas healthcare law. If spending for the reimbursements were cut off, insurers might have to raise premiums somewhat. Other experts say the insurance companies could turn to a federal claims court to seek reimbursements. MORE POLITICALNEWS, For some Republicans, Ben Carson is Trump minus bluster plus faith, Secure in Iran deal victory, White House is gently mocking its opponents, Hillary Clinton makes case for Iran deal, and a more hawkish approach in Middle East]", "Date": "20150909", "Title": "[Judge allows unusual House GOP lawsuit against president to proceed]", "Link": "http://www.latimes.com/nation/la-na-obamacare-gop-lawsuit-20150909-story.html", "Author": "[David G. Savage]"}