{"Content": "[New research out Friday shows that Republicans will need a larger slice of Latino voters than previously thought if they hope to win the White House in 2016, creating an even tougher hurdle for the eventual nominee. Thanks to changing demographics, the conventional math that once said the GOP would need to win a minimum of 40% of the Latino electorate no longer holds. Now, data suggests that Republicans will need as much as 47% of Latino voters -- nearly twice the share that Mitt Romney is believed to have captured in 2012. Put another way: 47% is the new 40%. And it is a daunting number. \"Its very, very, very basic: Every single year, you need a little bit more of the Latino vote,\" said Matt Barreto, UCLA political science professor and co-founder of the polling firm Latino Decisions. \"Its just math.\", The research is based on demographic changes and voter preferences emerging at a time when older, white voters who have powered Republican nominees are fading. The growing Latino electorate is expected to surpass 10% of all voters in 2016, and younger white voters are trending toward Democrats. The findings arelikely to scramble Republican strategy circles, because the top Republican candidates are currently performing no better than Romney among Latinos -- a problem compounded by celebrity candidate Donald Trumps disparaging comments about Mexican immigrants. Jeb Bush, the former Florida governor, does best with Latinos, at 27%, according to a Univision poll this week, closely trailed by Sen. Marco Rubio (R-Fla.) at 25%. The new thinking unveiled Friday largely mirrors that of Republican pollster Whit Ayres, who has argued that the partys 2016 nominee will need more than 40% of the Latino vote. He has been tapped by Rubios campaign. A look at past elections shows the rough road ahead for the GOP amid the demographic shift. The last Republican nominee to hit the 40% threshold was George W. Bush in 2004, who was popular with Latino voters. He went on to win the White House with 58% of the white vote, at a time when Latinos were 7% of overall voters. Romney and John McCain trailed in Latino support and lost the presidency. Republicans could stem their reliance on Latino voters if the partys nominee performed better among whites -- as some GOP strategists are hoping to do. But that strategy could force thecandidate to favor more conservative positions on immigration and other issues for little gain, as history also shows that the partys attempt to grow its support among white voters has its limits. The partys high-water mark with white voters came when Ronald Reagan won 66% of the white electorate in the 1984 landslide. By 2012, Romney won 59% of white voters against President Obama. If the GOP nominee won 60% of the white electorate in 2016, the candidate would need 42% of the Latino vote to win the White House, the research shows. But if the candidate again topped out at 59% of white voters in 2016, he or she would need 47% of the Latino vote to make up the difference, the research said. Barreto, who conducted the research for Americas Voice, a leading immigration advocacy group, acknowledged he had been using the old thinking until he ran the numbers. \"We were blind to this,\" he said at a briefing Friday in Washington. \"We shouldnt use the 40% anymore.\", For the latest from Congress and the 2016 campaign follow @LisaMascaro]", "Date": "20150717", "Title": "[New data suggest GOP 2016 nominee will need to win nearly half of Latino vote]", "Link": "http://www.latimes.com/nation/la-na-latino-gop-20150717-story.html\n", "Author": "[Lisa Mascaro]"}
