{"Content": "[The setting matched the message Tuesday as Donald Trump stood beneath the gun barrels of a 57,000-ton battleship in Los Angeles Harbor and fired rhetorical blasts on immigration, trade and national security. But protesters on shore nearly drowned out Trump, the front-runner for the Republican presidential nomination, as his shipboard rally set the stage for Wednesdays GOP debate at the Reagan Presidential Library in Simi Valley. Borrowing Richard Nixons polarizing pledge to stand up for the silent majority amid the social upheaval of the 1960s, Trump told supporters gathered on the ships stern that Americans were disgusted by the U.S. allowing immigrants to just pour into the country illegally. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Theyre disgusted when a woman whos nine months pregnant walks across the border, has a baby, and you have to take care of that baby for the next 85 years, Trump, wearing a red baseball cap emblazoned with his Make America Great Again campaign slogan, told the crowd. Booooooo! the audience responded. The comment was typical of Trumps remarks on illegal immigration on the campaign trail. He has led in polls for much of the summer, tapping into fears about people in the country illegally and garnering support mostly from restive Republicans drawn to his political-outsider status. Trump appeared unfazed by the loud and relentless taunting by demonstrators waving signs reading Deport Trump! and Were All Anchor Babies. But the talkative New York real estate tycoon, whose speeches can exceed a full hour, spoke for just 13 minutes, packing his remarks, as usual, with superlatives. He pledged a military buildup that would force the leaders of Russia and Iran to respect America. Nobodys going to mess with us, he said. He called President Obamas nuclear agreement with Iran one of the dumbest deals and one of the weakest contracts Ive ever seen of any kind. Fire him, Donald! a man in the crowd bellowed. Fire him!, Get more national political newsand the latest from Campaign 2016 >>, Trump, the only one of the 15 candidates in Wednesdays debates to appear publicly Tuesday in Southern California, assailed Obama on trade with Japan, China and Mexico, saying the leaders of all three countries were smarter and more cunning, a favorite comparison of his. Japans massive ships float right here and they drop off the cars, right? he said, gesturing to the giant container vessels floating nearby. They drop off thousands and thousands and thousands of cars. Millions of cars. And we sell them beef. The crowd erupted in laughter. Trumps event was a fundraiser for Veterans for a Strong America, a group that endorsed him Tuesday. Trumps stature with veterans has been bumpy. Trump offended some this summer when he mocked Arizona Sen. John McCains record of service as a prisoner of war for five years in Vietnam, saying hes not a war hero. He ignored calls to apologize, but has been casting himself as a champion of veterans, as he did again aboard the battleshipIowa, now a museum. We have illegal immigrants that are treated better, by far, than our veterans, he said. Trump, who received draft deferments during the Vietnam War and has never served in the military, has called on CNN, the sponsor of Wednesdays debate, to donate its advertising revenue to veterans groups. Marine veteran Scott Fischer of Lake Forest, who attended the rally, said he was undecided on Trump but was concerned about illegal immigration. Theyre just letting everyone from all these countries in, he said. One of Trumps biggest applause lines was his promise to make Mexico pay for a wall along its entire border with the U.S. He lamented drugs pouring into the country. Not a good deal: We get the drugs, they get the money, he said. The drug cartels are going wild. They cannot believe how stupid our government is. It was just such comments that drew 18-year-old Rebekah Kritz of San Pedro and a couple of hundred other protesters to the ships berth. Hes a racist, Kritz said bluntly. We cant let people just constantly call for a wall to be built to keep others out. Its like putting people against people. Follow @finneganLATand@kurtisalee for political news. ALSO:, Trump and Schwarzenegger: A political comparison, Meet the busboy whos taking on Donald Trump over immigration, A frail Nancy Reagan probably wont make the GOP debate, 8:50 p.m.: This story was updated throughout with Trumps appearance. This story was originally published at 3 a.m.]", "Date": "20150915", "Title": "[Trump, taunted by protesters, delivers barbs on immigration in L.A. Harbor speech]", "Link": "http://www.latimes.com/nation/politics/la-na-trump-national-security-20150915-story.html\n", "Author": "[Michael Finnegan, Kurtis Lee]"}
