{"Content": "[Somehow, 40 years into a political career that was crowned by his election as Hawaiis governor, Neil Abercrombie ignored the most basic lesson of the trade: Its a popularity contest. After years of antagonizing not just partisan opponents but key elements of his own Democratic Party, retaliation came Saturday in the form of an epic thumping. Abercrombie lost his partys primary by 35 points to state Sen. David Ige, who campaigned on his mastery of the state budget but implicitly promised a return to the more workman-like, less bombastic style that defined Hawaiis political class before Abercrombie. The depth of anger toward the incumbent was evident in two statistics: Abercrombie, 76, lost to a candidate he outspent by a 10-1 margin. And he lost to a candidate who, one poll showed, was unknown to almost 4 in 10 Hawaii Democrats as recently as February. Iges victory highlighted a strange primary election for Hawaii, and one that will not end for weeks: Two Democrats vying for the party nomination for a U.S. Senate seat were separated by about 1,600 votes, and the outcome of the race may hinge on ballots yet to be cast in two precincts where voting was canceled because of Fridays pounding from Tropical Storm Iselle. State elections officials said that voters who had not otherwise cast ballots in the Big Island precincts will be mailed new ones, which must be returned within three weeks. But the timing of the start of that process was not clear Sunday, nor was it clear how the Senate candidates would marshal their forces to campaign in the damaged areas. Some strategists said that both Abercrombies trouncing and Sen. Brian Schatzs narrow lead over Rep. Colleen Hanabusa in a race he was expected to easily win suggested that Asian American voters in particular had rallied to Ige and Hanabusa to the detriment of the incumbents. The races were fraught with ethnic divisions driven in part by the circumstances of Schatz appointment by Abercrombie to the Senate seat held until his death by Daniel Inouye. In a deathbed missive, the 50-year senator had made clear he wanted Hanabusa to be appointed to his seat, but Abercrombie sided instead with his lieutenant governor, Schatz. Then, pouring acid into the wound, Abercrombie earlier this year suggested in an interview with the Los Angeles Times that someone other than Inouye had manufactured the imprimatur. (He later apologized to Inouyes widow Irene but insisted the senator had given him free rein to pick his successor.), The contretemps escalated what was already a perilous circumstance for the first-term governor and, before that, legislator and member of Congress. Jennifer Duffy, who studies governors races for the nonpartisan Cook Political Report, said that after his comments on Inouye, people kind of looked at him in a different light. A lot of it is just self-inflicted, she said. Indeed, Abercrombie entered the race woefully weakened  one poll said almost half of Hawaiians had a negative view of him  which required him to both curry favor among his fellow Democrats and run an artful campaign. Those who watched his fall said he did neither. Barely six months after his election, he angered the tourism industry  the states biggest source of income by saying that it was so stupid for the state to pay to host the NFL Pro Bowl, a game that generated upwards of $30 million in visitor spending and state tax revenue. He alienated the states teachers union by imposing a contract upon it during labor negotiations; the union became an early and important backer of Ige. And then he cast aspersions on Inouyes braintrust and by extension the states largest voting group, Asian Americans, and inflamed the elbowing between them and the more liberal white voting bloc that was Abercrombie and Schatz power base. \"This is a very small place and people have very long memories,\" said Floyd Takeuchi, a writer and former political journalist. Abercrombies campaign \"seriously misjudged the depth of the old guards ability to organize\" against him, Takeuchi said. Ben Tulchin, a California-based Democratic pollster who has worked extensively in Hawaii for independent groups, said Abercrombie ran,quite frankly, one of the worst campaigns imaginable for an incumbent in trouble. Time after time, he said, Abercrombies antagonistic style pushed aside voters he needed, even if he eventually worked his way toward their views when it came to policy. A personality that was bearable when he was working in the statehouse or in far-off Washington became less so in the higher profile, in-your-living-room role of governor. Strategically, Tulchin said, Abercrombie negated his overwhelming financial advantage by refusing to define Ige before Ige had the money to define himself. In hewing to Hawaiis traditional distaste for negative campaigning, he gave up one of the few options left to an unpopular politician. If youre an incumbent who is in trouble and you have the resources, it cant just be a referendum on you, Tulchin said. You have to tell others why the other guy is worse than you. The Abercrombie campaign refused to do that. In the end, being the anti-Abercrombie  and a quieter, less annoying presence  was more than enough for Ige. The question now is whether it will carry him to victory in November. The general election race will feature three major candidates:Ige, Republican Duke Aiona and independent Mufi Hanneman. While Ige easily outdistanced all other candidates Saturday, he opens the campaign with little money, if some momentum from his victory. Although Democrats control the state, three-way races are notoriously difficult to predict and the winner may be dictated by where Hanneman gets his voters, analyst Duffy said. If he pulls votes from Ige, this is really a race, she said. The winner of the Democratic Senate primary is expected to have no such difficulty against Republican Cam Cavasso; both Schatz and Hanabusa drew four times the votes he did. For that reason, the race is not expected to alter the balance of power in the Senate. The winner will hold the seat until 2016, the conclusion of Inouyes original term. In the Senate race, it was all about the primary, pollster Tulchin said. For political news and analysis, follow me on Twitter: @cathleendecker]", "Date": "20140810", "Title": "['Self-inflicted' wounds led to Hawaii governor's defeat, analysts say]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-how-hawaii-governor-lost-self-inflicted-wounds-20140810-story.html\n", "Author": "[Cathleen Decker]"}
