{"Content": "[Making a case for reelection, Gov. Jerry Brown said in an interview that he would hold the line on state spending despite \"pent-up\" demand for more, further boost local governments authority and keep Californias tangle of regulations from growing in a fourth and final term as governor. Rather than announce a host of sweeping new policies, Brown said he would largely build on what hes already done, particularly in transferring some education and criminal justice authority to local jurisdictions. And he would make sure that fellow Democrats push to spend billions of dollars more on state services, now that the recession is over, doesnt endanger Californias newfound fiscal health. \"The gold rush for new programs and spending has accelerated with the return of the economy,\" Brown said Friday, a sweater slung over his shoulders as he picked at a chocolate chip cookie in a bakery near his campaign headquarters. \"A key role that I will play will be to keep a balanced hand on the spending, try to be wise and compassionate, but practical.\", Until now, Brown has largely been a candidate without a campaign, despite more than $23 million at his disposal, and he has not articulated a policy agenda. He has devoted large chunks of time to raising money but has otherwise skipped nearly every tradition of governors seeking reelection, including TV ads touting his achievements. Neither has Brown published a platform. And he has mostly ignored the existence of little-known, under-funded Republican challenger Neel Kashkari. Brown only recently hit the airwaves, asking people to vote not for him but for two November propositions  a water bond measure and a rainy-day fund  and has helped a few embattled Democrats in key races. And only now, slightly more than two weeks from election day, is Brown talking  mostly in generalities  about what he would do if, as expected, he glides into office again Nov. 4. Brown said his role as leader is \"to make a success of that which Ive been helping to bring about.\", In the wide-ranging  at times rambling  hourlong interview, Brown struck themes that were remarkably conservative for the most powerful Democrat in California, a national stronghold for the party. He lamented, for example, Californias enactment of tens of thousands of laws during his 45 years in politics. Although many of those were important to ensure public safety, protect civil rights or fight pollution, he said, the ever-growing reach of state bureaucracy needs to be checked. \"Its like Gulliver being tied by these Lilliputians, with more and more little strings and ropes,\" the former Oakland mayor said, describing how a thicket of building restrictions unnecessarily hamstrung redevelopment of the hardscrabble downtown neighborhoods of the city. \"So just signing the law and it goes into the code books  thats the beginning, not the end,\" he said. \"I intend to do a lot more follow-through work in the next four years.\", Policy changes needing further attention, he said, include a shift to local control over certain school funds and prison realignment, which sends low-level felons to local jails rather than state prisons. Brown, 76, cast himself as a wiser manager of the states giant bureaucracy than he was during his first two terms, from 1975 to 1983. He also suggested hed finally mastered Californias political complexities, saying he was squirreling away much of his campaign money for ballot measure campaigns that he might need to mount during a final term. \"There may be things to be done that will involve a ballot measure,\" he said. \"Im not going to disclose\" what they might be. But \"I do think having a credible war chest will overcome whatever infirmities lame-duck governors might ordinarily suffer from.\", Brown said hed learned from his failure in the mid-1970s to build a war chest that he could have used to push an alternative to Proposition 13, the 1978 initiative that capped property tax hikes and has bedeviled elected officials ever since. Brown was definitive that he would not seek to change the law, a third rail in California politics. But he left open the possibility of altering other tax laws. \"Prop. 13 is a sacred doctrine that should never be questioned,\" he said. \"That doesnt mean that we cant look at our tax code in various ways.\", In 2010, Brown pledged not to raise taxes without voters consent, even though Sacramento can increase levies without the publics permission. He declined to make a similar vow now. And although Brown insisted that the tax increase he took to the ballot in 2012  Proposition 30  was temporary and he had no intention to make it permanent, he did not rule out an extension. \"Tax reform is difficult  thats why I havent talked a lot about it  but Im not ruling it out,\" he said, adding that his goal is to replace the revenue provided by Proposition 30 with money saved from paying down the states debt by the time the measure expires. \"Were trying to manage so we can do without it,\" he said. \"But it is challenging.\", Kashkari has hammered Brown for his ties with the powerful California Teachers Assn. which has spent millions of dollars supporting the incumbents campaigns. Brown said he believes he could serve as a bridge between warring factions  the teachers unions and those who seek to change teacher tenure, seniority and evaluation systems. \"The issue du jour is firing teachers, that through that one mechanism of firing a very small number of teachers, that that is the leverage point that will transform the entire school. Well thats just not true,\" Brown said. \"Most kids are dealing with teachers that under no scenario of reform would ever be fired.\", Though dismissal procedures are a serious issue, getting teacher qualification, development and evaluation right are critical for schools long-term health, he said. \"It cant all be just about more rules and more money, and thats basically what Sacramento does.\", Brown said he had no regrets, perhaps aside from not meeting his wife, Anne, earlier. He repeatedly pointed to his experiences and seasoning  as governor in the 1970s, as mayor of Oakland, as a presidential candidate  as the source of his surer hand and greater clarity than he had in his first stint as governor. \"I govern from a base of enormous experience,\" he said. \"I am more penetrating in my understanding than I was 35 years ago. I think thats very helpful.\", Brown has ruled out a run for president in 2016. But he declined to rule out another bid for Oakland mayor. \"I wouldnt mind being mayor of Oakland,\" Brown said. \"But I dont know, when Im 80 and a half, whether Ill have the same appetite. Im very excited doing this job.\", Still, he said, \"I dont want to foreclose my options for four years from now.\", @LATSeema, @ finneganLAT]", "Date": "20141019", "Title": "[ An experienced Jerry Brown vows to build on what he's already done]", "Link": "http://www.latimes.com/local/politics/la-me-pol-jerry-brown-20141019-story.html\n", "Author": "[Seema Mehta, Michael Finnegan]"}
