{"Content": "[Rep. Scott Peters of San Diego had a major disadvantage in seeking the endorsement of the U.S. Chamber of Commerce for Novembers midterm election: Hes a Democrat. The views of the nations largest business group are closely aligned with the Republican Partys. And the GOPs reputation as the \"party of business\" has been strengthened in recent years as President Obama and Democrats tightened regulations and bashed Wall Street in the wake of the financial crisis. But a tea party-led debt limit fight and a partial federal government shutdown, along with conservative opposition this year to business community priorities such as immigration reform and reauthorization of the Export-Import Bank, have tarnished that image. Democrats believe the door is open for them to break the Republicans stranglehold on business support. Its an uphill battle because of the Republican Partys core focus on low taxes and light regulation. But recently there have been signs of hope for Democrats. After failing to get the Chambers backing in 2012, for instance, Peters was among a handful of business-friendly Democratic congressional candidates this year to win its endorsement. \"There are very serious things that the business community sincerely wants us to handle, and many times its the Republicans who are part of the tea party or Republicans who are scared of the tea party who are standing in the way,\" he said. \"I think businesses are starting to realize that sometimes its the Democrats willing to push that agenda more than the Republicans,\" said Peters, a freshman whose GOP opponent this fall, Carl DeMaio, is sympathetic to some tea party positions. Democrats said businesses should give their partys candidates another look. \"I want to say to the business community, I think blind dedication to Republicans is a serious mistake,\" said Rep. Sander Levin (D-Mich.). He called the recent battle over reauthorizing the Export-Import Bank, which helps U.S. companies sell their products abroad, \"mind-boggling.\", The agency doesnt require taxpayer funding and helps level the field for U.S. firms because dozens of foreign countries offer similar assistance to their companies. Business groups supported a five-year extension championed by Obama and congressional Democrats. But conservatives slammed the bank as an example of \"crony capitalism\" and a dispenser of \"corporate welfare\"  terms usually uttered by liberals. With the bank in danger of shutting down if its charter wasnt reauthorized by Sept. 30, House Republican leaders gave in to heavy business lobbying and allowed a nine-month extension to be included in a budget bill that passed last month. \"I think the fight over the Ex-Im Bank was a flare in the night sky about the coming battle,\" said Jonathan Cowan, president of Third Way, a centrist Democratic think tank. \"There could be a big clash ahead over whats in the business communitys interest for economic growth and what some significant portion of the Republican Party is willing to support,\" he said. Democrats have a difficult task convincing executives, small-business owners and trade associations that the party is better for them than Republicans are. The six Democratic congressional candidates the chamber endorsed this year is one more than in 2012. But its far below the 28 the group endorsed in 2008. The rest of the Chambers 280 nods go to Republicans, said Chamber spokeswoman Blair Latoff Holmes. \"There is a lot of talk about how there is a war going on within the Republican Party, but the reality is, there arent many Democrats left who are pro-business and earn the Chambers endorsement,\" she said. Sen. Richard Durbin (D-Ill.) said that businesspeople hes met with have been critical of Republicans in private but unwilling to go public. \"We had a meeting with all these businesses and the U.S. Chamber of Commerce, talking about the Ex-Im Bank,\" he told reporters last month. \"We sit there and theyre just moaning and groaning about the House Republicans.... I finally said to the Chamber of Commerce, When are you going to hold a press conference and say that?\", Carlos Gutierrez, a former Kellogg Co. chief executive who was Commerce secretary under President George W. Bush, said he still believes that Republicans are much more pro-business than Democrats. But recent hard-line party stands against immigration reform and the Export-Import Bank have not helped that reputation, said Gutierrez, who started a political action committee called Republicans for Immigration Reform. \"Businesspeople are very frustrated with the Republican Party in that they dont get it that immigration reform is a business issue,\" he said. \"Republicans see it as a rule-of-law issue and a social issue.\", Last year, the Senate passed a bipartisan bill to overhaul the immigration system, including increasing visas for high-tech workers, revamping farm labor programs and strengthening border security. The legislation had strong backing from business groups but stalled in the Republican-controlled House because of stiff conservative opposition to some provisions, such as a 13-year path to citizenship for qualified immigrants. Tea party conservatives have pushed the Republican Party away from business-friendly positions on key issues, centrist Cowan said. That provides an opening to Democrats if they can move away from the anti-big business sentiments of the partys liberal wing, he said. In San Diego, Peters has accused DeMaio of hiding his \"allegiance to the tea party.\", DeMaio is a self-described \"proud gay American\" who bills himself as a reformer willing to take on his own party. In a recent TV ad, DeMaio said he was not a \"tea party extremist.\" On immigration reform, for example, DeMaio said in an interview that he wanted to \"cool the Republican rhetoric,\" which he described as disrespectful. Still, hes fiscally conservative and some of his views are similar to tea party positions that have angered business groups. He wants the border secured before lawmakers start overhauling the immigration system, and he wants a \"bevy of reforms\" in any Export-Import Bank reauthorization to make sure it helps small businesses. John Raymond, a Republican who runs an Escondido real estate firm, said he contributed $1,000 to Peters campaign because he found him \"intelligent and thoughtful\" after they served on two San Diego boards. \"Business and the revenues created thereby is what funds government,\" Raymond said. \"Scott understands that. You can talk to him about those issues, and he gets it.\", Peters said he showed during his first term that he was willing to work across party lines on pro-growth policies. \"Not that theres not extremism in both parties, but there are a lot of moderates in the Democratic Party who want to sit down and make this country competitive, spur job growth here, promote exports, and I think businesses are starting to pick up on it,\" Peters said. jim.puzzanghera@latimes.com, Times staff writer Lisa Mascaro in Washington contributed to this report.]", "Date": "20141024", "Title": "[Democratic candidates seek gains from Republicans' tarnished business image]", "Link": "http://www.latimes.com/business/la-fi-business-elections-20141024-story.html", "Author": "[Jim Puzzanghera]"}