{"Content": "[There is only one woman on the 15-member Los Angeles City Council. Statewide, women have been losing ground at other elected levels. But the emerging field of potential candidates for next years Los Angeles County Board of Supervisors election raises the odds that women could capture a majority of seats for the first time ever. Some see that prospect as a major milestone in a state where both U.S. senators are women but where representation in lower offices is lagging. Currently, 67 of the 296 county boards of supervisors seats in the state are held by women, according California Women Lead, a nonprofit, nonpartisan association of female officeholders. \"Women do approach issues differently and they draw attention to different issues because of their life experiences,\" said Rachel Michelin, chief executive of the group. In addition, she said, they serve as role models that \"can inspire more women to think about running for public office.\", When Rep. Janice Hahn (D-Los Angeles) announced her candidacy last week for the 4th District seat that Supervisor Don Knabe must relinquish due to term limits, she became a top challenger in a field that already has two others with local political experience. Also, Kathryn Barger, the top deputy to Supervisor Michael D. Antonovich, is running  with Antonovichs endorsement  to succeed the north county supervisor who has held office for 35 years. No one else has declared yet in the race, but the rare, open position is drawing interest from a number of viable potential candidates. \"These seats will be highly contested, thats no surprise,\" said Raphael Sonenshein, executive director of the Pat Brown Institute at Cal State L.A. and an expert on local politics. \"These are immensely powerful positions,\" he said. The races for the two seats dont get underway officially until March 7, the first day candidates can begin raising money for their campaigns, and the June 2016 primary is well over a year away, The 2002 voter-approved measure limiting supervisors to three four-year terms began taking effect with last years elections, opening seats that some supervisors had held for decades. The countys population has been growing ethnically diverse and its voters have become increasingly Democratic. Last year, former U.S. Labor Secretary Hilda Solis was elected to succeed the termed-out Gloria Molina, who won her seat in 1991, when the county was forced to redraw district lines after losing a lawsuit that held that the county had deprived Latino voters of an opportunity to elect a representative. Voters last year also picked former state legislator Sheila Kuehl to replace Zev Yaroslavsky, who left office due to term limits. The switch did not change the political makeup of the officially nonpartisan board  the newcomers replaced fellow Democrats  but some observers believe the new board members will be more labor-friendly than Yaroslavsky and Molina. In 2012 Supervisor Mark Ridley-Thomas, who is also a Democrat, won election to a second term with strong support from labor. Departing Supervisors Knabe and Antonovich, meanwhile, are Republicans who were rarely counted as labor allies. A shift to a female majority on a board that has seen only four women members in more than 160 years  and never more than two at one time  would stand in sharp contrast to the trend at other levels of state and local government. Across the state, the number of women in elected offices has mostly held steady or declined slightly. The possibility that voters could bring a female majority to a county board long dominated by men also represents the flip slide of what has happened at Los Angeles City Hall, where only one woman serves on the 15-member City Council. There once were five women on the council, beginning in 1997: Laura Chick, Ruth Galanter, Rita Walters, Cindy Miscikowski and Jackie Goldberg. A decade earlier, women held the councils leadership posts, with Pat Russell serving as president and Joan Milke Flores as president pro tem. Hahn, a former council member and an experienced politician with several tough elections under her belt, has a well-known name  her father served on the county Board of Supervisors for 40 years and her brother was Los Angeles city controller, city attorney and mayor. She is a proven fundraiser and has been racking up endorsements from elected officials  including Kuehl  and labor groups, including the Los Angeles County Professional Peace Officers Assn. But two Republicans also have jumped into the race. Steve Napolitano, a former Manhattan Beach councilman and a senior deputy in Knabes South Bay field office, has been running since the fall and has endorsements from a long list of local elected officials. (Knabe has not yet said whether he will endorse in the race.) Also running is Mike Gin, a former Redondo Beach school board member, city councilman and mayor who says he has experience balancing municipal budgets and making other tough decisions. Several others are taking a close look at Antonovichs seat, which some observers believe is likely to stay in Republican hands. Deputy Dist. Atty. Elan S. Carr, a moderate Republican who ran last year to succeed retiring Rep. Henry A. Waxman (D-Beverly Hills), said through a spokesman that a recent surge in crime has him considering a run for supervisor. The congressional race demonstrated that he can raise money, but he would need to move into the district from his home on the Westside. Other possible contenders are Lancaster Mayor R. Rex Parris, who said he would think about running if no suitable candidate emerges; Los Angeles City Councilman Mitch Englander, who has not ruled out making the race, and state Sen. Bob Huff (R-Diamond Bar), who is termed out in 2016. A spokesman for Huff, the Senate minority leader, said he would consider his options later. jean.merl@latimes.com, Twitter:@jeanmerl]", "Date": "20150223", "Title": "[Supervisors' races could create female majority]", "Link": "http://www.latimes.com/local/california/la-me-supervisors-women-20150224-story.html\n", "Author": "[Jean Merl]"}
