{"Content": "[Veteran GOP strategist Rob Stutzman says he plans to launch an anti-Tom Steyer effort if the billionaire environmental activist runs for the U.S. Senate seat being vacated by Barbara Boxer. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... I intend to lead a bipartisan effort to educate California voters about Tom Steyer from day one of his candidacy if he runs for the Senate, Stutzman said Wednesday evening. He may be the most hypocritical candidate voters have ever seen, which isnt easy to be, because of his history making money off energy investments that conflict with his political platform. An advisor to Steyer said the threatened move highlights the potency of Steyers potential bid. \"They have tried this before and lost in an embarrassing fashion, and trying it again only proves the fact that the underwriters of the dark pool of money that funds the Republican Party -- the oil companies, the big banks, the polluters to name a few -- are shaking in their Gucci loafers over the prospect of someone like Tom joining the Senate and having the power to hold them accountable for putting the interests of the few above the many. They have long viewed Tom as a traitor to his class and are terrified that his joining the fight for the three justices -- environmental, economic and education -- in order to give all Americans a fair shake will upset their ability to keep rigging the system to their benefit,\" said Democratic strategist Chris Lehane. Stutzman is a former advisor to ex-Gov. Arnold Schwarzenegger and 2010 gubernatorial candidate Meg Whitman, the former EBay chief who spent $144 million of her own money on her unsuccessful bid. Stutzmans effort would initially be formed as an educational group but would eventually turn into a super PAC, which could accept unlimited donations. It has the potential to draw from a broad base of contributors, including moneyed oil interests angered by Steyers work fighting climate change and fracking, small-dollar conservative donors irked by Steyers multimillion-dollar attempts to sway political contests across the nation in 2014 and supporters of other Democratic candidates in the 2016 California Senate race, such as Atty. Gen. Kamala D. Harris. Steyer, a former hedge-fund manager from the Bay Area who spent more than $74 million of his own money trying to make climate change a top issue and elect Democrats in 2014, has confirmed that he is weighing a Senate bid, but its unclear when he will make a decision. I havent made a decision yet, he said in an interview with The Times published Tuesday. Either way, Ill be working full time to be part of the solution to the problems I care the most about. Steyers wealth would be an enormous advantage in a potential run -- he could easily fund his own campaign in California, an expensive undertaking. However, the states voters have not looked kindly on millionaire/billionaire candidates who have never held elected office and spent large chunks of their fortunes seeking top posts -- see the failed efforts of former business executives including Whitman, Carly Fiorina, Al Checchi and Michael Huffington. Steyer also faces challenges with his business background. He left Farallon Capital Management, the hedge fund he ran, in 2012, saying he wanted to focus his work on alternative energy. As he became increasingly engaged in politics, his business record has come under growing scrutiny. News reports detailed his longtime investments in coal and other fossil fuels, for example, and the slow pace at which he shed some of those investments. All of this would likely be mined by Stutzmans anti-Steyer effort. Follow@LATSeemafor political news, 9:09 a.m.: This article has been updated to add a quote from a Steyer advisor. This article was originally published at 7 a.m.]", "Date": "20150122", "Title": "[GOP operative plans anti-Steyer effort]", "Link": "http://www.latimes.com/local/political/la-me-pc-antisteyer-effort-20150121-story.html", "Author": "[Seema Mehta]"}