{"Content": "[One of the oldest cliches on American elections, attributed to the late House Speaker Thomas P. \"Tip\" ONeill, holds that all politics is local. Not anymore. Indeed, just the opposite holds true: Increasingly, politics has become nationalized. Emory University political science professor Alan Abramowitz, one of the countrys leading experts on political polarization, lays out some of the evidence in a new paper thatalso offers a theory to explain why. The change, Abramowitz writes, is driven by the rise of what he calls negative partisanship  the belief by voters that supporters of the opposite party are very different from themselves, and not in a good way. Anyone who has followed headlines about Congress for the last decade has probably absorbed the fact that polarization has widened dramatically among elected officials. A few decades ago, both parties had conservative and liberal wings, and the votes of Democratic and Republican members of Congress often overlapped. Bipartisan coalitions moved nearly all major legislation, and local issues drove a lot of votes. Today, the Republicans have become a consistently conservative party. Democrats remain somewhat more diverse ideologically, but they have shed their conservative bloc. The most centrist Democrats in Congress stand several steps to the left of the few centrist Republicans. Congress has become much more of a parliamentary body than it once was, with members voting almost entirely along party lines on most issues, not along regional or state lines. As a result, divided government  with the White House and Congress controlled by opposite parties  has become more of an invitation to gridlock. A key insight from Abramowitz has been that polarization isnt just a Washington thing: The voters who engage most in the political process  turning out to cast ballots, contributing money, contacting elected officials  are also the ones most likely to follow their parties. In dividing along rigid ideological lines, elected officials represent the voting part of the public. In 2012, Abramowitz reports, 91% of people who either openly identified with a party or called themselves independent but leaned to a party, actually voted for thatpartys candidate for president. That tied a record set in 2004. Down the ballot, the record-setting continued: 89% of those who cast ballots in 2012 voted a straight, party-line ticket for the president and House of Representatives, while 90% voted for the same party for president and the U.S. Senate elections. Those levels of straight-ticket, party-line voting, found by American National Election Studies surveys, hit levels last seen when the study project first began to quiz voters in the early 1950s, Abramowitz reported in a paper that he and a graduate student, Steven Webster, prepared for a recent political science conference. All that straight-ticket voting comes despite the fact that more and more American voters call themselves independent. Because partisanship has a bad reputation in the U.S. the independent label appeals to many voters, Abramowitz writes. But the vast majority of people claiming that label are independents in name only. The share of the electorate who truly dont stick with a party is less than 10%. So why has that happened?, Increasingly, Abramowitz says, polls have revealed that voters see the opposing partys supporters in a highly negative light. Much of the gap, he says, stems from the fact that the two parties increasingly are divided along lines of race, religion and culture. Republicans increasingly have come to be the party of white, religiously observant Americans while Democrats draw their support from racial minorities and whites who do not have a strong religious identification. Those racial and cultural shifts have led to a widening ideological gap in which each partys supporters now feel much farther from the opposing partys ideological position than in the past, he writes. Asked to place themselves and each of the two parties on a seven-point scale from conservative to liberal, fewer than 1 in 5 voters in 1972 said the other party was at least four steps away from their position. Now, almost half do. Just more than 1 in 5 now put the other party at least five steps away, something that almost no voters said in 1972. Asked to rate their feelings about the other party on a thermometer, with 0 being entirely negative and 100 entirely positive, people who strongly identify with one party or the other went from giving the opposition a largely neutral 41 rating in 1980 to a chilly 24 now. The share of the electorate giving the other party a negative rating has jumped from just more than 1 in 4 to well over half. Not surprisingly, given those negative feelings, voters are far less likely to cast a ballot for a candidate of the other party, even if the candidate is a longtime incumbent with strong local roots. Theyre also more likely to punish elected officials whom they perceive as too willing to compromise with the other side. The nationalization of U.S. elections doomed Democratic senators from conservative states who were up for election in 2014. The same phenomenon probably will create serious problems for several Republican senators running in blue states in 2016. In the House, however, the pattern gives a clear advantage to the GOP. Because Democratic voters cluster in the nations cities, Republican presidential candidates win in significantly more House districts than do Democrats, even when a Democrat wins the White House. With election results increasingly nationalized, that means Democrats will continue to have trouble winning a majority of the House so long as that uneven distribution of where voters live continues. Those trends, Abramowitz writes, lead to a gloomy conclusion: With divided government likely to be a frequent occurrence and little or no incentive for bipartisan compromise, our findings suggest that confrontation and gridlock are almost certain to characterize thepolicy-making process in Washington for the foreseeable future. @DavidLauter]", "Date": "20150420", "Title": "[Rising partisanship among voters is 'nationalizing' local politics]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-polarized-politics-20150420-story.html\n", "Author": "[David Lauter]"}
