{"Content": "[A tip for people thinking of running for president: Get the rights to your name on the Internet early; failure to do so just cost Sen. Rand Paul $100,000. Paul, the Republican from Kentucky who is vying for his partys presidentialnomination, shelled out the sum earlier this spring, paying a third-party firm to purchase randpaul.com. The purchase, first reported by the National Journal, is outlined in the Federal Election Commission disclosure report filed by Pauls Senate reelection campaign. In late March, ahead of the formal announcement that he was running for the nomination, Pauls campaign paid the money to Escrow.com, a company based in Rancho Santa Margarita that processes online transactionsbetween buyers and sellers of domain names. A spokesman for the Paul campaign declined to comment about the purchase and the exact name of the seller is unknown. At one point, the site had been run by fans of Pauls, who used it to promote him, but whether they still owned it when the sale took place is unknown. With campaigns usuallycash-strapped at early points in the race, a $100,000 payment for a domain name raised some eyebrows. But Pauls campaign apparently thought the price was worth paying. Why spend that much? Two of Pauls rivals in the Republican race, Carly Fiorina and Sen. Ted Cruz, could testify to the embarassment that so-called \"cyber-squatters\" can cause. Fiorina, the former chief executive of Hewlett Packard, failed to register carlyfiorina.org before someone else got it. The site now prominently displays 30,000 frowning faces, highlighting the number of people she laid off while running the computer firm. Fiorinas record of laying people off at Hewlett Packard provided fodder for her opponents when she unsuccessfully ran for Senate from California in 2010 against Sen. Barbara Boxer. Cruz was also targeted by cyber squatters, who owned tedcruz.com. That site now taunts him with the message \"SUPPORT PRESIDENT OBAMA. IMMIGRATION REFORM NOW!\", Other candidates have done better on the domain-name front. Sen. Marco Rubio of Florida, who announced his candidacy last month, owns his own name. So does Hillary Rodham Clinton, the Democratic frontrunner. But Jeb Bush and Chris Christie both have potential problems with domain squatters. The Christie domain is owned by a man who shares the New Jersey governors name while jebbushforpresident.com, which mocks the former Florida governor, is owned by a gay couple from Oregon. Follow @kurtisaleeand emailkurtis.lee@latimes.com]", "Date": "20150506", "Title": "[$100,000 for a website domain name? Rand Paul pays up]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rand-paul-domain-name-20150506-story.html\n", "Author": "[Kurtis Lee]"}
