{"Content": "[When Tsai Ing-wen became Taiwans first female major party candidate for president in 2012, she was asked questions that included whether a woman could lead the islands military. Tsai, who lost by 6 percentage points, is seeking the office again in 2016, but this time, even if she loses, the winner will almost certainly be female because the islands two major parties have both chosen female candidates. Tsai, a 58-year-old lawyer and member of the Democratic Progressive Party, will face Hung Hsiu-chu, 67, a former teacher who was nominated Sunday by the ruling Nationalist Party. Backed by Taiwans ruling Nationalist Party members, Hung Hsiu-chu waves a flag as she is nominated for president on July 19 in Taipei. Backed by Taiwans ruling Nationalist Party members, Hung Hsiu-chu waves a flag as she is nominated for president on July 19 in Taipei. The looming matchup, observers say, signals that Taiwanese can handily accept women at the helm, a reflection of traditional social values as well as modern political advances. I think Taiwan is better prepared for female leadership than even the U.S. said Joanna Lei, chief executive of the Chunghua 21st Century Think Tank in Taiwan. Weve had a long matriarchic tradition, Lei said. In ancient days, when they reached their 50s and 60s, women became the senior people, often the commanding power of their clan and family. Female leadership is not alien to Asian culture. In the Philippines, Gloria Macapagal-Arroyo was president from 2001 to 2010, and in 2013, Park Geun-hye took office as South Koreas first female president. Both India and Pakistan have had female prime ministers: Indira Gandhi led India for 15 years and was in office when she was assassinated in 1984; Benazir Bhutto served two terms at Pakistans helm in the 1980s and 90s, and was assassinated in 2007. Unlike most Asian female presidents, Tsai and Hung did not build their names on the fame of their fathers or a decorated family history. They earned it through seniority, popularity and promotions within their parties. Hung has served as deputy legislative speaker for nearly four years and has a reputation for sharpness in grilling Cabinet ministers who appear before the parliament. Local news media describe her as fierce, feisty or just plain funny. Tsai has chaired her party for two stints over five years and served as Taiwans top policymaker on China affairs in the mid-2000s. She is known for bridging deep factional divides and acerbically attacking Hungs party. She has earned recognition abroad for her speeches in fluent English, which she learned in part while studying in the United States and Britain. Ten women work as heads of central government departments in Taiwan, compared with 76 men. In 2010 Taiwan implemented a law to promote gender equality, requiring that a quarter of city and county councils of four or more people be female. Political analysts say the quotas are easily being met today. Taiwan is more politically mature than foreigners can ever imagine, said Liu Yi-jiun, a public affairs professor at Fo Guang University in Taiwan. Only about 2% of Taiwanese, mostly older people, oppose female leadership, Liu said, based on his own research. The race is primarily expected to be fought over issues such as relations with mainland China and the steep cost of living for Taiwans youth. Tsai has a tenuous lead in opinion polls. The election will take place Jan. 16. Tsai supports dialogue with China, though her party lacks a framework for negotiations that Beijing is likely to accept. Taiwan has been self-ruled since the 1940s, when Chiang Kai-sheks Nationalists lost the Chinese civil war to the Communists and relocated to the island. China insists that the two sides eventually reunite, though polls say most Taiwanese prefer separation. The Nationalists ran an authoritarian government until 1987, when then-President Chiang Ching-kuo lifted 38 years of martial law to introduce democracy. Tsais party was established in the 1980s, after years of political persecution, to vie with the Nationalists. Under Nationalist President Ma Ying-jeou, in office since 2008, ties between mainland China and Taiwan have warmed. The two sides have signed 21 economic agreements. Ma agreed to negotiate with Beijing on the basis that both sides belong to a single China, though the two sides hold different interpretations of exactly what that means. Tsais party rejects that basis for talks, and the public has shown increasing doubt about Mas engagement policies. The Nationalists lost nine mayoral and county magistrate seats in November as younger voters accused Mas government of getting dangerously close to China while ignoring a wealth gap at home. Ma must step down in May because of term limits. Jennings is a special correspondent]", "Date": "20150719", "Title": "[Taiwan seems sure to elect its first female president. But which one?]", "Link": "http://www.latimes.com/world/asia/la-fg-taiwan-next-president-woman-20150719-story.html", "Author": "NULL"}