{"Content": "[Former Los Angeles Mayor Antonio Villaraigosa emerged as the most formidable potential rival of state Atty. Gen. Kamala Harris for Barbara Boxers Senate seat Thursday after billionaire Tom Steyer announced that he would not run. Steyer, a former hedge fund manager who gave $74 million last year to candidates who vowed to fight global warming, said he thought he could do more as a private citizen than as a senator to promote justice in education, the economy and the environment. \"This was a very hard decision,\" he wrote on the Huffington Post website. \"The U.S. Senate offers a unique opportunity to serve, but I also know that we will have excellent candidates.\", After Boxers announcement two weeks ago that she would not seek reelection, Steyer said he was seriously considering a run  a daunting prospect for opponents who could not match the personal fortune at his disposal for advertising. For now, Harris, 50, remains the lone major candidate in the June 2016 primary. But Villaraigosa, who turns 62 on Friday, has spent two weeks seeking advice and trying to build support in private meetings and phone conversations with elected officials, party luminaries, fundraisers and campaign consultants. He joked about the race Thursday at an awards dinner in Washington. \"I have an important announcement to make,\" he told the crowd, pausing. \"Dessert will be served in a moment.\", Villaraigosa could still opt to run instead for governor in 2018  or give up hope of returning to elected office. But if he enters the Senate race, as associates expect he will, Villaraigosas maiden run for statewide office could be tough. His candidacy would set up a political clash between Los Angeles and San Francisco, where fellow Democrat Harris was district attorney from 2004 to 2010. A key question is whether he could mobilize broad enough support in Southern California to offset Harris strength in the Bay Area, a bastion of liberal Democrats. He would need to inspire heavy turnout of Latinos, as he did in his mayoral campaigns. Turnout can be dismal in the Los Angeles area, but its normally highest in a presidential election, increasing the allure of a 2016 race. Villaraigosas 2005 election as the first Latino mayor of modern Los Angeles symbolized the ascendancy of Latinos as a major political force in California. If he captured Boxers seat, Villaraigosa would be Californias first Latino in the Senate. Some of Villaraigosas Latino allies in L.A. have suggested that Harris was anointed by the San Francisco Democrats who have long dominated the party in California. Fabian Nuez, like Villaraigosa a former state Assembly speaker, described her as part of an entrenched Bay Area \"machine\" that included Boxer, Sen. Dianne Feinstein, House Minority Leader Nancy Pelosi and state party Chairman John Burton. Boxer and Feinstein have been a \"very strong collective political force\" for the Bay Area since they won their Senate seats 22 years ago, Nuez said, but Latinos now make up a much larger share of the California vote. \"The dynamics have changed since 1992,\" said Nuez, who named Villaraigosa and Reps. Xavier Becerra (D-Los Angeles) and Loretta Sanchez (D-Garden Grove) as viable contenders in a race against Harris. \"We have a role to play.\", Becerra and Sanchez are still weighing whether to run for Senate. For Villaraigosa, Steyers exit Thursday was a mixed blessing. The San Francisco billionaire could have eroded Harris Bay Areasupport. But with his money, Steyer also could have blocked Villaraigosa from advancing to the November runoff. Villaraigosa said he called Steyer as soon as he heard of his decision. \"I have a lot of respect for him,\" Villaraigosa said. A key task for Villaraigosa would be image rebuilding. His turbulent personal life  his marriage ended after an affair with a local TV newscaster  harmed his public standing while he was mayor. And his frequent travels, which raised his national profile, set off grumbling at City Hall that he was more focused on personal ambition than the day-to-day job of running the city. Still, Villaraigosas record as mayor would probably serve as the foundation for his campaign. During his tenure, he secured billions of dollars in public transit money, much of it for rail-line expansion, and the city made a big shift from coal-fired power plants to solar and wind energy. His plan to win mayoral control of the L.A. Unified School District failed, but Villaraigosa used his clout to influence its leadership and oversee a small group of low-performing schools that made academic gains. His schools agenda turned powerful teacher unions against him, which could pose serious trouble in a Senate race. Since leaving office, Villaraigosa has worked as an advisor to nutritional products company Herbalife Ltd. the Banc of California and the global public relations firm Edelman. He has also been a part-time professor at the USC Price School of Public Policy. The Herbalife job could be another liability. Brent Wilkes, national executive director of the League of United Latin American Citizens, a civil rights group, has criticized Villaraigosa for advising the company, which has battled allegations that it runs an illegal pyramid scheme and preys on Latino entrepreneurs. Villaraigosa has defended Herbalife, saying it was \"a solid member of the Los Angeles business community and a strong presence within the Latino community.\", Another uncertainty is who else might get into the race. Rep. Adam Schiff (D-Burbank) said Thursday that he was seriously considering it. Among the House members weighing whether to run, Schiff is one of the strongest fundraisers, with more than $2.1 million in the bank, according to the Center for Responsive Politics, a nonpartisan group that tracks campaign money. But it is unclear how he could frame a candidacy with enough statewide appeal to compete with Harris, who hopes to run especially strongly among women, or Villaraigosa. Harris has won two statewide elections as attorney general, and her immigrant heritage  Indian mother, Jamaican father  could enhance her appeal among Democrats. \"If Antonio Villaraigosa gets in it, these are the two big kahunas,\" said Garry South, a consultant who has spoken extensively with the former mayor in recent days. \"Anyone else becomes a bit player.\", michael.finnegan@latimes.com, Twitter: @finneganLAT, Times staff writers Seema Mehta and Evan Halper contributed to this report.]", "Date": "20150122", "Title": "[California billionaire Tom Steyer says he won't run for Senate]", "Link": "http://www.latimes.com/local/politics/la-me-pol-steyer-villaraigosa-20150123-story.html", "Author": "[Michael Finnegan]"}