{"Content": "[If Donald Trump were president, he would put U.S. ground troops in Iraq to fight Islamic extremists, rescind President Obamas executive orders that protect millions of immigrants from deportation, eliminate American citizenship for U.S.-born children whose parents are in the country illegally and \"police\" but not necessarily revoke the nuclear pact with Iran. These are some of the positions the poll-leading Republican presidential aspirant laid out in a Sunday interview and a policy paper, adding a little more substance to a campaign that has been marked by populist statements and fiery criticism of rivals. Trumps immigration plan, released on his campaign website, says he would \"end birthright citizenship ... the biggest magnet for illegal immigration.\", That would require a constitutional amendment. Anyone born in the U.S. has been considered a citizen since the 14th Amendments adoption in 1868. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Trump wants to deport all immigrants in the U.S. illegally  an estimated 11 million people  but says he wouldnt break up families because their families would be deported too. \"Were going to keep the families together ... but they have to go,\" he said in a wide-ranging interview on NBCs \"Meet the Press.\" \"We have to make a whole new set of standards. And when people come in, they have to come in legally.\", Deportees who qualify could return, he said. Trump would end Obamas Deferred Action for Childhood Arrivals program, which allows young people brought to the country illegally as children to work and attend college without facing deportation. And he would require Mexico to pay for a wall along the southern border. If it refused, he would \"impound all remittance payments derived from illegal wages\" and increase fees for temporary visas and all border-crossing cards, among other measures. He did not define what he meant by illegal wages. He also wants to triple the number of immigration officers on the border and require the \"mandatory return of all criminal aliens.\", Trumps plan and comments drew immediate fire from Latino organizations and other groups, who havent forgotten the billionaire businessmans remarks when he started his campaign by saying that Mexico was sending its rapists and drug smugglers to the U.S. \"Trump has reignited the GOPs long-standing obsession with mass deportation,\" said Pablo Manriquez, the Democratic National Committees director of Latino media. \"Like his fellow GOP candidates Jeb Bush, Scott Walker, Marco Rubio and others, GOP front-runner Trump dismisses a full and equal pathway to citizenship for hardworking immigrants.\", At least one of Trumps rivals responded directly to his immigration plan Sunday. Ohio Gov. John Kasich, while agreeing that a wall should be built on the border, told CBS \"Face the Nation\" that he supported a guest-worker program as a way to offer legal status to immigrants in the country illegally so long as they didnt have a criminal record. On other controversial topics, Trump told NBC that his views on abortion had evolved, and that he now opposed abortion except in cases of rape, incest and when the mothers life was at risk. He said Planned Parenthood, which has been sharply criticized after the release of undercover videos about how it handles the donation of fetal tissue, \"has to stop with the abortions.\" Asked whether he had donated to Planned Parenthood, Trump said he wasnt sure. \"I dont think so, but its possible,\" he said, noting that he has given to many organizations over the years. However, he hesitated when asked whether he would support shutting down the government to defund Planned Parenthood, as some Republicans advocate. As president, Trump said he would ask Supreme Court nominees about their views on abortion  something that hasnt been the norm, even though nominees are carefully vetted on this and other divisive issues behind the scenes. Trump said: \"I think it would be, if not a litmus test, it would certainly be helpful in terms of my choices.\", Trump is a less orthodox conservative on some other social issues. He said he supported affirmative action and gay rights, for example. \"Im fine with affirmative action. Weve lived with it for a long time. And I lived with it for a long time. And Ive had great relationships with lots of people,\" he said. When asked whether private companies should be allowed to fire a person because he or she is gay, Trump said he didnt think that should be a reason. On foreign policy, Trump wants other countries to pay the U.S. for policing the world. Saudi Arabia \"wouldnt be there\" if it werent for U.S. protection, he said. He questioned why Germany wasnt doing more to lead NATOs charge in Ukraine. And then theres Americas defense of South Korea against the rogue state of North Korea. \"We get nothing for this,\" he said. Trump said he wanted to defeat Islamic State militants \"by taking over a lot of the oil and certain areas of Iraq. And I said you take away their wealth, that you go and knock the hell out of the oil, take back the oil ... which we should have done in the first place.\", When asked about sending U.S. ground troops to do that, Trump said, \"Thats OK.\", As for the Iran nuclear pact, Trump told NBC it would be \"very hard to say were ripping [it] up.\", \"But let me tell you, but I will police that deal,\" he said. \"You know, Ive taken over some bad contracts. ... I would police that contract so tough that they dont have a chance.\", don.lee@latimes.com, kurtis.lee@latimes.com, Don Lee reported from Washington and Kurtis Lee from Los Angeles. ALSO:, Why the Border Patrol has launched an effort to recruit female agents, Putting on a circus with 14 felines? Its as easy as herding cats, University of Texas delays removal of Jefferson Davis statue]", "Date": "20150816", "Title": "[Trump details immigration plan, including mass deportation, and backs ground troops in Iraq ]", "Link": "http://www.latimes.com/nation/la-na-trump-interview-20150817-story.html\n", "Author": "[Don Lee, Kurtis Lee]"}
