{"Content": "[Bernie Sanders has no patience. No time for small talk, glad-handing, saying how great it is to be back in Iowa. The middle class is circling the drain, oligarchs are taking over the government, and people  wake up, people!  are obsessing about football and baseball and what Kim Kardashian is wearing if, he says, shes wearing anything at all. He is angry, righteous, waving his arms, hollering and contemplating a run for president, which is why 150 Iowans have turned out on a numbingly cold evening to hear Vermonts independent U.S. senator vent. Sanders strides from between shelves at the Prairie Lights bookstore, muttering \"hello, hello\" by way of introduction, then launches into a 45-minute attack, aimed mainly at the billionaire Koch brothers and their conservative allies. \"What they are very clear about  is doing away with every single piece of legislation passed since the 1930s designed to protect the elderly, the children, the sick, the poor, the working families of this country,\" Sanders thunders. \"And they do this under the guise of\"  he adds a sarcastic lilt  \"freedom.\", \"Its freedom for me to be able to do anything I want in my factory and put all the crap that I produce in our rivers and our lakes and into the air,\" he scoffs. \"Thats freeeedom!\", His jeremiad is delivered below and to the right of a sign reading \"Science Fiction and Fantasy,\" an unfortunate, if fitting, bit of imagery. Sanders is an exceedingly long shot to win the Democratic nomination for president in 2016  not to mention the White House  should he run. But he speaks to a distinct strain of Democratic discontent, to liberals who view Hillary Rodham Clinton as too moderate, populists who see her as too wedded to Wall Street, doves who consider her too hawkish and Iowans who fret their state, which kicks off the presidential nominating process, will be ignored by the partys overwhelming front-runner. Many hoped Democratic Sen. Elizabeth Warren of Massachusetts, the scourge of the financial industry, would challenge Clinton. But since she wont, some on the left have turned to Sanders, 73, a slouch-shouldered, self-described Democratic socialist who speaks with the vibrancy of an electric current and exhibits all the personal warmth of a snow bank. He will decide in a few weeks whether to run but wont seek, he insists, to undermine Clinton or split Democrats and elect a Republican president, the way independent Ralph Nader helped put George W. Bush in the White House. \"I will not play the role of spoiler,\" Sanders says. Nor would he wage a negative campaign, he says, suggesting he wouldnt even run against Clinton, per se: \"I run on the most important issues facing America.\", But Sanders has always been blunt, which wouldnt change just because some Democrats would prefer a bloodless coronation. More than once Sanders has questioned Clintons commitment to the middle class and those struggling to reach it. \"I dont think that is the politics of Sen. Clinton or the Democratic establishment,\" he told a college newspaper in Vermont. Hearing his words read back, Sanders cracks a rare smile. \"You can quote it,\" he says. ::, Bernie Sanders knows futility. Starting in 1971 he ran for office four times in five years, never getting more than 6% of the vote. (Vermont was once one of the most Republican states in the country.), He finally won a 1981 race for Burlington mayor, then lost campaigns for governor and Congress before winning Vermonts lone House seat. After eight terms, Sanders was elected to the Senate in 2006. \"Im not very smart,\" he tells the bookstore crowd. \"But Im persistent.\", Later, over coffee at an Iowa City diner, he was asked where that trait comes from. He responds curtly, \"I dont know.\", Perhaps it was his upbringing. His father, a penniless Polish immigrant whose family died in the Holocaust, sold paint for a living. The four-member Sanders family crowded a three-room apartment in the Flatbush area of Brooklyn, N.Y.; Bernie slept for a time in the living room, with his older brother. No one starved, but Sanders recalls the familys acquisitions were always \"at the low end of things.\" His mother died at 46, never realizing the dream of living in a house of their own. \"As a kid, I learned what a lack of money means to a family,\" Sanders said in a recent speech at the Brookings Institution. \"Thats a lesson I have never forgotten.\", He got his first taste of politics  and defeat  in high school, when he finished third in a three-way race for student body president. The winner did adopt one of his planks: raising scholarships for Korean orphans. After a year at Brooklyn College, Sanders attended the University of Chicago, where he was, by his own account, a middling student. He preferred his own course of study, reading Marx and Freud and helping organize sit-ins to protest the segregated campus housing. He spent several months after graduation living on an Israeli kibbutz, admiring the collective spirit, then moved to Vermont, lured by happy memories of Boy Scout camp and a travel brochure he saw as a kid. He scraped by for years in low-paying jobs, including working as a carpenter and freelance researcher. He divorced his college sweetheart and married a woman he met the night he was elected mayor. (The couple have four children and seven grandchildren.), The one constant was politics and  more often than not  rejection. When Sanders first went to Congress, Democrats wanted nothing to do with him. (He has run every race as a third-party candidate or independent.) It took intense negotiations for Sanders to win his first committee assignments. Since then, though, he has allied himself with congressional Democrats, who have embraced him in turn, and even worked across the aisle with Republicans on legislation targeting \"corporate welfare\" and caring for the nations veterans. Gradually he went from outsider and eccentric to something of a Vermont institution. \"Bernie fights for the little guy,\" says Garrison Nelson, a University of Vermont political scientist whos known Sanders for 40 years. \"That resonates very effectively in the state, because were little guys.\", In November, Sanders won reelection to the Senate with 71% of the vote. ::, If one of Clintons problems is persistent doubts about who she is and what she truly stands for, Sanders is all take it or leave it. Speaking to a largely student audience at the University of Iowa, the nights second stop, his clip-on microphone is pinned in a way that every word is muffled and every gesticulation rustles like a man crunching through a pile of dead leaves. He either doesnt know or doesnt care. His policy prescriptions are a throwback to the heydays of the New Deal and the Great Society: free college tuition, a $1-trillion program to rebuild the nations roads and bridges, government-run healthcare, higher taxes on the wealthy and publicly funded elections to chase rich donors out of politics. He would break up the nations big financial institutions and scrap trade agreements that he says have punished workers by shipping jobs overseas. All of it is delivered in a nasal Brooklynese that turns words like \"Iowa\" to \"Eye-uh-were\" and \"media\" to \"me-dee-uhr\" and in a string of admonishments: \"Listen to this!\" \"You got that?\" \"You follow what Im saying?\", Its a message that resonates with Democrats like Russ Gerst, 48, an accountant from Cedar Rapids who came to the universitys palatial business school to hear Sanders flay the countrys business leaders. He would like to see the senator run not because he thinks Sanders could win the nomination or become president but to force Clinton  too much the \"corporate Democrat,\" Gerst says  to take a stronger stance against Wall Street and the big banks, and to fight global warming by ending government subsidies for the oil and gas industries. He worries, though, that most voters wont get past the S-word  socialist  to hear what Sanders has to say. \"If you put out a paper and didnt know where it came from, a lot of people would shake their heads yes,\" Gerst says. \"But its hard if people shut their minds right away and dont want anything to do with listening.\", Sanders is undaunted. For all their urgent alarmism, his speeches always include a note of uplift, suggesting how the once improbable  a black president, female police officers, gay couples marrying  has become reality. \"The fight that we have now on the economic struggle, taking on the billionaire class  that is enormously difficult,\" he tells the crowd of about 75. \"But can it take place? Can we win that fight? We can. And we win it the old-fashioned way, when people stand up and fight back.\", The applause has barely died when Sanders is out the door into the 7-degree chill  no time for photos or chitchat. mark.barabak@latimes.com, Twitter: @markzbarabak]", "Date": "20150306", "Title": "[A Bernie Sanders presidential bid would take on the billionaires]", "Link": "http://www.latimes.com/la-na-c1-bernie-sanders-president-2016-20150306-story.html\n", "Author": "[Mark Z. Barabak]"}
