{"Content": "[Even as stock prices tumbled and the country was plunged into a deep recession in 2008, seven of Californias 10 highest-paid chief executives got sizable raises, lifting the average pay package to $32 million. That same year, Wall Street bankers gave themselves nearly $20 billion in bonuses as the government spent billions of dollars to bail out financial institutions. President Obama called the bonuses shameful. The public outrage continues, and now the Securities and Exchange Commission is taking another step to help shareholders decide whether to rein in executive pay. The SECs commissioners voted 3-2 on Wednesday to require publicly held companies to disclose in a clear manner more details about how executive pay compares to a companys total shareholder return; that is, the annual change in its stock price plus dividends. The data in many cases would provide the compensation and total-return data going back five years. Companies also would have to provide total-return data for firms in its industry or peer group. The proposed rules were mandated by the Dodd-Frank financial law that grew out of the 2008 crisis. A companys shareholders dont by themselves directly decide how much an executive is paid, information that companies already spell out in detail in annual proxy statements filed with the SEC. But investors can decide whether to push for bylaws curbing executive pay or whether to elect the directors who are on board committees that decide executive-pay matters. The SECs rules would give shareholders a new metric for assessing a companys executive compensation relative to its financial performance, SEC Chairwoman Mary Jo White said at Wednesdays meeting in Washington before voting to approve the proposal. Ahead of the meeting, the SEC said the rules also would provide greater transparency and allow shareholders to be better informed when they vote to elect directors or vote on executive compensation. Michael Hermsen, a former SEC lawyer who is now a partner with the law firm Mayer Brown in Chicago, said the proposed rules will crystallize some of the discussion among investors as to whether an executives pay is warranted. Its going to provide information in a very precise format, he said. But Hermsen and some others wondered whether a companys total shareholder return is the best measure against which to gauge executive-pay packages. Even White raised the question: Is total shareholder return the optimal measure of financial performance, as the rule proposes?, White said she was very interested in receiving public comment on the proposal  and potential alternatives to the proposed rules approved Wednesday. The proposal is subject to a public-comment period of 60 days, after which the SECs staff would make a renewed recommendation on the rules to the commissioners. Then a second vote by the commissioners is required before the rules take effect. So the rules might be in place by next years annual-meeting season in the spring. Gary Lutin, chairman of the Shareholder Forum, which provides information for investor decisions, said he was glad to see that chairwoman White encouraged debate about what would be the right performance measure. Using total shareholder return might provide a fairly uniform measure for the public, but the number might not always represent the true health of an underlying company, he and others said. For instance, a company that has gone through a merger using lots of debt might have a robust stock price for one year yet remain hobbled by the leverage over the long term, he said. Its important to shift the focus from current stock price, which is easily manipulated by all the wrong things, to a focus on operating performance that will encourage building sound companies, Lutin said. White said that during the public-comment period, she also wanted to hear how the rules would affect smaller publicly held firms. Those firms, whose size under the rules wasnt immediately available, would have to provide data going back only three years. I am particularly interested in views about how investors in smaller reporting companies will use this information, and the costs to these companies of providing this information, she said. james.peltz@latimes.com, , 5:44 p.m.: Updates with additional details, Originally posted at 11:11 a.m.]", "Date": "20150429", "Title": "[SEC is seeking more clarity on executive pay]", "Link": "http://www.latimes.com/business/la-fi-sec-executive-pay-20150429-story.html\n", "Author": "NULL"}
