{"Content": "[We treat political campaigns like slow-moving athletic competitions and like to pretend that every last gaffe could determine the next president of the United States. But most of us also know, at some level, that forces beyond strategy and personality decide national elections. Since 1978, based on data going back to 1916, Ive documented how four conditions affect voting patterns. The first is whether the president is running again. If so, this has a positive effect on votes for the president. The second is how long a party has controlled the White House. Voters like change; when a party has been in power for two or more consecutive terms, this has a negative effect on votes for that partys candidate. The third is the slight but persistent bias in favor of the Republican Party. Finally, the state of the economy: A good economy at the time of the election has a positive effect on votes for the incumbent party candidate. The economic variables that matter are the rate of inflation and output (GDP) growth. Of particular importance is GDP growth in the first three quarters of the election year. These first three conditions are working against the Democrats in 2016. The president is not running; the Democrats have been in power for two terms; there is that lingering Republican bias. According to the equation behind my work, then, the economy has to be very strong between now and the election for the Democrats to have a good chance of winning. Most economists believe the economy will grow at about a 3% annual rate between now and November 2016. If that happens, my equation predicts the Democrats will win about 46% of the vote in a two-party contest. In order for them to win more than 50%, the economy would need to grow at about 4%, and even in that case their predicted vote share would climb only slightly above the halfway mark. My equations average prediction error over the 25 elections since 1916 is between 2.5 and 3.5 percentage points. Assuming the economy does indeed grow at 3%, the probability that the Democrats will win is low, between about 5% and 13%. Republicans have cause for confidence. My analysis is, of course, based on the assumption that the future will be like the past. What if voters start caring more about income inequality than economic growth, and perceive the Republicans to be poor on that issue? Or what if the GOP nominates someone further from the mainstream than ever before?, Shifts in priorities can never be ruled out, but the best I can say is that the conditions that sway voters appear to have been fairly stable for 100 years  and my equation has a fairly good track record. In seven of the nine contests between 1980 and 2012, my equation correctly predicted which party would win the popular vote. It was wrong in 1992, when it predicted that Clinton would lose. (There was a strong third-party candidate that year, Ross Perot, which may have been a problem.) And it was wrong in 2012, when it predicted President Obama would win only 49% of the vote and he got 52%. All along, however, I said the prediction fell within the margin of error. A prediction of the sort I have just made is different from predictions using polls. Although polls can at times be fairly accurate, at least near the time of the election, they are not causal. The theory behind my analysis is that the economy and the other conditions have a causal effect on voting behavior. Given an economic forecast, I can make a prediction at any time  I dont even need to know whos running. I made my first prediction for the 2016 election in November, at which time I predicted, as now, that the Republicans would win if the economy turned out as currently expected. If a more robust economy does not materialize, it is likely that after 18 months of essentially nonstop campaigning, the Democratic nominee will lose  through no fault of her own. Ray C. Fair is professor of economics at Yale University. This work is presented at fairmodel.econ.yale.edu. Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150527", "Title": "[In 2016's presidential race, the winner will be ...]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0527-fair-election-prediction-20150527-story.html\n", "Author": "NULL"}
