{"Content": "[In an extraordinary exchange on live radio this week, Donald Trump seemed to stumble when he landed in the Middle East. It started when he was asked about Maj. Gen. Qassem Suleimani, the powerful and popular military officer who heads the elite Quds force of Irans Revolutionary Guard Corps. \"The Kurds ... have been horribly mistreated,\" Trump suggested, prompting an exchange with radio host Hugh Hewitt that at times sounded a bit like a Laurel and Hardy routine. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, No, not the Kurds  the Quds forces, the Iranian Revolutionary Guards Quds forces, Hewitt said. \"The bad guys. Oh, I thought you said Kurds, Kurds, Trump said. \"No, Quds.\", Kurds, Quds: What should Trump know about Qassem Suleimani?, The once-reclusive commander of Tehrans legendary intelligence gathering and covert war operations across the Middle East and South Asia has lately emerged as a major figure in Iran, with celebrity-like status and an outsized presence on the Web. Conservative Iranian bloggers have called him the countrys most honest leader and have urged him to run for president in 2017. His silvery-bearded image has appeared in photographs from the worlds battlefields, on posters brandished at political rallies and in pop music videos. So ubiquitous has he become, in fact, that a photograph of him supposedly shaking hands with astronaut Neil Armstrong on the surface of the moon in 1969 was circulated on social media. The Quds force, which he commands, is the special forces unit of the Revolutionary Guard Corps responsible for operations outside Irans borders. It takes its name from the Persian word for Jerusalem, which it has vowed to liberate. Under Suleimanis leadership, the force is believed to have armed allies and assassinated rivals in an effort to defend Irans Shiite Muslim revolution and project its influence across the region. U.S. officials twice declared Suleimani a terrorist and accused him of directing attacks on American forces in Iraq a decade ago. But there he was earlier this year, according to photographs circulated on the Internet, apparently drinking tea outside Tikrit at the start of the Shiite led-governments campaign -- heartily endorsed by the U.S. -- to take back the city from Islamic State fighters. It was not the first time that Washington has found itself on the same side as a man long viewed as an arch-foe. After the Sept. 11, 2001, attacks, Iran was reported to have provided intelligence to the U.S. to help its forces overthrow the Taliban in Afghanistan. In an interview with the BBC Persian service, the former U.S. ambassador to Iraq, Ryan C. Crocker, described the central role later played by Suleimani in talks about stemming sectarian violence in that country. Irans ambassador \"called repeatedly for breaks\" during the talks, Crocker said. \"I couldnt quite figure out why, and then later discovered that whenever I said something that he didnt have covered in his points, he would need to call back to Tehran for guidance - he was that tightly controlled. On the other end of the phone was Qassem Suleimani.\", In a speech this week to Irans Assembly of Experts, an influential panel of clerics that chooses the countrys supreme leader, Suleimaniwas reported to have proclaimed the collapse of American power in the region. He accused the United States of seeking to preserve the presence of Islamic State in Iraq and Syria so the regions Muslims would continue to need American help, according to reports cited by the Middle East news site Al-Monitor. In Syria, Suleimani has served as point person for the critical backing that Iran has provided to the government of Syrian President Bashar Assad in the war against rebels supported by the U.S. and its allies. Many people would say hes the most dangerous man in the world, Hewitt told Trump in Thursdays interview. That seemed to trigger a flash of recognition. \"Is he the gentleman that was going back and forth with Russia and meeting with Putin?\" he said, referring to the Russian president. Thats the guy, Hewitt said. Not good, Trump agreed. Trump didnt fare much better when it came to name recognition of many of the regions other militant leaders, but dismissed such questions as \"gotcha\" tactics. As far as the individual players, of course I dont know them. Ive never met them. I havent been, you know, in a position to meet them, he said. If, if theyre still there [after the election], which is unlikely in many cases, but if theyre still there, I will know them better than I know you. For more international news, follow @alexzavis on Twitter, ALSO IN THE NEWS, Britain offers to take more refugees; hundreds are crossing Hungary on foot, Why The Times published the photograph of the deadSyrian toddler, Men who say they found Nazi treasure train reveal new details]", "Date": "20150904", "Title": "[Who is Maj. Gen. Qassem Suleimani, the man who stumped Trump?]", "Link": "http://www.latimes.com/world/middleeast/la-fg-iran-qassem-suleimani-20150904-story.html\n", "Author": "[Alexandra Zavis]"}
