{"Content": "[The heavyweights of the crowded 2016 presidential field,Hillary Rodham ClintonandJeb Bush, laid out starkly different visions Friday for uplifting the plight of blacks in America, as the two appeared at the same event for the first time since they announced their runs for office. Each came to the annual conference of the National Urban League in Fort Lauderdale, Fla. to sway a crucial segment of the electorate. Clintonis eager to maintain the enthusiasm that black voters showed President Obama when they turned out for him in record numbers, propelling him to victory in key swing states. Bush is eager to reverse the trend. TheRepublicanhopes toconvinceblack voters to rethink their traditional alliance with the left as part of his effort to widen the appeal of the GOP to the minority populations that are becoming an increasingly dominant force in presidential elections. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Overshadowing the event was the sustained period of racial unrest in America, sparked by the 2012 shooting death of Florida teen Trayvon Martin and propelled by rioting in Ferguson, Mo. and Baltimore as well as the recent rampage by a gunman in a historic black church in Charleston, S.C. The prison cell death just weeks ago of Sandra Bland, an African American woman arrested after she failed to use her turn signal, also weighed heavily on the convention. Clinton, as well as otherDemocratswho spoke at the event Vermont Sen. Bernie Sanders and former Maryland Gov. Martin OMalley forcefully and personally confronted those issues and the national protest that has resulted. Bush took a more subdued approach, focusing his speech on policy points, presenting a conservative agenda he vows would empower inner-city minorities. While Florida is Bushs home state, Clinton clearly had the home-court advantage Friday. Hillary and Bill Clinton have deep ties in the nations prominent civil rights groups, and among mainstream politicians, they are favorites in the black community. Even after some uncomfortable interactions with the robust Black Lives Matter protest movement, the former secretary of State projected a level of empathy and authenticity the other candidates had difficulty matching. She was the only speaker to receive a standing ovation. The event afforded Clinton an opportunity to draw a sharp contrast with Bush and his oft-repeated right to rise slogan. She warned the hundreds of activists at the event to be wary of a mismatch between what some candidates say in a venue like this and what they actually do when elected. Then, without mentioning Bush by name, she declared, I dont think you can credibly say that everyone has a right to rise and then say you are for phasing out Medicare or for repealing Obamacare. People cant rise if they cant afford healthcare. They cant rise if the minimum wage is too low to live on. They cant rise if their governor makes it harder to get a college education. And you cannot seriously talk about the right to rise and support laws that deny the right to vote. But for much of the speech, Clinton strayed from her usual talking points to dive deep into the challenges of being black in America and the structural racism embedded in the countrys culture and economy. This is not just about statistics, as damning as they can be, Clinton said. This is about Americans doing some soul-searching and holding ourselves to account.  This is about all of us looking into our hearts and examining our assumptions and fears and asking ourselves what more can I do in my life to counter hate and injustice. She talked about the need for whites to ask themselves what it would be like to sit our son down and have the talk. Or if people followed us around stores or locked their car doors when we passed. OMalley, who is struggling with persistently low poll numbers, gave a similarly impassioned speech, drawing from his experiences as mayor of Baltimore. Police accountability was a central theme of his address. Sanders, who has surged in the polls but continues to have difficulty widening his reach to minority voters, stuck mostly to his boilerplate economic populism, underscoring the racial injustice embedded in the nations economic disparity. The one black candidate in the 2016 race, Republican Ben Carson, also spoke. He talked about his own experience growing up in Detroit in an urban neighborhood, fearing he would not live past 25. But he also attacked the entitlements and liberal economic policies implemented as part of a war on poverty, which he says has been a failure, creating a culture of dependency. Bush took the stage last. He ignored Clintons barb in his remarks, during which he declared, There are unjust barriers to opportunity and upward mobility in this country, and touted his record in Florida appointing black judges and boosting the number of minority-owned businesses. But he emphasized that his economic plan, which focuses on boosting the gross domestic product, would prove more beneficial to inner urban communities than those pushed by Democrats, which are rooted in restructuring the economy to move more of the countrys wealth to the middle class. \"Four percent growth is more enterprise in urban areas, more people moving in, a higher tax base and more revenuesin other words, a better chance to save our cities, he said. We can do this as a country. We can grow at a pace that lifts up everybody, and there is no excuse for not trying.\", Twitter:@evanhalper, ALSO:, Hillary Clintons new campaign strategy is shes now taking questions, Sanders is drawing big crowds -- but how long will they stick around?, Jeb Bush announces unprecedented fundraising haul of $114 million]", "Date": "20150731", "Title": "[Hillary Clinton takes a shot at Jeb Bush on race in front of black activists]", "Link": "http://www.latimes.com/nation/la-na-clinton-bush-20150731-story.html\n", "Author": "[Evan Halper]"}
