{"Content": "[WASHINGTON  As the White House looks to wrap up years of negotiations on a highly contested Pacific Rim trade pact, administration officials are increasingly casting the agreement as vital to helping the U.S. face its most daunting economic rival: China. The proposed Trans-Pacific Partnership, or TPP, would be the largest trade deal in American history, involving the U.S. Japan and 10 other countries that combined make up 40% of the world economy. China isnt among them. In recent weeks, one Obama official after another has hammered away at the same line of argument: Its crucial that Congress supports the TPP  including passing a related trade-promotion bill that would strengthen the presidents negotiating hand  because the alternative is that China, not the U.S. will write the rules of global trade. They note that China is trying to cobble together a competing 16-nation trade pact without the United States. \"We want to make sure we dont cede ground to China,\" Agriculture Secretary Tom Vilsack said last month. Added Deputy Commerce Secretary Bruce Andrews: \"Its a choice between us writing it and, frankly, China writing it.\", The administrations focus on China comes at an important juncture for what has become a priority for President Obama this year. Though he didnt launch the decade-old TPP talks, Obama has made the proposed trade deal the centerpiece of his foreign policy in East Asia, where Chinas rising economic and military power is challenging Americas long-held dominant influence in the region. And in that sense, Obamas legacy as the self-proclaimed Pacific president hinges on nailing down the TPP. Yet with less than two years left in his presidency and much less time on the political calendar for passing a trade bill, the administration has been stepping up its campaign for a trade-promotion legislation that many see as a necessary first step to conclude the TPP negotiations. Trade-promotion authority would allow the White House to iron out an agreement with other nations with the assurance that Congress would not make changes to a final deal, only voting it up or down. Obama stands a better chance today of winning so-called fast-track authority than a few months ago, thanks to a stronger domestic economy and a midterm election that put the Senate in the hands of the Republican Party, which is historically more favorable toward trade agreements. Even so, the president needs enough Democratic backing to secure passage, and with strident opposition from corners of his own party, the White House has unleashed a full-court press on trade  with China as a major talking point. \"Theyre trying to reframe the debate and say this is not simply a matter of trade flows  [that] this is about a long-term geopolitical competition between the U.S. and China,\" said Robert J. Shapiro, a Washington consultant and top Clinton administration economic strategist. Opponents of the TPP say that pulling out the China card at this stage represents an act of desperation in the face of persistent congressional uneasiness about Obamas trade agenda. \"They think China is the biggest, scariest story they can tell,\" said Lori Wallach, trade director at Public Citizen, a consumer-rights advocacy group that has been a sharp critic of the TPP. \"Its the best boogeyman for the moment.\", U.S. Trade Representative Michael Froman, commenting on the shift in strategy, noted that China was trying to forge its own regionwide trade alliance. \"We have different approaches to how we pursue trade agreements,\" he said at a recent briefing with reporters. \"And as we look ahead, we want to make sure that were using our trade agreements to shape globalization  in a way that supports American workers and American jobs.\", With the TPP, the U.S. wants to reduce tariffs and other barriers to open markets as well as establish standards on a range of issues affecting trade and commerce, such as intellectual property rights, government procurement and state-owned enterprises. Besides the U.S. and Japan, the TPP parties are Canada, Australia, Mexico, Malaysia, Singapore, Chile, Peru, New Zealand, Vietnam and Brunei. The White House has estimated that the trade deal would boost American exports by $123.5 billion a year by 2025. Thats about 6% of the total $2.3 trillion in exports last year. Administration officials, including Vilsack and Secretary of State John F. Kerry, also have said the trade agreement \"would support\" an additional 650,000 jobs in the U.S. Though no one disputes that trade-related jobs pay considerably more than average wages, many analysts doubt that the TPP would have a significant effect on U.S. employment overall. If the deal boosts exports, imports too will rise, putting downward pressure on domestic jobs. Various labor, environmental and health groups, meanwhile, fear the deal would benefit corporations at the expense of workers and ordinary families. Fair minimum wages and access to generic medicines are among areas of concern. Big-business groups are squarely behind the TPP and have ramped up their lobbying efforts for fast-track authority too, also appealing in part to the threat of a rival, 16-country trade deal that China is spearheading. That deal would exclude the U.S. in the same way that the TPP excludes China. \"The Trans-Pacific Partnership is Americas best and only chance to ensure the United States is not stuck on the outside looking in,\" Tami Overby, senior vice president at the U.S. Chamber of Commerce, said at a House hearing Wednesday on the TPP. Whether the China argument will influence lawmakers or the public is hard to tell. Surveys show that a strengthening recovery in the U.S. along with Chinas slowing economic growth has made the giant Asian country less of a threat today in the eyes of the American public. On the other hand, a Gallup poll last month found that more Americans than ever, a solid 50%, viewed it as \"important\" for the U.S. to be No. 1 in the world economically. The emphasis on China may appeal to moderate Democrats, said Derek Scissors, a China specialist at the conservative American Enterprise Institute. \"To this point, trade has pressed wages of the industrial middle class while its paid off for people in technology,\" he said. Given Democratic skepticism, the Obama administration may be reluctant to focus the argument on the merits of trade, Scissors said. \"So you turn it into Its a way to beat China. Politically it makes a lot of sense.\", Rep. Janice Hahn (D-Los Angeles), whose district includes the Port of Los Angeles, isnt buying it. \"I believe that in concept,\" she said of the need for the U.S. to set the rules of global trade. \"Im pro-trade. I understand the economic value of trade.... But I think there are so many questions we have about the actual deal. Im not comfortable about just having an up-or-down vote on it.\", don.lee@latimes.com]", "Date": "20150308", "Title": "[China is Obama's trump card in push for Pacific Rim trade pact]", "Link": "http://www.latimes.com/business/la-fi-obama-trade-china-20150309-story.html", "Author": "[Don Lee]"}