{"Content": "[Tom Steyer wants to save the planet, but first he wants to know about the U.S. Senate race in Iowa. Seated in a hotel coffee shop, with a packet of data in his lap, he bursts with questions for the political strategists arrayed around the table: How many early voters? How many undecided? How much spending on persuasion and how much turning out the environmental-minded vote?, Later, touring an eco-friendly farm, Steyer asks about the compost used to grow the organic figs and wild berries. Is manure part of the mix?, In short order, the inquisitive San Francisco hedge-fund billionaire has become one of the most powerful players in American politics, sinking tens of millions of his fortune into boosting Democrats and trying to elevate global warming from a political afterthought into a top-tier issue. Hes built an organization that includes some of the countrys top campaign strategists. Hes won a following among environmental activists thrilled at his free-spending ways  hes drawn at least $40 million from his own checkbook this election cycle  and recruited a nationwide legion of green-thinking volunteers. His political organization, NextGen Climate Action, is focused on seven campaigns across the country: U.S. Senate contests in Iowa, Colorado, New Hampshire and Michigan and gubernatorial races in Florida, Maine and Pennsylvania. Hes also invested in some state legislative races, including Democratic efforts to win back a two-thirds majority in Sacramento. In the process Steyer has drawn the enmity of conservatives, who paint him as the epitome of smug I-know-whats-best-for-you liberalism: a radical leftist billionaire hypocrite who wants to kill jobs and raise gas prices while perched snugly in his Sea Cliff mansion. Hes even inspired the Republican Party to create a website, MeetTomSteyer, devoted entirely to disparaging \"Steyer the Liar.\", Through it all he displays the casual comportment and breezy self-assurance of someone rich enough to treat money as though it doesnt really matter. He professes to be quite comfortable on the receiving end of attacks, the product of an age when deep-pocketed donors such as Steyer on the left and the Koch brothers on the right are often higher-profile targets than those seeking office. \"This is full-contact sports, and  people are going to say nasty things about me,\" Steyer says with a shrug. Although his efforts so far appear unavailing  polls consistently show climate change low on the list of voter priorities  he is determined to inject the issue into the next presidential race and is talked about as a possible 2018 candidate for governor of California, where he honed his advocacy by pushing through ballot measures on taxes and climate change. All of which raise a number of questions for Steyer himself: What do issues such as same-sex marriage and shipping jobs overseas, featured in attack ads hes paid for in Colorado and Iowa, have to do with climate change? Has Steyer hurt his credibility with claims that fact-checkers have deemed misleading and even patently false, such as an ad suggesting Floridas governor was soft on polluters who enriched his campaign? And how much of his conservationist crusade is about him and a future run for office? , Working his way through a cheeseburger, Steyer defends his advertising  \"I have not seen anything  that I did not think was supportable,\" he says. And he rules out a gubernatorial bid  sort of. \"I have no plans,\" he insists, \"and thats no joke.\", He has come a long way from his first campaign experience, as a lowly fundraiser for Walter Mondales 1984 presidential race, when he was shocked by the casual cruelty of politics. Presented with one of the attack mailers he has paid for against Joni Ernst, Iowas Republican Senate candidate, Steyer throws his head back and laughs, a deep throaty chortle. He waves it merrily, then returns to performance metrics. \"What,\" he demands of his Iowa campaign team, \"do you think the delta will be for our effort?\", Part of the Steyer lore is the role of unassuming billionaire, and he is easygoing and approachable as he chats up small groups of college students across Iowa. On Day Two of his state tour he wears the same toad-green sport coat, frayed-at-the-cuff khakis and signature tie, a red tartan plaid, as the day before. He may be the countrys biggest individual political donor this year, but no one looks twice as Steyer strolls across campus. Climate change, Steyer tells his young audiences, is the seismic issue of our day, akin to being on the right side of the American Revolution or the Civil War. But \"its not just a question of understanding,\" he tells an earnest group of Iowa State volunteers. \"Its a question of thinking that its important.\", Steyer has some way to go in convincing Americans of that; even his lavish spending is not likely to make climate change the deciding factor in any of the U.S. Senate or gubernatorial contests hes targeted. \"I would say its near the bottom of issues people are motivated by,\" said Andrew Smith, a pollster at the University of New Hampshire, who has been sampling opinion in the state for well over a decade. Others say the same. \"If your life is fine and youre not worried about next weeks paycheck  and youre not buried in student loans, youve got the luxury to think about global warming,\" said Michael Fraioli, a longtime Democratic strategist working on several campaigns this year. \"But if youre worried about next week, or what happens six months from now, youve got more immediate concerns.\", Steyer doesnt entirely disagree. The states he aimed at are places where Democrats can talk about climate change without the risk they face in, say, conservative-leaning Louisiana, Kentucky or Georgia, which also have highly competitive Senate races. His absence there is tacit admission that, whatever the merits Steyer sees in his argument, the politics are not yet on his side. That also explains NextGens far-afield advertising, on issues including jobs and contraception, which are much more likely to stir Democratic voters than global warming. Steyer suggests there is a connection, that candidates he deems wrong on such issues as birth control are probably also wrong on climate change. \"If youre too extreme,\" he says, \"these things all go together.\", After a privileged upbringing on New Yorks Upper East Side, college at Yale and then Stanford business school, Steyer passed through the wealth-creating portals of Morgan Stanley and Goldman Sachs before moving to California and founding his own hedge fund, Farallon Capital Management, in 1986. Part of his fortune comes from investments in companies Steyer now blames for global warming, though he says he is 100% divested from fossil fuels after the New York Times and Washington Post this year detailed his financial ties to coal mines and other polluters. \"Im trying to at least be congruent and consistent in what I do,\" he says. Steyer, a longtime Democratic donor, financed a 2010 California ballot measure that successfully beat back repeal of the states landmark law fighting climate change, and another in 2012 that hiked taxes $1 billion for out-of-state corporations to pay for conservation and alternative energy programs. What really drew notice, though, was a stated intention this spring to spend $100 million  half Steyers money, half raised from supporters  to make global warming an overriding issue in the midterm election. Fundraising has fallen drastically short of that goal, however; the NextGen political action committee collected nearly $43 million through August, the end of the last reporting period, and all but about $2 million of that came from Steyer. He now says he has no idea where the $100-million figure originated, blaming \"somebody I dont know who has never owned up to it.\", Actually, Steyers political strategists suggested the sum, both in public and private. \"Things change and the budget changes,\" he says, striding unperturbed across the rainy University of Iowa campus to thank another group of volunteers. \"We are going to be able to do what we need to do.\", He also cautions against drawing conclusions before all the votes are cast and the postelection data are crunched. \"It aint over until its over,\" Steyer says, suggesting his efforts could make a meaningful difference in November in, say, a close governors race in Florida, or the hard-fought Senate contest here in Iowa. He calls this \"one round of what were doing.\" Already, Steyers hoping to build on this years efforts in 2016, when not just the Senate but the White House will be up for grabs. mark.barabak@latimes.com, Twitter: @markzbarabak]", "Date": "20141011", "Title": "[Tom Steyer's climate change crusade focuses on midterm races, for now]", "Link": "http://www.latimes.com/nation/politics/la-na-tom-steyer-environment-2014-elections-20141012-story.html\n", "Author": "[Mark Z. Barabak]"}
