{"Content": "[One consequence of the steady decline of unions in America is that weve forgotten what little we used to know about what organized labor even means. Union members are often depicted as lazy and overpaid, and job actions as a threat to the livelihoods of average Americans. These points would be a lot harder to make stick if union representation today still reached 23.3% of all private and public workers as it did in 1963 (according to the Bureau of Labor Statistics), rather than 12.3%, and if union members were still 16.6% of the private workforce, as in 1963, instead of 6.6%. It certainly would be a lot harder to depict union members as outsiders at war with society. USA Today, for instance, observed in an editorial that \"the longshoremen who are causing so much grief to workers and businesses around the country are among the nations best-paid blue-collar workers.\" It noted that a contract with raises of 2.8% a year for five years \"seems reasonable,\" since the average full-time longshoreman makes $147,000 a year (according to the employers; the union says its much less than that). The editorial counseled the port workers that it may not be \"worthwhile to rock the boat so much\" because \"things are very good for them.\", But how poor do unionized workers have to be for them to be eligible to bargain for raises?, The subtext is that unions are on their way out, and that taking actions like agitating for pay and benefits will only hasten their disappearance. Recent events, however, are pointing in the opposite direction. Labor organizations are starting to show new creativity and militancy in attaining their goals. Some 6,500 members of the United Steelworkers are now on strike at 15 refineries across the country, including the nations largest. Refinery owners say the issue is about preserving union jobs, but for the union its more about safety: \"Onerous overtime; unsafe staffing levels; dangerous conditions the industry continues to ignore,\" a USW statement says. Thats bound to resonate when explosions and fires at refineries remain frequent occurrences  including a big blast Feb. 18 at Exxon Mobils Torrance refinery. As my colleague Tiffany Hsu has documented, overwork and employee fatigue are rife at Tesoro Corp.s Carson plant. Unions are mobilizing even for workers who arent their own members. The Fight for 15 movement for a $15 hourly minimum wage for fast-food workers was launched by the Service Employees International Union in 2012, even though few are unionized. But the movement, and other union pressure to raise the minimum wage in the restaurant and retail industries, plainly has helped place higher wages for low-income workers on the agenda for politicians and labor-intensive companies including Wal-Mart. The retail giants decision to increase minimum pay to $10 an hour by April 2016 already has been followed by TJX Corp. the owner of T.J. Maxx, Marshalls and other retailers. The Fight for 15 is \"significant in two ways,\" said Thomas Geoghegan, a veteran Chicago labor attorney and author on unionization topics. \"It shows theres some point in going out and disrupting, and it builds morale, even if it hasnt brought in a lot of dues yet.\", Unions are proving more nimble at snatching victory from the jaws of even major defeats, such as the United Auto Workers loss of a hard-fought organizing vote last year at a Volkswagen plant in Chattanooga, Tenn. The loss was commonly described as a \"devastating\" setback in the UAWs effort to organize auto workers in the South. Yet today the UAW is negotiating with Volkswagen over a voice in work conditions at that very plant, where it still represents at least 45% of the workers. The union defeat made nationwide news, but its success at bringing Volkswagen to the table has stayed under the national radar. Attacks on unionization rights have been proliferating. The most recent example is the fast-track passage of a \"right-to-work\" measure by the Wisconsin Senate. The bill, which will come before the state Assembly this week and is expected to be signed by Gov. Scott Walker, a candidate for the GOP presidential nomination, would bar labor contracts that require workers to pay union fees. Geoghegan argues that the Republicans anti-union campaign could backfire, by raising the profile of labor rights as a Democratic issue. \"I can tell you with absolute certainty that the right has not given this a lot of thought,\" he said. Last year Democratic Reps. Keith Ellison of Minnesota and John Lewis of Georgia introduced a bill to recognize labor organizing as a civil right. Lawrence Summers, the former chief economist for the Obama White House and a quintessential centrist Democrat, lately has been highlighting the role of collective bargaining in raising wages. In the words of a January report by a Commission on Inclusive Prosperity co-chaired by Summers, \"expanding the benefits of collective bargaining in the United States ... would help reverse the trend toward wage inequality for U.S. middle- and lower-income workers.\", The presidential election already is shaping up as a test of which party can depict itself better as a friend of the middle class. Republicans tried to claim the mantle during the 2014 midterm elections, and many voters may have believed them. Yet attacks on unionization rights are fundamentally at odds with the interests of the middle and working class. Efforts to undermine collective-bargaining rights and union resources have only one goal, nicely articulated by the former corporate hatchet man Martin Jay Levitt in his 1993 book, \"Confessions of a Union Buster\": \"The enemy was the collective spirit. I got hold of that spirit while it was still a seedling; I poisoned it, choked it, bludgeoned it if I had to, anything to be sure it would never blossom into a united work force, the dreaded foe of any corporate tyrant.\", Its impossible to know just yet how far the pushback will go, but something is stirring. Michael Hiltziks column appears Sundays and Wednesdays. Read his blog, the Economy Hub, at latimes.com/business/hiltzik, reach him at mhiltzik@latimes.com, check out facebook.com/hiltzik and follow @hiltzikm on Twitter.]", "Date": "20150227", "Title": "[Under attack, unions show new creativity and militancy]", "Link": "http://www.latimes.com/business/hiltzik/la-fi-hiltzik-20150301-column.html\n", "Author": "NULL"}
