{"Content": "[I visited friends last week in Brittany, the French province whose wild Atlantic coast resembles Northern California or Maine. And what do you think a dinner table full of smart French people wanted to talk about? The American presidential campaign. Ive always found it remarkable how much attention people in other countries pay to American politics. Is it because our political personalities are so compelling? More likely its because the decisions our presidents make end up affecting other peoples lives. France has a presidential election coming up too, and most Americans havent given it a moments thought. But when it comes to U.S. politics, the French can name many of our leading candidates. My hosts were a French couple, Pascal and Martine Lebehot; hes a high school teacher, shes an auditor for the regional government (and the cousin of one of my wifes oldest friends, which is how we met them). They mostly had one question: \"Will Hillary win?\", Theyre taken, understandably, with the Clinton family saga: A charismatic president falls into a sex scandal, only to regain his popularity  \"You mean that doesnt happen only in France?\" Pascal asked mockingly  and might now be succeeded by his wife. They wanted to know if Americans were ready to elect a woman, something France has never done. \"Its a good idea,\" Martine advised. \"Just look at Angela Merkel and Margaret Thatcher.\", They wanted to know which family would come out on top, Clinton or Bush. \"Dynasties  just like France before the revolution,\" Pascal said. \"This Bush is smarter than his brother, right?\" Martine asked. Thats his reputation, I said, but hes just as conservative as George W. Bush. She made an unhappy little moue. But there are also insurgent candidates among the Republicans, I added, among them Ted Cruz, whose father groomed him to be a leader from a young age. \"Ah,\" said Pascal. \"Just like Joseph Kennedy and his sons\"  an analogy no American pundit has noticed, as far as I know. They recoiled in mock horror when I explained that the Republicans could have 16 candidates in next years primaries. (Frances center-right Republicains have only one candidate, former President Nicolas Sarkozy. He recently renamed the party, apparently to make it sound more American. Go figure.), Unwisely, I tried to impress them by reeling off all 16 GOP names. I could only remember 15. (Sorry, Gov. Bobby Jindal. It must have been the wine.), They were interested to hear that our Republicans are divided over immigration, just like theirs. But our immigrants are mostly Latinos, while theirs are mostly Muslim, so the issues quickly diverge. They were intrigued that the GOP field, with two Cuban Americans and one African American, is more diverse than the Democrats. And, as if to prove that French civilization is still superior, they had never heard of Le Donald. (Sorry, Mr. Trump.), \"Theres one thing Ive always been curious about,\" Pascal said. \"Whats a GOP?\" (He pronounced it to rhyme with \"top.\"), A few days earlier, another French friend had posed a more probing question with genuine puzzlement. \"Your economy is doing a lot better than ours,\" he said. \"Why is everyone so mad at Obama?\", The short version, I said, is that were a grouchy nation right now  grouchy about an economy thats not delivering higher incomes to ordinary people, grouchy about the inability of our political system to solve problems. The French have a word for that: \"la morosit,\" or \"moroseness,\" a national funk at which Parisians believe they excel. But you dont look very morose, I told Pascal as he brought out a tray of many cheeses. \"Were really quite morose,\" he replied without a trace of irony. And for many of the same reasons were grouchy. Two-income professional couples like Pascal and Martine are doing fine; theyre planning a vacation trip to New York City next month. But theyre worried about their children and grandchildren in an economy thats not producing enough jobs. Theyre angry at politicians of both right and left who seem to spend more time cultivating wealthy patrons and running for office than solving problems. After all the spats between France and the United States over the last 12 years, it turns out that we have at least one thing in common: la morosit. Citizens of the Wests two founding democracies dont think democracy is working properly any more. But they still wanted to know whos going to win the 2016 presidential election. I insisted, boringly, that it was far too soon to tell, so Pascal bravely stepped in. \"Hillary seems like the most logical candidate,\" he declared. \"But in France, after one party has the presidency for two terms, a lot of people just think its time for a change. I suspect its the same with you.\", Maybe the French understand us better than we think. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus, Follow the Opinion section on Twitter@latimesopinion and Facebook]", "Date": "20150624", "Title": "[ A French take on the U.S. presidential race]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0624-mcmanus-french-dinner-20150624-column.html\n", "Author": "NULL"}
