{"Content": "[The news that Sen. Barbara Boxer would not run for her Senate seat again after nearly four decades in public life was a watershed moment for California and for her fellow Democrats, signifying the end of a political career that has come to embody Bay Area liberalism. Her announcement also set off a scramble among state politicians who have been waiting for a California Senate seat to open for more than two decades. Boxer, 74, stated her plans Thursday in a video to supporters, saying her decision was not prompted by her age or by partisan bickering in the nations Capitol, where Republicans now control both houses. I am never going to retire  the work is too important, but I will not be running for the Senate in 2016, she said, adding that she would remain engaged through her political action committee and on behalf of fellow Democrats. I want to come home to the state that I love so much: California, she said. The move was not a complete surprise. Boxer had not been raising money for a reelection campaign, as rumors abounded that she wanted to spend more time with her family and had grown weary of the long commute to Washington. The announcement sparked a deluge of gushing statements from fellow Democrats. Barbara Boxer is more than a senator  shes an institution, said President Obama. Shes served the people of California for more than three decades with distinction, fighting for the issues that are close to their homes and hearts. Though short of stature  and often accompanied by an aide carrying a Boxer box for her to stand on at news conferences  Boxer has not been a demure presence on Capitol Hill. She has advocated vocally on behalf of environmentalists, organized labor and womens rights groups. Her Senate career was forged at a crucial time for women in politics. In 1991, Boxer  then a member of the House  was among the seven lawmakers who marched up the steps of the male-dominated Senate and demanded that a vote on the Clarence Thomas Supreme Court confirmation be postponed so accusations of sexual harassment against him could be investigated. The protest instigated the televised hearings that nearly sank Thomas. It also triggered a national backlash against the Senate that created openings that swept Boxer, Sen. Dianne Feinstein and others into office in 1992, the year of the woman in American politics. In the 1992 race, Boxer beat conservative television personality Bruce Herschensohn by 4.9 points after a last-minute revelation that he patronized a Hollywood strip club. In every Senate election since, Boxer beat her rival by double digits, most recently former Hewlett-Packard chief Carly Fiorina in 2010. Boxer told reporters Thursday that she did not believe she would have been elected to the Senate in her first run without the Thomas investigation. I  did this long shot for the Senate, never believing I would win.... And then Anita Hill happened, she said. Without Anita Hill, that story, I dont think I would have made it. Feinstein, who spoke with Boxer by phone shortly before the announcement, reflected on that time Thursday. Everyone said it couldnt be done; thats what made it a moment, Feinstein told reporters on Capitol Hill. Boxer and Feinstein have had similar positions on legislation, but Boxers combative style has made her a target of the right and has not always been conducive to deal-making: Few landmark laws bear her name. When the GOP took over Congress in 1994 and began rolling back environmental laws, Boxer launched into a three-day filibuster. She has sparred with arch-conservative Rick Santorum of Pennsylvania over abortion rights. Her testy exchanges with former National Security Advisor Condoleezza Rice were parodied on Saturday Night Live. Her scolding of a general who addressed her as maam instead of senator enraged her critics. Boxer rattled Capitol Hill with her crusade for an open investigation into allegations of unwanted sexual advances by former Sen. Bob Packwood, an Oregon Republican. Many voters were appalled by what they learned about the ways of the Senate as a result. Sen. Mitch McConnell (R-Ky.), then chairman of the Senate Ethics Committee, was so annoyed by Boxer that he responded to her charge that he lacked ethics by saying: Being called unethical by Barbara is like being called ugly by a frog. Boxer irked colleagues again in 2004, when she challenged the electoral college votes from Ohio, where some Democrats alleged fraud. She was the only senator to do so. The move delayed certification of George W. Bushs reelection for several hours. But the senator also played the inside game sometimes. She collaborated with Republicans to push through multibillion-dollar infrastructure measures. She took a lead in securing funding for the hard-fought expansion of the Los Angeles subway and other key transportation projects. Sen. Amy Klobuchar, a second-term Democrat from Minnesota, noted in an interview that when few other major bills advanced in the last Congress, Boxer negotiated a major water bill and transportation package with Republican Sens. Jim Inhofe of Oklahoma and David Vitter of Louisiana. Those are no small tasks, Klobuchar said. Im sure a lot of people are talking about her passion and her work for liberal causes. But in fact she had an uncanny knack to be able to deal with and positively work with incredibly conservative members of the Senate. Inhofe and Boxer are polar opposites on the issue of climate change. As they prepared to spar at a hearing scheduled for Halloween in 2007, Boxer brought costumes  angel garb for her, devil horns for him. Inhofe, who took over the chairmanship of the Senates Environment and Public Works Committee from Boxer after control of the Senate changed hands this year, said he may have no closer friend in the Senate than Boxer after 28 years of serving together in the House and Senate. We have a respect for each other and weve always been able to keep things light and happy, and yet do battle, he said. I know you dont believe this  nobodys going to believe this when they read it  but Im going to miss her. Boxer said the failure to pass a climate bill has been one of her greatest regrets. The other was not doing more to stop the Iraq war, which she voted against. I used to come down there [to the Senate Floor] and read the names of the dead, she told reporters. I couldnt change things. And that just weighs on me. I wasnt able to gather enough support in the Senate. It took us a long time. We finally got there. Born in Brooklyn, Boxer attended Brooklyn College and worked as a stockbroker and a journalist before being elected to the Marin County Board of Supervisors in 1976. Running with the slogan Barbara Boxer Gives a Damn, she was elected to the U.S. House of Representatives in 1982. In her video Thursday, Boxer made clear that although she would be leaving the Senate, she had no plans for a life of leisure. Although I wont be working from my Senate space and I wont be running in that next tough race, as long as there are issues and challenges and strife, I will never retire because this is the meaning of my life, said Boxer, who is known for working whimsical verse into her speeches. Twitter: @LATSeema, Twitter: @evanhalper, Mehta reported from Los Angeles, Halper from Washington. Times staff writers Mike Memoli and Lisa Mascaro in Washington contributed to this report. 8:34 a.m.: Post updated to include quotes from Boxer and more background. 10:48 a.m.: Story updated with additional background. 10:05 p.m.: Story updated with additional background.]", "Date": "20150108", "Title": "[Sen. Barbara Boxer, liberal lion from California, to retire after 2016]", "Link": "http://www.latimes.com/nation/la-na-boxer-retire-20150108-story.html\n", "Author": "[Seema Mehta, Evan Halper]"}
