{"Content": "[When the Supreme Court issued its ruling this week in the Hobby Lobby contraception case, there was no end of commentary amid a wall-to-wall unfurling of predictable response: Conservatives celebrated the 5-4 decision as a triumph for religious freedom. Liberals denounced it as an assault on the rights of women. Perhaps the most curious and surprising reaction came from New Jersey Gov. Chris Christie, whose response was, essentially, no response. The fact is that when youre an executive, your Supreme Court makes a ruling and youve got to live with it unless you can get the legislative body to change the law or change the Constitution, Christie offered by way of a Politics 101 explication on CNBCs Squawk Box. The point is, why should I give an opinion as to whether they were right or wrong? the prospective 2016 Republican presidential hopeful continued. At the end of the day, they did what they did. Thats now the law of the land, unless people in the legislative branch try to change it. When speculation began about a possible Christie White House bid, handicappers focused on the governors blowtorch persona and his vociferous and opinionated style of public engagement, a soundtrack that includes any number of loud, in-your-face arias. \"I am not a focus-group-tested, blow-dried candidate, or governor,\" the acutely self-aware Christie said at an epic January news conference, in which he repeatedly apologized for staffers who tied up roads leading to the George Washington Bridge, apparently to punish a small-town mayor for refusing to endorse Christies reelection bid. Given that verity, few expected much reticence on the outspoken governors part. Yet since emerging from his self-imposed media exile  Christie spent several weeks traveling the country but ducking reporters after the bridge scandal broke  he has adopted an unusually closed-mouth stance on certain difficult questions hed likely face in a presidential run. Appearing last month in San Francisco, Christie was asked to outline his position on immigration, which, perhaps more than any issue, threatens to sunder the GOP. Im sure youd love me to do that and, in fact, what I want to do in a flower warehouse, I want to give you a very complex answer behind a set of microphones on a contentious issue thats driving debate all across the country, Christie replied. The sarcastic response got a laugh from the several dozen Republican activists who showed up at the floral business to cheer Christie and the GOPs California gubernatorial nominee, Neel Kashkari. Christie was even more dismissive when a reporter asked about revelations that the Port Authority of New York and New Jersey, the agency at the center of the bridge scandal, was being probed by the U.S. Securities and Exchange Commission, one of a tangle of ongoing investigations. Any other questions? he asked, turning away from his questioner. That got snickers, too. The bridge scandal came up again on MSNBC on Tuesday, drawing a breezy Christie dismissal. \"I think what the people across this country  and Ive been in 19 states now over the past four or five months or so  and what people talk to me about is not that stuff, said the governor, who has strenuously and repeatedly denied any involvement in last years deliberate traffic tie-up. Christie treads a difficult path as he eyes a White House bid. He is a relative social moderate in a party with a voter base that remains deeply conservative; that would explain why he prefers to downplay issues like abortion and access to contraception, even as some competitors were quick to hail the Hobby Lobby decision. The high court ruled Monday that business owners who have religious objections to birth control, like the owners of Hobby Lobby, can decline to provide their employees with insurance coverage for certain contraceptives, despite a requirement under the new federal healthcare law. \"I dont think thats the most central issue that we need to talk about this morning when you look at the challenges that face this country,\" Christie said in the Squawk Box interview. \"If I allow people to put me in the box, then shame on me. Im not a good politician. Im not a good leader.\", That sort of evasion might work, but only for a time. Reporters, as a class, are held in generally low regard by much of the public, especially partisans who believe they unfairly slant political coverage in favor of the other side. (A neat trick, managing to displease both.) So ignoring or even belittling a pesky questioner can seem like great sport and might even help among at least a certain segment of the electorate. But its not just reporters who are being stiff-armed; its the voters who rely on their coverage to cast an informed ballot. It is early in the presidential campaign, with the first voting still 18 months or so away. Eventually, though, there will come a time when Christie and every other would-be president will be forced to address, explicitly and at length, all the questions put to them, not just those they wish to acknowledge. Otherwise, theyll likely answer for it at the polls. mark.barabak@latimes.com, Follow  @markzbarabak for more on national & California politics]", "Date": "20140702", "Title": "[Chris Christie silent treatment a surprise from outspoken governor]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-chris-christie-hobby-lobby-20140702-story.html", "Author": "NULL"}