{"Content": "[Bernie Sanders, one of Vermonts U.S. senators, is mulling a 2016 run for president, as either a Democrat or independent. He is expected to announce his decision in a few weeks. During a recent testing-the-waters swing through Iowa, the self-described Democratic socialist --elected as an independent -- sat down for a 45-minute interview at Iowa Citys Bluebird Diner. Here are selected excerpts:, Q: Setting aside political labels, how would you describe yourself and your political philosophy?, A: Setting aside labels, I am somebody who believes that government in a democratic society should be representing the needs of the vast majority of the people who are middle-class and working families. That at the current point, we are living in a society which is moving more and more toward an oligarchic form of society where government is dominated heavily by big-money interests. Q: When did you first have the notion of running for president? What set off thatlight bulb in your head?, A: About a year ago....The light bulb going off in my head was a fear that in this pivotal moment in history, when this country faces so many serious problems, when the middle class and working class of this country are being decimated, that there were not voices out there representing the tens of millions of people who needed a voice. And the idea of going through a campaign where there is not a serious discussion about the most important issues facing America, where there are not voices out there representing people who are hurting -- that seemed to me unacceptable.\", Q: You have almost a physical aversion to discussing yourself and answering personal questions. Why is that?, A: I think that the media spends far too much time [on personalities]. Ill give you an example. Im not going to tell you I know George W. Bush intimately. Im not going to tell you were best friends. Ill tell you I met him on a number of occasions. You know what? George W. Bush is a very nice guy. Very funny guy. His wife is a very nice woman; I thought she was a great first lady.George [W.] Bush was the worst president in the history of the United States of America.... The issue is not Bernie Sanders. The issue is the Koch brothers. The issue is who owns America. Q: If you choose to run against the Democratic front-runner, Hillary Rodham Clinton, how do you distinguish yourself and draw contrasts?, A:I dont run against Hillary Clinton. I run on the most important issues facing America. I state my views. And if Hillary Clinton runs, Im sure she will state her views. And if she runs and if I run, there will be a contrast of views.... I dont believe in trashing my opponents. Ive never run a negative ad in my life. I believe in talking about issues, sometimes fighting for the media to talk about the issues, but thats what I do, and the people will decide. Q: What do you think of the continued focus on Massachusetts Sen. Elizabeth Warren and efforts to coax her into the Democratic race despite her statements she wont run in 2016?, A: Elizabeth is a good friend of mine. Elizabeth came up [to Vermont] to do a number of town meetings before she was elected to the Senate, when she was at Harvard, and I think she is doing a great job. Q: Would you like to see her run for president?, A: Would I like to see Elizabeth run? Talk to Elizabeth, its not my business. Q: So whats your thought process? When do you make a decision?, A: Obviously the clock is ticking. You have primaries at a certain date. But I think we have time. For me, the determination is, can we put together the kind of grass-roots organization that we need and can we raise the kind of money that we need, and thats what Im trying to determine. Q: Short of winning the White House, short of winning the Democratic nomination, how would you measure success?, A: The truth is that political consciousness in this country is pretty low.... To the degree that we can help educate and organize people around the most important issues facing their lives and show that there is support for fundamental changes in the way we do business in the United States of America in terms of income inequality, in terms of low wages, in terms of disastrous trade policies, in terms of being the only major country not to have a national healthcare program -- thats success. Q: So if you run, its with the intention of injecting your agenda into the campaign?, A: If I run -- thats a big if -- the goal is to win the election, no ifs, buts or maybes. What I would say to the establishment is that there is far more discontent among the American people than they believe. The question that I have got to ask myself -- what were wrestling with right now -- is can you put together that grass-roots mobilization, can you get the volunteers that you need, can you raise the significant number of small donations that you need to run an effective campaign?, Q: What kind of odds would you give yourself of winning?, A: Were the underdog. No ifs, buts or maybes. Q: If you fall short but push others to embrace your views, would that constitute success?, A: The answer is, the people push somebody. If we can create a climate among people that says that any serious candidate for president, Senate, governor, [the] House is going to have to talk about income inequality, raising wages in this country, trade policy -- thats a huge success. Its not putting pressure on a candidate. Its mobilizing people. Q: You repeatedly mention your opposition to the war in Iraq. If you run, do you plan to relitigate that issue?, A: Its not a question of relitigating it. It was a long time ago. It was a terrible mistake. So the issue, I think, is not to relitigate. The issue, which is a very, very tough issue, is where do we go from here given the situation.... I am very, very, very concerned about the United States getting drawn into an endless war, year after year after year. Q: As you doubtless know, Hillary Clinton supported going to war in Iraq, and that was a big issue in the 2008 presidential campaign. Is her support something voters should consider in 2016?, A: I think the war in the Mideast, how we got into it and how were going to address the current problems, are issues that every American should be concerned about. Q: Should I follow @markzbarabak for coverage of national and California politics? A: Absolutely!]", "Date": "20150306", "Title": "[Q&A: Bernie Sanders on Hillary, 2016 and personality politics]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-bernie-sanders-hillary-2016-20150306-story.html\n", "Author": "[Mark Z. Barabak]"}
