{"Content": "[Rep. Kevin McCarthy celebrated his first election to Congress at an In-N-Out Burger, sipping sodas from paper cups at Formica tables with his wife and children. The understated evening fit perfectly into the Bakersfield Republicans image as the son of a firefighter who started his first business, a deli, with proceeds from a winning lottery ticket. Eight years later, as the new House majority leader, McCarthy commands a multimillion-dollar political operation featuring lavish meals, opulent getaways with lobbyists, and privately chartered aircraft. In the two years leading up to last falls election, McCarthy, through his reelection campaign and leadership PAC, spent $140,000 on steakhouses alone. He paid $426,000 to companies that charter private jets, covering 46 trips. And he raised at least $10.5 million for his own and party political committees. That spending and fundraising have fueled one of the fastest rises to power in congressional history. At the time of his election last summer to the No. 2 post in the House, McCarthy had spent fewer than four full terms in Congress. He was the most junior person to reach a top leadership post since the early 19th century. He may lack some of the qualities of previous top party leaders in the House - the grand political vision of Newt Gingrich, the deal-making savvy of Tip ONeill, the strong arm of Tom DeLay. But McCarthy excels at something else that has become key to leadership in Congress: recruiting candidates and raising money for them. McCarthy seldom takes sides in the partys intramural battles over ideology. He has a solidly conservative voting record, but is associated with relatively few legislative causes. The issue on which he has the highest profile is a persistent effort to roll back environmental laws that he says have hurt agriculture in California, particularly rules that set aside water for wildlife conservation. His rapid ascent hasnt been the result of his political positions. Rather, it highlights the important role that fundraising plays in Washington. In a statement in response to written questions, a spokesman said McCarthys focus had been on providing leadership for \"conservative principles and vision,\" a goal that \"does include fundraising for the party and for candidates.\", McCarthys talent for navigating todays all-but-unlimited system of campaign finance was on display last month when he hosted a few dozen lobbyists and other Washington insiders at Bostons Liberty Hotel, a renovated 19th century jail with a granite facade, cheeky jail-themed cocktail bars, views of the Charles River and a lobby with a 90-foot ceiling that becomes a multi-level nightclub. Guests received complimentary flutes of cava upon arrival. Getaways with lobbyists were at the center of a scandal a decade ago that sent lobbyist Jack Abramoff to prison and brought down House Majority Leader DeLay. New ethics rules passed afterward were supposed to put a stop to them. But lawmakers in both parties have since found a way to sidestep the rules. Lobbyists no longer bankroll trips directly. Instead, they write checks to a lawmakers campaign accounts. Those accounts then pay for the lawmakers travel. One thing hasnt changed: Lobbyists are not required to disclose expenses of the many weekends they spend hobnobbing with lawmakers. At these intimate gatherings, lobbyists get the kind of casual access that builds valuable relationships with top lawmakers and their staffs. Lawmakers and lobbyists are often encouraged to bring families along. McCarthys getaway this fall, at the $499-a-night Planters Inn in Charleston, S.C. will be held the weekend before Thanksgiving, according to an invitation. The point of such gatherings is not to discuss specific legislation, but to build relationships between lawmakers and donors who often direct funds from trade associations and political action committees to a leaders favored candidates. \"You dont sit around and talk about HR 301 and how to get it passed,\" said Lindsay Mark Lewis, who raised more than $200 million for Democrats before writing a book about the sway that wealthy donors have over Washington. \"It is a bonding experience over a policy experience.\", McCarthys campaign declined to provide a guest list for the Boston function. Such excursions, often referred to as destination fundraisers, have become mainstays for members of Congress moving up the leadership ladder, in both parties. Rep. Xavier Becerra (D-Los Angeles), the fourth-ranking member of the Democratic leadership, takes donors even farther from Washington, to the Dorado Beach Resort in Puerto Rico, \"home to four legendary championship golf courses, plantation-style resort residences, world-class cuisine and beach activities for the whole family,\" according to the resorts website. \"I come from a district where no one goes to raise money,\" said Becerra, whose district covers much of the Eastside of Los Angeles. \"In politics, unfortunately I think, you have to learn how to raise money. Otherwise you dont survive.\", Becerra declined to provide an itinerary or a list of those who attended last years trip to Puerto Rico. He said fundraising and other aspects of policy were a means \"to do the best policy possible.\", In McCarthys case, the work of building a financial stockpile started even before his first election to the House in 2006. The seat was being vacated by his mentor, former Rep. Bill Thomas, who accompanied McCarthy through the Washington fundraising circuit, attending events alongside Gingrich and John A. Boehner of Ohio, then the majority leader, now speaker of the House. In Washington and California, Thomas lobbied big donors and influential politicians to help his protege. What donors found most impressive about McCarthy, according to people who watched the meetings, was the statistical precision with which he could assess Republican chances in even the most far-flung congressional races. He wowed them with algorithms for probing Democratic weaknesses and persuasive riffs on the promise of potential tea party candidates most had not heard of before McCarthy mentioned their names. Before he was sworn in, McCarthy had distributed to other Republicans tens of thousands of the dollars he had raised. He also gave $50,000 from his campaign funds to the National Republican Congressional Committee, a generous amount for someone who had not yet been elected. He traveled widely, lending support to Republicans in difficult races. \"I wanted to start building relationships and help bring more allies to Congress for the hard work I knew lay ahead,\" he said in \"Young Guns,\" the 2010 book he co-wrote with Republican House colleagues Eric Cantor of Virginia and Paul D. Ryan of Wisconsin, which shares a title with the fundraising network the three men created. McCarthy quickly leapfrogged other junior members of the House, establishing himself as a major part of the GOPs effort to recruit and fund candidates to recapture control of the chamber, which they had lost in 2006. Republican campaign workers still talk about that four-year effort, which came to fruition in the 2010 election. They talk of McCarthy driving cheap rental cars down lonely country roads, a single staffer riding shotgun, on their way to bean suppers, fish fries and Chamber of Commerce events. As his prominence has grown, those country roads have been replaced by runways. Charter travel was rare in McCarthys first congressional election in 2006. He made two payments for $3,600 that year to private air-travel companies, according to campaign records, about enough to ride for two or three hours in a small plane. In the last two years, the period during which McCarthy went from No. 3 in the House to No. 2, the amount he spent on charter air travel soared more than a hundredfold from that first campaign. McCarthy used Golden State Air Charter for most of his private jet travel. The company, based in Bakersfield, offers a range of options  from light jets that travel two to three hours  to long-haul aircraft, \"the ultimate luxury in private jet travel,\" the company says  complete with beds, plush couches, in-flight entertainment, food and flight attendant service. Campaign records do not specify where the planes flew or the identities of the passengers. The campaign declined to provide that information, but said three-quarters of the flights were within California and noted that commercial flights from Bakersfield are limited. McCarthy spoke proudly of his busy travel schedule. \"The month before the election last November he told a group of us that he was in 100 districts in 31 or 32 days,\" said auto dealer Fritz Hitchcock, a GOP donor and former chairman of the California Chamber of Commerce. \"He is a horse. He is a hardworking guy.\", Election day has passed, but the pace of fundraising has barely slowed. McCarthy bounces from headlining low-dollar events like a Corpus Christi barbecue for Texas Rep. Blake Farenthold  donors were asked to help him retain his congressional seat by buying $27 tickets  to dinner in the Southern California home of billionaire Tony Pritzker, an heir to the Hyatt hotel fortune. He has an uncanny ability to keep up that pace without ever seeming rushed. \"He was available for everybody to talk one on one,\" said former Los Angeles Mayor Richard Riordan, who was at the Pritzker event. \"He had pictures taken with everyone.\", Riordan is excited to bankroll McCarthy because he sees him as a flexible moderate. \"He is very open-minded,\" Riordan said. When the archbishop of Los Angeles asked Riordan whether McCarthy might be open to chatting about immigration issues, Riordan said, \"I called Kevin up and within a minute he said yes.\", Yet many in the tea party also consider McCarthy to be on their side. Many tea party-influenced members, who typically view the GOP as too prone to compromise and too attentive to the interests of big business rather than conservative, populist concerns, owe their seats in Congress to him. He recruited them. He raised money for them. He doesnt scold when they rebel against positions taken by the GOP leadership, they say. Instead, he often takes them to dinner to discuss what his campaign statement called \"the common goal to establish a freer and more prosperous country.\", The majority leaders ability to avoid ideological debate and deal with all factions of the party is admired by colleagues, few of whom can shed political baggage so easily. It is a key asset for him in raising money. McCarthy seamlessly moves from recruiting ultraconservatives to meeting with strategists from the GOPs business-oriented faction, who want to limit the power of the partys right wing. He recently flew to the Ritz-Carlton on Amelia Island, Fla. for example, for a strategy session with the leaders of a large political action committee determined to wrest control of the GOP from the tea party insurgents. Its one of the paradoxes of todays congressional fundraising world that a portion of the money McCarthy raises from such wealthy donors goes to fund the campaigns of the tea party members they oppose. Ideological loyalty is not the path to power in todays Washington, said Bill Allison, senior fellow at the Sunlight Foundation and co-editor of \"The Buying of the President 2004.\", \"The country is led by people who are good at asking for money,\" he said. noah.bierman@latimes.com, evan.halper@latimes.com]", "Date": "20150605", "Title": "[Congressman Kevin McCarthy's journey from In-N-Out Burger to millions in fundraising]", "Link": "http://www.latimes.com/nation/politics/la-na-mccarthy-money-20150605-story.html", "Author": "[Noah Bierman , Evan Halper]"}