{"Content": "[Following the release of American Alan Gross from a Cuban prison, the Obama administration said it plans to normalize diplomatic relations between the United States and Cuba. The surprising move has garnered widespread reaction from members of Congress and other politicians. Republican Sen. Lindsey Graham (R-S.C.) blasted the Obama administration over the announcement, calling it a \"bad idea at a bad time.\", , He also promised to do \"all in my power\" to block funding for the reopening of a U.S. embassy in Cuba. I will do all in my power to block the use of funds to open an embassy in Cuba. Normalizing relations with Cuba is bad idea at a bad time. Graham, a third-term senator, is a member of the Senate Appropriations committee. Earlier Wednesday, Graham and Sen. John McCain (R-Ariz.) released a joint statement saying Obamas moves represent \"America and the values we stand for in retreat and decline.\", -- Christine Mai-Duc, Former Florida governor and prospective presidential candidate Jeb Bush reacted to news of President Obamas plans to soften the U.S. stance on Cuba on Wednesday afternoon, calling it a \"dramatic overreach\" of presidential authority. , Bush, who announced Tuesday that he was \"exploring\" the possibility of running for president in 2016, tweeted that Obamas actions toward Cuba will undermine America and the push for democracy in Cuba. President Obamas decision to restore diplomatic ties with Cuba undermines Americas credibility: https://t.co/Gg2m6T4oku. In a statement, Bush said he is \"delighted\" that the Cuban government freed American contractor Alan Gross from prison, but like many other Republicans, decried the release of three Cuban prisoners by the United States. , \"The beneficiaries of President Obamas ill-advised move will be the heinous Castro brothers who have oppressed the Cuban people for decades,\" Bush said in a statement posted on Facebook. \"Cuba is a dictatorship with a disastrous human rights record, and now President Obama has rewarded those dictators.\", -- Christine Mai-Duc, For decades, the politics surrounding Cuba were as durable as they were predictable, as Democrats and Republicans alike condemned the Castro dictatorship and supported a U.S. embargo of the island nation. But a subtle shift began in recent years as memories of the 1959 Cuban revolution faded and as second- and third-generation Cuban Americans grew more amenable to normalized relations  a change that helped lay the groundwork for Wednesdays White House announcement of renewed ties. The change is charted in opinion polls. -- David Lauter and Mark Z. Baraback , Read more, Sen. Ted Cruz (R-Texas), a prospective 2016 GOP presidential candidate, argued that Cuba will retain long standing ties with \"hostile nations, notably Russia, Iran, North Korea and Venezuela.\", , \"They will continue their support for terrorist organizations from FARC to Hezbollah and Hamas,\" Cruz said in a statement. Florida International University has been polling Cuban Americans in Miami since 1991. The percentage of Cuban Americans supporting the embargo has declined from 87% in 1991 to 62% in 2000 to 48% now. Cuban Americans older than 65 support the embargo. Among those younger than 65, a majority oppose it. Also, in 2012, people who identified themselves as having Cuban ancestry made up approximately 6% of the Florida electorate. -- David Lauter, As Democratic lawmakers lined up to praise President Obamas announcement that the U.S. would soften relations with Cuba, the congressional delegate representing Puerto Rico reminded the nation about the lack of democratic rights for citizens in the U.S. territory. Tweeting in Spanish, Puerto Ricos resident commissioner Pedro Pierluisi said that while he respects Obamas authority, he also hopes the reestablishment of diplomatic relations with Cuba will \"bring democracy and freedom.\", Respeto la potestad de Obama. Espero el reestablecimiento d las relaciones diplomticas con Cuba est atado a lograr democracia y libertad. Pierluisi, a nonvoting delegate for the 3.6 million U.S. citizens in Puerto Rico, took the opportunity to condemn what he called the continued \"lack of democratic rights\" in Puerto Rico. , While Congress granted Puerto Ricans U.S. citizenship in 1917, those who live there do not have a voting representative in Congress, dont pay federal taxes, and cant vote in presidential elections. They are allowed to vote in primaries. , \"If there is something that I condemn, it is the lack of democratic rights under our territorial status in Puerto Rico,\" Pierluisi said in a statement posted on Facebook. \"I have always supported Cuban exiles in their claim for these rights in Cuba.\", Apoyo el reclamo de democracia del exilio cubano y repudio la falta de derechos democrticos bajo nuestro estatus territorial en PR. -- Christine Mai-Duc, Just hours after returning from a trip to Cuba, Rep. Barbara Lee (D-Oakland) spoke to MSNBC, praising the release of Alan Gross and the thawing in U.S.-Cuba relations. Lee, who has led dozens of delegations to the country since the 1970s and met with Gross at least four times during his captivity, called it a \"very, very exciting, very humbling moment\" for her. Lee says normalizing diplomatic relations between the two countries will not only allow increased commerce, but also allow scientists and doctors to engage in important exchanges. \"This benefits both the Cuban people and the American people,\" Lee told the network. Lee also called on Congress to repeal the trade embargo with Cuba. To truly normalize relations with #Cuba Congress needs to repeal the failed embargo. #CubaNow pic.twitter.com/mGW6cGjXai, -- Christine Mai-Duc, Rep. Matt Salmon (R-Ariz.) said the policy announced by the Obama administration Wednesday \"sends a message to every rogue government and terrorist organization that this administration is willing to negotiate with them, even if it undercuts U.S. interests and values.\" , , \"This puts a price on the head of every U.S. citizen,\" Salmon said. Read more, Read more, Calling the release of Alan Gross a \"joyous moment,\" Sen. Barbara Boxer (D-Calif.) said the move to normalize U.S.-Cuba relations \"rejects the failed policies of the past and embraces a new future\" that will benefit both Americas interests and the lives of Cuban citizens. , \"We will have enormous economic opportunities because of this action,\" Boxer said in a statement. -- Christine Mai-Duc, Sen. Marco Rubio (R-Fla.), a top Cuban American and potential 2016 presidential hopeful, called the administrations new policy so profoundly disappointing. This president and this administration have let the people of Cuba down, said Rubio. This entire policy shift announced today is based on an illusion, a lie -- the lie and the illusion that more commerce and access to money and goods will translate to political freedom. All this is going to do is give the Castro regime -- perpetuate -- greater wealth and influence for this oppressive regime, especially the military. Rubio criticized Obama for not extracting Democratic changes from the Castro regime in exchange for normalizing relations, saying the economic flow between the two countries will do little to loosen the governments grip on ordinary lives. --Lisa Mascaro , Alan Gross shouldve never been jailed. Obamas unilateral move is propaganda coup 4 #Castro regime, may violate law http://t.co/tB9z0w6Pd0, The U.S. Chamber of Commerce issued a statement Wednesday applauding the new relations between the U.S. and Cuba. , \"We deeply believe that an open dialogue and commercial exchange between the U.S. and Cuban private sectors will bring shared benefits, and the steps announced today will go a long way in allowing opportunities for free enterprise to flourish,\" the group said in a statement. Read more, House Majority Leader Kevin McCarthy (R-Bakersfield) continued a theme struck by several Republican lawmakers Wednesday, calling Obamas shift to soften the U.S. policy on Cuba an indication of the Presidents \"policy of accommodation\" toward enemies. , Earlier Wednesday, Florida Republican Mario Diaz-Balart blasted Obama, calling him the \"appeaser-in-chief.\", Shows Appeaser-in-Chief Obama is willing to provide unprecedented concessions to a brutal dictatorship that opposes US interests @ every opp, McCarthy also said Obamas announcement would be interpreted as rewarding Cuba, which he said continues to detain political dissidents and cooperates with countries such as Syria, Iran, and North Korea. \"It is difficult to have much confidence that this new policy will result in a better life and more political freedoms for the people of Cuba. More likely it will suggest to adversaries and allies alike that the United States lacks resolve in standing up for its interests and its principles,\" McCarthy said in a statement. -- Christine Mai-Duc, In a statement Wednesday morning, Rep. Ron DeSantis (R-Fla.) said the release of American Alan Gross was \"long overdue,\" but decried the release of three convicted Cuban spies, an act DeSantis said sends a signal that American hostages can be leveraged into policy concessions. Happy for Alan Gross & family but dismayed Obama admin agreed to release Cuban spies. Legitimizes Castro regimes coercive tactics. DeSantis also opposed what he called possible pro-Castro changes in U.S. policy, including the relaxing of sanctions on Cuba, saying it would reward a regime that continues to oppress millions. -- Christine Mai-Duc, President Obamas actions have vindicated the brutal behavior of the Cuban government. There is no equivalence between an international aid worker and convicted spies who were found guilty of conspiracy to commit espionage against our nation. One spy was also convicted of conspiracy to murder for his role in the 1996 tragedy in which the Cuban military shot down two U.S. civilian planes, killing several American citizens. My heart goes out to the American families that lost love ones on that fateful day.\", Read more, Relations with the Castro regime should not be revisited, let alone normalized, until the Cuban people enjoy freedom  & not 1 second sooner, Read more, Honored to be here to celebrate Alans return to American soil. #Cuba pic.twitter.com/86eYizwALI, Read more, Welcome home, Alan! pic.twitter.com/rO7G6EHlPs, Sen. Dick Durbin (D-Ill.) welcomed Alan Gross home and in a statement said \"opening the door with Cuba for trade, travel, and the exchange of ideas will create a force for positive change in Cuba that more than 50 years of our current policy of exclusion could not achieve.\", , Read more, Read more]", "Date": "20141217", "Title": "[How politicians are reacting to renewed Cuba-U.S. relations]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-congress-reaction-cuba-us-20141217-htmlstory.html", "Author": "NULL"}