{"Content": "[Mitt Romneys announcement that he is pondering a third run for the White House with a focus on fighting income inequality and poverty presents a host of challenges that would appear to be particularly difficult for Romney to surmount. After running in 2008 on his record as Massachusetts governor, and in 2012 as an economic turnaround specialist, Romney will have to convince voters that his new emphasis is heartfelt. That would be a stretch for any candidate, not the least a man already skewered for flip-flopping and viewed by many voters as caring little about the poor. These perceptions were hardened by Romneys own words as he sought the Republican nomination in 2012. At one point, he appeared to dismiss concerns about the \"very poor\" because, he said, they were aided by a safety net that could be repaired if necessary. He was caught on video telling donors that 47% of voters were unavailable to him because they were dependent on the government. After the election, he blamed President Obama giving \"gifts\" to black, Latino and young voters for his loss. Polls taken during the campaign consistently showed that voters believed Romneys policies would benefit the wealthy, not those lower on the economic scale, and he was assaulted by Democratic ads accusing him of boosting businesses without concern for workers. Even some Romney aides found it difficult to explain how his new focus on poverty  one of three principles Romney laid out to Republican leaders Friday night in San Diego, without adding specific policy details  would mesh with his previous messages. \"I dont understand the angle that hes taking,\" said one Romney loyalist, who, like many Republicans interviewed at a party gathering in Coronado last week, would not discuss Romneys strategy by name in order to preserve relations. \"I dont understand why its one of his top three talking points. Im still trying to sort that out on my own.\", Advisors to Romney said that if he runs, he plans to counter criticism of his approach by emphasizing his years as a leader in his Mormon church  work that Romney highlighted Friday. He cited his wife, Ann, as testifying to his intent. \"She knows my heart in a way that few people do,\" Romney said. \"Shes seen me not just as a business guy and a political guy, but for over 10 years, as you know, I served as a pastor for a congregation and for groups of congregations.... Shes seen me work with folks that are looking for better work and jobs and providing care for the sick and the elderly.\", Romney is known as a man of deep faith who has donated generously to his church, but public emphasis on his religious background is new. In 2008, concerned that evangelical voters would be hostile to his Mormonism, Romney rarely spoke of it. Four years later, he was somewhat more open, allowing reporters to accompany him to services, but he did not emphasize his faith. One of the most compelling moments of the 2012 GOP convention featured testimonials from people whom Romney helped when he was a Mormon leader in Massachusetts. But their appearance was scheduled during a part of the gathering that was not televised. One Romney advisor said his reluctance to tout his good works was driven by humility  but acceding to that instinct was a political mistake. Besides having to sell voters on his new approach, Romney faces the additional job of convincing Republicans anxious for a fresh face that the best visage is that of a political veteran and two-time presidential loser. In more than two dozen interviews with party leaders in Coronado and Republicans across the country, little organic groundswell for Romney appeared to be developing. Many said they liked him and believed that the nation would be better off had he been elected president; many were grateful for the role he played as party booster as recently as the November election. Others declined to criticize Romney but said that if he runs, he would compete without any particular advantage against a score of other candidates already vying for support. \"I think Gov. Romney has built up lot of goodwill and earned lot of respect from Republicans across the country,\" said New Hampshire state GOP chairwoman Jennifer Horn. But \"whether its Gov. Romney or anyone else, its a new cycle and theyre going to have to come back and earn every vote, one by one.\", Others, from conservative media pundits to longtime GOP strategists and leaders, were openly caustic. \"I certainly hope that Romney is not our nominee again,\" said Morton Blackwell, a Republican National Committee member from Virginia since 1988. He and his wife contributed $30,000 to efforts backing Romneys 2012 bid. \"Look, having contributed more money to him than any other candidate in my lifetime, I think I have the right to say weve given him his shot.\", Henry Barbour, an influential member of the committee from Mississippi, said Romneys 2012 campaign was both \"a pro and a con\" for 2016, sharpening the candidates political skills but also displaying his weaknesses. \"Should he decide to run, hes going to be competitive and anyone who takes him lightly is a fool. But everybody starts on the go, and thats probably a hard thing if youve already been the nominee,\" Barbour said. \"2012 in many ways for him is his hurdle.\", For some, potential competition from former Florida Gov. Jeb Bush complicates loyalty to Romney. Gordon Sondland, a hotelier and real estate investor, was a member of Romneys 2012 national finance committee; he co-chaired multiple Southern California fundraising events for Bush last week. He said he and other former supporters took Romney at his word when he said he would not run again. \"Many of us that have other relationships with other candidates have begun coalescing behind and supporting them. Once we do that, we dance with the one that brung us,\" Sondland said. Todd Cranney, who served as Romneys deputy political director in 2012 and hopes he runs in 2016, said Romneys decision would come down to the once and potentially future candidates assessment of the circumstances. \"Mitts not going to sit around and let someone else make decisions for him. Hes going to decide for himself,\" he said. Several Romney advisors noted that President Reagan won the White House on his third attempt, but Stuart Spencer, Reagans chief campaign strategist, dismissed the comparison to the late president. Romney \"didnt win over hearts and minds\" like Reagan did in his first campaigns, Spencer said. \"He was just the opponent of a guy [Republicans] didnt like, named Obama.\", \"I dont think it is good for the party,\" he said of a potential third Romney run. \"They need some new blood and new ideas.  He cant just switch and say, Im the new Romney and get away with it.\", seema.mehta@latimes.com, Twitter: @latseema, mark.barabak@latimes.com, Twitter: @markzbarabak]", "Date": "20150118", "Title": "[Mitt Romney's new focus on poverty has many allies baffled]", "Link": "http://www.latimes.com/nation/politics/la-na-romney-reaction-20150118-story.html\n", "Author": "[Seema Mehta, Mark Z. Barabak]"}
