{"Content": "[Senate leaders moved toward a deal Wednesday to avoid a shutdown of the Homeland Security Department, sidestepping a fight over immigration policy, as President Obama declared his administration would curtail deportations of immigrants in the country illegally despite losing a court fight on the issue this month. Money for the Homeland Security Department has been tied up for weeks as congressional conservatives sought to block the departments budget unless Democrats agreed to a measure repealing Obamas executive actions on deportation. Funds for the department, which oversees immigration and border security, among other duties, will run out Friday night unless lawmakers act. Administration officials say that would force some department employees off the job, while about 85% of the departments more than 200,000 front-line employees would have to work without pay. Senate Majority Leader Mitch McConnell (R-Ky.) has been anxious to avoid even a temporary shutdown of the department, fearing the political risk. On Tuesday, he offered to move ahead with a no-strings-attached bill to provide funds, and on Wednesday, Senate Democrats agreed not to block his plan. Meanwhile, in a meeting with activists in Washington and later in a town hall event in Miami hosted by Telemundo, Obama defended his plan to stop the deportation of several million immigrants who came to the U.S. illegally. The executive action he took was necessary to encourage a large population to come out of the shadows, work and pay taxes, he said. He tried to calm worries about the legal difficulties his plan has encountered, saying at the town hall event that a decision this month by a federal judge in Texas to block implementation of his plan was just one federal judge. His administration has appealed the decision aggressively, Obama said, adding that the legal fight wont slow down the administrations decision to shift the focus of deportations from families to people with criminal records. You are going to see a substantial change even as the case makes its way through the courts, Obama told the group. Obamas trip was the latest sign of the presidents hope to begin shaping the issues of the 2016 presidential race. Democrats hope that a large Latino turnout in their favor, like the ones they enjoyed in 2008 and 2012, will help them again. The immigration issue is key to that. The standoff over the Homeland Security budget has helped heighten the contrast between the two parties on immigration issues, much to the chagrin of some Republican strategists. To end the deadlock, McConnell proposed that the Senate vote to provide money for the department and act separately to overturn Obamas policy. Even if both houses passed a repeal measure, however, Obama could veto it, which the president made clear he would do. If McConnell and House Speaker John A.Boehner want to have a vote on whether what Im doing is legal or not, they can have that vote, he said. I will veto that. Senate Democrats, meeting privately over lunch, decided they would not block McConnells offer of an unencumbered funding bill for the department. They also said they would block the vote on Obamas immigration policy until funds for Homeland Security had been approved by both chambers, ending the shutdown threat. Early Wednesday afternoon, an initial procedural vote to open debate on the money bill passed the Senate, 98 to 2, with the opposition coming from conservative Republicans. This isnt a time for games, said Senate Minority Leader Harry Reid (D-Nev.). Progress in the Senate, though, still means days of knotty procedural votes unless all senators agree to speed up the process. That seems unlikely because several conservative Republicans who are most opposed to the presidents immigration actions would prefer to prolong the fight. \"Its going to be bumpy,\" said Sen. John Cornyn of Texas, the chambers second-ranking Republican. McConnell said he would \"work to expedite\" the process, with the goal being Senate passage \"this week.\" Senate officials, however, said that unless conservatives drop their objections, the earliest the chamber could finish the bill would be Sunday. Were beginning a pathway here, a process, said Sen. Richard J. Durbin (D-Ill.), the minority whip. Were testing the waters of trust. Even if the Senate is able to wrap up its work, there would still be a question of whether Boehnerwould be willing to bring such a bill to the floor of his chamber, where it could pass with Democratic support. Doing so would deeply anger some Republican conservatives. A group of 30 House Republicans wrote to the GOP leadership Wednesday urging them to hold firm against the McConnell plan. We want to stop the amnesty, said Rep. Tim Huelskamp (R-Kan.), who believes linking the immigration fight to the money bill provides Republicans with leverage. Most Americans would not notice a difference in their lives if Homeland Security funds run out, he said. Boehner did not commit himself in comments to reporters Wednesday morning. Im waiting for the Senate to act, he said as he emerged from a closed session of House Republicans before holding his first talks with McConnell in two weeks. Until the Senate does something, were in wait-and-see mode. House Majority Leader Kevin McCarthy (R-Bakersfield) told fellow lawmakers to keep their schedules flexible, a hint that Congress may need to work over the weekend to resolve the standoff or to pass a stop-gap measure to keep the department operating for a few extra days. Florida illustrates the stakes for both parties with Latino voters. Nationwide, Latinos voted for Obama over Republican Mitt Romney in 2012 by almost 3 to 1, according to exit polls, in an election in which Latino voters made up a tenth of the electorate. Obama carried Florida, a key swing state, in both of his elections, largely because of strong margins among Latinos, who make up almost 1 in 5 of the states voters. At the same time, the state has one Republican senator, a Republican governor and Republican majorities in the Legislature, showing that Democrats are far from dominant. The next Democratic nominees prospects in Florida would be further complicated if former Florida Gov. Jeb Bush wins the Republican nod. Obama made it clear what he wants the litmus test to be. When people come asking for votes, Obama said, \"the first question should be, do you really intend to deport 11 million people? If not, what is your plan?\", But Obama and his partys hopes to win Latino votes wont be quite that simple, said Eduardo Gamarra, a professor of politics and international studies at Florida International University, where Wednesdays town hall event took place. Democrats will also need to make a case to a narrower audience that is divided over Obamas Cuba policy, he said. Obama announced in December that he would begin taking steps to restore diplomatic ties with Cuba and gradually bring an end to a five-decade standoff with the communist nation. Young Cuban Americans in and around Miami, home to a large Cuban community, are more open to the presidents strategy than are their parents and grandparents, Gamarra said, citing repeated polls conducted by the university. The president encountered signs of that challenge almost immediately upon arriving Wednesday. Driving from the airport, his motorcade passed a cluster of protesters and a man waving a sign: \"Freedom for Cuba. Helping Castro is a crime.\", For more on the White House, follow@CParsons on Twitter. For Congress, follow @LisaMascaro. Times staff writers Kathleen Hennessey and Brian Bennett contributed to this report from Washington. Parsons reported from Miami and Mascaro from Washington. 4:04 p.m: The story was updated with quotes from President Obamas town hall event in Miami. 2:15 p.m.: The story was updated with quotes from Senate Majority Leader Mitch McConnell (R-Ky.), Sen. John Cornyn (R-Texas) and Rep. Tim Huelskamp (R-Kan.). 12:31 p.m.: The story was updated with the initial Senate procedural vote and more detail on Senate Democrats plans. 11:40 a.m.: The story was updated with an agreement by House and Senate leaders to avoid a shutdown of the Homeland Security Department. 8:41 a.m.: The story was updated with remarks from House Speaker John A. Boehner and House Majority Leader Kevin McCarthy. The story was first published at 8:21 a.m.]", "Date": "20150225", "Title": "[Obama to press ahead on deportation relief as Congress tries to avoid Homeland Security shutdown]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-immigration-20150225-story.html\n", "Author": "[Christi Parsons, Lisa Mascaro]"}
