{"Content": "[\"The arc of the moral universe is long, but it bends toward justice,\" the Rev. Martin Luther King Jr. assured his followers. But was he right?, The arc of American history, at least, has a different shape. During the 19th century, a high point for justice was reached after the Civil War, with Reconstruction Republicans guaranteeing equal protection and voting rights for blacks in the 14th and 15th amendments. But these brave words did not prevent a tragic retreat, from the Gilded Age beginning in the 1880s through the Roaring 20s. By 1929, blacks were barred from the polls, locked in third-rate schools, excluded from white neighborhoods and consigned to menial jobs. All the while, the Supreme Court blessed these retreats in the name of the Constitution. This tragic history haunts us today as we celebrate the 50th anniversary of the Second Reconstruction: the Civil Rights Act, the Voting Rights Act and the Fair Housing Act, of the 1960s. The Second Reconstruction was a far more impressive achievement than its predecessor. After Lincolns assassination, President Andrew Johnson, of Tennessee, did everything in his power to defeat the 14th Amendment. A century later, another presidential assassination opened the way for Lyndon Johnson to lead the nation in a very different direction. LBJ pushed the Civil Rights Act through Congress and defended this achievement in his election campaign in 1964 against Sen. Barry Goldwater. Citing Goldwaters opposition to the act, Johnson appealed to his fellow Southerners in Memphis, Tenn. shortly before the election: \"As a man that has spent all of his life and cast his every vote in Texas, and as the grandson of two Confederate veterans, I think one of the things that we are going to have to do is wipe away the Mason-Dixon Line across our politics.The mandate of this election is going to be a mandate to unite this nation.\", This \"mandate\" is often overlooked in telling the story of Johnsons masterful leadership in pushing the Voting Rights Act of 1965 through Congress. While his constant arm-twisting was important, his landslide victory over Goldwater, including in much of the South, demonstrated that Americans overwhelmingly supported his demand for an end to all forms of voting discrimination. It also opened space for Republicans such as Illinois Sen. Everett Dirksen to build bipartisan support for the presidents initiatives. Goldwaters crushing defeat also allowed Richard Nixon to reenter the presidential sweepstakes as one of those supporters. With the Fair Housing Act stalled in the House in the spring of 1968, Nixon intervened to break the logjam and helped secure its passage. He followed up by conducting a fall campaign that \"conspicuously, conscientiously, calculatedly, denied himself all racist votes, yielding them to [George] Wallace\"  as Theodore H. White explained in his classic book \"The Making of the President 1968.\", The Second Reconstruction, unlike the first, was a bipartisan collaboration, with political leaders joining with the civil rights movement in large acts of statesmanship that gained the consent of the American people in a series of sweeping electoral victories. Despite the remarkable character of this achievement, the arc of justice is now once again in sharp decline, during Americas Second Gilded Age. The Supreme Court is playing a leading role in this act of betrayal. Just as the 19th century court struck down the Civil Rights Act of 1875, which would have banned discrimination in public accommodations and transportation, the Roberts court has struck down key provisions of the modern Voting Rights Act. What is more, it keeps chipping away at other basic principles established during the civil rights era, as in last weeks decision on affirmative action in university admissions. If these dynamics continue, the annual celebration of Martin Luther King Day will turn into a tragic recital of his lost legacy. The way to stop this runaway court is through presidential leadership of the kind we saw half a century ago. In 2016, as in 1964, each party will offer very different visions of our constitutional future: the Republicans defending the Roberts court, the Democrats attacking it. If a Democrat triumphs, he or she will be in a position to fill Supreme Court vacancies with new justices who could call a halt to the further destruction of the civil rights legacy. As in Goldwaters case, a Republican defeat might well open a space for a new generation of leaders determined to reclaim the partys Lincolnian legacy. But its easy to tell another story, one in which Republican victories in 2016 and 2020 serve to accelerate the Roberts courts assault on the Second Reconstruction. Only one thing is clear: As Americans celebrate the civil rights achievements of the day-before-yesterday, their actions in the not-too-distant future will shape the arc of constitutional justice for a very long time to come. Bruce Ackerman teaches law and political science at Yale. His latest book is \"We the People: the Civil Rights Revolution.\"]", "Date": "20140428", "Title": "[Was Martin Luther King wrong?]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-ackerman-lbj-civil-rights-20140428-story.html", "Author": "NULL"}