{"Content": "[Former Los Angeles Mayor Antonio Villaraigosa hasnt said if hes planning to run for governor in 2018. But it sure looks like he is. He said no to the U.S. Senate seat that Barbara Boxer is vacating in 2016. So, why else would he schedule a listening and learning tour and kick it off with a meeting last week with the Fresno Bee editorial board?, No disrespect to the Bee intended; they are former colleagues and I know them to be impressively smart people, just located outside Villaraigosas usual milieu. This foray from his home turf to meet with some of the Central Valleys opinion makers to talk issues was clearly calculated. But to what end? We can only guess. Im guessing this: The GavinNewsom vs. Villaraigosa contest has unofficially begun. Its about two years too early, as far as Im concerned. We have a president and U.S. senator to choose before we should have to think about what comes after Gov. Jerry Brown, who only started his latest four-year term in January. At the moment, the only official candidate in the race is Newsom, the former mayor of San Francisco who is just starting his second term as lieutenant governor. Newsom is raising money and has a campaign website up already. However, he is not yet conducting listening tours of California  or any tours, for that matter -- at least that we know about. But then he has something that Villaraigosa doesnt -- a high-profile elected position, even if it is one so pointless that he famously quipped to the San Francisco Chronicle editorial board in 2012 that it should be eliminated if it could not be improved. This puts Villaraigosa, who hasnt been in elective office since L.A. City Hall in 2013, at a disadvantage. Can he overcome it with an extended campaign prologue? Maybe. But it does mean a long, long gubernatorial campaign. And whos to say voters, not to mention journalists, wont be tired of it, and maybe Villaraigosa too, by then?, Follow me at @MarielGarzaLAT]", "Date": "20150324", "Title": "[Has California's 2018 gubernatorial race already begun? Looks like.]", "Link": "http://www.latimes.com/opinion/opinion-la/la-has-californias-2018-gubernatorial-race-already-begun-looks-like-20150324-story.html", "Author": "[Mariel Garza]"}