{"Content": "[First, Gov. Scott Walker defeated public-sector labor unions. Then, he declawed their private-sector counterparts. Now, just weeks beforehis expected entry into the presidential race, the Wisconsin Republican is staring down another conservative target: college professors. The trifecta could cement Walkers reputation among conservative Republican primary voters as a bold leader willing to battle entrenched interests of the left in the name of reform. But faculty at the states universities  backed by national higher education groups  say he is risking the quality and prestige of one of the countrys leading state universities to fuel his presidential ambitions. The clash of values echoes many that have erupted since Walker took office after the 2010 election. Loud, polarizing debates have punctuated the Walker years. The attention they received has catapulted him into the front ranks of those seeking the GOP presidential nomination. His campaign, expected to formally launch next month, is largely built around his image as a fighter for conservative causes who has won key battles. In this small city, the University of Wisconsins flagship campus, long seen as a liberal bastion, sits less than a mile from the state Capitol, and the lines between the conservative governor and his liberal opponents are sharply drawn. Professors fume at what they regard as a multi-pronged attack. Walkers allies say he and the Republican-majority Legislature are carrying out a mandate for reform on behalf of beleaguered taxpayers. The Legislature is set to vote within weeks on a budget that includes a $250-million cut to higher education over the next two years, roughly an 11% reduction in state support for the university system. More attention has focused on a provision of the budget that removes tenure protection from state law  leaving it in the hands of a board of regents largely appointed by Walker. The proposal would also broaden the power of administrators to eliminate academic positions and departments in the name of efficiency. The president of the board and the UW-Madison chancellor have pledged to maintain tenure and academic freedom. But faculty are skeptical they will have the same iron-clad protections against retaliation for controversial research, particularly the type of scholarship that can leave winners and losers in the marketplace. Chancellor Rebecca Blank told the faculty Monday that the controversy means the school would have a bulls-eye on our back in competing with other institutions for recruits and defending against poaching by rivals. Blank pledged that she would not accept a tenure policy that falls short of peer universities protections and urged professors to band together in preserving the universitys reputation. I know that there are a lot of angry and a lot of very worried and a lot of very upset people, Blank told faculty members during one of several campus forums. My staff can tell you just how angry Ive been at various times over the last five to six months. My role is not to be angry, she said. My role is to figure out how we move forward. Blank said she has been frustrated by headlines declaring the end of tenure. Wisconsin is unusual in enshrining tenure protections for university professors in state statute; at nearly all public universities, tenure is set by administrative policies. The board of regents has approved language that will keep tenure protections in place even if they are removed from state law. But faculty also worry about another section of the budget bill  inserted by the Legislature  that relaxes the ability to lay off professors because of budget issues or changes to academic programs deemed necessary. That sort of open-ended phrase could be used to undermine academic freedom, some faculty members say. As long as this section exists, what we have is not tenure, said David Vanness, a population health sciences professor. Regina Millner, president of the regents who oversee all 26 of the states colleges and universities, said repeatedly during an interview that she and her colleagues were conscious of the need to protect academic freedom for numerous reasons, including the imperativeto compete for top faculty talent. Walker, she said, was trying to provide more financial flexibility to the systems leaders during tight budget times. Walker came into office as a reform candidate, said Millner, who was appointed to her seven-year term by Walker in 2012. Hes comfortable with reform, and he understands that theres going to be a certain amount of angst with any reform. State Assembly Speaker Robin Vos, a Republican, blames faculty members for politicizing the issue by claiming that the tenure changes are more dramatic than they are. ------------, FOR THE RECORD, 8:36 a.m.: An earlier version of this article gave the name of the Wisconsin Assembly speaker as Robin Voss. His name is Robin Vos. ------------, But Walker, too, has dramatized the issue, saying earlier this year that the changes he was proposing for state colleges would be the Act 10 of higher education, a reference to the bill eliminatingcollective bargaining rights for most public employees, which passed early in his term. The drive to pass Act 10 continues to define Walkers governorship to both supporters and detractors. In the months after the law passed, protesters filled the Capitol beyond capacity and unions led an unsuccessful campaign to recall the governor. Today, protestersstill gather almost daily under the rotunda, but their ranks are down to a trickle. On Tuesday, about20 showed up at lunchtime, singing Will the Circle Be Unbroken and unfurling a maroon banner with a fractured outline of the state map atop a broken heart. In March, Walker also signed a right to work bill that curbed the power of private-sector unions. Vos said he initially viewed tenure as an outdated notion but has been persuaded that professors need some protection, citing the example of conservatives who work in campuses dominated by die-hard liberals. But he insisted that tenure should not be simply permanent job protection, particularly for professors who are unproductive or work in outdated fields. Now, if Gov. Walker wants to talk about that on the campaign trail, I guess he can do that, Vos said. But I dont think thats the reason for it. Many professors say they believe that Walker, who dropped out of Marquette University, and would be the first president since Harry Truman without a college degree if he were to win, sees no political upside to placating them. Were seen as this major liberal institution, said Donald Downs, a political scientist who has taught at the school for 30 years. Downs, a national leader in free-speech issues who was active in abolishing faculty speech codes in the 1990s, said the attack on higher education is part of Walkers broader vision to dismantle Wisconsins Blue State model. That strategy, he pointed out, works well with Walkers bid to win the Iowa caucuses by consolidating the support of conservatives just a few months after he signs the budget. Weve been sitting up here as a target for a long time, he said, sitting outside the student union beside Lake Mendota. None of this surprises me at all. Twitter:@noahbierman]", "Date": "20150623", "Title": "[Scott Walker, going for conservative trifecta, takes on tenured professors]", "Link": "http://www.latimes.com/nation/la-na-walker-wisconsin-tenure-20150623-story.html", "Author": "[Noah Bierman ]"}