{"Content": "[In a Gavin Newsom governorship, Californias current bullet train project probably would be derailed. The delta twin tunnels, as presently envisioned, also likely would be buried. Those are Gov. Jerry Browns two big legacy-builders. But Brown will be termed out after 2018, and Lt. Gov. Newsoms goal is to succeed him. The two Democrats see eye-to-eye on many things, but not on the train or the tunnels. Thats useful information because Newsom, 47, the former San Francisco mayor, officially announced last week that hell run for governor in 2018. Newsom didnt trumpet his objections to Browns pet projects in the formal announcement. Quite the opposite. He proclaimed that \"Californians are blessed with the remarkable leadership of Gov. Jerry Brown, who  has led our state to firm fiscal footing and brought us to the enviable position of dreaming  and achieving  big dreams again.\", But I later asked him about two Brown dreams. Newsom, unlike so many politicians, invariably is candid. He thinks the bullet trains financing is too risky and would drain money from other, more necessary infrastructure projects such as roads, transit and waterworks. You recall the history: Voters in 2008 authorized $9 billion in bonds to begin building a 500-mile high-speed rail line from Los Angeles to San Francisco, with later extensions to San Diego and Sacramento. That L.A.-San Francisco first phase was to cost $33 billion. The federal government and private investors, voters were told, would kick in the rest of the money. But the state received only $3.3 billion from the feds and have repeatedly been told by Congress that therell be no more. Private financiers havent put up a dime. The projected cost has more than doubled to $68 billion. And theres no longer any talk about extensions to San Diego or Sacramento, Brown did pick up more funding last year from the Legislature. It appropriated $650 million in cap-and-trade greenhouse emission fees. And it allocated 25% of future cap-and-trade revenue to the project, meaning between $500 million and $1 billion annually. Says Newsom: \"Youd be hard pressed to find a bigger champion of high-speed rail than me when the bond went to voters. I believed in it. But my current problem with it is the financing. I cant in good conscience square what I was supporting then with what were doing today.\", He says Brown is confident the project eventually will attract private investment. \"If so, that changes the game.\", \"But absent something significant  and I mean, really significant  I cant see supporting something that would come at such a high cost to other infrastructure. I dont see how we could go forward. Theres got to be a different financing plan. Without it, the math doesnt add up.\", Concerning the $25-billion twin tunnels  40-foot-wide, 30-mile-long monstrosities under the Sacramento-San Joaquin River Delta that would divert fresh water from the estuary  Newsom leans toward the opposition. \"Im not supportive\" of the proposal, Newsom says, calling it \"too aggressive.\" Hed prefer an alternative thats \"substantially more modest and substantially less impactful\" to the environment. \"Jerry Brown is uniquely positioned to figure this out,\" Newsom adds. \"And his legacy is going to be advanced or diminished by his ability to figure it out.\", Newsom never has been one to shy away from controversy. As San Francisco mayor, he was far ahead of his time by issuing marriage licenses to same-sex couples. In the practically powerless job of lieutenant governor, Newsom early on became impatient with the lack of progress in Sacramento on job creation. So he wrote his own sensible economic growth plan, angering Brown, who felt upstaged. An opponent of the death penalty, Newsom in 2012 publicly supported Proposition 34, which would have abolished capital punishment and substituted life in prison without parole. Brown and Atty. Gen. Kamala Harris  both longtime death penalty opponents  didnt utter a peep. The measure narrowly lost. \"It frustrates me no end,\" Newsom says of the many politicians who kept mum on Prop. 34. \"I get the politics, but \", Now Newsom is trying to craft a coalition and a 2016 ballot initiative to legalize marijuana. \"I cant support the status quo,\" he says. \"The war on drugs is more impactful than the drug itself.\", Besides the wasted money on law enforcement and incarceration, he continues, \"we have an underground economy controlled by bad people. I dont want the drug dealer being the arbiter of who marijuana is appropriate for.\", He wants to keep pot away from kids. \"Theres no question that for young kids it has a significant impact on brain development,\" he says. \"And it scares me as a parent. I dont like the smell. I dont want it in a park or playground.\", But, of course, he has smoked weed, right?, \"Its a weird thing,\" he replies. \"I dont like to admit it. Nobodys going to believe me. I almost want to lie and say I did. But it was never my thing. \"I was more interested in wine and beer, which Id argue have a more negative impact. Im a restaurant and bar owner and own three wineries. I cant moralize about marijuana when Im sitting there selling alcohol.\", Newsoms candidacy announcement was probably the earliest of anyone in history. No playing coy. Good for him. Its upfront and honest. It gives us nearly four years to ask more questions  and for Brown to retool the train and tunnels. Twitter: @LATimesSkelton]", "Date": "20150215", "Title": "[On train, tunnel, Newsom would change course from Brown]", "Link": "http://www.latimes.com/local/california/la-me-cap-newsom-20150216-column.html\n", "Author": "NULL"}
