{"Content": "[Theres a moment in season eight of the HBO comedy \"Curb Your Enthusiasm\" when the character Larry David (played in duly neurotic and cantankerous fashion by the real Larry David) discovers the transformative power of eyeglasses. When his friend Leon, an African American with a penchant for baggy pants and gold chains, is barred from an event being held in a snooty hotel, Larry suggests that white acceptance might be simply a matter of the right accessory. \"Ive noticed that white people revere black people in glasses, go out of their way to do stuff with them,\" Larry tells Leon. \"A black man with glasses goes out for a job against a white man, glasses get the job. No glasses, no job.\", Sure enough, Leon puts on a pair of smart-looking specs and, even though the event is sold out and Larry himself is turned away, hes immediately ushered in. \"This is better than anything the civil rights leaders have ever come up with!\" Larry exclaims. \"I have overcome,\" says Leon earnestly. Is Rick Perry trying to pull off a similar trick with his glasses? Ever since the former Texas governor announced his candidacy for the Republican presidential nomination last week, theres been much talk about whether Perry 2.0 will be discernibly smarter than the candidate we saw back in 2011. His famous \"oops\" moment  when he announced during a debate that he would shut down three major government agencies but couldnt remember the third one  sealed his reputation as a something of a good-old-boy airhead. But today, wearing dark-rimmed, nerdy-cum-arty frames, Perry looks, if not exactly professorial, at least like he wouldnt stand out at a gallery opening. In fairness, the Jean Lafont glasses, which Perry says his wife picked out, may not be overtly part of his campaign strategy. For starters, hes been wearing them since 2013. Whats more, it seems likely that Anita Perry chose this style simply because its often remarkably flattering. Obviously this is subjective, but Ive long noticed that when even the plainest person puts on a pair of dark, rectangular frames, he or she looks at least 60% more attractive. For instance, actor Paul Giamatti, not known for having an especially traditional Hollywood look, can thank his eyewear for kicking him up several notches in the appearance department. Perry, who was already a reasonably good-looking man, could pass for an aging male model in his glasses (the kind of guy you see in print ads for geriatric vitamins or retirement investment funds). At least if he lost that giant Aggie ring. Perrys frame style has its own taxonomy. The domain is Buddy Holly; the kingdom, Elvis Costello; the phylum, Tina Fey and so on. Personally, though, I like to call them Ira Glasses. Not just because theyve always been integral to the signature look of the host of NPRs \"This American Life\" but because the style seemed to gain cultural traction in the late 1990s and early aughts. Thats when the programs edgy, alternative vibe went from being something that only cool people knew about to something that (much to the distress of the cool people) everyone was hip to. The glasses frames had a similar trajectory. Formerly available mostly at vintage stores or high-end urban boutiques, by 2001 they could be found at any LensCrafters. Sure, their sharp lines and dark color still qualified them as \"statement eyewear.\" Its just that the statement basically amounted to \"Im different in exactly the same way everyone else is.\", Though there might be some truth to the theory that Perrys choice of eyewear represents an attempt to look smarter  or at least less dumb  I suspect theres an even subtler form of messaging in play. By sporting Ira Glasses, Perry may also be trying make himself more palatable to moderates and young people. Thats because the glasses dont say \"I know perfectly well what three government agencies Id shut down\" as much as \"I may support gun rights and not gay rights but that doesnt mean Im afraid to skew a little metrosexual\" (theres another late 90s/early aughts term for you). They dont say \"Im smart\" as much as \"Im not a redneck.\", Which is all well and good. Though, as Larry David would point out, Perry still wouldnt stand a chance against a bespectacled Leon. mdaum@latimescolumnists.com, Twitter: @meghan_daum, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150611", "Title": "[ Will smart-looking glasses do the trick for Rick Perry? ]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-daum-rick-perry-glasses-20150611-column.html\n", "Author": "NULL"}
