{"Content": "[Rep. Lois Capps, a former nurse known for a kind demeanor in a Congress where that quality is often lacking, announced Wednesday that she would retire when her term expires next year. The Santa Barbara Democrat was elected to Congress in a 1998 special election to replace her husband, Walter, after his death. She said in a video that it is time for me to return home, back to the community and family that I love so much. Its been a hard decision to make, for I have loved this job, she added. Capps, 77, initially signed a pledge to serve no more than three terms in Congress  a limitation that expired a decade ago. President Obama lauded Capps for a lasting legacy of service. She has led efforts to increase access to healthcare, improve mental health services, detect and prevent domestic violence, protect our environment, and improve education  all while consistently being voted the nicest member of Congress, Obama said in a statement. House Minority Leader Nancy Pelosi called Capps a steadfast champion for protecting public lands, providing affordable education to all children and fighting for the resources families need to live healthier lives. Capps most notable work has been in healthcare and nursing. For example, she wrote a provision in 2000 giving grants for childrens dental care and a 2002 law providing scholarships and grants designed to train more nurses. She was named the nicest member of the House most recently in 2014 in a poll of congressional staff conducted by Washingtonian magazine. Her retirement opens a seat potentially viable for Republicans, but one that will be contested in a presidential year, in which Democratic turnout typically rises. The narrow slice of the Central Coast became more competitive in 2012 after redistricting. Democrats hold a narrow lead in party registration over Republicans, 37% to 34%, according to the California Target Book, a nonpartisan election compendium. More than 1 in 5 voters registered as nonpartisan. Capps won with 52% of the vote in November. The Cook Political Report, a nonpartisan political handicapper, said Wednesday that the seat remains likely Democratic, even after Capps retirement. But Allan Hoffenblum, publisher of the Target Book, said he believes it will be competitive enough that Republicans will consider it a target, especially if the GOP fields a strong presidential candidate to draw Republican voters to the polls. Santa Barbara Mayor Helene Schneider, a Democrat, jumped into the race on Wednesday, hours after Capps departure was announced. Another potential Democratic contender is Capps daughter Laura Burton Capps, a former speechwriter for Bill Clinton who also served as an aide to Sens. John F. Kerry and Edward M. Kennedy. Laura Capps and her husband, political consultant Bill Burton, purchased a house in Santa Barbara two years ago, Burton said. Laura Capps, who declined to comment, runs a consulting firm. Justin Fareed, a Republican who ran for the seat previously, formed a political committee six weeks ago for a new bid. It certainly will get far more interesting than it may have been, but the issues are still the same and the difficulties are going to be the same, said Fareed, a former Capitol Hill staffer who works in his familys manufacturing business. Fareed, who is one month shy of his 27th birthday, said he has raised $100,000 since entering the race. GOP Assemblyman Katcho Achadjian said he also is leaning toward running and will meet with advisors and family members this weekend before announcing his decision the following weekend. The announcement of her retirement put us in the faster lane to make a decision, even though weve been talking about it, Achadjian said. Twitter: @noahbierman]", "Date": "20150408", "Title": "[Rep. Lois Capps of Santa Barbara announces she will retire in 2016]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-lois-capps-retirement-20150408-story.html\n", "Author": "NULL"}
