{"Content": "[Republicans eager to dislodge Donald Trump from his perch at the top of primary polls and reset the turbulent 2016 presidential race showed new willingness to directly confront the real estate magnate in a marathon debate Wednesday, questioning his temperament, authenticity and conservative bona fides during a critical showdown at the Reagan Presidential Library. For one-time front-runner Jeb Bush, that meant going toe-to-toe with Trump over his business record while portraying himself as a steady hand. For Wisconsin Gov. Scott Walker, who spiked in early polling but fell to earth as Trump took off, it meant highlighting his successful battles with labor unions while rebutting the Democratic talking points he said Trump had borrowed. Who needs three hours of debate? Cathleen Decker and Mark Z. Barabak boil it down to two minutes ofthe best moments and the notable misses. Who needs three hours of debate? Cathleen Decker and Mark Z. Barabak boil it down to two minutes ofthe best moments and the notable misses. We dont need an apprentice in the White House, he said to Trump, in a jab at Trumps old TV show. We need someone who can actually get the job done. And for Carly Fiorina, the former business executive who graduated to the main debate after a shining performance in last months undercard forum, it meant dismissing Trump as an entertainer while positioning herself as someone who could withstand the grind of a national campaign. Trump seemed to nod toward humility in his opening statement, eschewing a braggadocious style, but he quickly reverted to form. He zinged Kentucky Sen. Rand Paul over his low poll numbers after Paul called him sophomoric, and he noted that Walker went down the tubes in Iowa. At one early point, as he and Bush sparred, Trump tweaked his rival by acknowledging Bushs newly aggressive approach: More energy tonight. I like that. For the sprawling cast of Republican presidential contenders running in Trumps shadow, the debates in Simi Valley offered a chance to make their cases before a television audience likely in the tens of millions. But it also emerged as a test of viability for once-touted contenders whove been upstaged by political outsiders, and others suddenly struggling to demonstrate they still belong in the conversation at all. It also proved to be something of an endurance test for the leading contenders, as they answered questions for more than three hours on topics including immigration and abortion, terrorism and the Iran nuclear deal, and even vaccinations and which woman should appear on the $10 bill. But once again it was Trump at the front and center, both literally and figuratively. The urgency of confronting him was clear immediately. In the preliminary debate among four GOP hopefuls lagging in the polls, Trump was not present but was frequently discussed. The best way for us to give this election back would be to nominate a Donald Trump, Louisiana Gov. Bobby Jindal charged. Hell implode in the general election. In the main debate, Trump was flanked this time by Bush and Dr. Ben Carson, another surging candidate who has confounded race handicappers. He highlighted his personal story and outsider status with a much softer tone than Trumps. When I entered this race, all the political pundits said its impossible, he said. But the pundits forgot about one thing, and that is the people. And they are really in charge. Staged before the blue and white Air Force jet that Ronald Reagan flew in as president, the clashes revealed the extent to which the Gippers political party has broken with him in practice, even as many continued to speak reverently of him. Reagan signed a major immigration reform bill during his two terms, and even openly referred to the policy as amnesty, for instance. South Carolina Sen. Lindsey Graham, one of the co-sponsors of a comprehensive immigration reform plan that passed the Senate in 2013, challenged others on immigration during a well-reviewed performance where he flashed a self-effacing sense of humor. In my world, Hispanics are Americans, he said. Bush also used immigration to challenge Trump directly, contrasting what he said was the Reagan-style optimistic approach with the Trump approach that says that everything is bad. He demanded Trump apologize to his wife, a Mexican American, for invoking her during the campaign. Trump declined to do so, insisting he had done nothing wrong. When Fiorina took Trump on, it was when asked to respond to Trumps disparaging remark over her appearance. I think women all over the country heard very clearly what Mr. Trump said, she said. By necessity more than by choice, the candidates also broke the so-called 11th Commandment long attributed to Reagan  that thou shalt not speak ill of a fellow Republican. CNNs Jake Tapper, the lead questioner Wednesday, delivered on his pledge to force the candidates into direct confrontation. But some strategically stayed out of the fray. If I were sitting at home and watching the back-and-forth, I would be inclined to turn it off, Ohio Gov. John Kasich said. I mean, people at home want to know -- across this country, they want to know -- what were going to do to fix this place. @mikememoli, @LATseema, Mehta reported from Simi Valley and Memoli from Washington. Times staff writer Lisa Mascaro in Washingtoncontributed to this report. MORE POLITICS COVERAGE, Aboard the battleship Iowa, Trump plans to talk national security, State politicians grab at Trumps coattails, seeking reflected attention, Sisters, top advisors with opposing views, bring California influence to campaign trail, 8:40 p.m.:This story was updated with more detailsfrom the debate. 7:19 p.m.:This story was updated with details from the nights second debate. 5:15 p.m.:This story was updated with details from the first debate of the night. 3:25 p.m.: This story was updated with new details throughout. This story was originally published at 11:18 p.m.]", "Date": "20150916", "Title": "[Rivals target Trump in bid to gain traction in second Republican presidential debate]", "Link": "http://www.latimes.com/nation/politics/la-na-gop-debate-20150915-story.html", "Author": "[Michael A. Memoli, Seema Mehta]"}