{"Content": "[When President Obama joked to African Union leaders Tuesday about his theoretical ability to win a third-term if not for the U.S. Constitution, he was speaking to a group of men notorious for clinging to power. \"I love my job,\" Obama told leaders at the AU headquarters in Ethiopia. \"But under our constitution, I cannot run again. I actually think Im a pretty good president. I think if I ran, I could win. But I cant.\", It was a message deliberately targeted to African leaders who all too often refuse to abide by their own countries presidential term limits, most of which were put in place at the urging of Western powers. More than a half-dozen countries have simply repealed term-limit laws to allow sitting presidents to remain. This week, Zimbabwean President Robert Mugabe, in power since 1987, likened the two-term limit to a rope around the neck for African leaders. He dismissed term limits as a Western concept that doesnt work on the continent, even though his nation adopted two five-year terms limits in 2013. ------------, July 28, 3:56 p.m.: An earlier version of this article referred to Mwai Kibaki as Daniel Arap Mois predecessor. In fact, he was Mois successor. ------------, Of the current leaders of the more than 50 member states of the AU, three men have been in power since the 1970s, four since the 1980s and eight since the 1990s. Heres a look at how some African countries have handled term limits:, Burundian President Pierre Nkurunziza this month won a third term, even though the countrys parliament voted to preserve the constitutional two-term limit. He is arguing that because his first election came through parliament, not a direct vote of the people, it didnt count as his first term. Facing pressure to step down after his second term in 2016, President Joseph Kabila failed to change term-limits law amid violent protests and then delayed setting an election date. A vote is now scheduled for November 2016. Former Kenyan big man Daniel Arap Moi won international praise in 2002 for stepping down after 24 years, following Kenyas adoption of term limits. His successor, Mwai Kibaki, also served two terms. Paul Kagame took control after the 1994 genocide, but wasnt officially elected until 2003 under the new constitution that limits the president to two seven-year terms. His test will come in 2017. Nelson Mandela was elected in 1994, stepping down after one term in hopes of setting a good example, even though by law he could have run again. In office since 1986, Yoweri Museveni in 2005 repealed a clause in the constitution that imposed two-term limits. He ran and won again in 2006 and 2011. See the most popular stories this hour >>, Longest reigns in Africa, Here are some of Africas , longest-serving leaders:, Sahrawi Arab Democratic Republic, Pres. Mohamed Abdelaziz, 90, 76, 80, 00, 10, 15, 39 yrs. *, Republic of Angola, Pres. Jos Eduardo dos Santos, 36, Republic of Equatorial Guinea, Pres. Teodoro Obiang Nguema Mbasogo, 36, Republic of Cameroon, Pres. Paul Biya, 33, Republic of the Congo, Pres. Denis Sassou-Nguesso, 31, **, Kingdom of Swaziland, King Mswati III, 29, Republic of Uganda, Pres. Yoweri Museveni, 29, Republic of Zimbabwe, Pres. Robert Mugabe, 28, Republic of Sudan, Pres. Omar Hassan Ahmed Albashir, 26, ***, The Republic of Chad, Pres. Idriss Dby Itno, 25, State of Eritrea, Pres. Isaias Afewerki, 24, ****, Republic of the Gambia, Pres. Yahya Jammeh, 21, *In power since 1976. Became president in 1982 for a total of 39 years in office. **Also served in 1979-92 for a total of 31 years in office. ***In power since 1989 for a total of 26 years in office. ****In power since 1991. Became president in 1993 for a total of 24 years in office. Longest reigns in Africa, Here are some of Africas longest-serving leaders:, Sahrawi Arab Democratic Republic, Pres. Mohamed Abdelaziz, 90, 76, 80, 00, 10, 15, 39 yrs. *, Republic of Angola, President Jos Eduardo dos Santos, 36, Republic of Equatorial Guinea, Pres. Teodoro Obiang Nguema Mbasogo, 36, Republic of Cameroon, Pres. Paul Biya, 33, Republic of the Congo, Pres. Denis Sassou-Nguesso, 31, **, Kingdom of Swaziland, King Mswati III, 29, Republic of Uganda, Pres. Yoweri Museveni, 29, Republic of Zimbabwe, Pres. Robert Mugabe, 28, Republic of Sudan, Pres. Omar Hassan Ahmed Albashir, 26, ***, The Republic of Chad, Pres. Idriss Dby Itno, 25, State of Eritrea, Pres. Isaias Afewerki, 24, ****, Republic of the Gambia, Pres. Yahya Jammeh, 21, *In power since 1976. Became president in 1982 for a total of 39 years in office. **Also served in 1979-92 for a total of 31 years in office. ***In power since 1989 for a total of 26 years in office. ****In power since 1991. Became president in 1993 for a total of 24 years in office. Longest reigns in Africa, Here are some of Africas longest-serving leaders:, 1976, 80, 90, 00, 10, 15, Sahrawi Arab Democratic Republic, President Mohamed Abdelaziz, 39 yrs. *, Republic of Angola, President Jos Eduardo dos Santos, 36, Republic of Equatorial Guinea, President Teodoro Obiang, Nguema Mbasogo, 36, Republic of Cameroon, President Paul Biya, 33, Republic of the Congo, President Denis Sassou-Nguesso, 31, **, Kingdom of Swaziland, King Mswati III, 29, Republic of Uganda, President Yoweri Museveni, 29, Republic of Zimbabwe, President Robert Mugabe, 28, Republic of Sudan, President Omar Hassan Ahmed Albashir, 26, ***, The Republic of Chad, President Idriss Dby Itno, 25, State of Eritrea, President Isaias Afewerki, 24, ****, Republic of the Gambia, President Yahya Jammeh, 21, *In power since 1976. Became president in 1982 for a total , of 39 years in office. **Also served in 1979-92 for a total of 31 years in office. ***In power since 1989 for a total of 26 years in office. ****In power since 1991. Became president in 1993 for a , total of 24 years in office. Longest reigns in Africa, Here are some of Africas longest-serving leaders:, 1976, 80, 90, 00, 10, 15, Sahrawi Arab Democratic Republic, President Mohamed Abdelaziz, 39 yrs. *, Republic of Angola, President Jos Eduardo dos Santos, 36, Republic of Equatorial Guinea, President Teodoro Obiang Nguema Mbasogo, 36, Republic of Cameroon, President Paul Biya, 33, Republic of the Congo, President Denis Sassou-Nguesso, 31, **, Kingdom of Swaziland, King Mswati III, 29, Republic of Uganda, President Yoweri Museveni, 29, Republic of Zimbabwe, President Robert Mugabe, 28, Republic of Sudan, President Omar Hassan Ahmed Albashir, 26, ***, The Republic of Chad, President Idriss Dby Itno, 25, State of Eritrea, President Isaias Afewerki, 24, ****, Republic of the Gambia, President Yahya Jammeh, 21, *In power since 1976. Became president in 1982 for a total of 39 years in office. **Also served in 1979-92 for a total of 31 years in office. ***In power since 1989 for a total of 26 years in office. ****In power since 1991. Became president in 1993 for a total of 24 years in office. Longest reigns in Africa, Here are some of Africas longest-serving leaders:, 1976, 80, 90, 00, 10, 15, Sahrawi Arab Democratic Republic, President Mohamed Abdelaziz, 39 yrs. *, Republic of Angola, President Jos Eduardo dos Santos, 36, Republic of Equatorial Guinea, President Teodoro Obiang Nguema Mbasogo, 36, Republic of Cameroon, President Paul Biya, 33, Republic of the Congo, President Denis Sassou-Nguesso, 31, **, Kingdom of Swaziland, King Mswati III, 29, Republic of Uganda, President Yoweri Museveni, 29, Republic of Zimbabwe, President Robert Mugabe, 28, Republic of Sudan, President Omar Hassan Ahmed Albashir, 26, ***, The Republic of Chad, President Idriss Dby Itno, 25, State of Eritrea, President Isaias Afewerki, 24, ****, Republic of the Gambia, President Yahya Jammeh, 21, *In power since 1976. Became president in 1982 for a total of 39 years in office. **Also served in 1979-92 for a total of 31 years in office. ***In power since 1989 for a total of 26 years in office. ****In power since 1991. Became president in 1993 for a total of 24 years in office. Sources: African Union, Times reporting. Graphics reporting by Edmund Sanders, Lorena Elebee @latimesgraphics, MORE ON OBAMA, Obama: Huckabees oven comment shows pattern of GOPs outrageous attacks, Obamas Africa trip was a delicate dance of diplomacy, Rights groups criticize Obama for calling Ethiopias election democratic]", "Date": "20150728", "Title": "[In Africa, where many leaders cling to power, Obama's joke about a third term had an edge]", "Link": "http://www.latimes.com/world/africa/la-fg-africa-leaders-power-obama-20150728-htmlstory.html\n", "Author": "NULL"}
