{"Content": "[If Donald Trump were running against Bernie Sanders in the general election next year, Americans would face a choice between an unabashed capitalist and an enthusiastic socialist. One candidate would rail against the power of the billionaire class, while the other once said that part of the beauty of me is that I am very rich. On many levels, the contrast between the two candidates in this hypothetical  and highly unlikely  matchupwould be stark. But its what they have in common thats made them the men with the momentum this summer. Both Trump, the real estate tycoon, and Sanders, the independent senator from Vermont, are tapping into anti-establishment, pro-outsider sentiment that is emerging as a potent force early in the campaign cycle. Years of dissatisfaction with Washington leaders, along with a thirst for authenticity in politics, is leading voters to at least contemplate something different this year  dramatically different. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, While the primary races are still six months from any ballot being cast, the first phase has become the \"disrupter\" summer, where candidates who promise to upend the system are rising fast and those promising merely to fix it seem stuck. The long, hot trend was unavoidable over the last week as Sanders, who is seeking the Democratic nomination, drew a total of 60,000 people to rallies in Seattle, Portland, Ore. and Los Angeles, and for a second week appeared to be very close in polls with Hillary Rodham Clinton in New Hampshire. Trump, meanwhile, managed to again defy punditry by holding his lead in the race for the Republican nomination after he made comments that would have killed another candidacy. Pollsters caution against making too much of early polls influenced heavily by name recognition, media attention and, on the GOP side, considerable voter indecision. Still, some conditions are ripe for outbursts of anti-establishment sentiment, particularly among Republicans. Along with continued low marks for government institutions and lukewarm feelings about the economy, Americans dont think much of the two parties. The GOPs approval rating sunk to 32% in a recent Pew Research survey, one of the lowest numbers in more than two decades, said Carroll Doherty, director of political research for the organization. One of the main reasons for that is that Republicans themselves are giving the party relatively low ratings, including the party leaders in Congress, he said. You see a real restiveness among Republicans, and its clearly having an impact in the presidential campaign. And while displeasure with Capitol Hill is not new, the number of Republicans viewing their party favorably has plummeted in just the last six months, from 86% to 68% in the Pew survey this month. Both campaigns acknowledge  albeit somewhat reluctantly  that they share common undercurrents. On the one hand, I find the comparison preposterous, said Tad Devine, a longtime Democratic strategist and Sanders advisor. Aside from some similar-sounding populist rhetoric on trade and on campaign finance, the two mens views are diametrically opposed. On the other hand, I understand why people are looking for some commonality to whats going on. I think theyre both candidates who are cutting through the typical back-and-forth of politics.  Theres this recognition on the part of voters that this is a guy who says exactly what hes thinking at the moment. I think with Trump, too, people believe that theyre hearing what hes thinking. For voters who are used to canned responses, teleprompter speeches and things that are much more packaged, I think thats refreshing. Trump, speaking this week on MSNBCs Morning Joe, also noted the similarities. Hes struck a nerve on the other side and Ive struck, I think, an even bigger nerve on the Republican side, the conservative side. Its amazing, he said. Other candidates are also amazed  and looking for a way to hit the same nerve, no matter how unlikely their chances of posing as unpolished outsiders. Several have labeled themselves disrupters, borrowing a word once in vogue to describe Silicon Valley innovators. Last month, Jeb Bush, arguably the Republican with the most establishment backing in the race, declared he was running to disrupt the established order, change the culture and make possible the real changes that this nation needs. Clinton, as she outlined her version of Sanders critique of Wall Street, said she was looking for new creative, innovative, disruptive ideas that will save capitalism for the 21st century. Meanwhile, candidates who were once viewed as the bomb throwers in the race have turned to calling out the others. Republican Sen. Rand Paul held a conference call with reporters this week in which he decried Trump as a phony and a an empty suit full of bravado but not anything meaningful for the country. He followed up with a video casting Trump as a closeted Democrat. His campaign argues that Rand is the disrupter who can get elected. Most disrupters today in the news are heavily lagging behind Hillary Clinton. Sen. Paul is an outsider taking on the Washington machine, but hes literally the most electable\" against Clinton, said Paul spokesman Sergio Gor. Indeed, even as voters have been drawn to both Trump and Sanders it is not because they believe these men will win. In a Franklin Pierce University-Boston Herald poll released this week, 37% of GOP voters said they believed Bush would win the nomination, compared with 16% who thought Trump would win. Among Trump backers, none said they supported him because he has the best chance of winning the general election, but 45% said they backed him because he would lead in a new direction. Three-quarters of the likely Republican voters surveyed said they could change their minds. On the Democratic side, too, even as Sanders support has risen, most voters told pollsters they still viewed Clinton as the likely nominee. Electability isnt the only thing that may eventually take the steam out of the disrupters rise. Some argue that while many voters say they are looking for someone to shake things up, when pollsters drill for specifics, voters say they are looking for more than that. When they talk about an outsider, what theyre really looking for is a problem-solver, said one GOP candidates strategist who asked not to be name discussing the campaigns thinking. That means candidates with experience passing reforms and governing  the bevy of governors past or present in the GOP race  may fare better if they can get their message to voters, the strategist said. But that will mean cutting through the buzz behind Sanders and Trump. Googles tracking of the most-searched presidential candidate recently found Sanders on top in Vermont, Oregon and Washington. Trump prevailed in the other 47 states. For more campaign-trailcoverage, follow @khennessey, MORE ON THE 2016 CAMPAIGN:, In Jeb Bushs foreign policy speech, George W. Bush goes missing, Whats Whitewater? These voters know less than you think about Hillary Clinton, Why a huge Los Angeles crowd turned out for Bernie Sanders]", "Date": "20150814", "Title": "[The populist sentiment fueling both the Bernie Sanders and Donald Trump campaigns]", "Link": "http://www.latimes.com/nation/politics/la-na-trump-sanders-20150814-story.html\n", "Author": "[Kathleen Hennessey]"}
