{"Content": "[Hundreds of Taiwanese students were locked in a standoff with authorities in Taipei on Friday after storming the national legislature and surrounding the Education Ministry in a protest over new curriculum guidelines. Anguished by the apparent suicide of one student protest group member on Thursday, the demonstrators were demanding the resignation of Education Minister Wu Se-hwa and the shelving of the guidelines. They also want authorities to drop all legal charges against a group of activists who stormed into Wus offices last week. Tensions over the guidelines for high school history classes, due to take effect Saturday, have been mounting since last year, and the debate is becoming a political issue in the run-up to the islands 2016 presidential election. The revisions were initiated by the Education Ministry in 2014. Officials with the ruling Nationalist Party describe them as minor changes intended to make the curriculum more factually accurate and to emphasize Taiwanese identity. But opponents have charged that the revisions whitewash Taiwans authoritarian period under Nationalist rule before it became a democracy in the early 1990s, and amount to inserting pro-mainland China ideology into the curriculum. In particular, they complain that a violent crackdown on student protesters in 1947 by the Nationalist government has been left out of the curriculum. Critics also allege that the revision process was not conducted in a fully transparent manner, and complain about the composition of the panel that formulated the changes. Among its members was a professor who also serves as vice chairman of a group called the Alliance for the Reunification of China. Wu refused Friday afternoon to step down and said he would work to resolve the conflict. He reiterated that the new guidelines were not mandatory and that it was up to individual schools and teachers to decide what textbooks to adopt. Educators are still free to use older textbooks written before the recent guidelines. Taiwan has been self-ruled since Chinas civil war ended in 1949, with Chiang Kai-sheks Nationalists fleeing to the island after being defeated by the Communists on the mainland. But Communist Party leaders in Beijing regard Taiwan as a renegade province and part of one China, and insist that the two sides must eventually be reunited. Under President Ma Ying-jeou of the Nationalist Party, Taiwan has pursued closer trade ties with the mainland. Businesses and others have welcomed the economic rapprochement but some constituencies, particularly young people, have eyed the closer ties with some skepticism. In March and April 2014, students opposed to a trade pact with the mainland stormed the legislature in protest, in a development that became known as the Sunflower Movement. The occupiers argued that the agreement could damage Taiwans economy and open it to greater political pressure from Beijing. The curriculum revisions have struck a similar nerve. Last week, 33 people, including 24 students, were arrested after occupying the Ministry of Education on July 23. Among them was a 19-year-old, Dai Lin, a member of the Northern Taiwan Anti-Curriculum Changes Alliance. Lin was found dead Thursday, his 20th birthday, at his home in an apparent suicide, the Taiwan Times reported. Mourners were planning a candlelight vigil Friday evening in his honor. Visiting the demonstrators on Friday afternoon, the mayor of Taipei, Ko Wen-je, called on Wu to face up to the students as soon as possible to reach a deal and conclusion. Taiwan should not be involved in a war of extremism because of ideological issues, he added, while urging students to protest with reason and peace and advising them that police are not public enemies. But the protests may go on for some time, said J. Michael Cole, a senior non-resident fellow at the University of Nottinghams China Policy Institute and a researcher at theThinking Taiwan Foundation, a think tank launched in 2012 by Tsai Ing-wen, who is now the Democratic Progressive Partys nominee for the 2016presidential election. Wu is unlikely to step down and the government is unlikely to freeze or mothball the proposal, Cole said. The Nationalists are behind in the polls for the 2016 election, he noted, while Tsai is ahead. \"With their expected loss in the Jan. 16 elections, there is less pressure on [the Nationalists]to do what society wants, so the Maadministration could very well stick to its position,\" he said. \"Looks like we might be in this for the long haul.\", Harvard Zhang, Nicole Liu and Tommy Yang in the Times Beijing bureau contributed to this report. 4 a.m.: This article has been updated with quotes from analyst J. Michael Cole. This article was originally published at 2:07 a.m.]", "Date": "20150731", "Title": "[Taiwan students storm legislature, Education Ministry in curriculum protest ]", "Link": "http://www.latimes.com/world/asia/la-fg-taiwan-students-protest-20150731-story.html", "Author": "[Julie Makinen]"}