{"Content": "[China marked the 32nd anniversary of its constitution this week with unprecedented fanfare -- and continued violations of citizens rights. The nations first-ever Constitution Day was held Thursday, with celebrations across the country. Thousands of schools staged readings of the 135-article document, while national television aired images of judicial employees swearing an oath to the text. In Shanghai, officials organized screenings of two American films, The Shawshank Redemption and Training Day, which authorities said showed the dangers of corruption and promoted awareness of the law. As the nominal backbone to Chinas government, the constitution outlines the structure of the state and general principles of the government, and lists the rights of citizens -- including freedom of speech, religion and assembly. But the document also clearly states the primacy of the Communist Party, and without a system of checks and balances, the state frequently runs roughshod over what it claims to protect. The party almost never adheres to the constitution if other interests outweigh that. It tends to hold itself above the constitution, said Michael Davis, a professor specializing in constitutionalism and international law at Hong Kong University. When it comes to enforcement of the constitution, theres virtually none. But Communist officials are trying to shore up public support by uprooting a deeply entrenched culture of corruption and curbing abuses of power. The newfound rhetorical attention lavished on the constitution is part of a broader effort to make the legal system more effective -- if not independent. Legal reform was the key topic at a major conclave of the Communist Party in October.The party vowed to increase implementation of the constitution, with a declaration afterward asserting that everyone in society must regard the constitution as the fundamental guideline of their activities. The National Peoples Congress later designated Dec. 4 as Constitution Day to promote awareness. The general public and officials awareness of the constitution is not fully in place, state-run media outlets said in an editorial this week. Some officials, including those from law enforcement agencies and judicial departments, have abused their power, infringing on citizens rights. But many experts outside China are skeptical that meaningful change is afoot. Chinas courts do not have a system of judicial review and cannot declare laws unconstitutional. Citizens are routinely thwarted in their attempts to exercise rights enshrined in the constitution. Because the party has unrestrained control over interpreting the constitution, critics say a new emphasis on the document in fact will only make the party stronger. A group of demonstrators who sought to voice their grievances with the government on Constitution Day found police blocked them from protesting in Tiananmen Square and in front of the headquarters of CCTV, the national broadcaster. Officers also scuffled with some of the demonstrators. Open discussion of constitutionalism was also curtailed. Forums on search engine Baidu titled The Constitution and Constitutional Governance were blocked by censors. (Party officials regard constitutionalism as a code word for Western-style democracy, an idea they cannot tolerate.), In an editorial, nationalistic newspaper the Global Times claimed this week that many Chinese have committed unconstitutional deeds because they do not understand the document and their rights. Among those they cited was Nobel Prize winner Liu Xiaobo, a democracy campaigner who was convicted of subversion and sentenced to 11 years in prison in 2009. Not only government officials, but radical activists have also violated the constitution, the editorial claimed. The most well-known is Liu Xiaobo and his Charter 08 movement in 2008. His actions were nothing but defiance of the constitution. The Charter 08 manifesto called for separation of powers, an independent judiciary and elections, complaining that Chinas political progress has largely remained on paper: there are laws, but there is no rule of law; there is a constitution, but no constitutional government. ... The ruling elite continues to insist on its authoritarian grip on power. The first demand of Charter 08 was amending the constitution, asking that it become a law that no individual, party or group could violate. Silbert is a special correspondent.]", "Date": "20141205", "Title": "[On first-ever 'Constitution Day,' China touts and flouts rights]", "Link": "http://www.latimes.com/world/asia/la-fg-constitution-day-china-touts-and-flouts-rights-20141205-story.html\n", "Author": "NULL"}
