{"Content": "[President Obamas standing with the public likely will continue its recent upward trend following the latest positive economic news, but new data on the countrys polarized politics suggests hell soon bump up against a low ceiling. The labor market data released by the federal government on Friday showed the best three months of job growth since the mid-1990s, an increase in the percentage of Americans who are working and the first signs of wage growth. Thats the kind of good news that usually sends presidential approval ratings upward. But political polarization exerts a powerful pull in the other direction: Much like President George W. Bush before him, Obama faces near unanimous disapproval from opposing partisans that is deeply dug in and unlikely to change. Gallups latest analysis of a years worth of polling data illustrates the depth of the polarization. Across his sixth year as president, Obama averaged 79% approval from fellow Democrats but only 9% from Republicans. In the history of Gallups survey, that 70-point partisan gap is unrivaled, except for Bush, whose ratings in year six were identical to Obamas but with the party labels switched. Critics of both presidents decried their failure to unify the country, but the fact that two such different politicians could have identical degrees of polarization strongly suggests that the times, not the men, are to blame. In the past half century, the only years that showed more polarization than Obamas sixth year were his -- and Bushs -- fourth and fifth years. All of that suggests that Obamas overall approval rating probably will not rise much above 50% for any sustained period. The 64% approval that President Bill Clinton averaged in his sixth year, for example, is out of reach for Obama unless some completely unforeseen development causes Republicans to change their view of him. A sharply polarized electorate is not the worst thing that can happen to a president, however. The partisan gap for Bush narrowed in the last two years of his tenure. That wasnt because Democrats began to approve his performance more but because Republicans approved it less. Obama, by contrast, has been able to keep his party largely united behind him despite perennial tensions between the White House and congressional Democrats. With strong economic growth, executive actions on immigration and climate change, and policy proposals in his State of the Union speech that address Democratic priorities on a host of other issues, the unity on his side of the aisle likely will continue to grow. For more on politics and policy, follow @DavidLauter on Twitter.]", "Date": "20150206", "Title": "[Obama's approval ratings benefit from good economy but have low ceiling]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-polarized-polls-20150206-story.html", "Author": "[David Lauter]"}