{"Content": "[House Republicans pushed past their internal divisions to approve a budget blueprint Wednesday, putting the new Congress on track to notch a significant achievement once Senate Republicans pass their version by the end of the week. The ambitious but largely symbolic spending proposals adhere to Republican ideas for slashing social safety-net programs and lowering tax rates. But they have drawn criticism for dramatically boosting defense spending in a way that breaks with the Republican pledge to stick to deficit-lowering limits imposed at their own behest just a few years ago. Overcoming those differences between the partys defense and deficit hawks posed a daunting challenge for House Speaker John A. Boehner (R-Ohio) and his leadership team. Rather than take sides, Boehner took the unusual step of allowing competing proposals to come to the floor, letting the top vote-getter win. Both budget versions would boost Pentagon spending, but one would make part of the money contingent on finding spending cuts elsewhere, an uncertain prospect. The other version  backed by military supporters  would provide the extra money regardless. In a win for defense hawks, the House voted 219 to 208 for the amendment that guaranteed the money. The final budget was approved 228 to 199. All Democrats opposed. Budgets arent easy things, clearly, said House Budget Committee Chairman Tom Price (R-Ga.) as voting began. Weve navigated some interesting times. The Senate, meanwhile, continued working through amendments to its plan, with passage expected late Thursday or early Friday in an all-night session. Once both chambers finish their work this week, new challenges await when they return from a spring break next month. The House and Senate must reconcile their different versions, which could prove difficult. The House plan overhauls Medicare by creating a voucher-like option for seniors to purchase private health insurance. Senate Republicans have distanced themselves from that approach and did not include it in their budget. But they will have to resolve those discrepancies if they hope to achieve one of their top goals  passage of a bill to repeal President Obamas healthcare law. Though the House has voted more than 50 times to repeal the Affordable Care Act, legislation has never been sent to the president because it could not overcome opposition in the Senate. The budget process offers a special opportunity that would allow Republicans to pass a bill to repeal the healthcare law with only a simple majority, averting a Democratic filibuster in the Senate. Obama would certainly veto such legislation, but getting the measure to the presidents desk would give Republicans boasting rights in future election campaigns. Passage of the budget proposals also fulfill a GOP promise to break the gridlock in Congress and govern more effectively. Republicans frequently criticized Democrats for failing to pass a budget in recent years when they held the majority in the Senate. Republicans say their 2016 blueprint would balance the budget within a decade, unlike a rival plan offered this year by Obama. But critics note that the GOP budget balances by making several assumptions about economic growth and future spending cuts that may not come to fruition. Republicans also count on the tax revenue collected through Obamas healthcare law, even as they vow to repeal it. In crafting their budgets, Republicans struggled to cope with spending caps mandated in the 2011 Budget Control Act, also know as the sequester. It requires steep cuts for domestic and defense budgets. Obamas plan simply did away with the sequester cuts, relying on tax hikes for the rich and allowing an increase in the deficit. GOP budget drafters instead found a creative way to get around the sequester cap on the main defense account, which sets the Pentagon budget at $523 billion for fiscal 2016. To add money, the GOP budgets rely on a separate account that has usually been used for overseas contingency operations  most recently the wars in Iraq and Afghanistan. That account also has the advantage of not being covered under the sequester. The overseas contingency account will grow to $96 billion under the House and Senate proposals --- $20 billion over this years level and $38 billion beyond what Obama requested in his 2016 budget. Steve Ellis, a budget watcher at the nonpartisan Taxpayers for Common Sense, noted the new level is about half what it was in fiscal 2008, when the Pentagon was fighting the war in Afghanistan and sending more soldiers to Iraq. They decided instead of busting the budget caps, they would just evade the budget caps, Ellis said. It really is an insult to the intelligence of the American taxpayers, he said. Theyre going to have this whole extra slush fund  now slushier than ever  for Pentagon spending. For the latest from Congress follow @LisaMascaro.]", "Date": "20150325", "Title": "[House GOP approves budget to hike defense, slash safety-net programs]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-house-budget-deal-20150325-story.html", "Author": "[Lisa Mascaro]"}