{"Content": "[After a series of setbacks, abortion rights advocates claimed a small victory Tuesday after a federal appeals court blocked a law that would have closed the last remaining abortion clinic in Mississippi. The law required that all physicians associated with an abortion clinic have admitting privileges at a local hospital. The states last clinic, Jackson Womens Health Organization, had filed a suit challenging the law, in part because none of the seven hospitals in the Jackson area were willing to grant the physicians admitting privileges. Mississippi officials argued that women could go to neighboring states to obtain abortions, but the three-member panel of the U.S. 5th Circuit Court of Appeals ruled, 2 to 1, that the state could not shift its constitutional duties to another state. The law imposes an undue burden on a womens right to choose an abortion, the court said. The decision is curious because the same appeals court, with a different panel of judges, let stand a similar law in Texas this year. Similar laws are also being litigated in Wisconsin and Alabama and are in place in Kansas, North Dakota and Tennessee. Comparable laws will go into effect later this year in Louisiana and Oklahoma. The difference, said Matthew Steffey, a professor at the Mississippi College School of Law, is that the Mississippi law would have closed the last remaining clinic, whereas the Texas law closed only some. If you go all the way back to the era of Roe vs. Wade, the problem was that abortions were available in some jurisdictions but not others, Steffey said. Roe nationalized the right of access to abortion, and the court, for very good reason, said a state cant export or transfer its constitutional duties to other states. The state can still appeal the decision, and Jan Schaefer, a spokeswoman for the Mississippi attorney general, said in an email that the state was reviewing the ruling and considering our options. Steffey said the law was likely to remain blocked. I think its essentially game over at this point, he said. The Mississippi law, passed in 2012, was one of a flurry of antiabortion laws pushed by conservative legislatures after the midterm election of 2010. Some required doctors performing abortions to have admitting privileges in local hospitals, others banned abortion after 20 weeks of pregnancy, and others required clinics to give women an ultrasound and then describe the image to them before performing the procedure. Legislators said the bills were aimed at making abortion safer for women, although many also said they would prefer to eliminate abortion entirely if they could. If a woman is going to have an abortion, we want to make sure she receives proper healthcare, said Rep. Katrina Jackson, a Democrat, who sponsored Louisianas admitting-privileges bill. Its about continuity of care. Abortion rights advocates have fought many of the state laws in court, with varying degrees of success. In January, the U.S. Supreme Court declined to hear an appeal from Arizona on a state law that barred abortions after 20 weeks of pregnancy, effectively blocking that law, but similar laws still stand. The Texas admitting-privileges law still stands, and a paper released last week found that the number of abortion facilities in the state had dropped to 22 from 41 and that the abortion rate had declined 13% in the year the law has been in place. The courts have been a bit of a mixed bag, and sometimes restrictions are struck down, sometimes theyre not, and its very hard to predict what will happen, said Elizabeth Nash, the state issues manager at the Guttmacher Institute, which advocates for reproductive rights. In an effort to get a more definitive ruling on the matter, Planned Parenthood has filed a petition asking the full bench of the 5th Circuit to reconsider the Texas case. Its petition would essentially ask all of the judges to rule on the law, rather than just the three-judge panel, which upheld it in March. Differing decisions could make the case proceed to the U.S. Supreme Court. Also Tuesday, the Massachusetts Legislature gave final approval to a bill designed to tighten security around abortion clinics in the state. The law, which would allow police to disperse anyone impeding access and keep them at least 25 feet from the clinics entrance for up to eight hours, comes a month after the U.S. Supreme Court struck down a 2007 state law that prevented protesters from coming within 35 feet of the entrances. Gov. Deval Patrick has said he will act quickly to sign the bill into law. In the meantime, clinics like the Womens Health Care Center in New Orleans are struggling to gain admitting privileges at local hospitals, since the law in Louisiana still stands. On a recent weekday, Sylvia Cochran, the administrator of the clinic, one of two in the New Orleans area, sat in an office as protesters outside held graphic images of fetuses and shouted at women approaching the building. The admitting-privileges law is a game-changer, said Cochran, who has been working at the clinic since 1977. It goes into effect Sept. 1, and abortion rights advocates say it could close all clinics in the state except for two in Shreveport. Cochran spent recent months applying for malpractice insurance, which is necessary for gaining admitting privileges, to no avail so far. The state had previously prohibited doctors providing abortions from obtaining malpractice insurance, a law that was overturned by the courts in 2012. No hospital had granted her clinic admitting privileges yet. If the New Orleans and Baton Rouge clinics close, it will be a shorter drive for New Orleans women to visit the clinic in Jackson, across the state border, than it will be for them to visit the remaining clinics in their own state. 6:27 p.m.: This story was updated throughout with new information and details. This story was originally posted at 11:52 a.m. ]", "Date": "20140729", "Title": "[Court blocks Mississippi from closing state's last abortion clinic]", "Link": "http://www.latimes.com/nation/la-na-mississippi-abortion-law-20140729-story.html\n", "Author": "NULL"}
