{"Content": "[A group urging Hillary Rodham Clinton to run for president in 2016 held a fundraiser in downtown Los Angeles on Wednesday night, during which supporters called it their duty to encourage the former secretary of State to seek the White House. Our job is to basically convince, to urge, to nudge, to hug Hillary Clinton into the presidential race, said Michael Trujillo, a senior advisor to the Ready for Hillary Super PAC. So as we take this journey literally three years from now, on election day hopefully its all of us at the White House, hopefully its all of us saying thank you to Hillary. The fundraiser at the art deco Exchange LA nightclub raised thousands of dollars for the super PAC, Trujillo said, making it the groups biggest fundraiser to date. Volunteers handed out yard signs, T-shirts and bumper stickers to the more than 400 people who were asked to donate at least $20.16 to attend. Hosted by many young Democratic operatives who worked for former Mayor Antonio Villaraigosa and former city Controller Wendy Greuel, the event focused on the prospect of Clinton being elected the nations first female president. PHOTOS: 2013s memorable political moments, Organizers played a video of Clinton conceding the 2008 Democratic nomination to then-Sen. Barack Obama, a speech at the National Building Museum that was as much about her desire to see a woman elected president as it was to unite Democrats after a bitterly divisive primary. As we gather here today in this historic, magnificent building, the 50th woman to leave this Earth is orbiting overhead. If we can blast 50 women into space, we will someday launch a woman into the White House, Clinton said in the video. Among the speakers Wednesday night were Councilwoman Nury Martinez, the lone elected woman at City Hall, and Greuel, who unsuccessfully sought to be the citys first female mayor. Were the second-largest city in the country, were down to one woman at City Hall. That is not good. That is not good for my daughter, who can call her mother a city councilwoman, Martinez said. I need my daughter to call her president a woman. We have a lot of work to do. Three years from today we can elect the first woman president of the United States, she continued. Hillary needs to know that we are ready in Los Angeles, we are ready in California, that were going to be mobilized and make sure little girls, our mothers, our sisters, our daughters, our friends and our men in this country are ready for a woman president. And in an only-in-Los Angeles twist, the surprise guest who concluded the event was Omarosa, who worked as a scheduler in President Bill Clintons administration before becoming a reality show villain on The Apprentice. All of us have to stick together and get behind this sister because Im going to tell you, when I was at the White House, she cared about each and every one of us and she made sure we stayed connected to the issues that were important, Omarosa said. The event took place two days before Hillary Clinton is due to return to California for a series of speeches and awards. PHOTOS: The battle over Obamacare, California has long played a key role in the political success of Clinton and her husband. The states deep-pocketed donors provided millions of dollars in support for Bill Clintons two presidential campaigns, and it was the state that clinched the Democratic nomination for him in 1992. In 2008, Hillary Clintons eight-point win in California helped keep her in the fight after a string of losses to Obama. The state and its donors will likely be crucial if she decides to run again. In October, Clinton gave her strongest indication to date that she is considering another White House bid. \"I am not going to begin to think seriously about it until sometime next year,\" Clinton said during a speech to the Long Island Assn. in New York, according to Newsday. \"I will think about it because its something on a lot of peoples minds. And its on my mind as well.\", Since then Clinton has come under pressure to run from leading Democrats, including Senate Majority Leader Harry Reid on Tuesday and Sen. Charles E. Schumer on Saturday. After Schumer exhorted her to run during a speech at the Iowa Democratic Partys Jefferson-Jackson fundraiser, her office said Clinton has not made a decision. \"Senator Schumer is an old colleague and an even older friend, and what he said about her is very flattering. Ultimately though, this is a very personal decision that she hasnt made,\" Clintons office said in a statement to Reuters. Still, the question will be raised every time she makes a speech. On Friday, Clinton is to accept an award for her work on behalf of women and children from the International Medical Corps in Beverly Hills. The following day, shes to be honored at a brunch at USC by the Mexican American Leadership Initiative, before heading to the Bay Area for additional events. seema.mehta@latimes.com, Twitter: @latseema]", "Date": "20131107", "Title": "[Hillary Clinton supporters meet in Los Angeles to boost 2016 bid]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-hillary-clinton-los-angeles-fundraiser-20131106-story.html", "Author": "NULL"}