{"Content": "[Former Democratic Assemblyman Isadore Hall III of Compton on Tuesday won a special election for the state Senate, beating three other candidates for a Los Angeles County seat left vacant by the resignation of Sen. Roderick Wright. With all precincts reporting, Hall had 54.98% of the vote, enough to avoid a Feb. 10 runoff election. He beat Democrats Louis L. Dominguez of San Pedro and Hector Serrano of Wilmington, and Republican James Spencer of Inglewood. Spencer finished a distant second. \"I am deeply humbled and sincerely thankful for the confidence placed in me by the voters of the 35th district,\" Hall said in declaring victory. \"I take great pride in this sacred responsibility, and in being the voice of so many people and so many local neighborhoods in our state capital.\", The seat was left vacant in October when Wright resigned after a jury convicted him of felony voter fraud and perjury for lying about living in his Senate district. Hall spent $478,000 on the campaign and had endorsements from the California Democratic Party and Gov. Jerry Brown, while none of the other candidates were expected to report raising more than $10,000. Other candidates criticized Hall during the campaign, charging he spent campaign funds on expensive meals, cigars, limousines and travel to exotic resorts. Hall may serve out the remainder of Wrights term, which ends in December 2016. The Senate district includes the communities of Carson, Compton, West Compton, Gardena, Harbor City, Hawthorne, Lawndale, Lennox, San Pedro, West Carson, Watts, Willowbrook, Wilmington and parts of Long Beach, Los Angeles, Inglewood and Torrance. Hall, who left the Assembly last month because of term limits, had said his priorities in the Senate would be bringing clean and green jobs to his district and opposing a proposed tuition increase for the University of California system. I think we need to look at the salaries we are paying our [university] CEOs before we start talking about increasing tuition for our most vulnerable population that is in college right now, he said.]", "Date": "20141209", "Title": "[Isadore Hall wins special election for state Senate seat]", "Link": "http://www.latimes.com/local/political/la-me-pc-isadore-hall-state-senate-seat-20141209-story.html\n", "Author": "[Patrick McGreevy]"}
