{"Content": "[Mike Huckabee, the former Arkansas governor and Fox News commentator whos thinking of running for president in 2016, is no Abraham Lincoln. But recent comments for which Huckabee is being ridiculed could have come from the mouth of the Great Emancipator. Huckabee recently doubled down on his suggestion that states need not comply with a Supreme Court decision legalizing same-sex marriage nationwide. In an interview with USA Today, he asked: \"Do we really surrender the entire American system of government to five people, unelected, appointed for life, with no consequences for the decisions they make? The founders never intended for there to be such incredible, almost unlimited power, put in the hands of so few people.\", Challenged by Chuck Todd on Meet the Press, Huckabee basically held his ground, though he rejected the idea that he was advocating state nullification of Supreme Court decisions. The courts cant make a law, Huckabee told Todd. They can interpret one, they can invalidate one. But even then, as in the case of theDred Scott decision in 1857, that said black people werent human beings, Abraham Lincoln refused to adhere to that because he said it wasnt a just law. Huckabee is wrong if he thinks that a Supreme Court decision isnt binding on the states or that states could block the implementation of a ruling by refusing to pass enabling legislation. But hes right that Lincoln had a similar view. In his first inaugural address Lincoln said that if the policy of the government upon vital questions affecting the whole people is to be irrevocably fixed by decisions of the Supreme Court, the instant they are made in ordinary litigation between parties in personal actions the people will have ceased to be their own rulers, having to that extent practically resigned their government into the hands of that eminent tribunal. But Lincolns limited view of the courts role didnt survive the civil rights revolution of the 20th century. In Cooper vs. Aaron, a 1958 decision involving the desegregation of schools in Little Rock, Ark. the court rejected the notion that there is no duty on state officials to obey federal court orders resting on this courts considered interpretation of the United States Constitution. If the Supreme Court does rule later this year that the Constitution requires that states recognize same-sex marriages, states will have to comply, whatever Huckabee says and whatever Lincoln thought. Follow Michael McGough on Twitter @MichaelMcGough3]", "Date": "20150128", "Title": "[Huckabee and Lincoln agree, and they're both wrong]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-huckabee-lincoln-gaymarriage-20150128-story.html\n", "Author": "[Michael McGough]"}
