{"Content": "[Sen. Marco Rubio said Wednesday that he is at the final stages of deciding whether to run for the Republican presidential nomination, telling reporters that he is aware the clock is running. His wife and children are supportive of a run if he decides to make one, and hes thought through what would be needed towin the race, the Florida senator told reporters at a breakfast session here sponsored by the Christian Science Monitor. Now, \"Im down to the last decision -- and I think the fundamental one -- and that is, at this stage in my life, at this stage, where is the best place for me to serve the country,\" he said. He would have to make a choice between a presidential race and seeking reelection to his Senate seat in 2016, he noted. \"I know well have to make the decision if I am to run for president soon enough to be able to mount the sort of credible campaign that it takes to run a national race,\" he said, although he declined to set a deadline for his decision making. Rubio praised fellow Florida Republican former Gov. Jeb Bush, saying he would be a \"very credible candidate\" who has an \"extraordinary network of donors.\" But, he said, he would make his own decision regardless of Bushs plans to seek the nomination. Rubio used the session to tout the major themes of his newly released book, \"American Dreams,\" in which he focused on the stagnation of middle-class incomes as a central problem for the next president. Voters, he said, want to know that candidates understand the problems they face. \"Thats something our party should improve on,\" he added. He said he attributed the Republican loss in 2012 mostly to the Obama campaigns \"better organization\" and ability to turn out its supporters, rather than to any particular flaws of Mitt Romney, the once and perhaps future nominee. But, he added, \"its certainly not helpful to be viewed as someone who doesnt care.\", He also reiterated his opposition to President Obamas policies toward Cuba, saying he \"cant think of a single contemporary example\" in which expanding economic ties caused a dictatorial regime to become democratic. In China and Vietnam, he said, U.S. decisions to expand economic ties have led to increased trade and business investment, but have only further entrenched authoritarian governments. In those cases, the U.S. had compelling national security reasons to expand ties, he said. By contrast, \"my interest in Cuba is singular,\" he said. \"I want them to have freedom and democracy.\", For more on policy and politics, follow @DavidLauter on Twitter. ]", "Date": "20150121", "Title": "[Marco Rubio says he's 'down to the last decision' on 2016 presidential run]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rubio-20150121-story.html\n", "Author": "[David Lauter]"}
