{"Content": "[During a turning point in the Republican debate Wednesday, Jeb Bush was asked about a charged comment Donald Trump made this summer about Bushs Mexican-born wife. Trump, who has repeatedly called Bush weak on immigration, had said in July that Bush has \"a soft spot for people from Mexico\" because of his wifes ancestry. Did Mr. Trump go too far? a debate moderator asked Bush last night. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Bush, the former Florida governor, defended his wife, saying she loves this country as much as anybody in this room. Seemingly emboldened by the applause that followed, Bush went a step further. Go behind the scenes of the second GOP Presidential Snapchat-style with L.A. Times political writers. Go behind the scenes of the second GOP Presidential Snapchat-style with L.A. Times political writers. Were at a crossroads right now, he said. Are we going to take the Reagan approach, the hopeful optimistic approach, the approach that says that, you come to our country legally, you pursue your dreams with a vengeance, you create opportunities for all of us? Or the Donald Trump approach -- the approach that says that everything is bad, that everything is coming to an end?, That divide on both rhetoric and policy has cleaved the Republican presidential field at least since Trump entered the race in June. The fight over immigration has damaged Republican hopes of improving their standing with Latinos, even as it may have energized at least some conservative white voters. Democrats have done their best to exploit the moment. On Thursday, the White House set out a new initiative aimed at the roughly 8.8 million legal permanent residents of the U.S. who are eligible for citizenship but have not sought it. The program is designed to make the process easier and less daunting for applicants. White House officials insisted the initiative was not politically motivated, but the political effect is clear: Most of the potential new citizens are Latino and could be expected to vote for Democrats if they become eligible. On the Republican side, Wednesday nights debate highlighted how divided the party remains, with Trump on one side and candidates including Bush, Marco Rubio, Ben Carson and Carly Fiorina on the other, seeking to disassociate themselves to varying degrees from Trumps harsh view of immigration. In recent months, as Trump has risen in the polls with his calls to build a massive border fence and deny citizenship to babies born to people in the country illegally, Democrats and immigrant groups have accused the billionaire businessman of forcing his Republican competitors far to the right on immigration. NEWSLETTER:Get the best from our political teams delivered daily. After Bush used the controversial term anchor babies to describe children born to immigrants in the U.S. illegally, Democratic National Committee Chairwoman and Florida Rep. Debbie Wasserman Schultz said Bush was \"no better than Trump or the rest of the Republicans running for president.\" By invoking Reagan, who in 1986 granted amnesty to 3 million immigrants in the country illegally, Bush aligned himself with a view that is unpopular to a large segment of conservative primary voters but that could help him appeal to moderates -- and Latinos -- in a general election. Going into the debate, immigrant advocates launched a Twitter campaign calling on CNN and the candidates to tone down the rhetoric, urging people to tweet with the hashtag #NoHateDebate. Even former Republican National Committee Chairman Michael Steele was urging his own partys candidates to be more inclusive, he told The Times. Perhaps in response to that demand -- but more likely in recognition of the increasingly important Latino vote -- several candidates flexed their independence on immigration. Carson, a retiredneurosurgeon, said he supported a guest worker program for certain immigrants in the country illegally, a view denounced as too moderate by some Republican hard-liners. See the most-read stories this hour >>, Fiorina, the former Hewlett-Packard chief executive, took jabs at Trumps repeated claims that Republicans would not even be talking about illegal immigration if Trump hadnt raised the issue. Immigration did not come up in 2016 because Mr. Trump brought it up, Fiorina said. We talked about it in 2012. We talked about it in 2008. We talked about it in 2004. Fiorina also criticized Trumps proposal to promptly and painlessly end birthright citizenship, a right enshrined in the 14th Amendment to the Constitution. The truth is, you cant just wave your hands and say the 14th Amendment is going to go away, Fiorina said. Bush and Rubio also used the debate to reach out explicitly to the record 28 million Latinos who will be eligible to vote in next years presidential election. After a moderator asked a question about Trump criticizing Bush for using Spanish on the campaign trail, Rubio, a Cuban American senator from Florida, jumped in. He talked about his grandfather, an immigrant from Cuba who spoke only Spanish. My grandfather instilled in me the belief that I was blessed to live in the one society in all of human history where even I, the son of a bartender and a maid, could aspire to have anything, and be anything that I was willing to work hard to achieve, Rubio said. But he taught me that in Spanish, because it was the language he was most comfortable in. And he became a conservative, even though he got his news in Spanish. @katelinthicum, ALSO:, This was the story of the debate on the Internet, Analysis: This time, Trumps rivals came prepared, Republican temperaments are tested in Simi Valley presidential debate, 9 a.m.: This story has been updated to include a new White House program aimed at easing the way for legal permanent residents to become citizens. The story was originally published at 4 a.m.]", "Date": "20150917", "Title": "[As debate highlights GOP divide on immigration, White House woos new citizens]", "Link": "http://www.latimes.com/politics/la-na-immigration-bush-trump-20150917-story.html\n", "Author": "[Kate Linthicum]"}
