{"Content": "[With the 2016 election cycle gearing up, special interests are eyeing ways to advance the candidates of their choice without leaving any fingerprints. Their preferred vehicle is \"dark money\" donated to organizations  including so-called social welfare groups  that are allowed under the law to conceal the names of their contributors. When the Supreme Court ruled in the Citizens United decision that corporations have a 1st Amendment right to spend money to support or oppose candidates, it balanced that finding with an insistence on the importance of disclosure. Justice Anthony M. Kennedy wrote that transparency about the sources of political spending \"enables the electorate to make informed decisions and give proper weight to different speakers and messages.\", That noble principle is mocked by the practice of paying for election-related activities through tax-exempt organizations known as 501(c)(4) groups, named for the provision in the tax code under which they are authorized. These groups, unlike political action committees and candidates campaigns, are not required to disclose their donors. According to federal law, 501(c)(4) groups are organized \"exclusively\" for the promotion of social welfare. Examples listed in an Internal Revenue Service document include associations that build housing for the poor or provide financial planning. Theres no particular reason why people shouldnt be allowed to make charitable contributions to such social welfare organizations anonymously, and the law reasonably allows them to do so. The problem, however, is that in its regulations, the agency has redefined \"exclusively\" to mean \"primarily\"  meaning that a 501(c)(4) group may engage in significant political activity so long as politics isnt its primary occupation. How significant? Recently, campaign-reform groups criticized IRS Commissioner John Koskinen for suggesting that, under federal law, \"If you spend at this point less than 49% of your money on politics, you can be a (c)(4).\" Thus a giant loophole has been created under which campaign donors can influence political campaigns without their names being disclosed. So what can be done? More than 50 reform groups have proposed that President Obama issue an executive order requiring companies that receive federal contracts to disclose their political spending. Such an order is far from a complete answer to dark money. But it would shed light on political activity by firms with a vested interest in courting favor with candidates for federal office. And while hes at it, Obama should urge the IRS to scrap the 49% rule and enforce the laws requirement that 501(c)(4)s engage in social welfare activities \"exclusively.\" If companies and individuals wanted to engage in politics, they could still reach into their wallets  but they couldnt disguise their identities or their interests. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150412", "Title": "[Loopholes in political spending laws keep voters in the dark]", "Link": "http://www.latimes.com/opinion/editorials/la-ed-dark-money-20150412-story.html\n", "Author": "[The Times Editorial Board]"}
