{"Content": "[WASHINGTON  The Republican-controlled Senate took its first step toward fulfilling a GOP promise to roll back key parts of the sweeping 2010 law that overhauled financial industry regulations and oversight. The Dodd-Frank reform law, designed to prevent a catastrophe similar to the 2008 financial crisis, has been a target of GOP leaders since it was adopted on a largely party line vote by a then-Democratic-controlled Congress. On Thursday, the Senate Banking Committee voted 12 to 10 along party lines to loosen parts of the law that Republicans have argued were too burdensome on small banks and could hurt the economy. Democrats charged that the legislation by the panels chairman, Richard Shelby (R-Ala.), also would help big Wall Street banks and reduce consumer protections, demonstrating that deep partisan divisions over the issue still exist nearly five years after the law was enacted. The chairmans bill is good for giant banks, but its bad for families and its dangerous for the economy, said Sen. Elizabeth Warren (D-Mass.). Shelby and nearly all congressional Republicans opposed the Dodd-Frank bill in 2010, calling it an over-reaction to the crisis that would weigh down financial firms with too much government regulation. Urged by the banking industry, GOP leaders have been eager to make major changes. The House has approved numerous bills watering down key provisions of the law since Republicans took control of that chamber in 2011. But those attempts failed to get through the Democrat-controlled Senate. After Republicans won enough Senate seats in November to gain the majority, the efforts were revived. In December and January, Republican leaders successfully attached provisions watering down some parts of Dodd-Frank to must-pass bills that President Obama signed. And after taking over as Banking Committee chairman this year, Shelby began working on the comprehensive rollback bill. While there is bipartisan consensus that some changes are needed in Dodd-Frank to help community banks avoid burdensome regulations, Republicans and Democrats have split sharply on how to do that. Is Dodd-Frank perfect? Of course not, said Sen. Sherrod Brown (D-Ohio). But we must not undermine the key protections that the law provides to prevent another catastrophe for our economy or for our neighbor who has saved for years to buy a home. Brown and all nine of his Democratic colleagues on the Senate Banking Committee opposed Shelbys 216-page bill. They supported narrower legislation from Brown that the committee voted down Thursday, also on a party-line vote. The White House has said the president opposes Shelbys bill. Still, Shelby said he hopes that a bipartisan compromise can be reached because of general agreement that Dodd-Frank needs some revisions. His bill doesnt go as far as some past House proposals, which notably would overhaul the funding and the structure of the Consumer Financial Protection Bureau and subject Federal Reserve monetary policy decisions to congressional audits. Shelbys legislation, called the Financial Regulatory Improvement Act, would make many changes. Among them is giving regulators the discretion to ease tough new regulations on financial institutions with $50 billion to $500 billion in assets, a revision that could help large regional banks, such as U.S. Bancorp. Dodd-Frank requires any firm with assets of more than $50 billion to be designated a systemically important financial institution, subjecting it to greater oversight and requirements to hold more capital to cover potential losses. Shelbys bill would make the designation a requirement only for banks with more than $500 billion in assets. Only seven banks, including JPMorgan Chase & Co. Bank of America Corp. and Citigroup Inc. are that large. The mandatory $50-billion threshold is a blunt instrument, Shelby said. The total assets held by a bank are an important factor, but not the only factor that should be considered when determining whether a bank poses a risk to the entire financial system, he said. The bill also makes numerous changes to help small banks, such as expanding the number that would qualify for less frequent regulatory exams. Shelbys legislation also would ease some new mortgage lending requirements and make changes at the Federal Reserve, such as requiring the president of the Federal Reserve Bank of New York be nominated by the president and confirmed by the Senate instead of appointed by the banks board. In addition, the bill would establish a commission to study the Feds structure and submit recommendations to Congress about how to improve it. Frank Keating, president of the American Bankers Assn. trade group, said the legislation would provide much-needed regulatory relief to banks of all sizes. This bill is a significant step toward removing many of the statutory and regulatory barriers that constrain banks ability to serve their customers and meet the needs of their local communities, he said. Sen. Bob Corker (R-Tenn.), viewing the Democratic alternative as too narrow, said he hoped for a bipartisan compromise. He acknowledged, though, that a key feature of Shelbys legislation was a problem. I think its going to be incredibly hard to move from the $50-billion to the $500-billion level for mandatory designation as a systemically important financial institution, Corker said. Shelby needs to gain some Democratic support to overcome a potential filibuster. If he could craft a compromise, it probably would be approved by the Republican-controlled House. White House Press Secretary Josh Earnest indicated last week that Shelbys bill as it stands now would not get Obamas signature. Im confident that when it comes to opposing this piece of legislation, the president will be able to work effectively with Sen. Warren and others to stop it, Earnest said. jim.puzzanghera@latimes.com, , , , 6:12 p.m. Updates with additional details, Originally posted at 10:29 a.m.]", "Date": "20150521", "Title": "[Panel moves to weaken Dodd-Frank]", "Link": "http://www.latimes.com/business/la-fi-financial-regulation-shelby-dodd-frank-20150521-story.html\n", "Author": "[Jim Puzzanghera]"}
