{"Content": "[Its not easy being an atheist. A new Pew poll found that atheism ranked at the bottom of a list of 16 traits that might affect someones view of a 2016 presidential candidate. (People are more likely to vote for someone who uses pot, has had an extramarital affair, never held office or is gay.), The U.S. Supreme Court has brought new meaning to the phrase tear down that wall as its conservative majority has hammered away at the barrier between church and state. Government bodies are now free, thanks to one recent decision, to impose Christian prayer on everyone at the start of public meetings. Next month, in Sebelius vs. Hobby Lobby, the court will decide whether its permissible for private, nonprofit employers to impose their religious beliefs on their employees. So when I turned on my TV the other day to catch up with The Daily Show, I was surprised to see a full-throated celebrity endorsement for atheism. Hi Im Ron Reagan, an unabashed atheist, said the 56-year-old son of our 40thpresident. And Im alarmed by the intrusions of religion into our secular government. Thats why I am asking you to support the Freedom From Religion Foundation, the nations largest and most effective association of atheists and agnostics working to keep state and church separate, just like our founding fathers intended. His sign off: Lifelong atheist, not afraid of burning in hell. People dont usually spout off about their atheism, so I was curious what led him to make the spot. Thursday, I reached Reagan, an MSNBC contributor, in Seattle, where he has lived after leaving Los Angeles in 1994. He sounded subdued, and said he has not been working much, having just suffered through a personal tragedy. On March 24, he said, his wife of 33 years, Doria Palmieri Reagan, died of complications from a progressive neuromuscular disease that she developed seven-and-a-half years ago. A clinical psychologist, Doria Reagan was seven years older than her husband. But he had made a promise to the Freedom From Religion Foundation, which honored him in 2009, and he felt obligated to keep it. Reagan has been a nonbeliever since childhood, he said, and is surprised when people react with incredulity when they hear it. I think when you hold an opinion that you find entirely reasonable, you are surprised when you discover that other people dont also consider it reasonable, and kind of get up in arms, he said. Thats a familiar reaction to people who are outspoken about their atheism or agnosticism, said Annie Laurie Gaylor, co-president of the Wisconsin-based foundation, which considers its mission education. We get emails every day telling us we should leave the country. Very nasty stuff. Death threats,\" Gaylor said. \"The crank mail and phone campaigns are unending and almost always in response to our work for separation of church and state--not for promoting free thought and atheism. But theres no question that atheists and agnostics are at the bottom of the totem pole when it comes to social acceptance. Indeed. In 2006, a University of Minnesota study published in the American Sociological Review, found that atheists are less likely to be accepted, publicly and privately, than any others from a long list of ethnic, religious and other minority groups. Atheists topped a list called I Would Disapprove if My Child Wanted to Marry a Member of This Group. Gaylor said her foundation has been inspired to raise its profile by the recent successes of the gay civil rights movement. We already have an out of the closet movement, but we need to turn up the volume. (The foundation also filed a friend-of-the-court brief in the Hobby Lobby case.), Comedian Julia Sweeney cut a spot for the organization two years ago, taking on the American Conference of Catholic Bishops campaign against Obamacares contraception mandate. The ad aired 1,100 times, Gaylor said. Getting a celebrity with Reagans name recognition was a coup, Gaylor said. His spot ran May 22 on two Comedy Central shows, The Daily Show and The Colbert Report. The organization paid $155,000 for air time. She hopes to raise enough money to place the ad on 60 Minutes in the fall. Reagans spot has generated hundreds of responses. Some are very poignantI never thought I would live to see a commercial like this. Theres a lot of gratitude pouring in for Ron Reagan. Hes a big name, and thats what our movement has lacked. Reagan, who, like his mother former First Lady Nancy Reagan, has advocated for stem cell research, said he worries that religion often goes hand in hand with ignorance and scientific illiteracy. I think what troubles me  whether its religiously inspired or not  is the ignorance, foolishness, and I might say, stupidity, in this country. This championing of anti-intellectual, anti-science, scientifically illiterate theories and lack of critical thinking is disturbing. Climate change is such a handy example. Religion, he said, is delusion. And when it morphs into believing that the Earth is 6,000 years old and insisting on teaching that to our children, thats a very dangerous thing. So, hey, any freethinking celebrities out there who want to lend the cause a hand: the Freedom From Religion Foundation wants a word with you. \"If you know George Clooney,\" said Gaylor, \"let me know.\", ]", "Date": "20140530", "Title": "[Ron Reagan, not afraid to burn in hell, promotes atheism in TV spot]", "Link": "http://www.latimes.com/local/abcarian/la-me-ra-ron-reagan-endorses-atheism-20140530-column.html", "Author": "NULL"}