{"Content": "[Two days after their marathon debate, 10 Republican presidential contenders came to South Carolinato sell their antigovernment bona fides to the conservative faithful  who were tough customers. Thousands of committed activists came to an arena in this early primary state to shop for the right candidate in the driveto put a conservative in the White House in 2016. They loudly cheered calls to assert American muscle abroad, to scrap the Iran nuclear deal and to attack establishment politicians in Washington. The sponsor was Heritage Action for America, the advocacy arm of the right-wing Heritage Foundation, whose ardent opposition to immigration helped quash a reform movement in 2013. The group is among those now pressuring Republicans in Congress to shut down the government rather than appropriate any money to Planned Parenthood, a cause that has stirred the antiabortion fervor in the partys base. No candidate drew a reception that matchedthe standing, rock-star ovation that greeted Ben Carson, the retired neurosurgeon whos climbed near the top of polls in recent weeks. When Carson said it was his birthday, the crowdsang, Happy Birthday. Carson drew more cheers when he talked about his faith  I get tired of progressives telling me Im not a good scientist because I believe God created the Earth  and kept the crowd on his side when he said he continued to support a guest worker program for people in the U.S. illegally. He said farmers told him they need the labor. Any type of work that Americans dont want to do, we ought to think of a way to get it done, Carson said. As for deporting everyone who is in the country illegally, he said, I dont think its possible to round them all up. The judicial system would be clogged for many, many years. Carol Coring, 65, of Greenville, said she came mostly to see Carson, and he didnt disappoint. In the so-called racist South, he brought the house down, she said of Carson, the only African American running for president. He doesnt have a lot of charisma, but he has so much native intelligence. Coring, who said she worked in rock management in New York before her retirement, said many in the crowd were only shopping for political outsiders. People think theres no place else to turn at this point, she said. We elected a Republican Senate and House, and they havent managed to do a damn thing. Missing was Donald Trump, the outsize television personality whos been the star of the GOP campaign. Trump had pledged to come but pulled out on Friday morning, saying he had to take care of some unspecified significant business event. The campaign said the details of that event would be made public next week. This has been a rocky week for Trump, who faced zingers from other candidates at Wednesdays debate and has taken criticism from both Democrats and Republicans for failing to correct a man who said, at a campaign event in New Hampshire, that President Obama is a Muslim and not even an American. Most people in this crowd didnt seem to miss Trump much. Donald Trump is a chump, said Tim Eades, of Lexington, S.C. If the Republicans are stupid enough to put Donald Trump up there, Ill vote for Hillary. Well, not really, but Ill stay home. Wisconsin Gov. Scott Walker drew applause when he talked about fighting unions and doing away with the National Labor Relations Board  but got a much bigger response when he talked about defunding Planned Parenthood. If we can do that in a Democratic state like Wisconsin, why cant we do it in Washington? he asked. We dont have to buy this stuff the media says about shutdowns. All of the candidates tried to hit the anti-establishment theme, even former Florida Gov. Jeb Bush, whosefather and brother are former presidents. People are quite compliant with the old order [in Washington], and there needs to be a lot of disruption, he said. Carly Fiorina, the former Hewlett-Packard executive who turned in a strong debate performance, also got an enthusiastic reception, particularly when she assailed what she called the butchery and barbarity of Planned Parenthood. Fiorina referred to some of the more negative aspects of her tenure at Hewlett-Packard, which included plunging profits and the outsourcing of manufacturing jobs -- a history that dogged her during her losing 2010 campaign for a U.S. Senate seat in California. Its very difficult and painful to tell people they dont have a job anymore, yet sometimes that has to be done, she said. When you have someone who is competent, who is producing results but who does not have the core values that matter, those are the hard decisions. Outside the arena, some waved Confederate battle flags, a show of defiance against South Carolina Gov. Nikki Haley, who pushed for the flag to be taken down from the Statehouse grounds after the massacre at a historic black church in Charleston in June. Haley was one of the moderators Friday. One attendee, 72-year-old Marcia Bogan from Spartanburg, said she was intrigued by Trumps contempt for political correctness. She is longing for an alternative to the Republicans in Washington, she said, whom she viewed as siding with Obama. Whats wrong with people in our Congress?\" she said. \"Theyre completely compliant with absolutely everything Obama is doing. Oh, this country is rolling downhill like a snowball.]", "Date": "20150918", "Title": "[With Trump absent, conservative voters provide zingers at South Carolina forum ]", "Link": "http://www.latimes.com/nation/politics/la-na-politics-republicans-forum-20150918-story.html\n", "Author": "[Joseph Tanfani]"}
