{"Content": "[Philippine President Benigno Aquino III on Wednesday urged lawmakers to swiftly enact a law granting autonomy to the Muslim region of Mindanao to quell more than 40 years of rebellion that has killed at least 150,000 people. The proposed law is modeled on one that pacified a similar Muslim insurgency in neighboring Indonesias Aceh province in 2005. Aquino asked his political allies who dominate both houses of the legislature to pass the bill as soon as possible to give the region  to be called Bangsamoro, or Moro Nation  time to hold a referendum on the new status and organize local elections to coincide with the next national vote in 2016. The southern island of Mindanao, its Zamboanga Peninsula and nearby Sulu archipelago have been scenes of violent insurgency among the Moro populations since 1970. An Al Qaeda-affiliated extremist group known as Abu Sayyaf carried out kidnappings, beheadings and bombings in a bloody campaign for a separate Islamic state. The group has been tamped down over the last decade to a few hundred militants. U.S.-trained Filipino troops got the upper hand against the most radical insurgents with the aid of some fighters from more moderate Moro factions. The bill submitted by Aquino calls for Bangsamoro to replace the Autonomous Region in Muslim Mindanao created in 1990 but granted more limited powers. The new Muslim state would have its own 60-seat regional parliament, police force, control over its finances, the authority to raise taxes and the right to apply Islamic sharia law to Muslims. The Philippine justice system would continue to apply to non-Muslims in Bangsamoro. Only about 5% of the predominantly Roman Catholic countrys 107 million people are Muslims but they are heavily concentrated in the Mindanao region and the Sulu archipelago. Senate President Franklin Drilon said he would press lawmakers to expedite passage of the bill, and acknowledged that fierce debates were likely en route to what he expected to be eventual approval. \"We are giving ourselves until the first quarter of next year,\" Drilon said, according to the Manila Standard Today report on the bill proposal. \"I dont think we can pass this by the end of the year. We will give it our best shot but its extremely difficult because of the budget debates that come before that.\", The bill now before lawmakers omits provisions for disarming the 11,000 fighters of the Moro Islamic Liberation Front, with which Aquino signed a provisional peace agreement in March, the Philippine Star reported. The president nevertheless expressed optimism that the Muslim militia can be transformed into a political force for the autonomous region. \"If we are able to legislate this, we can give our Moro brothers enough time to prepare, thus enabling them to nurture the seeds of meaningful governance which were planted for the Bangsamoro,\" Aquino said in his ceremonial presentation of the bill to legislative leaders. The autonomy plan for the Muslim region was expected to ease concern among the island nations neighbors and allies that festering resentment among the religious minority could be used by extremist groups like Islamic State to recruit new fighters. U.S. military forces pulled out of the Philippines after lawmakers in 1991 refused to extend a defense cooperation agreement. They have begun returning since April, when the Obama and Aquino administrations signed an accord providing for U.S. access to Philippine naval and air force facilities on a rotational basis. Follow @cjwilliamslat for the latest international news 24/7, , ]", "Date": "20140910", "Title": "[Philippine leader proposes autonomous Muslim state to end rebellion]", "Link": "http://www.latimes.com/world/asia/la-fg-philippines-muslim-autonomy-20140910-story.html\n", "Author": "[Carol J. Williams]"}
