{"Content": "[Perhaps its just holiday cheer, but a few weeks after his party suffered painful losses in the midterm election, President Obama is ending 2014 with his highest approval ratings of the year. The evidence comes from new polls that show not only rising approval of Obamas performance in office, but also a warming trend in Americans perception of the economy. Its way too soon to claim a major shift. The evidence for more than a year has shown that the vast majority of Americans have strongly held views about Obama and that, as a result, changes in his approval ratings dont last. His ratings have been stuck at a tepid level through most of 2014. But there are a couple of reasons to think that the latest upswing might prove to be the beginning of something lasting. First, the numbers: A CNN/ORC poll released Tuesday showed 48% of Americans approved of Obamas job performance. Although that still leaves him somewhat underwater, its a 20-month high and up 4 percentage points from the previous month. Similarly, Gallups weekly tracking poll put Obamas approval at 45% through Sunday, the highest since May. Gallups more volatile three-day average had Obama at 47% over the weekend, the highest level of the year. Three factors seem to be bolstering Obamas ratings and could carry over into the new year. The most important is the economy, which, except in cases of major wars or scandals, usually exerts the strongest pull on a presidents ratings. Recent economic news has been good, capped by Tuesdays report that the economys growth rate in the third quarter reached 5%. For more than a year, as the economy has warmed up, political analysts have wondered why Obama wasnt getting more credit. One simple explanation is lag time - after a deep recession, history suggests the public needs many months of solid economic growth to feel better about the economy and political leaders. Now, that shift in public opinion may be taking place. The CNN/ORC poll, for example, showed that 51% of Americans said they had a positive view of the economy, compared with 49% who had a negative view. That was the first time a majority in the poll had been positive about the economy in seven years, and a big jump from 38% in October. Other polls have found smaller, though still notable, improvements in how Americans view the economy. Typically, such a shift benefits the incumbent. A second factor may be the impact of some of Obamas policy decisions. His approval rating among Latinos, for example, moved sharply upward after his announcement last month that the administration would seek to shield from deportation several million immigrants in the U.S. without legal authorization. Although many Republicans have denounced the immigration decision, the impact on public opinion was almost all on the plus side for Obama, presumably because the vast majority of those who disapprove already had negative views of his presidency. Finally, Obama has been plagued all year by a sense, even among those who tend to support him, that he is too passive and not a strong leader. The presidents recent spate of executive actions on a broad range of issues, including climate change and relations with Cuba, along with immigration, could be combating that image. Those factors - particularly the economy - could benefit Obama more in the year to come. Thats by no means certain. But if it happens, rising poll numbers for the incumbent would significantly help the Democratic presidential candidate in the 2016 election. The CNN/ORC poll interviewed 1,011 adult Americans on Thursday through Sunday; it has a margin of error of plus or minus 3 percentage points. The Gallup presidential approval numbers are based on approximately 1,500 interviews every three days; that poll has a margin of error of plus or minus 3 percentage points. For more on politics and policy, follow @DavidLauter on Twitter.]", "Date": "20141223", "Title": "[Obama's approval ratings climb as year ends. Trend or blip?]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-obama-approval-up-20141223-story.html\n", "Author": "[David Lauter]"}
