{"Content": "[With her U.S. Senate campaign off to a bumpy start, Loretta Sanchez refused Sunday to rule out the possibility of running instead for reelection to the House of Representatives. At a brief question-and-answer session with reporters, Sanchez (D-Santa Ana) first declined to elaborate on her apology to state Democratic convention delegates Sunday morning for making a stereotypical Native American war cry gesture in remarks to a crowd the day before. I think Ive said everything Im going to say on that subject, Sanchez said. Asked then whether there was any chance shed opt to seek reelection to the House next year if her Senate campaign appeared to be in trouble, the Santa Ana lawmaker responded, Let me be very clear: I am running for the United States Senate. Thank you. Asked to specify whether she was ruling out a run for reelection, Sanchez said: I am running for the United States Senate, and were running full bore to talk to people up and down California, and we think that by the time we finish, and [the June 2016 primary] rolls around, were going to be moving into the general election. Sanchez entered the Senate race Thursday and faces an uphill fight against another Democrat, state Atty. Gen. Kamala Harris, who launched her campaign in January. By the end of March, Harris had banked more than $2.2 million for the campaign, more than quadruple the nearly $540,000 in campaign money that Sanchez had on hand, according to their most recent campaign finance reports. Candidates for Californias seats in the U.S. House and Senate have until March 2016 to decide whether to run in the primary. Regardless of party, those who finish first and second in each contest will advance to a November runoff. Candidates are not allowed to run for the House and Senate simultaneously. Twitter: @finneganLAT]", "Date": "20150517", "Title": "[After 'war cry' fiasco, Loretta Sanchez doesn't rule out another run for Congress]", "Link": "http://www.latimes.com/local/political/la-me-pc-loretta-sanchez-reelection-house-senate20150517-story.html\n", "Author": "[Michael Finnegan]"}
