{"Content": "[I talked with Republican wise men last week  sober establishment strategists who have seen many presidential campaigns come and go  to ask them how long the improbable popularity of Donald Trump can last. Reassure me, I said: He cant actually win, right?, Their answers surprised me. \"Its not inconceivable,\" Vin Weber, a former congressman (and Jeb Bush supporter) told me. \"It doesnt look as if hes going to implode any time soon. Its hard for me to say this, but he actually seems to be getting better as a candidate.\", TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, \"Trump has put himself on the short list of five or six names who could win the nomination,\" said another GOP operative who insisted on anonymity because hes working for one of those other candidates. \"Its not impossible that he could win.\", Until a few weeks ago, the conventional wisdom held that Trump was merely a summer fling for angry voters, a protest candidate whose insults and braggadocio would soon impose a ceiling on his support. But recent polls suggest that Trump has raised that ceiling. Hes leading almost every horse race poll  although at this stage, those numbers are utterly unreliable as predictors of real voter behavior. (At this point in 2011, the polls were led by Texas Gov. Rick Perry; in 2007, by former New York Mayor Rudolph Giuliani.), More telling are polls that measure whether Trump has made himself acceptable to Republicans. A Quinnipiac University poll last month found that 30% of GOP voters had an unfavorable view of Trump  worse than most other candidates but a big improvement from the 52% that Trump scored in May. In Iowa, where the first GOP contest is held, the percentage of likely Republican caucus-goers who say they could never vote for Trump has fallen from 58% in May to 29%, according to a Des Moines Register-Bloomberg News poll. Get your free weekly take on the most pertinent, discussed topics of the day>>, What has Trump done right? He began by grabbing voters attention with a naked appeal to anti-immigrant anger. But hes broadened his pitch with broadsides against a \"corrupt\" political system, Wall Street financiers and corporations that send U.S. jobs overseas. There are even signs that he might ease up on the insults  glimpses of a new, more statesmanlike Donald. \"I have great respect for a lot of the other people on the stage,\" he said Friday. My GOP wise men outlined two possible scenarios: one for a Trump victory, the other for defeat. Trump could win, they suggested, if he rolls out more policy proposals to demonstrate that he has actually thought about what hed do as president (hes already promised one on tax reform), and if he survives increased scrutiny from the media as well as attacks from other candidates (Bush has already started in). Trump will lose, they said, if he cant handle criticism of his record or his paper-thin positions on many issues. Last week, he bobbled a question from conservative radio host Hugh Hewitt, admitting testily that he didnt know the names of the leaders of Al Qaeda or Islamic State. Less likely, he could simply run out of new things to say. \"You have to presume he cant dominate the media for five more months this way,\" Weber said. \"What happens to him when the attention starts to dry up?\", Trump will face a tough early test in Iowa, where the Republican caucuses have been dominated by Christian social conservatives not his natural constituency. See the most-read stories this hour >>, \"If he comes in third or fourth in Iowa, he could lose his cool,\" one strategist said. \"If he looks like a sore loser and says he was robbed, that could cause the floor to fall out.\", On the other hand, another strategist told me, \"The Southern primaries [in February and March] are a huge opportunity for him. If he wins enough of those, the rest of the field will collapse because their money will dry up. At that point, it becomes Trump versus someone else, an anti-Trump  probably Rubio, Walker, Kasich or Bush. And then its a real race.\", On balance, a Trump victory still appears unlikely; his conservative credentials are too weak, his political experience too thin. \"Im hearing people talk about him as if he were the inevitable nominee,\" Weber said. \"We arent there yet.\", But Republican Partys grandees are glumly acknowledging that Americas love affair with Trump is more than a summer romance  maybe a lot more. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus, Follow the Opinion section on Twitter@latimesopinion and Facebook, ALSO:, Less water might be plenty for California, experts say, and conservation is only the start, As migrants pour into Germany, Pope Francis calls on faithful to take them in, U.S. judge dismisses challenge of Arizonas SB 1070 immigration law]", "Date": "20150906", "Title": "[Trump can't actually win, can he?]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0906-mcmanus-trump-20150906-column.html\n", "Author": "NULL"}
