{"Content": "[When it convenes Jan. 6, the Republican-controlled 114th Congress will bring a wave of reinforcements to enhance the clout of President Obamas antagonists. But it remains to be seen whether that will set the stage for two years of continuing conflict or open a door to compromise as both parties seek to lay the groundwork for the 2016 presidential race. Here is a look at eight lawmakers who will probably play key roles in the 2015 congressional battles. The hard-liners: Sen. Ted Cruz of Texas usually grabs most of the attention, but look for Sen. Mike Lee of Utah to step out of that shadow as a prominent leader of the Republicans tea party wing. Lee was Cruzs chief ally in past showdowns, such as the effort to defund Obamas signature healthcare law and the presidents executive actions on immigration this winter. Both issues are certain to be on the agenda next year. After unseating a moderate Republican incumbent in 2010, Lee has quietly worked to develop a conservative policy platform on a range of issues. But the 114th Congress will pose a test for Lee and his conservative convictions as members of the Republicans establishment wing consider mounting a 2016 primary campaign against him in the solidly Republican state. For Democrats, the next two years may be judged by how Sen. Elizabeth Warren wields her influence with the partys progressive base. Until recently, she had largely followed the traditional low-profile route for new senators. But last months fight over a major spending bill, which included 11th-hour changes to relax Dodd-Frank Act banking regulations, prompted Warren to take a leading role against the deal. Warren now boasts a new, somewhat informal leadership title for Senate Democrats as they begin life as the chambers minority party for the first time in eight years. She says she is not running for president in 2016, but hasnt slammed the door shut in the way Hillary Rodham Clinton and other would-be Democratic presidential hopefuls might like. The insiders: Republican Sen. Rob Portman of Ohio has been a behind-the-scenes player in Washington for years  including six terms in the House and two years in George W. Bushs administration as trade representative and then budget director. He was on Mitt Romneys short list for vice president in 2012, and mulled a 2016 presidential bid of his own before announcing last month that he would focus instead on running for reelection to the Senate. Incoming Majority Leader Mitch McConnell was among the happiest at Portmans decision. Not only does it mean McConnell probably doesnt need to worry about Republicans losing the seat in 2016, it also frees Portman to focus on helping the Kentuckian advance party priorities. Portmans background makes him a natural for helping to guide the budget-writing process that will consume Washington for much of the early part of the year. Hell also have a seat at the table for talks about tax reform, an area of possible common ground between Obama and Republicans. With outgoing Senate Majority Leader Harry Reid inclined to focus on his own 2016 reelection fight, Sen. Charles E. Schumer will take on more responsibility in managing how Democrats adjust to their new status in the minority. Schumer has worked to build bridges with Republicans even as hes been one of his partys primary political strategists. The New York Democrat has been seen as Reids most likely successor, but the elevation of Warren into leadership underscored the challenges Schumer will face in leading a caucus with an increasingly vocal progressive wing. The leaders: Rep. Kevin McCarthy begins his first full term as the House majority leader in January, after Eric Cantors shocking primary election loss in June led to a promotion for the five-term Bakersfield congressman. His more low-key and back-slapping style has been received warmly among the Republican rank and file, but that doesnt mean hes been able to avoid the internal party divisions that vexed his predecessor. The real test for McCarthy in the new Congress will be to demonstrate he has as much heft in policy as he has in politics. Democrat Ben Ray Lujan of New Mexico is one of the only new faces in the House Democratic leadership next year, assuming the role of chairman of the Democratic Congressional Campaign Committee. House Minority Leader Nancy Pelosi (D-San Francisco) tapped the 42-year-old amid angst within the party over its direction as Democrats start 2015 with the fewest House seats since 1949. Lujans primary job will be helping put Democrats within striking distance to regain the House majority heading into 2016, but hell also provide a voice for newer members at the leadership table. The swing-state senators: Republicans successful election night gave the party a slightly bigger cushion in the upper chamber than many expected  54 seats. That could be key considering that the 2016 election map favors Democrats because of the high number of Republican incumbents facing reelection in states that Democrats have carried consistently in recent presidential election years. Sen. Mark Steven Kirk of Illinois, who won the seat Obama vacated to become president, could be the most vulnerable. Kirk has forged a reputation as a moderate Republican during multiple terms representing the Chicago suburbs in the House and during his first term in the Senate. Whether that continues to suit state voters, and whether he can mount a vigorous campaign as he continues to recover from a stroke, will be key to whether Republicans can hold their majority into the next presidential administration. Aside from Reid, Sen. Michael Bennet of Colorado is one of the few Democratic incumbents who will be running in a competitive state in 2016. Bennet was first appointed to the Senate and then won a tough election fight in the otherwise Republican-friendly year of 2010. The 2014 Democratic losses were especially tough on Bennet because of his role as the partys campaign committee chairman. michael.memoli@latimes.com]", "Date": "20141231", "Title": "[Eight lawmakers to watch in the 114th Congress]", "Link": "http://www.latimes.com/nation/politics/la-na-year-ahead-congress-20141231-story.html\n", "Author": "[Michael A. Memoli]"}
