{"Content": "[The first time Barbara Boxers name showed up in a Los Angeles Times editorial, it was May of 1984 and she was a first-term U.S. representative from the Bay Area pushing legislation that would force utilities  including the Los Angeles Department of Water and Power and the Metropolitan Water District  to pay market rates for power generated by the Hoover Dam. The editorial referred to her effort as the Boxer Rebellion, announced that the board was pleased that Boxer failed, but noted that the issue would revive in 2017 when the contract Congress approved over her opposition expired (it was recently extended until 2067). Since then, Boxers name has been mentioned in 172 Times editorials, some favorable, some not-so-favorable (including the papers refusal to endorse her 1998 reelection against Republican challenger Matt Fong). And even though Boxer has announced she will not seek reelection in 2016, I suspect her name will show up on the editorial page a few more times before she ends her career in elective office. But judging by the history, its a guess as to whether the page will agree with her or fault her. In 1992, as Boxer and fellow Bay Area politician Dianne Feinstein were seeking seats representing California in the U.S. Senate, the editorial board chastised both women for emphasizing social issues  the nation was still arguing about sexual harassment allegations by Anita Hill against new Supreme Court Justice Clarence Thomas  over economic issues (the editorial urged a focus on growing wealth inequality). Though The Times did not endorse candidates in presidential, senatorial and gubernatorial elections in those days, itwelcomed the victorious Boxer (and Feinstein) to the Senate and praised them for helping the upper legislative chamber look a bit more like the people it represents. During Boxers first term, the page gave the senator credit for drawing attention to Californias effort to create a low-level nuclear waste dump site in Imperial Countys Ward Valley, some 40 miles from the Colorado River; Boxers actions ultimately helped killed the plan. Though the project was of national importance, the board said, it was not on the national political radar screen until Sen. Barbara Boxer put it there, drawing attention to neglected, disturbing studies of radioactive pollution paths Californians owe a debt of gratitude to her vigilance. The board also joined Boxers call for open hearings by the Senate Ethics Committee on sexual and official misconduct allegations against Republican Sen. Bob Packwood of Oregon, a hot-button issue that involved both gender and party politics. But when Boxer faced off against Fong in her first reelection, the board (by then back in the Senate endorsements game) went with Fong:, Sen. Barbara Boxer has been a staunchly loyal defender of the handful of issues that drive her: a womans right to an abortion, environmental protections, tough gun control. On all of these issues, shes been a dependable vote. Dare we ask for more in a U.S. senator for California?, We do dare. We dare to ask for a senator who can forge new alliances, nationally and internationally, to benefit California. A leader for the states disparate and too often disorganized representatives in Congress. A senator who demonstrates a willingness to engage in, and readiness to take charge on, a wide variety of economic and social issues that will face the nations most diverse and populous state. The editorial page may have asked, but Boxer delivered an answer it didnt like, trouncing Fong by 10 percentage points. Afterward, the board chastised her over the harsh tone of the campaign: It was unfortunate that Boxer had to resort to such a negative campaign in recent weeks to win. Now, we hope she will expand her horizon and become a more effective senator for the state. The pro-free-trade board disagreed with Boxer in 2000 on protectionist policies for California citrus growers but appreciated her 2002 efforts to preserve wilderness land in the state and to revive the Superfund tax. In fact, the page decided when Boxer ran for her third term in 2004 that she merited an endorsement against former Republican Secretary of State Bill Jones. The page called her an unabashed liberal. Though her critics use the word derisively, liberal is not a disqualification for office in California. A majority of voters are in tune with Boxer on the environment, a womans choice on abortion and gun control. Though Boxer has in the past seemed too much the advocate and too little a lawmaker, she has worked during her second term on being more effective . But Boxers opposition has helped prevent misguided exploration for oil and gas in the Arctic National Wildlife Refuge in Alaska, block confirmation of extremist judicial nominees and prevent new offshore oil drilling in the West. Boxer also is sponsoring a bill to create new federal wilderness areas in California. Californians benefit, in terms of federal dollars and clout, from having two increasingly senior senators representing the state. Boxer deserves reelection. But it was far from blanket support. When Dubai Ports World wanted to buy some U.S. shipping ports in 2007, Boxer opposed it, despite backing an earlier effort by Cosco to move its shipping operations from the Port of Long Beach to a closed naval base. Congress, fearing Cosco was a front for Chinese spies, \"scotched the deal,\" though Boxer supported it. What was the difference between the two? Cosco came before 9/11, and the Dubai Ports World proposal came afterward. The page, though, smelled politics: One possible explanation is that the Cosco deal was heavily backed by a Democratic administration, while the Dubai Ports World deal is heavily backed by a Republican administration. But that would mean Boxer is working against the interests of her state in order to score cheap political points. She would never do such a thing. Would she?, The page thought so when Boxer pushed the Passenger Bill of Rights in 2007 after JetBlue passengers were stranded for hours on tarmacs by East Coast storms. JetBlue screwed up big time. But that doesnt mean Congress needs to intervene with headline-chasing legislation such as a Passenger Bill of Rights proposed by Sen. Barbara Boxer (D-Calif.) and Rep. Mike Thompson (D-St. Helena). Boxer and Thompson want to impose regulations requiring airlines to let passengers deplane when on-ground delays stretch longer than three hours, provide better information about delays and cancellations and offer stranded passengers food, water and adequate restrooms. The answer? Market forces, said the board. But in 2009, the board supported Boxer (and Feinstein) in their effort to remove some of the partisanship from selection of federal judges by using state screening panels to recommend people to submit to the White House as potential candidates. By the time Boxer stood for what turned out to be her last run for Senate, though, The Times had cooled and sat out the Democratic primary. We find that were no fans of incumbent Barbara Boxer. She displays less intellectual firepower or leadership than she could. We appreciate the challenge brought by Robert Mickey Kaus, even though hes not a realistic contender, because he asks pertinent questions about Boxers lockstep liberalism on labor, immigration and other matters. But we cant endorse him, because he gives no indication that he would step up to the job and away from his Democratic-gadfly persona. The fast-growing population of California voters who no longer affiliate with a party are seeking a dynamic and creative representative to help direct national policy. But the substantive debate about whether Boxer or the Republican nominee is the best person must wait until after the primary. Then, we hope, it will be possible to endorse a candidate. Boxer won easily, and by fall the idea of a Sen. Carly Fiorina was a bit much; the page endorsed Boxer. Boxer has been a voice  if sometimes a strident one  for values promoted by this editorial page: individual rights, equality, environmental protection and constructive engagement by the federal government with national economic problems, including the crisis in healthcare. We have criticized Boxer in the past for not exercising influence commensurate with her seniority. For example, as chair of the Senate Environment and Public Works Committee, she has brought creative ideas to the process of crafting a six-year transportation bill, but she bears some responsibility for the panels failure to produce one  the legislation is now a year overdue. Part of the problem is an assertiveness that often is perceived as arrogance. But the paramount responsibility of a senator is to cast the right votes for her state and her country. By that measure, the contrast between the two candidates couldnt be starker. So whats the last editorial to mention Boxer? It came in June as the board backed legislation Boxer pushed, the International Violence Against Women Act, that calls for the U.S. in countries where it is engaged in foreign assistance, to address the problem of violence against women and girls, to help create programs to educate local populations about recognizing and preventing such violence, to promote gender equality and to support existing programs that are confronting these issues. The board said the measure was broad and somewhat vague. But it should not be controversial. Yet it was. And Boxer, as she so often has been, was right in the middle of the fight. The board might not have always agreed with Boxer, but I doubt it would argue that the Senate will be a less interesting place without her. Follow Scott Martelle on Twitter @smartelle.]", "Date": "20150108", "Title": "[Barbara Boxer: A voice for individual rights, equality, environmental protection and more]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-barbara-boxer-retire-2016-20150108-story.html\n", "Author": "[Scott Martelle]"}
