{"Content": "[For months, Rep. Steve Knight (R-Palmdale) has appeared on a prominent list of congressmen who opposed the Export-Import Bank. That position won him the admiration of Tea Party groups and other conservatives, who abhor the bank as an example of crony capitalism and have made its destruction their top goal. So it was a big surprise this weekend when Knight was quoted in a Los Angeles Daily News column saying that letting the banks charter lapse would put \"American jobs at risk.\", When asked for a clarification Monday, his office issued an even stronger statement of support, arguing that small businesses in his district depend on the bank. \"If we allow the bank to close its doors, the families that I serve who rely on these businesses for their well-being would suffer immensely, and that is unacceptable,\" he wrote. \"I acknowledge that reforms are necessary, but we cant do that on a one-year basis and so I support reauthorization, he added. So how did Knight appear to hold two different positions on such a divisive issue?, It began during last years campaign, when Knight filled out a questionnaire for the local professional aerospace union. The questionnaire asked whether Knight supported reauthorizing the \"U.S. Export-Import Bank.\", Knight responded \"I do not support reauthorizing the Ibank,\" according to the survey, which is posted online. That response was picked up by Heritage Action for America, a conservative political group, which used his position to grade his performance as a conservative lawmaker. Heritage is a leading opponent of the bank, which subsidizes American exports. Democrats, who have made Knight a prime target in the 2016 election, noticed the Heritage website. The Democratic Congressional Campaign Committee blasted Knight in a statement last week: Knights abdication of duty means that businesses across the 25th District and the nation could stop exporting and even go out of business. Knights office had a hard time explaining the apparent flip-flop. His spokesman said the congressman was still studying the issue when he filled out the questionnaire last year. And although the questionnaire clearly asked about the U.S. Export-Import Bank, Knights office said he was instead referring to the California Infrastructure and Economic Development Bank, known as the IBank. noah.bierman@latimes.com, Twitter:@noahbierman]", "Date": "20150706", "Title": "[Rep. Steve Knight shows change of heart on controversial Export-Import Bank]", "Link": "http://www.latimes.com/nation/la-na-rep-steve-knight-export-import-20150706-story.html\n", "Author": "[Noah Bierman ]"}
