{"Content": "[After bolting to national prominence on a record of bringing public employee unions to heel and taming runaway pension costs like those that have challenged state governments across the country, Chris Christie hit a very large hurdle recently. A state court ruling last week caused the retirement policies Christie had battered through New Jerseys Legislature to unravel spectacularly, leaving the state with a massive deficit driven by pension costs that Christie had not, it turns out, gotten fully under control. The judge ruled that Christie had violated state law by not making almost $900 million in required payments to the state pension fund in order to balance last years budget, a move the governor had planned to repeat for the current fiscal year. Among Republican governors hoping to become president, Christie is not alone in having troubles back home. In Wisconsin, Gov. Scott Walker also faces a big deficit, which he has tried to close by cuts to the budget of the state university system, long the states crown jewel. And Louisianas Bobby Jindal is struggling with the fact that the state has gone from a giant surplus to a giant deficit under his stewardship. In an election season in which voters have a sour view of Washington, governors have unquestioned political appeal. But the problems that the GOP trio have run into in the last few weeks are a reminder that being a chief executive comes with downsides too. When all is well, a governor can tout his record of decisive action. But right now, governors who marketed themselves as fiscal miracle workers are scrambling to avoid damage from dour headlines. Democrats, of course, are doing everything they can to highlight the budget troubles the Republicans face, particularly at a time when blue states like California  which GOP presidential contenders have long derided as financially reckless  are doing well. \"Its downright laughable for these governors to run a presidential campaign on fiscal responsibility,\" said Jared Leopold, spokesman for the Democratic Governors Assn. Each of the three tried out a somewhat different strategy in speeches this week to the Conservative Political Action Conference, the annual Washington gathering where GOP headliners pitch themselves to party activists. Christies approach  consistent with his persona  was defiance. \"The elite folks from the media who cover me everyday,\" he declared, \"when you do things like I have done in New Jersey to take on a lot of these special interests frontally that they support, they just want to kill you.\", \"I am still standing,\" Christie said. \"Here I am.\", Still standing, but wounded. Even before the states fiscal problems made headlines, Christies position in the presidential field had been on the decline. Conservative talk radio host Laura Ingraham, who interviewed Christie onstage at CPAC, pointed out that in one recent poll of Republican voters, he did worse than Ben Carson, the retired neurosurgeon who has become a favorite among conservatives but an extreme long shot for the partys nomination. \"The budget provides more ammunition to Republicans who dont like him in the first place,\" said Jack Pitney, professor of political science at Claremont McKenna College and a former Republican party official. \"Its a convenient place to hang their misgivings and animosities.\", There is no shortage of ammunition. New Jerseys credit rating has been downgraded eight times during Christies tenure. Polls show that voters at home have lost confidence in his financial management. The state, according to data compiled by the Pew Charitable Trusts, is one of the least financially secure in the country. Its rainy day fund is so small, it could keep government running for just three days. \"These candidates wont be courting voters until later, but these troubles are raising doubts with the money people and party activists they need to court now,\" said David Redlawsk, director of the Eagleton Center for Public Interest Polling at Rutgers University in New Jersey. \"Potential supporters are not flocking to Christie the way they did in the last presidential election, when they were begging him to run.\", For Jindal, a budget crisis is creating even more unwanted baggage. \"Its one thing for a Republican governor to be controversial and unpopular in a Democratic state like New Jersey or Wisconsin, and quite another to have rock-bottom ratings in a deeply conservative state like Louisiana,\" said Larry Sabato, a professor of political science at University of Virginia. \"In that sense, Jindal is in a deeper hole.\", Analysts say the culprit in his case is not so much the governor as plunging oil prices, which deprive Louisiana of tax revenue it relies on to pay for schools, roads and other services. But such are the perils of being the states chief executive. When things go wrong, the governor gets blamed. Jindals strategy at CPAC was to change the subject. He did not talk about state budget issues, preferring to steer conversation toward radical Islamic terrorists, Obamacare, White House immigration policy and how federal education policy oppresses his son, a second-grader. He also took shots at the GOP leadership in Washington. \"It is time for our Republican leaders in Congress to grow a spine,\" he said. Walker, who has long profited politically by portraying himself as a target of liberal attacks, embraced the criticism he is facing at home as a mark of his courage. And the crowd embraced him. \"We are a state that has been taxed and taxed and taxed, and today I am proud to say after four years as governor weve reduced the burden on hardworking taxpayers by nearly $2 billion,\" he said. \"How many other governors can say that?\", Although budget cuts at the University of Wisconsin will be controversial at home, they may play well among Republican primary voters, many of whom see universities as hotbeds of liberalism. All three of the governors went over well at CPAC. How voters in Iowa, the first caucus state, and others on the primary trail will respond remains to be seen. \"Iowans hate debt,\" said Tim Albrecht, a GOP political consultant in Des Moines. \"These governors will need to spend a lot more time explaining to voters here why they are having these budget difficulties.\", evan.halper@latimes.com, Twitter: @evanhalper]", "Date": "20150228", "Title": "[Deficits at home are hurdle for GOP governors eyeing White House run]", "Link": "http://www.latimes.com/nation/la-na-gop-governors-20150227-story.html\n", "Author": "[Evan Halper]"}
