{"Content": "[Both major political parties and groups of their deep-pocketed supporters are playing big in the handful of fiercely fought congressional races in California this year. With Republicans widely expected to keep  even add to  their House majority in November, the interest from national groups appears to be all about future elections. The parties are positioning themselves for 2016, when the nation will next elect a president and when the political climate could be very different, and even beyond to 2018, experts said. \"Republicans want a cushion against the risk of future losses,\" said John J. \"Jack\" Pitney Jr. a Claremont McKenna College political scientist and former GOP official. \"Democrats want to limit GOP gains this year so that they will be in a better starting position for when their prospects are brighter.\", As a result, tough battles have developed in half a dozen districts. In four of those, Democrats, buoyed by strong turnout for President Obama, wrested the seats from Republicans in 2012. Another is in the Central Valley, where Democrats hope Amanda Renteria, a local native who has worked in Washington, can dislodge Rep. David Valadao (R-Hanford) from the seat he won that year. The other is in the Inland Empire, where the parties are fighting it out over who will succeed retiring Rep. Gary Miller (R-Rancho Cucamonga) in a Democrat-tilting district. The closest contests are widely believed to be those involving three first-term Democrats. In Northern California, Rep. Ami Bera of Elk Grove faces former Republican Rep. Doug Ose of Sacramento. In Southern California, Republicans recruited Assemblyman Jeff Gorell of Camarillo to take on Rep. Julia Brownley of Westlake Village, and former San Diego City Councilman Carl DeMaio, seen by some as a rising GOP star, is challenging Rep. Scott Peters of San Diego. The nonpartisan Cook Political Report labels each of the three contests a toss-up. Cook gives a slight edge to the fourth Democratic freshman, Rep. Raul Ruiz of Palm Desert, opposed by GOP Assemblyman Brian Nestande, also of Palm Desert, but concludes the Central Valley district probably will stay in the Republican column. The fierce competition is fanned by spending by groups that are not part of the candidates own campaigns. The Democratic Congressional Campaign Committee has so far spent roughly $3 million against DeMaio, Gorell and Ose, according to campaign reports filed with the government. Another Democratic group, House Majority PAC, has pumped almost half a million dollars into efforts to defeat Gorell and Ose. The National Republican Congressional Committee reported spending about $1.5 million to oppose Bera and Peters. Other groups involved in some of these races include the U.S. Chamber of Commerce, which has spent about $600,000 to support Ose and Valadao and more than $300,000 to oppose Bera. Likewise, Defending Main Street SuperPAC Inc. which supports incumbent Republicans, spent $100,000 for Ose and $29,000 for Valadao. With a month to go until election day, other interests have signaled theyll get involved, including the conservative American Action Network, which has reserved television advertising time. Some of the strongest attacks have surfaced in the Peters and Brownley races. In San Diego, the National Republican Congressional Committee launched a TV ad last week implying that Peters had used his position in Congress to engage in insider trading, a federal felony. The Peters campaign called the ad \"a false, egregious and purely political attack\" that its lawyers were working to have taken down. The local ABC affiliate, 10 News, and its Civility Project, which analyzes political advertising, called it \"outrageous\" and gave it an \"F\" grade. The Brownley camp has invested heavily in trying to knock down Gorells record as a work-across-the-aisle moderate in a district where Democrats hold a slim registration edge. No sooner had Gorell disavowed the tea party as \"too extreme\" than Brownley supporters dug up a 2009 YouTube video showing him addressing the ultra-conservative group at a rally with a tea bag around his neck. Gorell cited an analysis by the nonpartisan Sunlight Foundation that reviewed voting records and showed him to be one of the most moderate members of the state Legislature. He predicted his record, his military service in a district flush with veterans and his strong local ties would win the day. \"Im going to prove that you can win a congressional seat in this part of the state by running a positive campaign,\" Gorell said. On Thursday, the Brownley campaign issued a news release portraying Gorell as anti-immigrant, noting, among other things, that he had once defended Proposition 187, the controversial 1994 ballot measure intended to deny most public services to those in the country illegally. Gorell strategist Reed Galen said his clients record shows he is \"staunchly in favor of comprehensive immigration reform.\" Brownley and her allies \"have spent millions distorting Gorells record to avoid having to talk about her own,\" Galen said. Brownley and the Democratic Congressional Campaign Committee have said she is more in line with district voters on most issues, including healthcare access and womens rights. Longtime Democratic strategist Darry A. Sragow said it was no accident that many of the Democratic campaigns in competitive districts this year are trying to brand their Republican opponents as tea party candidates. In the past, social issues such as abortion and the death penalty were used to mobilize voters, Sragow said. Today, its the tea party. \"To a lot of voters, especially Democratic voters,\" Sragow said, \" tea party is a pejorative.\", Not all candidates are running in the middle. Republican Iraq War veteran and business owner Paul Chabot is competing with Redlands Mayor Pete Aguilar for an Inland Empire seat that most analysts say offers Democrats their best chance for a pickup this year. The Democratic Congressional Campaign Committee has spent about $523,000 against Chabot. Aguilar is emphasizing his support for schools and business growth and touting endorsements from several prominent local Republicans as evidence that he can work effectively across party lines. But the campaign strategist for Chabot, who opposes abortion and is endorsed by the National Rifle Assn. says his conservative views are shared by a majority of the districts voters, including many Democrats. \"This district does have a lot of Democrats,\" said the strategist, John S. Thomas, acknowledging the rival partys modest registration edge. But he added, referring to one of Los Angeles most liberal bastions, \"These are not Westside L.A. Democrats.\", Twitter: @jeanmerl, Times researcher Maloy Moore contributed to this report.]", "Date": "20141004", "Title": "[California congressional races heat up as parties look ahead to 2016 ]", "Link": "http://www.latimes.com/local/politics/la-me-pol-congress-elections-20141005-story.html", "Author": "[Jean Merl]"}