{"Content": "[House Speaker John Boehner declared Friday that President Barack Obama was damaging the presidency with his unilateral action on immigration. He said the Republican-run House will not stand by, but gave no hint of what the response would be. I will say to you, the House will, in fact, act, Boehner, R-Ohio, said at a news conference the morning after Obama announced plans to offer deportation relief and work permits to 5 million immigrants who are in the country illegally. We will listen to the American people, we will work with our members and we will work to protect the Constitution of the United States, Boehner said. But Republicans have few good options as they scramble for a solution that satisfies irate conservatives without alienating moderates, Hispanics and other voters who will be crucial for the 2016 presidential election. Possibilities include suing Obama or trying to fight his moves through the budget process. The situation poses a major challenge for Boehner and incoming Senate Majority Leader Mitch McConnell, R-Ky. barely two weeks after midterm election victories that handed Republicans control of the Senate and increased the partys majority in the House. Obamas move forces them to inaugurate their newly minted congressional majorities amid frantic GOP infighting that party leaders wanted to avoid. With Republicans seething over Obamas go-it-alone approach on such a contentious issue, its an open question whether Boehner and McConnell will be able to rein in the tea party faction in Congress that forced a politically damaging government shutdown a year ago over the presidents health care law. The answer will have major implications in determining whether the GOP can hang onto its newfound control of Congress and hope to win the White House in two years. Sen. Jeff Sessions, R-Ala. one of the fiercest opponents of Obamas actions, ruled out impeachment, telling the conservative Heritage Foundation, we are not going to impeach or move to impeach. Sessions did insist that the Congress can use its power over spending to affect the immigration initiative. What did the president do? He pulled the pin on the grenade two weeks after the election, said Rep. Pat Tiberi, R-Ohio, a Boehner ally. I dont think anybody knows or can predict what happens and the carnage that this creates quite frankly for the legislative process. Boehner took issue with Obamas claim that he had to act because House Republicans never moved on the bipartisan immigration bill that passed the Senate last year. That measure offered a path to citizenship for many of the 11 million immigrants here illegally, going further than Obama can on his own. Boehner said it was Obamas fault because lawmakers didnt trust him after earlier unilateral moves on health care. He created an environment where the members would not trust him, and trying to find a way to work together was virtually impossible, Boehner said. I warned the president over and over that his actions were making it impossible for me to do what he wanted me to do. Conservative lawmakers are pushing to insert language in upcoming must-pass spending bills to block Obamas order. Party leaders warn that could lead to a government shutdown. The chairman of the House Appropriations Chairman, Rep. Hal Rogers, R-Ky. also argues it is impossible to defund the U.S. Citizenship and Immigration Services because it pays for itself based on application fees. Rogers is pushing for a yearlong spending bill to get spending fights out of the way, and then finding some other way to respond to Obama. Thats angered some conservatives who argued that establishment Republicans were just looking for a way out of a necessary confrontation with the president. Theyre contriving red herring arguments to get to the point where enough members will walk out of this Congress and go home for Thanksgiving and say, Well, theres nothing we can do, said Rep. Steve King, R-Iowa, who was among a small group of conservatives arguing impeachment should be on the table as a last resort.]", "Date": "20141121", "Title": "[Boehner: We will not stand idle on immigration]", "Link": "http://www.seattletimes.com/seattle-news/politics/boehner-we-will-not-stand-idle-on-immigration/", "Author": "[ERICA WERNER]"}