{"Content": "[WASHINGTON (AP)  An effort to draft Elizabeth Warren into the 2016 presidential race plans to close up shop next week, acknowledging that the Massachusetts senator will not  as she has repeatedly said  seek the Democratic nomination. MoveOn.org and Democracy for America said Tuesday they plan to suspend their Run Warren Run campaign on June 8. In their last act, theyll deliver a petition to Warren with more than 365,000 signatures urging her to run for president. The groups said they had already influenced the economic debate in 2016 and want to focus their efforts on working with Warren on issues such as trade, including defeating the effort to give President Obama so-called fast track authority to complete the proposed Trans-Pacific Partnership trade deal. Even without her in the race, Elizabeth Warren and the Run Warren Run campaign she inspired have already transformed the 2016 presidential election by focusing every single Democratic candidate on combating our countrys income inequality crisis, said Charles Chamberlain, executive director of Democracy for America. Some of Warrens followers may back Vermont Sen. Bernie Sanders, an independent who is seeking the Democratic nomination and has offered an economic agenda in line with Warrens views. Sanders, who formally launched his campaign last week, has called for a political revolution to elevate issues like income inequality, overhauling the campaign finance system and addressing climate change. Ilya Sheyman, MoveOns executive director, said the campaign had helped elevate Warrens platform, an agenda that rejects the rigged status quo in Washington and puts working and middle-class Americans over corporate interests. The groups said they had held more than 400 events and recruited more than 60 state lawmakers and local party leaders from the early-voting states of Iowa and New Hampshire to join their movement. ", "Date": "20150602", "Title": "[Draft Warren groups to suspend efforts to lure her into 2016]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/draft-warren-groups-to-suspend-efforts-to-lure-her-into-2016/", "Author": "[KEN THOMAS]"}