{"Content": "[Washingtons presidential primary will return in 2016, but itll remain mostly for show. The state budget enacted this month included $11.5 million to pay for the primary, which had been canceled in 2012 due to cost concerns. Some critics argue the primary should remained shelved since the political parties are free to ignore it. Despite a push by Secretary of State Kim Wyman, lawmakers did not pass a bill to make the primary more than a beauty contest by requiring the state Democratic and Republican parties to at least partially heed its results. Instead, the parties can rely on partisan caucuses to decide which presidential candidates will win Washingtons delegates. The state Democratic Party plans to do just that, continuing its tradition of selecting 100 percent of presidential-nominating delegates based on caucuses. The state Republican Party plans to award about half its delegates based on the primary and half based on caucus results. Wyman, a Republican, said shes happy the primary is back, even if it is nonbinding. I definitely think its worthwhile. You look at the history of the presidential primary  the participation is so much greater (than caucuses) even if one party doesnt use the results, she said. Wymans legislation that would have required the parties to allocate at least some delegates based on the primary passed in the Republican-controlled state Senate but stalled in the Democratic-majority House. Some Democrats argue the nonbinding vote remains a waste of taxpayer dollars. Gov. Jay Inslee didnt fund it in his budget proposal released in December. The state Democratic Party signaled early this year it had no intention of honoring the primary results. I dont know why the Legislature wants to spend $11.5 million on a process that were not using to select our delegates, said state Democratic Party Chairman Jaxon Ravens. Right now Id rather see that $11.5 million spent in other ways around the state. Ravens defended the caucus system as challenging and a bit chaotic, but said the gatherings bring neighbors together to discuss issues and serve as a organizing opportunity for the party. State Republican Party spokesman Steve Beren said the GOP is fine with using the primary results as part of its delegate-selection process. He needled Democrats for ignoring a popular democratic process entirely: maybe they should change their name. Caucuses  long weekend meetings typically attended by a relatively small slice of hard-core party activists  can be vulnerable to takeover by small but organized political factions. Washingtons primary was spurred by just such a coup in 1988, when Christian conservatives dominated the Republican caucuses to hand televangelist Pat Robertson a victory. The next year an initiative to the Legislature created the presidential primary. State Rep. Ross Hunter, D-Medina, the chief budget writer in the House, said the primary wastes money as currently constructed but said its part of the law and he had no choice but to fund it because lawmakers did not pass legislation suspending it. Hunter said he supports primaries over caucuses in general. I think selecting the most powerful person in the world should be done by the largest selection of people that we can possible have do it, he said. The date of the primary is not settled. State law calls for it to be held in late May, but Wyman is pushing for legislative leaders to agree to move it to early March to give the state more clout in the presidential race. Although Washington does not require voters to register with a party, those voting in the primary will have to declare their party preference, Democrat or Republican, and vote only in that contest. Wyman said the primary could lure more presidential contenders to campaign here  especially in the crowded Republican contest. What Im hoping for is having an early enough primary that candidates want to show well in it and visit Washington and hear the issues that are important for the Pacific Northwest  and not just use us as a cash machine, she said.]", "Date": "20150707", "Title": "[States presidential primary next year mostly for show]", "Link": "http://www.seattletimes.com/seattle-news/politics/states-beauty-contest-primary-to-return-next-year/", "Author": "[Jim Brunner]"}