{"Content": "[More than 18.6 million Americans in 32 states already have cast ballots in the nations midterm elections, a significant increase over the 2010 early voting, according to data from state elections officials. At least 11 states have exceeded their advance voting totals from the last midterms in 2010, with several more poised to do the same as voters return more absentee ballots and officials tally the final days of in-person advance voting. In 2010, when Republicans regained control the House and swept into power in statehouses across the country, 26.9 million or about 30 percent of the total 89 million ballots were cast before traditional precincts opened. Heres a look at where some states with key races stand this year:, COLORADO, With the count updated through Friday, Republicans maintained an 8.1 percentage point lead over Democrats in the first Colorado election in which every registered voter got their ballots by mail. GOP registrants accounted for 41.4 percent of the returned ballots, compared to 32.3 percent from Democrats. Independent voters sent back 25.3 percent of the total, with 1.1 percent coming from minor party voters. That could be a good sign for Republican Rep. Cory Gardners bid to unseat Democratic Sen. Mark Udall, who was once viewed as a relatively safe incumbent and now could become a key pickup in the GOPs quest for six more seats and a majority. Republican analysts say that they continue to lead Democrats among irregular midterm voters  a target for both parties. The GOP advantage is wider than its 5.6-point margin in 2010. That year, Democratic Sen. Michael Bennet overcame the early deficit to win his seat by 1.7 percentage points or about 30,000 votes. FLORIDA, Democrats continue to chip away at the Republicans usual pre-Election Day lead, as Charlie Crist tries to unseat GOP Gov. Rick Scott. Registered Republicans still have out-voted Democrats, but the margin has dwindled over the last several days to settle at 3.2 percentage points heading into Tuesday. Scott benefited from a 13-point early advantage four years ago, when he won a narrow victory even without a majority. IOWA, Republicans continue their improved push in 2014, narrowing Democrats traditional advantage after watching Democrats use early voting to help President Barack Obama win the state in both of his national victories. The state GOP has made advance voting a priority for its Senate nominee Joni Ernst, who is trying to win the seat opened by Democrat Tom Harkins retirement. As of Monday, the number of ballots received was 108 percent of the 2010 total, with registered Democrats casting 40.9 percent of ballots and Republicans responsible for 39.2 percent. Four years ago, in a GOP wave year, Democrats led the early count by 5.5 percentage points. Democrats say their analyses show they still have attracted more new midterm voters than Republicans, arguing that the GOP boost comes mostly from steering reliable supporters to early ballots, rather than voting on Tuesday, a shift that doesnt change the bottom line. LOUISIANA, With both major parties outperforming their 2010 benchmarks, Democrats account for more than half of the total advance ballots, 19 percentage points ahead of Republicans. But Democratic Sen. Mary Landrieu still faces an uphill battle for a fourth term. Republicans say their analysis shows that African-American turnout thus far is not high enough to overcome Landrieus deficit among white voters, including rural and small-town whites who are still registered as Democrats and could account for at least some of the partys early lead. Polls suggest Landrieu will face Rep. Bill Cassidy in Dec. 6 runoff. NORTH CAROLINA  Registered Democrats will go into Election Day having cast 182,000 more ballots than registered Republicans  a gap of 16 percentage points. Democrats say thats an important number for Sen. Kay Hagan, because it comes in part on the strength of African-Americans and women, who account for a larger share of the advance electorate than they did in 2010 and, in the case of black voters, even in 2012, when Obama topped the ballot. Republicans reply: Its still not enough. In 2010, North Carolinas other senator, Republican Sen. Richard Burr, won by 313,000 votes in 2010 even with an advance deficit of more than 95,000 for Republicans. WISCONSIN  With more than 506,000 ballots received as of Monday, Wisconsin has more than doubled its 2010 pre-election turnout, when Republican Scott Walker first claimed the governors seat. This time, hes aiming for a second term that could set up a run for president in 2016. ", "Date": "20141103", "Title": "[Midterm elections: 18.6 million votes already cast]", "Link": "http://www.seattletimes.com/seattle-news/politics/midterm-elections-186-million-votes-already-cast/", "Author": "[BILL BARROW]"}