{"Content": "[WASHINGTON  Most U.S. presidential candidates really dont want to spend nearly two years bowing and scraping to voters and campaign donors. Most voters sure dont want to hear about the presidential race for anywhere near that long. Why, then, does it take so loooong to pick a U.S. president? Blame American-style democracy?, Blame the pollsters and consultants who feed off the horse race. Blame the unquenchable thirst for campaign cash. If youre a candidate, blame other candidates for forcing you to get going so early. Whatever the reason, 20 months out from the November 2016 presidential election, no fewer than two dozen potential candidates are maneuvering to run, and theyre already elbowing one another for advantage. Candidates are hiring staff members, donors are taking sides, party operatives are digging up dirt on potential opponents, and activist groups are holding straw polls of dubious value. Contrast that with the rest of the world. Israelis will spend about four months picking their next prime minister. In India, the formal campaign season for national elections was even shorter last year. In Canada, federal elections typically last about five weeks, although political positioning starts earlier. A look at why this exercise in democracy is so drawn out in the U.S.:, American presidents serve for a set four-year term. Future contenders start planning for the next election years in advance, with no limits on what they can spend in the primaries and often no limits in the general election. Thats different from many parliamentary democracies, in which elections may be called without much notice and where there are limits on paid advertising and spending. The U.S. system is particularly complex. Candidates compete in a maze of state caucuses and primaries to get their partys nominations, then orchestrate summer party nominating conventions before competing head-to-head in the fall general election. Its a hard thing to figure out, and its not something you do quickly, says Tom Rath, a GOP activist in New Hampshire, the first primary state on the political calendar. Any hope of dominating in the primaries requires months of advance work to lock up supporters in the states. That requires even earlier work to attract key staffers and raise the money needed for a strong campaign. This period sometimes is called the invisible primary. Campaigns last so long because we have something called the First Amendment, which means that you cant do what other democracies do, which is to say the campaign will only last for five weeks, or that you cant campaign except in the last five weeks and you cant advertise, says former Massachusetts Gov. Michael Dukakis, the Democratic nominee in 1988. If someone wants to start in Iowa six years ahead of time, you cant stop them. It used to be that pollsters and consultants went all-out during campaigns, then took off to do other things during a period of governing before the next election season, says Norman Ornstein of the American Enterprise Institute, a longtime observer of politics and author of The Permanent Campaign and Its Future. But starting in the 1980s and into the 1990s, he says, the pollsters and the campaign consultants werent melting away. They were sticking around. The end of one election is quickly followed by planning for the next. The midterm congressional elections are seen as an informal kickoff for the presidential race. Its kind of a symbiotic relationship involving consultants, pollsters and candidates eager to get out ahead of everybody else, says Ornstein. As the cost of U.S. campaigns goes up, the quest for campaign cash  and the desire to impress outside groups flush with their own money  starts earlier and earlier. The private Center for Responsive Politics estimates that candidates, parties and independent interest groups put $2.6 billion into the 2012 presidential race and $2.8 billion into the 2008 race, when there was no incumbent running. Those numbers compare with $1.9 billion in 2004 and $1.4 billion in 2000. Everybody is motivated to move a little bit earlier, says Ornstein. And the flood of outside money adds to the pressure to have enough inside money that you can at least be credible to get some of that outside money backing you, or to counter it if you dont have it. Even though candidates often would rather wait to begin a campaign, not a single politician dares risk being left behind. Once one candidate starts moving, others feel compelled to follow. Former Florida Gov. Jeb Bushs declaration in December that he actively would explore the possibility of running injected momentum into the whole Republican field. In addition, many candidates opt for a breakthrough strategy, settling in to a particular state early in hopes of surprising observers by doing well someplace unexpected. As a consequence, we look ever further out into the future for a set of tea leaves we can trust, says New Hampshires Rath. It gets late very quickly in this game. In the leadoff caucus state of Iowa, Republican activist Doug Gross is ready to do his part. Were electing the most powerful person in the world, says Gross, and we probably ought to at least do a pretty good job interview so we know what were getting before we vote for them.]", "Date": "20150308", "Title": "[Why the 2016 presidential race is off to such an early start]", "Link": "http://www.seattletimes.com/news/why-the-2016-presidential-race-is-off-to-such-an-early-start/", "Author": "[NANCY BENAC]"}