{"Content": "[Wisconsin Gov. Scott Walker brought his fiery brand of Republican politics to Seattle on Thursday night, describing at a think-tank fundraiser how he believes conservatives can reclaim our country. With some 300 demonstrators outside the downtown Sheraton Seattle Hotel protesting his appearance, the controversial and high-profile governor joked to the dinners 2,000 attendees that he felt quite at home. His half-hour speech urged Republicans to speak more optimistically about their ideas, talk in terms that are more relevant to voters and have the courage to act boldly. Im optimistic about the future of this great country, said Walker, who is up for re-election next year and is considered a potential 2016 presidential candidate. The governor came to town to pick up an award from the Washington Policy Center at the conservative-leaning think tanks 16th annual dinner, which also featured prominent Johns Hopkins University neurosurgeon Ben Carson. Carson, who gained a national profile after a video of his speech at this years National Prayer Breakfast went viral, on Thursday delivered a longer talk that wended through many theoretical issues. Carson warned of the secular progressive movement trying to erase all traces of God from our society and called for Americans to come together. We the people are the boss, he said. Organizers described the dinner as the Washington Policy Centers largest-ever annual event, with overflow rooms down the hall and in Spokane. The fundraiser did not yield any money for Walker or Carson, only for the think tank. Still, the cross-country invitation of Walker enraged local unions and liberal activists. The 45-year-old governor is best-known for his 2011 proposal, weeks after taking office, to curtail state workers collective-bargaining rights and prevent government unions from automatically deducting dues from members paychecks. The bill triggered weeks of protests and led Democratic lawmakers to leave the state, but eventually won approval. Walker survived a recall election last year. On Thursday, protesters gathered on Sixth Avenue two hours before the dinners start carrying signs that read, Stop The Attack On Worker Rights and Washington Respects Working Families. King County Executive Dow Constantine, Seattle Mayor Mike McGinn and his rival in the upcoming mayoral election, state Sen. Ed Murray, delivered speeches highlighting the success of liberal policies. Like Gov. Walker, I took office during tough times, Constantine said. But I partnered with our workers. Pat Miller of the Pacific Northwest Regional Council of Carpenters said he had a simpler message for the governor: Go away. The point of the protest, said organizer David Freiboth, was to affirm to the community that Seattle is a progressive city. Were here to say, Have your fun, said Freiboth, executive secretary of the King County Labor Council. We (progressives) are still going to run the agenda here. But at the dinner, speakers painted the protest as the result of bitterness over Walkers success. Former U.S. Sen. Slade Gorton, in introducing Walker, told the crowd that picketing you ran into on the way in tonight, is the reaction of losers. Walkers speech was largely devoid of zingers like that. Instead, he focused on his successes in office. Walker said that during his tenure as governor, Wisconsins unemployment has fallen dramatically, its budget deficit has turned into a surplus and many more of its employers feel the state is moving in the right direction, The reality is more mixed, as Wisconsins unemployment rate hasnt fallen as fast as the rest of the country and recent news reports have shown that it is unlikely Walker will fulfill his promise to deliver 250,000 jobs in his first term. In the Seattle speech, Walker also discussed adding accountability to education. Brian M. Rosenthal: 206-464-3195 or brosenthal@seattletimes.com. On Twitter @brianmrosenthal]", "Date": "20130905", "Title": "[Gov. Walker tells of how GOP can reclaim our country]", "Link": "http://www.seattletimes.com/seattle-news/gov-walker-tells-of-how-gop-can-lsquoreclaim-our-countryrsquo/", "Author": "[Brian M. Rosenthal]"}