{"Content": "[ST. LOUIS (AP)  Out of money and relegated once again to the back-of-the-pack debate, former Texas Gov. Rick Perry on Friday dropped out of the race for president, ending his second bid for the Republican presidential nomination and becoming the first major candidate of the 2016 campaign to give up on the White House. The longest-serving governor in Texas history, who had never lost an election until he started running for president, told a group of conservative activists in St. Louis that some things have become clear and that it was time to suspend his campaign. We have a tremendous field of candidates  probably the greatest group of men and women, Perry said. I step aside knowing our party is in good hands, as long as we listen to the grassroots, listen to that cause of conservatism. If we do that, then our party will be in good hands. Four years ago, Perrys first bid for the White House essentially collapsed after a GOP debate in which he couldnt remember the name of the third federal agency hed wanted to close if elected  he was only able to mutter Oops. This time around, he couldnt win enough support in early polls to even qualify for the partys prime-time debates, finding himself relegated instead to second-stage affairs. After formally kicking off his bid in early June, Perry announced raising about $1 million during the first month of his campaign. That wasnt enough to keep the small staffs he had assembled in the early voting states of Iowa, New Hampshire and South Carolina, as well as at his headquarters in Texas, on the payroll. While some members of Perrys team pledged to work as volunteers, and he resumed paying some late last month, he ultimately couldnt recover from the lack of campaign cash. Itd be easy just to keep going, be easy to go do the debate next week, be easy to keep going to Iowa and South Carolina and other states and everything and taking your money and dragging it out, said Dallas businessman and longtime Perry donor Roy Bailey. But, Bailey said, Perry could see it was pretty obvious to him he wasnt going to be the next presidential nominee from the Republican Party. Former Arkansas Gov. Mike Huckabee, who took the stage at the Eagle Forum conference in St. Louis immediately after Perry announced his exit, called on the crowd to pray for Perrys future success. The only thing harder than to get into a race for something like president, is to make the decision to get out of the race, said Huckabee, the runner-up for the GOP nomination in 2008. And I hope that all of you will recognize that it was a very difficult decision. Ive been there before. Perry spent four years after his failed bid in 2012, which ended after disappointing finishes in the Iowa caucuses and New Hampshire primary, trying to rebuild his image and convince America hed lived down Oops. He swapped his cowboy boots for eyeglasses, traveled extensively touting his states job-creating prowess and huddled with policy experts and top donors, insisting hed be humbler and better-prepared for the national spotlight when running again in 2016. He staked his strategy this time around on Iowa, visiting the first-to-vote state repeatedly over the past three months, showing off strong one-on-one campaigning skills and country charm honed after decades in Texas politics. But it wasnt enough to push him into the top 10 of the GOPs unwieldy field of candidates, which meant he wasnt on stage last month at the first prime-time debate of the campaign. While delivered a stronger performance at the pre-debate forum than he did during the debates four years ago, few noticed in a 2016 GOP campaign dominated to date by billionaire Donald Trump  who stole away Perrys Iowa campaign chairman after Perry was forced to suspend paying members of his staff. While the ultimate accuracy of polls taken months before voters cast their ballots is notoriously poor, they are nonetheless being used in this campaign to pick who can take part in the GOP debates. Hovering around 1 percent, Perry was again set to miss out on the main event at next weeks debate at the Reagan Library outside Los Angeles. On Thursday night, Perry called Bailey to say he was out. He was very matter of fact, he was confident in his decision, Bailey said. He hated it, because hes such a competitive person, that thats what it came down to. Hell take a breather and jump back into life out of politics. Amid Perrys money problems, a group of super PACs largely funded by three big Perry backers had kept Perry afloat by raising $17 million and hiring their own Iowa staff and producing television and digital ads and mailers. His decision Friday came as a surprise to those groups, which are barred from communicating directly with the campaign. A pro-Perry super PAC emailed its supporters Friday morning saying it was back on television in Iowa to promote his candidacy. A Twitter message from the group sent later in the morning further emphasized, In It For the Long Haul. The decisions of a candidate to get into, or out of, a campaign of this magnitude are intensely personal, family decisions, said Ray Sullivan, the co-chair of one of the pro-Perry super PACs. The campaigns cash position matters, your poll numbers matter, but those things are surmountable if the candidate and his family are willing to stick it out even against seemingly long odds. ", "Date": "20150911", "Title": "[Rick Perry first to exit 2016 Republican presidential race]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/ap-sources-perry-to-exit-2016-republican-presidential-race/", "Author": "[STEVE PEOPLES, WILL WEISSERT]"}