{"Content": "[Nessa: John Stanford International School filled, SEATTLE  6:47 p.m. PHOTO COURTESY OF NESSAVoters still arriving after 1 p.m. at the John Stanford International School. The cafeteria doors leading to the had to be opened to accommodate the more than 700 people who showed up to vote. Charlotte Zachary: We have two fantastic candidates, REDMOND  4:31 p.m. Reporting from Democratic Caucus Precinct 48-0950:, I arrived at 12:30 and there was a line of about 75 ahead of me. People kept coming until around 1:45. The room was packed and SRO. Im not good with estimating a head count, but there were 20 precincts so approximately 800 were present.  Once everyone signed in the ball started rolling.After the first vote count, the tally in our precinct was:, 28 for Obama  4 delegates, 9 for Clinton  1 delegate, 2 were undecided, Several passionate speakers appealed on behalf of each candidate. There was basic agreement that we have two fantastic candidates and we WILL defeat the Republicans in November. Debate followed over who would make the better president. The Clinton supporters touted her health care plan but didnt really say much else on her behalf. One Clinton supporter said that if Hillary could be president for 8 years and Obama become president after her that would be the best result. An Obama supporter responded that we cant wait 8 more years  we need Obama now. He spoke of how Obama unites while Clinton divides, and that Obama inspires and brings people to his side, noting the results of Iowa and Idaho in particular. After the second vote count, the tally was:, 28 for Obama  4 delegates, 11 for Clinton  1 delegate, Bonnie Liberty: Well all be winners come November, OLYMPIA  5:51 p.m. Reporting from the Democratic Caucus at Black Hills High School:, Leading up to 1:00 a steady stream of cars approach the High School parking lot.  Never experiencing a caucus before, right away an imbalance strikes me. Hillary posters adorn the walls of the gym about every six feet. I dont see one for Obama.  Within moments a person offers me an Obama sticker to put on my shirt.  I accept, look around at all ages of people in the gym.  Kids rolling and playing on the shiny floor in the middle of the gym.  Some old folks look scruffy and down home with beards and a few look dressed up for the occasion, but most seemed dressed in the typical NW outdoorsy look. We are a rural community. About 300 people for 17 caucuses.  No telling who supports whom.  Although the polls divide out peoples votes by gender, race and age, the diverse group of people here seem to cross cut the demographics. Gathering around our precinct table, we need a captain volunteer.  Everyones fairly quiet.  This one tall, mountain man looking guy gratefully offers to volunteer.  And his name truth to tell is Robert Kennedy.  , When the precinct secretary passes out all the sign in sheets, people share them around.  A few people use each others backs as a hard surface for writing.  People are in close quarters and milling.  Not much in the way of tables.  The Precinct tally chief counts up and announces there are 15 votes for Clinton and 32 votes for Obama and 4 non-committals.  I heard gasps then delayed cheers.  Two prefer Kucinich and are ready to be convinced of the best other direction to go.  Two people circulate impeach Bush and Cheney petitions.  The captain says its time to have someone speak on behalf of their preferred candidate.  Who wants to speak on behalf of Obama? Silence.  Finally a young man dressed in a dark gray suit, with a striped tie said hell talk.  Simultaneously a tall dark-skinned man, with years of life on his face, and casual dress offers to speak.  Immediately they both defer to the other.  One supporter quipped, Thats the way Obama people are, courteous!!, Comments on behalf of favored candidates were limited to one minute each. The most dramatic cheers came with reference to ending the war in Iraq.  Clinton supporters raved about her health care plan, and her experience to get things done in Washington.  One mentioned the positive impact she had on Bill when he was president in spearheading programs.  One suggested a feeling that perhaps the best would be Hillary now, Obama in 8 years.   On the other hand, Obama supporters felt his strength in inspiring people, organizing and helping youth believe they could invest in the political system and be empowered to be part of solving problems.  A supporter suggested people read Obamas writings to understand his genius.  , Neighbors you know, neighbors you dont know, and acquaintances you didnt know were neighbors.  Felt real and gratifying to come together to make a bottom line level decision which impacts the future of the country.  We separated into Obama camps and Clinton camps.  After the opportunity for changing our choices, it was announced Obama 31 and Clinton 19.  I felt strange feeling such a thrill to be on the winning team, like this was a sports event, or a high school hoopdedoo.  Hopefully well all be winners come November. Vanessa Rene Casavant: Caucus process disenfranchised too many voters, SEATTLE  5:47 p.m. More than 700 Democratic caucus goers, some with children in tow, filled the cafeteria of the Stanford International School in Wallingford on Saturday afternoon.  Voters starting trickling in at noon, and by 1 p.m. the crowd had grown so large the sliding doors separating the cafeteria from the gymnasium had to be opened to make room for everyone. The turnout was at least double to that of 2004, said area caucus coordinator Rodger J. Biasca.  A total of 736 people voted, choosing36 delegates to represent Barack Obama and nine to represent Hillary Clinton at the 43rd Legislative District Caucus on April 9.The main discussion among voters here was about which candidate would stand a better chance of winning the general election on November 4.  Most were concerned with seeing another Republican president in the White House, and seeing another four years of policies not aligned with the Democratic Party.In my precinct SEA 43-2044, the initial vote was 52 to 22 in support of Obama, with seven undecided voters and one surrogate affidavit vote for John Edwards. After the speeches, the second votes were tallied with six voters switching to Obama and one deciding not to vote for Clinton, bringing my precincts total to 58-23 for Obama, and one undecided.  Of the five eligible delegates in my precinct, four will represent Obama and one will represent Clinton at the legislative district caucus on April 9. I was chosen as one of the four delegates for Obama, and am excited to support him at my legislative caucus because I truly believe in his ability to bring real change to Washington D.C. and to restore our relations with foreign countries.Overall, caucus-goers  said they felt the caucus process disenfranchised too many voters who had to work during the time of the caucus or were nervous about confrontation with neighbors in publicly identifying who they supported.  Many said they believed a more accurate tally of supporters for candidates will be provided through the primary ballot. One voice of dissent among those not liking the caucus was Susan Davis, 42, the area caucus secretary at the John Stanton International School. Its probably the only time we get the opportunity to meet our neighbors and discuss politics.  I love caucuses, and Id hate to see them go away, Davis said. Mary Davison: Complicated formula, SEATTLE, 5:26 p.m. Reporting from the Democratic Caucus at 1400 Prospect, Precinct 43-2009:, There was already a line-up to get in when I arrived at 12:45. By1:45, 195 out of approximately 240 seats were filled. With the exception of one Asian and one black, we were a very white crowd. We were about evenly divided by age-groups  and genders. Some parents brought their very-much underage children, including one young mother toting her toddler in a rainbow-striped carrier. Young people were very much in evidence, especially one with nearly fluorescent cherry red hair, but there were probably equal numbers of the still dark- haired middle-aged mena and women and grey-headed seniors. The woman beside me said shed urged her 16-year-old son to come, but he voted to stay home playing video games. I asked if she or her Latino husband had attended a rally: he hadnt been able to get inside Obamas rally last night  but listened outside; he was impressed. As people still stood lining the walls before the caucus began, one woman shouted Im surrounded by Obama, whereupon a man went Bama, Bama, Bama!. which pretty well sums up how the vote went on the first ballot:  41 for Clinton, equalling 2 delegates. 144 for Obama, giving him 6 delegates, with 10 signing in uncommitted for 0 uncommitted delegates. But a first attempt to announce the tally gave a real shock of suspense. No sooner had the official said, 41 votes for  than he paused and went silent. We gasped, then laughed. We had to wait for late sign-ins, three young people who sheepishly climbed over some seniors to take still vacant seats in a middle row. To my surprise there was absolutely no discussion of issues, just 3 men volunteering on the spot to give one-minute pitches, one each for Clinton, Obama, and uncommitted voters. First off was the one for Obama, a thirty-ish guy wearing a 50s-style brimmed hat and a steel- grey jacket over a coral T-shirt. Number one for him was Iraq. Obama  was  against it from the beginning. Clinton voted for it, and didnt change her mind till after Howard Dean made it an issue. She cant be trusted. The Clinton supporter was more academic looking, 50-ish with salt-and-pepper cropped hair and short beard, wearing a team jacket, red with white sleeves. He spoke more specifically, citing Clintons experience. She has experience in the White House and with the public. She has fought on health care. She will bring to the Oval Office an organization and network of people she can draw on to create a team. Representing those not yet committed, the third summarized his thoughts on both candidates. Im a physician. And I see the desperate situation of our health care..Senator Clinton is committed to providing health care to everyone. I dont know whether she can deliver it, but I support it. Obama I also like. He is young, possibly more flexible and open, more willing to go on a new direction. After the first tally was announced, a greying, sharp-eyed man just in front of  me asked the Caucus Chair, Brian Giddens, the essentialquestion: How many votes would have to change to change the number of delegates a candidate receives?Brians response drew laughs: Dont ask me, Im a social worker.Its such a complicated formula it would take a UW math professor to figure out the numbers. Maybe 25. But we laughed even harder when the questioner shot back, I AM a math professor at UW, then added, thats what I would have guessed. Right before we broke to elect delegates, another crucial question was raised: Can the delegates change their votes at the convention? When the preliminary answer Yes, they can evoked Then, whats the point?  there were murmured consultations up front. Brian corrected his answer to No, they cant.  The room relaxed.It was then time for people to switch votes and a few did. The final tally was 43 for Clinton, 147 for Obama,  5 remaining uncommitted. No changes to the delegate counts. Deborah Hamilton: Clean sweep for Obama, SEATTLE  5:14 p.m. At Orcas Elementary, located in between the Columbia City and Hillman City neighborhoods in South Seattle, the line to enter the caucus snaked around the building. A man in front of me commented that he had never waited in line before to caucus. I entered shortly after one oclock and found my way through a maze of people to my assigned table in the gym.  The space was packed to the gills, so they began to move precincts into vacant classrooms, to accommodate the approximately 200 more people who showed up after one who were still waiting outside of the building.  Eventually my precinct 37-1616 was assigned a classroom and we began our procedure after 1:30. Of the 93 voters who showed up to caucus in 1616, there were 83 initial votes for Obama, 7 for Clinton, and 3 undecided.  We began the first round of speeches.  In support of Clinton, one man argued that it was time that we had a leader in the White House who could fully represent women and mothers.  He argued that Hillary was battle-tested and was ready to take on the presidency.  The speaker for Obama began with the issue of electability, and how Obama is a candidate that has the potential to pick up independent voters; whereas Clinton has the potential of sending more evangelical voters out to the polls to vote for McCain.  He finished by describing Obama as a candidate who brings hope and is inviting everyone to be included in his vision. Our room then took time to mingle and discuss, so people could change their votes.  The final count ended up being 84 Obama, 9 Clinton, and 0 undecided.  All five of the delegates for precinct 1616 are for Obama. PHOTO COURTESY OF DEBORAH HAMILTON, Terry Parkhurst: Its about life, taxes and terrorism for some Republicans, SEATTLE  5:05 p.m. Reporting from the Republican Caucus at Nathan Hale High School:, At 1:15 p.m. Lisa Bailey, the Republican chair for the 46th legislative district had to announce the fact that people were still being registered at Nathan Hale High School for the GOP caucus; that despite the fact that the doors were supposed to be closed so things inside could proceed. A long line stretched out to the door.  Four years ago, we had 50 people in the 43rd district, said Bailey (who moved since that time and is now in the 46th district, as a result). There are more Republicans in Seattle than we think. But it is such a hostile environment to come out (as a Republican) in a lot of people wont admit to being a Republican. In addition to allowing people an opportunity to declare themselves for a particular candidate, there was a questionnaire circulated that covered topics such as transportation, education, health care, taxes, government spending, marriage, the Iraq war, life (as in Pro-life, pro-or-con on abortion), the business climate, rural/agricultural rights, Second Amendment Rights, immigration and Global warming. It asked participants to this caucus to rate those issues in terms of importance to both Federal and state government. But most people were willing to opine without a script and came to the questionnaire, only after someone brought it to their attention.  For most people, their candidate of choice was that because he stood for the issues important to them; and they wanted others to know that. Celia Roders, who came to this caucus for Mike Huckabee said, I like him because hes a compassionate conservative and he supports life.  Bob Haller, who works as both a window washer at the University of Washington and as a tax advisor for H&R Block, part of the year, was talking to a group of Ron Paul supporters, as the room emptied out. Haller himself supports the Texas congressman and said, If we were taxed less, Id get to keep more money from my other job (working at the University of Washington) instead of having to work 400 hours a year (for H&R Block). Michaela Leslie-Rule: An incredible feeling of community. SEATTLE  4:54 p.m. Reporting from the Democratic Caucus, Precinct 43-2003, at T.O.P.S. elementary school:As I approached T.O.P.S. elementary school I was struck by the image of people coming from every direction towards the entrance to the building. There were so many people. A line from the entrance of T.O.P.S. wrapped around the corner of Louisa and continued towards Roanoke and the excitement was palpable.  The cafeteria was full and my precinct met in a classroom on the second floor.  When all the classrooms were full people gathered in less traditional parts of the school on the steps or in the stairwells. Before the first count we casually discussed the meaning of the caucus and the role it would play in the rest of the electoral process.  Young people spoke about their excitement in participating and older members commented on their refreshed interest in politics during this years contest.  Everyone in the room was attending their first caucus save one person:  , 41 for Obama, 14 for Hillary, 2 Undecided, This was the first count.  It wasnt entirely necessary to do a second as those undecided members of our caucus couldnt make a dent in the amount of delegates assigned, but we decided to speak about why we supported our respective candidates.  We talked about health care and the war, and personality and the importance of being the first. We spoke about the implications of a Clinton victory.  Is this still a democracy if two families can run the country for 20 years?  We spoke about the baggage carried by Hillary Clinton.  One undecided member chose Obama.  And it was a thrilling victory. Second count:,  42 Obama, 14 Hillary, 3 Delegates Obama, 1 Hillary,  It was an incredible feeling of community and demonstrated the importance and strength of everyday citizens.  Caucusing was an act of patriotism. Holli Templeton: No one changed their mind, CARNATION  4:55 p.m. Reporting from the Democratic Caucus at Carnations elementary school:, I arrived about 12:15 at my caucus location in the gymnasium of the local elementary school in Carnation, a rural town about 15 miles east of Redmond.  About 8 precincts were being represented at this location.  Volunteers were busy setting up the chairs so I joined in to help.  Then I was given a packet and told to find a group of chairs for my precinct; I was also told that my precinct was allowed 4 delegates.  I had no idea what I was doing but I went through the packet, found a sign that I placed on the back of one of the chairs and I waited and read the information in the packet.  Another person showed up and after a few minutes, about 5 or 6 people were seated in my precinct area, which I thought was a good turnout as I live in a small community.  Little did I know that about 23 more were about to show up for my precinct alone!  People started coming in the doors in throngs as it got closer to 1:00; when I ran out of name tags for people in my precinct and went to find more, I realized I had to push my way through a large crowd in this very small gymnasium and that there was also a long line in the hallway.  I was amazed at this turnout as were the Chairs of the caucus.  They were also unprepared in terms of not only nametags, but sign-in sheets, snacks, chairs, etc. so they had to improvise. Once everyone was in, the Chair of the 45th Legislative district spoke about the process.  He discussed what was expected of us and then introduced two people to talk about each candidate and why they feel we should vote for them.  During this time, I looked around at the large group filling the gymnasium.  I attempted a rough count and estimate that there were about 300-350 people within the gym and hallways.  Being a rural community, there is not much racial diversity in our area so I would estimate a guess that the group was about 98% Caucasian.  As for the demographics related to age, I would say about 75% of the people were in the 30s-50s range, 15% were in the 18-29 range and 10% were in the 60+ range.  The first speaker spoke for Obama and she was basically reading off of his literature discussing his stands on the war, economy, alternative fuels, ethics, health care, and education.  She stated that he was a Unitarian candidate that would be effective with Republicans and Democrats and that in the recent National Gallup Poll, it showed he would win 10 points above McCain, but that Clinton would lose to McCain.  The speaker for Clinton had a bit of a different viewpoint in that he felt we had 2 great candidates and that we should hope for both of them on the Democratic ticket with Clinton as President and Obama as Vice President. That way we could have Clinton for 2 terms (if they did well), we would also get Bill in the deal and Obama could turn around our internal affairs.  Then Obama would have the experience and could run after Clintons terms were up and he could fill the next two terms in office and we would have gained 16 years of great Democrats in the White House!,  We then split into our precinct groups.  We had 29 people for our precinct that case their votes, but only about 18 stayed after signing for the discussion to follow.  I would guess there were about 11 women in our group and about 7 men.  We decided on our precinct caucus Chair and she discussed the agenda and then appointed a secretary to take minutes and 2 people to tally the votes.  Once we tallied the votes, we had 15 for Clinton, 13 for Obama and 1 uncommitted.  One person talked about why she is supporting Obama and one about why he is supporting Clinton and then quite a bit of discussion followed.  The discussions mainly centered on Clintons experience and Obamas ability to speak and bring people together.  People for Clinton expressed that they feel she has the experience, knows how things work in the White House already and that she has a rapport with many heads of state and presidents of other countries.  They also mentioned getting Bill in the deal was a big plus.  Those on the Obama side expressed that they feel he has what it takes to affect change and that he can turn around the negative image the rest of the world has of the United States.  They mentioned his ethics and ability to speak so people want to listen as well.  Many people were concerned that even though Clinton is a good candidate as well, they do not feel she can win against McCain.  No one changed their mind after all the discussion and we then broke into our delegate groups to choose our two delegates (for each candidate).  In the Obama group, there were about 7 women and 2 men and the one undecided person sat on this side as well and did admit she had now pretty much decided on Obama, but I am unsure if she changed her official vote before leaving.  In the Clinton group, there were about 4 women and 5 men.  After choosing our delegates to go onto the next caucus in April, we reconvened.  There were several precincts still in discussions when I left the caucus at 2:50. Allison Klune: Ready for a change, SEATTLE  4:52 p.m. Reporting from the Democratic Caucus, Legislative District 36, Precinct 1806, at McClure Middle School:It is clear that voters from Queen Anne are ready for a change.  The lines began forming at McClure Middle School on Queen Anne Hill before registration opened at 12:30, and soon the line grew and extended around the building.  Signs of support for Barack Obama were evident- stickers on lapels and hats, flyers shuffled around, large signs taped along the halls.  Hillary Clinton had supporters as well- a few Hillary 08 stickers stuck out among the crowd.Caucusing did not begin for precinct 1806 until close to 2:00pm. The crowd of over 100 from the North Queen Anne neighborhood was triple the number that came to caucus in the 2004 election.  As people shuffled in, there were quiet conversations among the crowd, of neighbors being introduced and the beginning of lobbying.  After a short series of introductions, instructions and nominations for chair and secretary, initial votes were tallied with the vast majority of support going to Barack Obama.  There were five undecided voters, who were then shuffled to the center of the table and the lobbying began.  There were a few vocal supporters of Hillary Clinton- who must have known they would be outnumbered and came prepared with solid facts, figures, and strategy.  However the majority of lobbying consisted of individuals ready for a change and for the  social movement that is Obamas campaign.In the end, Precinct 1806 has voted to send seven delegates to support Obama, one delegate to support Clinton, and one undecided delegate. Marilyn Matinetto: Long lines, STEILACOOM  4:06 p.m. My friend, Eva, and I began our walk to the Steilacoom Caucus at noon. Upon arrival 25 minutes later, we were allowed to sign in with our individual voting precinct caucus, listing our initial candidate preference.I indicated Hillary Clinton and Eva signed as Undecided. By 1pm, most of the approximately 250 attendees were present, though many were still in line at the entrance to Saltars Elementary School auditorium.Attendees appeared to be mostly age 45 and older, with about 30 between ages 20 and 30. No one came in waiving a sign or shouting a candidates name. All were quiet and intent upon understanding the process and voting. Even during the speeches to convince undecideds, all comments were civil, and at most happily enthusiastic. I heard only one speaker allude to a candidate representing the Zionist somethings (couldnt hear who he was talking about or the rest of his statement.) Attendees whod already committed to a candidate spanned the age range of attendees. No candidate had a lock on the oldest gray hairs, nor on the youngest who appeared to be students still.But Obama had the Black votes and Clinton had more what appeared to be 50+ year old females. Ms. Matinetto said that in unofficial results, Obama carried the caucus. Claire Petersky: Huge numbers, BELLEVUE  4:50 p.m. Reporting from the Democratic Caucus at Highland Middle School:We thought we had a big turn out in 04 with about a dozen people showing up at our caucus table. This year, we had 37. Our precinct went about 75% for Obama, which reflects an informal tally for the room. It was very crowded, and somewhat chaotic. There was a crowd around the map of the precincts as people tried to sort out which caucus was theirs.Supporters of both Clinton and Obama had sometimes been sent to the wrong caucus location by the campaigns. My husband helped drive an elderly woman to Tillicum Middle School so she could properly participate. The numbers of Democrats on the Eastside are growing, and the huge numbers that showed up reflect that. Beryl Fernandes: Thank goodness it wasnt raining, SEATTLE  4:40 p.m. Reporting from the Democratic Caucus at Meadowbrook Community Center:Our caucus day began with people in our precinct invited to coffee and doughnuts at a neighbors house at 10am. What looked like an additional obligation in an already super-busy week for those of us immersed in campaign duties, turned out to be a wonderful way to get to know our neighbors, review the caucus process, hear each neighbors stance on issues and reasons for their candidate preferences. It made going to the caucuses much more comfortable and fun. We enjoyed each others company so much and since most of us had never met each other, decided to exchange contact information and keep in touch after the caucuses. I was one of the precinct captains for # 2304, which held its caucus at the Meadowbrook Community Center. The indoor sign-in room quickly filled to overflowing, became unmanageable in the small space, and moved outdoors to the parking lot. Thank goodness it wasnt raining! The parking lot quickly filled up and people lined up on the sidewalk on the street along 35th Avenue NE for about a block and a half down the street. What might have looked chaotic at first quickly got under control with people volunteering to help direct people to their precinct sign-up sheets. We didnt think wed get everyone signed in by 1.30, but with this awesome neighborly cooperation, we did it!, Each room in the community center was assigned two precincts thats before they knew what an unusually high turnout they were going to have. The rooms were packed to the gills, stuffy, warm and physically uncomfortable BUT  full of excitement!  We quickly suggested one of the precincts in our room move outdoors to a pleasant patio with benches and Precinct # 2303 happily did so. We took a first round of votes by having people raise their hands. We came out with 13 Undecided, 20 for Clinton and 48 for Obama. We heard several one-minute speeches and persuasive arguments in small groups with people speaking passionately to sway others to their candidates. One young woman, not old enough to vote, brought a huge cheer when she showed three charts comparing Clinton and Obama on three issues she researched on the Internet. She showed colored bar charts comparing money received from lobbyists, donors of $200 or less and $ 4,600 or more, and money received from oil and gas companies. Other key issues raised included health care, climate change, Iraq war, collaborative approach to resolving issues, ability to beat McCain, experience, integrity and much more. They then counted the total number of people who had voted when they signed in, some of whom had already left and therefore werent counted when we did the first raised hand count. The second vote also allowed people who had not previously voted for a candidate when they signed in or who wanted to change their vote to do so. This brought us to the second and final vote. The final vote was 3 Undecided, 24 for Clinton and 66 for Obama, giving Clinton 1 delegate and Obama 4 delegates. The final step was to vote for our delegates and alternates and that concluded our enormously satisfying precinct caucus another huge lesson in the democratic process sometimes boisterous, sometimes chaotic but always more satisfying than any other political process to date. Kyle Shimamoto: Turnout was heavy, TACOMA, 4:39 p.m. Reporting from the Democratic Caucus at Meeker Middle School:, From 27-333 , Party:  Democrat, Location:  Meeker Middle School (NE Tacoma), Results:  Obama 62% / Clinton 38%, Delegates:  Obama 11/ Clinton 6, Turnout was heavy with 130 eligible participants from my precinct. Susanna Williams: This was democracy at its best, SEATTLE  4:38 p.m. Reporting from the Democratic Caucus at T.T. Minor Elementary School:Caucus goers flooded the hallways of T.T. Minor Elementary School, even before the official opening time of 1 p.m.  We were packed into the cafeteria, where we milled around waiting to hear room assignments.  Rooms were changed.  Voters were redirected.  The 1880 migrated to the media center, which we shared with at least three other precincts.  Those who declared their support for Obama gathered at one end, Clinton supporters at the other.  There were too many Obama voters to gather comfortably in one area, so we strained to talk to one another in a gerrymandered configuration.  First tally 66 for Obama, 14 for Clinton, 8 undecided. We heard speeches for all positions.  The Obama voter said that he was 26 years old and had lived his whole voting life under either war or lying.  He is tired of it and that is why he supports Obama.  The Clinton speaker talked about Clintons health insurance proposal and, as a 29 year old without health coverage, said that it was important to her to have a president with a plan that would work.  The undecided representative (our PCO) said that she was tired of corporate candidates and didnt feel that either candidate spoke to her.  We milled together and had informal conversations.  People asked for clarification on positions and rigorous conversations sometimes edged into impassioned debates.  Questions in my group centered around the plans for Iraq (after troop pull back, are we just going to abandon the people of Iraq?), health insurance / health care, student loan interest rates and college access, and national standards for K- 12 education.  , At the second tally, one undecided voter joined the Obama camp.  We ended with 5 delegates for Obama and 1 for Clinton.  Candidates for delegate were invited to stand up.  Four men and myself will be delegates to the next round of caucuses for Obama.  The woman who spoke for Clinton will be her delegate.  Alternates also volunteered. I left the caucus and struck up a conversation with Clifford MacAphee, a gentleman standing at the bus stop across the street.  He had a blue Obama sticker on the faux fur lapel of his long blue cashmere coat.  His caucus, too, had gone overwhelmingly for Obama.  Two strangers until this moment, we shared our mutual glee at this tidal wave we are experiencing.  Young, old, black, white, Republican you name it, people are coming together for Obama, Mr. MacAphee beamed. You know, after talking to you, Ive got so much excitement, I might just walk home instead of waiting for the bus!  Im fired up!, This was democracy at its best.  There is so much energy around this election. Renee Schurtz: I didnt see a big difference, WEST SEATTLE  4:37 p.m. Reporting from the 34th district Democratic Caucus, precinct 1456, at West Seattle High School:I signed in to the caucus as an undecided, and by the end I had voted for Hillary Clinton. I didnt see a big difference between the two of them on most issues going in. It appeared that many of those attending the caucus felt the same, and the majority of the discussion and attempts to sway undecided voters focused on who had the best chance at winning the general election. Clinton supporters focused on her experience and superior positioning on the issue of security, and Obama supporters focused on his ability to motivate some voter blocks, his speaking abilities, and some conservatives negative views of Hillary. The issue that decided my change in vote, however, was global warming. I see this as the most important issue of the next 4-8 years since we are already very behind and the deadline on managing this problem is not negotiable or swayed by political bias. The issue will need to be addressed from day 1 with solutions that will actually make greenhouse gases decrease. I researched each candidates record and position on this before the caucus and found the biggest difference between the 2 is that Obama focused more on using biofuels, nuclear energy, and coal far too much (which we know is not good for global warming or the environment in general), whereas Clinton is focusing more on other energies such as solar and wind. His support of the 2005 energy bill proves his commitment to these. The president will actually have a big individual impact on this problem (as weve seen with Bush the last 8 years) through EPA policies, United Nations,G-8 and other international summits that is not determined by working with congress. She appears to have the better knowledge and grasp of the details and more commitment to solving the problem sooner. Obama supporters stated that he would be able to motivate people on the issue better, but I believe the soonest large impact will be made at the policy level  and we dont have any more time to waste. I wanted the Obama camp to change my mind on this one, but they could not make a case to vote Obama on global warming and the environment. When it was all said and done, though, what struck me is that ultimately I would feel comfortable with voting for either Clinton or Obama in the general election. While Clinton appears to be better for global warming and universal healthcare, I believe Obama could do a decent job as well, and certainly better than McCain. It was also nice to see so many people getting involved in the election process. Im hopeful that the high turnout will carry through to the general election. Heidi Jenkins: Republican caucus goes for McCain, ISSAQUAH  4:30 p.m. Reporting from the Republican Caucus at Clark Elementary School:There was a solid turnout at the Issaquah caucus; at least 200 people showed up and congregated by precinct. My own precinct ranged in age from individuals in their 20s-60s; none of us had participated in a caucus before and spent the first twenty minutes shuffling through paperwork, making sure we were doing everything as we should. It was nice to know we were all on the same ground as far as experience went, and made the day less intimidating and more of a enlightening learning experience. I took the part of secretary and wrote down the statements made by each individual wishing to act as a delegate:Mike and Kristin, a husband and wife delegate nomination, were both strong conservatives who listed homeland security and family values as their main priority. Mike was unsure about McCain due to his more liberal views of illegal citizens. His time spent as a resident in Southern California has left him disappointed with the ease of non-American citizens ability to receive public services with no penalty. His wife stood by Huckabees strong conservatism and felt he remained true to himself and did not compromise on pro-life and traditional marriage. Our chairman, John, had been a Romney supporter and decided to now support McCain as he wanted to act for the greater good of the party: as he desires a republican win the overall election, he felt McCain was the strongest candidate to pull out the win. I also strongly support McCain; his ability to tell the straight facts, such as needing to maintain a presence in countries that control a majority of the worlds energy sources, is refreshing. His military experience and strong character that allows him to vote as he sees fit, and not necessarily vote to take the republican side, is ideal. I personally do not feel as if we should allow the government to control family issues, however, McCain appears to have good personal ideals but does not let that affect his decisions and seems to vote for the greater good of the country, even seeming liberal in his ability to want to allow our fellow Americans live as a good, respectable citizens despite choosing a liberal lifestyle. Not only is his character excellent, but he does not tout the fact he has a son in Iraq, something that truly backs up his stance on wanting to stay there. In fact, the members at my table were surprised to hear his son was currently overseas and seemed pleased to hear it. Its important to have a candidate support the war with personal stake at hand just like many of Americans who are personally invested in the war.Finally, we all agreed that keeping the right to bear arms is important to our basic rights as citizens, and the 2nd amendment should not be altered, in fact, it should be supported more than ever. Mike made an excellent point in stating that the instant you give up your right to defend yourself is when the government can become totalitarian and take control in more ways than we could ever want.The only complaint was the constant interruption from the caucus monitor, who consistently made announcements on the microphone; instructions they had already announced at the beginning of the gathering, and the interruptions made debating a little difficult. Overall, we unanimously chose our delegates and observed neighboring precincts in a hot debate as to narrow down their field of 12 eager delegates to only 3. I felt fortunate that less people had shown up in our own precinct so I had the opportunity to become a delegate! It was a selfish thought, as I realized that it is always better to have more people participating in the political process than be happy I could become a delegate due to the lack of individuals. Overall, it was exciting to be apart of such an important election and I look forward to continuing making good arguments in McCains favor at the district caucus. Chuck Hastings: Packed, FEDERAL WAY  4:26 p.m. This caucus was held in the gymnasium at Lakeland Elementary School.  There had been a last-minute change, of separating out about a dozen precincts in south Federal Way, to expand the amount of room available;  originally, these precincts had been assigned to Illahee Middle School.  There had been a lot of confusion this week about where to go for the Democratic caucus for our group of precincts. Even so, the Lakeland gym was PACKED.  My precinct, DeVille, had 22 people show up  versus 3 DeVille people who had shown up at the Democratic caucus four years ago, according to our Precinct Chairwoman, Jean Noe.  Other precincts seemed to be doing equally well on attendance.The proceedings began promptly at 1:00pm, with a brief talk favoring keeping the City of Federal Ways form of government as it is  (council/mayor)  rather than switching to a  strong mayor  form.  (Since my precinct lies outside the city limits of Federal Way, I dont get to vote on that proposition.)Volunteers were requested for caucus attendees to serve at the DeVille precinct caucus table as a secretary  (myself)  and a vote tallier  (Gilberto Martinez). Next, the woman in charge of the entire meeting, Jean Mathews, talked for perhaps 20 minutes on how we were to run the caucus for each of our precincts.  Then we did a preliminary vote, which for DeVille came out 15 for Obama and 7 for Clinton.  A spirited discussion followed, emphasizing the differences between Clintons mandatory universal healthcare proposal and Obamas voluntary healthcare proposal.  Two Clinton votes switched to Obama for the final tally, which thus came out 17 for Obama and 5 for Clinton.  So, after doing some math, our DeVille precinct has 4 Obama delegates and 1 Clinton delegate to the next-level convention during April. Most attendees left about 2:30pm.  Jean Noe and I stayed for another half hour, making sure that the paperwork was correct and complete.On my way out, I heard someone stating that Obama had gotten 52 delegates and Clinton had gotten 38, from the entire meeting.  Obviously, thats unofficial!, Tim Vos: I expected a close contest, SEATTLE  4:05 p.m. Reporting from the Democractic caucus at Rainier Beach High School. By 1:00, the cafeteria at Rainier Beach High School was hot and nearly at capacity, when the organizer of the democratic caucus for the 37th Legislative District instructed four of the precincts to relocate upstairs to the library.  When I entered I expected a close contest. The number of Hillary stickers seemed to equal Obama attendees. One man had written the name Obama on masking tape and stuck it to his coat. By 1:35 it was clear, at least in the 1586 precinct, that most of the excess capacity was for Senator Obama. The caucus organizer welcomed the enthusiastic crowd, as members of the most Democratic district in the state and shortly turned the proceedings over to the precinct captains. As a first-time attendee, I strained to hear the instructions over the din. It appeared many of the others were first-timers as well.  , The first major movement was to separate into voting blocs. The preliminary total was Obama 62, Clinton 21, Uncommitted 5. Of the six delegates, four would go to Obama and two to Clinton.    , The mood was generally friendly with advocates expressing a happiness with both candidate. When the count has announced and conversation began, a few Clinton supporters, visibly disappointed, left the room.  , With a little encouragement from the precinct captain, the Clinton and Obama supporters creeped in on the five standing alone. The conversation was generally warm but began to get a little hot as the passion grew and the King 5 camera spotlighted the small circle.  , When the time for speeches started, only a few reluctantly stood on the lunch stools to try to sway the crowd.   Two spoke for uniting leadership qualities of Obama, one for the experience of Clinton. The shyness seemed to be result of so many novice participants and a belief that so many were firmly dedicated to their candidate. It could have been a reluctance to argue with their friends but few seemed to know their neighbors well.  , As the call for the second vote began, uncommitted voters were encouraged to make a choice as they did not have enough votes to claim a delegate.  , In the end, all the uncommitted voters switched to Obama, with the final tally as Obama 70, Clinton 20, making the delegate count a five-to-one split. The Clinton defector, surprisingly enough, was the only voter willing to make a speech on her behalf. Sarah Martinez: Everyone was respectful, RENTON  4:15 p.m. Reporting from the Democratic Caucus at Benson Hill Elementary:All the tables were full, and there were people standing along all the walls. The speaker on behalf of Clinton spoke first and got applause but nothing in comparison to the speaker for Obama. I had seen him earlier passing out stickers for his candidate. He gave a very enthusiastic speech. All the points he made about our nations need for change as well as why Obama was the first choice for president were met with enthusiastic applause. There was a real feeling of cooperation. Through the course of the debates I witnessed, everyone was respectful, except for one man who became hostile because he couldnt hear very well and took this out on the woman explaining the process. She had a soft voice and had not yet made her way down to his part of the table. The rest of the people at the table were cooperative and worked together- sometimes too much. At one point when we were all waiting to begin, several people tried to explain to the rest of us what we were going to be doing, someone said: Too many chiefs, not enough Indians. All but two people said they were committed to their candidates so there was some debate but mostly a need to keep things moving and pick the delegates. Through the whole process one person who was a very enthusiastic and personable Obama supporter worked to help the woman in charge of our table. He made sure we all understood the process and engaged in debate for his candidate. In the end, we needed three delegates for Obama and one for Clinton. We had three volunteers for Obama but he continued to recruit delegate candidates which resulted in extra time taken to vote etc. As there was only one for Hillary, this process was pretty simple on her side. Jennifer Haller: This is unprecedented, SEATTLE  4:01 p.m. Reporting from the Democratic caucus at Calvary Lutheran Church. Today was a HUGE day for Obama! The unofficial delegate count from 10 precincts (including mine: 36-1296):, Obama  38, Clinton  15, This is unprecedented.  I am so excited to be a part of this movement and so proud that my children had the opportunity to see true democracy in action! Obama is a true leader who inspires people to take action and know that they can change this world. Tom Harris: Standing room only, GIG HARBOR  4:07 p.m. The Democratic Caucus at Harbor Ridge Middle School, Gig Harbor was attended by a standing room only crowd. Four different Precincts in the Gig Harbor area were represented. If the turnout at this location was a sampling of the gathering at other locations,  then the State of Washington should have a record for the 2008 caucuses. A good percentage of the crowd had either attended the Barack Obama rally in Seattle or Hillary Clintons Town Meeting at UPS in Tacoma.  That often mentioned energy and excitement, was very much in evidence by everyone that attended. Many spoke with passionate pleas to sway voters after the first vote but not many switched their choice. The tally in the Precinct that I belong to was Barack Obama 80  Hillary Clinton 44. Lisa Taylor-Molitch: Guess you just never know, SEATTLE  4:04 p.m. SEATTLE  4:04 p.m. We had 6 precints at McGilvra School in Madison Park. Caucus leaders said the turnout was double the last caucus. We had precints 1817, 1818, 1819, 1919, 2015 and 2058. Approximate turnout was 400 people. The caucus room I was in had 29 people on the sign-in sheet and 26 people in the room. Mine was the smallest of all the caucus rooms. The initial voting didnt differ from the final voting which had 48% for Clinton and 52% for Obama. Good discussions, no fighting. 3 delegates were assigned:  1 for Clinton and 2 for Obama. Many didnt like the math on this process as it was almost a split vote and yet Clinton only received one delegate. It appeared people came prepared to volunteer for these positions. In a room-to-room review following completion of our own voting, the splits were more in favor of Obama. For example, precinct 1817 had a vote of 36 for Obama and 3 for Clinton, however the 3 for Clinton did not remain in the room during the voting of delegates so they lost their delegate to Obamas side. The split in other rooms showed typically a 70% for Obama and a 30% for Clinton. Many complained that the process was not the least bit democratic, that many had friends and family that were not able to attend due to work schedules. Several suggested that the caucusing way of voting was not effective and was unorganized. The people that did come were obviously excited by the prospects of being involved and having their votes counted. On both Clinton and Obamas side there were many people who had never been involved before and had actually decided they wanted to become delegates for their candidate. It was inspiring for both camps. The one area of confusion amongst many was the continual media blitz for Obama, specifically the lack of substance in the candidate and the constant talk of hope and inspiration. Many wanted to know of the Obama supporters What he was inspiring them to do, exactly? but the question was not answered. Im glad I went, and am pleased I didnt have to work and could dedicate time to the election of a candidate. I was very pleased with the dialogue, on both sides and that so many people participated. Even though Im a Hillary Clinton supporter I was very inspired (guess you just never know). Althea Cawley-Murphree: The crowd was definitely younger than I expected, OLYMPIA, 4:03 p.m. Reporting from the Democratic Caucus at the Knox Center at the Olympia School District:Im a voter in the precinct Olympia 15, otherwise known as 215, in eastside neighborhood of Olympia.  My neighbors and I caucused at the Knox Center on Legion, the administrative building for the Olympia School District, with five other precincts.  Check-in for all the precincts was held in the auditorium which was packed.  Organizers said they planned for record crowds and still ended up with far more people than they expected.  By 1pm the line stretched through the old school, out the door and across the parking lot.  At 1:30pm there were still 50 people in line.  It took until about 1:45pm to get everyone checked in. A total of 115 people attended my precinct caucuses.  Ive never attended a caucus in this neighborhood, but in other areas of the state Ive never caucused with more than 25 people in my precinct.  On the first count, 85 of them preferred Obama, 20 were there to support Clinton, eight were undecided, one person came for Kucinich and one came for Gravel.  The initial delegate allocation was five for Obama and two for Clinton. Things started to get interesting around 2:30pm with one minute speeches from the Obama, Clinton and the undecided camps.  Both the Clinton and Obama supporters argued their candidate is the most electable.  The undecideds were the most passionate idealists in the room.  They argued the only way to push both candidates to address particular issues is to make them compete for undecided delegates.  I see the logic in that argument, but it also seemed like the candidates had address those issues, they just hadnt said exactly what these particular people wanted to hear. On the second vote count there were 85 for Obama, 19 for Clinton and 13 undecided (two folks came late and were allowed to sign in since the second ballot was not complete).  Obama got five delegates, Clinton got one, and the undecideds let out a big cheer when they got one delegate as well. My neighborhood is a mix of small single family homes, duplexes and a few small apartment buildings.  The crowd was definitely younger than I expected, but there werent that many students.  It seemed like there were a lot of young couples in their 20s and 30s, many with babies and toddlers.  At least half the crowd was under 50, maybe more, and there were very few over 65. Everyone was very patient with the process and lot of women had brought their knitting to keep them busy during the slow parts.  In 2004 I caucused in Mountlake Terrace.  I was really surprised that Olympia voters seemed more pragmatic and less argumentative than those I met at the caucus four years ago in Snohomish County.  I typically think of this community as much more liberal and much more idealistic.  People in my neighborhood were clearly excited about the election and the role Washington is playing this year, but seemed almost as excited about just getting to know eachother. As an aside, my mom called me from Ellensburg.  They held all the Democratic caucuses there at the high school and 900 people showed up.  They had planned for an unusually big crowd of 400.  She said there were more Hillary people than Obama people, but everyone was enthusiastic about supporting whoever becomes the nominee. PHOTO COURTESY OF ALTHEA CAWLEY-MURPHREE, Rob Meyer: In the forgotten corner of northeastern Washington, KETTLE FALLS  4:02 p.m. Reporting from the Kettle Falls Middle School Democratic Caucus:Its hard to be a Democrat in Stevens County, in the Forgotten Corner of Northeastern Washington.  This is 65%-35% Republican territory.  Surpassing the record turnouts for the caucuses in 2004, several Stevens County precincts have set a record for the Democratic Party caucuses.  And today, Forgotten Corner Democrats were proud to be caucussing, and enthusiastic in their discussions. In Kettle Falls, on the Western Edge of Stevens County, on the banks of The Columbia River (Lake Roosevelt), a community of some 1551 souls, the turnout at the Middle School was a robust 56 (plus a few non-voting children and adolescents). As of 3:00 PM, PST (caucus still in progress discussing resolutions), the totals for Kettle Falls and its several precinct caucuses  [UNOFFICIAL TOTALS]: , Barack Obama  47 supporters, Hillary Clinton  8 supporters, Mike Gravel  0 [zero] supporters, Undeclared  1, Attendees(registered voters) at the Kettle Falls Middle school ranged in age from 20 to over 80.  There was an equal mix of men and women, and the majority were middle-aged or older.  Every attendee was white, except for one Asian woman. More than half of those caucssing at Kettle Falls were participating in their first caucus ever.  The tally for Obama was overwhelming.  The one proponent of sending undeclared delegates to Aprils County Convention switched his vote to Barack Obama.  Several of the precincts were unanimous for Obama. Also unanimous:  resolutions to add to the State and National Democratic Party Platform:, 1)  repeal the USA PATRIOT ACT, 2)  eliminate all signing statements by the President on any bill. 3) single-payer Universal Health Care coverage based on the Medicare System, essentially removing the age of eligibility to allow all citizens to receive ,     Health benefits.  There was some opposition to this. Craig Marois: Filled to capacity, WEST SEATTLE, 3:50 p.m. Reporting from the Democratic Caucus at Alki Elementary:It was a great scene at Alki Elementary today where hundreds filled the lunch room to capacity for the caucus sign-ins.  People started coming in around 12:15 and by one oclock it was filled to capacity.  Our precinct chair was Stacie who was a Clinton supporter her husband Mark was an Obama supporter.  Clinton folks showed up early and made there presence known, but as people flowed in it was obvious that the Obama supporters would greatly outnumber them.  In my particular precinct it ended up being split 5 delegates to 2, Obama, Clinton respecitively and overall at Alki Elementary the final numbers looked to be about 75% in favor of Obama.  The most exciting part of the day was being chosen as a delegate for Barack Obama!, , PHOTO COURTESY OF CRAIG MAROIS, Cristin Carey: Back and forth between Hillary and Obama, SEATTLE  3:44 p.m. We had 199 people cast a vote in precinct 1861. They originally assigned us to a small classroom meant for 35, but when 200 showed we had to move down the hall to a common area. Obama supporters were the majority  you could tell just from the shirts and stickers. We went back and forth between Hillary and Obama supporters for speeches. The issues:, Electability: Who can actually win the popular vote?, Vote History: Obama doesnt have as deep of a history as Hillary. Policy: It was generally agreed that although their policies are not that different, Hillary is better about voicing hers. Legacy: Bush, Clinton, Bush, Clinton. Experience vs. Change, Being able to organize and inspire: Who is better?, 9 delegates went to Obama. 2 went to Hillary. Ben Johnstone-Anderson: Obama landslides, TACOMA, 3:50 p.m. Report from Jason Lee Middle School, in the strongly Democratic north end suburbs of Tacoma:Obama landslides in all precincts.  Mine, 27-309, was 14-6.  My friends who reside in 27-313, right next to UPS (where Clinton delivered her campaign speech Friday), was 15-5 for Senator Obama. >, Theres a great deal of enthusiasm, and while the speakers were about equally supportive of Obama and Clinton, the Obama folks delivered the most passionate orations.  In the end, there were three undecided voters and no one switched, so it was mostly for naught, but it was clear that Obama was sailing on the wide coalition of independents and moderates mantra.Turnout was robust.  They were expecting 600 people in the nine-precinct caucus; that number was reached after only four precincts. Pam Iverson: Being part of something together, WOODINVILLE, 3:50 p.m. Reporting from the Democratic Caucus at Leota Junior High School:Im just back from the Democratic Caucus in Woodinville.  My daughter Rachel said there were as many people crowded in the cafeteria as when she ate lunch there during junior high school.  About a dozen people sat around the table for our caucus, with several rows of people beyond that core.  Our precinct had no chairperson, so I volunteered  Id been to one in 2004.  All 66 people in our precinct signed in and voted, with 45 for Obama (hurrah), 19 for Clinton, and 2 undecided. After several people spoke, the count did not change  5 delegates for Obama, 2 for Clinton.  When people were asked to speak for their candidates, a high school student and a recent college graduate were among those supporting Obama.  A husband and wife split their support along gender lines.  One man complained that the Democratic Party keeps moving to the center, and that the candidate whose views best reflected his is Mike Gravel.  Many people supporting Obama wanted to be delegates  our final choices showed there is more diversity than is typically thought to exist in this suburb  3 young people (under 30), one Asian woman, one African American, one Native American.  There was such a strong feeling of being part of something together  we are making the democratic process work. John Mineer: Ah well, I tried!, EDMONDS  3:42 p.m. My caucus location hosts about 8-10 precincts. There were about twice as many participants in the building this year as there were in 2004, although my own precinct had 27 participants compared to only 6 in 2004. Overall, there were many more young people, probably not even old enough to vote in 2004. There were also more non-whites than before, primarily Asian. My own precinct of 27 had 10 men and 17 women. There were 25 whites and 2 blacks. There was 1 guy younger than 25. The majority were in the 30-50 range with 2-3 people probably over 60. The issues were discussed in a positive manner. Everyone seemed to agree we could support either Obama or Clinton. As both candidates are very similar on the issues, only a few differences were noted. Clintons vote for the authorization to invade Iraq was an issue. As a Clinton supporter, I brought up that she probably made the best decision she could with the information she had at the time, and I couldnt blame her for that. I also said that it wasnt fair for Obama to claim he was against the war all along when he wasnt even in the Senate at the time of the vote. I said it might have even been a weakness of his to say he would not have made the same decision as Clinton did with the information at hand at the time. No one could say without seeing the information available.  , Our initial vote was 17 for Obama, 7 for Clinton, 1 for Kucinich and 2 for Uncommitted  We had 5 delegates total.  The breakdown was 4 to Obama and 1 to Clinton. We were told that if we could get the uncommitted votes for Clinton, we could get another delegate.  We had more discussions. I spoke for Clinton.  I said that even though a vote for Obama or Clinton was a win for all of us, there were a few points to be made:, 1. That all this negative press flying around Clinton wouldnt exist if Obama was not a candidate. We would all be supporting her. 2. That Clinton has been thoroughly vetted. Obama has not and the Republicans will not go easy on him. What if a big issue comes to light that costs the Democrats the election?, 3. Republicans will likely lose whether we choose Clinton or Obama. Looking to the future, Obamas only 46 years old. Why  not have a 16 year legacy rather than just 8?, 4. Clinton has worked her way up through the party. She deferred to Kerry in 04. Its her turn and we shouldnt burn Rome just because the new kid in town makes a great speech. Wheres the loyalty? , 4. Obama supports nuclear energy. I do too, but most liberals dont and Clinton hasnt pressed the issue. 5. Clintons healthcare plan requires total participation. Healthcare like any insurance is cheaper when more people contribute to it. Obamas plan is optional. I closed with saying Clinton has demonstrated with her answers in the debates more actual knowledge of the issues and how to solve them. I said Obama is a great candidate and will be even better with a little more knowledge and experience. He brings people together with his awe-inspiring speeches, but Ronald Reagan was a great orator, too, and Democrats werent too wild about him. Obama is the candidate for change, but George W. Bush brought us change, too. Change is a vague term. We just need more information about Obama before we just blindly jump on the bandwagon. After that, one of the Obama supporters said she just felt Obama could be more effective in getting things done in Washington. I asked what would he do differently? She couldnt say. Discussions concluded and we had another vote. The tally came out 20 for Obama, 7 for Clinton.  4 went delegates to Obama and 1 to Clinton. Ah well, I tried! , We elected delegates and I was chosen as the lone Clinton delegate for my precinct. I will go to the 32nd LD and Snohomish county conventions to support Clinton. I was a delegate in 2004 as well, supporting Howard Dean. That was the end of the caucus. If I had to guess, Id say Obama will take Washington with about 2/3 of the delegates. There was a huge turnout for him. Nicole Wicks: Unorganized, too long and excludes too many people, RENTON  3:49 p.m. Reporting from the Democratic Caucus at Kennydale Elementary:, 452 people turned out at the Kennydale location  well over what was expected.  No seat was open and extra sign-in sheets had to be printed.  I could tell the staff was frazzled.  One woman told me her precinct went from 4 participants in 2004 to 56 participants today. The most popular issue in my precinct was the need for a candidate who could get things done.  Those who spoke for Obama stated that he had their support because of his ability to bring together all sides on key issues.  Those who spoke for Clinton stated that she was very strong, experienced and capable. 35 delegates went for Obama, 19 for Clinton, and 2 Uncommitted. Many people left before the final count and those who waited expressed their frustration.  I think the one thing everyone in the room did agree upon, was that the caucus process is unorganized, too long, and excludes too many people. Duncan Greene: Historic voter participation rates, VASHON ISLAND, 3:43 p.m. Reporting from Democratic Caucus in Dockton:Caucusgoers have broken into precincts. My precinct is Dockton, with historic voter participation rates exceeding 90 percent and 10 delegates  more than any other precinct on the Island. Over 100 caucusgoers from Dockton are packed into the band room amidst drums and music stands. A chair, secretary, and tally clerk are appointed. The chair explains the caucus process. While the tally clerk tabulates the numbers, supporters for each candidate speak. Matt Bergman speaks of Obamas ability to inspire, experience teaching constitutional law, and judgment on the war in Iraq. Jack Richards praises Clintons background in foreign policy, says Obama is not ready to be president, and suggests that Clinton should be president in 2008-2012 and Obama in 2016. Lynn Noah speaks of an imbalance in the country for over 200 years, with no woman president, and says over 80 percent of Iraq war planners were men. Brenda Howell would like to vote for a woman  but the right woman  and is disturbed by how the Clinton campaign has been conducted. Nancy Vanderpol thinks our world is hurting and sick and needs a womans care, intuition, diplomacy and intelligence. After other speakers, the tally clerk announces the first totals: 138 people, 100 for Obama (7 delegates), 30 for Clinton (2 delegates), 8 undecided (1 delegate).After more speeches, 1 undecided caucusgoer moved to the Obama camp. The delegate count did not change: 7 delegates for Obama, 2 for Clinton, 1 undecided. Other precincts report similar results, strongly in favor of Obama. Beth Daranciang: My precinct had only one attendee: me, SEATTLE  3:40 p.m. The caucus was crowded with over 400 people. More than two-thirds of the attendees raised their hands to say that this was their first caucus. As we were electing delegates and not candidates, there didnt seem to be any way of telling how many delegates would vote for each candidate. There seemed to be quite a number of young adults who were there to support Ron Paul, but I have no way of knowing how many delegates they actually elected. My precinct had only one attendee: me. That was the case for quite a number of precincts, since we live in a Democratic-dominated area. Freddy Rhoads: Incredible, VASHON ISLAND  3:38 p.m. The caucuses today were incredible. It was my first in Washington State, so I didnt know what to expect in terms of turnout and energy. The Turnout on Vashon was incredible. The gym was packed full of people, and lines for each precinct stretched far into the room. I was working to register people in my precinct, Dolphin, and we got 62 total. 2 people registered at the table, then signed in. There was much confusion about what was going to happen, and where it would take place, but everyone seemed to find their place. Even with all the chaos, pretty much everything was ready to go at 1:30. In my caucus, the vote tally initially was 41-Obama; 19-Clinton; and 2-Undeclared. This would work out to 3 delegates for Obama, 2 for Clinton, out of our possible 5 delegates. The Clinton camp sent two speakers to address the undeclareds and wavering Obama supporters. The first woman said things to the effectof: Obama is a wonderful candidate, but it just isnt his time. Her speech almost sounded like a plug for Obama, listing all of his assets, but her conclusion was that he is too young, too inexperienced. The next woman said that Obama was barely elected to the senate before he began to campaign for the president. He was absent for x votes, and is too ambitious or at least not dedicated enough to his current job to be trusted with the presidency. The Obama camp, which by the way, I am solidly in, chose 3 speakers to address the undeclareds and the Clinton supporters. The first man spoke about how having Bush/Clinton/Bush/Clinton was bad for our democracy, and seemed to set up a dynasty almost. The next woman spoke about how inspirational Obama was yesterday at the rally, and how he is energizing the electorate. I was the next scheduled to speak, but we ran out of time. I would have talked about his experience as a community organizer, and how that seems much more important to me than time served in the senate (which by the way, is only 4 years fewer than Hillarys total of 8 years).This swayed the 2 undeclared voters, and apparently 1 Clinton voter to come to Barack, so the final count was 44-Obama to 18 Clinton, which works out to 4 delegates for Obama, and 1 delegate to Clinton. Everyone was very cordial, and I made friends with people I didnt know on the Clinton side afterwards. I have heard accusations about dirty tricks in other elections around the country, so I did everything in my power to keep it fair and fun. The caucus overall seemed pretty disorganized. I have worked at the polls in Kansas City, where I just moved from, and we had to be trained for each election. This seems like it would have benefited from a minimal amount of preparation on the part of those in charge. But on the whole, I had a blast!, Denice Carnahan: It was a great experience, RENTON  3:13 p.m. I was just selected as the Obama delegate for precinct Gaile Leg District 11.  There were 36 of us there, the vote was 24 Obama and 12 for Clinton. This became 3 delegates for Obama and 2 delegates for Clinton. We didnt discuss the candidates and no one changed their votes. I made a new friend, who lives 3 doors down. It was a great experience. Carolyn Illman: Sandpoint update, SEATTLE  3:33 p.m. Reporting from the Democratic Caucus at Sandpoint Community United Methodist Church:We had 92 very enthusiastic people of all ages in our precinct. We had enough people for six delegates overall. Our caucus lasted over an hour, it was about an average amount of time for a caucus. We had a lot of great interaction. Early on, it was clear that the group swayed towards Obama due to very outspoken supporters and lots of t-shirts and buttons. After the initial tally, Obama had enough support for four delegates, Clinton had enough for one, and surprisingly there were enough uncommitted voters to have their own delegate. The uncommitted voters said they were undecided either because they had thrown their support to Edwards initially, or because they were torn between the two candidates. Then we had speeches, and the final outcome was that enough of the uncommitted people had moved to support Clinton that she took another delegate. The final count was four for Obama, and two for Clinton. The issues brought up during the caucus were very interesting. The Clinton supporters started with saying that she had been through so much scrutiny in the past that any mudslinging brought her way would not effect her, that she could not be swiftboated as John Kerry had been. They also focused on the fact that Clinton is the only candidate supporting Universal Healthcare. Clintons experience also was a talking point for her supporters. Obama supporters really highlighted the youth factor, one man stating that the reason why he was voting for Obama was for his seventeen year old sons future (who was also participating in the caucus). They also said that they thought America needed this different candidate to create change. They also briefly touched on the issue of healthcare. Overall, it was great to see so many people active in the community and interested in the election process. Sometimes caucuses are intimidating, especially if people arent sure how they work, but I think the political parties and the media really worked to make our caucus seem more accessible. I loved it!, , PHOTO COURTESY OF CAROLYN ILLMAN, Jason McBride: Obama won handily, SEATTLE &#8212 3:13 p.m. Sen. Barack Obama won handily in three out of four precincts of the 43rd Legislative district, with a fourth precinct projected to go to Obama. The delegate numbers are as follows:, 43-2039: Obama: 4, Clinton: 1, 43-2041: Obama: 4, Clinton: 1, 43-1851: Obama: 7, Clinton: 2, Precinct 43-2059 was still uncounted when I left the caucus at the Prospect Congregational Church about 15 minutes ago. Greg Lipski: A feeling in the air of excitement, SEATTLE  3:03 p.m. The Sandpoint Education Center was packed. Precincts were distributed among the classrooms and gymnasium in the facility. My precinct, 1961, was in a regular classroom size room with 60 Democrats. The room looks like it was dgned for 30 students, but we managed pretty well. The caucus went along very well. Our neighborhood leader took the lead and described the process. On our initial tally, one delegate went to Clinton, two to Obama, and one to uncommitted. Nine people were uncommitted. The camps divided themselves in the room and discussed and nominated a spokesperson. I was in the Obama camp and was glad to see my neighbor from across the street take charge and speak for Obama. After about 15 minutes, each camp spoke. The Clinton camp spoke to her being the most liberal and what the party and country needs at this time, and that if we can maintain a democratic congress, she could do great things to move the country in the direction of the Democratic party. The Obama camp felt that he is more electable, and his ability to take input from all sides and reach across party lines will be an asset to move ideas forward and is really what the party and country needs. It was stated that he would provide an excellent face for our nation looking outward into the international arena, and would go a long way to repairing and improving our international reputation. The uncommitted camp spoke that they werent necessarily satisfied with either candidate in their lack of good plans, particularly in regards to health care. Their spokesperson commented that neither plan is really what shed like to see implemented and that by casting a delegate or more as uncommitted, it may have the power to force the candidates to address their voice. They fear that once all votes are committed, the candidates have no need to respond. After the discussions, a final tally was held and the delegates fell: one to Clinton and three to Obama. We voted on the delegate representatives and adjourned. The participants were very well-mannered, well-spoken and there was a feeling in the air of excitement of the sheer turnout and sense that people were rallying to be involved and matter in this election. Ehsan Aleaziz: High turnout among college students, SEATTLE  3:33 p.m.  , Reporting from the Democratic Caucus at University Friends Meeting:I attended the Democratic caucus for the 43rd District, precinct 43-2113 at University Friends Meeting 4001 9th Ave NE Seattle, WA 98105. The room that I was in had three precincts, including several UW dormitories. The turnout for the three precincts was around 300-400 people, and most of the volunteers remarked that it was the highest caucus turnout that they had ever seen. Senator Obama had the overwhelming support of all three precincts. Among the three precincts, he won 24 delegates to Senator Clintons 3 delegates. It was encouraging to see how high the turnout among young college students was. Id say that about 85%-90% of the attendees were between the ages of 18-29. The Clinton supporters mostly focused on her experience, her health care plan, and her dedication to children. Obama supporters emphasized his opposition to the war, his health care plan, and his ability to change our image abroad. All of the reports that I have heard from other University District precincts had Obama winning by large margins as well.I myself was chosen as an Obama delegate at the end of the caucus. Jason McBride: Chaos reigned, SEATTLE  3:34 p.m. Reporting from Prospect Church Democratic Caucus: Chaos reigned from beginning to end. People flowed through the door to the church basement, wondering which precinct they belonged to. I didnt even know. I thought everyone at the church belonged to the same precinct, but it was one district divided into four precincts. One woman I spoke with said different websites gave her different locations. The Capitol Hill library must have been the original place because there was a sign there that said it had been switched to the Prospect Congregational Church on Prospect and 20th. Caucus coordinator Al Rasmussen seemed harried at the end, saying he was concerned that many of the 313 people who came didnt know which precincts table they were supposed to go to in order to sign up. Loren Brown, a volunteer for precinct 43-2039, was confused about how he was going to get in the vote counts. He said he got it right in the end, but it seemed like some better training would have been in order. Cortney Greene, 28, an architectural designer wondered if her vote was going to be counted properly, or if corrupt election officials might change her vote afterwards. But everyone wrote their vote down on a sign-up sheet during registration in front of everyone to see. And delegate counts were done in about an hour and made public, so it seems pretty unlikely there would have been time for any shenanigans. Over all, people seemed okay with the chaos of what Rasmussen described as the first tier of the grassroots  pyramid. People could talk to each other, argue about the pros and cons of the candidates and come to a consensus. One woman said splitting the count between the primary and the caucus, as Washington Republicans do, would work better, since it would give people who dont have time to caucus, or people who work on the day of the caucus, a chance for their voices to be heard. Linda Jacobs: Our delegates represented our eclectic community, SEATTLE  3:02 p.m.  , TOPS School in Eastlake was teeming with people. The Clinton supporters had arrived early and the walls of the school were filled with Hillary signs. Her supporters were also providing voters endorsing her with big labels to wear. As we got closer and closer to 1:30, the caucus starting time, the crowds were so impressive that some precincts had to meet outside the building. At precinct 2105, 75 citizens crowded into the south side of the school library, surrounded by sixth grade projects of ancient Egypt. Our breakdown after the tally was 56 for Obama, 16 for Clinton and three uncommitted. After speaking to the virtues of each of our candidates (most of us thought both were excellent but had various reasons for choosing one or the other) it was determined that Obama had five delegates and Clinton one. Interestingly, as delegates were chosen, they, too, represented our eclectic community: young, seasoned and from several different ethnicities. And despite an exhilerating caucus, the one resolution coming from our precinct was that it be resolved to abandon the caucus and go to an all primary election. Ken Saunderson: Truly inspiring, SEATTLE  3:31 p.m.  , Reporting from Whitman Middle School Democratic Caucus: ,  Truly inspiring and empowering! ,   The luncheon at Whitman Middle School was filled by 1 p.m. and by the starting time at 1:30 p.m. there was an overflow crowd attending the 36th District Democratic Caucus.     We thought we would double the 2004 attendance and weve easily exceeded that, commented the Caucus leader.  How many here are attending your first caucus? Approximately 75% of the people raised their hands  including me. The turn out was impressive.  In 2004, 12 people attended the Precinct 36-2520 caucus.  This year?  75!!! ,    Following an overview of the agenda, our groups initial votes were tallied  37 Sen. Obama, 18 Sen. Clinton, 3 Sen. Edwards and 9 Undecided.  (More people showed up after the initial tally).   The groups divided amongst their candidates and enlisted speakers to present their cases.  The main points for Clinton: experience, universal health care and her ability to network.  For Obama change, getting out of Iraq, putting a new American voice on the world stage and health care.   Our precinct then had a group discussion about the candidates, with Edwards supporters and undecideds asking questions.  Biggest discussion areas focused on Iraq (Sen. Clinton supporters blamed Bush for her vote, while Sen. Obama supporters said Sen. Obama heard the same argument and voted no); ability to be effective from day one; electability; ability to expand the partys base and participation; and, ability to beat Sen. McCain.  Interesting to note that most thought that Sen. Clintons greatest strengths (experience and being strong on national security) would not measure up in a race against Sen. McCain.  The vast majority agreed that Sen. Obama would fare better in a race against Sen. McCain.    When the final votes were tallied it was Sen. Obama with 53 votes (71%), Sen. Clinton with 19 (25%) and 3 undecideds (4%).  For precinct 36-2520, Sen. Obama received 5 delegates and Sen. Clinton received 2 delegates. Bryan Lane: Astounded by the turnout, BELLINGHAM  2:54 p.m.  , Americas fourth corner showed overwhelming support for Sen. Barack Obama in todays caucuses. This was my fourth Presidential caucus from this precinct and I was astounded by the turnout. In other years, 20 would be a large showing. This year, 114 people participated  many were first-timers, all of whom supported Obama. In the first voting, Obama had 87 representatives, Sen. Clinton 25 and Kucinich 2. When the groups split to talk about the issues, it was evident that Clintons support came mainly from older women. Health care resonated most for the Clinton supporters, while change and electability resonated for Obama. As one person noted, Sen. Clinton can pass her health care plan from the Senate  the point is choosing a candidate that can win in November. The huge turnout of new caucus-goers seemed to illustrate that possibility. Kerwin Manuel: Final votes are in, MAPLE VALLEY  3:27 p.m.  , Reporting from Rock Creek Elementary Democratic Caucus:Our final votes are in, 25 for Obama and 16 for Clintoncloser than I would have predicted, perhaps some of the speeches were more persuasive than Id thought. Still a bit of confusion about the forms, how to calculate the number of delegates and who attends the next meetingbut the volunteers are very helpful with us newbs. And now Im a delegate to the district convention on April 5th, Im excited to see the next step in this process.Good luck, everyone and thanks for participating!, Eric Keppler: A packed house, SEATTLE  3:16 p.m.  , Reporting from the Democratic Caucus at Bryant Elementary:The turnout this year absolutely swamped the party infrastructure, but volunteers actually did a remarkable job of getting votes tallied despite the Bryant Elementary gymnasium being absolutely overstuffed with Democrats.At least in our precinct, the presence of Obama in the race seems to have really encouraged people to participate.  Obama supporters outnumbered Clinton supporters by more than a 5:1 ratio in our precinct.   People gave varying explanations for their support of Obama ranging from electability to inspiration but in the end, he was way ahead on the raw numbers. The large turnout also had the effect of making the caucus process (vote, listen to speeches, vote again to see who changed their mind) seem antiquated and silly.  The notion that someone would be swayed mid-caucus by a one minute speech seemed, in todays packed auditorium, laughable.  With a packed house and people straining to hear the organizers speak and explain the agenda, the idea of an informal exchange of ideas among participants wasnt possible.  If there had been a smaller turnout and a chance to interact more freely with other caucusers, then perhaps the interactive, Athenian democracy concept may have worked.  But it doesnt seem to scale very well, and of course, we all (especially us Democrats!) want to see large turnout for elections.  So in my view, it wouldnt be so bad if the caucus gave way to a primary in the future. That said, it was great to be out with the neighbors and see people participating actively in the process. Jeff Rodenburg: Very spirited debate, SEATTLE  3:15 p.m.  , Reporting from Democratic Precinct 1262 Caucus at John Marshall Alternative School:Just returned from the caucus.  Most of the other precincts appeared to have finished as we exited John Marshall Alternative School.  Our voting precinct is bounded by NE 56th NE 60th streets, and 1st Ave. N and I-5 (about 8 square blocks.)  Small precinct, yet we had around 100 people in our corner of a gymnasium.  Very big turnout, both for our precinct and the others who were caucusing at the same location. Final results for our precinct: 5 delegates for Obama, 2 delegates for Clinton. Very spirited debate about the two candidates, but the broad majority of support is for Obama.  Hillary supporters were hammering the experience angle as their key differentiator, and also pointing out that Obama is more about charisma than anything else.  An Obama supporter pointed out the same was true for Bill Clinton in 1992, a very astute point. In our precinct, the majority of Clinton supporters were white females, in the late-twenties to early-fifties age range.  There were also some white males in support of her.  Obama supporters were completely spread out demographically; I couldnt point out a single dominant demographic of supporters for Obama.  Thats a good sign for Obama, it shows that his message resonates at a level that transcends the labels we so often use to categorize each other. Obama supporters were highly confident in their candidate, while Hillary supporters were in sales mode.  Many Obama supporters were highlighting the obvious: a Clinton candidacy will galvanize the conservative factions of this country to get out and vote AGAINST Hillary, while Obama quells that desire (at least for now.), One thing everyone agreed on: given how lackluster this has been in previous elections, how great it is that we have two compelling candidates to pick from this year!, Glenn Stone: It began to hit home just how short a minute is, LAKE FOREST PARK  2:52 p.m. After 15 minutes of preamble, rules, etc. caucus leader John Foy declared the caucus formally open at 1:30 p.m. He made sure everyone in attendance got signed in and was where they needed to be. The initial tally for our precinct was 72 folks present (a record for us); there were seven precincts in the building, so nearly 300 folks if that bears out. 52 people signed in for Obama, 11 for Clinton, one for Edwards, and eight were undecided.  , We then split into groups, chose a spokesperson, and decided what to cover in their one-minute speech. I was with the Obama people; the candidates for spokesperson got together, went over the topics, and then chose a speaker amongst themselves. Our candidates chose a lawyer among them. We realized that there was so much to cover in just one minute, so we decided to hit the high points. By consensus, the spokesperson for the undecideds went first, covering the points she and her people wanted to see addressed. Her big question was Who can who can unite the nation and stop all the he-said, she-said?  , The speaker for Obamas group said that Clinton cannot beat McCain in November and had brought poll numbers as handouts to prove it. He also emphasiszed that FDR, Lincoln, and others who were proven leaders had less experience than Obama does now.  , The speaker for Clinton felt that she has a proven record, a better healthcare plan, more experience and that she got specific, whereas Obama did not.  , Again, by consensus, we had one minute for the undecideds to ask further questions and for the candidates to rebut (this wasnt part of the rules, but no one objected). The undecideds wanted to know who could carry November better. Not much changed on the others positions. It began to hit home just how short a minute is, We were then allowed to mingle and persuade individually for ten minutes, and anyone who wanted to change votes could then do so. The votes were re-tallied. One person turned out to be in the wrong place, so of 71 in the precinct the final tally was 60 for Obama, 10 for Clinton and one person still undecided. Obama received 10 delegaes and Clinton 5  the one undecided person was not enough under the formula to garner a delegate. We then elected delegates by ballot and then alternates in order of preference. The delegates will need to be at the legislative caucus on April 5, to elect from their number people to go to the district caucus on May 17. The district caucues will elect delegates to the Democratic National Convention. The precinct captiain emphasized that if a delegate doesnt show up to a given caucus, their candidates numbers will be proprtionally  reduced.  , The entire caucus process is open to the public. Michele Scott: A new type of leader, OLYMPIA  3:07 p.m. Reporting from the Thurston County Courthouse Democratic Caucus:I just left the Thurston County Courthouse where there was a packed room. In the past there has been 30 or 45 people but this time there must have been close to 150/200 people in attendance.  Better arrangements should have been made but we made it through. This is not the official count but there were approximately 15 delegates for Obama, 5/6 for Clinton and 1 undecided.  There was an excitment of enthusiasm for Obama in his ability to change the climate of politics in general, and unite people from all walks of life including democrats, independents and republicans.  One man recounted that his 92 year old republican mother had made him promise he would attend (although he is a democrat) and speak on behalf of Obama!          \\t\\t\\t   , It was thought that the large turnout was that Bush has been a uniter in the sense that democrats must and will win the election in November.  Obama was seen as a new type of leader with a statesman quality of honesty and integrity. Seen not as part of the establishment and status quo.  Its going to be an exciting time for all of us and in general democrats feel that we have a win win with both our candidates. I am for Obama so it is he I am routing for as the democratic nominee. Linda Jacobs: St. Patricks Church caucus, SEATTLE  3:00 p.m. , PHOTO COURTESY OF LINDA JACOBSA caucus at St. Patricks Church on East Broadway in Seattle. Leo Hinton: Final tally, RAINIER BEACH  2:52 p.m. Final delegate count dem 37-1558 at dunlap elementary, rainier beach, southeast seattle, wa 98118. Total eight delegates for our precient.  Seven obama.  One Clinton.9 citizens have spoken individually for obama.  No one has spoken for Clinton here.   , Will Friedman: Final Results from Precinct 1773, SEATTLE  2:47 p.m. Reporting from the Democratic Caucus at the Seattle Labor Temple:Obama 10, Clinton 2, Daniel Kirschenbaum: One word to describe my caucus: chaotic , TACOMA  2:51 p.m. If I had just one word to describe the Democratic caucus at my location, it would be chaotic. The building quickly filled to capacity there was barely room to stand. Mass confusion abounded as organizers had apparently not been prepared for the remarkable number of people that came to vote. The party official here estimated that there were at least 1,500 voters rather than the 500 they had anticipated. There were so many people in the room that some were forced to stand outside the doors. There were dozens of Hillary supporters handing out stickers at the entrance, but it didnt seem like many people were taking them. I saw women with Obama signs and men with Hillary stickers on their jackets. It quickly became clear, however, that there were significantly more supporters of Obama than Clinton. When Obamas name was called at the precincts around me, all hands around the table flew up. The same people cheered and applauded when the final tally was made. At my precinct, Obama had 34 votes to Clintons 22. As I left the caucus, the building erupted with chants of O-ba-ma, O-ba-ma! , Sharon Chen: It is sweltering, SEATTLE  2:44 p.m. Reporting from Stevens Elementary Democratic Caucus, Precinct 2029:1:05PMThis place is packed.  I find my precinct (2029) and it seems to have the longest line in the place.  Probably 200 feet, 3 people wide.  People around me in line are making compacts to leave.  Theyre saying, Im for Obama, you for Clinton?  How about we both agree to leave?  and they leave, 1:10pm People still streaming in lots of people with stollers people looking up their precincts on maps on the walls.  1:12PM Announcer assuring people that if they wish to leave they can register their vote and that it will count.  Overhearing some people that are not registered are just here to watch!,   1:19 I finally sign in I think.  They are passing sign in sheets down the line now to get more people registering at once.  I pass the paper on hope it winds up where it needs to!,    1:25 Looks like the line is finally through.  A volunteer asks me if I have registered.  I tell her I have and then ask what happens next.  She says, I dunno!,  1:26 Announcement made that sign ups will be closing.  Someone comes up to announcer to tell him that the sound is really bad in this gym and that anyone past the basketball hoop cant hear the announcements at all. they go off to come up with a solution.   1:31 They ask everyone to come forward to the stage so that they can hear.  Amazingly everyone quiets down.  In the back, someone yells, Louder!  Announcer says, Come forward my child!!,  1:32 Local cafe Volunteer Marketpalce Cafe will donate concession proceeds to the 43rd dist democrats who will be spending $10,000 to run caucus..  Please make donations!,  1:35 Greg Whitter  coordinater or 43rd caucus begin with pledge of allegiance, The purpose of these caucuses are to elect delegates  next phase is Sat April 5, 9 precincts here.  Record turnout.  We will send 70 delegates to the next level. Complaints of it getting hot are coming from the back of the room.  Uh-oh, Fox news national has joined us here today!  And they are joining us!   cheers and laughter.  1:41 everyone is asked to break up and group by precint,  1:45 2029 is a huge precinct and some people didnt list anything under preference.  theyre calling names to ask people to fill it in.  yikes!,  1:55 nothing seems to be happenning here  I see a few people leave,  2:00 I push my way to the front.  one guy poring over a yellow pad oh! hes talking.  Precinct will get 12 delegates total.  233 people here today: 161 for obama. 59 for hillary clinton13 for uncommiteddelegates:8 for obama3 clinton1 uncommitted, speeches:  controversy on wether obama is for a womens right to choose or not no debate allowed anymore however.  complaints all around about that. final from 20298, 8 ob3, 3 hc1, 1 uncommited,  2:25pm This blogger goes home.  Gym has all doors wide open and it is sweltering in the gym.  Should cool off soon as people are leaving now. , PHOTO COURTESY OF SHARON CHEN, Damian Wolfgram: Caucus line was long, SEATTLE  3:02 p.m. Reporting from the Democratic Caucus at the Q Caf/Interbay:The caucus line was long and thick outside the Q Caf, stretching hundred people. Most huddled up in their earth-tones trying to stay warm, while an older woman handed Hillary stickers and a group of young people chanted, Yes we can! Inside the cafe was chaotic with an overflow of local residents. The barista behind the counter was making signature lattes for those waiting for the votes. I walked around squeezing past people trying to get a sense of the atmosphere.I asked a table who they voted for and they all replied in unison, Barack!. PHOTO COURTESY OF DAMIAN WOLFGRAM, Kerwin Manuel: Most important issues, MAPLE VALLEY  2:31 p.m. Reporting from Rock Creek Elementary Democratic Caucus:I just spoke to our group (district 05-3272) and asked what are the most important issues to them as Democrats, as community members and individuals. Tied for first was ending the war and removing Republicans from office, second was healthcare and the economy and rounding out the top three was immigration reform. There was a smattering of responses for the environment, green energy, domestic spending and infrastructure building.  Ralph Coolman and daughter, Claire Curran: People are ready for change, SEATTLE  2:29 p.m. Reporting from John Marshall Alternative School Democratic Caucus: We had 69 people for Obama,14 people for Clinton,1 Uncommitted. The delegates were divided up 5 for Obama and 1 for Clinton.It was really crowded and noisy.  Especially since it was in a gym with2 other precincts.  There are still a lot of people talking to each other.  We would characterize the general energy as enthusiastic.  We got a sense that people are ready for change in the political system.  Leo Henton: Initial tally, RAINIER BEACH  2:02 p.m. Reporting from Dunlap Elementary Democratic Caucus: Initial tally from dem 37-1558 dunlap elementary in rainier beach, southeast Seattle, wa 98118Obama 64. Clinton 11 uncomitted zero other zero. Nine citizens have spoken individually for Obama.  No one has spoken for Clinton here. Kerwin Manuel: The gloves come off early, MAPLE VALLEY  1:51 p.m. Weve just started the formal portion of the meeting, representatives of the candidates are speaking. I suppose when youve only 30 minutes to work the crowd, the gloves come off earlythere is not pulling of punches here!Ive personally talked to 13 different people at random, this is their first caucustheyve been life-long Democrats here in Washington. I suppose all that energy and excitement  for this election cycle that Ive been reading about is true. With so many first-timers theres a sense of disorganizationbut everyone is very congenial and were working through the process. My precinct (at least right now) has a large number of Obama supportors and the Clinton supportors have an up-hill battle to convince the crowd. Lisa Taylor-Molitch: First count in, MADISON PARK  1:48 p.m. First count in our Caucus is 48 percent, Clinton. Obama is 52 percent. Only our classroom. Not sure about the rest of the school. Leo Henton: 300 citizens present, RAINIER BEACH  1:40 p.m.  Reporting from Dunlap Elementary Democratic caucus: On-site at dem 37-1558 at dunlap elementary on cloverdale in rainier beach,  southeast Seattle.  To start in area 9 of ld 37 about 300 citizens present. Only our precient 37-1558 have moved to separate room.  About 45 citizens in our room now.  , Kerwin Manuel: Crowd seems very diverse, MAPLE VALLEY  1:30 p.m. Reporting from Rock Creed Elementary Democratic Caucus: Wow, we arrived a bit early to ensure we had a good spot to view the actionthe school gymnasium was already half filled 30 minutes prior to the start. At 1pm, the expected start time, wed already filled all the seats. and a long line has formed outside. The Obama camp seems to be well represented, spontaneous chants of O-bah-mah broke out sporadically. The crowd seems very diversetheres a large number of people that will be 18 in November attending their first caucus.  , Lisa Taylor-Molitch: Filling the school!, MADISON PARK  1:29 p.m. Good turnout. They are filling the school! About 300 people so far. Our caucus 2058 appears primarily Clinton, as am I. Discussions beginning soon. Nicole Wicks: Not enough signin sheets!, RENTON  1:26 p.m. Nicole Wicks, 25, is attending the Democratic caucus at Kennydale Elementary in Renton, where she is supporting Barack Obama. Her report: Overflowing turnout and not enough sign-in sheets! Staff is scrambling to come up with more. Duncan Greene: 500 and counting, VASHON ISLAND  1:19 p.m. The Vashon Island Democratic caucus begins at 1p.m. Approximately 500 people and counting fill the McMurray Middle School gym. Ivan Weiss, chair of the 34th District Democrats, shouts, Are you ready to take this country back? Caucus-goers shout back Yes! Weiss appeals to the crowd to help stop the rape of Maury Island by Glacier by electing a new Public Lands Commissioner and to keep Washington State accountable to our ferry-dependent communities.  , Will Friedman: Crowds gathering, SEATTLE  1:01 p.m. , PHOTO COURTESY OF WILL FRIEDMANCrowds gather to caucus at the Seattle Labor Temple, 2800 1st Avenue. Glenn Stone: There is an energy, LAKE FOREST PARK  1 p.m. Its just before opening here in Lake Forest Park, and theyve had to get extra chairs out twice.  Just a rough sampling indicates there are already over 250 people here in the gym, and there is a line out the door to get in.  The Obama supporters have set up a table near the main entrance, albeit unmanned; there is no evidence of Clinton supporters atall that I can see. While the signage is all hand-written, it is there, including the agenda sheet up on stage.  It seems to be going in a fairly orderly fashion at the moment, but there is an energy to this that says it is about to get intense.    ,  , Ralph Coolman and Claire Curran: Heading to caucus, SEATTLE  11:55 a.m. , PHOTO COURTESY OF RALPH COOLMANRalph Coolman and Claire Curran head to John Marshall Alternative School for caucusing. Blair Daly: Snowed out, SPOKANE  11:53 a.m. Im a sophomore political science student at Whitworth University in Spokane. As a King County Republican Party Precinct Committee Officer I have put in several hours of research and made dozens of phone calls to fellow Republicans within my precinct in preparation for my role as chairman of the precinct caucus. It will be held at Eastgate Elementary School in Bellevue. A P.C.S (poor college student, of course) without a car, I shelled out the dough to buy a Spokane-to-Seattle Greyhound bus ticket last night, only to find it worthless the next morning when the passes closed. Thank goodness for trains through, right? Nope. The desperation train ticket I bought this afternoon  which would put me in Seattle three hours before the caucuses begin  failed me too. A phone call from Amtrak at seven this evening informed me that mudslides had wiped out some railroad track and all trains heading west of Spokane were cancelled for the entire weekend!, Turns out I wont be attending the precinct caucus this election year. Im stuck in Spokane, and I dont plan on spending another $250 for a plane ticket. Suffice it to say Im pretty disappointed. Darn you record snowfall!, , PHOTO COURTESY OF BLAIR DALY]", "Date": "20080209", "Title": "[Dispatches from the caucuses]", "Link": "http://www.seattletimes.com/seattle-news/dispatches-from-the-caucuses/", "Author": "[Seattle Times staff]"}