{"Content": "[ISTANBUL  , Confronted with widespread protests two summers ago, Prime Minister Recep Erdogan of Turkey ordered a harsh crackdown and tarnished the demonstrators as traitors and spies. Faced with a corruption inquiry focused on his inner circle, he responded by purging the police and judiciary. So when Erdogan, now president, suffered a stinging electoral defeat in June that left his party without a majority in Parliament and seemingly dashed his hopes of establishing an executive presidency, Turks wondered how he would respond. Many say they have their answer: a new war. As Turkey resumes military operations against the separatist Kurdistan Workers Party, or PKK, analysts see a calculated strategy for Erdogans Islamist-rooted Justice and Development Party to regain its parliamentary majority in new elections. Having delayed formation of a coalition government, analysts say, Erdogan is buttressing his partys chances of winning new elections by appealing to Turkish nationalists opposed to self-determination for the Kurdish minority. Parallel to the military operations against the Kurds has been an effort to undermine the political side of the Kurdish movement, by associating it with the violence of the PKK, which has also seemed eager to return to fighting. Turkey battled the group for three decades at a cost of about 40,000 lives before a fragile peace process began in 2013. The overall assumption is that President Erdogan wants to create the conditions so the result of June 7 can be overturned, so that he can run the country from the presidency, said Suat Kiniklioglu, a former lawmaker from Erdogans party and executive director of the Center for Strategic Communication, a research organization in Ankara.  The Justice and Development Party, known as the AKP, recently began conducting nationwide polls to see how it might fare in snap elections, which could be held as soon as November. Many analysts say that after weeks of stalled coalition talks involving the AKP and three opposition parties, new elections are likely. And at a time of crisis, Turkish voters, experts say, could well turn again to Erdogan and the AKP. A voter survey released Wednesday by a widely cited Turkish pollster found that Erdogans party could regain a parliamentary majority if elections were held today. He is going for early elections, said Henri Barkey, director of the Middle East program at the Woodrow Wilson International Center for Scholars and an expert on Turkey. In any society when there is a crisis, people rally under the flag, even if they dont support the leader. In this instance, Mr. Erdogan is playing the nationalism card for his own benefit. In addition to domestic political concerns, analysts said, Erdogan is worried about the growing military strength of the PKK, whose military affiliate has been working closely with the United States in northern Syria to resist and repel advances by the Islamic State group. The bombing campaign against the PKK, these analysts say, is intended to weaken it. The resumption of war with the PKK, with Turkish warplanes strafing targets in northern Iraq, where the group is based, came as Turkey, in a major shift, decided to join the U.S.-led coalition against the Islamic State, the Sunni militant group that controls a large section of territory in Iraq and Syria. Turkey has struck Islamic State group targets in Syria, and granted the use of air bases to U.S. warplanes, restoring its international standing as a reliable ally in the fight against the Islamic State. Pentagon spokesman Navy Capt. Jeff Davis said a drone had launched an airstrike from Turkey for the first time Wednesday, but provided no details. The Turkish foreign minister, Mevlut Cavusoglu, reaffirmed the governments commitment to the coalition, saying Turkey was ready for a comprehensive fight against the Islamic State group. Also Wednesday, Syrias Foreign Minister Walid al-Moallem said Syria would support efforts against the Islamic State group, as long as the fight is coordinated with the Syrian government. Erdogan has said he is acting in Turkeys national-security interests in targeting terrorists of all stripes, both the Islamic State group and the PKK, as well as a homegrown leftist group that has periodically carried out attacks. But the bulk of the military operations have been directed at the PKK, which has carried out numerous attacks in Turkey during the past few weeks that have killed nearly three dozen people, mostly soldiers and police officers. The latest came Tuesday, when a roadside bomb killed three soldiers in the southeastern province of Sirnak, an attack that was followed by more Turkish airstrikes on PKK targets, according to Turkish news reports. Turkey also has arrested many suspected militants and has seemed to go to extra lengths to publicize the arrests of suspected Islamic State group members, perhaps to counter longstanding criticism from the West that it has been ambivalent about the threat posed by the group. However, according to news reports, many of the Islamic State group suspects have been quietly released for lack of evidence. The countrys new war footing already seems to be influencing some voters. I dont support Erdogan or the prime minister, but Turkey cant afford to have a weak coalition government, said Oktay Cenk, a taxi driver in Istanbul. The government tolerated the PKK for long enough. Its not possible to negotiate with terrorists, so we need to show strength against them and we need a strong government to do that.]", "Date": "20150805", "Title": "[Some see Erdogans domestic troubles fueling Turkeys war on extremism]", "Link": "http://www.seattletimes.com/nation-world/some-see-erdogans-domestic-troubles-fueling-turkeys-war-on-extremism/", "Author": "[TIM ARANGO, CEYLAN YEGINSU]"}