{"Content": "[In one of his final acts as governor, Democrat Martin OMalley announced Wednesday that he will commute the sentences of four death-row inmates to life in prison without parole. Two years ago, the General Assembly abolished the death penalty, leaving five inmates on death row. One of them, John Booth-El, died in prison this year. The governor said he had met or spoken with many of the relatives of the people killed by the inmates. Some victim family members and prosecutors were upset with OMalleys decision. OMalley said that if he didnt commute the sentences the legal process would needlessly and callously subject survivors, and the people of Maryland, to the ordeal of an endless appeals process, with unpredictable twists and turns, and without any hope of finality or closure. None of the executions was imminent because the state didnt have a procedure to carry one out. OMalley, who is considering running for president in 2016, will leave office next month after two terms, the limit in Maryland. The governor is a Catholic and longtime opponent of capital punishment. We would like to thank Gov. OMalley for taking what was a tough and courageous moral decision, Gary Proctor, one of the attorneys for death-row inmate Heath Burch, said in a statement. It was indeed time that Marylands machinery of death was consigned to the history books. Mary Frances Moore, whose father and stepmother were fatally stabbed by Burch in 1995 in Capitol Heights, said she was devastated by the governors decision. I think he was hoping I would give him the OK on it, to give him life without parole, and I didnt give him that, Moore, 71, said Wednesday. She fears a future governor could grant parole to Burch. Matthew Maciarello, the Wicomico County states attorney, said OMalley met with Dottie Atkinson  the mother of Edward Atkinson, who was killed in a 1997 robbery and murder by Jody Lee Miles in Mardela Springs on Marylands Eastern Shore. Maciarello, who attended the meeting, said while the family believes death was the appropriate sentence, they understand the political and legal realities. They believe that the actions taken by the governor will provide a degree of closure that could not be achieved through protracted litigation, Maciarello said. The family requested privacy and asked him to make a statement for them, he said. Miles attorney, Robert Biddle, argued in a letter to OMalley last month that the governor should not commute his clients sentence because Miles deserves the opportunity to argue in court for parole. Biddle said Wednesday that Miles would not agree to the commutation, arguing that his client deserves a chance at parole because of his remorse, his outstanding record in prison and other factors. Baltimore County States Attorney Scott Shellenberger, a death penalty supporter, criticized the governors move. Two death-row inmates, Anthony Grandison and Vernon Evans, were convicted in the 1983 contract killing in Baltimore County of two witnesses who were scheduled to testify against Grandison in a federal drug case. Death was the decision of the jury. These sentences were lawfully imposed and upheld numerous times on appeal, Shellenberger said in a statement. The governor should not be using his last days in office to show any mercy to these cold, calculating killers. Gov.-elect Larry Hogan, a Republican who takes office Jan. 21, said he wasnt going to second-guess the decision. There is only one governor at a time, and Im not in a place to second-guess what is probably one of the most difficult decisions a governor may have to make, Hogan said in a statement. Only five Maryland inmates were executed since the death penalty was reinstated in 1978. The last execution was in 2005 under Republican Gov. Robert Ehrlich. ", "Date": "20150101", "Title": "[Last 4 on Md. death row to have sentences commuted]", "Link": "http://www.seattletimes.com/nation-world/last-4-on-md-death-row-to-have-sentences-commuted/", "Author": "[BEN NUCKOLS, BRIAN WITTE]"}