{"Content": "[NEW YORK (AP)  President Barack Obama will impose even steeper cuts on greenhouse gas emissions from U.S. power plants than previously expected, senior administration officials said Sunday, in what the president called the most significant step the U.S. has ever taken to fight global warming. A year after proposing unprecedented carbon dioxide limits, the Obama administration was poised to finalize the rule at a White House event on Monday. Obama, in a video posted to Facebook, said the limits were backed up by decades of data and facts showing that without tough action, the world will face more extreme weather and escalating health problems like asthma. Climate change is not a problem for another generation, Obama said. Not anymore. In his initial proposal, Obama had mandated a 30 percent nationwide cut in carbon dioxide emissions by 2030, compared to 2005 levels. The final version, which follows extensive consultations with environmental groups and the energy industry, will require a 32 percent cut instead, according to Obama administration officials, who werent authorized to comment by name and requested anonymity. Opponents said they would sue the government immediately. They also planned to ask the courts to put the rule on hold while legal challenges play out. The final version also gives states an additional two years  until 2022  to comply, officials said, yielding to complaints that the original deadline was too soon. States will also have until 2018 instead of 2017 to submit their plans for how they intend to meet their targets. But the administration will attempt to incentivize states to take action earlier by offering credits to states that boost renewable sources like wind and solar in 2020 and 2021, officials said. The focus on renewables marks a significant shift from the earlier version that sought to accelerate the ongoing shift from coal-fired power to natural gas, which emits far less carbon dioxide. The final rule aims to keep the share of natural gas in the nations power mix the same as it is now. The stricter limits included in the final plan were certain to incense energy industry advocates who had already balked at the more lenient limits in the proposed plan. But the Obama administration said its tweaks would cut energy costs and address concerns about power grid reliability. The Obama administration previously predicted the emissions limits will cost up to $8.8 billion annually by 2030, although it says those costs will be far outweighed by health savings from fewer asthma attacks and other benefits. The actual price wont be clear until states decide how theyll reach their targets, but the administration has projected the rule would raise electricity prices about 4.9 percent by 2020 and prompt coal-fired power plants to close. In the works for years, the power plant rule forms the cornerstone of Obamas plan to curb U.S. emissions and keep global temperatures from climbing, and its success is pivotal to the legacy Obama hopes to leave on climate change. Never before has the U.S. sought to restrict carbon dioxide from existing power plants. By clamping down on power plant emissions, Obama is also working to increase his leverage and credibility with other nations whose commitments hes seeking for a global climate treaty to be finalized later this year in Paris. As its contribution to that treaty, the U.S. has pledged to cut overall emissions 26 percent to 28 percent by 2025, compared to 2005. Other major polluting nations have also stepped up including China, which pledged to halt its growth in emissions by 2030 despite an economy thats still growing. Americas largest source of greenhouse gases, power plants account for roughly one-third of all U.S. emissions of carbon dioxide and other heat-trapping gases blamed for global warming. Obamas rule assigns customized targets to each state, then leaves it up to the state to determine how to meet their targets. Even before the rule was finalized, more than a dozen states announced plans to fight it. At the urging of Senate Majority Leader Mitch McConnell of Kentucky, some Republican governors have declared theyll simply refuse to comply, setting up a certain confrontation with the EPA, which by law can force its own plan on states that fail to submit implementation plans. Yet even in many of those states, power companies and local utility authorities have started preparing plans to meet the targets. New, more efficient plants that are replacing older and dirtier ones have already pushed emissions down nearly 13 percent since 2005, putting them about halfway to meeting Obamas goal. In Congress, lawmakers have sought to use legislation to stop Obamas regulation, and McConnell has tried previously to use an obscure, rarely successful maneuver under the Congressional Review Act to allow Congress to vote it down. The more serious threat to Obamas rule will likely come in the courts. The Electric Reliability Coordinating Council, which represents energy companies, said 20 to 30 states were poised to join with industry in suing over the rule. The Obama administration has a mixed track record in fending off legal challenges to its climate rules. Earlier this year, a federal appeals court ruled against 15 states and a coal company that tried to block the power plant rule before it was finalized. The Supreme Court has also affirmed Obamas authority to regulate pollution crossing state lines and to use the decades-old Clean Air Act to reduce greenhouse gases  the legal underpinning for the power plant rule. But the high court in June ruled against his mercury emissions limits, arguing the EPA failed to properly account for costs. Federal courts have also forced Obama to redo other clean air standards that industry groups complained were too onerous. With the end of Obamas presidency drawing nearer, his climate efforts have become increasingly entangled in the next presidential election. The power plant rule wont go into effect until long after Obama leaves office, putting its implementation in the hands of his successor. Among other Republican critics, 2016 candidate and Wisconsin Gov. Scott Walker has said he would drastically scale down the EPA if elected and shift most of its duties to state regulators. ", "Date": "20150801", "Title": "[Obama to require steeper emissions cuts from US power plants]", "Link": "http://www.seattletimes.com/nation-world/obama-to-require-steeper-emissions-cuts-from-power-plants/", "Author": "[JOSH LEDERMAN]"}