{"Content": "[Ballots were mailed to every Washington voter this year. But most apparently wound up in the recycling with the credit-card and magazine offers. Statewide turnout in the November election was 44.5 percent as of Friday  the lowest in a decade. With several thousand ballots remaining to be counted, that figure could edge up a bit. But it will remain the lowest turnout since 2003, when just 40.5 percent of voters cast ballots, according to Secretary of State Kim Wymans office. Turnout is usually depressed in off-year elections, which dont feature high-profile presidential or congressional contests to attract interest. Since 1980, turnout in off-year elections has averaged 51 percent  which is what elections officials predicted turnout would reach this year. That compares with 79 percent in presidential-election years and 62 percent during midterm elections. Dave Ammons, a spokesman for Wymans office, noted that unlike 2012 there were no highly charged issues like marijuana legalization or gay marriage on this years ballot. Initiative 522, which would have required labeling of genetically engineered foods (GMOs), didnt draw the same level of interest, despite record spending by the no campaign. GMO is a pretty abstract notion that required quite a bit of voter research, and the Eyman one (I-517) only vaguely interested people, Ammons said in an email. The tax advisory votes probably didnt draw anyone to vote and, indeed, we heard from a lot of confused voters who didnt understand the process of a nonbinding vote on something that already happened. The lower turnout was cited by the Yes on I-522 campaign as a factor in the initiatives close defeat. We anticipated a likely lower off-year turnout in all of our strategizing about the race. But this exceeded our expectations and really was in many ways impossible to predict, said Lisa MacLean, a political consultant who worked on the pro-I-522 campaign. Backers vowed to try a similar measure in 2016. I think an even-year electorate is more conducive to turnout among progressives and young voters, MacLean said. Turnout in King County was about 47 percent as of Friday, with thousands more votes waiting to be counted, according to King County Elections. It was higher  about 53 percent  in Seattle, where voters decided a hard-fought mayoral race. Turnout was lowest in Yakima County (37.5 percent) and highest in Jefferson County (64.6 percent). Even with the relatively low numbers, turnout in Seattle, at least, was stellar compared with that in some other major cities. New Yorks mayoral race drew a record-low turnout of 24 percent, The New York Times reported. And in Los Angeles, a mayoral runoff election in May drew a record-low turnout of just 23.3 percent, according to the Los Angeles Times. Jim Brunner: 206-515-5628 or jbrunner@seattletimes.com. On Twitter @Jim_Brunner]", "Date": "20131115", "Title": "[States 2013 voter turnout lowest in a decade]", "Link": "http://www.seattletimes.com/seattle-news/politics/statersquos-2013-voter-turnout-lowest-in-a-decade/", "Author": "[Jim Brunner]"}