{"Content": "[PHOENIX (AP)  Sen. John McCain announced Tuesday that he will run for re-election in 2016, making official a move that has been widely expected for the Republican as he looks to extend his nearly three-decade career in the Senate. McCain described his plans to run before an Arizona Chamber of Commerce and Industry luncheon in Phoenix, receiving a loud applause when he told the crowd: With a full heart, I ask Arizonans again for their support as I seek re-election to the United States Senate. Im as determined as ever to deserve your trust and grateful as ever for the privilege. His appearance before a pro-business crowd put him in friendly territory ahead of a race in which he will likely face a challenge from the right amid tea party dissatisfaction over his record in the Senate. McCain will be 80 by Election Day, but says he is in great shape and has much work to do in the Senate. I work 16-hour days. Look at what Ive done for Arizona and America, he told The Associated Press. Make your own judgment. McCain is a former prisoner of war during the Vietnam War who was first elected to the Senate in 1986, replacing longtime conservative stalwart Barry Goldwater. He ran for president in 2000 and secured the Republican Partys nomination in 2008, losing to Barack Obama. He coasted to re-election to the Senate in 2010 and has signaled on several occasions in recent months that he was planning to seek a sixth term. McCain said he will emphasize local issues during his campaign, such as the drought, his work to benefit a copper mine and legislation to reform the Department of Veterans Affairs. The VA was thrown into turmoil last year amid allegations of misconduct and cover-ups at the VA hospital in Phoenix. The most prominent Republican to hint of challenging McCain is state Sen. Kelli Ward, a conservative member of the Arizona Legislature. Ward said she is still testing the waters but knows shell have to raise between $5 million and $10 million to beat McCain, who already has more than $3.5 million in cash on hand and the ability to raise much more. Being able to raise money is going to be very important. I think thats very important in a David and Goliath situation, Ward said. The state Republican partys leaders, dominated by conservatives, censured McCain last year for not being sufficiently conservative, but hes brushed off the criticism. A spokeswoman for the Arizona Democratic Party called McCain an angry man who pontificates on pretty much anything. McCains not going to do anything to help working families in Arizona, party spokeswoman Barbara Lubin said. He lives for the media interviews. He certainly is not a statesman, and I think that hes just publicly differing with the president just to get himself press. Thats all he lives for these days. Glenn Hamer, president of the Arizona Chamber, said McCain never takes anything for granted in a political race and has a deep reservoir of support in Arizona. That combined with his national security credentials should easily overcome any primary challenge in 2016, Hamer said. I would expect that he would be overwhelmingly re-elected, he said. McCain was elevated to chairman of the Senate Armed Services Committee this year after his party reclaimed the Senate. He has repeatedly used his prominence on the committee to attack Obama on foreign policy, ridiculing what he called a feckless policy of leading from behind.]", "Date": "20150407", "Title": "[US Sen. John McCain announces hes running for 6th term]", "Link": "http://www.seattletimes.com/seattle-news/politics/us-sen-john-mccain-announces-hes-running-for-sixth-term/", "Author": "[BOB CHRISTIE]"}