{"Content": "[ Probable Republican presidential candidate Scott Walker says hewouldnt rule out a full-scale American re-invasion of Iraq if the national interests of this country are at stake. Appearing on ABCsThis Weekon Sunday, the Wisconsin governorinitially demurred when interviewerJonathan Karl asked if hed rule out a full-blown U.S. re-invasion of Iraq and Syria. I dont think we should ever send a message to our foes as to how far were willing to go,Walker said. He doesnt think its necessary to send U.S. troops now, he said, but he would not rule out boots on the ground. He made a similar comment in February, saying he wouldnt rule anything out, including sending U.S. ground troops to Syria to fight the Islamic State militant group, as commander-in-chief. Asked again if hed be open to launching a full-scale re- invasion of Iraq, Walker kept that option open. If the national interests of this country are at stake, here at risk in this country or abroad, thats to me the standard of what we do for military engagement, he said. Walker said in a statement last month that knowing what we know now, we should not have gone into Iraq in 2003, and accused President Barack Obama of making the situation there worse. In the ABC interview,Walker also said he would support a constitutional amendment to affirm that states can prohibit same-sex marriage if the Supreme Court legalizes it this month. He described former Florida Governor Jeb Bush as a formidable rival in the Republican primary because hes going to have more money than just about all of us combined. WASHINGTON  After being the focus of Hillary Rodham Clintons criticism of voter registration laws, Republicans shot back on Sunday, lambasting the former secretary of State and front-runner for the Democratic presidential nomination as out of touch with states rights. She doesnt know what shes talking about, said New Jersey Gov. Chris Christie in an interview on CBSs Face the Nation. In New Jersey, we have early voting. In a speech last week, Clinton castigated Christie, former Govs. Jeb Bush of Florida and Rick Perry of Texas, and Wisconsin Gov. Scott Walker for deliberately seeking to disenfranchise voters throughout the nation with laws that make it harder to cast ballots. Christie, who will decide this month if he will run for the Republican presidential nomination, vetoed a Democratic bill in 2013 that would have expanded in-person early voting in the state. Speaking on Face the Nation, Christie said he doesnt want to expand early voting and increase the opportunities for fraud. And maybe thats what Mrs. Clinton wants to do. I dont know. But the fact is that the folks in New Jersey have plenty of an opportunity to vote, he said. Perry, who last week announced his second bid for the Republican nomination, dismissed Clintons comments as ridiculous. Its way outside the norm of ridiculous, if you want to know the truth of the matter, to call out the people of the state of Texas, because thats what she did, Perry said on CNNs State of the Union. In Texas, Perry signed into law a measure that requires the states estimated 14 million registered voters to show photo identification to cast a ballot. The law, which has faced several legal battles, was allowed to take effect last fall by the Supreme Court. Republican-led legislatures have in recent years passed measures, including voter-identification requirements and time restrictions imposed on early voting, which have been widely criticized by Democrats as moves to disenfranchise minority voters. Clinton, in her Houston speech, called for automatic voter registration, which would register every American citizen at 18  similar to a recently passed state law in Oregon. Moreover, she called on the Republican-led Congress to reinstate a key provision of the Voting Rights Act that had required states with a historic pattern of restricting minorities from voting to get federal approval before making changes to election laws. The Supreme Court in 2013 struck down the provision. I think this would have a profound impact on our elections and our democracy, she said. WASHINGTON  New Jersey Gov. Chris Christie says hed revive enforcement of federal marijuana law in states that have legalized recreational use of the drug if he were president. And he says if that position causes him political trouble in battleground Colorado, so be it. He says he wont pander to voters or hide his positions for political expediency. Federal and some state laws on marijuana are in conflict. But the federal government has adopted a hands-off approach to states with lenient marijuana laws. The Justice Department has told such states that it wont challenge their laws so long as marijuana is tightly regulated. Colorado is one of them. Christie spoke Sunday on CBS Face the Nation. He says hell decide this month whether to seek the Republican presidential nomination. WASHINGTON  Republican presidential contender Lindsey Graham says his party has room for transgender people like Caitlyn Jenner. The South Carolina senator calls himself a traditional marriage kind of guy. But he says he can only imagine the torment that Bruce Jenner went through before becoming a transgender woman. He hopes that, now, shes found peace. The underdog Republican candidate is campaigning on the need to counter threats from terrorists and Islamic State militants. He shares the opposition to same-sex marriage expressed by his rivals but says the Supreme Court is settling that question. Graham says if Jenner wants to be a Republican, shes welcome. And he says if she wants a safe country and a strong economy, she should vote for him. Vermont Senator Bernie Sanders boldly predicted Saturday that he would beat Democratic presidential rival and heavy favorite Hillary Rodham Clinton in the 2016 New Hampshire primary, expected to be in early February. Let me tell you a secret: were going to win New Hampshire, Sanders told upward of 1,000 supporters gathered in Keene, N.H. the Keene Sentinelreported. Sanders, 73, has drawn large crowds as he campaigns across Iowa and New Hampshire. Clinton, meanwhile, has continued her low-key listening tour before a June 13 campaign event at New Yorks Roosevelt Island that is expected to kick off a more outgoing phase of her quest for the White House. A Bloomberg Politics/Saint Anselm poll in May found Clinton leading Sanders in New Hampshire by a margin of 62-18 percent, but Sanders support has grown as he continues to deliver a populist message on the campaign trail. In my view, the issue of wealth and income inequality is the great moral issue of our time, it is the great economic issue of our time, and it is the great political issue of our time, Sanders said Saturday. While Sanders didnt mention Clinton by name in his stump speech, he was asked by a reporter afterward whether the former secretary of states lack of a concrete position on the Trans- Pacific Partnership, a potential trade deal involving the U.S. and much of the Pacific Rim, was hurting her campaign. On Sanders Senate website he calls the TPP disastrous. Call her up and ask her, Sanders said. Im against it.]", "Date": "20150607", "Title": "[Political notes: Walker on invading Iraq; Christie on pot; Graham on Jenner]", "Link": "http://www.seattletimes.com/nation-world/scott-walker-wont-rule-out-another-iraq-invasion/", "Author": "[Seattle Times staff]"}