{"Content": "[The conventional wisdom about national political conventions is that they have outlived their purpose. Once, they were the place where the parties actually picked their candidates for president and vice president.  But for at least 30 years now, conventions have been the place where the nominees, long since selected, try to bind up their partys internal wounds and reach out over the heads of the delegates to woo the less partisan voters who usually decide the election. They have become the largest, most expensive infomercials in human experience. So why are we even still having them?, As the parties convene, there will be much chattering that conventions dont matter anymore, that they are a waste of money (some of it taxpayer money) and should be abandoned. Total anachronisms. Parties should scrap `em, sniffs Mark McKinnon, former media adviser to George W. Bush and a co-founder of No Labels, a group devoted to purging hyper-partisanship from politics. The Senate, in fact, voted, 95 to 4 a few weeks ago to cut off in the future the $18.3 million subsidy each party gets to stage (that is the word  stage) the conventions. Homeland Security also gives out $50 million to assure security at each convention. The parties are not likely to give up their moments in the sun, however. Conventions are the time when voters really tune in. Even with the reduced air time the TV networks now give them, conventions bring a spike in attention, says Andrew Kohut, president of the Pew Research Center. Social media is likely to magnify that this year in the same way that it whetted TV audiences appetites for this summers other big event, the London Olympics. The acceptance speeches of the two presidential nominees will be the largest campaign audience either receives until they meet together for the three debates. Those speeches are no small thing. American politics is hardly burdened by too much communication, although if you live in a battleground state saturated with 30-second commercials you might be forgiven for thinking that. The larger problem is too little substantive communication, particularly communication that forces a thought to last longer than the speed of sound-bite. The acceptance speeches are the only time in the entire fall campaign when each candidate speaks directly to the country for an extended time, unfiltered by news coverage or back and forth with an opponent. Other countries arrange time specifically for that sort of thing. Not in America. It is the best chance for a candidate to `introduce himself to the country on his own terms, says former Rep. Mickey Edwards, a Republican from Oklahoma. That is particularly interesting coming from Edwards, who in almost every other respect excoriates the present political system in his new book, The Parties Versus the People. I do, indeed, want to radically overhaul the system, but thats about the voting process, money, partisanship in governing, Edwards says. The convention is not at that level; its more of a `show, more important than mere `entertainment. I see it as something worth watching, and even more so than most of the other stuff on television. Indeed, it is the kind of high-school civics version of campaigning that is otherwise pretty hard to locate in the day-to-day scrum of American national politics these days. If the candidates want to speak directly to the nation after their conventions, they have to pay for the time, as Obama did in 2008. Of course, if the justification for public spending on party events is that the acceptance speech is a public service, the government could just spend that $18.3 million to buy air time for each campaign. That $18.3 million is one of the last remnants of a public finance system that was meant to curb money in politics. The IRS collects $3 from every taxpayer who ticks the box for the presidential campaign fund. But most of the money, some $235 million, is sitting in the government coffers because neither Romney nor Obama is taking their share, preferring instead to go out and raise and spend even more on their own. Since $18 million might not be enough, at going rates, to buy an hour across all the networks and key cable channels, Congress could authorize the Presidential Election Campaign Fund to tap the rest of that money, too, to buy time on the condition it was used for long-form presentations. There will be a great temptation to take this unspent money and plow it back into paying down the government debt. But it would probably increase the chances of actually dealing with that debt if the candidates used the money to explain the fiscal situation and what they planned to do about it. The parties will have to make their own decision whether to continue the conventions without the federal subsidy. They might well, since the conventions are still a valuable tool for rewarding party workers and motivating the base voters of each party, something that could loom particularly large this year in an election that may revolve even more than usually on whose loyalists turn out in the fall (partisan voters do tend to watch their own convention more than the other guys). Conventions werent part of the original plan. The founders by and large hated parties (tellingly, they called them factions) and probably would have hated partisan conventions, which were invented only after they were gone. Conventions were originally thought of as a reform of a system in which congressmen picked the candidates. The first party conventions were before the election of 1832, and nominated Henry Clay to challenge President Andrew Jackson. Delegates arrived at both those party conventions knowing who would get the nomination. Just like this year. But that hasnt stopped conventions from convening every four years since. Even before the federal subsidy is yanked, the conventions are evolving. Once a fixture of midsummer, the Democratic convention this year will actually be after Labor Day, coinciding with the traditional kickoff of fall campaigning. The Democrats had already cut their convention to three days, recognizing a reality that broadcasters werent going to pay attention to their activities on Labor Day anyway. The broadcasters then told the Republicans they wouldnt cover their Monday sessions either, and Hurricane Isaac has now finished the job of washing out day one. Despite separation between church and state, Mother Nature is helping to ensure that the conventions get trimmed from four days to three, said Elizabeth Wilner, vice president of the Kantar/media analysis group.  With Dems really only doing three days, and now Republicans only doing three days, in 2016 there will be pressure to only do three days. Rep. David Dreier, R-Calif. saw this coming. He has served as parliamentarian of the last four GOP conventions. He recalls that in 2008 a Katrina-class hurricane was barreling for the Gulf Coast as the convention convened in Minnesota. His staff got together and figured out a way to compress all the legally required business of the convention  rules, the platform and the nomination of the ticket  into a few hours so delegates from the Gulf Coast, including the governors of Louisiana and Mississippi, could rush home to respond to the looming disaster. This Plan B went unneeded. The hurricane blew out, and the convention went ahead as planned over four days to nominate John McCain and Sarah Palin. While Dreier developed a plan to effectively eliminate the Republican convention, that doesnt mean he would.  There will be a degree of uncertainty about what party conventions will look like in the future, he said as he headed to Tampa. They are going through a bit of a change. But I dont agree they are unnecessary. EDITORS NOTE  Michael Oreskes is senior managing editor for U.S. news at The Associated Press. Reach him at moreskes(at)ap.org.]", "Date": "20120827", "Title": "[WATCHING THE SHOW: Are conventions still relevant?]", "Link": "http://www.seattletimes.com/seattle-news/politics/watching-the-show-are-conventions-still-relevant/", "Author": "[MICHAEL ORESKES]"}