{"Content": "[The first prosecution arising from the Benghazi attacks is playing out in the federal courthouse blocks from both the White House and Capitol Hill, an appropriate setting for a case that has drawn stark lines between President Barack Obama and Republicans in Congress. The criminal proceedings could provide new insights into the 2012 attacks that killed four Americans and will serve as the latest test of the U.S. legal systems ability to handle terrorism suspects captured overseas. Unfolding during an election year, the case against alleged mastermind Ahmed Abu Khattala could also help shape the legacies of Obama and Attorney General Eric Holder, and spill over into the potential 2016 presidential candidacy of Hillary Rodham Clinton. Even as the court case slogs forward, it may be challenging for the public to untangle the law from the politics, given how prominent the attacks on the diplomatic compound in the eastern Libyan city have become in U.S. political discourse. Whats going to matter to the public more than anything else is the result, and I think its going to only diffuse some of the ongoing Benghazi conspiracy theories if the Obama administration is going to be able to successfully obtain a conviction in this case, said American University law professor Stephen Vladeck, a national security law expert. Still, he said, the case raises the same legal issues as past terrorism prosecutions and should not by itself be viewed as a referendum on the Obama administration. The story of this case is not the story of the Obama administrations reaction to Benghazi, he added. The story of this case is those who were responsible for Benghazi and those who need to be held accountable for the four deaths that resulted. A 10-minute court appearance amid tight security Saturday was the American publics first concrete sense of Abu Khatalla, the Libyan militant accused by the U.S. government of being a ringleader of the fiery assault on Sept. 11, 2012. U.S. special forces captured him in Libya during a nighttime raid two weeks ago, and he was transported to the U.S. aboard a Navy ship, where he was interrogated by federal agents. He was flown by military helicopter to Washington. Prosecutors have yet to reveal details about their case, with a two-page indictment unsealed Saturday offering no new details. Abu Khattala pleaded not guilty to a single terrorism conspiracy charge punishable by up to life in prison, but the Justice Department expects to bring additional charges soon that may be more substantial and carry more dire penalties. A three-count criminal complaint filed last year and unsealed after his capture charged Abu Khattala with killing a person during an attack on a federal facility  a crime that carries the death penalty. The capture, a significant breakthrough in the investigation, immediately revived a debate on how to treat suspected terrorists from foreign countries: as criminal defendants with the protections of the U.S. legal system or as enemy combatants who should be interrogated for intelligence purposes and put through the military tribunal process at Guantanamo Bay, Cuba. If were doing to do this for everybody engaged in terrorism around the world, wed better start building prisons by the dozens, Rep. Mike Rogers, R-Mich. chairman of the House Intelligence Committee, said Sunday on CNNs State of the Union. He questioned the sheer expense, the manpower, the planning in preparing this criminal case. The Justice Department considers that discussion moot. Though a 2009 plan to prosecute avowed 9/11 mastermind Khalid Sheikh Mohammed and several alleged henchmen in New York was aborted because of political opposition, Holder has said successful terrorism cases in U.S. courts  most recently the March conviction in New York of Osama bin Ladens son-in-law  affirm the civilian justice systems capability of handling such defendants. Experts say the Justice Department would not have embarked on Abu Khattalas capture and prosecution if it didnt feel comfortable after the case. Even so, cases like these are never easy. Witnesses and evidence must be gathered from a hostile foreign country, and some of the evidence may be derived from classified information. Any trial that occurs would take place years after the attack, raising concerns of foggy memories. The case is being handled in Washington, where theres less established case law on terrorism prosecutions than in New York, which more regularly has handled this kind of case. And defense lawyers invariably will raise questions about Abu Khattalas handling, including his interrogation aboard the ship and the point at which he was advised of his Miranda rights. A U.S. official has said Abu Khatalla was read his Miranda rights at some point during the trip and continued talking. Rogers described him as compliant but not cooperative. Theres a whole host of challenges the government faces in this case, said David Laufman, a Washington attorney and former Justice Department national security lawyer. We dont have transparency into how they are grappling with them or how they have or overcome some or all of them. This will not be an easy case to present. No matter how the case proceeds, the political backdrop will be unavoidable. The rampage in Benghazi on the 11th anniversary of the Sept. 11 attacks has long been a politically divisive issue, fueled by dueling and bipartisan accusations. Republicans have criticized the response by Clinton, then the secretary of state, to the attacks. The GOP has accused the White House of misleading the American public and playing down a terrorist attack in the weeks before the 2012 presidential election. The White House has accused Republicans of politicizing the violence. Multiple investigations and the release of tens of thousands of pages of documents have done little to quell the dispute. Its not clear whether the court case will resolve those questions. But, said Laufman, the legal issues alone will make it fascinating to watch the case unfold.]", "Date": "20140630", "Title": "[Benghazi case unfolds against political backdrop]", "Link": "http://www.seattletimes.com/seattle-news/politics/benghazi-case-unfolds-against-political-backdrop-1/", "Author": "[ERIC TUCKER]"}