{"Content": "[WASHINGTON (AP)  The 11 million Americans who receive Social Security disability face steep benefit cuts next year, the government said Wednesday, handing lawmakers a fiscal and political crisis in the middle of a presidential campaign. The trustees who oversee Social Security and Medicare said the disability trust fund will run out of money in late 2016. That would trigger an automatic 19 percent cut in benefits, unless Congress acts. The average monthly benefit for disabled workers and their families is $1,017. The typical beneficiary would see a reduction of $193 a month. Todays report shows that we must seek meaningful, in some instances even urgent, changes to ensure the program is on stable ground for future generations, said Jo Ann Jenkins, the chief executive officer of AARP. In more bad news for beneficiaries, the trustees project there will be no cost-of-living increase in benefits at the end of the year. It would mark only the third year without an increase since automatic adjustments were adopted in 1975. Separately, about 7 million Medicare beneficiaries could face a monthly premium increase of at least $54 for outpatient coverage. That works out to an increase of more than 50 percent. The annual report card on the financial health of Social Security and Medicare shows that the federal governments largest benefit programs are feeling the strain of aging baby boomers as they both approach milestone anniversaries. Medicare turns 50 at the end of the month and Social Security turns 80 two weeks later. Together, the programs accounted for more than 40 percent of federal spending last year. There was some good news in the report: The trustees said Social Securitys retirement fund has enough money to pay full benefits until 2035, a year later than they predicted last year. At that point, Social Security will collect enough in payroll taxes to pay about 75 percent of benefits. Medicares giant hospital trust fund is projected to be exhausted in 2030, the same date as last years report. At that point, Medicare taxes would be enough to pay 86 percent of benefits. Advocates for seniors say that gives policymakers plenty of time to address both programs without cutting benefits. But some in Congress note that the longer lawmakers wait, the harder it gets to address the shortfall without making significant changes. There is an easy fix available for the disability program: Congress could shift tax revenue from Social Securitys much larger retirement fund, as it has done in the past. President Barack Obama supports the move. And acting Social Security Commissioner Carolyn Colvin said shifting the tax revenue would have no adverse effect on the solvency of the overall Social Security program. But Republicans say they want changes in the disability program to reduce fraud and to encourage disabled workers to re-enter the work force. Washington has continually kicked the can down the road, and now, as 11 million Americans face cuts to Social Security disability benefits they rely on, it is time for Congress to take action, said Sen. Rob Portman, R-Ohio. In January, Sen. Rand Paul, R-Ky. suggested that a lot of slackers are on disability. Paul, who is running for president, joked that half the people getting benefits are either anxious or their back hurts. The date that the disability fund will run dry is unchanged from last years report. But as the deadline gets closer, advocates say the need to act becomes more urgent. The president has proposed a commonsense solution to improve the solvency of this fund in the short run so that Americans who rely on it will continue to receive the benefits they need, Treasury Secretary Jacob Lew said. It is vital that Congress move forward to maintain the integrity of this critical program sooner rather than later. If the retirement and disability funds were combined, they would have enough money to pay full benefits until 2034, the trustees said. Lew noted that the life of the Medicare trust fund has been extended by 13 years since Congress passed Obamas health law. The fund is also benefiting from a slowdown in the rise of health care costs. The Medicare premium increases would affect Part B, which provides coverage for outpatient services. For about 70 percent of beneficiaries, premium increases cannot exceed the dollar amount of their Social Security cost-of-living adjustment, or COLA. Because no COLA is currently expected for next year, increased costs of outpatient coverage would have to be spread among the remaining 30 percent. That would result in an increase of about $54 in the base premium, bringing it to $159.30 a month. Those who would feel the impact include 2.8 million new beneficiaries, 1.6 million who pay the premium directly instead of having it deducted from their Social Security, and 3.1 million upper income beneficiaries, those making at least $85,000 for an individual and $170,000 for a married couple. The increases for upper-income beneficiaries would be higher, up to $174 for those in the highest bracket. Health and Human Services Secretary Sylvia M. Burwell said no final decision has been made. She said premium increases are expected to average under 5 percent a year over the long term. Nearly 60 million people receive Social Security benefits, including 42 million retired workers and dependents, 11 million disabled workers and 6 million survivors of deceased workers. About 55 million retirees and disabled people get Medicare. The hospital trust fund is only part of the program. Coverage for outpatient care and prescription drugs is covered by premiums and other government spending. ", "Date": "20150722", "Title": "[Report: Social Security disability fund to run dry next year]", "Link": "http://www.seattletimes.com/nation-world/report-social-security-disability-fund-could-dry-up-in-2016/", "Author": "[STEPHEN OHLEMACHER, RICARDO ALONSO-ZALDIVAR]"}