{"Content": "[Fast-food workers and their union allies plan to take the fight for a $15 minimum wage to Bellevue on Wednesday, the first attempt to expand the movement regionally since the Seattle City Council passed a $15 minimum-wage plan in June. While the prospects for a $15 minimum wage in Bellevue arent known, the city is generally considered more conservative and business-friendly than Seattle. And even in Seattle, supporters say the higher wage wasnt on local politicians radar when fast-food workers first went on strike in May 2013. We think history is moving in the direction of support for workers being able to support themselves and their families,  said Sage Wilson, spokesman for Working Washington, a union-backed organization planning Wednesdays march and rally. Seattle fast-food workers plan to march from a McDonalds on First Hill to a park overlooking Interstate 90, where they will be joined by supporters before marching across the I-90 bridge to Bellevue. The protesters plan to end the day with peaceful civil disobedience to call attention to the number of low-wage workers on the Eastside, Wilson said.  While the median household income in Bellevue is $88,000 a year, union leaders say thousands of workers in retail, fast-food and other service industries make less than $15 an hour and face the same high cost of living as in Seattle. Bellevue is not just a place of prosperity, its also a place of inequality, said Wilson,    noting that about 20 percent of children in the Bellevue School District qualify for free and reduced lunches and about one in six families lives below the federal poverty level. Bellevue leaders say raising the minimum wage hasnt been part of the political conversation there  at least not yet. And many of the political ingredients that led to passage of the Seattle measure arent present on the Eastside. No City Council members are up for election this year, so the issue hasnt come up on the campaign trail. There is no outspoken socialist demanding $15 now (Seattle Councilmember Kshama Sawant), and no mayor has vowed to make the wage a priority, as did Seattle Mayor Ed Murray when he was elected in November. Bellevue Mayor Claudia Balducci said that while her city hasnt taken up a local minimum-wage discussion, she thinks people will be receptive. I believe Bellevue residents will largely be understanding and sympathetic to the idea of fair pay and addressing income inequality. We have not yet had the discussion on what is the most effective way to address these systemic issues, she said.  Patrick Bannon, president of the Bellevue Downtown Association, said the minimum-wage issue hasnt appeared on the City Councils agenda and that business leaders havent been asked to help craft a plan, as they were in Seattle. When Murray was elected in Seattle, the $15 minimum wage seemed to be a foregone conclusion, Bannon said. The BDA hasnt taken it up. If it becomes a priority for members here, its up to our board to decide how or if we engage. The International Franchise Association, which is suing Seattle over the $15 minimum-wage plan, said the Bellevue move represented a union-organizing tactic and not a grass-roots workers effort. The majority of franchisees are not wealthy, theyre struggling just like other independent small businesses, said Matthew Haller, spokesman for the International Franchise Association. And the vast majority of workers in the fast-food industry are making more than minimum wage. Seattles wage ordinance requires franchise owners to reach the higher minimum wage on the same three- or four-year schedule as large businesses, regardless of the number of local employees. Small businesses have up to seven years to reach $15 an hour. The state minimum wage is $9.32 an hour. In its Seattle lawsuit, the franchise association accused SEIU Local 775 President David Rolf and his union of orchestrating the minimum-wage campaign to increase membership and union dues. In an email Tuesday, Rolf said global franchise brands make billions for their shareholders and millions for their CEOs. They do it by promoting a low-wage, part-time business model that impoverishes workers, and concentrates risk and debt on the franchisee  Instead of filing lawsuits, they should adopt a responsible business model that shares their prosperity with all of those who help create it. Nationally, observers of the fight for higher wages say that as cities take the lead, those efforts often spread to surrounding regions. Washington, D.C. and two neighboring counties, Montgomery and Prince Georges, enacted legislation at the same time to raise the minimum wage to $11.50 an hour by 2015, said Tsedeye Gebreselassie, senior staff attorney for the National Employment Law Project. She said Berkeley, Calif. just raised its minimum wage to hit $12.53 an hour by 2016 and Oakland residents will vote in November on a $12.25 minimum wage  both in response to San Franciscos $10.74-an-hour wage, which is also tied to inflation. Where cities have enacted higher minimum wages, it seeds the momentum to raise the minimum wage in surrounding areas, she said. Were now starting to see more regional strategies. Nicole Vallestero Keenan, policy director for Puget Sound Sage who served on Murrays Income Inequality Committee, said the push for a higher minimum wage can be polarizing, as it was in SeaTac. Business and labor spent more than $1 million   on a ballot measure last year to raise the minimum wage to $15 an hour for airport-area workers. But she said a citywide effort, such as the one being launched in Bellevue, can also bring together people in thinking about what a fair wage for the region should be. Lynn Thompson: lthompson@seattletimes.com or 206-464-8305. On Twitter @lthompsontimes]", "Date": "20140910", "Title": "[Bellevue latest target of push for $15 minimum wage]", "Link": "http://www.seattletimes.com/seattle-news/bellevue-latest-target-of-push-for-15-minimum-wage/", "Author": "[Lynn Thompson]"}