{"Content": "[Hillary Rodham Clintons initial primary-campaign spending total, $18.7 million, is a lot of money. And she is using it very differently from her rivals. While others spend their money to generate more fundraising, she has built a campaign organization with an eye toward the general election. Her campaigns burn rate, the amount spent divided by what is raised, was just a little less than 40 percent through June 30. Thats only a bit higher than the campaigns of Barack Obama and Mitt Romney at the same point four years ago, and close to the 38 percent burn rate of Obamas campaign in the first half of 2007. But comparing Clintons spending with those of her rivals is complicated, because she is running a different campaign. Most of the presidential candidates have emphasized spending money to raise more money, whether online or through direct mail, over other kinds of spending. Ted Cruz, a Republican, reported spending $835,798 on postage and an additional $678,730 on fundraising phone calls. Ben Carson, another Republican hopeful, spent $1.47 million on his digital efforts and $788,114 on printing and postage. Clinton isnt ignoring fundraising; she spent more than $2.5 million on direct marketing and additional amounts on events and catering. She has spent millions of dollars on staff, advertising and polling, establishing a much broader campaign than any other 2016 presidential candidate. Much of the money has gone toward mounting an effective operation in the early primary and caucus states, and for building the foundation for a broad general-election campaign should she become the Democratic nominee. Her $3.7 million in staff salary expenses (not including payroll taxes and service fees) is more than 10 times that of Cruz, who has the next-largest campaign in terms of staff payments. The 20 percent that Clinton spent on staff dwarfs that of all but the campaigns of Republican Mike Huckabee (21 percent) and Democrat Martin OMalley (20 percent). Clintons campaign employed 343 people, according to Federal Election Commission (FEC) data. The address of nearly all campaign workers listed in FEC records is the New York campaign headquarters, a tactic that Romney used. That makes it harder to tell exactly how much of a footprint the campaign has in say, Iowa, where it has paid $64,369 in rent. As of June 30, the Clinton campaign paid at least 58 field organizers, had spent more than $1 million on online advertising and paid a total of $370,000 to state parties in Iowa, New Hampshire, Nevada and South Carolina for voter data. On Friday, the Clinton campaign also said it had purchased $7.7 million worth of television airtime in early primary states, making its first ad buy of the 2016 election. The campaign said it has reserved time starting in early November through the first caucus and primary elections in early February, but it could broadcast the spots sooner if necessary. Jeb Bush, who spent slightly more than $3 million, devoted much of it to travel and other expenses related to testing the waters for his candidacy. He spent $372,647 on IT equipment and consulting services. The campaign of Bernie Sanders, the Vermont senator who is also seeking the Democratic nomination, put its largest investment into digital advertising and consulting, spending $1.3 million. Its payroll expenses were just $61,045, although Sanders campaign has not been operating as long as Clintons. Overall, the Sanders campaign spent 20 percent of the money it raised through June 30.]", "Date": "20150717", "Title": "[Clintons coffers going toward general election, not fundraising]", "Link": "http://www.seattletimes.com/nation-world/clintons-coffers-going-toward-general-election-not-fundraising/", "Author": "[Seattle Times staff]"}