{"Content": "[WASHINGTON (AP)  Hillary Rodham Clinton jumped back into presidential politics on Sunday, making a much-awaited announcement she will again seek the White House with a promise to serve as the champion of everyday Americans. Clinton opened her bid for the 2016 Democratic nomination by positioning herself as the heir to the diverse coalition of voters who elected her immediate predecessor and former campaign rival, President Barack Obama, as well as an appeal to those in her party still leery of her commitment to fighting income inequality. And unlike eight years ago, when she ran as a candidate with a deep resume in Washington, Clinton and her personal history werent the focus of the first message of her campaign. In the online video that kicked off her campaign, she made no mention of her time in the Senate and four years as secretary of state, or the prospect she could make history as the nations first female president. Instead, the video is collection of voters talking about their lives, their plans and aspirations for the future. Clinton doesnt appear until the very end. Im getting ready to do something, too. Im running for president, Clinton said. Americans have fought their way back from tough economic times, but the deck is still stacked in favor of those at the top. Every day Americans need a champion, and I want to be that champion, so you can do more than just get by. You can get ahead and stay ahead. Its a message that also made an immediate play to win over the support of liberals in her party for whom economic inequality has become a defining issue. They remain skeptical of Clintons close ties to Wall Street and the centrist economic policies of the administration of her husband, former President Bill Clinton. Many had hoped Clinton would face a challenge from Massachusetts Sen. Elizabeth Warren, who has said she will not run. It would do her well electorally to be firmly on the side of average working people who are working harder than ever and still not getting ahead, said economist Robert Reich, a former labor secretary during the Clinton administration who has known Hillary Clinton for nearly five decades. Unlike some of the Republicans who have entered the race, Clinton was scant on policy specifics on her first day as a candidate. Kentucky Sen. Rand Paul, for example, kicked off his campaign with a website and online videos that described his positions on an array of domestic and foreign policy issues. Clinton also began her campaign for president in 2007 with a video, followed by a splashy rally in Des Moines where she said, Im running for president, and Im in it to win it. This time around, Clinton will instead head this week to the first-to-vote Iowa, looking to connect with voters directly at a community college and small business roundtable in two small towns. When families are strong, America is strong. So Im hitting the road to earn your vote. Because its your time. And I hope youll join me on this journey, she said in the video. This voter-centric approach was picked with a purpose, her advisers said, to show that Clinton is not taking the nomination for granted. Her campaign said Sunday she would spend the next six to eight weeks in a ramp-up period, and she would not hold her first rally and deliver a campaign kickoff speech until May. Clinton is the first high-profile Democrat to get into the race, and she quickly won the endorsement of several leading members of her party, including her home state governor, New York Gov. Andrew Cuomo, and Virginia Sen. Tim Kaine. Still, there are some lesser-known Democrats who are considering challenging her, including former Maryland Gov. Martin OMalley and Vermont independent Sen. Bernie Sanders. During this campaign, it is imperative that Secretary Clinton, like every other candidate, address the great challenges of our time: the grotesque level of income and wealth inequality that is crushing our middle class, Sanders said. The GOP did not wait for her announcement to begin their campaign against her. The partys chairman, Reince Priebus, has outlined plans for a broad effort to try to undermine her record as secretary of state while arguing that her election would be like giving Obama a third term. Republicans have also jumped on Clintons use of a personal email account and server while she was secretary of state, as well as her handling of the 2012 terrorist attack in Benghazi, Libya. Former Florida Gov. Jeb Bush, in his own online video, said Sunday: We must do better than the Obama-Clinton foreign policy that has damaged relationships with our allies and emboldened our enemies. Should she win the Democratic nomination, Clinton will need to overcome history to win the White House. In the last half-century, the same party has held the White House for three consecutive terms only once, during the administrations of Republicans Ronald Reagan and George H.W. Bush. As part of her launch, Clinton also will leave the board of her familys foundation. The 2016 campaign is likely to be the most expensive in history, with total spending on both sides expected to well exceed the more than $1 billion spent by each of the two nominees campaigns four years ago. This weekend, Clinton campaign fundraisers escalated their outreach to Democratic donors, who largely back her bid, with a flurry of phone calls urging them to donate as soon as possible. Her team on Sunday encouraged donors to become Hillstarters by raising $27,000 for the campaign in the next 30 days. ", "Date": "20150412", "Title": "[Clinton kicks off 2016 campaign online, heads next to Iowa]", "Link": "http://www.seattletimes.com/nation-world/ap-sources-middle-class-economics-a-focus-of-clintons-bid/", "Author": "[KEN THOMAS, Lisa Lerer]"}