{"Content": "[Divided House Democrats are weighing whether to participate in a new investigation of the deadly attack in Benghazi, Libya, or boycott the election-year inquiry of a tragedy they accuse Republicans of politicizing. Party leaders will meet with rank-and-file members Friday to decide the next step after Republicans the day before rammed through a resolution creating a special select committee to examine the Sept. 11, 2012, assault. Four Americans, including U.S. Ambassador Chris Stevens, were killed when militants stormed the diplomatic outpost. The vote Thursday to create the special committee was 232-186. Seven Democrats, many of whom face tough re-elections in November, broke ranks and joined the GOP majority. The panels investigation will be the eighth on Benghazi and means high-profile hearings in the months leading up to the elections, with Republicans grilling current and former Obama administration officials. Certain to be called to testify is former Secretary of State Hillary Rodham Clinton, the Democrats potential 2016 presidential candidate. Democrats are split over whether to boycott the select committee, which will have a 7-5 Republican edge in membership. They are concerned that their participation would grant legitimacy to what they believe will be a partisan forum. But they also worry that if they avoid it they wont have the chance to counter GOP claims and defend potential witnesses. This doesnt need to be, shouldnt be and will not be a partisan process, House Speaker John Boehner, R-Ohio, said in a speech on the House floor promising pursuit of the truth. Democrats have their doubts, Its hard to trust what Speaker Boehner is doing with this new select committee, Rep. Xavier Becerra, D-Calif. chairman of the House Democratic Caucus, said in a statement after the vote. He pointed to Boehners comments a month ago that a special panel was unnecessary. After the vote, Minority Leader Nancy Pelosi, D-Calif. was noncommittal about whether Democrats would participate on the special committee, but assailed the new probe. Our nation deserves better than yet another deeply partisan and political review, she said. Boehners legislation creates the special committee through the end of the year. It will have to be reapproved when a new Congress begins in January or go out of existence. The select committee has no explicit financial constraints. The speaker was expected to announce the Republican members on Friday. House Democrats have issued several demands if they are to participate in the select committee. Rebuffed on their request for an equal split in membership, Democrats are seeking guarantees theyll have equal access to documents, say on subpoenas and the right to question witnesses. In the 20 months since the attack, multiple independent, bipartisan and GOP-led probes already have faulted the State Department for inadequate security at the outpost, leading to four demotions. No attacker has yet been brought to justice. Republicans say theyre unsatisfied with explanations so far, and they have leveled a range of accusations against President Barack Obama, Clinton and other senior administration officials. Chief among them is that the administration misled the American people about the nature of the attack during a presidential election campaign and stonewalled congressional investigators. Rep. Ileana Ros-Lehtinen, R-Fla. criticized the song and dance she said came from Clinton when House members wanted to question her about Benghazi a few months after the attack. Clintons testimony before the House Foreign Affairs Committee was delayed when she missed a month of work toward the end of her tenure after suffering a virus, then a fall and a concussion, and then brief hospitalization for a blood clot near her brain. Benghazi has produced 13 public hearings, the release of 25,000 pages of documents and 50 separate briefings. The select committee wont be the only inquiry, as other GOP-led congressional panels continue their investigations, including a House Oversight probe which just last week took the extraordinary step of subpoenaing a Cabinet member, Secretary of State John Kerry. Kerry hasnt said when he might testify. Democrats deride the effort as a conservative campaign designed to energize Republican voters in typically low-turnout midterm elections. Rep. Gerry Connolly, D-Va. accused Republicans of perpetuating myths and conspiracies and remaining obsessed with recycling tired and worn talking points in a cynical attempt to fire up the GOP base in the run-up to an election year. Earlier this week, the National Republican Congressional Committee sent an email vowing that no one will get away from the committees investigation and asking people for donations. Rep. Trey Gowdy, R-S.C. the former prosecutor tapped by Boehner to head the panel, has signaled he would re-examine the entirety of the Benghazi attack, including questions Democrats and some senior Republicans consider settled. Some Democrats dismiss the notion that the public will pay attention. I think the American people are not interested in Benghazi, said Sen. Chuck Schumer, D-N.Y. It appeals to the narrow base of the Republican Party. ", "Date": "20140509", "Title": "[House Democrats weigh role in new Benghazi probe]", "Link": "http://www.seattletimes.com/seattle-news/politics/house-democrats-weigh-role-in-new-benghazi-probe/", "Author": "[DONNA CASSATA]"}