{"Content": "[WASHINGTON (AP)  Hillary Rodham Clinton plans to more fully address questions about her use of a private email server as secretary of state starting this month, part of an acknowledgment by her campaign that her presidential bid has been hurt by the heavy focus on the controversy over the summer. Weve had some headwinds particularly around the email question, said Clinton campaign chairman John Podesta. Theres been a lot of noise thats made it more difficult to break through. On Friday, Clinton will sit down for an interview with MSNBC  the third national television interview of her four-month presidential campaign. The appearance will be the first in a series of media appearances that campaign staff say Clinton will participate in this fall, before her Oct. 22 public testimony to a congressional committee investigating the deadly 2012 terrorist attack in Benghazi, Libya. This week, members of the House panel are questioning Cheryl Mills, Clintons former chief of staff, and Jake Sullivan, another former top aide who now works on Clintons presidential campaign, behind closed doors. Clinton aides see the hearing as an opportunity to address questions about her email set-up, arguing that it gives the former New York senator a congressional platform to shame her Republican critics for what they view as a little more than a political witch-hunt. Clinton, the Democratic front-runner for the 2016 nomination, has struggled to explain her use of a private email server for government business during her tenure as secretary of state. We know that we have good answers on these questions that people have, and were going to make sure people hear from her, said Clinton campaign communications director Jen Palmieri. Still, aides say, Clinton remains the strongest candidate in the presidential contest, arguing the race is fundamentally unchanged from earlier this summer. We feel confident that were on a path to victory in both the primary and the general election, Podesta said. Clintons fall agenda also includes a heavier focus on foreign policy starting on Wednesday, when shes scheduled to deliver an address about the nuclear deal with Iran. Her campaign said on Thursday that theyve opened 27 offices, signed up 23,000 volunteers and contacted 1.35 million households in the four early primary states. Aides said they expect a particularly tight primary race in New Hampshire, where Vermont Sen. Bernie Sanders has gained traction in recent polling.]", "Date": "20150903", "Title": "[Clinton aides says 2016 bid hurt by email controversy]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/clinton-aides-says-2016-bid-hurt-by-email-controversy/", "Author": "[Lisa Lerer]"}