{"Content": "[In the 1960s, economics student Dilma Rousseff joined her first militant group opposing the military dictatorship in Brazil. In 1970, she was captured, tortured and tossed in prison for nearly three years. Jos Serra also was active in student politics, leading the left-leaning National Student Union and attracting the interest of the military. Just before the 1964 military coup, he fled the country. These former militants, who entered mainstream politics decades ago, are the front-runners in Brazils presidential election Sunday. Expected to finish a distant third in a nine-candidate field is Green Party candidate Marina Silva. While the leading candidates political histories might give U.S. voters pause, its mostly a nonissue for Brazilians. Thats the past. I dont criticize.  Those who are to be criticized are the military leaders who took power without a mandate, said Paulo Sotero, director of the Brazil Institute at the Woodrow Wilson Center in Washington, D.C. Rousseff, 62, and Serra, 68, the former governor of So Paulo, share other similarities: Both come from first-generation immigrant families, studied economics, are skilled administrators and have spent years in public service. There is one big difference: Rousseff is the hand-picked candidate of President Luiz Incio Lula da Silva, who is riding a vast wave of popularity in this ascendant country of 201 million. Lula, who cant seek re-election after serving two consecutive terms but could run again in four years, has presided over economic growth, when 24 million Brazilians moved out of poverty and the middle class grew to 103 million. Despite twinges of new scandal in his administration, so long are Lulas coattails that some analysts expect Rousseff, the presidents former chief of staff, to win the election outright without having to go to a second round Oct. 31. Brazils new president will take over Jan. 1. A victory by Rousseff would make her the first woman president of Latin Americas largest country, a major U.S. trading partner. A Datafolha poll released Thursday showed Rousseffs lead had slipped a few points from its peak to 52 percent  compared with Serras 31 percent  but that would still give her the percentage of valid votes she needs to escape a second round, which analysts say she would win handily. Accusations that Lulas chief of staff, Erenice Guerra, also a former aide to Rousseff, was involved in a kickback scheme prompted Guerra to resign and may be having an impact on Rousseffs lead. Rousseff, who represents the coalition Para o Brasil seguir mudando (So that Brazil Keeps on Changing) headed by Lulas Workers Party, has positioned herself as the candidate best able to continue his market-friendly policies. Indeed, many analysts say what Brazilians want is more of the same: brisk economic growth along with more equitable income distribution. Brazil also has discovered huge deep-water oil reserves and will host the 2014 World Cup and 2016 Olympic Games, events that are starting to spur an array of public-works projects. Brazil is on a roll for the next four or five years, and its very difficult to see anything that would derail that prospect, said Paulo Vieira da Cunha, a partner in New York-based Tandem Global Partners and the former deputy governor of the Central Bank of Brazil. During the campaign, Serra, from the coalition O Brasil pode mais (Brazil Can Do More) thats headed by his Brazilian Social Democracy Party, has tried to portray himself as the heir to Lulas policies without much success. There is a clear feeling among the population that (Rousseff) is prepared to continue Lulas work, said Jeanine Pires, former head of Embratur, the government tourism-promotion agency, and now director of Brasil 2016. She knows the countrys problems well and what it takes to solve them. Shes very intelligent, a strong woman and very prepared as an executive. Unlike Serra, Rousseff has never held elective office. Her political past, however, has provided an intriguing back story to the campaign. Lula has said, What I most admire in Dilma is the story of her life. Born to a Bulgarian immigrant father and a Brazilian teacher in the state of Minas Gerais, Rousseff had a comfortable childhood, went to private school, belonged to the Minas Tennis Club and mingled with the elite of Belo Horizonte. Her teenage years were a time of political foment in Brazil and she joined her first clandestine group as a 16-year-old. As the government took a turn to the left, the military seized power in 1964 and thus began an era when students were forbidden to organize and removed from universities because of their political activities; the media, literature and the arts were censured; the constitution was suspended; and opponents were stripped of their civil rights, jailed and tortured. As a member of the Revolutionary Armed Vanguard Palmares, Rousseff and her former husband, fellow militant Claudio Galena, moved frequently from house to house as a police crackdown intensified, according to the biography on her campaign website. Bank robberies and thefts to bankroll weapons purchases were standard operating procedure for many of the guerrilla groups of the time. How central a role Rousseff played in the armed resistance is a topic of debate. In complaints she filed after her release, she said she was beaten, punched and subjected to electric shocks while imprisoned. After her 1973 release, she moved to Porto Alegre, where she resumed her studies and began working in state government. The military dictatorship ended in 1979, and Rousseff and Serra  who stayed abroad for 14 years  took advantage of a 1979 amnesty law to return to political life. Rousseff, a lymphatic-cancer survivor, is described as tough, smart and hyperfocused by those who know her. Shes also famous for being short-fused, no-nonsense and very direct, Sotero said.]", "Date": "20101002", "Title": "[Former student radicals poised to lead Brazil]", "Link": "http://www.seattletimes.com/nation-world/former-student-radicals-poised-to-lead-brazil/", "Author": "[Mimi Whitefield]"}