{"Content": "[WASHINGTON (AP)  Democrats closed ranks around Hillary Rodham Clinton on Wednesday after her public explanation of her email practices  yet party officials in important election states appeared resigned to the prospect that her all-but-certain presidential campaign will be saddled with drama and controversy. The mood among Democrats around the country suggested Clinton has work to do to bolster party enthusiasm as she nears the launch of her 2016 campaign, though theres still no sign shell face a robust primary challenge. Brady Quirk-Garvan, the Democratic Party chairman in Charleston, South Carolina, said the intense focus on Clintons use of her private email account as secretary of state leaves him concerned that side issues could overshadow the partys message. Every time we talk about emails, we arent talking about how to grow the economy and the fact that President Obama has created jobs for the last 60 months straight, Quirk-Garvan said. In Iowa, Cerro Gordo County Democratic chairman John Stone said he expected the email issue to burn out. But he also raised the possibility that there will be more things to come. Clintons closest advisers have been quietly reaching out to Democratic leaders and other lawmakers on Capitol Hill, as well as influential progressive groups, in an effort to allay concerns. In conference calls over the past week, supporters in turn pressed Clinton to break her silence on the email disclosures, which she eventually did Tuesday in a 20-minute news at the United Nations. Those of us who strongly support her, we certainly have been given information, said Sen. Debbie Stabenow, D-Mich. Im satisfied with what Ive received. Much of the outreach has been led by longtime Clinton aide Huma Abedin and press secretary Nick Merrill. Clinton herself does not appear to have spoken directly to top Democratic lawmakers or surrogates since her use of personal email and a private server as secretary of state was reported last week. Two Democratic leadership aides and others familiar with the Clinton teams outreach described the efforts, insisting on anonymity to describe the private communications. White House spokesman Josh Earnest said he wasnt aware of any conversations between President Barack Obama and Clinton about the former secretary of states email use. Even as Clintons advisers do status checks with wary Democrats, her team has been moving forward with plans to formally announce her candidacy next month, perhaps in a swing state or on a college campus. Newly hired staff members are moving to New York, where the campaign will be headquartered. The skeleton team that has been traveling with Clinton for the past year has also been expanding, with Kristina Schake, a former communications director for first lady Michelle Obama, seen accompanying Clinton to an event in Washington last week. Still, the email issue has essentially served as the Clinton campaigns opening act, thrusting her squarely onto the political playing field she has been trying to avoid. Its also provided fresh fodder for congressional Republicans who want to keep their investigations into the 2012 attacks in Benghazi, Libya, alive through the presidential campaign. Rep. Trey Gowdy, the South Carolina Republican who chairs a House committee investigating the attacks, said Wednesday that he wants an independent review of Clintons email server. The House Oversight Committee also said it will seek access to the electronic versions of Clintons emails, not just printed copies, and was prepared to issue a subpoena if necessary. However, in a sign that the matter isnt shaking up the Democratic primary field, Clinton has faced no public criticism from any of the candidates who seem most likely to challenge her. Former Maryland Gov. Martin OMalley again passed up an opportunity to weigh in Wednesday. In fact, the party has spent little time cultivating other potential candidates should her bid for the White House implode. Still, Democratic Sen. Jeanne Shaheen of swing state New Hampshire was restrained in her defense of Clinton Wednesday, saying it remains to be seen how the email matter will affect her state. Clinton described her exclusive use of personal email as secretary of state as a matter of convenience and a way to avoid using two devices. She insists she did not violate federal rules requiring government officials to preserve written communications involving official business and says she turned over more than 30,000 work-related emails to the State Department last year, at the agencys request. That email trove represents half of the communications housed on a personal server, Clinton said. She said that because the rest of the emails were personal in nature, she got rid of them during the process of compiling files for the State Department. The agencys internal watchdog released a report Wednesday showing many department employees have not been preserving emails for the public record. The inspector generals office said that in 2011, when Clinton was secretary of state, department employees wrote more than 1 billion emails but marked only 61,156 for the public record. Also Wednesday, The Associated Press filed a lawsuit against the State Department in an effort to force the release of email correspondence and government documents from her tenure as secretary of state. The lawsuit follows Freedom of Information Act requests that went unfulfilled. ", "Date": "20150311", "Title": "[Democrats stand by Clinton, but with some reservations]", "Link": "http://www.seattletimes.com/seattle-news/politics/questions-swirl-over-clinton-emails-as-she-prepares-for-2016/", "Author": "[JULIE PACE, KEN THOMAS]"}