{"Content": "[WASHINGTON (AP)  A partial agency shutdown looming, Senate Republicans offered Tuesday to permit a vote on Homeland Security funding legislation stripped of immigration provisions backed by conservatives but strongly opposed by President Barack Obama and fellow Democrats. We could have that vote very quickly, Majority Leader Mitch McConnell, R-Ky. said as his party struggled to escape a political predicament of their own making involving an agency with major anti-terrorism responsibilities. McConnell said he did not know how the Republican-controlled House would respond if a stand-alone spending bill passed the Senate. Underscoring the realities of divided government, Senate Democratic leader Harry Reid of Nevada initially said he wouldnt agree to the proposal unless it had the backing of House Speaker John Boehner, in a sign it would be likely to clear the House. With House Republicans scheduled to meet privately Wednesday to discuss the issue, Boehners office issued a statement that neither accepted nor rejected the proposal McConnell outlined to end weeks of gridlock. The speaker has been clear: The House has acted, and now Senate Democrats need to stop hiding. Will they continue to block funding for the Department of Homeland Security or not? said Boehner spokesman Michael Steel. Some House conservatives criticized the proposal, but one lawmaker allied with the leadership predicted it might win approval. Noting that a federal judge in Texas has issued an order blocking implementation of Obamas plan to shield millions of immigrants from deportation, Rep. Tom Cole of Oklahoma said the court had effectively stopped the presidents executive action, at least for now. So I dont think wed run the risk of shutting down Homeland Security, he added. Even in the Senate, though, McConnells plan had its GOP critics. Texas Sen. Ted Cruz, a tea party favorite and potential 2016 presidential contender, called it a mistake. Congress is obliged to use every constitutional check and balance we have to rein in President Obamas lawlessness, he said in a statement. Senate Republican officials said McConnells offer of a vote on a stand-alone funding bill also envisions a vote on a separate measure to repeal a directive from Obama last fall that shields about 4 million immigrants from deportation even though they live in the United States illegally. That measure would almost certainly fail in the Senate at the hands of Democrats. At the same time, the proposal would eliminate an attempt by the House to repeal an earlier presidential order that allows tens of thousands of immigrants to remain in the country if they were brought here illegally as youngsters by their parents. Officials said Boehners office had been informed of McConnells plans before they were made public. The maneuvering occurred as the presidents party raised the specter of terrorism and the Republicans countered that it was the Democrats who were preventing an orderly renewal of funding for the Homeland Security Department. At a news conference a few hours before McConnell spoke, Sen. Amy Klobuchar, D-Minn. urged Republicans to fund our security and not to send a message to al-Shabab that were going to shut down Homeland Security. Klobuchars state is home to the Mall of America, an enormous facility that was singled out as a potential terror target in a video released by al-Shabab, an Islamic militant group linked to the al-Qaida terrorist network. Homeland Security Secretary Jeh Johnson has urged anyone considering a trip to the shopping mall to be particularly careful. For their part, Republicans sought to pin the blame on Democrats, pointing out they blocked Senate action four times on the combined funding-immigration bill. They also accused Reid of shifting his demands after first seeking a vote on a stand-alone spending bill, then refraining from accepting McConnells offer. In response, Democrats seemed to backtrack, suggesting they may well sign on to McConnells offer whether or not Boehner does. But even Republicans said privately that they needed to put an end to a controversy that was likely to turn out badly for them. The current stand-off dates to last fall, when Boehner told fellow Republicans they should allow the funding of Homeland Security without conditions until after the elections. By then, he said, Republicans would have more leverage to force a rollback in the presidents immigration policy. Republicans won control of the Senate, but they lack the 60 votes needed to overcome Democratic blocking actions. As a result, they have been unable to force a vote on House-passed DHS funding legislation that includes the repeal of the immigration policies Obama put into effect in 2012 and last fall. Among some Republicans, there was recognition that McConnell was offering as graceful a way out as possible. I just dont know how we do it any other way, said Sen. Lindsey Graham, R-S.C. ", "Date": "20150224", "Title": "[In a bind, Republicans offer vote on Homeland Security bill]", "Link": "http://www.seattletimes.com/business/gop-struggles-for-way-out-as-homeland-shutdown-looms-2/", "Author": "[DAVID ESPO, ERICA WERNER]"}