{"Content": "[The Port of Seattle has been busy this past year: the Seaport Alliance was first announced in October; labor negotiations between the International Longshore and Warehouse Union and its employers hit a snag during a prime shipping season for Washington agriculture, and in January the Port announced Terminal 5 would be the new home port for Shells Arctic drilling fleet. Going into election season, two of the five seats for the Port of Seattle Commission are on this years ballot, and the recent attention on the Port has helped attract a dozen candidates. The Port of Seattle, which is governed by the commissioners, operates one of the states busiest seaports, plus Seattle-Tacoma International Airport, two cruise terminals, marinas and Fishermens Terminal, which is the headquarters of the North Pacific fishing fleet. As part of its primary mission, the Port serves as an economic development agency, generating family-wage jobs and economic growth in King County. While Courtney Gregoire is running for re-election for Position 2, Bill Bryant, who has held Position 5 for the past eight years, is running for governor, a 2016 race. Bryants open Port seat has drawn nine candidates for the Aug. 4 primary. The two to receive the most votes will advance to the November general election. Leading the Position 5 race in money raised is Darrell Bryan. He is well known in the maritime industry as the former president and CEO of Clipper Navigations, which operates the Victoria Clipper. He has pulled in more than $76,000 as of Friday, much of which came from the maritime community, including the CEOs of Vigor Industrial and Foss Maritime  as well as other Foss and Saltchuk employees, according to the state Public Disclosure Commission. Ken Rogers, a longtime pilot, labor leader and board member for Delta Air Lines, has raised about $46,500, almost half of which came directly from Delta leadership, pilots and people with ties to the company. With the Port finalizing plans for Sea-Tacs new international arrivals facility, Delta and Alaska Airlines have been butting heads over using passenger fees to fund the new international facility. Not surprisingly, Alaska Airlines has not named Rogers as a candidate worthy of consideration; instead, the Seattle-based company gave that rating to Bryan and Herb Krohn. As a railroad conductor and rail-union leader, Krohn has support from much of the labor community and has raised about $17,000 for the race. As a self-described pro-business labor leader, he told The Seattle Times Editorial Board he would have supported the Foss Maritime lease to host Shells Arctic oil-drilling fleet at Terminal 5 had he been in the position. Fred Felleman, a marine environmental consultant, and Marion Yoshino, former City Council member for Normandy Park and economic development manager for Des Moines, have both been critical of the lack of transparency behind that lease agreement. Felleman has raised about $29,000 and received the endorsement of The Stranger because he is the only candidate with good, specific ideas on how to clean up port pollution, as well as from Seattle City Councilmember Mike OBrien. Yoshino and Norman Sigler, a diversity recruiter who has worked in financial planning and analysis for multiple airlines, have each raised about $9,000. Other candidates running for Position 5 include Mark Hennon, an author and computer consultant; Daniel Reandeau, who is retired but says he has more than 32 years in the manufacturing industry, and Richard Pope, an attorney who took on commissioner Tom Albro in 2013 and who has run a dozen other times for various offices. As of Friday, these candidates had not raised any funds, according to the state Public Disclosure Commission. Gregoire, who joined the Port Commission in 2013, is running against perennial candidate Goodspaceguy and John Naubert, a socialist candidate who also ran in 2013 and 2011. Gregoire has raised almost $55,000; her two competitors, as of Friday, had not raised any.]", "Date": "20150724", "Title": "[Port of Seattles open seat draws 9 primary candidates]", "Link": "http://www.seattletimes.com/seattle-news/politics/port-of-seattles-open-seat-draws-9-primary-candidates/", "Author": "[Coral Garnick]"}