{"Content": "[MINNEAPOLIS (AP)  In ways both subtle and blunt, Hillary Rodham Clintons campaign is sending a message to Vice President Joe Biden about his potential presidential campaign: This wont be easy. While Clinton and her team speak warmly of Biden in public, they have taken steps to make clear how theyve taken control of the partys establishment in hopes of discouraging the vice president from entering the race. The latest came Friday in the most public of settings: the Democratic National Committee summer meetings. In a speech to the partys most committed activists, Clinton cast herself as its standard-bearer and vowed to win the presidential race and rebuild the party from the ground up. We are building something that will last long after next November, Clinton told party officials gathered in a Minneapolis ballroom. Other candidates may be fighting for a particular ideology, but Im fighting for you and your families. The speech came after her team rolled out a string of high-profile endorsements in early-voting states and scheduled an onslaught of fundraisers across the country in the effort to ice a Biden bid before he even gets started. Behind the scenes, theyre pressuring donors and delegates to pledge their loyalty to Clinton. Her team sent a slate of top aides to the meeting this weekend armed with pledge cards asking party delegates to commit to Clinton. Donors who have publicly expressed support for a Biden run have later been contacted by the Clinton team, according to fundraisers and Democratic strategists who spoke on condition of anonymity because they were not authorized to discuss the private conversations. Even Clinton herself has made a few calls, they said, to express her disappointment in the defector. Clinton said the over-arching strategy was based on the lessons she learned from her last run, attributing her 2008 primary loss to a failure to capture enough backing from the partys important super delegates  the party and elected officials who are empowered to select the presidential nominee at the Democratic national convention, regardless of what happens in the 2016 primaries. We are working really hard to lock in as many supporters as possible, Clinton told reporters on Friday. This is really about how you put the numbers together to secure the nomination. Clintons chief rival, Vermont Sen. Bernie Sanders, predicted at the DNC meeting that top leaders would eventually migrate to his campaign. Lets see where we are in three months, Sanders told reporters. Clintons campaign has taken steps in South Carolina, where Biden has deep ties, to showcase her clout. She recently picked up the endorsements of two former governors, Jim Hodges and Dick Riley, the latter who served as education secretary during Bill Clintons administration. During a trip to the Iowa State Fair earlier this month, former Iowa Sen. Tom Harkin joined Clinton and endorsed her campaign. When she returned to Iowa this week, she was joined by Agriculture Secretary Tom Vilsack, a former Iowa governor who wrote in an op-ed in the Gazette of Cedar Rapids that he intended to caucus for her, plain and simple. Clintons fundraising apparatus has extensive overlap with Bidens, causing some awkwardness among their donors. I plan on supporting Secretary Clinton. She is the announced candidate, said George Tsunis, a Long Island, New York, businessman and a top donor to Obama and Bidens 2012 re-election campaign. If the vice president were to announce his candidacy and run, I would be supporting the vice president. Clintons campaign, however, is not leaving an opening in fundraising, lining up about three-dozen events in September after the Labor Day holiday. Some of the fundraising receptions will be hosted by leading donors to Obama and Bidens campaigns. In Chicago, Clinton is scheduled to attend fundraisers on Sept. 17 hosted by two longtime Obama supporters, attorney Joseph Power and businessman Michael Polsky. While her husband presides over the annual Clinton Global Initiative meeting in New York in late September, Clinton will raise money at seven fundraisers planned in Los Angeles and San Francisco. Following her West Coast swing, Clinton may attend a fundraiser in Nashville with country music stars Faith Hill and Tim McGraw, but her campaign said late Friday that the event was not yet confirmed. Those advocating for a Biden run say theyll be able to build a vibrant primary organization and have already solicited commitments from a number of Clinton backers who say they are ready to switch sides. They dont want to put their neck out unless they know Biden is in this, said Jon Cooper, finance chairman of the Draft Biden super PAC and a top Obama fundraiser. But I have no doubt hell be able to put together a national fundraising infrastructure in place overnight. He estimated the PAC would raise as much as $3 million over the next few weeks. ", "Date": "20150828", "Title": "[Before nations top Democrats, Clinton sends Biden a message]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/before-nations-top-democrats-clinton-sends-biden-a-message/", "Author": "[KEN THOMAS, Lisa Lerer]"}