{"Content": "[ST. LOUIS (AP)  A growing divide has emerged in the Republican Partys unruly presidential contest, as the race bid farewell to a once-powerful White House contender. On one side stands billionaire businessman Donald Trump and his allies, on the other are those who oppose him. A day after Rick Perry, Texas longest-serving governor, ended his second Republican presidential run with a whimper, Trump marked the shake-up by embracing his role as his partys 2016 bully on Saturday. Mr. Perry, hes gone. Good luck. He was very nasty to me, Trump told Iowa voters. Turning to rival Ben Carson, he questioned whether the retired neurosurgeon had the energy to negotiate successfully with world leaders. In an interview earlier, Trump touted his tough-talking style as a plus. Rick Perry first to exit 2016 Republican presidential race, Schwarzenegger takes over for Trump on Apprentice, Its an attitude that our country needs. We get pushed around by everybody, he told Fox News, adding, We have to push back. Perry had all but declared war on the billionaire businessman in July, calling Trump a cancer on conservatism who could destroy the Republican Party. On Saturday, Trumps campaign was soaring while Perrys White House ambitions were dead. And with the real estate mogul suffocating the rest of the packed field, its likely a matter of time before he helps push another GOP candidate out of the race. Perry was a leading voice in the anti-Trump movement, a group that has suffered in the polls as Trumps public allies largely avoid backlash from the anti-insider wave that made Trump the unlikeliest of Republican presidential front-runners. There is no play in the playbook for where we are right now, said John Jordan, a California winery owner and major Republican fundraiser. Donors dont know what to think. Nobody saw the Trump phenomenon coming. In still-early polls, the real-estate mogul and reality TV star has more support that the once-top-tier trio of former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker and Florida Sen. Marco Rubio combined. In second, by the way, is another political rookie: Carson, who repeatedly refused to criticize Trump in recent days. Bush has gone the other way in recent weeks, jabbing the businessman repeatedly on the campaign trail and through social media. He was at it again Saturday while meeting with supporters in Miami. Mr. Trump says that I cant speak Spanish, Bush told the crowd in Spanish. Pobrecito (poor guy). Walker, another Trump critic, has also struggled recently, particularly in Iowa, where he was considered a front-runner for much of the year. The Wisconsin governor canceled upcoming appearances in California and Michigan to focus instead on the critical early voting Iowa and South Carolina. Nothing changed for us aside from some scheduling, Walker spokeswoman Kirsten Kukowski said, dismissing any suggestion the campaign was concerned. On the other end of the spectrum, Texas Sen. Ted Cruz, perhaps Trumps biggest ally, declined to address the Trump effect on Perrys exit on Saturday. I recognize that the media enjoys seeing Republicans bicker back and forth with each other and throw rocks at each other. But I think the American people could not care less, Cruz told reporters after addressing the same gathering of social conservatives in St. Louis that Perry shocked the night before with his announcement. A tea party favorite, Cruz has declined to seize on Trumps positions that would normally trigger conservative ire. Trump favors tax increases on the rich, once supported abortion rights, gave money to Hillary Rodham Clinton and said kind things about government-run health care in other countries. Someone has to bring him down.  Im not going to sit quietly by and let the disaster that is Donald Trump become the nominee, Kentucky Sen. Rand Paul told The Associated Press. Do you want someone who appears to still be in grade school to be in charge of the nuclear arsenal?, Meanwhile, Perrys allies at three well-funded super PACs found they couldnt share the money theyve raised or coordinate their activities with his campaign. Austin Barbour, a leader of the pro-Perry super PACs, said the groups have as much as $13 million in the bank. He planned to talk with lawyers to see what the law says we can do with this money. Perrys Republican rivals praised him publicly and privately  and began courting his political network. Cruz on Saturday said Perry did a remarkable job as governor and praised him for running an honorable campaign. A person close to the Cruz campaign, who was not authorized to speak publicly and requested anonymity, says the fellow Texans camp will be immediately reaching out to Perry donors and supporters. If we dont jump in, other campaigns are going to try to, the person said. ", "Date": "20150912", "Title": "[Trump embraces role as bully, bids Perry a thorny farewell]", "Link": "http://www.seattletimes.com/nation-world/trump-embraces-role-as-bully-bids-perry-a-thorny-farewell/", "Author": "[STEVE PEOPLES]"}