{"Content": "[WASHINGTON (AP)  To some Republican presidential candidates, its better to be with the popular pope than against him. Marco Rubio, Rand Paul and Ted Cruz have deep policy differences with Pope Francis, but the senators will break off campaign travel to attend his address to Congress later this month, a centerpiece of his eagerly anticipated visit to the United States. Former Florida Gov. Jeb Bush, a devout Catholic, will attend Mass with Francis in Washington. New Jersey Gov. Chris Christie, another Catholic candidate, plans to attend one of the popes East Coast events. Regardless of what the pope says or emphasizes, the simple fact of being associated with his visit is still significant for a candidate, said David Campbell, a professor at the University of Notre Dame who studies religion and politics. The images are very powerful. Francis has become one of the worlds most popular figures since his 2013 election to the papacy, drawing praise for his humility and efforts to refocus the church on the poor and needy. He also has become involved in numerous hot-button political issues, often staking out positions that put him at odds with Republicans. The pope supports the Iran nuclear deal, which many GOP candidates pledge to tear up if they are elected president. As Republicans debate the place of immigrants in the U.S. the pope has urged countries to welcome those seeking refuge and has decried the inhuman conditions facing people crossing the U.S.-Mexico border. Francis was also instrumental in secret talks to restore diplomatic relations between the U.S. and Cuba, a rapprochement the GOP views as a premature reward for the islands repressive government. In a heated primary where any break from party orthodoxy is a political risk, Republican candidates have stepped gingerly around their differences with Francis. When Francis issued an encyclical this year calling for aggressive international action to combat climate change, most Republicans made clear they had no problem with pope taking a position on the matter. But they suggested his stance would have little influence on their own views. He is a moral authority and as a moral authority is reminding us of our obligation to be good caretakers of the planet, Rubio, a practicing Catholic, said at the time. Im a political leader and my job as a policymaker is to act in the common good. Bush, who was raised Episcopalian and converted to Catholicism as an adult, said it was best to leave climate change in the realm of politics, not religion. During a campaign stop Thursday in New Hampshire, Bush called the pope an amazing man and welcomed his emphasis on mercy and compassion. I think hes going to lift peoples spirits up, Bush said of the popes visit to the U.S. Were in a time where theres a lot of vulgarity and a lot of insults and a lot of just coarseness in our discourse. Im not talking about politics, either. Im talking about everyday life. And heres a man who comes with a gentle soul, and I think it might be really healthy for our country to hear someone speak the way he does. Not all GOP candidates plan to attend events with the pope. Among them are Wisconsin Gov. Scott Walker, whose spokeswoman said he didnt expect to be in Washington during Francis visit, and Rick Santorum, the former Pennsylvania senator and devout Catholic, who was scheduled to be on a campaign trip to Iowa. American politicians have long struggled with how to balance their policy positions with the views of the Vatican. For Democrats, the focus has often been on the gulf between the partys support for abortion rights and the churchs stern and contrary view. After John Kerry, a Catholic who backs abortion rights, captured the Democratic nomination in 2004, a top Vatican official issued a statement saying priests must deny Communion to politicians who hold that position. Francis has taken a more conciliatory tone on abortion, as well as homosexuality, but hasnt changed church doctrine. President George W. Bush found himself at odds with the Vatican over the Iraq war. Both Pope John Paul II and his successor Benedict XVI vehemently opposed the war, yet each met Bush during their tenure. Charles Camosy, a theology professor at Fordham University, said that in interactions between politicians and popes, politics is put aside and theres respect shown. Still, the timing of the popes visit  in the heart of fall primary campaigning  and his own schedule will make politics difficult to avoid. Francis will hold an Oval Office meeting Sept. 23 with Obama, who has highlighted areas where his agenda overlaps with the popes priorities, including income inequality. The pope will speak the following day on Capitol Hill, where at least some of the focus will be on the reaction to his remarks from the presidential candidates sitting in the audience. The popes message in Washington is expected to touch on some of the issues that are sources of disagreement with Republicans, though its unlikely he will insert himself directly into presidential politics. Still, as Campbell, the Notre Dame professor, noted, One thing weve learned about Pope Francis is that hes very unpredictable. ", "Date": "20150914", "Title": "[GOP candidates to attend pope events despite differences]", "Link": "http://www.seattletimes.com/nation-world/gop-candidates-to-attend-pope-events-despite-differences/", "Author": "[JULIE PACE]"}