{"Content": "[CLEVELAND (AP)  A combative Donald Trump, the billionaire businessman-turned-presidential candidate, jolted the first Republican debate of the 2016 campaign by warning he might run as an independent if denied the GOP nomination. His startling declaration left his onstage rivals scrambling to compete for attention the rest of the night. Asked in the debates opening minutes whether he could rule out a third-party run, Trump declared Thursday night, I will not make the pledge at this time. He also refused to apologize for making crude comments about women, defended his changing policy positions and tangled with the debate moderators. While Trump was characteristically bombastic, most of the contenders standing alongside him clamored for their piece of the spotlight without engaging him directly. They quarreled over immigration, terrorism and gay marriage, each casting himself as the strongest to take on Democratic front-runner Hillary Rodham Clinton. They also assailed President Barack Obama and his nuclear deal with Iran. The closest former Florida Gov. Jeb Bush, a favorite of the partys moderate, establishment wing, came to tangling with Trump was a gentle critique of the businessmans over-the-top rhetoric. Mr. Trumps language is divisive, Bush said. Were not going to win by doing what Barack Obama and Hillary Clinton do every day  dividing the country. On immigration, one of the main topics of the night, Bush defended his call for a path to legal status for some of the people living in the U.S. illegally, an unpopular position among some Republican voters who equate legal status with amnesty. The great majority of people coming here have no other option, Bush said. Trump in particular has pushed the issue of immigration throughout the summer, drawing criticism for saying Mexican immigrants are rapists. He said Thursday that he had been told that by border patrol agents, and he took credit for immigration being an issue in the campaign. If it werent for me, you wouldnt even be talking about illegal immigration, he said, despite the fact that immigration has been a hot-button issue in presidential campaigns for years. Trumps blunt style was in line with the approach hes taken to his campaign throughout the summer, appealing to voters frustrated with career politicians and perplexing his rivals. He entered the first debate leading the polls in a field filled with governors and senators. Seventeen Republicans are seeking the partys nomination, but only 10 were invited by debate host Fox News to participate in the main event based on their showing in recent polls. The remaining seven were relegated to a pre-debate forum. On stage in his home state, Ohio Gov. John Kasich sought to raise his profile by striking an optimistic tone on the economy, saying all Americans need an opportunity to share in this great American dream. He said that while he favored traditional marriage, he had recently attended a same-sex wedding and would support his children if they were gay. A raucous crowd cheered the candidates on throughout the debate in Cleveland, the same city where Republicans will nominate their general election candidate next summer. No Republican has ever won the presidency without winning Ohio. While the candidates peppered their remarks with barbs about Clinton, they avoided lengthy attacks on her record as secretary of state and the deadly attack in Benghazi, Libya. Only late in the debate did Wisconsin Gov. Scott Walker raise the controversy surrounding her use of personal email and a private server while serving in the Obama administration. Probably the Russian and Chinese governments know more about Hillary Clintons email server than do the members of the U.S. Congress, Walker said. The first debate highlighted deep divisions within the Republican Party, with Kentucky Sen. Rand Paul representing a segment of GOP voters frustrated with military action overseas and what they see as infringements on personal liberties. In a lengthy exchange with New Jersey Gov. Chris Christie, Paul defended his opposition to the USA Patriot Act and laws giving government access to Americans phone records. He said he wanted to collect more information from terrorists, not law-abiding Americans. Christie, a former U.S. attorney, was dismissive. Listen, senator, you know, when youre sitting in a subcommittee, just blowing hot air about this, you can say things like that, he said. Paul was also the most aggressive in taking on Trump, challenging him early on his refusal to commit to supporting the party nominee. Hes already hedging his bets because hes used to buying politicians, Paul said. Florida Sen. Marco Rubio, the youngest candidate in the field at age 44, has tried to carve out a niche as a foreign policy authority, but has struggled to break through this summer  particularly since Trumps surge. He said the election cannot be a resume competition. This election better be about the future, not the past, he said. Rounding out the field was Texas Sen. Ted Cruz, surgeon and tea party favorite Ben Carson and former Arkansas Gov. Mike Huckabee. The crowded field meant limited talking time for candidates, many of whom were introducing themselves to Americans for the first time. I wasnt sure I was going to get to talk again, Carson quipped when the moderators came back to him at one point. The remaining seven candidates were relegated to a pre-debate forum, a low-key event in a largely empty arena, where candidates avoided debating each other and largely stuck to scripted responses on domestic and foreign policy. Former Texas Gov. Rick Perry and businesswoman Carly Fiorina opened the early event with biting criticisms of Trump. Perry  whose failed 2012 White House campaign was damaged by an embarrassing debate stumble  accused Trump of using his celebrity rather than his conservatism to fuel his run for president. Fiorina, the only woman in the GOP field, said that Trump had tapped into Americans anger with Washington, but she challenged the businessman as lacking policy positions. What are the principles by which he would govern? she asked. While the candidates pitched their visions for the Republican Partys future, they also made the case that they would present the strongest general election challenge to Clinton. Clinton, in Los Angeles, said in Los Angeles shes often left in a state of disbelief by what she hears from some of her 2016 rivals. Thursdays debate was the first of six party-sanctioned forums scheduled before primary voting begins in February. Fox News used national polls to determine which 10 candidates would be on the stage, and several candidates were grouped together in the single digits  most separated by a number smaller than the polls margin of error. ", "Date": "20150806", "Title": "[Trump jolts first GOP debate, rivals scramble for attention]", "Link": "http://www.seattletimes.com/nation-world/candidate-clash-republicans-face-off-in-first-2016-debate/", "Author": "[JULIE PACE, STEVE PEOPLES]"}