{"Content": "[The Republican Party thats showing its face to America this week is a restless institution that relies heavily on the uncompromising passions of tea partyers, anti-immigration activists and social conservatives. Its a potent but unruly coalition that supplies vital energy today but poses serious challenges for the future. These forces propelled the GOP to big wins in 2010, and they might help Mitt Romney win the White House this fall. But they operate largely beyond his control, sometimes igniting brushfires and pulling his campaign off message. More troubling for the Republican Party in future elections is that these fiery conservatives seem to be turning off many Hispanic voters, the fastest-growing segment of the American electorate. The challenge facing GOP leaders as they hold their nominating convention and look to the future: trying to win elections and push their agenda through Congress by harnessing the energy of these conservatives without letting that energy turn on them  and without letting it put the party badly out of step with a nation thats rapidly becoming less white. In Romney, the convention-goers in Tampa are nominating a former corporate executive who fits somewhat uneasily in the partys decades-long rightward shift, which manifests itself most clearly in Congress. Social conservatives remain wary of Romney, who once backed abortion rights and gun control. Their antipathy toward President Barack Obama, however, may well nudge them along to polling places in November. That is Romneys great hope, even as he and his GOP establishment allies try to dampen some of the political rights most vocal figures. Romney and others urged a Missouri congressman to drop out of the Senate race after he made widely condemned remarks about rape and pregnancy. Romneys words angered some religious activists who see the congressman, Todd Akin, as a champion of anti-abortion efforts. On the economic front, Romney is in step with his partys anti-tax advocates. He promises to cut taxes further, saying that will help strengthen the economy despite some economists warnings that tax cuts have contributed heavily to the nations massive debt. GOP lawmakers adamant opposition to tax hikes, even on the wealthiest families, puts them at odds with most Americans. The issue might loom larger as efforts to tame the federal debt intensify. Much more problematic is the Republican Partys strained relationship with minorities, especially a fast-growing Hispanic population alarmed by the sometimes sharp tone of conservatives on illegal immigrants. The party may need to address that problem before long to avoid falling behind Democrats in key states. For now, Republicans have a right to party with some swagger in Tampa. Strategists in both parties say Romney has a solid chance of defeating Obama. In congressional races, Republicans are well-positioned to keep their House majority. And they might pick up the handful of Senate seats they need to take control of that chamber, too. Should those three things happen, Republicans will be able to reshape much of the governments tax, spending and regulatory policies to their liking, checked only by Senate Democrats ability to sustain filibusters here and there. Republicans presumably would dismantle much of Obamacare, extend all the Bush-era income tax cuts, reduce other levies including the corporate tax, cut federal payments to Medicaid and loosen regulations on banks and other businesses. But whether Romney wins or not, his partys congressional leaders will continue to struggle to keep a lid on their tea party wing. Several more Republicans who vow not to compromise with Democrats are headed to Congress, and they will give new headaches to House and Senate leaders seeking ways to pass legislation in a nation thats split almost 50-50 politically. Former Florida Gov. Jeb Bush, at a recent event hosted by Bloomberg View, said his partys rightward shift on a host of issues  coupled with the growing aversion to almost any form of compromise with Democrats, especially in the House  is endangering its ability to assemble winning coalitions in the future. Ronald Reagan and George H.W. Bush, he said, wouldnt feel welcome in todays dogmatic GOP. Thats the paradox facing party activists in Tampa. The fiery, ideological stances enlivening the party this fall might, in just a few years, put it at odds with an increasingly diverse electorate inclined to weigh the drawbacks as well as the benefits of an activist government. Opposition to Obamas proposed health care overhaul gave rise to the tea party movement in 2009. Public aversion to Democrats sharp-elbow tactics in passing the measure, plus persistently high unemployment, powered Republicans to big gains in the 2010 midterm elections. They gained control of the House and turned their focus to Obama. Many conservatives said the results proved that a hardline, uncompromising strategy works. But midterm elections draw smaller and more ideological electorates than do presidential elections, said Emory University political scientist Alan Abramowitz. I think some conservatives are taking the wrong lesson, he said. Short-term, were heading to a very competitive presidential race, Abramowitz said. But long-term, I think its more troubling for Republicans, because they are becoming increasingly dominated by white conservatives in a country thats becoming increasingly diverse in terms of race and ethnicity, and more moderate, at least on social issues. The need to reach out to Latinos in particular, and non-whites in general, will require the Republican Party to moderate some of its positions, Abramowitz said. There seems to be little appetite for that. I think the partys in a great position right now, said Rep. Kenny Marchand, R-Texas. I dont find my constituents back home give me a whole lot of latitude on these issues. They hold me pretty much to repealing Obamacare, extending the Bush tax cuts. But what about the Republicans prospects for winning national elections in 2016 and beyond? While the countrys non-white population keeps growing rapidly, the GOP keeps relying heavily on white voters. The statistics trouble GOP strategists eyeing the future. Ninety percent of John McCains presidential vote in 2008 came from whites, as did 91 percent of George W. Bushs vote in 2000. Whites are steadily shrinking as a share of the U.S. population. They accounted for 69 percent in 2000, and 64 percent in 2010. They are on track to slip below 50 percent of the population in 2042, the Census Bureau says, largely because of the rapid growth of Hispanics. Obama won comfortably in 2008 despite taking only 43 percent of the white vote. He did it by winning 95 percent of the black vote and by beating McCain more than 2-to-1 among Hispanics. Two out of three registered Hispanic voters say they will vote for Obama, while 23 percent back Romney, according to a poll by NBC News, The Wall Street Journal and Telemundo. Republicans must change these ratios if theyre to win national elections in the coming decades. Some GOP leaders, however, fear the party is sowing deep seeds of anger among Hispanics by rejecting calls for comprehensive immigration reform, including pathways to legal status for millions of illegal immigrants. George W. Bush and other prominent Republicans once championed that view, but it has fallen deeply out of favor. Dont just talk about Hispanics and say immediately we must have controlled borders, said Jeb Bush, the brother of one Republican president and son of another. Change the tone. Nominating conventions work better as pep rallies than philosophical, agenda-setting forums. Republican activists in Tampa will party, cheer and shout about their determination to make Obama a one-term president. But eventually  perhaps sooner rather than later  party leaders will have to confront demographic and voting trends. Then they will have to decide how long to stick with an uncompromising agenda that appeals mainly to white voters, a group whose influence shrinks with each passing month.]", "Date": "20120827", "Title": "[Happy now for tea party help, GOP faces challenges]", "Link": "http://www.seattletimes.com/seattle-news/politics/happy-now-for-tea-party-help-gop-faces-challenges/", "Author": "[CHARLES BABINGTON]"}