{"Content": "[ATHENS, Greece (AP)  New Greek proposals aimed at ending a long standoff with international bailout creditors and unlocking vital rescue funds were received with little visible enthusiasm in Brussels on Tuesday. Greece has just three weeks to conclude a deal before its finances implode, and a key negotiator complained that officials at the European Unions executive Commission have yet to respond to the documents presented late Monday. We want a written and clear answer, State Minister Nikos Pappas said, in comment posted on a social media site, as Prime Minister Alexis Tsipras briefed officials in his radical left Syriza party on the negotiations. A government official said the proposals included alternative ideas on budget measures required for creditors to approve the bailout payment, and for a workable plan to render Greeces crushing debt load viable. No further details were made public. The submission follows last weeks impasse, when bailout creditors responded to a 47-page Greek proposal with a brief counter-offer that Athens rejected as containing absurd measures that would worsen the lot of Greeks already reeling from five years of deep cuts and soaring unemployment. The two sides mainly disagree on creditors demands for Athens to raise the sales tax on food, medicine and power bills, labor market reforms and cuts to pensions. These would be hard for the new government to implement less than five months after its election on a combative anti-austerity platform. A deal must be struck before the end of June, when Greeces bailout program ends  and the pending 7.2 billion euro payment ($8 billion) will no longer be available. Without the cash, Greece will be unable to pay its creditors, and would default on its loans. Greece has already said it will bundle its four June debt repayments  all owed to the International Monetary Fund and totaling 1.6 billion euros ($1.8 billion)  into one on June 30. The move, which is allowed under IMF rules, may be more a sign of defiance than absolute penury. While Greece should still be able to pay pensions and salaries, and keep the essential functions of state running through tax revenues, a default would likely kill its banks. The banks depend on emergency funding from the European Central Bank, but in the case of a government default, the state-backed guarantees they give the ECB as collateral for the emergency funding would become worthless. The import-reliant country could then have to put limits on money transfers and withdrawals and see shortages of basic goods. It could even have to ditch the euro as it adopts a devalued version of its old drachma currency to get liquid currency back into the banks and economy. The price of vital imported goods would likely rocket under the new, weaker currency. A spokesman for the Commission  which together with the ECB and the IMF oversees the rescue program  said diverse proposals are being circulated, but did not comment on what European officials thought of them. The three institutions are currently assessing these suggestions with diligence and care, Margaritis Schinas said in Brussels. Speculation is now growing that the bailout deal could be extended months past its current end-June expiry. Teneo Intelligence analyst Wolfango Piccoli said stretching the bailout to March 2016  when IMF participation in the bailout ends  is slowly emerging as the new baseline scenario ahead of a meeting of eurozone finance ministers on June 18. That would help the creditors delay the question of how to help Greece once the next batch of rescue loans run out. It remains unlikely that (Tsipras) himself will be able to propose the kind of tough deal creditors will find acceptable he said in a note. As a result, Piccoli expects creditors to effectively force a deal, including an extension, on Athens in time for the June 18 meeting, as Greece would have few other options. Schinas said that if the conditions are there Tsipras could hold a new meeting Wednesday with European Commission head Jean-Claude Juncker on the sidelines of an EU-Latin America summit in Brussels. At the summit, Tsipras is also expected to meet again with German Chancellor Angela Merkel and French President Francois Hollande. Hopes of progress helped Greek stocks buck the negative trend in Europe, and the main Athens index closed 0.6 percent higher. Greece has depended on international rescue loans since 2010 when it was unable to finance itself by borrowing from financial markets. In exchange for loans, it had to implement big spending cuts and tax hikes. That prescription helped tame the countrys budget deficits but worsened the economy. Failure to agree on a deal with creditors on new reforms has left the country without rescue loans since last summer. Greece has managed to survive through its own resources but cannot do so much longer. ", "Date": "20150609", "Title": "[Greece makes new proposals to end bailout impasse]", "Link": "http://www.seattletimes.com/nation-world/greece-makes-new-proposals-to-end-bailout-impasse/", "Author": "[NICHOLAS PAPHITIS]"}