{"Content": "[Citing popular demand, Sound Transits governing board Thursday unanimously voted to seek   a new sales tax, a new car-tab fee and/or a new property tax. Next, the agency will ask the Legislature for authorization before sending a proposal to the November 2016 ballot in urban Snohomish, King and Pierce counties. I think we have a wonderful story to tell the Legislature, said board Vice-Chair Paul Roberts, who is also a member of the Everett City Council. He mentioned the regions biggest manufacturing facility at Boeing, and two-hour commutes from Everett to Seattle this fall. Sound Transit is improving its efficiency in delivering projects, he added. The next light-rail segment, a $1.8 billion, three-mile subway from Westlake Station to Capitol Hill and Husky Stadium, opens in early 2016, a half-year sooner than forecast. Tax rates for Sound Transit 3  the 2016 ballot measure  will probably be less than the full amount officials request from Olympia. A ST3 project map almost certainly will include new stretches of light rail from Lynnwood to Everett, Overlake to Redmond, and Kent-Des Moines Road to Federal Way. Other suggestions include Ballard, West Seattle, Eastgate or Issaquah spurs, and better bus-rapid transit on Interstate 405. New taxes might bring in $9 billion over 15 years. When combined with income streams from the 1996 and 2008 ballot measures, the project list could grow to $15 billion, said spokesman Geoff Patrick. Board Chairman Dow Constantine, the King County executive, said he wants the big numbers out in public long before a 2016 election, when a presidential race should entice young, pro-transit voters. People are smart, and they realize that permanent infrastructure that changes mobility in the region requires investment over a number of years, he said. Sound Transit budgets, much like state highway funds, are burdened by debt, requiring new taxes to extend the corridors. Analyses by Sound Transit Finance Director Brian McCartan show that to provide just the 50 miles of light rail already approved, plus bus and commuter-train service, the agency needs to maintain its existing 0.9 percent sales tax through the late 2030s. Some bond payments are proposed until 2053. And the board Thursday approved a $1.33 billion, low-interest federal loan to help build the $4 billion Chinatown-Bellevue-Overlake rail line  to be paid off in 2058. Mike Lindblom: 206-515-5631 or mlindblom@seattletimes.com. On Twitter @mikelindblom]", "Date": "20141120", "Title": "[Sound Transit to seek new tax, fees to extend light-rail routes]", "Link": "http://www.seattletimes.com/seattle-news/sound-transit-to-seek-new-tax-fees-to-extend-light-rail-routes/", "Author": "[Mike Lindblom]"}