{"Content": "[WASHINGTON  Rick Perrys voice softens when he talks about the joy he gets from looking at his iPad and seeing that 20-week picture of my first grandbaby. Marco Rubio says ultrasounds of his sons and daughters reinforced how they were children  and they were our children. Rand Paul recalls watching fetuses suck their thumbs. And Chris Christie says the ultrasound of his first daughter changed his views on abortion. If they seem to be reading from the same script, they are. With help from a well-funded, well-researched and invigorated anti-abortion movement, Republican politicians have refined how they are talking about pregnancy and abortion rights, choosing their words in a way they hope puts Democrats on the defensive. The goal, social conservatives say, is to shift the debate away from the war on women paradigm that has proved so harmful to their partys image. Democrats were jolted by the latest and perhaps most disruptive effort yet in this line of attack by activists who want to outlaw abortion: surreptitiously recorded video of Planned Parenthood doctors casually discussing how they extract tissue from aborted fetuses. It took Hillary Rodham Clinton several days to respond to the uproar the videos created. When she finally did late last week, she called the videos part of a deliberate and concerted attack on womens rights, and pointed back to Planned Parenthood, which she said had already apologized for the tone of one of the doctors who were recorded. It is unclear whether the new offensive will succeed in crippling Planned Parenthood, a provider of across-the-board womens health services that has long been a target of conservatives for the hundreds of millions of dollars in federal funding it receives. Democrats like Clinton have, so far, not wavered. But with the presidential campaign revving up, Democrats and abortion-rights supporters are bracing for a sustained, sophisticated and coordinated effort to force a debate on the uncomfortable moral and ethical questions that abortion raises. The out-of-sight, out-of-mind mantra that propelled the pro-choice movement for decades is forever gone, said Kellyanne Conway, a Republican pollster who has been hired by conservative candidates, anti-abortion groups and the Republican National Committee to help conservatives sharpen their message on the issue. Conway has advised Republicans, especially men, to describe their recollections of seeing ultrasound images for the first time because it can be disarming. Coincidentally or not, many of the partys presidential contenders did so in New Orleans this month at a gathering of the National Right to Life Committee. Planned Parenthood is now struggling to explain a legal aspect of its practice that has gone largely unnoticed  procuring tissues from aborted fetuses for medical research  in a crisis that shows no signs of abating. Cecile Richards, the groups president, told ABC News on Sunday, Planned Parenthood has broken no laws. She said the activists responsible were from the most militant wing of the anti-abortion movement in this country and were seeking to entrap doctors. The activist behind the videos, David Daleiden, has said he has enough covertly recorded footage for perhaps a dozen videos that he could release, one a week, for the next few months. Planned Parenthood has told Congress that it believes the next installments could have a racial element to them, with its employees possibly discussing the different characteristics of the extracted fetal tissue based on race. The group also says it knows that Daleiden or his colleagues were admitted into a clinic area that processes tissue after abortions, and it believes they may have obtained footage of that as well. The tactics could backfire if people perceive them as extreme and dishonest. Democrats have already begun making this case, saying the footage was edited in a misleading way. Josh Earnest, the White House press secretary, said last week that the videos were selectively edited to distort not just the words of the individual speaking, but also the position of Planned Parenthood. Not shown in the videos is the doctors insistence that they would not profit from tissue donation, which is illegal, and that their motivation for collecting donated tissue was scientific, not financial. But anti-abortion activists say their new efforts are forcing their opponents to defend their own words and beliefs on the issue in a way they had not had to before. Its very difficult to deliver a message that people dont basically believe, said Marjorie Dannenfelser, the president of the Susan B. Anthony List, a group that funds anti-abortion candidates. Were the source of the information, so they think were biased. But in this case, she added, its coming from them, not us. Abortion opponents hope the videos will provoke people to consider the humanity of the unborn, much like discussing ultrasounds can  albeit in a much more jarring and graphic way. Conway, the Republican pollster, calls this a shock the conscience, warm the heart approach. Daleidens approach shows how the movements tactics have evolved. He and his fellow activists took the time to study an aspect of Planned Parenthoods practice that was largely unknown to outsiders. And they trained extensively  learning the correct terminology and financial information  to give the false impression that they were professionals. The images and language that advocates use are intended to portray the Democratic Partys official position on abortion, particularly its support for late-term abortions, as extreme  a label that has stuck much more effectively to Republicans on issues of womens reproductive health. The potential for the issue to be a factor in the 2016 presidential election is real. All the Republican candidates who are now in the upper tier strongly oppose abortion rights, unlike in 2008 and 2012, when social conservatives found Rudolph Giuliani and Mitt Romney to be untrustworthy because they previously supported liberal abortion laws. The Supreme Court, which many experts expect to take up a major abortion case next term, could bring the issue to the fore and keep it there well into 2016. At some point, too, the Senate will take up a bill that would ban abortion after 20 weeks of pregnancy. All four of the Republican presidential candidates in the Senate  Ted Cruz of Texas, Paul of Kentucky, Rubio of Florida and Lindsey Graham of South Carolina  support it. The release of the Planned Parenthood videos, meanwhile, has set off a new push by congressional Republicans to cut the groups funding. That could come to a boil this year, shortly before the first presidential primaries. Democrats often relish legislative fights over abortion, because Republicans often stumble by making ill-advised statements, like the legitimate rape remarks that damaged the party so badly in the summer of 2012, months before the presidential election. Social conservatives say they hope the missteps and overreach are a thing of the past. Those of us whove grown up in the movement have learned a lot, said Jeanne Mancini, the president of the March for Life, an annual event on the National Mall. She said, for example, that her group now discourages participants in the march from using the disturbing images of abortion that so often appear at rallies and protests. Instead, she said, it encourages a softer approach, like posters with pictures of babies.]", "Date": "20150726", "Title": "[GOP candidates following scripted message on abortion, pregnancy]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/gop-candidates-following-scripted-message-on-abortion-pregnancy/", "Author": "[JEREMY W. PETERS]"}