{"Content": "[If youre looking for intrigue in Seattle City Council elections this year, theres at least one place to turn: the race between Councilmember Mike OBrien and engineering consultant Albert Shen. Four years after a pair of open seats drew nearly a dozen candidates, the elections this time around are widely seen as sleepy. Few strong challengers have emerged to oppose four incumbents up for re-election. Two of the incumbents, Sally Bagshaw and Nick Licata, have only one opponent and thus wont appear on the Aug. 6 primary election ballot. A third, longtime council member and former Council President Richard Conlin, has received most major endorsements in his re-election bid against socialist Kshama Sawant and Amazon.com employee Brian Carver. That leaves OBrien, a first-term incumbent, as the most vulnerable member. Shen, running on a pro-business platform, has received several endorsements and has raised more than $130,000  more than OBriens nearly $94,500. Poet David Ishii is also running. But local political consultants note that even the OBrien race has struggled for attention in a year when the city has been focused on a crowded field for mayor. OBrien, Shen, Ishii, OBrien, a 45-year-old financial officer and former local Sierra Club chairman, is perhaps best known as Mayor Mike McGinns closest ally on the council. He has carved out a name for himself, however, championing bills  to ban plastic bags and create an opt-out program for yellow-pages phone-book deliveries to save paper, and crafting a ballot measure to establish public financing of council elections. Im really proud of what Ive accomplished, said OBrien, who was first elected four years ago, and I really feel like Im just getting started. Shen, 46, who serves on the Seattle Community Colleges board of trustees and runs a civil-engineering company, has criticized the incumbents relationship with the mayor, including by distributing a flier with an illustration of OBrien literally in McGinns pocket. He also argued that OBrien has failed to adequately include the business community in policy discussions. Process is important. We have to get business involved, said Shen, who is endorsed by the political arm of the Seattle Metropolitan Chamber of Commerce. Specifically, Shen noted the $500,000 settlement the city paid publishers of the yellow-pages directories that sued over the opt-out law. OBrien said he was disappointed with that legal outcome but that the opt-out law was well worth it. In two years, we have reduced 1,000 tons of paper and saved the city two-thirds of the $200,000 we pay (annually) to recycle yellow pages, he said. OBrien said he hasnt heard Shen articulate a specific case against him. Im still struggling to understand what he would do differently and why hes in this race, OBrien said. One of their differences is on affordable housing. OBrien, who played a key role in establishing more affordable housing in South Lake Union as part of a rezone, believes it is worth the citys money to build such housing in more expensive neighborhoods because thats where the jobs are. Shen thinks public money would be best spent in areas where more housing can be built for the same cost. Another difference is on the proposed Sodo basketball arena. OBrien supported the plan, while Shen said he had serious concerns about its location and the use of public financing. Ishii, who turns 57 on Thursday, has not mounted a serious campaign. His website blares Chers I Got You Babe and turns the cursor into a fountain of bubbles or hearts, depending on which section you click into. Conlin, Sawant, Carver, Conlin has served on the  Seattle City Council for 16 years, tied for the longest on the  current council. The 65-year-old former director of the Environment Division at Metrocenter YMCA has worked on a variety of issues, including the plastic-bag ban and the parks levy, first approved by voters in 2008, which directs more money to city parks. If re-elected, he said, he wants to focus on overseeing planned light-rail projects to Lynnwood and the Eastside, work on a 2016 package for additional rail lines and ensure that development occurs around the transit stations. I have both the experience to know how to make things happen and the fresh ideas to make them happen, he said. Carver, 34, accused Conlin of not leading on big issues and being too conservative for Seattle. Specifically, he cited the incumbents votes against the proposed Sodo arena and requiring businesses to provide paid sick leave. Conlin was the only no vote on the latter, saying more study was needed. I think our council needs to be doing more to lead in areas that are really important for Seattle, said Carver, arguing for more investments in early learning, more oversight of the police force and more protection of neighborhoods. Sawant, 40, who ran as a socialist alternative against state House Speaker Frank Chopp last year, is running this time on a platform with three main proposals: a tax on millionaires, a $15 citywide minimum wage and rent control mandating that rents can rise no more than inflation. Seattle has become unaffordable to working people, said Sawant, an economics professor at Seattle Central Community College who has gotten endorsements from The Stranger newspaper and several labor unions. The majority of people are well to the left of the City Council, and were running to represent their interests. Specifically, she said Conlin has been a poster boy for out of touch representation and hostile to the homeless. Conlin said the council is prevented by law from establishing a millionaires tax or rent control. He said he is open to exploring an increase in the minimum wage, however. Brian M. Rosenthal: 206-464-3195 or brosenthal@seattletimes.com. On Twitter @brianmrosenthal]", "Date": "20130731", "Title": "[OBrien looks most vulnerable in Seattle City Council race]", "Link": "http://www.seattletimes.com/seattle-news/orsquobrien-looks-most-vulnerable-in-seattle-city-council-race/", "Author": "[Brian M. Rosenthal]"}