{"Content": "[WASHINGTON (AP)  If he runs for president as expected, Sen. Marco Rubio will have a political committee ready to raise and spend unlimited cash on his behalf. Rubio is set to announce his 2016 campaign plans in a speech Monday in Miami and would become the third major candidate to declare his White House ambitions. A first-term senator representing Florida, the Cuban-American Rubio is expected to bypass a second term in favor of pursuing the presidency and becoming the first Hispanic president. But from even his most enthusiastic supporters, Rubio can only accept $2,700 to help him win the nomination. The pro-Rubio, independent Conservative Solutions PAC will face no such limits. Conservative Solutions is set to collect checks from deep-pocketed donors to pay for as many television, digital and radio ads as it can afford to boost Rubios chances. This race will be won by the candidate with the best vision for where to take this nation and the resources to ensure that message is heard, veteran strategist Warren Tompkins said in a statement released to The Associated Press early Thursday morning. Marco has the vision  few have laid out in as much detail where theyd like to lead this country  and were going to spend the next two years ensuring that the resources are there and used to effectively share that vision with voters. Super PACs are political committees that operate independently of the candidates and cannot coordinate strategy with the campaigns of those seeking office. But they often can play an outsized role in shaping how voters view the candidates because they can buy so much more advertising than the campaigns can afford. For instance, Priorities USA spent $65 million to boost President Barack Obamas re-election bid in 2012. The Restore Our Future super PAC spent $142 million to help Mitt Romney win the Republican nomination and then face Obama in the general election. Heading into 2016, Priorities USA is repositioning itself as the de facto super PAC for presumed Democratic front-runner Hillary Rodham Clinton. And most of her Republican rivals have outside admirers in the process of assembling their own bottomless political ATM machines. Rubio is no different now. Led by veteran Republican consultant Warren Tompkins, Conservative Solutions PAC is set to be Rubios primary advertising partner, allowing the official campaign to focus on other nuts-and-bolts functions of running a race, such as building databases, knocking on doors and staging public events. Conservative Solutions officials declined to provide a budget, but Newt Gingrichs failed presidential bid in 2012 proved a super PAC only needs a single patron to be effective. The pro-Gingrich super PAC Winning the Future collected $20 million from casino billionaires Sheldon and Miriam Adelson to keep it afloat after a string of primary losses. (The Adelsons then gave Romneys super PAC $30 million when he became the nominee.), Rubio has met with the Adelsons multiple times since January although they remain uncommitted in the presidential campaign and are considering a lesser role in 2016. Tompkins is a major get for Rubios allies, and not just because he has seven presidential primaries on his resume. He was Ronald Reagans political director during the South Carolina primary, then went on to work for the campaigns of George H.W. Bush, George W. Bush and Romney. Bypassing the likely candidacy of former Florida Gov. Jeb Bush, the son of George H.W. Bush and brother of George W. Bush, will probably be seen as a slight from a party elder who has worked with the Bush clan since 1980. Making what is expected to be a raft of ads will be Jon Lerner, who has more than two-dozen winning House, Senate and gubernatorial campaigns to his credit. Most recently, he has been the advertising adviser for the last four successful gubernatorial campaigns in South Carolina. Jon Graham will head up fundraising for the group, which can take unlimited cash from donors but must disclose its fundraising and spending on a regular basis. His firm, Gula Graham, has raised more than $100 million since it was formed in 2009. And Jeff Sadosky, a veteran of George W. Bushs re-election bid and John McCains presidential campaign, will manage the communications for the super PAC. Sadoskys most recent campaign was Rob Portmans successful bid for Senate in Ohio in 2010. He served as a senior aide in Portmans Senate office before going to work in the private sector. ", "Date": "20150409", "Title": "[Marco Rubio, set to launch 2016 campaign, gets a super PAC]", "Link": "http://www.seattletimes.com/seattle-news/politics/marco-rubio-set-to-launch-2016-campaign-gets-a-super-pac/", "Author": "[PHILIP ELLIOTT]"}