{"Content": "[WASHINGTON  Bill and Hillary Rodham Clinton are fighting back against critics as if they are waging another campaign, the clearest sign yet that, perhaps, they are. The former secretary of state and her former president husband are defending their records, showing off their health and humor and raising money for fellow Democrats, fresh indications that Hillary Clinton has her eye on running for president in 2016. The onetime first lady was attending her first political event of the year on Thursday, a New York fundraiser for Pennsylvania congressional candidate Marjorie Margolies, who is the mother-in-law of the Clintons daughter, Chelsea. The former president has been a steady rainmaker for Democrats this year, raising money for candidates from Arkansas to Florida, Kentucky, Michigan and Maryland. Confronting Republican critics, the Clintons responded with humor and heft to suggestions by Republican strategist Karl Rove that Hillary Clinton may have suffered health problems more serious than she acknowledged after a concussion and hospitalization in late 2012. The former president mused Wednesday that Roves doubt-casting on Hillary Clintons health could be a sign of more attacks to come. You cant be too upset about it, its just the beginning. Theyll get better and better at it, Clinton said. Its just part of the deal. Clinton vouched for his wifes good health. Rove disputed reports that he suggested Hillary Clinton suffered a brain injury but said her health would be relevant if she runs again in 2016. His comments brought a stinging rebuke from Mrs. Clintons advisers, the type of response common in a presidential campaign but unusual since Mrs. Clinton left the Obama administration last year. They are scared of what she has achieved and what she has to offer, said Clinton spokesman Nick Merrill. Former Pennsylvania Gov. Ed Rendell, a Clinton supporter, said Roves comments were an attempt to dissuade Hillary from becoming a candidate but said the Clinton response should not imply that Hillary Clinton had made any decisions. Hillarys people are doing all these things with a hope that she will become a candidate. This is what a candidate should be doing in the early stages, but I dont necessarily think that means shes decided yet, Rendell said. Republicans have signaled that they will raise the former first ladys health and age  she would turn 69 about a week before the 2016 election  and her record at the State Department, including her handling of the 2012 terrorist attack on a diplomatic outpost in Benghazi, Libya, that killed four Americans, including the U.S. ambassador. On Capitol Hill, Republicans offered another reminder Thursday of how they will maintain a steady drumbeat on the Benghazi attacks. Sens. Lindsey Graham, R-S.C. and Kelly Ayotte, R-N.H. renewed a call for a joint select committee, which Senate Democratic leader Harry Reid has rejected. They suggested weakness over Clintons decision to skip a round of Sunday talk shows five days after the Sept. 11, 2012, attack and allow then-United Nations Ambassador Susan Rice to take her place. What does that say about Benghazi and her leadership ability? Graham asked reporters at a news conference. Clinton is expected to tell her side of the Benghazi story next month, when her new book, Hard Choices, is released. She has offered a preview in recent speeches, describing her work with Obama to curb Irans nuclear ambitions, lay the foundation for Middle East peace and help Chinese dissident Chen Guangcheng. Bill Clinton, meanwhile, has sought to remind people of his administrations economic record. During a recent Georgetown University speech, he pointed to his creation of nearly 23 million jobs. More immediately, the Clintons are helping Margolies, a former Pennsylvania congresswoman, leading up to her May 20 primary for a House seat in the Philadelphia suburbs. Hillary Clintons event for Margolies was being held at the New York home of Lynn Forester de Rothschild, a major donor for her 2008 campaign. Bill Clinton, meanwhile, is appearing in a television ad for Margolies, vouching for her as someone who will make you proud. The former president on Tuesday helped rake in $1 million at a Potomac, Md. campaign fundraiser for Maryland Lt. Gov. Anthony Brown, who hopes to succeed outgoing Gov. Martin OMalley, D-Md. Clinton has appeared at fundraisers for Alison Lundergan Grimes, a Kentucky Democrat challenging Senate GOP leader Mitch McConnell, and longtime allies like Mike Ross, who is running for Arkansas governor, the office that launched Clinton to the White House. The former president will headline the Ohio Democratic Partys annual gala on June 13, raising money in one of the nations premiere presidential battleground states. _]", "Date": "20140515", "Title": "[Bill and Hillary fight back against critics with humor, records]", "Link": "http://www.seattletimes.com/nation-world/bill-and-hillary-fight-back-against-critics-with-humor-records/", "Author": "[KEN THOMAS]"}