{"Content": "[After listening to Gov. Scott Walker of Wisconsin as he has traveled the country preparing his campaign for president, which officially begins Monday, admiring voters most often describe him as authentic, real and approachable, Walkers advisers say. Two words these voters do not use about him? Smart and sophisticated. Scott is working on that, said Ed Goeas, a veteran Republican pollster and a senior adviser to Walker. Look, approachable is worth its weight in gold in politics. Smart is something voters look for in legislators who craft policy. But Scott is preparing hard to talk about every issue. As Walker becomes the 15th prominent Republican to enter the 2016 race, the crucial question he must answer is whether he can cross the threshold of credibility so that someone entering a voting booth can imagine him as president, according to several leading Republicans and interviews with regular voters. While Walker is ahead in some opinion polls, including for Iowas first-in-the-nation caucuses, a series of early gaffes alarmed party leaders and donors and led Walker to begin several months of policy tutorials.  The collective hope is that Walker can avoid what Goeas and others describe as Sarah Palins problem: becoming a candidate who is initially popular among Republicans, like the 2008 vice-presidential nominee, but loses luster because of missteps as the campaign goes on. Walker is now emerging from his crash course with the aim of reassuring activists and contributors, who have given relatively modest amounts to his political operation so far. The goal is to no longer sow doubts with comments like comparing pro-union protesters to Islamic State group terrorists, refusing to answer a question about evolution, or saying he does not know if President Obama is a Christian or if he loves America. Whether Walker can demonstrate that he has a command of the challenges facing America, and is big enough for the presidency, will be tested in the coming weeks on the campaign trail and in televised debates. Gov. Terry Branstad, Republican of Iowa, said Walker had a lot going for him given that hes a neighboring state governor who has been tried and tested on tough issues. Yet Republican voters in Iowa want to be confident Walker will not make political errors that might raise doubts about his capabilities and make Hillary Rodham Clinton look more prepared if she emerges as the Democratic nominee. Iowa is a state that rewards candidates who work hard, Branstad said, and I think Governor Walker will benefit if he shows he has done the work to be ready to lead. Judd Gregg, a former three-term senator from New Hampshire, noted that Walker had a good run of events there in the spring, followed by long absences as he focused more on briefings by his advisers. Many Republicans are not sure what to expect from him as he returns Thursday as part of his campaign kickoff tour. If Walker comes across as very credible, he has the political record and the message to do very well in the New Hampshire primary, Gregg said. But again, he has to be credible. Concerns about the breadth and depth of Walkers knowledge extend to both national-security and domestic-policy issues. Two Republicans recalled being at a closed-door event last winter when, they said, Walker did not articulate a strong answer to a question about Internet neutrality, instead promising to look at the issue. Others questioned his sophistication in boiling down national-security challenges to matters of safety; he believes people relate to that word, whereas national security is an elitist phrase. And his repeated comments that the most important foreign-policy decision of his lifetime was President Reagans firing of air traffic controllers in 1981, because it got the attention of the Soviet Union, was a sign to some Republicans that Walker, who dropped out of Marquette University and has not traveled widely abroad, has a limited worldview. His lack of knowledge in the foreign-policy area has been a problem because, well, you want your commander in chief to be confident on those issues, said Bruce Perlo, chairman of the Grafton County Republican Committee in New Hampshire. Recognizing the problem, Walker has joined in hourslong meetings in Washington; Madison, Wis.; and elsewhere for tutorials on the Islamic State, Iran, Russia and military and geopolitical confrontations, as well as human-rights abuses, border security and immigration policy, and other issues, advisers said. He has relied on Republicans such as former Sen. Jim Talent of Missouri, who leads Walkers national-security advisory council, and Andrew Bremberg, his policy director, who previously was a top aide to Senate Majority Leader Mitch McConnell of Kentucky. In recent months, Walker has also met or spoken with Prime Ministers Benjamin Netanyahu of Israel (as part of a trip to Israel), David Cameron of Britain and Stephen Harper of Canada; Presidents Xi Jinping of China and Toomas Hendrik Ilves of Estonia; retired military leaders such as former Gen. David Petraeus and former Gen. Jack Keane; and a number of U.S. and foreign ambassadors. Aides to Walker provided this list in response to questions about his briefings; they declined a request to interview Walker. Keane, in an email, said he had provided an analysis of global security challenges facing the United States, which he has done for several other candidates from both parties. He said he was not an adviser to any campaign, and he declined to offer an assessment of Walkers capabilities. Pete Peters, a Republican voter in New Hampshire and a Navy veteran, said that the rise of the Islamic State group was his foremost concern in the 2016 election, and that he was far from certain that Walker had the ability to defeat the terrorists. I like Walker, but he doesnt come across like a guy who has thought hard or creatively about the Middle East, Peters said. Walker does seem to have made some progress. One of the Republicans who was concerned about net neutrality said that, about a month ago, he heard Walker give a thoughtful and crisp statement about the issue. A lot of us are still worried about Walkers off-the-cuff answers, and about how Walker will handle himself when the real shooting starts in Iowa, when the television attack ads and direct-mail pieces start hitting him, said the Republican, who leads a prominent national conservative group and is not aligned with any presidential candidate. He spoke on the condition of anonymity to candidly assess Walker, with whom he has a good relationship. The policy briefings have cut into time that Walker might have otherwise devoted to fundraising events, which his advisers cite as one reason for the relatively modest amount that he and his allies have raised for his political committees in recent months. The dollar amount is expected to be disclosed soon. But some potential donors have said in recent weeks that Walkers busy schedule was not an issue for them; rather, they were taking a wait-and-see approach on Walker.]", "Date": "20150712", "Title": "[Authentic Scott Walker seeks to add smart to image]", "Link": "http://www.seattletimes.com/nation-world/authentic-scott-walker-seeks-to-add-smart-to-image/", "Author": "[Patrick Healy]"}