{"Content": "[Even before this months tumultuous ruling quashing charter schools as unconstitutional, the Washington Supreme Court had been a central player in some of the states biggest recent political fights. Last year the court held the state in contempt for inadequate funding of public schools  and it followed up in August with a $100,000-a-day fine. Three years ago, justices struck down a voter-approved measure requiring the Legislature to have a supermajority to enact tax increases. The high-profile rulings generally have been applauded by unions and Democratic-leaning groups, while angering conservatives and some business organizations. AG to justices: Charter-school ruling puts Running Start at risk, Charter-school ruling prompts initiative targeting Supreme Court, The ideological makeup of the court shifted over the past several years, with the departure of its two most conservative members, James Johnson and Richard Sanders, as well as centrist former Chief Justice Gerry Alexander. Critics argue the court has grown more liberal and activist. Defenders say the nine justices are doing their jobs  applying the constitution without regard to popular opinion. While there is widespread disagreement about the courts recent decisions, some common themes emerged in interviews last week with attorneys, former justices, legislators and other court observers. They described a studious and engaged set of judges who ask probing questions of attorneys during oral arguments. But they also see a body that  unlike past courts  includes no former legislators or public officials with deep experience in other branches of government. That means that they have a certain outlook about the judiciary, said former Justice Phil Talmadge, who also served as a Democratic state legislator. Its basically a court that sees itself unrestrained in its authority. Talmadge and others blasted as tone deaf the timing of the charter-school ruling, which came late on the Friday before Labor Day  after some of the fledgling schools had opened. They argued the majority opinion  which held that taxpayer money could go only to schools under the authority of elected local boards, unlike independently run charter schools  is an example of overreach that breaks with a precedent of deference to the Legislature on budget matters. The same, critics noted, could be said of the courts decision to retain active oversight of education budgeting in the McCleary school-funding case. Chief Justice Barbara Madsen, who authored the charter ruling and is one of three justices up for re-election in 2016, declined interview requests for this story, noting through a spokeswoman she cannot comment on ongoing cases. In an emailed statement, Madsen said the court has often been asked to decide difficult constitutional questions, which is the role of a judiciary in a democratic society. The court makes its decisions on the merits, and only (italics hers) the legal merits of each case, she wrote. Hugh Spitzer, a professor of constitutional law at the University of Washington, dismissed complaints of judicial activism. A court is always called activist when it issues a ruling that someone doesnt like, he said. I would say the state Supreme Court tries very hard to get it right in terms of the law. Even if all the members of the court might have been Democrats before they went on the court, Spitzer said they split on rulings all the time  noting the three justices who dissented in the charter-schools case. State Sen. Jamie Pedersen, D-Seattle, an attorney, argued the court has shown patience. Contrary to some of my Republican colleagues who think this is a massively activist court, I think they have been extremely restrained in their dealing with the McCleary case, Pedersen said. The recent set of decisions has led some Republicans behind the scenes to start mulling whether to recruit challengers for the court. Elections for the high-court seats have grown less competitive in recent years  with spending dominated more by liberal groups. In 2014, when four justices were up for election, two faced no opposition and two had nominal opponents. All the incumbents easily won in relatively light-spending contests. That was in sharp contrast to the mid-2000s when unions battled it out with the states homebuilders association in expensive, bruising contests. In the most recent elections, the builders have basically stood down. I think the court has not been as ideologically uniform as it is today for a long time. It is a court composed of people who are very left of center, argued former Attorney General Rob McKenna, a Republican. Alexander, who retired in 2011, defended the court. He said he considers himself a Republican, though in 2006 he was challenged by a Building Industry Association of Washington (BIAW)-backed conservative candidate in what was the costliest judicial race in state history. He said he never thought partisan identity had much influence on decision-making at the court. The court intellectually is probably as good as its ever been since statehood, Alexander added. He described the nine justices  six women and three men  as a hot court, meaning they tend to ask lots of questions during oral arguments. That was readily apparent in the Oct. 28 oral arguments on charter schools. Paul Lawrence, the attorney for the League of Women Voters of Washington and other plaintiffs, got about a minute into his argument when Justice Debra Stephens jumped in with a question about the parameters of common schools, the term applied by the state constitution to the bulk of public schools. Several observers described Stephens, the first woman from Eastern Washington to serve on the court, as a particularly avid and incisive questioner. Former Justice Sanders called her brilliant. He also pointedly noted the supermajority of women on the court. He didnt explicitly say the women voted together as a bloc. But he said Madsen, in particular, wants to drive the court in a certain direction  one preoccupied with matters of gender equity in the justice system. Madsen chairs the state Gender and Justice Commission, which addresses gender bias in the courts. Sanders also described the women on the court as showing antipathy to guns and gun rights. Jim Johnson would be at the other extreme. He would get up at 4 a.m. to go duck hunting in Aberdeen and show up at 8 to the court. That was something the women on the court couldnt fathom. Even so, Sanders was reluctant to cast the courts decisions in an ideological light, saying each one had to be judged on the merits. Johnson showed no such hesitancy. He compared the court majority to George Wallace standing in front of the charter-school doors  a reference to the legendary segregationist governor standing in a University of Alabama doorway to protest black students enrollment. Some Republicans in Washington state hope the anger brings more competition to the next rounds of judicial races. I think there ought to be, said former Republican U.S. Sen. Slade Gorton, noting hes not personally involved in such efforts. He said a qualified attorney or judge ought to run for the court next year specifically criticizing the charter-schools ruling, which he called an absolute disgrace. Still others are scrutinizing the funding of judicial races. Johnson complained that public-sector unions have become the giants in the room. He himself was targeted by unions during his re-election campaigns. But he had big-money support of his own. As a former lawyer for the BIAW, he benefited from more than $135,000 in support from the builders group during a 2004 re-election campaign. The Washington Education Association (WEA) has been the largest donor to Supreme Court races since 2008, with $21,200 in direct contributions, according to campaign-finance data maintained by the National Institute on Money in State Politics. Seven justices received maximum donations of $1,800 or $1,900 from the WEA during their most recent campaigns. Justice Susan Owens also benefitted from a $50,000 WEA donation to a political-action committee supporting her in 2006. The union was a named plaintiff in the lawsuit to overturn the 2012 charter-schools initiative. In her statement to The Seattle Times, Madsen defended the courts impartiality, pointing to provisions in the state Code of Judicial Conduct that prohibit judges from directly asking for campaign contributions. In practice, Jim Lobsenz, an attorney who has been to judicial fundraisers, said judges leave the room when talk of money begins. Alexander professed he didnt even know who donated in his elections. I just kept myself isolated from that part of the campaign. But some national judicial-reform advocates say Washington could have stricter recusal laws when it comes to cases involving campaign donors. The Washington standard is very subjective. It basically leaves it up to the judge to decide, said Debra Erenberg, director of state affairs for Justice At Stake, a nonpartisan Washington, D.C.-based group that advocates for policies to keep courts impartial. Polling has shown the public loses confidence in court decisions when judges fail to recuse themselves from cases involving substantial donors, Erenberg noted. Some groups have questioned whether it makes sense to elect judges at all. Washington is one of 22 states that choose high-court justices in contested elections, according to the Institute for the Advancement of the American Legal System at the University of Denver. In seven of those states, partisan affiliation of candidates must be indicated on judicial ballots. Thats not the case in Washington, where races are officially nonpartisan. Some state legislators  irked by the Supreme Courts school-funding mandates  proposed a bill this year to make Supreme Court candidates run in partisan races. The bill was mostly backed by Republicans, but also attracted a few Democratic sponsors. Washingtons system of electing judges is contained in the state constitution and so is unlikely to change anytime soon. Talmadge said elections are the proper remedy  as opposed to impeachment threats or other legislative overreactions. I believe in election of judges, he said. Thats the correcting feature  change the makeup of the membership.]", "Date": "20150912", "Title": "[State Supreme Court: activist justices, or just different?]", "Link": "http://www.seattletimes.com/seattle-news/politics/state-supreme-court-activist-justices-or-just-different/", "Author": "[Jim Brunner, Nina Shapiro]"}