{"Content": "[WERE watching the last days of a phony war in Olympia. Twice choosing to delay budget decisions, the state Legislature has deliberately pushed state agencies toward shutdown. Senate Republicans claim they are battling to save citizens from unnecessary tax increases. Surrendering on that point, House Democrats still insist the senators dont know how to count and that any new tax revenues  which will be necessary soon  need come only from a few rich people. In fact, both warring parties are looking to the 2016 elections and the next battle to control the Legislature. With conservative winds blowing nationally, our Republicans are thinking they might be able to capture the governors office and continue to weaken Frank Chopps grip on the House speakers office. Democrats count on the cyclic, pro-Democrat voting patterns of a presidential election year to recapture the Senate and resume full control. Hence the fake fight. The real goal of this slow-motion, low-energy Legislature has been the final news release. Each party knew from Day One that a last-minute deal could avoid shutting down state government. Both parties have long known that they absolutely must vote out a budget this year that (minimally) satisfies our state Supreme Courts demand for real progress on school spending. Beyond that, no need to hurry. Delay maximizes the political theater and multiplies the partisan payoff in next years elections. Months of posturing have cost all of us far more than the extra per diem paid when lawmakers gather (occasionally) in Olympia. The biggest single casualty of this political theater is our education system. Yes, each side appears to agree on a major increment in the Supreme Court-ordered McCleary spending. Both sides seem ready to join in persuading the court that they are successfully climbing the spending ramp toward the 2018 paramount goal of ample funding for the basic education of all children in the state. But the needs of our states education system go way beyond those legalistic parameters for K-12 spending. Our states future as a prosperous hub of innovation and manufacturing depends on our ability to increase immediately the numbers of successful high-school and college graduates. As Washingtons business leaders tell the Legislature over and over, they are hungry to hire. Lacking enough homegrown graduates, Washingtons marquee businesses are importing great numbers of high-skill professionals from elsewhere. And elsewhere is where our businesses are going to move unless we can rapidly ramp up our graduation numbers. The requirement is plain: We need to educate a lot of people. We will need many more ready-to-hire citizens in the years ahead. These days, to be ready to work requires almost everyone to earn a certificate or degree beyond high school. Most will have to return to the classroom every few years for updating. How to do that? First, lose fewer of the students already in school. Educators are attacking the dropout problem. But dropouts continue to leak in huge numbers from our underfunded high schools and colleges  especially among students from low-income, first-generation families without college-educated parents to show the way. Second, bring many more of our under- and unemployed young adults into our apprentice programs, colleges and universities. The fact is that our state has no economic future unless our Latino, African-American and other minority communities are fully and successfully part of our mainstream education system. But that is not the education system the backroom dealmakers are cobbling together this week in Olympia. Instead of strategic leadership, were getting political posturing and the budget shaving that automatically goes with pandering. Even if they somehow manage to satisfy the court on basic funding, our legislators will leave our overall education system too small, our teacher corps in crisis and way too many of our citizens fenced out. This was a missed opportunity. There are many fine legislators and some excellent leaders in each caucus in Olympia. Party bosses could have been leading the states voters to understand what our business leaders and our working families already know: Education works  lets have more.]", "Date": "20150624", "Title": "[Phony politicking in Olympia puts education at risk]", "Link": "http://www.seattletimes.com/opinion/phony-politicking-in-olympia-puts-education-at-risk/", "Author": "[Larry Seaquist]"}