{"Content": "[WASHINGTON (AP)  After the Senates derailing of Republican legislation halting federal dollars for Planned Parenthood, one thing seems clear: Many on both sides think they can ring up gains from the battle. Abortion-rights groups are already releasing TV ads attacking GOP supporters of the measure for stomping on womens health care needs. Conservatives are accusing Democrats of voting to protect taxpayer funds for an organization whose campaign contributions tilt lopsidedly to Democratic candidates. And each party was bracing to revisit the fight next month, when Congress returns from its summer recess and considers legislation keeping government agencies open after their budgets expire Oct. 1. Conservatives see that as an opportunity to keep Planned Parenthood money out of those bills. GOP leaders, concerned that their party could be blamed, would prefer to avoid a government shutdown battle with President Barack Obama. Senate Majority Leader Mitch McConnell, R-Ky. repeated that sentiment Tuesday, telling reporters that while congressional investigations of Planned Parenthood were just beginning, No more government shutdowns. The Republican drive was prompted by graphic videos secretly recorded by anti-abortion activists that show Planned Parenthood officials coolly describing how they sometimes provide fetal tissue to medical researchers. Abortion opponents say the recordings caught Planned Parenthood illegally selling the organs for profit, while Planned Parenthood officials  while apologizing for their workers businesslike words  say theyve abided by laws that let them recoup the procedures costs. The anti-abortion group, the Center for Medical Progress, released its fifth video Tuesday in which people posing as purchasers of fetal tissue for researchers question a Planned Parenthood official. As in previous videos, the official describes how her clinic retrieves tissue and technicians pick through fetal organs  including what looks like a small arm  in lab dishes. Also Tuesday, Senate Judiciary Committee Chairman Chuck Grassley, R-Iowa, said he had expanded his investigation into how Planned Parenthood obtains fetal tissue. He said he had now requested information from Planned Parenthood affiliates, private companies involved in the process and the Center for Medical Progress. Hed earlier sent questions to Planned Parenthood headquarters and asked the Justice Department about its enforcement of related laws. On Monday, the Senate voted 53-46 to advance a GOP bill terminating Planned Parenthoods federal funds. That was seven short of the 60 votes needed to keep the measure moving toward passage, effectively derailing it for now. Republicans expected to lose but envisioned political gain because the videos have fired up their core conservative, anti-abortion voters. Underscoring that, Tony Perkins, president of the anti-abortion Family Research Center, said Congress must take the next step and end Planned Parenthood funding when lawmakers return next month. The Republican measure calls for funneling Planned Parenthoods federal dollars to other providers of health care to women, including hospitals, state and local agencies and federally financed community health centers. Planned Parenthood and its allies say that would mean that many of its 2.7 million annual clients  many of whom are low-income women  would lose health care. National Right to Life President Carol Tobias said the movement against Planned Parenthood was gaining strength, calling it a long-term project and describing Planned Parenthood as a major backer of many Democratic senators. According to the nonpartisan Center for Responsive Politics, Planned Parenthoods campaign spending in the 2014 elections included $4.2 million in outside spending  which it used nearly exclusively to support Democrats or oppose GOP candidates. Planned Parenthood President Cecile Richards said Mondays vote showed the bill was a political nonstarter. Acknowledging that Republicans may continue the battle, she said: This fight may not be over, but were ready for it. A Planned Parenthood ally, NARAL Pro-Choice America, said it would run TV ads this week attacking three GOP senators seeking re-election in 2016: Kelly Ayotte of New Hampshire, Rob Portman of Ohio and Ron Johnson of Wisconsin. Its clear Senator Ayotte should not be trusted with womens health, the New Hampshire ad says. The House is expected to vote on legislation ending Planned Parenthoods federal aid when Congress returns. Planned Parenthood says it gives fetal tissue to researchers only with a mothers advance consent and in fewer than five states. Planned Parenthood receives more than $500 million yearly in government funds  including state payments  more than one-third of its annual $1.3 billion in revenue. By law, federal funds cannot be used for abortions except for cases of incest, rape or when a womans life is in danger.]", "Date": "20150804", "Title": "[More fights ahead on Planned Parenthood after Senate vote]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/more-fights-ahead-on-planned-parenthood-after-senate-vote/", "Author": "[ALAN FRAM]"}