{"Content": "[The partial government shutdown has ended but that doesnt mean anyone has a solid idea for dodging a potential sequel. The legislative stalemate was resolved last week, but a possible repeat could loom on the horizon. Lawmakers approved a budget that keeps the lights on through Jan. 15 and lets the Treasury Department continue to pay the countrys bills through Feb. 7. This can never happen again, Treasury Secretary Jacob Lew said Sunday. Added Senate Republican Leader Mitch McConnell: Therell not be another government shutdown, you can count on that. Thats not to say there is a solution at hand, and no one is rushing forward with alternatives to a potential repeat of the gridlock that shuttered parts of the government for more than two weeks and pushed the nation toward a default on its debt. The political price has been high ahead of 2014s midterm elections, especially for Republicans. I think there was some ground lost from the political point of view, said former Florida Gov. Jeb Bush, a potential 2016 presidential contender for the GOP. Democratic House Leader Nancy Pelosi of California reiterated the publics reaction to the partisan gamesmanship: I join the American people in their disgust at what happened in terms of the shutdown of government. But theres no real way forward to dodge a repeat and its chief architect, tea party favorite Republican Sen. Ted of Cruz, is urging one. Hundreds of thousands of government workers were sent home amid the shutdown and national parks were barricaded while politicians negotiated. The whole situation could be repeated early next year  combined with economic consequences, perhaps with more severe consequences. The deal this week was a lousy deal for the American people, Cruz said. Its not an ideal situation, but no one has a tangible way to avoid the threat of another shutdown. We just went through an awful period for our country, said Sen. Lindsey Graham, R-S.C. A standoff between President Barack Obama and a group of Republicans over spending for the budget year beginning Oct. 1 and defunding the nations health care overhaul led to the shutdown. Lawmakers also pushed the country to the edge of economic default by threatening the Treasury Departments authority to continue borrowing the money needed to pay the nations bills. The bitter feuding ended on Wednesday, and a group of House and Senate lawmakers has until Dec. 13 to produce a spending deal to stave off another shutdown and possible default in early 2014. There were really no winners, said Sen. Mark Warner, D-Va. I mean, our country took an economic hit. The public wont tolerate a repeat, said Sen. John McCain, R-Ariz. I am very confident the American people will not stand for another repetition of this disaster. Lew appeared on NBCs Meet the Press. McConnell, Warner and Graham were on CBS Face the Nation. Bush and Pelosi spoke to ABCs This Week. McCain and Cruz were on CNNs State of the Union. ", "Date": "20131022", "Title": "[Shutdown has ended but alternative to next potential crisis remains elusive]", "Link": "http://www.seattletimes.com/seattle-news/politics/shutdown-has-ended-but-alternative-to-next-potential-crisis-remains-elusive-1/", "Author": "[PHILIP ELLIOTT]"}