{"Content": "[Press that white button! This right here, the former secretary of state instructed a technologically deficient fan in New Hampshire who was fumbling to work an iPhone camera. Her patience thinning, Hillary Rodham Clinton took matters into her own hands and jabbed the button herself. And with the sound of an electronic shutter snap, another selfie  the must-have political souvenir of 2016  went up into the cloud for campaign posterity. Who wants their babies kissed or their yard signs autographed anymore? This is the Selfie Election. And if you are running for president, you have no choice but to submit. Candidates can now spend an hour  or sometimes two, as Sen. Rand Paul did last month in New Hampshire  exhausting a line of eager selfie seekers. Others, like Sen. Ted Cruz, have learned to add an extra 20 minutes at the beginning and end of events because so many people want pictures. Jeb Bush has perfected a technique suited to his 6-foot-3 frame: For his shorter fans, he will take the picture with his own outstretched selfie stick of an arm. The sons of Gov. Scott Walker have watched their father take so many, they say he has significantly polished his shutterbug skills. Gov. Chris Christies staff says he has taken too many to count. But as campaigns adjust to a new self-focused social-media world, some are left wondering whether more meaningful voter-candidate interactions are suffering. When candidates oblige so many people, some requesting multiple takes to straighten that smile, square a double chin or get a pesky photo bomber out of the frame, are they losing the chance to clarify a policy position, listen to concerns or even just look a voter in the eye?, Its self-serving, and the candidate is kind of screwed, said Craig Robinson, a former political director of the Iowa Republican Party. They just have to put up with it, because how do you decipher who is a fan and who wants to fill their profile with pictures of them with candidates? said Robinson, now the editor of The Iowa Republican, a political publication. Indeed, it is not always clear whether the people asking for photographs even like or plan to vote for the candidate they are posing with, or whether they just want a Facebook trophy to flaunt. Not all candidates care to oblige. Please stop, Ben Carson, the retired pediatric neurosurgeon and Republican presidential hopeful, wrote in a recent opinion piece for The Washington Post that raised a jarring if somewhat hyperbolic concern: Selfies kill. Beyond the obvious narcissism of endlessly photographing oneself and blasting it over social networks for others to admire, selfies are dangerous, he went on, citing a few examples of how inattentive selfie snappers had met their demise. (Falling off a cliff in Portugal, for example.), Former President Clinton has complained that he is inundated with requests whenever he goes out in public. At an event last year with another former president, George W. Bush, Clinton observed that even eating out had become a challenge  to which Bush cracked, At least theyre still asking. President Obama has had to draw the line before. I want to warn in advance, I cant do a selfie with everybody, he told a crowd last month. Few people embody the selfie craze like Maggie Fitzgerald, a lobbyist in Des Moines, Iowa, who has maneuvered her way into photos with politicians willing and unwilling. Her biggest gets: Donald Trump, Rick Perry and Gov. Bobby Jindal of Louisiana, whom she found eager and obliging, and Clinton, Paul and Carson, who seemed much less enthusiastic. Sometimes theyll ask me, Dont you want a normal picture? Fitzgerald said in an interview. No, I just want a selfie. She is undecided in the race, but said she gained some insight into the candidates by their demeanor during selfies. Most of them arent stiff about it, Fitzgerald added. Some of them might be. But they shouldnt be president. Then there are those who see the selfie as just one more example of how people have become slaves to their devices at the expense of human interaction. Queen Elizabeth II has said she finds the trend disconcerting and indicated she misses eye contact with her subjects. For security teams on the campaigns, all this close contact between candidates and strangers can be a challenge, but in some ways it is easier to monitor than a traditional rope line. That is because selfies keep peoples hands up where they can be seen. Many campaigns say they are benefiting after posing for all those pictures. When shared on Facebook and Instagram, they can exponentially increase a candidates visibility, spreading an authentic memento that helps extend the chatter around a rally beyond those who attended. This is something that campaigns should embrace and be very happy with, because its just free advertising, said Pauls chief digital strategist, Vincent Harris. The Paul campaign sees a branding opportunity. When people line up for photos, campaign aides often erect a backdrop with a Rand logo on it for people to pose in front of. These exercises have also resulted in a little horizon broadening for Paul, who picked up a new term on the trail: Us-ie, a selfie with multiple people. The ubiquity of camera phones at campaign stops is forcing aides to become proficient in operating different brands. Rick Tyler, an aide to Cruz, said the staff member who usually traveled with the senator was now well versed in how to quickly snap pictures with a Samsung Galaxy versus an iPhone. The demand for selfies has grown so much, he added, that even walking just a short distance from one event to another can be an ordeal. Our schedulers will say to me: Hes just going 100 steps. Why would it take 20 minutes to get there? Tyler said. Well, travel with us and youll see. Sen. Lindsey Graham said he could probably benefit from losing 15 pounds to make his selfies a bit more flattering. But his attitude toward selfies is upbeat: Society, he said, is richer for the selfie. When we take selfies and chat, its the beauty of American democracy, Graham said. I dont think Putin really does this, he added, referring to President Vladimir Putin of Russia. I dont think he probably has to worry about selfies. Sen. Marco Rubio will indulge people who want selfies. But he often travels with a professional photographer who takes photos of him with voters as an aide trails behind, handing out index cards listing a website where supporters can go to download their pictures. The benefit? Not only does the photographer speed the process and produce higher-quality images, but voters are asked to provide personal information on Rubios website. Before they can view their photos, Rubio supporters have told the campaign their name, their home and email addresses, which issues matter most to them and if they are willing to volunteer. Even voters who embrace the selfie culture can seem slightly conflicted. Just take Lincoln Boyd, 22, who sneaked up to the stage at a recent conservative gathering and captured a selfie with Rubio that quickly went viral. In a telephone interview, Boyd said he would have preferred to grill Rubio, asking him, Why werent you able to corral the Republicans to get behind immigration? But, he added, theres a time and a place for that. And, Boyd explained: Were millennials, its the 21st century, and if Im with the candidate and I can get a quick picture with him, Im going to do that.]", "Date": "20150704", "Title": "[The Selfie Election: snap, share  win?]", "Link": "http://www.seattletimes.com/nation-world/selfie-requests-shift-focus-of-presidential-campaigns/", "Author": "[JEREMY W. PETERS, ASHLEY PARKER]"}