{"Content": "[MANCHESTER, N.H.  Hillary Rodham Clinton turned to New Hampshire Democratic officials and county leaders Saturday for help in fighting the surging campaign of Sen. Bernie Sanders of Vermont, who holds a steady lead over her in state polls in the 2016 presidential primary race. It was Sanders, speaking after Clinton at the state partys annual convention in Manchester, who received more ecstatic cheers from the crowd, as he denounced big banks, trade deals, tax breaks for the wealthy and super PACs like the one supporting Clintons candidacy. Well, it certainly sounds like some people are ready for a political revolution, Sanders said to shouts of We love you, Bernie!, While Clinton received an enthusiastic reception, with people beating inflatable noisemaker sticks that her well-financed campaign passed out, the ovation for Sanders was striking because he is not a party member (he is a democratic socialist) and has far fewer endorsements than Clinton from members of the state political apparatus. The convention drew about 1,000 delegates, many of them traditional politicians and elected officials not unlike Clinton, and 3,000 other participants, many of them longtime avowed liberals like Sanders. Sanders acknowledged he had come a long way since joining the race nearly four months ago, when he had a fraction of the support of Clinton in the polls. What looked like a fringe campaign is now seen as a campaign that is standing up for working Americans, that is prepared to take on the billionaire class, Sanders said. I dont want their money. I dont want a super PAC. Were going to do it on our own. Clinton, by contrast, highlighted recent endorsements from the states governor, Maggie Hassan, and Democratic senator, Jeanne Shaheen, and at various points mentioned her husband, former President Clinton, a popular figure with New Hampshire Democrats. Bill Clinton, in his 1992 campaign, famously vowed to be there for you till the last dog dies, and Hillary Clinton put her own spin on the sentiment. If you want a president who will listen to you, work her heart out to make your life better and together to build a stronger, fairer, better country, then youre looking at her, she said, drawing particular cheers from women as she emphasized the female pronoun. She pledged to fight for equal pay for women and address income inequality, and again invoked her husband as an example of economic stewardship. When he got into the White House, he realized he had inherited real economic problems from his Republican predecessors  that seems to happen, have you noticed? Clinton said. But she is not running on her husbands coattails, she said, as she repeated a popular applause line from her stump speech. Im not running for my husbands third term or President Obamas third term. Im running for my first term, she said, in remarks that ran for about 40 minutes  twice as long as those of other candidates. One of them, Lawrence Lessig, a professor at Harvard Law School, gently chided her, noting that he would respect time limits for speakers. While the crowd applauded the attacks on Republican economic policies, some Democrats in the audience also displayed unhappiness with their own leaders. Scores of them heckled the chairwoman of the Democratic National Committee, Rep. Debbie Wasserman Schultz of Florida, over the partys decision to limit the number of debates for its presidential candidates to six, a decision that one candidate, former Gov. Martin OMalley of Maryland, said was rigged to help Clinton. At points the hecklers nearly drowned out Wasserman Schultz with More debates! and We want debates, and the chants grew so loud that she went off script and addressed them. Whats more important, driving the contrast with Republicans or arguing about debates? Wasserman Schultz said. Lets focus on our task at hand. GOP front-runner Donald Trump proved an easy source of applause at the meeting. OMalley drew one of his biggest ovations when he described Trump as that racist, anti-immigrant carnival barker and blasted the Republican field for stoking the grievances of Americans. They can have their anger and their fear, but they cannot go unanswered, OMalley said. Anger and fear never built a great country. OMalley did not dwell on the issue of Democratic debates, but he made his case for more of them during a news conference afterward. He noted that the New Hampshire Democratic faceoff was scheduled for the Saturday before Christmas, one of the busiest shopping days of the year, when few voters might be inclined to watch the televised debate. I think everyone in the party realizes we should not let the Republican debates go unanswered, he said.]", "Date": "20150919", "Title": "[Clinton and Sanders each a draw at New Hampshire event]", "Link": "http://www.seattletimes.com/nation-world/clinton-and-sanders-each-a-draw-at-new-hampshire-event/", "Author": "[Patrick Healy]"}