{"Content": "[WASHINGTON (AP)  Most Americans think the government should protect religious liberties over gay rights when the two come into conflict, a new Associated Press-GfK poll finds, though fewer think most businesses should be allowed to turn away gay couples because of religious beliefs. The survey uncovered nuanced views on gay rights as the Supreme Court considers, in a case heard this week, whether the Constitution gives same-sex couples the right to marry. Americans are more likely to say that religious liberties are more important for the government to protect than the rights of gays and lesbians, by a 56 percent to 40 percent margin, the poll found. Just a quarter of Americans call gay rights a very or extremely important issue to them personally, while half call religious liberties a very or extremely important issue. But fewer Americans  just 40 percent  think most business owners should be allowed to refuse service to gays and lesbians on religious grounds. That finding goes to the heart of the significant political fallout over Indianas Religious Freedom Restoration Act, which critics charged was intended to allow businesses discriminate against gays and lesbians. With public opinion apparently split, its an open question how gay rights will play in the 2016 campaign. Rev. Samuel Rodriguez, president of the National Hispanic Leadership Conference, said Republicans would be wise to make religious freedom a central issue because the broad debate highlights intolerance against Christians. Religious freedom will emerge as a centerpiece, and Democrats will have an impossible time defending against it, said Rodriguez, whose organization aligns with conservative Republicans on this issue. Others think the issue could be perilous for the GOP. Religious liberty works well with religious people, which is the GOPs base, but the argument is easily turned on its head when the issue is discrimination against gay people, said veteran Republican strategist John Feehery. I think the GOP is better off talking about economic security and national security, while leaving this particular issue to the courts to decide. Although only a minority of poll respondents thought businesses generally should be able to discriminate against gays or lesbians, support was stronger for letting wedding-related businesses in particular refuse service to same-sex couples  52 percent said so. That was down slightly since the beginning of February, when 57 percent said so in an earlier AP-GfK poll. The new poll found a distinct split between Republicans and Democrats on the issue. Most Democrats opposed any such discrimination by businesses; most Republicans thought businesses should have the right to refuse service, whether generally or for wedding matters. On marriage, just under half of Americans want it to be legal for gay and lesbian couples to wed in their states, while just over a third are opposed, according to the poll. There is a significant partisan divide over that issue, too, but it could be a moot point in the 2016 campaign if the Supreme Court affirms same-sex marriage. On the court case, 50 percent said the justices should rule that gay marriage must be legal nationwide; 48 percent said they should not. Kelly Huston, a retired autoworker from Newtown Falls, Ohio, says he doesnt object to gay marriage, just as he doesnt object to a business refusing to serve gay patrons. I think a business owner should decide what they want to do in their business, Huston said. Im not against gays. Im against the government telling people how to run their businesses. The issue could play differently in some regions than others. For example, the survey finds 60 percent of Southerners, but only 45 percent of Northeasterners or Westerners, say wedding-related businesses should be allowed to refuse service to gay couples. In New Hampshire, which hosts the nations first presidential primary election, a leading Republican official warns prospective candidates against a heavy focus on religious freedom. For the average Republican presidential primary voter in New Hampshire, thats not one of the top six or seven issues, said Steve Duprey, New Hampshires national Republican committeeman. I dont think theres anybody who could win the New Hampshire primary running on religious liberty. ", "Date": "20150429", "Title": "[AP-GfK Poll: Nuanced views on gay rights, religious liberty]", "Link": "http://www.seattletimes.com/nation-world/ap-gfk-poll-americans-evenly-split-on-gay-marriage-case/", "Author": "[EMILY SWANSON, STEVE PEOPLES]"}