{"Content": "[WASHINGTON (AP)  When Hillary Rodham Clinton takes the stage at fundraisers thrown by a group that wants to elect her president, shes not presented as a White House candidate. Shes a special guest. When Jeb Bush raises money for a group preparing to run major parts of his all-but-certain presidential campaign, he doesnt ask for the cash himself. And the hundreds of millions these groups will raise? They have to spend it without talking strategy with the candidates and campaigns they support. The groups are called super PACs, and their influence in selecting the next president will be without precedent. Born out of two Supreme Court decisions in 2010, they are governed by rules some see as a game of winks and nods, enforced by an agency bedeviled by partisan gridlock. As with most things in Washington, theres not even agreement on whether they are a problem to solve, or are a solution to celebrate. Whats really going on largely is a breakdown of the enforcement system of the campaign finance laws, says Craig Holman of the left-leaning consumer group Public Citizen. The Federal Election Commission is just broken. Counters David Keating of the right-leaning Center for Competitive Politics, I think this is overblown. The line has been drawn: Its the First Amendment. So if people want to speak, let them. The primary benefit for campaigns of the super PACs is that they can raise and spend unlimited amounts of money to advocate for and against candidates, with only a few rules holding them back. Among the rules is a ban on campaigns and super PACs working together. They cannot discuss political strategy or share key information such as internal polling. While candidates can attend super PAC events, they cannot technically ask for the unlimited donations that make the groups such a powerful force. Most of these super PACs that are going to be spending millions of dollars, I think they have a good understanding of what the law is, Keating said. But even should they break the rules, there are questions about what price they might pay. The six commissioners of the Federal Election Commission are split evenly between Republicans and Democrats, and they have only once cited someone for breaking the rules. In February, the campaign manager for a failed Virginia Republican congressional candidate pleaded guilty to funneling money illegally from a super PAC to bolster his campaign. Clinton has decried the existence of unaccounted money in politics and has suggested a constitutional amendment to overturn the case that helped usher in the new system. Yet during a California fundraising trip last week, she took her first steps to embrace Priorities USA Action, a Democratic super PAC that helped support President Barack Obama in 2012. Like other candidates, Clinton cannot legally ask donors to give more than $5,000 to the group. But she can appear as a special guest. Her husband, former President Bill Clinton, has headlined Priorities events in the past. On the Republican side, Bush is taking it even further. The former Florida governor is preparing to delegate many of the operations of his expected campaign to his allied Right to Rise super PAC, using the group to produce campaign ads, conduct voter data analysis and run get-out-the-vote efforts. Mike Murphy, one of Bushs closest political advisers, is expected to lead the super PAC and is intimately involved in Bushs current operation, where he guides staffing decisions, courts donors and shapes political strategy. Bush takes care to say hes not yet a candidate, allowing him to work with Murphy and the super PAC in a way that wont be allowed once hes in the race. A dozen White House prospects are already benefiting from allied super PACs, which are frequently led by former political advisers and business partners. For example, Kentucky Sen. Rand Paul will benefit from a super PAC run by his former campaign manager, who is also married to Pauls niece. Texas Sen. Ted Cruzs college roommate is working prominently in a network of four allied super PACs, while a longtime friend and financial backer, Dathan Voelter, is the treasurer. Voelter said the pro-Cruz groups have already raised more than $31 million. During his run for re-election in 2012, Obama never really warmed up to the super PAC world and the group supporting him, Priorities USA Action. He declined to appear at fundraising events even though his opponent, Republican Mitt Romney, frequently attended gatherings held by Restore Our Future, a pro-Romney super PAC. Seeking to succeed Obama in the White House, Clinton and her allies have taken steps recently to strengthen Priorities USA Action. Among them: She will appear at the groups events and reach out to potential donors, something Obama declined to do. The group is also bringing aboard Guy Cecil, a former staffer on Clintons 2008 presidential campaign who remains close to Bill Clinton and previously worked for a firm stocked with longtime Clinton advisers.]", "Date": "20150511", "Title": "[Super PACs rise in influence in 2016 campaign]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/super-pacs-rise-in-influence-in-2016-campaign/", "Author": "[KEN THOMAS, STEVE PEOPLES]"}