{"Content": "[WASHINGTON  Republican presidential candidate Carly Fiorinas decision to release two years of tax returns did more than reveal the former Hewlett-Packard chief executives $59 million fortune: The longshot contenders move won her props for transparency and, more important, increased pressure on other 2016 contenders to follow suit. Fiorinas attention-getting move last week has the potential for being a game-changer. Joseph Thorndike, a historian and author who studies the political economy of American taxation, cant recall any other major candidate who has revealed so much about personal finances this early in the campaign cycle. Not so coincidentally, Fiorinas disclosure comes at a time Democratic front-runner Hillary Rodham Clinton has been under fire for the complexity of her familys financial arrangements. Candidates for federal office and elected officials are legally required to file personal financial disclosures with the Federal Election Commission to let the public know about any potential conflicts of interest. But the forms are notoriously vague (filers list their assets and liabilities in broad categories of value, rather than precise dollar amounts) and loophole-ridden (spousal income, while included, can prove difficult to parse, and home values dont have to be included). Over the years, many candidates for office  usually those with modest incomes and wealthy opponents  have chosen to go the extra mile by releasing tax returns. Fiorina stands out because she voluntarily listed her considerable holdings in exact dollar amounts without being pressured to do so. Theres no law compelling disclosure but theres a lot of moral pressure we place on candidates, Thorndike noted. Richard Nixon was the first president to release his tax returns (while under investigation), Thorndike added, after which it became standard practice for presidents and, increasingly, candidates. As reported by The Wall Street Journal, Fiorina and her husband have a net worth of $59 million, making her one of the wealthiest candidates in the race so far. According to their 2013 tax return, the Fiorinas earned nearly $2 million that year, placing them among the highest earners in the top 1 percent of the population. They reported $1.3 million in income for 2012. In 2012 and 2013, they paid an effective tax rate of 30 percent, according to the Fiorina campaign. They also gave an average of 14 percent of their income to charity in those years, the campaign said. Fiorina and her husband, Frank, a retired AT&T executive, filed an extension on their 2014 tax return. No one enjoys turning over private documents for public scrutiny, and candidates often drop out of a presidential race before making such disclosures or wait until as late as possible before offering up the intimate details of their financial lives. In 2012, Mitt Romney faced mounting pressure to disclose his returns from Republican rivals and Democrats before he buckled and released two years worth. The reason for his stall was readily apparent: The returns provided ammunition for the Obama campaign, and its allies proceeded to hammer the wealthy former private-equity executive for paying a lower effective tax rate (roughly 14 percent) than many middle-class Americans. The returns served to bolster the presidents narrative about Romney as member of a wealthy elite that helps itself to upper-end tax breaks. A former Romney campaign spokesman confirmed that the pressure to release the returns eventually became too much. We had Harry Reid lying on the floor of the Senate about Mitt Romney not paying taxes. And the press corps continued to push for the returns. It was a distraction for the campaign, said Ryan Williams. Compared to the federally mandated personal financial-disclosure forms, tax returns shed more light on how certain policies might affect the candidate, said Dan Auble, a senior researcher at the nonpartisan Center for Responsive Politics. Especially for the wealthy, whose finances tend to be more complicated, the tax return can provide context that informs debate. He noted that tax returns include information that personal financial-disclosure forms do not, such as tax deductions used by the candidate, charitable giving and real-estate loans. That may be cause some heartburn for wealthy longtime politicians like Clinton and Republican Jeb Bush  both of whom have released tax returns in the past but both of whom are believed to have become significantly wealthier since their last disclosures. Between his first 1998 and 2002 gubernatorial races, Bush disclosed 20 years of returns. In 2002, his tax return revealed a nosedive in income once he took office. Now hes been out of office for decades and has reportedly made millions serving on corporate boards and giving speeches. Clinton released seven years of tax returns during her 2008 run for the White House (in addition to more dating back to Bill Clintons tenure as governor of Arkansas). But she hasnt released any since she became secretary of state in 2009; her more recent tax returns will surely generate interest given the recent spotlight on the mammoth speaker fees that she and her husband have been able to command since leaving office, turning them from a couple who was dead broke, as Hillary Clinton controversially put it, upon leaving the White House, into multimillionaires. There are a variety of reasons candidates may not want to release their tax returns. For instance, people whove had a lot of sophisticated tax advice about how to minimize their taxes might not want that on display for everyone to see, Thorndike said. Anything that seems unusual to regular voters. Most of us have nothing close to that. Other candidates who have made their returns public include Sen. Ted Cruz, R-Texas, who released five years worth of taxes in 2012, when he was running for the Senate; Rubio, who released nine years of returns during his 2010 Senate run; former Texas Gov. Rick Perry, who disclosed his taxes from 1987 to 2010; and former New York Gov. George Pataki, who last released his returns in 1994. I believe that every serious candidate will release their tax returns, said Thorndike. Dave Levinthal, of the Center for Public Integrity, said the politics of tax returns arent always earthshaking. Then again, he wrote in an email, to paraphrase Donald Rumsfeld: You dont know what you dont know.]", "Date": "20150606", "Title": "[Carly Fiorinas tax-return move puts pressure on rival candidates]", "Link": "http://www.seattletimes.com/nation-world/carly-fiorinas-tax-return-disclosure-pressures-other-2016-candidates-to-do-the-same/", "Author": "[Sahil Kapur]"}