{"Content": "[The abortion battle has long been laden with symbolic images. On Friday morning, the House voted to block Planned Parenthoods federal funds for a year so it could investigate claims of the groups wrongdoing. The alleged wrongdoing went viral in videos with headlines such as Planned Parenthood Uses Partial-Birth Abortions to Sell Baby Parts, (viewed 3million times). The agency said the video was edited to make it appear laws were broken. The videos were a major part of this weeks GOP presidential debate. Fridays vote had been along party lines, and the symbolism included a poster-sized photo of a scarred, aborted fetus. Conservatives threatened a government shutdown if the funding isnt cut off. On Friday morning at the Seattle headquarters of Planned Parenthood, it was the other sides turn for symbolism. Fifty young women, many in pink T-shirts, surrounded Sen. Patty Murray. The women carried signs, also pink, that said, Dont take away our care. Murray talked about this Tea Party tantrum in prepared comments not dissimilar from previous ones shes made on the issue. She was standing in the lobby of the centers offices on East Madison Street, 2,100 miles from the Texas State Capitol in Austin. Texas already has stripped the agency of most government funding, state or federal. The symbolism at the womens health center on East Madison Street included 25-year-old Justis Phillips. Shes a cloud-computing project manager, and later admitted that at first she was nervous talking so personally. But, she said, I have a theater background and I like to command a room. And, said Phillips, I think people are more respectful to things when you give them a personal anecdote. She told about getting a Pap smear a few years ago that came back abnormal. Planned Parenthood was there to ease my anxiety and overactive imagination with scientifically accurate information, statistics and also compassion, she said. They also implanted my free copper IUD, which just so happens to have been the most empowering choice Ive ever made for myself. Phillips grew up in Denton, Texas, just outside of Dallas, and came to Seattle two years ago. Refreshing, she said about living here. Also speaking at the media event was Chris Charbonneau, head of Planned Parenthood of the Great Northwest and the Hawaiian Islands. She went through her talking points, such as how more than half the centers were in rural areas, and that without Planned Parenthood, there would be no other place for many patients. Afterward, she also talked about the new reality for employees at Planned Parenthood:, The assumption that they could be surreptitiously recorded, for viral videos such as made by The Center for Medical Progress, the anti-abortion group. She said workers for her group now receive training in recognizing potentially suspicious interviewers or exchanges. How will the abortion issue play in our regional politics, in which Seattle makes the state lean liberal?, I wouldnt think its the top issue, or even among the top three issues, said pollster Stuart Elway. We have a solid history of supporting choice. Were a pretty blue state. Its the fire-breathing Republican Congress who are pushing this. Chris Vance, the states former GOP chairman, is running against Murray in the 2016 election. Hes certainly a long ways from fire-breathing on the issue. Vance says that if an investigation finds that Planned Parenthood broke the law, as the viral videos claim, then different organizations need to be found to provide the same services. But until then, funding for Planned Parenthood stays, he said. There cannot be any interruption in those services, said Vance. The media event at Planned Parenthood was over within an hour. Afterward, in the parking lot, there was a different image, and probably more common at the agency. A young couple emerged from a car, and they walked in, holding hands. They looked anxious. Appointment time.]", "Date": "20150918", "Title": "[After House vote, Planned Parenthoods turn for symbolism]", "Link": "http://www.seattletimes.com/seattle-news/politics/after-house-vote-planned-parenthoods-turn-for-symbolism/", "Author": "[Erik Lacitis]"}