{"Content": "[Gov. Scott Walker of Wisconsin and his wife, Tonette, had planned to spend a recent Friday evening at the Nashua home of Jennifer Horn, the New Hampshire Republican chairwoman. Then he heard about Al, the Horns beloved Dalmatian-Catahoula Leopard mix. The dinner was promptly moved to a restaurant in nearby Bedford. The governors allergic to dogs, Horn explained. And we have a very hairy dog. Campaign finance: Two watchdog groups have filed election complaints against four unannounced  but likely  presidential candidates, saying theyre flouting campaign-finance laws by raising money and traveling to early primary states without acknowledging that theyre testing the waters for a presidential bid. The Campaign Legal Center and Democracy 21 filed the complaints with the Federal Election Commission against three Republicans: former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker and former Pennsylvania Sen. Rick Santorum, and former Maryland Gov. Martin OMalley, a Democrat. Clinton emails: The House of Representatives committee thats investigating the 2012 fatal attacks on the U.S. diplomatic compound in Benghazi, Libya, formally asked Hillary Rodham Clinton on Tuesday to appear before lawmakers for a closed-door interview to answer questions about the use of a private email account while she was secretary of state. Rep. Trey Gowdy, R-S.C. chairman of the House Select Committee on Benghazi, sent a letter to Clinton on Tuesday asking that she sit for a transcribed interview regarding her use of private email and a personal server for official State Department business by May 1. Seattle Times news services, The attention to Walkers likely candidacy for the Republican presidential nomination has focused on weighty matters such as his battles with the left, faltering forays into foreign policy and solid conservative stances on social issues including abortion and gun rights. But little notice has been given to an area in which he faces a different sort of constitutional challenge: overcoming his aversion to mans best friend. Jeb Bush can lament how he lost a Labrador (named for his brother Marvin) to cancer. Marco Rubio has a Shih Tzu, with a name like a gift from heaven: Manna. Ted Cruz goes one better: His rescue mutt is called Snowflake. (Dear Jesus, please, please, PLEASE bring us a puppy, his daughters prayed, according to Cruzs Facebook page.) And if Walker makes it to November, he could face Hillary Rodham Clinton and her toy poodle, Tally. Walker, who gives a gloomy stump speech filled with worry, perhaps could use a four-legged image softener of his own. But he is allergic to dog dander, an aide confirmed. And in that, he is running against the long sweep of U.S. political history. If the ritual for presidential candidates wooing American voters had a handbook, must love dogs would be somewhere near the front. At the Newseum in Washington, the First Dogs: American Presidents and Their Pets exhibit is listed as on display indefinitely. On the National Mall, the memorial to Franklin D. Roosevelt depicts his Scottish terrier, Fala, forever at his feet. Puppy love in presidential campaigns dates at least to Herbert Hoover, who loosened up his stiff and sober image by posing, paws in hands, with King Tut, his Belgian Malinois, on the way to victory in 1928. It humanizes them, said Claire McLean, founder of the Presidential Pet Museum. It shows that they are just like me and you, with the kids and the dog. The potential contenders in the 2016 field are quick to offer furry proof of their humanity. Clinton and Tally posed in People magazine. Vice President Joe Biden shows grade-schoolers pictures of his dog Champ. The list goes on. Martin OMalley, the former Maryland governor, has Rex, a cocker spaniel, and Winston, a mutt. Gov. Rick Perry of Texas has a dachshund, a black Lab, a mutt and a Griffon named Duchess. Ben Carson, the retired neurosurgeon, has a German shepherd named Echo; former Sen. Rick Santorum has spent the last year mourning his own shepherd, Schatzie. Even candidates who are not dog owners strongly hint that they intend to become dog owners: A spokeswoman for Bobby Jindal said that he likes dogs! and is looking to get one when he leaves the Louisiana governors mansion. Walkers allergies prevent such a possibility, a situation that his spokeswoman called unfortunate because he loves animals. (In fairness, Walker, who had a fish growing up, is not the only allergic White House aspirant: Gov. Chris Christie of New Jersey is also allergic to dogs, and his children had to settle for a goldfish.), In a possible sign of his will to win, Walker has managed to suppress his allergic reactions in the past. In 2010, during his initial run for governor, he greeted Lisa Bell, a Republican activist who had been tossing her Wire Fox terrier, Diva, in the air during his speech. Bell recalled that Walker was very nice to the dog and pet her. Perhaps to compensate for his difficulty, Walker has reached out to more exotic animals. He did the bear encounter and giraffe encounter, said Judith Domaszek, who runs Wildwood Wildlife Park in Minocqua, Wis. which Walker visited last summer. She said he petted and fed fruit juice to a kinkajou, a small mammal often called a honey bear. He had no problems there, and they have lots of dander, Domaszek said. While earlier presidents preferred horses or birds  William McKinleys Mexican parrot was said to be named Washington Post  dogs have a more storied presidential history. President Hardings Airedale terrier, Laddie Boy, had his own chair at Cabinet meetings. Republicans accused FDR of sending a destroyer to the Aleutian Islands to pick up Fala, who had his own secretary. Richard Nixon may have saved his spot on the Eisenhower ticket in 1952 with his televised speech focusing on his daughters cocker spaniel, Checkers. And President Lyndon Johnson appalled reporters by lifting his beagles, Him and Her, by their ears. Candidates would be unwise to try that. It was often noted in 2012 that Mitt Romney once drove from Boston to Canada with the family Irish setter, Seamus, in a crate on the roof of the car. Seamus survived. But presidential dogs have met their ends in poignant ways. President Lincolns Fido, a yellowish-brown mongrel, was killed by a knife-wielding drunk not long after the presidents assassination. President George W. Bushs dog Spot had a series of strokes, and Bush communed with her on the South Lawn, stroking her head to say goodbye before having her put down. President Reagan had Victory, Rex and Lucky. Years later, amid the fallout of the Monica Lewinsky scandal, President Clintons Buddy was the only member of our family who was still willing to keep the president company, Hillary Clinton later wrote. (Post-presidency, Buddy was run over by a teenage driver in Chappaqua, N.Y.), A possible solution to Walkers pooch problem came when Sen. Edward M. Kennedy gave President Obama a low-dander Portuguese water dog; the presidents daughter Malia, like Walker, has allergies.]", "Date": "20150331", "Title": "[Scott Walkers dog allergy could be a campaign hazard]", "Link": "http://www.seattletimes.com/nation-world/scott-walkers-dog-allergy-could-be-a-campaign-hazard/", "Author": "[JASON HOROWITZ]"}