{"Content": "[James Williams was worried when his son was born three months ago. The Tukwila resident, 33, couldnt help but think that his son and other black newborns could one day be behind bars. Hes specifically concerned about the King County Children and Family Justice Center, set to begin construction in spring 2016 and open in fall 2019. This jail  theyre building it for those babies to fill, said Williams, who works with a group called Ending the Prison Industrial Complex (EPIC). Its why Williams and representatives from Seattle King County NAACP, EPIC and Youth Undoing Institutional Racism (YUIR) say a Seattle Office for Civil Rights racial equity examination of the proposed jail failed to dig into its impacts  both racial and economic. The report was released in June. About 30 young people, many of them people of color, stood behind a group of speakers at a Wednesday news conference outside the Bethany United Church of Christ in Beacon Hill, mentioning alternatives they would prefer to incarceration, including dance, basketball and tutoring programs. In March, the county announced it would reduce the number of jail beds in the center to 112 in an effort to address the disproportionality of jailed black youth. We live in the only county in America thats actually named after Dr. King himself, but this is exactly the process were going through by spending a quarter of a billion dollars to lock our youths up, said Gerald Hankerson, Seattle King County NAACP president. Opposition to the proposed juvenile court and detention facility has bubbled since 2012, when King County voters supported a nine-year levy increase to provide $210 million for the project. More than 60 organizations oppose the youth jail, according to a statement by the organizers of Wednesdays news conference. NAACP notes that African Americans account for nearly 1 million of the 2.3 million people incarcerated nationwide. Blacks are 8 percent of King Countys youth but total half the juveniles in detention, King County Executive Dow Constantine said in his April 2015 State of the County address. In 2015, we cant deny that your ZIP code and the shade of your melanin will be the determinant of where you end up as an adult in your life, said Sheley Secrest, Seattle King County NAACP economic chair. The reports recommendations include providing quality medical, mental- and behavioral-health services, designing detention spaces that can be converted to non-detention spaces in the future, and holding youth who could be processed in the adult system in a youth facility, not an adult jail. An overarching goal is eliminating the need to detain or incarcerate youth at all. It didnt satisfy the opposition groups, who say the county missed an opportunity to look at the jails overall impacts. The report reinforced many of the points raised by jail opponents, Williams said, but didnt propose any alternatives to the detention center. Everyones talking about zero detention, Williams said. If were serious about making that a goal, we shouldnt proceed full speed ahead.]", "Date": "20150805", "Title": "[Groups say Seattles racial assessment of youth jail missed the mark]", "Link": "http://www.seattletimes.com/seattle-news/politics/conference-youthjail/", "Author": "[Seattle Times staff]"}