{"Content": "[Workers who make minimum wage are a meager 1.5 percent slice of the local job market, but their numbers nearly doubled over the past two years. Among them is Dallas Brazier, who struggles to get by on $9.19 an hour despite carefully managing his expenses. He lives with an aunt in Tacoma and takes the bus to his job at Burger King in South Seattle. Brazier, 28, also is part of a growing movement to raise the minimum wage to $15 in Seattle. Im marching to help improve workers rights and create equal opportunity, Brazier said during a 13-mile protest march from SeaTac to Seattle City Hall, one of a series of rallies nationwide calling for a $15 living wage. I feel I deserve to be paid more because I go above and beyond, and I like my work. Even so, a $15 wage floor would cover way more than the 14,400 jobs in King County that pay only the current minimum. Statewide, about a quarter of workers in October earned less than $15 an hour, or $31,200 a year on a full-time basis. A lot of the extremes of the economy are settled in Seattle. We have a robust tech sector. But we also have a lot of restaurants, bars, hotels and retail, not to mention home and health-care workers, said Marilyn Watkins, policy director at the Seattle-based Economic Opportunity Institute. Those are all people who are going to be below that $15-an-hour range. Seattle now finds itself at the forefront of a national push by labor leaders to boost the minimum wage to a more livable level and ease poverty. Bolstered by a supportive new mayor and a socialist City Council member, activistsaim to bring Seattle in line with SeaTac, where voters last month narrowly approved a $15 minimum wage for airport-related workers. Were carrying the $15 victory from SeaTac to the destination of our next victory, said Working Washington spokesman and march organizer Sage Wilson.  ,  National restaurant-industry leaders    lambasted the pay-raise efforts as harmful to workers and the economy, but critics locally chose a muted response to the idea of a $15 minimum wage. Rather than getting our backs up, we want to approach this from the angle of looking forward to working with city leaders and trying to find a solution that works, said Anthony Anton, president of the Washington Restaurant Association, which opposed SeaTacs $15-an-hour ballot measure. What we dont want to do is draw a line so early that we cant have a conversation. Washingtons minimum wage of $9.19 is the highest of any state in the nation and will rise to $9.32 on Jan. 1 due to an inflation adjustment. A national economic recovery heavily skewed toward low-paying jobs has fueled fears that the middle class is shrinking and has brought new attention to the income gap between rich and poor. Theres a middle class thats shaken by the crisis and feels insecure, said Michael Reich, director of the Institute for Research on Labor and Employment at the University of California, Berkeley. Somebody who lost their job making, say, $60,000 or $70,000 a year maybe now makes $30,000 or $40,000. The next step below that is minimum wage. Nationwide, nearly 40 percent of jobs last year paid less than $15 an hour, up 3 percentage points from 2009, according to the Seattle-based Alliance for a Just Society, a national network of grass-roots community organizations.  In King County, full-time jobs that pay within 2 percent of minimum wage  or less than $9.38  represented 1.5 percent of the work force in 2012, up from 1.2 percent in 2011, state Employment Security Department data show. Employers countywide added the equivalent of 6,750 full-time minimum-wage jobs from 2010 to 2012, an 88 percent increase. Early in the recovery, we saw a lot of job growth in manufacturing, particularly aerospace, as well as professional and business services, said Anneliese Vance-Sherman, a regional labor economist at the Employment Security Department. But then the momentum shifted to sectors with a lot of low-wage jobs, and that would explain the jump. Its not known how many workers in Seattle would be directly affected by a   minimum- wage increase to $15. Detailed pay information by city or county, beyond the minimum wage, is scant. And while the Seattle City Council has set aside $100,000 to study a $15 wage, that wont be done until June. Mayor-elect Ed Murray, who will lead the study, has promised to bring organized labor and business groups to the bargaining table. He also has said he supports a phased-in approach, starting with city workers and then extending it to employees of national retail and fast-food companies. Likewise, a majority of city council members say they support a $15 minimum wage, but they point to the potential for a lengthy ramp-up to give employers time to adjust, or exemptions for small businesses. Others call for a greater sense of urgency. Socialist Kshama Sawant, who campaigned on a $15 minimum wage in her successful bid for a council seat, vows to put it to a public vote with a 2014 ballot initiative if the process drags on. Its really quite astonishing how much momentum this movement has gathered within the past year, said Ben Henry, a senior policy associate at the Alliance for a Just Society. This is the first time we might actually get a minimum wage that at least comes close to what it takes to live.  President Obama and congressional Democrats are pushing federal legislation that would gradually raise the U.S. minimum wage to $10.10 from $7.25 and peg it to inflation. But the bill faces an uphill battle in the Republican-led House of Representatives. Meanwhile, some states and cities are taking matters into their own hands. The Washington, D.C. City Council last week approved an increase in the minimum wage to $11.50 an hour from $8.25 by 2016. Last month, New Jersey voters passed a statewide minimum standard of $8.25. And in September, California lawmakers committed to raising the states wage floor to $10 from $8 by 2016.  The Alliance for a Just Society estimates that working full-time at minimum wage in Washington state provides just   57 percent of what a single adult needs and only a third of what a parent of two children needs to get by. Labor activists also argue that a $15 minimum wage would reduce costs for public-welfare programs, such as food stamps and Medicaid, while stimulating consumer spending and boosting the economy.  Michael Reich, the UC-Berkeley economics professor, said he has studied San Franciscos decade-old minimum-wage ordinance and found that businesses benefited from lower staff turnover and higher productivity. He noted that small businesses were given two years to adjust to the new law. The California minimum wage was $6.75 in 2004 when San Francisco set its own standard of $8.50, plus annual inflation adjustments. The citys minimum wage will increase next month by 19 cents to $10.74  well below the $15 talked about in Seattle. Based on San Franciscos experience, it has all worked out well, Reich said. Even in a low-wage industry like restaurants, employment has grown faster in San Francisco than in surrounding counties. But opponents say a $15 minimum would drive up the costs of doing business in Seattle, causing significant job losses and price increases. They also argue that businesses already are on the hook for a range of new regulations, from the U.S. Affordable Care Act to the 2011 Seattle paid-sick-leave ordinance. Whats more, workers accustomed to making several dollars more than minimum wage might not be content to go to only $15 along with everyone else. Weve had some fairly lackluster economic growth for a while. Folks can be frustrated with that. But Id caution against a knee-jerk reaction to force businesses to pay people more because that comes with unintended consequences, said Maxford Nelson, a labor-policy analyst at the Freedom Foundation in Olympia. Our solutions need to be more about fixing the economy and getting things running again, he said. That will improve wages and opportunities for folks. Meanwhile, some minimum-wage workers say $15 would mean financial freedom. Martina Phelps, 21, who participated in Thursdays protest march with her 5-year-old niece, Emonie, said its hard making ends meet on the $9.25 an hour she earnsat McDonalds on Capitol Hill. She smiled at the prospect of a $5.75-an-hour pay raise. I could go back to school, pay for my medication  I just found out Im diabetic  and live by myself, she said. Others hope the $15 movement spreads beyond Seattle. Karl Balogh, 28, makes $10.75 at McDonalds in Gig Harbor and $9.19 at Arbys in Tacoma. All told, he works 60 to 70 hours a week to make ends meet. This is just the next step, Balogh said of the push for $15 in Seattle. From there, well take it to wherever we can, hopefully Tacoma. Amy Martinez: 206-464-2923 or amartinez@seattletimes.com. On Twitter: @amyemartinez]", "Date": "20131207", "Title": "[Seattle on front line of push for raising minimum wage]", "Link": "http://www.seattletimes.com/business/seattle-on-front-line-of-push-for-raising-minimum-wage/", "Author": "[Amy Martinez]"}