{"Content": "[NEW YORK  Republican Jeb Bush slow jammed the news, told about meeting his wife, offered a guacamole recipe and oddly compared his presidential father and brother during a Tonight show appearance. One day after announcing his bid for the presidency, Bush entered the entertainment world on the nations most popular late-night talk show. Americans dont expect their presidents to be song-and-dance entertainers, but they at least expect them to appear comfortable and quick-witted opposite television hosts. He was featured Tuesday night on the shows recurring slow jam the news skit with host Jimmy Fallon. The job required Bush to recite lines about his candidacy while Fallon, stylized as a 1970s soul man and backed by the Roots, offered a series of double entendres. Bush took the straight man role that was most often filled by NBCs suspended anchorman, Brian Williams. When soul man Fallon asked about immigration, Bush gave his answer in both English and Spanish. Whoa, hold the telefono, Fallon said. I know you just got back from Miami, but I didnt realize I was interviewing Gov. Pitbull, he said, referencing the Miami-born rapper. Later, an interview with Bush was sandwiched in between appearances by comic Billy Crystal and rock singer Courtney Barnett. Fallon brought up the time Bushs mother, former first lady Barbara Bush, made a comment about having enough Bushes in the White House. Jeb recalled watching the interview. She did it without telling me, he said. Thanks, mom. Shes coming around, thankfully. Asked by Fallon about how he differentiates himself from his father and sibling George W. Bush, Jeb Bush said that former President George H.W. Bush is the most perfect man Ive ever met. My brother, I would say, is a significantly better artist than I am, he said. Bush talked about meeting his wife when he was in Mexico helping to build homes. He knew little Spanish at the time and she didnt know English, but when youre in love you can overcome these problems pretty quickly. Theres another language, he said. In a sense, the appearance was a meeting between two rookies. Bush is new to the national stage, and Fallon is getting ready for his first presidential campaign as a late-night comic in an election where the two most politically savvy late-night hosts, David Letterman and Jon Stewart, will be off the scene. Fallon asked no tough questions and seemed to hold pretty tightly to a script, once impersonating Regis Philbin talking about Bushs campaign signs. Bush is the first candidate of the 2016 cycle to appear on Fallons show. The candidate smiled stiffly during a commercial break as Fallon read a series of promotions to insert in local NBC newscasts that air just before his show. Fallon noted that Tonight had a lot of younger viewers, and wondered what type of message Bush would offer them. I think we need high, sustained economic growth so they can get jobs, he replied. Fallon wondered what his message would be to older voters. I think we need high, sustained economic growth, he said. To them, I would just say it louder.]", "Date": "20150616", "Title": "[Jeb Bush slow jams the news with Fallon]", "Link": "http://www.seattletimes.com/nation-world/jeb-bush-slow-jams-the-news-with-fallon/", "Author": "[DAVID BAUDER]"}