{"Content": "[WASHINGTON (AP)  Seeking to avert a government shutdown, Republican leaders drove a bill blocking Planned Parenthoods federal funds through the House on Friday, hoping to contain conservatives demands for a politically risky showdown with President Barack Obama by striking a quick blow against abortion. The nearly party-line 241-187 vote followed a no-holds-barred debate that included a graphic, poster-sized photo of a scarred, aborted fetus and underscored how abortion has resurfaced as a white-hot political issue. The battle has been rejoined just in time for the 2016 election campaign and next weeks historic address to Congress by Pope Francis. The issues re-emergence followed the release of secretly recorded videos of Planned Parenthood officials offhandedly discussing how they sometimes procure tissue from aborted fetuses for medical research. The anti-abortion activists who made the videos say they show that Planned Parenthood is illegally profiting from fetal organ sales. After House vote, its Seattle Planned Parenthoods turn for symbolism, What does it say about this Congress that today were here on the House floor debating the killing and harvesting of aborted babies? said Rep. Marlin Stutzman, R-Ind. How can there possibly be two sides to this?, Democrats said the true GOP goal was to whip up conservative voters with legislation that would make it harder for women to get health care. Planned Parenthood, whose clinics provide sexual disease tests, contraception and abortion, says its done nothing illegal and is being victimized by misleadingly edited videos. Republicans are willing to risk womens lives just to score political points, said Rep. Debbie Wasserman Schultz, D-Fla. who chairs the Democratic National Committee. Enough is enough. Planned Parenthood gets around $450 million yearly in federal payments, mostly Medicaid reimbursements for handling low-income patients. Thats around one-third of the organizations $1.3 billion annual budget. Practically none of the federal money can be used for abortions. Beyond Fridays bill, some conservatives want to attach language halting Planned Parenthoods payments to broader legislation financing government agencies, which otherwise run out of money next Thursday. Those Republicans say a shutdown fight would at least produce a veto battle that would show voters where Republicans stand. House Speaker John Boehner, R-Ohio, a long-time abortion foe, and virtually all House Republicans favor halting the flow of federal dollars to Planned Parenthood. But Boehner and other GOP leaders say a shutdown battle would be fruitless because they lack enough votes to prevail in the Senate or overcome an Obama veto. They say voters oppose a shutdown and would punish the GOP in next years elections if one occurred. GOP leaders efforts to avoid a shutdown were explicitly endorsed Friday by the nations most powerful anti-abortion group. Carol Tobias, president of the National Right to Life Committee, said in a written statement that a shutdown would cause political damage to our allies by angering the public, adding, The grim fact is this: In order to defund Planned Parenthood, we must have a pro-life president. Long unhappy with Boehner and other GOP leaders for not being confrontational enough, some in his party have threatened to force a House vote on removing him from his post if he backs down on this or other upcoming fights over federal borrowing and spending. The legislation approved Friday, proposed by Rep. Diane Black, R-Tenn. would end federal payments to Planned Parenthood for a year, diverting the money to thousands of community health centers. Republicans say those clinics could handle the displaced Planned Parenthood patients, but Democrats say the centers are overburdened and sometimes distant. Pressure from conservatives may ultimately force leaders to let Congress vote anyway on a bill that would avert a shutdown and stop Planned Parenthoods federal dollars, a measure certain to die in the Senate. Once defeated, that would likely be followed by a measure temporarily financing government, perhaps into December, that would include Planned Parenthood funds and buy time to resolve disputes over spending, abortion and other issues. For now, Republican leaders are hoping that investigations by four congressional committees and other anti-abortion bills will relieve some pressure. Along those lines, the House voted 248-177 Friday for another measure, this one by Rep. Trent Franks, R-Ariz. that would impose penalties of up to five years in prison plus fines on doctors who dont try to save infants born alive during abortions. And the Senate set a vote for Tuesday on a measure banning most late-term abortions. Both of those bills would face likely Senate defeat and an Obama veto threat. In Fridays House debate, both sides showed plenty of fight on the issue. Franks, who brought the fetus poster to the floor, said Congress response to the Planned Parenthood videos is vital to everything those lying out in Arlington Cemetery died to save. House Majority Leader Kevin McCarthy, R-Calif. asked, In the face of these videos, with all the alternatives women have for health, why would you want to force your constituents to pay for something so evil?, Rep. Jan Schakowsky, D-Ill. said Republicans relying on deceptively edited videos had manufactured a witch hunt. Added Rep. Sam Farr, D-Calif. Stop being so mean. Solve problems, do not create them. Planned Parenthood spokesman Eric Ferrero called the two House-passed bills a callous attempt to insert politics into womens health.]", "Date": "20150918", "Title": "[House OKs GOP bill blocking Planned Parenthood funds]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/house-bills-hit-planned-parenthood-some-abortion-doctors/", "Author": "[ALAN FRAM, ANDREW TAYLOR]"}