{"Content": "[Costco Wholesale seems to lean to the Democratic side: Co-founders Jeff Brotman and Jim Sinegal held fundraisers for President   Obama at their Eastside homes, and the company was hailed by the Obama administration as the paragon of American capitalism with a conscience. Costco leaders also have prominently backed the presidents efforts to raise the federal minimum wage. So its interesting to see a Costco board member, Dr. Ben Carson, emerge as one of the most strident and controversial voices against Obama  and the great hope of some Republicans for the 2016 presidential election. Last month Carson ran a very close second to Sen. Ted Cruz of Texas in a straw poll at the Republican Leadership Conference in New Orleans. Hearing the retired neurosurgeon and 15-year Costco director rail against gay marriage or Obamacare  in October he called the health-insurance package the worst thing that has happened in this nation since slavery, according to The Washington Post  suggests the companys board better leave politics at the door when meeting to discuss the business. Many other Costco directors are clearly not in Carsons corner. Former Yahoo President Susan Decker contributed to the Obama campaign in 2008 and to Hillary Rodham Clinton in 2007, according to campaign-finance website Opensecrets.org. Chief Financial Officer Richard Galanti gave money not only to Obamas campaign in 2012, but to Bill Bradleys in 1999. Likewise, former Bill & Melinda Gates Foundation head Jeff Raikes is mostly Democratic in his political contributions; and Warren Buffetts right-hand man, Charles Munger, has been a vocal supporter of raising both the minimum wage and   taxes on the wealthy. Representing the other side of the political aisle, to some extent, is former Washington governor and U.S. Sen. Daniel Evans, a moderate Republican in his day. Costco CFO Galanti referred a request for comment on Carson to CEO Craig Jelinek and former CEO Sinegal, who did not respond. But whatever the political differences, they arent keeping Carsons latest book, One Nation out of Costco warehouses. About 80 percent carry it, said Galanti. The book is No. 1 on The New York Times nonfiction best-seller list. His ongoing book tour included a stop at a Costco in Naples, Fla. Carson rose from poverty in Detroit to become a respected neurosurgeon, and for years led the pediatric neurosurgery center at Johns Hopkins in Baltimore. His retirement last year, a few months after a widely followed speech touting conservative values at the National Prayer Breakfast, fed speculation that he might make a run for the presidency. A committee encouraging Carson to run for president was formed last August, and has raised $3.9 million, according to the Federal Election Commission. A message on Carsons website says hes fully aware of the efforts to draft him as presidential candidate, and he doesnt endorse them. As of today it is not my intention to seek public office, it says, but if God has other plans for me moving forward, I am certain he will make those clear and I will always listen.  ngel Gonzlez: agonzalez@seattletimes.com,  ngel Gonzlez: agonzalez@seattletimes.com, , , Auditors tepid take on Baristas Coffee, Baristas Coffee is in the process of rewriting its financial history  and the new version is far less rosy. The Kent-based company, which trades over the counter but has loudly proclaimed plans to get listed on the Nasdaq, touts itself as the fastest-growing drive-through espresso company in the country. Its primary appeal is the female baristas who wear appealing costume-themed attire, which is MBA-speak for scantily clad. This past week, in pursuit of that potential Nasdaq listing, Baristas published its first quarterly financial statement approved by an auditor. That report sharply revises  or overturns  the companys previous account of how it fared in last years first quarter. In its previous, unaudited statement for the quarter ending in March 2013, Baristas reported a $38,440 profit. Now the audited version says that the year-ago quarter actually had a $277,730 loss. None of the key numbers match: Previously reported sales of $433,858 morphed into $366,673, a  15 percent drop. Personnel costs rose to $152,254 from $114,415. General and administration expenses, previously shown as $54,510, in fact amounted to $200,078, the audited report says. As for the latest quarter, ending March 2014, the company reported its loss  narrowed to $51,319. But its financial health is not a pretty picture. Audited sales shrank to $318,246 from the year-ago $366,673. And Baristas reported a mere    $5,799 in cash and no other current assets (although it reports $2.9 million in intangible assets, which is how companies refer to brand recognition and other fuzzy attributes). The company had $927,369 in total liabilities. Asked about the stark difference between the audited and unaudited books, CEO Barry Henthorn said sales in the audited report were lower because they omitted amounts that were not backed up by daily sales records. Also, general and administrative expenses rose to reflect stock-based compensation in 2013 that was not previously recognized. Baristas will be filing amended audited financial reports for the years 2012 and 2013 in the next week. Henthorn said he doesnt expect any significant stock-based compensation or additional cleanup of historical data in the future. ngel Gonzlez: agonzalez@seattletimes.com, ngel Gonzlez: agonzalez@seattletimes.com, , Online eyewear seller Rivet & Sway closes, After two years of encouraging women to accessorize with eyeglasses and sunglasses of all shapes, colors and sizes, just like they would with handbags and scarves, online eyewear startup Rivet & Sway has closed. The Seattle company allowed customers to order multiple pairs and return any they did not like. And even though the company was growing quickly, with sales up 350percent in 2013, the cost of shipping glasses both ways was too much, CEO Sarah Bryar said. We were losing money on every sale, which is not atypical for a startup, said Bryar, who would not disclose the companys revenues. We had made a ton of progress, but it just wasnt enough  We just didnt drive enough growth. Tech news website Geekwire, which first reported the closure, said Rivet and Sways total funding was $3.3 million. Bryar said the last three months were difficult. She tried to persuade investors that with just a couple million dollars more to add a retail store she could bring in more customers, making the difference on profitability, but we just sort of ran out of time to prove that model. Rivet & Sway had began to dabble in adding a physical presence last year with tricycle carts and pop-up-shop events around Seattle.  But Bryar said she didnt pivot fast enough on the idea of a retail space, which she said its much bigger competitor Warby Parker is now also doing. The future of eyewear is really going to be a combination of online and offline, she said. Interaction with a customer in a retail space  Even if they do not come back to your physical store, theyll return to your website. The business had grown to 14 employees, who will stay on for the next two weeks while the company has a blowout sale at its Pioneer Square showroom. Frames and sunglasses are on sale for $49, down from the $169 they were running this year. It is so bittersweet, Bryar said. Raising capital was my single responsibility and I feel responsible for the fate of the company  I just have a mixture of sadness and disappointment, but it is rounded out with a great sense of pride in what we had accomplished. Coral Garnick: cgarnick@seattletimes.com, Coral Garnick: cgarnick@seattletimes.com, ]", "Date": "20140607", "Title": "[Costco execs favor Obama, but board member denounces him]", "Link": "http://www.seattletimes.com/business/costco-execs-favor-obama-but-board-member-denounces-him/", "Author": "[Seattle Times staff]"}