{"Content": "[GUATEMALA CITY (AP)  Guatemalas newly sworn-in president demanded that all top government officials submit their resignations and promised an honest and inclusive administration following the surprise resignation earlier Thursday of President Otto Perez Molina amid a widening fraud investigation. After President Alejandro Maldonado took office, a judge ordered Perez Molina held until Friday morning, when his corruption hearing was to reconvene. The former president was seen entering a military barracks where he will spend the night in custody. Maldonado reached out to protesters who took to the streets against the countrys entrenched corruption, promising he would leave a legacy of honesty and restore faith in Guatemalas democracy in his brief few months in office. You cant consider your work done, Maldonado said in remarks aimed at all those demanding change. In what is left of this year, there must be a positive response. The unprecedented political drama played out after a week in which Perez Molina was stripped of his immunity, deserted by key members of his Cabinet, and saw his jailed former vice president ordered to stand trial. All this just days before Sundays election to choose his successor. Perez Molina, the first Guatemalan president to resign, appeared in court Thursday accused of involvement in a scheme in which businesspeople paid bribes to avoid import duties through Guatemalas customs agency. Judge Miguel Angel Galvez ordered him held overnight, citing a need to ensure the continuity of the hearing and guarantee the former presidents personal safety. Perez Molina, 64, reiterated his willingness to face the investigation head-on. I have always said I will respect due process, he said. I do not have the slightest intention of leaving the country. Earlier in the day, the retired military general insisted upon his innocence in an interview with The Associated Press during a break in the court proceedings, saying the process had been very hard, very difficult. He said he could have derailed the investigation, but didnt. I had things I could have done, Perez Molina said. I could have replaced the prosecutor, I could have dug in. Analysts say the resignation was a key blow to corruption in the country and a boost for the rule of law. In the midst of this political crisis there is interesting and good news, said Eric Olson, a Central America expert at the Washington-based Wilson Center. The attorney general resisted strong pressures and even asked for the president to be incarcerated  that shows the institutions in Guatemala under the right circumstances can operate and be effective. Maldonado, a 79-year-old conservative former high court justice, has served as Guatemalas foreign minister and in ambassadorial posts. He also formerly headed Guatemalas highest court, where he presided over much-debated decisions like the one not to extradite former dictator Efrain Rios Montt. Rios Montt faced charges in Spain for genocide, torture and terrorism committed at the height of Guatemalas 1960-1996 civil war, and the decision against extradition was hotly criticized. Upon taking office Thursday, Maldonado said he was going to form a transition government and invite all the social groups that are protesting in the streets to propose young professionals to form the new administration. The corruption scandal that engulfed Perez Molinas government was uncovered by prosecutors and the United Nations commission against impunity, which have mounted a huge investigation into fiscal fraud. The scheme they uncovered, known as La Linea, or The Line, involved businesspeople paying bribes to avoid import duties through the customs agency. The ring is believed to have defrauded the state of millions of dollars. Ex-Vice President Roxana Baldettis former personal secretary was named as the alleged ringleader and is a fugitive. She resigned May 8 because of the same scandal and is now jailed and facing charges. She also maintains her innocence. A growing protest movement brought together Guatemalans from all walks of life demanding that Perez Molina step down. Business leaders and even Catholic church officials had called for him to resign in recent weeks as the investigation of the customs fraud ring has grown wider and hit more officials. Perez Molina was steadfast in his plan to stay until the judges unprecedented order, only deciding to resign in the middle of the night. His spokesman told reporters the president submitted his resignation to maintain the institution of the presidency and resolve on his own the legal proceedings leveled against him. Perez Molina was elected in 2011 on a platform of cracking down on crime. He is a retired general who participated in the countrys 36-year bloody civil war, and later in the march toward peace. His critics say he also took part in the mass killings of civilians, but he has never been charged with anything. His election as president had worried leftist groups and human rights organizations because of the militarys past control of the government. But Perez Molina has been a political moderate who has kept the military at arms length, proposing at one point to legalize drugs to rid his country of the scourge of cartels and trafficking. Maldonado will likely remain in office until the winner of upcoming elections is inaugurated Jan. 14, 2016. The first round is on Sunday, pitting a wealthy businessman and politician against 13 other candidates, including a comedian with no political experience, a former first lady and the daughter of an ex-dictator accused of genocide. If none of the candidates reaches 50 percent, a runoff will be held Oct. 25. Protesters filling the streets have also demanded that Sundays presidential elections be postponed. Perez Molina, who was not on the ballot, has said delaying the vote would be against the law.]", "Date": "20150903", "Title": "[Guatemala swears in new president after Perez Molina resigns]", "Link": "http://www.seattletimes.com/nation-world/guatemalan-congress-accepts-presidents-resignation/", "Author": "[SONIA PEREZ D., ALBERTO ARCE]"}