{"Content": "[Vice President Joe Biden and his associates have begun to explore a possible presidential campaign, an entry that would upend the Democratic field and deliver a threat to Hillary Rodham Clinton, say several people who have spoken to Biden or his closest advisers. Bidens advisers have started to contact Democratic leaders and donors who have not committed to Clinton or who have grown concerned about what they see as her increasingly visible vulnerabilities as a candidate. The conversations, often fielded by Bidens chief of staff, Steve Ricchetti, have taken place through phone calls and at lunches. In most cases, they have grown out of an outpouring of sympathy for Biden since the death of his son Beau, 46, in May.  New York Times columnist Maureen Dowd reported Saturday that Biden had been holding meetings at his residence, talking to friends, family and donors about jumping in to challenge Clinton in Iowa and New Hampshire, the first two nominating states. One longtime Biden supporter said the vice president has been moved by his late sons desire for him to run. He was so close to Beau and it was so heartbreaking that, frankly, I thought initially he wouldnt have the heart, the supporter, Michael Thornton, a Boston lawyer, said. But Ive had indications that maybe he does want to  and, Thats what Beau would have wanted me to do. Bidens path, should he run, would not be easy. Clinton has enormous support among Democrats inspired by the idea of electing a woman as president, and her campaign has raised millions of dollars. Additionally, Biden, 72, has proved to be prone to embarrassing gaffes on the campaign trail, and he would also face the critical task of building a field operation. One Democrat with knowledge of the conversations described the outreach as a combination of donors and friends of Bidens wanting to prop up the vice president in his darkest hours, combined with recent polls showing Clintons support among independents declining, suggesting there could be a path to the nomination for the vice president. Dowd reported that as Beau Biden lay dying from brain cancer, he tried to make his father promise to run, saying the White House should not revert to the Clintons and that the country would be better off with Biden values. Bidens other son, Hunter, also encouraged him to run, she wrote. The support Biden has garnered speaks to growing concerns among Democrats that Clinton could lose in Iowa and New Hampshire, as the populist message of one of her opponents, Sen. Bernie Sanders of Vermont, draws swelling crowds. The reality is its going to be a tough, even-steven kind of race, and theres that moment a lot of party establishment would start exactly this kind of rumble: Is there anybody else?  said Joe Trippi, a Democratic strategist. At the same time, the slow trickle of news about Clintons use of private email when she was secretary of state and the coming Benghazi hearings may be distracting some voters from the core message of her campaign: the need to lift the middle class. Its not that we dislike Hillary, its that we want to win the White House, said Richard Harpootlian, a lawyer and Democratic donor in Columbia, S.C. who met with Ricchetti before Beau Biden died. We have a better chance of doing that with somebody who is not going to have all the distractions of a Clinton campaign. A spokeswoman for the Clinton campaign declined to comment. In a July 30 Quinnipiac poll, 57 percent of voters said Clinton was not honest and trustworthy and 52 percent said she did not care about their needs or problems. The same poll showed Biden with his highest favorability rating  49 percent  in seven years, with 58 percent saying he is honest and trustworthy and 57 percent saying he cares about them. But Clintons numbers were still strong, especially among likely Democratic primary voters. The No. 1 thing voters want is a candidate who is honest and trustworthy, and the veep is leading in those polls, said William Pierce, executive director of Draft Biden, a super PAC that is trying to build enthusiasm for a possible candidacy. Confidants say they expect Biden to make something official by early September. Kendra Barkoff, a Biden spokeswoman, said: As the Biden family continues to go through this difficult time, the vice president is focused on his family and immersed in his work. A 2016 run would be the third time Biden, a longtime senator from Delaware, has sought the presidency, which friends say is his ultimate dream. His first campaign in 1988 ended in heartbreak after news reports that he plagiarized parts of a speech and exaggerated his academic record forced him to drop out. In 2008, he drew less than 1 percent of the vote in the Iowa caucuses and dropped out after making controversial comments about Barack Obama. Biden said he was the first mainstream African American who is articulate and bright and clean. Obama later chose Biden as his running mate. The president has been careful not to undermine or wholeheartedly endorse either his former secretary of state or his vice president. The president has said that the best political decision hes ever made in his career has been to ask Joe Biden to run as his vice president, Eric Schultz, a White House spokesman said last week. Ricchetti, a former White House aide in the Clinton administration who is now Bidens chief of staff, began talking to donors and supporters in the months before Beau Biden died. In recent weeks those talks, with local elected officials and party leaders, started again, mostly because well-wishers were calling to check on the Biden family. The talk inevitably drifted to 2016, and many of these Democrats urged Biden to seriously consider getting into the race, said people with knowledge of the talks who spoke on condition of anonymity. Ricchetti declined to comment.]", "Date": "20150801", "Title": "[Biden taking steps toward 2016 run, supporters say]", "Link": "http://www.seattletimes.com/nation-world/biden-taking-steps-toward-2016-run-supporters-say/", "Author": "[Amy Chozick]"}