{"Content": "[CLEVELAND  Donald Trump needs to act presidential. Jeb Bush has to erase the notion that hes just another Bush. And some other Republicans have to make enough of a first impression on voters that they can vault into the top tier of a crowded presidential field. On TV: The 2-hour GOP debate. Time: 6 p.m. PST. Channel: Fox News.Where:Cleveland, Ten Republicans will vie tonight in the first Republican presidential debate of the 2016 campaign. The other seven candidates can participate in a one-hour forum starting at 2 p.m. The debate at Clevelands Quicken Loans Arena is likely to shake up and redefine the Republican field, the biggest in modern times. Heres what the contenders need to do to stay in, or reach, the front of the pack:, Donald Trump: Can he look and act presidential? He needs to show (a) hes thought out some policy positions and (b) he has a commander in chiefs temperament. Whats his remedy for overhauling the nations health-care system? Will there be detail or another burst of vivid sound bites?, Jeb Bush: Can he be pithy, and can he separate himself from his brother? The former governor of Florida tends to ramble and get too nuanced, not a recipe for standing out in rapid-fire debates. Hes likely to get challenged on his support for a path to legal status for many immigrants in the U.S. illegally and his support for Common Core educational standards. Scott Walker: Will he get beyond the talking points? The governor of Wisconsin wows Republicans when he boasts about how he took on unions in a budget fight. But its not all that it seems, and hes likely to be confronted about shortfalls that required tough spending cuts. He usually answers with well-rehearsed talking points, but he must go further and impress viewers that he knows what hes talking about. Marco Rubio: Can he demonstrate gravitas and commitment? The Florida senator has to defend his 2013 support for a comprehensive immigration overhaul that included a path to citizenship for immigrants in the U.S. illegally, and then his move away from that approach. He wants to come across as a national-security expert and needs to talk comfortably and authoritatively about terrorist threats. Ted Cruz: Will he try to out-Trump Trump? He cant resist the quick hit, and its landed him in political jeopardy while Trump has won the outraged voters, so far. The senator from Texas went for broke recently, calling the Senate Republican leader a liar. Will Cruz separate himself further from the establishment?, Rand Paul: He sank to eighth in the Fox News poll averages that determined debate status. The senator from Kentucky seems unable to get traction, even after this weeks leadership role in trying to divert federal funds from Planned Parenthood. He must find a way to stand out in the pack. John Kasich: Will conservatives accept him? Hell be introducing himself to much of the public, and his regular-guy demeanor and ease discussing issues should help. But will the governor of Ohio appear presidential? And might he seem too centrist and accommodating to satisfy the conservative base?, Mike Huckabee: Can he demonstrate mainstream appeal? Hes likely to keep pounding away with provocative statements, largely aimed at his Christian right constituency. The former Arkansas governor must show a greater grasp of mainstream issues, notably the economy, health care and foreign policy, to break out of this tier. Ben Carson: Is he too understated to make a splash? Hell be steady, thoughtful, conservative, and maybe too calm and quiet to stand out. The retired neurosurgeon has stayed away from the sort of incendiary comments that marked his early political efforts. But what does he know about how to fight terrorism or manage an economy?, Chris Christie: Can he calm down? His no-prisoners style is perfect for a debate. But the governor of New Jersey has to erase the impression that hes too quick to anger when challenged. These candidates didnt have the support in national polls to qualify for the debate under rules set by Fox News. Theyre invited to the 2 p.m. forum, which will allow them to appear sequentially. Rick Perry: Is he 2012s news? The former governor of Texas had a huge opportunity last time and blew it. Hes got to get through all the new faces and the old concerns, and winding up in the other forum could be further evidence his time is up. Carly Fiorina: How does she break out of the pack? Expect the former business executive to keep stressing her business rsum and criticizing Hillary Rodham Clinton, which she does like no one else in the field. Lindsey Graham: Is he too accommodating to Democrats? He has to show conservatives hes really one of them. Theyre unhappy with his willingness to work with Democrats. The senator from South Carolina also needs to explain why he thinks he has a shot. Bobby Jindal: Can the policy-wonk Jindal reappear? Hes fashioned himself as the candidate of the Christian right. Can he return to being the two-term governor of Louisiana known for his budget-management and health-care expertise?, Rick Santorum: What happened to the winner of the 2012 Iowa caucus? The former senator from Pennsylvania has a rough task, convincing his religious right constituency he deserves another chance. So far, that group seems more inclined to consider Cruz, Huckabee and Carson. George Pataki: The three-term governor of New York is hoping to break through in New Hampshire. He can only hope independents and moderates tune in. Jim Gilmore: The former governor of Virginia will talk national security. Viewers may wonder why someone who hasnt won a race since 1997 and was crushed in his 2008 Senate bid should be considered. Keep these points in mind:, How far can candidates go challenging Donald Trump?, Will rivals demand he explain his branding undocumented Mexican immigrants as criminals and rapists? Trump has insulted most of these candidates, and this is their chance to return fire. And what will it cost them? Think about whether they look better if they go after him, or he does?, Will Trump evolve from showman to potential president?, While hes comfortably ahead in most polls, Trumps negatives are also huge. Skeptics see him as a shallow-minded distraction. This week, Trump posted a Facebook video saying he wanted rivals to answer one question: How will you make America great again? Trump needs to answer that himself, and say how he can go beyond the quips and sound bites to get things done. Is it time for a new generation?, Walker, 47, and Rubio, 44, are the years biggest curiosities. Each boasts a strong political rsum and plenty of campaign cash. Walker wowed Iowa Republicans this year demanding that the federal government adopt the same spending restraints as his state. Rubio, from the nations premier swing state, has been on the short list of future presidents since he won a Senate seat in 2010. Who speaks to and for Christian conservatives?, A sizable bloc of Republicans is eager to rally around a firebrand whos fiercely anti-abortion, wont relent in trying to repeal Obamacare, thinks Common Core is federal control of schools and is appalled by same-sex marriage. Santorum won these voters in 2012. This time, hes one of many  Carson, Huckabee, Cruz and Walker  seeking their approval. Who seems most like a president?, In recent elections, the most successful candidates projected an aura. That didnt mean voters liked them. Debates allow viewers to discern who seems presidential, who could command the military, negotiate with Congress and rally the nation.]", "Date": "20150806", "Title": "[Can any GOP contenders pull away from pack in tonights debate?]", "Link": "http://www.seattletimes.com/nation-world/can-any-gop-contenders-pull-away-from-pack-in-debate/", "Author": "[David Lightman]"}