{"Content": "[WASHINGTON (AP)  Think of it as tweeting for dollars. The social media service Twitter on Tuesday introduced a feature that enables political candidates and advocacy groups to raise money directly via its mobile application, making it quicker and easier to harvest small donations from followers. Campaigns already aggressively use Twitter to spread their message, particularly during live political events such as Wednesday nights Republican presidential debate. The company says that tweets about the August 6 debates on Fox News were viewed more than 1 billion times on Twitter and across the web. And in a race likely to cost more than the $2 billion spent in 2012, why not look for cash in every corner?, At least a dozen presidential candidates will begin using the new fundraising technique right away, said Jenna Golden, Twitters director of political ad sales. Democratic candidate Bernie Sanders and Republicans Scott Walker and Rick Santorum were among the first to use the new feature Tuesday morning. Walkers campaign wrote on Twitter, Show Scott Walker some support going into the second debate by donating $2. While the White House seekers are early adopters, Golden said the fundraising service is also available to local and state-level candidates. We think about donating to a campaign as an old-fashioned, traditional process, a cumbersome process, she said. This was an incredible opportunity for us to simplify and streamline. Political candidates have been able to raise money through Twitter by linking to the web-based online donation forms. But for people on mobile devices  and thats 80 percent of Twitters audience  it can be clunky to click through different applications and web pages. Kentucky Sen. Rand Paul, among the savviest digital fundraisers in the GOP presidential field, has tweeted links to campaign swag, including a red T-shirt that says, The NSA knows I bought this Rand Paul t-shirt. His campaign and the Democratic National Committee are among the groups that say theyll make use of Twitters new in-message fundraising. The DNC is interested in the new tool because we think it will help give people a chance to show their support without taking them away from one of the platforms where theyre getting their information, said Matt Compton, the groups digital director. Twitter is working with Square Inc. a financial services company, to collect the money and the information that the Federal Election Commission requires from political donors. Would-be givers fill in their identifying information and link to a debit card. Several clicks later, the Twitter users contribution is headed straight for the candidate of their choice, and they can share news of their financial support to their own Twitter followers. The candidates also can pay Twitter to promote their fundraising-linked tweets. Twitter has been a successful avenue of fundraising for campaigns in the past, and this will make it even more attractive to campaigns as they look at how to allocate precious dollars, said Vincent Harris, a digital strategist for the Paul campaign. ", "Date": "20150915", "Title": "[2016 candidates jump to raise money via new Twitter service]", "Link": "http://www.seattletimes.com/business/twitter-offers-new-cash-stream-for-presidential-candidates/", "Author": "[Julie Bykowicz]"}