{"Content": "[Republican proposals to move up the states late-season presidential primary failed Tuesday, leaving Washington with one of the last votes in the nation. The Presidential Primary Committee met in SeaTac and voted along party lines, failing to shift the states May 24 primary next year to March, when about 30 states are scheduled to hold a primary or caucus. Washingtons primary wont have much direct impact on how the presidential nominees are chosen. Democrats will select all their delegates through caucus meetings, while Republicans may choose some of theirs through the primary. Nonetheless, state Secretary of State Kim Wyman said Tuesday she would like the primary to go forward. I realized that the voters want to weigh in  and they dont really care about the party rules, Wyman, a Republican, said Tuesday after the committee meeting. She had proposed moving the primary to March 8 to draw more interest from candidates, and possibly voters. But Democrats on the committee opposed that proposal and another plan to set the primary for March 22. The committee has nine members, with four Democrats, four Republicans and Wyman, and neither proposal got the six votes necessary to change the primary schedule. Wyman said she called for the change because, I really believe that the May 24 date is too late in the process for it to be meaningful for voters or candidates. Wed like to use that primary as a way to get candidates to come to our state and not just fundraise, but to campaign, she added later. Democrats at the meeting cited their national partys rules  as well as the possibility of confusing voters  as reasons not to move up the primary. State Democratic Party Chairman Jaxon Ravens said the national party required rules to be made earlier this year. And that decision, made by state Democrats, was to allocate our delegates through the use of caucuses, said Ravens. The Democratic caucuses are scheduled for March 26. One committee member, Sen. Sharon Nelson, D-Maury Island, worried that a primary held earlier than that date could confuse voters. They will go to the polls and vote and  they will think they are choosing delegates, said Nelson, adding later: This will create a confusion that I dont think benefits citizens of the state. The Legislature this year approved $11.5 million to pay for the primary, which was canceled in 2012 as the state continued to recover from the Great Recession. During the meeting, committee member Rep. Matt Manweller, R-Ellensburg, proposed what he described as a fair compromise, holding the primary March 22, near the time of the Democratic caucuses so as not to confuse. And, It would maintain some relevance for the $11 million that were going to spend to do this, said Manweller. That idea also failed to gain traction with Democrats, some of whom have questioned spending money for a primary. I dont know why the Legislature wants to spend $11.5 million on a process that were not using to select our delegates, Ravens said earlier this year.]", "Date": "20150811", "Title": "[Bid to hold states presidential primary earlier in 2016 voted down]", "Link": "http://www.seattletimes.com/seattle-news/politics/vote-keeps-presidential-primary-late-in-campaign-season/", "Author": "[Joseph OSullivan]"}