{"Content": "[THE pathway to the American dream is changing. These days, people need to work hard, play by the rules and pursue a lifelong education. For many Washingtonians, the access to lifelong education starts at the states community and technical colleges. Congress recently introduced legislation that would widen the path to the American dream and lifelong education. Modeled along the lines of President Obamas Americas College Promise proposal, the legislation would reduce financial barriers and send a clear and definitive message that college attendance should be as universal as high school. This is welcome news. The legislation introduced by U.S. Sens. Tammy Baldwin, D-Wis. and Cory Booker, D-N.J. would be a significant expansion of these efforts and would represent a milestone in American education. It would allow all first-time students to enroll in high-quality community and technical college programs without having to pay tuition. Students, for their part, would need to enroll on at least a half-time basis, show satisfactory progress, and pursue programs that either fully transfer to four-year institutions or lead to in-demand job credentials. The estimated price tag for the program is $79.7 billion over 10 years, with a 25 percent match from participating states. The legislation also asks states to maintain or exceed their average three-year spending levels for higher education and allocate some higher-education funding based on performance. Available funds would be distributed to states according to their proportion of eligible students nationally. Fortunately for us, Washington state is ahead of the curve in many of these areas and is well positioned if this legislation is enacted. At Seattle Colleges  Seattle Central College, North Seattle College, South Seattle College and Seattle Vocational Institute  we witness firsthand the financial burden and ramifications students face as a result. Its increasingly common to find students balancing school with the demands of working two or three jobs. This is especially true for our low-income and underrepresented populations. We have also seen amazing results when this burden is removed. Our 13th Year Scholarship pays the first year of tuition  about $4,000 for a full-time student  for graduating seniors from Chief Sealth, Cleveland and Rainier Beach high schools regardless of GPA or family income. Under this program, the number of students from these high schools has tripled at South Seattle College. As reported in The Seattle Times, this is a life-changing opportunity for these students. In fact, 60 percent of the 13th Year Scholars are the first in their families to attend college. Another one of our programs, the Seattle Promise scholarship, covers tuition when state and federal aid fall short. Without these initiatives, many students would take out loans or abandon their pursuit of education altogether. With them, students thrive and go on to become the employees, entrepreneurs, consumers and taxpayers who keep our states economy vibrant. Everyone  Democrats, Republicans and independents alike  knows that higher education yields high returns for our students and our economy. The most cost-effective means of delivering higher education is through community and technical colleges. By approving Americas College Promise Act, Congress would ensure the pathway to the American dream remains open, accessible to all and full of promise.]", "Date": "20150722", "Title": "[Free tuition puts American dream within reach]", "Link": "http://www.seattletimes.com/opinion/free-tuition-puts-american-dream-within-reach/", "Author": "[Jill Wakefield, Marty Brown]"}