{"Content": "[LONDON (AP)  The race is on for the 2024 Olympics: A five-city contest pitting four European bids against a two-time host from the United States. The International Olympic Committee announced the official field of candidates Wednesday, and there were no surprises as the previously declared bidders were all on the list  Budapest, Hungary; Hamburg, Germany; Los Angeles; Paris; and Rome. We are welcoming five outstanding and highly qualified candidate cities, IOC President Thomas Bach said. The lineup features three capital cities (Budapest, Paris, and Rome), three previous Olympic hosts (Paris, Rome, and Los Angeles) and one first-time bidder (Hamburg). Los Angeles, which hosted the 1932 and 1984 Olympics, and Paris, which staged the games in 1900 and 1924, shape up as early front-runners as they seek to join London in becoming three-time hosts. The deadline for submission of entries expired at midnight on Tuesday in Switzerland. Two other potential candidates  Toronto, and Baku, Azerbaijan  decided not to bid. This is a competition about quality, not quantity, Bach said in a conference call. The IOC also released the host city contract and other documents setting out the two-year bid process, which has been changed to eliminate the cut-down phase, and ensure that all candidates go to the final vote in Lima, Peru, in September 2017. Bach said a candidate would be cut only if it violates bidding rules or if the IOC determines a city cannot meet minimum requirements for hosting the games. The IOC has been determined to present a healthy number of bids and world-class field for 2024 following the troubled race for the 2022 Winter Games, which was left with only two candidates after four pulled out for financial or political reasons. Beijing defeated Almaty, Kazakhstan, in the IOC vote on July 31. Bach said all five bid cities for 2024 fully embraced his Olympic Agenda 2020 reform program, which seeks to reduce bidding and hosting costs. Sustainability and legacy are the cornerstones of each candidature, he said. The IOC will contribute $1.7 billion in cash and services to the organizing committee of whichever city is chosen as host. Bach expressed confidence the city will produce a surplus on its operating budget, which does not cover long-term infrastructure costs. The cities must submit their first bid files by Feb. 17, 2016. An IOC evaluation commission will visit the cities between February and June 2017. A technical briefing for IOC members will be held in July 2017, two months before the vote. Bach said the evaluation process would change from an examination style to a dialogue style, helping ensure that bid promises are kept once the games are awarded so that the organization phase may be less turbulent and more reliable. Los Angeles stepped in as the U.S. candidate after Bostons bid collapsed in July amid a lack of public and political support. The Californian city is bidding to bring the Summer Games back to the U.S. for the first time since Atlanta held the 1996 Olympics. New York and Chicago failed in their bids for the 2012 and 2016 Olympics, respectively. Los Angeles, which faced no opposition for the 32 and 84 Olympics, has lost in seven other contested bid elections. Paris is hoping to host the Olympics exactly 100 years after it last held the games. The French capital was the favorite for the 2012 Games but lost out to London. Rome is seeking to take the games back to the Italian capital for the first time since 1960. Rome dropped out of the bidding for the 2020 Olympics when the government refused to give financial support. Hamburgs bid faces a referendum among voters in the northern port city on Nov. 29, with no certainty that it will win. What is important for the IOC is that we want to send the athletes only to cities where they are welcome, Bach said, adding that the IOC will carry out its own confidential polling in all the bid cities. Germany, which last held the Summer Olympics in Munich in 1972, is the leading contender to host the European soccer championship in 2024, but Bach  a German  said there was no reason the country couldnt hold both events. Nobody has a real doubt about the organizational skills of Germany, and German sport in particular, he said. Budapest, which has failed in numerous previous bids, would bring the Olympics to Hungary for the first time. Hungary is facing criticism for its tough stance on migrants and refugees, while Germany has been praised for its welcoming policy. This humanitarian challenge is going beyond Olympic candidatures, Bach said.]", "Date": "20150916", "Title": "[Race is on: 5 cities to compete for 2024 Summer Olympics]", "Link": "http://www.seattletimes.com/sports/race-is-on-5-cities-to-compete-for-2024-summer-olympics/", "Author": "[STEPHEN WILSON]"}