{"Content": "[WASHINGTON (AP)  Anyone in America can grow up to be president, as the saying goes  unless you happen to be a Muslim, a leading Republican presidential candidate believes. Its possibly one more self-inflicted dent in the partys professed commitment to broaden its appeal and promote tolerance. I would not advocate that we put a Muslim in charge of this nation, retired neurosurgeon Ben Carson said in an interview aired Sunday on NBCs Meet the Press. I absolutely would not agree with that. For GOP leaders, the 2016 campaign offered a chance at redemption and fresh pitch to minorities, gays, women and others beyond the traditional core supporters. After a blistering examination of the 2012 election, a report commissioned by Republican National Committee Chairman Reince Priebus concluded that if our party is not welcoming and inclusive, young people and increasingly other voters will continue to tune us out. But it hasnt unfolded according to the hierarchys hoped-for script, with some high-profile candidates inviting lots of eyebrow-raising. Just in the past few days, their comments have underscored that the problems extend beyond the GOPs well-documented troubles appealing to Hispanics. To be sure, candidates Jeb Bush and others have disavowed some of that rhetoric or tried to stake out more moderate positions. It can be tough, though, to avoid getting drowned out by language sure to stir up people. Front-runner Donald Trump declined to correct a town hall participant who wrongly said President Barack Obama was a Muslim. Days later, Carson spoke about Muslims and the presidency  remarks described as un-American, by a spokesman for the Council on American-Islamic Relations, Ibrahim Hooper. Hooper said the Constitution expressly bars religious tests for those seeking public office. To me this really means he is not qualified to be president of the United States, Hooper said. You cannot hold these kinds of views and at the same time say you will represent all Americans, of all faiths and backgrounds. Carson found no defender in rival John Kasich. The most important thing about being president is you have leadership skills, you know what youre doing, and you can help fix this country and raise this country. Those are the qualifications that matter to me, the Ohio governor told NBC. For Trump, the election of a Muslim president was something that could happen. Would I be comfortable? I dont know if we have to address it right now. 2016 hopeful Mike Huckabee, a former Arkansas governor, responded to Obamas nomination last week of an openly gay man to serve as Army secretary by saying the president is more interested in appeasing Americas homosexuals than honoring Americas heroes. Kasich told a story last week about a note left for him by a Latina hotel maid. A lot of them do jobs that theyre willing to do, and thats why in the hotel you leave a little tip, Kasich remarked. After Trumps town hall, Bush made clear he would not fuel the conspiracy theories about Obamas religion. He is an American, he is a Christian, the former Florida governor said Friday. And an exasperated Sen. Marco Rubio, R-Fla. told ABCs This Week that these issues have been discussed ad nauseam over the last few years. Its a big waste of time. Barack Obama will not be president in a year and a half. Its time to start talking about the future of America. Kasich earned applause in the first Republican debate last month when he said that he opposes gay marriage but he accepted the Supreme Courts ruling making same-sex unions legal across the country. And guess what? I just went to a wedding of a friend of mine who happens to be gay, he added. Because somebody doesnt think the way I do doesnt mean that I cant care about them or I cant love them. Still, the rhetoric has provided an opening that Democrats are ready to try to exploit. Of course a Muslim, or any other American citizen, can run for president, end of story, said Rep. Debbie Wasserman Schultz, who leads the Democratic National Committee. To think otherwise is not only harmful to our political process, but it elevates and validates discrimination in this country. Steve Schmidt, who served as Republican Sen. John McCains top strategist in the 2008 presidential election, said its problematic for the GOP to be seen as intolerant, particularly with moderate voters who help sway the general election. Of course its worrisome if you have a party thats perceived as anti-Latino, anti-Asian, anti-gay, intolerant of Muslims, Schmidt said. Asked specifically about Carsons comments, Schmidt said it exposed him as an amateur politician and underscored his total lack of understanding about the American political system. Kevin Madden, who worked for GOP presidential nominee Mitt Romneys 2012 campaign, said the GOP field is expanding the base, despite some of the high-profile missteps. There are over a dozen candidates running for president right now who are shaping the profile of the party and for everyone who promotes a view outside the mainstream, there are many more promoting views and policies focused on unifying the country and broadening the partys appeal, Madden said.]", "Date": "20150920", "Title": "[GOP wants to broaden appeal; will candidates get in the way?]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/fiorina-promises-a-fight-for-republican-nomination/", "Author": "[KEVIN FREKING, JULIE PACE]"}