{"Content": "[Shedding any pretense of civility and party unity, Donald Trump overwhelmed the first Republican presidential debate on Thursday night by ripping into his rivals and the moderators alike  but also drew fire from Jeb Bush and other candidates who are seeking to stop Trumps surge. Trump displayed his trademark pugnacity from the start with a bravura moment: refusing to rule out a third-party run for the presidency if he does not win the GOP nomination. Facing loud boos from audience members in a Cleveland sports arena, he held his hand up in defiance as several other Republicans looked flabbergasted. I have to respect the person that, if its not me, the person that wins, said Trump, the billionaire businessman and reality-TV star who has attracted legions of fans, in part by attacking traditional politicians such as Bush, who Trump has said should not be president. He then quipped: If Im the nominee, I will pledge I will not run as an independent. In the first of several freewheeling moments, Trumps statement drew an instant, contemptuous retort from Sen. Rand Paul of Kentucky, who nodded to Trumps past donations to former Secretary of State Hillary Rodham Clinton. He buys and sells politicians of all stripes, Paul said. So if he doesnt run as a Republican, maybe he supports Clinton, or maybe he runs as an independent?, Trump  whose withering put-downs have become legendary, his favorite pejorative being loser  was true to form in dismissing Paul. Well, Ive given him plenty of money, he said. Trumps outsize presence in the two-hour debate, shown on Fox News, was an emphatic reminder that Republicans quest to regain the presidency will be complicated by their own internal divisions. In addition to refusing to rule out a third-party bid and sparring with the Fox News moderators, Trump boasted that the Clintons attended his third wedding because he demanded it and said: Our politicians are stupid, while dismissing President George W. Bushs tenure as a catastrophe. Even as some of the other Republicans showed moments of strength, it was little match for the bombast of Trump. Establishment-oriented Republicans had hoped that two terms of President Obama would make grass-roots activists pragmatic about 2016, perhaps rallying around a well-known, well-financed candidate such as Jeb Bush. But the popularity of Trumps message suggested the party was just as interested in finding a pugilist. Trump and Bush, who have been lashing out at each other for weeks, barely tangled. But near the end of the debate, Bush said Trump  who has portrayed some Mexican immigrants as rapists  was a divisive figure who would ensure that Republicans continued to lose. I want to win, Bush said. Were not going to win by doing what Barack Obama and Hillary Clinton do each and every day: dividing the country  Were going to win when we unite people with a hopeful optimistic message. Trump shot back that the threats against the U.S. were too urgent for such concerns about tone. When you have people that are cutting Christians heads off, when you have a world at the border and at so many places that, its medieval times, Trump said. We dont have time for tone; we have to go out and get the job done. The exchange of fire between Trump and Bush  the dominant figures in the race and two American household names  offered a preview of the broader debate to come between Republicans who believe the party must be more inclusive to regain the presidency and those determined to speak to the boiling anger in the conservative grass roots. Few of the fights were over policy, however: Trump, for one, offered few substantive details about his plans for the country. The Fox News moderators, delving into the records of the 10 candidates, posed a series of difficult questions, while also trying, with occasional success, to provoke arguments among them over areas of disagreement. In the first question directly to Trump, for instance, Megyn Kelly cited his negative comments about some women, whom he has called fat pigs and slobs, before Trump cut her off. Only Rosie ODonnell, he said, looking for a laugh. For the record, it was well beyond Rosie ODonnell, Kelly said. Yes, Im sure it was, Trump replied, before offering an explanation. I think the big problem this country has is being politically correct, he said. I dont frankly have time for total political correctness. And to be honest with you, this country doesnt have time, either. He went on to complain about rough treatment by Kelly. As the night went on, occasional alliances appeared to form among certain candidates, intentionally or not. Sen. Marco Rubio of Florida and Gov. John Kasich of Ohio each flattered Trump by saying he had hit a nerve with his tough talk about illegal immigration and other problems facing the United States. Trump and Gov. Chris Christie of New Jersey took turns belittling Paul, who has been struggling in polls and fundraising, and who kept on the attack against Trump and other rivals throughout the debate. In the sharpest exchange between candidates, Paul and Christie, who have traded shots over national security for more than two years, exchanged personal insults over surveillance and civil liberties. After Paul said he only wanted to seek the personal data of terrorists, not average citizens, Christie called that a completely ridiculous answer and went further. When youre sitting in a subcommittee just blowing hot air about this, you can say things like that, Christie said. Paul, his voice rising, said Christie misunderstood the Bill of Rights and then offered his own stinging rejoinder. I dont trust President Obama with our records, said Paul, before lowering the boom with a reference to the embrace between Obama and Christie after Hurricane Sandy in 2012, a moment that still haunts Christie with conservatives: I know you gave him a big hug. Boos and cheers from the audience quickly enveloped the exchange onstage. Christie, seemingly ready for the attack, shot back that the hugs he recalled were with the families who lost their people on Sept. 11. The moderators tried to incite a confrontation between Bush and Rubio, who were once allies in Florida politics but now hope to bury each others candidacies in the March primary there, pressing them over Bushs support for the Common Core education standards. But Rubio went to higher ground and discussed school reform without disparaging Bush, one of several moments he struck a positive tone about his fellow Republicans. Rubio did go on the offensive against Clinton, the leading Democratic presidential candidate, painting her as out of touch with the financial struggles of many Americans. If Im our nominee, how is Hillary Clinton going to lecture me about living paycheck to paycheck? Rubio asked. I was raised paycheck to paycheck. Later, he expanded on the hit: God has blessed the Republican Party with some very good candidates, he said. The Democrats cant even find one. Other debate participants demonstrated why many in the party believe they have one of the best presidential fields in decades. Gov. Scott Walker of Wisconsin appeared fluent on policy and emerged untouched by his rivals. And Kasich won repeated applause from the home-state crowd, and with his heartfelt talk suggested he could be a threat to Bush among right-of-center Republicans.]", "Date": "20150806", "Title": "[Trump starts with stunner  and keeps on shocking]", "Link": "http://www.seattletimes.com/nation-world/trump-starts-with-stunner-and-keeps-on-shocking/", "Author": "[Patrick Healy]"}