{"Content": "[WASHINGTON  , Loretta Lynch, who was confirmed Thursday as attorney general, will meet with local police officers nationwide this summer as she tries to strike a new tone for the Justice Department amid a roiling controversy over the use of lethal force, aides said. Lynch, who will be the first African-American woman to hold the post, will replace Eric Holder, an ally of President Obama who has been the administrations most outspoken voice on issues of race relations and civil rights. His tenure made him a hero among many on the left but recently earned him scorn from some police groups that said he was too quick to criticize officers amid a spate of high-profile episodes of black men dying at the hands of white officers. Lynch, the daughter of a North Carolina civil-rights leader and a child of the segregated South, shares many of Holders liberal views but has signaled that she plans a different approach, particularly in the nationwide debate over police tactics. While Holder recently completed a tour of minority communities to discuss policing, Lynchs aides said that improving police morale and finding common ground between law enforcement and minority communities would be among her top priorities. Lorettas confirmation ensures that we are better positioned to keep our communities safe, keep our nation secure, and ensure that every American experiences justice under the law, Obama said. The Harvard-educated Lynch is expected to be sworn in Monday, according to the Justice Department. Thursdays vote came after weeks of a fractious debate, with Democrats increasingly incensed by the delay, which was longer than that for all but two other nominees for attorney general: Edwin Meese, who was nominated by President Reagan, and A. Mitchell Palmer, who was selected by President Wilson, according to the Congressional Research Service. Though no senators questioned her qualifications, some Republicans opposed her because she defended Obamas executive actions to give legal status to millions of immigrants.  Lynch was confirmed 56-43, with 10 Republicans voting for her, including Sen. Mitch McConnell, R-Ky. the majority leader, whose control of the Senate floor had helped cause the delay. The vote also had overtones for the 2016 elections. The Republican majority if it so chose could defeat this confirmation, said Sen. Ted Cruz of Texas, a Republican presidential candidate, who called Lynch lawless during a floor speech. After lecturing his colleagues about how unsuitable Lynch is, he skipped the vote to catch a plane to Dallas for a fundraiser for his presidential campaign. He was the only senator to miss the final vote. Lynchs aides said she has no immediate plans for major pronouncements and will instead focus on internal changes at the department. She wants to restructure her office to be more responsive to cybersecurity cases, much in the same way that officials restructured the office in response to terrorism after 9/11. She also has told Congress and Justice Department officials that she plans to do more to combat human trafficking. As the top federal prosecutor in Brooklyn, Lynch built one of the nations premier programs to fight that crime. Lynch, 55, comes to the job with decades of experience inside the Justice Department. Her deputy, Sally Yates, is also a career prosecutor and the former U.S. attorney in Atlanta. With the shortened timeline, that experience should serve them well, former Justice Department officials said. Born in Greensboro, N.C. Lynch is the daughter of a Baptist minister and a school librarian. She has said she draws inspiration from her fathers work in the civil-rights movement. But her friends and relatives said she has never viewed her job in government as one of a civil-rights advocate. Shes not an ideologue, Annette Gordon-Reed, a Harvard law professor and longtime friend, said recently. Shes not going to do things to please some wing. Shes not a caricature of anything. She is a prosecutor. Lynch has spoken about the need for police officers, because they have positions of power, to repair fractured relationships with minorities. But she has also described, in passionate and personal terms, how law enforcement is a force for good in minority neighborhoods. She really thinks the communities and the police officers have more in common than they realize, one adviser said. There may be more pressing matters. The section of the Patriot Act that allows the National Security Agency to seize the phone records of millions of Americans without any evidence of wrongdoing expires in June. Lynch, a supporter of that authority, may be called on to help persuade Congress to reauthorize that power under a compromise bill supported by the Obama administration. She also faces immediate decisions on the use of force by the police. Her office in Brooklyn is leading the investigation into the death of Eric Garner, who died after a police officer put him in a chokehold last year. And the Justice Departments civil-rights investigators are negotiating a settlement with Ferguson, Mo. over allegations of police misconduct there. Lynch is expected to be deeply involved in both those cases. She is not expected to push for changing marijuana laws. Under Holder, the Justice Department did not stand in the way of states that legalized marijuana. That was one of the few moments in which her confirmation hearing provided a glimpse at her priorities. Senators used much of the hearing to ask about her views on immigration or on other issues they considered important. Rarely was she asked what she considered important. One thing she did promise, however, was to improve the Justice Departments relationship with Congress, which has been strained during Holders tenure. The Republican-controlled House held Holder in contempt over his response to questions about the flawed gun-trafficking investigation known as Fast and Furious. Lynch told aides that she wants a better relationship with Congress and plans to meet with lawmakers regularly. Just as with police groups, Lynch told aides, a lot can be accomplished with a simple change in tone.]", "Date": "20150423", "Title": "[New attorney general plans shift in tone for Justice Department]", "Link": "http://www.seattletimes.com/nation-world/new-attorney-general-plans-shift-in-tone-for-justice-department/", "Author": "[MATT APUZZO, JENNIFER STEINHAUER]"}