{"Content": "[LIVINGSTON, N.J. (AP)  A tough-talking New Jersey Gov. Chris Christie launched his 2016 campaign for president Tuesday with a promise to tell voters the truth even if it makes them cringe. The Republican governor, a one-time GOP favorite who faded and now tries to climb back, lashed out at bickering leaders from both political parties in a kickoff rally in the gymnasium of his old high school. And in his trademark blunt style, he told voters  and warned Republican rivals  that hes ready to be aggressive in the 2016 contest. Who is in, and about to get in, the GOP race for president, Youre going to get what I think whether you like it or not, or whether it makes you cringe every once in a while or not, Christie declared. He added: I am now ready to fight for the people of the United States of America. He went on to a town hall meeting in Sandown, New Hampshire, receiving enthusiastic applause from the standing-room crowd as he arrived with his family. I want to be the next president of the United States and I intend to win this election, he told the meeting, held in an actual town hall. Christie has already held nearly a dozen town halls in New Hampshire, a state key to his hopes, and plans more as he spends the next week in the state. Christie enters a Republican presidential field that already has more than a dozen GOP candidates. Not all draw as much attention as Christie, who will compete for the same slice of the electorate as pragmatic-minded White House hopefuls such as former Florida Gov. Jeb Bush. But its an accomplished lineup of governors, senators and business people. Christies effort is largely driven by his outsized personality, and his resume, while notable, contains scattered land mines that have given many Republicans pause. Four years ago, some of Christies backers tried to persuade him to challenge President Barack Obama. In the years since, he won re-election with ease, but also struggled to revive New Jerseys moribund economy and fought with the states Democratic-controlled legislature over pensions and the state budget. While Christies turn as head of the Republican Governors Association was widely viewed as a success in the 2014 midterm elections, hes also faced the fallout from the actions of three former aides, charged with creating politically motivated traffic jams at a bridge to retaliate against a Democratic mayor who declined to endorse Christies re-election. Christie has not been tied directly to wrongdoing, denies he had anything to do with the bridge closing and has seen no evidence emerge to refute that. Still, the episode deepened the sense that he may surround himself with people who will do anything to win. He declared early in the scandal that I am not a bully to counter the public perception that he is just that. The governor faces a tough sell with many conservatives, but has seemingly found his stride at times in visits to early voting states with the lively town hall meetings hes known for at home. There will be plenty more of those now that hes an affirmed candidate. Emboldened by his political successes in heavily Democratic New Jersey, he seems himself as a leader who can work across Washingtons bitter partisan divide. We need this country to work together again, not against each other, he said with his wife, Mary Pat, and their four children standing behind him. He promised to lead a White House that would welcome the American people no matter what party, no matter what race or creed or color. Yet Christie also jabbed President Barack Obamas weak and feckless foreign policy and called Democratic presidential candidate Hillary Rodham Clinton the presidents second mate. America is tired of hand-wringing and indecisiveness and weakness in the Oval Office, he said. We need to have strength and decision-making and authority back in the Oval Office. And that is why today I am proud to announce my candidacy for the Republican nomination for president of the United States of America. In 2012, Christie was seen as the charismatic, pragmatic governor who burst onto the scene in made-for-YouTube moments. He gained national attention with a landmark deal in which the states public sector unions agreed to higher health care costs and retirement ages in exchange for promised payments into the states chronically underfunded pension season. Christies fortunes have certainly changed. Now, Christie has been eclipsed by others in a pack of more than dozen rivals. And his poll numbers at home have sunk to record lows. New Jerseys economy is lagging and there have been nine credit downgrades on Christies watch. Christie grew up in Livingston, a town about 20 miles west of New York City, and served as class president at the high school. His high school friends were among the first to receive word that Christie would be launching his campaign at their old school. ", "Date": "20150630", "Title": "[Christie promises blunt campaign as he enters 2016 contest]", "Link": "http://www.seattletimes.com/nation-world/christie-back-at-high-school-to-announce-2016-run/", "Author": "[JILL COLVIN, STEVE PEOPLES]"}