{"Content": "[Gov. Jay Inslee took his bully pulpit underground Friday into the future University of Washington Station, to send a message that nothing less than $15 billion is acceptable to expand the regional light-rail network. That number has created a stumbling block in Olympia, as lawmakers try for a third year to agree on a massive transportation package. The Senate, controlled by Republicans, approved an 11.7-cent gas-tax increase, predominantly for highways, while limiting Sound Transit to $11 billion in a separate tax measure that would go to voters in urban Snohomish, King and Pierce counties next year. Sound Transit is asking to allow this mix of taxes to reach the 2016 ballot. These would bring in $15 billion from 2017 to 2032. With federal funding and long-term debt, the value of new projects would be higher, agency staff predict.  Property tax of up to $25 per $100,000 of assessed value, per year.  Sales tax of up to 50 cents per $100 purchase (in addition to 90 cents already collected by Sound Transit and 90 cents by King County Metro.) ,  Motor-vehicle excise-tax increase to $80 per $10,000 of vehicle value. (The agency currently collects $30 per $10,000.), Source: Sound Transit, Sound Transit says it needs $15billion to build tracks to Everett, Redmond, Tacoma, Ballard and West Seattle, and provide Interstate 405 bus-rapid transit. The goal is to stretch routes voters previously approved to Northgate, Lynnwood, Overlake and Highline Community College, in the early 2020s, with debt to be paid off around 2053. In the Democratic-controlled House, the transportation committee approved the highway list plus the full $15 billion Sound Transit wants  leaving a $4 billion rift. The UW station will open early next year, auspicious timing for a 2016 ballot measure, in a presidential-election year. Inslee was a student at UW in 1970, when a local ballot measure for high-speed transit narrowly failed, and federal aid went to MARTA in Atlanta. Elected officials have invoked this episode for at least a dozen years to justify tax requests. Isnt it great that after 46 years we get Link rail coming to this station? he said, surrounded by midnight-blue station tiles. The $1.8billion, three-mile tunnel will link Westlake Station, Capitol Hill and the UW campus in an eight-minute ride. A bridge, or a light-rail system, is a monument to optimism, he said. Traffic congestion is bad and can only get worse. I am confident we can solve the problem. Some lawmakers are reluctant to allow Sound Transit the entire menu of sales tax, property tax and car-tab tax it desires. Rep. Reuven Carlyle, D-Seattle and chairman of the House Finance Committee, said he is 110 percent behind building more transit, but he objects that the Sound Transit proposal nudges the state closer to constitutional limits on property tax. That could mean less leeway to boost taxes for education, he said. Within three years, Carlyle forecasts the Legislature will seek property-tax increases to fully fund schools, to get out from under a contempt-of-court order. Im not going to throw 1 million school kids under the bus, for the trains, said Carlyle, even though a proposed Ballard train spur would serve his district. Carlyle said he would support other ideas to reach $15 billion, such as charging a yearly $50 per head payroll tax at companies with more than 50 employees, plus a higher car-tab tax. However, politicians are generally unwilling to offend business groups; the Seattle City Council repealed its $25 head tax for transportation in 2009. Sound Transit Chairman Dow Constantine, the King County executive, predicted a $15 billion request has greater odds of winning an election than an $11 billion version  because rail could be promised to more voters. Not lost on him is the likelihood that $4billion makes the difference between reaching or missing Constantines own neighborhood in West Seattle with rail. The genesis of an $11 billion GOP ceiling isnt entirely clear, but Sen. Ann Rivers, R-La Center, Clark County, recalls that when she heard a $15 billion request, many of us raised a brow. Sen. David Frockt, D-Seattle, and Rep. Jake Fey, D-Tacoma, said the $4 billion gap seems designed to give senators leverage in writing a compromise bill. Republican planks include sending sales tax on road construction to the road fund instead of to the general fund; and deterring Inslee from imposing costly low-carbon fuel regulations. In the end we have a very good shot on getting the full authority thats in the House package, Frockt said. Inslee wouldnt say if hed sign or veto a bill that falls short of Sound Transits request. I dont answer questions like that. I answer questions about what the right thing to do is. Our region is at risk if we dont at least free people to evaluate the full funding package.]", "Date": "20150417", "Title": "[On tour of UW station, Inslee backs $15 billion tax plan for more light rail]", "Link": "http://www.seattletimes.com/seattle-news/transportation/inslee-touts-need-for-light-rail-backs-15-billion-to-expand-line/", "Author": "[Mike Lindblom]"}