{"Content": "[OLYMPIA  Washington may be among the crowd of states moving up its presidential primary in 2016 as part of an effort to cut into the influence wielded by party caucuses. A proposal from Secretary of State Kim Wyman seeks to revamp the way Washingtons political parties pick their candidates for the nations highest office, moving the state away from a system in which party caucuses and conventions control how to award delegates after a nominal primary vote to one with stronger primaries. You have a much more representative outcome for a primary than for a caucus, Wyman said in a Tuesday morning news conference, citing figures that show 3 percent of state voters participate in caucuses versus more than 40 percent in primaries. Under the current process, created by a 1989 ballot initiative, voters choose a party candidate in a primary election, but the state political parties arent bound to use the results of that primary in allocating delegates to a candidate. The state pays for this straw-poll election, which Wymans office projects will cost $11.5 million in 2016, and the process is viewed as optional enough that lawmakers cancelled the 2012 primary to save money during a budget shortfall. Wymans plan, attached to pending bills in the state House and Senate, would move the states default primary date from late May to March 8, a week after the Super Tuesday primaries. It could move even earlier, Wyman said, depending on discussions with governors of a half-dozen other Western states to coordinate a primary date for maximum influence. The Republican and Democratic parties would each be asked to commit to allocating at least some delegates to the winner of its primary election. Even though Washington does not require voters to register with a party preference, voters would have to make a public declaration of party choice to vote in a partys presidential primary. If either party declines, all of the candidates would go onto one ballot with nonbinding results, and no public party declaration would be required to vote. Wymans idea has a strong chance for progress in the Legislature. Sponsors of the bills before the House and Senate include the chairs of the committees that will hear the bill first in each chamber. If it passes, the state Republican party plans to commit to awarding 50 percent or more of its delegates to the winner of its 2016 primary, state Republican chair Susan Hutchison said Tuesday, though the exact figure would be have to be calculated by the party rules committee. The primary is paid for by taxpayers, and so they want to know theres a purpose to it beyond being a beauty pageant, Hutchison said. The Washington state Democratic Party did not immediately respond to a request for comment. The plan comes up for a hearing before a Senate committee Thursday.]", "Date": "20150217", "Title": "[State considers revamping 2016 presidential primary]", "Link": "http://www.seattletimes.com/seattle-news/washington-considers-changing-2016-presidential-primary-2/", "Author": "[DERRICK NUNNALLY]"}