{"Content": "[MASON CITY, Iowa (AP)  Hillary Rodham Clinton said Monday that if elected president, she would make opposition to a Supreme Court ruling that cleared the way for unlimited political donations a litmus test for nominees to the high court. I will do everything I can do to appoint Supreme Court justices who will protect the right to vote and not the right of billionaires to buy elections, Clinton told about 50 supporters at a house party in Iowa. While Clinton has previously said she would support a constitutional amendment overturning the 2010 decision known as Citizens United, she has not previously said publicly that she would use the ruling as a benchmark for nominating justices. She added Monday she is consulting with legal experts about other ways the courts ruling in the case could be trumped. Despite her staunch opposition to Citizens United, which helped usher into politics groups known as super PACs that can raise unlimited amounts of campaign cash, Clinton is directly courting donors for a super PAC backing her candidacy. Democrats were initially reluctant in the elections after the court ruled in Citizens United to fully embrace such outside groups, while Republicans did so with fewer reservations and are aggressively raising money for them in the early days of the 2016 campaign. Clintons stop in the northern Iowa town of Mason City marked her second trip to the state since she formally launched her campaign last month. She spent more than an hour talking with local officials, campaign organizers and volunteers  the type of small-scale campaigning some Iowa Democrats say she didnt do enough of during her first bid for the Democratic nomination in 2008. Clinton placed third in the Iowa caucus that year, behind President Barack Obama and former North Carolina Sen. John Edwards. The hosts of Mondays event, Dean Genth and Gary Swenson, campaigned actively for Obama in 2008. Genth said he didnt choose Obama over Clinton for any ideological reasons, but more because he captured everyones imaginations with his charismatic campaign and his ability to connect to the grassroots. While Clinton so far doesnt face as tough of a primary challenge as she did in 2008, her campaign is eager to show shes learned lessons from her past missteps. The campaign has hired 21 caucus organizers and six regional field directors who are seeking commitments from voters to caucus for Clinton early next year. The early organizing could also yield longer-term benefits for Clintons campaign, should she win her partys nomination. Iowa will be among the competitive battleground states in the general election and her campaign can draw on the voter contacts it makes now next year. Clinton arrived in Iowa under pressure from Republicans who want her to clarify her position on a massive Asia-Pacific trade deal being debated on Capitol Hill. While Clinton was supportive of the Trans-Pacific Partnership pact while serving as Obamas secretary of state, she has been largely silent on the matter since announcing her campaign. Obamas push for the trade deal has angered some liberal Democrats who fear the agreement with Japan and several other nations would hurt U.S. companies and workers. As she opened her remarks Monday, Clinton subtly defended her decision to avoid wading into the trade debate or taking questions from reporters on a range of other issues. Though she never mentioned the Republican criticism directly, she said small events that put her in direct contact with voters are providing her with the foundation for her campaign, as well as the kind of information I need to be an even better president. ", "Date": "20150518", "Title": "[Clinton sets Citizens United as Supreme Court litmus test]", "Link": "http://www.seattletimes.com/nation-world/clinton-sets-citizens-united-as-supreme-court-litmus-test/", "Author": "[JULIE PACE]"}