{"Content": "[NORWAY just held a federal election. Almost 80 percent of eligible voters cast ballots. Germany just held a federal election. Seventy-two percent of eligible voters cast ballots. Those are not outlier numbers. Most countries that the United States would compare itself with register dramatically higher turnout rates than those posted in our federal elections. Roughly 53 percent of the voting-age population participated in the 2012 U.S. presidential elections. In this country, roughly 37 percent participated in the most recent off-year congressional election  the 2010 contest that saw Republicans take control of the U.S. House and most state houses. The U.S. now ranks No. 21 in the The Economists annual Democracy Index, with especially low marks for political participation. On the indexs scale of one to 10, the U.S. gets an 8.1 rating, just one-tenth of a point above the line the analysts draw to separate fully functional democracies from those experiencing notable dysfunction. There can no longer be any question that free and fair elections  what we were raised to believe was an American democratic birthright  are effectively being taken away from the people. Billionaires, corporations, the politicians who do their bidding and the media conglomerates that facilitate the abuse are sapping elections of their meaning and of their democratic potential. The Money Power  as Teddy Roosevelt and his progressive contemporaries termed the collaboration that imposed the will of wealth on our politics  achieves its ends by flooding the electoral system with an unprecedented tidal wave of unaccountable spending. That money makes a mockery of political equality in the voting booth. The determination of media companies to cash in on that mockery  when they should instead be exposing and opposing it  completes a vicious circle. This is not an entirely new phenomenon. But it is an accelerating phenomenon, with spending in 2012 hitting the $10 billion mark. The U.S. Supreme Courts 2010 Citizens United decision allowing unlimited corporate campaign spending confirmed the court-ordered diminution of democratic processes. But, as law professor Lawrence Lessig notes, The day before Citizens United was decided, our democracy was already broken. Citizens United may have shot the body, but the body was already cold. Self-interested donors, corporations and their political pawns are grasping for total power. If they did not succeed in choking off every avenue of dissent in 2012, they will surely return, with increased determination and more insidious tactics in 2014, 2016 and beyond. We have one of the worst election processes in the world right in the United States of America, former President Jimmy Carter said in 2012, and its almost entirely because of the excessive influx of money. The owners of media corporations have made their pact with the new order. For the most part, they do not challenge it. Rather, managers position media outlets to reap windfall profits through the broadcasting of inane and crudely negative political campaign advertising, which is now the lingua franca of American electioneering. To talk about the crisis of money in politics without addressing the mess that the media have made of things is the equivalent of talking about the deliberate fire without discussing the arsonist. The emerging money-and-media election complex has become so vast and so powerful that it can best be understood as an entity unto itself. It is this complex that defines our politics, largely through negative ads. In some high-stakes races, these ads account for more than 90 percent of the political communications on radio and television. This sort of advertising, which is banned in many countries that seek and achieve high voter turnout, represents a form of voter suppression every bit as noxious as a restrictive voter ID law. An onslaught of negative advertising  in the absence of serious journalism and serious debate  repulses potential voters. That repulsion discourages participation by the voters who are most likely to demand better; as such, the negative ads benefit a status quo that is renewing the social and economic inequality that defined the Gilded Age. The response of the progressives of a century ago to political structures and practices that promoted that sort of inequality was a demand for fundamental reform that would open up the process and make the vote matter more than the dollar. If we hope to ever again see meaningful, high-turnout elections in the United States, Americans must demand nothing less. The demands are already being made at the grass-roots level. Tuesday is Election Day in Seattle and voters will have an opportunity to reform how local democracy works. Proposition 1 would establish a public-financing system, creating a property-tax levy that would provide City Council candidates who raise small amounts of money from Seattle residents with a $6-to-$1 match. Another proposal, Charter Amendment 19, would convert some at-large City Council seats to district-based seats, making it easier for candidates who do not have a lot of money to run and win with community-based, door-to-door campaigns. These are important steps, but they will not be sufficient to reverse the slide toward dollarocracy. A year ago, President Obama (no slouch in the fundraising department) responded to a question about money in politics by saying, I think we need to seriously consider mobilizing a constitutional amendment process to overturn Citizens United  , The people are ahead of their president on this one. Sixteen states have already formally called on Congress (via ballot measures, legislative or official letters signed by a majority of state legislators) to begin the process of amending the Constitution to address the damage that is being done. In todays campaigns, money no longer merely speaks  it shouts. In March, the Washington state House voted 55-42 in favor of a resolution written by state Rep. Jamie Pedersen, D-Seattle, that seeks a federal amendment to restore the authority to regulate election campaign contributions to Congress and state legislatures. That measure is now pending in the state Senate, as are similar resolutions in states across the country. Too much of our media and too many of our politicians remain focused on the failure of our politics that is on display in Washington, D.C. The real story is playing out at the grass-roots level. Americans are demanding reform. And those demands are essential if the United States is to avert dollarocracy and embrace democracy. John Nichols of Washington, D.C. and Robert W. McChesney of Madison, Wis. are the authors of Dollarocracy: How the Money and Media Election Complex is Destroying America. McChesney has a M.A. and Ph.D. from the University of Washington.]", "Date": "20131102", "Title": "[Guest: Avalanche of money makes a mockery of political equality]", "Link": "http://www.seattletimes.com/opinion/guest-avalanche-of-money-makes-a-mockery-of-political-equality/", "Author": "[Robert W. McChesney, John Nichols]"}