{"Content": "[WASHINGTON  The gun-control movement, blocked in Congress and facing mounting losses in federal elections, is tweaking its name, refining its goals and using the same-sex marriage movement as a model to take the fight to voters on the state level. After a victory in November on a Washington state ballot measure that will require broader background checks on gun buyers, groups that promote gun regulations are turning their attention  and their growing wallets  to other states that allow ballot measures. An initiative seeking stricter background checks for certain purchasers has qualified for the 2016 ballot in Nevada, where such a law was passed last year by the Legislature and then vetoed by the governor. Advocates of gun safety  the term many now use instead of gun control  also are seeking spots on ballots in Arizona, Maine and Oregon. I cant recall ballot initiatives focused on gun policy, said Daniel Webster, director of the Johns Hopkins Center for Gun Policy and Research. There wasnt the money. Colorado and Oregon approved ballot measures on background checks at gun shows after the Columbine school massacre in 1999, but the movement stalled after that. The National Rifle Association (NRA), which raises millions of dollars a year largely from small donors and has one of the most muscular state-lobbying apparatuses in the country, is attuned to its foes shift in focus. We will be wherever they are to challenge them, said Andrew Arulanandam, the groups spokesman. The new focus on ballot initiatives comes after setbacks in Congress and in statehouses. After the 2012 massacre of schoolchildren in Newtown, Conn. President Obamas effort to pass a background-check measure never got out of the Democratic-controlled Senate. Although 10 states have passed major gun-control legislation, not only in Connecticut and New York but also Colorado, more states have loosened gun restrictions. Candidates who backed gun control mostly lost in the midterm elections, even after groups spent millions on their behalf. The last setback came in December, when Martha McSally, a Republican, prevailed in a razor-thin recount over a Democratic incumbent, Rep. Ron Barber of Arizona. Barber was wounded in the 2011 shooting of Rep. Gabrielle Giffords, and lost even though Giffords PAC, Americans For Responsible Solutions, spent more than $2 million in the race. Message recast, Gun-control groups say that although they are dwarfed by the NRA, they have more money and are involved in more grass-roots activism than ever before. The NRA was heavily outspent in the Washington state referendum. The advocacy groups have recast their cause as a public-health and safety movement, and are homing in on areas where polling has shown voter support, such as expanded background checks and keeping guns out of the hands of people with domestic-violence convictions, restraining orders or mental illnesses. Some of those provisions have gained steam even in heavily Republican-controlled state governments, such as those in Louisiana and Wisconsin. Things that people feel are most doable politically right now are connected to domestic violence, Webster said. There is a lot of uptick on that issue even in red states and states with a lot of guns. In the past two years, 11 states have passed such legislation. Closing loopholes on background checks for gun owners is an area Americans support far more than steps such as curbs on assault weapons or limits on magazine sizes. A recent Pew survey showed that 52 percent of respondents said they believed it was more important to protect gun-ownership rights. That figure was up from 29 percent in 2000. Still, in a 2013 poll, Pew found that nearly 75 percent of respondents supported background-check expansions. Gun-control advocates believe that ensuring background checks for the majority of gun buyers is the foundation of all other existing laws. The reason voters support these laws is the same reason the movement supports these laws, said Laura Cutilletta, a senior lawyer for the Law Center to Prevent Gun Violence. The same-sex marriage movement has been a model for advocates of new gun restrictions. As with gay marriage, background-check expansions enjoy far broader public support in polls than among elected officials, and they affect state residents immediately. The arc of the marriage-equality movement started in the federal government, and got them the Defense of Marriage Act, said John Feinblatt, president of Everytown for Gun Safety, the gun-control group backed by Michael Bloomberg, the former mayor of New York City. Then they went to the states and showed that if you can get the majority of the public on your side state by state, that will influence the courts and Congress in the end. Refighting the battle, Last month, Gov. Terry McAuliffe of Virginia, which has been the source of many illegally obtained guns in other states, proposed the restoration of the states limit on handgun sales to one a month to slow the iron highway, a nickname for gunrunning up Interstate 95 to states to the north. He would also seek mandatory background checks on gun sales at firearm shows, and end issuing gun permits to anyone restrained under domestic-violence orders of protection. I own three guns, said McAuliffe, a Democrat. I love to take my three boys hunting. This is not gun restriction, this is anti-crime. I couch it in economic terms. The prospects for his gun proposals did not look great out of the gate. The governor knows refighting the one-gun-a-month battle will not be productive, Thomas Norment Jr. the Republican majority leader of the Virginia Legislature, said in a statement. For gun-control groups, money is not the problem it was only recently. Contested ballot-initiative programs cost between $5 million and $15 million, said Pia Carusone, a senior adviser to Giffords group. You will see heavy hitters; money isnt a problem, she said. The group has raised about $30 million for all political activities, including the Washington state initiative, in the past two years. Bloomberg has spent millions of dollars on everything from research to political campaigns to the Washington referendum and is prepared to continue to do so. Gun-rights groups plan to meet them head-on. The terrain gets a lot harder for him, Arulanandam, the NRA spokesman, said of Bloomberg. The Brady Campaign to Prevent Gun Violence  along with other advocacy groups  is evaluating which states among the 17 that allow ballot initiatives are the best spots to pick for the next fight; Maine, Arizona and Oregon, should their legislatures not take action, are widely viewed as the three with the most potential for gun-control advocates. In Washington, those who pushed the ballot measure through say they will begin a campaign to get the Legislature to pass measures to keep guns from those with mental illnesses, children and people with a record of domestic violence. Opponents of gun control, for their part, went to the courts this week to challenge the new background-check requirements. As with the same-sex marriage movement  and efforts by some conservative groups to weaken labor unions and to make abortions more difficult to obtain  the efforts of gun-rights advocates and advocates for gun restrictions demonstrate a fading faith that legislative remedies are to be found in Congress. Whether its on guns or immigration or tax reform, clearly Washington (D.C.) is broken, Feinblatt said. You have to influence the federal government at the state.]", "Date": "20150102", "Title": "[With success of gun-check law in Washington, groups turn attention to other states]", "Link": "http://www.seattletimes.com/nation-world/with-success-of-gun-check-law-in-washington-groups-turn-attention-to-other-states/", "Author": "[JENNIFER STEINHAUER]"}