{"Content": "[WASHINGTON  With only 8percent of salaried workers currently covered by overtime rules, Sen. Patty Murray says its time for the federal government to intervene. After becoming the top Democrat on the Senate Health, Education, Labor and Pensions Committee in January, the senator from Washington state is among the leading backers of a White House plan to expand overtime pay for nearly 5 million Americans. It could mean raises for 90,000 workers in her home state. Murray faces resistance from retailers who fear that higher pay would force them to cut jobs and reduce work hours. She counters that the overtime rules are outdated, doing little to help workers who are routinely assigned to longer hours. It would mean a lot of money in peoples pockets, and what it basically means is youre going to get paid for the work that you do, Murray said in an interview Tuesday. In the mid-1970s, Murray said, 62 percent of the American workforce was covered by overtime rules, but that number has been in steady decline. Under federal law, hourly employees are guaranteed overtime pay for working more than 40 hours per week, receiving at least 1 times their regular rate of pay. But the rules limit overtime pay for salaried workers to those who earn less than $23,660 per year. Under the White House plan announced earlier this month by President Obama, that threshold would more than double, to $50,440. Murray said shes confident that the new rule will take effect after the Department of Labor seeks comment on the proposal. Murray said the only way it can be blocked is if Congress intervenes. Even then, she said, Obama could use his veto power to prevail. This is something that is going to happen, Murray said. So far, the proposal isnt causing much of a fuss in Washington state. The Washington Retail Association, based in Olympia, said it had not yet decided how to react, while Amazon, the Seattle-based Internet retail giant, did not respond to a request for comment. In Washington, D.C. its a much different story. In a statement, the National Retail Federation, the nations largest retail trade association, called the plan an attempt to build the middle class by government mandate. There simply isnt any magic pot of money that lets employers pay more just because the government says so, said David French, the groups senior vice president for government relations. And House Republicans, anticipating the White House move, called a hearing on the plan in June, nearly a month before Obama announced the proposed change. Rather than providing more opportunities for individuals to earn overtime pay, it appears that the new regulations will only result in a more complicated law, requiring outside legal advice for small businesses, and more litigation, said Jamie Richardson, White Castles vice president of government and shareholder relations, testifying before the House Subcommittee on Workforce Protections. Despite the opposition, Murray said the plan will boost the economy by helping people spend more. If they get that additional money for working more, theyre going to have more in their pockets to take their kids out for pizza or to buy them another pair of shoes for school or to perhaps save for their college, she said. The issue is just one of many pro-labor plans on Murrays plate this year, after she replaced former Iowa Sen. Tom Harkin as the ranking Democrat on the Health, Education and Pensions Committee. Murray called it a rewarding assignment. While she has gained much attention for overhauling the No Child Left Behind schools law, she has also used her new perch to promote a series of labor issues. Among them:,  Shes the chief sponsor of the Raise the Wage Act, which would increase the federal minimum wage to $12 by 2020.  Shes the lead Senate Democrat on The Healthy Families Act, which would require employers to provide up to seven paid sick days per year. It would apply to companies with more 15 employees.  She teamed up with Democratic Sen. Elizabeth Warren, of Massachusetts, to introduce a bill aimed at giving workers more predictability in their work schedules. It would require retail, food service and cleaning employees to receive work schedules at least two weeks in advance, or one hours worth of extra pay for schedules changed with less than a 24-hour notice.  She has pushed to close the wage gap between men and women working the same jobs. And she released a report showing the challenges women face in retirement, with a poverty rate nearly double that of men among those 65 and older. For Murray, a 64-year-old former preschool teacher, theyre all bread-and-butter family issues. And theyre sure to come into play in 2016, when the states senior senator runs for a fifth term. In the 2014 election cycle, Murray ranked 19th among sitting senators in receiving campaign donations from labor, according to the Center for Responsive Politics in Washington, D.C. which tracks political spending. She received $84,375 in the two-year cycle. While labor groups generally support her, many of them were angered by her vote in May to support Obamas plan for fast-track trade authority.]", "Date": "20150722", "Title": "[Sen. Patty Murray pushing to expand overtime pay rules]", "Link": "http://www.seattletimes.com/business/sen-murray-uses-new-perch-to-push-for-more-overtime-pay/", "Author": "[Rob Hotakainen]"}