{"Content": "[CHICAGO (AP)  Hillary Rodham Clintons presidential campaign will center on boosting economic security for the middle class and expanding opportunities for working families, while casting the former senator and secretary of state as a tenacious fighter able to get results, two senior advisers said Saturday. President Barack Obama all but endorsed her, saying I think she would be an excellent president. The senior advisers provided the first preview of the message Clinton planned to convey when she launches her long-anticipated campaign on Sunday with an online video. Until now, the former first lady has offered only hints of what would drive her if she were to run a second time for the White House. The strategy described by Clintons advisers has echoes of Obamas 2012 re-election campaign. He framed the choice for voters as between Democrats focused on the middle class and Republicans wanting to protect the wealthy and return to policies that led to the 2008 economic collapse. The advisers said Clinton will argue that voters have a similar choice in 2016. Clinton also intends to sell herself as being able to work with Congress, businesses and world leaders. That approach could be perceived as a critique of Obama, Clintons rival for the nomination in 2008. He has largely been unable to fulfill his pledge to end Washingtons intense partisanship and found much of his presidency stymied by gridlock with Congress. The Clinton advisers spoke on condition of anonymity in order to discuss her plans ahead of Sundays announcement. People familiar with the plans say Clinton will travel to Iowa and other early-voting states to hold small events with residents in the days after the videos release. In New York on Saturday, at the final event put on by Ready for Hillary, a group not connected with her campaign thats worked for the past few years to stoke excitement for it, enthusiastic supporters joined elected officials and local party leaders to celebrate the launch to come. After she left the State Department she could have slipped into grandmother-hood, but people want to call her back into public service, said Jarret Berg, 29, a Democratic staffer in the New York legislature. Its time for her. As her official announcement loomed, the Republican National Committee linked Clinton to Obama, a regular focus of criticism from the GOP. All Hillary Clinton is offering is a continuation of the same big government ideas that have grown Washington instead of the middle class, RNC spokesman Michael Short said in a statement. Thats why voters want fresh leadership and a new direction, not four more years of Obamas failed policies. Clinton is not expected to roll out detailed policy positions in the first weeks of her campaign. Advisers said she planned to talk about ways families can increase take-home pay, the importance of expanding early childhood education and making higher education more affordable. Its not yet clear whether that will include a noticeable break with Obama on economic policy. The GOP has hammered Obamas approach as anti-business and insufficient in the wake of the recession. The White House says the economy has improved significantly in recent years. The unemployment rate fell to 5.5 percent in March, but manufacturing and new home construction slowed, cheaper gas has yet to ignite consumer spending and participation in the labor force remains sluggish. Clinton will enter the race as the overwhelming favorite for her partys nomination. Still, her team has said her early strategy is designed to avoid appearing to take that nomination for granted. Clinton received an early boost Saturday from Obama, who was asked if he would be involved in her expected campaign. She was a formidable candidate in 2008. She was a great supporter of mine in the general election. She was an outstanding secretary of state. She is my friend. I think she would be an excellent president, and Im not on the ballot so Im not going to step on her lines, Obama said from Panama City as he wrapped up participation in a summit of Western Hemisphere leaders. Clintons early events will include discussions at colleges, day care centers and private homes, and stops at coffee shops and diners. After about a month of such events, Clinton will give a broader speech outlining more specifics about her rationale for running. Clintons husband, Bill, and daughter, Chelsea, are unlikely to appear at her early events. Bill Clinton, the former two-term president, said recently that he wanted to play a role as a backstage adviser in his wifes campaign. Advisers said Bill Clinton has been engaged with his wife in some of the policy discussions leading up to this weekends rollout. To prepare for the campaign, Clinton has spent months meeting with economic policy experts, including Heather Boushey, whose research focuses on inequality, and Teresa Ghilarducci, a labor economist and retirement policy expert. The policy development process has been overseen by aides Jake Sullivan and Dan Schwerin. In the days before her announcement, Clinton has been holding lengthy meetings with her staff, sometimes joining them at her crowded personal offices in midtown Manhattan and other times participating by phone. She is expected to reach out to donors in the coming weeks, but does not plan to headline many fundraising events over the next month. Clintons growing team of staffers began working Friday out of a new campaign headquarters in Brooklyn. They gathered Saturday to hear from campaign manager-in-waiting Robby Mook, who told them the campaign would value teamwork, diversity, discipline and humility. Mook distributed a memo titled We are Hillary for America that included several guiding principles, including a vow to work together and respect each other. The campaign, the memo said, is not about Hillary Clinton and not about us  its about the everyday Americans who are trying to build a better life for themselves and their families. The meeting was described by a Democratic official in attendance who spoke on condition of anonymity to describe a private strategy session. The memo was first reported by Politico. ", "Date": "20150411", "Title": "[Clinton campaign to focus on economic security, opportunity]", "Link": "http://www.seattletimes.com/nation-world/clinton-campaign-to-focus-on-economic-security-opportunity/", "Author": "[JULIE PACE]"}