{"Content": "[White people will no longer make up a majority of Americans by 2043, according to new census projections. Thats part of a historic shift that already is reshaping the nations schools, workforce and electorate, and is redefining long-held notions of race. The official projection, released Wednesday by the Census Bureau, now places the tipping point for the white majority a year later than previous estimates, which were made before the impact of the recent economic downturn was fully known. America continues to grow and become more diverse due to higher birth rates among minorities, particularly for Hispanics who entered the U.S. at the height of the immigration boom in the 1990s and early 2000s. Since the mid-2000 housing bust, however, the arrival of millions of new immigrants from Mexico and other nations has slowed from its once-torrid pace. The countrys changing demographic mosaic has stark political implications, shown clearly in last months election that gave President Barack Obama a second term  in no small part due to his support from 78 percent of non-white voters. There are social and economic ramifications, as well. Longstanding fights over civil rights and racial equality are going in new directions, promising to reshape race relations and common notions of being a minority. White plaintiffs now before the Supreme Court argue that special protections for racial and ethnic minorities dating back to the 1960s may no longer be needed, from affirmative action in college admissions to the Voting Rights Act, designed for states with a history of disenfranchising blacks. Residential segregation has eased and intermarriage for first- and second-generation Hispanics and Asians is on the rise, blurring racial and ethnic lines and lifting the numbers of people who identify as multiracial. Unpublished 2010 census data show that millions of people shunned standard race categories such as black or white on government forms, opting to write in their own cultural or individual identities. By 2060, multiracial people are projected to more than triple, from 7.5 million to 26.7 million  rising even faster and rendering notions of race labels increasingly irrelevant, experts say, if lingering stigma over being mixed-race can fully fade. The non-Hispanic white population, now at 197.8 million, is projected to peak at 200 million in 2024, before entering a steady decline in absolute numbers as the massive baby boomer generation enters its golden years. Four years after that, racial and ethnic minorities will become a majority among adults 18-29 and wield an even greater impact on the youth vote in presidential elections, census projects. The fast-growing demographic today is now the children of immigrants, said Marcelo Suarez-Orozco, a global expert on immigration and dean of UCLAs Graduate School of Education & Information Studies, describing the rate of minority growth in the U.S. as dipping from overdrive to drive. Even with slowing immigration, Suarez-Orozco says, the die has been cast for strong minority growth from births. As recently as 1960, whites made up 85 percent of the U.S. but that share has steadily dropped after a 1965 overhaul of U.S. immigration laws opened doors to waves of new immigrants from Mexico, Latin America and Asia. By 2000, the percentage of U.S. whites had slid to 69 percent; it now stands at nearly 64 percent. Moving forward, the U.S. will become the first major post-industrial society in the world where minorities will be the majority, Suarez-Orozco said. With the white baby boomer population now leaving the workforce, the big challenge will be educating the new immigrants, he said. The U.S. has nearly 315 million people today. According to the projections released Wednesday, the U.S. population is projected to cross the 400 million mark in 2051, 12 years later than previously projected. The population will hit 420.3 million a half century from now in 2060. By then, whites will drop to 43 percent of the U.S. Blacks will make up 14.7 percent, up slightly from today. Hispanics, currently 17 percent of the population, will more than double in absolute number, making up 31 percent, or nearly 1 in 3 residents, according to the projections. Asians are expected to increase from 5 percent of the population to 8 percent. Among children, the point when minorities become the majority is expected to arrive much sooner, by 2018 or so. Last year, racial and ethnic minorities became a majority among babies under age 1 for the first time in U.S. history. At the same time, the U.S. population as a whole is aging, driven by 78 million mostly white baby boomers born between 1946 and 1964. By 2030, roughly 1 in 5 residents will be 65 and older. Over the next half century, the oldest old  those ages 85 and older  will more than triple to 18.2 million, reaching 4 percent of the U.S. population. The actual shift in demographics will be shaped by a host of factors that cant always be accurately pinpointed  the pace of the economic recovery, cultural changes, natural or manmade disasters, as well as an overhaul of immigration law, which is expected to be debated in Congress early next year. The next half century marks key points in continuing trends  the U.S. will become a plurality nation, where the non-Hispanic white population remains the largest single group, but no group is in the majority, said acting Census Bureau Director Thomas Mesenbourg. Republicans have been seeking to broaden their appeal to minorities, who made up 28 percent of the electorate this year, after faring poorly among non-whites on Election Day, when Republican presidential candidate Mitt Romney carried only about 20 percent of non-white votes. The race and ethnic changes are already seen in pockets of the U.S. and in the younger age groups, where roughly 45 percent of all students in K-12 are Hispanics, blacks, Asian-Americans and others. Already, the District of Columbia and four states  Hawaii, California, New Mexico and Texas  have minority populations greater than 50 percent; across the U.S. more than 11 percent of counties have tipped to majority-minority status. Last month, nearly all voters over age 65 were white (87 percent), but among voters under age 30, just 58 percent were white. Irrespective of future immigration and minority fertility patterns, the U.S. is facing a stagnating white population, said William H. Frey, a demographer at the Brookings Institution. The biggest shift will occur over the next 20 years as the mostly white baby boom generation moves into traditional retirement years. It is in the child and early labor force ages where we must be ready for the greatest changes as new American minorities take over for aging whites. Economically, the rapidly growing non-white population gives the U.S. an advantage over other developed nations, including Russia, Japan and France, which are seeing reduced growth or population losses due to declining birth rates and limited immigration. The combined population of more-developed countries other than the U.S. has been projected to decline beginning in 2016, raising the prospect of prolonged budget crises as the number of working-age citizens diminish, pension costs rise and tax revenues fall. Depending on future rates of immigration, the U.S. population is estimated to continue growing through at least 2060. In a hypothetical situation in which all immigration  both legal and illegal  immediately stopped, previous government estimates have suggested the U.S. could lose population beginning in 2048. Young families  many of them first or second-generation immigrants  have been the engine of U.S. population growth for several decades, said Mark Mather, associate vice president of the Population Reference Bureau. AP Director of Polling Jennifer Agiesta contributed to this report.]", "Date": "20121212", "Title": "[Census: Whites no longer a majority in US by 2043]", "Link": "http://www.seattletimes.com/seattle-news/politics/census-whites-no-longer-a-majority-in-us-by-2043/", "Author": "[HOPE YEN]"}