{"Content": "[For Bellevue-based T-Mobile USA, a deal with satellite-TV provider Dish Network isnt the only option  and it may not be the best one either. The fourth-largest U.S. wireless carrier has climbed 15 percent since Sprint decided in August to drop its bid for T-Mobile because of regulatory pressure (getting a 1.8 percent boost in the last 10 days on reports that Dish and T-Mobile were in merger talks). Earnings at T-Mobile, a $32 billion company, have gotten better, too, as it gained more subscribers. Because of that, T-Mobiles German parent Deutsche Telekom can command top dollar for what is probably the last major U.S. mobile-phone service provider still obtainable. T-Mobile has outperformed their expectations, thats for sure, said Sergey Dluzhevskiy, an analyst at Gabelli & Co. They are going to be looking for the best possible deal. Charlie Ergen is a tough negotiator, and obviously Deutsche Telekom is not a forced seller. Dish Chief Executive Office Charlie Ergen said in a Bloomberg TV interview that T-Mobile remains a logical merger partner for his $34billion company, but Deutsche Telekom may be in a position where it doesnt want to do a deal. Would Dish and T-Mo be a logical combination? I think it would be. I think that there are certainly a lot of positives to that, if theres willing participants, Ergen said. Theyre obviously controlled by a German company who has strategic initiatives, both in Europe and the United States, and they may not be in a position where they want to do anything. T-Mobile would be on the pricier side for a billionaire dealmaker who isnt known for paying up. Ergen amassed his stockpile of spectrum, or wireless airwaves, mainly through bankruptcy auctions. While he did shell out most of Dishs cash for the latest government sale of bandwidth, he used a loophole to get about $3 billion in discounts. In a sale, T-Mobile  whose stock closed Friday at $39  could probably command about $49 a share, Dluzhevskiy, of Gabelli, said. Another sticking point is that Dish would likely pay for a large portion of any T-Mobile takeover in stock. Deutsche Telekom is concerned that Dish shares are overvalued and the premium investors now assign to its unused spectrum will go away once those airwaves are put to use, according to people familiar with the matter, who asked not to be identified because the information is private. T-Mobile will eventually need more spectrum to continue growing and a deal with Dish would let it avoid spending billions at government auctions. Thats not a pressing need right now, though, because T-Mobiles customer base is still relatively small and it has ample capacity where it has coverage, Walter Piecyk, an analyst at BTIG, wrote in a June 4 report. At $49 a share, a takeover of T-Mobile would be a $62 billion deal, including debt. Its big, but several billion less than what Comcast was willing to pay for Time Warner Cable. And there are companies in the industry, Comcast included, that might consider the price tag worth it. Buying T-Mobile would help Comcast offer TV, Internet, mobile and wireline service in one package  a quadruple play that peers in Europe have already been moving toward, Dluzhevskiy said. Altice, which was in the running for Time Warner Cable, is more of a longshot buyer. Still, the cable operator has said it wants the U.S. to ultimately account for half of its business and there arent many other big targets available to get it there. Even Charter Communications could take a look after it digests the planned $79billion purchase of Time Warner Cable announced in May. Wireless suitors for T-Mobile are also a possibility. Foreign carriers such as Mexican billionaire Carlos Slims America Movil could consider a bid to expand their U.S. presence. Sprint and its majority owner SoftBank could also make another run at T-Mobile if the 2016 presidential election brings in an administration more amenable to its case.]", "Date": "20150612", "Title": "[T-Mobile in position to weigh other options besides Dish]", "Link": "http://www.seattletimes.com/business/t-mobile-in-position-to-weigh-other-options-besides-dish/", "Author": "[Brooke Sutherland, Alex Sherman]"}