{"Content": "[Andrew Cuomo was sworn in for his second term as governor Thursday just hours before his father died. Former three-term Gov. Mario Cuomo did not attend the inauguration because his ill health forced him to stay home. Cuomo said in his inaugural address that he had gone through his speech with his father, who quipped that it was good, especially for a second-termer. He couldnt be here physically today  but my father is in this room, he said. Hes in the heart and mind of every person who is here. His inspiration and his legacy and his spirit is what has brought this day to this point. The governors office said the elder Cuomo died at his home of natural causes due to heart failure. Andrew Cuomo, speaking from the symbolic heights of the newly completed One World Trade Center, used his inauguration to urge New Yorkers to lead by example through some of the nations worst problems. He aimed high with his rhetoric, touching on national issues sure to trigger questions about his political ambitions while also hinting that he may firmly insert himself into the imbroglio that has roiled the nations largest city. We work harder and we earn less. Income inequality is at the highest point in over a century. While American capitalism never guaranteed success, it did guarantee opportunity, Cuomo said. For too many, the dream of economic mobility has been replaced with a nightmare of economic stagnation. Cuomo said these frequently troubled times are a uniquely New York moment because when things are at their worst, New York is at its best. The governor also reacted to the protests against police brutality that have swept the nation since grand juries failed to indict police officers in the deaths of black men, including Eric Garner, whose last moments were captured on videotape as he was placed in a fatal chokehold by a white New York Police Department officer. The world saw an African-American man in Staten Island die and people are confused, disgruntled and angry, Cuomo said.  He argued that today, sadly, too many people are questioning if the blindfold is still intact or does the justice system now see black and white or black and blue or rich and poor. The resulting protests have driven a wedge between Mayor Bill de Blasio and New York City police unions, which have claimed that the mayor has helped create an anti-NYPD atmosphere that led to the fatal shooting of two police officers on Dec. 20. Law enforcement officials have been wrongfully targeted and even assassinated. It must stop, Cuomo said, before calling the two sides to work harder to find common ground. Everyone is talking but no one is listening. De Blasio, whose relationship with Cuomo has at times been rocky, and the head of the largest police union both attended the inauguration but did not speak. The Democratic governor  who has been mentioned as a possible 2016 presidential candidate  took the oath of office in a private ceremony at the governors mansion on Wednesday afternoon, alongside incoming Lt. Gov. Kathy Hochul. The 57-year-old Cuomo, who defeated Republican Rob Astorino 54 percent to 40 percent to secure his second term, then to traveled to Buffalo  Hochuls home  for a second inaugural ceremony. He gave a similar speech, with additional focus on New Yorks upstate economy. During his half-hour speech in Manhattan, Cuomo said he wanted to focus his second term on continued efforts to revitalize upstate New York, overhaul public education and make government fairer and more effective. He said the state had made great strides since he took office, turning a $10 billion deficit into a $5 billion surplus, expanding health care to cover 1.5 million more people, approving same-sex marriage, enacting tougher gun control laws and reversing gridlock and dysfunction in state government by getting Republicans and Democrats to work together. He said the state needed to replicate reforms occurring in Buffalo throughout the upstate region and address chronic high poverty with higher wages so you dont have to choose between paying the rent and putting food on the table. On Wednesday, Cuomo is scheduled to deliver his state of the state address to lawmakers, who will begin their 2015 session next week.]", "Date": "20150102", "Title": "[Andrew Cuomo begins 2nd term on day his father dies]", "Link": "http://www.seattletimes.com/nation-world/andrew-cuomo-begins-2nd-term-on-day-his-father-dies/", "Author": "[JONATHAN LEMIRE]"}