{"Content": "[OXON HILL, Md. (AP)  Wisconsin Gov. Scott Walker said Thursday that his experience taking on thousands of protesters in his state helped prepare him to take on terrorists across the world. The likely Republican presidential contender sparked pointed criticism from labor union leaders across the country after remarks delivered on the first day of the Conservative Political Action Conference in suburban Washington. The annual conference features more than a dozen potential Republican presidential contenders over three days hoping to win over conservative activists. Asked how he would handle the Islamic State group if elected president, Walker said, For years Ive been concerned about that threat, not just abroad but here on American soil. If I can take on 100,000 protesters, I can do the same across the world, he said. Walker is gearing up for a 2016 presidential contest in which foreign policy figures to play prominently. What determines the perfect candidate for 2016?, GOPs Jeb Bush working to reassert conservative credentials, Christie tells CPAC crowd he shouldnt be counted out, Carly Fiorina ramps up Hillary Clinton attacks at CPAC, Islamic State militants have captured large parts of Iraq and neighboring Syria over the last year. They declared a self-styled caliphate on territories that are under their control, killing members of religious minorities, driving others from their homes, enslaving women and destroying houses of worship. Walkers comments drew sharp reaction from union leaders. Its disgusting that Gov. Walker would compare everyday heroes  educators  to international terrorists, said Betsy Kippers, a teacher and president of the Wisconsin Education Association Council. Gov. Walker, I know terrorism. I know that your own states citizens speaking up for whats right isnt terrorism, said Jim Tucciarelli, a union representative in New York City whose office was one block away from the 9/11 attacks. Today, after hearing your words, I also know the sound of cowardice. Walker has limited experience with foreign policy. He recently returned from a trip to England. The Wisconsin governor has faced particularly aggressive protests from labor unions over his budget policies in the four years since he took office. He survived a recall election in 2010 and a bitter re-election test last fall. Walker spokesman Kirsten Kukowski sought to clarify his remarks after the speech. Gov. Walker believes our fight against ISIS is one of the most important issues our country faces. He was in no way comparing any American citizen to ISIS, Kukowski said, using one acronym for the Islamic State group. What the governor was saying was: When faced with adversity he chooses strength and leadership. Walker dedicated much of his remarks Thursday to the threat of radical Islam. He said he receives regular threat assessments from the FBI and the leader of Wisconsins National Guard. We need a president, a leader, who will stand up and say we will take the fight to them and not wait til they bring the fight to American soil, he said. We need to show the world that in America you have no better ally and no greater enemy. Walker was briefly interrupted during his remarks with a Run Scott Run chant. Ive been running three times in the last four years, he said, so Im getting pretty used to it. __, AP writer Scott Bauer in Madison, Wisc. contributed to this report.]", "Date": "20150226", "Title": "[Scott Walker: Wisconsin protesters prepared him to confront global terrorism]", "Link": "http://www.seattletimes.com/nation-world/walker-protesters-prepared-him-to-confront-global-terrorism/", "Author": "[STEVE PEOPLES]"}