{"Content": "[LAGOS, Nigeria (AP)  They have been gone a year now, the hundreds of girls abducted by Islamic militants from their school in northeastern Nigeria. And while the cry to Bring Back Our Girls remains a worldwide cause, the new president Tuesday would not repeat his predecessors failed promise to find them  only that they wont be forgotten. A solemn march was held to remember the 219 girls seized from their boarding school in Chibok by gunmen from the Boko Haram extremist group. In Nigerias capital of Abuja, 219 girls paraded in the streets, with each carrying a placard bearing the name of a kidnap victim. We believe the girls are still alive, said Dr. Allan Manasseh, the brother of missing 18-year-old Maryamu Wavi, in an interview with The Associated Press. But it was clear that hope has dwindled a year after the April 14-15 mass abduction. President-elect Muhammadu Buhari said he must be honest about the prospects of getting the missing girls back to their families. We do not know if the Chibok girls can be rescued. Their whereabouts remain unknown, Buhari said in a statement. As much as I wish to, I cannot promise that we can find them. The statement by Buhari, a former military ruler of Nigeria who was elected last month and takes over May 29, is a marked departure from President Goodluck Jonathan. After Jonathans administration initially denied there had even been a kidnapping, he made repeated hollow promises that the girls would be rescued. Campaigners have replaced the slogan of Bring Back Our Girls  Now and Alive! with a new one: Never to be forgotten. Still, some of the marchers Tuesday held the new leadership accountable. We are here to appeal to the government to do better. We want our girls now and alive, said Solamipe Onifade, 16. A vigil was held after sundown, with people holding candles and singing. The gunmen initially seized 276 girls, but several dozen managed to escape as the militants transported them to the Sambisa Forest, with some clinging to the branches of trees from a moving open-back truck. Those still missing may have been split up. Witnesses said some girls were taken across the border into Cameroon. Boko Harams leader, Abubakar Shekau, claimed they had converted to Islam and been married off to his fighters. A negotiator said that at least three died in the early days, from a snake bite, malaria and dysentery. Then, Jonathan refused to negotiate with Boko Haram, who were offering to exchange the girls for detained insurgents. The girls became the focus of a global campaign soon after their abduction. U.S. first lady Michelle Obama had said she was outraged and heartbroken about the kidnapping and also posted a picture of herself holding a sign reading #BringBackOurGirls on her official Twitter account in May 2014. At least 2,000 women and girls have been abducted by Boko Haram since 2014, forced to become sex slaves and fighters, Amnesty International said Tuesday. Unknown hundreds of boys and young men also have been kidnapped and forced to fight for Boko Haram. Those who refuse are killed. White House press secretary Josh Earnest said the U.S. has helped Nigerian security forces counter the threat by Boko Haram and also helped look for the kidnapped girls. Unfortunately, this kind of kidnapping story is one that is becoming all too familiar in Nigeria, Earnest said. We continue to be very concerned about that and we continue to be supportive of the efforts of Nigerians to counter the depraved tactics that are employed by Boko Haram, he said. Earnest added that the U.S. is engaged in a substantial number of operations to try to address the many needs of the Nigerian people, particularly as they try to counter the threat thats posed by Boko Haram. State Department spokeswoman Marie Harf said a team from U.S. government agencies was in Abuja to help both in the search, providing training, equipment, to try and help them find not just the girls, but all of those kidnapped by Boko Haram. A hopeful message addressed to the captives from Nobel Peace Prize laureate Malala Yousafzai promised scholarships for the girls and said they must never lose courage. The 17-year-old Pakistani activist who stood up to the Taliban chastised Jonathans administration and other countries. Nigerian leaders and the international community have not done enough to help you. They must do much more to help secure your release, she said. Malala said she and millions of people around the world stand in solidarity with the Chibok girls. We cannot imagine the full extent of the horrors you have endured. But please know this: we will never forget you. We will always stand with you. Today and every day, we call on the Nigerian authorities and the international community to do more to bring you home. In Chibok, dozens of family members and supporters marked the anniversary by gathering at the remains of the school, in front of a burned out and roofless classroom. Young girls held handwritten signs demanding Bring back our girls  Now and Alive. One mother, Mariam Abubakar, told the crowd she was in disbelief that the government had been unable to rescue the girls during a whole year. On Monday, a few dozen people marched in Abuja, their mouths shut by red tape. When your voice is taken from you, which is what the terrorists have done to our daughters, you cant speak, you dont exist. But our girls exist, said organizer Oby Ezekwesili, a former education minister. The Empire State Building in New York was lit up Tuesday night in the campaigns purple and red colors to symbolize its call for an end to violence against women and girls. When Boko Haram started using young women and girls as suicide bombers last year, many wondered whether some were the Chibok girls. More such speculation followed when the insurgents beheaded women they had forced into marriage as they fled a military offensive on the border town of Bama last month. Several of the girls parents have died  some killed in Boko Haram attacks, some of illnesses like high blood pressure that residents blame on the trauma related to their lost daughters. The Boko Haram attacks continue despite a multinational military offensive that has ousted the Islamic extremists from all major towns in northeastern Nigeria in recent weeks. Scores held captive by Boko Haram have been freed. But there has been no whisper of the girls. ", "Date": "20150414", "Title": "[A year after kidnap of schoolgirls in Nigeria, hope dwindles]", "Link": "http://www.seattletimes.com/nation-world/nigeria-president-elect-cant-promise-to-find-chibok-girls/", "Author": "[MICHELLE FAUL]"}