{"Content": "[Boeing laid out Tuesday its price for assuring that the forthcoming 777X jet is manufactured in Washington state: a  hardball contract offer for the Machinists and a demanding agenda for a special session of the Legislature. Machinists union members face a watershed vote next week on a   contract offer from Boeing. To ensure they will fabricate the 777Xs giant composite wings and assemble the airplane here, theyll have to hold their noses and sign off on the loss of long-cherished benefits. And in a weeklong special session in Olympia beginning Thursday, Gov. Jay Inslee has asked state legislators to pass a package of bills that include granting Boeing after 2024 estimated state tax savings of $8.7 billion. In a hastily arranged news conference on Election Day, Inslee said Boeing executives have guaranteed that if these two things happen, were going to get the largest aerospace expansion project of my lifetime. These jobs are ours, if we act now, Inslee said. Inslee was flanked by Boeing Commercial Airplanes chief Ray Conner and International Association of Machinists (IAM) District 751 President Tom Wroblewski, although neither spoke or took questions. Just hours earlier, the union leadership agreed to take to its members a bitter pill: a tough Boeing proposal    for anew eight-year contract with big cuts in future pension and health-care benefits. Union members will earn a $10,000 signing bonus if it passes, payable within a month. But the pension change would be a major loss for current employees: Traditional pension accruals would stop, to be replaced by an alternative company-funded retirement savings plan. Clearly the terms were difficult for the Machinists leaders to accept. Only a project as significant as the 777X and the jobs it will bring to this region warrants consideration of the terms contained in Boeings proposal, said Wroblewski in a union statement. While not all will agree with the proposals merits, we believe this is a debate and a decision that ultimately belongs to the members themselves. If passed, the deal ensures Boeing management a full decade of labor peace. Its eight-year span begins at the end of the current contract in 2016. The proposal represents a major poker play by the company to cut its long-term costs, using the future of airplane manufacturing in the Puget Sound area as the high stakes on the table. Securing the Boeing 777X for the Puget Sound means much more than job security for thousands of IAM members, said Wroblewski. It means decades of economic activity for the region. Boeings Conner, in a statement, said the union deal when ratified, will secure and extend thousands of high-wage, high-skilled aerospace jobs and expanded economic opportunity for residents of Puget Sound and Portland for many years to come. Inslee stressed the significance of Washingtons winning the advanced manufacturing facility where the 777Xs carbon fiber-reinforced plastic composite wing will be built, saying that will create a carbon fiber manufacturing industry for future airplanes. He called for swift passage of a raft of bills, including extension of Boeings tax incentives through 2040; a massive $10 billion 10-year transportation package; actions to streamline industrial permitting; education and training initiatives; and a compromise that will satisfy Boeing on the states pending water-quality rule. The 777X is a planned variant of todays 777 that will retain the same metal fuselage but utilize new engines and the new composite wings. The plane is expected to be launched at this months Dubai Air Show and to enter service around 2020. Almost 20,000 Boeing employees work directly or indirectly on the 777 program today. Inslee said that counting support and service jobs, some 56,000 people in the state depend on that jet. State officials said later that the 777X project will produce fiscal benefits to the state from now through 2040 of $17.8 billion. Sweeteners for union, To try to secure a yes vote by the IAMs 31,000 members here and 1,500 more in Portland, Boeing wrapped the bitter pill of its contract proposal in lots of sugar. The IAM deal includes substantial cash awards: not only the big ratification bonus but alsoa golden handshake buyout that would allow retirement with boosted pension terms of $95 per month per year of service for anyone over age 58. The take-aways include significantly higher health-care premiums and, crucially, the radically changed pension plan. The new pension plan would have the company contribute a fixed percentage of gross salary into a retirement savings account each year: 10 percent the first year, 8 percent the second; 6 percent the third, and 4 percent every year thereafter. The IAM is the last Boeing union with a traditional pension, and the company has sought unsuccessfully in multiple contract negotiations to move away from a defined-benefit pension plan to such a defined-contributions savings plan. The offer would also change the wage structure so that new hires would take 16years to reach the top of the pay scale instead of the 6years it takes today. One machinist summed up Boeings strategy this way: Offer the big signing bonus to entice younger members who perhaps arent thinking of staying their entire working lives with the company. And use the early-retirement package to swing the votes of those planning to retire in the next few years. For everyone else, this machinist said, the offer is a losing deal. However, another machinist said the agreement is the best available. He said that layoffs could continue next year as the 787 program sheds workers no longer needed to fix earlier production problems. He said the early-retirement buyout will stave off those layoffs as older workers take the offer. This is an incentive that will save younger people with families, he said. I think reality is, this thing will pass. A company source said that during secret negotiations over the past months, Boeing moved somewhat toward the union on the pension and health-care numbers. However, among the union rank and file there is a widespread conviction that Boeing presented its offer largely on a take-it-or-leave-it basis. One union official told members that if the offer is voted down, Boeing the next day will put the 777X work out to bid by other states. Boeing declined to comment on what happens if the vote fails. Sen. Patty Murray, who acted as a mediator between the IAM and Boeing over the past two months, offered an optimistic outlook. Im encouraged and hopeful that we are close to an agreement that will make the Puget Sound home to the 777X, Murray said. Everyones goal should be a mutually agreeable solution that will provide labor peace and help rev up our states economic engine for the foreseeable future. The union said it will provide IAM members full details of all contract changes in the proposal  when printing is completed and will communicate voting arrangements as soon as they are ready. Dominic Gates: 206-464-2963 or dgates@seattletimes.com]", "Date": "20131105", "Title": "[Boeing machinists face hard choices to secure 777X jobs]", "Link": "http://www.seattletimes.com/business/boeing-machinists-face-hard-choices-to-secure-777x-jobs/", "Author": "[Dominic Gates]"}