{"Content": "[OLYMPIA  To picture how political foes may seek to use Gov. Jay Inslees death-penalty moratorium against him, look back at   one of the last television ads of the 2012 state attorney generals race:, Horror music twinkles as a sepia-toned photo of Democrat Bob Ferguson appears alongside a Cop Killer, Ronald Turney Williams. A Snohomish County sheriffs deputy expresses outrage that Ferguson once wrote a legal brief for the death-row inmate. A boy in a green shirt swings on a playset before disappearing into the words Keep Our Families Safe: Defeat Bob Ferguson. The national Republican State Leadership Committee spent $2.9 million on the commercial and two similar ads aimed at defeating Ferguson and promoting fellow Metropolitan King County Councilmember Reagan Dunn. Dunn is still on the council. Ferguson is the attorney general. While no public pollster has recently taken the pulse of Washington state on the death penalty, several local scholars and strategists said Fergusons victory is among multiple pieces of evidence that   Inslees decision is unlikely to haunt him in the future. The insiders also cited the experiences of other governors, including Oregons, and noted that while capital punishment is still popular, its support is declining. Thirty-two states have the death penalty, but six have abolished it in the past six years, giving legitimacy to foes of a policy long seen as unquestionably popular. The analysts mostly did not suggest Inslee would benefit from the moratorium, just that it wouldnt hurt him. I dont think itll have huge ramifications in his bid for re-election down the road, said Matt Barreto, a prominent University of Washington professor who runs the Washington Poll. Its just not a mobilizing issue. Republicans disagreed, arguing the moratorium could become a liability for Inslee. They provided internal polling showing the death penalty is popular in Washington. A 2011 poll commissioned by Dunns campaign from Moore Information, for example, showed 63 percent of state residents supported the death penalty while only 25 percent opposed it. The poll of 400 registered voters had a margin of error of plus or minus 5 percentage points. Some conservative lawmakers vowed last week to fight the moratorium. Some prosecutors criticized it. Some newspapers, including The Columbian in Vancouver, editorialized against Inslees decision, although others praised it. The Seattle Times editorial board on Sunday called for abolishing capital punishment. I think the governors action has already proven to be politically foolish, said Susan Hutchison, chairwoman of the Washington State Republican Party. Its executive overreach, and that is proving to be very unpopular among Americans in regard to President Obama. This is the same thing. Whether Republicans run ads on the issue if Inslee seeks re-election will depend on the candidate that runs in 2016, Hutchison said. Inslee spokesman David Postman said political considerations did not factor into the governors decision, which was announced at a news conference last Tuesday and surprised many in the Capitol. Inslee, a Democrat, had previously supported the death penalty, although he hadnt recently talked about it, or had been asked. In announcing he would not allow anybody to be executed while hes in office, but not commuting any death sentences or proposing any legislation, Inslee said he was taking a relatively restrained step. Still, Postman said, there was a recognition that there would be some people who would be unhappy with this decision. Issue emerged , The attacks in the Ferguson-Dunn race marked the first time in recent years that the death penalty emerged as a major political issue in Washington state. That may be because of the scant number of executions here  just five since 1963. Nine men are currently on death row. Dunn supporters chose the issue because Ferguson had helped Williams two decades previously, when Ferguson was a second-year law student working under a grant from the Arizona Capital Representation Project. During the campaign, Ferguson said he opposed the death penalty but that as attorney general would defend the states right to impose capital punishment. Dunn emphasized last week that he did not work with the Republican State Leadership Committee, a Karl Rove-funded group. But he said the ads were effective. It moved the ball forward, Dunn said. And it closed our poll numbers. Dunn did tighten his deficit in public polls after the ads ran, closing within 2 percentage points in two October 2012 surveys after trailing by 8 and 13 in them the month before. But he ultimately lost by 7 points, 46.5 percent to 53.5 percent  one of the larger losing margins among the high-profile statewide races that year. That result speaks for itself, said Ferguson, although he declined to comment on how the death penalty might play in other races. Officials with both of the 2012 gubernatorial campaigns, for Inslee and Republican Rob McKenna, said they did not consider the death penalty as a campaign issue or conduct any extensive polling on it. Sterling Clifford, who served as Inslees communications director, said the campaign didnt even discuss it. McKenna campaign manager Randy Pepple said he was focused on other issues, primarily education. The death penalty was not seen as a big issue to a ton of people, he said. I dont think this will be a top-tier issue in 2016, Pepple added. Comparison , Over the past few days, Inslees decision has been compared to former Illinois Republican Gov. George Ryans nationally watched moratorium in 2000. Ryan did not seek re-election, but probably not because of his death-penalty stance. Several of his former employees were indicted while he was in office, and he eventually was convicted of corruption. A Chicago Tribune poll conducted during the scandal showed Ryan had an approval rating of just 32 percent. But two-thirds of those surveyed supported the moratorium. A more relevant comparison may be found closer: In late 2011, Oregon Gov. John Kitzhaber announced he would not allow any more executions while he was in office. Like Inslee, Kitzhaber called for a broad conversation. A state representative introduced a constitutional amendment to outlaw capital punishment. Then, said Salem Statesman Journal Editorial Page Editor Dick Hughes, nothing happened. The issue is just sitting there, he said, noting the amendment never got support in the Legislature. Kitzhaber is seeking re-election this year. But Hughes said the death penalty is a very minor issue. The much more major issue is that Cover Oregon, our health-care website, is a disaster, he said. Few governors have been hurt by suspending the death penalty, said Richard Dieter, executive director of anti-capital punishment Death Penalty Information Center. Dieter acknowledged an example of a politician being hit for being soft on crime  1988 Democratic Party presidential nominee Michael Dukakis, who lost to George H.W. Bush after facing an attack ad about William Willie Horton, who had raped a woman while on a furlough from jail. Dukakis had vetoed a bill to end the furloughs for first-degree murderers. But Dieter said others have gained support from opposing the death penalty, in part because voters respect a politician who takes a stand. People respect the position even if they disagree with it, Dieter said. Support falls , Nationwide, support for the death penalty has been falling since 1994, according to an annual poll by Gallup, Inc. Support was at 80 percent that year, according to the poll. Last year, it was at 60 percent  the lowest since 1972. Several local analysts said they didnt know of any local polling in Washington state. Stuart Elway, who runs the state Elway Poll, said he hasnt included the death penalty in his polls because it hasnt been a big issue. I think I will now, Elway said. Brian M. Rosenthal: 206-464-3195 or brosenthal@seattletimes.com. On Twitter @brianmrosenthal]", "Date": "20140216", "Title": "[Views split on fallout for Inslee from death-penalty moratorium]", "Link": "http://www.seattletimes.com/seattle-news/views-split-on-fallout-for-inslee-from-death-penalty-moratorium/", "Author": "[Brian M. Rosenthal]"}