{"Content": "[WASHINGTON (AP)  Democratic Arizona Rep. Ann Kirkpatrick said Tuesday she will challenge Republican John McCain for his Senate seat next year, launching an uphill bid to unseat the five-term senator in the GOP-leaning state. Kirkpatrick, 65, is serving her third House term in a district she has won narrowly. She was already being targeted by Republicans for what was expected to be her House re-election bid in 2016. Kirkpatricks decision to try to unseat McCain is seen by Republicans as an acknowledgment that her district is soon likely to be redrawn to make it more GOP friendly. The U.S. Supreme Court is considering a challenge to the constitutionality of Arizonas independent redistricting commission, a voter-enacted panel that took the redrawing of lines away from the Republican-controlled Legislature. Former Arizona House Speaker Andy Tobin, who has championed the lawsuit the high court is now considering, lost to Kirkpatrick by 5 percentage points in Novembers election. He said Tuesday that it is too early to say if hell try again to win the 1st District seat, especially since the Legislature is expected to radically redraw the states nine districts to create more GOP-controlled seats this summer if the Supreme Court strikes down the redistricting law. Its a hard call, but I dont think that I should be jumping the gun and throwing in my hat when the Legislature may have work to do  its premature, Tobin said. Tobin said he believes Kirkpatrick is motivated by the looming Supreme Court decision. Justices in early March heard the case brought by the GOP-controlled Arizona Legislature and seemed likely to overturn the states redistricting scheme. I think she sees the writing on the wall, Tobin said. Republicans running the state Legislature filed the lawsuit after complaining that the commission helped Democrats by packing large numbers of GOP voters into just a few districts. The states U.S. House delegation now has five Republicans and four Democrats, and GOP leaders say they expect at least a 7-2 split if the Legislature redraws the lines. McCain was his partys unsuccessful 2008 presidential candidate, losing to Barack Obama. A Navy flier who was held prisoner during the Vietnam War, McCain, 78, has long been one of his partys most influential voices on military and foreign policy issues and is chairman of the Senate Armed Services Committee. McCain announced his intention to seek re-election in April at a meeting of the Arizona Chamber of Commerce and Industry. With a full heart, I ask Arizonans again for their support as I seek re-election to the United States Senate, McCain told the supportive crowd. Im as determined as ever to deserve your trust and grateful as ever for the privilege. McCain, who was first elected to the Senate in 1986 and will be 80 when he seeks re-election next year, expects at least one GOP challenger. The state Republican Partys leaders, dominated by conservatives, censured McCain last year for not being sufficiently conservative, but hes brushed off the criticism. The most prominent Republican to hint of challenging McCain is state Sen. Kelli Ward, a conservative member of the Arizona Legislature. McCain will be a formidable opponent for any challenger. He already has more than $3.5 million in cash on hand and the ability to raise much more. Kirkpatrick has a tenth that amount in the bank. I respect John McCains service to our nation, Kirkpatrick said in a video her campaign released. I just believe our states changing. The former prosecutors video also emphasized her roots in the state, including pictures of boots she says she purchased with tips from waitressing. Im not naive, she says. I know that Washington insiders are already trying to dig up dirt. But having grown up here, a little mud on my boots is part of life. Andrea Bozek, spokeswoman for the National Republican Senatorial Committee, the Senate GOPs political arm, criticized Kirkpatrick for backing Obamas health care and other programs. Ann Kirkpatrick has been part of the problem in Washington and Arizonans are paying the price, Bozek said. ", "Date": "20150526", "Title": "[Arizona House Democrat to challenge McCain for Senate]", "Link": "http://www.seattletimes.com/nation-world/arizona-house-democrat-to-challenge-mccain-for-senate/", "Author": "[ALAN FRAM, BOB CHRISTIE]"}