{"Content": "[Know him or not, in 2014, Seattle venture capitalist Nick Hanauers politics are sure to be in your face  and headed for your ballot. As a renegade member of the 1 percent, Hanauer is trying to tilt the debate over what makes the economy tick, arguing against the conservative dogma that the wealthy are job creators. Or, as he likes to put it, Prosperity isnt something that squirts out of rich people. Its a result of policies that boost the wages of average workers, he says. Hanauer has become a leading advocate for spiking the federal minimum wage to $15 an hour. While thats unlikely to happen on a national level, Hanauer is part of a panel appointed by Seattle Mayor Ed Murray working up a $15-minimum-wage plan for the city. Its a crusade that drives some of his capitalist pals bonkers. Even the CEO of Hanauers family-owned pillow-making business argues a $15-an-hour minimum wage would destroy the company. As if that werent enough controversy, Hanauer also has jumped into the fight over gun control. Enraged by the massacre of schoolchildren at Sandy Hook Elementary in Connecticut in 2012, he helped bankroll a proposal to require background checks for all gun purchases in Washington. That measure is headed for the November ballot as Initiative 594. Hanauer, 54, has long been a behind-the-scenes player in Democratic political circles. He cofounded the League of Education Voters in 2001. He and his wife, Leslie, have given nearly $5million to state and federal political candidates and initiative campaigns since 2000, including $250,000 to a failed 2010 state income-tax initiative and $1million to 2012s successful charter-schools initiative. Thats in addition to checks doled out by the Nick and Leslie Hanauer Foundation, which donates hundreds of thousands of dollars a year to progressive think tanks and activist nonprofits. Hanauers public profile has grown in recent years. He is the co-author of two books and a frequent guest on cable-TV talk shows, and appeared in the documentary Inequality For All. While hes not the first local political donor to throw his weight around, in 2014 its hard to identify anyone whos more in the middle of the fray. Right now we are in the era of Nick Hanauer, said Chris Vance, former chairman of the state Republican Party. Success story and beyond, Hanauer made his name in the family pillow business before striking it rich as an early investor in Amazon. Now more interested in public policy than making money, he spends much of his time researching, writing and talking about income inequality. And his ideas have penetrated deep into Democratic politics. Look no further than President Obama, who has been talking since his 2012 re-election campaign about middle-out economic policies, based on the idea that prosperity flows from the middle class, not the wealthy. The term middle-out was coined by Hanauer and Eric Liu, a former speechwriter for President Clinton. Their two pamphlet-length books, The True Patriot and The Gardens of Democracy, aim to be a kind of manifesto for progressives about citizenship and the role of government. As a successful entrepreneur  not a billionaire, but well on his way  Hanauer makes a provocative messenger for the argument that the country would be better off taxing the rich to fund programs that favor the middle class and poor. Nicks influence comes from three tangible things: Hes a donor, hes also an activist, and hes cast against type, said David Rolf, president of union local SEIU Healthcare 775NW, a friend and close political ally of Hanauer in the $15-minimum-wage movement. Energetic, blunt and sometimes profane, Hanauer seems to take particular delight in ripping business moguls who resent paying higher taxes. This is my world, I know a lot of these folks, Hanauer said in an appearance on MSNBC last week. These are borderline sociopathic people, and they dont care about other people and they have no empathy. Hanauers sway extends to members of Congress, the White House and even presidential wannabes. Maryland Gov. Martin OMalley  a Democrat said to be considering a presidential run in 2016  has been passing out copies of Hanauers books to friends. I think the very fact that the minimum-wage debate is spreading, and so much of the language echoes Nicks insights and language  I think thats evidence of his impact, OMalley said. Hanauer interrupted one recent phone call with a reporter. I have to go. Sen. Hagan is walking into my office, he said. That was U.S. Sen. Kay Hagan, a North Carolina Democrat facing a tough re-election challenge, who paid a visit to Hanauer while in Seattle. She later left him a flattering voice message saying shed started his book and wanted to give him full credit for the middle-out economic debate. They come in thinking theyre raising money for their campaigns, and they walk out realizing theyve become one of my middle-out minions, Hanauer said. Going big for $15 wage, Hanauer has been obsessed with the $15-an-hour minimum wage since late 2012, when he emailed a Columbia University economist, calling it a go-big-or-go-home idea that could have more impact than 20 years of union bargaining. Hanauer honed his argument in an attention-grabbing op-ed for Bloomberg News last June, headlined , claiming a big jump in the federal minimum wage would stimulate the economy. He used his familys longtime pillow-making business, Pacific Coast Feather, as an example. The company has struggled, like many others, with sagging consumer demand. An economy such as ours that increasingly concentrates wealth in the top 1 percent  isnt a place to build much of a pillow business, or any other business for that matter, he wrote. Critics argue Hanauers prescription would be a disaster. A Forbes magazine columnist labeled his minimum-wage proposal near insane. The idea even horrifies the CEO of Hanauers family pillow business. If someone were to force me to move the base wage in our manufacturing organizations to $15 an hour, we will be out of business in six months. Period, said Joe Crawford, CEO of Seattle-based Pacific Coast Feather. The company pays an average of about $11 an hour, not including benefits, at its pillow-making plants in North Carolina, Illinois, Iowa and California, Crawford said. (The $15 minimum wage in Seattle would not be a factor, he said, because employees at the company headquarters already are paid more.), Crawford stressed he agrees with Hanauer that too many Americans are working hard without getting ahead. But he said a big boost in the minimum wage would have unintended consequences. Thats because Pacific Coast Feather competes with foreign manufacturers whose labor costs already are cheaper. American consumers are very interesting folks. They like to talk about Made in the USA until they have to pay a nickel more, Crawford said. Hanauer is used to those arguments. Joe hates my politics, he said cheerfully. Eye on the big picture, Critics of raising the minimum wage  even his own CEO  fail to see the big picture, Hanauer says. If all workers receive higher wages, theyll have more money to spend  and theyd spend some of it on pillows. A federal $15-an-hour minimum wage would lead to $450billion in additional consumer spending a year, he estimates. When pressed, Hanauer acknowledges that quickly raising the minimum wage that high could be problematic for some companies. Thats why the task force hes part of is considering phasing in the wage in Seattle and adding exemptions for small businesses. But for Hanauer, the details of how and where to raise the wage are not as important as the fact that hes helping change the conversation. What I am far more interested in is framing up the right set of questions, getting people to think about prosperity in the right way, he said. Do we want to live in a society where people work full time and still have to get government assistance and go on food stamps? Do we want to live in a society that is economically optimized for places like McDonalds and Wal-Mart? Hanauer said. Forcing higher wages might harm such companies, he said. But I would respectfully suggest that if you have a business model that cant survive without paying people poverty wages, maybe you should go out of business. Besides, Hanauer noted that taxpayers wind up subsidizing low-wage workers who qualify for food stamps and other government aid. Liu, Hanauers book co-author, said Hanauers style is to provoke by getting people out of their self-justifying or clichd ways of thinking. He likes to jolt that way. But some political opponents find Hanauers certitude less endearing. I regard him as one of the many misguided rich donors who want to make the state in their own image, said Randy Pepple, a Republican political consultant critical of the network of liberal nonprofits funded by Hanauer and other donors. Alan Gottlieb, a prominent Bellevue Second Amendment activist, said he reached out to Hanauer through an intermediary to see if hed discuss ways to make his background-check initiative more palatable to gun-rights advocates. Hanauer wasnt interested. I thought his response was a little arrogant, Gottlieb said. I dont think he has any interest in meeting with people who dont share his views. Gottlieb is running a competing gun measure on the November ballot. Initiative 591 would prohibit Washington state from adopting any gun background-check standards stricter than federal law. Hanauer said by the time Gottlieb reached out, initiative backers were on a fast track to file the measure. He added that since Gottlieb has spent his career pushing pro-gun laws, he  was not someone we considered seriously as a source for advice. Middle-class Bellevue kid, Born in New York, Hanauer grew up in a middle-class neighborhood in Bellevue. He got a philosophy degree from the University of Washington and says hes had the same political leanings for as long as he can remember. I come from generations of progressive, atheist Jews, he said. After years helping to grow Pacific Coast Feather, Hanauer struck it rich investing in startups. An early Seattle friend of Jeff Bezos, he became the first nonfamily investor in Amazon.com in 1995, betting all the cash he had at the time  $45,000  on the nascent Internet bookseller. When he sold his Amazon stock in 2000, it was worth more than $100million. Hanauer has subsequently founded or financed a series of successful startups, including aQuantive, a digital-advertising company that was bought by Microsoft in 2007 for $6.4billion. He now invests in companies ranging from banks to Internet developers and a biotech firm testing a cure for cancer. Success has left Hanauer confident of his business and political acumen. Im not the worlds best philosopher. But I am one of the worlds best strategists. I will put my strategic abilities against anybody on Earth, he said. His vast wealth gives him what he describes as an indefensible, unbelievably lavish lifestyle complete with private jet and five houses. His 7,000-square-foot Shoreline mansion alone is valued at more than $3million. But while capitalism has been good to Hanauer, he parts ways with free-market purists who believe unfettered markets always produce the best outcomes for society. For example, while Hanauer says hes incredibly proud of what Amazon has accomplished, its not an unalloyed good. Amazon didnt create any jobs. Amazon probably destroyed a million jobs in our economy, he said, pointing to reduced employment at brick-and-mortar stores displaced by the Internet giant. We have to find a way as a capitalist democracy to account for that, Hanauer said. Robert Nelsen, another prominent Seattle venture capitalist, likes to needle Hanauer about his politics. Before I met him I thought he was out of his mind, Nelsen said. He still disagrees with Hanauer on the minimum wage, for example, arguing that government creates more problems than it solves by mucking with the market. But Nelsen said he respects Hanauers constant questioning of the system. Even though I disagree with Nick on lots of things, I would say that having change agents is a valuable thing. And Nick is a change agent. Jim Brunner: 206-515-5628 or jbrunner@seattletimes.com. On Twitter @Jim_Brunner]", "Date": "20140215", "Title": "[Seattle 1-percenter a leader in push for $15 minimum wage]", "Link": "http://www.seattletimes.com/seattle-news/seattle-1-percenter-a-leader-in-push-for-15-minimum-wage/", "Author": "[Jim Brunner]"}