{"Content": "[    On the steps of the Insurance Building on the state Capitol campus,     Insurance Commissioner Mike Kreidler pauses to ponder        a question about his motivations. I love predictability, Kreidler     says  at first glance, an odd statement, from a man now at the center     of health insurances biggest upheaval in decades. With his moves     watched by policymakers, insurance regulators and companies        across the country, this affable 70-year-old politician has had     anything but a predictable life in the past few years.   ,     Consumer advocates say he may be        the most respected insurance regulator in the country, but     some state legislators tried to have his office abolished in the     last session.  Now, midway through his third term in his position,    Kreidler is taking full advantage of his independence  only 11     states elect insurance commissioners  to wade into some of the most     challenging issues of his long career.       , Earlier this year, he adopted    new rules    to address narrow        networks of doctors and hospitals included in health plans, spurring    vigorous protests from health providers, insurers and businesses. He     decided that many low-cost association coverage plans, favored by     small businesses in Washington, were illegal under the Affordable     Care Act (ACA). That drew    sharp criticism from the business community. And when Kreidler, a     lifelong Democrat, quickly    dismissed    President Obamas offer last year to let people temporarily keep their     discontinued health plans, many policyholders reacted in anger.  ,     To some, it seems unlikely that Kreidler, a doting     grandfather who eats the same lunch nearly every day  with a     generous dollop of Tabasco sauce         would find himself the target of so much animus. Observers say he is     usually slow to anger or to take a political joust personally. He is     a politician, not a wonk, but talks easily about risk pools and     underwriting, and admits to a certain pride when praised by an     actuary. Occasionally, he refers to himself in the third person, as     in:        No one is more identified with health reform at the state level     than Mike Kreidler.   , In the hot seat,     What he means is that hes become a target. In the past legislative     session, vexed by what she considered Kreidlers intransigence,     Republican State Sen. Randi Becker of Eatonville sponsored a bill to     replace his elected position with a board selected by legislative     caucuses. Becker said her bill, which failed, would have     made the office more accountable.    , John Conniff, a lawyer and former deputy insurance commissioner   who now represents businesses, says Kreidlers decisions are too     often rigid and ideological, and ignore        the real costs to people running small companies.       ,     In the latest storm,     the insurance offices chief administrative-law judge    accused    Kreidlers chief deputy of trying to pressure       her     to decide cases Kreidlers way  or lose her job. A leaked copy of the     judges complaint halted an ongoing high-profile case and, later,     she said she had accidentally  and improperly  sent it to a lawyer in the case.       ,     Kreidlers decision to    suspend    the judge  but not his chief deputy  brought criticism from        friends and foes, despite his vow to hold        an independent investigation of her    allegations.    , Mike Padden, a Spokane Valley Republican and former district-court     judge, said the allegations suggest really improper conduct may have occurred.      He has scheduled a    legislative   work session focusing on the independence of administrative-law     judges and may propose legislation, he said last week.     Kreidler appears sanguine. All painful episodes seem like the     worst ever when they happen,        he said, but they blow over. Ill probably be proven wrong, but I     think its kind of a sideshow right now, he said.    ,     Kreidler said hes focused instead on the big picture, where the     issues are crucial: long-term market stability, the ability of     consumers to get the care they pay for, and preserving the offices     role as a guide  and rule maker  through the        ACA. I have good reasons why Im doing what Im doing, he said. In the     end, I think we will have a better system as a result of my being     strong.   , Path to his dream job,     Myron Bradford Mike Kreidler, son of two Tacoma-area teachers and     grandson of the former dean of women at Pacific Lutheran University,     was born in 1943, a fraternal twin who beat brother Peter by 13     minutes. His sense of leadership was bolstered by his parents     decision to hold the boys back a year; their birthday was just on     the dividing line for entering school. It was a great decision,     said Peter Kreidler. We were more mature in terms of athletics,     self confidence, our ability to talk to other people. They wore the     same clothes all the way through Curtis High School in Tacoma, where     Mike was elected student-body president. A high-school civics-class     debate ignited a driving interest in health reform.  While in college in Oregon, Kreidler married Lela Lopez, of        Forest Grove, Ore. and received        a doctorate in optometry. After       two years active duty with the Army Reserve, he received a masters     in public health.   ,     In 1972, he began two decades as an optometrist     with Group Health Cooperative. But he couldnt resist the lure of     political opportunity when it came knocking  literally. At his door     was a        Democratic Party worker, ginning up turnout for a precinct meeting.     He asked Mike if hed serve as precinct chairman. That got him     going, Peter Kreidler recalled. Soon, still working as an optometrist,     Kreidler won        a seat on the North Thurston School Board in 1973. After that, his political career included the state Legislature for 16 years, Congress for a single term and stints in regional and federal agencies. Much of that time he continued to practice optometry on a flexible schedule.  At home, tragedy struck when a baby boy born with a severe birth defect lived only three months. A year later, the Kreidlers adopted a son, now their middle child. In 2000, Kreidler was elected insurance commissioner  the job of his dreams. He succeeded Deborah Senn, inheriting an individual health-insurance market in disarray.  For the next decade, Kreidlers favorite watchwords were consistency, stability, fairness and, yes, predictability. He regained accreditation for the office and successfully pushed for consumer legislation. Health insurance, always a small part of what the office handled, wasnt often big news, and disputes were mostly about humdrum matters, Kreidler said. Rep. Eileen Cody, a West Seattle Democrat who chairs the House Healthcare & Wellness Committee, said Kreidler has been good for both consumers and insurers. He has a reputation for being fair, Cody said. The insurance industry has not bitched to me about him like they did about Deborah [Senn]. Office overwhelmed, The advent of the ACA suddenly nudged   Kreidler into the spotlight. Insurers pushed for narrow networks, consumers pushed for more access, and every type of provider pushed to be included, noted Cody.  All the little pigs come to the trough, she quipped. Hes in somewhat of a horrible position. Last year, by all accounts, started badly. A dust-up over a gift resulted in the exodus of two employees in Kreidlers office, including his chief deputy, Mike Watson. Kreidler said the dispute arose when Kreidler argued that ethics rules allowed him to keep a potted plant sent by a trade association.  Watson, a friend and campaign manager for four decades, wouldnt talk about the details. I will tell you, I said for many years that I was one bad day away from retiring. I had a bad day, and I retired, he said. They remain friends, both said, and Watson still serves as Kreidlers campaign treasurer. Meanwhile, other employees, including most of his deputies, began peeling away from the agency for different, individual reasons. In April of last year, Kreidler had extensive open-heart surgery, just as the crazy first year of the ACA hit. Suddenly, it was a new, more intensely competitive game. His office, which reviews insurance plans, was prepared for insurers trying to skirt the law banning discrimination on health conditions  for example, by excluding certain drugs from coverage. But it wasnt prepared to see such narrow provider networks, he said. We were truly overwhelmed, Kreidler said. Soon, it became clear that the informal desk-drawer rules his office had used in the past wouldnt stand up; it needed formal rules. Much of what we had been doing was really bluster, Kreidler said. We didnt really have that kind of authority. An episode that caused a rift began last year, when Kreidler refused to approve several plans aimed for sale under the Washington Healthplanfinder insurance marketplace. The board of the Washington Health Benefit Exchange, which operates Healthplanfinder, sent the issue back, saying, essentially, make it work. He needed new, formal rules to protect consumers in the new world, Kreidler said, and he had the authority to do just that. Seeking transparency,  Kreidler says he doesnt expect the next few years to ease up. Soon, hell begin revising the network rules for 2016 plans. He grows animated about his plan to create transparency to let purchasers see whether a plan includes the drugs or doctors they need. What critics characterize as Kreidlers unwillingness to compromise, others see as strength of conviction. Hes very intense, says his wife Lela. When he gets onto something, it really means a lot to him to see things through. Other insurance regulators are watching closely as Kreidler walks the tightrope, says Sally McCarty, a former Indiana insurance commissioner, now with Georgetown Universitys Center on Health Insurance Reforms. Theyre all looking at what Washington is doing, she says, and particularly at Kreidlers effort to update network-adequacy standards, because Washington is first out of the gate. Kreidler is eager to take it on. I cant imagine anything better than being at the center of health reform. This is something this country has desperately needed for 100 years, he says. It couldnt be a better job. Carol M. Ostrom: 206-464-2249 or costrom@seattletimes.com. On      Twitter @costrom]", "Date": "20140608", "Title": "[Longtime leader Mike Kreidler plunges into political storms]", "Link": "http://www.seattletimes.com/seattle-news/longtime-leader-mike-kreidler-plunges-into-political-storms/", "Author": "[Carol M. Ostrom]"}