{"Content": "[WASHINGTON  Supreme Court Justice Ruth Bader Ginsburg had a heart stent implanted Wednesday, reviving talk about how long the 81-year-old liberal jurist will be staying on the court. She was expected back at work Monday, but her hospitalization  three weeks after elections handed Republicans control of the Senate  raised anew the question of whether President Obama would be able to appoint a like-minded replacement. The situation sends many, particularly on the left of the political spectrum, into a tizzy, said Jonathan Turley, a professor at George Washington University Law School. Ginsburgs procedure came after a blockage was discovered in her right coronary artery, said court spokeswoman Kathy Arberg. The justice was taken to the hospital by ambulance at about 10 p.m. Tuesday after she experienced discomfort during routine exercise at the court with her personal trainer, Arberg said. The justice was expected to leave the hospital within 48 hours. Ginsburg, who leads the courts liberal wing, has for years been fending off questions about whether she should retire and give a Democratic president a chance to name her successor. She underwent operations for colorectal cancer in 1999 and for pancreatic cancer in 2009, was hospitalized after a bad reaction to medicine in 2009 and suffered broken ribs in a fall two years ago. But the courts oldest justice has not missed any time on the job since President Clinton appointed her in 1993. For several years, liberal academics have been calling on Ginsburg and, to a lesser extent, Justice Stephen Breyer, 76, to step down to ensure that Obama could nominate a younger justice with similar views. Lawyers who are close to the Obama administration have made the same argument, but more quietly. In one sense, its already too late for that, since the Senate will be in Republican hands come January, making confirmation more difficult. Turley said that while some liberals had been urging Ginsburg to leave before the GOPs midterm election gains: I doubt seriously that anyone would want to face a vacancy in this political environment, certainly not those on the left of the political spectrum. Still, the picture would look worse for the Democrats if a Republican should win the presidential election in 2016. A retirement then by a liberal justice would allow the appointment of a more conservative justice and potentially flip the outcome in important 5-4 decisions in death-penalty, abortion-rights and gay-rights cases in which the liberal side sometimes prevails. The decision to leave the pinnacle of the legal world never is easy, even for justices with health problems. Chief Justice William Rehnquist remained even as he was treated for thyroid cancer. He died in September 2005, still chief justice. Rehnquists death allowed President George W. Bush to nominate another conservative, John Roberts, the current chief justice. The Roberts court has five justices appointed by Republican presidents and four appointed by Democrats. Ginsburg has repeatedly rebuffed suggestions that its time to step down. She remains one of the courts fastest writers, and she has continued to make frequent public appearances. So who do you think could be nominated now that would get through the Senate that you would rather see on the court than me? she said in an Associated Press interview in July. And as for the next presidential election, she has said on more than one occasion: I am hopeful about 2016. In 2005, Supreme Court Justice Anthony Kennedy, 78, said nothing publicly when he had a stent inserted to keep an artery open after experiencing mild chest pain. The court revealed the procedure when he returned to the hospital to have the stent replaced ten months later. Stents are mesh scaffoldings inserted into about 500,000 people in the United States each year to prop open arteries clogged by years of cholesterol buildup. Doctors guide a narrow tube through a blood vessel in the groin or an arm, inflate a tiny balloon to flatten the blockage, and then push the stent into place.]", "Date": "20141126", "Title": "[Supreme Court Justice Ginsburg gets heart stent at 81]", "Link": "http://www.seattletimes.com/nation-world/supreme-court-justice-ginsburg-gets-heart-stent-at-81/", "Author": "[SAM HANANEL, MARK SHERMAN]"}