{"Content": "[Richard Rorty, one of Americas most influential philosophers, wrote only occasionally about politics. He once wrote, National pride is to countries what self-respect is to individuals: a necessary condition for self-improvement. Donald Trump is busy proving that our national pride is on the verge of turning into a national lampoon. In my last column, I argued that a credible third party or independent presidential campaign is an obvious and excellent way to spur some civic pride and stem the governments bleeding legitimacy. It is, after all, how most democracies break partisan ruts. So why now  and how?, First off, the conditions are ripe. The American economy right now worships disruption. Cable TV disrupted the networks; the Internet disrupted everything; Uber disrupted taxis; Airbnb disrupted hotels. If such transformations  such improvements  are possible in business, why not in politics? Democrats and Republicans are the last, best monopolists. The political market wants it. In September 2014, Gallup asked Americans, In your view, do the Republican and Democratic parties do an adequate job of representing the American people, or do they do such a poor job that a third party is needed? A clear majority, 58 percent, wanted a third party. Thats been true since 2006. Also, there is no incumbent in 2016. There have never been more independent voters. The parties favorability ratings have never been worse. Trust in government is at an all-time low. But what really makes a political disruption possible this year is money. The Supreme Court has fully deregulated the politics market. Presidential campaigns can raise capital easier than Silicon Valley tech darlings. A credible startup campaign could snag a $500 million initial political offering no sweat, given the right business model. That might be gross, but its true. The business model also would have to be new  entrepreneurial. The classic model of a political party is that a movement forms and eventually picks a leader democratically. That wont work now because the two-party duopoly has made the barriers to entry too high. Success requires money and organization to get on all the state ballots. It also requires that a candidate have poll numbers of 15 percent or higher in September 2016 to qualify for the presidential debates, which means the candidate has to be well known and well sold. All that means that a 2016 disruption needs to be top-down. It will need to ride on a wave of disgust with the status quo instead of on a field of grass roots. (Donald Trumps political vandalism doesnt count.) The good news is that this might attract candidates who would never run in the current perverted process. Heres a scenario:, An insurgent cadre, call it the Declaration of Independence Alliance, forms what is essentially a venture-political-capital firm, staking upfront the money necessary to run a competitive general election campaign, say $500 million minimum. The Koch brothers have proved that a national organization easily as competent as the parties can be built from scratch. The alliance has to bring non-contributors into its leadership and it has to be truly transparent about money and process. The war cry has to be political reform, fixing a corrupted system and breaking partisan gridlock. That means proposals such as constitutional amendments to allow campaign-finance regulation; creating four-year terms in the House; mandating shorter political campaigns (like every other democracy); changing ballot access laws; reforming the tax code. The alliance has to recruit a CEO  a presidential candidate. It could be done partly in a smoke-filled room, partly through e-voting  direct democracy. On July 4, 2016, the alliance announces its ticket for president, vice president and as many Senate seats as possible  in case they win the White House. Potential candidates? There are true disrupters: Michael Bloomberg, Sheryl Sandberg of Facebook, Howard Schultz of Starbucks or Eric Schmidt of Google. There are radical centrists and party orphans: Maine Sen. Angus King, former Virginia Sen. Jim Webb (flirting now with a Democratic campaign) and former Govs. Jon Huntsman of Utah, Mitch Daniels of Indiana and Brian Schweitzer of Montana. They all have been mentioned. I know. Theres no slam-dunk name. There isnt going to be a slam-dunk name in this era. There isnt going to be a political hero. Sorry. The long and even less inspiring list of candidates from the two big parties confirms that. So a Schultz-Schweitzer ticket? Bloomberg-King? Schmidt-Sandberg? Who knows?, Maybe none of them is far enough from the mainstream to find a new current. Maybe none of them can run without sounding like just another pol. Maybe the top-down model is too compromised. And maybe the whole centrist-reform third way thing is too wimpy. But as unrealistic as my plot seems, it is more unrealistic to expect more than were getting from the current duopoly. A world of only two teams is not destined. Disruption happens. These days, it happens a lot. Sometimes it helps.]", "Date": "20150815", "Title": "[Its the age of disruption, and politics should not be left out]", "Link": "http://www.seattletimes.com/opinion/its-the-age-of-disruption-and-politics-should-not-be-left-out/", "Author": "[Dick Meyer]"}