{"Content": "[House Republicans want Congress to address the troubled finances of Social Securitys disability program, setting the stage for a contentious debate that could affect 11 million people in the middle of the next presidential campaign. The House has adopted a procedural rule that could force lawmakers to tackle the issue by the end of 2016, when the program is projected to run out of reserves, triggering automatic benefit cuts. An easy fix was available. Congress could have redirected payroll tax revenue from Social Securitys much larger retirement program, as lawmakers have done before. But Tuesdays procedural rule blocks such a move, unless as part of a larger plan to improve Social Securitys finances, by either cutting benefits or raising taxes. The rule only applies to the House. Tinkering with Social Security never has been easy, and factoring in election-year politics makes finding votes even harder for those alternatives. Rep. Tom Reed, R-N.Y. said he sponsored the provision to prevent Congress from raiding the retirement fund to prop up the disability program. Reed said lawmakers are working on proposals to bolster the disability programs finances, but that taking tax money from the retirement program is a short-term Band-Aid. We need to do better than that, Reed said. Added the chairman of the House Ways and Means Committee, Rep. Paul Ryan, R-Wis.: We just want to make sure we improve the integrity of the Social Security trust fund all across the board. Advocates for older Americans say the rule could be used to help push through benefit cuts, especially because House Republicans have opposed raising taxes. This is a blatant attempt on the first day members take office to sneak a rule into the process that virtually guarantees devastating cuts for beneficiaries of the Social Security disability system, said J. David Cox, president of the American Federation of Government Employees. David Certner of AARP said it would be a mistake to eliminate the option of redirecting money from the retirement fund. Otherwise, we could be facing a deadline, and certainly over the last couple of years, weve seen Congress seemingly unable to pass bills, even with deadlines in front of them, Certner said. New House rules will govern the chamber for the next two years. The 36-page set of rules passed by a vote of 234-172, with all Democrats opposed and almost every Republican in favor. On page 32 is a provision that allows any representative to raise a point of order if the House tries to pass a bill redirecting tax revenue from Social Securitys retirement fund to the disability fund. The House could vote to overcome the objection, but that could be difficult, with almost every Republican supporting the rules package. The number of workers, spouses and children receiving Social Security disability benefits has ballooned over the past decade. Members of Congress from both political parties say fraud has played a part, too. About 11 million people get disability benefits, nearly 40 percent more than a decade ago. By comparison, about 48 million people get Social Security retirement or survivor benefits. Unless Congress acts, the trust fund that supports the disability program will run dry sometime during the last three months of 2016, according to projections by the trustees who oversee Social Security. At that point, the program will collect only enough payroll taxes to pay 81 percent of benefits. That would trigger an automatic 19 percent cut in benefit payments. The average monthly payment for a disabled worker is $1,146, or a little less than $14,000 a year. Social Security is supported by a 12.4 percent tax on wages up to $118,500. Half is paid by workers and half by employers. Most of the payroll tax  10.6 percent of wages  goes to the retirement fund. The remaining 1.8 percent of wages goes to the disability fund. Social Securitys retirement trust fund is projected to run dry in 2034. At that point, it would only collect enough payroll taxes to pay about 75 percent of benefits. Social Security has more than $2.7 trillion in reserves, but the retirement program has been paying out more in benefits than it collects in payroll taxes since 2010. The disability program has been paying out more than it collects since 2005. If the retirement fund and the disability fund were combined, they would have enough money to pay full benefits until 2033, giving lawmakers more time to address their long-term finances. ", "Date": "20150108", "Title": "[House GOP forcing 2016 debate on Social Securitys finances]", "Link": "http://www.seattletimes.com/nation-world/house-gop-forcing-2016-debate-on-social-securitys-finances/", "Author": "[STEPHEN OHLEMACHER]"}