{"Content": "[MIAMI (AP)  Republican presidential hopeful Marco Rubios slow-go campaign strategy is puzzling party operatives in Iowa and New Hampshire, states where voters are used to candidates showering them with attention early and often. While some GOP hopefuls are already highlighting their progress toward visiting all of Iowas 99 counties, Rubios return to the state this week marks his first stop in the caucus battleground in a month. The Florida senator hasnt traveled to New Hampshire, home to the first-in-the-nation primary, since July 4, though he is expected to return before the end of August. Youve had some of the others who have worked it a lot harder, said Richard Schwarm, a former Iowa GOP chairman who is uncommitted in the 2016 race. I dont think its too late. But I think he should step up the appearances here because we are wide open. Fergus Cullen, a former New Hampshire GOP chairman who has yet to back a candidate, said that while Rubio benefits from goodwill and interest, his infrequent appearances in the state have cost him early endorsements. He would have more if he spent more time here, Cullen said. Rubio has visited New Hampshire just three times since announcing his campaign in early April. His stop in Iowa this week marks his fifth trip to the caucus state as a candidate. The senators advisers say they see little reason to worry about early state grumbling at this juncture in the campaign. Even after a burst of momentum following his campaign launch and a strong performance in the first GOP debate, Rubios team has said it doesnt expect the young senator to surge until fall or even winter, when voters start paying more attention to the White House race. On Tuesday, Rubio told reporters his Senate duties and fundraising absorb chunks of his time. But he also suggested it was too early for voters to worry, saying he would be in Iowa often, especially as we get closer to the caucuses. When this election becomes about what it should become about, and that is whats next for America  I feel very confident about our message, Rubio said after speaking to more than 100 people at the Iowa State Fairs political soapbox, a common stop for White House candidates in the early voting state. But even Rubios return to Iowa was literally dampened by off-and-on downpours, and the umbrella-covered crowd who attended his appearance at the fair was far smaller than those that gathered a day earlier for former Wisconsin Gov. Scott Walker. Early polling shows Rubio has lost ground this summer while billionaire businessman-turned-presidential candidate Donald Trump has surged, in part by tapping into the publics anger with Washington. Like some of his rivals, Rubio has spent much of the summer rounding up enough campaign cash to stay competitive in a lengthy primary. Rubios campaign and outside groups supporting him raised a combined $45 million through the second quarter, a strong number but well below the massive haul from former Florida Gov. Jeb Bush, who brought in more than $100 million. We dont expect to have the most money, but we will be competing in all 50 states, said Alex Conant, the campaigns spokesman. Rubio, a first-term senator, has also eschewed the campaign trail at times for hearings and votes on Capitol Hill, where hes taken heat for being absent since launching his White House run in April. He returned to Washington the day after his campaign launch for a vote on giving Congress a say on President Barack Obamas Iran deal. He also skipped an in-person appearance at a New Hampshire candidate forum earlier this month to vote on legislation to defund Planned Parenthood. He participated in the forum via video instead. Rubio, a 44-year-old son of Cuban immigrants, is seen by some Republicans as a bright hope for a party desperate to attract younger, more diverse voters. His optimistic, future-focused campaign message already has some Democrats worried that he would be a formidable general election opponent for front-runner Hillary Rodham Clinton. I think hes a rising star in the Republican Party, Iowa Gov. Terry Branstad said. I think it would be worth his time to spend a significant amount of time in the state of Iowa. Some of Rubios rivals have devoted more time to the early voting states this summer. Bush, who is counting on a strong performance in New Hampshire to propel his White House hopes, has made six trips to the state since announcing his campaign in mid-June. Ohio Gov. John Kasich has only officially been in the race for a month, but he has already matched Rubios travel to New Hampshire. Rubio was returning to Iowa this week for an appearance at the state fair Tuesday and the opening of his campaign headquarters in Des Moines on Wednesday. Conant said Rubio would also make stops in New Hampshire, as well as South Carolina and Nevada, by the end of the month. ", "Date": "20150818", "Title": "[Rubios slow start in Iowa, New Hampshire puzzles GOP]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/rubios-slow-start-in-iowa-new-hampshire-puzzles-gop/", "Author": "[JULIE PACE, SERGIO BUSTOS]"}