{"Content": "[A rift over national security is developing in the early stages of the Republican Partys next presidential campaign, pitting libertarians who question government overreach against defenders of a more hawkish approach on national security formed after the 2001 terrorist attacks. During a forum Thursday night in Aspen, Colo. New Jersey Gov. Chris Christie pointed to a strain of libertarianism coursing through both parties as a very dangerous thought more than a decade after the Sept. 11 attacks. Christie was asked whether he was referring to Kentucky Sen. Rand Paul, a potential presidential candidate who has been at the forefront of the partys libertarian wing. You can name any number of people and hes one of them, said Christie, noting his state suffered the second-most casualties in the hijacked airliner attacks on New York and Washington, which killed nearly 3,000 people. These esoteric, intellectual debates  I want them to come to New Jersey and sit across from the widows and the orphans and have that conversation. And they wont, because thats a much tougher conversation to have. Paul responded Friday on Twitter, saying Christie worries about the dangers of freedom. I worry about the danger of losing that freedom. Spying without warrants is unconstitutional. For Republicans, the national security debate offers a window into an evolving party that nearly a decade ago re-elected President George W. Bush, in part, on the basis of his administrations hard-line response to the terror attacks and use of tools provided by the USA Patriot Act, which gave the administration the powers to search records and conduct roving wiretaps in pursuit of terrorists. It also serves notice that whoever hopes to claim the GOP nomination in 2016 may need to fuse factions within the party on national security. The exchange followed a fight this week in Congress over the National Security Agencys collection of hundreds of millions of U.S. phone records, where libertarian-leaning conservatives and liberal Democrats sought to undo the NSA program that they contend is an affront to civil liberties. The House narrowly defeated the attempt to restrict the surveillance, with some Republicans questioning whether their adversaries had forgotten the lessons of 2001. The House vote came in the weeks after former NSA systems analyst Edward Snowden leaked classified documents that exposed the governments secret surveillance activities. And it followed Pauls nearly 13-hour filibuster in March over President Barack Obamas pick to lead the CIA, a fight that focused attention on the presidents use of aerial drones to kill suspected terrorists and concerns the unmanned aircraft could be used in the United States to target suspects who are American citizens. Doug Stafford, a top adviser to Paul, said in a statement that if Christie believes the constitutional rights and the privacy of all Americans is `esoteric, he either needs a new dictionary, or he needs to talk to more Americans, because a great number of them are concerned about the dramatic overreach of our government in recent years. Republicans have said the libertarian strain within their party has been galvanized by what they call a large, more intrusive government under Obama, pointing to the health care overhaul, probes by the IRS into political groups and the Snowden affair. Yet the internal debate in the months after Obamas re-election underscores a party figuring out a new approach to foreign policy as long wars in Iraq and Afghanistan come to a close and many Americans express hesitation about future foreign entanglements. Republican consultants based in early presidential voting states said there is an undeniable growing wave of libertarianism within the GOP that has already begun to reshape the political debate as candidates begin to jockey for position three years before the next presidential contest. South Carolina-based Republican operative Hogan Gidley said there are risks  both for candidates like Christie who criticize the libertarian movement and for candidates like Paul who embrace it. You cant ignore the libertarian movement. And if you do, you do it at your own peril, said Gidley, a senior aide on Rick Santorums 2012 presidential campaign. But he said some libertarian policies  particularly those that would aggressively scale back spending on defense and foreign policy  could scare away voters, as was the case of former presidential candidate Ron Paul, the senators father, who placed fourth in South Carolinas last presidential primary. Yet Rand Pauls libertarian approach remains popular among influential Republican activists. Former New Hampshire GOP chairman Jack Kimball, who is active in the partys `liberty movement, said Christie went overboard on this. Hes got to tone this down. A lot of people in this country are upset with the breadth and scope of what the NSA is doing. Christie, who is running for re-election this year and considered a formidable potential 2016 candidate, made his comments at an event sponsored by the Aspen Institute that also featured Republican governors Bobby Jindal of Louisiana, Scott Walker of Wisconsin and Mike Pence of Indiana, all of whom have been discussed as potential White House aspirants. Asked whether the party had become more libertarian, Jindal said it was a good thing and in part, a reaction to Obamas policies. Youve got a lot of voters  who are saying, `Im tired of the government telling me how to live my life. Walker spoke of the need to make fewer Americans dependent upon government services like unemployment benefits and Medicaid. But Christie, who was appointed by Bush as U.S. attorney in New Jersey one day before the 2001 attacks, warned that the public would not look kindly upon lawmakers who seek to undercut national security efforts if another terror attack struck American soil. The next attack that comes, that kills thousands of Americans as a result, people are going to be looking back on the people who were having this intellectual debate and wondering whether they knew that their first job was to defend the homeland, he said. How Republicans deal with the debate could shape the partys future after losing the popular vote in five of the past six presidential elections. Its a mistake to try to drive anybody out when youre losing, said Sal Russo, chief strategist for the Tea Party Express. I think you need to tolerate those different viewpoints. Peoples reported from Boston. Follow Ken Thomas on Twitter: http://twitter.com/AP-Ken-Thomas, Follow Steve Peoples on Twitter: http://twitter.com/sppeoples]", "Date": "20130729", "Title": "[Christie, Paul highlight GOP debate over security]", "Link": "http://www.seattletimes.com/seattle-news/politics/christie-paul-highlight-gop-debate-over-security/", "Author": "[KEN THOMAS, STEVE PEOPLES]"}