{"Content": "[ITS time for presidential candidates to pivot to Asia. So far the endless quagmire in the Middle East has dominated candidates discussion and debate of foreign affairs. Thats important and America has an obligation to show leadership in the troubled region. Its also instructive to learn which candidates are likely to repeat our terrible mistakes and ignore lessons we should have learned about the futility of military solutions to problems in a place defined by ancient religious rivalries. But voters need to know where candidates stand on other overseas challenges the country will face in 2016 and beyond. China now tops that list. Maintaining positive relations with this restless frenemy will have a much greater bearing on Americas economic security and long-term prosperity. The ascendant superpower is undergoing a transition. Its enjoying new levels of wealth and global influence. Yet its leaders are struggling to maintain the countrys remarkable economic growth  growth that has also maintained internal stability. With Chinas rise has come disconcerting nationalism. China is aggressively challenging borders in the Pacific, rattling U.S. allies in the region and testing boundaries drawn after World World II. The U.S. response  including concerns expressed in May by U.S. Defense Secretary Ashton Carter  has been outwardly dismissed by Chinese authorities and has stoked anti-Western sentiment in the country. Chinas move this month to devalue its currency is also troubling. Rising wages were opening the door for the United States and other countries to expand manufacturing and compete. But that door will be slammed shut if China further manipulates its currency to maintain its cost advantage. That follows Chinas moves to dissuade use of American technology products and turn to domestic suppliers, purportedly because of security concerns. These moves affect the scarcity of jobs in America and the middle class sense of falling behind, which remain top concerns of voters. Yet instead of discussing how to win manufacturing back from China, increase trade and create jobs, politicians rail on about the boogeyman of illegal immigration  the rate of which has leveled off. Candidates should also stop threatening to start another terrible, misguided war in the Persian Gulf. Instead, tell voters how America can respond to Chinas apparent intrusion into government computers and personnel files. Not to mention new revelations that Chinese security services are secretly operating on U.S. soil and harassing expatriates. Perhaps candidates would focus more on Asia-Pacific issues if Washington, Oregon and California would get their act together with presidential primaries. All three states hold their primaries late, long after the March runoffs elsewhere in the country. The timing diminishes the influence these trade-oriented states have on campaigns. Even so, the growing importance of China to the entire country demands that presidential candidates discuss the Middle Kingdom as well as the Middle East.]", "Date": "20150817", "Title": "[Why presidential candidates need to pay attention to China]", "Link": "http://www.seattletimes.com/opinion/editorials/its-time-for-presidential-candidates-to-pay-attention-to-asia/", "Author": "[Seattle Times editorial board]"}