{"Content": "[WASHINGTON (AP)  President Barack Obama is the man in the middle, caught between the White House aspirations of two of his closest advisers: Vice President Joe Biden and former Secretary of State Hillary Rodham Clinton. For months, White House officials expected Clinton to be the Democratic nominee in the 2016 election. Some of Obamas top political advisers moved to New York to run her campaign and Obama appeared to give his tacit approval, saying she would be an excellent president. But that bet on Clinton suddenly looks less certain. With Biden weighing his own presidential run more seriously amid signs of weakness in Clintons campaign, the White House faces the prospect of a family feud over who will become heir to Obamas legacy. Certainly hes got something at stake here, White House spokesman Josh Earnest said Monday of Obamas interest in the 2016 election. Bidens recent overtures to donors and Democratic officials have led to palpable awkwardness in the West Wing as aides  many with close ties to Clinton, the vice president or both  try to maintain impartiality. Earnest raised the prospect that Obama could endorse a candidate in the Democratic primary, though others close to the president say its unlikely hed publicly put his thumb on the scale if Clinton and Biden were locked in a close contest. In picking between Biden and Clinton, Obama would be making a choice between two of the most influential members of his administration. Obama and Clinton long ago turned their political rivalry from the 2008 primary into an alliance. Clinton left the administration in early 2013 after four years as Obamas secretary of state, but she and the president still get together for occasional meetings. They both attended a birthday party in Marthas Vineyard last week for Democratic powerbroker Vernon Jordan, and Obama played golf on the tony Massachusetts island with former President Bill Clinton. However, some White House officials were irked by revelations that Clinton sidestepped administration guidelines by using a private email account on her own computer server to do State Department business. Privately, some Obama allies also say theyre miffed at Clintons handling of the email controversy, which continues to dog her campaign. Meanwhile, Obama and Biden appear to have developed a genuine friendship during their six-and-a-half years in the White House. When Bidens son, Beau, died of brain cancer earlier this year, Obama delivered a moving eulogy in which he referred to the vice president as a brother. In the weeks after the younger Bidens death, Obama made sure the vice president was by his side for high-profile administration announcements. Earnest said Obama viewed his selection of Biden as a running mate as the smartest decision of his political career. I think that should give you some sense of the presidents view of Vice President Bidens aptitude for the top job, Earnest said. On Monday, Obama and Biden met for their weekly lunch in the presidents private dining room. Both men spent much of August on family vacations and their lunch marked their first in-person meeting since Biden stepped up his deliberations and outreach about a possible campaign. People familiar with Bidens thinking say hes yet to make a final decision, but is likely to announce his political future within a month. The vice president is consulting with a close circle of longtime advisers, though there are said to be divisions within that group about whether he should run. Those close to Obama and Biden insisted on anonymity because they were not authorized to publicly discuss the vice presidents deliberations or the White Houses view of the 2016 race. Of course, whats at stake for Obama in the 2016 election is more than just his personal relationships with Clinton and Biden. Much of his legacy is contingent on a Democratic president maintaining his policies on immigration, health care and climate change, as well as the nuclear agreement with Iran. Since announcing her candidacy in April, Clinton has largely backed Obamas policies. However, shes distanced herself from his decision to approve offshore oil drilling in the Artic and said she would have voted against his bid to get fast-track authority for an Asia-Pacific trade deal if she were still in the Senate. Clinton has more latitude than Biden in breaking with Obama policies given that her portfolio in the administration was largely limited to foreign affairs. The vice president, however, has been a central figure in wide-ranging administration policies and has been the point person on everything from the economic stimulus to gun control legislation to Ukraine. Biden, as the presidents partner, would be closely identified with the Obama legacy, said David Axelrod, a longtime Obama political adviser. However, he added that any Democrat will carry the benefits and burdens of Obama into this election. Some Democrats say Bidens strongest campaign strategy would be to cast himself as an economic populist. He met over the weekend with Massachusetts Sen. Elizabeth Warren, a favorite of the Democratic Partys progressive wing whose support would be a major coup for Biden. Democrats say Biden supporters are also quietly reminding influential operatives and donors that the vice president was ahead of both Obama and Clinton on some issues that are now cornerstones for the party, including gay marriage. ", "Date": "20150825", "Title": "[Family feud? Obama caught between Clinton, Biden ambitions]", "Link": "http://www.seattletimes.com/nation-world/nation-politics/family-feud-obama-caught-between-clinton-biden-ambitions/", "Author": "[JULIE PACE]"}