{"Content": "[WASHINGTON (AP)  If Marco Rubio launches his presidential campaign as expected Monday, the first-term Republican senator from Florida may have to answer this simple question. Why now?, The 43-year-old Rubio, a rising star on Capitol Hill, could wait four more years, even eight, and still be a relatively young candidate. Some party officials want him run for governor or try to hold his Senate seat, which could be crucial to continued GOP control of the chamber. By training his sights on the White House, Rubio also sets up a head-to-head competition with Jeb Bush, a mentor with whom he has many overlapping supporters. But the window to run for president can close as quickly as it opens. Then-Sen. Barack Obama of Illinois seized an opportunity in 2008 and won. Donors clamored for New Jersey Gov. Chris Christie to run in 2012, but he declined and now heads into the 2016 campaign in a decidedly weaker position. Theres no telling that (Rubios) opportunity will be better four or eight years from now, said Fergus Cullen, the former New Hampshire Republican chairman who is yet to throw his support behind a candidate. Rubios advisers know all about the fickle preferences of the electorate. Rubio was a beneficiary of the 2010 tea party wave that swept dozens of conservative lawmakers into Congress just two years after Obama and Democrats won big. Rubio was expected to announce his candidacy Monday in his hometown of Miami, which would put him in the shadow of Democrat Hillary Rodham Clintons highly anticipated announcement Sunday of a second White House run. But Rubios team sees an opportunity to answer the why now question and argue the countrys pressing problems require a new generation of leaders, not a return to the 1990s. Rubio is about to step into a field that is shaping up to be crowded and competitive. He wont be the only senator in the race. He wont be the only tea party-aligned candidate. He wont even be the only Floridian, the only Cuban-American or the only candidate claiming foreign policy expertise. Some are better known  Bush, for one. But it is early, and Rubios advisers say they are playing a long game. Campaigns are won at the end, not at the beginning, said Alex Conant, Rubios spokesman. Miamis Freedom Tower was picked as the expected backdrop for Rubios campaign announcement. The landmark was once the federal processing center for tens of thousands of Cuban exiles arriving in the U.S. in the 1960s and 1970s. Rubios parents left Cuba in 1956, shortly before Fidel Castro took power. The senator plans to make his familys immigrant past and his own success story a central part of his campaign. He also intends to play up his hawkish foreign policy views and experience on two powerful national security-focused Senate committees as he tries to sell his qualifications to be commander in chief. Rubio was expected to return to Washington in time for a Senate Foreign Relations Committee hearing Tuesday on Iran. Like his Republican presidential rivals, Rubio has been sharply critical of Obamas deal-making with Iran over its disputed nuclear program. Rubio will headline fundraisers in New York and Boston later in the coming week. He was a strong fundraiser for Republicans in the 2014 elections and a popular draw in their campaigns, though he will be competing with Bush for some high-dollar Florida donors. Rubio supporters recently announced the formation of a super PAC to bolster his candidacy. Rubio is set to make his first campaign stop as a presidential candidate Friday in New Hampshire. Hes also expected to visit Iowa, South Carolina and possibly Nevada by the end of the month, aides said. When Rubios campaign set Monday at its launch date, aides knew Clinton could be looking at the same window. The team weighed the risks of Clintons announcement upstaging Rubios event, but decided to move forward. Lin Bennett, the first vice chairman of the South Carolina Republican Party, said Rubio could set himself apart in the Republican field by getting the first shot at rebutting Clintons candidacy. It would be a plus for him that I hope hell take advantage of, said Bennett, who is unaffiliated in the Republican primary. ", "Date": "20150412", "Title": "[Rubio looks to find his opening in the 2016 Republican field]", "Link": "http://www.seattletimes.com/nation-world/rubio-looks-to-find-his-opening-in-the-2016-republican-field/", "Author": "[JULIE PACE]"}