{"Content": "[To those intrigued by the Donald Trump frenzy or impressed by Carly Fiorinas performance Wednesday night, the message from the King County Republican Party is clear:, This presidential election is something to look forward to. In a packed banquet room set up for TV-watching at the Hyatt Regency in Bellevue, GOP supporters showed overwhelming support for Fiorina in the presidential debate. They cheered for the former business executives comments about former Florida Gov. Jeb Bushs pot use, for instance, and her ability to stand her ground against other debaters. How amazing would it be to have two women running against each other? asked Everett resident Vera Olson, referring to Democratic presumed front-runner Hillary Rodham Clinton. The crowd found Trumps self-described humble comments extremely comedic. And though party supporters gave relatively meek applause for the remaining nine leading candidates throughout the CNN showdown, they said they appreciate the variety and believe this crop of presidential hopefuls is strong. When you have this many candidates, this much involvement so early on, it shows its a robust competition, said 570 KVI conservative radio host John Carlson, who helped host the Bellevue event. Sen. Rand Paul and Trump didnt win any popularity points with the crowd, and Sen. Marco Rubios performance, a favorite attendees said among young party supporters, followed Fiorinas top spot for support. Some Bellevue High School seniors  who will vote for the first time come November 2016  were among Wednesdays crowd and voiced frustration with the nights political jargon and candidates wide-sweeping statements. It could perpetuate the problem among their peers, the high-schoolers said, of following candidates like Trump simply because they recognize his name. They hear these superficial details from whatever pops up on Facebook, Linnea Uyeno said, and theyre not considering the facts, she said. King County Republican Chairman Lori Sotelo said its too early to gauge a real front-runner. In the last couple years, weve become a tent with very different and interesting candidates, she said. The candidates are getting their word out there, and well know more about whos on top around January and February. Olson, the Everett resident, said shes so turned off by Trump, the races goofball, shes considered recently abandoning her ties to the party and rooting for Democratic candidate Sen. Bernie Sanders, the fiery progressive from Vermont. Related Stories]", "Date": "20150916", "Title": "[Fiorina a favorite at local GOP event in Bellevue]", "Link": "http://www.seattletimes.com/seattle-news/politics/fiorina-a-favorite-at-local-gop-event-in-bellevue/", "Author": "[Jessica Lee]"}