{"Content": "[Several million American workers will cut back their hours on the job or leave the nations workforce entirely because of President Barack Obamas health care overhaul, congressional analysts said Tuesday, adding fresh fuel to the political fight over Obamacare. The workforce changes would mean nationwide losses equal to 2.3 million full-time jobs by 2021, in large part because people would opt to keep their income low to stay eligible for federal health care subsidies or Medicaid, the Congressional Budget Office said. It had estimated previously that the law would lead to 800,000 fewer jobs by that year. Republican lawmakers seized on the report as major new evidence of what they consider the failures of Obamas overhaul, the huge change in U.S. health coverage that theyre trying to overturn and planning to use as a main argument against Democrats in Novembers midterm elections. Its the latest indication that the presidents health care law is destroying full-time jobs, said Republican Rep. John Kline of Minnesota, chairman of the House Education and the Workforce Committee. This fatally flawed health care scheme is wreaking havoc on working families nationwide, he said. But the White House said the possible reduction would be due to voluntary steps by workers rather than businesses cutting jobs  people having the freedom to retire early or spend more time as stay-at-home parents because they no longer had to depend only on their employers for health insurance. The law means people will be empowered to make choices about their own lives and livelihoods, said White House Press Secretary Jay Carney. CBO Director Douglas Elmendorf said the top reasons people would reduce work would be to qualify for subsidized coverage and an expanded Medicaid program but that lower wages  because of penalties on employers who dont provide coverage and looming taxes on generous health care plans  would also be a factor. The agency also reduced its estimate of the number of uninsured people who will get coverage through the health care law. The budget experts now say 1 million more people will be uninsured this year than had been expected, partly because of the website problems that prevented people from signing up last fall. However, it wasnt all bad news for the Obama administration. The CBOs wide-ranging report predicted that the federal budget deficit will fall to $514 billion this year, down from last years $680 billion and the lowest by far since Obama took office five years ago. The new estimates also say that the health care law will, in the short run, benefit the economy by boosting demand for goods and services because the lower-income people it helps will have more purchasing power. The report noted that the 2014 premiums that people pay for exchange coverage are coming in about 15 percent lower than projected, and the health care law, on balance, still is expected to reduce the federal deficit. However, the budget experts see the long-term federal deficit picture worsening by about $100 billion a year through the end of the decade because of slower growth in the economy than they had previously predicted. As for health care signups, the website woes have largely been cleared up, but the nonpartisan congressional analysts estimated that about 1 million fewer people will enroll through the new insurance exchanges than had been expected this year, for a total of 6 million. Enrollment is predicted to pick up, topping 20 million in 2016. The exchanges, or online marketplaces, offer subsidized private coverage and cater mainly to middle-class people who dont have health care on the job. The Congressional Budget Office also revised its Medicaid enrollment projection downward by about 1 million, for a new total of 8 million signups in 2014. About half the states have accepted the health laws Medicaid expansion. What about those people whose decisions about work might be affected by the new law?, Lower-wage workers are more likely to reduce their hours or quit their jobs because of Obamacare incentives, the report said. Although some employers will choose not to hire additional workers, or will reduce hours, the budget office said that does not appear to be the main factor. The estimated reduction stems almost entirely from a net decline in the amount of labor that workers choose to supply, rather than from a net drop in businesses demand for labor, the report said. The health care analysis is layered with complexity. The job losses are measured in full-time-equivalent workers, which means more people are actually affected than, say, the 2 million full-time-equivalent jobs lost in 2017. It could take several part-time workers or people deciding to reduce their hours to produce the wage loss of one full-time equivalent. The report also contains an important caveat, that the estimate of job losses is subject to substantial uncertainty and could be larger or smaller than predicted. There now are more than 130 million jobs in the economy. Meanwhile, the broad federal deficit projection shows another yearly improvement. Obama inherited an economy in crisis and the first deficits ever to exceed $1 trillion. The 2009 total, swelled by the costs of the Wall Street bailout, hit a record $1.4 trillion, while the deficits of 2010 and 2011 each registered $1.3 trillion. The agency sees the deficit sliding to $478 billion next year before beginning a steady rise years through 2024 that would bring the annual imbalance back above $1 trillion. Overall, it forecasts deficits totaling $7.3 trillion over the coming decade, about $1 trillion more than previously estimated. CBO expects that economic growth will diminish to a pace that is well below the average seen over the past several decades, the report said, citing an aging population and a decrease in the rate of growth in the labor force. Tuesdays report comes as Obama and Republicans in Congress are taking a respite in the budget wars that have periodically consumed Washington since Republicans took control of the House in 2011. The declining deficit numbers mean they could feel even less urgency to act now. A December budget agreement and last months follow-up spending bill could buy peace through Novembers midterm elections. Republicans also appear to be taking a less confrontational approach to legislation needed this month to increase the governments borrowing limit to avoid defaulting on its obligations.]", "Date": "20140204", "Title": "[Obamacare may prompt millions to work less]", "Link": "http://www.seattletimes.com/nation-world/obamacare-may-prompt-millions-to-work-less/", "Author": "[RICARDO ALONSO-ZALDIVAR, ANDREW TAYLOR]"}