{"Content": "[Whether its on his HBO talk show, on Twitter or in his stand-up comedy, Bill Mahers untethered tongue roils folks on both the left and the right of the political spectrum. Mahers fiery brand of political humor has made him enemies in Donald Trump, comedian Wayne Brady and ex-Gov. Sarah Palin, who tweeted: Im in your neck of the woods this weekend, little Bill. Care to meet so I can tell you how I really feel? This came after Maher made an offensive and insensitive joke about Palins special-needs son. The comedian and political commentator, who plays the Paramount on Saturday, spoke over the phone recently about his brand of comedy and the thinness of peoples skin when it comes to humor. Stand-up comedy is certainly driven by whats gonna get the biggest laugh, Maher said. People ask me, why are you so hard on the Republicans? Because they are stupider. The Real Time host is not short on reasons why he thinks that. Democrats dont claim that we dont have to worry about global warming because God promised Noah in the Bible that he wouldnt try to wipe out the world again, Maher said. If thats the kind of raw meat that Mahers liberal audience is looking for, theyll get it, but not before Maher gives them a dose of their own. The fight I have with liberals is that lately they do not understand when I talk about problems with religion, especially Islam, they conflate it with some sort of bigotry or racism when its only about incompatible beliefs, Maher said. Maher, who says hes not a registered Democrat, made headlines in the 2012 election when he donated $1 million to President Obamas campaign. Despite that investment, Maher says he still finds plenty to criticize the president for. Ive often had to tell my liberal audience, hes not your boyfriend, hes the president,   Maher said. On who has a thicker skin, Maher gives credit to conservatives and Republican guests on his show. Theyre happy warriors. They are always smiling. I feel like half the time they know that theyre playing a weak hand in whatever nonsense theyre there to justify or defend, Maher said. His prediction for the 2016 presidential race? A matchup of Hillary Clinton vs. New Jersey Gov. Chris Christie. I think Hillary will win. I think this country wants the first woman president, and shes obviously the one who has paid her dues to get it, Maher predicted. Mahers stand-up act pushes peoples buttons and generates as much outrage as it does laughter. Audiences should prepare for both. Jeff Albertson: 206-464-2304 or jalbertson@seattletimes.com]", "Date": "20130621", "Title": "[Bill Mahers politics of humor]", "Link": "http://www.seattletimes.com/entertainment/bill-maherrsquos-politics-of-humor/", "Author": "[Jeff Albertson]"}