{"Content": "[Remember the scary  some would say sensationalized  simulation video of the Alaskan Way Viaduct along the Seattle waterfront collapsing in a magnitude 7.0 earthquake?, City of Seattle engineers say the destruction shown in the video, released by the state during the campaign to replace the viaduct with a tunnel, is a pretty good approximation of what would happen to the aging waterfront seawall in a comparable earthquake. Within 30 seconds, the soil beneath Alaskan Way liquefies and pushes against the seawall, collapsing it. The roadway, sidewalks and pier ends buckle and tip into Elliott Bay. Major utility lines break, cutting power and rupturing gas pipes. The damage to the state ferry dock, railroads, streets and historic buildings is extensive. Seattle voters will be asked in the Nov. 6 general election to approve a $290 million bond measure to replace the waterfront seawall, built between 1915 and 1936 and badly eroded over the years by marine borers and tides. The 30-year bond measure would cost $59 per year for the owner of a median-valued, $360,000 home. The measure requires 60 percent approval to pass. There is a clear and present danger to public safety if it is not replaced. Its time for us to act, said Bob Davidson, president and CEO of the Seattle Aquarium and a member of the Save Our Seawall campaign, which supports the ballot measure. And unlike the divisive tunnel issue, city leaders including Mayor Mike McGinn and the entire City Council support the seawall replacement. Weve patched the seawall together for so many years. We can no longer postpone it. This is one of those housekeeping tasks a city has to undertake, said Councilmember Tom Rasmussen, chairman of the Transportation Committee. Rasmussen also notes the city is on a tight timeline. Removal of the viaduct, now scheduled for 2016, and the reconstruction of Alaskan Way cant be completed until the seawall is rebuilt. Who should pay?, Opponents, including some of the activists who argued against the tunnel, call the threats of a seawall collapse scaremongering claptrap. And they say that because waterfront businesses and property owners stand to benefit the most from the seawall replacement, those private-property owners, and not the city as a whole, should pay for the improvements. They argue that a Local Improvement District is more appropriate. The people who benefit from a project should pay for the project, said Christopher Brown, a retired traffic and transportation engineer who, along with Ed Plute, wrote the statement Against Proposition 1 for the Seattle Voters Guide. Brown says the benefits of the project diminish the farther one gets from Elliott Bay. Why should Northgate be taxed for 30 years so Ivars can get a free ride?, Brown calls the citys expensive, long-range plans to redesign the waterfront to create a series of parks and open spaces lunacy, and notes that this is the most valuable real estate in a several-state radius. But Bob Donegan, president of Ivars, on Pier 54, said that while businesses own and maintain their own piers, its the citys seawall. Donegan said the seawall protects critical transportation and communication infrastructure for the region, not just a few businesses. Every utility in downtown goes through Alaskan Way  sewer, water, fiber optics, natural gas, electricity  as well as freight and railroad lines. If the seawall fails and those are lost, the whole city and region goes down, he said. Donegan noted that a Local Improvement District is part of the financing plan for the redesigned waterfront park, where local property owners will more directly benefit from removal of the viaduct and the creation of new public spaces. But Donegan concedes the grand plan for a parkway that re-connects the city to Elliott Bay depends on a rebuilt seawall. We cant realize our vision of the waterfront without it, he said. Quiet campaign, To date, neither campaign has been very visible. The Save Our Seawall group had raised $180,000 through Oct. 5. Davidson said supporters plan to send several direct mailers to likely voters in the coming weeks, but they wont distribute yard signs or buy TV ads. The opponents have not raised any money. Speakers from both sides have argued their cases to political and municipal groups. So far, the proponents have picked up the major endorsements, including the Seattle Metropolitan Chamber of Commerce, the King County Labor Council, the League of Women Voters Seattle-King County, the environmental group Futurewise and all of the citys Democratic legislative districts. The bond measure would fund Phase 1of the seawall replacement from South Washington Street to Virginia Street, the oldest and most vulnerable section, the city says. An additional $30 million for the project would come from the city and also $30 million from the King County Flood Control District. Whats a seawall?, The seawall is not just a vertical face. Near the historic piers, between about Madison Street and University Street, the wall extends 60 feet under Alaskan Way, to the support columns of the viaduct. Part of the seawall is concrete. Part is made up of 20,000 old-growth timbers. Behind the wall face and around the supports is fill  silt, dirt and whatever else the workers poured in years ago, said Jennifer Wieland, seawall-project manager with the Seattle Department of Transportation. City engineers knew the wall was in bad shape, but it wasnt clear just how bad until after the Nisqually earthquake. Engineers assessing damage in 2002 excavated large chunks of decaying timbers, casualties of gribbles, a tiny, shrimplike crustacean with a voracious appetite for wood. The city estimates about half of the seawall is deteriorated and has a 1-in-10 chance of failing in a major earthquake in the next 10 years. Part of the complexity and cost of the project is the need to coordinate the seawall construction with the states Highway 99 tunnel project. If the bond measure fails, city leaders say, it would leave the waterfront at risk and delay viaduct removal and Alaskan Way reconstruction. The bond measure also would rebuild the public piers to either side of the Aquarium that are badly deteriorated, and it would restore shoreline habitat. The city plans to create a small beach at the foot of Washington Street. Planners also hope to re-establish a migration corridor for juvenile salmon by raising the seafloor next to the wall and designing new sidewalks that sunlight can penetrate. Currently, no light reaches beneath the existing piers and the seafloor is nearly lifeless, Wieland said. Lynn Thompson: 206-464-8305 or lthompson@seattletimes.com. On Twitter @lthompsontimes.]", "Date": "20121012", "Title": "[Seattle voters face hefty bill for crumbling seawall]", "Link": "http://www.seattletimes.com/seattle-news/seattle-voters-face-hefty-bill-for-crumbling-seawall/", "Author": "[Lynn Thompson]"}