{"Content": "[For most Republicans, the Supreme Courts ruling on gay marriage is an opportunity to put to rest a divisive issue that threatens their party in the 2016 presidential election. As if dropping a hint to some members of his party, Republican National Chairman Reince Priebus said in a statement the Supreme Court has spoken with finality. Yet some Republican candidates are seizing the decision and the controversy as an opportunity. Former Gov. Mike Huckabee, former Sen. Rick Santorum and Louisiana Gov. Bobby Jindal are among the Republican contenders decrying the courts 5-4 ruling and angling to use it as a cudgel against competitors like Florida Gov. Jeb Bush, who hasnt stated his position on a constitutional amendment banning gay marriage and probably has a better shot at the nomination. Sen. Ted Cruz of Texas is sponsoring such legislation in Congress. I will not acquiesce to an imperial court any more than our Founders acquiesced to an imperial British monarch, Huckabee said in a statement. We must resist and reject judicial tyranny, not retreat. Responses from the 2016 field:, THE DEMOCRATS, Moments after the Supreme Court announced the ruling Hillary Rodham Clinton tweeted out congratulations to LGBT Americans. Today is one of those days well tell all our grandchildren about. . . . This is our country at its best: inclusive, open and striving towards true equality, Clinton said in a statement. Equally quick off the mark was Clinton rival Martin OMalley, who worked in a not-so-subtle reminder that he signed a gay marriage bill into law when he was governor of Maryland. Today, the Supreme Court affirmed that marriage is a human right  not a state right. Im grateful to the people of Maryland for leading the way on this important issue of human dignity and equality under the law. The American Dream is strongest when all are included. Sen. Bernie Sanders, a Vermont independent who is seeking the Democratic nomination, was equally emphatic: Today the Supreme Court fulfilled the words engraved upon its building: Equal justice under law. This decision is a victory for same-sex couples across our country as well as all those seeking to live in a nation where every citizen is afforded equal rights, Sanders said in a statement issued by his campaign. For far too long our justice system has marginalized the gay community and I am very glad the Court has finally caught up to the American people. THE REPUBLICANS, Republican Jeb Bush led a number of centrist Republican candidates in trying to express disapproval of the decision without hostility to gay and lesbian Americans, and their friends and families. The Supreme Court should have allowed the states to make this decision, he said. I also believe that we should love our neighbor and respect others, including those making lifetime commitments. Neurosurgeon Ben Carson, who says he supports same-sex civil unions but not gay marriage, said that the ruling is the law of the land while I strongly disagree. Congress should make sure deeply held religious views are respected, Carson said in a statement. The government must never force Christians to violate their religious beliefs. Florida Sen. Marco Rubio also used the decision to make a case that a Republican should pick the next Supreme Court justice. Marriage should be between one man and one woman, he said in a statement, adding that those who disagree have the right to change their state laws. Rubio said that is not the right of the unelected judges or justices of the Supreme Court. While he said even those who disagree with the decision must abide by the law, Rubio added that it must be a priority of the next president to nominate judges and justices committed to applying the Constitution as written and originally understood. Former Hewlett-Packard CEO Carly Fiorina took a similarly nuanced position. The Court ruled today that all Americans should receive equal benefits and rights from the government under the law. I have always supported this view, she said in a statement. However, this decision was also about the definition of marriage itself. I do not agree that the Court can or should redefine marriage. Huckabee, a Baptist minister, decried the unconstitutional judicial tyranny of the ruling. This ruling is not about marriage equality, its about marriage redefinition, Huckabee said in a statement issued by his campaign. This irrational, unconstitutional rejection of the expressed will of the people in over 30 states will prove to be one of the courts most disastrous decisions, and they have had many. Ohio Gov. John Kasichs statement was short and to the point. The governor has always believed in the sanctity of marriage between a man and a woman, but our nations highest court has spoken and we must respect its decision, said Kasich spokesman Rob Nichols. Former Texas Gov. Rick Perry said he is disappointed the Supreme Court today those to end the centuries old definition of marriage as between one man and one woman. Contending that the 10th Amendment to the Constitution leaves such definitions to states, Perry added: Our founding fathers did not intend for the judicial branch to legislate from the bench and as president, I would appoint constitutional conservatives who would apply the law as written. Jindal accused the justices of following public opinion polls and said the decision tramples on states rights that were once protected by the 10th Amendment of the Constitution. Marriage between a man and a woman was established by God, and no earthly court can alter that, he said in a statement, predicting: This decision will pave the way for an all-out assault against the religious freedom rights of Christians who disagree with this decision. Santorum said the justices made a mistake just as they have in cases from Dred Scott to Plessy, invoking the infamous 19th century rulings that upheld the institution of slavery. As president, I will be committed to using the bully pulpit of the White House to lead a national discussion on the importance to our economy and our culture of mothers and fathers entering into healthy marriages so that every child is given their birthright  to be raised by their mother and father in a stable, loving home, Santorum said in a statement issued by his campaign committee. On Twitter, Donald Trump blamed Chief Justice John Roberts, apparently neglecting the detail that Roberts voted with the minority against gay marriage and alluding to the fact that Roberts was appointed to his job by former President George W. Bush, the brother of one of Trumps rivals for the Republican presidential nomination.]", "Date": "20150626", "Title": "[Presidential candidates react to gay-marriage ruling]", "Link": "http://www.seattletimes.com/nation-world/presidential-candidates-react-to-gay-marriage-ruling/", "Author": "[Heidi Przybyla]"}