{"Content": "[Guns are back in the spotlight after a mass shooting at aCharleston, South Carolina, church last week in which a 21-year old white man shot nine African-Americans to death with a handgun he was able to legally obtain. Gun control is an issue that has frustrated and flummoxed President Barack Obama for the majority of his time in office. And it is unlikely to be an issue on which his administration will be able to make further changes before he leaves. Obama admitted this during his comments last Thursday following the shooting, saying \"it is in our power to do something about [mass shootings]. \"I say that recognizing the politics in this town foreclose a lot of those avenues right now. But itd be wrong for us not to acknowledge it, and at some point, its going to important for the American to come to grips with it and for us to be able to shift how we think about the issue of gun violence collectively,\" Obama said. Whether you believe fewer guns will lead to fewer mass shootings  or that more guns will give people the ability to defend themselves  the needle is unlikely to move in either direction until a new president takes office in 2017. But with the issue back in the limelight, it will likely become a featured topic on the campaign trail. Heres a look at eachofficial and likely presidential candidates stance on gun control and gun issues:, , Clinton has publicly said she will fight for \"common sense\" gun reforms. In 2013, she backed bipartisan legislation requiring universal background checks on gun purchases. \"I know that gun ownership is part of the fabric of a lot of law abiding communities,\" Clinton told the U.S. Conference of Mayors in San Francisco following the Charleston shooting. \"I also know that we can have common sense gun reforms that keep weapons out of the hands of criminals and the violently unstable while respecting responsible gun owners.\", OMalley has called for a ban on assault weapons, stricter background checks, and to prevent \"straw\" purchases of guns, such as fingerprinting requirements. In the wake of the Charleston shooting, OMalley launched what his aides described as a \"major push\" to reform the nations gun laws, saying he was \"pissed\" that observers keep asking how many more incidents it will take to institute any reforms. The most poisonous force in American politics today is not the bad people who do bad things, OMalley said on Monday at the U.S. Conference of Mayors in San Francisco. It is the good people who do nothing. . . .If the thousands of young men killed by gun violence every year across America were young, poor and white rather than young, poor and black, it is hard to imagine that our Congress would continue to block common-sense measures to keep guns out of the hands of criminals and the mentally ill.\", OMalley has said he \"proudly\" holds an F rating from the NRA. , Sanders has an uncertain track record when it comes to guns. As Politico reported, Sanders campaign manager says he is \"very moderate\" when it comes to gun control. However in the past, Sanders has voted against the Brady Bill (law that requires a waiting period for handgun purchases and background checks on those who wish to purchase handguns), voted for a ban on assault weapons, voted to allow firearms on Amtrak trains, and voted for universal background checks. He did not speak publicly following the Charleston shooting, but his campaign manager released a statement.  \"This sick and tragic attack is an example of why we need to ensure that guns do not end up in the hands of dangerous people,\" the statement read. , According to Rhode Island Public Radio, Chafee has voted to ban semi-automatic assault weapons and high-capacity magazines in Rhode Island. He hasalso voted against federal legislation that would have banned lawsuits against gun manufacturers. , Bush has an \"A+\" rating from the National Rifle Association (the groupgives politicians a grade based on how they vote on gun legislation) and has consistently been opposed to stricter gun laws. \"I have a message for the Obama administration,\" Bush said at an NRA conference in Nashville in April. \"Why dont you focus more on keeping weapons out of the hands of Islamic terrorists and less on keeping weapons out of the hands of law-abiding Americans?\", Bush signed Floridas so-called \"stand your ground\" legislation into law as governor, legislation that was thrust into the national spotlight after the 2012 shooting of unarmed black teenager Trayvon Martin. That law was used in Zimmermans defense. Bush defended \"stand your ground\" laws at the NRA meeting in April. \"In Florida you can defend yourself anywhere you have a legal right to be,\" Bush said. \"You shouldnt have to choose between being attacked and going to jail.\", , Graham toldCBS News following the Charleston shooting that he is \"open-minded\" to the modification of current gun laws. He voted against the 2013 Senate legislation that would have expanded background checks for gun purchases after the Sandy Hook massacre in 2012. When asked if there is any solution to gun violence, Graham told CBS \"just being able to track people  put them into systems where they can be deterred or stopped.\", \"Its very complicated in a nation of 300 million people where you have freedom of movement and freedom of thought  300 million of us and unfortunately every now and then, something like this happens,\" Graham added. \"And well see. But I think usually its some disturbed person with a gun. Thats what, usually, these things are.\", Graham has said he owns several firearms. , Ted Cruz has an \"A+\" rating from the NRA and has firmly expressed support for Second Amendment rights. \"The Second Amendment to the Constitution isnt for just protecting hunting rights, and its not only to safeguard your right to target practice,\" Cruz has said, per the New York Times.\"It is a Constitutional right to protect your children, your family, your home, our lives, and to serve as the ultimate check against governmental tyranny  for the protection of liberty.\", Like many other Republican colleagues, Cruz voted against moving forward on the 2013 Senate legislation to expand background checks. , Paul has an \"A\" rating from the NRA and is a strong supporter of the Second Amendment. After the Charleston shooting, he said government wouldnt be able to \"fix\" a \"sickness in our country.\", \"What kind of person goes into church and shoots nine people?\" Paul said at a Faith and Freedom summit in Washington, D.C. \"Theres a sickness in our country. Theres something terribly wrong. But it isnt going to be fixed by your government. Its people straying away, its people not understanding where salvation comes from. I think if we understand that, well have better expectations of what to expect from government.\", Paul also voted against moving forward on the 2013 Senate background-check legislation. , Rubio has an \"A\" rating from the NRA,thanks in part to a bill he introduced into the Senate at the end of March. That bill, called the \"Second Amendment Rights in the District of Columbia\" Act, would amend D.C. gun laws and make it easier for individuals to obtain firearms. Following the Sandy Hook massacre, Rubio voted against the Senate legislation to expand background checks on gun purchases. , In a 2013 interview with conservative host Glenn Beck, Carson took a bit of a different line on gun rights and left some conservatives concerned about his stance. \"It depends on where you live,\" Carson told Beck when the host asked him whether people should be allowed to own \"semi-automatic weapons.\",  \"I think if you live in the midst of a lot of people, and Im afraid that that semi-automatic weapon is going to fall into the hands of a crazy person, I would rather you not have it,\" he said. Carson was invited to the NRA meeting earlier this year and sought to dispel any doubts about his views on gun rights. , During his 2012 presidential campaign, Santorum was a staunch supporter of Second Amendment rights. In 2013, he said he opposed the Senates background-check legislation, instead urging a focus on mental health and the \"impact of the entertainment industrys glorification of violence.\", \"While the president did propose some reasonable measures, Im disappointed, yet not surprised, to see so much emphasis on gun control and not enough on key contributors to mass shootings  mental illness and the impact of the entertainment industrys glorification of violence,\" he said. , Perry expanded gun rights during his tenure as governor of Texas. He has signed legislation allowing people to bring guns in their cars to work and has tried to lure gun manufacturers to the Lone Star state. Days after the Sandy Hook massacre, he said hed support arming teachers in schools. But he has also expressed some hesitation to open-carry laws. , Huckabee has an \"A+\" rating from the NRA and named his 2015 memoir \"God, Guns, Grits and Gravy.\", \"Clearly, city slickers who are more afraid of guns than of the criminals who might use them have a serious mental condition rendering them incapable of critical thinking,\" he wrote. , The former CEO of Hewlett-Packard has said she isa supporter of the Second Amendment and accused Obama of \"pushing a political agenda\" after his comments in the wake of the Charleston shooting. , Walker has an \"A+\" rating from the NRA. During his time as Wisconsin governor, Walker signed into law a bill that gives people more leeway to shoot and kill intruders, as well as a concealed-carry law. , Pataki is perhaps the only Republican running who supports stricter gun laws. In 2000, while governor of New York, Pataki signed into law what was described at the time as the strictest gun-control legislation in the country. , During a 2013 interview with FOX News, Trump described himself as \"a very strong person on the Second Amendment.\" But in his 2000 book \"The America We Deserve,\" Trump said he supports a ban on assault weapons and longer waiting periods on gun purchases. , Christie has a \"C\" rating from the NRA, though he has spent time recently trying to get back into the organizations good graces.Last year,Christievetoed a bill that would have banned ammunition magazines that hold more than 10 rounds. But he was still not invited to speak at the NRA convention this year. Join the conversation about this story , NOW WATCH: What To Do When Theres A Gun To Your Head, See Also:, SEE ALSO:Republicans are more psyched than Democrats about their presidential candidates  ]", "Date": "20150623", "Author": "[Matthew Speiser, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/Here-is-where-all-the-presidential-hopefuls-stand-6344805.php", "Title": "[Here is where all the presidential hopefuls stand on gun control]"}