{"Content": "[ Caption, Close, In this July 10, 2013, file photo, Regent Wallace Hall, of Dallas, takes part in a University of Texas Regents meeting in Austin, Texas. Hall, who is facing a rare threat of impeachment wont testify as expected this week to a House committee investigating his actions, lawmakers said Tuesday, Dec. 17, 2013. (AP Photo/Eric Gay, File), AUSTIN - A Travis County grand jury has declined to indict University of Texas System Regent Wallace Hall, Jr. instead issuing a damning report recommending his removal. \"We, as citizens, feel it is in the best interests of the State of Texas to remove Regent Hall from office,\" stated the four-page report released Tuesday. \"Transparency and accountability are key elements in maintaining citizens trust in their government. Regent Hall demonstrated neither accountability nor transparency.\", The grand jury was assigned to look into whether Hall should be indicted for abuse of office, misuse of information and official oppression for undertaking his own independent probe into the administration of UT-Austin President Bill Powers. The investigation involved filing massive public records requests with the system flagship, which the report said clocked in at 800,000 pages and cost $1 million to compile. While it decided not to indict the Gov. Rick Perry appointee, the grand jury noted he refused to cooperate with its investigation - choosing to communicate verbally so as to avoid a paper trail - abused his power and released to the Office of the Attorney General and his lawyerconfidential student information, some of which made it into the public domain. \"With no written record of his communication, his motives and actions are shielded from direct scrutiny or reconstruction,\" the report reads. \"Based on the information we reviewed, we are appalled at the Regents unaccountable and abusive behavior.\", In addition to recommending Halls ouster, the grand jury recommended the regents board institute other reforms such as requiring regents to pay for the cost of open records requests, ensuring there are consequences for regents who release confidential information and mandating regents to use university email for all official communication. The grand jury members did not expressly explain why they chose not to return an indictment. In his response Tuesday, Hall said House Speaker Joe Straus, R-San Antonio, Rep. Dan Flynn, R-Van and Sen. Kel Seliger, R-Amarillo, abused their own power by seeking to \"criminalize\" his service as a Regent:\" \"Their use of the levers of political power to cover up wrongdoing by legislators should now be investigated, and those exposed for their abuses should be driven from office.\", A system probe into admissions practices at the flagship, spurred by Halls own investigation, last month revealed Powers repeatedly intervened in admissions decisions based on financial or political considerations, recommending candidates over the expressed objections of staff. System Chancellor William McRaven said Powers, who had already agreed to step down this summer, would not be disciplined. Last year, a House committee censured Hall, but the regentrefused calls from Regents Chair Paul Foster to step down from the position. Hall and two allies on the board last weekvoted against naming Greg Fenves, the current provost, to replace Powers. Foster said he expects all regents to work with the new president when he takes over in June.]", "Date": "20150331", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Grand-jury-declines-to-indict-Wallace-Hall-6170233.php", "Title": "[Grand jury declines to indict Wallace Hall]"}