{"Content": "[ Caption, Close, Undated (Possibly 1946): Aerial shot of the soon-to-be Shamrock Hotel. , March 21, 1946: Glenn McCarthy speaks to crowd at groundbreaking ceremony for Shamrock Hotel and McCarthy Center, Early 1947: The Holcombe Boulevard-Main Street intersection. The Shamrock Hotel would occupy this spot later. March 16, 1949: The day before the opening, the Houston Chronicle published an extensive special section describing the Shamrock Hotel. March 1949: Shamrock Hotel is ready for its grand opening. March 16, 1949: Shamrock Hotel pre-opening festivities press party. March 17, 1949: Photographers record ribbon cutting ceremonies at the grand opening of the Shamrock Hotel. 1949: Like many others, young Kathy Covey of Palestine is looking for celebrities at the Shamrocks opening ceremonies. March 17, 1949: Ribbon cutting ceremonies at the grand opening of the Shamrock Hotel. Glenn McCarthy and his wife, Faustine (women in white hat and dress), pose with their family and honored guests at the ribbon cutting for the grand opening of the Shamrock Hotel. March 17, 1949: Onlookers watch as photographers record ribbon cutting ceremonies at the grand opening of the Shamrock Hotel. 03/17/1949 - Glenn McCarthy, his family and honored guests pose for media before ribbon cutting ceremonies at the grand opening of the Shamrock Hotel. Three of Glenn McCarthys daughters (not sure of order), Mary Margaret McCarthy, Glenna Lee McCarthy, Leah McCarthy are on the left; young Glenn McCarthy Jr.;  entertainer Pat OBrien and actor Robert Paige (partially obscured behind OBrien); actress Dorothy Lamour; Glenn McCarthy; Mrs. Glenn (Faustine) McCarthy; youngest daughter Faustine McCarthy. March 17, 1949: - Ribbon cutting ceremonies at the grand opening of the Shamrock Hotel. two of Glenn McCarthys daughters (not sure of order), Mary Margaret McCarthy and Glenna Lee McCarthy are on the left; young Glenn McCarthy Jr.; behind him are entertainer Pat OBrien and actor Robert Paige; actress Dorothy Lamour; Glenn McCarthys youngest daughter, Faustine McCarthy; Mrs. Glenn (Faustine) McCarthy; Glenn H. McCarthy holding the scissors. March 17, 1949: These revelers wait outside to get in the Shamrock Hotel on opening night. March 17, 1949: Arrivals at the grand opening of the Shamrock Hotel were greeted with special editions of the newspaper. March 17, 1949: At the Shamrocks grand opening, the hotels owner Glenn McCarthy is joined by actor Robert Paige, Pat Parham and actor Pat OBrien. March 17, 1949: Gov. Beauford Jester speaks with Glenna McCarthy in the Emerald Ballroom at Shamrock Hotels grand opening party. March 18, 1949: Actress Ginger Rogers arrives at the Metropolitan theater for the premiere of Glenn McCarthys film, \"The Green Promise.\" The premiere was part of the Shamrock Hilton opening festivities. Sept. 11, 1949 - Josephine Abercrombie and husband, Richard C. Hudson, were among the 700 attendees of the Designers Millinery Festival show in the Emerald Room of the Shamrock Hotel. December 1950: Shamrock Hilton Christmas tree lighting. 1952: The Shamrock Hotel took part in a United Fund drive. Undated: Photo of the former Shamrock Hotel, Houstons first big hotel built with oil money. 1953: An aerial shot of the Shamrock Hotel in south Houston. Valians Drive-In Restaurant is seen in the lower left of photo. 1955: The Ed Gerlach Orchestra at the Shamrock Hotel. Nov. 28, 1955: President Harry Turman autographed a copy of his book to Shamrock Hotel banquet manager Erick Worscheh while at a dinner. Undated: Frank Sinatra, appearing at Houstons Shamrock Hotel during Galvestons gambling heyday, dropped down to the Balinese Room on his night-off to socialize with, from left,  Anthony Fertitta, Jimmy Van Heusen, and Sam Maceo. , Feb. 17, 1956: Nothing like paying respects to the boss. New York hotel magnate Conrad Hilton, apparently is no exception. Sign men are changing the name of the Shamrock Hotel to that of Shamrock Hilton. First they put up the Hilton. Then they started on the Shamrock - not with the first letter first, but with the middle letters first. So for several days folks saw, atop the hotel, the sign, quite well spaced,  \"MR. HILTON\". Dec. 3, 1957: A fire at the Shamrock Hilton Hotel Hall of Exhibits caused $100,000 to $150,000 damage. The National Swimming Pool Institutes exposition was ruined. Dec. 3, 1957: A fire at the Shamrock Hilton Hotel Hall of Exhibits caused $100,000 to $150,000 damage. The National Swimming Pool Institutes exposition was ruined. Dec. 3, 1957: A fire at the Shamrock Hilton Hotel Hall of Exhibits caused $100,000 to $150,000 damage. The National Swimming Pool Institutes exposition was ruined. 1958: Erick Worscheh, center, Shamrock Hotel banquet manager, shown with  his staff of captains and waiters at the Shamrock Hotel. Undated: Shamrock Hotel banquet manager Erick Worscheh with Dionne Warwick taken at the Shamrock Hotel. Undated: Zsa Zs Gabor, left, and her unnamed friend with Shamrock Hotel banquet manager Erick Worscheh at the Shamrock Hotel. 1959: \"Here are 2 photos of me with Hugh OBrian, TVs Wyatt Earp,\" D.K. Phillips said.   \"The Hugh OBrian photos taken around Rodeo time at the Shamrock Hilton Hotel, were front page of the Chronicle and the Post (same day).  Im still a cowboy and still dress the part.\", 1959: \"Here are 2 photos of me with Hugh OBrian, TVs Wyatt  Earp,\" D.K. Phillips said.   \"The Hugh OBrian photos taken around Rodeo time at the Shamrock Hilton  Hotel, were front page of the Chronicle and the Post (same day).  Im still a cowboy and still dress the part.\", April 13, 1962: The Houston Press Club chorus line belting out Finale at 13th annual Gridiron dinner at the Shamrock Hilton Hotel, June 18, 1963: Mrs. Phillip M. Pappas, first lady of Texas poetry, was honored with a reception at the Shamrock Hilton Hotel.  She is seated at right.  With her, are Mrs. Andrew Louis, and Mrs. Pappas son Evan. June 12, 1964: Miriam and Jack Weingarten, Lea Fastows parents, at the Cork Club in the old Shamrock Hotel. January 1964: An aerial shot of Fannin, Main and Holcombe streets. The Prudential Building on Holcombe is seen on the left and the Shamrock Hilton Hotel is seen on the far right. May 20, 1970: From left to right, Professor Nicolai Blokhin of Moscow, U.S. Rep. George H.W. Bush and Dr. Emil Freireich of Houston converse while at a dinner given by the Houston chapter of the Leukemia Society of America at the Shamrock Hilton Hotel. The event attracted many of the delegates to the then forthcoming International Cancer Congress. Blokhin was the congress president. Nov. 30, 1970: Barbara Bush and husband, George H.W. Bush, watch election returns at the Shamrock Hilton Hotel. U.S. Senate candidate George Bush lost to Lloyd Bentsen later in that evening. April 15, 1972: A footsore demonstrator tends to personal matters  as his colleagues continue a peaceful picket against Republican Sen.  John Tower at the Shamrock Hilton Hotel. The marchers, supporters of the  United Farm Workers, a militant Chicano labor union, protested action  by the Republican members of the National Labor Relations Board against  their union. Tower, who was at the hotel to address the Student  Optometric Association, never met the 35 marchers. Nov. 27, 1979: Longfellow Elementary students start the seasons Christmas caroling in the lobby of the Shamrock Hilton Hotel in the 6900 block of Main Street. Groups from fourteen other Houston-area schools also performed each weekday from noon to 1 p.m. through Dec. 18. March 10, 1986: A view of the Shamrock Hotel at dusk. June 10, 1986: Rachel Longoria is one of many Houstonians who  found an excuse to stop by the Shamrock Hilton Tuesday morning, just  before it closed for good. The hotel boutique had marked everything down  for quick sale - even the stores fixtures. December 30, 1986: Glenn McCarthy with a photo of the Shamrock Hotel, which he opened in 1949, was among Houstonians who protested its razing in 1987. June 8, 1987: John Horn, his two daughters - Jenny, 14 and Jessica, 8 - and their friend, Rayne Ryan, 14 view the demolition of the Shamrock Hilton Monday afternoon. Aug. 18, 1987: Shamrock Hilton Hotel demolition. 1987: The famous Shamrock Hotel being demolished. Oct. 13, 1987: The historic Shamrock Hilton Hotel Houston is demolished. Oct. 14, 1987: Shamrock Hilton Hotel demolition rubble. Oct. 14, 1987: The historic Shamrock Hilton Hotel Houston is demolished. March 17, 1998: Dick Krueger, left, accompanied by Betty Clifford playing the accordian, sing Irish songs to a small crowd while Jeani Horan and Faye Adams place a wreath at the site of Houstons  former Shamrock Hote. Horan and Clifford, and Faye, former employees of Houstons first big Hotel, gather each year on St. Patricks Day with other former employees and patrons to make a toast to the hotel which was torn down to make a parking lot 10 years prior. March 17, 1998: Tom Horan, right, accompanied by Betty Clifford playing the accordian, left, sing Irish songs to a small crowd while toasting with Irish Whisky the 10th anniversary of the demise of Houstons Shamrock Hotel. Horan and Clifford, former employees of the Houstons first big Hotel, gather each year on St. Patricks Day with other former employees and patrons to make a toast and place a wreath at the site of the former hotel which was torn down to make a parking lot. March 16, 1999: Tom Horan gives a toast to the Shamrock Hotel, shown in background photograph, Tuesday, , in Houston. To commemorate the 50th Anniversary of the hotel, Horan has planned a party which will begin after his final wreath laying ceremony to honor the hotel Wednesday, March 17. March 17, 1999: Web Beard, great-grandson of Glenn McCarthy the owner and builder of the legendary Shamrock Hotel that closed in June 1986, attempts to plant a green carnation Wednesday next to the site where the Shamrock stood on South Main. The boy was there with his mother, Christi, to witness the final wreath-laying ceremony in memory of the Shamrock. The ceremony also marked the 50th anniversary of the construction of the hotel. Back in its heyday, the Shamrock Hotel was one of Houstons most colorful landmarks. Today, a Texas Medical Center parking lot marks the site of its once prized swimming pool. RELATED: Departed businesses, places in Houston we miss, On June 1, 1987, the demolition of the once iconic building began. When it opened on St. Patricks Day in March 1949, the Houston Chronicle featured the event as a centerpiece on its front page with the headline: \"Houstons Luxurious Shamrock Hotel to Open Thursday.\", Over the years, including on its opening day, many celebrities walked through the hotels front doors, including the late Frank Sinatra and former U.S. presidents Harry Truman and George H.W. Bush. Susanne Theis of the Orange Show Foundation, a local non-profit, described the Shamrock as a symbol of Texas 1950s opulence, the Houston Chronicles David Kaplan reported. Weve combed our archive for photos of the Shamrock Hotel, from its birth to its eventual death. You can see them all in the gallery above.]", "Date": "20150601", "Author": "[By John-Henry Perera]", "Link": "http://www.chron.com/news/houston-texas/article/28-years-ago-Shamrock-Hotel-is-demolished-6299153.php", "Title": "[28 years ago: Shamrock Hotel is demolished]"}