{"Content": "[ Caption, Close, Sen. Ted Cruz-ROccupations: Law Partner, Law adjunct professor at UT-Austin, Solicitor General of Texas, Director of Office of Policy Planning, Coordinator of Department of Justice, Associate Deputy Attorney General, Law associate, Law clerk for Supreme Court Justice William Rehnquist and Fourth Circuit appeals courtSource: Vote Smart, Sen. John Cornyn-ROccupations: Attorney/partner, Texas Supreme Court Justice, Bexar County District JudgeSource: Vote Smart, Louie Gohmert-RDistrict: 1Occupations: Mediator, attorney, Army captain, District judgeSource: Vote Smart, Ted Poe-RDistrict: 2Occupations: Air Force reserves, judge, prosecutor, FBI academy trainer, teacherSource: Vote Smart, Sam Johnson-RDistrict: 3Occupations: Air Force colonel, author, home building company owner, Air Force Fighter Weapons School directorSource: Vote Smart, John Ratcliffe-RDistrict: 4Occupations: U.S. attorney, anti-terrorism and national security chiefSource: Vote Smart, Jeb Hensarling-RDistrict: 5Occupations: CEO, San Jacinto Ventures owner, energy company VP, Maverick Capital VP, state director for Senator Phil GrammSource: Vote Smart, Joe Barton-RDistrict: 6Occupations: Natural gas consultant, White House aide/fellow, plant manager, assistant to Ennis Business Forms VPSource: Vote Smart, John Culberson-RDistrict: 7Occupations: Mud logger, oil rig employee, political consulting and advertising agency employee, civil defense attorneySource: Vote Smart, Kevin Brady-RDistrict: 8Occupations: President-Chamber of Commerce for South Montgomery County, Executive VP Beaumont Chamber of Commerce, VP Chamber of Commerce Rapid CitySource: Vote Smart, Al Green-DDistrict: 9Occupations: Co-Manager/Co-Founder, law instructor, Justice of the PeaceSource: Vote Smart, Michael McCaul-RDistrict: 10Occupations: Former Chief of Counter-Terrorism and National Security Section, senior Homeland Security advisor, trial attorney, Deputy Attorney General of TexasSource: Vote Smart, Michael Conaway-RDistrict: 11Occupations: Superintendent/chief financial officer, tax manager, U.S Army specialistSource: Vote Smart, Kay Granger-RDistrict: 12Occupations: Former high school English/journalism teacher, author, owner of Kay Granger InsuranceSource: Vote Smart, Mac Thornberry-RDistrict: 13Occupations: Former congressional aide, deputy assistant secretary of legislative affairs, rancher, former attorneySource: Vote Smart, Randy Weber-RDistrict: 14Occupation: Owner of Webers Air & Heat air-conditioning company, former election judge, grand jury commissionerSource: Vote Smart, Ruben Hinojosa-DDistrict: 15Occupations: Former president and chief financial officer H&H FoodsSource: Vote Smart, Beto ORourke-DDistrict: 16Occupations: Owner-Stanton Street TechnologySource: Vote Smart, Bill Flores-RDistrict: 17Occupations: Former newspaper deliverer, ranch hand, chief financial officer, CEO, company president, former commissioner-Real Estate CommissionSource: Vote Smart, Sheila Jackson Lee-DDistrict: 18Occupations: Attorney, associate municipal court judge, staff counsel for select committeeSource: Vote Smart, Randy Neugebauer-RDistrict: 19Occupations: Former real estate developer, bank executive, president/CEO Lubbock Land CompanySource: Vote Smart, Joaquin Castro-DDistrict: 20Occupations: Attorney, law professor, business ownerSource: Vote Smart, Lamar Smith-RDistrict: 21Occupations: Partner-Lamar Seelingson Ranch, attorney, Christian Science Monitor business/financial writer, management internSource: Vote Smart, Pete Olson-RDistrict: 22Occupations: U.S. Navy aviator and officer, U.S. Navy reserves, Sen. John Cornyns Chief of Staff, legislative aide, U.S. senate naval liaison officerSource: Vote Smart, Will Hurd-RDistrict: 23Occupations: FusionX senior advisor, CIA operations officer, Crumpton Group Limited Liability Company partnerSource: Vote Smart, Kenny Marchant-RDistrict: 24Occupations: Dishwasher, investor, newspaper deliverer, lawn mower, roofing and home building company ownerSource: Vote Smart, Roger Williams-RDistrict: 25Occupations: Atlanta Braves baseball player, chair of Roger Williams Auto Mall, owner of Roger Williams Ranches, TCU baseball coach, chair of Vestry Financial Corporation, national grassroots fundraising chair of Bush-Cheney campaign, State finance chair for John Cornyn, North Texas Chair of Bush-Cheney president campaign, regional finance chair for Governor George W. BushSource: Vote Smart, Michael Burgess-RDistrict: 26Occupations: Chief of  obstetrics and chief of staff at Lewisville Medical Center, Obstetrics  and Gynecology Associates of Lewisville founder, resident of Parkland  HospitalSource: Vote Smart, Blake Farenthold-RDistrict: 27Occupations: President/owner/operator Farenthold Consulting LLC, talk show contributor, attorney, Austin Party Line President, BFP Mobile Entertainment owner, radio DJSource: Vote Smart, Henry Cuellar-DDistrict: 28Occupations: Licensed U.S. customs broker, mediator, dishwasher, arbitrator, attorney, government instructor, law adjunct professor Source: Vote Smart, Gene Green-DDistrict: 29Occupations: Attorney, business manager of Daily Court ReviewSource: Vote Smart, Eddie Bernice Johnson-DDistrict: 30Occupations: Board of Directors member of Sunbelt National Bank, consulting and airport concession management, chief psychiatric nurse at Veterans Administration Hospital, regional director of U.S. Department of Health, Education and WelfareSource: Vote Smart, John Carter-RDistrict: 31Occupations: State legislative aide, offshore oil rig employee, attorney, district judge, appointed judge, lawyer for Agriculture CommitteeSource: Vote Smart, Pete Sessions-RDistrict: 32Occupations: District manager for marketing at Southwestern Bell Telephone company, VP of public policy at National Center for Policy Analysis, Source: Vote Smart, Marc Veasey-DDistrict: 33Occupations: Realtor, health care consultant, community activist, legislative aide, Polytechnic High School employee, sports writer for Source Media IT Network and Fort Worth Star-TelegramSource: Vote Smart, Filemon Vela-DDistrict: 34Occupations: Intern with Congressman Solomon P. Ortiz, Federal Judicial Center internSource: Vote Smart, Lloyd Doggett-DDistrict: 35Occupations: Attorney, Texas Supreme Court Justice, law adjunct professor at UT-AustinSource: Vote Smart, Brian Babin-RDistrict: 36Occupations: Dental practice owner, dental staff at Tyler County Hospital, U.S. Air Force captain, Texas National Guard/U.S. Army ReserveSource: Vote Smart, Thirty-eight men and women represent the state of Texas in the U.S. Senate and House of Representatives and when they come from every corner of the state, you can bet they bring diverse backgrounds to the job. As expected, many of Texas congressmen have backgrounds in law, including teaching at colleges and universities. Business owners and executives round out many of their resumes but others are not so traditional. Past psychiatrists and dentists are also in the mix. Theres even a handful of members whove been dishwashers as well as one former English/journalism teacher. Click through the slideshow to see what each senator and representative from Texas has done for a living. Correction: An earlier version identified Pete Gallego as the District 22 representative. ]", "Date": "20141112", "Author": "[By Maribel Molina]", "Link": "http://www.chron.com/news/politics/article/Texas-congressmen-have-held-some-interesting-jobs-5887716.php", "Title": "[Texas' congressmen have held some interesting jobs]"}