{"Content": "[Sen. Rand Paul (R-Kentucky) launched his presidential campaign at an event inthe Galt House Hotel in Louisville, Kentucky on Tuesday. Paul took the stage after about an hour of introductions to cheers of \"President Paul!\", \"I have a message  a message that is loud and clear and does not mince words,\" he said. \"We have come to take our country back!\", He went on to say he would take the country from the \"special interests\" and the \"Washington machine.\", \"The answer is the same now as it was then: I have a vision for America. I want to be part of a return to prosperity, a true economic boon that lifts all Americans. A return to a government restrained by the Constitution,\" Paul said. \"A return to privacy, opportunity, liberty. Too often when Republicans have won, weve squandered our victory by becoming part of the Washington machine. Thats not who I am.\", Paul vowed to heal the rift between two \"Americas.\" He described one America, where \"people experience the opportunity, liberty, and the pursuit of happiness,\" and another, where people struggle to experience those things. \"Those who have enjoyed the American dream must break down the wall that separates us from the other America,\" he said. , Throughout the speech, Paul railed against the ways of Washington. He called for term limits for federal lawmakers like himself and demanded members of Congress actually read legislation before they pass it.Paul also took a veiled shot at his Republican rivals, one or more of whom he labeled \"Democrat-lite.\", \"In order to restore America, one thing is for certain, though: We cannot, we must not give dilute our message or give up on our principles. If we nominate a candidate who is simply Democrat-lite, whats the point? Why bother? We need to boldly proclaim our vision for America. We need to go boldly forth under the banner of liberty that clutches the Constitution in one hand and the Bill of Rights in the other,\" he said to cheers. , His announcement began with a video featuring actors playing factory workers discussing their financial woes. The video included a country song with a chorus that said \"theyre living it up on Wall Street in that New York City town\" and \"here in the real world, theyre shutting Detroit down.\", Afterwards, former Rep. J.C. Watts (R-Oklahoma) introduced the pledge of allegiance. He described the event as the beginning of a \"cause.\" , Watts is a prominent African-American conservative. Following the pledge an African-American pastor gave an invocation. The symbolism of their presence was likely deliberate. Paul has given several speeches designed to reach out to minority voters and has described his views on drug reform and prison reform as advocacy for minorities. After these introductions and a singing of the national anthem, Kentucky State Sen. Ralph Alvarado (R) took the stage. Watts said Alvarado would present \"a Guatemala video.\" , \"Its time for a President Rand Paul!\" Alvarado said before the clip began. The video highlighted a philanthropic trip Paul took to that country. On that mission, Paul, an ophthalmologist, performed free surgeries for people in need. A young Kentucky activist named Lauren Bosler spoke next. She expressed dissatisfaction with the Democratic and Republican parties and said Paul would take a new approach. \"My generation is not comprised of the traditional electorate and Rand Paul is not a traditional politician,\" Bosler said. \"He is not only interested in Republican successes. He is interested in American successes.\", Bosler also stressed Pauls interest in technology, small government, and \"civil liberties,\" particularly government not restricting or monitoring peoples use of new technologies. A video then played of Paul giving a speech about the needs of the \"Facebook generation.\", \"If you have a cell phone, you are under surveillance. I believe what you do on your cell phone is none of their damn business,\" Paul said in the clip. , After some more speeches and videos, Watts unveiled a clip of Pauls wife, Kelley discussing how they met. \"I kind of blew him off at first, but Rand kept trying,\" she said. She also attributed Pauls medical career to watching his grandmother struggle with vision problems. Kelley then gave a speech praising Pauls legislative record. \"Rand is truly a different kind of legislator, which has earned him descriptions like the one man think tank,\" she said. Paul took the stage following his wife. Pauls announcement made him the second top tier Republican presidential candidate after Sen. Ted Cruz (R-Texas), who launched his campaign on March 23. Paul, whose father is former congressman and presidential candidate Ron Paul, was elected in 2010. Since then he has become known for his libertarian-leaning positions on foreign policy, drug policy, and the economy. The elder Paul was in attendance at his sons launch. In the presidential race, Paul is expected to eschew the Republican establishment and try to build a grassroots base of atypical supporters including younger voters and minorities. This post was continuously updated through 12:56 p.m. Join the conversation about this story , NOW WATCH: Heres how President Obama starts every morning, See Also:]", "Date": "20150407", "Author": "[Hunter Walker, provided by]", "Link": "http://www.chron.com/default/article/RAND-PAUL-We-have-come-to-take-our-country-6184146.php", "Title": "[RAND PAUL: 'We have come to take our country back!']"}