{"Content": "[ Caption, Close, FILE - In this Sept. 3, 2015, file photo, Republican presidential candidate former Florida Gov. Jeb Bush speaks to employees at Foss Manufacturing during campaign stop in Hampton. N.H. Bush wanted to run for president as a joyful front-runner, above the fray of the pack. Instead, he heads into the fall campaign as a fighter with a foil: Donald Trump. \"I believe that a conservative can win, campaigning with his arms wide open, with joy in his heart, speaking about the hopes and aspirations of the people, being on the side of the people that right now dont see their lives in the future being better than what they have today,\" Bush said in New Hampshire late last week. LACONIA, N.H. (AP)  Jeb Bush wanted to run for president as a joyful front-runner, above the fray of the pack. Instead, he heads into the fall campaign as a fighter with a foil: Donald Trump. Theres a new urgency in Bushs tone as a candidate. Its moved from frustration and annoyance with Trumps constant needling to a willingness to confront the brash billionaire and call him out for his antics. And though he still relies on the policy-driven arguments that suit his wonkish style, the son and brother of former presidents is also acknowledging whats powered Trumps rise: outrage with the political class his family embodies. Such anger alone, he says, cannot prevail. \"I believe that a conservative can win, campaigning with his arms wide open, with joy in his heart, speaking about the hopes and aspirations of the people, being on the side of the people that right now dont see their lives in the future being better than what they have today,\" Bush told a crowded hall in New Hampshire late last week. Bushs aides argue there was no \"aha!\" moment for the former Florida governor that triggered a shift in strategy. Instead, they say, the threat posed by Trump  who has held steady atop polls nationally and in the early voting states for the past six weeks  has awakened an instinctive sense of drive. \"Its something about Jebs makeup,\" said spokesman Tim Miller. \"He is an extremely competitive person, in all aspects of life. He recognizes that this is a race he has to earn.\", Bush remains viewed by many in the party  as well among his opponents  as the most likely candidate to emerge from the unwieldy GOP field to win the nomination. Thats due in large part to the more than $114 million Bush has raised for his campaign and allied super PAC  far and away the most of any 2016 White House effort  and the television advertising that money buys. The super PAC is scheduled to begin $21.8 million in advertising in Iowa, New Hampshire and South Carolina this month. \"Hes still the front-runner, though others could compete\" said veteran GOP presidential adviser Charlie Black, who isnt aligned with any 2016 candidate. He predicted the ads will change public opinion. Democratic front-runner Hillary Rodham Clinton often mentions Bush by name, although she has taken to talking about Trump more often in recent weeks. In doing so, shes tried to link Bush to Trumps policies on immigration  an issue on which the two men have vastly different ideas. And while Trump is an equal opportunity belittler, fighting back against anyone he deems \"not nice,\" he, too, focuses more often than not on Bush. \"As far as Jeb is concerned,\" Trump said, \"I watched him this morning on television and its a little bit sad. Dont forget, he was supposed to win. And he just doesnt have the energy.\" He made the comment on a day when he pledged to remain a Republican. Bush displayed plenty of energy during his run through New Hampshire last week. More than 200 voters got a taste of the new approach, and some uncharacteristically blunt language, after a woman asked Bush during a campaign stop in the states northern lake community if hes afraid that contrasting himself with Trump will turn off voters. \"Im going to push back when he says things that are ugly,\" Bush replied. \"I sure as hell am going to, when he attacks me personally or disparages my family. Damn right, Im going to fight back.\", But, he added to whoops and cheers, \"Im not going to participate in some reality TV show.\" During the same trip, after Trump suggested Bush should only speak English while in the U.S. the bilingual candidate defiantly told factory workers the GOP should campaign with \"brazos abiertos\"  or open arms. While Bush engaged with Trump in a contest of snarky Instagram videos last week, he also tried to short-circuit Trumps appeal by joining in bemoaning the failures of those in power. Referring to a Colorado veterans hospital project that has ballooned in cost, Bush said, \"no one accepts responsibility,\" his voice rising as he jabbed a finger into the air punctuating his words. \"Fix the damn thing. Thats what people want.\", While some supporters are sold on Bushs grittier approach, others are eager to see how it plays out in the months ahead. \"Theres no worry, yet,\" said Republican Rep. Adam Kinzinger of Illinois. \"It might be a little different if we get too late into the fall and things havent changed.\", Bush voiced confidence they will. \"Maybe were in the first quarter,\" Bush said, making a football reference. \"Theres a long haul to go.\", ", "Date": "20150911", "Author": "[Thomas Beaumont, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Trump-surge-challenges-Bush-to-fight-yet-keep-6490224.php", "Title": "[Trump surge challenges Bush to fight, yet keep the 'joy']"}