{"Content": "[ Caption, Close, Toll booth operators collect money from motorists on the Sam Houston Tollway in Harris County. Sidewalks and transit , Regarding \"Pedal power\" (Page B5, Tuesday), yes, Houston needs more bicycle infastructure. But even more important, Houston needs more walkable, ADA-compliant sidewalks. Metros recently introduced Reimagined transit system will not reach its full potential absent walkable sidewalks leading to and from transit stops. Houston-Galveston Area Council should work with Metro and the city of Houston to insure that there are walkable American with Disabilities Act  compliant sidewalks in a half-mile radius around all transit stops. Jane Cahill West, posted on HoustonChronicle.com, , Americans are ready, Regarding \"Carters long pursuit for peace and justice\" (Page 9, Friday), Randall Balmer opines that, unlike Jimmy Carter in 1976, a presidential candidate today who \"challenged corporate interests and questioned the justice of a criminal system that overwhelmingly punished the poor\" could not be elected and further states that Bernie Sanders, although espousing some of those same themes, has little chance of being elected as pundits generally minimize his prospects. But I believe Carter was viewed as one with little chance of securing the nomination of the Democratic Party. Balmer even states Edward Kennedy was the frontrunner.  Although it may be \"exceptional  in American political rhetoric to hear a presidential aspirant take on powerful interests,\" I believe the American people just may be ready to look past the onslaught of messages by the special interest money \"that have flooded the political arena\" and nominate and even elect a person who pursues \"peace, justice and care for those on the margins, those who lack the resources to command the attention of politicians.\" At least I hope they can. Bill Spear Bartlett, Houston, , Classical collapse, Regarding \"Classical music station to go digital\" (Page B2, Saturday), there is a saying: If it aint broke, dont fix it. I knew it was only a matter of time before classical music became ever less accessible as soon as the public radio news and music formats were split. At the same time, 88.7 became padded with repetition and far more news than any one person needs to hear in one day.  The 91.7 frequency is much weaker than 88.7 and already has severely curtailed the reach of classical music.  , Switching to HD and streaming will further limit the accessibility of classical music to all.  Once the ordinary car and home radios cannot access it, it is cut off for those who have older equipment or cannot afford newer equipment or subscriptions. The solution is not to further marginalize classical radio but to reincorporate it into the 88.7 frequency with its strength and broad listener base. I was a faithful donor to public radio before the station split but fell off the wagon once I saw the decision to limit the reach of classical music in Houston.  I will return when that is corrected. Deborah Moran, Houston, , Paying tolls, Regarding \"Norths growth calls for Hardy upgrades\" (Page A1, Tuesday), Im not sure why Houstons in-town residents are barking about toll roads.  If you live and work inside the Loop, then you seldom have to use the toll roads and really arent paying tolls. Commuters driving from the suburbs are paying. I am probably in the minority of not being annoyed by toll roads. Im not saying build more of them, but toll roads do get built faster and better. The new Katy Freeway is nice and wide (yet still congested) because there are toll lanes on it that help pay for it. Interstate 45 has been under a state of construction for decades because it was kept free. Putting toll lanes on it will speed up construction. The Grand Parkway is being built as fast as possible because it is a toll road. If you dont want to pay for the toll road, then dont drive on it.  Ride a bus or carpool and jump in an HOV lane. There are plenty of HOV/bus options around town. If the area just had commuter trains, paid for proportionally by the participating cities and counties, then commuters would have even more options. Matthew Jackson, postedon HoustonChrornicle.com]", "Date": "20150825", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/letters/article/Wednesday-letters-Sidewalks-classical-music-6465305.php", "Title": "[Wednesday letters: Sidewalks, classical music, toll roads]"}