{"Content": "[ A man, as Clint Eastwoods Dirty Harry Callahan put it, has got to know his limitations. As a fellow at his half-century mark, I have long since digested mine. For me, there will be no speeches elevating the throngs, no judicial opinions shaping the law. Like most of us, there will primarily be observation. But my, what a time to observe. Getting ready for next weeks inauguration, it seemed appropriate to read the president-elects The Audacity of Hope. Though I had sworn off self-serving books by contemporary politicians some time ago, I was genuinely hoping that this one would be different. It was. Because I teach a constitutional law course, as Obama once did, I was especially drawn to the chapter, Our Constitution. Though constitutional jurisprudence is but one of several topics covered, the tone was instructive. What I found was not a simplistic, one-size-fits-all approach such as that employed by many of his political opponents; that is, the familiar, We need judges that strictly interpret the Constitution as the Framers wrote it. For them, that refrain constitutes game, set and match. If only it were that simple. The president-elect understands that the law, just like this nations history, is anything but simple. He acknowledges the thorny realities, those which complicate: That accurately ascertaining what this nations founders intended by the document they patched together 222 years ago is a quest more chimerical than real; and that those very framers housed contradictions as deep as any men. And on the precipice of Obamas assumption of the enormous mess that will officially be his next Tuesday, the fact that he would rather proceed down the more difficult winding road strikes me as reason for optimism. Regarding the enticing illusion of divining the original intent of those responsible for the Constitution, the president-elect noted: Anyone looking to resolve our modern constitutional dispute through strict construction has one more problem: The Founders and ratifiers themselves disagreed profoundly, vehemently, on the meaning of their masterpiece. Before the ink on the constitutional parchment was dry, arguments had erupted, not just about minor provisions but about the first principle, not just between peripheral figures but within the Revolutions very core. They argued about how much power the national government should have  to regulate the economy, to supersede state laws, to form a standing army, or to assume debt. They argued about the presidents role in establishing treaties with foreign powers, and about the Supreme Courts role in determining the law. They argued about the meaning of such basic rights as freedom of speech and freedom of assembly, and on several occasions, when the fragile state seemed threatened, they were not averse to ignoring those rights altogether. Given what we know of this scrum, with all its shifting alliances and occasionally underhanded tactics, it is unrealistic to believe that a judge, two hundred years later, can somehow discern the original intent of the Founders or ratifiers. As to the complexity of the founders themselves (and while a recent inductee to the Senate), Obama wrote: Listening to Senator [Robert] Byrd speak, I felt with full force all the essential contradictions of me in this new place, with its marble busts, its arcane traditions, it memories and its ghosts. I pondered the fact that, according to his own autobiography, Senator Byrd had received his first taste of leadership in his early twenties, as a member of the Raleigh County Ku Klux Klan.  I wondered if it should matter. Senator Byrds life  like most of ours  has been the struggle of warring impulses, a twining of darkness and light. And in that sense I realized that he really was a proper emblem for the Senate, whose rules and design reflect the grand compromise of Americas founding: the bargain between Northern states and Southern states, the Senates role as a guardian against the passions of the moment, a defender of minority rights and state sovereignty, but also a tool to protect the wealthy from the rabble, and assure slaveholders of noninterference with their peculiar institution. Stamped into the very fiber of the Senate, within its genetic code, was the same contest between power and principle that characterized America as a whole, a lasting expression of that great debate among a few brilliant, flawed men that had concluded with the creation of a form of government unique in its genius  yet blind to the whip and the chain. No matter ones views on constitutional interpretation, no matter what one thinks of this man, one cannot in good faith deem such reflections expedient sound bites or equate them with the animated chatter that has sadly come to pass for reasoned debate. Ruminations such as these cannot be squeezed onto a bumper sticker and would be most ineffective during a Fox or MSNBC shout-off. They are the serious thoughts of a serious man on a serious topic. And when one reads the president-elects entire book  composed without the obligatory ghostwriter  one sees the same level of humble intellectualism and mental wrestling again and again and again. In these terribly complex times when we all have so much to lose, it inspires  I dare say  hope. Obviously, none of us knows how things will turn out for our next president. He may be an utter failure; he may be the next FDR. But either way, it is heartening to have a leader capable of seeing nuance where nuance exists, capable of demonstrating the strength of mind to acknowledge both this nations great promise as well as its many frailties. For if recent history teaches us anything, it is not that our best leaders necessarily have all the answers in advance, but that they have the capacity to ask the hard questions, listen soberly and then move forward with humility. Political leaders, too, need to know their limitations. Especially those brought on by the vanity of certitude. Wall is a trial lawyer at Oaks, Hartline & Daly and a constitutional law instructor at the University of Houston.]", "Date": "20090115", "Author": "[KEN WALL, Copyright 2009 Houston Chronicle]", "Link": "http://www.chron.com/opinion/outlook/article/Giving-thanks-for-leader-who-knows-limitations-1741357.php", "Title": "[Giving thanks for leader who knows limitations]"}