{"Content": "[ Caption, Close, , Pistols are offered for sale at Freddie Bear Sports on October 18, 2012 in Tinley Park, Illinois. Pistols are offered for sale at Freddie Bear Sports on... Owners of some Houston gun shops say they have noticed an increase of gun sales since President Barack Obamas re-election, and attribute the rush to the presidents reference in a debate to renewing an assault rifle ban. Jim and Joy Pruett, who have run Jim Pruetts Guns and Ammo for 11 years, said sales have gone \"through the roof\" since Election Day. \"We havent been able to keep up with it,\" Pruett said. \"Its beyond our wildest imagination.\", Matthew Swan, a firearms associate at Gander Mountain on Hempstead Road, said hes also noticed an uptick in gun sales and ammunition since Obamas re-election. \"People come in here with opinions,\" Swan said. \"There are people coming in that have never even been interested in firearms.\", Several other Houston area gun stores refused to comment, noting store policies against speaking with the media. Similar stories emerged in cities across the country, with stores attributing higher sales to fears of stricter gun laws passing in Obamas second term. The FBI reported an 18 percent spike in firearm background checks increasing in the months leading up the election, several media outlets reported. Officials say background checks are the leading indicator of sales growth. Since 1998, 11.5 million firearm background checks have been conducted in Texas and 154.6 million nationwide, federal statistics show. The Associated Press reported a jump when Obama was first elected in 2008. A total of 12.7 million background checks were conducted nationwide, up from 11.2 million the year before. The number has continued to rise since. Texas Department of Public Safety records show that between 2008 and 2009, applications granted for concealed handgun licenses spiked and have been steadily increasing. No data was immediately available for 2012. Gun control advocates called for stricter regulations after the mass shooting in Aurora, Colo. where a man with an assault rifle opened fire in the midnight premiere of \"The Dark Knight Rises.\" The July 20 attack left 12 people dead and 58 wounded. Pruett and other gun owners across the country attribute the sales spike to Obamas reference to renewing an assault rifle ban. Gander Mountains Swan said he does not think gun laws will change. \"If a politician comes in and says anything about firearms, people freak out,\" Swan said. \"There is a lot of fear and ignorance about what is really going on.\", With his shelves emptying, Pruett said he and his employees have been working hard to order more and more merchandise, with a constant flow of people purchasing firearms since Election Night. \"Weve seen it before but not to this magnitude,\" he said. Joy Pruett said gun sales grew at their store in 2008 leading up to the November election with a major spike after Obama was elected the first time. In October 2008, sales were $230,000, far above the monthly average of $150,000. In November 2008, sales skyrocketed to $550,000, the Pruetts said. The day before the 2008 election, sales were $6,000 and after Election Day, sales increased to $14,500. The couple has not tallied the numbers for October and November for this year, but Jim Pruett predicts that the ratio is a 20 to 1 increase since Election Day. \"Its wise perhaps to make sure they have the tools to protect their lives, while they are not outlawed by the U.S. government,\" he said.]", "Date": "20121126", "Author": "[By Erin Mulvaney]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Guns-sales-on-the-rise-after-Obama-s-re-election-4065602.php", "Title": "[Gun sales on the rise after Obama's re-election]"}