{"Content": "[ Caption, Close, President Barack Obama speaks about his Clean Power Plan, Monday, Aug. 3, 2015, in the East Room at the White House in Washington. The president is mandating even steeper greenhouse gas cuts from U.S. power plants than previously expected, while granting states more time and broader options to comply. FILE - In this March 20, 2015 file photo, Illinois Gov. Bruce Rauner speaks at a news conference in Chicago. Rauner is reviewing a federal plan to cut greenhouse gas emissions from U.S. power plants to determine whether the state should comply or challenge the new rules. The first-term Republicans office responded, Monday Aug. 3, 2015, to s scheduled climate change announcement by President Barack Obama with a one-sentence statement that his administration is assessing the measure and its \"impacts on Illinois.\", President Barack Obama speaks about his Clean Power Plan, Monday, Aug. 3, 2015, in the East Room at the White House in Washington. The president is mandating even steeper greenhouse gas cuts from U.S. power plants than previously expected, while granting states more time and broader options to comply. Environmental Protection Agency (EPA) Administrator Gina McCarthy speaks in the East Room at the White House in Washington, Monday, Aug. 3, 2015, before President Barack Obama spoke about his Clean Power Plan. The president is mandating even steeper greenhouse gas cuts from U.S. power plants than previously expected, while granting states more time and broader options to comply. WASHINGTON (AP)  President Barack Obamas sweeping new power plant regulations are thrusting the divisive debate over climate change into the race for the White House, with candidates in both parties seeing an opportunity to capitalize. To Democrats, rallying around global climate change is a way to energize liberal supporters and paint Republicans as out of touch with the majority of Americans. To the GOP, Obamas executive actions to curb greenhouse gas emissions are burdensome to business and block job creation, an argument targeting Americans worries about the economy. The president unveiled the plan at the White House Monday, calling it the \"single most important step\" the U.S. has taken to combat a major global threat. Broad support for the rules by Democratic candidates and universal opposition from Republicans puts the parties eventual nominees on a general-election collision course. Most of the changes Obama outlined would have to be implemented by the next president, if the rules survive court challenges. Republicans gave little indication of what they would do differently to curb emissions from U.S. power plants, if anything at all. They cast the measure requiring states to cut carbon dioxide emissions by 32 percent by 2030 as unnecessary and costly White House overreach that will raise energy costs for Americans. The Obama administration itself estimated the emissions limits will cost $8.4 billion annually by 2030, though the actual price wont be clear until states decide how they would reach their targets. Wisconsin Gov. Scott Walker, a Republican, said the regulations would be an economic \"buzz saw\" that would \"cost hard-working Americans jobs and raise their energy rates.\" Jeb Bush, the former GOP governor of Florida, said the rules \"run over state governments, will throw countless people out of work and increases everyones energy prices.\", Texas Republican Sen. Ted Cruz questioned whether climate change is really occurring. \"Im saying the data and facts dont support it,\" Cruz said at a retreat sponsored by billionaire brothers Charles and David Koch, heavily courted donors who strongly oppose Obamas climate change agenda. The issue has also fueled the fundraising race for Democrats. Billionaire environmentalist Tom Steyer dropped $74 million into the 2014 midterm elections for candidates who support policies to curb climate change. Despite such spending, Democrats gave up control of the Senate, lost seats in the House and suffered embarrassing defeats in gubernatorial races. Steyer hosted a fundraiser earlier this year for Hillary Rodham Clinton, the front-runner for the Democratic nomination. Clinton called Obamas power plant measure a \"significant step forward\" and said she would defend it if elected president. Her Democratic challengers were similarly supportive. Power plants account for roughly one-third of all U.S. emissions of the heat-trapping gases blamed for global warming, making them the largest single source. Obama has already used executive actions to curb greenhouse gas emissions from other major sources, including cars and trucks. Building on Obamas aggressive actions, Democrats have cast climate change as one in a long list of issues  along with gay marriage, immigration and diplomatic relations with Cuba  where Republicans are out of step with the majority of Americans. A Washington Post/ABC News poll conducted in March showed 59 percent of Americans said theyd like the next president to be someone who favors government action to address climate change, while 31 percent would prefer someone who opposes it. Dan Pfeiffer, a longtime Obama adviser, said climate change is also a \"litmus test\" for many of the young voters who backed the president in the 2008 and 2012 elections. Some Democrats fear Clinton, if she wins the nomination, will struggle to replicate the high turnout among young people and minorities that helped propel Obama into the White House. \"They see candidates who deny the science as relics from the past not worthy of their support,\" said Pfeiffer, who left the White House earlier this year. \"Motivating the younger voters that were core to the Obama coalition will be one of the biggest tasks for the Democrats in 2016 and climate change is one the best issues to get them to the polls.\", According to the Washington Post/ABC News poll, 64 percent of adults between ages 18-39 said theyd prefer the next president to favor action to address climate change, compared with 49 percent of those over 65. However, an Associated Press-NORC Center for Public Affairs and Yale University poll late last year found that younger Americans didnt hold significantly different views from older Americans on government regulation of carbon dioxide emissions. ", "Date": "20150806", "Author": "[Julie Pace, Ap White House Correspondent]", "Link": "http://www.chron.com/business/energy/article/Obama-power-plant-rules-spark-2016-fight-over-6422347.php", "Title": "[Obama power plant rules spark 2016 fight over climate change]"}