{"Content": "[ TAMPA, Fla. (AP)  They railed against the Obama administrations foreign policy. They scolded \"Washington Republicans.\" And they decried the $18 trillion national debt and the dysfunction of a Congress that cannot get anything done. These were the messages delivered Saturday morning by four Florida Republicans seeking their partys nomination to compete in the race next year to replace Sen. Marco Rubio. Speaking before a Republican Party of Florida meeting, hundreds of activists and grass-roots leaders, from the Panhandle to South Florida, heard the four men make their case. It was the first time they all shared the same stage before a GOP audience. U.S. Rep. Ron DeSantis, a two-term congressman from Ponte Vedra Beach, said hes \"sick and tired of an administration that treats (Cuban President) Raul Castro and (Irans Supreme Leader Ayatollah Ali) Khamenei better than it treats the prime minister of Israel.\", DeSantis promised to limit the federal governments size, reduce taxes and regulations and demand a balanced budget amendment to lower the $18 trillion national debt. \"A limited government is much more likely to be a competent government,\" said DeSantis, a former member of the Navy Judge Advocate Generals Corps who was deployed to Iraq in 2007 and holds a Harvard University law degree. U.S. Rep. David Jolly, of St. Petersburg, said he would stand up to \"Washington Republicans,\" a group he described as \"go-along, get along, look the other way\" GOP lawmakers. \"Our national debt constitutes the greatest threat to our national security,\" he said. Jolly defeated Democrat Alex Sink in a high-profile and expensive March 2014 special election after Congressman C.W. Bill Young died in office from cancer. He was re-elected last November in a congressional district that President Barack Obama had won twice. Florida Lt. Gov Carlos Lopez-Cantera, of Miami, didnt spare anyone in his harsh critique of Obama and Republican-dominated Congress. \"Washington is not good at getting things done,\" he said in promoting his record with Gov. Rick Scott in reducing unemployment, cutting taxes and building a surplus in the state budget. \"I didnt talk about it_I got it done.\", He lambasted Obamas foreign policy, saying he \"treats our enemies like our friends and our friends like our enemies\" and said he was the \"most effective, most experienced and most electable\" Senate candidate. Scott picked Lopez-Cantera as lieutenant governor in early 2014 after leaving the post vacant for nearly a year following the forced resignation of Jennifer Carroll. Lopez-Cantera had left the Florida Legislature due to term limits and had won election as property appraiser for Miami-Dade County. Todd Wilcox, an Orlando businessman and political newcomer, said he offered \"real-world\" experience in a field of GOP Senate candidates who agree on \"95 percent of the issues.\", He hammered Obama on foreign policy and health care, and pledged to reduce the federal governments size and to fight against the Common Core education standards. \"Government big enough to give you everything you want is big enough to take everything you have,\" said Wilcox, invoking the famous words of Thomas Jefferson. Wilcox served eight years in the Armys Special Forces as a Green Beret before joining the CIA, and later ran a defense contracting business. None of the GOP Senate candidates has strong name recognition, according to a recent poll that found a vast majority of respondents in Florida had not heard enough about them to form a favorable or unfavorable opinion. They have plenty of time, however. The Republican Senate primary is Aug. 30, 2016. On the Democratic side, U.S. Rep. Patrick Murphy of Jupiter and Alan Grayson of Orlando are seeking the Senate seat.]", "Date": "20150829", "Author": "[Sergio Bustos, Associated Press]", "Link": "http://www.chron.com/news/article/GOP-Senate-candidates-slam-Obama-Washington-6473422.php", "Title": "[GOP Senate candidates slam Obama, \"Washington Republicans\"]"}