{"Content": "[ In 25 states, lawmakers are considering state constitutional amendments banning gay marriage. In seven more, opponents of gay marriage are gathering signatures to place the issue on the November ballot that also will include the presidential election. Most of the same states already have laws against gay marriage, separate from language in their constitutions. Texas law bans gay marriage. Its lawmakers, however, have not moved to encode the ban into the state constitution or put the issue on the ballot. In the U.S. Senate, Republicans announced plans Friday to seek a vote on a federal constitutional marriage ban July 12, two weeks before the Democratic National Convention in Boston, where the Massachusetts Supreme Judicial Court ruled this year that gays have a right to wed. \"I think when the American people get a chance to have their voice heard that they will overwhelmingly reaffirm their commitment to traditional marriage,\"said Sen. John Cornyn, R-Texas, a leading advocate for the amendment. Making the marriage ban a high priority could help President Bush and other Republicans in close races come November by energizing voters who support the marriage restriction. In February, Bush called for a constitutional amendment to ban gay marriage after the Massachusetts court ruled and San Francisco issued marriage licenses to same-sex couples. Steven Fisher, communications director for the Human Rights Campaign, a national gay rights advocacy group, said the issue has become mired in the politics of the presidential contest. \"The proponents of this started off claiming their objective was protecting marriage, but the timing of this shows its just a political effort and the veil of protecting marriage is tattering,\" Fisher said. \"This is about Republicans turning out their base, its all about politics.\", The vote could force Senate Democrats to choose sides between the majority of voters, who are shown in various polls as opposing gay marriage, and the more liberal elements of their own party who endorse gay marriage. After July action in the Senate, voters in Missouri, a campaign battleground state, will consider the issue on the August primary ballot. Petitions being circulated in other states where the presidential election is closest, including Ohio, Oregon, Michigan and Arkansas, would place the issue on the November general election ballot. They call for amending the states constitutions to ban same-sex marriage. Speaking this week to the Southern Baptist Convention, Bush reiterated his support for a federal amendment. \"My administration is defending the sanctity of marriage against activist courts and local officials who want to redefine marriage forever,\" Bush said. \"The union of a man and woman is the most enduring human institution, honored and encouraged in all cultures and by every religious faith. And government, by strengthening and protecting marriage, serves the interests of all,\" Bush said. But, while most Americans do not support legalizing gay marriage, Americans tend to split evenly on whether a constitutional amendment is necessary, according to surveys. Senate proponents of the gay marriage ban said Friday that their actions are not aimed at winning the fall election but are necessary because circumstances forced them to act. \"I think at first many people were sort of in shock when they first saw the images of same-sex couples being married in San Francisco and then in Massachusetts, thinking this could not be. And then they were more or less in denial,\" Cornyn said. \"I think that sort of describes even some of our colleagues, thinking that maybe this matter would just go away. \", Sen. John Kerry, the Democratic presidential contender from Boston, is against legalizing gay marriage. Even so, Kerry campaign manager Mary Beth Cahill criticized Bush and his Senate backers for using the issue to drum up political support. \"The U.S. Constitution is one of our nations most enduring and sacred symbols and shouldnt be politicized by the president or his surrogates,\" Cahill said of the call for a July 12 vote in the Senate. \"The only thing this plan will do is continue the presidents efforts to further divide an already-divided nation.\", While it is an enduring, emotional issue for many, gay marriage is not one that historically divides the two parties. President Clinton in 1996 signed the Defense of Marriage Act, defining marriage as between heterosexuals. With that model, 39 states have passed similar laws. Democratic pollster Celinda Lake said voters believe there are more important issues at the moment, notably the war in Iraq and the economy at home. \"I think a lot of voters are going to conclude that this is a political ploy and we need to get back to real issues,\" Lake said. Some social conservatives see the pending vote in the Senate as a test that forces politicians to take a stand on the issue. \"We look forward to seeing which senators will step up to the plate and take a stand in defense of marriage next month,\" said Tony Perkins, president of the conservative Family Research Council. \"We have heard from many senators who have declined to co-sponsor the (amendment) but have privately said they will still vote for it. It will be interesting to see if they keep their word.\", A proposed constitutional amendment becomes law if it is approved by two-thirds majorities in the Senate and House and by the legislatures of at least 38 states.]", "Date": "20040619", "Author": "[JULIE MASON, Copyright 2004 Houston Chronicle Washington Bureau]", "Link": "http://www.chron.com/news/politics/article/GOP-making-gay-marriage-major-election-issue-1627877.php", "Title": "[GOP making gay marriage major election issue]"}