{"Content": "[ Caption, Close, Attorney Andy Taylor takes the podium to applause from supporters during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. ( Jon Shapley / Houston Chronicle ), Last week the Texas Supreme Court stood up and took a strong position against discrimination - specifically, the court refused to discriminate between valid and invalid signatures. In an 8-0 order, the statewide elected judges held that Houston City Council had to recognize a petition to repeal the citys equal rights ordinance. It doesnt matter that then-City Attorney David Feldman found the petitioners collected too many flawed signatures to reach the necessary threshold. Nor does it matter that a state district judge similarly discovered fatal errors in the repeal attempt. Our state Supreme Court leapfrogged the usual appeals process and instead focused on the fact that City Secretary Anna Russell said that enough signatures were collected before the city attorney argued otherwise. Once she certified it, the court wrote, City Council had a duty to follow through on the referendum. Now City Council has to choose its next step: either put the ordinance on the November ballot or repeal it. It is tempting to simply repeal the ordinance for the time being and take it up again after Election Day under a new mayor and new city council. Asking for a public vote on Houstons nondiscrimination ordinance risks subjecting immutable human dignity to a popularity contest. Houstonians who look to City Hall to prevent public discrimination on the basis of sex, race, color, ethnicity, national origin, age, religion, disability, pregnancy and genetic information, or family, marital or military status, deserve something greater than a rushed campaign. True liberty means more than fifty percent plus one, and civil rights cannot be doled out at the ballot box. But a campaign may be the only way to win. Theres no reason to think that the people who oppose the ordinance now will have a change of heart in a few months. Whether the law is passed under Mayor Annise Parker or some future politician, there will be people who believe that businesses should be allowed discriminate on the basis of peoples immutable characteristics. Without this ordinance, Houstonians kicked out of a bar for the color of their skin will have to make a federal case to find justice. Veterans will get little help at City Hall if theyre booted by a coffee shop because of their service dog. Members of the gay, lesbian, bisexual and transgender community will have scant legal recourse beyond a social media campaign. And that is just how some people want it - often people from outside city limits, judging by referendum signatures. Thats not the Houston we know. Houston is a place that draws strength from its diversity, and City Hall must have laws to protect that diversity. Municipal elections are just a few months away, and voters have already started to contemplate what the future of their city will look like. That should be a future where Houston doesnt risk losing the Super Bowl because of our discriminatory policies. Just a week ago it seemed like the mayors race would be about potholes and pensions, with the citys revenue cap as the most likely referendum item. Now were back to refighting an issue thats dogged local politics for decades. It is time to finally put it to sleep, and if punching a ballot is the only way to show that Houston is a place that doesnt discriminate, then let the block-walking begin. ]", "Date": "20150728", "Author": "NULL", "Link": "http://www.chron.com/opinion/editorials/article/Equal-rights-and-true-liberty-6411109.php", "Title": "[Equal rights and true liberty]"}