{"Content": "[ Caption, Close, This handout photo provided by Collin County, Texas shows Texas Attorney General Kenneth Paxton, who was booked into the county jail Monday, Aug. 3, 2015, in McKinney, Texas. A grand jury last week indicted Paxton on felony securities fraud charges. (AP Photo/Collin County via AP), A black SUV carrying Texas Attorney General Ken Paxton and others departs the Collin County jail Monday, Aug. 3, 2015, in Plano, Texas. (AP Photo/Tony Gutierrez), Protesters demonstrate against Attorney General Ken Paxton outside the Collin County Courthouse as he was being booked Monday. Protesters against Texas Attorney General Ken Paxton hold signs as they stand outside the Collin County Courthouse, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), A black SUV carrying Texas Attorney General Ken Paxton and others departs the Collin County jail Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), Protesters call for the resignation of Texas Attorney General Ken Paxton as they stand on the Collin County Courthouse steps, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), Protesters calling for Texas Attorney General Ken Paxton to resign hold signs as they stand outside the Collin County Courthouse, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), A photograph of a copy of one of the indictments against Texas Attorney General Ken Paxton, is shown, Monday, Aug. 3, 2015, in Plano, Texas. Paxton turned himself in Monday to face charges that he misled investors and didnt disclose money he made for referring financial clients as part of his private business before becoming the states top lawyer in January. (AP Photo/Tony Gutierrez), The specific details of the indictment will not be revealed until Tuesday, but a special prosecutors said earlier this month they would seek first-degree felony charges against Paxton for violating state securities laws. 1,300 - The percent increase in Paxtons business interests since he was first elected to the state House in 2003. At that time, he had investments in just two businesses; by 2014, this had expanded to 28. He had said he is trying to divest or dial down many of these investments after critics have raised conflict of interest concerns. 3 - The number of times Paxton admitted to soliciting clients for his friend Frederick \"Fritz\" Mowery without being properly registered with state authorities. He was fined $1,000 and reprimanded in April 2014. Texans for Public Justice, an Austin-based group, later filed a criminal complaint with Travis County prosecutors, saying the violation amounted to a third-degree felony. 20 - The percent by which Paxton defeated Sam Houston, his Democratic opponent in the 2014 race for attorney general. Houston, and Paxtons Republican rivals in the GOP primary, lost even after continuing to highlight Paxtons admitted securities violations. 10 - The number of months between the time when Paxton admitted to breaking the law and Travis County prosecutors referred the case to Collin County, where any violations likely took place. The case was put on hold because of an internal policy aimed at preventing politically motivated investigations in campaign season. 4 - The number of businesses Paxton and Collin County District Attorney Greg Willis have invested in together. Willis, a long-time friend and political ally of Paxton, recused himself after it became clear months had passed without him taking up the case referred to him by Travis County prosecutors. 2 -The number of special prosecutors assigned to the case in April after Willis recusal. A month later, a local judge agreed to grant the prosecutors request to expand the case to include any and all possible securities act violations. $100,000+ - The amount of money involved in evidence the special prosecutors plan to present to a Collin County grand jury this month. Schaffer has said they have \"substantial evidence\" to secure a first-degree felony indictment against Paxton. $26 million - The total stock sale for Servergy, Inc. a McKinney-based company over the last five years. The U.S. Securities and Exchange Commission confirmed it began investigating Servergy in 2013 for allegedly defrauding its investors. Paxton was an early investor in the company, his name and email was found in the SEC subpoena of Servergy principals. $2.5 million - The amount of money Paxton currently holds in his campaign coffers, a comfortable cushion to mitigate against future expenses. AUSTIN - Ken Paxton was allowed to skip swaddling his shoulders in a white towel for his mugshot to ensure he was guaranteed a fair trial, a local judge decided Monday. Everyone booked into the Collin County jail for far more than a decade has had to wear a white towel around his or her shoulders to ensure that everyone is on an even playing field when identifying a potential suspect. But not Paxton. The first-term attorney general, indicted Monday for felony securities fraud, was allowed to forgo the towel. READ THE JUDGES ORDER HERE, \"Due to the high profile nature of this case and the Defendants right to fair trial, the Court hereby orders the Sheriff of Collin County, Texas, to refrain from making the Defendant wear a towel while being photographed in custody,\" Tarrant County Judge George Gallagher wrote in his Monday order. \"It (the towel) just takes clothing out of the process,\" said Collin County Sheriffs Office Lt. Chris Havey, who said its called \"the great equalizer.\", \"We do not give anybody in the booking process the opportunity to opt out of it,\" he added. \"That being said, we will comply with a court order obviously. To my knowledge, we have never seen another court order telling us not to use the towel for the booking photos.\", Paxton also entered and exited the jail through a door inaccessible to the public and press, usually only taken for those who are brought into the complex in handcuffs. Paxton made no public statements yesterday, skipping dozens of members of the media who waited more than an hour for him to appear at the county courthouse. , ]", "Date": "20150804", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Mugshot-towel-could-have-impacted-right-to-fair-6424147.php", "Title": "[Mugshot towel could have impacted Paxton's 'right to fair trial,' judge says]"}