{"Content": "[ WICHITA, Kan. (AP)  Kansas Secretary of State Kris Kobach said he agrees with Republican presidential candidate Donald Trumps proposals to build a wall along the southern border and end \"birthright citizenship\" for children born to parents who are in the U.S. illegally. Kobach advised Mitt Romney on immigration policy during his 2012 presidential campaign, and he said it was he who urged Romney to espouse making it impossible to find work for those in the U.S. illegally, thus making them more likely to leave. Romney won just 27 percent of the Latino vote in 2012, the worst performance for a GOP nominee in 16 years. Kobach rejected GOP fears that taking a hardline stance on immigration will hurt the partys chances in the 2016 general election. And he dismissed a Republican Party \"autopsy\" of the 2012 election that recommended the GOP should embrace \"comprehensive immigration reform,\" saying its conclusions are based on the opinions of only a few people. Immigration enforcement is \"a huge issue\" for independents, he said. Romney got an exceptionally high portion of the independent vote, Kobach said. \"There were groups on the left that wanted to scare Republicans into thinking that being for enforcing the law is politically bad for you and bad for a president, but that was a politically driven agenda that they had, and not true.\", President Ronald Reagan signed the biggest amnesty in American history in 1986, and that according to that theory the Republicans should have \"reaped huge rewards\" with Hispanic voters, he said. Instead, the opposite happened when George W. Bush was on the ballot to carry on the Reagan policy. \"We know for certain that a Republican president being for amnesty doesnt yield any benefit at the ballot box,\" Kobach said. \"Just ask George W. Bush who saw a dramatic drop off after Reagan signed the amnesty, not an increase in Hispanic support.\", Kobach said he is not working now advising any of the presidential campaigns, but says he may do so in the future. He declined to specify which one.]", "Date": "20150827", "Author": "[Roxana Hegeman, Associated Press]", "Link": "http://www.chron.com/news/article/Kobach-Trump-correct-on-immigration-proposals-6469538.php", "Title": "[Kobach: Trump correct on immigration proposals]"}