{"Content": "[ Caption, Close, Scott Walker made his White House ambitions official on Monday morning. The Wisconsinite will try to become the 13th presidential aspirant to win an election without a college degree. Walker has some impressive company. See the other U.S. presidents who didnt have a degree. George Washington, first president of the U.S. James Monroe (1817-1825), fifth president of the U.S. Martin Van Buren (1837-1841), eighth president of the U.S. Andrew Jackson (1829-1837), seventh president of the U.S. William Henry Harrison (1841), ninth president of the U.S. Zachary Taylor (1849-1850),12th president of the United States. Millard Fillmore (1850 to 1853), 13th president of the U.S. Abraham Lincoln (1861-1865), 16th president of the U.S. Andrew Johnson(1865-1869), 17th president of the U.S. Grover Cleveland (1885-1889; 1893-1897), 22nd and 24th president of the U.S. William McKinley (1897-1901), 25th president of the U.S. Harry Truman (1945-1953), 33rd president of the U.S. Scott Walker left Marquette University during his senior year. The Republican college dropout and Wisconsin governor hasnt let his lack of a degree hold back his political ambitions. On Monday morning, he announced a run for the White House. READ MORE: The net worth of 2016 U.S. presidential candidates, The 15th GOP member to declare a White House run could join a dozen other presidents who reached Americas highest office without a degree. There are some prestigious names on the list, including two members of Mount Rushmore (Washington and Lincoln). Still every president since 1953 has had one. A couple of the most recent presidents (Obama and Clinton) have earned law degrees. Nine more Americans vying for the 2016 nominee also have the same degree, including Hillary Clinton, Ted Cruz and Marco Rubio. Only one president  Woodrow Wilson  had a doctorate (political science). Two Republican contenders, Rand Paul and Ben Carson, are actual doctors. RELATED: See what U.S. presidents looked like in their youth, This handy National Journal graphic breaks down the current candidates by level of education. Seven others aiming for the Oval Office in 2016 have only an undergraduate degree, including Rick Perry whose paltry grades at Texas A&M included a D in a class called Meats. See the gallery above for a look at the 12 presidents who never entered or completed their undergraduate studies. ]", "Date": "20150713", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/politics/article/Scott-Walker-tries-to-join-the-prestigious-list-6382456.php", "Title": "[Scott Walker tries to join the prestigious list of presidents without college degrees]"}