{"Content": "[ Caption, Close, Members of the crowd cheer during a Christian conservatives rally outside the Tennessee Capitol on Thursday, Sept. 17, 2015, in Nashville. The event featured Joe Davis, the husband of Kentucky clerk Kim Davis, and Rafael Cruz, the father of U.S. Sen. Ted Cruz, a Republican presidential candidate. NASHVILLE, Tenn. (AP)  Hundreds of people cheered the husband of Kentucky clerk Kim Davis during a rally of Christian conservatives Thursday outside the Tennessee Capitol. The celebration of Constitution Day was sponsored by the Tennessee Pastors Network and also drew Rafael Cruz, a pastor and the father of U.S. Sen. Ted Cruz, the Texas Republican and presidential candidate. Speaking of the U.S. Supreme Courts recent decision effectively legalizing same-sex marriage, Cruz said, \"The devil overplayed his hand.\", He said the country needs to elect a constitutional conservative as president, and suggested that Christian conservatives will be roused to action by the ruling. \"Weve been silent too long,\" he said. \"Religious persecution ends in January 2017,\" he said. Cruz acknowledged Joe Davis, husband of the Rowan County, Kentucky, clerk who was jailed for five days after defying a federal judges order to process same-sex marriage licenses. \"What we saw in Kentucky with Kim Davis is tyranny,\" Cruz said, to cheers and applause. Speaking briefly after Cruz, Joe Davis simply asked the crowd to pray for him and his wife. About 40 Tennessee legislators appeared at the rally. State Sen. Mae Beavers and state Rep. Mark Pody drew cheers for their legislation calling for Tennessee to defend the state constitution, which defines marriage as between a man and a woman. It was unclear how they planned to override the Supreme Courts decision. Also speaking at the rally was Richard Land, who led the Nashville-based Southern Baptist Conventions public policy arm for 25 years before leaving to serve as president of Southern Evangelical Seminary. Like Cruz, he predicted the Supreme Courts ruling will lead to a backlash. Speaking to reporters, Land suggested the next president could appoint conservative Supreme Court justices who would overturn that ruling. \"The good news for America is that Supreme Court decisions are never final,\" he said.]", "Date": "20150917", "Author": "[Travis Loller, Associated Press]", "Link": "http://www.chron.com/news/us/article/Christian-conservatives-rally-for-religious-6511819.php", "Title": "[Christian conservatives rally for religious awakening]"}