{"Content": "[ Sen. Ted Cruz (R-Texas) launched his presidential campaign shortly after midnight on Monday with a brief message and video he posted on Twitter. \"Im running for President and I hope to earn your support!\" Cruz wrote in his tweet. Cruz has long been expected to throw his hat into the presidential race. His announcement made him the first major candidate to officially begin a campaign. Cruzs 30-second video features shots of nature, people riding motorcycles through the desert, children playing baseball and reciting the pledge of allegiance. It also shows multiple American flags and a church and closes with a shot of Cruz waving. \"Its a time for truth, a time to rise to the challenge, just as Americans have always done. I believe in America and her people and I believe we can stand up and restore our promise,\" Cruz says in the clip. \"Its going to take a new generation of courageous conservatives to help make America great again, and Im ready to stand with you to lead the fight.\", Cruz, a Tea Party favorite, was first elected to the US Senate in 2012. If he is elected, Cruz, whose father is Cuban, will be the first Latino president. During his time in the Senate, Cruz has been a prominent opponent of President Barack Obamas healthcare reform plans. He was one of the major forces behind the 2013 government shutdown, which occurred when House Republicans attempted to include amendments that would scale back Obamacare in the legislation appropriating the funds for the federal budget. According to a New York Times report published Sunday, multiple Republicans briefed on Cruzs strategy said Cruz wanted to be first out of the gate in an attempt to draw attention away from some of his likely GOP rivals who have \"overshadowed\" him \"in the early competition for donors, staff, volunteers, and news coverage.\" Specifically, the newspaper cited formerFlorida Gov. Jeb Bush and Wisconsin Gov. Scott Walker, who have been widely dubbed the early front-runners. There is some reason to question this strategy. Last year, Bloomberg politics notedthat no candidate who was first to announce had won a presidential election since 1952. One of the people who appeared in Cruzs announcement video was Elizabeth Perez, an accountant based in Houston. Perez spoke to Business Insider shortly after the clip was posted and described how it came together. \"Ihappened to be friends with some of Ted Cruzs campaign staff,\" Perez said. \"So, they were contacting different people here in Houston in regards to who would be interested in doing a supportive video piece for Ted Cruz. And so I was one of the people they contacted.\", Perez, who said she planned to work on Cruzs campaign team, filmed her part in Houstons Hermann Park. She said the video was also filmed in \"different locations that I cant disclose.\", \"I did have to sign a nondisclosure until the announcement came out,\" Perez said. Perez said she was told to wear \"business casual\" for the clip. \"That was it, they said jeans were OK,\" Perez said. In addition to Houston, the video includes shots of Brooklyn, New York, and San Francisco. These images from very blue states drew early attention from observers after the clip was posted. Perez said the inclusion of those other cities was also \"a surprise\" to her. \"I got to say Im surprised as well,\" she said. \"I only knew about Houston being filmed.\", Overall, Perez said she was pleased with how the campaign announcement video turned out. \"I love it,\" Perez said. \"Its a very patriotic and enthusiastic video.\", Ina coy tweet posted Sunday evening, Cruz said he would have \"some big news\" at \"around midnight.\" The video was posted at exactly 12:09 a.m. Earlier in the day, news broke that Cruzwould launch his 2016 bid with a speech at Liberty Universityon Monday morning. Liberty University is a Christian school in Lynchburg, Virginia. It was founded in 1971 by conservative pastor Jerry Falwell. Cruzs venue choice seems to be a clear sign he hopes to court the religious right. On Sunday evening, the Associated Press published a series of photos showing Cruz doing a \"walk-through\" rehearsal of his speech at the universitys Vines Center. View Cruzs tweet and campaign launch video below. This post was last updated at 1:23 a.m. Join the conversation about this story , NOW WATCH: Heres what it takes to be President Obamas right-hand man, See Also:]", "Date": "20150322", "Author": "[Hunter Walker, provided by]", "Link": "http://www.chron.com/default/article/It-has-begun-Ted-Cruz-just-became-the-first-6152040.php", "Title": "[It has begun Ted Cruz just became the first major 2016 hopeful to officially launch a campaign]"}