{"Content": "[ Caption, Close, Vice President Joe Biden speaks at the Solar Power International Trade Show in Anaheim, Calif. Wednesday, Sept. 16, 2015. Taking aim at his potential political opponents, Biden railed against Republicans who \"deny climate change\" and want to shut down the federal government over funding for Planned Parenthood, and pleaded with them to \"just get out of the way.\", Vice President Joe Biden speaks at the Solar Power International Trade Show in Anaheim, Calif. Wednesday, Sept. 16, 2015. Taking aim at his potential political opponents, Biden railed against Republicans who \"deny climate change\" and want to shut down the federal government over funding for Planned Parenthood, and pleaded with them to \"just get out of the way.\", Vice President Joe Biden displays a photo of the field house at the University of Delaware during a speech at the Solar Power International Trade Show in Anaheim, Calif. Wednesday, Sept. 16, 2015, in Anaheim, Calif.  The field house has solar panels on its roof. Taking aim at his potential political opponents, Biden railed against Republicans who \"deny climate change\" and want to shut down the federal government over funding for Planned Parenthood, and pleaded with them to \"just get out of the way.\", LOS ANGELES (AP)  Taking aim at his potential political opponents, Vice President Joe Biden railed Wednesday against Republicans who \"deny climate change\" and want to shut down the federal government over funding for Planned Parenthood, and pleaded with them to \"just get out of the way.\", Biden came to California, a national leader on clean energy, to tout solar technology and ramp up pressure on the U.S. and other nations as the Obama administration presses for a successful finish to global climate talks. Yet his visit was infused with 2016 overtones, and he playfully mocked Republicans who reject mainstream climate science that says humans are contributing to warmer temperatures. \"I think if you pushed them, theyd probably deny gravity as well,\" Biden said. The California swing brought Biden to the same corner of the state as the pack of Republican presidential candidates, who descended on the Ronald Reagan Presidential Library for their second televised debate on Wednesday night. Addressing a solar power summit in Anaheim, Biden offered a prediction that viewers would hear more skepticism about climate change from the pack of GOP candidates participating in the debate. He also called out the billionaire Koch brothers  the Democratic Partys preferred boogeymen  for leading efforts to stymie renewable energy development, though he added sardonically that they were \"fine guys, as I understand it.\", \"We need to set an example for the whole world by eliminating these wasteful, unnecessary subsidies,\" Biden said, arguing that special interests are fighting to preserve federal tax benefits that the energy industry enjoys. As he considers a late entrance into the 2016 presidential race, Biden has started to speak out more directly against the Republican candidates he would face if he won his partys nomination. Addressing Hispanics at a reception on Tuesday night, he lashed out at GOP front-runner Donald Trump and said his \"sick\" message of xenophobia \"will not prevail.\", Bidens California trip was designed to give a boost to a key element of President Barack Obamas agenda. World leaders are working feverishly to finish a global climate treaty by December, and the vice presidents next stop in California was a U.S.-China Climate Leaders Summit in Los Angeles, where the worlds two largest polluters are aiming to ramp up pressure on other countries to match the ambitious pledges to cap or curb emissions that the U.S. and China have already laid out. Taking the stage in Los Angeles, Biden cast himself as having been ahead of the curve on climate, citing a bill he introduced in 1986. Calling the U.S.-China relationship critical to fighting climate change, Biden invoked his longstanding relationship with Chinese President Xi Jinping, whom Biden courted when he was Chinas vice president. \"Tell him I miss him,\" he told visiting Chinese State Councilor Yang Jiechi, who met with Biden at the summit to prepare for Xis state visit to the White House next week. On the sidelines of the summit, Biden met privately with Los Angeles Mayor Eric Garcetti, California Senate President Pro Tem Kevin de Leon and mayors from other major U.S. cities. He also squeezed in a session with the secretary-treasurer of the Culinary Workers Union, whose endorsement is key for presidential candidates in the competitive state of Nevada. The vice president is deeply immersed in deliberations with his family and advisers about whether to enter the 2016 presidential race. In recent days, Biden has opened a window into those deliberations, describing his lingering doubts about whether he has the emotional strength to mount a viable campaign just months after his son, Beau, died from brain cancer. At the same time, Biden has kept up an intensive travel schedule, crisscrossing Florida, Georgia, New York and now California, stops that have done little to quell speculation that hes laying the groundwork for a potential campaign. On Thursday, Biden planned speeches on transportation and sexual assault in Ohio and Michigan  two battleground states that will play key roles in electing the next president. In tandem with Bidens trip, the White House announced that 11 Chinese cities and provinces would max out their emissions earlier than Chinas national goal of 2030. Biden also announced more than $120 million for new and existing clean energy projects in 24 states. ", "Date": "20150916", "Author": "[Josh Lederman, Associated Press]", "Link": "http://www.chron.com/business/energy/article/In-California-Biden-aims-to-build-resolve-for-6507807.php", "Title": "[As Republicans debate, Biden knocks climate change doubters]"}