{"Content": "[ Caption, Close, , Southbound traffic on I-45 jams both the main lanes and the service road due to construction on the interchange with the Grand Parkway near The Woodlands in this file photo. Take a closer look at the biggest transportation issues in Houston for 2015. Southbound traffic on I-45 jams both the main lanes and the service... New light rail:The new cars ordered to operate the new lines will finally go into service this month on the Red Line. Gas prices: As of midday Wednesday, four of the eleven metro areas AAA tracks averaged below $2 for a gallon of unleaded regular gasoline. Houston remained at $2.08, but the price was sliding and some spots offered sub-$2 fuel. The price of gas can be a mixed blessing in Houston, where low oil prices make driving cheaper but threaten to put some people out of work. Gas prices also affect development patterns.\"I think it will open up areas that may have seemed too remote before because now it will be more affordable to commute,\" Scott Davis, director of the Houston market for Metrostudy, told Chronicle real estate reporter Nancy Sarnoff recently. \"People will be willing to make that trade-off if they know theyll be seeing $2 instead of $3 gas.\", Grand Parkway: Along those outer development lines, the next segments of the Grand Parkway, set to open in late 2015, might be the most important new road in the Houston region since the western side of the Sam Houston Tollway was completed. The next segments connect U.S. 290, where the tollway ends now, to U.S. 59 north of Kingwood. Its a critical link to the area around The Woodlands, which is booming not only with new homes, but major new job centers. Highway funding fix: A shortage of transportation money is becoming such a fixture of the Legislatures biennial gathering, its affecting lawmakers vocabularies. The phrase \"end diversions\" -- meaning the shifting of gas tax money to other purposes like policing highways -- is well know even by freshman House and Senate members. Texas, transportation experts estimate, is $5 billion in the hole in terms of needed spending on highways and alternatives to driving. Though theyve come into every session of Rick Perrys terms as governor aiming to align transportation spending with needs, lawmakers say they really, really mean it this time. Armed with a big win for Prop. 1 in November, they might have some success. New bus routes: The new light rail lines have gotten most of the attention, but Metros plan to restructure its bus service will likely affect more transit users. Every route is being revised as part of theso-called reimagining plan, set to start in June. The goal, according to supporters, is to make travel around the region easier by creating frequent routes that criss-cross, fed by local service. It might mean more transfers for riders, but should also result in quicker trips. Skeptics worry Metro is making major changes to a system that just needs tweaks, and could limit local access. Fare game: Last year Houston officials spent a lot of time debating allowing tech companies like Uber to partner with local drivers and offer service that competes with cabs. In November one of the companies pulled up stakes rather than comply with the new rules. This year, well see what the popular Uber service does to the ride market, and whether any of the dozens of small taxi companies in Houston close up shop and turn on the Uber app. U.S. 290 widening: Its still going on, and will be for a while, but drivers might start seeing a lot of progress. The highways connection with Loop 610 is one of the regions worst bottlenecks, a problem that the construction and better access from U.S. 290 to and from Interstate 10 should address. It will also be important to see how discussions of the toll lane, or lanes, in the center proceed. Texas Department of Transportation officials are planning for just one lane, but there has been a push for at least two. Suburban transit gets serious:Part of the mobility problem faced in Houston is that many people live in outlying suburban communities and commute back in to major job centers such as the central business district and Texas Medical Center. Unable to just keep widening roads and hoping solo drivers will sort things out, more suburbs are planning transit projects. Whether it isThe Woodlands and Conroe making plans for their own serviceto bolster park and ride access, orPearland plotting its first park and ridefacility, people are talking about transit in many places that for years avoided betting on buses. Bike master plan:The other new trend taking hold in many areas of Houston is cycling, leading the city toupdate its bicycling master plan.\"The city has changed much in 20 years, the support and use of bicycling has increased significantly in 20 years, and we feel its time to revisit our planning for bicycle activities,\" Houston planning director Pat Walsh said last month. With a plan, local advocates believe they can correct many of the cycling challenges holding Houston back. Some of those efforts, however, are viewed with skepticism by drivers. City officials also plan a downtown bike lane along Lamar, set to open this year, which will connect miles of area trails. Thats abit later than they had hoped, but still a big step in cycling options. New mayor:Annise Parker is in her last year, and the campaign to replace her has already started, even if not everyone has declared. Houstons mayoral hopefuls will have a lot of topics to debate, but expect the sorry state of some city streets, Parkers push for more bike trails and the Complete Streets edict she issued to be among them. The mayor also has a big role in setting Metros agenda, by way of appointing five of the agencys nine board members. Interstate 45 widening: Work on the Gulf Freeway south of the Sam Houston Tollway, is years from completion, after years of work. Still, 2015 will be a big year for getting segments much further ahead. The widening, planned in two phases, will expand the freeway to five lanes, along with new frontage roads. Oscar Slotboom, who literally wrote the book on Houston Freeways, took some really detailed photos back in September, when the work was proceeding around Dixie Farm Road. Interstate 45 widening (the other one): Widening I-45 north of the central business district to the Sam Houston Tollway wont start for years, but the plans will take a step forward when TxDOT releases its proposal.\"In my mind that is huge,\" spokeswoman Raquelle Lewis recently said. The project is certain to have its ups and downs, since the alternatives being considered include elevating managed lanes along the freeway or sinking some of the lanes. Residents, especially those on the north side of downtown, are very concerned about the noise and smog that comes from a bigger freeway. Tomball Tollway: All of the major Houston suburbs have a major freeway to help connect folks, and Tomball is hoping to join that list. Though the city doesnt have Interstate 10 like Katy, Interstate 45 like The Woodlands or even Texas 288 like Pearland, its access via Texas 249 has helped turn it into a huge growth area. That will only accelerate, hopefully along with the speed of traffic, once the Tomball Tollway opens later this year. Though it will come at a price, officials believe the first leg fromsouth of Spring Cypress Road to just north of FM 2920 will be a catalyst for further development, though the future of Texas 249 isnt welcomed by all. Uptown BRT: The plan to put dedicated bus lanes along Post Oak Boulevard was on pace for 2014 to be a big win, then everyone got stuck in a morass similar to the traffic situation in the Uptown area. After some back and forth about $25 million in state funds for elevated lanes along Loop 610, the project receded from view during November and December. Sometime in early 2015, its either going to go forward as planned or see some changes. Expect some political posturing along the way. High-speed rail: This project has long been seen as a pipe dream, but the people behind Texas Central Railway are serious about building a bullet train between Houston and Dallas. Theyve held plenty of meetings to gauge public reaction, but the real test will come when federal officials and the private company unveil the final preferred route and start drilling down into the specifics of how to connect the two metros with a closed-off, 200-mph train line. A plan to use half of Texas motor vehicle sales tax revenues to widen and improve the roads those cars and trucks rely on passed the Texas Senate Wednesday. The proposal now moves to the House. Its expected to face more oppposition in the lower chamber than in the Senate, where it passed 28-2. Democratic Senators Rodney Ellis and Kirk Watson were opposed, citing concerns about limiting the discretion of future legislators. This creates a mandatory entitlement for transportation, Watson, of Austin, said. The plan, sponsored by Sen. Robert Nichols, R-Jacksonville, with support from Lt. Gov. Dan Patrick, directs the first $2.5 billion of sales taxes on cars, trucks and other vehicles to the general fund. The next $2.5 billion would go directly to road spending. Any revenue above $5 billion would be evenly split, Nichols said. Texas roads, clogged because of chronic underinvestment and rapid population growth, are falling further behind because local and state officials lack predictable funding that stymies their ability to plan major projects, Nichols said. By providing dedicated money, he said highway projects will be built faster because there will be more money and more ability to stagger them to avoid delays. To extend the measure beyond 2016, voters will be asked to approve a constitutional amendment in November 2016.]", "Date": "20150304", "Author": "[By Dug Begley]", "Link": "http://www.chron.com/news/transportation/article/State-senate-approves-road-spending-plan-6114713.php", "Title": "[State senate approves road spending plan]"}