{"Content": "[ Caption, Close, Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. , Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history.The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Images from the 1976 floods that resulted in the only \"rain out\" in... Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Images from the 1976 floods that resulted in the only \"rain out\" in Astrodome history. The game between the Astros and Pittsburgh Pirates on June 15, 1976 was postponed after fans, umpires and other stadium personnel couldnt enter the stadium due to flooding around the Astrodomes entrances. Astrodomes top 50 memorable moments, April 9, 1965: Opening Day, with President Johnson and Texas Gov. John Connally on hand for an Astros-Yankees exhibition game. Mickey Mantle launches the first Astrodome home run, but the Astros win, 2-1. April 12, 1965: Twenty-two NASA astronauts throw ceremonial first pitches for the Astros first regular-season game at the Dome, a 2-0 loss to the Phillies. April 28, 1965: Mets radio play by play announcer Lindsey Nelson broadcasts a 12-9 Astros win from the gondola suspended 208 feet above second base. Nov. 19, 1965:  Billy Graham, who described the Astrodome as one of the wonders of the world (which Judge Roy Hofheinz amended to Eighth Wonder of the World), begins a crusade that draws 376,419 to the Dome. Dec. 17, 1965:  Judy Garland, with the Supremes as opening act, presents the first Astrodome concert. July 19, 1966:  The Astros beat the Phillies 8-2 in the first major league game played entirely on the AstroTurf artificial surface. Nov. 14, 1966:  Muhammad Ali defends his heavyweight boxing title, knocking out Cleveland Big Cat Williams in the third round of a scheduled 15-rounder. He returns in 1967 for a 15-round decision over Ernie Terrell and in 1970 for a 12th-round TKO of Jimmy Ellis. June 18, 1967:  Rookie Don Wilson no-hits the Braves, striking out 15 in a 2-0 victory. Jan. 20, 1968:  In college basketballs Game of the Century before 52,693, Elvin Hayes leads the University of Houston Cougars past defending national champion UCLA, led by Lew Alcindor, 71-69, paving the way for basketball to become a stadium sport. July 9, 1968: Willie Mays scores the games only run as the National League wins the first baseball All-Star Game played indoors. Nov. 23, 1968:  Three years after Tulsa beat Houston in the Astrodomes first college football game, the Cougars roll 100-6 in the most recent major-college game in which a team reached a hundred points. UHs next-to-last TD is scored by future country music star Larry Gatlin. Feb. 27-March 1, 1970: Elvis Presley performs six shows at the Houston Livestock Show and Rodeo for a combined 207,494 fans. He returns for two shows on March 3, 1974, before 88,149. Jan. 7-8, 1971:  Daredevil Evel Knievel draws more than 100,000 to the Dome over two nights, each time successfully jumping his motorcycle over a record 13 cars. March 25-27, 1971:  In the first stadium-sized NCAA Final Four, UCLA beats Villanova, 68-62, for the national championship. Sept. 20, 1973:  Billie Jean King defeats Bobby Riggs in the nationally televised tennis Battle of the Sexes. Dec. 22, 1973:  The first high school championship game at the Astrodome features a future Houston favorite  Earl Campbell, who runs for 164 yards and two TDs in Tyler John Tylers 21-14 win over Austin Reagan. June 15, 1976:  The Astros and Pirates are rained in when heavy rain  10 inches were measured at the Texas Medical Center - and flooding prevents most fans from reaching the stadium. July 9, 1976:  Larry Dierker no-hits the Montreal Expos, striking out eight and walking four in a 6-0 Astros victory. Nov. 20, 1978:  In one of the most memorable \"Monday Night Football\" games, Earl Campbell runs for 199 yards and four TDs, including an 81-yarder in the fourth quarter, in the Oilers 35-30 victory over Miami. Dec. 23, 1978:  Craig James totals 19 points and runs for 168 yards, bypassing Earl Campbells single-season rushing record, in Stratfords 29-13 win over Plano for the Class 4A championship. Jan. 7, 1979:  One of the great Luv Ya Blue moments: 50,000 welcome the Oilers home from a 34-5 loss in Pittsburgh in the AFC Championship game. April 7, 1979:  Ken Forsch no-hits the Braves, 6-0, and retires 20 batters in a row between walks in the second and eighth innings. Jan. 7. 1980: After losing for a second year to the Steelers in the AFC title game, 60,000 people pack the Astrodome (another 20,000 are turned away) to hear coach Bum Phillips kick in the door speech. Alas, it proves to be the high-water mark of the Luv Ya Blue era. Oct. 11, 1980:  The mother of all doubleheaders amid one of sports greatest playoff series: After the Phillies require 3:55 to beat the Astros, 5-3, in 10 innings in Game 4 of the National League Championship Series, the Dome is switched to football configuration for the Houston-Texas A&M game, which begins at 11:33 p.m. and ends at 2:41 a.m. UH wins, 17-13. The Astros later lose Game 5 and the NLCS, also in extra innings. Sept. 26, 1981:  Nolan Ryan pitches his fifth career no-hitter, striking out 11 with three walks in a 5-0 win over the Dodgers. Oct. 28, 1981:  The Rolling Stones first visit to the Dome for a crowd of 59,865 is marred by a fatal stabbing. The group returns in 1989 and 1994. July 15, 1986:  Red Sox ace Roger Clemens is the MVP of the Astrodomes second All-Star Game, a 3-2 American League victory. Sept. 23-25, 1986:   In one of the best three-game pitching stretches in baseball history, Jim Deshaies sets a record by striking out the first eight batters Sept. 23 against the Dodgers, Nolan Ryan allows one hit with 12 strikeouts through eight innings Sept. 24 against the Giants and Mike Scott no-hits the Giants on Sept. 25 to clinch the NL West title. Oct. 11, 1986: In a game voted by MLB Network as the fifth-best game of the last 50 years, the Mets rally to beat the Astros, 7-6, in 16 innings to win the National League Championship Series, four games to two. Billy Hatchers home run off the left field foul pole in the 14th inning keeps the Astros alive, but the Mets score three in the top of the 16th, and Jesse Orosco strikes out Kevin Bass with a man on in the bottom of the 16th to end the game. July 9, 1988:  Nolan Ryan becomes the second player in history, joining Cy Young, to win a hundred games for teams in each league, winning his 100th game for the Astros in a 6-3 victory over the Mets. The Astros sixth run comes on a bases-loaded walk to rookie Craig Biggio for his first career RBI. Sept. 6, 1988: The original Astrodome scoreboard explodes one last time before being removed to add 10,000 additional seats required to keep the Oilers from moving to Jacksonville, Fla. Feb. 12, 1989: Karl Malone of the Utah Jazz is the MVP of the 39th NBA All-Star Game. The West defeats the East, 143-134, before a record crowd of 44,735. June 3-4, 1989:  The Astros beat the Dodgers, 5-4, on Rafael Ramirezs RBI single in the 22nd inning, to wrap up a game that lasts seven hours and 14 minutes  the longest night game in MLB history. A day later, they win 7-6 in 13 innings. Oct. 21, 1989: UH quarterback Andre Ware stokes his Heisman Trophy campaign by setting NCAA records for most passing yards in a quarter (340) and a half (517) in the Cougars 95-21 victory over SMU. Aug. 17-20, 1992: The Astrodome hosts the Republican National Convention, which culminates in the nomination for a second term of President George H.W. Bush and Vice President Dan Quayle, who are defeated in the November election. Sept. 8, 1993: Astros righthander Darryl Kile no-hits the Mets, retiring the last 17 batters in a row in a 6-1 victory. Jan. 2, 1994:  The Oilers close a 12-4 regular season with a 24-0 win over the Jets, but defensive coordinator Buddy Ryan takes a swing at offensive coordinator Kevin Gilbride before halftime in a defining moment for Team Turmoil. Two weeks later, the season ends with a 28-20 loss to the Chiefs in the Oilers final playoff game in Houston. Aug. 5, 1994:  En route to an MVP season in what will prove to be a strike-shortened season, Jeff Bagwell breaks team single-season records for home runs, RBIs and extra-base hits in a 12-4 win over the Giants. Dec. 17, 1994:  The first high school championship game tripleheader features John Tyler over Austin Westlake, Stephenville over La Marque and Sealy over Atlanta. Feb. 26, 1995:  Selena performs before 66,746 fans at the Houston Livestock Show and Rodeo, her final televised concert before she was shot to death in March 1995. Dec. 15, 1996: The final Oilers game at the Astrodome, a 21-13 loss to the Bengals, draws a record-low crowd of 15,131. Sept. 25, 1997: The Astros clinch their first playoff berth since 1986 with a 9-1 win over the Cubs. Dec. 13-20, 1997: Katy, Texas City, Sealy and La Marque all win football division titles on back-to-back weekends at the Astrodome, completing the most successful season for Houston teams in high school history. Aug. 7, 1998: Randy Johnson, a late-season trade acquisition from the Mariners, debuts with a five-hit shutout before 52,071 fans in a 9-0 win over the Phillies, the first of three consecutive home shutouts for the Big Unit. Oct. 3, 1999:  The Astros win their final regular-season game at the Astrodome, 9-4 over the Dodgers, to clinch the National League Central Division title. Oct. 9, 1999:  In the final Astros game at the Astrodome, the Atlanta Braves win 7-5 to wrap up the best-of-five National League Division Series, three games to one. April 1, 2001:   Stone Cold Steve Austin, aka Steve Williams of Edna, defeats the Rock, and the Undertaker, aka Mark Calaway of Houston, defeats Triple H in the headline events of Wrestlemania X-Seven before 67.925 World Wrestling Federation fans. , March 3, 2002:  George Strait sings for 68,000 fans at the Astrodomes final rodeo performance. Sept. 1-16, 2005: The Astrodome houses thousands of New Orleans residents evacuated from the storm-damaged Louisiana Superdome in the wake of Hurricane Katrina. Judge Roy Hofheinz, the man behind the Astrodomes creation, dubbed the stadium a weather-proof Eighth Wonder of the World. Only once did the Astrodome fail to live up to that designation: On June 15, 1976, heavy rains resulted in the Houston Astros postponing a match-up with the visiting Pittsburgh Pirates. Monday marked the 39th anniversary of that event as a tropical disturbance looks poised to dump several inches of precipitation on Minute Maid Park and the Houston area beginning Monday night. RELATED: System moving toward Houston could become Tropical Storm Bill, The 1976 game couldve gone on. Astros then-General Manager Tal Smith said at the time the field was dry. But fans couldnt get to the game after water flooded local streets and entrances to the Astrodome. Neither could many security members or concession workers. The umpires scheduled to work the game tried to drive to the stadium, but their car stalled in high water. They had to wade back to their hotels. Smith told the Associated Press. Only the players and team employees  who needed to arrive several hours before start time  and some 20 fans made it inside the stadium before the deluge began. Like the Christmas Truce of 1914, the two opposing sides met on the field to share a meal. Concession workers set up a buffet and tables behind second base, and both teams ate dinner on the field together, Astros official historian (authentication manager) Mike Acosta told the Chronicles Ken Hoffman in 2009. The players were in their uniforms, but some of them were wearing shower flip-flops on their feet. The Astrodome staff ate with the players, too. READ MORE: The worst floods in Houston history, The Astros organization offered refunds for the tickets that ranged in cost between $1.50 and $4.50. Because the Astros were the only team to play under a roof, their tickets were missing something that appeared on every other teams tickets: Rain checks, Hoffman wrote. The Astrodome had received a new roof prior to that season due to leakage, Hoffman noted, but that couldnt stop the lone rain out in the stadiums history. The postponement was the second for Astrodome at the time. An exhibition game was called off on April 7, 1968 as part of a day of mourning after the assassination of Martin Luther King Jr.]", "Date": "20150615", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/houston-texas/article/The-only-rainout-in-Astrodome-history-occurred-6327953.php", "Title": "[The only 'rainout' in Astrodome history occurred 39 years ago today]"}