{"Content": "[ AUSTIN -- Facing the likelihood of losing a lucrative revenue source and the possibility of being shut down entirely, the Texas horse racing industry is fighting back by targeting powerful state Senator Jane Nelson. Jan Haynes, president of an association of Texas horsemen and horsewomen, late Monday filed a complaint asking the state Department of Public Safety to investigate Nelsons role in a dispute between the Legislature and the Texas Racing Commission that could result in the commission and industry closing. \"I believe the Texas Racing Commission is being bullied and power misappropriated from Senator Nelson to the Legislative Budget Board,\" Haynes wrote in her complaint, referring to how the board -- which Nelson helps lead -- has not funded the commission in a move believed aimed at forcing the commission to repeal a lucrative racing game approved last summer. The commission has scheduled an Aug. 25 meeting to repeal the game known as \"historical racing,\" and officials expect the agency will be funded by the end of the month. \"Only the Legislature can make laws,\" Haynes wrote. \"Not individuals or a state agency. Next time, is Senator Nelson going to threaten an agency if they do not let her son or daughter into college?\", Nelsons office declined to comment on the complaint. In a statement about the dispute, the senator said it is the racing commissions fault that it has not been paid. \"The Racing Commission has yet to submit their budget request to the Legislative Budget Board, as required in the budget rider, so right now there isnt anything to approve or disapprove,\" Nelson said. \"When they do submit their request for funds, we will give it full consideration as we do all budget requests.\", A spokesman for the horse racing industry responded that the racing commission has not been told how to submit its request despite multiple pleas for guidance. The Legislative Budget Board, in turn, issued a statement saying the commission \"will get information on how to proceed\" by the end of the month. The Department of Public Safety declined to comment. The drama is the culmination of a year-long battle over \"historical racing,\" which allows players to bet on previously-run races that have been stripped of identifications. It is seen by the tracks as a necessary innovation to help them to keep up with states where more betting is allowed, but it has drawn opposition from critics who say the terminals resemble slot machines and would expand gambling here while hurting charitable bingo groups. The commissions approval of the game last summer drew condemnation from Senate Republicans, who said the agency did not have the authority to make such an authorization. A Travis County judge agreed last year, although that decision is being appealed. Meanwhile, lawmakers sought to rein in what they called a \"rogue agency\" by putting its budget under control of the Legislative Budget Board. This weeks fireworks were set off by the racing commission saying last week that it would have to shut down if the budget board did not approve a funding request by the end of the month.]", "Date": "20150811", "Author": "[Brian M .Rosenthal]", "Link": "http://www.chron.com/news/politics/texas/article/Texas-horse-industry-official-files-complaint-6437792.php", "Title": "[Texas horse industry official files complaint against senator]"}