{"Content": "[ Caption, Close, Democratic presidential candidate Hillary Rodham Clinton talks with customers during a campaign stop at the Union Diner, Thursday, Sept. 17, 2015, in Laconia, N.H. Democratic presidential candidate Hillary Rodham Clinton is seen during a campaign stop at the Union Diner, Thursday, Sept. 17, 2015, in Laconia, N.H. CONCORD, N.H. (AP)  Hillary Rodham Clinton warned congressional Republicans on Thursday that they would be endangering the economy if they shut down the federal government in an effort to block funding for Planned Parenthood. Less than a day after the Republican field gathered for their second debate, Clinton seized on promises by some of her would-be rivals to defund the womens health organization  even if the move results in a politically treacherous government shutdown. \"I would hope that the Republicans, and particularly the Republicans in the House lead by Speaker Boehner, would not put our country and our economy in peril pursuing some kind of emotionally, politically charged partisan attack,\" she said in an interview Thursday with CNN. \"That would be a very, very unfortunate decision.\", At a town hall meeting, Clinton said it was \"heartbreaking to think one more time the Republicans in Congress are thinking about shutting our government down\" over funding for Planned Parenthood. Turning to the Republican debate, she said the candidates at the three-hour forum ignored domestic issues like college debt, equal pay and stagnant wages in favor of partisan rhetoric and \"lots of bickering, lots of personal insults.\", \"It might be entertaining for some but its not going to be good for America,\" Clinton said at a Concord Boys and Girls Club. She also reiterated her impatience with ongoing deliberations by the Obama administration on whether to approve the Keystone XL pipeline, which would carry oil from Canada into the U.S. Clinton has refrained from offering her opinion on the controversial pipeline but said she could not wait too much longer. \"I am putting the White House on notice. Im going to tell you what I think soon.\", Republican leaders are trying to avoid a politically damaging government shutdown as some conservative lawmakers demand to block federal spending on Planned Parenthood. The showdown over a stopgap bill needed to keep the government open comes after the summers release of videos secretly recorded by abortion foes who say Planned Parenthood illegally profited from selling tissue from aborted fetuses to medical researchers. Planned Parenthood officials deny the allegations. Earlier, Clinton listened to the stories of people recovering from drug addiction and family members who lost loved ones to substance abuse. At a town hall meeting in Laconia, she promoted a $10 billion presidential campaign initiative to address drug and alcohol abuse, which has roiled many rural towns in New Hampshire. \"This is a disease. This is a chronic condition that has to be interrupted and treated and prevented if possible,\" Clinton said. \"Left untended, its only going to get worse. The numbers are only going to get higher.\", Clinton kicked off a three-day swing through New Hampshire as polls show her once-commanding lead over Vermont Sen. Bernie Sanders in the states 2016 primary has evaporated. In a touch of symbolism, Clinton was joined by Vermont Gov. Peter Shumlin, a Democrat who endorsed her over Sanders and has mobilized his own state against heroin and prescription painkiller abuse. Her campaign said New Hampshire Gov. Maggie Hassan would endorse Clinton on Friday at an event at the University of New Hampshire. The former secretary of state said she has been surprised by the number of people who have talked to her about painful addictions hurting families and communities. Her campaign recently rolled out plans to help states and communities offer more treatment and access to recovery centers and to shift the emphasis from incarceration to treatment. Republicans, too, addressed drug addiction in their debate Wednesday night in strikingly personal tones. GOP candidate Carly Fiorina brought up her stepdaughters 2009 death from drug abuse. \"We need to tell young people the truth. Drug addiction is an epidemic, and it is taking too many of our young people,\" she said. Former Florida Gov. Jeb Bush, who admitted that he smoked marijuana in high school, said the country faces a \"serious epidemic of drugs that goes way beyond marijuana.\", ", "Date": "20150918", "Author": "[Ken Thomas and Lisa Lerer, Associated Press]", "Link": "http://www.chron.com/news/politics/article/In-New-Hampshire-Clinton-warns-about-unchecked-6511979.php", "Title": "[Clinton warns GOP a federal shutdown would imperil economy]"}