{"Content": "[ Early voting begins today in the Nov. 6 general election, which includes 16 constitutional amendments proposed by Texas lawmakers, the city of Houstons mayoral and council elections, $805 million in bonds proposed by the Houston Independent School District, and $893 million Harris County and Port of Houston bonds. Voters in 28 other area cities, school districts and other political entities also start going to the polls today. Some area ballots will have as many as 34 items for voters to consider, Harris County Clerk Beverly Kaufman said last week. There are 33 early voting locations across Harris County, which can be found at Kaufmans Web site, www.harrisvotes.org. There are some changes to the early voting locations, Kaufman said. Voters should note that the Hobby area early voting location has returned to the IBEW Hall #66, at 4345 Allen Genoa. Voting in Kingwood will be at the Harris County Librarys Kingwood Branch at 4102 Rustic Woods and voting in far west Houston will be at the Altharetta Yeargin Art Museum, located at 901 Yorkchester. From today through Friday the early voting schedule is 8 a.m. to 4:30 p.m.; from 7 a.m. to 7 p.m. on Saturday; and from 1 p.m. to 7 p.m. Sunday. Kaufman encouraged voters to bring voter registration cards and another form of identification, such as a drivers license, to the early vote locations. Bonds and trustee elections are also big issues for voters in the Aldine, Alief, Cypress-Fairbanks, Klein, North Forest, Spring, and Spring Branch school districts. Outside Houston, voters will be choosing mayors and/or council members in Baytown, Bellaire, Seabook and Southside Place. There are 17 special district elections in the area, involving municipal utility districts or water control and improvement districts. To be eligible to vote during early voting or on Nov. 6, voters must have registered by Oct. 9. Harris County Tax Assessor-Collector Paul Bettencourt said that the records of all newly registered voters are complete, and ready for the start of early voting. \"Early voting is getting more and more popular, because people can use the next two weeks to vote on their schedules, as opposed to one day,\" Bettencourt said. \"Thats why we work so hard to make sure the voter rolls are complete. Early voting is like Election Day.\", This year, there are 1.8 million registered voters in Harris County, which is a slight dip from the peak of 1.9 million registered voters in 2004, the last presidential election year, Bettencourt said. He predicts there will be more than 2 million registered voters in Harris County for the 2008 presidential contest. Hector de Leon, director of communications and outreach for Kaufmans office, said that early voting had grown increasingly popular in Harris County. In 2004, nearly 40 percent of voters took advantage of early voting, he said. \"There are super voters, who go out and vote at every election. They tend to utilize early voting,\" de Leon said. De Leon said, however, that the early vote turnout depends on the issues. \"Obviously, when it comes to different kinds of elections, you cant compare apples to oranges,\" de Leon said. \"You cant compare a presidential election year to an election on constitutional amendments.\", \"In the beginning, obviously, we had to get the message out and it took a while before people began to utilize it,\" de Leon said. \"But every year early voting has trended up.\", anne.kilday@chron.com]", "Date": "20071022", "Author": "[ANNE MARIE KILDAY, Copyright 2007 Houston Chronicle]", "Link": "http://www.chron.com/news/houston-texas/article/Polls-opening-today-for-mayoral-bond-elections-1669854.php", "Title": "[Polls opening today for mayoral, bond elections]"}