{"Content": "[ RALEIGH, N.C. (AP)  North Carolina Sen. Richard Burr said Thursday the war on terrorism wont be successful unless the United States strategy changes from simply containing terrorist groups overseas to a more aggressive policy that also brings Middle East allies into the fight. Speaking on economic and physical security for the country and North Carolina, the Senates new Intelligence Committee chairman said current methods to defeat the Islamic State and other military wont be successful in the long run. \"The strategy that seems to be the strategy of today, now which is containment, does not work when you have a recruiting mechanism that recruits more fighters than everybody kills on a daily basis,\" Burr told a luncheon crowd of more than 100 gathered in a Raleigh skyscraper. Terror groups use zero-cost social media to find new adherents, he said. Burr said he wasnt suggesting that thousands of U.S. armed forces be sent to fight the terror groups, but rather that trust must be rebuilt among U.S. allies in the region surrounding places such as Syria and Iraq, where the Islamic State is strong. \"Lets prosecute the war against terrorism, and lets leverage not just the Kurds but everybody in the Middle East that has the potential for boots on the ground and change the landscape,\" he said. Burr, a Winston-Salem Republican seeking re-election in 2016, praised the FBI for the agencys efforts nationwide to halt potential homeland terror attacks, including those in North Carolina. Intelligence agencies now face a greater obstacle in monitoring potential terrorist activities after congressional action two months ago, according to Burr. He opposed provisions in the USA Freedom Act approved in June that prevent the National Security Agency from collecting and storing phone records. Soon the government will have to get court orders to obtain information from phone companies on specific phone numbers that could be linked to terror activities. \"We had that debate in Washington. I lost,\" Burr said. \"And now our intelligence community no longer has the tool.\" He said the U.S. and its allies have a limited amount of time before technology used by terrorists becomes so advanced that their potential actions cant be tracked through electronic data. On other topics, Burr said:,  the U.S. economy still is slow to recover from the Great Recession. He said corporate tax reform and strong commitments to protecting intellectual property and continuing the rule of law is a sure recipe to increase economic growth.  a great asset of North Carolinas economy is the number of college graduates it produces annually, which Burr said is second only to California. He said those graduates provide a ready-made workforce that will attract companies to North Carolina.  he wouldnt \"engage\" in his Senate re-election bid as a candidate until Congress recesses next summer or even later in the early fall. He said that doesnt mean he wont be raising money and putting his campaign structure in place before then. His campaign raised $1.7 million in the second quarter.]", "Date": "20150820", "Author": "[Gary D. Robertson, Associated Press]", "Link": "http://www.chron.com/news/article/NC-Sen-Burr-addressing-national-security-issues-6454992.php", "Title": "[Senator Burr worried about anti-terror strategy, technology]"}