{"Content": "[ Caption, Close, Republican U.S. Sen. Pat Toomey, of Pennsylvania, smiles while being introduced before taking the stage in a suburban Philadelphia hotel ballroom to announce that he is running for a second six-year term in office, Sunday, Sept. 13, 2015, in King of Prussia, Pa. Pennsylvania Republican U.S. Sen. Pat Toomey speaks while announcing that he is running for a second six-year term in office, Sunday, Sept. 13, 2015, in King of Prussia, Pa. Pennsylvania Republican U.S. Sen. Pat Toomey speaks while announcing that he is running for a second six-year term in office, Sunday, Sept. 13, 2015, in King of Prussia, Pa. KING OF PRUSSIA, Pa. (AP)  Republican U.S. Sen. Pat Toomey is preparing to face what could be his biggest political test yet as he runs for another term in 2016, a presidential election year, when Democrats tend to have more success getting elected in the primarily Democratic state. Toomeys announcement Sunday at a suburban Philadelphia hotel that he is running for a second term was a formality. His campaign has been up and running for months, raising millions of dollars and airing a TV ad to tout his work on legislation to make it more difficult for would-be child predators to get jobs in schools. The event, with endorsements from people in law enforcement, business and child protection advocacy, gave a look at how Toomey will characterize his four and a half years in office. As a campaign video played at the event put it, Toomey is \"getting things done for Pennsylvania\" and often working with Democrats to do it. Toomey told a crowd of more than 100 people in the hotel ballroom about his experience in the Senate, saying hes learned its difficult to get things done in Washington partly because of a polarized political environment. \"Its a challenging environment for all of us,\" he said. \"But Ive learned that it is possible to get things done if youre willing to stick to your principles but look for common ground at the same time.\", Accomplishments, according to the campaign, include working with Democrats on a package of 2012 legislation that relaxed regulations on small- and medium-size businesses to help them raise capital and grow. Toomey, 53, is popular with business, anti-tax and free-market advocacy groups. Hes framing his fiscal conservatism as a populist and bipartisan fight against wasteful spending of tax dollars and corporate welfare. That will compete with the Democrats version of a fiscal conservative who has opposed their efforts to increase the federal minimum wage and backed Republican plans in Congress to halt federal dollars for Planned Parenthood and overhaul traditional Medicare coverage into a subsidy-based health insurance option on the open market. The American Conservative Union gives Toomey a lifetime 94 rating through 2014, ranking him the second-most conservative Pennsylvania member of Congress in office last year, after U.S. Rep. Joe Pitts. After Toomeys 20-minute speech, he downplayed the notion that 2016 will be markedly more difficult for him than 2010. In 2010, Toomey narrowly won his first term, beating Democratic former U.S. Rep. Joe Sestak by 2 percentage points, when a midterm Republican wave helped the GOP pick up 69 seats in Congress. \"This is Pennsylvania, so I assume this is going to be a very competitive race,\" Toomey said. \"But we will be prepared for it. We will run strong, and Im confident were going to win.\", In a presidential election year, more registered voters turn out at the polls, and Democrats outnumber Republicans by a 4-3 ratio in Pennsylvania. Democrats believe the higher voter turnout means a better shot at winning for their candidates. The state has supported Democratic candidates for president in six straight elections. Toomey, who lives in the Allentown area, is unopposed for the Republican nomination and has a unified party behind him. A Quinnipiac University poll in June showed him leading Sestak, 47 percent to 36 percent. Including Sestak, Democrats have a field of at least three challengers seeking the partys nomination in the April 26 primary election. Sestak, a former Navy vice admiral, declared in March that he would seek a rematch with Toomey. Katie McGinty, who has held high-level posts in state and federal government, joined the hunt in August. Braddock Mayor John Fetterman said Friday that he will run. Before joining the Senate, the Harvard University-educated Toomey helped start a restaurant chain, worked in investment banking and headed the Washington, D.C.-based Club for Growth, which advocates for free markets, less government regulation and lower taxes. He also served three terms in the U.S. House, representing the Allentown area, and ran unsuccessfully for U.S. Senate in 2004, losing narrowly in the GOP primary to the late Arlen Specter.]", "Date": "20150913", "Author": "[Marc Levy, Associated Press]", "Link": "http://www.chron.com/news/article/Toomey-s-first-re-election-bid-could-be-his-6502021.php", "Title": "[Toomey's 1st re-election bid could be his biggest test yet]"}