{"Content": "[ Caption, Close, A voter prepares to cast his ballot at an early voting polling site in Austin, Texas. (AP Photo/Eric Gay), Imagine a simple voting reform that would drastically cut administrative costs, decrease the possibility of voter fraud and almost surely increase turnout. Who could be against such a reform? Candidates and officeholders who like to pick their own voters through gerrymandering and other tools to tamp down opposition turnout may be opposed, but most folks interested in seeing democracy work more effectively would endorse the reform immediately. Were talking about online voter registration. Its one of several approaches states and municipalities around the country are trying these days, and theyre getting good results. Voting by mail is another. Another is reliance on so-called election-day vote centers. Nineteen states allow citizens to register to vote online. State Rep. Carol Alvarado, D-Houston, tried to make Texas No. 20 during the recently concluded legislative session, but Republican opposition, including that of Harris County Tax Assessor-Collector Mike Sullivan, killed the bill. Those states that allow it, including conservative Utah and South Carolina and liberal Washington and Oregon, have seen higher turnouts and no problems with voter fraud. The Washington Post reports, for example, that Arizona increased registration rates among voters ages 18-24 from 29 percent to 53 percent. Theyve also experienced dramatic savings. Alvarado noted that Arizona, one of the first states to transition to online voter registration, reported the cost of a single registration dropped from 83 cents per card to 3 cents per card. Oregon and Washington have instituted universal vote-by-mail, and both states have experienced dramatic increases in turnout. Coloradans have been voting by mail since 1992; the Rocky Mountain State regularly experiences 70 percent turnout and higher. Texans, with the lowest civic participation rates in the country, cannot imagine a 70 percent turnout. Were more accustomed to a 24 percent turnout statewide for a mid-term election or a 14 percent rate in a local race, as San Antonio experienced in its recent hotly contested mayoral election. Eleven states allow voters to register and vote on Election Day. These states have come to realize that same-day registration is not only convenient for voters, but it also allows them to complete the entire process under the supervision of state election workers. And voters can more easily keep their information current in the states database.  , The Election Day voting centers are non-precinct-based polling locations. Theyre located near workplaces, schools, shopping areas or along major transit routes, and theyre designed to be more convenient than smaller neighborhood polling places. According to Rice University sociologist and voting expert Bob Stein, theyre working well in 11 Texas counties and around the country. They should be expanded. What we would like to see, now that the Legislature has finished its business in Austin until 2017, is a renewed commitment on the part of both local and statewide officials to the notion that voting is a right, not a privilege. Wed like to see them acknowledge that democracy works best when everyone participates. Instead of looking for ways to restrict voting, while decrying almost nonexistent voter fraud, wed like to see Gov. Greg Abbott or Lt. Gov. Dan Patrick or House Speaker Joe Straus appoint a citizens committee charged with finding ways to modernize voter registration, make it easier to vote and increase participation. The committees aim would be to find a more just and effective voting system, not to mention a more cost-efficient one. Thats a relatively easy way to make democracy work better, right here in the Lone Star State.]", "Date": "20150703", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Voting-rights-6364232.php", "Title": "[Voting rights]"}