{"Content": "[ Caption, Close, Secretary of State John Kerry smiles while delivering his remarks during the flag raising ceremonies at the newly reopened embassy in Havana, Cuba. Friday, Aug. 14, 2015. Kerry traveled to the Cuban capital to raise the U.S. flag and formally reopen the long-closed U.S. Embassy. Cuba and U.S. officially restored diplomatic relations July 20, as part of efforts to normalize ties between the former Cold War foes. Cubans stand along the Malecon, the avenue that runs along the seawall at the northern shore of Havana, during Secretary of State John Kerrys remarks for the raising of the U.S. flag over the newly reopened embassy in Havana, Cuba. Friday, Aug. 14, 2015. Kerry traveled to the Cuban capital to raise the U.S. flag and formally reopen the long-closed U.S. Embassy. Cuba and U.S. officially restored diplomatic relations July 20, as part of efforts to normalize ties between the former Cold War foes. U.S. Secretary of State John Kerry and Havana City Historian Eusebio Leal, peer into the interior of a classic American car  parked in Old Havana, Friday, Aug. 14, 2015. Kerry walked in the historic Plaza de San Francisco, accompanied by Leal, stopping to look in shops and greet local residents and store owners. Kerry traveled to the Cuban capital to raise the U.S. flag and formally reopen the long-closed U.S. Embassy. A worker wipes a representation of the The Great Seal of the United States at the newly opened U.S. Embassy in Havana, Cuba, Friday, Aug. 14, 2015. U.S. Secretary of State John Kerry arrived Friday morning in Havana for an historic ceremony to raise the U.S. flag over the restored U.S. Embassy in the Cuban capital. Retired Marines, from left, Gunnery Sgt. Francis Mike East, Gunnery Sgt. James Tracy, and Cpl. Larry Morris, wait to present the U.S. flag to Marines currently stationed in Cuba, during the raising of the U.S. flag over the newly reopened embassy in Havana, Cuba. Friday, Aug. 14, 2015. East, Tracy and Morris where part of the Marines that had originally lowered the American flag in 1961 and promised to return the flag. Reporters watch the raising of the American flag at the newly opened embassy in Havana, Cuba, Friday, Aug. 14, 2015. U.S. Secretary of State John Kerry traveled to the Cuban capital to raise the U.S. flag and formally reopen the long-closed embassy. Paper fans with the American flag motif sit on chairs designated for U.S. dignitaries including Secretary of State John Kerry, outside the newly opened U.S. Embassy in Havana, Cuba, Friday, Aug. 14, 2015. Kerry arrived in Havana Friday for an historic ceremony to raise the U.S. flag over a restored U.S. Embassy in the Cuban capital. Its the first time a U.S. secretary of state has visited the nearby nation since 1945. U.S. and Cuban Security Officials look toward old Chevys along the Malecon, during the flag raising ceremonies at the newly reopened U.S. Embassy in Havana, Cuba. Friday, Aug. 14, 2015. Secretary John Kerry traveled to the Cuban capital to raise the U.S. flag and formally reopen the long-closed U.S. Embassy. Cuba and U.S. officially restored diplomatic relations July 20, as part of efforts to normalize ties between the former Cold War foes. U.S. Secretary of State John Kerry gives a thumbs-up as he boards his aircraft from Andrews Air Force Base, Md. for a flight to Havana, Friday, Aug. 14, 2015. Kerry is traveling to the Cuban capital to raise the U.S. flag and formally reopen the long-closed U.S. Embassy. Cuba and the U.S. officially restored diplomatic relations July 20, as part of efforts to normalize ties between the former Cold War foes. Children look out a window from inside the newly opened U.S. Embassy, at the end of a flag raising ceremony, in Havana, Cuba, Friday, Aug. 14, 2015. U.S. Secretary of State John Kerry arrived Friday morning in Havana for an historic ceremony to raise the U.S. flag over the restored embassy in the Cuban capital. In this photo taken through a window, Cuban videographers film the U.S. flag from a crane after it was raised at the U.S. Embassy in Havana, Friday, Aug. 14, 2015. The Stars and Stripes rose over the newly reopened U.S. Embassy after a half-century of broken diplomatic relations. A man walks along the ledge of a building after hanging two giant Cuban flags, next to the US embassy, in Havana, Cuba, Tuesday, Aug. 11, 2015. The embassy will hold a ceremony on Friday, Aug. 14, to raise the U.S. flag, to mark its reopening on Havanas historic waterfront. HAVANA (AP)  A jubilant flag-raising at the reopened U.S. Embassy in Havana is giving way to serious talk about the road ahead in improving relations between the United States and Cuba. Capping off a Friday in Havana that began with the Stars and Stripes being hoisted outside the embassy, Secretary of State John Kerry met with Cuban dissidents in the evening and said the island will not see an end to the despised U.S. trade embargo if Cubas single-party government does not make progress on human rights. Cuban and U.S. negotiators are to meet in Havana in early September to begin talks on normalization of the relationship between the two countries, which includes topics ranging from maritime security to the embargo to human rights, Kerry told reporters. He said negotiations will follow three tracks. The first will encompass areas in which rapid progress is expected, such as cooperation on naval matters, climate change and the environment. The second will tackle more complex topics like the establishment of direct airline flights and U.S. telecommunications deals with Cuba. The last will take on the toughest problems, including the embargo, human rights and each countrys desire to have fugitives returned by the other. While the three tracks will proceed simultaneously, Kerry said, Cuban leaders should not expect to see progress on the embargo without improvements in civil liberties in Cuba, which does not allow independent media, political parties other than the ruling communist party or direct election of anything but low-level municipal posts. \"There is no way Congress will lift the embargo if we are not making progress on issues of conscience,\" he said. Kerry began the day with a nationally broadcast call for democratic change on the island, saying that \"we remain convinced the people of Cuba would be best served by a genuine democracy, where people are free to choose their leaders, express their ideas, practice their faith.\", Hundreds of Cubans mixed with American tourists outside the former U.S. Interests Section, newly rechristened with a sign announcing \"Embassy of the United States of America.\" They cheered as Kerry spoke, the United States Army Brass Quintet played \"The Star-Spangled Banner\" and U.S. Marines raised the flag outside the building, which overlooks the famous Malecon seaside promenade. Addressing reporters with Kerry after the ceremony, Foreign Minister Bruno Rodriguez responded by indignantly opening his remarks with complaints of U.S. human rights transgressions  from police shootings of black men to mistreatment of prisoners at Guantanamo Bay, the U.S. naval base on Cuba that the government says must be returned. \"Cuba isnt a place where theres racial discrimination, police brutality or deaths resulting from those problems,\" Rodriguez said. \"The territory where torture occurs and people are held in legal limbo isnt under Cuban jurisdiction.\", Many Cubans disagree with that assessment, including Afro-Cubans who say discrimination is still rampant despite the revolutions egalitarian ideals. Human rights groups say regular, short-term arrests and beatings of the governments critics seek to intimidate dissent. President Barack Obama also called for change in Cuba when he announced the new U.S. policy of engagement in December, but his words were less pointed than Kerrys on Friday. Cuba formally reopened its Washington embassy last month. The U.S. raised its flag in Havana then, too, though saving the formal ceremony for Kerrys visit. Three Marines who took part in lowering the U.S. flag when the embassy was closed in 1961 handed over the new flag to Marines who raised it on Friday. Kerry was the first secretary of state to visit Cuba since 1945, and his speech was remarkable for its bluntness and the national spotlight in which it came. Many Cubans lauded Kerrys call for reform, including greater access to technology on an island with one of the worlds lowest rates of Internet penetration. They paired their praise with calls for the United States to lift the 53-year-old trade embargo and allow easier travel between the two countries. \"More democracy, elections, we hope for that to come with this diplomatic opening,\" said Julio Garcia, a mechanic. Like Obama, Kerry said the longtime U.S. strategy of trying to isolate Cuba and provoke regime change by choking off trade and fomenting grass-roots agitation had failed. \"It would be equally unrealistic to expect normalizing relations to have a transformative impact in the short term,\" he said. \"After all, Cubas future is for Cubans to shape.\", Kerry briefly walked Old Havanas historic Plaza de San Francisco with City Historian Eusebio Leal, stopping to look in shops and greet residents and store owners before attending an afternoon flag-raising at the home of the embassys chief of mission. While there, he addressed a group of diplomats, Cuban-Americans and advocates of warming relations with Cuba. The event also was attended by dissidents including Jose Daniel Ferrer, Miriam Leiva and Yoani Sanchez, who tweeted a selfie of with Kerry and a photo of the secretary of state meeting privately with a group of dissidents. The dissidents were not invited to the embassy ceremony to avoid tensions with Cuban officials who typically boycott events attended by the countrys small political opposition. ", "Date": "20150818", "Author": "[Michael Weissenstein and Bradley Klapper, Associated Press]", "Link": "http://www.chron.com/news/politics/article/A-festive-flag-raising-then-tough-talk-on-6445906.php", "Title": "[A festive flag-raising, then tough talk on US-Cuba relations]"}