{"Content": "[ Caption, Close, FILE - In this June 30,2015 file photo, former Virginia Sen. Jim Webb speaks in Baltimore. On Thursday, Webb announced his campaign for the Democratic presidential nomination. FILE  President Barack Obama, accompanied by retiring Sen. Jim Webb, D-Va. left, waves to supporters during a campaign rally in Virginia Beach, Va. FILE  Sen. Jim Webb, D-Va. right, accompanied by the congressionally chartered Commission on Wartime Contracting in Iraq and Afghanistan members, gestures during the commission?s news conference on Capitol Hill in Washington in 2011. Click through the following photos to learn more about the declared 2016 presidential candidates. Jeb Bush, Ben Carson, Chris Christie, Hillary Clinton, Sen. Ted Cruz, Carly Fiorina  , Rick Perry  CAMPAIGN SUSPENDED, Rick Perry  CAMPAIGN... Marco Rubio, Sen. Bernie Sanders, Rick Santorum WASHINGTON (AP)  Jim Webb, a decorated Vietnam veteran and accomplished novelist who became a fierce critic of the Iraq war in the Senate, announced Thursday that hes challenging Hillary Rodham Clinton and other rivals for the Democratic presidential nomination. Webb, in a statement posted on his campaign website, acknowledged he would face major hurdles but vowed to bring an outsiders voice to the 2016 race, dominated by Clinton. \"I understand the odds, particularly in todays political climate, where fair debate is so often drowned out by huge sums of money,\" Webb wrote. \"I know that more than one candidate in this process intends to raise at least a billion dollars.\", But the former Virginia senator added, \"We need to shake the hold of these shadow elites on our political process\" and find fresh answers to the nations problems. Webb, 69, was a Navy secretary under Republican President Ronald Reagan who became a Democrat in response to the Iraq war that he opposed, and Clinton supported. He surprised many fellow Democrats when he became the first major figure in the party to form a presidential exploratory committee in November. Webb has outlined a campaign message centered on helping working-class Americans compete in the economy, reworking the campaign finance system and preventing the U.S. from getting involved in foreign entanglements like Iraq and Afghanistan. Webb has made frequent trips to the early voting states of Iowa and New Hampshire, but without the impact that Clinton brings to the race or Vermont Sen. Bernie Sanders unexpected success in raising campaign money and drawing crowds in his own longshot challenge. Also in the field: former Maryland Gov. Martin OMalley and former Rhode Island Gov. Lincoln Chafee. Webbs opposition to the Iraq war, in which his son Jimmy served, was key to his surprise Senate election in 2006 against Republican Sen. George Allen. While Webb chose not to seek re-election after one term, his military and foreign policy credentials could make him a debate-stage foil to Clinton, who served as President Barack Obamas secretary of state. He said in his statement that as president, he would not have urged the invasion of Iraq and, as senator, he would not have voted to authorize it in 2003, as Clinton did. Webb has said U.S. foreign policy has been \"adrift\" since the end of the Cold War and called for a new foreign policy doctrine that would outline the circumstances in which the U.S. would use military force. The ex-senator brings a unique perspective to the field. A graduate of the U.S. Naval Academy, Webb served as a company commander in Vietnam and later wrote an acclaimed novel, \"Fields of Fire,\" about the war. At the end of the war, Webb became a Republican, worked in the Defense Department and served as Navy secretary at the end of the Reagan administration. But he opposed President George W. Bushs decision to invade Iraq in 2003 and was recruited by Democrats to challenge Allen in 2006. Webbs campaign was helped by an anti-Iraq war fervor and missteps by Allen, whose campaign imploded after he called a Democratic tracker \"macaca,\" an ethnic insult. In the Senate, Webb focused on foreign affairs and veterans issues and was the driving force behind a GI Bill for post-9/11 veterans seeking to attend college after returning from Iraq and Afghanistan. He announced he would not seek re-election in 2012 and returned to writing. Webb has said he needs to raise enough money to mount a \"viable\" campaign, which could be critical to competing with Clinton and Sanders. \"Assuming he raises enough money to make a difference, then he could bring a voice that is more appealing to moderate, more rural Democrats and champion their issues,\" said Jamal Simmons, a Democratic strategist. Given Webbs military background, \"if he chooses to take on Hillary Clinton on foreign policy, he could be a real thorn in her side.\", ", "Date": "20150703", "Author": "[Ken Thomas, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Former-Virginia-Sen-Jim-Webb-to-run-for-president-6363275.php", "Title": "[Jim Webb, Iraq war critic in Senate, running for president]"}