{"Content": "[ Caption, Close, In 2011, Rick Perrys run for the White House came to a screeching halt after a major mistake on stage at a GOP debate in Rochester, Mich. Theres a whole year of campaigning, positioning and politicking to go before the next campaign for president kicks off with the Iowa Caucus in early 2016. Here are ten things to look out for next year that might tell us something about how that campaign to come (which is really already underway) may shake out. On his relationship with Judaism: ,  Im more Jewish than you think I am,\" he told the New York Times. \"I read the part of the Bible that said the Jews are Gods chosen people. Im more Jewish than...  On gays and lesbians: ,  \"I may have the genetic coding that Im inclined to be an alcoholic, but I have the desire not to do that, and I look at the homosexual issue in the same way,\" he said during an appearance at the Commonwealth Club of California. \"I may have the genetic coding that Im...  On gays and lesbians in his 2008 book: ,  \"Even if an alcoholic is powerless over alcohol once it enters his body, he still makes a choice to drink. And, even if someone is attracted to a person of the same sex, he or she still makes a choice to engage in sexual activity with someone of the same gender.\", \"Even if an alcoholic... On the age of our planet and the theory of evolution: ,  \"How old do I think the earth is? You know what? I dont have any idea. I know its pretty old. So it goes back a long, long way. Im not sure anybody actually knows completely and absolutely how old the earth is ... I hear your mom was asking about evolution and, you know, its a theory thats out there. Its got some gaps in it, but in Texas we teach both creationism and evolution in our public schools. Because I figure youre smart enough to figure out which one is right,\" he told a young boy in downtown Portsmouth. \"How old...  On former U.S. President George W. Bush: ,  George W. Bush did a incredible job in the presidency, defending us from freedom,\" he said on NBCs The Today Show. George W. Bush did...  On the 2010 Deepwater Horizon oil spill: ,  \"From time to time there are going to be things that occur that are acts of God that cannot be prevented,\" he told the Chamber of Commerce in Washington. \"From time to time...  On intelligent design: ,  \"I am a firm believer in intelligent design as a matter of faith and intellect, and I believe it should be presented in schools alongside the theories of evolution,\" he told the San Angelo Standard Times in 2010. \"I am a firm believer in intelligent...  On getting the younger vote: ,  \"Those of you that will be 21 by November the 12th, I ask for your support and your vote,\" he told college students in New Hampshire. (The voting age has been 18 since 1971), \"Those of you that will be 21 by...  On President Barack Obamas birth certificate: ,  \"Its a good issue to keep alive. Its fun to poke at him,\" he told CNBCs John Harwood.\", \"Its a good...  On U.S. Cabinet departments: ,  \"Its three agencies of government when I get there that are gone -- Commerce, Education and the, um, whats the third one there?\" he asked during the 2012 GOP presidential debate. \"Its three agencies of... AUSTIN, Texas (AP)  Texas Gov. Rick Perry would like to run for president in 2016 as a proven job-creator who modeled Texas strong economy in his own political gunslinger image and says he can do the same for the rest of the country. To do it, hell have to convince voters to forget about \"Oops.\", Its the moment when Perry, in the midst of a 2011 presidential debate, was unable to recall the third of three federal agencies hed promised to shutter, finally muttering \"oops.\" Asked about it in a recent interview with The Associated Press, Perry said, \"Thats like going back and asking a football player who dropped a pass to win the Super Bowl, Did that bother you? \", As he looks at running a second time for president, Perry, 64, is banking on his record as governor of Texas to move past \"oops.\" Its a strategy that didnt connect in the last campaign, when the governors jobs record was drowned out by that moment and other gaffes, said Ray Sullivan, a former Perry chief of staff and spokesman for his 2012 campaign. RELATED: Here are the 10 biggest things that will impact 2016, \"Our own errors on the campaign trail led to a shortened campaign,\" Sullivan said. \"So the message got overshadowed.\", Should he run again, Perry will have two more years of his time as Texas governor to try to make the case anew. His state has generated more than a third of the nations new private-sector jobs since 2001. While critics say about 6 percent of the states hourly wage earners in 2013 got minimum wage or less, fifth highest in the nation, Perry counters that this figure has fallen three straight years since 2010, when Texas rate peaked at a national high 9.5 percent. Perry credits the gangbusters state economy to low taxes, restrained regulation and caps on civil litigation damage awards, as well as improving high school graduation rates. He also oversees two funds offering economic incentives to lure top employers to Texas and repeatedly visited states with Democratic governors to poach jobs. \"Youre the chief yell leader, cheerleader,\" said Perry, who was elected yell leader, a coveted campus spirit squad post, while a student at Texas A&M University. When Waste Connections, Inc. was looking to relocate its headquarters from east of Sacramento in 2011, CEO Ronald Mittelstaedt received calls from both Perry and fellow Republican Gov. Brian Sandoval of Nevada. RELATED: GQ has an unflattering award for Texas outgoing governor, \"Governor Perry, he is a very down-to-earth, easy to talk to man,\" said Mittelstaedt, whose company eventually moved about 100 employees to suburban Houston. John W. Harrington was laid up after back surgery in 2013 when he heard frequent recruitment radio ads featuring Perry. He soon transplanted his gun shop from California, to Shiner, Texas, a town otherwise famous for its brewery. \"Rick and guns, thats kind of the epitome of what Texas is all about,\" said Harrington, who held a ribbon-cutting barbeque with Perry. Perrys penchant for guns  he once famously shot a coyote while jogging in a rural corner of Austin in 2010  helped solidify his image as a cowboy governor long before \"oops,\" and the personal role he plays in administering the incentive funds and recruiting jobs so aggressively for Texas have ensured much of the same sentiment has rubbed off on the states economy. The incentive funds the governor oversees, though, have been savaged by state auditors. They found that The Texas Enterprise Fund, offering deal-closing money to top business and employers, had awarded $222 million to 11 firms and universities that either didnt apply for the funding or werent required to directly create jobs. And Perrys Texas Emerging Technology Fund is supposed to bolster high-tech startups, but some firms havent filed tax reports or made questionable job claims. RELATED: All the Rick Perry memes you ever needed, Both also have given money to firms linked to Perry donors, drawing \"crony capitalism\" complaints from conservative activists. But Perry dismissed that: \"I consider myself to be very much an adherent to most of the tea partys philosophical positions.\", Meanwhile, Texas leads the nation with about a quarter of residents lacking health insurance, and had the countrys highest annual total of workplace fatalities nine times during Perrys tenure. \"The bragging that he has engaged in about the Texas miracle is going to come under very strict scrutiny and I think people are going to see its not what he claims it to be,\" said Gilberto Hinojosa, chairman of the Texas Democratic Party. Beyond the questions related to how much credit Perry deserves for the Texas economy, and about \"oops,\" he will also be forced to contend with worries about his felony indictment. The left-leaning government watchdog group Texans for Public Justice filed a complaint in 2013 when Perry publicly threatened  then made good on  a veto of state funding for public corruption prosecutors, following the Democratic head of the units drunken driving conviction. In August, an Austin grand jury indicted the governor for abuse of official capacity and coercion of a public servant. RELATED: 10 people to watch for as the 2016 race heats up, Perry insists most Americans believe he did nothing wrong and that the case wont affect any possible presidential aspirations. He concedes that \"oops\" might, but is hoping voters see it as a test of character. \"Its easier to judge someone by how they get up from a failure when theyve been knocked down,\" Perry said. \"Being tested is a good thing.\"]", "Date": "20150115", "Author": "[Will Weissert, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Rick-Perry-Jobs-juggernaut-meets-Governor-Oops-5989079.php", "Title": "[Rick Perry: Jobs juggernaut meets 'Governor Oops']"}