{"Content": "[ Caption, Close, The fraternity of men whove held the title of President of the United States is full of notable orators including Obama, JFK and Lincoln. But are their speeches on the same level? Click through to compare some famous speeches based on their reading grade level. George Washington: First Inaugural Address, April 30, 1789Reading grade level: 21Source: Vocativ, Abraham Lincoln: Gettysburg Address, Nov. 19, 1863Reading grade level: 11.2Source: Vocativ, Theodore Roosevelt: Fifth annual message, Dec. 5, 1905Reading grade level: 16.9Source: Vocativ, Franklin Delano Roosevelt: First fireside chat on the banking crisis, March 12, 1933Reading grade level: 10.9Source: Vocativ, John F. Kennedy The goal of sending a man to the Moon, May 25, 1961Reading grade level: 13.5Source: Vocativ, Lyndon B. Johnson: Remarks upon signing the Civil Rights Act, July 2, 1964Reading grade level: 8.9Source: Vocativ, Richard Nixon: Remarks on departure from the White House, Aug. 9, 1974Reading grade level: 7.2Source: Vocativ, Ronald Reagan: Address at the Brandenburg Gate (Berlin Wall), June 12, 1987Reading grade level: 9.6Source: Vocativ, Bill Clinton: Second inaugural address, Jan. 20, 1997Reading grade level: 8.6Source: Vocativ, George W. Bush: Address to the nation, Sept. 11, 2001Reading grade level: 8.1Source: Vocativ, Barack Obama: Speech on ISIS threat, Sept. 10, 2014Reading grade level: 10.8Source: Vocativ, Uneasy lies the head that wears the crown , , Barack Obama - 2013, , Barack Obama - 2015   , , Bill Clinton - 1996     Stressed Out POTUS, Lincoln. JFK. Obama. Many people have admired the oratory skills of the men who have held the presidency. But is the content of their popular speeches as sophisticated as weve come to know?, Vocativ, a media company specializing in garnering data from the \"deep web,\" took more than 600 presidential addresses from George Washington to Barack Obama and analyzed them against the Flesch-Kincaid readability test, a comprehension algorithm. Many speeches given before 1850 achieved a reading level grade of 21, equivalent to a PhD. The last speech to reach that level was delivered by Woodrow Wilson in 1917. On the opposite end of the spectrum, the lowest reading grade level goes to President George H.W. Bush with his 1989 inaugural address which received a grade of 5.9. Speeches have gotten longer over time, but theres also a general trend of speeches declining on the grade level scale. The data also finds while President George W. Bush was often criticized for his speeches, President Obamas are comparable to his predecessor in terms of reading grade level. Find out what grade level some of the most famous presidential speeches are by clicking through the slideshow above. ]", "Date": "20141014", "Author": "[By Maribel Molina]", "Link": "http://www.chron.com/news/politics/article/Chart-shows-gradual-decline-in-reading-level-of-5822412.php", "Title": "[Chart shows gradual decline in reading level of presidential speeches]"}