{"Content": "[ Caption, Close, Former Texas Gov. Rick Perry gets his makeup retouched during a break in the early Fox News presidential forum. Republican presidential candidate former Texas Gov. Rick Perry speaks during a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015, in Cleveland. Seven of the candidates have not qualified for the prime time debate. Republican presidential candidates Louisiana Gov. Bobby Jindal, left, and former Texas Gov. Rick Perry, right, speak on stage during a commercial break during a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015,  in Cleveland. Seven of the candidates have not qualified for the primetime debate. Republican presidential candidate businesswoman Carly Fiorina stands on stage for a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015,  in Cleveland. Seven of the candidates have not qualified for the primetime debate. Republican presidential candidate former Texas Gov. Rick Perry, right, speaks during a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015,  in Cleveland. Seven of the candidates have not qualified for the primetime debate. Republican presidential candidate Lindsey Graham speaks during a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015, in Cleveland. Seven of the candidates have not qualified for the primetime debate. Republican presidential candidates from left, Jim Gilmore, Lindsey Graham, Bobby Jindal, Rick Perry, Rick Santorum, Carly Fiorina, and George Pataki take the stage for a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015,  in Cleveland. Seven of the candidates have not qualified for the primetime debate. Bob Kunst of Miami Beach, Fla. wears a Hillary Rodham Clinton mask and holds an anti-Hillary poster outside the Quicken Loans Arena in Cleveland, Wednesday, Aug. 5, 2015, before Thursdays first Republican presidential debate being held at the arena. Republican presidential candidate former Pennsylvania Sen. Rick Santorum speaks during a pre-debate forum at the Quicken Loans Arena, Thursday, Aug. 6, 2015, in Cleveland. Seven of the candidates have not qualified for the prime time debate. Click through the following photos to learn more about the declared 2016 presidential candidates. Jeb Bush, Ben Carson, Chris Christie, Hillary Clinton, Sen. Ted Cruz, Carly Fiorina  , Rick Perry  CAMPAIGN SUSPENDED, Rick Perry  CAMPAIGN... Marco Rubio, Sen. Bernie Sanders, Rick Santorum CLEVELAND - Rick Perry didnt make the main stage in the first GOP presidential debate, but he seized a moment that was given to him to take aim at Donald Trump and try to persuade voters he is ready to be president. Perry, as the top-seeded candidate on Fox News undercard debate, used his center stage position to take the first shot at Trump, the front-runner who has dominated the run-up to the debate. \"When you look at the celebrity of Donald Trump, then I think that says a lot about him,\" Perry said. Echoing his outspoken criticism of Trump on the campaign trail, Perry recalled that he has \"talked about Donald Trump from the standpoint of being an individual who was using his celebrity rather than his conservatism.\", Perry singled out the billionaire for his past support for a single-payer, government health care system, and talked up his own record strengthening the border with Mexico. \"We need a president that doesnt just talk a good game, but a president thats got real results.\", The former Texas governor and a half-dozen other GOP hopefuls who did not qualify for the prime time event took part in the hour-long undercard debate. Thoughtful discussion, Perry and the others were relegated to second-tier status after placing outside the top ten contenders in the average of five recent national polls. Perry (1.8 percent) placed 11th behind Ohio Gov. John Kasich (3.2 percent) but ahead of the others on the stage at the early debate. Perrys poor showing in recent polling was a significant blow to his campaign at a time when GOP primary voters and uncommitted donors are focusing intently on the presidential campaign. A Perry adviser said the initial debate, absent Donald Trump and the predicted theatrics of the main debate, would provide a forum for \"a thoughtful discussion.\", At times it did, on issues ranging from immigration, to Planned Parenthood to the threat of terrorism and the Islamic State. Also on stage dubbed the Happy Hour Debate: Former Pennsylvania Sen. Rick Santorum; Louisiana Gov. Bobby Jindal; former Hewlett-Packard executive Carly Fiorina; South Carolina Sen. Lindsey Graham; former New York Gov. George Pataki and former Virginia Gov. Jim Gilmore. Early on, Perry was challenged on his lackluster performance in his first presidential campaign four years ago, a candidacy that he has acknowledged he wasnt ready for. \"After four years, looking back, and being prepared - the preparation to be the most powerful individual in the world requires an extraordinary amount of work,\" he said. Reagan gaffe?, Though halting in some of his answers, Perry avoided the sort of debate pitfall that helped sink his 2012 campaign, although at one point, in invoking Ronald Reagan, he appeared to pronounce the former presidents name as Ronald Raven. As he often does, Perry cited his experience as governor of Texas - the 12th largest economy in the world - where he took credit for adding 1.5 million jobs during the recession. \"I will suggest to you nobodys done it like Rick Perry has done it over the last eight years,\" he said. Perry and the others condemned the recent deal with Iran aimed at stopping that nations nuclear weapons program and criticized the Obama administrations response to the spread of the Islamic State group, also known as ISIS. Graham said that any GOP contender unwilling to put troops on the ground in the fight with ISIS is not suited for the presidency. \"If we dont stop them over there, they are coming here just as sure I stand here in front of you,\" he said. Perry said as president he would swiftly tear up the deal with Iran, offering a compliment to Fiorina in the process. \"I would whole lot rather have Carly Fiorina over there doing our negotiation, than John Kerry,\" he said. Perry was primed to seize the moment on immigration, one of the strong suits in his campaign. He said Americans are tired of the inability to secure the border. In an unusual slight to Republican icon Reagan, Perry said the problem dates back to a law Reagan signed in 1986, which Perry characterized as \"amnesty for 4 million people.\", \"If you elect me president of the United States, I will secure that southern border,\" he said. , , ]", "Date": "20150806", "Author": "[By Bill Lambrecht and Kevin Diaz]", "Link": "http://www.chron.com/news/houston-texas/houston/article/In-undercard-GOP-debate-Perry-hits-Trump-touts-6429997.php", "Title": "[In undercard GOP debate Perry hits Trump, touts immigration record]"}