{"Content": "[ Caption, Close, Democratic presidential candidate, Sen. Bernie Sanders shakes hands with supporters after speaking at a political rally in Madison, Wis. Wednesday, July 1, 2015. (Michael P. King/Wisconsin State Journal via AP), From left, Sam Brueggeman, 16, and his parents Bill and Carol, of North Freedom, Wis. lead a cheer while waiting for Democratic presidential candidate Sen. Bernie Sanders to arrive at the Veterans Memorial Coliseum at Alliant Energy Center in Madison, Wis. Wednesday, July 1, 2015. (Michael P. King/Wisconsin State Journal via AP), Supporters of Democratic presidential candidate Sen. Bernie Sanders look at the selection of buttons as they arrive for a political rally at the Veterans Memorial Coliseum at Alliant Energy Center in Madison, Wis. Wednesday, July 1, 2015. (Michael P. King/Wisconsin State Journal via AP), Joseph Strom of Elgin, Ill. waits to hear Democratic presidential candidate Sen. Bernie Sanders speak at a political rally at the Veterans Memorial Coliseum at Alliant Energy Center in Madison, Wis. Wednesday, July 1, 2015. (Michael P. King/Wisconsin State Journal via AP), Gail Christensen, of Lake Mills, Wis. cheers as Democratic presidential candidate Sen. Bernie Sanders speaks during a political rally in Madison, Wis. Wednesday, July 1, 2015. (Michael P. King/Wisconsin State Journal via AP), Democratic presidential candidate Sen. Bernie Sanders speaks during a political rally in Madison, Wis. Wednesday, July 1, 2015. (Michael P. King/Wisconsin State Journal via AP), MADISON, Wis. (AP)  Democratic presidential candidate Bernie Sanders touted his progressive credentials before his largest crowd to date Wednesday night as he pushed his campaign into Wisconsin Republican Gov. Scott Walkers backyard. Sanders packed the Veterans Memorial Coliseum in Madison, filling its 10,000 seats to show his bid to snatch the Democratic nomination from front-runner Hillary Rodham Clinton isnt a longshot after all. \"Tonight we have made a little bit of history,\" the white-haired Sanders said at a podium positioned between Wisconsin and United States flags at the outset of his hourlong speech before a boisterous crowd. \"Tonight, we have more people at any meeting for a candidate of president of the United States than any other candidate.\", Sanders, a 73-year-old self-described democratic socialist, is trying to appeal to the most liberal Democrats with his message of raising the minimum wage to $15 an hour, bridging the gap between rich and poor, criminal justice reform and raising taxes on the wealthy and Wall Street. The message resonated in Madison, the states reliably liberal capital and home to the University of Wisconsin. And it stood as a sharp contrast to Wisconsins own conservative White House hopeful Walker, who is preparing to enter the crowded field of GOP candidates. The governor is expected to make his announcement on or shortly after July 13. Sanders immediately went after Republicans and Walker, who made his name restricting collective bargaining rights for public workers. \"When you deny the right of workers to come together in collective bargaining, thats extremism,\" Sanders said to rousing cheers. \"When you tell a woman that she cannot control her own body, thats extremism.\", Walker, whom the crowd loudly booed whenever Sanders mentioned his name, criticized Sanders in a statement issued Wednesday in advance of the speech. \"Bernie Sanders is right about one thing: We dont need another Clinton in the White House,\" Walker said. \"On virtually every other issue, however, he stands in stark opposition to most Americans. Wisconsinites have rejected his top-down, government-knows-best approach three times in the last four years.\", Walkers statement is a reference to his three election victories since 2010. He won election, defeated a recall in 2012 and then won re-election. His victories have helped fuel his all-but-certain run for the White House. Sanders has built his underdog campaign to succeed President Barack Obama on blunt talk about the economy. In addition to advocating a $15-an-hour minimum wage and raising taxes on the rich, he also supports a massive government-led jobs program to fix roads and bridges, a single-payer health care system, an expansion of Social Security benefits and debt-free college. \"The big money interests  Wall Street, corporate America, all of these guys   have so much power that no president can defeat them unless there is an organized grassroots movement making them an offer they cant refuse,\" Sanders said. The message resonated with the welcoming crowd, many of whom gathered at the state Capitol four years ago to protest against Walker and his move against unions. \"Hes reminiscent of Obama in that he breaks the mold of what weve seen election after election with presidential candidates,\" said Savannah Kramas, a 26-year-old health care worker from Mosinee. Kramas said she likes Clinton but wants to hear more about her positions. \"I think Sanders has the benefit of being a little more obscure, so he can say what he wants,\" Kramas said. ", "Date": "20150701", "Author": "[Scott Bauer, Associated Press]", "Link": "http://www.chron.com/news/politics/article/In-Wisconsin-Sanders-hopes-to-find-like-minded-6361492.php", "Title": "[In Wisconsin, Sanders appeals to like-minded liberals]"}