{"Content": "[ Caption, Close, Republican presidential candidate, Sen. Marco Rubio, R-Fla. speaks at an outdoor restaurant in the Santurce district of San Juan, Puerto Rico, Friday, Sept. 4, 2015. The U.S. territory must find its own way to get its financial house in order, Rubio wrote in an op-ed published in Spanish Friday in El Nuevo Dia, Puerto Ricos largest newspaper. The Florida Republican opposes efforts to allow Puerto Rico to use bankruptcy laws to deal with a staggering $72 billion debt. (Carlos Giusti/El Vocero via AP Photo) PUERTO RICO OUT, Republican presidential candidate, Sen. Marco Rubio, R-Fla. right center, poses for a photo with a supporter at an outdoor restaurant in the Santurce district of San Juan, Puerto Rico, Friday, Sept. 4, 2015. The U.S. territory must find its own way to get its financial house in order, Rubio wrote in an op-ed published in Spanish Friday in El Nuevo Dia, Puerto Ricos largest newspaper. The Florida Republican opposes efforts to allow Puerto Rico to use bankruptcy laws to deal with a staggering $72 billion debt. (Carlos Giusti/El Vocero via AP Photo) PUERTO RICO OUT, Republican presidential candidate, Sen. Marco Rubio, R-Fla. speaks to supporters at an outdoor restaurant in the Santurce district of San Juan, Puerto Rico, Friday, Sept. 4, 2015. The U.S. territory must find its own way to get its financial house in order, Rubio wrote in an op-ed published in Spanish Friday in El Nuevo Dia, Puerto Ricos largest newspaper. The Florida Republican opposes efforts to allow Puerto Rico to use bankruptcy laws to deal with a staggering $72 billion debt. (Carlos Giusti/El Vocero via AP Photo) PUERTO RICO OUT, SAN JUAN, Puerto Rico (AP)  Puerto Ricos financial crisis loomed over dueling Friday campaign appearances by Democrat Hillary Rodham Clinton and Republican Marco Rubio, two presidential contenders with sharply different positions on a key issue for Puerto Rican voters whose influence is growing in U.S. politics. In a speech delivered entirely in Spanish, Rubio blamed Clinton supporters for the U.S. territorys economic problems as he railed against giving Puerto Rico bankruptcy protection to resolve a staggering $72 billion debt. \"The people who are rallying behind her today are the people who put Puerto Rico in this fiscal mess to begin with,\" the young Florida senator told about 150 people crammed into an open-air restaurant in San Juans gritty neighborhood of Santurce. Clinton, who won Puerto Ricos 2008 Democratic primary election, defended her support for giving Puerto Rico bankruptcy protection during a round-table discussion focused on the islands health-care problems. She took an indirect shot at Rubio, charging, \"You cant fix your economy through austerity.\", \"Not a single Republican in Washington has stepped up to support Puerto Rico,\" she told an invitation-only crowd gathered in the islands largest hospital. Some Republicans describe Clintons policy prescription as a bailout, although others  among them former Florida Gov. Jeb Bush  share her position. Rubio said the island faces multiple challenges, but remained firm that allowing its municipalities and agencies to declare bankruptcy is not the answer. \"I dont believe Chapter 9 would solve Puerto Ricos problems,\" he said, adding that the island has spent more money than it had available. \"Ultimately, if there is no other option left, Chapter 9 is a viable option at that point.\", Asked about Clinton at a brief news conference after his speech, Rubio said he didnt have details about her plan for Puerto Rico. \"I think it was on her server, and it was wiped clean,\" he jabbed, a reference to the Clinton email server that is now the subject of a federal investigation. The debate could have 2016 implications, even though Puerto Rican residents cant vote for president despite being U.S. citizens. The U.S. territory holds primary contests for both parties that give candidates a chance to connect with Hispanic voters across the nation. Five million Puerto Ricans live on the U.S. mainland, including nearly 1 million in the key swing state of Florida, and they care about what happens back on the island. Bush visited in April before announcing his Republican presidential campaign and was warmly received as he praised the contributions of immigrants and endorsed statehood, a long-running issue for generations of Puerto Ricans, many of whom feel like second-class citizens because of their limited voting rights. Martin OMalley, a Democrat and former Maryland governor who visited last month, pledged to fight for equal treatment, noting that Puerto Rico gets lower Medicaid and Medicare reimbursement rates than the mainland, an issue also on Clintons agenda. At the round-table discussion, Clinton, with pen and notepad in hand, said she came to \"listen\" and asked questions about reimbursement rates under Medicaid and Medicare, the exodus of doctors from the island and the lack of access Puerto Rican veterans have to full health-care coverage. \"You cant solve the health care crisis without addressing the economic crisis,\" she said. The parade of presidential hopefuls to the territory speaks to the growing power of Puerto Rican voters on the mainland, especially in Florida, the top destination for those fleeing the islands 12 percent unemployment rate and nine-year economic slump. The governor declared the massive public debt unpayable and said it needs restructuring. Historically, Puerto Ricans have sided with Democrats. But Republicans say they do see an opening, at least with recent arrivals, and have been going into Puerto Rican communities for several years to woo potential voters. Gregorio Matias, a 43-year-old police sergeant, said he decided to fully support Rubio on Friday after reading the Florida senators op-ed opposing bankruptcy protection in the islands largest newspaper. \"Im going to call all my relatives and tell them to vote for Rubio,\" he said, adding that they live in Florida, New York, New Jersey and Wisconsin. \"Rubio offers what Puerto Rico has been waiting for: that we be treated as equals, not as third-class citizens.\"]", "Date": "20150906", "Author": "[Sergio Bustos and Danica Coto, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Puerto-Rican-voters-prized-by-Democrats-6484653.php", "Title": "[Clinton, Rubio court Puerto Rico voters as crisis looms]"}