{"Content": "[ Caption, Close, Rev. Eliezer Bonilla, left, watches as Jeb Bush, center, shakes hands with Rev. Samuel Rodriguez, president of the National Hispanic Evangelical Association, after Bush spoke at the National Hispanic Christian Leadership Conference at Crowne Plaza Houston, 8686 Kirby Drive, Wednesday, April 29, 2015, in Houston. Inter, Jeb Bush speaks at the National Hispanic Christian Leadership Conference at Crowne Plaza Houston, 8686 Kirby Drive, Wednesday, April 29, 2015, in Houston. Former President George H. W. Bush and his wife, Barbara, listen as their son, Jeb Bush, speaks at the National Hispanic Christian Leadership Conference at Crowne Plaza Houston, 8686 Kirby Drive, Wednesday, April 29, 2015, in Houston. Jeb Bush speaks at the National Hispanic Christian Leadership Conference at Crowne Plaza Houston, 8686 Kirby Drive, Wednesday, April 29, 2015, in Houston. Jeb Bush speaks at the National Hispanic Christian Leadership Conference at Crowne Plaza Houston, 8686 Kirby Drive, Wednesday, April 29, 2015, in Houston. Jeb Bush speaks at the National Hispanic Christian Leadership Conference at Crowne Plaza Houston, 8686 Kirby Drive, Wednesday, April 29, 2015, in Houston. The Bush family is one of the most influential dynasties in American politics. Beginning with Prescott Bush, the clan has produced two presidents, and on Tuesday, Jeb Bush, the former governor of Florida announced that he aims to become the third. Take a closer look at how the familys power has expanded over four generations. 1950: Prescotts failed Senate bid, 1952: Prescott elected to U.S. Senate, 1964: George H.W.s Senate run, , 1978:George W. runs for Congress, , 1989:George H.W. becomes president, 1994: George W. runs for governor, 1994: Jeb runs for governor, 1998:Jeb elected governor, 2001:George W. elected president, 2014:George P wins statewide office, 2014:Jeb running for president, As Republican presidential hopefuls vie for the support of Latino voters, likely candidate Jeb Bush courted a group of Hispanic evangelicals in Houston Wednesday, underscoring his belief in the need for immigration reform and touting his record on education. \"We have the ability because of immigration to be an emerging country again  to be full of optimism, to believe that our future is brighter than our present,\" the former Florida governor said in a bilingual address to the National Hispanic Christian Leadership Conference. \"But we have to fix a broken immigration system and do it in short order.\", Bush outlined a plan that included border control, facilitating legal immigration and creating a mechanism for undocumented workers to earn legal status. His remarks point to the importance of Hispanic voters to Republicans in the 2016 presidential race, particularly in a campaign in which two other candidates  U.S. Sens. Ted Cruz, R-Texas, and Marco Rubio, R-Fla.  actively are courting both Hispanics and evangelicals. Bushs parents, former president George H.W. Bush and former first lady Barbara Bush, were also in attendance, their presence making Bush \"a little intimidated,\" he joked.]", "Date": "20150429", "Author": "[By Rebecca Elliott]", "Link": "http://www.chron.com/news/politics/us/article/Bush-in-Houston-to-talk-about-education-standards-6231186.php", "Title": "[Bush talks education, immigration reform in Houston]"}