{"Content": "[ Caption, Close, Will Ferrell, actor/comedian, Justin Long, actor, Sarah Silverman, comedian, Jeremy Piven, actor/producer, Mark Ruffalo, actor/director/producer, Steve Wozniak, the co-founder of Apple Computer, Juliette Lewis, actress, Justin Bartha, actor, Patton Oswalt, actor/comedian, John Densmore (left), of The Doors, George Wendt, actor, David Koechner, actor/comedian, Danny DeVito, actor, Maragaret Cho, comedian/author/artist, Alex Ebert, of Edward Sharpe and the Magnetic Zeros, Breckin Meyer (right), actor, Brad \"Scarface\" Jordan, musician/music producer/author, Steve Earle, musician, Flea, Chad Smith, Anthony Kiedis and Josh Klinghoffer, of the Red Hot Chili Peppers, Zo Kravitz, actress, Lucinda Williams, musician, Loudon Wainwright III, musician, Brian Baker,of Bad Religion, Ben Foster, actor, Wil Wheaton (left), actor, Serj Tankian (left), of System of Down, David Crosby, musician, Belinda Carlisle (middle), of the Go-Gos, Jeff Tweedy (front center), of Wilco, Hunter \"Patch\" Adams, founder of the Gesundheit! Institute and subject of the movie \"Patch Adams\", Its not often you get to group Will Ferrell, Apple co-founder Steven Wozniak, Scarface of Geto Boys, every member of the Red Hot Chili Peppers and that kid who had an unfortunate mishap with leeches in \"Stand By Me\" into the same category. But now you can. They were among the celebrities who issued a letter backing Bernie Sanders as the 2016 Democratic Nominee for President of the United States. Thesmorgasbord of names signed on to the letter ranges from A-listers to academics to people youd have to Google figure out where you remember that name from. See the random group of celebrities endorsing Bernie Sanders in the slideshow above. The endorsement reads:, \"We  the undersigned artists, musicians, and cultural leaders of America  are excited to endorse a new vision for our country. Its a vision that pushes for a progressive economic agenda. Its a vision that creates jobs, raises wages, protects the environment, and gets big money out of politics. We endorse Bernie Sanders to become the 2016 Democratic Nominee for President of the United States of America. Sincerely, The Artists and Cultural Leaders for Bernie Sanders\", The letter comes amid his fight against a report by the Wall Street Journal which claimed Sanders proposals would cost about $18 trillion.]", "Date": "20150921", "Author": "[Jessica Hamilton]", "Link": "http://www.chron.com/news/politics/election/article/A-pretty-random-group-of-celebrities-is-endorsing-6519162.php", "Title": "[A pretty random group of celebrities is endorsing Bernie Sanders for president]"}