{"Content": "[ Sen. Ted Cruz plans to announce Monday that he will run for president of the United States, according to his senior advisers, accelerating his already rapid three-year rise from a tea party insurgent in Texas into a divisive political force in Washington. Cruz, scheduled to speak Monday at a convocation ceremony at Liberty University in Virginia, will not form an exploratory committee but rather launch a presidential bid outright, said advisers with direct knowledge of his plans, who spoke on condition of anonymity because an official announcement had not been made yet. They say he is done exploring and is now ready to become the first Republican presidential candidate. Over the course of the primary campaign, Cruz will aim to raise between $40 million and $50 million, according to advisers, and dominate with the same tea party voters who supported his underdog senate campaign in 2012. But the key to victory, Cruz advisers believe, is to be the second choice of enough voters in the partys libertarian and social conservative wings to cobble together a coalition to defeat the chosen candidate of the Republican establishment. The firebrand Texan may have few Senate colleagues who will back his White House bid, but his appeal to his partys base who vote disproportionately in Republican primaries could make him competitive in Iowa and beyond. Yet critics of Cruz argue that he will have trouble raising high-dollar donations from traditional contributors, will land few endorsements from the nations political establishment and be unable to escape comparisons to President Barack Obama, who also ran for president in his first Senate term. And if he advances to a general election, Cruz trails likely Democratic nominee Hillary Clinton solidly in early public opinion polls. \"I dont consider him a mainstream candidate, and usually to win youve got to be inside the 45-yard lines,\" said Greg Valliere, a political adviser to Wall Street firms who believes that if Cruz did earn the nomination, he would not win more than a dozen states in the general election. \"The enthusiasm for him will be tremendous in maybe a third of the party, but another third of the party will be strongly opposed and another third of the party will be wary.\", Senior advisers say Cruz will run as an unabashed conservative eager to mobilize like-minded voters who cannot stomach the choice of the \"mushy middle\" that he has ridiculed on the stump over the past two months in Iowa, New Hampshire and South Carolina. \"Ted is exactly where most Republican voters are,\" said Mike Needham, who heads the conservative advocacy group Heritage Action for America. \"Most people go to Washington and get co-opted. And Ted clearly is somebody that hasnt been.\", Upon arriving in Washington, D.C. Cruz discarded the expectation of deference that accompanies a freshman senator, launching frequent one-man stands to stymie congressional Democrats and Republicans alike. After Cruz led a shutdown of the federal government in October 2013 as part of an effort to repeal the Affordable Care Act, conservative activists flocked to their new hero even as Republican leaders excoriated him. For Cruz, 44, Mondays planned announcement will culminate two years of open musing about running for president that began nearly the moment voters elected him to the Senate in 2012. Only a month later, as senator-elect, Cruz established a political action committee to back conservative candidates nationwide. During his first congressional summer recess, he was already visiting Iowa. And over the past seven months, the Jobs, Growth and Freedom PAC has added a coterie of nationally experienced political operatives to the 2012 team of Texas strategists who engineered the surprise dethroning of Lt. Gov. David Dewhurst in the Republican primary. Joining the team Monday will be Cruzs wife, Heidi, a managing director at Goldman Sachs in Houston, who will take leave from the firm and accompany her husband on the campaign trail.]", "Date": "20150321", "Author": "[By Theodore Schleifer]", "Link": "http://www.chron.com/news/politics/us/article/Ted-Cruz-to-announce-presidential-bid-Monday-6150890.php", "Title": "[Ted Cruz to announce presidential bid Monday]"}