{"Content": "[ When Mike Huckabee accused President Barack Obama of forging a nuclear deal with Iran that would lead Jews to the \"oven door,\" Jeb Bush made use of the moment. He could have asserted his pro-Israel credentials in different language. Or, sensing little gain in the transaction, he might have simply reiterated his condemnation of the administrations Iran policy. Instead, Bush used the occasion to reinforce his own distance from his partys flammable fringe. \"Look, Ive been to Israel - not as many times as Mike Huckabee, who I respect,\" Bush said to MSNBC on Monday. \"But the use of that kind of language, its just wrong. This is not the way were going to win elections, thats not how were going to solve problems.\", A good way to tell the Republican base that you share their values even if you dont speak their language is to signal concern that blunt talk will prove self-defeating - costing votes in the general election. Thats what Bush said; then he said something more interesting: that rhetoric like Huckabees is \"not how were going to solve problems.\", Solving problems is not high on the bases list of priorities, judging by the robust level of support for Donald Trump. The billionaires invective-laden, policy-free and fact-challenged campaign has proved an effective conduit for rage. But Trump scarcely even pretends to be in the solutions business. Bush strategy is grown-upism, In one of the most remarkable political comments of recent years, Bush said last fall that a Republican candidate had to be willing to lose the primary to win the general election. Bush didnt have to explain why. His premise was widely understood as an expression of concern about his partys affinity for candidates promising a demolition derby in Washington. So far, hes running as if he meant it. Bushs strategy might be called grown- upism. He doesnt just turn down invitations to stoke anger; he treats them as opportunities to show restraint. Trumps emergence appears to be aiding him. Trump hasnt simply shut off attention to competitors. He has, for the moment, locked down a group of voters who might ultimately make their way to a more viable Bush competitor, especially Wisconsin Gov. Scott Walker. (Ohio Gov. John Kasich, by contrast, has probably been too accommodating of both government in general and Obama in particular by accepting Obamacares expansion of Medicaid in his state. Any increase in his vote share is unlikely to be derived from the base.), Trumps success has allowed Bush to run not only as the unapologetic establishment candidate he is, but as a challenge to Trumpism and the anti-government extremism it represents. (At least what it represents this week; its possible that Trumpism is not an ideologically fixed manifesto.),  While many of his partys voters are dreaming of mass deportation of undocumented, largely Hispanic immigrants, Bush keeps finding ways to remind them why his Spanish is so fluent. \"We are very Hispanic in the sense that we speak Spanish at home,\" Bush said to Telemundo - in Spanish - referring to his wife and children. \"Columba is very Mexican. She is proud of her U.S. citizenship naturally, but we eat Mexican food at home. Our children are Hispanic in many aspects, and we dont talk about that. But yes, the Hispanic influence in my family is something quite important in my life.\", Campaigning against the wind, None of this would be possible without the enormous assets Bush brings to the campaign - his fundraising prowess, his name recognition and his familys political network. Without them, he would be an interesting GOP anomaly campaigning against gale-force winds. Money and connections make Bush an establishment horse. But at least in the early going, a loud billionaire is preoccupying the voters most eager to thwart Bushs rise. Bush isnt the type to run a race with abandon. Trump is enabling him to run with extra restraint. , Wilkinson writes on politics and domestic policy for Bloomberg View, where this commentary first appeared.]", "Date": "20150730", "Author": "[By Francis Wilkinson]", "Link": "http://www.chron.com/opinion/outlook/article/Wilkinson-Noise-from-Trump-enables-Bush-to-run-6415979.php", "Title": "[Wilkinson: Noise from Trump enables Bush to run with restraint]"}