{"Content": "[ Caption, Close, In this Aug. 18, 2015, photo, Democratic presidential candidate Hillary Rodham Clinton speaks with people at a town hall meeting in North Las Vegas, Nev. Clintons campaign is facing fresh worries among congressional Democrats about her use of a private email account while serving as secretary of state. Poll results suggest the inquiry may be taking a toll on her presidential campaign. FILE - In this June 1, 2015, file photo, Sen. Bill Nelson, D-Fla. make his way through the Senate subway on Capitol Hill in Washington. Hillary Rodham Clintons campaign is facing fresh worries among congressional Democrats about her use of a private email account while serving as secretary of state. Poll results suggest the inquiry may be taking a toll on her presidential campaign. Some Democrats in Congress say Clintons campaign has not adequately explained the complicated nature of the email review. Nelson says in an interview: \"I dont think the campaign has handled it very well.\", WASHINGTON (AP)  Hillary Rodham Clinton is facing fresh worries among elected Democrats about her use of a private email account while serving as secretary of state, as new polls signal that the inquiry is taking a toll on her presidential campaign. The Democratic front-runners campaign has taken steps to defend her against allegations she may have put classified information at risk by using a private email account and server, arguing she never sent or received material considered classified at the time. Democratic lawmakers said Clintons campaign has not adequately explained the complicated nature of the email review and panned some of her attempts to use humor to talk about the probe. Clinton joked at a Democratic dinner in Iowa last week that she liked the social media platform Snapchat because the messages disappear by themselves. And she shrugged off questions about her server being wiped clean, asking facetiously in Nevada, \"Like a cloth or something?\", \"I dont think the campaign has handled it very well,\" Florida Sen. Bill Nelson told The Associated Press on Thursday. \"I think the advice to her of making a joke out of it  I think that was not good advice.\", Nelson said if Clinton had received information that should have been labeled classified or top secret, the person sending the email would bear the responsibility of making that clear on the email. \"If she is receiving something on a private email account and it has no designation, then how would she know that it is classified?\" he asked. In Republican-leaning Kentucky, Democratic Rep. John Yarmuth warned in an interview with WHAS-TV in Louisville, \"I still think there is a chance that this could upend her campaign.\", \"I just never feel like I have a grasp of what the facts are,\" Yarmuth said Wednesday. \"Clearly she has handled it poorly from the first day. And theres the appearance of dishonesty, if its not dishonest.\", The new concerns follow Clintons decision to turn over her server to federal investigators who are trying to determine if the data on it was secure. Democratic California Gov. Jerry Brown compared the controversy to a \"vampire\" in an interview Friday with NBC News \"Meet the Press,\" saying it has \"some kind of dark energy that gets everybody excited.\", \"Shes going to have to find a stake and put it right through the heart of these emails in some way,\" Brown said. Clinton holds a wide but narrowing lead in the Democratic field against Vermont Sen. Bernie Sanders, who has picked up ground on her in New Hampshire and Iowa. Former Maryland Gov. Martin OMalley has pitched himself as a fresh face and has tried to gain traction. While Clinton holds significant advantages in money and support among Democrats, polls released Thursday by Quinnipiac University in Florida, Ohio and Pennsylvania  three general election battleground states  found that only about one-third of respondents thought she was honest and trustworthy. That has prompted Clintons campaign to defend her on cable television and distribute fact sheets to supporters about the inquiry. On Friday, the campaign publicized a video of Clinton press secretary Brian Fallon sitting behind a laptop and reading off and then correcting what he called inaccurate tweets about the emails. \"Look, we fully expect that Republicans are going to continue to want to talk about Hillary Clintons emails,\" Fallon says at the end of the video. \"And the reason for that is because they cant talk about their plan to grow the economy on behalf of the middle class.\", Clintons allies predict congressional Republicans will overplay their hand when Clinton testifies in October before a GOP-led panel investigating the 2012 terrorist attack in Benghazi, Libya. \"Ive been around this block many times with supposed Clinton scandals. It just wont work,\" said David Brock, a Clinton loyalist and the founder of Democratic super PAC American Bridge. Clinton told reporters in Nevada that they were the only ones bringing up the subject. Yet others are hearing about it. Marc Lasry, a New York financier and top fundraiser for Clinton, said donors are asking him questions about the situation  which he said he sees as \"a non-issue.\", \"What I hear from people is, Hey, can you explain this to me?\" Lasry said in an interview Friday. \"I tell people that it was perfectly fine for her to have a personal server. They say, Oh, thats what I thought. And the next question is, Why is this such a big deal? And I tell them that this is only an issue because Republicans and the media have made it into an issue.\", Watching from the sidelines is Vice President Joe Biden, who is considering entering the Democratic primaries. Biden has struggled in two previous presidential bids, but his entry could offer Democrats another alternative. While those in the Democratic field have largely steered clear of the email review, OMalley said Wednesday in Las Vegas that Clintons email practices had become a \"huge distraction\" from what Democrats should be talking about and said it showed the need for more televised debates. \"Until we do, our partys label is going to be the latest news du jour about emails and email servers and what Secretary Clinton knew and when she knew it,\" OMalley said. Republicans say they arent surprised that Democrats are growing nervous about continued focus on the situation. \"Clintons growing email scandal is a huge potential problem for Democrats because, at some point, this is going to become a drag on the whole ticket if she happens to be the nominee,\" Republican National Committee Chairman Reince Priebus said Friday. ", "Date": "20150824", "Author": "[Ken Thomas and Julie Bykowicz, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Clinton-facing-fresh-worries-in-Congress-over-6457009.php", "Title": "[Democrats urge Clinton to offer better explanation of emails]"}