{"Content": "[ Caption, Close, Chele Trammel holds election signs outside the Governors Ham Breakfast at the Missouri State Fair in Sedalia, Mo. Thursday, Aug. 20, 2015. Gov. Jay Nixon and his wife Georganne, left, take in a ham breakfast at the Missouri State Fair in Sedalia, Mo. Thursday, Aug. 20, 2015. Wyatt Stafford, right, waits in line for a ham breakfast at the Missouri State Fair in Sedalia, Mo. Thursday, Aug. 20, 2015. Stafford exhibited the Grand Champion Ham. The breakfast is a traditional gathering of Missouri elected officials, leaders in agriculture and supporters of the Missouri State Fair. Gov. Jay Nixon greets attendees at the Governors Ham Breakfast in Sedalia, Mo. Thursday, Aug. 20, 2015. The breakfast is a traditional gathering of Missouri elected officials, leaders in agriculture and supporters of the Missouri State Fair. Cristian Antal decorates his car outside the Governors Ham Breakfast at the Missouri State Fair in Sedalia, Mo. Thursday, Aug. 20, 2015.  The breakfast is a traditional gathering of Missouri elected officials, leaders in agriculture and supporters of the Missouri State Fair. SEDALIA, Mo. (AP)  Most of Missouris potential Republican candidates for governor expressed opposition Thursday to raising taxes for transportation funding, as they gathered under the same tent with other politicians to shake hands with voters at the Missouri State Fair. The annual Governors Ham Breakfast offered a rare opportunity for people to mingle with five Republicans and a Democrat expected to run for the states top office  possibly the last time theyll all be in one spot before the August 2016 primary elections. So far, four Republicans have officially announced their candidacies: former state Rep. Randy Asbury, state Sen. Bob Dixon, former House speaker and U.S. attorney Catherine Hanaway and Lt. Gov. Peter Kinder. Suburban St. Louis businessman John Brunner also is expected to join the race. The ham-and-eggs breakfast is a mainstay in Missouri politics, making the absence of former Navy SEAL Eric Greitens, who is expected to announce plans to run as a Republican, unusual. Greitens has never before run for elected office and has touted himself as a political outsider. Republican gubernatorial candidates told The Associated Press on Thursday that in general they oppose proposals to raise the gas or cigarette taxes to pay for road and bridge repairs. Kinder even said its important to \"try to at all costs to avoid raising taxes.\", Some lawmakers and interest groups have suggested raising the gas and cigarette taxes as transportation officials warn about a strained budget they say is forcing them to take a triage approach to maintenance. Most GOP candidates said the current transportation budget should be reviewed to ensure money is being spent efficiently. Hanaway said shes taken a no-tax pledge but that issuing bonds would be a likely solution. The Republicans push to try to make use of existing state money to pay for the roads stands in opposition to Democratic Gov. Jay Nixon. He floated ideas for a gas tax or to institute tolls on Interstate 70 during his State of the State address in January. He later backed a failed Senate measure this year that would have increased the diesel fuel tax by 3.5 cents and the gas tax by 1.5 cents. He reiterated support for a gas tax Thursday. Dixon is the only Republican candidate so far to have voiced support for raising the gas tax, saying it goes against his general opposition to taxes but is necessary for safety. He voted for the proposed Senate gas tax increase. Democratic Attorney General Chris Koster, who has said he plans to run for governor, said he supports increasing the cigarette tax. He listed transportation as a major need for the state, but also pointed to early childhood, K-12 and higher education. \"I have been supportive of a plan to utilize the money to help higher education,\" Koster said. ", "Date": "20150820", "Author": "[Summer Ballentine, Associated Press]", "Link": "http://www.chron.com/business/energy/article/Missouri-candidates-for-governor-gather-at-State-6455746.php", "Title": "[Missouri candidates for governor gather at State Fair]"}