{"Content": "[ Caption, Close, In this Monday, Aug. 3, 2015, file photo, Republican presidential candidate and retired neurosurgeon Ben Carson speaks during a forum, in Manchester, N.H. Responding to a question during an interview broadcast Sunday, Sept. 20, 2015, on NBCs \"Meet the Press,\" Carson, a devout Christian, said Islam is antithetical to the Constitution and he doesnt believe that a Muslim should be elected president. Republican presidential candidate Ben Carson speaks at a presidential forum sponsored by Heritage Action at the Bon Secours Wellness Arena, Friday, Sept. 18, 2015, in Greenville, S.C. Republican presidential candidate Ben Carson speaks at a presidential forum sponsored by Heritage Action at the Bon Secours Wellness Arena, Friday, Sept. 18, 2015, in Greenville, S.C. In this photo taken Wednesday, Sept. 16, 2015, Republican presidential candidates, from left, Ben Carson, Donald Trump, and former Florida Gov. Jeb Bush chat during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum in Simi Valley, Calif.   Donald Trumps rivals emerged from the second Republican debate newly confident that the brash billionaire will fade if the primary takes a more substantive turn and that they can play a role in taking him down without hurting their own White House ambitions. Yet in a race that has so far defied standard political logic, that may be little more than wishful thinking. FILE - In this Aug. 6, 2015, file photo, Republican presidential candidates from left, Chris Christie, Marco Rubio, Ben Carson, Scott Walker, Donald Trump, Jeb Bush, Mike Huckabee, Ted Cruz, Rand Paul, and John Kasich take the stage for the first Republican presidential debate in Cleveland.  Eleven top-tier Republican presidential hopefuls face off in their second prime-time debate of the 2016 campaign Sept. 16, in a clash between outsiders and establishment candidates under a cathedral of political conservatism. Republican presidential candidate Ben Carson speaks at a presidential forum sponsored by Heritage Action at the Bon Secours Wellness Arena, Friday, Sept. 18, 2015, in Greenville, S.C. Republican presidential candidate, retired neurosurgeon Ben Carson, left, speaks as Donald Trump looks on during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidates, from left, former Pennsylvania Sen. Rick Santorum, former New York Gov. George Pataki,  Sen. Rand Paul, R-Ky. former Arkansas Gov. Mike Huckabee, Sen. Marco Rubio, R-Fla. Sen. Ted Cruz, R-Texas, retired neurosurgeon Ben Carson, businessman Donald Trump, former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker, businesswoman Carly Fiorina, Ohio Gov. John Kasich, and New Jersey Gov. Chris Christie take the stage during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidates Ben Carson, left, and Donald Trump talk before the start of the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidates, from left, former Arkansas Gov. Mike Huckabee, Sen. Marco Rubio, R-Fla. Sen. Ted Cruz, R-Texas, retired neurosurgeon Ben Carson, businessman Donald Trump, former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker, businesswoman Carly Fiorina, and Ohio Gov. John Kasich, appear during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidates, from left, former Pennsylvania Sen. Rick Santorum, former New York Gov. George Pataki,  Sen. Rand Paul, R-Ky. former Arkansas Gov. Mike Huckabee, Sen. Marco Rubio, R-Fla. Sen. Ted Cruz, R-Texas, retired neurosurgeon Ben Carson, businessman Donald Trump, former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker, businesswoman Carly Fiorina, Ohio Gov. John Kasich, and New Jersey Gov. Chris Christie take the stage during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidate, businessman Donald Trump, center, speaks as Ben Carson, left, and Jeb Bush, look on during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidates, from left, former Pennsylvania Sen. Rick Santorum, former New York Gov. George Pataki,  Sen. Rand Paul, R-Ky. former Arkansas Gov. Mike Huckabee, Sen. Marco Rubio, R-Fla. Sen. Ted Cruz, R-Texas, retired neurosurgeon Ben Carson, businessman Donald Trump, former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker, businesswoman Carly Fiorina, Ohio Gov. John Kasich, and New Jersey Gov. Chris Christie take the stage during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidates Ted Cruz, left, Ben Carson, second from left, Donald Trump, second from right, and Jeb Bush appear during the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. Republican presidential candidate, retired neurosurgeon Ben Carson, center, tours the media workroom prior to the CNN Republican presidential debate at the Ronald Reagan Presidential Library and Museum on Wednesday, Sept. 16, 2015, in Simi Valley, Calif. In this Sept. 11, 2015 file photo, Republican presidential candidate Ben Carson speaks in St. Louis. Carson has moved into the top tier of the 2016 presidential race as quietly as Donald Trump crashed the party with bombast, and hell join the billionaire real-estate mogul as a focus of attention at the GOPs second debate. WASHINGTON (AP)  Republican presidential candidate Ben Carson says Islam is antithetical to the Constitution, and he doesnt believe that a Muslim should be elected president. Carson, a devout Christian, says a presidents faith should matter to voters if it runs counter to the values and principles of America. Responding to a question during an interview broadcast Sunday on NBCs \"Meet the Press,\" he described the Islamic faith as inconsistent with the Constitution. \"I would not advocate that we put a Muslim in charge of this nation,\" Carson said. \"I absolutely would not agree with that.\", He did not specify in what way Islam ran counter to constitutional principles. Carsons comments drew strong criticism from the countrys largest Muslim civil rights and advocacy organization, the Council on American-Islamic Relations. \"To me this really means he is not qualified to be president of the United States,\" said the groups spokesman, Ibrahim Hooper. \"You cannot hold these kinds of views and at the same time say you will represent all Americans, of all faiths and backgrounds.\", Hooper said the Constitution expressly forbids religious tests for those seeking public office and called for the repudiation of \"these un-American comments.\", In a separate appearance on NBC, one of Carsons rivals for the GOP nomination, Ohio Gov. John Kasich, was asked whether he would have a problem with a Muslim in the White House. \"The answer is, at the end of the day, youve got to go through the rigors, and people will look at everything. But, for me, the most important thing about being president is you have leadership skills, you know what youre doing and you can help fix this country and raise this country. Those are the qualifications that matter to me.\", Texas Sen. Ted Cruz, who taped Sunday an episode of Iowa Press, an Iowa Public Television program, was asked if he agreed with Carsons statements on Muslims being president. \"The Constitution specifies that there shall be no religious test for public office, and I am a constitutionalist,\" Cruz said. Carsons comments came amid lingering fallout over Republican Donald Trumps refusal last week to take issue with a man during a campaign event who wrongly called President Barack Obama a Muslim and said Muslims are \"a problem in this country.\", Also speaking on NBC on Sunday, Trump said that a Muslim in the White House is \"something that could happen... Some people have said it already happened, frankly.\", In multiple interviews Sunday, Trump tried to draw a distinction between all American Muslims and extremist Muslims in the U.S. and elsewhere. \"I have friends that are Muslims theyre great people, amazing people,\" Trump said on CNNs \"State of the Union.\", \"You have extremists Muslims that are in a class by themselves,\" Trump added. \"Its a problem in this country, its a problem throughout this world.... You do have a problem with radical Muslims.\", GOP candidates have been split over whether to criticize Trump, who has been a vocal skeptic of Obamas birthplace and faith. Obama is Christian. In the NBC interview, Carson said he believes that Obama was born in the U.S. and is Christian, saying he has \"no reason to doubt\" what the president says. Carson also made a distinction when it came to electing Muslims to Congress, calling it a \"different story\" from the presidency that \"depends on who that Muslim is and what their policies are, just as it depends on what anybody else says.\", Congress has two Muslim members, Democratic Reps. Keith Ellison of Minnesota and Andre Carson of Indiana. \"If theres somebody whos of any faith, but they say things, and their life has been consistent with things that will elevate this nation and make it possible for everybody to succeed, and bring peace and harmony, then Im with them,\" Carson said. ", "Date": "20150920", "Author": "[Hope Yen, Associated Press]", "Link": "http://www.chron.com/news/politics/article/GOP-candidate-Carson-Muslims-shouldn-t-be-6517236.php", "Title": "[GOP candidate Carson: Muslim shouldn't be elected president]"}