{"Content": "[Former Arkansas Gov Mike Huckabee (R) officially kicked off his presidential bid on Tuesday with a folksy campaign speech filled with references to his Christian faith. The former Southern Baptist pastor opened his address by noting some of the religious lessons he learned while growing up in his hometown of Hope, Arkansas. \"I learned that God loves me as much as he loves anyone. But he doesnt love some more than others,\" he said. \"I learned the Pledge of Allegiance, the Lords prayer, and the Preamble of the Constitution. We prayed at the start of each day and we prayed again before lunch. And I learned that this exceptional country could only be explained by the providence of Almighty God.\", Like former President Bill Clinton, who also hailed from Hope, Huckabee constantly referenced their hometown as a metaphor. \"It was here that I was baptized in the Garrett Memorial Baptist Church after accepting Jesus in a vacation Bible school when I was just 10 years old. I truly went from Hope to higher ground,\" he said. Huckabee s religious messaging is undoubtedly meant to appeal to the same evangelical voters that formed his base in the 2008 presidential race. In that contest, Huckabee won the Iowa caucuses and performed well throughout the South before ultimately losing the nomination to Sen. John McCain (R-Arizona). The stronger field of Republican candidates in 2016 will likely make Huckabees path even more difficult this time around. However, Huckabee is clearly not backing down and he vowed, as president, he will stand up to \"the false God of judicial supremacy\"  his term for the federal courts that have widely found a constitutional right to same-sex marriage. \"Weve lost our way morally. Weve witnessed the slaughter of over 55 million babies in the name of choice. And we are now threatening the foundation of religious liberty by criminalizing Christianity and demanding we abandon Biblical principles of natural marriage,\" he said. \"My friends, the Supreme Court is not the Supreme Being and they cannot overturn the laws of nature or of natures God.\", , In another apparent Biblical reference, Huckabee compared jihadist militants like the Islamic State group (also known as ISIS) to \"deadly snakes.\" He contrasted his approach to terrorism with President Barack Obama, who drew controversy in February by urging Christians to get off their \"high horse\" before criticizing Islam. \"When I hear our current president say he wants Christians to get off their high horse so we can make nice with radical jihadists, I wonder if he could watch a Western from the 50s and be able to figure out who they good guys and the bad guys really are,\" he said. \"As president, I promise you that we will no longer try to merely contain jihadism, we will conquer it! We will deal with jihadis just as we would deal with deadly snakes.\", Even when Huckabee was addressing issues like immigration reform, he invoked his faith. \"As Americans, we ought to get onto our knees every night and thank God we still live in a country that people are trying to break into rather than one theyre trying to break out of,\" he said to cheers. Huckabee is the third Republican candidate to throw his hat into the presidential race this week. On Monday, formerHewlett-Packard CEO Carly Fiorina and retired neurosurgeon Ben Carson both announced their own White House bids. Join the conversation about this story , NOW WATCH: Heres how President Obama starts every morning, See Also:]", "Date": "20150505", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/Mike-Huckabee-launched-his-presidential-campaign-6243563.php", "Title": "[Mike Huckabee launched his presidential campaign with a fiery, religious speech]"}