{"Content": "[ So, you want to learn about your Houston mayoral candidates?, Try Facebook or Twitter, or check out a campaign website or two. Whatever you do online, though, you will be hard-pressed to learn what the more than half-dozen contenders vying to be the next mayor of Houston think should be done about, say, pensions or infrastructure or economic development. Five months before voters head to the polls, the candidates digital platforms are up and running, but most are heavy on biography, light on ideas. \"Theyre checking the box. They have a website, they have a Facebook, they have a Twitter,\" said Luke Marchant, a Houston-based Republican consultant. \"Theyre all doing what they need to do, but no ones really pushing the envelope.\", That is not surprising at this stage of the game, when the hot summer months loom large and politics remain an afterthought for all but the most active voters, political experts said. Still, with more than a half dozen contenders vying to replace term-limited Mayor Annise Parker, the candidates are missing out on an opportunity to set themselves apart, said Vincent Harris, an Austin-based GOP strategist. \"How are these candidates differentiating themselves?\" said Harris, who worked on City Council member Oliver Penningtons campaign before he dropped out. \"They have to start differentiating themselves, and policy online is a great way to be doing that.\", Some of the contenders have made small forays into the online policy conversation, with state Rep. Sylvester Turners proposals including a job training program aimed at fixing the citys streets and lifting the existing cap on public arts funding. Among former congressman Chris Bells suggestions are reorganizing the citys public works department, expanding bus rapid transit and housing pre-kindergarten programs in city libraries and community centers. \"A lot of the effort right now is focused on fundraising, but the people who are donating to campaigns are no different than any other type of voter. They want to know where you stand,\" Bell said, \"and the best place for them to find that information in a quick manner is online.\", Others, namely City Council member Stephen Costello and former mayor of Kemah Bill King introduce themselves on their websites and broadly outline campaign priorities: Costello wants to add to the Houston Police Departments ranks, while King suggests auditing the department and doing away with the citys crime lab. Former Harris County Sheriff Adrian Garcia and businessman Marty McVey leave it mostly at biography. \"Before Im able to govern effectively, I need to know whats important to the people,\" McVey said, noting that his policy is developing as he talks to potential voters. Meanwhile, 2013 mayoral runner-up Ben Halls website was down as of Friday afternoon, having previously sported donate and endorse buttons, as well as a countdown clock until election day, but no candidate information whatsoever. Hall said he was refining his policy positions before updating his website. \"I think you have some top-tier candidates producing some top-tier websites, and others are still struggling to get their websites up and running and online presence secured,\" Marchant said, noting that only a few of the candidates have begun using online advertising to drive traffic to their sites. That will come in time, most of the campaigns said. As will policy positions. For now, they are concerned with introducing the candidates to potential donors and voters. \"Its pretty common that you go up with a simple operation at first and then expand it over time in terms of depth of content,\" said Ward Curtin, Costellos campaign manager. King spokesman Jim McGrath said he expects to roll out more policy information in the late summer or early fall. \"Its about having the right conversation at the right time,\" he said. \"Timing is important on this.\", Other campaigns, Turner and Garcias included, said they anticipate laying out policy plans in the coming weeks.]", "Date": "20150605", "Author": "[By Rebecca Elliott]", "Link": "http://www.chron.com/news/politics/houston/article/Mayoral-candidate-websites-slow-to-develop-6310319.php", "Title": "[Mayoral candidate websites slow to develop]"}