{"Content": "[ Caption, Close, FILE - In this March 7, 2015 file photo, Wisconsin Gov. Scott Walker speaks in Des Moines, Iowa. Its become even clearer thanks to Wisconsin Gov. Scott Walker: Immigration is the banana peel of 2016 Republican presidential politics. Just ask Florida Sen. Marco Rubio. He stepped up as a Senate leader on immigration only to slip and fall in a tea party ruckus over the issue. In a moment of candor, he remembered the months of trying to get back up as a real trial for me. Former Florida Gov. Jeb Bush has a strong voice _ and a book _ on immigration but hes done some shifting of his own. His statements in support of a path to legal status for people in the country illegally are loud and proud, but a departure from an earlier position that envisaged eventual citizenship. (AP Photo/Charlie Neibergall, File), Likely presidential candidate Scott Walker reiterated Saturday that he opposes any path to citizenship for current undocumented immigrants, insisting that he didnt even use the word \"citizenship\" at a New Hampshire dinner earlier this month when he reportedly endorsed that route to legal status. \"I made it clear that for me if someone wants to be a citizen they need to go back to their country of origin, get in line, no preferential treatment,\" Walker told reporters before he addressed the Harris County Republican Partys Lincoln-Reagan Dinner in south Houston. \"In terms of what to do beyond that, again thats something weve got to work with Congress on.\", Walkers comments came a day after he visited the Texas-Mexico border alongside Gov. Greg Abbott, who introduced him Saturday evening as someone who \"governs like a Texan.\" Walker, the governor of Wisconsin, pitched himself to county Republican elected officials and donors as a union fighter who has shown how Republicans can win in traditionally Democratic states. Walker, who won his first election in 2010, survived a recall election triggered by organized labor in 2012, and then won re-election in 2014, is eyeing another election in 2016. But he will have to claw his way to win over establishment backers nationwide - a reality starkly depicted locally Saturday when his speech was preceded by a lengthy video homage to a prominent backer of Walker opponent Jeb Bush: his father, former President George H.W. Bush. \"We can transform America just like we transformed the states - and were gonna do that in the 2016 election,\" said Walker, who is expected to launch his presidential campaign once Wisconsins legislative session concludes this summer. Legal path, Walker and Bush, the former governor of Florida, have trailed in the opening stages of the presidential race by concerns over their positions on immigration, which some conservatives see as insufficiently tough. Earlier this week, the Wall Street Journal reported that the Wisconsin governor agreed with providing a pathway to citizenship, which would put him at odds with his prior stated position. Walker said Saturday that he does not support any route to legal status for the immigrants already living in the United States. \"What I said just now is what Ive said repeatedly, whether in New Hampshire or anywhere else,\" Walker said. \"I dont believe in amnesty in the sense of citizenship. I believe if someone wants to be a legal citizen of the United States, there is a legal path by which to do that.\", Walker has acknowledged changing his position on the issue since 2013, when the presidential hopeful said that he supported some way for undocumented immigrants to eventually become citizens - though those waiting patiently for entry to the United States should have \"first preference.\", Walker now sings a different tune, saying he does not support any \"amnesty\" for those currently living here. But the Journal report suggested that Walker had once again flipped: At a March 13 dinner in the Granite State, Walker said these immigrants should \"eventually get their citizenship without being given preferential treatment.\", Blue-collar voters, On Saturday evening, Walker characterized the Journal story, attributed to \"people present,\" as entirely false. Walker said he talked about an e-verification system and securing the border, but not any options for citizenship. In his speech here in Houston, Walker largely avoided the immigration issue, instead focusing on his appeal to blue-collar voters potentially key to giving Republicans the White House in 2016. And Abbott, who has avoided endorsing any of the Republicans currently positioning to run, at least endorsed Walkers record. \"The Wisconsin turnaround is so profound, it is proof that conservative principles really do work,\" Abbott said. \"No Republican presidential candidate has won Wisconsin since Ronald Reagan, but that might just change in 2016.\"]", "Date": "20150328", "Author": "[By Theodore Schleifer]", "Link": "http://www.chron.com/news/politics/us/article/Wisconsin-governor-defends-immigration-comments-6165628.php", "Title": "[Wisconsin governor reiterates immigration stance at Houston stop]"}