{"Content": "[ Caption, Close, Sen. Ted Cruz, R-Texas,  leaves a policy luncheon at the U.S. Capitol in Washington, Tuesday, June 23, 2015. The Senate pushed bipartisan trade legislation to the brink of final approval Tuesday in a combined effort by President Barack Obama and Republican congressional leaders to rescue a measure that appeared all but dead less than two weeks ago. (AP Photo/Cliff Owen), See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. See where various religions and denominations stand on same sex marriage. The Republican Party is hoping that a Supreme Court ruling before months end will close a chapter in American politics that has caught much of the party between evangelicals who emphatically opposes gay marriage and many voters who are supportive of same-sex couples. Ted Cruz is trying to ensure that the debate is far from over. While Republican leaders hope that the issue will be neutralized either way the high court rules  by affirming social conservatives seeking to protect states that still bar same-sex marriages or by issuing an unambiguous statement in support of gay couples  Cruz has other goals. The Texas senator is making evangelicals a bedrock of his 2016 presidential campaign. Hes making it clear that regardless of the cases outcome, hell keep pressing the issue. \"I believe 2016 will be the religious liberty election,\" Cruz said at a gathering of faith activists in Washington last week. \"Religious liberty has never been more threatened in America than right now today.\", Cruz has legislative, political and fund-raising motivation. In the Senate, hes sponsoring a constitutional amendment shielding states that still bar gay marriage, and hes already attacking his competitors. In his speech last week, he derided Republicans who werent supportive of religious liberty laws in Indiana and Arkansas that opponents said would allow businesses to discriminate against gay customers. \"Ill tell you what was saddest, just how many Republicans ran for the hills,\" Cruz said, adding that Indiana was \"a time for choosing.\", Cruzs legislative challenge is going nowhere fast, given that it requires a two-thirds majority of both chambers of Congress and ratification by three-fourths of the state legislatures to amend the Constitution. But by using his power to sponsor legislation, he can distinguish himself from other conservatives in the crowded 2016 presidential field. That may help him with the partys coveted evangelical base. In the process, Cruz can also create headaches for more centrist (and more front-of-the-pack) candidates such as former Florida Gov. Jeb Bush and Florida Sen. Marco Rubio, who need to get through the nominating process without having to take stands that could hurt them in a general election. Underlining the concerns of some party strategists, Wisconsin Gov. Scott Walker, also among the Republican fields top-polling candidates, recently threw his support behind a constitutional amendment to allow states to ban gay marriage. Congressional Republican leaders are using megaphones to blast President Barack Obamas health care law, which also figures in a major case the court will decide by the end of June. By contrast, theyve been practically silent on gay marriage. The same goes for Bush and Rubio. Its a reflection of the partys desire to downplay a matter on which polls show they are at odds with the public. A Gallup poll in May found that a record 60 percent of Americans support gay marriage. \"The reality is the ground is shifting on this issue because of people getting to know more about the fact that, for the vast majority of people, this is not a choice, this is who they are,\" Ohio Sen. Rob Portman, a Republican whose son is gay and who supports gay marriage, said in an interview. \"Most of the candidates are not talking about it, which is different than it would have been eight years ago.\", On the other side of the debate, Gary Bauer, president of American Values and one of the nations most vocal social conservatives, agrees that \"the party establishment and some of the donor base is very uncomfortable with these issues.\", \"What they need to ponder is the very real chance of demoralization among voters that care about these issues that would suppress voter turnout,\" Bauer said. As a senator, Cruz can introduce legislation on gay marriage, but there are other Republican candidates who are competing for the evangelical vote and who are eager to make an issue of gay marriage. In May, Louisiana Gov. Bobby Jindal signed a religious freedom executive order. Huckabee, the former Arkansas governor, is promising to fight \"judicial tyranny\" and calling on his fellow candidates to join him. \"If you lack the backbone to reject judicial tyranny and fight for religious liberty, you have no business serving our nation as president of the United States,\" Huckabee said in a letter last week to more than 100 conservative leaders and organizations. Cruz and the others are backed by activists who say the gay marriage debate is a part of a broader assault on religious liberty that will eventually strip them of their ability to openly practice their beliefs. Religious leaders are concerned the ruling will force Catholic and other religious-based adoption services to give same-sex couples equal preference, Bauer said. \"The battle is morphing away from just the question of the definition of marriage,\" he said. \"Thats going to be a huge battle that is likely to be very divisive.\", Iowa Rep. Steve King, a Republican who is heavily courted by Republican presidential candidates because hes from the state where the first ballots of the presidential election will be cast, has called for \"civil disobedience\" if the court rules in favor of same-sex marriages. The National Organization for Marriage is urging all the Republican candidates for the 2016 presidential nomination to sign a pledge promising to support a constitutional amendment similar to what Cruz has proposed defining marriage as between one man and one woman. And the Southern Baptist Convention says it will reject any ruling affirming gay marriage. Meanwhile, other Republicans are making clear its a fight theyd rather not have. During last weeks Faith & Freedom Coalition meeting in Washington, D.C. Cruz was the only 2016 candidate to aggressively address the gay marriage issue. Wisconsin Sen. Ron Johnson, a Republican facing a tough reelection battle, said his priorities are addressing the nations debt and deficit and turning back Obamacare. Once the court rules, \"I would move on,\" he said in an interview. \"The Supreme Court rulings are pretty definitive. They just are.\", That wont be easy to do for the 2016 field of Republicans because of voters like Linda Cleaver of Cochranville, Pa. a member of the Faith & Freedom Coalition. \"It will go everywhere and affect everything,\" she said of the ruling. \"Its Bill of Rights time,\" she said in rejecting the argument that forcing Bush, Rubio and Walker into an aggressive posture against gay marriage will hurt them if they become the partys nominee. \"I dont care what they think,\" she said of Republican strategists who argue the party has a better chance of winning the White House if it avoids divisive social issues. \"They have their opinion, but theyre out of touch.\", , 2015 Bloomberg News]", "Date": "20150624", "Author": "[Heidi Przybyla, Bloomberg News (TNS)]", "Link": "http://www.chron.com/news/article/Why-Ted-Cruz-isn-t-giving-up-the-gay-marriage-6347456.php", "Title": "[Why Ted Cruz isnt giving up the gay marriage fight]"}