{"Content": "[ Caption, Close, Andy Taylor speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Attorney Andy Taylor takes the podium to applause from supporters during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Members of the media record Andy Taylor speaking about  the Texas Supreme Courts suspension of the HERO ordinance during a press conference Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Pastor Hernan Castano, one of the plaintiffs in the case, speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Andy Taylor speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Andy Taylor speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Rev. Dave Welch, right, Executive Director of the Houston Area Pastor Council, speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Attorney Andy Taylor hugs F. N. Williams Sr. the lead plaintiff in the case, following a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Andy Taylor speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Attorney Andy Taylor, left, is greeted by Bishop Dr. Delagraentiss and attorney Jared Woodfill before a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Members of the media record Andy Taylor speaking about  the Texas Supreme Courts suspension of the HERO ordinance during a press conference Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Protesters gather outside City Hall after a proposed compromise was announced on May 13 in the Houston Equal Rights Ordinance. Jared Woodfill, left, David Welch, right, and others with a group seeking to repeal Houstons equal rights ordinance delivered boxes of signatures to the office of the Houston city secretary on July 3. Flanked by clergy, Mayor Annise Parker announces that the city will withdraw subpoenas issued in a lawsuit over Houstons equal rights law. Former City Council member Jolanda Jones speaks on the equal rights measure in August. In 2014, Rev. Dave Welch, executive director of the Texas Pastor Council, addresses the media after Mayor Annise Parker, City Attorney David Feldman and Council Member Ellen Cohen announced that the petition to repeal the Houston equal rights ordinance adopted by the City Council in May has fallen short of the number of signatures required due to errors in the signature collection process, Former city councilor Jolanda Jones speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Marcus Smith with University of Houston NAACP speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Rev. Michael Diaz speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. People listen as former city councilor Jolanda Jones speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Mahpreet Singh speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Attorney Danyahel Norris speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Lou Weaver speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. The Texas Supreme Court ruled Friday that Houston City Council must repeal the citys equal rights ordinance or place it on the November ballot. The ruling comes three months after a state district judge ruled that opponents of Houstons contentious non-discrimination ordinance passed last year failed to gather enough valid signatures to force a repeal referendum. \"We agree with the Relators that the City Secretary certified their petition and thereby invokedthe City Councils ministerial duty to reconsider and repeal the ordinance or submit it to popularvote,\" the Texas Supreme Court wrote in a per curiam opinion. \"The legislative power reserved to the people of Houston is not being honored.\", The citys equal right ordinance bans discrimination based not just on sexual orientation and gender identity but also,  as federal laws do,  sex,  race,  color,  ethnicity,  national origin,  age,  religion,  disability,  pregnancy and genetic information,  as well as family,  marital or military status. Houston City Council has 30 days to repeal the ordinance or place it on the November ballot. Opponents sued the city, complaining that City Secretary Anna Russell had determined that petitioners had collected enough signatures to force a repeal measure onto the ballot, but had been overridden by Mayor Annise Parker and then-City Attorney David Feldman, whose staff determined many of the valid signatures were on invalid petition pages. One of the plaintiffs, former Harris County Republican Party chiefJared Woodfill, called the ruling \"a huge victory for the people of the city of Houston.\" He called on Parker, the first openly gay leader of a major American city, to apologize to the public. \"This is all about the mayor and her personal agenda,\" Woodfill said. \"The actions she took were unlawful, and now the court has said the people are going to have an opportunity to vote, and thats all weve asked for from day one. I think this mayor owes an apology to the people of the city of Houston.\", A \"disappointed\" Parker said she thought the court had erred in its \"eleventh hour ruling\" and said her team was consulting with the citys pro bono outside counsel on \"any possible available legal actions.\" She said the ordinance resembles measures passed by other major U.S. cities and many local companies. \"No matter the color of your skin, your age, gender, physical limitations, or sexual orientation, every Houstonian deserves the right to be treated equally,\" Parker said. \"To do otherwise, hurts Houstons well-known image as a city that is tolerant, accepting, inclusive and embracing of its diversity.  Our citizens fully support and understand this and I have never been afraid to take it to the voters.  We will win!\", Woodfill said he anticipates the ruling will greatly influence this Novembers elections, which will see the first open mayors race in six years because Parker is term-limited; all 16 council positions also are up for a vote. Political observers have assumed the council will place the ordinance to a vote rather than repeal it, as the measure was adopted on an 11-6 vote. Houston voters twice have rejected protections or benefits for gays, in 1985 and in 2001. \"Youre going to have money pouring in from all across the country on this issue because its extremely important,\" Woodfill said. \"Were going to be looking at mayoral candidates, city council candidates that stand with us on this important issue. The eyes of the country are going to be looking at Houston.\", Councilwoman Ellen Cohen, who helped rally votes for the measures passage at council, said she remains concerned that the spectacle of a political debate over the topic could, as similar debates have in other states, harm local businesses, cause the cancellation of events or conventions, and make firms less likely to relocate to Houston. \"Im disappointed,\" Cohen said. \"Frankly, in this day and age, particularly with the recent (U.S.) Supreme Court decision (legalizing gay marriage), I think its a real shame that were going to have to be debating equal rights in the fourth largest city in the United States.\"]", "Date": "20150724", "Author": "[By Rebecca Elliott and Mike Morris]", "Link": "http://www.chron.com/news/politics/houston/article/Texas-Supreme-Court-sides-with-plaintiffs-in-6403354.php", "Title": "[Texas Supreme Court says city must repeal HERO or put it on ballot]"}