{"Content": "[According to the odds, Democrat Hillary Clinton and former Florida Gov. Jeb Bush (R) are the clear frontrunners in the 2016 presidential race. Irelands biggest bookmaker, Paddy Power, has taken over 5,000 individual bets on the upcoming election. Paddy Power is providing Business Insider with weekly updates on the odds for the race. Rory Scott, a spokesman for Paddy Power said the numbers havent changed much since last week, so he provided us with a historical look at how they have evolved since the company began taking 2016 bets. Overall, its clear most bettors are putting their money on Clinton to win while Bush is ahead of his Republican rivals. Scott attributed the lack of movement in this weeks numbers to gamblers waiting to see whether some big names throw their hats into the ring. \"It seems the market is waiting for a confirmation from one of the potential big hitters  Clinton obviously, Bush, [Sen. Elizabeth Warren (D-Massachusetts)], [New Jersey Gov. Chris Christie (R)], etc.,\" Scott said. Though Scott described this week as \"uneventful\" there were two takeaways from the new odds. Clintons chances improved slightly after what Scott described as \"modest money\" being bet on her \"combined with the fact her fundraising activities appear to be ramping up (and of course time slips away for other candidates to mount a credible challenge).\", The numbers also showed that Sen. Ted Cruz (R-Texas) didnt see his odds improve after officially announcing his campaign last Monday. According to Scott, gamblers have \"very little confidence\" in Cruz. \"Ted Cruzs declaration hasnt made a jot of difference to the betting and theres very little confidence in him from the punters POV,\" Scott said. View a chart showing how the odds have changed over time below. , Join the conversation about this story , NOW WATCH: This 40-year-old Indonesian is Obamas doppelgnger, See Also:]", "Date": "20150405", "Author": "[Hunter Walker, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/The-odds-are-in-Jeb-Bush-s-and-Hillary-Clinton-s-6168941.php", "Title": "[The odds are in Jeb Bush's and Hillary Clinton's favor]"}