{"Content": "[ Caption, Close, While many experts believe that presidential candidate Donald Trumps candidacy will be short-lived, polling data and  comments from voters in primary states indicate that his appeal is based on his boldness and attitude rather than his policy positions. Live soap opera, , Regarding \"Trump driving GOP immigrant debate\" (Page A1, Tuesday), the Republican Party is now hostage to its own creation. Donald Trump, whom they had no problems with when he was attacking President Obamas American citizenship, now takes the lead in defining their immigration policy. This is the same problem they often have. When someone first starts inappropriate rhetoric there are rarely enough people in the room who say \"no.\", Americans will just have to live with the results if they elect Trump or any other Republican who seems to be falling in line with the soap opera that is playing out in the GOP. Europeans and other outsiders are laughing or scratching their heads at the new dynamics working in our political system. Republicans will have to decide for themselves if Trumps prior self assessment that he will win the Hispanic vote can possibly be true after this plan. Ron Curtis, Houston, , Maturity challenged, Regarding \"Tough stance at Waco hearing\" (Page B1, Tuesday), I am struck as to how stupid this whole episode is. We are in the 15th year of the 21st century and we still have grown men acting like 10-year-olds running around with guns trying to prove who controls the playground. Stop and think about this for a moment: two bands of grown men fighting over who gets to wear a patch on their motorcycle jacket to show \"superiority.\", Why dont they worry about teaching children to read? Or spend their time repairing houses for old, poor people?, Frankly, I think we should throw them all in jail for a year and force them to attend manners and maturity classes. We could have meal time like we had in summer camp 60 years ago - alternating seating for different gang members; i.e. one of one group next to one of the other group, etc. Stan Thurber, Spring, , Exploiters benefit, Regarding \"Immigration enforcement misunderstood\" (Page B5, Monday), Ruben Navarrette Jr. again has nailed it when he states that the key to controlling illegal immigration is the enforcement of the Immigration Reform and Control Act of 1986 and the arrest and prosecution of companies and individuals who knowingly employ illegal immigrants. By doing this, jobs for immigrants in the country illegally would disappear, and there would be no reason for them to come here.  All of the rhetoric and soul searching being put forth by the current presidential candidates is pointless. Common sense tells us that this is the real solution to the problem and that there is no need to build walls and patrol the border with thousands of agents. The only reason that this has not been done a long time ago is that the industries which profit the most from exploiting illegal immigrant labor are represented by powerful lobby groups in Washington, D.C. and have persuaded congressmen and administrations to look the other way for many years. Hopefully we will end up with a new president and Congress that does not cave in to lobbyists. Ralph Tibiletti, Spring, , Rail woes on track , Regarding \"New contract fight costing Metro $1 million\" (Page B3, Wednesday), the article describing Metros problems with the company contracted to deliver 39 rail cars glosses over the most glaring error of the board: \"The company ran into problems complying with requirements for American-made products.\",  It was the board that created problems by attempting to circumvent the American-made provisions of the federal money grant by complying with the letter of the regulation rather than the spirit. Someone needs to remind the board that Metro exists to better the quality of the greater Houston area and spending $150 million with a Spanish firm does a great disservice to our areas and our countrys citizens. Bill Spear Bartlett, Houston]", "Date": "20150819", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/letters/article/Thursday-letters-Trump-opera-Waco-flap-Metro-6454047.php", "Title": "[Thursday letters: Trump opera, Waco flap, Metro rail]"}