{"Content": "[ AUSTIN  When Jimmie Don Aycock was asked to run for the state House a decade ago, he went into his barn and fashioned a \"truth in government pipe\" out of a piece of scrap copper. On one end he drilled an \"S\" for \"spending\" and on the other, a \"T\" for \"taxes.\", As House Education Chairman, he has turned to that small piece of copper to remind himself and others that \"government cant separate what we spend from what we tax.\" On Monday, he will announce he is not seeking re-election, putting away the pipe for the last time. \"Theres about a thousand reasons\" he will not seek re-election, Aycock told the Chronicle. The Killeen Republican is considered by members of both parties as one of the most trusted and honest members in either chamber. Hes so ethical, Houston Democrat Harold Dutton recently mused, that \"hes the kind of guy youd buy a used car from, and wouldnt look under the hood.\", He also has been incredibly productive in his nine years, passing major education reform bills like 2013s House Bill 5, which cut end-of-course exams for high school students, among other things. The legislative life, however, really never has been for him, he said. \"Ive never really enjoyed being at the mic and arguing,\" said the soft-spoken former veterinarian and rancher. He and Marie, his wife of almost 50 years from which he says he is inseparable, are \"anxious\" to return to \"family and farm life.\", \"I had a really good life before I did this,\" Aycock said chuckling. He described his seven years of retirement before he ran for the House as \"wonderful, gloriously wonderful.\", Aycock, 68, was born and raised in Bell County. He was a member of First Baptist Willow Grove Church, where he met his wife as a child. He attended Moody High School, where he graduated as valedictorian, and Texas A&M, where he received both his Bachelors and Doctor of Veterinary Medicine. He did not run for state elected office until he was in his late 50s, but he was no stranger to public service, having served as the head of the Greater Killeen and Harker Heights chambers of commerce and as president of two local water boards. He also sat on a school board in the mid-to-late 1980s, where he became intimately familiar with the long-time struggles of Texas public schools. It is his public school reforms, including House Bill 5, for which he likely will be remembered best. Texas Monthly named his one of the best lawmakers in 2013 for just that reason. He considers his greatest achievement in the state Legislature to be his role in helping Texas A&M-Central Texas become a stand-alone university. This session, he unsuccessfully attempted to push a major reform of the states method of funding public schools. Bucking the desires of most other Republicans to wait for the Texas Supreme Court to rule on whether the school finance system is unconstitutional, Aycock and his staff undertook months of statistical analyses to come up with what he thought was a first step toward an eventual fix. It quickly became evident the bill would be killed in the Senate, however, so Aycock pulled it down when it reached the House floor to enable debate on other bills. The House gave him a standing ovation that day, to thank him for not holding up the calendar. Aycock, visibly emotional, said that was a great honor. \"I just dont deal well with that,\" Aycock said of receiving such public admiration of his colleagues. \"I get emotional when a flag (goes by).\", Later that same day, Democrats opposed to his bill that would grade K-12 campuses on an A-F scale decided not to block debate on the measure in deference to Aycock. They said they did not want to do anything out of the respect they held for him. Now, that bill is now headed to the governors desk. \"Its the way he conducts himself,\" Rep. Dan Huberty, R-Houston, said, calling Aycock \"a great chairman, a great friend and a great mentor.\" \"Hes more of a statesman.\"]", "Date": "20150601", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/House-education-chairman-will-not-seek-re-election-6299185.php", "Title": "[Aycock, House education chairman, will not seek re-election]"}