{"Content": "[ WASHINGTON (AP)  Rising religious intolerance threatens the unity of Myanmar, a senior U.S. official said Friday, as the former pariah state prepares for landmark Nov. 8 elections. Top diplomat for East Asia, Daniel Russel, criticized the election commissions disqualification of dozens of parliamentary candidates, mostly minority Muslims, and the disenfranchisement of hundreds of thousands of stateless Rohingya, who were allowed to vote in previous elections. Russel said the current government needs to \"push back against the infusion of religious intolerance in the political scene.\", Myanmar is predominantly Buddhist and has seen an upswing in religious nationalism. Sectarian attacks and discrimination against Muslims have marred the nations shift from decades of direct military rule  a democratic transition that has gotten strong diplomatic support from Washington. Russel, who visited the Southeast Asian nation last week to discuss the election preparations, spoke of a \"worrisome trend toward allowing the voices of religious extremism to speak unchallenged, to use hate speech.\", He noted that the government of President Thein Sein has striven to forge peace with ethnic armed groups  a nationwide cease-fire may be signed by next month  and it would be ironic if the country also known as Burma now became divided along religious lines. \"The election process, like the peace process, is part of Burmese peoples quest to create a national identity whether its under the label of Burma or Myanmar. They cant do that if the religious minorities are vilified and excluded,\" he told reporters after addressing the Carnegie Endowment for International Peace think tank. But despite the problems, Russel said the elections can be a significant step forward in Myanmars transition. Russel said non-government groups in Myanmar say the election preparations have been transparent and the vote will be \"genuinely contested.\", The pro-military ruling party faces a stiff challenge at the polls from party of opposition leader and former political prisoner Aung San Suu Kyi, who is widely respected in Washington. In all, more than 90 political parties are contesting for parliamentary seats. Russel said he told Myanmar officials that it was essential that all parties, including the military, abide by the election results and the formation of new government in early 2016. In 1990, the military refused to cede power after Suu Kyis party won by a landslide. Russel said the United States has a \"huge interest\" in the success of Myanmar and vowed continued U.S. support as the nation continues political and economic reforms. The Obama administration in 2012 normalized diplomatic relations and eased sanctions, but initial optimism has dampened as reforms have slowed.]", "Date": "20150913", "Author": "[Matthew Pennington, Associated Press]", "Link": "http://www.chron.com/news/article/US-Religious-intolerance-threat-to-Myanmar-unity-6498449.php", "Title": "[US: Religious intolerance threat to Myanmar unity]"}