{"Content": "[ Caption, Close, FILE - In this Feb. 4, 2014 file photo, Sen. Heidi Heitkamp, D-N.D. speaks on Capitol Hill in Washington. Heitkamp said Wednesday, Sept. 9, 2015, that she wont run for North Dakota governor, a setback for Democrats hopes of claiming the states top office. BISMARCK, N.D. (AP)  U.S. Sen. Heidi Heitkamp said Wednesday that she wont run for North Dakota governor, a setback for Democrats hopes of claiming the top office in the Republican-dominated state. Heitkamp said she has ruled out seeking the seat being vacated by Republican Jack Dalrymple, who announced Aug. 24 that he wouldnt seek re-election because he wanted to spend more time with his family. In a call-in to her brother Joels talk radio show on KFGO-AM in Fargo, Heitkamp said being governor would be the \"greatest honor you can have.\" But she added: \"I dont think this is the time to make this race.\", For congressional Democrats, the announcement was good news. If she had left the Senate for a run, it could have complicated their chances of retaking the U.S. Senate in 2016. She isnt up for re-election until 2018. But state Democrats had seen Heitkamp as their top chance to win the governorship in a solidly Republican state. Since narrowly winning her Senate seat in 2012, she has carefully balanced national party priorities with stances important back home, such as supporting oil and coal development. Heitkamp told The Associated Press that she had been mulling a gubernatorial bid for a long time but made her final decision Wednesday morning. \"I went to bed last night having made the decision,\" Heitkamp said, adding that she left it as \"reversible\" when she woke up. Just a week ago, Heitkamp announced her support for President Barack Obamas Iran nuclear deal, a politically risky move in a Republican-dominated state and one that some political observers thought signaled her intention to stay in Washington. The states GOP party was quick to pounce, calling Heitkamp out of touch with her constituents. After Heitkamp, the field of Democrats seen as strong contenders for governor is not deep. Tim Purdon, a former U.S. attorney who has since gone into private practice, has been mentioned as a potential candidate. Joel Heitkamp, a former state senator, has also been mentioned. After his interview with his sister, Joel Heitkamp said \"the race interests\" him. Former U.S. Department of Agriculture Rural Development state director Jasper Schneider and state Sen. George Sinner of Fargo, who lost a U.S. House bid last year, also have been mentioned. There are no declared candidates from either party. Robert Haider, executive director of the state Democratic party, said Heitkamps announcement came as no surprise. \"Weve been operating all along that Sen. Heitkamp would continue her great work in the U.S. Senate,\" he said. \"This does not impact what we do moving forward.\", On the GOP side, Dalrymples running mate Drew Wrigley, who is serving his first four-year term as lieutenant governor, had been atop the short list of potential candidates but his recent admission of an extramarital affair has put his candidacy in question. Attorney General Wayne Stenehjem, a former Grand Forks lawyer and longtime state legislator, also has been mentioned as a contender. Doug Burgum, a philanthropist and former Microsoft Corp. executive, is a possible wild card if he runs, either as a Republican or an independent. Heitkamp, a 59-year-old Mandan attorney who has served as the states tax commissioner and attorney general, made an unsuccessful bid for the governors mansion in 2000. She lost to Republican John Hoeven in a race interrupted late in the campaign when Heitkamp was diagnosed with breast cancer and underwent surgery six weeks before Election Day. Her cancer is in remission. She passed up a rematch with Hoeven in 2010 for the U.S. Senate seat being vacated by Democratic Sen. Byron Dorgan. Instead, she chose a 2012 run for North Dakotas other U.S. Senate seat as Democrat Kent Conrad retired, and narrowly beat freshman U.S. Rep. Rick Berg.]", "Date": "20150909", "Author": "[James Macpherson and Dave Kolpack, Associated Press]", "Link": "http://www.chron.com/news/article/Sen-Heidi-Heitkamp-says-no-run-for-governor-6493247.php", "Title": "[Sen. Heidi Heitkamp says no run for North Dakota governor]"}