{"Content": "[ Caption, Close, Republican presidential candidate Donald Trump leaves the courthouse after serving on jury duty in New York, Monday, Aug. 17, 2015. The Republican presidential candidate reported for jury duty in Manhattan on Monday and spent much of the day like everyone else, filling out forms and wondering whether he would get picked. DES MOINES, Iowa (AP)  Donald Trump is dividing his Republican presidential rivals anew with his call to rewrite the Constitution to crack down on millions of immigrants living in the U.S. illegally, and to force Mexico to pay for a better border fence. Scott Walker embraced some of the plan Monday, but other contenders, such as Chris Christie and Carly Fiorina, dismissed elements as unworkable. Trumps immigration proposal, his first formal policy plan since announcing his candidacy in June, won praise Monday from the GOPs conservative tea partyers, some of whom favor changing the Constitution to reverse the \"birthright citizenship\" guaranteed to anyone born in the United States, no matter the status of their parents. At the same time, surveys show a majority of Americans, including Republicans, support allowing many immigrants in the U.S. illegally to stay. Trump leads his Republican rivals in national polls, and his proposal quickly reverberated within the party, which has struggled with the issue of immigration. Party leaders are determined to expand the GOPs appeal with Hispanics after the 2012 election in which Mitt Romney won just 27 percent of the Latino vote. But many Republicans have adopted a hardline approach on immigrants, appealing to the partys core voters who play an oversized role in nominating primaries and caucuses. Asked at the Iowa State Fair on Monday if he supports building a wall along the U.S. Mexican border, as Trump has proposed, Wisconsin Gov. Walker gave a quick \"yes,\" but he declined to address whether he supports deporting children of parents in the country illegally. \"Going forward, the best thing we can do is enforce the law,\" he said. Walker, who reversed his position in April on allowing a chance for legal status for those in the country illegally, also gave mixed answers on ending birthright citizenship. Christie said during a CNN interview that a wall or fence along parts of the border, especially in more urban and difficult-to-control areas, was conceivable, but \"not the entire border. Doesnt make any sense.\" Likewise, the New Jersey governor is opposed to requiring Mexico to pay for the construction, saying Trumps suggestion \"makes no sense.\", \"And this is not negotiation of a real estate deal, OK. This is international diplomacy and its different,\" Christie said, noting Trumps line of business. Former Hewlett-Packard CEO Carly Fiorina called Trumps wall plan, \"completely unrealistic.\", Trump wasnt flinching Monday. \"The wall will work,\" he said when he arrived for jury duty in New York and a passer-by at the courthouse asked about the idea. He spent much of the day like other prospective jurors, filling out forms and waiting to see if he would be picked. In the end, he wasnt. Like Trumps early derogatory campaign statements about immigrants, his new plan has lit up angry conservatives. But it also has annoyed Republicans who see the nations growing Latino population as an opportunity to demonstrate sensitivity to minorities who have voted overwhelmingly Democratic in recent presidential elections. Tea party movement co-founder Mark Meckler said Trumps \"position on deportation generally reflects what likely voters think. Trump is dealing head-on with the difficult issues while more establishment candidates fret over focus groups and polls.\", Trump also is calling for eliminating federal aid to \"sanctuary cities,\" such as San Francisco, where local officials have decided not to use their police to enforce some federal immigration laws. The position is also supported by former Florida Gov. Jeb Bush. Like Christie, however, Bush differs sharply with Trump on other aspects of immigration policy. Though he didnt chime in specifically on Trumps new proposal, Bush supports allowing people in the country illegally who have not committed major crimes, who work and follow a course such as learning English and paying fines, to stay in the United States. In a late July Wall Street Journal/NBC News poll, 64 percent of Americans said they support either a path to permanent legal status or citizenship for immigrants in the country illegally. According to the poll, a small majority of Republicans fall into the same category. South Carolina Sen. Lindsey Graham, also speaking at the fair, called Trumps proposal \"gibberish,\" but warned it also sends a hostile signal toward Latinos voters. \"Youre not going to get 11 million people and drive them back out of this country,\" he said. \"Thats just not practical. Thats going to kill the Republican Party.\", Though Ohio Gov. John Kasich supports building a wall, he, like Bush supports maintaining birthright citizenship and allowing a pathway to legal status for immigrants. \"They are a very important part of most of our communities,\" Kasich said in South Carolina. \"For the bulk of them, they are God-fearing, good, hardworking people, and they are a part of our country now.\", Fiorina said to change birthright citizenship would be rigorous. \"It would take passing a constitutional amendment to get that changed. This is part of our 14th Amendment, and so honestly I think we should put all of our energies, all of our political will over finally getting the border secured and fixing the legal immigration system.\", ", "Date": "20150821", "Author": "[Thomas Beaumont, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Trump-immigration-proposal-divides-GOP-6449378.php", "Title": "[Trump immigration proposal divides GOP presidential field]"}