{"Content": "[ Caption, Close, FILE - In this Monday, Aug. 3, 2015, file photo, Republican presidential candidate and retired neurosurgeon Ben Carson speaks during a forum, in Manchester, N.H. Responding to a question during an interview broadcast Sunday, Sept. 20, 2015, on NBCs \"Meet the Press,\" Carson, a devout Christian, said Islam is antithetical to the Constitution and he doesnt believe that a Muslim should be elected president. White House press secretary Josh Earnest talks to reporters during the daily press briefing in the Brady press briefing room of the White House in Washington, Monday, Sept. 21, 2015. Earnest spoke about U.S. trade embargo against Cuba. Republican presidential candidate, businessman Donald Trump holds a Bible as he speaks during the Iowa Faith & Freedom Coalitions annual fall dinner, Saturday, Sept. 19, 2015, in Des Moines, Iowa. Republican presidential candidate, Ohio Gov. John Kasich addresses supporters during a reception at the 2016 Mackinac Republican Leadership Conference, Saturday, Sept. 19, 2015, in Mackinac Island, Mich. WASHINGTON (AP)  The Republican Partys plan to broaden its appeal with minority groups is clashing at times with comments from some of its presidential aspirants. Retired neurosurgeon Ben Carson says he believes that Islam is inconsistent with the Constitution and \"I would not advocate that we put a Muslim in charge of this nation.\", White House spokesman Josh Earnest said Monday that Carson was among the top GOP presidential candidates who have made offensive views in pursuit of political support, and that voters will surely take those views into account, both in the primary and in the general election. \"I think whats particularly disappointing to many observers, including me, is that we havent seen a significant outcry from all of the other candidates in the Republican race, and for the same reason, because theyre chasing for the same votes,\" Earnest said. Carsons comments, aired Sunday on NBCs \"Meet the Press,\" brought a quick rebuke from the head of the Democratic National Committee and a major advocacy group for Muslims, the Council on American-Islamic Relations, which noted that the Constitution expressly bars a religious test for those seeking public office. \"You cannot hold these kinds of views and at the same time say you will represent all Americans, of all faiths and backgrounds,\" said Ibrahim Hooper, the groups spokesman. For GOP leaders, the 2016 campaign offered a chance at redemption and a fresh pitch to minorities, gays, women and others beyond their traditional core supporters. After a blistering examination of the 2012 election, a report commissioned by Republican National Committee Chairman Reince Priebus concluded, \"If our party is not welcoming and inclusive, young people and increasingly other voters will continue to tune us out.\", To be sure, candidates Jeb Bush and others have disavowed some of that rhetoric or tried to stake out more moderate positions. It can be tough, though, to avoid getting drowned out by language sure to stir up people. Front-runner Donald Trump has stirred passions on illegal immigration to the point that Priebus asked him to tone down his rhetoric. Trump declined last week to correct a town hall participant who inaccurately stated that President Barack Obama is a Muslim. For Trump, the election of a Muslim president was \"something that could happen. Would I be comfortable? I dont know if we have to address it right now.\", 2016 hopeful Mike Huckabee, a former Arkansas governor, responded to Obamas nomination last week of an openly gay man to serve as Army secretary by saying the president \"is more interested in appeasing Americas homosexuals than honoring Americas heroes.\", After Trumps town hall, Bush made clear that he would not fuel the conspiracy theories about Obamas religion. \"He is an American, he is a Christian,\" the former Florida governor said Friday. Texas Sen. Ted Cruz, who taped Sunday an episode of Iowa Press, an Iowa Public Television program, was asked if he agreed with Carsons statements on Muslims being president. \"The Constitution specifies that there shall be no religious test for public office, and I am a constitutionalist,\" Cruz said. And an exasperated Sen. Marco Rubio, R-Fla. told ABCs \"This Week\" that \"these issues have been discussed ad nauseam over the last few years. Its a big waste of time. Barack Obama will not be president in a year and a half. Its time to start talking about the future of America.\", Ohio Gov. John Kasich earned applause last month in the first Republican debate when he said that he opposes gay marriage but accepted the Supreme Courts ruling making same-sex unions legal across the country. \"And guess what? I just went to a wedding of a friend of mine who happens to be gay,\" he added. \"Because somebody doesnt think the way I do doesnt mean that I cant care about them or I cant love them.\", Still, the rhetoric has provided an opening that Democrats are ready to try to exploit. \"Of course a Muslim, or any other American citizen, can run for president, end of story.\" said Rep. Debbie Wasserman Schultz, who leads the Democratic National Committee. \"To think otherwise is not only harmful to our political process, but it elevates and validates discrimination in this country.\", Steve Schmidt, who served as Republican Sen. John McCains top strategist in the 2008 presidential election, said its problematic for the GOP to be seen as intolerant, particularly with moderate voters who help sway the general election. \"Of course its worrisome if you have a party thats perceived as anti-Latino, anti-Asian, anti-gay, intolerant of Muslims,\" Schmidt said. Asked specifically about Carsons comments on NBC, Schmidt said it exposed him as an amateur politician and underscored his \"total lack of understanding about the American political system.\", Kevin Madden, who worked for GOP presidential nominee Mitt Romneys 2012 campaign, said the Republican field is expanding the base, despite some of the high-profile missteps. \"There are over a dozen candidates running for president right now who are shaping the profile of the party, and for everyone who promotes a view outside the mainstream, there are many more promoting views and policies focused on unifying the country and broadening the partys appeal,\" Madden said.]", "Date": "20150921", "Author": "[Kevin Freking and Julie Pace, Associated Press]", "Link": "http://www.chron.com/news/politics/article/GOP-wants-to-broaden-appeal-will-candidates-get-6518395.php", "Title": "[GOP wants to broaden appeal; will candidates get in the way?]"}