{"Content": "[ Caption, Close, Texas Gov. Greg Abbott, right, delivers his State of the State address to a joint session of the House and Senate, Tuesday in Austin, Texas. Texas Lt. Gov. Dan Patrick is at left. (AP Photo/Eric Gay), Gov. Greg Abbott, left, and Lt. Gov. Dan Patrick shake hands for the crowd during the Inauguration Parade along Congress Ave. in Austin, Texas.  Tuesday, Jan. 20, 2015. In the State of the State speech before a joint session of the Legislature, his first major policy speech, Texas new governor Greg Abbott outlined his priorities, including early childhood education. See his priorities for Texas. Beefed-up early education programs to ensure that children get a good start at life, along with changes to give parents more choice in where their kids attend school. Although he made no mention of vouchers, he spoke about successful open enrollment programs in several districts. Doubling the amount of state spending on border security, including 500 more troopers and more Texas Rangers to curb criminal activity, along with keeping National Guard troops along the border with Mexico until state police can ramp up their forces to take the soldiers place. Allowing school districts to opt out of some state education rules, to give local school districts more control over educating children. Adding an additional $500 million for higher-education research initiatives to strengthen Texas place in the future economy by attracting top programs and researchers to state universities. Putting an additional $4 billion in transportation funding to untangle gridlocked highways, ending diversion of highway funds to other budget purposes and dedicating half of the motor-vehicle sales tax to road projects. Reforming state ethics laws to require more public disclosure about the financial holdings of public officials, and more disclosure of campaign contributions. Calling for the costs of state government to be reduced, Abbott said he is cutting his own budget by 3 percent and called for most state agencies to do the same, with the exception of key public safety functions. AUSTIN - Lt. Gov. Dan Patrick is trying to distance himself from his Tea Party advisory panel, after its members penned a letter blasting Gov. Greg Abbotts quality pre-K legislation as \"socialistic\" and \"a threat to parental rights.\", \"We are experimenting at great cost to taxpayers with a program that removes our young children from homes and half-day religious preschools and mothers day out programs to a Godless environment with only evidence showing absolutely NO LONG-TERM BENEFITS beyond the 1st grade,\" the letter, sent to the state Senate on Tuesday, reads. RELATED:Texas Gov. Greg Abbott, wife paid $104 combined in federal income taxes, It was signed by all 20 members of the lieutenant governorsGrassroots Advisory Board,\" a group of Tea Party leaders Patrick chose soon after taking office to meet regularly and discuss public policy, especially as it related toborder security, education reform, and tax relief legislation. \"This interference by the State tramples up our parental rights,\" the letter adds. \"The early removal of children from parents care if historically promoted in socialistic countries, not free societies which respect parental rights.\", Abbott has made quality pre-kindergarten one of his top priorities this session, after running heavily on the issue during the 2014 gubernatorial election. House Bill 4 is modeled on those pledges, and promises to funnel $130 million in state money to incentivize high-quality, half-day pre-kindergarten programs for certain children. The proposed legislation would not expand eligibility - currently the state only funds pre-K for 4-year-olds from low-income, military and non-native English speaking families - but would offer additional funding to programs that meet certain accountability and quality standards. Abbotts office did not directly address the letter in a statement released later Tuesday. \"Governor Abbotts pre-k initiative is a conservative antidote to ineffective pre-existing pre-k programs because it adds accountability, implements high-quality education standards, gives parents and teachers the freedom to determine how best to educate their students and helps schools avoid a one-size-fits-all approach,\" said Abbott press secretary Amelia Chasse. \"It will ensure tax dollars are used more effectively and reduce the $1.7 billion in tax dollars spent on remediation education programs.\", While Patrick quickly distanced himself from the letter Tuesday, saying it was \"unsolicited\" and expressed \"the individual viewpoints of Texas citizens,\" House Bill 4 has not yet been approved by the chamber he oversees. The letter - and any further delay in the Senate hearing Abbotts pre-K bill - is sure to create friction between the states two most powerful elected officials. Last week, Abbott refused to choose sides in the ongoing debate over tax cuts, saying both the House and Senates plans are possible paths. Patrick, however, has framed himself as Abbotts true ally, issuing statements that often start \"Governor Abbott and I...\" or \"I agree with Governor Abbott...\", ]", "Date": "20150421", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Dan-Patrick-advisory-panel-says-Abbott-pre-K-bill-6214494.php", "Title": "[Lt. Guv advisers call Abbott pre-K bill 'socialistic']"}