{"Content": "[ Caption, Close, , MANY CAUSES: No one can say that Rep. Sheila Jackson Lee ignores her constituents. Shes been involved in nearly every major issue impacting Houston over the years. SOUTHMORE STATION: Louis C. Ray, center, holds the hand of  U.S. Rep. Sheila Jackson Lee, left, in appreciation for her efforts to preserve the Southmore Station post office. Rep. Sheila Jackson Lee, D-Houston, holds posters in support of saving the Southmore Station post office during her town hall meeting on Jan. 11, 2014 in Houston. NIGERIAN SCHOOLGIRLS: U.S. Rep. Sheila Jackson Lee, D-Texas, spoke Sunday at St. John Missionary Baptist Church, where members of Houstons Nigerian community and others hoped to bring more attention to 276 abducted schoolgirls. TAKING OFFICE: House Speaker John Boehner, of Ohio performs a mock swearing in for Rep. Sheila Jackson Lee, D-Texas, Thursday, Jan. 3, 2013, on Capitol Hill in Washington as the 113th Congress began. VOTING: Rep. Sheila Jackson Lee speaks holds a news conference in front of the federal courthouse on Monday, Nov. 5, 2012, to inform Houston-area voters about the process in Harris County and the state of Texas. EQUAL RIGHTS: Rep. Sheila Jackson Lee also joined the NOH8 (No Hate) campaign for gender and marriage equality. RECOGNIZED: Elwyn Lee and honoree U.S. Rep. Sheila Jackson Lee attended the Houston NAACP 2012 Freedom Fund Gala on Friday, Oct. 26, 2012, at the Hilton Americas. TRAYVON MARTIN: Rep. Sheila Jackson Lee greets Trayvon Martins parents, Tracy Martin and Sybrina Fulton, during a House Judiciary Committee briefing on racial profiling and hate crimes on March 27, 2012. CONGRESSIONAL BLACK CAUCUS: Rep. Emanuel Cleaver II,  D-Mo. center, accompanied by fellow CBC members, speaks outside the White House in Washington, Thursday, May 12, 2011, following their meeting with President Barack Obama. From left are, Del. Eleanor Holmes Norton, D-D.C. Rep. Sheila Jackson Lee, D-Texas, Rep. Laura Richardson, D-Calif. Rep. Bobby Scott, D-Va. Rep. Barbara Lee, D-Calif.  Cleaver, Rep. Bobby Rush, D-Ill. Rep. Donald Payne, D-N.J. and Rep. Charles Rangel, D-N.Y. GRADUATION: Congresswoman Sheila Jackson Lee speaks during graduation ceremonies at Texas Southern University on Saturday, May 12, 2012, in Houston. SPORTS FAN: Rep. Sheila Jackson Lee joins Houston officials for the May 1, 2012, ribbon-cutting on the Houston Dynamos BBVA Compass Stadium. LIBYA: Sara Baaba of Houston shakes hands after Rep. Sheila Jackson Lee made a statement about Moammar Gadhafis death and what she hopes to see in the North African countrys future on Thursday, Oct. 20, 2011, in the Mickey Leland Federal Building in Houston. THANKSGIVING: U.S. Rep. Sheila Jackson Lee helps distribute turkeys on Nov. 23, 2010, at the Latino Learning Center in Houston. COMMON CONCERN: U.S. Sen. Ted Cruz greets U.S. Rep. Sheila Jackson Lee after both spoke at the official kickoff of National School Choice Week in January 2014. The crowd cheers a during a speech by US Rep. Sheila Jackson Lee at the Official Kickoff of National School Choice Week. RODEO READY: Rep. Sheila Jackson Lee waves during the 76th annual Houston Rodeo Parade on Saturday, March 1, 2014, in Houston. , MANDELA TRIBUTE: Congresswoman Sheila Jackson Lee right, speaks during a candle light vigil for Nelson Mandela at Lucy Ethiopian Restaurant and Lounge on Friday, Dec. 6, 2013, in Houston. Johan Zaayman, center, and others hold candles as they take part in a prayer vigil in honor of Nelson Mandela sponsored by Congresswoman Sheila Jackson Lee outside the Bob Casey Federal Courthouse, Friday, Dec. 6, 2013, in Houston.  Around 10 people braved the cold weather to take part in the event. GOVERNMENT SHUTDOWN: Rep. Sheila Jackson Lee listens to House Minority Whip Steny Hoyer of Md. during an Oct. 4, 2013, event with the Democratic Progressive Caucus and furloughed federal employees blaming Republicans for the government shutdown. MINIMUM WAGE: Protesters rally in front of a Taco Bell. U.S. Rep. Sheila Jackson Lee said fast-food workers arent just teenagers working part-time. Many employees are parents supporting their families, she said. Rep. Sheila Jackson Lee, D-Houston, came under fire after claiming the Democratic-controlled House never tried to impeach President George W. Bush  even though she supported a resolution to do so in 2008. Rep. Sheila Jackson Lee, D-Texas, had an \"oops\" moment when she said the U.S. Constitution was some 400-years-old. Unfortunately, it was 173 some years off its actual creation date: Sep. 17, 1787. See other notable quotes from the polarizing Texas congresswoman. (Photo from C-SPAN / YouTube), , Rep. Sheila Jackson Lee made headlines for suggesting \"welfare\" should be called a \"transitional living fund.\"Related: Sheila Jackson Lee proposes new term for \"welfare\", In the wake of the oncoming sequester in early 2013, Lee demanded GOP leaders who saw President Barack Obama as being divisive to \"take the cotton out of their ears.\", \"Im a queen and demand to be treated like one,\" a former staffer recalled Lee saying. It was never officially recorded, but ex-aides to Lee went to the Daily Caller to complain about her being the worst boss in the Capitol. In response to a NRA ad that featured President Obamas two daughters, Lee said the NRA was \"reckless and irresponsible\" and may have \"jeopardized the security of the first family.\", In response to school safety, Lee says they should be fortresses but not armed. Conservatives quickly jumped on Lee after she said this on the house floor:, , Lee called for \"zero tolerance\" regarding the agents involved in the Secret Service prostitution scandal in 2012. Soon after Trayvon Martins death, Lee questioned George Zimmermans actions:, In response to allegations that there may have been fraud in the 2008 presidential elections, Lee brought race into play when she said the allegations probably startedmaybe because we elected the first African American president. In what is considered a big faux-paus on the House floor, Lee gave the University of Houston some props:, To all the bloggers, shut up and stop playing racial politics, Lee said on the PBS talk show program hosted by Tavis Smiley. \"This is not an idea of anyone over another person. Republican and Democratic Senators have already voted for this clean bill that we could vote on today. We have martial law. What that means - and my colleagues know what it means - is that you can put a bill on in just minutes,\" Rep. Sheila Jackson Lee, D-Houston.  Related: Read the full text of her speech here. Rep. Sheila Jackson Lee of Houston has publicly come forward with a fellow house representative to denounce female genital mutilation and so-called \"vacation cutting season\" in the hopes of getting President Barack Obama and federal agencies to take steps to fight the practice here and abroad. In a press statement released on Thursday, the congresswoman thanked U.S. Representative Joe Crowley (D-NY), female genital mutilation survivor and activist Jaha Dukureh, plus international human rights organization Equality Now for devising this new call to action. Dukureh tells her story of being mutilated as an infant in Gambia, finally making it to the United States at the age of 15 just a decade ago. She escaped a forced marriage there and fled to Atlanta where she currently resides. \"It took away a part of my femininity, my ownership to my body. Some girls, including my half-sister who died from complications from being cut, even lose their lives,\" she writes in the materials for the Change.org petition to draw up an updated prevalence report on FGM in this country. That petition now has just over 205,000 virtual signatures. Female genital mutilation is illegal in the United States. Under the Girls Protection Act of 2011, it was made a federal crime to transportAmerican girls overseas for the purpose of FGM. The United Nations General Assembly has already deemed it a violation of human rights as well. According to the press release, vacation cutting season\" comes in the summer when girls are usually on break from American schools and are sent to other countries to undergo FGM to adhere to cultural norms. What Jackson, Crowley and 58 members of the U.S. House are calling for from top officials at the Departments of Justice, State, Health & Human Services, and Education, the U.S. Agency for International Development and the White House Office of Management and Budget is for a cross-agency plan to further fight FGM. This would include funding for resources to help law enforcement, health workers, and educators detect the practice here in this country, plus a hotline for girls who may be in danger of mutilation. The goal of all involved, stated in the press release, is to eradicate the practice globally. According to a World Health Organization fact sheet on the practice, FGM procedures intentionally alter or cause injury to the female genital organs for non-medical reasons. There are no health benefits, regarding FGM, only harm. FGM is typically carried out on girls and women between the ages of just a few months to the age of 15. According to WHO, over 125 million girls and women alive today have been cut in the 29 countries in Africa and Middle East where FGM is concentrated. The practice can cause numerous problems down the line for the victims, including severe bleeding, problems urinating, and infections and cysts. Some can even become infertile or have a risk of high infant mortality. By creating a national strategy, the U.S. would join the ranks of countries like the United Kingdom and Italy that, over the past decade, have begun adopting and supporting vigorous, pro-active practices to help end FGM,\" Lee said in the press release.]", "Date": "20140612", "Author": "[By Craig Hlavaty]", "Link": "http://www.chron.com/news/politics/texas/article/SJL-house-reps-call-for-more-action-on-FGM-in-5548128.php", "Title": "[Sheila Jackson Lee's latest stance is against female genital mutilation]"}