{"Content": "[ In a landmark shift in U.S.-Cuban relations toward cooperation and the restoration of diplomatic ties, President Barack Obama has changed the face of diplomacy and ideological politics in the Western Hemisphere. Of course, the main takeaways from the speech are indeed Cuba-specific. Washington will establish an embassy in Havana for the first time since 1961. Cold War-era security policy will be revised with the goal of removing Cuba as a state sponsor of terrorism. Travel, commerce and telecommunications restrictions will be eased dramatically. A closer listen to Obamas speech, however, also reveals some of the most progressive changes to U.S. policy in Latin America since FDRs noninterventionist Good Neighbor policy, which dissolved under Cold War tensions and fear of communist proliferation in the region. With this speech, the Western Hemispheres equivalent of the Berlin Wall has begun to crumble, propelling U.S.-Latin American relations into the 21st century. Nod to Monroe Doctrine coercion, The shift in U.S. policy on Cuba - until today, an entrenched symbol of ideological differences in the region - sends a strong signal across the hemisphere that the U.S. is indeed ready for \"renewed leadership in the Americas.\" Obama revealed that Cuba will send its first-ever representative to the 2015 Summit of the Americas, which will also now host members of civil society. For years, the absence of Cuba at the summit, largely at the insistence of the U.S. has frustrated other heads of state, thus hindering multilateral diplomacy. In addition to denouncing communism, drug cartels, dictators and fraudulent elections, Obamas remarks take a stab at colonialism and recognize the common Latin American perception of the U.S. as a regional colonizer. Between the lines here, Obama - albeit lightly - acknowledges Washingtons long habit of coercion in the region under the Monroe Doctrine. He envisions that \"a future of greater peace, security and democratic development is possible if we work together - not to maintain power, not to secure vested interest, but instead to advance the dreams of our citizens.\" These comments, although relatively vague next to the concrete actions taken on Cuba, are a step in the right direction for mutual prosperity and respect among all countries in the Western Hemisphere. Accepting democraphic realities, On the home front, improved foreign relations with Cuba and Latin America have a direct impact on the lives of many U.S. citizens and residents, especially those with Latin American roots. Obama mentions Miamis proximity to Havana and the thousands of Cubans who fled to the United States under the Castro regime. Today, Miamis diversity continues to grow, attracting immigrants from Venezuela, Argentina and Brazil, adding to the increasingly visible Latin American diaspora across the country, as weve seen in Houston as well. With this in mind, Obama indirectly embraces the United States as an integral part of a region often thought of as culturally distinct. He does not shy away from demographic realities, and paints Miami with its moniker - \"the capital of Latin America\" - as \"a profoundly American city - a place that reminds us that ideals matter more than the color of our skin, or the circumstances of our birth; a demonstration of what the Cuban people can achieve, and the openness of the United States to our family to the South.\", Obamas rhetoric and executive decisions unfortunately fall short of lifting the embargo. That remains up to Congress. The events of the week nonetheless represent a historic beginning to the end of an era for the sake of a more united Western Hemisphere. Speaking for the American people, but poignantly doing so in Spanish, the president declares a mutual brotherhood: Were all American. \"Todos somos Americanos.\", , McNally is a research analyst in the Mexico Center of Rice Universitys Baker Institute.]", "Date": "20141219", "Author": "[By Dylan McNally]", "Link": "http://www.chron.com/opinion/outlook/article/McNally-Obama-makes-vast-progressive-changes-to-5969385.php", "Title": "[McNally: Obama makes vast, progressive changes to U.S. policy in Latin America]"}