{"Content": "[ August 18, 1992: On this day, President George H.W. Bush took a little break from the Republican National Convention and channeled his inner karate master when he put on an honorary karate uniform and black belt jacket. The President joined Chuck Norris at a local middle school to watch an exhibition by children who belonged to an anti-drug program sponsored by the one and only Walker, Texas Ranger. When President Bush was asked if he would \"drop-kick\" Bill Clinton home to Arkansas in November, Bush winked at reporters and flashed an OK sign. Caption, Close, Forever 41: Cool facts about George H.W. BushWhile he was a senior baseball player at Yale, Bush got to meet the  legendary Babe Ruth just months before the sluggers death during a  ceremony where Ruth donated the original transcript of his autobiography  to the college. When his son George W. Bush was elected president in 2000, it was just  the second time in history when a father and son had both been elected  to the high office. The other pair? John and John Quincy Adams. For years, Bushs principal supplier of socks has been Spike Heminway, a  long-time friend and golfing buddy from Kennebunkport, Maine. Bush has  even given out socks as Christmas gifts. The gift shop at the George  Bush Presidential Library and Museum on the Texas A&M campus is  selling limited edition pairs of \"41\" socks right now. At 90 years old, Bush is not the president who lived the longest just  yet. He has three and half years until he beats the current reigning  champ, Gerald Ford, who lived to be 93 years and 165 days old. He died  in 2006, the day after Christmas. When Blackberry phones were all the rage in the days before the  proliferation of the iPhone, Bush 41 was a big fan of the devices  according to those who spent time with him. Last summer Bush and members of his Secret Service detail all shaved  their heads in solidarity with the young daughter of a Secret Service  agent who was in the midst of a fight with leukemia. When the couple was a constant mainstay at Houston Astros games at  Minute Maid Park, Barbara was fond of the game with a scorecard, which  is becoming a lost art. Seriously, most people wouldnt know how to read  a scorecard, let alone fill one out. Bush began his career in public service as an 18-year-old Navy pilot  flying a torpedo bomber off the USS San Jacinto in the South Pacific  during World War II. Six years ago the USS George H.W. Bush, the 10th  and last of the Nimitz class aircraft carriers and the only carrier to  be named for a carrier pilot was commissioned. Bush was there with a  brood of Bushes to commemorate the event. George met his wife of 69 years, Barbara Pierce, at a Christmas party in 1941. They wouldnt be married until January 1945. How many ex-presidents do you know that go skydiving to celebrate their  90th birthday? Bush 41 did, this morning in Maine. He even made sure to  tweet about it first. He also did this on 75th, 80th, and 85th  birthdays. In total hes made eight jumps. He might just Baumgartner it  back to Earth for his 100th. The President also told reporters that he thought expectations about the importance of his upcoming Republican nomination acceptance speech were being raised too high. Of course, President Bush would go on to lose his re-election bid to Clinton that November. Have you ever met the President or Chuck Norris? Tell us in the comments below, or tweet our host, Michael Callahan, @MCallahanTV using #ForgottenDayHOU, and hell tweet you back!]", "Date": "20150818", "Author": "[Carolina Gonzales]", "Link": "http://www.chron.com/chrontv/this-forgotten-day-in-houston/article/23-years-ago-President-George-HW-Bush-teamed-up-6450702.php", "Title": "[23 years ago: President George HW Bush teamed up with Chuck Norris]"}