{"Content": "[ Caption, Close, This handout photo provided by Collin County, Texas shows Texas Attorney General Kenneth Paxton, who was booked into the county jail Monday, Aug. 3, 2015, in McKinney, Texas. A grand jury last week indicted Paxton on felony securities fraud charges. (AP Photo/Collin County via AP), Theres little surprise in Texas Attorney General Ken Paxtons felony indictments for securities fraud and failing to register with the state to sell securities (\"Paxton indicted on felony charges, Page A1, Sunday). The longtime lawmakers legal troubles have been public knowledge for some time. During the 2014 election season, political watchers routinely warned voters about Paxtons record of insider dealings and kickbacks. As we wrote during the primary runoff: \"Voters shouldnt want a lawyer-in-chief who will confront the wrong end of a grand jury on day one.\", It took a bit longer than one day, but here we are at the predictable inevitability of a broken political system. Paxtons campaign for attorney general was a parade of red flags. News poured from the woodwork about admissions to lawbreaking, failures to fill out ethics disclosures, lawsuits about breach of fiduciary duty and instances of him investing with companies that suspiciously went on to land state contracts. There was even the odd story about him stealing another lawyers $1,000 pen. This should have been enough to doom a man in a competitive primary race, but serious allegations seemed to matter less than an endorsement from now-U.S. Sen. Ted Cruz. It didnt have to be like this. Republican primary voters had a fine candidate in Paxtons opponent, former state Rep. Dan Branch of Dallas. A seasoned conservative, Branch could tout the endorsements of many legal advisers to then-Attorney General Greg Abbott and support from former President George W. Bush. While in the Legislature, Branch proved capable and pragmatic. \"Conservatives have a responsibility to govern,\" he told the Chronicle editorial board during his endorsement meeting. Unfortunately, Republican primary voters saw little to like in Branchs camaraderie with Texas Speaker of the House Joe Straus, a moderate Republican and tea party target. Democratic candidate Sam Houston didnt fare much better in the general election. Now were stuck with an attorney general who will be too busy tending to self-inflicted wounds to fulfill the business of his office. Government transparency, consumer protection and all manner of regular governing will have to take a back seat to Paxtons personal legal woes. This unforced error should remind Texans that they have a duty to vote in primaries not on the basis of their political allegiance, but with a strategic mindset aimed at blocking the worst that our state has to offer. Until Republican primary voters love Texas more than they hate Straus, well be stuck with politicians who have more ambition than ethics. ]", "Date": "20150804", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/There-was-no-surprise-in-Ken-Paxton-indictment-6422565.php", "Title": "[There was no surprise in Ken Paxton indictment]"}