{"Content": "[Sen. Ted Cruz (R-Texas) isnt buying White Houses spin on the last election  and he suggested administration officials might be on drugs if they truly believe what theyre saying about what the vote means for President Barack Obamas upcoming executive action on immigration. White House Press Secretary Josh Earnest said on Wednesday that the message Obama took from the Republican midterm election landslide was the American people expected the president to make \"progress\" despite congressional gridlock. Cruz respondedin an interview with Fox News host Megyn Kellylater in the day by joking the White House must be high on marijuana if they honestly believe that line. \"If theyre spinning that the message of this last election is that Congress should suddenly agree with President Obamas policies and roll over, then theyve traveled to some of these states that have legalized marijuana and theyve been smoking something. Because that aint what that election was,\" Cruz quipped. Cruz, an outspoken conservative looking at potentially running for president in 2016, made the comments as he fiercely criticized Obamas executive action on immigration, which is scheduled to be announced Thursday night. \"There is not, in recent times, any parallel for a president, repudiated by the voters, standing up and essentially telling the voters, Go jump in a lake,\" Cruz said. Cruz, who previously accused Obama of \"acting like a monarch\"in an op-ed published Wednesday, took the line to the next level with Kelly when he cited the Revolutionary War. \"In the founding of our country, our framers were familiar with the monarchy; they were familiar with the despotic king. And we fought a revolution to be free from King George, to have the rights of the people protected by a Constitution, protected by a Congress. And if you read the Federalist Papers, they talk about the dangers of a despotic executive that rules by fiat,\" Cruz said. Cruz further said the executive action was a \"moment of testing\" for Republicans, whom he called to take decisive action to block Obama. \"If the president goes forward with this  if he goes forward unilaterally defying the Congress elected by the people, defying the American voters then its incumbent upon Republicans in Congress to use every single constitutional tool we have to defend the rule of law, to rein in the president. So the president doesnt become an unaccountable monarch,\" he said. Watch Cruzs interview below. , Join the conversation about this story , See Also:]", "Date": "20141120", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/TED-CRUZ-White-House-Has-Been-Smoking-5906593.php", "Title": "[TED CRUZ: White House Has 'Been Smoking Something' If They Think People Want Obama's Immigration Order]"}