{"Content": "[ Caption, Close, Donald Trump and Rick Perry. , Rick Perry, The former Texas governor and Republican presidential candidate told ABC News host George Stephanopoulosthat Trump does not represent the Republican Party. He said, I was offended by his remarks. Listen, Hispanics in American and Hispanics in Texas from the Alamo to Afghanistan have been extraordinary people and citizens of our country and state. They have served nobly. And to paint with that broad a brush that Donald Trump did hes going to have to defend those remarks. I never will and I will stand up and say that those are offensive, which they were. , Click through our slideshow to see what other politicians and celebrities had to say about Trumps allegations... Rick Perry, The former Texas governor and Republican presidential... Ted Cruz, Jeb Bush, Marco Rubio, , Chris Christie, According to Fox News Insider, the Republican presidential candidate said of Trumps comments, \"I think what he said was wrong. It was inappropriate and I dont think it has any place in the campaign.\", Chris Christie, According to Fox News Insider, the Republican... Mike Huckabee, , Aaron Paul, The \"Breaking Bad\" actor tweeted, \"Dead Donald Trump, Youre an idiot.\", Aaron Paul, The \"Breaking Bad\" actor tweeted, \"Dead Donald... Shakira, Arnold Schwarzenegger, Melissa Rivers, , Eva Longoria, Eva Longoria, Roselyn SnchezThe television star stepped down as co-host of this years Miss USA pageant, which is operated by the Miss Universe Organization and owned in part by Trump.\"I was very excited and proud to have been invited to participate in Miss USA, but as a Latina, that is now inconceivable,\"she told Billboard. \"Although I am not Mexican, I am Puerto Rican and a proud Latina, and his comments were an insult to our culture. I wont sponsor anything produced by Donald Trump.\", Roselyn Snchez, The television star stepped down as co-host of this years Miss USA pageant, which is operated by the Miss Universe Organization and owned in part by Trump. \"I was very excited and proud to have been invited to participate in Miss USA, but as a Latina, that is now inconceivable,\"she told Billboard. \"Although I am not Mexican, I am Puerto Rican and a proud Latina, and his comments were an insult to our culture. I wont sponsor anything produced by Donald Trump.\", Roselyn Snchez, The television star stepped down as co-host of... Cristian De La Fuente, J Balvin, Rob Schneider, Jorge Ramos, , Flo Rida, Natalie La Rose, , Cheryl Burke, , Emmitt Smith, The former Dallas Cowboys star withdrew from his role as a judge of the Miss USA pageant. Emmitt Smith, The former Dallas Cowboys star withdrew from his... WASHINGTON  Former Texas Gov. Rick Perry stuck to his guns Wednesday, taking another jab at what he calls the \"barking carnival act\" of his fellow Republican presidential contender Donald Trump in their ongoing feud. \"Let no one be mistaken -- Donald Trumps candidacy is a cancer on conservatism, and it must be clearly diagnosed, excised and discarded,\" Perry said at a Washington forum for the Opportunity and Freedom PAC, an independent group that has raised nearly $17 million in support of his bid. His remarks came on the eve of Trumps visit to Laredo, where he plans to tour the border on Thursday. The former Texas governor added a new insult to his growing repertoire of analogies for Trumps campaign: \"Empty calories.\", The bad blood began in June when Perry slammed the real estate tycoons characterization of undocumented immigrants as criminals and rapists, making Perry one of the first in the GOP field to question whether Trumps views reflect the Republican Party, which has been trying to make inroads with Hispanics and other minorities. Since then, Perry has coined the phrase \"Trumpism\" for his opponents campaign, which he described as \"a toxic mix of demagoguery, mean-spiritedness and nonsense.\" At Wednesdays forum, Perry reopened fire on Trump for his remark attacking the war record of Republican Sen. John McCain, a former Navy pilot and POW. \"[Trump] breathes the free air thousands of heroes died protecting,\" Perry said, firing back. \"And he couldnt have endured for five minutes what John McCain endured for five and a half years.\", The cross words come as Trump has taken a double-digit lead in some polls. Meanwhile, Perry has registered support in the single digits, leaving him in danger of disqualification for the opening Republican presidential debate August 6. Talking to reporters after the forum, Perry minimized the importance of the debate in Cleveland. \"Im not concerned about being on the stage,\" he said. \"What Im focused on is spending time in Iowa, New Hampshire, South Carolina.\", The forum of Perry supporters included former Dallas state representative Kenneth George, who highlighted the importance of the Hispanic vote in the 2016 elections. Trump also came under fire in the forum. \"Donald Trump provides actually an opportunity for Republicans,\" said Alfonso Aguilar, executive director of the American Principles Projects Latino Partnership. \"It can hurt the Republican party if Republicans remain quiet. Let [Trump] be on stage in the debate, but lets isolate him by denouncing forcefully what hes saying.\", The Perry campaign also released a video of Trumps previous compliments about the former Texas governor, which can be viewed above.]", "Date": "20150722", "Author": "[Tatiana Cirisano, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/article/Perry-Trump-s-campaign-is-a-barking-carnival-6400362.php", "Title": "[Perry: Trump's campaign is a 'barking carnival act']"}