{"Content": "[ Caption, Close, Cartoonist Signe Wilkinson says he adores Ted Cruzs \"glass jaw.\", Cartoonist Adam Zyglis says Chris Christie \"takes the cake\" for caricatures, and Donald Trump \"comes in at a close second.\", WASHINGTON  Another week, another prime candidate. Oh, not for voting on. No, we mean that another presidential contender, by declaring, has gone and entered the cartoonists den. Now visual satirists, they dont approach the whole business of American democracy in action quite like normal folk. As this national match of electoral poker plays out, political artists often play their cards close to the vested interests. Because they are paid to be artful jokers, they necessarily have skewed preferences over who is shooting to be kings and queens. And the graphical pull together certain candidates is inevitable. \"Whats good for us political satirists certainly isnt necessarily good for the rest of the world. I believe the German word for this is schadenweldenfreude, \" jokes Matt Wuerker, the Pulitzer-winning cartoonist for Politico. \"For us, its the loonier the better.\", And from the right side of the political aisle, Steve Breen, the Pulitzer-winning cartoonist for the San Diego Union-Tribune, acknowledges how a specific candidate trait can lure cartoonists like a moth to the flame  like some lantern of sheer lampoonability. \"A cartoonist is inexorably drawn to Trumps bombastic arrogance,\" Breen said, \"like a lecherous multimillionaire is attracted to a young, Slavic model.\", So with all these stacking-up hats thrown in the political ring, just which candidate is emerging as the most fun to caricature? From toupeed head to toe, who embodies the most delicious smorgasbord of richly exaggerated features?, Well, with that very puzzler in mind, I approached nine of the nations top political cartoonists, both liberal and conservative, to ask: Who from among the electoral hordes is your favorite current presidential candidate to draw?, How they answered:, Nate Beeler (Columbus Dispatch):, As of now, Ive only drawn a handful of the candidates. The one Ive tackled the most is Hillary Clinton, but Im not super-happy with my version of her. Of the Republicans, I think Ted Cruz is the most fun to draw because his features are so interesting-looking. He reminds me of the silent-movie stars. Cant you just picture him in black and white, either as a swashbuckling hero come to save Washington, or a black-clothed villain tying an Obamacare maiden to the train tracks? Im eager to draw him and Rand Pauls curls as we get closer to 2016. The one possible GOP contender who gives me fits is the guy Ive drawn the most: Ohio Gov. John Kasich. Theres something about his face that throws me every time I sit down at the drawing board. I usually blame it on the fact that he lacks eyebrows. Steve Breen (San Diego Union-Tribune):, It has to be Donald Trump. I love going after him. I know hes an easy target, but he has such a nice, puffy face and weird head of hair. Plus, a cartoonist is inexorably drawn to Trumps bombastic arrogance like a lecherous multi-millionaire is attracted to a young, Slavic model. Kevin \"Kal\" Kallaugher (The Economist and the Baltimore Sun):, Christie is among the most interesting to engage as a caricature because his body is an essential feature of his recognition. It is hard to utilize the typical Big Head/Little Body equation that is conventional in cartoons because his body shape makes his head look small. He has been grappling with a weight problem for some time, and it would be an easy target for cartoonists to poison his portrait with a little padding around the waist. The challenge for me is to create an effective caricature that doesnt appear to be gratuitously adding pounds, but instead accentuates the total shape of his head/body combination. Mike Luckovich (Atlanta Journal Constitution):, Of all the clowns in the Republican clown car, my favorites Jeb. Theres an arrogance about him, and its funny when hes asked questions he shouldve seen coming and stumbles over them. With Jindal, Cruz, Christie, Huckabee and Jeb, to name but a few, this group is like something \"Saturday Night Live\" dreamed up. Jimmy Margulies (The Record):, Since I have been drawing cartoons of Chris Christie as New Jersey governor since he took office, I would have to go with him as a favorite. He has been running for president almost from the day he first took office, even if he declined to get into the race in 2012. His at-times intemperate outbursts  as well as policy decisions that have been both self-serving towards his candidacy, as well as highly questionable in terms of what is best for New Jersey  have made him, as one observer characterized it: \"The gift that keeps on giving.\", I dont know how successful he will be as a candidate this time, but according to his announcement speech, he promises to be outspoken and hold little back, so it is likely he will generate some controversy that becomes good cartoon fodder for New Jersey audiences, and possibly national ones, as well. Scott Stantis (Chicago Tribune):, I have been drawing Hillary and her ever-changing hair for 20 years, so there is some comfort in familiarity there. Christie is a big bucket of goo, and thats always fun, but my favorite so far is Ted Cruz. He looks a lot like Joe McCarthy. Heavy brows and narrow eyes. A pointed nose and a lipless mouth. Add a five oclock shadow and there he is. Signe Wilkinson (Philly.com):, I like them all except for Lindsey Graham, who  like so many nice-looking, pale-haired, middle-aged white men  has no discernible features. [I] adore Ted Cruzs glass jaw. Matt Wuerker (Politico):, The start of a campaign puts a cartoonist in that awkward spot of having to choose between whats best for the country and whats best for satire. Whats good for us political satirists certainly isnt necessarily good for the rest of the world. I believe the German word for this is \"schadenweldenfreude.\" For us, its the loonier the better, so its hard to beat Donald Trump when it comes to being the ideal generator of juicy political bombast and ready-made political satire. And then, of course, theres his hair. Adam Zyglis (Buffalo News):, I would say the larger-than-life Christie takes the cake  no pun intended. He has a Mafioso quality that makes it incredibly fun to draw. His physical size, distinctive features and strong personality lend well to caricature, to say the least. The fact that hes a more legitimate candidate makes him a more important target than Trump, in my opinion. Trump comes in at a close second, and its 100 percent because of the hair, of course. If you can imagine the Donald with a generic hairdo, he would be infinitely less interesting to draw. That said, his egoism and outrageous comments have been a magnet to satirists. Its like T-ball for cartoonists. Hes clearly the vanity candidate.]", "Date": "20150702", "Author": "[Michael Cavna, The Washington Post]", "Link": "http://www.chron.com/news/politics/election/article/Christie-Trump-Here-s-the-candidate-nation-s-6363514.php", "Title": "[Christie? Trump? Which candidate is cartoonists' fave?]"}