{"Content": "[ WASHINGTON (AP)  A decade from now, Americans will look back \"shocked and embarrassed that immigration reform was so hotly contested,\" Los Angeles Mayor Eric Garcetti predicted Wednesday during a speech at the National Press Club in Washington. Garcetti likened attitudes on immigration to what has taken place with gay marriage over the past decade, as more Americans and politicians support allowing same-sex couples to enter into legally valid marriages. A decade ago, politicians from both parties treated same-sex marriage as taboo, he said. Garcetti used the speech to highlight two Democratic priorities: reducing income inequality and providing a pathway for legal and undocumented immigrants to stay in the country permanently. On wages, Garcetti pointed to Los Angeles new law to incrementally increase the minimum wage to $15 an hour as an example of helping those struggling to make ends meet. On immigration, he called Los Angeles the epicenter of an immigration reform movement that is gradually gaining support nationally. Garcetti, who noted that he is half-Mexican and half-Jewish, said he was not offering any new, brave polices through his speech, but a return to the nations past, which is embracing diversity as the strength of the nation. He said Los Angeles formed an office of immigration affairs that makes sure immigrants have a say on city policies. He said the city also uses its libraries to help legal permanent residents access jobs, health benefits and become citizens. In addition, Los Angeles is part of a coalition of cities that supports President Barack Obamas efforts to provide millions of undocumented immigrants with relief from deportation. \"We as mayors and cities are now leading because we must.  We have to fill this vacuum,\" Garcetti said. \"Its a practical necessity for our communities, just as much as fixing that break of a water main, filling a pothole.\", Garcetti, who is expected to run for re-election is 2017, also said hed like to see more communities raise their minimum wage, though he cautioned that the Los Angeles model may not be for everyone. \"The cost of living is different in difference cities and you need to cater it to what is right for your own city,\" Garcetti said. Garcetti said the higher wages in Los Angeles would reduce employee turnover and attract better workers. \"When an employer at a McDonalds in Los Angeles can pick the very best, they will get the very best,\" he said. Garcetti was elected after promising to focus on a back-to-basics agenda, including fixing cratered streets and buckled sidewalks. The city continues to struggle with some long-standing problems, including high housing costs, homelessness and clotted traffic.]", "Date": "20150715", "Author": "[Kevin Freking, Associated Press]", "Link": "http://www.chron.com/news/article/Mayor-Los-Angeles-leads-nation-on-immigration-6387043.php", "Title": "[Mayor: Los Angeles leads nation on immigration, wage fronts]"}