{"Content": "[ Retail marijuana sales for adults are now legal (at least at the state level) in Colorado and Washington. Next month, voters in Alaska and Oregon may decide to follow suit. It is nearly certain that marijuana legalization will make it onto the California ballot in 2016, during a presidential election season that will generate enormous interest among young voters. It is less certain whether that proposition will succeed; right now, support is above 50 percent, but propositions tend to lose support as election day approaches. Much may depend on how outcomes look in Colorado and Washington next year, and whether Alaska and Oregon build or end the momentum next month. Ballot propositions are a blunt instrument for policymaking. Activists and their lawyers draft language, and as long as its constitutional, voters get to vote up or down without the give and take that happens (or at least used to happen) in the legislative process. The major legalization propositions thus far (including 2010s failed Proposition 19 initiative in California) are variations on a state tax-and-regulate scheme of commercialization. That may indeed be the best way to legalize marijuana, but no one really knows yet, and it may not be the best option for attracting votes in 2016. In fact, there is a whole menu of options for designing and regulating some form of adult legal access to marijuana, some that have been tried elsewhere. What should we look for in a marijuana proposal? , There are many conflicting values at stake, including public health and safety, personal liberty and state revenues. The schemes best at promoting personal liberty and public revenues are not the schemes most likely to protect public health and safety. (Just think about marijuana candies.) And the health and safety concerns are real. Current research suggests that marijuana may be safer than you were told when you were young (at least if you are over 40), but also that it is riskier than you may think it is. So here are five alternatives worth considering, arrayed roughly from lower risk/lower revenues to higher risk/higher revenues:, 1) Decriminalize possession. Many of the most compelling arguments for reform involve complaints about the corrosive effects of drug-law enforcement. Decriminalizing possession is a no-brainer; it saves money without any serious impact on levels of use. But California is one of the states that already has done this, and voters will have to decide whether its OK that non-medical users still have to break the law to obtain marijuana. 2) Grow your own. California could simply legalize home cultivation of a small number of plants. This already has been tried in Alaska and in South Australia, and the available evidence suggests that neither community saw increases in marijuana use. Skeptics point to smurfing, in which traffickers scatter their growing operation across many households. But so what? We already have a black market industry, so the perfect shouldnt be the enemy of the good. Home growing takes the profit and the promotion out of marijuana use. 3) Cannabis co-ops. Since around 2002, Spain has tolerated co-ops of growers and buyers, and there are now several hundred of them. They require membership, and the co-op leaders have an incentive to self-regulate the process so they can stay in operation. It is more of a hassle for consumers than a retail sales outlet, but that may discourage impulse buying and driving under the influence. 4) Dutch-style cannabis coffee shops. Contrary to popular belief, the Dutch havent legalized marijuana, but they have a written policy of non-enforcement for sales of small quantities in regulated coffee shops. While use did rise when the coffee shops started spreading, it later leveled off once they started closing shops that sold to minors or disrupted neighborhoods. The quasi-legal status of the coffee shop gives the government more control than in a fully legal retail system, and it has kept prices from falling because the government still cracks down on large-scale production. 5) Tax THC. The biggest risks posed by legalization involve the potential for significant increases in the number of consumers and the amount they consume. Though the United States had more marijuana users in the late 1970s, todays users are consuming more, and more often  which may be why admissions for marijuana treatments are rising in many countries, including the Netherlands. Legalization will probably drive prices down, perhaps dramatically  too low to simply offset with a sin tax that taxes by weight or as a percentage of sale price. But if users are going to smoke more, we can at least discourage them from using the most potent products by taxing by the concentration of the mind-altering ingredient in the cannabis plant, Tetrahydrocannabinol (THC), and other components. (Users of primo products say they can titrate their dose. Seriously?) Skeptics say it is too difficult to measure THC, but thats not very convincing when High Times magazine offers the same kind of product specs youd find in an issue of Stereophile or Car and Driver Magazine. Theres a good chance that California will legalize marijuana in the coming years. Whether you like the idea of California legalizing marijuana or you dont, everyone who cares should pay attention to the choices. November 2016 is two years away, but voter propositions start solidifying far sooner, and it will be too late to negotiate the details once one qualifies for the ballot. It is possible that marijuana legalization in Colorado and Washington will prove to be no big deal. Marijuana use was a lot more common in 1979, the historical peak of use, than it is today, so some increase in use is well within our historical experience. But that was milder weed, promoted by black light posters and stoner comedians rather than a major tobacco-like industry. So we have a lot to think about. Robert MacCoun is a psychologist, a professor of law at Stanford University and senior fellow at the Freeman Spogli Institute. To comment, submit your letter to the editor at www.sfgate.com/submissions/#1.]", "Date": "20141026", "Author": "[By Robert MacCoun]", "Link": "http://www.chron.com/opinion/article/Grow-your-own-marijuana-law-5846477.php", "Title": "[Grow your own marijuana law]"}