{"Content": "[ METULA, Israel - If I were a political novelist, Id try to write a novel about Benjamin Netanyahu, the prime minister of Israel. The story would be partly Nixonian. Netanyahu is surpassingly brilliant, as even his opponents here concede. He knows the minute guts of Israeli politics and has read deeply into big history and grand strategy. He is also said to be suspicious, solitary and insular. It is hard to stay on good terms with him, whether you are on his staff or his nations closest ally. The story would be partly Kennedyesque. The Netanyahu clan was presided over by Benjamins brilliant father, Benzion, the great medieval historian. The eldest brother, Jonathan, was the golden child. When Jonathan died in the raid on Entebbe in 1976, hopes shifted to Benjamin, who is known as Bibi. Political analysts have spent decades psychoanalyzing the family dynamic, with mixed results, but a novelist who studied Sophocles or Tolstoy might be able to make some sense of it. The story would be partly Churchillian. Netanyahu sees himself in world historical terms and admires Theodor Herzl and Winston Churchill - two men who saw dangers ahead of other people. Netanyahu obviously lacks many of Churchills qualities, like playful charm, but he has a profound nationalist passion and a consuming historical consciousness. Like Churchill, he is wisest when things are going wrong. He has been a pessimist about the Arab world. As the Arab Spring has deteriorated, as Palestinian democracy led to Hamas, as run-of-the-mill extremists have lost ground to the Islamic State, Bibis instincts have basically been proved correct. The story would be part Shakespearean. Nearly every political leader has one close friend or spouse, often female, who is widely hated. People cant blame the leader for slights, so they blame her. In Israel, the role is played by Netanyahus wife, Sara, who has been the subject of fascination and scorn for decades: She is often described as Lady Macbeth. Few know her exact role, but, it is said, she exiles the disloyal, shapes his politics, mistreats servants and distracts him when he is supposed to be running the country. Obviously, any novel about Netanyahu and modern Israel would have to be told from her vantage point. The narrative voice would be electric. The story would be part \"Citizen Kane.\" Netanyahu rose to fame via CNN. His rise and survival are intertwined with changes in media, with the decline of old newspapers that are generally hostile, and the rise of new cable networks and outlets that are often his allies. Ferociously tending his image, his wars with his foes in the Israeli press have been epic. Finally, the story would be part Machiavelli. The great Renaissance philosopher argued that it is best to be both loved and feared, but if you have to choose one, it is better to be feared. Netanyahu is not loved, especially by those in his party. But he is feared and acknowledged, the way any large, effective object is feared and respected. Im visiting Israel for the 18th or 19th time (my son is currently a member of the Lone Soldiers Program, which allows people from around the world to serve in the Israeli military). I asked a couple of smart Israelis what their coming elections are about. They said the elections are about one thing: What do you think of Netanyahu? Such is the outsized role he plays in the consciousness of this nation. No one has a simple view of him. To some, he is a monster who has expanded the settlements on the West Bank, which are a moral stain and do calamitous damage to Israels efforts to win support around the world. To some, he is the necessary man in hard times, the vigilant guardian as the rest of the Middle East goes berserk. Both viewpoints have some truth. To me, his caution is most fascinating. For all his soaring rhetoric and bellicosity, he has been a defensive leader. He seems to understand that, in his countrys situation, the lows are lower than the highs are high. The costs of a mistake are bigger than the benefits of an accomplishment. So he is loath to take risks. He doesnt do some smart things, like improve life for Palestinians on the West Bank, but he doesnt do unpredictable dumb things, like prematurely bomb Iran. He talks everything through, and his decisions shift and flip as the discussions evolve. If you think trends in the Middle East will doom Israel unless it acts, then this defensiveness is a disaster. If you think, as I do, that Israel has to wait out the current spasm of Islamist radicalism, then this caution has its uses. Israeli voters havent warmed to Netanyahu over the past quarter-century. But they have come to think more like him, accepting that this conflict will endure, digging in for a dogged struggle. For good and ill, he has refashioned the national mind. , Brooks is a New York Times columnist.]", "Date": "20150103", "Author": "[By David Brooks]", "Link": "http://www.chron.com/opinion/outlook/article/Brooks-Netanyahu-Monster-or-Israel-s-guardian-5992057.php", "Title": "[Brooks: Netanyahu: Monster or Israel's guardian?]"}