{"Content": "[ JEFFERSON CITY, Mo. (AP)  Voters next year will pick more than a new governor  the election likely will either ensure Missouri becomes the 26th right-to-work state or remains a holdout in the national push for the measure despite being surrounded mostly by states that have adopted it. Thats because despite having what should be veto-proof Republican majorities in both the House and Senate, the bill didnt pass this week. While enough lawmakers supported the measure in order to send it to Democratic Gov. Jay Nixons desk, they fell 13 votes short of the two-thirds majority needed to override his veto. Opponents ranging from Democratic presidential candidate Hillary Rodham Clinton to local unions praised Nixon, as well as lawmakers who voted against it, after the measure failed. \"On behalf of working women and men in Missouri, I want to thank Governor Nixon for vetoing Right To Work,\" Missouri AFL-CIO President Mike Louis said in a statement. The measures failure in Missouri, Republican House Speaker Todd Richardson said, isnt a reflection on momentum for the national push for its passage. Richardson said the proposal has seen perhaps unexpected support in states such as Indiana, Wisconsin and even Michigan  the headquarters of the United Auto Workers. The three Midwestern states have enacted right to work in recent years, but with the support of Republican governors. Nixon is the difference in Missouri. \"Im proud of how far weve been able to take the issue despite not having a governor who supports the policy,\" Richardson said. Richardson isnt the only supporter who has pointed to Nixon as a major  or primary  reason for the bills failure, and that adds pressure to next years election. A change in power could also mean a change in the fate of right to work. \"This is why this election matters,\" said former state House speaker and U.S. attorney Catherine Hanaway, a Republican running for governor in 2016, in a statement sent to supporters after the House vote. \"We must elect a governor who will sign right to work.\", Republican Lt. Gov. Peter Kinder, a longtime right-to-work supporter who is running for governor, also distributed a public letter the day after the bills failure, vowing to continue the fight. \"This is no time for retreat,\" Kinder wrote. \"Forward, then: onward to ultimate victory on right to work for Missouri.\", Hanaway, Kinder and three other potential or announced Republican candidates signed a letter this past week in support of right to work, and a state senator also running for the job voted in favor of the measure in May. That likely means Missouri will be a right-to-work state if a Republican is elected to succeed Nixon. Attorney General Chris Koster, the only Democrat running for governor, criticized the measure in a pitch for donations for his campaign the day after the House vote. \"I hope youll help build this organization so we can get a few more votes in each precinct, a few more votes in each county, and a few more votes in each district,\" the emailed request read. \"Thats how well change Jefferson City  with men and women who put Missouris families first.\", Unless enough of the Republican opponents from strong-union districts who voted against the bill in the House are ousted during the 2016 elections, electing Koster likely will ensure Missouri remains a right-to-work holdout. ", "Date": "20150919", "Author": "[Summer Ballentine, Associated Press]", "Link": "http://www.chron.com/news/article/Missouri-governor-s-race-to-determine-fate-of-6516081.php", "Title": "[Missouri governor's race to determine fate of right to work]"}