{"Content": "[Former Florida Gov. Jeb Bush (R) has the potential to\"reshape Republican politics for a generation\" by launching a campaign for president,according to The New York Times. \"If he goes forward with a campaign in which he avoids trying to appease the most conservative voters and wins the nomination as well as the presidency, it could reshape Republican politics for a generation.Should he take that approach and lose the nomination to a more aggressive conservative, however, it would send a powerful message that a more pragmatic approach has little appeal among the partys primary voters,\" The Times Jonathan Martin wrote over the weekend. Bush  the brother and son of two recent presidents has forged a relatively moderate political brand compared with the more outspoken conservatives considering campaigns in 2016. Unlike most of his potential foes, for example, Bush has endorsed controversial Common Core educational standards and reportedly backed a path to citizenship for immigrants who entered the US illegally. \"You have to deal with this issue,\" hewas quoted in 2012 arguing about the issue of illegal immigration.\"You cant ignore it. And so, either a path to citizenship, which I would support and that does put me probably out of the mainstream of most conservatives.\", The Times reported that Bushs advisers were pushing him to maintain his moderate positions to preserve his electability in the general election. \"The partys establishment elites and some longtime advisers ... are convinced that Mitt Romney ruined his chance to win in the fall of 2012 by veering too far to the right during the primaries, turning off general election voters as a result,\" Martin continued. However, its unclear whether Bush will launch a White House bid. Bloomberg Businessweek reported last weekthat Bushs recent business ventures led many observers to question his interest in a 2016 campaign. On the other hand, Bush said in a Sunday television interview that he wouldrelease 250,000 emails from his time as governor. This makes him \"look like a candidate,\" according toGreg Valliere, the chief political strategist for the nonpartisan Potomac Research Group. \"This looks like a clever move  Jeb Bush is about to release all of his emails from the period in which he was Florida governor, the clearest signal yet that hes running,\" Valliere wrote Monday morning. \"Its a Big Time challenge to Hillary Clinton, Chris Christie, Scott Walker, Rand Paul, and others  Ill show you mine, will you show me yours?\", , Join the conversation about this story , See Also:, SEE ALSO:Jeb Bush Is Going To Let People Make Up Their Mind With Email Dump]", "Date": "20141215", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/A-Jeb-Bush-2016-Run-Would-Have-Huge-Implications-5957906.php", "Title": "[A Jeb Bush 2016 Run Would Have Huge Implications For The Republican Party]"}