{"Content": "[ Caption, Close, Ken Paxton, Republican candidate for Attorney General of Texas, speaks Monday July 28, 2014 during the Annual Training Conference for the Sheriffs Association of Texas. The conference is taking place at the Henry B. Gonzalez Convention Center. In this Jan. 5 file photo, Gov.-elect Greg Abbott, left, listens to Gov. Rick Perry during an oath of office ceremony for new Attorney General Ken Paxton. Texas Agriculture Commissioner Sid Miller, third from left, Land Commissioner George P. Bush, Comptroller Glenn Hagar and Attorney General Ken Paxton listen to Gov. Rick Perrys farewell address to a joint session of the Texas Legislature, Thursday, Jan. 15, 2015, in Austin, Texas. (AP Photo/Eric Gay), Attorney General Ken Paxton reported he owned at least 10,000 shares of stock in Servergy in 2014. Texas Lt. Gov.-elect Dan Patrick, second from left, Agriculture Commissioner Sid Miller, Land Commissioner George P. Bush, Comptroller Glenn Hagar and Attorney General Ken Paxton applaud Gov. Rick Perry during his farewell address to a joint session of the Texas Legislature, Thursday, Jan. 15, 2015, in Austin, Texas. (AP Photo/Eric Gay), AUSTIN  A pair of Houston criminal defense lawyers will take over any criminal case against Attorney General Ken Paxton over his admitted securities law violations, after the local district attorney recused himself from the case. Collin County District Attorney Greg Willis recused himself from Paxtons case this week, citing his personal and business relationship with the attorney general. In his place, the district court appointed Houston criminal defense lawyers Brian Wice and Kent Schaffer as district attorneys pro tem. RELATED:Craig McDonald: Prosecutor needed in Ken Paxton case, \"Normally any recusal considerations are prompted after a law enforcement agencys submission of an investigated case to our office,\" Willis recusal request reads.\"This has not happened. Nevertheless, now than an investigative agency has been tasked to investigate this matter, and to avoid any potential appearance of impropriety arising from his business and personal relationship with Ken Paxton, the undersigned ... respectfully requests this Honorable Court to appoint a Criminal District Attorney Pro Tem of Collin County in this matter.\", According to the order naming Wice and Schaffer as district attorneys pro tem, the two lawyers will be tasked with \"assisting in the investigation and, if warranted, the prosecution of Ken Paxton for the securities law complaints currently under investigation by the Texas Rangers.\", A year ago, Paxton admitted to repeatedly violating state securities laws by soliciting clients for his friend Frederick \"Fritz\" Mowerys investment firm without being properly registered with the state. He was fined $1,000 and reprimanded. A subsequent criminal complaint was filed with the Travis County District Attorneys office, which assigned the case to Dallas and Collin counties, where Paxton was working at the time. Earlier this month, after a local grand jury signaled its intent to investigate the matter without his involvement, Willis referred the case to the Texas Rangers for investigation. Willis and Paxton have known each other for more than thirty years and have been involved in at least four of the same business ventures.]", "Date": "20150422", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Houston-defense-lawyers-appointed-to-Paxton-case-6216572.php", "Title": "[Houston defense lawyers appointed to Paxton case in DA's stead]"}