{"Content": "[ Caption, Close, More than 60 percent of Texans support an online voter registration system, according to recent polling by the Pew Charitable Trusts. ( J. Patric Schneider / For the Chronicle ), If you want to know the priorities of Harris County Tax Assessor-Collector Mike Sullivan, just go to his 2012 campaign website and click the issues tab. The first item on his list: \"Bring the office into the 21st century by embracing new technology.\", We have no reason to doubt Sullivan, but were perplexed as to why he has opposed a bill that would allow online voter registration in the state of Texas (\"Online voter registration bill derailed,\" Page B1, Monday). Twenty other states currently allow registering online, and six others recently approved laws that have not yet taken effect. At this point it is hardly a new technology. Tested time and again across the nation, in red states and blue, the results of online registration have been overwhelmingly positive. Online systems save money, reduce fraud and make it easier for citizens to register before elections. Maricopa County, Ariz. which is home to Phoenix and Mesa, reported back in 2008 that online voter registration saved data entry costs equivalent to eight full-time employees. And the California Secretary of State reported in 2013 that online voter registration saved the states taxpayers about $2 million. Texans should be joining these states. Instead, were stuck funding an outdated, inefficient system. Like a leery grandmother who doesnt trust email, Sullivan testified in Austin that Texas simply isnt ready for online registration. This circumspect attitude hasnt stopped his office from accepting payments online, nor has it prevented the state of Texas from allowing people to use the Internet to renew drivers licenses or apply for and renew concealed handgun licenses. Perhaps if folks punched their ballots with a bullet, Sullivan would get onboard. Instead, he raises the evidence-free specter of potential fraud, despite the fact that there have been zero reported instances of fraud due to online registration in other states. In fact, online systems can actually help catch errors by fixing the problems of illegible handwriting and incomplete forms. Theres a reason why online voter registration is supported by groups like Houston Young Republicans, Harris County Young Democrats, the Texas Association of Election Administration, the National Republican Lawyers Association and the Tax Assessor-Collectors Association of Texas. If Sullivan can see problems on the road to implementing this system, then he should step up as Tax Assessor-Collector and fix them. \"We have a responsibility to register people,\" Sullivan told the Houston Chronicle editorial board during the 2012 Republican Party primary. \"Voter registration is really what its all about.\", It was that sort of can-do attitude that won him that primary race over Don Sumners, who had been criticized for his lackluster management and conflicts with the League of Women Voters. \"The customers always right,\" Sullivan said at the time, drawing a contrast with the incumbent. Today those customers want online voter registration. More than 60 percent of Texans support an online system, according to recent polling by the Pew Charitable Trusts. Yet Sullivan still testified in Austin that \"our current system works, and it works well.\", Sullivan is acting like a taxicab politician in the age of Uber, desperately defending the only system weve had against online competition. When he first ran for his position, Sullivan said that he would embrace new technology to improve services for constituents. We hope that doesnt become a promise broken.]", "Date": "20150506", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/New-technology-6247104.php", "Title": "[New technology]"}