{"Content": "[ If anyone should be feeling an overwhelming sense of Groundhog Day this presidential election, cest moi, Frankly, Ive been covering Bushes for so long, I feel like I ought to be parachuting out of airplanes. In fact, the arc of my career parallels the so-called Bush Dynasty, beginning in 1980 when I was a young reporter for the Charleston (S.C.) Evening Post. That was the first year South Carolina held a Republican presidential primary and its been the \"First in the South\" ever since. Recognizing the historic importance of the 1980 race, my papers editors split the state into east and west and assigned two reporters to cover the terrain. The other reporter was a classic from central casting - a chain-smoking political veteran aptly named Jack Roach. Taking off in different directions, we traversed the state, filing three columns a week - on typewriters, with no spellcheck I might add. Memorably, I found myself one night in a Charleston hotel room with Ronald and Nancy Reagan. I dont recall how I got there, but I was pretty good at wiggling into places I didnt belong, probably because I looked about 12 years old. Though my intent was to interview Reagan, my confidence was rendered null by my having to explain to the future president that my parents didnt need to know where I was. This may also explain why my favorite of the bunch was George H.W. Bush, who was courtly, kind, handsome and, most important, treated me as if I were his equal. This was more than a paternal gesture but spoke to his quality, character and class - the thread that runs through my nearly 30 years exposure to and experience with the Bush family. By the time the senior Bush became president in 1988, I was writing a different sort of column, more lifestyle than politics, and was busy with motherhood. But his defeat four years later by Bill Clinton, thanks largely to the chart-happy vote siphon Ross Perot, signaled a turning point in American culture and, therefore, in my column and my politics. Lifestyle and politics suddenly collided. After the national trauma of the Clinton years, during which mothers like me were forced to shield our children from the presidents deeds, it was a relief to see George W. and Laura Bush move into the White House. If nothing else was certain, at least no one would have to worry about blue dresses, knee pads and cigars. I became familiar with these Bushes, as their years in office coincided with my own migration to Washington. I remember a comment George W. Bush made to me during a one-on-one, in-flight interview. He said the toughest moment of his life wasnt what to do after 9/11 but seeing his father - \"this fine, fine man\" - defeated by Clinton. I thought for a moment he might cry, but of course he wouldnt. I also got to know Laura Bush when she invited Greta Van Susteren and me to travel with her to the Middle East to launch a breast cancer awareness program in four countries.  People say you can learn about a persons character by playing golf with them. The same is true about traveling together, especially under challenging conditions. It wasnt like dodging bullets in Bosnia, mind you, but sharing close quarters with Secret Service snipers provides its own sort of bonding tension. More to the point, observing Laura Bush navigate the uber-mans world of the Middle East - putting kings and sheikhs at ease while lifting terrified women from despair by her reassuring presence - was inspiring. Mrs. Bush didnt get as much recognition for her efforts on this side of the world as she deserved, but seeking such attention was never her point. And now comes Jeb. Though Ive not met him, I formed an impression about Jeb Bush during the 2012 Republican Convention in Tampa, Fla. when I heard him speak at a small reception. Predisposed neither to like nor dislike him, I was immediately impressed. Without notes, he was eloquent, thoughtful, fluent in policy yet plainspoken, accessible and utterly free of artifice or guile. I remember thinking at the time: If the American people could hear him, they would like him. They finally got to hear him Monday as he launched his presidential campaign. Well soon know whether my instincts were right. As to the dynasty question, Bush settled the issue, indirectly and cleverly: \"The presidency,\" he said, \"shouldnt be passed on from one liberal to the next.\" , Classy. And the real point, after all. , Parkers email address is kathleenparker@washpost.com.]", "Date": "20150617", "Author": "[By Kathleen Parker]", "Link": "http://www.chron.com/opinion/outlook/article/Jeb-appears-worthy-to-assume-Bush-mantel-6333480.php", "Title": "[Jeb appears worthy to assume Bush mantel]"}