{"Content": "[ Caption, Close, Risk the consequences? Maybe the most accurate campaign slogan Ive ever heard!  , , Rick Perrys announcement of his presidential run excited Jon Stewart so much yesterday that the Daily Show Host couldnt help but thump the desk like an excited rabbit while making monkey calls. \"Oh my God, oh my God, oh my God. Rick Perry is running for president,\" he said. \"Give me more!\", RELATED:Rick Perry goes at it again, launches 2016 bid, Apparently the funnyman foresees ample comedic content coming out of the former Texas governors second shot at the White House. After all, Perrys fueled many a \"Daily Show\" joke over the years, and even sat down with Stewart for a TV interview in 2010. Stewart found plenty of fodder in Perrys kickoff speech at an airport hangar outside Dallas, and a promotional video the new candidate released hours before in which he said \"we must do right and risk the consequences.\", RELATED:Where They Stand: Rick Perry on issues of 2016 campaign, \"Maybe the most accurate campaign slogan Ive ever heard: Rick Perry, risk the consequences,\" Stewart said. \"Its the same slogan youd use to advocate unprotected sex.\", At the announcement event, Perry touted his five years of Air Force service and his 14 year tenure as the Texas governor. But his theme songa custom remix of Colt Ford and JJ Lawhorns country rap hit \"Answer to No One\" with rehashed Perry-centric versesalso drew attention and amusement. RELATED:Rick Perry jumps on rap-country bandwagon with campaign song, \"Rick Perry supporter, lets protect our border, to hell with anyone who dont believe in the USA, Rick Perry all the way,\" the rap verse said. \"I dont know about Rick Perry,\" Stewart said. \"I think that song is going to be the Republican nominee.\", Perry is now the 10th contender for the Republican nomination, with five more expected to announce runs.]", "Date": "20150605", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/election/article/Jon-Stewart-can-t-hide-his-excitement-for-Perry-s-6309127.php", "Title": "[Jon Stewart can't hide his excitement for Perry's presidential bid]"}