{"Content": "[ LEXINGTON, Ky. (AP)  A Kentucky county clerk has appealed a judges decision to put her in jail for refusing to issue marriage licenses to same-sex couples. Attorneys for Rowan County Clerk Kim Davis officially appealed the ruling to the 6th Circuit U.S. Court of Appeals on Sunday. The three page motion does not include arguments as to why Davis should be released but amends Davis earlier appeal of the judges order. Davis objects to same-sex marriage for religious reasons and stopped issuing all marriage licenses in June after the U.S. Supreme Court legalized gay marriage nationwide. Two gay couples and two straight couples sued her. U.S. District Judge David Bunning ordered Davis to issue the licenses and the Supreme Court upheld his ruling. But Davis still refused to do it, saying she could not betray her conscience. Thursday, Bunning ruled Davis was in contempt of court for disobeying his order and sent her to jail. Her deputy clerks then issued marriage licenses to gay couples Friday with Davis behind bars. \"Civil rights are civil rights and they are not subject to belief,\" said James Yates, who got a marriage license on Friday after having been denied five times previously. Mat Staver, one of Davis attorneys, said the marriage licenses issued Friday are \"not worth the paper they are written on\" because Davis refused to authorize them. But Rowan County Attorney Cecil Watkins says the licenses are valid. Bunning said he did not know if the licenses were valid but ordered them issued anyway. Bunning indicated Davis will be in jail at least a week. She could stay longer if she continues to not obey the judges order. Bunning had offered to release Davis from jail if she promised not to interfere with her deputy clerks as they issued the licenses. But Davis refused. Staver called the contempt hearing \"a charade\" saying that Bunning had his mind made up before the hearing began. Kentucky law requires marriage licenses be issued under the authority of the elected county clerk. Davis views issuing marriage licenses to same-sex couples as a stamp of approval of something she believes is a sin. She has said she will not issue marriage licenses until the state legislature changes the law so the licenses can be issued under someone elses authority. The state legislature is not scheduled to meet again until January and Democratic Gov. Steve Beshear has refused to call a special session. Davis has refused to resign her $80,000-a-year job. As an elected official the only way she could lose her job is to lose an election or have the state legislature impeach her, which is unlikely given the conservative nature of the state General Assembly. \"Shes not going to resign, shes not going to sacrifice her conscience, so shes doing what Martin Luther King Jr. wrote about in his Letter from the Birmingham Jail, which is to pay the consequences for her decision,\" Staver said. Davis plight has reignited the gay marriage debate and the limits of religious freedom. Her imprisonment has inspired spirited protests from both sides in this small eastern Kentucky community known mostly as the home to Morehead State University. Saturday, about 300 people rallied in support of Davis at the Carter County Detention Center where she is being held. Another rally is scheduled for Tuesday with Republican presidential candidate Mike Huckabee.]", "Date": "20150910", "Author": "[Adam Beam, The Associated Press]", "Link": "http://www.chron.com/news/us/article/Kentucky-clerk-appeals-order-putting-her-in-jail-6488746.php", "Title": "[Kentucky clerk appeals order putting her in jail]"}