{"Content": "[ Caption, Close, Senator John Cornyn speaks during an interview at the Houston Chronicle, Wednesday, Oct. 1, 2014, in Houston. (Cody Duty / Houston Chronicle), The story of U.S. Sen. John Cornyn is one of a slow and steady ascension to power. From district judge in San Antonio to minority whip in the U.S. Senate, Texas senior senator now has his eye on majority leader. That position has a special significance to Texans - it was once held by Lyndon B. Johnson - and Cornyn isnt afraid to name drop that former president along the way. This election isnt likely to serve as a road bump to any grand plans. Democratic challenger David Alameel, a multimillionaire dentist and investor, has a lot of money, a biography straight out of Horatio Alger and an anachronistic opposition to free trade. The incumbent earns an endorsement almost by default. Telegenic and well-spoken, Cornyn, 62, is practically a casting call model for a third-term senator, which he will become upon re-election. Polls show Republicans on the verge of taking the Senate, and Cornyns seniority stands to help promote Texas interests in our nations capital. But voters should know that Cornyn is a Republican first and a Texan second. For a man who has served in elected office since 1986, Cornyn remains unfocused on issues of importance to Houston and the Gulf Coast. Meeting with the Chronicle editorial board, it seemed as if coastal storm surge protection was a new topic for Texas senior senator. When asked about his position on the Ike Dike, Cornyn responded, \"I dont even know what that is.\" , Discussing the nuances of exporting crude, Cornyn admitted, \"I dont pretend to understand these things.\", Houston is the energy capital of the world and our representatives should bring that expertise to Washington. Instead, the authority is yielded to senators from Louisiana and Alaska. When pushed by the editorial board to name Texas-specific accomplishments, Cornyn had to reach back to his days as the state attorney general. Twelve years in our nations capital should merit at least one notable win. Former Sen. Kay Bailey Hutchison sat on the Appropriations Committee with the specific intent of pulling down federal resources to support Texas needs. There are ways to serve Texas in the Senate besides returning our tax dollars, but Cornyn seems more comfortable hammering wedge issues like abortion than fighting for NASA, the Texas Medical Center, the Port of Houston and other jewels of the Texas economy. He pointed to the national debt as a reason for his lackluster performance - it is hard to bring down dollars when you want to cut spending. But after raising that challenge of routine budget deficits, he offered no solutions to balancing the budget beyond a milquetoast reference to another senators plan. It isnt all bad. Cornyn found himself at Houstons City Hall this week to tout his role in reducing the backlog of untested DNA in rape test kits - a problem that Houston faced for far too long. In the realm of international relations, Cornyn co-founded the Senate India Caucus back in 2004 and serves as its co-chair today, working to strengthen ties with the worlds largest democracy. Texas has a surprisingly high stake in those bilateral relationships, given Indias hunger for U.S. natural gas. Cornyn has also maintained a steady position as a moderate Republican voice on immigration issues, seeking solutions over grandstanding. There is no secret about Cornyns disdain for the attention-getting antics of his junior Senate colleague - Sen. Ted Cruz - and he is the first to recognize that Congress is unpopular for a reason. But if Cornyn wants to offer a real alternative to The Party of No, he will have to step up his game. Power is on the horizon for Cornyn; we hope he uses it wisely.]", "Date": "20141008", "Author": "[Copyright 2014: Houston Chronicle]", "Link": "http://www.chron.com/opinion/recommendations/article/For-U-S-Senate-Cornyn-5807713.php", "Title": "[For U.S. Senate: Cornyn]"}