{"Content": "[ Caption, Close, Houston City Council member Stephen Costello, 2013 mayoral runner-up Ben Hall, Businessman Marty McVey, State Rep. Sylvester Turner, , Former Harris County Sheriff and Houston Mayor Pro-Tem Adrian Garcia, Former congressman and Houston City Council member Chris Bell, With three mayoral forums scheduled for next week, the policy debate in the race to become Houstons next mayor is about to begin in earnest. The events, which will focus on arts and culture, economic development, and labor and community concerns, kick off a months-long cycle in which the candidates will appear before various interest groups, speaking to their specific concerns. Wednesdays arts forum at the Asia Society comes two days after the conclusion of this years legislative session in Austin and is expected to be the first time the candidates appear together since former Harris County Sheriff Adrian Garcia entered the race. The forum hosted by Houston Arts Alliance, Houston Museum District, Theater District Houston and Miller Outdoor Theatre begins at 6:30 p.m. and will be moderated by KTRK reporter Miya Shay. Each of the seven attending candidates  Garcia, Rep. Sylvester Turner, former congressman Chris Bell, City Council member Stephen Costello, former mayor of Kemah Bill King, 2013 mayoral runner-up Ben Hall and businessman Marty McVey  will have a minute to introduce himself before being asked a series of four arts and culture-related questions, for which he will have two minutes to respond. Time allowing, the candidates also willtake questions from the audience before offering closing statements. Thursdays forumhosted by SPARC Growth Houston, a coalition of economic development groups, will focus on the city budget and economic development. It begins at 6 p.m. at the University of Houston and is structured similarly, with Rice University sociology professor Stephen Klineberg discussing the results of his Houston Area Survey before representatives of area chambers of commerce ask the seven candidates five questions, to which they will each have 90 seconds to respond. Then, on Saturday, the candidates are set to appear before area labor and community organizations for a 9 a.m. debate at Talento Bilingue. Each will have a minute to introduce himself and a minute to answer the 10 questions posed by panelists from the Texas Organizing Project, Harris County AFL-CIO, Fe y Justicia Workers Center, Mi Familia Vota and Houston Gulf Coast Building and Construction Trades Council. Six of the candidates, Costello not included, have confirmed their attendance, according to event organizer Linda Morales.]", "Date": "20150528", "Author": "[By Rebecca Elliott]", "Link": "http://www.chron.com/politics/election/local/article/Mayor-s-race-gearing-up-with-three-forums-next-6292024.php", "Title": "[Mayors race gearing up with three forums next week]"}