{"Content": "[ AUSTIN -- U.S. Sen. Rand Paul brought his likely presidential campaign here Sunday, using the annual South by Southwest festival as a stage for a trio of events aimed at portraying himself as the best option for young voters in Texas and across the country. Paul, who grew up in Lake Jackson and has focused more than most any other potential 2016 contender on the nations largest Republican state, continued that approach by headlining a launch party for a new group to train young activists, answering questions at a festival interview and joining a Texas state senator for a Q&A featuring queries submitted on Twitter. The Kentucky senator said at the beginning of each of the question sessions that he had not yet decided whether to run, saying a decision would come \"within weeks,\" which would square with the time frame he has set. But almost every other moment of a busy afternoon indicated he was in. At one point during his interview with Texas Tribune CEO Evan Smith, Paul said he was \"the only candidate\" who wants to end the National Security Agencys program of collecting telephone records in bulk. Asked at the Twitter event whether that meant he was officially running, Paul joked that he was a candidate -- for the Senate. His seat will be up in 2016. Privacy proven a common theme throughout the events Sunday, in addition to liberty generally as well as criminal justice reform, a platform that Paul said would make him a \"completely different\" candidate than others with appeal across party lines and among young people. \"The liberty movement brings right and left together in an extraordinary way,\" the self-described \"libertarian-ish\" senator said at his first event, a reception to launch Liberty Action Texas, founded by conservative consultants Jeff Frazee and Brendan Steinhauser. \"You can be liberal, you can be conservative, you can be an evangelical Christian, you can be a pot-smoking Austinite, and still believe in freedom and that the government oughta leave you alone.\", Paul expanded on that idea in his sit-down with Smith, calling for, among other things, an end to \"ridiculous, menial, misdemeanor type of crimes that were foisting on people to raise money\" and an end to the NSA program. Told that state Rep. Jonathan Stickland had filed a bill to cut off electricity and water to NSA facilities in Texas, Paul said he would like to meet Stickland, although he later called the idea an example of hyperbole. Paul accused Obama of executive overreach, defending his signing of a letter to Iran about a potential nuclear deal as necessary to reign in a president who \"doesnt understand the separation of powers.\", \"Whether its immigration, health care or war, hes gonna do whatever the hell he wants,\" Paul said. The senator also attacked the likely Democratic nominee for president, Hillary Clinton, over a recent scandal involving her use of a private email address as Secretary of State. \"Convenience shouldnt trump national security,\" Paul said, referring to Clintons claim that she used the address for convenience. He later said the scandal was representative of a general issue that Clinton thinks she is above the law. Paul confronted a more immediate challenge than a general election at the Twitter Q&A with state Sen. Don Huffines, answering a question about how he can appeal to libertarians and mainstream Republicans. \"Very carefully,\" he deadpanned, before calling himself a \"constitutional conservative\" who has \"sort of a foot in both camps.\", Paul is among a pack of likely 2016 Republican candidates from all wings of the party, including several with Texas ties, such as former Gov. Rick Perry, current U.S. Sen. Ted Cruz and former Florida Gov. Jeb Bush, whose family has deep roots here. Steve Munisteri, who stepped down as chair of the Republican Party of Texas to advise Paul, said in an interview after the Twitter event that the senator recognizes the importance of the state. Pauls visit to Austin will climax Monday, when he will open an office at startup incubator Capital Factory. The incubators director, Joshua Baer, told reporters at the mansion of Gov. Greg Abbott on Saturday that it will not be a campaign office and the move is not an endorsement by the group. Still, Baer said, it is great that presidential candidates such as Paul are interested in the technology community.]", "Date": "20150316", "Author": "[By Brian M. Rosenthal]", "Link": "http://www.chron.com/news/politics/texas/article/On-eve-of-Austin-office-opening-Paul-makes-his-6135967.php", "Title": "[On eve of Austin office opening, Rand Paul makes his pitch at SXSW]"}