{"Content": "[ Caption, Close, The specific details of the indictment will not be revealed until Tuesday, but a special prosecutors said earlier this month they would seek first-degree felony charges against Paxton for violating state securities laws. 1,300 - The percent increase in Paxtons business interests since he was first elected to the state House in 2003. At that time, he had investments in just two businesses; by 2014, this had expanded to 28. He had said he is trying to divest or dial down many of these investments after critics have raised conflict of interest concerns. 3 - The number of times Paxton admitted to soliciting clients for his friend Frederick \"Fritz\" Mowery without being properly registered with state authorities. He was fined $1,000 and reprimanded in April 2014. Texans for Public Justice, an Austin-based group, later filed a criminal complaint with Travis County prosecutors, saying the violation amounted to a third-degree felony. 20 - The percent by which Paxton defeated Sam Houston, his Democratic opponent in the 2014 race for attorney general. Houston, and Paxtons Republican rivals in the GOP primary, lost even after continuing to highlight Paxtons admitted securities violations. 10 - The number of months between the time when Paxton admitted to breaking the law and Travis County prosecutors referred the case to Collin County, where any violations likely took place. The case was put on hold because of an internal policy aimed at preventing politically motivated investigations in campaign season. 4 - The number of businesses Paxton and Collin County District Attorney Greg Willis have invested in together. Willis, a long-time friend and political ally of Paxton, recused himself after it became clear months had passed without him taking up the case referred to him by Travis County prosecutors. 2 -The number of special prosecutors assigned to the case in April after Willis recusal. A month later, a local judge agreed to grant the prosecutors request to expand the case to include any and all possible securities act violations. $100,000+ - The amount of money involved in evidence the special prosecutors plan to present to a Collin County grand jury this month. Schaffer has said they have \"substantial evidence\" to secure a first-degree felony indictment against Paxton. $26 million - The total stock sale for Servergy, Inc. a McKinney-based company over the last five years. The U.S. Securities and Exchange Commission confirmed it began investigating Servergy in 2013 for allegedly defrauding its investors. Paxton was an early investor in the company, his name and email was found in the SEC subpoena of Servergy principals. $2.5 million - The amount of money Paxton currently holds in his campaign coffers, a comfortable cushion to mitigate against future expenses. AUSTIN  Attorney General Ken Paxton is expected to surrender to authorities Monday following an indictment on multiple felony charges stemming from his involvement with a North Texas technology company accused of defrauding investors, according to multiple sources close to the case. A Collin County grand jury issued the indictment against the first-term attorney general on Tuesday, two sources who had been briefed on the proceedings told the Chronicle on Saturday. Paxton faces two counts of first-degree securities fraud and one count of third-degree securities fraud, with the most serious charges carrying a minimum sentence of five years in prison, special prosecutor Kent Schaffer told The New York Times. Schaffer said Paxton is accused of encouraging people, including current and former members of the Legislature, to invest more than $600,000 in a McKinney-based technology company called Servergy without telling them he was making a commission. He also misrepresented himself as an investor in the company that the U.S. Securities and Exchange Commission was investigating for defrauding stockholders as recently as December 2014. The first-degree charges each carry a sentence of five to 99 years in prison and a fine of not more than $10,000. The third-degree charge stems from his failure to properly register with the state as an investment adviser representative, which carries a sentence of two to 10 years in prison, as well as a $10,000 fine. The indictment was immediately sealed Tuesday, but will be unsealed Monday afternoon, according to a high-ranking source with the Texas Department of Public Safety who asked not to be identified. Local media reported a Tarrant County judge already has been named to preside over the case, which is expected to go to trial. Paxtons spokesman on Saturday did not answer multiple calls, texts and emails requesting comment. The charges involve actions Paxton is accused of taking before he was elected attorney general last fall. Calls for Paxtons resignation surfaced almost immediately after the indictment news broke Saturday afternoon. Craig McDonald, executive director of the Austin-based advocacy group Texans for Public Justice, said the only appropriate response would be for Paxton to step aside. \"How can you have faith in the Texas legal system if its top official remains in office while under indictment for felony securities fraud? That shouldnt be able to happen,\" said McDonald, whose group filed an early criminal complaint against Paxton. Calls and emails to the Texas Republican Party and office of Gov. Greg Abbott were not returned.Paxton was not without supporters, however, with fellow tea party favorite Rep. Matt Schaefer, R-Tyler, likening the indictment to that of former Gov. Rick Perry. Perry, now seeking the Republic nomination for president, has repeatedly called his own indictment a partisan attack. Tony McDonald, counsel for the conservative advocacy group Empower Texans, called the indictments \"politically charged attacks\" in a post on the groups website. State law does not require Paxton to step down due to the indictment. Like Perry, who was indicted during his final months in office, Paxton could retain his job as the legal process continues. Jim Henson, head of the Texas Politics Project at the University of Texas at Austin, said a number of factors will influence if and how Paxton leaves the position. \"Its going to be a little harder to sustain the argument that this was a politically motivated persecution over time,\" Henson said. \"But my suspicion is that we will not see the attorney general going particularly quietly into the night.\", The Chronicle could not reach Schaffer Saturday, and co-special prosecutor Brian Wice declined comment on the indictment reports. \"As defense attorneys, we have dedicated our careers to ensuring that every citizen accused of any crime is afforded the fundamental constitutional guarantees of the presumption of innocence, proof beyond a reasonable doubt, and a fair trial with a reliable result,\" Wice said in a statement. \"Because our statutory mandate as special prosecutors is not to convict, but to see that justice is done, our commitment to these bedrock principles remains inviolate.\", Paxtons criminal case dates to April 2014, when the then-state senator admitted to soliciting clients for his friend Frederick \"Fritz\" Mowerys investment firm without being properly registered with the state as an investment adviser representative. That occurred at least three times during his dozen years in the state House and Senate, Paxton admitted. He was fined $1,000 and officially reprimanded solely for the final instance because the statute of limitations had expired for the first two cases. Soon after, Texans for Public Justice filed a criminal complaint against Paxton with Travis County prosecutors. The case was put on hold until after the 2014 election, when Paxton sailed to an easy win in the race for attorney general. In January, Travis County prosecutors kicked the case to, Paxtons home county in North Texas, where they said the offenses likely took place. Months later, Collin County District Attorney Greg Willis recused himself, citing his close personal and business relationship with Paxton, and referred it to the Texas Rangers. It was only then that the investigation was broadened into any and all possible securities act violations, after the Texas Rangers uncovered evidence of wrongdoing in addition that to which Paxton admitted in April 2014. Paxton became involved with Servergy soon after Bill Mapp, a Paxton donor and tea party member in McKinney, took over at its helm. Paxton still holds at least 10,000 shares of Servergy stock, according to financial documents covering last year, and also used to name the company on his \"business entities\" list. The SEC began investigating the McKinney-based company in 2013, saying it allegedly defrauded its stockholders by misrepresenting orders it had received for the Cleantech-1000, a server it said would consume up to 80 percent less power and space compared to others on the market. The SEC took Servergy to court in 2014 to force its leaders to produce documents responsive to multiple subpoenas. That case was eventually settled when Servergy produced the information requested. Rep. Byron Cook, R-Corsicana and former state Rep. Bob Griggs, both Servergy investors, also sued the company in 2014 for similar documents. That case also was settled, and Cook, who heads the House State Affairs Committee, remains an investor. Terry Jacobson, a Corsicana attorney who counts Cook and Griggs among his clients, declined to comment Saturday on the indictment. Mapp no longer heads the company but remains an investor, said Miranda Sevcik, spokesperson for current Servergy CEO Lance Smith. While it did take the company longer than expected, she said, it eventually produced the server to the specifications promised investors. \"They are currently using it to provide tech solutions in a cloud that secures and stores data,\" Sevcik said. \"They are generating revenue on this and creating value for their shareholders.\", Paxton is the first sitting attorney general to be indicted in more than 30 years. In 1983, a Travis County grand jury indicted then-Attorney General Jim Mattox, a Democrat, for commercial bribery. Mattox defeated the indictment and was re-elected to the post in 1986. Staff writer Mike Ward and Jim Pinkerton contributed to this report, which contains material from The New York Times.]", "Date": "20150801", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/us/article/Attorney-General-Ken-Paxton-indicted-local-media-6419389.php", "Title": "[Sources: Attorney General Ken Paxton indicted]"}