{"Content": "[ Caption, Close, Wendy Davis may have shot herself in the foot with her latest political ad. As Houston Chronicle columnist Lisa Falkenberg noted: It had a solid message, but it was clumsily delivered. Weve compiled a list of the sharpest, most biting mudslinging thats taken place in the 2014 fight for the Texas governorship. Republican Attorney General Greg Abbotts campaign for governor released this web ad, criticizing Sen. Wendy Davis for raising money outside Texas for her gubernatorial bid. The ad ends with the tag: WENDY DAVIS: OUT OF TOUCH WITH TEXAS.Read more: Abbott web ad hits Davis for out-of-state fundraising, Abbotts campaign for governor ramped up its criticism of Davis alleged \"flip-flopping\" position on the death penalty, asking viewers if Texans could really trust Wendy Davis.Read more: Abbott web ad claims Davis flip-flopped on death penalty, Davis revived questions about Abbotts oversight of a cancer research group, making it the focus of her second TV ad for the general election. The spot featured a cancer survivor suggesting while he was \"praying for a cure,\" Abbott was looking out for his own campaign contributors.Read more: Davis goes on air with second attack ad, Davis campaign for governor released a TV ad, combining her critiques of Abbotts education record, including a plan to force 4-year-olds to undergo regimented assessments, and ends with a challenge to the viewers to decide \"wholl be better for Texas.\"Read more: Davis TV ad takes aim at Abbott on education , Davis campaign for governor released a TV ad accusing Abbott of looking the other way as attorney general when his office learned of sexual assault allegations at a state-run school nearly a decade ago. Repeating an attack from her first two ads, the video ends with the tag: \"What insider was Greg Abbott covering up for this time?\"Read more: Davis says Abbott ignored rape claims at state-run school, Abbotts gubernatorial campaign stepped up its criticism of Davis tenure on the Fort Worth City Council when it unleashed a web ad that labeled her unethical and unfit for Texas.Read more: Abbott web ad says Davis unethical and unfit for Texas, Davis used a TV ad to press questions about Abbotts involvement in federal lawsuits against a Plano hospital with ties to a major donor, alleging Abbott had sided with the hospital after its drug-addled surgeon killed two patients and paralyzed two others.Read more: Davis TV commercial brings back sociopath surgeon, Abbotts first negative TV ad attacked Davis over ethics, saying she \"voted on bills affecting clients and her law firms bottom line.\"Read more: Abbott hits Davis on ethics in 1st negative TV ad, Davis campaign for governor took to the airwaves to criticize Abbott for defending cuts to public schools as attorney general, releasing a TV ad that re-launched the attack in Spanish: He fought against our schools, defending reductions in funds that resulted in 11,000 teachers being fired.Read more: Davis TV ad presents education contrast in Spanish, Abbotts campaign for governor went with a Web ad suggesting opponent Wendy Davis recently failed a pop quiz on her ethics record. The video set her answers to game-show music and sound effects indicating Abbott was not impressed with what she had to say.Read more: Abbott Web ad suggests Davis failed pop quiz , A day before the last debate in the governors race, the Abbotts campaign used a Web ad to tie Davis to President Barack Obama, highlighting her earlier comments about whether she regretted voting for Obama. The spot ends with an excerpt from an earlier Abbott speech: We love this state too much to let the next four years in Texas look like the last six years under Barack Obama.Read more: Abbott web ad links Davis with Obama, , Republican Greg Abbotts campaign for governor released a Web ad Friday morning criticizing Democratic opponent Wendy Davis for dodging questions about the price tag on her education plan. Republican Greg Abbotts campaign for governor released a Web ad... Abbotts campaign zeroed in Davis employment for a title company involved in bringing a business to Fort Worth, highlighting an exchange from an earlier debate in which he asked Davis how much her title company received by closing the \"Cabelas deal.\"Read more: Abbott Web ad quibbles with Davis defense of Cabelas deal , Davis campaign released a radio ad in Spanish that questioned the sincerity of Abbotts outreach to Hispanic voters. In the ad, three people expressed frustration with Abbotts defense of $5.4 billion in state budget cuts to public schools.Read more: Davis radio ad targets Abbott defense of school cuts in Spanish, Davis used Abbotts disability against him in a new TV ad, accusing the attorney general of repeatedly siding against victims like himself. A tree fell on Greg Abbott, a narrator says over an image of an empty wheelchair. He sued and got millions. Since then, hes spent his career working against other victims.Read more: Davis TV ad makes issue out of Abbotts disability , Abbott unveiled a Web ad that rounds up negative reviews of Davis TV ad, which has caused a political uproar by touching on the attorney generals use of a wheelchair. Set to a horror movie-like soundtrack, Abbotts minute-long spot features quotes from various reporters and pundits reacting to Davis commercial and is titled \"Lost Cause.\"Read more: Abbott spot runs down negative reviews of Davis wheelchair ad, Abbotts latest TV ad raised the specter of Barack Obama leading Texas, using the presidents recent remark that his policies are on the ballot this fall against Davis. Barack Obama as the governor of Texas? a narrator says as the 30-second spot begins, showing a fake nameplate bearing the hypothetical name and title. He may as well be on the ballot because Wendy Davis is just like Obama.Read more: Abbott TV ad asks Barack Obama as the governor of Texas, Wendy Davis: \" ... My opponent on the other hand has paid women in his office less than hes paid men, he has campaigned with a known sexual predator who has bragged about having sex with underage girls, and he has shown that he is not favorable, even for women to make decisions on their own in cases of brutal rape or incest. Mr. Abbot that is not protecting Texas women and on behalf of Texas women, no thanks.\"Read more: Oh snap! moments from Abbott-Davis debate in Edinburg, Wendy Davis: \"Mr. Abbott, these cuts and the cuts that youre defending that have left our classrooms overcrowded, that have left our teachers laid off, thats not liberal. Thats not conservative. Its just dumb. And its shortchanging our children and selling out their future.\"Read more: Oh snap! moments from Abbott-Davis debate in Edinburg, State Sen. Wendy Davis  - \"... This should come as no surprise to us given that Greg Abbotts attitudes towards women have revealed themselves in other ways. He pays women in his office less than he pays male assistant attorney generals, he campaigned with a known sexual predator who has bragged about having sex with underage girls.\"Read more: Oh snap! moments during Greg Abbott, Wendy Davis debate in Dallas, Whether you call it on target or way out of line, State Sen. Wendy Davis campaign is standing firmly beside their controversial TV ad that highlighted her Republican opponent Greg Abbotts use of a wheelchair. \"This ad is about one thing and one thing only. Its about Greg Abbotts hypocrisy,\" the Democratic gubernatorial nominee said. The attorney generals campaign has since launched a counter-attack, this one focusing on all the outrage and bewilderment generated by Davis ad. Houston Chronicle columnist Lisa Falkenberg said Davis 30-second ad had a \"solid message\" but clumsy delivery. \"Im not one to advocate violence, but maybe its time to shoot the messenger over there at Davis campaign headquarters?\" Falkenberg said. And this isnt the first round of mudslinging in both campaigns. Weve compiled a list of the meanest moments this year in the gallery above.]", "Date": "20141015", "Author": "[By John-Henry Perera]", "Link": "http://www.chron.com/news/politics/article/Meanest-moments-in-Texas-2014-gubernatorial-run-5824876.php", "Title": "[Meanest moments in Texas' 2014 gubernatorial race]"}