{"Content": "[Now that last weeks midterms are over, 2016 is the next major election cycle on the calendar, and the race for the White House seems to have taken off in earnest. A trio of leading potential Republican candidates campaigns on Wednesday revealed high-profile steps they have taken toward launching their presidential bids. According to multiple reports published Wednesday, former Arkansas Gov. Mike Huckabee, Sen. Ted Cruz of Texas, and Sen. Rand Paul of Kentucky are all quickly moving forward with their plans for the elections in some form or another, even though voters in Iowa wont cast their ballots for at least a year. Early in the morning, The Washington Post detailed Huckabees efforts to reconnect with supporters six years after his unsuccessful 2008 White House bid. Huckabee is reportedly doing several things to lay the groundwork for a campaign. He is planning his reintroduction to key fundraisers over the next few months, hes keeping his 2008 campaign advisers close, and hes receiving encouragement from his family. The Post article also noted Huckabees allies commissioned polls in early primary states that they said found him leading the GOP pack by double digits. \"There were polls done that surprised me and got my attention  and led my friends to urge me to think of this again,\" Huckabee said. Meanwhile, Politicos Mike Allen reported Paul was set to huddle with his core political advisers on Wednesday \"to plan ahead for a likely presidential campaign.\" Allen gave Paul a 90% chance of ultimately launching a White House bid, even though the senator publicly insists he is still making up his mind. \"Doug Stafford, executive director of RAND PAC, will sketch the tentative plans. Separate sessions will cover finance, politics and communications. Participants look at this as the kickoff of a great adventure, where theyre likely to be working shoulder-to-shoulder on a grueling national campaign. In later afternoon, the senator will join to pump up his troops, and will stay for a celebratory dinner,\" Allen wrote in his morning newsletter. Supporters of Cruz, a conservative firebrand, also revealed their plans on Wednesday for a so-called super PAC supporting his candidacy. \"Wed like to be $50 million by the end of March 2016, going into Super Tuesday,\"Cruz confidante Maria Strollo Zack reportedly told the Daily Mail of the PAC, called \"Stand for Principle PAC.\", However, not every Republican is rushing toward the campaign trail. Texas Gov. Rick Perrysurprised many observers on Monday when he said he wouldnt make an official decision whether to run for president again until May  at the soonest. On the Democratic side, front-runner Hillary Clinton said in September that she would make a decision by Jan. 1. However, in October, The New York Times reported a Republican Senate takeover could prompt Clinton to launch her official exploratory committee before the end of the year. That report cited sources close to Clinton who said the Democratic party might \"need to quickly pivot to the presidential campaign\" if the midterms went badly.Of course, last weeks elections were a drubbing for Democrats, with Republicans gaining control of the Senate and winning downballot races by much higher than expected margins. However, on Wednesday, The Hill published a piece indicating Clinton wouldnt push up her timeline based on the midterms. Still, according to that story, Clinton is planning to reveal her presidential plans \"early next year.\", In other words, on both sides of the aisle, it looks as if the presidential campaign is about to be in full swing. Join the conversation about this story , See Also:]", "Date": "20141112", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/Three-Top-GOP-Candidates-Just-Took-Major-Steps-5889040.php", "Title": "[3 Top GOP Candidates Just Took Major Steps Toward 2016]"}