{"Content": "[ Caption, Close, , As the citys historic Emancipation Park anticipates a grand reopening this year, Dowling and Tuam streets are among several street names, school names and memorials that commemorate a racist past best left to history books and museums. (Johnny Hanson / Chronicle), As the citys historic Emancipation Park anticipates a grand... In 1892, Houstons city fathers decided the time had come for East Broadway Street to become Dowling Street, in honor of Lt. Richard Dowling. Thirty years earlier, young Dick Dowling, a 25-year-old Irish immigrant and Houston barkeep, had become an instant Confederate hero when he and 42 artillerymen repelled 22 Union warships at the mouth of the Sabine River. Perhaps it was coincidental, but the newly named streets most prominent feature was Emancipation Park, founded 20 years earlier by African-American community leaders, with money black churches had donated. Perhaps it was a coincidence, as well, that those same Houston city officials decided decided to bestow the name Tuam, Dowlings birthplace in Galway, Ireland, on the street runing along the parks northern border.  , As the citys historic Emancipation Park anticipates a grand reopening this year, Dowling and Tuam streets are among several street names, school names and memorials that commemorate a racist past best left to history books and museums. If South Carolina, where the Civil War began - and where its never really ended - can decide to take down the Confederate battle flag that flies on the grounds of the state capitol, then surely Houston and Texas can reassess their commemoration of a slave-holding, apartheid South, a regime dedicated to the notion of white supremacy and willing to defend it no matter the cost. Houston can start by renaming Dowling Street, perhaps in time for the reopening of Emancipation Park. Interestingly, theres precedent for reassessing the local heros place in history. A Dowling statue erected in front of the old City Hall in 1905 came down in 1939 and was stored away in a barn for nearly 20 years. Today it stands on the backside of Hermann Park, near the fifth green of the golf course. Most Houstonians rarely notice it. At least four schools in the Houston Independent School District need to be renamed: Lee High School, named in honor of Gen. Robert E. Lee; Johnston Middle School, which honors Albert Sidney Johnston, another Confederate general; Jefferson Davis High School, named after the president of the Confederacy; and Dowling Middle School. Weve changed school mascots; now its time to change names. Although Texas was on the periphery of the Confederacy compared to South Carolina and other Deep South bastions of a breakaway apartheid nation, the Lone Star State is replete with Confederate memorials. A Confederate-soldier statue stands guard over a number of county courthouse squares. More than 30 of those counties are named after Confederate figures (including Jeff Davis County in far West Texas). Those counties are unlikely to be renamed, but other memorials are more easily changed. The statue of Davis has no place on the campus of the University of Texas at Austin, where it has stood for decades. \"Given Jefferson Davis vehement support for the institution of slavery and white supremacy, we believe this statue is not in line with the universitys core values - learning, discovery, freedom, leadership, individual opportunity, and responsibility,\" stated a petition circulated by members of UTs student government. Newly installed UT-Austin President Gregory Fenves, to his credit, is giving the petitioners a respectful hearing. We are well aware of the argument that commemorating the Confederacy is about heritage, not hate. Unfortunately, its a heritage of hate, as the Texas secessionists themselves made clear in their Statement of Causes, published on Feb. 2, 1861:, \"We hold as undeniable truths that the governments of the various States, and of the confederacy itself, were established exclusively by the white race, for themselves and their posterity; that the African race had no agency in their establishment; that they were rightfully held and regarded as an inferior and dependent race, and in that condition only could their existence in this country be rendered beneficial or tolerable.   .\", More than a century and a half after a war that tore apart this nation, thats the heritage we should be honoring?]", "Date": "20150624", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/editorials/article/Rename-Dowling-Street-6345130.php", "Title": "[Editorial: Rename Dowling Street]"}