{"Content": "[ Caption, Close, Social activist Julian Bond, and leader in the American civil rights movement, and Luci Baines Johnson, the younger daughter of President Lyndon Baines Johnson, join hands as they sing \"We Shall Overcome\" before President Barack Obama spoke at the LBJ Presidential Library, Thursday, April 10, 2014, in Austin, Texas, during the Civil Rights Summit to commemorate the 50th anniversary of the signing of the Civil Rights Act. Civil Rights leader Julian Bond, right, talks with Chesapeake Climate Action Network Executive Director, Mike Tidwell, center, and another activist as they are chained to a fence at the White House in Washington, Wednesday, Feb. 13, 2013, as prominent environmental leaders tied themselves to the White House gate to protest the Keystone XL oil pipeline. President Clinton waves to the 3,000 people attending the NAACP Convention who gave him an enthusiastic welcome in the organizations hometown of Baltimore, Md. Thursday, July 13, 2000.  At left is  Chairman of the National Board of Directors Julian Bond. Presidential candidates Vice President Al Gore and Gov. George W. Bush spoke to the convention earlier in the week. Republican presidential candidate Texas Gov. George W. Bush waves as Julian Bond, chairman of the board of directors of the NAACP, points out someone in the audience to him during the NAACPs annual convention in Baltimore, Monday, July 10, 2000. Social activist Julian Bond, center, and Luci Baines Johnson, the younger daughter of President Lyndon Baines Johnson, right join hands as they sing \"We Shall Overcome\" before President Barack Obama speaks at the LBJ Presidential Library, Thursday, April 10, 2014, in Austin, Texas, during the Civil Rights Summit to commemorate the 50th anniversary of the signing of the Civil Rights Act. Civil rights leader Julian Bond is arrested outside the White House in Washington, Wednesday, Feb. 13, 2013, as prominent environmental leaders tied themselves to the White House gate to protest the Keystone XL oil pipeline. Bruce Gordon, left, president of the NAACP, talks with  NAACP chairman Julian Bond after a news conference in Washington Saturday, July 15, 2006 as the organizations 97th annual convention begins.   \"Voting Our Values: Valuing Our Votes\" is the theme for the gathering.   (AP Photo/Gerald Herbert) Ran on: 07-16-2006 Bruce Gordon (left), NAACP president, talks with NAACP Chairman Julian Bond at the organizations 97th annual convention. Civil rights protester Julian Bond, left, and Sierra Club Executive Director Michael Brune, second from left, gather with activists in front of the White House in Washington, Wednesday, Feb. 13, 2013, as prominent environmental leaders tied themselves to the White House gate to protest the Keystone XL oil pipeline. Bruce S. Gordon, president and chief executive officer of the NAACP, left, Rev. Jesse Jackson, center, and Julian Bond, chairman of the NAACP National Board of Directors, right, join hands at the annual convention of the National Association for the Advancement of Colored People Wednesday, July 19, 2006 in Washington.  (AP Photo/Evan Vucci) Ran on: 07-20-2006 NAACP President Bruce Gordon (left) and Chairman Julian Bond (right) join hands with Jesse Jackson at the organizations conven- tion, which featured a lobbying blitz on the Senate. Julian Bond, shown in this Jan. 17, 1998 file photo, said restoring the NAACPs integrity was paramount during his campaign to become chairman of the civil rights organizations national board. So more than a few eyebrows arched when Bond selected supporter James Ghee, a convicted embezzler and disbarred attorney from Virginia, for leadership positions on the board just moments after winning the election two weeks ago. Julian Bond, chairman of the NAACP National Board of Directors, addresses the NAACP national conventions public mass meeting at the Baltimore Civic Center Sunday, July 9, 2000. Julian Bond, civil rights activist and recently-elected chairman of the National Association for the Advancement of Colored People, delivers a lecture Tuesday, March 10, 1998, at Saginaw Valley State University. Bond said todays youth need to capture the can-do spirit that led students to demand their rights in the 1960s. Civil rights pioneer JUlian Bond, right, is shown with March on Washington Film Festival founder Robert Raben. Democratic presidential candidate Vice President Al Gore waves at the conclusion of his speech as Julian Bond, chairman of the NAACPs national board of directors, far left, and Kweisi Mfume, president and chief executive officer of the NAACP, second from left, applaud Wednesday, July 12, 2000.  Gore addressed the NAACPs national convention in Baltimore. Julian Bond, chairman of the NAACP National Board of Directors, addresses the NAACP national conventions public mass meeting at the Baltimore Civic Center Sunday, July 9, 2000. Former NAACP Chairman Julian Bond speaks during the unveiling of the new Rosa Parks stamp, a commemorative stamp issued by the U.S. Postal Service honoring civil rights icon, February 4, 2013 at The Henry Ford in Dearborn, Michigan. The stamp went on sale February 4, 2013, what would have been Rosa Parks 100th birthday. Julian Bond, former Chairman, NAACP (R) looks over towards  Lonnie G. Bunch, III, moderator, during the panel discussion, Heroes of the Civil Rights Movement: Views from the Front Line, on the second day of the Civil Rights Summit at the LBJ Presidential Library April 9, 2014 in Austin, Texas. The summit is marking the 50th anniversary of the passing of the Civil Rights Act legislation, with U.S. President Barack Obama making the keynote speech on April 10. NAACP National Board of Directors Chairman Julian Bond speaks during a news briefing at the National Press Club August 31, 2006 in Washington DC. The Internal Revenue Service cleared the NAACP?s tax-exempt status in the wake of an investigation of speech by Bond criticizing U.S. President George W. Bush called the tax status of the organization into question. FILE- In this Oct. 13, 2006, file photo, Julian Bond, chairman of the Board for The National Association for the Advancement of Colored People, gestures as he talk to the media about the organization at The University of South Carolina in Columbia, S.C. Bond, a civil rights activist and longtime board chairman of the NAACP, died Saturday, Aug. 15, 2015, according to the Southern Poverty Law Center. He was 75. FILE- In this July 8, 2007, file photo shows NAACP Chairman Julian Bond addresses the civil rights organizations annual convention in Detroit. Bond, a civil rights activist and longtime board chairman of the NAACP, died Saturday, Aug. 15, 2015, according to the Southern Poverty Law Center. He was 75. FILE- In this April 10, 2014, file photo, social activist Julian Bond hugs Luci Baines Johnson, the younger daughter of President Lyndon Baines Johnson after singing \"We Shall Overcome\" during the Civil Rights Summit to commemorate the 50th anniversary of the signing of the Civil Rights Act in Austin, Texas. Bond, a civil rights activist and longtime board chairman of the NAACP, died Saturday, Aug. 15, 2015, according to the Southern Poverty Law Center. He was 75. ATLANTA (AP)  Julian Bonds life traced the arc of the civil rights movement, from his efforts as a militant young man to start a student protest group all the way to the top leadership post at the NAACP. Year after year, the calm, telegenic Bond was one of the nations most poetic voices for equality, inspiring fellow activists with his words in the 1960s and sharing the movements vision with succeeding generations as a speaker and academic. He died Saturday at 75. Former Ambassador Andrew Young said Bonds legacy would be as a \"lifetime struggler.\", \"He started when he was about 17 and he went to 75,\" Young said. \"And I dont know a single time when he was not involved in some phase of the civil rights movement.\", Bond died in Fort Walton Beach, Florida, after a brief illness, according to a statement issued Sunday by the Southern Poverty Law Center, an advocacy group that he founded in 1971 and helped oversee for the rest of his life. His wife, Pamela Horowitz, said Bond suffered from vascular disease. Her husband, she said, \"never took his eyes off the prize and that was always racial equality.\", The son of a college president burst into the national consciousness after helping to start the Student Non-Violent Coordinating Committee, where he rubbed shoulders with committee leaders Stokely Carmichael and John Lewis. As the committee grew into one of the movements most important groups, the young Bond dropped out of Morehouse College in Atlanta to serve as communications director. He later returned and completed his degree in 1971. Bond was elected to the Georgia House of Representatives in 1965, but fellow lawmakers, many of them white, refused to let him take his seat because of his anti-war stance on Vietnam. The case went all the way to the U.S. Supreme Court, which ruled in his favor. Bond finally took office in 1967. \"If this was another movement, they would call him the PR man, because he was the one who wrote the best, who framed the issues the best. He was called upon time and again to write it, to express it,\" said Eleanor Holmes Norton, who was Bonds colleague on the student committee and later wrote a friend-of-the-court brief for the American Civil Liberties Union when Bonds case was before the high court. President Barack Obama called Bond \"a hero.\", \"Justice and equality was the mission that spanned his life,\" Obama said in a statement. \"Julian Bond helped change this country for the better.\", In 1968, he led a delegation to the Democratic National Convention, where his name was placed in nomination for the vice presidency, but he declined because he was too young. He served in the Georgia House until 1975 and then served six terms in the Georgia Senate until 1986. He also served as president of the law center from its founding until 1979 and was later on its board of directors. Bond was elected board chairman of the NAACP in 1998 and served for 10 years. He was known for his intellect and his even keel, even in the most emotional situations, Young said. \"When everybody else was getting worked up, I could find in Julian a cool serious analysis of what was going on,\" Young said. In the most intense debates, Bond was \"always a gentleman\" and never mean, his wife said. Bond was often at the forefront of protests. In 1960, he helped organize a sit-in involving Atlanta college students at the city hall cafeteria. \"We never thought that he really would participate and be arrested because he was always so laid back and cool, but he joined in with us,\" recalled Carolyn Long Banks, now 74, who said Bond never sought much recognition in those early years. Bond was \"a thinker as well as a doer. He was a writer as well as a young philosopher,\" said Charlayne Hunter-Gault, a journalist who struck up a friendship with Bond in the early 1960s, when she was one of the first two black students to attend the University of Georgia. At the time, Bond was an activist in Atlanta with the newly formed committee. His eloquence and sense of humor \"really helped sustain the young people in the civil rights movement.\", Hunter-Gault said she hopes a new generation of activists draws lessons from Bonds life and work as they embrace the Black Lives Matter movement. \"Everybody is not going to be out there in the street with their hands up or shouting,\" she said. \"Thereve got to be people like Julian who participate and observe and combine those two things for action and change that make a difference.\", Morris Dees, co-founder of the law center, said the nation lost one of its most passionate voices for justice. \"He advocated not just for African-Americans but for every group, indeed every person subject to oppression and discrimination, because he recognized the common humanity in us all,\" Dees said. After leading the NAACP, Bond stayed active in Democratic politics. He also made regular appearances on the lecture circuit and on television and taught at several universities. Horace Julian Bond was born Jan. 14, 1940, in Nashville, Tennessee. In addition to his wife, a former staff attorney at the law center, survivors include five children. ", "Date": "20150819", "Author": "[Jesse J. Holland and Jeff Martin, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Longtime-civil-rights-activist-Bond-dead-at-75-6447049.php", "Title": "[Julian Bond, former NAACP chairman and activist, dies at 75]"}