{"Content": "[ PETERBOROUGH, N.H. (AP)  Even at his own rallies, Republican presidential candidate John Kasich is a stranger to some New Hampshire voters. Karen Bednarski, who packed into one of the Ohio governors three New Hampshire appearances this week, says she learned about his presidential bid for the first time \"within the last week.\", \"What Ive heard I like,\" Bednarski, a 48-year-old Republican-leaning independent from Peterborough, said just before Kasich walked into the room. It may not matter that many in the audience didnt know how to pronounce his name (its KAY-sik), didnt remember his 18 years in Congress and hadnt heard about his overwhelming re-election last year in one of the nations premiere swing states. Even as a mystery, Kasich has emerged as a legitimate threat to his better-known Republican rivals  former Florida Gov. Jeb Bush in particular  whose presidential aspirations are focused on New Hampshire. \"Ive always been underestimated,\" Kasich said, describing himself as \"the little engine that keeps saying that it can.\", Kasich is among a handful of Republican White House hopefuls betting they can capitalize on the first-in-the-nation primary states tendency to favor pragmatic leaders over party ideologues. Beyond Kasich and Bush, its a group that includes New Jersey Gov. Chris Christie, former New York Gov. George Pataki and perhaps Kentucky Sen. Rand Paul, whose libertarian leanings resonate in the state whose official motto is \"live free or die.\", It is a powerful collection of candidates targeting the same slice of the electorate among a larger field of 17 major Republican contenders. Coming off a strong performance in the first GOP debate, however, Kasich has shown signs of momentum. And Bushs team has taken notice. On policy, tone and political strategy, Kasich and Bush draw from a remarkably similar political playbook. Both men made New Hampshire their first stop immediately after announcing their presidential campaigns and after the recent presidential debate, although the straight-talking Kasich doesnt pretend hes as well-known as his rivals. \"One of the things that frustrates me is that you dont know me,\" he told the audience at a Peterborough town hall-style meeting on Tuesday, the first of three public appearances over three days of campaigning. It was Kasichs 11th trip to the state this year, said Kasich spokesman Chris Schrimpf; hes scheduled to make his 12th next week. Bush is set to return to New Hampshire next week for his 11th appearance since March alone. \"Our approach from the start is were going to be low to the ground and were going to take Jeb everywhere,\" said Rich Killion, a senior adviser to Bush in New Hampshire. Kasich has just four paid staffers in the state compared to Jebs seven. Yet Kasich has recently acquired two well-respected surrogates volunteering on his behalf: former Sen. John E. Sununu and former state Attorney General Tom Rath. \"I think Jeb is a very strong candidate here,\" said Rath, a former adviser to Bushs older brother, former President George W. Bush. \"The difference is its a stronger field. Right now, nobodys got control of this playing surface.\", The parallels between Kasich and Bush are undeniable. In sharp contrast to many conservatives, both men speak warmly of immigrants in the country illegally. While Bush says such immigrants came out of an \"act of love,\" Kasich said this week they \"contribute significantly\" to the nation. \"A lot of these people who are here are some of the hardest-working, God-fearing family-oriented people you can ever meet,\" he said. Kasich and Bush are also among the few candidates in the race who support the Common Core education standards, a policy they defend as helpful for states to seeking to establish higher standards. The standards are vehemently opposed by many conservative Republicans. Both favor sending additional ground troops to combat the Islamic State group. Like Bush, Kasich wont say how many troops might be necessary beyond the 3,500 American military trainers and advisers already helping Iraqi forces. Asked how long U.S. forces should be willing to stay in the region, Kasich said, \"As long as it takes to get the job done.\", The pair also shares a similar tone, embracing an optimistic campaign message when compared to rivals such as Paul and Texas Sen. Ted Cruz, whose candidacies are defined as much by what theyre against as what theyre for. Kasich has taken his positive message to the next level, however, by refusing to attack his competitors in either party. \"If youre suggesting that personal attacks are off limits, I agree with you,\" he told a voter this past week, adding that issue-oriented debates are fair. \"I wont attack Hillary personally,\" a reference to Democratic front-runner Hillary Rodham Clinton. After his first New Hampshire appearance, Bednarski said she was impressed by Kasichs straightforward manner and compassionate tone. And once he started talking, she said, she remembered his role in budget negotiations with President Bill Clinton in the 1990s. \"I never thought Id say this,\" Bednarski said, \"but I may sign up to help him. Thats a step Ive never taken.\", ", "Date": "20150818", "Author": "[Steve Peoples, Associated Press]", "Link": "http://www.chron.com/news/politics/article/He-may-be-a-mystery-but-Kasich-challenges-Bush-6446013.php", "Title": "[He may be a mystery, but Kasich challenges Bush in NH]"}