{"Content": "[ Caption, Close, FILE - In this Aug. 14, 2015, file photo, Democratic presidential candidate Sen. Bernie Sanders, I-Vt. speaks at the at the Iowa Democratic Wing Ding at the Surf Ballroom in Clear Lake, Iowa. The Vermont senator sought to broaden his appeal with black voters Friday, Aug. 21, 2015, in speeches in South Carolina denouncing \"institutional racism\" in the American political and economic system. Republican presidential candidate, former Texas Gov. Rick Perry speaks at the Defending the American Dream summit hosted by Americans for Prosperity at the Greater Columbus Convention Center in Columbus, Ohio, Saturday, Aug. 22, 2015. Republican presidential candidate, Sen. Marco Rubio, R-Fla. speaks at the Defending the American Dream summit hosted by Americans for Prosperity at the Greater Columbus Convention Center in Columbus, Ohio, Saturday, Aug. 22, 2015. Republican presidential candidate, Sen. Ted Cruz, R-Texas, greets supporters  at the Defending the American Dream summit hosted by Americans for Prosperity, Saturday, Aug. 22, 2015, at the Greater Columbus Convention Center in Columbus, Ohio. COLUMBUS, Ohio (AP)  The latest on the annual summit of Americans for Prosperity, the flagship conservative political organization of the billionaire industrialists Charles and David Koch. All times are local. 9 p.m. As Americans for Prosperity hears from GOP presidential hopefuls in Ohio, 2016 Democratic candidate Bernie Sanders is in South Carolina blasting the organizations benefactors, Charles and David Koch. Sanders tells more than 3,000 activists that the Kochs represent a billionaire class that is trying to buy elections to consolidate their already immense economic power. Earlier Saturday in Sumter, South Carolina, the Vermont senator called for publicly financed elections. And he promised at both stops that any judge he nominates for the Supreme Court would first pledge to overturn the Citizens United decision that allows corporations, unions and wealthy individuals to spend unlimited amounts of money in campaigns. Sanders refuses large donors to a separate Super PAC, like those aligned with many of the top presidential contenders. He says he has more than 400,000 individual donors, with an average contribution of $31.20.  Bill Barrow in North Charleston, South Carolina, 4 p.m. Former Texas Gov. Rick Perry is needling fellow GOP presidential candidate Ohio Gov. John Kasich (KAY-sik) in his own home state, criticizing him for accepting federal Medicaid dollars under President Barack Obamas health care law. Without ever mentioning Kasich by name, Perry boasted Saturday that as governor of Texas he had refused to take federal dollars, whether Race to the Top education grants or money to expand Medicaid. \"See, the idea that Washington has this federal pot of Ohio Medicaid money that would have gone to some other state is just nonsense,\" Perry told thousands of activists at the Americans for Prosperity summit in Columbus. \"That money doesnt come from an endless vault of money in Washington. It is borrowed from bankers in China and children in Cleveland and Columbus.\", Kasich was one of the initial Republican governors who expanded Medicaid under the health law, arguing it was Christian to help the poor and his state sends more to Washington than it gets back. The move infuriated conservatives, and though Kasichs office is just down the street he was not invited to the two-day summit. Kasichs campaign contended in response that one of Perrys budgets was balanced using federal stimulus dollars.  Julie Carr Smyth, Columbus, 3:30 p.m. Florida Sen. Marco Rubio is telling more than 3,000 conservative activists from around the country that the United States economic growth is lagging because other countries are doing better at what the U.S. set in motion but has abandoned. Rubio was among the five Republican presidential candidates speaking to Americans for Prosperitys annual summit, a gathering of local conservative activists affiliated with the flagship political advocacy group financed largely by industrialists Charles and David Koch. Rubio says: \"There are dozens of countries that have learned from our example... So the first thing we must do is become globally competitive again. Thats why we talk about tax reform.\", The crowd cheered often during his 20-minute speech, and laughed at his jokes, though not as fervently as they did during Sen. Ted Cruzs speech immediately before. Unlike Cruz, in shirtsleeves, and perhaps hoping to come across as presidential, Rubio, 43 and the youngest GOP candidate for president, wore a dark suit, white shirt, and Republican-red tie.  Tom Beaumont, Columbus, 2:20 p.m. Republican presidential candidate Sen. Ted Cruz says if elected he would rescind \"every single illegal and unconstitutional executive order\" signed by President Barack Obama, begin investigating Planned Parenthood, \"rip to shreds\" the Iranian nuclear deal and order all federal agencies to end religious persecution of Christians  all on his first day in office. Cruz was the first of three GOP presidential contenders speaking Saturday to a packed crowd at the annual summit of Americans for Prosperity, the conservative flagship of the Koch brothers. Cruz peppered his address with jokes, scriptural references and jabs at Obama and Democratic frontrunner Hillary Clinton. He said hes the best choice among the GOPs vast field because he will always do what he says hes going to do. Cruz joked hed like to see the Internal Revenue Service discontinued and would take its 90,000 employees and send them to guard the U.S.-Mexico border.  Julie Carr Smyth, Columbus, 2:00 p.m. Roaring crowds are dancing and leaping for prizes from t-shirt guns on the second day of Americans for Prosperitys annual conference in Columbus, Ohio. Three more Republican presidential hopefuls  Sens. Ted Cruz and Marco Rubio and former Texas Gov. Rick Perry  are scheduled to address the conservative flagship organization of billionaire industrialists Charles and David Koch on Saturday. Former Florida Gov. Jeb Bush and Louisiana Gov. Bobby Jindal spoke on Friday. An invitation to speak at the event potentially paves the way to tea party financial support and votes as Republicans seek to narrow their large presidential field in 2016.]", "Date": "20150823", "Author": "[The Associated Press]", "Link": "http://www.chron.com/news/texas/article/The-Latest-Perry-criticizes-Kasich-in-his-own-6459918.php", "Title": "[The Latest: Sanders denounces Koch brothers at SC stop]"}