{"Content": "[ Sometimes it takes a tragedy to get peoples attention. Januarys terrorist attack on a kosher grocery in Paris triggered a long-overdue discussion about the rise of anti-Semitism in Europe. \"These are the worst times since the Nazi era,\" Dieter Graumann, president of Germanys Central Council of Jews, told The Guardian after a spike in violence against Jews this summer. The problem can no longer be denied or chalked up to statistical blips. In 2014, some 7,000 French Jews left for Israel, more than double the number who left the previous year. A nonprofit in England reports that from 2013 and 2014 the number of anti-Semitic incidents - violence, property damage, abuse, and threats - more than doubled to 1,168, the most ever recorded. A 2013 European Union survey found that nearly 50 percent of Hungarian Jews had considered emigrating because they felt unsafe. Anti-Semitism is sometimes viewed as distinct from - and even subordinate to - other human rights issues. Thats a mistake. Anti-Semitism, left unchecked, leads to the persecution of other minorities and an overall increase in repression. It augurs societal breakdown. Houstonians and other Americans may see this trend as a problem for European Jews or, at most, for Europe. Thats a mistake. The rise of anti-Semitism threatens democratic values and the European Union itself. Europe is our most important ally. That makes it our problem, too. In France, as in other European countries, a classic fascistic anti-Semitism exists alongside a newer incarnation taking root among marginalized people of Muslim heritage. Its important not to lump all French Muslims together; many are well-integrated into broader French society. But a sizable, disenfranchised minority remains. Among this population, conspiracy theories about Jewish control of the world tend to resonate, and the line between criticizing Israeli government policies and demonizing Jews often vanishes. While only a fraction of Muslims who hold anti-Semitic beliefs engage in attacks on Jews or Jewish institutions, theres no denying that hatred has contributed to violence. The resulting rise in anti-Muslim sentiment is a gift to Europes neo-fascists. As Shadi Hamid of the Brookings Institution says: \"Just as Islamist extremists benefit the far right, an emboldened French far right benefits Islamist extremists, allowing them to drive a greater wedge between Muslims and non-Muslims and feed their clash of civilizations narrative.\", Unfortunately, the response of some European governments has been poor. Consider Hungary, where the anti-Semitic Jobbik party won 20 percent of the vote in recent elections. Instead of challenging Jobbik, Prime Minster Victor Orban has coopted important parts of its agenda. As part of a broader slide toward authoritarianism, Orban has trafficked in ethnic nationalism and World War II revisionism. French officials have spoken out boldly against anti-Semitism. In the wake of the Paris attacks, however, the government is using a new counterterrorism law to restrict speech. Dozens of Muslims have been arrested for speech allegedly in support of terrorism, exacerbating the very divisions on which extremists feed. Public officials should condemn, not criminalize, hate speech. They should reserve the force of the law for perpetrators of anti-Semitic violence. Hate crime harms not only its direct victims but entire communities. With a single act of violence, an attacker can terrorize thousands. Indeed, thats often the goal. The U.S. government, a leader in combating hate crime, should share best practices and lend technical assistance. Governments should also work with Jewish communities to assess their security needs and provide protection. Increased security, however, is no more than a stopgap measure. Leaders must work to create a culture of zero tolerance for anti-Semitism. Civil society and religious leaders also have a role. No community should stand alone. Targeted minorities and human rights groups share an interest in preventing persecution and exclusion. Leaders should forge coalitions to promote respect for the rights of all. The Holocaust taught us, or shouldve taught us, about the dangers of complacency in the face of anti-Semitism. Milton Boniuk - a Houston Holocaust Museum board member who sponsors a library of videotaped testimony of Houston-area survivors and benefactor to The Boniuk Institute for the Study and Advancement of Religious Tolerance at Rice University - says that many who would become victims of the Holocaust were in denial. \"They couldnt believe what was happening until it was too late,\" says Boniuk, who himself lost family members in the Holocaust. Europe is not on the brink of another Holocaust, but the problem is serious. And we know from history that anti-Semitism will keep growing - unless people come together to fight it. , Elisa Massimino is president and CEO of Human Rights First.]", "Date": "20150326", "Author": "[By Elisa Massimino]", "Link": "http://www.chron.com/opinion/outlook/article/Massimino-Europe-s-anti-Semitism-can-be-ignored-6161647.php", "Title": "[Massimino: Europe's anti-Semitism can be ignored no more]"}