{"Content": "[ Caption, Close, When he was Texas attorney general, Greg Abbott, now the governor, filed a lawsuit challenging President Obamas order shielding millions from deportation. Texas was joined by more than two dozen states in the lawsuit. The highly controversial executive order issued by President Obama caused a backlash from many in the GOP. See how the order, which has been blocked by a judge, would impact the nation if its eventually enforced. 1. Parents, 2. Children, 3. Prioritizing deportations, 4. Law enforcement, 5. Border security, 6. Salaries, 7. Business programs, 8. Green cards, AUSTIN - A federal judge late Monday halted President Barack Obamas landmark immigration order on the eve of its implementation, denying millions of people illegally in America access to work permits and dealing a victory to Gov. Greg Abbott in his lawsuit against the program. The decision from Judge Andrew Hanen, based in Brownsville, did not declare the executive action unconstitutional but said it should not take effect until the legal questions have been settled. \"Once these services are provided,\" Hanen wrote in a 123-page ruling, \"there will be no effective way of putting the toothpaste back in the tube should the plaintiffs ultimately prevail.\", Immigration activists had been bracing for an unfavorable decision from Hanen, an appointee of former President George W. Bush to the Southern District of Texas. He previously has expressed skepticism at the federal governments ability to enforce the law at the border. The White House cast the ruling as a temporary set-back. \"The Supreme Court and Congress have made clear that the federal government can set priorities in enforcing our immigration lawswhich is exactly what the President did when he announced commonsense policies to help fix our broken immigration system,\" according to a statement. The administration is expected to appeal the decision to the 5th U.S. Circuit Court of Appeals in New Orleans. Still, Texas Republicans late Monday night cheered the ruling as a clear rebuttal of Obamas policy. Attorney General Ken Paxton called it a \"crucial first step in reining in President Obamas lawlessness,\" and Abbott said it \"rightly stops the presidents overreach in its tracks.\", \"We live in a nation governed by a system of checks and balances, and the presidents attempt to by-pass the will of the American people was successfully checked today,\" Abbott said in a statement. Led by Abbott, Texas and 25 other states had argued that Obama unconstitutionally sidestepped Congress when he took executive action last November to shield from deportation up to 5 million immigrants in the country illegally. That number included an estimated 170,000 in Harris County, about a third of all such immigrants in the region, and more than half a million in other parts of Texas, according to an analysis of U.S. Census data. The states argued they will have to pay the costs of providing services to those here illegally. Texas led a 17-state coalition when Abbott filed the lawsuit last December while serving as the states attorney general. The number of states that have signed on to the challenge has since grown to 26. The Obama administration defended the move as within the presidents authority and consistent with other actions taken by presidents of both parties. Hanens ruling arrived two days before U.S. Citizenship and Immigration Services was set to start accepting applications for the program. It also came as Congress is debating how to fund the U.S. Department of Homeland Security, which oversees immigration laws. The decision could give Republicans some leverage in that fight. Democrats expressed optimism about an appeal but said even a temporary delay in providing work permits would hurt people who had done nothing wrong. \"We are talking about Texas students who know no other country but the United States, and parents of U.S. citizen children,\" said state Rep. Armando Walle, D-Houston. \"These children pledge allegiance every day in school to the U.S. and Texas flags.\"]", "Date": "20150217", "Author": "[By Brian M. Rosenthal and Patrick Svitek]", "Link": "http://www.chron.com/news/houston-texas/article/Abbott-Federal-judge-halts-Obama-immigration-6084523.php", "Title": "[Federal judge blocks Obama immigration order]"}