{"Content": "[ Caption, Close, , Dick CheneyPresident George W. Bushs no. 2 man was initially opposed to gays in the military, but changed his tune nearly a decade later. \"With the respect to the question of relationships, my general view is freedom means freedom for everyone,\" he told the Associated Press. His lesbian daughter almost certainly played a role in evolving his views. Hes still one of the few prominent Republicans to support extending gay marriage rights. Al GoreFor a good length of time, the former vice president supported the concept of same-sex unions but not same-sex marriages. \"Im for domestic partnerships having legal protections, but not the same sacrament, not the same name, because I favor protecting the institution of marriage as it has been understood between a man and a woman,\" he said during a debate at Dartmouth College in 1999. But in 2008, Gore switched his tune when he outright said \"gay men and women ought to have the same rights as heterosexual men and women ... to join together in marriage, and I dont understand why it is considered by some people to be a threat to heterosexual marriage.\", Sen. Patrick Leahy, D-Vt.In 1996, Leahy voted YES on the Defense of Marriage Act, prohibiting same-sex marriage. Leahy later expressed regret on his decision, saying \"When I voted for DOMA in 1996, I believed that it was a way to allow states to maintain their independence and define marriage as each state saw fit.\" , Laura BushThe former First Ladys stance on same-sex marriage and abortion was a bit different than her husbands, according to her memoir \"Spoken from the Heart.\" In an interview with CNNs Larry King in 2010, Bush said, \"There are a lot of people who have trouble coming to terms with that because they see marriage as traditionally between a man and a woman. But I also know that, you know, when couples are committed to each other and love each other, that they ought to have, I think, the same sort of rights that everyone has.\", Sen. Patty Murray, D-Wash.Like so many other senators, Murray voted YES on the 1996 Defense of Marriage Act, prohibiting same-sex marriage. Murray later changed her stance, and in 2011 stated that she was planning to repeal the act entirely. It was noted that Murray never offered an explanation on why she voted for DOMA in the first place. John KerryStrangely, Kerry voted NO on the 1996 Defense of Marriage Act, but would later say states should be able to decide if they would allow same-sex marriages during his presidential campaign. In 2004, he went on record saying that while he supported same-sex unions, he believed marriage was between a man and a women. In 2011, Kerry quietly came out in support of same-sex marriage to the Boston Globe in an editorial. Bill ClintonThe former Arkansas governor and U.S. president unceremoniously signed the Defense of Marriage Act into law in 1996 despite calling it \"gay-baiting.\" Years later, he said the law should be overturned, though some in the LGBT community are still upset that he signed into being in the first place, the New York Times reported. Jimmy CarterAfter long supporting same-sex marriage, the former U.S. president confused many following an interview with Dallas WFAA-TV. In that interview, Carter flip-flopped on the issue, saying states, rather than the nation as a whole, should decide on legalizing same-sex marriage. \"I dont think that the government ought to ever tell the church to marry people, if the church doesnt want to ... Im kind of inclined to let the states decide individually.\", Vice President Joe BidenPrior to angering President Barack Obamas campaign staff in 2012 by openly supporting same-sex marriage, Biden issued support for same-sex civil unions but not marriage during a debate with Sarah Palin in 2008. In 2013, he repeated his support for same-sex marriage in an interview with Rolling Stone Magazine, saying \"Remember, I got criticized for saying I support gay marriage. I just decided I couldnt be quiet about it anymore, and everybody was stunned that thats where the public is. And Im not stunned; its where the publics been for a while. Talk to any of your kids, for Gods sake.\", President Barack ObamaIn 2006, Obama expressed opposition to same-sex marriage, but supported the concept of civil unions, saying churches and faith groups should be able to decide whether to call them marriages or not. In 2013, he regretted his distinction between unions and marriages. \"Ive always believed that gay and lesbian Americans should be treated fairly and equally. I was reluctant to use the term marriage because of the very powerful traditions it evokes. And I thought civil union laws that conferred legal rights upon gay and lesbian couples were a solution ... What Ive come to realize is that for loving, same-sex couples, the denial of marriage equality means that, in their eyes and the eyes of their children, they are still considered less than full citizens.\", Sen. Harry Reid, D-Nev.In 1996, Reid voted YES on the Defense of Marriage Act, prohibiting same-sex marriage. His views must have evolved since then because in 2013, following the Supreme Courts ruling to strike down DOMA, he called it a \"great, historic day for equality in America.\"Source: Politico, Jon Huntsman, Jr.Just prior to the 2012 presidential election, Huntsman supported the concept of same-sex unions. A year later, he wrote in an editorial for the American Conservative that he was for same-sex marriage and encouraged others to do so as well. \"While serving as governor of Utah, I pushed for civil unions and expanded reciprocal benefits for gay citizens. I did so not because of political pressure--indeed, at the time 70% of Utahns were opposed--but because as governor my role was to work for everybody, even those who didnt have access to a powerful lobby ... That was 4 years ago. Today we have an opportunity to do more: conservatives should start to lead again and push their states to join the nine others that allow all their citizens to marry.\", Hillary ClintonThe former First Lady expressed support for the Defense of Marriage Act in 1996, but supported same-sex civil unions and benefits for same-sex partnerships. In 2014, she claimed to have since evolved her views in support of same-sex marriage. \"I think youre reading it very wrong,\" she told CBS News. \"Just because youre a politician doesnt mean youre not a thinking human being. You gather information, you think through positions, youre not 100 percent set, thank goodness, youre constantly re-evaluating where you stand. That is true for me. One of my big problems right now is that too many people believe they have a direct line to the divine and they never want to change their mind about anything.\", A West Texas county clerk vowed to defy the U.S. Supreme Court and not grant marriage licenses to same sex couples. In a 1,100-word \"declaration of obedience to law and defense of natural marriage,\" Irion County Clerk Molly Criner called the Supreme Courts June 26 ruling \"an opinion with no basis in the Constitution, the Fourteenth Amendment, American law, or Western history,\" and said issuing marriage licenses to homosexual couples would violate her religious beliefs. RELATED:Texas AG tells clerks they can flout Supreme Court ruling on gay marriage, Criner said she \"shall resist unlawful federal or state court encroachments upon the prerogative of the People of Texas to protect Natural Marriage, and shall only issue marriage licenses consistent with Texas law, so help me God.\", The declaration follows an opinion offered by Texas Attorney General Ken Paxton days after the ruling, in which he claimed Texas county clerks could opt not to issue same sex marriage licenses if it offended their religious sensibilities and if another person, such as a deputy, was present to provide the service. Although most clerks ignored the opinion, at least two heeded Paxtons words and faced swift lawsuits. RELATED:Gay couple granted Texas marriage license after lawsuit, Elsewhere in the nation, a handful of other county clerks have resigned or refused to offer same sex licenses in protest, including in Indiana and Tennessee, and have faced lawsuits. But in rural Irion County, seated in 800-person town of Mertzon, no resident has requested a license for a same sex marriage, according to the Florida-based Liberty Counsel, which is offering free legal representation to Criner and other county clerks who decline to license same-sex marriages. Criners office directed all queries to the Liberty Counsel. \"The Liberty Counsel is committed to defending clerks who stand for natural marriage,\" said Counsel attorney Richard Mast. \"We have given (Criner) assurances of representation.\", He said the also represents Rowan County Clerk Kim Davis in Kentucky, who faces litigation after denying marriage licenses to four couples. A hearing will be held Monday. For a summary of the legal defense, Mast pointed to Criners declaration, which he said the counsel helped compose. He said ruling on marriage was beyond the jurisdiction of the Supreme Court. \"Not all orders claiming authority under color of law are lawful,\" said Criners declaration. \"Unlawful orders, no matter their source -- whether from a military commander, a federal judge, or the United States Supreme Court -- are and remain unlawful, and should be resisted.\", The declaration also compared the courts marriage ruling to past court rulings that upheld slavery, affirmed states rights to sterilize some mentally ill people and supported the internment of Japanese Americans during World War II.]", "Date": "20150707", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/houston-texas/article/West-Texas-county-clerk-refuses-to-issue-same-sex-6371264.php", "Title": "[West Texas county clerk refuses to issue same sex marriage licenses]"}