{"Content": "[ WASHINGTON  It was supposed to be a quick show of strength by conservative groups opposed to the nuclear agreement between Iran and the United States. Instead, it turned into a debate between the self-identified avatar of \"courageous conservatives\" and the omnipresent antiwar activists of Code Pink  and it lasted as long as the average sitcom episode. The result, captured on video by the team at Breitbart News, is among the most popular conservative entertainment of the past week. The drama began Thursday afternoon, when Concerned Women for America brought Sen. Ted Cruz, R-Texas, and Christians United for Israel campaigner Gary Bauer to the gates of the White House. Code Pinks presence was a given. Led by Medea Benjamin, who in the past few years has interrupted everyone from President Barack Obama to Henry Kissinger, the group relentlessly works its way into congressional hearings and political events. If there is a picture of a political figure with angry protesters holding signs behind him, odds are Code Pink did it. (The pinkness is a play on the long-defunct, much mocked Department of Homeland Security color code for potential risks.), Cruz issued his familiar arguments against the Iran deal. Code Pink activists, easily able to swarm an outdoor event like this, kept heckling. After a few minutes, Cruz dared the loudest heckler to stand and debate him. \"It is very interesting to see those who profess to believe in free speech be afraid of speech,\" said Cruz. \"Hold on a second  Sir, come forward. You want to be a part of the discussion?\", The main heckler stood down, and Code Pink dispatched Benjamin to debate Cruz. He talked about the deal, specifically. She talked about the benefits of diplomacy, generally. \"Over $100 billion will flow to Iran that they will use to fund jihadists\" that will murder people, said Cruz. \"The only way were going to stop Iran from getting a nuclear weapon is through negotiation,\" said Benjamin, who insisted that Irans real nuclear ambitions were still mysterious, or over-hyped. \"I think in debates, truth matters,\" said Cruz. \"One entity with whom there is no ambiguity, in terms of whether Iran wants nuclear weapons, is Ayatollah Khameini. . . . I recognize that the Code Pink folks like to hold up signs saying, Peace with Iran. Do you know who doesnt reciprocate those views? Iran.\", Code Pink protesters did not stutter or falter. But they were pitted against one of the best debaters at the high levels of American politics. This encounter did not make the rounds on the left; it went viral on the right. A recap of the debate became the top trending story at the Washington Examiner. Washington Free Beacon reporter Adam Kredo, who stood next to Cruz during the debate, reported that the senator \"tussled with and shut down a group of left wing activists.\" On the first-generation conservative blog Powerline, it was reported that Cruz had \"crushed\" Code Pink. Few senators would have bothered. Earlier this year, when a Code Pink heckler interrupted a meeting of the Senate Armed Services Committee, Sen. John McCain, R-Ariz. told the \"low-life scum\" to exit. Security made it so. But Cruz saw a chance to work a punching bag, in full view of the conservative base that he courts. He took that chance. A debate with actual Republican rivals for the presidency will follow in less than three weeks.]", "Date": "20150725", "Author": "[By David Weigel, Washington Post]", "Link": "http://www.chron.com/politics/election/national/article/Code-Pink-gives-Cruz-some-early-debate-practice-6405736.php", "Title": "[Code Pink gives Cruz some early debate practice]"}