{"Content": "[ Caption, Close, , Flowers and ribbons line a makeshift memorial outside Emanuel AME Church in Charleston, S.C. Racism not gone, , Regarding \"Area churches mourn Charleston victims\" (Page A1, Friday), I think perhaps we were a more honest people in 1963. That was the year when a church bombing in Birmingham, Ala. killed four little girls, and nobody idly speculated about whether this was some assault on Christianity. We all knew that this was racial terrorism. The shooting at Emanuel AME Church was racial terrorism, too. This 21-year-old racist drove past many other Christian churches, traveling 100 miles to come to this particular church. We want racism to be thing of the past, but it isnt. And, given the age of the assailant, it may be a part of our nations future. P.A. Moye, Sugar Land , , People kill, It is a tragedy for anyone to use guns to destroy life. We give our condolences to those who have lost friends and loved ones. But I pray the media will use wisdom concerning the use of this tragedy to condemn \"guns.\" To take away guns would only promote the use of guns by the crazy, deranged and criminal elements. Our Founders understood the consequences of an unprotected citizenry. Fear begets fear. Mobs beget mobs. To allow the unscrupulous to use fear to rouse the mobs will only produce more violence. Roy W. Hutchinson, Booker, , Too many guns, Numerous mass shootings in the U.S. since President Obama has taken office. Why? Easy access to guns. I checked many developed countries, such as Canada and those in Europe, and their total has not come anything close to this number of shootings or deaths by citizen-owned guns. And, our governor just signed a \"right to carry\" bill! Time to wake up, America!, Fred Olenick, Richmond, , Solidarity, Martin Luther King Jr. said that the most segregated hour of the week is on Sunday morning. In solidarity with our African-American neighbors, may I suggest that if you are a white church-goer, that you attend services today at a predominately black church. Expressing sympathy is laudable but more than words are needed now. After the tragedy at the Emanuel AME Church, we must show by our actions that we are truly one nation under God. Judy Adams, Houston]", "Date": "20150620", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/letters/article/Sunday-letters-Charleston-6338649.php", "Title": "[Sunday letters: Charleston]"}