{"Content": "[ AUSTIN - Well, this could make for an awkward conversation at Thanksgiving dinner. Former Republican presidential candidate Ron Paul on Saturday dismissed as a \"joke\" the demand by U.S. senators of his party that they must approve a potential agreement over the Middle East countrys nuclear capabilities. \"I strongly disagree with the motivation of that statement made by so many members of Congress, especially in the Senate,\" Paul said at a conference on liberty at the University of Texas at Austin, presumably referring to an open letter senators sent to Iranian officials describing any deal not approved by them as informal. Paul, a longtime Lake Jackson congressman who left office in 2013, said Congress should have a role in reviewing agreements, but he questioned whether the senators really cared about the constitutional questions or just wanted to undermine the deal. \"Theyre out to stop peace,\" he said. \"Theyre terrified that peace might break out.\", Pauls son, Sen. Rand Paul of Kentucky, who announced his own presidential bid earlier this week, signed the letter and cosponsored a bill to require the Obama administration to seek congressional review. The senator said during an interview at the South by Southwest festival here last month that he did so because he believes in the separation of powers. The younger Paul for months has been moderating some public positions on foreign policy in the hopes of making himself a more palatable option for mainstream conservatives who will play a big role in determining the GOP nominee. Much has been made of the relationship between the Pauls ahead of the election, with the conventional wisdom being the candidate needs to maintain his dads base while also reaching out to more mainstream voters. Eric Dondero, a former Ron Paul aide, told the Houston Chronicle earlier this week that the Pauls have always disagreed somewhat about foreign policy, with the son being slightly more willing to consider intervening in foreign countries. Dondero added that the topic frequently comes up during Thanksgiving dinner. \"The rumor is that they sit there throwing turkey legs at each other, and it wouldnt surprise me,\" he said. \"That is absolutely how it is at the Paul dinner table. The two of them will seriously go at it about policy issues.\", Saturdays conference, which was sponsored by the Future of Freedom Foundation and the Young Americans for Liberty, also featured journalists Glenn Greenwald and Radley Balko. Ron Pauls office said he would not speak to reporters after the event. Rand Pauls campaign declined to comment. Brian M. Rosenthal is a reporter in the Austin bureau of the Houston Chronicle. He can be reached at brian.rosenthal@chron.com or on Twitter @brianmrosenthal.]", "Date": "20150411", "Author": "[By Brian M. Rosenthal]", "Link": "http://www.chron.com/news/politics/us/article/Ron-Paul-Senate-s-Iran-letter-a-joke-6193986.php", "Title": "[Ron Paul criticizes Iran position taken by his son, Rand Paul]"}