{"Content": "[ Caption, Close, Donald Trump supporters wait in line outside Ladd-Peebles Stadium hours before the start of a rally expected to draw 40,000 people in Mobile, Ala. Friday, Aug. 21, 2015. (Sharon Steinmann/AL.com via AP), Donald Trump supporters wait in line outside Ladd-Peebles Stadium hours before the start of a rally expected to draw 40,000 people in Mobile, Ala. Friday, Aug. 21, 2015. (Sharon Steinmann/AL.com via AP), Laci Lamb, 6, of Lucedale, Miss. wears a beauty pageant dress her mother made for her that says \"Trump\" before Republican presidential candidate businessman Donald Trump speaks at a campaign pep rally, Friday, Aug. 21, 2015, in Mobile, Ala. Johnny Pace, of Leroy, Ala. sits on the sidewalk waiting for the Republican presidential candidate businessman Donald Trump to speak during a campaign pep rally, Friday, Aug. 21, 2015, in Mobile, Ala. FILE - In this Aug. 19, 2015 file photo, Republican presidential candidate businessman Donald Trump speak in Derry, N.H. Trump on Friday declared the silent majority is back!, an echo of former President Richard Nixons appeal to overlooked Americans, as his GOP rivals struggled for traction in a race dominated by the billionaire businessman. MOBILE, Ala. (AP)  Republican front-runner Donald Trump on Friday joked, \"Now I know how the great Billy Graham felt\" as he addressed the largest crowd yet of his thriving presidential campaign. \"I would like to have the election tomorrow,\" Trump crowed. \"I dont want to wait.\", Trump evoked Graham  the evangelist who packed stadiums around the world  as he brought his message to the Deep South. The 40,000-seat Ladd-Peebles Stadium was about half-full when he began his speech. Trump was welcomed by an array of Alabama politicians, including Republican Sen. Jeff Sessions, who praised him for the attention hes drawn to immigration issues. And Trump led off his speech with more criticism of immigrants living in the country illegally, drawing loud cheers when he repeated his promise to build a wall on the U.S.-Mexico border. He reiterated his intention to end \"birthright citizenship\" for children of immigrants here illegally. Trump also attacked the Obama administrations deal with Iran to restrict that countrys nuclear program, calling it \"so sad.\", And he again promised to \"repeal and replace Obamacare\"  the health care law thats President Barack Obamas defining domestic achievement. The South will be strategically important because a group of states in the region, including Alabama, hold their primaries on March 1, 2016, right after the early voting states. Before Trump arrived, his fans  some carrying signs, others wearing T-shirts supporting the billionaire businessman  spoke of his outsider status in a crowded field dominated by former and current elected officials as the song \"Sweet Home Alabama\" blared from loudspeakers. \"Donald Trump is telling the truth and people dont always like that,\" said Donald Kidd, a 73-year-old retired pipe welder from Mobile. \"He is like George Wallace, he told the truth. It is the same thing.\", Wallace, a fierce opponent of civil rights, served as governor of Alabama and sought the presidency multiple times. Kidd said Trump is a \"breath of fresh air,\" and praised him as a businessman with common sense. Savannah Zimmerman, a 27-year-old registered nurse from Mobile, agreed. \"I think he appeals to us Southerners because he tells it like it is and he has strong opinions. That is the way we are here in the South,\" she said. Mary Anne Bousenitz, 59, a retired psychiatrist from Tuscaloosa, said she isnt offended by the insults Trump has directed at women, like \"dog\" and \"bimbo.\", \"Im not married to the man and its not like Im going to have to sit across a turkey at the table with him,\" she said. Interest in the candidate forced organizers to move a planned rally from the Mobile Civic Center, which holds about 2,000 people, to Ladd-Peebles Stadium, a 40,000-seat football stadium. Before the rally, Trump tweeted: \"We are going to have a wild time in Alabama tonight! Finally, the silent majority is back!\", During the height of the Vietnam War, Richard Nixon sought the backing of the \"silent majority,\" widely considered to be Americans who stood behind the Republican president and werent getting the attention that protesters attracted. Trump has derided elected officials and cast his candidacy as an outsiders bid. Republican rival Jeb Bushs campaign e-mailed thousands of supporters in Alabama on Friday night, denouncing Trump as a Republican presidential candidate. The campaign statement said Trump favors partial-birth abortions, supports restrictions on gun rights and backs laws that infringe on states land rights. \"Trumps positions are deeply out of step with the Alabama way of life,\" the campaign said in the email. \"We know Alabama cherishes life, especially the life of the unborn.\", Right to Rise USA, the super PAC supporting Bush, tweeted photos of a plane, with a banner ad bashing Trump and promoting Bush, flying over the stadium before Trumps rally.]", "Date": "20150825", "Author": "[Melissa Nelson, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Heading-to-the-South-Trump-says-silent-majority-6457922.php", "Title": "[In Alabama, Trump says he knows how Billy Graham felt]"}