{"Content": "[ Caption, Close, Mexico head coach Miguel Herrera yells during the first half of the CONCACAF Gold Cup championship soccer match against Jamaica, Sunday, July 26, 2015, in Philadelphia. Mexico fans hold an image of head coach Miguel Herrera as they cheer before the first half of the CONCACAF Gold Cup championship soccer match between Mexico and Jamaica, Sunday, July 26, 2015, in Philadelphia. Mexico head coach Miguel Herrera yells during the first half of the CONCACAF Gold Cup championship soccer match against Jamaica, Sunday, July 26, 2015, in Philadelphia. MEXICO CITY (AP)  Mexican national team coach Miguel Herrera was fired Tuesday following a television reporters claim that the man known as \"El Piojo\" punched him. The ouster came just two days after Herrera led Mexico to victory in the CONCACAF Gold Cup. But Decio de Maria, who on Saturday becomes president of the Mexican Soccer Federation, said the incident with the journalist was not in keeping with \"the spirit of fair and respectful competition\" the organization espouses. \"Our values, our principles, are above any result,\" de Maria said at a news conference. \"In our profession, our industry, the matches are never over, and as public figures who represent an institution we must be absolutely clear on that.\", In a statement, Herrera apologized to his players, his staff, fans, the federation and the media for his conduct in \"the painful incident I had with a commentator.\", \"It is clear to me that this is not the attitude that a coach for the Mexican national team should take, despite having received all manner of criticisms, offenses and mockery of my family and my person,\" it said. He said he planned to spend time with family and rest. Herrera is the latest to depart from what has become a revolving-door job since Ricardo La Volpe of Argentina was the last to complete a four-year World Cup cycle as head of the team, known as \"El Tri.\" Mexico has burned through 10 head coaches in the nine years since La Volpe departed after the 2006 World Cup in Germany. De Maria did not announce a replacement for Herrera, who led Mexico to the round of 16 at last years World Cup. The incident involving the coach and Television Aztecas Christian Martinoli took place Monday at Philadelphias airport as the team prepared to return to Mexico following its 3-1 victory over Jamaica in the championship match. Martinoli accused Herrera of hitting him in the neck and then threatening him. \"Nobody can be above a situation like the one that happened Monday in Philadelphia,\" de Maria said. Martinoli has been a tough critic of Herrera as have many Mexican fans and pundits disappointed with the teams recent results. \"El Tri\" failed to advance from group play at the Copa America last month in Chile. Critics also faulted Mexicos performance at the Gold Cup, where it finished second in group play and advanced to the final only after winning two knockout-round matches with the help of late penalty kicks awarded in controversial calls. \"We all saw what happened on the pitch. ... We won at the Gold Cup, but none of us liked how it happened,\" de Maria said. Herrera defended his record. \"It saddens me greatly to leave the position of team coach due to this regrettable reason, since the sporting results were, for the most part, positive within the stated objectives,\" he said in his statement. Herrera, whose affectionate nickname is Spanish for \"The Louse,\" became interim head coach in November 2013 and was given the job full-time a month later. During his tenure Mexico won 18 matches, tied 11 and lost 7. He became well known for his exuberant sideline displays at last years World Cup, and was both criticized and admired for his impetuous style. Earlier this year he and two players came under investigation by the soccer federation for tweets supporting Mexicos Green Party just before midterm elections, an apparent violation of the federations code of ethics. Mexicos next match is a friendly vs. Trinidad and Tobago on Sept. 4. In October, it faces regional rival the United States in a qualifying playoff for the 2017 Confederations Cup. ", "Date": "20150728", "Author": "[Carlos Rodriguez, Associated Press]", "Link": "http://www.chron.com/news/article/Mexico-national-soccer-coach-fired-after-6410397.php", "Title": "[Mexico coach Herrera fired after claim he punched reporter]"}