{"Content": "[ Caption, Close, The presidential firsts that would come with a Donald Trump administration That hair, , Da Boss, Movie star, , , Getting tipsy on Trump, Cock of the Walk, , , QUOTES: Donald Trumps greatest hits, On immigration:\"When Mexico sends its people, theyre not sending their best. Theyre not sending you. Theyre not sending you.Theyre sending people that have lots of problems and theyre bringing those problems with us.\"Theyre bringing drugs, theyre bringing crime, theyre rapists and some, I assume, are good people,\" Trump said in his announcement speech. On protecting Americas borders:Trump pledged to commit his construction skills to keeping out the illegals. \"I would build a great wall,\" he said.\"And nobody builds walls better than me, believe me.\"And Ill build them (sic) very inexpensively.I will build a great, great wall on our southern border and Ill have Mexico pay for that wall.\", On Iraq:In a favorite 2011 speech to Republican women in Las Vegas, Trump dropped the \"f-bomb.\" Discussing Iraq, he said: \"We build a school. We build a road. They blow up the school. We build another school. We build another road.\"They blow them up, we build again.In the meantime, we cant get a f****** school in Brooklyn.\", On his enemies: Trump has used Twitter to launch feuds with the likes of Rosie ODonnell and Cher, and to call \"Meet the Press\" host Chuck Todd a \"moron.\" He enjoys getting under peoples skin, and said last year:\"I do love provoking people. There is truth to that. I love competition and sometimes competition is provoking people.I dont mind provoking people. Especially when theyre the right kind of people.\", On China: Trump has had a love-hate relationship with the Middle Kingdom.He once proposed a trading strategy with China in these terms:\"Listen, you m*****f******: We are going to tax you 25 percent.\"He was mellower recently, saying: \"Im not saying theyre stupid.I like China.I just sold an apartment for $15 million.Am I supposed to dislike em? ... People say you dont like China.No, I love them. But their leaders are much smarter than our leaders.\"Here Donald Trump poses with his wife  Melania Trump. On the conservative elite: Trump has refused to genuflect before big-name conservative columnists, particularly when they dont take his presidential ambitions seriously.He delivered a two-work review of a book of Charles Krauthammers columns -- \"Book sucks\" -- and said of Michelle Malkin: \"You were born stupid.\"When pundit George F. Will called Trump a \"bloviating ignoramus,\" The Donald tweeted Brett Baier of Fox News: \"Why do you have George Will on your show? Hes exhausted, boring and not even a little relevant. Waste of good air time.\", On his 2016 Republican rivals. Trump has doubts about their abilities, expressed Tuesday: \"The other candidates -- they went in, they didnt know the air conditioning didnt work. They sweated like dogs.\"They didnt know the room was too big because they didnt have anybody there. How are they going to beat ISIS? I dont think its gonna happen.\", On the Organization of Petroleum Exporting Countries (OPEC):Trump has long hated OPEC, saying in 2011: \"We have nobody in Washington that sits back and said, Youre not going to raise that f****** price.\"In 2012 he depicted OPEC leaders \"sitting around the table, setting the price of oil, and laughing at us because we have no leadership.\"He is pledging a new deal now that North Dakota oil has made America again the worlds greatest oil producer. On being rich:In his 1987 book \"The Art of the Deal,\" Trump began by saying: \"I dont do it for the money.Ive got enough, much more than Ill ever need.I do it to do it. Deals are my art form.\"He argued Tuesday that America needs his philosophy, saying: \"I dont need anybodys money. Its nice. Im using my own money. Im not using the lobbyists.Im not using donors. I dont care. Im really rich, Ill show you that in a second.\"And by the way, Im not even saying that in a braggadocios . . Thats the kind of thinking you need for this country.\", On the Iran nuclear talks: Not even a bicycle accident, and broken limb, can win Secretary of State John Kerry a moment of sympathy from Donald Trump.\"I will stop Iran from getting nuclear weapons,\" he said Tuesday, not saying how.\"And we wont be using a man like Secretary Kerry that has absolutely no concept of negotiation, whos making a horrible and laughable deal, whos just being tapped along as they make weapons right now and then goes into a bicycle race at 72 years old and falls and breaks his leg.\"I wont be doing that.And I promise, I will never be in a bicycle race -- that I can tell you.\", On terrorism:Trump sees a special understanding with Americas adversaries.\"Islamic terrorism is eating large portions of the Middle East,\" he said Tuesday. \"Theyve become rich. Im in competition with them.\", If Donald Trump is elected to the highest office in the land in the 2016 presidential election, well get a president who has accomplished a lifetimes worth of accolades before even stepping foot in the White House. The business tycoon has been endlessly quotable on his campaign trail and CNN covers his every move like hes a missing passenger jet. Barring a debilitating scandal or a sharp lack in interest, we need to get used to seeing Trumps face and hair all over the place from here until next November. See some of the Oval Office firsts that would come true if Donald Trump were elected president. ]", "Date": "20150820", "Author": "[By Craig Hlavaty]", "Link": "http://www.chron.com/news/politics/article/Plenty-of-firsts-would-come-with-a-Trump-6456241.php", "Title": "[Plenty of firsts would come with a Donald Trump presidency: Here are a few]"}