{"Content": "[ Caption, Close, Attorney Andy Taylor hugs F. N. Williams Sr. the lead plaintiff in the case, following a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Attorney Andy Taylor takes the podium to applause from supporters during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. ( Jon Shapley / Houston Chronicle ), Members of the media record Andy Taylor speaking about  the Texas Supreme Courts suspension of the HERO ordinance during a press conference Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Attorney Andy Taylor, left, is greeted by Bishop Dr. Delagraentiss and attorney Jared Woodfill before a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Andy Taylor speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Andy Taylor speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Andy Taylor speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Andy Taylor speaks during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. Attorney Andy Taylor takes the podium to applause from supporters during a press conference celebrating the Texas Supreme Courts suspension of the HERO ordinance Friday, July 24, 2015, in Houston. The decision will force city council to consider a repeal, or place the issue on the ballot in November. On the heels of a Texas Supreme Court ruling that the city must repeal its equal rights ordinance or place it on the November ballot, conservative opponents again sued Mayor Annise Parker on Monday, this time seeking unspecified legal fees and damages for allegedly impeding citizens right to vote, among other charges. The Houston Area Pastor Council is suing the mayor for legal fees and damages associated with a lawsuit filed last summer. At issue in the equal rights ordinance case was not the law itself, but whether opponents submitted a repeal referendum petition last summer with the needed 17,269 valid signatures. The city said the petition was riddled with forgery and errors, and rejected it on those grounds. Opponents, largely conservative activists, said the city sought and falsely found problems with the petition. A district judge eventually ruled that the plaintiffs were 565 signatures shy of clearing the threshold. But last month, the Texas Supreme Court reversed that ruling and ordered the city to either repeal the ordinance or send it to voters. If the equal rights ordinance lands on the November ballot, it could drive turnout in what is usually a low turnout election. Attorney Andy Taylor would not specify an amount at a press conference Monday morning, but said the legal work associated with case was close to $500,000. The suit has been filed in Harris County district court. The citys equal right ordinance bans discrimination based not just on sexual orientation and gender identity but also, as federal laws do, sex, race, color, ethnicity, national origin, age, religion, disability, pregnancy and genetic information, as well as family, marital or military status. \"She trampled the voting rights of over a million people in the fourth largest city in the United States of America,\" Taylor said. \"And so were here today to say uh uh, theres going to be accountability for doing that. We are not going to sit idly by and let you do that.\", The second party in the lawsuit is seeking likely much smaller damages for an incident last fall when, as part of a broader discovery phase, the city issued subpoenas to five local pastors that included a demand for their sermons. Parker quickly called the subpoenas overly broad and eventually withdrew them amid national backlash, particularly from Christian conservatives and Republican politicians, who blasted the city for trying to silence the church. Taylor said the move infringed on the five pastors religious liberty. Three of them, Hernan Castano, Magda Hermida and Khanh Huynh, are listed as plaintiffs in the suit. A request for comment from Parker was not immediately returned Monday morning.]", "Date": "20150803", "Author": "[By Katherine Driessen]", "Link": "http://www.chron.com/news/politics/houston/article/HERO-opponents-sue-mayor-over-court-costs-sermon-6421825.php", "Title": "[HERO opponents sue mayor over court costs, sermon subpoenas]"}