{"Content": "[ AUSTIN -- Texas Senate budget writer Jane Nelson on Thursday responded to critics of her role in an escalating dispute between the Legislature and the state agency that oversees horse racing, calling a demand for her to be investigated for abusing her power \"horse hockey.\", \"Its horse hockey, pure and simple, and it is making things worse  not better  for the Texas Racing Commission,\" Nelson said ina lengthy statement posted on her websiteabout the horse racing industry targeting her. Industry official Jan Haynes responded to Nelsons response by ratcheting up her rhetoric even more, saying the senators statement was practically a confession to the allegations. The dispute centers around the racing commissions approval last summer of \"historical racing,\" which allows players to bet on previously-run races that have been stripped of identifications. The new game is seen by the tracks as a necessary innovation to help them keep up with states where more betting is allowed, but it has drawn opposition from critics who say the game terminals resemble slot machines and would expand gambling here. Nelson and other Senate Republicans have said the commission did not have the power to approve the new game and moved during this years legislative session to reign in the agency by putting part of its budget under control of the Legislative Budget Board. With only a couple weeks before the start of the next fiscal year, the Legislative Budget Board still has not released the funding -- a movebelieved to be aimed at forcing the commission to repeal its approval of \"historical racing.\", If the commission does not receive the money, it says it would have to close, which by extension would shutter the multi-million horse racing industry. Haynes on Monday filed a complaint with the state Department of Public Safety, requesting a formal investigation into whether Nelson was \"bullying\" the racing commission. Industry officials say the case is similar to the veto threat that got former Gov. Rick Perry indicted last year. In her statement, Nelson said it was nothing of the sort. \"Unfortunately, there is a misguided effort under way to paint anyone opposed to slot machines as against the horse industry,\" said Nelson, adding, \"Throughout my time in the Legislature, I have been an ardent supporter of the horse racing industry.\", Nelson argued that the racing commission exceeded its authority by approving \"historical racing\" and lawmakers were within their rights to respond. \"Lets be clear: the Legislature can decide what funding level every agency should receive, how those funds should be spent and what conditions should be placed on them,\" Nelson said. \"Moreover, the Legislature can decide whether an agency should continue to exist at all.\", Haynes said Nelson did not address the reality that the Legislature did not decide anything about \"historical racing,\" and that the senator was abusing her power on the Legislative Budget Board to get the outcome she wants -- repeal of the game. \"Senator Nelsons response to my public corruption complaint is disingenuous at best,\" Haynes said. \"Senator Nelson makes no denial and practically confesses that she is tying a decision on Texas Racing Commission funding to whether or not they repeal the Historical Racing Rules.  Because there is not a shred of evidence that the Legislature intended this result, her statement validates what I said in my complaint.\", She added that Nelson has been a \"huge disappointment\" to the horse industry. \"The only thing she gives us is lip service and when we have reached out for help, she has consistently refused and instead tried to harm the horse industry,\" Haynes said.]", "Date": "20150813", "Author": "[By Brian M. Rosenthal]", "Link": "http://www.chron.com/news/politics/texas/article/Nelson-responds-to-critics-of-her-role-in-Racing-6443320.php", "Title": "['Horse hockey': Senator blasts back in racing commission dispute]"}