{"Content": "[ TALLAHASSEE, Fla. (AP)  Floridas Republican-controlled Legislature shut down its work Friday on a new congressional map, as infighting and finger-pointing led to the meltdown of yet another legislative session. The failure of legislators to reach an accord on how to redraw the states 27 congressional districts means that the task will now likely fall to the Florida Supreme Court. This is the same court that many GOP legislators had lambasted for the stinging ruling that prompted the rare summer special session. \"Youre here to fight for what you believe in and I dont think the people anticipate that youre just going to come here and, as its been said, rubber stamp what another persons doing whether theyre in your party or not,\" said House Speaker Steve Crisafulli. Gov. Rick Scott could call legislators back to work, but a spokeswoman said that he would not intervene in the spat, which led some legislators to call Tallahassee \"dysfunctional\" despite having one-party rule for nearly two decades. This marks the second time this year that a legislative session fell apart due to sharp disagreements between the House and Senate. Legislators were forced to have a budget special session in June after the regular session ended abruptly due to a fight over health care spending and Medicaid expansion. The Supreme Court in July ordered legislators to change the boundaries of eight districts, ruling that previous map-drawing efforts violated voter-approved standards that ban drawing up districts to benefit incumbents or a political party. The Legislature was sued by a coalition of groups including the League of Women Voters and Common Cause. The court gave legislators 100 days to draw up new maps in order to have them in place by the 2016 elections. Legislative staff and lawyers used the courts instructions  which included shifting the seat of U.S. Rep. Corrine Brown to an east-west configuration  to draw up a map that would have altered the states political landscape. It was a map that if adopted could lead to the possible ouster of several incumbents in Congress, including U.S. Reps. Dan Webster and Gwen Graham. But the Senate pushed to tweak the geography of congressional districts in the Tampa Bay and central Florida region. The biggest change involved the district of U.S. Rep. Dennis Ross, a Lakeland Republican and would have shifted most of it into Hillsborough County. The change was instigated by Sen. Tom Lee who said his goal was to give additional clout to his home county. House leaders, however, refused to go along with that proposal and suggested the court would question whether the move was done for some parochial interest. Lee has said he had no interest currently in running for Congress. When House and Senate Republicans held a Friday morning meeting to make a last-ditch effort to work out their differences it ended acrimoniously with the sight of Sen. Bill Galvano leading a contingent of senators out the door while Rep. Jose Oliva was still talking about the proposals. Galvano, a Bradenton Republican, contended House criticisms of the Senate plan had \"no merit\" legally. He and other senators also argued legislators had a right to have a final say in the map and not relegate everything to attorneys and legislative staff. \"We really believe very strongly that the legislative branch should be the ones that are drawing these maps,\" said Senate President Andy Gardiner. Democrats in the minority wasted little time in criticizing Republicans for their failure to pass a new congressional map. They said that the stalemate among legislators shows that the job of drawing new districts should be given over to an independent commission. \"When egos continue to prevail over the oath each of us took to uphold the constitution, its time to question the master were serving, said Senate Democratic Leader Arthenia Joyner. \"Given the outcome weve seen over this reapportionment process, the answer, sadly, has not always been the people.\", ", "Date": "20150821", "Author": "[Gary Fineout and Brendan Farrington, Associated Press]", "Link": "http://www.chron.com/news/article/Divided-Florida-Legislature-ends-session-with-no-6457849.php", "Title": "[Divided Florida Legislature ends session with no new map]"}