{"Content": "[ She burned the tapes. Had Richard Nixon burned his tapes, he would have survived Watergate. Sure, there would have been a major firestorm, but no smoking gun. Hillary Rodham was a young staffer on the House Judiciary Committee investigating Nixon. She saw. She learned. Today you dont burn tapes. You delete emails. Hillary Clinton deleted 30,000, dismissing their destruction with the brilliantly casual: \"I didnt see any reason to keep them.\" After all, they were private and personal, she assured everyone. How do we know that? She says so. Were, say, Clinton Foundation contributions considered personal? No one asked. Its unlikely well ever know. We have to trust her. Will remain private, Thats not easy. Not just because of her history - William Safire wrote in 1996 that \"Americans of all political persuasions are coming to the sad realization that our first lady ... is a congenital liar\" - but because of what she said in her emergency news conference on Tuesday. Among the things she listed as private were \"personal communications from my husband and me.\" Except that, as The Wall Street Journal reported the very same day, Bill Clintons spokesman said the former president has sent exactly two emails in his life, one to John Glenn, the other to U.S. troops in the Adriatic. Mrs. Clintons other major declaration was that the server containing the emails - owned, controlled and housed by her - \"will remain private.\" Meaning: No one will get near them. This she learned not from Watergate but from Whitewater. Her husband acquiesced to the appointment of a Whitewater special prosecutor. Hillary objected strenuously. Her fear was that once someone is empowered to search, the searcher can roam freely. In the Clintons case, it led to impeachment because when the Lewinsky scandal broke, the special prosecutor added that to his portfolio. Answers are farcial, Hillary was determined never to permit another open-ended investigation. Which is why she decided even before being confirmed as secretary of state that only she would control her email. Her pretense for keeping just a single private email account was \"convenience.\" She doesnt like to carry around two devices. But two weeks ago she said she now carries two phones and a total of four devices. Moreover, it takes about a minute to create two accounts on one device. Former Transportation Secretary Ray LaHood did exactly that. Her answers are farcical. Everyone knows she kept the email private for purposes of concealment and, above all, control. For other State Department employees, their emails belong to the government. The records officers decide to return to you whats personal. For Hillary Clinton, she decides. The point of regulations is to ensure government transparency. The point of owning the server is to ensure opacity. Because she holds the emails, all document requests by Congress, by subpoena, by Freedom of Information Act inquiries have ultimately to go through her lawyers, who will stonewall until the end of time - or Election Day 2016, whichever comes first. Its a smart political calculation. Taking a few weeks of heat now - its only March 2015 - is far less risky than being blown up by some future email discovery. Moreover, around April 1, the Clinton apologists will begin dismissing the whole story as \"old news.\", Damage is done, But even if nothing further is found, the damage is done. After all, what is Hillary running on? Her experience and record, say her supporters. What record? Shes had three major jobs. Secretary of state: Can you name a single achievement in four years? U.S. senator: Can you name a single achievement in eight years? First lady: her one achievement in eight years? Hillarycare, a shipwreck. In reality, Hillary Clinton is running on two things: gender and name. Gender is not to be underestimated. It will make her the Democratic nominee. The name is equally valuable. It evokes the warm memory of the golden 1990s, a decade of peace and prosperity during our holiday from history. Now breaking through, however, is a stark reminder of the underside of that Clinton decade: the chicanery, the sleaze, the dodging, the parsing, the wordplay. Its a dual legacy that Hillary Clinton cannot escape and that will be a permanent drag on her candidacy. You can feel it. Its a recurrence of an old ailment. It was bound to set in, but not this soon. What youre feeling now is Early Onset Clinton Fatigue. The CDC is recommending elaborate precautions. Forget it. The only known cure is Elizabeth Warren. , Charles Krauthammers email address is letters@charleskrauthammer.com.]", "Date": "20150312", "Author": "[By Charles Krauthammer]", "Link": "http://www.chron.com/opinion/outlook/article/Krauthammer-In-email-debacle-Clinton-learned-6130951.php", "Title": "[Krauthammer: In email debacle, Clinton learned from Nixon's mistakes]"}