{"Content": "[ Let the sparring begin. Houstons mayoral candidates duked it out at Tuesday nights unusually lively mayoral forum, in which candidates had the opportunity to both debate a series of broad-ranging topics and quiz each other. The events different format highlighted the races emerging political fault lines, most of which revolve around the citys looming budget deficit. Issues of the hour included if and when to lift the citys revenue cap, whether to close the fiscal gap by issuing new debt, and what to do about thecontroversial streets and drainage initiative known as ReBuild Houston. At nights end, City Councilman Stephen Costello was the self-declared \"piata,\" having fielded a host of questions about ReBuild Houston, which was his brainchild, and received four of the seven questions that candidates posed to each other. Costello and former Kemah Mayor Bill King, both of whom bill themselves as moderate fiscal conservatives, are thought to be in a battle for Houstons right-leaning voters  a well-represented demographic at the forum, which was hosted by the United Republicans of Harris County. The first question of the forum addressed whether to amend the citys revenue cap in light of Houstons looming $126 million deficit. Of the seven candidates in attendance, only former City Councilman Chris Bell and state Rep. Sylvester Turner proposed changes, with Bell calling for the cap to be repealed and Turner suggesting the city make exceptions for either public safety or to pay down city debt. The next question, on ReBuild, set up each of the candidates to criticize the execution of ReBuild Houston, if not pan it entirely. That left Costello alone singing the programs praises. Other questions posed by the moderator, KHOUs Doug Miller, touched on the Houston Police Departments best chiefs in the last 36 years and use of devices called Stingrays to collect cell phone data, as well as the citys pensions and permitting processes. Garcia fumbled his answer to Millers query about HPDs best chiefs when he named Fred Bankston, who was deputy chief. Miller also offered candidates an opportunity to list the top three items on their to-do lists, should they replace term-limited Mayor Annise Parker. Turner named infrastructure, financial management and transportation, while Bell decided to go a more specific route, listing as his top priorities zero-based budgeting, getting new trucks to fill potholes and implementing a new system to collect data on city services. Costello, Hall and Kings responses were similar to Turners, with all three naming slight variations of public safety, infrastructure and financial management or pension reform. King also used the opportunity to take another jab at ReBuild Houston. Businessman Marty McVey said he would create an office of economic development office, which the city already has, though McVey clarified that his would be \"actually a real economic development office.\" He also listed tackling the budget and reorganizing the structure of city departments. Garcia named just two specific items  financial reform and public safety before generalizing that his priorities would be to \"lead, manage and reform.\", Sparks didnt really begin to fly until the second half of the event, when each candidate had the chance to ask one other candidate a question. 2013 mayoral runner-up Ben Hall and businessman Marty McVey asked Costello about ReBuild, while King pressed him on fiscal discipline and former Harris County Sheriff Adrian Garcia lobbed him a softball on improving the citys permitting process. Halls attack on Costello was particularly pointed, and he accused Costello of obscuring how ReBuild Houstons funds would be used. Costello reiterated that he thinks ReBuild is \"a good program,\" citing a series of accomplishments and discussing the sources of revenue that flow to the citys streets and drainage renewal fund. Hall did not back down, responding, \"its wrong to mislead voters.\", (At nights end, Miller dubbed Costello \"Stephen Rocky Balboa Costello.\"), Meanwhile, Costello went head-to-head with King on how King would fund the pensions of legacy members through his proposed defined-contribution model. When Turners chance at bat came around, he tried to inject some humor into the increasingly tense room, asking, \"Can we all get along?\", \"Steve, I love you, I really do. I do love you,\" Turner continued to much laughter, before turning to question Kings proposal to fund infrastructure projects through bond elections. \"I have no problem with borrowing money for building long-term assets,\" King responded. \"Bond elections is the way we built infrastructure for 180 years. There was no reason to change what we were doing.\", Turner then criticized King for his support of issuing new bonds. \"I agree with you that ReBuild Houston certainly can be better run,\" Turner said to King. \"You are going to, in a sense, bankrupt the city and put it on future generations to pay for increased debt. That is not a conservative philosophy.\", Garcia was the only other mayoral hopeful to receive a candidate question. Bell inquired about when Garcia initially found out that a mentally ill inmate was being held in squalid conditions in the Harris County Jail, under his watch. Garcia did not directly answer whether his former chief deputy had indeed told him about the case a year before it became public last fall, saying instead, \"when I found out about this issue, I took action.\"]", "Date": "20150715", "Author": "[By Rebecca Elliott]", "Link": "http://www.chron.com/politics/election/local/article/Mayoral-candidates-spar-in-Republican-forum-6385193.php", "Title": "[Mayoral candidates spar in Republican hosted forum]"}