{"Content": "[ Supporters of Houstons nondiscrimination ordinance launched a formal campaign Wednesday urging voters to defend the measure this November. ACLU of Texas Executive Director Terri Burke urged Houstonians to \"send a message that this is a city that doesnt discriminate.\" BusinessmanBobby Singh, invoking the threat of losing sporting events and conventions if the law is repealed, added, \"Lets send a strong message to people across the country and across the world that Houston is open for business.\", The Hero Equal Rights Ordinance, or HERO, bans discrimination based not just on sexual orientation and gender identity -- the flash points for opponents -- but also, as federal laws do, sex, race, color, ethnicity, national origin, age, religion, disability, pregnancy and genetic information, as well as family, marital or military status. The ordinance applies to businesses that serve the public, private employers, housing, city employment and city contracting. Religious institutions are exempt. Violators could be fined up to $5,000. Opponents of the measure submitted a petition seeking to place the law on the ballot for repeal last summer following City Councils 11-6 approval of the ordinance. City Secretary Anna Russell initially counted enough valid signatures to qualify the petition for the ballot, but Mayor Annise Parker and former City Attorney David Feldman threw out many of those because they appeared on pages of the petition they said had not been properly collected or notarized. Foes sued, leading to a state district judges ruling earlier this year that the petition did not have enough valid signatures. The Texas Supreme Court overrode that in a separate decision last month, ordering the council to repeal the ordinance or place it on the November ballot; the group voted 12-5 to put the law before the public. Foes have seized on the protections the ordinance extends to transgender residents, specifically the perceived threat of transgender women -- people who were born male but identify as female -- using womens restrooms and locker rooms. They allege \"transvestite men\" may enter womens facilities and commit sexual assaults. Opponents also accuse Mayor Annise Parker, the first openly gay mayor of a major American city, ofseeking to \"criminalize faith\" byforcing \"individuals, families, churches, schools and businesses to accept, affirm and celebrate the LGBT agenda.\", Supporters on Wednesday indicated they will address both sets of allegations head-on. Sonia Corrales, chief program officer at the Houston Area Womens Center, said the majority of women and more than 90 percent of children are assaulted by someone known to them, and that similar nondiscrimination laws have been passed in 17 states and 200 cities without accompanying public safety concerns. \"It is a disservice to the public to continue to perpetuate myths about how and why sexual assault happens,\" she said. \"Nothing in HERO changes the fact that it is illegal to enter a restroom to harm or harass people or invade their privacy.\", Leslie Jackson, a minister at Cathedral of Hope, also decried the \"voices of division\" who \"confuse religious freedom with the freedom to discriminate.\", \"Religious faith does not undermine the value of equality for all under the law,\" he said. \"Religious faith demands it.\", Opponents of the ordinance are hosting their own event Thursday evening, part of the \"Faith, Family and Freedom Tour Across Texas\"that will feature among its speakers former Congressman Tom DeLay, former county GOP chairman Jared Woodfill, Texas Eagle Forums Cathie Adams, and local conservatives Terry Lowry and Dr. Steve Hotze. \"This is going to be a major battle for the heart and soul of our city,\" a flyer for the event reads. \"Mayor Parker and her liberal allies believe they can take over Houston, then take over Texas.\"]", "Date": "20150812", "Author": "[By Mike Morris]", "Link": "http://www.chron.com/politics/election/local/article/HERO-supporters-launch-Houston-Unites-campaign-6441090.php", "Title": "[HERO supporters launch 'Houston Unites' campaign]"}