{"Content": "[ Caption, Close, A new study from the University of Houston and Rice University found that Texas controversial voter ID law discourages voter turnout. The first general election under that law was in 2014. Austin County voter turnout, According to numbers from the Office of the Texas Secretary of State, Fort Bend Countyvoter turnout, Brazoria Countyvoter turnout, Waller Countyvoter turnout, Montgomery Countyvoter turnout, Liberty Countyvoter turnout, Jefferson Countyvoter turnout, Chambers Countyvoter turnout, Galveston Countyvoter turnout, Harris Countyvoter turnout, A new study claims that Texas controversial voter ID law discouraged election turnout in November 2014, and not just in citizens who lacked proper documents. Researchers at the University of Houston and Rice Universitys Baker Institute for Public Policy released their findings Thursday to mark the 50th anniversary of the federal Voting Rights Act. It was one day after a federal appeals panel called Texas election day ID requirements discriminatory. RELATED: Appeals court tosses Texas voter ID law, That 2013 state legislation required voters to present one of seven photo IDs at polling sites in order to cast a ballot. \"The most prominent effect of the law seemed to be to discourage voters who actually had one of the forms of photo ID, but due to misinformation or miscommunication believed they did not and did not go to vote,\" said Mark Jones, a fellow in political science at the Baker Institute and an author of the study. The study, based on 400 telephone interviews in March, looked exclusively at West Texas congressional district 23 because it was the states only district that could plausibly have voted either Republican or Democrat.  It is also a majority-Latino district, and researchers wanted to investigate common criticism that the Texas law disproportionately affects minorities. RELATED:How latest federal court ruling affects Texas voter ID law, In that district, 5.8 percent of nonvoters said the main reason they didnt cast ballots was that they didnt have any of the required photo IDs, and 12.8 percent said it was one of several reasons. However research revealed that only 2.7 percent of non-voters actually didnt possess a required ID. Jones said the numbers showed that many voters were misinformed. However he cautioned that voter ID requirements were a \"modest factor\" in making Texas 2014 turnout the lowest in the nation for an election that saw the lowest nationwide participation since 1942. The most cited reason for not voting (38.5 percent)was \"too busy\" with school or work. After that was \"felt vote wouldnt make a difference\" (34.1 percent) and \"didnt like the candidates\" (26.9 percent). Lack of ID came in seventh. But Jones said it was a unique cause because \"it is an explicit state intervention in the process; the others are more personal reasons.\", The new study is the first to examine at the effects of the law which drew widespread national criticism. Though it took effect in 2013, that years constitutional referendum draw such a small turnout that it couldnt be considered representative. Last year saw the first general election under the new legislation. RELATED:Houstons 2015 mayoral election: Voter turnout and its impact, Now Jones said the next step will be to study in depth what actually caused the voters confusion, and to repeat the study in a wider geographical area to determine if a perceived lack of adequate IDs affected turnout elsewhere. \"Do we have the same number of misinformed registered voters throughout the state?\" Jones said. \"That will take more research.\"]", "Date": "20150807", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/texas/article/Controversial-Texas-voter-ID-law-kept-registered-v-6431414.php", "Title": "[Controversial Texas voter ID law kept registered voters with proper ID from voting, study shows]"}