{"Content": "[ Caption, Close, FILE - In this Aug. 23, 2015 file photo, former President Jimmy Carter opens up a Bible while teaching Sunday School class at Maranatha Baptist Church in his hometown in Plains, Ga.  Carters recent diagnosis that cancer has spread to his brain will require him to scale back his work, but Carter Center officials say their programs will continue uninterrupted. FILE - In this Aug. 22, 2015 file photo, former President Jimmy Carter leaves a reception in his hometown of Plains, Ga. Carters recent diagnosis that cancer has spread to his brain will require him to scale back his work, but Carter Center officials say their programs will continue uninterrupted. FILE - In this Aug. 23, 2015 file photo, former President Jimmy Carter, sits to pose for photos after teaching Sunday School class at Maranatha Baptist Church in his hometown in Plains, Ga.  Carters recent diagnosis that cancer has spread to his brain will require him to scale back his work, but Carter Center officials say their programs will continue uninterrupted. FILE - In this Aug. 23, 2015 file photo, former President Jimmy Carter teaches Sunday School class at Maranatha Baptist Church in his hometown  in Plains, Ga.   Carters recent diagnosis that cancer has spread to his brain will require him to scale back his work, but Carter Center officials say their programs will continue uninterrupted. ATLANTA (AP)  To Azaratu Zakaria, Jimmy Carters battle against the Guinea worm is represented by a scar. Zakaria was the last person to be declared disease-free in Ghana after more than 20 years of work spearheaded the former presidents humanitarian organization, The Carter Center.  Zakaria, who is in her 40s, said she and her family have prayed every day since Carter announced this month that cancer has spread to his brain and forced him to scale back his work. \"There is no one in my household who does not have the Guinea worm scar and for this reason, every time we think of the work he came to do to free us all from the disease,\" Zakaria said through a translator.  \"He has done a lot of good work and for that, we shall always remember him.\", From its founding, Carter insisted that the humanitarian organization focus on work that others had not or would not tackle, including the Guinea-worm eradication project, which cut the number of cases of the disease from 3.5 million in 1986 to 126 in 2014. A former president often eager to travel and see the problem first-hand lent immediate credibility. The center is now known worldwide for its work on a number of tropical diseases and as a credible backstop to dictators through election monitoring. In Nepal, for instance, Carter monitored an election after pro-democracy protests forced King Gyanendra to give up his authoritarian rule in 2006. The Carter Centers staff also opened regional offices and assisted for years with efforts to write a constitution, despite one failed effort and several postponed elections. \"He was the American leader who always held Nepal close to his heart,\" government minister Narayan Prakash Saud said. \"Both Nepali people and the government will always remember the contributions he made for Nepal. He was the bridge to connect people from Nepal with United States.\", When the opposition Maoist party leaders saw they would lose the 2013 election, Carter quietly convinced them to accept it. He took a different tactic during the centers first election monitoring trip, to Panama in 1989. Carter discovered that the falsified results would give General Manuel Noriegas candidate the victory. He climbed on a stage and shouted in Spanish: \"Are you honest officials or thieves?\" according to his 2007 book \"Beyond the White House.\", Experts in the field say Carters work put the integrity of elections under a microscope and established election monitoring as a serious and professional industry. \"President Carters contributions to peace and democracy in the world have been incalculable,\" said Eric Bjornlund, president of Democracy International, an organization that promotes democracy globally. Carters health has been watched closely since May, when he returned early from his 39th election monitoring trip and the centers 100th. During a follow-up exam, doctors discovered a mass on his liver that was removed in August and determined to be melanoma. In the meantime, the 90-year-old Carter kept working. In mid-June, he announced receipt of $10 million donation to fight another disease that few are targeting. River blindness disease can lead to loss of sight, along with a rash or skin discoloration, when biting black flies transmit larvae. Carter offered a glimpse of how intimately he is involved in these projects, easily reciting statistics to reporters and expressing frustration over medication getting stuck in African or Latin American ports. \"Ive had to go through sometimes three different presidents and get them to call their customs officials to let the medicine go through,\" Carter said, prompting smiles from staffers in the room. Officials at The Carter Center say they will move forward smoothly thanks to years of preparation. The centers cash budget is more than $100 million, with 180 staffers and hundreds of experts, Carter wrote in his latest book. The Carter Centers endowment stands at $600 million, and last March trustees voted his grandson, Jason Carter, to become board chairman in November. \"I have no intention of trying to fill his shoes,\" said Jason Carter, a former Georgia state senator. \"This is his legacy that he has built and I have no intention of trying to be Jimmy Carter to this foundation.\", ", "Date": "20150831", "Author": "[Kathleen Foody and Francis Kokutse, Associated Press]", "Link": "http://www.chron.com/news/us/article/Health-election-work-elevated-Jimmy-Carter-6473390.php", "Title": "[Health, election work elevated Jimmy Carter post-presidency]"}