{"Content": "[ Caption, Close, Republican presidential candidate Donald Trump, left, speaks as Jeb Bush listens during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate Ohio Gov. John Kasich, center, says hello to the daughters of Sen. Ted Cruz, R-Texas, right, Catherine, 4, second from right, and Caroline, 7, left, during a commercial break as they participate in the first Republican presidential debate at the Quicken Loans Arena, Thursday, Aug. 6, 2015,  in Cleveland. Republican presidential candidate Sen. Marco Rubio, R-Fla. speaks during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate former Florida Gov. Jeb Bush during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate Ohio Gov. John Kasich speaks during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate Wisconsin Gov. Scott Walker speaks as Donald Trump listens during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate Ben Carson speaks during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidate New Jersey Gov. Chris Christie during the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. Republican presidential candidates from left, Chris Christie, Marco Rubio, Ben Carson, Scott Walker, Donald Trump, Jeb Bush, Mike Huckabee, Ted Cruz, Rand Paul, and John Kasich take the stage for the first Republican presidential debate at the Quicken Loans Arena Thursday, Aug. 6, 2015, in Cleveland. ,  Donald Trump - 23.2percent,  Jeb Bush - 12.8 percent, Scott Walker -10.6 percent, Mike Huckabee -6.6 percent, Ben Carson -6.6 percent, Ted Cruz -6.2 percent, Marco Rubio- 5.2 percent, Rand Paul- 4.8 percent,  Chris Christie - 3.4 percent, John Kasich- 2.8 percent, , Rick Santorum- 1.4 percent,  Bobby Jindal-1.2 percent, Carly Fiorina- 1.0 percent, Lindsey Graham- 0.4 percent, George Pataki- N/A, CLEVELAND (AP)  The Latest on the first Republican debate of the 2016 campaign for president:, ", "Date": "20150806", "Author": "[The Associated Press]", "Link": "http://www.chron.com/business/energy/article/The-Latest-Walker-opens-state-fair-before-6429025.php", "Title": "[The Latest: Trump ends with 'We can't do anything right']"}