{"Content": "[ Caption, Close, The highly controversial executive order issued by President Obama caused a backlash from many in the GOP. See how the order, which has been blocked by a judge, would impact the nation if its eventually enforced. 1. Parents, 2. Children, 3. Prioritizing deportations, 4. Law enforcement, 5. Border security, 6. Salaries, 7. Business programs, 8. Green cards, , , Governor Rick Perry, Governor Rick Perry, Governor-elect Greg Abbott, Governor-elect Greg Abbott, , Senator John Cornyn, , Rep. Lamar Smith, R-San Antonio, , State Senator Sylvia Garca, D-District 6, State Rep. Jessica Farrar, D-District 148, On the heels of President Barack Obamas major immigration reform announcement Thursday, Houston Mayor Annise Parker said she will join other cities across the country in coordinating local services for the expected wave of illegal immigrants seeking legal status. In Houston alone, the mayors office estimated Obamas policy, allowing millions of immigrants who are in the U.S. illegally to get work permits, will affect some 300,000 to 400,000 adults and children. The goal will be to put residents in touch with non-profits and other local agencies because the city is limited in providing direct assistance to immigrants without legal status. Parker will go to New York next month to meet with mayors of other major cities, devising a national plan for providing local resources. In a press release Friday, Parker applauded the executive action. \"The new order has the potential to remove fears of deportation and separation faced by many immigrant families,\" Parker said. \"This is in line with Houston as a city that values inclusiveness, encourages civic participation and aims to provide access to city services and resources to all of its residents.\", Among the cities that have agreed to take part in \"Cities United for Immigration Action\" are the mayors of New York, San Francisco, Atlanta and Salt Lake City, according to the mayors office. That list is expected to grow.]", "Date": "20141121", "Author": "[By Katherine Driessen]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Parker-to-lead-local-response-to-Obama-s-5909329.php", "Title": "[Parker to lead local response to Obama's immigration reform]"}