{"Content": "[ Caption, Close, , Ken Paxton, the ten-candidate for Texas attorney general, is shown in 2014. A Collin County grand jury wants to look into the attorney generals admitted violations of state securities law. Ken Paxton, the ten-candidate for Texas attorney general, is shown... Texas politicians who have faced indictment, Billy Clayton, Speaker of the House, U.S. Rep. Tom DeLay, R-Texas, State Rep. Lane Denton, R-Waco, State Rep. Betty Denton, R-Waco, , Gov. Edmund J. Davis, Gov. James Ferguson, State Rep. Kino Flores, D-Palmview, Speaker of the House Gib Lewis, U.S. Sen. Kay Bailey Hutchinson, Attorney general James \"Jim\" Mattox, Speaker of the House Bascom Giles, Gov. John Connally, House Speaker Gus Mutscher, State Rep. Tommy Shannon, Attorney General Dan Morales, State Rep. Terri Hodge, D-Dallas, , Attorney General Ken Paxton, , AUSTIN  A Collin County grand jury has asked the Travis County District Attorneys office for its investigative file on Ken Paxton, indicating the panel wants to look into the attorney generals admitted violations of state securities law. \"Collin County appears to be the venue where this evidence needs to be heard,\" says the letter from the grand jury vice foreman. \"Therefore, we are requesting the documents be sent to us as soon as possible.\", The letter, obtained by the Houston Chronicle on Wednesday, comes a week after the Collin County District Attorneys office indicated it had not and would not take up the case unless it receives a criminal complaint from a law enforcement agency. Texans for Public Justice, the public watchdog group that filed the criminal complaint against Paxton in Travis County, since has asked Collin County District Attorney Greg Willis to recuse himself and appoint a special prosecutor to look into the case. Willis and Paxton have been friends for more than 30 years and have been involved in multiple business ventures together. In April of last year, Paxton was fined $1,000 and was reprimanded by the Texas State Securities Board after he admitted to repeatedly violating the law by soliciting clients for his friend Frederick \"Fritz\" Mowerys investment firm without being properly registered with the state. Pointing out that the violations were third-degree felonies, Texans for Public Justice filed a criminal complaint with the Travis County District Attorneys office. Travis County District Attorney Rosemary Lehmberg said her office was not the proper venue, however, and sent the cases to Dallas and Collin counties. Dallas County District Attorney Susan Hawk said she did not believe her office had venue over any alleged crimes, leaving Willis the sole remaining prosecutor to consider Paxtons case. ]", "Date": "20150408", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Collin-County-grand-jury-wants-to-investigate-6187693.php", "Title": "[Collin County grand jury wants to take up Paxton case]"}