{"Content": "[ The majority of Republicans in the 2016 race for the White House, formal candidates and likely contenders, are opposed to legalizing same-sex marriage. However, nearly all say they would attend a gay wedding. Among the trio of major declared Republican presidential candidates, Sen. Marco Rubio (R-Florida)is the only one yet to provide a clear response to the gotcha question of the month. Sen. Ted Cruz (R-Texas) has avoided addressing the issue altogether.Cruzs office didnt respond to a request from Business Insider to clarify his stance.Sen. Rand Paul (R-Kentucky) also hasnt weighed in yet and his campaign didnt respond to a request for comment from Business Insider. Among the likely GOP contenders who responded to the question, all but one said they would attend a gay wedding. This willingness came in spite of the fact they are all opposed to legalizing gay marriage, with the exception ofNew York Gov. George Pataki (R). Wisconsin Gov. Scott Walker (R),former Texas Gov. Rick Perry (R),former Florida Gov. Jeb Bush (R),Louisiana Gov. Bobby Jindal (R), Pataki, andCarly Fiorina would all be will to go to a ceremony or reception to celebrate a gay marriage. Former Sen. Rick Santorum (R-Pennsylvania) said he would not attend. New Jersey Gov. Chris Christie (R) and former Arkansas Gov. Mike Huckabee (R) havenot publicly weighed in on the issue. Their officesdid not respond to requests for comment. A spokesman for retired neurosurgeon Dr. Ben Carson told Business Insider they did not have a comment on the issue. The reaction from presidential contenders mirrors public sentiment, according to a Wednesday Reuters/Ipsos poll that showed more than half of Republicans in the U.S. would attend a same-sex wedding of a loved one. Of Republican respondents,56% said they would attend the gay wedding of a loved one if invited. Overall, 68% of Americans responded that they would attend such a wedding. 19% said they would not and 13% were unsure. The poll was released one day afterthe Supreme Court heard oral arguments challenging state laws to prohibit same-sex unions. Heres how 2016 Republican contenders answered: \"Would you attend a gay wedding?\", Wisconsin Gov. Scott Walker (R): Would attend the reception, Walker told reporters in New Hampshire on April 18: \"Thatscertainly a personal issue. For a family member, Tonette and I and our family have already had a family member whos had a reception. I havent been at a wedding. Thats true even though my position on marriage is still that its defined between a man and a woman, and I support the constitution of the state. But for someone I love, weve been at a reception,\" according to the Milwaukee-Wisconsin Journal Sentinel. A spokesperson forWalkers Our American Revival PAC told Business Insider that Walker was out of town when the same-sex couple decided to go to the courthouse for their ceremony. \"Later, he went to their reception because he loves them even though he believes marriage is still between a man and a woman,\" the spokesperson said. , Carly Fiorina:Yes, but not in a church, \"I have attended a reception in a same-sex couples home and celebrated with them. I would not be comfortable doing that in a church, for example. But I certainly would be willing to attend a civil ceremony or reception if I were invited to do so. And I have many gay friends and Im glad theyre happy.\", Former Florida Gov. Jeb Bush (R):I would go, \"No I havent, thats not to say I wouldnt if people that I cared for were going to be married, of course I would go if they asked me to go,\" he told a crowd inPuerto Rico on April 28. Sen. Marco Rubio (R-Florida):Of course, \"If its somebody in my life that I care for, of course I would,\" Rubio toldFusions Jorge Ramos on April 15. \"Im not going to hurt them simply because I disagree with a choice theyve made or because I disagree with a decision theyve made, or whatever it may be. Ultimately, if someone that you care for and is part of your family has decided to move in one direction or another or feels that way because of who they love, you respect that because you love them.\", Sen. Ted Cruz (R-Texas):Non answer, \"I havent faced that circumstance. I have not had a loved one go to a, have a gay wedding,\" he told radio hostHugh Hewitt in an interview on April 16. Louisiana Gov. Bobby Jindal (R):Absolutely, \"Sure, if its somebody I loved and cared for, absolutely. Now, the reality is I dont like attending a lot of weddings,\" hetold reporters on April 27. Former Texas Gov. Rick Perry (R):Probably would, Perry told Hewitt in a radio interview on April 21,\"Yeah, well, I probably would,\" when asked if he would attend a same-sex marriage ceremony. Perry did voice his complaint to the line of questioning, telling Hewitt, \"I think the real issue here is you know, thats the gotcha question that the left tries to get out there so everyone will talk about.\", Former New York Gov. George Pataki (R):Pleased to, \"Id be pleased to attend a same sex wedding. Ive been invited, but I havent had the chance. But when Im invited again, if theyre friends and I have the opportunity, of course I will go,\" he toldHewitt in a radio interview on April 23. Former Sen. Rick Santorum (R-Pennsylvania): No, \"No, I would not. No, I mean, because I dont, Ive just self, as a person of my faith, that would be something that would be a violation of my faith. I would love them and support them, but I would not participate in that ceremony,\" he told Hewitt in an interview on April 16. Join the conversation about this story , NOW WATCH: Barney Frank has a grim outlook for the 2016 elections, See Also:]", "Date": "20150430", "Author": "[Leslie Larson, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/Here-s-which-Republican-presidential-candidates-6232956.php", "Title": "[Here's which Republican presidential candidates would attend your gay wedding]"}