{"Content": "[ Caption, Close, Eric Medearis and his family meet presidential candidate Sen. Ted Cruz during a book signing Wednesday at a Houston Sams Club. ( Mayra Beltran / Houston Chronicle ), [Up] Too many Americans think that July 4 is a holiday devoted to activities that require Coppertone, bottle rockets and mustard on hot dogs. To remind Texans of why the colonists revolted against British rule, Houston attorney Robb Fickman has organized readings of the Declaration of Independence on the courthouse steps in 134 of Texas counties. , [Up] Fighting on behalf of the Constitution this week was Harris County Attorney Vince Ryan. He issued an opinion saying that judges, JPs and county clerks cannot discriminate against same-sex couples seeking to marry. , [Down] Another Houstonian, Texas Sen. Ted Cruz, was defiant in an interview with NPR Radio. \"This week, in response to both of these decisions,\" he said of the Obamacare and gay marriage opinions, \"I have called for another constitutional amendment - this one that would make members of the Supreme Court subject to periodic judicial retention elections.\", , [Down] HPD still isnt coming clean about how it uses its top-secret StingRay technology to spy on Houstonians. Maybe it should track \"moonlighting\" cops. A KHOU-TV investigation showed that one patrolman was guarding the private St. Johns School when his time card said he was at work. , [Down] For decades, Houstonians have enjoyed lounging in the ornate lobby of the Rice Hotel on Texas Avenue. No more. The new owner told the Chronicle it is closing that space to the public. , [Up] Carlos Correa is Houstons newest favorite sports hero, quickly elevating himself onto the mantle with James Harden and J.J. Watt. But save some room for Carli Lloyd. The Houston Dash midfielder won her third player of the match in six games Tuesday, leading the U.S. into Sundays final versus Japan, , [Down] Memo to the New York Times food writers: We favor world peas. But not in guacamole. Thats a little bit like putting mayo on one of your Reuben sandwiches. , [Twiddled] Well end where we began: with the 4th. We respect your right to buy firecrackers. But please dont blow off your thumbs. ]", "Date": "20150703", "Author": "NULL", "Link": "http://www.chron.com/opinion/editorials/article/Ups-and-downsUps-and-downs-6365172.php", "Title": "[Editorial: Ups and downs]"}