{"Content": "[ LINCOLN, Neb. (AP)  A host of new laws took effect Sunday in Nebraska, leading to changes ranging from costlier marriage licenses to expanded opportunities for nonviolent prisoners to be released for parole and probation. The 181 laws took effect three months after the end of this years legislative session, the normal grace period for measure approved by lawmakers. Following a vote  and veto override  by legislators, Sunday also would have marked the end of capital punishment in Nebraska, but death penalty supporters announced last week they had gathered enough signatures to place a measure blocking the death penalty repeal on the ballot and stop the change from taking effect before the November 2016 election. Here are some of the new laws now in effect:, MARRIAGE LICENSE FEES, Getting married in Nebraska will now cost an extra $10. The new law increases marriage license fees from $15 to $25, while certified copies will rise from $5 to $9. Nebraska counties lobbied for the increase, arguing the previous fee did not cover the costs of filing licenses and verifying the information. The original proposal would have raised the fee to $50, but conservative lawmakers balked at the idea. The law is LB88. The law will generate an estimated $28,000 a year for Lancaster County, covering expenses that otherwise would have been paid through property tax revenue, said County Clerk Dan Nolte. Nolte said processing roughly 2,000 licenses each year and ensuring theyre accurate takes more effort than people realize. \"Its an important legal document, and we want to make sure things are the way they need to be,\" Nolte said. UNDERAGE DRINKERS, Underage drinkers who seek medical help for themselves or a friend because of alcohol poisoning will receive legal immunity from alcohol charges in some situations. The law is designed to encourage underage drinkers to seek medical attention when someones life is at risk without having to fear a criminal conviction. The law is LB439. \"We need to accept the reality that drinking occurs in a college environment, and we need to educate on how to be safe, responsible and look out for one another,\" said Thien Chau, the University of Nebraska-Lincolns student body president. NURSE PRACTITIONERS, Nurse practitioners now have more independence under a law removing a requirement that they get a written agreement to consult with a doctor before they can practice. The so-called integrated practice agreements are designed to ensure a physician is available for collaboration or referral, but nurse practitioners say theyre extensively trained and could help ease the states health care shortage. The Nebraska Medical Association opposed the law, citing patient safety concerns. The law is LB107. NATIVE AMERICAN CHILDREN, Native American children who are at risk of being removed from their homes will have new protections that make it harder to separate them from their families and break cultural ties. The new law makes clear exactly when a social worker can remove a child, and requires that custodial preference be given to a foster home or adoptive parents who can preserve a childs relationship with his or her tribe. The law is LB566. PRISON CROWDING AND SENTENCING, Nebraskas prison population could start to decline under a new law that increases the use of probation for nonviolent offenders, increases parole opportunities and requires supervised release for felony offenders before they complete their sentences. Another law going into effect Sunday will increase the Legislatures oversight of the state prison system by creating a new inspector general positon. The laws are LB605 and LB598. DIRECT DEMOCRACY, Organizers of Nebraska petition drives can once again pay circulators by the signature rather than by the hour, making it easier to place issues on the ballot. The law overturns a 2008 ban on signature-based pay. Critics of the ban say many grassroots groups dont have the resources to pay circulators hourly. The law is LB367. TRIAL EVIDENCE, Wrongly convicted Nebraska prisoners will have more chances to demonstrate their innocence. The law will give prisoners up to five years, instead of the current three, to seek a new trial based on newly discovered, non-DNA evidence. It also would allow judges to order DNA testing on evidence that wasnt previously examined, or where new technology could lead to more accurate or probative results. The law is LB245. BRAND INSPECTION FEES, The cost of brand inspections for cattle could rise to as much as $1.10 per head. The Nebraska Brand Committee now has the authority to charge a higher maximum fee to cover its expenses. The Brand Committee hasnt decided whether to increase the fees, but the new law will give its members more flexibility, said Executive Director Shawn Harvey. Harvey said the committee is working with outdated computers and needs to offer higher salaries to attract more inspectors. \"In the last three or four years, its been difficult to get qualified applicants to apply for our openings,\" Harvey said. The fee ceiling was last increased in 2005, from 65 cents to 75 cents per head. Inspections are mandatory in the western two-thirds of Nebraska anytime a bovine animal changes ownership. The law is LB85.]", "Date": "20150830", "Author": "[Grant Schulte, Associated Press]", "Link": "http://www.chron.com/news/article/Higher-marriage-fees-prison-reforms-among-new-6474293.php", "Title": "[Higher marriage fees, prison reforms among new Nebraska laws]"}