{"Content": "[ Advocating the adoption of the new Constitution drafted in Philadelphia, the authors of \"The Federalist Papers\" mocked the \"imbecility\" of the weak central government created a dozen years earlier by the Articles of Confederation. But today, nearly 225 years later, critics across the spectrum call the American political system dysfunctional, even pathological. What they dont mention, though, is the role of the Constitution itself in generating the pathology. Ignore, for discussions sake, the clauses that helped to entrench chattel slavery until it was eliminated by a brutal Civil War. Begin with the Senate and its assignment of equal voting power to California and Wyoming; Vermont and Texas; New York and North Dakota. Consider that, although a majority of Americans since World War II have registered opposition to the Electoral College, we will participate this year in yet another election that battleground states will dominate while the three largest states will be largely ignored. Our vaunted system of separation of powers and checks and balances - a legacy of the founders mistrust of factions - means that we rarely have anything that can truly be described as a government. Save for those rare instances when one party has hefty control over four branches - the House of Representatives, the Senate, the White House and the Supreme Court - gridlock threatens. Elections are increasingly meaningless, at least in terms of producing results commensurate with the challenges facing the country. But if one must choose the worst single part of the Constitution, it is surely Article V, which has made our Constitution among the most difficult to amend of any in the world. The last truly significant constitutional change was the 22nd Amendment, added in 1951, to limit presidents to two terms. The near impossibility of amending the national Constitution not only prevents needed reforms; it also makes discussion seem futile and generates a complacent denial that there is anything to be concerned about. It was not always so. In the election of 1912, two presidents - past and future - seriously questioned the adequacy of the Constitution. Theodore Roosevelt would have allowed Congress to override Supreme Court decisions invalidating federal laws, while Woodrow Wilson basically supported a parliamentary system and, as president, tried to act more as a prime minister than as an agent of Congress. The next few years saw the enactment of amendments establishing the legitimacy of the federal income tax, direct election of senators, Prohibition and womens right to vote. No such debate is likely to take place between Barack Obama and Mitt Romney. They, like most contemporary Americans, have seemingly lost their capacity for thinking seriously about the extent to which the Constitution serves us well. Instead, the Constitution is enveloped in near religious veneration. What might radical reform mean?, We might look to the 50 state constitutions, most of which are considerably easier to amend. There have been more than 230 state constitutional conventions; each state has had an average of almost three constitutions. (New York, for example, is on its fifth Constitution, adopted in 1938.) This year Ohioans will be voting on whether to call a new constitutional convention; its Constitution, like 13 others, including New Yorks, gives voters the chance to do so at regular intervals, typically 20 years. Another reform would aim to fix congressional gridlock. We could permit each newly elected president to appoint 50 members of the House and 10 members of the Senate, all to serve four-year terms until the next presidential election. Presidents would be judged on actual programs, instead of hollow rhetoric. If enhanced presidential power seems too scary, then the solution might lie in reducing, if not eliminating, the presidents power to veto legislation and to return to true bicameralism, instead of the tricameralism we effectively operate under. We might allow deadlocks between the two branches of Congress to be broken by, say, a supermajority of the House or of Congress voting as a whole. One might also be inspired by the states to allow at least some aspects of direct democracy. California - the only state with a constitution more dysfunctional than that of the United States - allows constitutional amendment at the ballot box. Maine, more sensibly, allows its citizenry to override legislation they deem objectionable. Might we not be far better off to have a national referendum on health care reform instead of letting nine politically unaccountable judges decide?, Even if we want to preserve judicial review of national legislation, something Justice Oliver Wendell Holmes Jr. believed could be dispensed with, perhaps we should emulate North Dakota or Nebraska, which require supermajorities of their court to invalidate state legislation. Why shouldnt the votes of, say, seven of the nine Supreme Court justices be required to overturn national legislation?, Or consider the fact that almost all states have rejected the model of judges nominated by the president and then confirmed by the Senate. Most state judges are electorally accountable in some way, and almost all must retire at a given age. Many states have adopted commissions to limit the politicization of the appointment process. What was truly admirable about the framers was their willingness to critique, indeed junk, the Articles of Confederation. One need not believe that the Constitution of 1787 should be discarded in quite the same way to accept that we are long overdue for a serious discussion about its own role in creating the depressed (and depressing) state of American politics. , Levinson, a professor of law and government at the University of Texas, is the author of \"Framed: Americas 51 Constitutions and the Crisis of Governance.\" The article is republished with permission from The New York Times.]", "Date": "20120601", "Author": "[By Sanford Levinson]", "Link": "http://www.chron.com/opinion/outlook/article/Blame-the-Constitution-for-our-dysfunctional-3602902.php", "Title": "[Blame the Constitution for our dysfunctional government]"}