{"Content": "[ Caption, Close, In this photo taken Aug. 18, 2015, Democratic presidential candidate Hillary Rodham Clinton speaks in North Las Vegas, Nev. Nearly six months out from the first votes of a presidential campaign, candidates should be fleshing out who they are and what they stand for. Instead, some of the best-known 2016 candidates are toting around heavy baggage thats proving to be a big distraction from the conversations theyd rather be having with the American people. FILE - In this Aug. 19, 2015 file photo, Republican presidential candidate, former Florida Gov. Jeb Bush, speaks in Londonderry, N.H. Nearly six months out from the first votes of a presidential campaign, candidates should be fleshing out who they are and what they stand for. Instead, some of the best-known 2016 candidates are toting around heavy baggage thats proving to be a big distraction from the conversations theyd rather be having with the American people. FILE - In this Aug. 19, 2015 file photo, Republican presidential candidate Donald Trump speaks in Derry, N.H. Nearly six months out from the first votes of a presidential campaign, candidates should be fleshing out who they are and what they stand for. Instead, some of the best-known 2016 candidates are toting around heavy baggage thats proving to be a big distraction from the conversations theyd rather be having with the American people. WASHINGTON (AP)  It wasnt supposed to be this way. Nearly six months out from the first votes of a presidential campaign, candidates should be fleshing out who they are and what they stand for. Instead, some of the best-known 2016 candidates are toting heavy baggage thats proving to be a big distraction from the conversations theyd rather be having with the American people. Like it or not, Hillary Rodham Clintons still forced to talk about her email. And Jeb Bush is still trying to distinguish himself from his famous brother and father. Donald Trump, meanwhile, is stoking flames over immigration policy that are fueling his campaign for now, but also risk consuming it. And other Republican candidates are finding their own messages knocked off-kilter as theyre forced to respond to Trumps ideas. The current distractions for Clinton and Bush are inevitable to some extent, but also partly their own making. For two such well-known candidates, the getting-to-know-you phase of the campaign requires a healthy dose of new ideas, says GOP pollster David Winston. Absent something new, \"the story line tends to drift to the negative,\" says Winston, and that trend is particularly pronounced in a time of general voter dissatisfaction with political discourse and the direction of the country. Neither candidate was able to keep from drifting off course, he says. Once news emerged early on that Clinton had used a private email account and server as secretary of state, the not-yet-announced candidate knew shed have to deal with the consequences. But her campaign miscalculated the staying power of the issue and the various investigations it would spawn. Clintons low-key campaign launch, in which she did more listening than talking, didnt do anything to quell the swirling controversy. And her subsequent attempts to change the subject to topics like her economic and education proposals came too late to contain the damage. Now, the clearly frustrated candidate is trying everything from humor to fact-checks to put the issue to rest. Shes blaming government bureaucrats, GOP enemies and fixated reporters for what her campaign insists is an overblown emphasis on the matter. A somewhat cocky Clinton joked during a speech earlier this month about getting a Snapchat account, saying, \"I love it. Those messages disappear all by themselves.\", Four days later, pressed on the email issue by reporters in Las Vegas, Clinton threw up her arms and declared, \"Nobody talks to me about it other than you guys.\", Dan Schnur, director of the University of Southern Californias political institute, says Clinton seemed to be relying, at least initially, on an old playbook. \"The lesson that the Clintons learned in the 1990s is that its not necessary to immediately make all information available, and if you wait long enough, the tables eventually turn,\" Schnur said. \"So even if there are a lot of smart people sitting at her campaign table telling her otherwise, human nature is going to influence her to try to duplicate a past success.\", Bush, for his part, knew from the beginning that hed need to distinguish himself from his father and brothers presidencies. He had an \"I-am-my-own-man\" answer practiced and ready to go. Yet he still managed to fumble questions about whether hed have invaded Iraq as his brother did. And his turns of phrase about \"evil-doers\" and the burdens of presidential decision-making clearly echo those of his brother George W. Bush, undercutting his efforts to distinguish himself. In both Clinton and Bushs cases, says Schnur, no matter how hard campaigns try to anticipate challenges and be ready for them, \"It always sounds better at campaign headquarters than it does out on the trail.\", \"Its not that hard to sit in a conference room and strategize about how to handle a potential problem,\" Schnur said. \"The problem is the other candidates and the media and the voters dont always react to that strategy the way you want them to.\", While Clinton and Bush keep trying out new tactics to stow their unwanted baggage, Trump shows no inclination to move past the political flashpoint of immigration, even though some of his comments have been criticized by Republicans as well as Democrats. Trump seems happy to tap into a subset of voter disquiet, and to force GOP rivals to take a stand on proposals such as his call for a giant wall on the southern border and to deny automatic \"birthright citizenship\" to anyone born in the U.S. For now, thats helping him \"ride a wave having to do with his chutzpah,\" says University of Texas political scientist Bruce Buchanan. But ultimately, Buchanan says, it could be a big problem for his candidacy and Republicans overall. You can bet the party that vowed to make nice with Hispanics after the GOPs poor showing with Latino voters in 2012 didnt aim for its candidates to spend August talking about \"anchor babies.\", For all of the candidates, much of whats being talked about in August 2015 could well be largely forgotten by the time people cast votes next year. But this summertime chatter is sure to contribute to the overall impressions of candidates that voters are developing. \"Its shaping the context for how voters make their decisions,\" says Winston. \"You dont want the initial thought in everybodys mind to be, Wow, they have a lot of baggage.\", ", "Date": "20150824", "Author": "[Nancy Benac, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Top-candidates-struggle-with-distractions-from-6461332.php", "Title": "[Top candidates struggle with distractions from the past]"}