{"Content": "[ Caption, Close, Miss Alabama, Meg McGuffin attends the 2016 Miss America Competition at Boardwalk Hall Arena on September 13, 2015 in Atlantic City, New Jersey. Click through the photos to see the competitors thus far in the 2015 Miss America swimsuit competition. Miss Alabama Meg McGuffin, Miss Arizona Madi Esteves, Miss Arkansas Loren Alyssa McDaniel, Miss California Bree Morse, Miss Colorado Kelley Johnson, Miss Delaware Brooke Mitchell, Miss Florida Mary Katherine Fechtel, Miss Hawaii Jeanne Kapela, Miss Idaho Kalie Wright, Miss Indiana Morgan Jackson, Miss Illinois Crystal Davis, Miss Iowa Taylor Wiebers, Miss Kansas Hannah Wagner, Miss Kentucky Clark Janell, Miss Louisiana April Nelson, Miss Maine Kelsey Earley, Miss Maryland Destiny Clark, Miss Maryland Destiny Clark, Miss Massachusetts Meagan Fuller, Miss Michigan Emily Kieliszewski, Miss Minnesota Rachel Latuff, Miss Mississippi Hannah Roberts, Miss Missouri McKensie Garber, Miss Montana Danielle Wineman, Miss Nebraska Alyssa Howell, Miss New Jersey Lindsey Giannini, Miss New Mexico Marissa Livingston, Miss New York Jamie Lynn Macchia, Miss  North Carolina Kate Peacock, Miss North Dakota Delanie Wiedrich, Miss Nevada Katherine Kelley, Miss Ohio Sarah Hider, Miss Oklahoma Georgia Frazier, Miss Oregon Ali Wallace, Miss Pennsylvania Ashley Schmider, Miss Rhode Island Alexandra Curtis, Miss Puerto Rico Destiny Velez, Miss South Carolina Daja Dial, Miss Tennessee Hannah Robison, Miss Utah Krissia Beatty, Miss Utah Krissia Beatty, Miss Vermont Alayna Westcom, Miss Washington Lizzi Jackson, Miss West Virginia Chelsea Malone, Miss Wisconsin Rosalie Smith, Miss Wyoming Mikaela Shaw, Contestants compete in the swimsuit portion of the second night of preliminary competition in the 2016 Miss America pageant on Wednesday Sept. 9, 2015 in Atlantic City, N.J. Forget the dancing routine Miss Alabama Meg McGuffin did for the talent portion of Sundays Miss America pageant: this beauty queens true talent is keeping it real. During Sunday nights Miss American pageant, McGuffin made no bones about where she stands on GOP presidential front-runner Donald Trump. McGuffin was asked by pageant judge Taya Kyle, the wife of the late \"American Sniper\" Navy SEAL Chris Kyle, why she thought Trump led his GOP rivals by such a large margin in presidential polls. Her answer?, \"I think Donald Trump is an entertainer and I think he says whats on a lot of peoples minds, but I think the Republican party should be absolutely terrified of all the attention that he is taking from incredible candidates like Jeb Bush and Chris Christie who could absolutely do the job of President of the United States. If I were Republican I would be absolutely terrified of that,\" McGuffin said, before finishing with a polite, \"Thank you.\", McGuffin finished as the fourth runner-up to Miss America 2016, which was won by Miss Georgia Betty Cantrell. In the latest Quinnipiac poll, Trump continued to lead the Republican field among likely caucus voters in Iowa, the first state to cast a ballot for GOP nominee. Trump held the support of 27 percent of Iowans, followed by Ben Carson with 21 percent and Sen. Ted Cruz with 9 percent.]", "Date": "20150914", "Author": "[By John Boyd]", "Link": "http://www.chron.com/news/politics/election/article/Miss-Alabama-slams-Donald-Trump-as-entertainer-6503701.php", "Title": "[Miss Alabama slams Donald Trump as 'entertainer' stealing attention from GOP]"}