{"Content": "[ Its pretty basic: You have to be a citizen of this country to vote, right? Not necessarily. A movement is growing in New York City to grant the vote in local elections to legal immigrants. And the debate is growing loud enough to become a major issue in the citys next mayoral election. The right to vote in a presidential election is not on the wish list: New York proponents say immigrants just want a voice on local issues ranging from sewer improvements to public school construction for everyone who pays local taxes. A similar movement is percolating on the West Coast. Immigrant groups in San Francisco are researching how they could change state and local law to allow non-citizen parents to vote in local school board elections. There is nothing in the U.S. Constitution that bans non-citizen voting. Those decisions are made by the states, and some allow it. While Texas has large and diverse immigrant populations concentrated in cities like Houston and Dallas, immigrant activists say \"alien suffrage\" is an issue that doesnt draw much support in the southwestern states, perhaps because of the concerns about large numbers of illegal immigrants living in the region. A Texas legislator introduced a bill in 1995 to allow local communities to decide whether non-citizens could vote in their elections. It never made it out of committee. Until a backlash against immigrants began to swell at the beginning of the 20th century, more than 2 dozen states, including Texas, allowed non-citizens to vote. But in New York City, a change of state law would add approximately 1 million legal immigrants to the list of eligible voters, a potentially powerful voting bloc. Its not unprecedented. When many large urban school districts were decentralized in the late 1960s, parents who were not citizens were allowed to vote in school board elections in Chicago and New York. Immigrant parents in New York lost that voice two years ago when the city dismantled the school boards. A handful of suburban towns in Maryland allows non-citizens to vote in local elections, and the mayor of Washington, D.C. would like to open the vote to legal immigrants in his citys elections. Opponents say granting voting rights to non-citizens devalues the concept of citizenship. \"Theres nothing in the Constitution to prohibit extending the vote to anybody,\" said Dan Stein, executive director of the Federation for American Immigration Reform. \"But that doesnt mean its a good idea.\", FAIR advocates reducing legal immigration and stopping illegal immigration. Steins group has long complained that the so-called \"Motor Voter\" law, which makes applying for a voters registration card nearly automatic for anyone applying for a drivers license, has sent countless numbers of non-citizens to the polls anyway, with only an honor system about citizenship standing in the way. \"Its always interesting. The genesis of these proposals seems to be there are people on the city council who see a lot of people in their communities who would probably vote for them but arent citizens,\" Stein said. \"Thats a heck of a reason to dilute the concept of citizenship.\", A variety of immigrant groups and a few labor-related organizations are backing the idea in New York, but they are not united on the details. Some want voting rights for all legal immigrants; some want rights only for those who are pursuing citizenship. New Yorks Republican mayor, Michael Bloomberg, is against the measure, while City Council speaker Gifford Miller, a Democrat and potential mayoral candidate, indicated hes leaning toward supporting the idea. Margaret Fung, director of the Asian-American Legal Defense and Education Fund, said the issue will become important in the municipal elections. At a basic level, immigrant parents just want to get back the voice they had when they were allowed to vote in school board elections, she said. \"It was the one spot where Asian turnout was generally higher than the general population,\" Fung said. Jamin Raskin, professor of constitutional law at American University, led the \"Share the Vote\" campaign in Marylands Takoma Park in 1992, getting the right to vote in local elections for the small communitys immigrant population, mostly Salvadoran and Guatemalan refugees. New Yorks vast non-citizen population needs to get similar access to the polls, Raskin said, to get the voice it deserves. \"This is a way to make people who are politically invisible today visible tomorrow,\" Raskin said. \"Mayor Bloomberg, who has spoken of his openness to immigrants, has raised peoples expectations, and now many New Yorkers will follow through on his political rhetoric even if he does not.\", Granting the right to vote to Takoma Parks non-citizens has not made much of an impact on local elections. In 2003, out of 9,832 registered voters, the city reports, only 494 were non-citizens and 14 of those actually voted in the last election, according to the city secretary. It was unclear how the votes by non-citizens were identified. In states like California and Texas, Hispanic activist groups are more focused on getting Latino voters already eligible to register and show up at the polls. \"We are a formidable force as it is, with just those citizens that are eligible to vote,\" said Victor Landa, regional director for the Southwest Voter Education Project in San Antonio. \"If we could just tap into that, it would be outstanding. Im not really sure if those residents awaiting citizenship would be more eager voters -- whos to say?\", Allowing non-citizens to vote on local issues makes sense, Landa said. \"But I dont know if Texas is ready for something like that. Hopefully we could debate it,\" he added. The Texas Election Code required voters to be U.S. citizens as of 1921. That constitutional amendment took the vote from immigrants, who had been allowed to cast ballots since 1869. State Rep. Robert Alonzo, D-Dallas, couldnt raise any support for non-citizen voting when he introduced his proposed legislation in 1995. But he still thinks its worth pursuing. \"At the time, we were discussing school issues, talking about local control and that people locally should be involved in their community, definitely on school issues,\" Alonzo said. \"In a lot of cities like Houston (with an estimated 587,000 non-citizen residents) there are parents who are legal residents, theyre in line to become citizens, they pay taxes, they can go to PTA meetings, but they cant elect their local school board members.\", \"The biggest involvement they can have is to allow them to make decisions that affect their children,\" Alonzo said.]", "Date": "20040419", "Author": "[KIM COBB, Copyright 2004 Houston Chronicle]", "Link": "http://www.chron.com/news/houston-texas/article/Immigrants-voting-rights-becoming-a-major-issue-1982040.php", "Title": "[Immigrants' voting rights becoming a major issue]"}