{"Content": "[ Caption, Close, Republican Presidential candidate Sen. Ted Cruz, R-Texas, speaks during a demonstration by the Concerned Women for America Legislative Action Committee (CWALAC) to address the Obama administrations nuclear deal with Iran and the fact it leaves four Americans behind, Thursday, July 23, 2015, near the White House in Washington. Sen. Ted Cruz announced his bid for the 2016 Republican presidential nomination Monday at Liberty University in Lynchburg, Va. But without support from his fellow GOP leaders, does so-called \"most hated man in the Senate\" stand a chance at the nomination?, Sen. John Cornyn, (R-Texas), Former Texas Gov. Rick Perry, Sen. John McCain, (R-Ariz.), Rep. Peter King, (R-N.Y.), Conservative televangelist Pat Robertson, Rep. Sean Duffy (R-Wisc.), Sen. Bob Corker, (R-Tenn.), Former Rep. (current Arkansas Lt. Gov) Tim Griffin, R-Ark. Conservative political commenter Ann Coulter, Anonymous Republican aides during the government shutdown*:, WASHINGTON (AP)  In a stunning, public attack on his own party leader, Republican Sen. Ted Cruz accused Majority Leader Mitch McConnell of lying, and said he was no better than his Democratic predecessor and couldnt be trusted. Cruz, a Texan who is running for president but ranks low in early polling, delivered the broadside in a speech on the Senate floor Friday, an extraordinary departure from the norms of Senate behavior that demand courtesy and respect. \"Not only what he told every Republican senator, but what he told the press over and over and over again, was a simple lie,\" Cruz said. At issue were assurances Cruz claimed McConnell, R-Ky. had given that there was no deal to allow a vote to renew the federal Export-Import Bank  a little-known federal agency that has become a rallying cry for conservatives. Cruz rose to deliver his remarks moments after McConnell had lined up a vote on the Export-Import Bank for coming days. \"It saddens me to say this. I sat in my office, I told my staff the majority leader looked me in the eye and looked 54 Republicans in the eye. I cannot believe he would tell a flat-out lie,\" Cruz said. \"We now know that when the majority leader looks us in the eyes and makes an explicit commitment that he is willing to say things that he knows are false.\", The majority leader was not on the Senate floor when Cruz issued his attack, and ignored reporters who tried to ask him about it in the Capitols hallways. A spokesman said McConnell would have no response. McConnell has long indicated he would allow a vote on the Export-Import Bank as an amendment on the highway bill, which is the course hes now following. Senate supporters of the Export-Import Bank have said they got that commitment from McConnell in the course of debate on a separate trade bill, though theres been some dispute about what precisely was agreed to. No senator rose to defend McConnell on the floor, as some Republicans sought to avoid engaging in the dispute and giving Cruz still more attention. Questioned by reporters later, Sen. Orrin Hatch, R-Utah, challenged Cruzs criticism of McConnell, telling reporters, \"I think its wrong to disclose private information, especially when the disclosure is not accurate.\", \"Keep in mind, hes running for president,\" Hatch added. \"People who run for president do some very interesting things.\", McConnell and Cruz have never had a thriving relationship. The new majority leaders allies earlier this year derided Cruzs Senate record, complaining that he often speaks out but has missed important developments. After complaining about President Barack Obamas nomination of Loretta Lynch as attorney general, for example, Cruz skipped the final vote on her confirmation. Some close to McConnell call Cruz \"Mr. 1 percent,\" referring to his share of support in the crowded race for the GOP presidential nomination. Recent polls have him a few points higher among more than a dozen contenders. Cruz, for his part, has grown increasingly outspoken about his contempt for McConnell and other Republicans, using his newly published book, \"A Time for Truth,\" to attack his colleagues on various fronts and accuse them of failing to stand up for their principles. On Friday he charged that the Senate under Republican control is no different from when Democrats ran the show before this year and McConnell is behaving like his Democratic predecessor, Harry Reid of Nevada. Republicans accused Reid of shutting down debate and limiting amendments when he ran the Senate. \"Now the Republican leader is behaving like the senior senator from Nevada,\" Cruz complained. He also derided an announcement from McConnell that the Senate will vote Sunday to repeal Obamas health care law, calling it \"an empty show vote\" and \"exercise in meaningless political theater\" because the legislation will inevitably fail to get the 60 votes needed to advance. \"We keep winning elections and then we keep getting leaders who dont do anything they promised,\" Cruz said. The Senates historian, Betty K. Koed, said that it was not a specific breach of Senate rules to call another senator a liar, but pointed to rules cautioning against talking ill of other members or imputing unbecoming conduct or motives. \"In more recent times theres been very little of this type of behavior,\" Koed said. ", "Date": "20150727", "Author": "[Erica Werner and Laurie Kellman, Associated Press]", "Link": "http://www.chron.com/news/texas/article/Cruz-McConnell-lied-on-Ex-IM-bank-cannot-be-6403318.php", "Title": "[In stunning attack, Cruz accuses leader McConnell of lying]"}