{"Content": "[ AUSTIN - Texas Republicans made clear Friday they plan to continue fighting to protect the ban on same-sex marriage in Texas, even after controversial bill to reaffirm the prohibition seemed to die in the state House. The legislation, House Bill 4105, would prevent state or local funds from being used for issuing same-sex marriage licenses, a move that supporters hope protects the ban even if the U.S. Supreme Court rules this summer that it is unconstitutional. It died late Thursday when it was not approved before the end of day cutoff for the lower chamber to approve proposals starting there. Rep. Cecil Bell, R-Magnolia, who sponsored the measure, said he would look for another billthat he could amend with the same-sex marriage language, although it was not immediately clear that such a bill existed. In the Texas Legislature, amendments must be related to the topic of a bill. \"The session still moves on,\" Bell said minutes after the midnight deadline. \"We will continue to work toward a favorable conclusion.\", Later on Friday, 93 state House members released a letter supporting the states current same-sex marriage ban. \"We, therefore, affirm the preservation of the present definition of marriage as being the legal union of one man and one woman as husband and wife, and pledge to uphold and defend this principle that is so dearly held by Texans far and wide,\" the lawmakers wrote, although they did not specifically mention Bells bill. The letter was signed by all but five members of the majority House GOP Caucus -- Sarah Davis of Houston, MattSchaefer of Tyler, Jason Villalba of Dallas, Larry Gonzales of Round Rock and Joe Straus of San Antonio, who as speaker typically does not sign onto statements of that type. House Bill 4105 had passed through the House State Affairs Committee last month, with Bell calling it a critical measure to assert \"the sovereign rights of Texas and of the citizens of Texas.\", On Thursday, the legislation took center stage at the Capitol even though it never actually came up for a vote. Instead, Texas Democrats worked to run out the clock on the bill before the midnight deadline, raising procedural points of order and asking lengthy questions on other legislation due up first. The tactics, known as \"chubbing,\" take place every year but this focused on Bells bill. \"Personally, I really dont think its a discussion we need to have today,\" said Rep. Garnet Coleman, D-Houston. When the clock struck midnight, Democrats celebrated. \"We kept #HB4015, the anti-equality bill, away from consideration!\" wrote Rep. Eddie Rodriguez, D-Austin, on Twitter. \"Gonna go home and take a nap now...\", Bell blamed the defeat on \"a bunch of folks (who) dont think state sovereignty is important.\", He noted that the bill was 23 proposals away from being considered on a day when dozens of measures were debated. \"We nearly got there,\" he said. \"Obviously Im disappointed.\"]", "Date": "20150515", "Author": "[By Brian M. Rosenthal]", "Link": "http://www.chron.com/news/politics/texas/article/Lawmaker-vows-to-continue-fighting-to-protect-gay-6265652.php", "Title": "[Texas GOP vows to continue fighting to protect gay marriage ban]"}