{"Content": "[ Caption, Close, Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Thursday, Sept. 10, 2015, in Houston. Houston ISD Superintendent Terry Grier and HISD Spokesman Jason Spencer walk toward the podium Thursday, Sept. 10, 2015, in Houston. Grier announced that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", Houston ISD Superintendent Terry Grier announced Thursday, Sept. 10, 2015, in Houston that he is stepping down effective on  March 1. Grier became superintendent of Houston in 2009, leading the nations seventh largest school district to win the Broad Prize for Urban Education in 2013. \"You cant be school superintendent in Houston forever,\" Grier said, citing his age and recent knee replacement. \"Its just time and thats it in a nutshell.\", , Media waits as Houston ISD Superintendent Terry Grier announces Thursday that he is stepping down effective on March 1. Houston ISD Superintendent Terry Grier delivers his State of the Schools address at the Hilton Americas Hotel in February. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. These charts show HISDs progress under Superintendent Terry Grier. Houston ISD Superintendent Terry Grier made a surprise announcement Thursday that he would step down March 1, leaving midway through his seventh school year as some trustees have been unwilling to extend his contract after an aggressive tenure marked by big-dollar reform efforts, staffing shake-ups and national accolades. Grier, who came to Houston from San Diego in August 2009, expressed pride in his accomplishments in the states largest district but said it was \"just time\" to leave. His contract expires in June 2016, and the school board had not yet moved to extend it. The 65-year-old said he did not plan to retire, but noted that he underwent a knee replacement over the summer and has a second surgery in November. \"Time flies when youre having fun. This is, like, year seven,\" Grier told a crowd of administrators at the Houston Independent School Districts central office. \"As I reflect back and look at where we were and where we are today, I couldnt be more proud.\", Several board members said Thursday that they were surprised by the timing of Griers news. He told trustees about his resignation in private shortly before holding a news conference. Grier has been a polarizing figure from the outset, partly because of his fast-paced rollout of initiatives designed to accelerate achievement among the districts roughly 215,000 students. HISD won the coveted Broad Prize for Urban Education in 2013, though scores on state and national exams generally have stagnated in recent years. While Grier has outlasted the tenure of most big-city superintendents, board meetings have become increasingly tense. Grier told the Houston Chronicle in May that he and his wife, Nancy, loved Houston and that his future with HISD depended largely on his relationship with the board. Four of nine trustee seats are on the ballot in November. Some candidates have called for Griers ouster. In June, Grier expressed his frustration with trustees after they repeatedly refused to improve state-mandated school improvement plans. Grier, however, called the board \"fantastic\" in his speech Thursday. \"Someone said to me, Well, why now? Whats going on?\" he said, as eight trustees stood behind him. \"You cant be school superintendent in Houston forever, even though you might want to. You just simply cant.\", Board president Rhonda Skillern-Jones, whos up for re-election, suggested to the Chronicle this week that she did not support extending Griers contract. The contract would roll over to 2017 if the board did not take action next year. \"As a sitting board member, thats a difficult question to answer publicly considering our personnel issues are to be kept private,\" she said. \"But I think Dr. Grier probably has taken the district as far as it can go. Hes made some wonderful contributions, and were grateful for that.\", Griers successes include significantly expanding the number of students taking and passing Advanced Placement exams, raising the high school graduation rate and overseeing passage of a $1.9 billion bond issue, the largest in Texas school history. His signature reform effort, a three-year experiment called Apollo, resulted in significant gains in math with continued lackluster performance in reading. Based on the states accountability system, roughly one of five HISD campuses is low-performing. The district had 58 schools rated \"improvement required\" this year, up from 44 in 2014. Trustee Harvin Moore, one of the four trustees who in 2009 hired Grier, said Thursday that he was \"surprised\" and \"disappointed\" he was leaving. He praised Grier for elevating the quality of staff  which he called \"the best of any district in the U.S.\"  and for expanding the number of dual-language programs in hopes of graduating more bilingual students. \"He was a person that does not shy away from controversy, if theres something he believes is the right thing to do. And I admire him for that,\" Moore said. Trustee Greg Meyers, also on the board that hired Grier, walked over to hug him after his resignation announcement. \"I knew from the beginning we had a superintendent that was going to make significant changes, changes that we needed to make in the interest of our students,\" Meyers said. Leaders of HISDs largest teacher group focused on the November school board elections, noting that the trustees will be charged with hiring Griers replacement. \"Will we maintain a board majority focused on unhealthy competition, misuse of testing and profiteering off public education?\" Zeph Capo, president of the Houston Federation of Teachers, said in a statement. \"Or will we elect a board that will focus on collaboration with all stakeholders to build the successful schools our kids deserve? Our kids and our dedicated school employees deserve no less.\", Chuck Robinson, executive director of the Congress of Houston Teachers, characterized Griers tenure as \"tumultuous.\", \"I dont have anything personally against the man,\" Robinson said. \"But weve had some very strong disagreements with some of his major initiatives  specifically, this mass termination of teachers, which has not moved the needle on the test scores.\", Grier oversaw the rollout of a new teacher evaluation system based in part on their students test scores. Griers tenure has been marked by turnover at all levels. Teacher turnover hit 20 percent in 2013-14, the highest level in a decade. As of last school year, more than two-thirds of campuses had at least two different principals since Grier arrived. Drew Houlihan, Griers fifth chief academic officer, described his boss as \"highly visionary.\", \"He has a very high level of expectations,\" Houlihan said. \"One of the quotes he uses that I always keep in my mind is, Students have only one chance in school.\", The school board and Grier still must negotiate any exit package, said HISD spokeswoman Holly Huffman. His annual salary is $300,000, plus $19,200 in stipends for his car and technology. He also is eligible for bonuses totaling $125,000. Grier said he planned to work hard through March. \"Weve got a lot left to do,\" he said. He pledged to fulfill promises made as part of the districts 2012 bond referendum. His administration recently reported a potential $211 million shortfall that he attributed to inflation in the construction market. \"Weve had some issues with funding. Thats going be resolved,\" Grier said. \"We are going to build the schools that we promised we were going to build. And when were finished, Houston, Texas, is going to have the finest portfolio of new high schools in any urban city in America.\", The crowd applauded. Take a closer look at Griers time and office and how HISD fared under his leadership on HoustonChronicle.com.]", "Date": "20150911", "Author": "[By Ericka Mellon]", "Link": "http://www.chron.com/news/education/article/Grier-out-as-Houston-ISD-superintendent-6496621.php", "Title": "[Grier out as Houston ISD superintendent]"}