{"Content": "[ Caption, Close, The highly controversial executive order issued by President Obama caused a backlash from many in the GOP. See how the order, which has been blocked by a judge, would impact the nation if its eventually enforced. 1. Parents, 2. Children, 3. Prioritizing deportations, 4. Law enforcement, 5. Border security, 6. Salaries, 7. Business programs, 8. Green cards, , , Governor Rick Perry, Governor Rick Perry, Governor-elect Greg Abbott, Governor-elect Greg Abbott, , Senator John Cornyn, , Rep. Lamar Smith, R-San Antonio, , State Senator Sylvia Garca, D-District 6, State Rep. Jessica Farrar, D-District 148, WASHINGTON  The Senate voted Tuesday to confirm Dallas-based U.S. attorney Sarah Saldaa to head Immigration and Customs Enforcement, making her the first Latina to oversee enforcement of the nations immigration laws.The 55-39 vote reflected the objections of Texas Sens. John Cornyn, Ted Cruz, and other Republicans angered over President Obamas recent executive action delaying deportations of roughly 5 million undocumented immigrants.Obama called Saldaa \"the right person to lead the dedicated men and women at ICE in securing our borders, keeping American communities safe, and upholding our values.\"The Congressional Hispanic Caucus issued a statement praising Saldaa for \"breaking new ground.\"Until the presidents action on immigration last month, Saldaa, the states first Hispanic U.S. attorney, had enjoyed bipartisan support both in Texas and Washington.When she was confirmed in 2011 as the U.S. Attorney for the Northern District of Texas, she got the strong backing of both Cornyn and then-Sen. Kay Bailey Hutchison.In a floor speech Tuesday, Cornyn called Saldaa \"a person of courage and conviction,\" noting that she had presided over the prosecution of former Dallas Mayor Pro Tem Don Hill for corruption.\"Unfortunately, the president changed everything this last November by his executive order by his executive actions on immigration,\" Cornyn said. \"When confirmed, she will be the principal enforcer of our immigration laws, and unfortunately, she now claims that the president was operating within his legal authority to issue this executive action.\"Under Senate rules, her confirmation required only a simple majority, giving Republicans little hope of blocking her.In the end, Democrats said Saldaa owed her confirmation in part to Cruz. His unsuccessful weekend gambit to block Obamas executive action, they argued, created an opening to vote on a raft of stalled presidential nominations.Cruz disputed that account Tuesday, accusing Democrats of causing the delay by denying his request for a direct vote defunding Obamas executive \"amnesty\" as part of an annual spending bill.Writing in an editorial published Tuesday in Politico, Cruz said Saldaa \"has pledged to uphold Obamas amnesty.\"Cornyn said that while he admires Saldaa, the administration had put her in the \"untenable position\" of either disagreeing with the president or fully embracing his immigration policies.Saldaa will report to Homeland Security Secretary Jeh Johnson, who praised her commitment to \"supporting those that enforce our laws, protect the homeland, and promote public safety.\"]", "Date": "20141216", "Author": "[By Kevin Diaz]", "Link": "http://www.chron.com/news/politics/us/article/Salda-a-confirmed-to-head-ICE-5960933.php", "Title": "[Saldaa confirmed to head ICE]"}