{"Content": "[ Caption, Close, Republican presidential candidate, former Florida Gov. Jeb Bush, right, talks with students in a third grade class as teacher Judy Elder, left, looks on before a town hall at La Progresiva Presbyterian School, Tuesday, Sept. 1, 2015, in Miami. Republican presidential candidate, former Florida Gov. Jeb Bush, responds to a question during a town hall at La Progresiva Presbyterian School, Tuesday, Sept. 1, 2015, in Miami. In this Thursday, Aug.  27, 2015, photo, Republican presidential candidate Donald Trump listens during a news conference after speaking at the TD Convention Center, in Greenville, S.C. Trumps call for mass deportation of millions of immigrants living in the U.S. illegally, as well as their American-born children, bears similarities to a large-scale removal that actually happened to many Mexican-American families 85 years ago. MIAMI (AP)  Republican presidential candidate Jeb Bush escalated his feud with Donald Trump on Tuesday, betting big he can re-energize his stalled campaign by challenging the billionaire businessman head on. Its a risky strategy for the former Florida governor, still considered the GOP front-runner by many party officials, but a move his advisers suggest is necessary to reverse Trumps unlikely ascension to the top of the 2016 presidential class. Bush intensified his criticism of the former reality television star on multiple fronts, first releasing a Web video featuring clips of Trump himself promoting traditionally liberal positions in old interviews. \"Youd be shocked if I said that in many cases I probably identify more as a Democrat,\" Trump says in the video produced and promoted by the Bush campaign titled \"Liberal Things That Trump Says.\", In a subsequent Fox News interview, Bush charged that \"Trump is more a Democrat than a Republican.\" Speaking to reporters in English and Spanish in Miami later in the day, Bush said: \"He attacks me every day. He personalizes everything. If youre not totally in agreement with him, youre an idiot, youre stupid, you have low energy, blah, blah, blah. Thats what he does.\", The Bush campaign reports that Tuesdays political assault was not an isolated incident, but part of a broader strategy to engage Trump more directly. While the two have traded jabs before, the approach marks a shift for Bush, who previously preferred to ignore Trumps bombast altogether. \"Trump has attacked Jebs wife, his mother, hes taken him out of context and lied about his record,\" said Bush spokesman Tim Miller. \"Its incumbent upon us to not just set the record straight about Jebs record, and not just fight back, but also expose Trump as somebody whos completely misrepresenting himself to voters.\", Miller promised the campaign would release \"more digital products,\" such as the video, in the coming days, while Bush would continue to be aggressive on the campaign trail. Bush, the son of one president and brother of another, is certainly not the first Republican presidential contender to go after Trump, yet he has the highest profile of the critics. The struggles of Trumps other critics offer a pointed reminder of the risks of confronting a man whose business is confrontation. \"Fighting with Donald Trump is like wrestling in the WWE,\" said Republican pollster Frank Luntz, himself the target of insults from Trump. \"It doesnt get you anywhere, and you know its going to hurt.\", Trump released a Web video of his own later in the day highlighting Bushs praise for the Clinton family. And on Twitter, Trump noted that other presidential contenders have tried to take him on. He dismissed Bushs video as \"yet another weak hit by a candidate with a failing campaign. Will Jeb sink as low in the polls as the others who have gone after me?\", Indeed, former Texas Gov. Rick Perry, New Jersey Gov. Chris Christie and Kentucky Sen. Rand Paul have lashed out at Trump at times over the summer. Each man dropped in the polls as Trump grew stronger. Bush maintains an overwhelming fundraising advantage over much of his Republican competition but he, too, has struggled in recent polls. Quinnipiac University pollster Peter Brown noted that no candidate has suffered more during Trumps rise than Bush. \"Obviously, Trump has found  at least for now  a strategy that works,\" Brown said, adding that Bush may be trying to pitch himself \"as less of a policy wonk and more of a potential president who can dish it out as well as he can take it.\", Political operatives note that the next phase of the 2016 campaign is just beginning. After a summer season in which most voters typically dont closely follow national politics, many candidates, Bush among them, will start advertising on television in coming weeks. A pro-Bush super PAC is set to spend $12 million on an advertising campaign to begin running in key states later in the month. Bush \"knows the contours of this primary will change by late fall and early 2016,\" said Republican operative Leonard Alcivar. \"He also knows his super PAC is weeks away from dropping millions of dollars in positive TV ads and mail highlighting his conservative record as governor. When that happens, no one will be talking about Web videos.\", Former New Hampshire GOP Chairman Fergus Cullen praised Bushs decision to confront Trump. \"Ive watched so many others pander  Im looking at your Scott Walker and Ted Cruz  and the rest of the field run for cover,\" Cullen said. \"I really think this is a leadership test. Trump is doing serious damage to our party.\", ", "Date": "20150904", "Author": "[Sergio Bustos and Steve Peoples, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Bush-Trump-dispute-intensifies-Bush-hitting-back-6478458.php", "Title": "[Bush-Trump feud intensifies in GOP primary]"}