{"Content": "[ Caption, Close, Opposition to the equal rights ordinance in May led to an anti-ordinance petition. The city claims many signatures on that document are fraudulent. Protesters gather outside City Hall after a proposed compromise was announced May 13 in the Houston Equal Rights Ordinance. Mayor Annise Parker announces Wednesday morning that the city of Houston will withdraw subpoenas of five pastors in the lawsuit over the Houston Equal Rights Ordinance. Mayor Annise Parker announces Wednesday morning that the city of Houston will withdraw subpoenas of five pastors in the lawsuit over the Houston Equal Rights Ordinance. Mayor Annise Parker announces Wednesday morning that the city of Houston will withdraw subpoenas of five pastors in the lawsuit over the Houston Equal Rights Ordinance. Standing with Houston area clergy (center)  Mayor Annise Parker announces Wednesday October 29, 2014 at city hall that the city of Houston will withdraw subpoenas of five pastors in the lawsuit over the Houston Equal Rights Ordinance. In an editorial for the USA Today, Sen. Ted Cruz, R-Texas, laid out his plan for the Republican party in 2015, but it sounds somewhat like a presidential platform. Here are the 10 priorities he says the GOP needs to focus on. U.S. Sen. Ted Cruz (R-Texas) is surrounded by preachers as he addresses a crowd at a Houston church Thursday, Oct. 16, 2014. Cruz spoke about a legal dispute involving several pastors fighting subpoenas from Houston city attorneys demanding they turn over copies of any sermons they delivered that relate to Houstons equal rights ordinance championed by the citys gay mayor, Annise Parker. (AP Photo/Pat Sullivan), Sen. Ted Cruz speaks out against Houston City Halls subpoena request for the sermons of certain ministers opposed to the citys equal rights ordinance. Cruz spoke Thursday, Oct. 16, 2014, at First Baptist Church, 7401 Katy Freeway. Former City Councilwoman Jolanda Jones speaks at a rally supporting Houstons  Equal Rights Ordinance held Friday on Caroline Street. Lou Weaver gives his views in support of the citys Equal Rights Ordinance during Fridays rally on Caroline. Opponents of the measure won the right to an \"expedited\" trial set for January 2015, Former city councilor Jolanda Jones speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Marcus Smith with University of Houston NAACP speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Rev. Michael Diaz speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. People listen as former city councilor Jolanda Jones speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Mahpreet Singh speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Attorney Danyahel Norris speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Lou Weaver speaks about Equal Rights Ordinance on August 15, 2014 at 201 Caroline St. in Houston, TX. Former City Council member Jolanda Jones, stands with supporters of the Equal RIght Ordinance outside of Harris County Civil Courthouse on Friday, August 15, 2014 in Houston, Texas. Mayor Annise Parker and City Attorney David Feldman, announce that the petition to repeal the Houston Equal Rights Ordinance adopted by the City Council in May has fallen short of the number of signatures required due to errors in the signature collection process Monday, Aug. 4, 2014, in Houston. The 15,249 valid signatures fell short of the 17,269 required. Pages of signatures didnt qualify due to \"irregularities and problems.\" ( Johnny Hanson / Houston Chronicle ), Rev. Dave Welch, executive director of the Texas Pastor Council addresses the media after Mayor Annise Parker, City Attorney, David Feldman, and Council Member Ellen Cohen announced that the petition to repeal the Houston Equal Rights Ordinance adopted by the City Council in May has fallen short of the number of signatures required due to errors in the signature collection process Monday, Aug. 4, 2014, in Houston.  \"They violated the charter process,\" Welch said. \"We are saying let the people vote.\" The 15,249 valid signatures fell short of the 17,269 required. Pages of signatures didnt qualify due to \"irregularities and problems.\" ( Johnny Hanson / Houston Chronicle ), Mayor Annise Parker and City Attorney David Feldman, announce that the petition to repeal the Houston Equal Rights Ordinance adopted by the City Council in May has fallen short of the number of signatures required due to errors in the signature collection process Monday, Aug. 4, 2014, in Houston. The 15,249 valid signatures fell short of the 17,269 required. Pages of signatures didnt qualify due to \"irregularities and problems.\", Rev. Dave Welch, executive director of the Texas Pastor Council addresses the media after Mayor Annise Parker, City Attorney, David Feldman, and Council Member Ellen Cohen announced that the petition to repeal the Houston Equal Rights Ordinance adopted by the City Council in May has fallen short of the number of signatures required due to errors in the signature collection process Monday, Aug. 4, 2014, in Houston.  \"They violated the charter process,\" Welch said. \"We are saying let the people vote.\" The 15,249 valid signatures fell short of the 17,269 required. Pages of signatures didnt qualify due to \"irregularities and problems.\", Jared Woodfill, left, David Welch, right, and others with a group seeking to repeal Houstons equal rights ordinance delivered boxes of signatures to the office of the Houston city secretary on July 3. Protestors gather outside of City Hall after Mayor Annise Parker and supporters of her proposed nondiscrimination ordinance announced a compromise, Tuesday, May 13, 2014, in Houston. The proposed change in the Houston Equal Rights Ordinance would specify that no business open to the public could deny a transgender person entry to the restroom consistent with his or her gender identity. (Cody Duty / Houston Chronicle), Jared Woodfill, left, David Welch, right, and others seeking to repeal the Houston Equal Rights Ordinance deliver boxes of signatures to the Houston City Secretary. Houston Mayor Annise Parker is applauded by supporters during a media conference about the HERO (Houston Equal Rights) ordinance Thursday, July 3, 2014. Supporters of the equal rights ordinance encourage the members of the community who approached the Houston  City Council in favor of the ordinance. Wednesday, May 28, 2014, in Houston. Mayor Parker embraces Autumn Packard whos daughter is a transgender. Packard thanked the Mayor for bringing up the equal rights ordinance. Packard got emotional on her arms. David Maldonado walks away after placing his case against the equal rights ordinance to the Houston City Council, Wednesday, May 28, 2014, in Houston. Melanie Pang, left, kisses her partner Kendall Toarmina after Pang stood in support of the equal rights ordinance at the Houston City Hall City Council room, Wednesday, May 28, 2014, in Houston. Debbie Kelly, center, embraces Melanie Pang, left, after Pangs support for the equal rights ordinance at the Houston City Hall, Wednesday, May 28, 2014, in Houston. Joaquin Garcia speaks to the Houston City Council in favor of the equal rights ordinance, Wednesday, May 28, 2014, in Houston. Debbie Kelly, center, embraces Melanie Pang, left, after Pangs support for the equal rights ordinance at the Houston City Hall, Wednesday, May 28, 2014, in Houston. Protestors against the equal rights ordinance pray at the Houston City Hall City Council room during a session break, Wednesday, May 28, 2014, in Houston. Protestors against the equal rights ordinance pray outside the Houston City Hall during the city council meeting in which the future of the ordinance will be decided, Wednesday, May 28, 2014, in Houston. Ryan Leach holds Madeleine Schimmer (4) in his arms with her mother Sarah Schimmer at right (with red scarf) at the moment when Houston City Council voted to approve the Equal Rights ordinance Wednesday May 28, 2014. Ryan is gay and Sarah and Madeleine joined him at City Hall to support his cause. Kendall Toarmina (cq) and Melanie Pang (cq) (glasses and grey jacket) hug each other at the moment when Houston City Council voted to approve the Equal Rights ordinance Wednesday May 28, 2014. Houston Mayor Annise Parker speaks to the media after Houston City Council voted to approve the Equal Rights ordinance Wednesday May 28, 2014. Protestors against the equal rights ordinance gather outside the Houston City Hall during the city council meeting in which the future of the ordinance will be decided, Wednesday, May 28, 2014, in Houston. , Protestors gather outside of City Hall after Mayor Annise Parker and supporters of her proposed nondiscrimination ordinance announced a compromise, Tuesday, May 13, 2014, in Houston. The proposed change in the Houston Equal Rights Ordinance would specify that no business open to the public could deny a transgender person entry to the restroom consistent with his or her gender identity. Protestors gather outside of City Hall after Mayor Annise Parker... Protestors gather outside of City Hall after Mayor Annise Parker and supporters of her proposed nondiscrimination ordinance announced a compromise, Tuesday, May 13, 2014, in Houston. The proposed change in the Houston Equal Rights Ordinance would specify that no business open to the public could deny a transgender person entry to the restroom consistent with his or her gender identity. A capacity crowd waves their hands as they agree with a speaker on an issue as the proposed Equal Rights Ordinance was up for public discussion in front of city council members at City Hall, Wednesday, April 30, 2014, in Houston. Mayor Annise Parker and supporters of her proposed nondiscrimination ordinance announce a compromise during a news conference at City Hall, Tuesday, May 13, 2014, in Houston. The proposed change in the Houston Equal Rights Ordinance would specify that no business open to the public could deny a transgender person entry to the restroom consistent with his or her gender identity. Equal rights ordinance opponents on Friday sued Mayor Annise Parker for the second time this week, challenging the ballot language that will go to voters in November. At issue is whether the ballot item should ask voters if they favor repealing the law or not, or if they support implementing the law or not. City Council approved sending the equal rights ordinance to voters on Wednesday, under order from the Texas Supreme Court to either repeal the law or affirm it and place it on the November ballot. Then, City Council tackled the ballot language. Attorney Andy Taylor, who represents the opponents, told City Council he believed City Charter does not allow for a suspended ordinance -- the law has been tabled, under court order -- to be voted on by repeal. The current ballot language asks \"shall the city of Houston repeal the Equal Rights Ordinance\" -- so a supporter of the law would vote against it, and an opponent would vote in favor. In a press release, Taylor said the \"Mayor decided to play games with the language in an effort to confuse voters on the effect of a Yes or No vote.\", Taylor has submitted an emergency mandamus relief request to the Texas Supreme Court. In order to meet a late August deadline for ballot items, City Council has only one meeting left to re-vote on the language if ordered to do so. Mayor Annise Parker did not respond to a request for comment but on the Houston Matters radio show Friday afternoon she said the lawsuit lacked merit. The language, she noted, was taken from a repeal referendum petition opponents submitted last summer. \"They apparently dont trust the voters to figure out how to read do you want to repeal, yes or no,\" Parker said. \"This is a frustrating situation for me but I know that we are following the law in the city of Houston.\", The equal rights ordinance bans discrimination based not just on sexual orientation and gender identity - the flash points for opponents - but also, as federal laws do, sex, race, color, ethnicity, national origin, age, religion, disability, pregnancy and genetic information, as well as family, marital or military status. The ordinance applies to businesses that serve the public, private employers, housing, city employment and city contracting. Religious institutions are exempt. Violators can be fined up to $5,000. Conservative opponents submitted a petition to send the law to voters last summer, but city officials rejected it, saying it was riddled with errors and did not contain the needed 17,269 valid signatures from Houston residents. That triggered a lawsuit from opponents and the subsequent district court and Supreme Court rulings. On Monday, opponents again filed suit against Parker, seeking unspecified court costs and other damages associated with the earlier lawsuit. Three pastors also are suing Parker for damages and legal costs incurred when the city, as part of a broad discovery request, issued subpoenas that included a demand for certain sermons. Those subpoenas eventually were pulled down amid significant backlash.]", "Date": "20150807", "Author": "[By Katherine Driessen]", "Link": "http://www.chron.com/news/politics/houston/article/Equal-rights-ordinance-opponents-sue-mayor-over-6431037.php", "Title": "[Equal rights ordinance foes sue mayor over ballot language]"}