{"Content": "[ Caption, Close, Rep. Randy Weber, R-Texas, was widely criticized after comparing Obama to Hitler on Twitter. Weber lambasted the White House for failing to attend a unity march in Paris, France, dedicated to the victims of the Jan. 7-9 terror attacks.Source: Twitter, Congressman Randy Weber apologized to those offended by his tweet involving President Barack Obama and Adolf Hitler. Then-Rep. Barney Frank, D-Mass. reacts to a sign on Aug. 18, 2009. Obama-Hitler posters and photos are occasionally seen being held up by some protesters in the U.S. and around the world. Keep clicking to see other comparisons made between the two. President Barack Obamas handshake with Cuban President Raul Castro wasnt well-received by Sen. John McCain, who compared it to British Prime Minister Neville Chamberlains handshake with Adolf Hitler. Here are some other Obama-Hitler comparisons. Home Depot co-founder and billionaire Kenneth Langone compared Obama to Hitler in a Politico story about wealthy Americans and their political actions. Because if you go back to 1933, with different words, this is what Hitler was saying in Germany. You dont survive as a society if you encourage and thrive on envy or jealousy. He later apologized.Source: Politico, A video billboard in Indiana made national headlines for an image of Obama wearing a Hitler-like mustache. Indianas WANE-TV reports the billboard may have been created by the LaRouchePac, a political action committee espousing the ideas of Lyndon LaRouche Jr.Source: Huffington Post, In 2012, a political opponent of Rep. Tim Ryan, D-Ohio, took to Twitter to criticize Obama on his abortion stance, comparing him to such brutal dictators as Hitler and Joseph Stalin. She later backpedaled, saying she chose a \"poor analogy.\"Source: Twitter, , In 2009, conservative shock radio host Rush Limbaugh made a few  comparisons of Obama to Hitler, saying both leaders \"ruled by dictate.\"  He also said the \"Obama health logo is damn close to a Nazi swastika  logo.\"Source: Huffington Post, While she didnt directly make an Obama-Hitler comparison, former Alaska Gov. Sarah Palin endorsed an article/column that did. Thomas Sowell wrote that Obamas policies regarding the 2010 BP oil spill resembled the German Reichstags passage of a law that gave Hitler dictatorial powers.Source: Twitter, , Veering away from a direct comparison, former Florida representative and tea party champion Allen West opted to go for a \"Neville Chamberlain\" comparison, saying that Obama had blood on his hands following the destruction of a Malaysian Airlines plane over Ukraine.Source: Business Insider, Houston Democrat and LaRouche supporter Kesha Rogers has never shied away from her disapproval of Obama. In a 2014 interview with Digital Journal, she made no apologies for comparing the president with Hitler. \"Im appealing to voters by actually telling the truth,\" she said. \"Mr. Larouche made the clear forecast or warning about the character of President Obama as being similar to Adolf Hitler and [the Roman emperor] Nero.\"Source: Digital Journal, ESPN pulled Hank Williams Jr.s classic intro song from \"Monday Night Football\" after the country singer discussed President Barack Obamas golf game with GOP House Speaker John Boehner. \"Come on. Thatd be like Hitler playing golf with Netanyahu,\" he said on Fox News. In September, Slate reported that Sen. Ted Cruz had compared his fellow Republicans fight against Obamacare to British Prime Minister Neville Chamberlains strategy of appeasement with Adolf Hitler. \"Look, we saw in Britain, Neville Chamberlain, who told the British people, Accept the Nazis. Yes, theyll dominate the continent of Europe, but thats not our problem. Lets appease them. Why? Because it cant be done. We cant possibly stand against them. And in America there were voices that listened to that. I expect those same pundits who say it cant be done, had it been in  the 1940s, we would have listened to them.\", In the wake of Obamas health care policies regarding contraceptives, Catholic Bishop Daniel Jenky decided to pull Godwins law and compare his flocks \"persecution\" to those who suffered under Russian dictator Josef Stalin and Adolf Hitler. \"Hitler and Stalin, at their better moments, would just barely tolerate some churches remaining open, but would not tolerate any competition with the state in education, social services and health care.\", Then GOP presidential candidate Rick Santorum compared the election to the early 1940s when Americans didnt act against Adolf Hitler. Its going to be harder for this generation to figure this out. Theres no cataclysmic event, he said. President Barack Obamas decision not to attend a peace rally in Paris this weekend has drawn widespread criticism, but a Hitler comparison may have been a bit much. Texas Congressman Randy Weber has created a stir on Twitter after his choice of words when attacking the president, declaring \"Even Adolph Hitler thought it more important than Obama to get to Paris. (For all the wrong reasons.) Obama couldnt do it for right reasons.\", Weber later relased a statement on his website, somewhat backtracking from the post. \"I need to first apologize to all those offended by my tweet. It was not my intention to trivialize the Holocaust nor to compare the President to Adolf Hitler. The mention of Hitler was meant to represent the face of evil that still exists in the world today. I now realize that the use of Hitler invokes pain and emotional trauma for those affected by the atrocities of the Holocaust and victims of anti-Semitism and hate.\", Weber represents Texas 14th District, which covers areas along the coast stretching from Lake Jackson to Arthur, including Galveston. He previously drew fire for a post during the 2014 State of the Union, which said \"On floor of house waitin on \"Kommandant-In-Chef\"... the Socialistic dictator whos been feeding US a line or is it A-Lying?\", On Monday, the administration apologized for not sending a high level official to the event, which was attended by heads of state from the around Europe and the Middle East. \"Its fair to say we should have sent someone with a higher profile,\" White House spokesman Josh Earnest said. Sen. Ted Cruz also attacked the presidents decision, but with much tamer language than his counterpart in the House of Representatives. \"Where was the president? Where was the vice president? Where was the secretary of state? Where was the attorney general, who had been there moments before, but chose to get on a plane and fly back home?\" Cruz asked Monday during a speech at the conservative Heritage Foundation.]", "Date": "20150113", "Author": "[By Brian Reynolds]", "Link": "http://www.chron.com/news/politics/article/Texas-congressman-s-Obama-Hitler-comparison-6011886.php", "Title": "[Texas congressman's Obama, Hitler comparison draws fire]"}