{"Content": "[ Caption, Close, , AUSTIN, TX- JANUARY 11:  A person holds a sign as others belonging to the Tea Party movement convene at a rally at the Texas state capitol during the first day of the 82nd Legislative session on January 11, 2011 in Austin, Texas. The demonstrators picketed demanding true conservative values from elected officials. AUSTIN, TX- JANUARY 11: A person holds a sign as others belonging... Robert McNair, Bob and Doylene Perry, Ken Davis, Paul Foster (right), Marcus Hiles (not pictured), , , John Nau III, CEO of Silver Eagle Distributors, John Nau III, the force behind the new Nau Center for Texas Cultural Heritage, says he feels he has an obligation to \"tell the story of how Houston went from a swamp to a major city., John Nau III, CEO of Silver Eagle Distributors, Robert Bass, Carolyn Oliver, J. Steve and Amber Mostyn, , Anthony Scott Noble (not pictured), Biggest contributors to Greg Abbott and Wendy Davis, , Harold Simmons - $900,000, Peter and Julianna Holt (shown with children Peter and Corinna) - $600,000, Kelcy Warren - $450,000, Brandon Steele - $402,000, Richard and Nancy Kinder - $400,000, Dan Friedkin - $382,000, Javid Anwar - $369,000, Richie Ray and Carissa Ray - $350,000, Jeffery Hildebrand - $301,000, James and Cherie Flores - $300,000, , Battleground Texas - $1.456 million in in-kind donations, Carolyn Oliver - $1 million, Mostyn Law Firm - $837,000, Emilys List - $323,000, Lone Star Project - $287,000 in in-kind donations, Robert \"Bobby\" Patton - $258,000, Service Employees International Union Committee on Political Education - $250,000, Louise Carvey - $240,000, Lee and Amy Fikes - $228,000, Planned Parenthood Votes - $216,000 , So-called \"mega donors\" have been called the gatekeepers of American politics. A handful of wealthy habitual givers have so much money to offer that candidates need their financial blessing to succeed. According to a recent analysis by the Center for Responsive Politics and the Sunlight Foundation, mega donors contributed $1.18 billion, almost a third of all fundraising reported by federal political committees in 2014. On state elections, they spent nearly half a billion that year. RELATED: Top local donors to the Ted Cruz campaign, Texas hosts the nations third largest population of high-power contributors, with 2,621, behind California and New York. Collectively, they put more than $98 million into the 2014 election, about two thirds for Republican or conservative interests. Five of the top 100 donors nationally call Houston home. Many of those top donors on the federal level aslo leverage big bucks to steer elections in the state, where three quarters of state congressional candidates collected less than 5 percent of campaign funds from donations less than $200 in 2012, the Chronicle found. The Center considers mega-donors the top 31,976 donors because that number is approximately equal to one percent of Americas notorious one percent. But it notes the list has become more \"top heavy\" in recent years, with the number of donors givinmore than $500,000 growing from 17 in 2010 to 135 in 2014. RELATED:Texas candidates far more reliant on big-dollar contributions than other states pols, Many critics of the election system allege that such big money in politics turns candidates from asking the citizens for votes to asking a select few citizens for money. The issue has gained prominence in the political discussion since the U.S. Supreme Court voted in 2010 to allow unlimited political contributions from individuals and corporations, saying the expenditures qualified as speech and could not be regulated by the government. Check out our slideshow to see which Texans have been spending the most on federal elections.]", "Date": "20150505", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/texas/article/Texas-political-mega-donors-6241520.php", "Title": "[Texas' political mega-donors]"}