{"Content": "[ Caption, Close, FILE - In this Sept. 4, 2012, file photo, former Ohio Gov. Ted Strickland speaks in Charlotte, N.C. One of the biggest outside groups backed by billionaire conservative donors Charles and David Koch is spending $1.4 million to attack a Democratic Ohio Senate candidate Strickland in television advertisements. The ads against Strickland are paid for by Americans for Prosperity, a nonprofit group that doesnt disclose its donors. WASHINGTON (AP)  Americans for Prosperity, one of the biggest outside groups backed by billionaire conservative donors Charles and David Koch, this week begins a $1.4 million television advertising campaign against former Ohio Gov. Ted Strickland, now a leading Democratic candidate for Senate. \"We had such devastation and job loss in the state of Ohio when Ted Strickland was our governor,\" a man identified as Bruce says in the 30-second spot, which will air in all of the states major media markets. \"Ive never seen him solve Ohios problems.\", The ad concludes with text on the screen saying: \"Vote against Ted Strickland. Hes failed Ohios families.\" Republican Sen. Rob Portman is up for re-election next year. The anti-Strickland spot is a rare overtly political message from a group that typically refrains from express advocacy even as it encourages voters to back Republicans. Not since 2012 when it asked voters to reject President Barack Obama has Americans for Prosperity made this kind of ballot-box appeal. Thats because as a nonprofit advocacy group, it is limited in how much purely political work it can do. In exchange, it can keep its donors private. The difference in messaging can be slight  and lost on viewers. For example, earlier this month Americans for Prosperity began airing $1.2 million worth of ads against New Hampshire Gov. Maggie Hassan, a Democrat who is weighing whether to run against Republican Sen. Kelly Ayotte next year. Those spots criticize Hassans veto of lower taxes as harmful to small businesses. But instead of saying to vote against Hassan, the spot concludes by asking viewers to \"tell Maggie Hassan we cant afford her tax hikes.\", Democratic groups said they arent surprised that outside money is quickly moving into the Ohio Senate race. Strickland has high name recognition, potentially posing a threat to Portman. \"Washington special interests are lining up to buy this race for Rob Portman so they can keep him in the Senate to do their bidding,\" said Jennifer Donohue, a spokeswoman for the Ohio Democratic Party. Bridge Project, a Washington-based nonprofit aligned with Democrats, said it will soon release a report detailing how policies backed by the Kochs are bad for Ohio. \"The Koch brothers know that Rob Portman backs their reckless economic agenda that enriches billionaires like themselves while hurting Ohios middle class and working families,\" said Regan Page, a spokeswoman for the group. These August ad buys put Americans for Prosperity  it expects to spend at least $225 million this year and next  on early offense in two states that will be important for both the presidential contest and in helping Republicans hold the Senate. Americans for Prosperity has its annual activist summit this week in Columbus, Ohio; former Florida Gov. Jeb Bush and Texas Sen. Ted Cruz are among the GOP presidential candidates scheduled to address the crowd. The Koch brothers founded the group about a decade ago. It advocates for less government spending, fewer regulations and lower taxes through advertising and voter canvassing across the country. Tim Phillips, president of Americans for Prosperity, said the anti-Strickland ad, which will be on air throughout August, is meant to \"make sure Ohio citizens remember just how badly people were hurt by his policies.\", The ad says Bruce is a former employee of DHL, a delivery company that closed operations in Ohio. Hes one of 400,000 Ohioans who lost jobs during Stricklands term, the ad says, citing a Labor Department statistic. That same number was in heavy rotation in ads during Stricklands 2010 re-election bid, which he lost to Republican Gov. John Kasich, now a presidential candidate. Those job losses came as the country was in the midst of a national recession. As a major manufacturing state, Ohio was hit particularly hard. __, Associated Press writer Julie Carr Smyth contributed to this report from Columbus, Ohio. __, Follow Julie Bykowicz on Twitter at: http://twitter.com/bykowicz]", "Date": "20150818", "Author": "[Julie Bykowicz, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Koch-group-jumps-into-Senate-fight-with-6450071.php", "Title": "[Koch group jumps into Senate fight with anti-Strickland ad]"}