{"Content": "[ LITTLE ROCK, Ark. (AP)  A former member of the Little Rock School Board said Wednesday shes running for a U.S. House seat in central Arkansas, the first Democrat to launch a congressional bid in the state for 2016. Dianne Curry said she was running for the partys nomination to challenge Republican Rep. French Hill in the 2nd Congressional District. Hill was elected in November and is seeking a second term in the House. \"I feel that I have the ability and I have had the ambition for a long time to move forward,\" Curry told The Associated Press. \"For me, this is an opportune time to move forward and represent the people of my community.\", Curry is launching her bid months after Republicans swept statewide and congressional offices. The GOP has made major gains in the state primarily by tying Democrats to President Barack Obama, who remains deeply unpopular in Arkansas. Curry said shell detail her campaign proposals in the coming months but that she wants to focus on health, education, jobs and the economy. She said she would have voted for the federal health care law if she had been in Congress when it was approved in 2010. Hill and the rest of the states all-GOP congressional delegation have repeatedly called for the laws repeal. \"There is some tweaking that needs to be done,\" said Curry, who declined to specify what changes shed like in the law. Curry, 61, was first elected to the Little Rock School Board in 2006 and served through earlier this year, when the state took over the district and dissolved the board. Hill, a former banking executive, defeated Democratic rival and former North Little Rock Mayor Pat Hays for the 2nd District seat. Hill last month reported having nearly $375,000 in the bank for his re-election bid. His campaign didnt immediately respond to a request for comment on Currys announcement. So far, no other Democrats have announced a bid for federal office in Arkansas next year. Former federal prosecutor Conner Eldridge said Monday hes considering seeking the Democratic nomination to challenge Republican U.S. Sen. John Boozman. The one-week filing period for state and federal offices in Arkansas begins Nov. 2. ", "Date": "20150826", "Author": "[Andrew Demillo, Associated Press]", "Link": "http://www.chron.com/news/article/Former-Little-Rock-school-board-member-running-6467678.php", "Title": "[Former Little Rock school board member running for US House]"}