{"Content": "[ Statistics tell a powerful story. Consider that 36 percent of Texas residents age 65 or older depend on Social Security as their only source of income. Or that more than four of 10 in this age group would live in poverty were it not for Social Security. Then there are people like 72-year-old Raechel Foerster, who paint a face on those numbers. She is one of 3.7 million Texans who could tell their own story of how Social Security makes a difference in their lives. Foerster lives in the small town of Larue, southeast of Dallas, in a single-wide trailer financed through the USDA Rural Development Corp. For most of her adult life, she worked in department stores, never making more than $8 an hour. Her Social Security payments today allow her to meet her monthly mortgage payments, but she still struggles financially. \"Without it, Id be on the street panhandling,\" Foerster says. \"I would have to give up my dog, my only companion, who keeps me sane.\", Born in the depths of the Great Depression, Social Security celebrates its 80th anniversary in August and continues to be a pillar of financial security for so many. It isnt only for retirees like Foerster and others who have spent their work lives contributing into the system. Its benefits are also counted on by widows, people on disability and young children who have lost a parent, among others. To Julia Castellano-Hoyt, an AARP volunteer leader in San Antonio, Social Security survivors benefits have played a key role in her life, both as a child and now as a grandmother. \"My father died when I still had five siblings in school, in an area where employment was limited,\" she says. \"My mom didnt have the necessary skills for stable employment. If it hadnt been for the survivors benefits, I dont know what my mom would have done.\", Fast forward to today when Castellano-Hoyt and husband, Don, are both receiving Social Security while also being fortunate to have pensions and a bit of savings. Yet they depend on Social Security to make their retirement years work. They also point out to a beloved great grandchild who lost her dad almost two years ago and receives Social Security through her dads survivors benefits. So do we need to save Social Security? You bet we do,\" Castellano-Hoyt says. Indeed, Social Security - which enjoys strong support from all parts of the political spectrum - faces challenges that must be addressed to ensure it is strong for the next generation and ones that follow. The program is currently fully funded until the year 2035 and able to pay only 75 percent of benefits after that. It should be our duty to continue to ensure that people who work hard and pay into the system receive the benefits theyve earned when they retire. When President Franklin D. Roosevelt signed the new law on Aug. 14, 1935 - amid criticism from both right and left - he took an historic step that has withstood the test of time. Social Security has benefitted generations and resulted in arguably the most universally popular social program in our nations history. With 10,000 Americans retiring each day, it is important that we keep this program strong and in sync with how people live today. Any changes should be discussed as part of a broader conversation about how to help Americans prepare for a secure retirement. The 2016 presidential elections - already in full swing - offer us an excellent opportunity to have a thoughtful, national conversation about this issue and to begin taking action. Strengthening a program like Social Security, which provides a solid financial foundation that enables people to age with dignity on their own terms, creates a legacy that we can proudly pass along to future generations. , Bob Jackson is director of AARP Texas. ]", "Date": "20150813", "Author": "[By Bob Jackson]", "Link": "http://www.chron.com/opinion/outlook/article/Jackson-Keeping-Social-Security-viable-is-worthy-6443241.php", "Title": "[Jackson: Keeping Social Security viable is worthy legacy]"}