{"Content": "[ Caption, Close, , Tim Draper, head of venture capital firm Draper Fisher Jurvetson on Sand Hill Road. Silicon Valley venture capitalist Tim Draper will submit signatures Tuesday to put what could be one of the most dramatic startups ever on the ballot - a plan to divide California into six states. Draper, a multimillionaire known as the Riskmaster, and his team are expected to announce in Sacramento that theyve gathered more than enough signatures to put the Six Californias measure before state voters. The measure, a constitutional amendment, needs 807,615 valid signatures to qualify. Because the deadline has already passed for November, the plan could end up on the November 2016 general election ballot. Supporters would not say how many signatures they have gathered until Draper holds a news conference Tuesday in Sacramento. But they said they were confident they had plenty to spare. Democrats have denounced Drapers idea, and worry that an outpouring of conservative support and a lengthy campaign for the proposal could hurt both Gov. Jerry Brown in November and the partys presidential candidate in 2016. \"This is a colossal and divisive waste of time, energy and money that will hurt the California brand\" as well as the states \"ability to attract business and jobs,\" said Democratic strategist Steve Maviglio. \"Its unfortunate that Mr. Draper is putting his millions into this effort to split up our state rather than help us face our challenges.\", But Roger Salazar - a Democratic strategist who has worked for former Gov. Gray Davis, 2000 presidential candidate Al Gore and the Clinton White House, and is now the spokesman for Drapers effort - called Maviglios take \"the pessimistic view.\", \"California is a beautiful place to live, and any time you can get new ideas and have a conversation, its a good thing for California,\" Salazar said. \"If it helps to make government more responsible, thats a good thing, too.\", Under Drapers plan, each of the six states would have its own government and own collection of elected officials, including congressional representatives. A Field Poll in February showed 59 percent of Californians surveyed opposed the idea. Even if Draper can turn that around, there would be another major hurdle: The U.S. Constitution requires the approval of both Congress and the state Legislature, which is now firmly controlled by Democrats. Under the proposal, San Francisco, Oakland and San Jose would be part of the state of Silicon Valley, which would extend to Santa Cruz and Monterey counties; San Diego and Orange counties would be in South California; Los Angeles, Santa Monica and Santa Barbara would be part of West California. The Central Valley south of Stockton and the central and southern Sierra would be the state of Central California, while North California would include Marin and Sonoma counties and the greater Sacramento area. Rural counties in far Northern California would make up the state of Jefferson. Draper, speaking to a crowd of tech insiders in San Francisco earlier this year, insisted his plan was not - as some critics have suggested - a means of getting more Republican representation in California. He said he was simply aiming to spread Silicon Valleys spirit of innovation to the entire state, which he said has been struggling with partisanship and lack of leadership as businesses decamp for better climates. \"We have had really good people running California,\" he told the San Francisco crowd. \"Why is this not working?, \"Think of it as Sacramento being sort of ... rusted,\" said Draper, who is a registered independent. \"We need to do something structural, something fresh. ... If we dont try, were failing in our complacency.\", Draper must now submit his petitions to county registrars, who will have eight workdays to conduct an initial check to see if enough signatures are valid. If necessary, a thorough check could take an additional two months. Draper is no stranger to the challenges of expensive state ballot measures. In 2000, he spent $20 million on a failed measure to support school vouchers. When he first floated the Six Californias plan in February, Draper said he didnt plan on putting a lot of money into the measure. But that changed: Draper spent $1.3 million and hired the signature-gathering firm Arno Political Consultants, which paid collectors as much as $3 per signature. Draper has admitted that the ballot measure is a longshot, though he said private polling shows some conservative regions, including the Central Valley, are in favor of it. But he said can convince Californians that something must be done for a state that has \"the worst-managed government in the country.\", \"This is not going to happen overnight,\" he said. Carla Marinucci is the senior political writer at The San Francisco Chronicle. E-mail: cmarinucci@sfchronicle.com Twitter: @cmarinucci]", "Date": "20140715", "Author": "[Carla Marinucci]", "Link": "http://www.chron.com/politics/article/Six-Californias-backers-say-it-s-heading-for-5621377.php", "Title": "[Six Californias measure heading for 2016 ballot, backers say]"}