{"Content": "[ Caption, Close, A number of GOP presidential candidates had foot in mouth moments when asked if South Carolina should continue flying the Confederate battle flag on the capitol grounds. See what some of them had to say. Texas Sen. Ted Cruz said the last thing the people of South Carolina need is \"people from outside of the state coming in and dictating how they should resolve it.\", , Lindsey Graham told CNN hes open to revisiting the decision to use the flag, but it \"is a part of who we are.\", \"This is an issue that they should debate and work through and not have a bunch of outsiders going in and telling them what to do,\"Marco Rubio said according to the Washington Post, Ohio Gov. John Kasich said its ultimately \"up to the people of South Carolina to decide, but if I were a citizen of South Carolina Id be for taking it down.\", \"For those of us running for president, everyones being baited with this question as if somehow that has anything to do whatsoever with running for president. And my position is: It most certainly does not. I dont personally display it anywhere. So its not an issue for me,\" Huckabee said Sunday. \"Thats an issue for the people of South Carolina,\" Mike Huckabeesaid on Meet the Press, I think a governors job should be one to bring people together, not to divide them, and I think the Confederate battle flag is clearly one of those that divides people,\" Rick Perry told RealClearPolitics.com. , Former technology executive Carly Fiorina said Saturday she agrees the flag is a \"symbol of racial hatred\" yet declined to call for its removal, saying her \"personal opinion is not whats relevant here.\", \"Take down the #ConfederateFlag at the SC Capitol. To many, it is a symbol of racial hatred. Remove it now to honor #Charleston victims,\" former GOP presidential nominee Mitt Romney tweeted. WASHINGTON (AP)  Mitt Romney, the Republican nominee for president in 2012, called for the immediate removal of the Confederate battle flag from outside the South Carolina Statehouse, scrambling the 2016 GOP presidential contenders into staking a position on a contentious cultural issue. Some still steered clear from the sensitive debate, even after the shooting deaths of nine people in a historic African-American church in Charleston further exposed the raw emotions about the flying the flag. Many see the Confederate flag as \"a symbol of racial hatred,\" Romney tweeted on Saturday. \"Remove it now to honor #Charleston victims.\", The former Massachusetts governor joins President Barack Obama and civil rights leaders in calling for the flag to come down as the nation grapples with Wednesdays murders. The man charged with the crimes, Dylann Storm Roof, held the Confederate flag in a photograph on a website and displayed the flags of defeated white-supremacist governments in Africa on his Facebook page. Romneys statement prompted most of the Republican Partys leading presidential contenders to weigh in on flying the Confederate battle flag, although few took a definitive position one way or the other. Many instead expressed personal dislike for the flag, but suggested it was up to the people of South Carolina to decide. See what some of the candidates had to say in the gallery above.]", "Date": "20150623", "Author": "[The Associated Press]", "Link": "http://www.chron.com/news/politics/article/Confederate-flag-sets-off-debate-in-GOP-2016-class-6341546.php", "Title": "[Confederate flag sets off debate in GOP 2016 class]"}