{"Content": "[ Caption, Close, Democratic presidential candidate Bernie Sanders spreads his message Sunday at the University of Houston Hofheinz Pavilion. Democratic presidential candidate Bernie Sanders spread his progressive message of reducing income inequality, providing free college tuition and taking big money out of politics to Houstonians Sunday night at a packed arena on the University of Houston campus. He implored his supporters to ask their Republican friends, families and co-workers if it makes sense to grant huge tax breaks for the rich while cutting spending on health care programs and federal student aid.  , \"Our job is to reach out to our Republican brothers and sisters, working-class people and middle class people, and get their heads right,\" Sanders said to a boisterous crowd of 5,200 people at UHs Hofheinz Pavilion. The U.S. senator from Vermont was in Dallas earlier Sunday where he spoke to a crowd of some 7,000 people at a downtown hotel. He said visiting Texas and other Republican-leaning states is a part of his campaign strategy. \"Its wrong for the Democratic Party to surrender half of the states in America,\" Sanders said. \"The simple truth is you cannot be a national political party that claims to represent working families and low-income people and turn your back on some of the poorest states in America.\", Before Sanders began his speech shortly after 7 p.m. supporters were buying buttons and T-shirts and taking their seats in the arena. Among mounting turnout projections, Sanders organizers decided Friday to move his speech to the roughly 8,500-seat pavilion. He was originally scheduled to appear at the Universitys smaller Cullen Performance Hall, which seats around 1,600. Melanie Jackson, who attended with her husband and three children, including a baby she was balancing on her hip, said she likes Sanders stance on the working class and his ideas on for raising taxes on the most wealthy Americans. She was a little disappointed though when she got to the arena and realized it would not be a town-hall meeting where Sanders would take questions from the audience. If she could have, she said she would have asked about his plan for effecting change in Washington. \"He has really strict ideology,\" said Jackson, a stay-at-home mom and trained paralegal. \"Hows he going to pull everyone together and get things passed?\", Others in the crowd were eager to hear his plan for easing student debt, increasing wages and improving race relations. Recent appearances by Sanders, the leading rival to Hillary Rodham Clinton for the Democratic nomination, have drawn impressive numbers. Earlier this month, more than 7,000 people showed up to see him in Portland, Maine, and he drew a crowd of nearly 10,000 in Madison, Wisc. On Saturday night in Phoenix, he pulled in the biggest crowd of his campaign with more than 11,000 people, according to a press release citing figures from the Phoenix Convention Center. \"Everyone saw Hillary as the frontrunner, but Bernie has come to the forefront and now some think they may have another option,\" said Sydney Gibson, a 25-year old Rice University doctorate student, who attended the Houston rally. Gibson said President Barack Obama did a good job of getting the young vote. Sanders, she said, is \"a little unknown, but if he can get the younger crowd like Obama did he may have a chance.\"]", "Date": "20150719", "Author": "[By Nancy Sarnoff]", "Link": "http://www.chron.com/news/houston-texas/houston/article/5-2000-turn-out-to-Sanders-rally-at-UH-6393983.php", "Title": "[5,200 turn out to Sanders rally at UH]"}