{"Content": "[ Caption, Close, Ken Paxton, fiscal general de Texas, se congratul de que los estados de Nevada y Tennessee se hayan unido a la demanda multi-estatal liderada por su oficina contra los programas DACA y DAPA. Segn Paxton, el objetivo de la demanda es proteger a nuestros estados de las implicaciones econmicas y de seguridad pblica de una amnista ilegal. Rep. Ken Paxton, R-McKinney, addresses  the opening session of the 82nd Texas Legislature, Tuesday, Jan. 11, 2011, in Austin, Texas.  (AP Photo/Eric Gay), FILE - In this Jan. 5, 2015, file photio, Ken Paxton speaks after he was sworn in as Texas attorney general in Austin, Texas. Paxton calls the Supreme Court decision giving same-sex couples the right to marry a \"lawless ruling\" and says state workers can cite their religious objections in denying marriage licenses. He warned in a statement Sunday, June 28, 2015, that any clerk, justice of the peace or other administrator who declines to issue a license to a same-sex couple could face litigation or a fine. But in the nonbinding legal opinion, Paxton says \"numerous lawyers\" stand ready to defend, free of charge, any public official refusing to grant one. (AP Photo/Eric Gay, File), AUSTIN  A Collin County grand jury appears to have begun hearing testimony on allegations that Attorney General Ken Paxton violated state securities law. WFAA TV in Dallas reported Tuesday that special prosecutors assigned to the case, as well as Texas Rangers, who are investigating Paxton, were seen entering the grand jury room at the Collin County courthouse. The special prosecutors, Houston criminal defense attorneys Brian Wice and Kent Schaffer, have declined to discuss the case in recent weeks. Earlier this month, Schaffer said he believed they had \"substantial evidence\" to secure a first-degree felony fraud indictment from the grand jury. He said the amount of money involved in the case he and Wice will present to the grand jury will be \"substantially higher than $100,000.\", Securities fraud violations above that amount to a first-degree felony under state law. If convicted, Paxton could face a sentence of five years to life in prison and a fine of not more than $10,000. The case traces back to the 2014 election season, when Paxton was fined $1,000 and reprimanded after he admitted to repeatedly soliciting clients for a friends investment firm without being properly registered with the state. A criminal complaint later was filed against Paxton in Travis County, but prosecutors there said they lacked jurisdiction and referred the complaint to Collin County. Collin County District Attorney Greg Willis, a close friend and business associate of Paxton, recused himself and referred the case to the Texas Rangers in April. Wice and Schaffer were assigned to be special prosecutors by a state district judge soon after. The scope of the investigation was expanded in May, after Schaffer said the Rangers uncovered evidence of possible securities violations in addition to those Paxton admitted to in April 2014. The case in recent weeks has become a war of words between the special prosecutors, who say they are driven by the responsibility \"to do justice,\" and Paxton spokesman Anthony Holm, who has accused them of inexperience and bias. ]", "Date": "20150728", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/Paxton-fraud-case-now-before-grand-jury-6410396.php", "Title": "[Paxton case now before grand jury]"}