{"Content": "[ Caption, Close, From left, poll workers Briana Ashley and Marlene Gonzalez help a voter on Tuesday, July 21, 2015, at Nenahnezad Chapter House in Fruitland, N.M. during the Navajo Nations referendum election to decide the language qualifications for future leaders.  A simple majority of \"yes\" votes in Tuesdays election means Navajos will determine if candidates speak and understand the language well enough to hold office, starting with the 2018 election. A \"no\" vote leaves the current requirement in place. (Jon Austria/The Daily Times via AP), Harris Jim hands in his ballot to poll worker Chris Johnson on Tuesday, July 21, 2015, at the Upper Fruitland Chapter House in Upper Fruitland, N.M. during the Navajo Nations referendum election to decide the language qualifications for future leaders. A simple majority of \"yes\" votes in Tuesdays election means Navajos will determine if candidates speak and understand the language well enough to hold office, starting with the 2018 election. A \"no\" vote leaves the current requirement in place. (Jon Austria/The Daily Times via AP), Tom Smith Sr. and his daughter Alissa Lee, fill out paper work, Friday, July 17, 2015, before voting at the Navajo Election Administration - Northern Agency Office in Shiprock, N.M. (Jon Austria/The Daily Times via AP), Philo Pinto casts his ballot, Friday, July 17, 2015, at the Navajo Election Administration - Northern Agency Office in Shiprock, N.M. (Jon Austria/The Daily Times via AP), Alberta King, office administrator with the Navajo Election Administration, explains the ballot to voter Philo Pinto, Friday, July 17, 2015, at the Navajo Election Administration - Northern Agency Office in Shiprock, N.M. (Jon Austria/The Daily Times via AP), FLAGSTAFF, Ariz. (AP)  Navajos voted Tuesday to loosen language requirements for their top leaders, eliminating the need for them to be fluent in Navajo and giving voters more discretion in who can hold elected office. The passage of the referendum also raises the possibility that the Navajo Nation could elect a non-Navajo-speaking president and vice president in the future, starting with the 2018 election. The vote is a victory for Navajos who rallied around a presidential candidate who was disqualified from the race last year for refusing to have his language skills tested. \"It tells me that a majority of the Navajo people would like to see youth back at the leadership table,\" said tribal lawmaker Leonard Tsosie, who sponsored the language referendum and joined a crowd gathered in Window Rock where the results were broadcast. \"It shows the Navajo democracy at work.\", Others argued that not having a president speak fluent Navajo diminishes the language that is a defining part of the tribes culture and is recognized worldwide as the basis for a code that helped the U.S. win World War II. More people speak Navajo than any other single American Indian language, but its not widespread among the younger generation. Bernadette Todacheene, 65, of Shiprock, New Mexico, said Navajos have fought hard to maintain their language through U.S. government efforts to assimilate them into the American society and didnt want to see those struggles dismissed. She voted against the referendum. \"It is a perplexing point and time where we cannot, we cannot step back,\" she said. Navajo President Russell Begaye also advocated for keeping the fluency requirement intact. Not all tribes have a language requirement for their leaders. The neighboring Hopi Tribe requires its top elected official to be fluent in Hopi, for example, and the White Mountain Apache Tribe requires the leader to speak Apache. Other tribal constitutions dont address language skills. Unofficial results from the Navajo referendum showed that it passed by more than 1,200 votes with all precincts reporting. That means Navajo will determine if candidates for president and vice president speak and understand the language well enough to hold office when they cast their votes. Previously, candidates had to understand Navajo and speak it fluently, a requirement that could be enforced by tribal courts. More than 122,000 Navajos were registered to vote in Tuesdays referendum that gave tribal members a rare chance to change tribal law. The Navajo Nation Council called for the referendum months after Chris Deschene was dropped from the presidential race over a question of Navajo language fluency. The issue overshadowed the election that was delayed for months by court challenges, first filed against Deschene. Terry Teller, of Lukachukai, grew up speaking Navajo but said its not easy to learn and the fluency requirement kept younger Navajos out of the upper level of politics. \"It discourages Navajos who are educated and live off the reservation to return and help their people,\" said Teller, 36. Tsosie said he planned to sponsor legislation to create a Navajo language commission that would develop resources to help people learn the language. About a handful of other referendum elections have been held on the reservation, including one that rejected a tribal takeover of federal health care services and three on tribal casinos. The only citizen-led ballot measures resulted in a significant cut in the number of tribal lawmakers and a presidential line-item veto.]", "Date": "20150721", "Author": "[Felicia Fonseca, Associated Press]", "Link": "http://www.chron.com/news/us/article/Election-focuses-on-Navajo-language-fluency-6397419.php", "Title": "[Navajo Nation loosens language requirements for top leaders]"}