{"Content": "[ AUSTIN  A top lieutenant for Speaker Joe Straus is proposing the House allocate more money for border security to fund an unspecified number of new troopers along the Texas-Mexico perimeter, a plan being pitched as one that would end the need for future high-profile border surges. State Rep. Dennis Bonnen, R-Angleton, unveiled a wide-ranging border security measure Monday that, in part, authorizes Department of Public Safety troopers to work 10 hour days, imposes tougher penalties on smugglers and allows DPS to set up checkpoints within 250 yards of the border. The bill also would create a \"DPS Officer Reserve Corps\" of retired troopers to help police with background checks and sex offender compliance. The main thrust of Bonnens proposal is to end the states \"off again, on again\" approach of calling up troopers from all over Texas to implement so-called surge missions. \"Were stopping the surge and stop. Were creating a long-term plan,\" said Bonnen, who chairs the House Ways and Means Committee and was flanked by about three-dozen lawmakers at a news conference Monday. State officials last summer OKd tens of millions of dollars in taxpayer money to fund a surge operation led by the DPS to deal with an influx of Central American children pouring into Texas. Late last year, officials approved another $86 million to continue the surge, with the bulk of that money being directed to keep the increased DPS presence along the border through August. Roughly seven weeks into 140-day legislative session, border security has remained a hot topic at the Capitol. Gov. Greg Abbott has named it an emergency item, setting the issue on the fast track for passage in the first 60 days of the legislative session. He also voiced support for keeping National Guard troops in the border region until DPS can beef up its ranks there with an additional 500 state troopers and Texas Rangers. Abbott has recommended doubling border security spending. The Senate is proposing about $800 million for border security in its starting-point budget, while the Houses base budget includes roughly $400 million for border security. On Monday, Bonnen did not release any concrete figures for an expected cost or an anticipated number of new troopers for border. He said the House Appropriations Committee will figure out that part. State Rep. John Otto, the Houses top budget writer, said full implementation of the bill will require the lower chamber to add to its starting point budget for border security. He declined to offer a potential dollar figure, saying his committee would know more after hearing from DPS Director Steve McCraw at a Tuesday hearing. \"The base was never intended to cover the ultimate solution that has been unveiled today,\" said State Rep. John Otto, R-Dayton, and the Houses top budget writer. \"The House is committed to funding what is necessary to accomplish the goals that have been laid out in this piece of legislation.\" , Asked how many new troopers would be needed along the border, Otto also declined to provide an estimate, saying, \"I will know better tomorrow after Col. McCraw tells us how many troopers he can train and get deployed on the border.\" , Democrats Monday said they needed to fully vet the bill but cautioned that the measure could have unintended consequences. State Rep. Rafael Anchia, D-Dallas, said Democrats will be focused on ensuring the proposed checkpoints \"dont inhibit lawful trade\" and that additional trooper deployments make sense financially. \"Im all about looking at the numbers to make sure the tax payer money were spending is being used wisely and has an important return on investment,\" he said.]", "Date": "20150302", "Author": "[By David Saleh Rauf]", "Link": "http://www.chron.com/news/politics/texas/article/Lawmaker-offers-plan-to-make-DPS-border-presence-6111051.php", "Title": "[Lawmaker offers plan to make DPS border presence permanent]"}