{"Content": "[ Caption, Close, Ben Hall at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Houston mayoral candidate Ben Hall said Thursday he signed a petition seeking to define gender identity and prevent men \"who perceive or express themselves as women\" from entering womens restrooms because he wants to protect the right to vote. Halls press conference at his Montrose law firm comes three days after an LGBT blog reported that Hall signed the request, which it framed as \"anti-gay.\", \"Im trying to correct the record about people who are mischaracterizing why we signed the petition. I want to make sure we change that narrative,\" said Hall, who was accompanied by his wife. \"We signed this petition because everybody has the right to vote, whether you like the outcome or not.\", Hall added that he \"will protect all our citizens from illegal discrimination, gay or straight.\", Of this years crowded slate of mayoral contenders, Hall, the 2013 mayoral runner-up, is the most vocal opponent of the citys equal rights ordinance, which bans discrimination based on sexual orientation and gender identity, as well as sex, race, color, ethnicity, national origin, age, religion, disability, pregnancy, genetic information, and family, marital or military status. Hall is among the opponents of the ordinance who criticize it for potentially allowing men dressed in drag to enter womens restrooms. Earlier this month, longtime anti-gay activist Dave Wilson sued the city in an effort to force the city secretary to count the signatures on his latest petition  the one Hall signed  which wouldlimit the definition of gender identity and restrict bathroom access accordingly. Although Wilson said he collected 22,000 valid signatures  2,000 more than the number required for the city to place the charter amendment on Novembers ballot  Mayor Annise Parkers legal team has maintained the proposed revision is too similar to the one already in court that would repeal the citys equal rights ordinance. The next hearing in Wilsons case in Harris Countys 270th District Court is set for Friday. Over the last two years, Halls position on an equal rights ordinance appears to have evolved. During the 2013 mayors race, Hall initially indicated that he supported a nondiscrimination ordinance, though he later came out against it in the final days before the election.]", "Date": "20150723", "Author": "[By Rebecca Elliott]", "Link": "http://www.chron.com/news/politics/houston/article/Hall-calls-for-vote-on-charter-amendment-defining-6402309.php", "Title": "[Hall calls for vote on charter amendment defining gender]"}