{"Content": "[ Caption, Close, Houston City Hall, According to Matthew McConaugheys character in the HBO show \"True Detective,\" time is a flat circle. But at Houstons City Hall, time is a horseshoe - in that we measure the flow of time in the rise and fall of the elected representatives who sit around the horseshoe-shaped council table. Our city charters combination of two-year election cycles and a three-term maximum means that time ends rather quickly for our municipal politicians. Once council members have enough experience under their belts to understand the long-term policy picture or the nuances of city government, theyre forced into retirement and the education process starts all over again. Lessons learned go forgotten. City employees face agendas that shift without a clutch every two years. We keep having the same debates about planning, pensions and infrastructure without fully addressing the big picture. Time at the horseshoe doesnt really end, it just repeats. City Council should work to break this cycle, and it met on Thursday to do just that. At the second ad hoc charter review committee, council members addressed potential changes to the city charter, including extending term limits from three, two-year terms to two, four-year terms (\"City Council agrees any charter changes belong on November ballot,\" HoustonChronicle.com, Thursday). Were not sure that two, four-year terms is the best option, but it is certainly better. Council members also agreed that any vote to change the charter should go on the November ballot instead of during a special May election. The city charter serves as the underlying constitution of local governance. Elections to change that document should be timed to garner the highest possible number of voters, ensuring that Houstonians have a direct say in the manner that theyre governed. The mayoral election in November 2015 promises to be the most heated municipal election in some time. It would be a prime occasion to hold a vote on charter changes. In addition to changing term limits, the committee also is addressing three other proposals: repeal the citys revenue cap to help pay down the general fund debt; allow closed-door executive sessions for City Council; and remove the mayors exclusive control over the council agenda and allow items to be added to the agenda through a six-member vote. The revenue cap puts an unnecessary and fiscally irresponsible limit on City Halls ability to draw up a budget. A wise investor would dedicate the windfall of Houstons economic boom toward important projects like repairing infrastructure or paying down debt. A charter vote on the revenue cap will grant Houstonians the opportunity to untie the ropes that bind a steady hand of government. The other two proposed changes, however, seem less prudent. Sunshine is the best disinfectant, and council meetings closed to the public will cast a shadow on the transparency that Houstonians should want in their government. At the Thursday meeting, Council Member C.O. Bradford pointed out that plenty of other jurisdictions have the ability to hold closed-door sessions for specific issues that require discretion, such as personnel problems. If council really wants this power, the burden is on them to prove its necessity on an ad hoc basis. The plan to grant councilmembers the power to put items on the city agenda also should be viewed as an uphill battle. Houston entrusts the mayor with both executive and legislative powers. Gutting the mayors control over council meetings will radically change the way that City Hall works. A sudden change in government style will have unforeseeable consequences. This proposal would work better as a stand-alone issue that Houston can address another day. This isnt the first time that Houston has considered expanding our term limits or changing the mayors power over the agenda, and it probably wont be the last. But with growing pension burdens and potholes galore, it is about time we granted City Hall some room to work on long-term issues instead of rushing through a two-year election cycle.  Houston can address other concerns afterward. After all, time at the horseshoe doesnt end, it just repeats. ]", "Date": "20141206", "Author": "[Copyright 2014: Houston Chronicle]", "Link": "http://www.chron.com/opinion/article/Charter-changes-5938735.php", "Title": "[Editorial: Charter changes]"}