{"Content": "[ Caption, Close, FILE - In this Sept. 10, 2015, file photo, Vice President Joe Biden speaks during a news conference at the Office of the Chief Medical Examiner in New York. Reaching for a successful end to global climate talks, Biden will call on other nations to commit to ambitious cuts in greenhouse gases at a gathering of U.S. and Chinese leaders Sept. 16, 2015, in Los Angeles. WASHINGTON (AP)  Vice President Joe Biden lashed out at Republican front-runner Donald Trump on immigration Tuesday, accusing him of reverting to \"xenophobia\" to garner support in the 2016 election. Biden, who is weighing a late entry into the Democratic presidential primary, called Trumps message \"sick\" and predicted it \"will not prevail.\", \"This will pass  the Trump stuff and that stuff that youre hearing on the other team,\" Biden said at a Hispanic Heritage Month event at his residence in Washington. Trump has roiled the Republican field with his call to remove the millions of people living in the U.S. illegally before allowing some to return. Hes also accused some Mexican immigrants of being rapists and vowed to build a wall along the U.S. border with Mexico. Bidens comments mark a rare instance of top White House officials singling Republican presidential candidates out by name. On a visit to Iowa Monday, President Barack Obama avoided mentioning individual candidates even as he drew distinctions between Democratic and Republican positions, including on immigration. But while Obama definitely wont be on the ballot in 2016, Biden is still contemplating a run. Hes spoken movingly in recent days about the impact of his son Beaus death earlier this year and how his decision rests on whether he can make the emotional commitment to running for president. If Biden runs, his remarks Tuesday could serve as a template for his argument against Republicans in a general election. Both parties will be fighting for support from Hispanics, a fast-growing voting bloc that overwhelmingly supported Obama in the last presidential election. Biden, a Catholic, drew a distinction between Trump and Pope Francis, who is visiting the United States later this month. The popular pope has been a vocal advocate for humane treatment of immigrants and has spoken specifically about the conditions facing people crossing the U.S.-Mexico border. \"Watch the response that Pope Francis gets,\" said Biden, who called the pontiff \"the single most popular man in the world.\", As Biden closed his remarks, participants yelled \"Run, Joe, Run.\", \"Oh, no, no, no, no,\" Biden said, brushing their cheers aside and offering no new insights on his political future. __, Follow Julie Pace at http://twitter.com/jpaceDC]", "Date": "20150916", "Author": "[Julie Pace, Ap White House Correspondent]", "Link": "http://www.chron.com/news/politics/article/Biden-Trump-s-view-on-immigration-will-not-6507227.php", "Title": "[Biden: Trump's view on immigration 'will not prevail']"}