{"Content": "[ Caption, Close, , Increase presence of ICE officers: Trump wants to triple the number of Immigration and Customs Enforcement workers, saying the agencys enforcement arm has barely grown in the past decade. Mandate e-verify: Donald Trump wants nationwide use of the online program that lets companies determine if their employees are eligible for work in the U.S. Mandatory deportation of all immigrants who commit a crime while illegally in the U.S.: The Republican candidate says the process \"can be aided by canceling any visas to foreign countries, which will not accept their own criminals, and making it a separate and additional crime to commit an offense while here illegally.\", Defund sanctuary cities: Trumpwants to eliminate federal grants to cities that dont want cooperate with federal law enforcement on immigration matters. Cooperate with local gang task forces: The measure asks that ICE officers work more closely with local police departments in raids on street gangs, and deport members that are in the country illegally. Increase prevailing wage for H-1Bs: Saying Silicon Valley uses the H-1B program as an excuse to pull in cheap foreign labor, Trump wants to force the hands of companies to look harder at \"the domestic pool of unemployed native and immigrant workers in the U.S. instead of flying in cheaper workers from overseas.\", Require companies to seek American workers first: Trump says visa programs like the H-1B need to require qualified American applicants get hired before foreign labor. Enhanced penalties for overstaying a visa:Calling immigrants who overstay their visas a threat to national security, Trump wants violators to be subject to criminal penalties. End birthright citizenship: The proposal would eliminate automatic citizenship the children born in the U.S. whose parents are in the country illegally. Get Mexico to pay for a border wall: How will the real estate mogul accomplish this? His plan says that the U.S. will \"impound all remittance payments derived from illegal wages,\" increase or perhaps cancel temporary visas to Mexican CEOs and diplomats, raise the costs on border crossing cards, \"increase fees on all NAFTA worker visas from Mexico\" and up the fees at U.S. ports of entries from Mexico. Foreign applicants must be able to pay for themselves: Trump says he wants to \"end welfare abuse\" by requiring immigrants applying to come to the U.S. to show \"they can pay for their own housing, health care and other needs.\", Make it harder to obtain asylum in the U.S.: Trump wants to crackdown on alleged abuses committed by refuges and instead spend more money on refugee programs fro American children. Immigration moderation: \"Before any new green cards are issued to foreign workers abroad, there will be a pause where employers will have to hire from the domestic pool of unemployed immigrant and native workers.\", Donald Trump posted his immigration reform plan to his website over the weekend. Some of his proposals  like his bid to end birthright citizenship for the children of immigrants in the U.S. illegally  immediatelyraised eyebrows. The plan also outlines how Trump would get the Mexican government to pay for a border wall and how hell require U.S. companies to hire local talent before looking abroad for high-skilled foreign workers. RELATED: Trump says deport children of immigrants living illegally in the U.S. The new proposals that garnered the most attention focus on Trumps plan to toughen up the countrys deportation policies. A clause in the 14th amendment in the U.S. Constitution has granted birthright citizenship since 1868. The AP reports how previous Republican efforts to overturn the amendment have proven futile:, The odds of repealing the amendments citizenship clause would be steep, requiring the votes of two-thirds of both houses of Congress and support from three-fourths of the nations state legislatures. Republicans in Congress have repeatedly failed since 2011 to pass bills aimed at ending \"birthright citizenship.\", The AP wrote that some conservatives believe its impossible to eliminate birthright citizenship without touching the Constitution. However, Trumps reform plan does not mention how hed enact his proposal, and its unclear if many of the presidential candidates pitches are feasible. See the gallery above for key points from Trumps immigration reform plan]", "Date": "20150817", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/politics/election/article/14-key-proposals-in-Donald-Trump-s-immigration-6448916.php", "Title": "[13 key proposals in Donald Trump's immigration reform plan]"}