{"Content": "[ Caption, Close, Rick Perry proposed cutting off some federal funding to cities that declined to turn over suspected undocumented people to to federal immigration authorities. A new study by the Pew Center shows the changes in the U.S. labor force made up of unauthorized immigrant workers.  Take a look at some of the states where the top industries for unauthorized immigrant workers have the highest share of employees for this type of labor.    The figures represent Census data from 2012. AlabamaTotal labor force:   2.24 millionTop industry for unauthorized immigrants:   ConstructionUnauthorized immigrant labor force:   45,000, AlaskaTotal labor force:     380,000Top industry for unauthorized immigrants:  Education/health servicesUnauthorized immigrant workforce:   10,000, ArkansasTotal labor force:  1.38 millionTop industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  45,000, ColoradoTotal labor force:  2.8 millionTop industry for unauthorized immigrants:  Leisure/hospitalityUnauthorized immigrant workforce:  130,000, DelawareTotal labor force:  470,000 Top industry for unauthorized immigrants:  Business servicesUnauthorized immigrant workforce:  20,000, Washington, D.C.Total labor force:  370,000 Top industry for unauthorized immigrants:  Leisure/hospitalityUnauthorized immigrant workforce:  15,000, GeorgiaTotal labor force:  4.81 millionTop industry for unauthorized immigrants:  ConstructionUnauthorized immigrant workforce:   275,000, HawaiiTotal labor force:  700,000Top industry for unauthorized immigrants:  Leisure/hospitalityUnauthorized immigrant workforce:  :25,000, IdahoTotal labor force:  780,000Top industry for unauthorized immigrants:  AgricultureUnauthorized immigrant workforce:  35,000, IllinoisTotal labor force:  6.72 millionTop industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  350,000, IndianaTotal labor force:  3.30 millionTop industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  60,000, IowaTotal labor force:  1.65 millionTop industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  30,000, KansasTotal labor force:  1.49 millionTop industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  50,000, KentuckyTotal labor force:  2.07 millionTop industry for unauthorized immigrants:  Leisure/hospitalityUnauthorized immigrant workforce:    25,000, LouisianaTotal labor force:  2.20 millionTop industry for unauthorized immigrants:  ConstructionUnauthorized immigrant workforce:  40,000, MarylandTotal labor force:  3.26 millionTop industry for unauthorized immigrants:  ConstructionUnauthorized immigrant workforce:   200,000, MichiganTotal labor force:  4.86 millionTop industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  75,000, MinnesotaTotal labor force:  3 millionTop industry for unauthorized immigrants:  Leisure/hospitalityUnauthorized immigrant workforce:  75,000, MississippiTotal labor force:  1.35 millionTop industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  15,000, MissouriTotal labor force:  3.02 millionTop industry for unauthorized immigrants:  Business servicesUnauthorized immigrant workforce:  45,000, NebraskaTotal labor force:  1.02 millionTop industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  40,000, NevadaTotal labor force:  1.42 millionTop industry for unauthorized immigrants:  Leisure/hospitalityUnauthorized immigrant workforce:    150,000, New HampshireTotal labor force:  740,000Top industry for unauthorized immigrants:  Leisure/hospitalityUnauthorized immigrant workforce:    10,000, New MexicoTotal labor force:  980,000Top industry for unauthorized immigrants:  ConstructionUnauthorized immigrant workforce:    45,000, New YorkTotal labor force:  10.12 millionTop industry for unauthorized immigrants:  Leisure/hospitalityUnauthorized immigrant workforce:    575,000, North CarolinaTotal labor force:  4.82 millionTop industry for unauthorized immigrants:  ConstructionUnauthorized immigrant workforce:  250,000, OklahomaTotal labor force:  1.83 millionTop industry for unauthorized immigrants:  ConstructionUnauthorized immigrant workforce:  65,000, Rhode IslandTotal labor force:  570,000Top industry for unauthorized immigrants:  ManufacturingUnauthorized immigrant workforce:  25,000, South CarolinaTotal labor force:  2.28 millionTop industry for unauthorized immigrants:  ConstructionUnauthorized immigrant workforce:   70,000, TennesseeTotal labor force:  3.14 millionTop industry for unauthorized immigrants:  ConstructionUnauthorized immigrant workforce:  90,000, TexasTotal labor force:  12.96 millionTop industry for unauthorized immigrants: ConstructionUnauthorized immigrant workforce: 1.15 million, UtahTotal labor force: 1.42 millionTop industry for unauthorized immigrants: Leisure/hospitalityUnauthorized immigrant workforce:   70,000, VirginaTotal labor force: 4.28 millionTop industry for unauthorized immigrants: ConstructionUnauthorized immigrant workforce: 220,000, WashingtonTotal labor force: 3.54 millionTop industry for unauthorized immigrants: AgricultureUnauthorized immigrant workforce: 170,000, WisconsinTotal labor force: 3.07 millionTop industry for unauthorized immigrants: ManufacturingUnauthorized immigrant workforce:   55,000, On tour promoting his presidential bid, former Texas Gov. Rick Perry is advocating a crack-down on so-called \"sanctuary cities\"places in the United States where local law enforcement dont scrutinize the immigration status of criminal suspects. On Thursday, Perry released a statement calling for blocks on certain federal grants and revocation of certain federal funding from sanctuary cities. Subsequent reports show hes taking his call to the campaign trail. \"Federal taxpayers shouldnt be forced to subsidize the irresponsible behavior of these governments,\" he said in a statement. A July 2015 analysis by the right-leaning think tank Center for Immigration Studies named just one Texas sanctuary: Travis County  home to Austin. Other voices, notably Perry before his previous presidential bid, put the label on Houston, where police department policy prohibits officers from inquiring on suspects immigration status. But it remains unclear just what constitutes a sanctuary city. On one far side of the spectrum are the jurisdictions that have denied federal Immigration and Customs Enforcement requests to turn over suspected illegal immigrants. An October 2014 release from the Department of Homeland Security said 270 jurisdictions had done so. On the other side is the State of Arizona, which in 2012 enacted legislation requiring police to check the immigration status of suspected illegal immigrants. The threshold of a sanctuary city lies somewhere between those two extremes. In March, state Sen. Charles Perry (R-Lubbock) introduced legislation reflective of Perrys pushit would have cut off certain state funding from local governments that adopted sanctuary city policies. And it mirrors the 2010 race for Texas governor, when Perry alleged that his democratic opponent, former Houston Mayor Bill White, ran a sanctuary in the Bayou City. But White, as well as current mayor Annise Parker, contested that claim. \"Houston is not a sanctuary city,\" Parker told the Texas Tribune in 2010. \"If you break a law in Houston, we will arrest you, we will take you to jail, and if youre in this country illegally, we will turn you over to the appropriate federal agency, generally ICE.\", In that way, Houston does not mesh with the American jurisdictions that decline to turn immigrants over to federal authorities. But Houston police are also forbidden from inquiring the immigration status of a suspect who has not yet been charged with a crime, a Houston Police Department spokesman said. Supporters of sanctuary city policies call them good for business, which in many states relies heavily on immigrant labor, and also allege that requiring local police to enforce federal immigration policy would encourage immigrants to hide from local police and not to come forward with crime reports. Opponents say holding non-citizens in U.S. jails puts an unfair burden on American taxpayers, clogs the immigration system for those pursuing a legal route to immigration and allows individuals with criminal records in other countries to wander freely and dangerously in the United States. Under Perrys proposal, sanctuary cities would lose federal State Criminal Alien Assistance Program, which helps cities cover the costs of jailing undocumented immigrants. States with sanctuary cities would also lost some SCAAP funding based on the number of sanctuary cities in their borders. He did not specify how a sanctuary city would be defined.]", "Date": "20150714", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/houston-texas/texas/article/Perry-proposes-cutting-federal-funding-to-6384247.php", "Title": "[Perry proposes cutting federal funding to sanctuary cities  like Houston, Austin?]"}