{"Content": "[ AUSTIN  Gov. Rick Perry has dipped into his campaign coffers to spend more than $1 million on an all-star roster of lawyers hired to defend him against a felony indictment alleging he abused his power last year, according to state data made public Thursday. The records detail for the first time just how much that legal dream team is costing Perry, who delivered a farewell speech Thursday and will officially leave office next week after 14 years as governor. He had originally used state taxpayer money to defend himself in the case, racking up at least $80,000 in legal expenses for one lawyer. But Perry eventually bowed to public pressure, changing course days after being indicted and announcing he would use his campaign account to pay his legal tab. According to state data, Perry spent upward of $1.1 million on \"legal defense\" since the last week of August. Nearly 40 percent of the legal fees  more than $455,000 went to the law firm of lead counsel Tony Buzbee, a well-known Houston attorney. The rest was divided among firms associated with attorneys Ben Ginbsberg, a lawyer involved in the 2000 presidential election recount; Tom Phillips, former chief justice of the Texas Supreme Court; Bobby Burchfield, general counsel for George H.W. Bushs presidential re-election campaign; and David Botsford, a prominent Austin lawyer who represented Perry during the grand jury process. Perry was indicted Aug. 15 on two felony charges stemming from his threat to veto funding for the state Public Integrity Unit unless Travis County District Attorney Rosemary Lehmberg resigned following a highly publicized drunk-driving conviction. Lehmberg, whose office houses the unit, refused to step down, and Perry carried through with the veto. Shortly after he was indicted, he hired a high-powered legal squad that helped amplify his argument that the case is a political witch hunt. A judge refused to dismiss the indictment on technical grounds in November. A ruling on Perrys effort to get the indictment tossed on constitutional issues is expected soon. Perrys new campaign finance report also shows his political account started collecting big contributions again. During the first half of the year, Perrys political action committee raised about $9,000, but in the last six months of 2014, it took in more than $376,000. Just three donors  all of them longtime Perry benefactors  were responsible for more than 93 percent of the latest haul. James Pitcock, chairman and CEO of Williams Brothers Construction, provided more than half the total, writing a $200,000 check for Perry in September. Peter Holt, owner of the San Antonio Spurs, gave Perry a combined $100,000. And Fort Worth billionaire Lee Bass chipped in $50,000. Perry spent $2 million during the period and reported cash-on-hand of $2.9 million. drauf@express-news.net, patrick.svitek@chron.com]", "Date": "20150116", "Author": "[By David Saleh Rauf and Patrick Svitek]", "Link": "http://www.chron.com/news/politics/texas/article/Perry-spends-1M-in-campaign-cash-fighting-6019154.php", "Title": "[Perry spends $1M in campaign cash fighting indictment]"}