{"Content": "[ Caption, Close, President Barack Obama delivered the State of the Union address on Tuesday night, where he discussed ways to bolster the middle class through various incentives and raising taxes on wealthier Americans. He also touched on his plan to provide free community college tuition to students who maintain certain academic standing. His full address can be seen here. U.S. Sen. Ted Cruz, R-Texas, posted an un-edited video of his response to Obamas address to YouTube on Tuesday night. The clip showed him delivering his response, stopping about forty seconds in and saying \"Eh, let me start over.\" The clip then cuts away and the Senator has another go at his un-scripted speech. The video was later removed and an edited version was posted, featuring only his second speech. The original clip can be seen here. U.S. Sen. Rand Paul, R-Ky. also issued a response to Obamas address, but shared much of his commentary onTwitter. Much of his frustration was dedicated to Obamas plan to offer free community college. His jabs at the presidents plan ranged from memes featuring Willy Wonka to posts like, \"Middle class economics? Wonder if youll learn about that in free community college?\" Pauls official response can be viewed here. Former Florida Gov. Jeb Bush - who has said he is exploring a 2016 presidential run - also shared his thoughts on Obamas address on Twitter. \"Its sad Pres. Obama wants to use the tax code to divide us. We need broad based tax reforms so everyone can rise up,\" He tweeted. Mitt Romney, the former Republican presidential nominee, took to Facebook following Obamas address, sharing a post that reads \"True to form, the President in his State of the Union speech is more interested in politics than in leadership....Rather than bridging the gap between the parties, he makes \"bridge to nowhere\" proposals. Disappointing. A missed opportunity to lead.\" His full post can be read here. Freshman U.S. Sen. Joni Ernst, R-Iowa, delivered the official Republican response to Obamas address Tuesday night. Ernst opened her speech by thanking Obama for sharing his ideas and then quickly shifting her focus to the newly elected, heavily Republican Congress and the various changes theyre planning to implement. \"We heard the message you sent in November loud and clear and now were getting to work to change the direction Washington has been taking our country,\" Ernst said. U.S. Sen.Lindsey Graham, R-S.C. (right) issued a statement following Obamas address. Graham, who has expressed interest in a presidential run in 2016, attacked Obamas domestic and foreign policies, calling him \"out of touch.\" His full statement can be read here. U.S. Rep. Curt Clawson, R-Fla. delivered the Tea Party response to the State of the Union address. Clawson provided a \"different vision\" than Obama for the nation. The speech focused on conservative ideals and Clawson emphasized local control over issues like education and healthcare. \"We need to get past the idea that Washington can solve all of our problems. Government and decisions must move closer to home.\" Clawsons full speech can be seen here. , U.S. Rep Carlos Curbelo, R-Fla. delivered a response to Obamas address in Spanish. Curbelos response was similar to Ernsts, but focused more on immigration. We should also work through the appropriate channels to create permanent solutions for our immigration system, to secure our borders, modernize legal immigration, and strengthen our economy,\" Curbelo said, as translated by Politico. Opting to deliver a script-less response to President Barack Obamas State of the Union address, Sen. Ted Cruz, R-Texas, delivered a brief, yet eloquent, response to the address before pausing and requesting a do-over. The clip, originally posted on his YouTube channel, shot around social media late Tuesday. Eh, let me start over, Cruz said, closing his eyes and stepping away from what appears to be an iPhone camera. The clip then cuts and Cruz returns to the center of the screen and delivers a different speech, with a similar opening line to his first take. Tonight, America saw a powerful demonstration that its time to move on beyond President Barack Obama, Cruz said. The unedited clip was deleted shortly after being posted and a new version was posted with the first attempt at a response cut out. The original clip can be seen here. The remainder of Cruzs remarks focused on things Obama did not say, including the phrase radical Islamic terrorism, which Cruz managed to say three times in his response. Cruz also said Obama failed to address the voters wants, as expressed in the midterm elections last year. \"Tonight, the president told American voters not only does he not hear their message, but he intends to do precisely the opposite, Cruz said. Cruzs sentiments were echoed by four other GOP responses, including Sen. Joni Ernst, R-Iowa, and Sen. Rand Paul, R-Kentucky. In addition to delivering a filmed (and scripted) response following the address, Paul spent most of the night sharing his thoughts about Obamas speech via twitter. Mr. President, you cant wave a magic wand and declare something free. Someone has to pay for it, Paul tweeted, voicing his distaste in Obamas plan to offer free community college tuition.]", "Date": "20150121", "Author": "[By Madlin Mekelburg]", "Link": "http://www.chron.com/news/politics/us/article/Ted-Cruz-shares-unedited-response-to-the-State-of-6029949.php", "Title": "[Ted Cruz shares unedited response to SOTU]"}