{"Content": "[ Caption, Close, FILE - In this July 27, 2015 file photo, Republican presidential candidate, former Florida Gov. Jeb Bush speaks in Orlando, Fla. The largest Florida corporate donor to a super political committee backing former Gov. Jeb Bushs presidential run is NextEra Energy, the company that owns electric utility giant Florida Power & Light. WASHINGTON (AP)  The largest Florida corporate donor to a super political action committee backing former Gov. Jeb Bushs presidential run is NextEra Energy Inc. the company that owns electric utility giant Florida Power & Light. Bush, a leading Republican contender, knows the company well. In 2009, more than two years after leaving office, he penned an opinion piece in the state capitals newspaper urging regulators to approve the utilitys proposed rate increase for Florida customers. \"With power, the cash registers open and close,\" Bush wrote in the op-ed, published in the Tallahassee Democrat. FP&L is the states largest electric utility, and NextEra operates in 26 other states and Canada. Now, NextEra is opening its own coffers to support Right to Rise, the super PAC formed to help Bushs bid for the presidency. The publicly traded, Fortune 200 company contributed more than $1 million to the group this year, according to newly available records  not including cash from its top executive to Bushs campaign. For Bush, NextEras contributions could raise questions about how the governors past support for the power company factored into its financial support and whether, as president, he would face conflicts should the company undergo federal regulatory scrutiny. Kristy Campbell, a Bush campaign spokeswoman, denied any conflict of interest in Bushs relationship with NextEra. \"As evidenced by his strong record in Florida, Gov. Bushs public service was always driven by what was in the best interests of his constituents, nothing else,\" Campbell said. \"As president, he would do the same.\", FP&L did not respond to requests for comment. Bushs most vocal support for FP&L came in November 2009, as the company sought a rate increase. Writing in the Tallahassee Democrat, Bush said it was the first time in a quarter century the company sought a basic rate increase  and he chided those he viewed as trying to block the raise. FP&L, he said, would use the rate increase to improve its operations, expand capacity, improve fuel efficiency and reduce emissions. Another company, Progress Energy, had a similar plan, he wrote. FP&L runs the Turkey Point nuclear plant near Miami. Bush called out the five-person Public Service Commission that would make the decision, calling the members \"de facto judges,\" and writing: \"Their job is to follow the law, not to impose their personal opinions about the merits of the proposed rate increase.\", In January 2010, the commission approved a basic rate increase for FP&L  a far cry from the record hike it sought. A state official called the decision a win for consumers. Failing to get the larger rate hike, the company said at the time it was halting billions of dollars in projects. The opinion piece was not the only time Bush supported the industry. In 2008, he wrote an op-ed for the Ocala Star-Banner, headlined: \"Nuclear power: a change for the better,\" and urged approval of three proposed nuclear plants in Florida. Those plants, and their operators, regularly undergo regulatory scrutiny  an issue that could surface should Bush ultimately win the White House. NextEras filings with the Securities and Exchange Commission describe some of those regulatory hurdles and their potential effect on the company. It said in December 2014 its business could be hurt by federal or state laws or regulations mandating new or additional limits on greenhouse gas emissions. It warned shareholders about significant costs to comply with environmental laws. The 2010 U.S. Supreme Court decision in the Citizens United case made it clear that corporations and unions can contribute in unlimited ways to political races, so long as that money comes through super PACs that are not directly coordinated with the candidates. Corporations and unions remain legally barred from giving directly to a candidates campaign. James Robo, NextEras chairman and chief executive, has personally contributed more than $30,000 to federal candidates since 2008, federal records show. His donations include $2,700 recently to Bushs campaign, as well as $6,600 to Arizona Sen. John McCains White House run in 2008. He also gave to Democrats, including $10,000 to a fund that helped President Barack Obamas re-election effort in 2012. The largest individual donor to Right to Rise is South Florida health care entrepreneur Miguel \"Mike\" Hernandez, who donated $3 million. Separately, more than two-dozen other companies with Florida addresses have contributed $100,000 or more to Right to Rise, records show. They include Southern Strategy Group, a Tallahassee lobbying firm that has long been close to Bush and had employed his former deputy campaign chief. Another $100,000 came from Peace River Products Inc. run by William \"Bill\" Becker, a longtime Bush family supporter. \"It seems whenever I am in touch with you,\" he wrote the governor in 2006, \"it is for a favor, and I hate to have to do so again.\", ", "Date": "20150805", "Author": "[Jack Gillum and Ronnie Greene, Associated Press]", "Link": "http://www.chron.com/business/energy/article/Pro-Bush-super-PAC-received-1M-from-Florida-6421050.php", "Title": "[Pro-Bush super PAC received $1M from Florida power company]"}