{"Content": "[ Caption, Close, President Barack Obama points to his ear as he talks about how some perceive education as just pouring information into your head as he speaks at a town hall with high school juniors, seniors and their parents at North High School in Des Moines, Monday, Sept. 14, 2015, to discuss college access and affordability. President Barack Obama, speaks at a town hall with high school juniors, seniors and their parents at North High School in Des Moines, Monday, Sept. 14, 2015, to discuss college access and affordability. President Barack Obama, accompanied by Pulitzer Prize winning Iowa writer Marilynne Robinson, arrives to the State Library of Iowa in the Ola Babcock Miller Building, Monday, Sept. 14, 2015, in Des Moines. Obama will sit down for an interview with Robinson which will appear in the New York Review of Books. While in Iowa, Obama is expected to officially announce a change to the college financial aid system. President Barack Obama hands of his coat as he walks to great people on the tarmac upon his arrival on Air Force One, Monday, Sept. 14, 2015, at the Des Moines International in Des Moines, Iowa. President Barack Obama, accompanied by Secretary of Education Arne Duncan, left, takes questions from the audience at a town hall with high school juniors, seniors and their parents at North High School in Des Moines, Monday, Sept. 14, 2015, to discuss college access and affordability and announce a change to the college financial aid system. DES MOINES, Iowa (AP)  President Barack Obama wont be on the ballot in 2016, but on Monday he showed hes looking for ways to put his imprint on the race to succeed him. On a visit to Iowa, the state that will have the first say in winnowing the presidential field, Obama drew sharp contrasts between Democratic policies and those of Republicans seeking to reclaim the White House. He was especially blistering on immigration, an emotional issue that has roiled the GOP. \"This whole anti-immigrant sentiment thats out there in our politics right now is contrary to who we are,\" Obama said during a town hall at Des Moines North High School. Officially, Obama came to Iowa to announce plans to let aspiring college students apply for federal financial aid earlier. But from the start of his question-and-answer session, it was clear the election was on his mind. \"I know you guys are all about to be flooded with ads and calls from a bunch of folks who want this job,\" Obama said in his opening remarks. He jokingly added, \"I just cant imagine what kind of person would put themselves through something like that.\", Asked by one participant for his views on the 2016 candidates education policies, Obama said he wouldnt tell anyone who to vote for  \"at least not right now; later I will.\", Still, he criticized congressional Republicans for wanting to keep broad domestic budget cuts in place and urged voters not to back candidates who blame teachers for problems in education, a slap at Republicans who have fought teachers unions, A young woman volunteering for Hillary Rodham Clinton, the Democratic front-runner, tried to pull Obama into his own partys primary fight. She asked the president whether he thought a proposal from Clintons top challenger, Vermont Sen. Bernie Sanders, to make education at public universities free was realistic. Without mentioning Sanders, Obama plugged his own proposal for free tuition at two-year community colleges. If that can be accomplished, Obama said, \"then I think we can start building from there.\", The presidents comments on immigration came in response to a student who asked whether young people in the U.S. illegally qualified for financial aid. Obama said the idea that young people brought to the U.S. illegally should not be welcome if they want to contribute to their communities makes no sense. Most Republicans running for president oppose providing a path to citizenship to those living in the U.S. illegally. Donald Trump, who has surged to the top of the GOP field, has said he wants to round up the millions of people here illegally and remove them from the country before allowing some to come back. The presidents trip was pegged to Education Secretary Arne Duncans annual back-to-school bus tour. If Obama had wanted to stay out of the campaign fray, however, he could have joined Duncan in one of the six other states the secretary is visiting. Instead, Obama chose Des Moines, the capital of a politically important state that sparks nostalgia for the president and his closest advisers. Iowa voters carried Obama to a surprise victory over Hillary Rodham Clinton in the 2008 Democratic caucuses. He returned to the state on the eve of the 2012 election for his final rally as a candidate, an emotional event that drew 20,000 supporters. Even in a state flooded with candidates seeking to carve out their own legacy, Obamas advisers know that a presidential visit  with the spectacle of an Air Force One arrival and a big motorcade speeding through the city  still garners attention. Republicans hoping to replace Obama certainly noticed. Florida Sen. Marco Rubio wrote an op-ed article in Mondays Des Moines Register about his own higher education plans, saying he would reform the college accreditation system and bring down tuition costs by allowing new schools to compete with traditional institutions. Rubio said Obamas education policies, including his proposal for free community college, only \"double-down on Washingtons failed strategy of spending more taxpayer money on the same outdated model.\", The president didnt meet with any presidential candidates while in Iowa. Still, he was joined by White House political strategy director David Simas, who typically joins Obama on travel involving campaign fundraisers or other overtly political events. For Obama, keeping a Democrat in the White House could be crucial to the longevity of many of the actions hes taken while in office. Stymied by Congress, hes wielded his executive power to implement changes to immigration and energy policies, among other issues. He also acted alone to re-establish diplomatic relations with Cuba and will leave the next president a non-binding nuclear agreement with Iran. By acting on his own authority so often, hes risked having many of his policies wiped away or reversed by a future president. Several candidates vying for the Republican nomination have vowed to pull out of the Iran deal, upend the Affordable Care Act and end some Obama immigration policies. Obama hasnt endorsed any of the Democratic contenders, though hes said Clinton  his former rival-turned ally  would make an excellent president. His spokesman has said the president feels the same about Vice President Joe Biden, who is weighing making a late entry into the race. ", "Date": "20150915", "Author": "[Julie Pace, Ap White House Correspondent]", "Link": "http://www.chron.com/news/article/In-Iowa-Obama-looks-to-leave-his-imprint-on-2016-6503958.php", "Title": "[In Iowa, Obama looks to leave his imprint on 2016 race]"}