{"Content": "[ Caption, Close, Republican presidential candidate Donald Trump listens during a news conference after speaking at the TD Convention Center, Thursday, Aug.  27, 2015, in Greenville, S.C. Republican presidential candidate Donald Trump greets supporters after speaking during a rally at the TD Convention Center, Thursday, Aug.  27, 2015, in Greenville, S.C. WASHINGTON (AP)  Donald Trump has exposed anew the deep rift inside the Republican Party on immigration, a break between its past and the countrys future that the party itself has said it must bridge if the GOP ever hopes to win back the White House. As they headed into the 2016 election, Republicans thought they had a strategy for moving past their immigration woes. Outlined in a so-called \"autopsy\" of 2012 nominee Mitt Romneys loss to President Barack Obama, it called for passing \"comprehensive immigration reform\"  shorthand for resolving the status of the estimated 11 million people living in the country illegally. Those plans ran aground in the GOP-controlled House, falling victim to the passionate opposition among conservatives to anything they deem \"amnesty\" for such immigrants. Some Republicans then hoped candidates with more moderate positions on immigration  such as Jeb Bush, the Spanish-speaking former Florida governor, or Sen. Marco Rubio, a Miami native and son of Cuban parents  would rise during the 2016 campaign and boost the partys appeal to Hispanic voters. Instead, its Trump  with his call to deport everyone living in the U.S. illegally and eliminate birthright citizenship  who has surged to the top of the summertime polls, reinforcing the lasting power of white, conservative voters who the GOP has courted for decades and continue to dominate the partys presidential primaries. \"Donald Trump is telling the truth and people dont always like that,\" Donald Kidd, a 73-year-old retired pipe welder from Mobile, Alabama, said at a weekend rally for Trump. Kidd added that Trump was \"like George Wallace,\" the former Alabama governor and presidential candidate known for his outspoken conservative rhetoric and segregationist views. Trumps growing support appears to have pushed some of his rivals to match his hard-line positions on immigration. Texas Sen. Ted Cruz and Wisconsin Gov. Scott Walker quickly echoed Trumps call for ending birthright citizenship. While Walker later backed off, Cruz has refused to join with those who criticized Trump after he called immigrants from Mexico rapists and criminals. On Thursday, Cruz and Trump announced plans to appear together at a rally next month in Washington. \"Other campaigns should look at incorporating what hes saying,\" said South Carolina Rep. Jeff Duncan, who represents the most Republican congressional district in the early-voting state. He said he doesnt know how Trumps proposals are playing with Hispanics, but said his message \"resonates with average Americans.\", Trump mixes his boasts on immigration, including his pledge to build a \"beautiful\" wall on the nations Southern border to stop illegal crossings, with talk about how hell focus on jobs if elected president, which would be a boon for minorities who endure higher rates of unemployment. But Ferrel Guillory, a longtime political observer at the University of North Carolina, said it is rhetoric that nonetheless \"signals to white voters, especially through the immigration issue.\", The billionaire businessman has frequently referred to his supporters as the \"silent majority,\" a phrase used by Richard Nixon as part of his \"Southern strategy\" to bolster support from working class white voters in the 1968 and 1972 elections. At a news conference in South Carolina on Thursday, Trump brushed aside questions about the terms loaded history. \"Im just bringing it to modern day,\" he said, arguing that his backers are \"a silent majority in this country that feels abused, that feels forgotten, that feels mistreated ... that wants the country to have victories again.\", For decades, Republicans sank their presidential hopes into winning over white working- and middle-class voters. But as the country grows increasingly diverse, winning the majority of white voters  which may yield victories in the GOP primaries  is no longer enough to power a candidate to success in the general election. That was the stark lesson for Republicans in 2012. GOP nominee Mitt Romney won 59 percent of the white vote in the general election, but garnered just 27 percent from Hispanics, 26 percent from Asians and 6 percent from black voters. It was the worst performance from a Republican candidate among Hispanic voters in a decade, and Obama swept every competitive state in the nation save North Carolina. Thats undoubtedly why Hillary Rodham Clinton, the front-runner for the Democratic nomination, has argued that theres little difference between Trump and the other GOP candidates on immigration. And why Bush, who is married to a Mexican woman and famously said Republican candidates for president must be willing to risk losing in the primaries if they hope to win in the general election, has been among his sharpest critics. \"Hes appealing to peoples angst and their anger,\" Bush said this week. \"I want to solve problems so we can fix this and turn immigration into what its always been  an economic driver for our country.\", ", "Date": "20150830", "Author": "[Julie Pace and Bill Barrow, Associated Press]", "Link": "http://www.chron.com/news/texas/article/Trump-proposals-risk-deepening-GOP-rift-on-6470703.php", "Title": "[Trump proposals risk deepening GOP rift on immigration]"}