{"Content": "[ Caption, Close, Ben Hall at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. Sylvester Turner at the Mayoral Forum focused on Arts and Culture on June 3, 2015 at the Asia Society Texas in Houston, TX. With less than four months to go before the general election, Houstons mayoral candidates have yet to go negative, but public rivalries have nonetheless begun to emerge as contenders jockey for the support of key portions of the electorate. Among them are Sylvester Turner and Ben Hall, who butted heads at a candidate forum Saturday over Turners tenure as a state representative. The two African-American candidates are vying for the support of black voters, who made up most of the audience event in Sunnyside, hosted by the Southeast Precinct Judges Council. African-American voters compose 27 percent of Houstons likely voters, according to recent polling. Turners and Halls back-and-forth began when Hall, mayoral runner-up in 2013, said the next mayor of Houstons biggest challenge would be to \"get rid of career politicians,\" as Turner, a 26-year state legislator, was sitting on his left. The conflict escalated after Turner touted his experience on the House Appropriations Committee in response to a question about city finances. \"Im the only one thats taken a $10 billion deficit in 2003 and balanced it, taken a $27 billion deficit in 2011 and balanced it,\" Turner said. \"When it comes to the budget, thats my area of expertise.\", Hall shot back. \"Sylvester, one thing I have to say my dear friend: You shouldnt take credit for things that you didnt do,\" he said. \"You are saying to this audience that you single-handedly balanced the state budget. With all due respect, theres a whole Appropriations Committee that deals with that.\", Later, Turner returned with a mini-tutorial on the legislative process: \"150 state representatives, 27 people on the Appropriations Committee. But there are only five that write the actual budget. I have been one of the five since 2003,\" Turner said. \"Sylvester, you made my point for me. It was not you alone,\" Hall responded. Their spat culminated in a fiery closing statement by Turner, who knocked Hall for the hypocrisy of criticizing career politicians while seeking the mayors office. \"Its not about how long youve been there. Its what youve done while you were there,\" Turner said. , ]", "Date": "20150720", "Author": "[By Rebecca Elliott]", "Link": "http://www.chron.com/politics/election/local/article/Tensions-flare-between-Turner-Hall-at-mayoral-6392795.php", "Title": "[Tensions flare between Turner, Hall at mayoral forum]"}