{"Content": "[ Caption, Close, Ed Sheeran recently revealed his latest tat, but hes hardly the first famous person to get inked.Keep clicking to see if you can guess the celebrity tatttoo. , Jennifer Lawrences tattoo could be seen at Comic-Con this year. Can you spot the mistake? At least she had it made very small. See if you can guess these other celebs by just their tattoos. Jennifer Lawrences tattoo could be seen at Comic-Con this year.... Dont cry Jennifer Lawrence. , Miley Cyrus. , Nicki Minaj, , Iggy Azalea, , Ryan Gosling, , Zoe Kravitz, , Lea Michele, , Emma Stone, , Marilyn Manson, , Stacey Dash, , Jenny McCarthy, , Zoe Saldana, , Charlize Theron, , Christina Applegate, , Johnny Depp, , Pauley Perrette, , Skylar Grey, Jordin Sparks, , , Billy Ray Cyrus, , Mel B, , Lena Dunham, , Sabina Kelley, , Carmen Carrera, , Megan Fox, , , Nicole Richie, , Adam Levine, , , Lil Wayne, , David Beckham, , , Angelina Jolie, , , Dwayne Johnson Tommy Lee, Tommy Lee Pamela Anderson, Pamela Anderson, Some guy just got a Jeb 4 Prez tattoo on his neck. And Jeb Bush helped out. ATTENTION! @JebBush!The Vine hit 1mil, so I had to do what we agreed on. Last night, I got a #Jeb4Prez neck tattoo. pic.twitter.com/5i3HzWQ7jF, The Pennsylvania man made a strange video on the social network Vine. He made an even odder promise for if the video reached 1 million views. The GOP candidate for president got wind of it. So Vic Berger had to follow through with his promise. If this Jeb Vine hits 1,000,000 loops by the end of the weekend, Ill get #Jeb4Prez tattooed on my neck. Please RT https://t.co/tOaczdT9OY, Id like to make Vic get a #Jeb4Prez tattoo. Hes halfway to 1mil, give this Vine a few views... https://t.co/iIGFSDB4Pm, The story took another unusual turn when a man claiming to be Bergers father said the tattoo stunt cost Vic his job. He said his son is mentally ill and even lashed out at Bush for encouraging the act. A reporter for Timesaid Bergers workplace, Turkey Hill grocery store, didnt employ anyone by that name. She also questioned the authenticity of the tattoo since no photos showed him under the needle. A fair question. Vic Berger didnt like it:, Hey, @mstanyabasu. Is THIS real enough for you?!? @TIME @JebBush pic.twitter.com/shRkoO4YJC, If the tattoo is authentic, Berger would not be the first man to get a face tattoo for a Republican candidate. In 2012, a man tattooed a Mitt Romney-Paul Ryan logo on his temple. An anonymous eBay user paid Eric Hartsburg $15,000 to get the tattoo. Hartsburg has since tried to get it removed by laser to mild success. Bergers tattoo is not even the worst viral tattoo of the week. See the worst celebrity tattoos in the gallery.]", "Date": "20150812", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/politics/election/article/Did-this-man-really-get-a-Jeb-4-Prez-tattoo-6440048.php", "Title": "[Did this man really get a 'Jeb 4 Prez' tattoo?]"}