{"Content": "[ Larry Downing/Reuters, The videos, even to one of Planned Parenthoods most ardent supporters, are disturbing. Tenof them have trickled out, one by one, since July. Each of the undercover videos, released as part of a \"sting\" operation byananti-abortion group called the Center for Medical Progress, has arguably provoked a more intense reaction than the last. Someshow executives and associates affiliated with the family-planning and womens health organization discussing the use of aborted fetuses for research. Another features a technician from a company that had partnered with Planned Parenthood and purchased aborted fetus parts recalling a moment in which she witnessed a fetus heart \"beating\" on an operating table. \"I would encourage every American to watch the videos,\" presidential candidate Sen. Ted Cruz (R-Texas) said in Wednesdays second Republican presidential debate on CNN. The issue has galvanized conservatives, like Cruz, into some of their most persistentactivism on the issue of abortion in some time. Conservatives accuse Planned Parenthood of harvesting and selling fetal body parts. Planned Parenthood has mounted a vehement public defense, insisting it has donenothing wrong and accusing its opponents of exaggerating claims in a years-long effort to derail the organization. Now, many Republicans  including a handful of presidential contenders  are pushing to cut off federal funding for the organization. Democrats and President Barack Obama defend the organization, pointing out that it provides an array of health services for women and that federal moneyfor Planned Parenthooddoesntfundabortion. However, defunding Planned Parenthood comes with a big catch: Funding for the organization is being tied to the legislative vehiclethat will keep the government from shutting down at the end of the month. Therein lies the debate within the Republican Party since its leaders desperately want to avoid a shutdown, given the damage to the partys brand from a 17-day shutdown two years ago. A good chunk of the Republican Partys rank and file still wants to de-fund the organization at all costs  even if it means a shutdown. Force President Barack Obamas hand, they argue, and make him veto the legislation that would simultaneously defund Planned Parenthood and prevent a government shutdown. That way the shutdown would be his fault. Time is of the essence; lawmakers are only scheduled to be in session for a handful of more days before the end of the month. There are several moving parts at play. House Speaker John Boehner (R-Ohio), with a bigger Republican majority in the House ever before in his tenure, is also facing perhaps the most angst among his conservative base. There are whispers that conservatives could try to remove Boehner from his post as speaker if he stands intheir way on Planned Parenthood. Larry Downing/Reuters, The intraparty feud has also spilled into the GOPpresidential race. Though every candidate agrees Planned Parenthood should be de-funded, there is broad disagreement on a strategy. And severalprominent presidential candidates are backing up the GOPs rank and file. Former Hewlett Packard CEO Carly Fiorina drew perhaps the debates most raucous applause Wednesday nightfor her answer on Planned Parenthood. Her comments came as the squabble was on full display. Ohio Gov. John Kasich (R), who served in Congress for nearly two decades, said any Republican attempt to de-fund the organization would be fruitless. Fiorina disagreed. \"I dare Hillary Clinton, Barack Obama to watch these tapes. Watch a fully formed fetus on the table, its heart beating, its legs kicking while someone says we have to keep it alive to harvest its brain,\" she said. \"This is about the character of our nation, and if we will not stand up in and force President Obama to veto this bill, shame on us.\", Fiorinas comments were later ruled \"misleading\" by multiple fact checkers.The scene she described never explicitly happened in any of the videos. (In one video, a technician describes another technician calling herover to see a fetus with a still-beating heart. There was no indication its brain was about to be removed, as The New York Times noted.), The fact that her comments were misleading didnt stop her from getting the biggest applause of the night. \"Carly Fiorina just won the Planned Parenthood exchange, even stealing Ted Cruzs thunder,\" said Erick Erickson, a prominent conservative activist and the editor in chief of the conservative website RedState. Larry Downing/Reuters, Depending on whom you ask and what you read, youll see two distinct sides and opinions that form over the significance of the videos, what they show, and what should be done about them. At the heart of the issue is a key ethical question:, Should the remains of aborted fetuses be used for medical research?, To the Center for Medical Progress, which has revealed 12 conversations between an undercover agent and officials or associates of Planned Parenthood in the 10 videos, the seriesreveals the \"barbaric abortion practice\" Planned Parenthood employs. The Center, which opposes abortion, had undercover actors pose as buyers for companies that procure fetal tissue for medical researchers.The videos include, for example, secretly recorded lunches with Planned Parenthood executives. The actors also traveled to either Planned Parenthood clinics themselves or clinics where companies had partnered with the organization. The CMP accuses Planned Parenthood of \"harvesting\" and selling body parts from \"living, fully-formed fetuses,\" and they allege the videos show such discussions taking place. Planned Parenthood denies \"selling\" fetal body parts and says it is acting within the law, only charging researchers enough to cover the costs of maintaining and transporting the fetal body parts. \"A lot of people are realizing that the out-of-sight, out-of-mind mantra about their barbaric abortion practice that propelled Planned Parenthood for so long is now forever gone,\" David Daleiden, the founder of the CMP, told Business Insider. \"The PR spin of their highly-paid executives and political consultants falls flat compared to the frank admissions of their top-level Medical Directors that they use illegal partial-birth abortion procedures to harvest body parts from living, fully-formed fetuses.\", Planned Parenthood Federation of America President Cecile Richards has apologized for the \"tone\" of at least one of her staff that appears in one of the videos. But the organization has mounted a proactive public defense against the CMP, accusing it of \"deceptive editing\" of the videos and attacking the character of Daleiden and others who have formed the CMP. Planned Parenthoods latest forceful defense came Thursday, when its executive vice president accused Fiorina of lying. \"I am writing to tell you directly that your claims are completely false and that the video footage you described simply does not exist,\" wrote Dawn Laguens in a letter published on Medium.\"Literally, there is no such scene on any of the heavily edited, widely discredited videos that have been released by anti-abortion extremists.\", Larry Downing/Reuters, But the videos do contain several moments that have raised controversy. Even Democratic presidential front-runner Hillary Clinton, who has defended Planned Parenthood in the wake of the assault, has called some elements of them\"disturbing.\", In the first video, for example, Deborah Nucatola, the senior director of medical services for Planned Parenthood, appears to suggest that some doctors will alter procedures when performing abortions if they know a potential buyer is interested in tissue remains. In a subsequent video, Dr. Mary Gatter, the president of the Planned Parenthood Medical Directors Council, discusseswith the CMP actors price ranges for \"intact tissue.\", Heres a partial transcript of their conversation:, GATTER: I dont want to play games. I just dont want to low-ball. CMP actor: You know what? If you low-ball, Ill act pleasantly surprised, and youll know its a low-ball. What I want to know is, what would work for you?, GATTER: $75 a specimen. CMP ACTOR: Oh. Thats way too low. And really, thats way too low. I want to keep you happy. GATTER: I was going to say $50. Ive been places that did $50, too. But see, we dont, were not in it for the money. We dont want to be in the position of being accused of selling tissue and stuff like that. On the other hand there are costs associated with the use of our space. The release of the videos, which first emerged in late July, spawned the immediate trigger of congressional investigations. Before it left for a month-long recess, the Senate voted on a bill to de-fund Planned Parenthood.It failed, as Senate Democrats blocked it from advancing beyond a procedural hurdle. Meanwhile, conservatives were ramping up the charge to attach Planned Parenthood funding to the vehicle to keep the government funded. Larry Downing/Reuters, The star in this congressional drama, once again, is Ted Cruz. The firebrand freshman senator, who joined forces with a group of House conservatives to push federal government intoa 2013 shutdown over the Affordable Care Act, is again leading Republicans down a path toward shutdown. \"Absolutely we shouldnt be sending $500 million of taxpayer money to funding an ongoing criminal enterprise, and Ill tell you, the fact that Republican leadership in both houses has begun this discussion by preemptively surrendering to Barack Obama and saying, Wellgive in because Obama threatens a veto,\" Cruz said Wednesday night. \"You know, Obamas committed to his principles. His liberal principles, he will fight for them. He says, I will veto any budget that doesnt fund Planned Parenthood, and Republicans surrender. We need to stop surrendering and start standingfor our principles.\", It looks, sometimes frame for frame, like a replay of the 2013 shutdown fight. At least 28 House Republicans have said they will not vote for a government-funding bill that does not de-fund Planned Parenthood, right around the limit of defections Boehner can afford to pass a bill with only Democratic support. Theyre being urged on by the conservative base, as well as the Center for Medical Progress. \"Americans are outraged at the fraudulent way Planned Parenthood holds itself out as a mainstream health care provider while trafficking in baby parts. All of our elected representatives should commit to holding Planned Parenthood accountable for its crimes,\" Daleiden, the founder of the CMP told Business Insider. It comes as Boehner faces perhaps the most passionate challenge to his speakership. Both of the Republicans who represent viable alternatives to Boehner as speaker  House Majority Leader Kevin McCarthy (R-California) and Rep. Paul Ryan (R-Wisconsin), the chair of the House Ways and Means Committee, said this weekthey back Boehner. But there is no end game yet for the House. And in the end, Boehner might face an all-too-recurring dilemma. Should he try to pass a bill with Democratic support and risk a real challenge to his leadership, or plunge the government into a self-inflicted wound?, \"A variety of options under consideration, no decisions at this point,\" a House leadership aide told Business Insider. Another Republican aide, when asked how the fight will end, responded to Business Insider with a \"\\\\_()_/,\" an emoticon, commonly referred to as a \"shruggie,\" that signals a shrug. Larry Downing/Reuters, In the Senate, meanwhile, Majority Leader Mitch McConnell (R-Kentucky) has been insistent that he will not allow a replay of 2013s shutdown. He has prominent lieutenants  including Sen. Kelly Ayotte (R-New Hampshire), who is up for re-election in 2016. Ayotte sent a letter to Cruz on Thursday that challenged him to explain how a funding fight ends with Republicans coming out on top. She bitingly saidshe opposes a shutdown, \"particularly when it appears there is no chance of achieving a successful result.\", Ayotte pointed to the fact that Republicans could only muster 53 votes to de-fund Planned Parenthood in August. With 60 votes needed to advance any bill beyond a key procedural hurdle, Ayotte questioned how Cruz sees Republicans getting to that number  let alone 67 votes in the certain event of a presidential veto. \"During the last government shutdown, I repeatedly asked you what your strategy for success was when we did not have the votes to achieve the goal of de-funding Obamacare, but I did not receive an answer,\" Ayotte wrote. \"I am again asking this question and would appreciate you sharing your strategy for success with all of us before any damaging government shutdown becomes imminent.\", For their part, Democrats and the White House appear unified. House Minority Leader Nancy Pelosi (D-California) and Senate Minority Leader Harry Reid (D-Nevada) met with Obama at the White House on Thursday for about 90 minutes. Reid said they agreed to support a short-term bill to keep the government funded for a matter of months, as long as spending for domestic and defense priorities are increased at equal levels. One Senate Democratic aide guessed an end result: After Republicans are unable to garner enough support for a continuing-resolution to keep the government funded that also de-funds Planned Parenthood, McConnell would bring forward a \"clean\" bill with no such Planned Parenthood rider. But whether the House would follow up by supporting such legislation is still unclear. And it would only punt the shutdown debate to later in the year, in the thick of the Republican presidential primary. \"Republicans are better punters than Shane Lechler,\" the Democratic aide said, referring to the legendary NFL punter. Join the conversation about this story , NOW WATCH: Fashion designer Nicole Miller reveals what Donald Trump is really like, See Also:, SEE ALSO:Carly Fiorina just gave an answer thats making conservatives go crazy]", "Date": "20150920", "Author": "[Brett LoGiurato, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/A-controversial-video-is-roiling-the-abortion-6391312.php", "Title": "[A lot of Republicans want to shut down the government over 10 'undercover' videos]"}