{"Content": "[ Caption, Close, FILE - In this Sept. 22, 2010 file photo, Mary Beth Kelly poses for a photo in her office in Detroit. Michigan Supreme Court Justice Mary Beth Kelly announced Monday, Aug. 17, 2015, she will leave the bench early for private practice with more than three years left in her term. The 53-year-old Kellys surprise departure will take effect Oct. 1. She is among five Republican nominees on the seven-member court. FILE -  In this Nov. 2, 2010 file photo, Michigan Gov. elect Rick Snyder, right, and Michigan Supreme Court justice-elect Mary Beth Kelly wave at supporters at the GOP party in Detroit. Michigan Supreme Court Justice Mary Beth Kelly announced Monday, Aug. 17, 2015 she will leave the bench early for private practice with more than three years left in her term. The 53-year-old Kellys surprise departure will take effect Oct. 1. She is among five Republican nominees on the seven-member court. LANSING, Mich. (AP)  Michigan Supreme Court Justice Mary Beth Kelly announced Monday she will leave the bench early for private practice with more than three years left in her term. The 53-year-old Kellys surprise departure will take effect Oct. 1. She is among five Republican nominees on the seven-member court. \"I am grateful for the opportunity to have served on our states highest court,\" Kelly said in a statement. \"I leave the Supreme Court knowing that our judicial system is better equipped to help families and children.\", Kelly won election to an eight-year term in 2010. GOP Gov. Rick Snyder will name her successor, who will serve through next year but could run in November 2016 to finish the remainder of Kellys term through 2018. She wrote the courts first ruling on Michigans medical marijuana law, laying out a set of rules to guide patients, prosecutors, defense lawyers and judges. Kelly also cast the crucial vote ordering the state election board to put a referendum of an emergency manager law on the ballot. Among her notable dissents was when she broke with other GOP justices who said hundreds of prisoners automatically sentenced to life behind bars for murder as teens were not entitled to a new day in court. And last month, she dissented when the court ruled that state employees cannot be forced to pay labor unions for negotiating contracts and other services. Kelly said a 2012 right-to-work law should not apply to state workers under the state constitution. \"Justice Kelly has written important opinions and made her presence felt on this bench,\" Chief Justice Robert Young Jr. said in a statement. \"In particular, my colleagues and I have appreciated the experience and insights she brought from leading the states largest circuit court.\", Kelly will join Bodmans Detroit office and become vice chairwoman of the firms litigation and alternative dispute resolution practice group. She said she achieved her public service objectives and returning to private practice will \"open many community service opportunities that I could not pursue as a Supreme Court justice.\", Kelly was a Wayne County circuit judge from 1999-2010 and is the only woman to serve as chief judge of that court. She previously was a commercial litigation partner with Dickinson Wright in Detroit after graduating from the Notre Dame Law School. She is the Supreme Courts liaison for substance abuse and veterans courts. In January, Snyder appointed her to a 15-member committee that advises him on juvenile justice issues. Kellys resignation means Snyder will make his third appointment to the high court. His first two appointments, Brian Zahra and David Viviano, have since been elected to their posts. ", "Date": "20150817", "Author": "[David Eggert, Associated Press]", "Link": "http://www.chron.com/news/article/Justice-Kelly-leaving-Michigan-Supreme-Court-early-6448558.php", "Title": "[Justice Kelly leaving Michigan Supreme Court 3 years early]"}