{"Content": "[ Caption, Close, , VATICAN CITY, VATICAN - DECEMBER 17:  Pope Francis arrives in St. Peters Square for the weekly audience on December 17, 2014 in Vatican City, Vatican. There was a festive atmosphere at the weekly General Audience on Wednesday in St. Peters Square, as Pope Francis celebrated his 78th birthday. Pope Francis has asked for prayers for the terror victims this week in Sydney, Australia and in Peshawar, Pakistan.  (Photo by Franco Origlia/Getty Images), VATICAN CITY, VATICAN - DECEMBER 17: Pope Francis arrives in St.... Rear Adm. Margaret G. Kibben became the first female chief of Navy chaplains in 2014.  DOD photo by EJ Hersom -, Pope Francis greets the crowd during the audience to the Vatican employees, on December 22, 2014. In the Paul VI hall at the Vatican  AFP PHOTO / ANDREAS SOLAROANDREAS SOLARO/AFP/Getty Images, Pope Francis is named the top Religion Newsmaker of the Year. Pope Francis, right, kisses a child during a meeting with faithful of Pope John XXIII Community in the Paul VI hall at the Vatican, Saturday, Dec. 20, 2014. (AP Photo/Gregorio Borgia), Pope Francis prays at the end of his weekly general audience in St. Peters Square at the Vatican, Wednesday, Dec. 17, 2014. (AP Photo/Alessandra Tarantino), Names that made news in 2014:,   Pope Francis is named the top Religion Newsmaker of the Year for the second year in a row by the Religion Newswriters Association. The group noted that the pope continues to draw both worldwide admiration and consternation for his efforts toward inclusiveness, including outreach to the needy and people of other faiths.    German Bishop Franz-Peter Tebartz-van Elst, whose $43 million housing renovation earned him the unwelcome nickname \"Bishop Bling,\" was fired by Pope Francis.   The Rev. Libby Lane was appointed the first female bishop in the Church of England, just weeks after church authorities took the final step to reverse centuries of canon law. She will be consecrated on Jan. 26.   Retired Episcopal Bishop V. Gene Robinson, whose election as the first openly gay bishop ruptured the Anglican Communion, announced his divorce from his husband, Mark Andrew.  Popes John Paul II and John XXIII were proclaimed saints by Pope Francis, and Pope Paul VI was beatified.   Sudanese Christian Meriam Ibrahim was finally freed after nearly being executed for apostasy, becoming an icon for many Christians.   Mormon feminist Kate Kelly was excommunicated for advocating for women in the priesthood.   Rear Adm. Margaret G. Kibben became the first female chief of Navy chaplains.   Rabbi David Saperstein was confirmed as the first non-Christian U.S. ambassador-at-large for international religious freedom.   Blase Cupich was installed as the new archbishop of Chicago, Pope Francis first major appointment to the U.S. hierarchy.   Washington, D.C. pastor Amy Butler became the first woman named senior pastor of New Yorks storied Riverside Church.   Seven years after officiating at the wedding of his gay son, the Rev. Frank Schaefer was reinstated as a clergyman in the United Methodist Church. He had been defrocked in 2013.   Washington, D.C. Rabbi Barry Freundel was fired after allegedly installing a hidden camera in the mikvah, or ritual bath, used by women at his prominent Georgetown synagogue.   Seattle megachurch pastor Mark Driscoll resigned from Mars Hill Church after facing a series of allegations involving plagiarism, bullying and an unhealthy ego.   Conservative activist Bill Gothard, an advocate of home-schooling, modest attire and large families, resigned after a series of abuse allegations.   Filmmaker Roma Downey cut Satan from her biblical epic \"Son of God\" after some viewers pointed out that the actor playing Satan looked too much like President Barack Obama.   Kentucky pastor Jamie Coots, a Pentecostal snake-handler and star of the reality show \"Snake Salvation,\" died of a snakebite at 42.  Westboro Baptist Church founder Fred Phelps, infamous for his \"God Hates Fags\" rallies, died at 84.]", "Date": "20141224", "Author": "[By Kevin Eckstrom, Religion News Service]", "Link": "http://www.chron.com/life/houston-belief/article/Names-that-made-religion-news-in-2014-5978153.php", "Title": "[Names that made religion news in 2014]"}