{"Content": "[ Caption, Close, This book cover image released by Broadside books, \"A Time for Truth: Reigniting the Miracle of America,\" by Sen. Ted Cruz, R-Texas. The book was released on June 30. (AP Photo/Broadside), Hillary Clinton, Democratic presidential hopeful and former Secretary of State  NORWALK, IA - APRIL 15:  Democratic presidential hopeful and former Secretary of State Hillary Clinton looks on during a roundtable discussion with members of the small business community at Capital City Fruit on April 15, 2015 in Norwalk, Iowa. Hillary Clinton continues to campaign throughout Iowa as she makes her second bid for President of the United States.  (Photo by Justin Sullivan/Getty Images)    , They like to say they dont pay attention to the polls, so how do we know which Republican presidential candidate Texans really love the most?, Based on contributions to their presidential campaigns, U.S. Sen. Ted Cruz is the runway winner for the affections of individual Texas donors, those who have given less than the maximum $2,700 allowed for the 2016 primary. In that category (not counting the big cigars who give unlimited mega-dollars to their associated Super PACs) Cruz pulled in more than $5.7 million from individual Texans. Former Florida Gov. Jeb Bush, despite his long family roots in Texas, collected just under $1.2 million in the Lone Star State, according to Federal Election Commission reports filed last week. Third in the native son bracket was former Texas Gov. Rick Perry, who gathered in $626,024 from his fellow Texans. Rounding out the field was Kentucky U.S. Sen. Rand Paul, who grew up in Lake Jackson and attended Baylor. His campaign raised $409,072 in Texas. The results roughly approximate a June University of Texas poll showing Cruz out ahead of the pack among likely Republican voters in the state. (Cruz 20 percent; Perry 12 percent; Bush 7 percent; Paul 6 percent), Interestingly, Perrys best state outside Texas was California, from where, as governor, he famously encouraged businesses to move as Texas. Perry has raised $218,625 in California. California was Pauls top state, sending his campaign $425,909, more than he took in in either Texas or Kentucky. Bushs best state, not surprisingly, was Florida, where he raked in more than $2.5 million. Then theres this interesting factoid: Democratic contender Hillary Rodham Clinton has raised a little more than $2 million in Texas, more than all the Republican hopefuls except Cruz.]", "Date": "20150720", "Author": "[By Kevin Diaz]", "Link": "http://www.chron.com/news/politics/article/Ted-Cruz-tops-the-field-for-small-dollar-6395622.php", "Title": "[Ted Cruz tops the field for 'small dollar' contributions from Texas - Hillary is second]"}