{"Content": "[ Caption, Close, Baby Iris was born with hearing loss and requires hearing aids. Who would consider the $6,000 devices a luxury?, Updated resolutions are placed on empty desks in the House. Its a particularly stressful time at work. A major deadline is looming, youre drowning in piles of paperwork and lots of people are paying attention. You have every intention of finishing the job you were hired to do - you know that people are counting on you. But between an inability of the team to effectively collaborate and the sheer power of time, the work just doesnt get done. So, when the clock strikes midnight, you get up from your desk, throw all of the unfinished work in the trash and go on a two-year hiatus. This is how the Texas Legislature works. Or doesnt. Democrats try to block Republicans from getting what they want, Republicans try to block Democrats from getting what they want, and in the end, Texans get little of what they need. Sandwiched between the big, divisive, hot-button, political issues are lots of little bills that could actually do some good - that could actually help people. These are the bills that get lost in the mix, bills that never get the chance to be heard, bills that die on the floor of the Texas House and Senate. For our family, it was the Hearing Aid for Children Coverage Act, or HB 2979, that would have required insurance companies to cover the cost of hearing aids for children under the age of 18. They are currently considered \"cosmetic\" - not medically necessary and, therefore, not covered by health insurance - and cost approximately $6,000 out of pocket every three to five years. In many cases, hearing loss is genetic, so many families have multiple children in hearing aids. The financial burden is heavy. For the parent of a child with hearing loss, this $6,000 bill is not optional. All the medical experts agree that with early intervention - namely, hearing aids and speech therapy - a child with hearing loss has the opportunity to live a life no different than a typical hearing child. My daughter, Iris, is living proof. Thanks to two separate grants from The Center for Hearing and Speech, Iris started speech therapy as a five week-old newborn and was fitted for her first pair of hearing aids at the age of six weeks. Now, at 16 months, she is a curious, lively and extremely talkative little person. We credit her success first and foremost with her ability to hear. How could hearing possibly be considered a luxury for those who can afford it?, Everyone seems to agree that this notion is nonsensical and counterintuitive. Because hearing loss is relatively rare, affecting only two to three babies out of every 1,000, most people simply dont realize that insurance companies in Texas arent required to pay for hearing aids. They just assume they do. Twenty states have passed legislation requiring insurance companies to cover them. Texas should join them, and thats the fight we were waging in Austin. Most of the representatives and legislative aides with whom I made contact in recent weeks agreed that the bill was \"good.\" Houston representative Sarah Davis, a Republican, was particularly supportive and encouraging. Unfortunately, the goodness (or badness) of a bill has very little to do with whether or not it gets passed. The Texas Academy of Audiology, which sponsored our bill, tried to pass a similar bill during the 2013 legislative session. It never made it past the Insurance Committee, which is the first step of this process. In order to build momentum and ensure that the bill would make it to the House for a vote this time around, a motivated group of parents made it our mission to spread awareness about the bill via social media, online petitions and various other media outlets. Family and friends near and far started calling and writing their representatives on our behalf, and it actually seemed to make an impact. We got word at nearly midnight on Monday, May 11, that the Insurance Committee unanimously voted to push the bill through to the next critical step of the legislative process: the Calendars Committee. Calendars would prove to be a huge hurdle - this is where many bills go to die. However, supporters told us that if we had the votes in the Insurance Committee, we would most likely have support in the House. They tend to follow suit, especially when theres virtually no opposition to a bill. While reassuring, we were aware of the time crunch. With the deadline looming for House action on bills that were generated in that chamber, if it didnt pass, we would have to wait another two years to try again. The reality of how laws are made came into stark relief: These small committees - specifically, the chairs of these small committees - have far more to do with the fate of a bill than the makeup of the legislative chambers or who is governor. Everyone puts stock in the big elections for president or governor, but local elections are where the real power lies. Its a shame that no one really shows up for those. All the phone calls in the world dont stand a chance if the chairman of the Calendars Committee - for the 84th Legislature it was Todd Hunter, a Corpus Christi Republican - doesnt deem it worthy to set on the House calendar. The Calendars chairman has an extraordinary and shocking amount of power. We found out on Tuesday night, May 12, that our bill had been officially set on the House Calendar for Thursday, the last possible day for votes on House-generated bills. I felt like wed won the lottery - it was that exciting. I remember saying to my husband, \"This is going to happen!\", In hindsight, this was incredibly naive. On average, I hear it takes six years - three legislative sessions - to pass a bill, and now I see why. The calendar is unreliable. Bills that arent heard on their scheduled day just keep getting pushed back to the following day and piling up. Getting onto the House calendar the last day essentially means youre not on the calendar. Thursday morning, May 14, the lobbyist we were working with emailed with the news that there were 290 bills on the calendar for the day, and ours was 264th on the list. One of the legislative aides who had been keeping me in the loop said it would take a miracle for the House to get to our bill before midnight and that there was absolutely nothing we could do about it. Calling, emailing, showing up at the Capitol in person - nothing would make a difference at this point. We werent up against people; we were up against the clock. I stopped watching the live stream around 9 p.m. that Thursday night. By this point, the House was still hearing \"overflow\" bills from the day before and hadnt even gotten to those that were originally scheduled for Thursday. It was a loss and a real shame, but certainly not a defeat. Maybe Im still naive; maybe I just care deeply about my kid and others like her. Either way, we plan to start the process all over again in January 2017 when the House reconvenes. Until then, I will show up at the polls to vote for my local representatives and urge others to do the same. Our parent group plans to take the next two years to regroup, spread awareness and find a Senate companion for the bill. Hopefully, third times a charm. In the meantime, as the Legislature prepares to adjourn tomorrow, we are left wondering: What kind of state government takes six years to pass a law that would require insurance companies to pay for kids hearing aids? , Ours. , Wittels is a Houston resident.]", "Date": "20150601", "Author": "[By Stephanie Wittels Wachs]", "Link": "http://www.chron.com/opinion/outlook/article/Wittels-Texas-Legislature-puts-process-politics-6295733.php", "Title": "[Wachs: Texas Legislature puts process, politics ahead of kids' needs]"}