{"Content": "[ Caption, Close, State Supreme Court Chief Justice Tani Cantil-Sakauye, Justice Goodwin Liu,  in an opinion endorsing the courts order, said allowing an advisory  measure on the ballot \"blurs accountability for legislative choices.\", Chief Justice Tani Cantil-Sakauye cast the lone dissenting vote. She  said lawmakers had placed an advisory measure on the ballot once before -  in 1892, backing the direct election of U.S. senators - and said Prop  49 was a legitimate effort to let lawmakers know \"where the voters stand  on theissue.\", The state Supreme Court has removed from the November ballot a measure calling for a constitutional amendment to overturn Citizens United, the U.S. Supreme Court ruling that allowed unlimited corporate spending in federal elections. The measure, Proposition 49, was placed on the ballot by Democrats who control both houses of the Legislature. If approved by the voters, it would have asked Congress to submit a constitutional amendment to the states that would authorize federal lawmakers to limit campaign spending and would specify that only people, not corporations, have the right of political free speech. A lawsuit by the conservative Howard Jarvis Taxpayers Association argued that Prop. 49 was invalid because it was only an advisory measure that would not change state law. On Monday, five of the six justices signed an order striking the measure from the Nov. 4 ballot and expressing doubt about whether California voters, who have the power to enact state laws, can consider questions that are purely advisory. Prop. 49s \"validity is uncertain,\" the justices said, and \"substantial harm can occur if an invalid measure is permitted to remain on the ballot.\" They said they couldnt decide the issue by November, but could have it resolved in time for the next statewide elections in 2016. Chief Justice Tani Cantil-Sakauye cast the lone dissenting vote. She said lawmakers had placed an advisory measure on the ballot once before - in 1892, backing the direct election of U.S. senators - and said Prop 49 was a legitimate effort to let lawmakers know \"where the voters stand on the issue.\", But Justice Goodwin Liu, in an opinion endorsing the courts order, said allowing an advisory measure on the ballot \"blurs accountability for legislative choices.\" He noted that the court had removed an initiative from the ballot in 1984 because it merely asked Congress to draft a constitutional amendment requiring a balanced federal budget. In the 2010 Citizens United ruling, a 5-4 majority of the nations high court said federal laws that limit spending by corporations or labor unions on political causes violate freedom of speech. The ruling affected only spending by independent political organizations and preserved limits on contributions to individual candidates. Earlier this year, the California Legislature passed a resolution calling for a national constitutional convention to draft an amendment that would overturn the ruling. Prop. 49, approved by the same state lawmakers, would ask Congress to adopt such an amendment and submit it to the states. Jon Coupal, president of the Jarvis organization - named for the sponsor of the Prop. 13 tax cut of 1978 - said Monday that Prop. 49 was a glorified opinion poll that would damage the electoral process. \"In an era where voter turnout in California is at an all-time low, why would we want to do something that fosters the notion that votes are meaningless?\" he asked. Derek Cressman, spokesman for the Prop. 49 campaign, countered that the court had \"canceled an election that (was) meant to check and balance the judicial branch,\" which issued the Citizens United ruling. \"Its pretty chilling.\", The case is Howard Jarvis Taxpayers Association vs. Bowen, S220289. Bob Egelko is a San Francisco Chronicle staff writer. E-mail: begelko@sfchronicle.com Twitter: @egelko]", "Date": "20140812", "Author": "[By Bob Egelko]", "Link": "http://www.chron.com/politics/article/State-Supreme-Court-yanks-Citizens-United-measure-5682420.php", "Title": "[State Supreme Court yanks Citizens United measure from ballot]"}