{"Content": "[Add former Arkansas Gov. Mike Huckabee (R) too the long list of critics of President Barack Obamas speech on religion last week. Huckabee, a likely 2016 presidential candidate, even accused Obama on Monday of supporting radical Islam by refusing to specifically condemn it in his speech. \"Everything he does is against what Christians stand for, and hes against the Jews in Israel,\" Huckabee said on Fox News, according to video posted by Mediaite. \"The one group of people that can know they have his undying, unfailing support would be the Muslim community. And it doesnt matter if its the radical Muslim community.\", Huckabee was reacting to Obamas address last Wednesday to the National Prayer Breakfast in Washington. In the speech, Obama told Christians they should not be arrogant, and he compared violent terrorists in the Middle East to those who carried out the Crusades and the Inquisition. \"Unless we get on our high horse and think this is unique to some other place, remember that during the Crusades and the Inquisition, people committed terrible deeds in the name of Christ,\" Obama said. \"And in our home country, slavery, and Jim Crow, all too often was justified in the name of Christ.\", But Huckabee insisted Obama had his US history mixed up. The former governor noted many Christians led the fight to end slavery and racist Jim Crow laws. \"I think hes forgetting that it was the Christian movement, led by the Rev. Dr. Martin Luther King Jr. who resisted racism,\" Huckabee said. \"And many of the most staunch voters that helped to bring this country in a whole new understanding of racial justicewere voices from the pulpits. The same thing with slavery.\", Join the conversation about this story , NOW WATCH: 11 Facts That Show How Different Russia Is From The Rest Of The World, See Also:]", "Date": "20150209", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/technology/businessinsider/article/A-2016-contender-just-said-everything-Obama-does-6070823.php", "Title": "[A 2016 contender just said everything Obama does 'is against what Christians stand for']"}