{"Content": "[ Caption, Close, U.S. Marines raise the U.S. flag over the newly reopened embassy in Havana, Cuba. Friday, Aug. 14, 2015. U.S. Secretary of State John Kerry traveled to the Cuban capital to raise the U.S. flag and formally reopen the long-closed U.S. Embassy. Cuba and U.S. officially restored diplomatic relations July 20, as part of efforts to normalize ties between the former Cold War foes. A crowd waits behind barrier with a draped Cuban national flag, near the newly opened U.S. Embassy, to catch a glimpse of the flag raising ceremony, in Havana, Cuba, Friday, Aug. 14, 2015. U.S. Secretary of State John Kerry arrived Friday morning in Havana for the historic ceremony to raise the U.S. flag over the restored embassy in the Cuban capital. A worker wipes a representation of the The Great Seal of the United States at the newly opened U.S. Embassy in Havana, Cuba, Friday, Aug. 14, 2015. Secretary of State John Kerry arrived Friday morning in Havana for an historic ceremony to raise the U.S. flag over the restored embassy in the Cuban capital. A child looks out a window from inside the newly opened U.S. Embassy overlooking the staging area, at the end of a flag raising ceremony of the newly opened U.S. Embassy, in Havana, Cuba, Friday, Aug. 14, 2015. Washingtons top diplomat traveled to the Cuban capital to raise the U.S. flag and formally reopen the long-closed U.S. Embassy. Cuba and U.S. officially restored diplomatic relations July 20. The American flag waves outside the newly opened U.S. Embassy, overlooking Havanas seaside boulevard, the Malecon, as guests depart after attending the flag raising ceremony, in Cuba, Friday, Aug. 14, 2015. U.S. Secretary of State John Kerry arrived Friday morning in Havana for an historic ceremony to raise the U.S. flag over the restored U.S. Embassy in the Cuban capital. Cuban and U.S. flags hang from a residents balcony on the day the U.S. opened its embassy in Havana, Cuba, Friday, Aug. 14, 2015. U.S. Secretary of State John Kerry and his Cuban counterpart Bruno Rodriguez said their nations would continue to disagree over issues such as democracy and human rights. But they also said they hoped to make progress on issues ranging from maritime security and public health to the billions of dollars in dueling claims over confiscation of U.S. property and the U.S. economic embargo on the island. HAVANA (AP)  Jubilant crowds waved American flags and chanted \"Long live the United States!\" as the Stars and Stripes rose over the newly reopened U.S. Embassy in Cuba on Friday after a half-century of often-hostile relations. Secretary of State John Kerry celebrated the day but also made an extraordinary, nationally broadcast call for democratic change on the island. Hundreds of Cubans mixed with American tourists outside the former U.S. Interests Section, newly emblazoned with the letters \"Embassy of the United States of America.\" They cheered as Kerry spoke, the United States Army Brass Quintet played \"The Star-Spangled Banner\" and U.S. Marines raised the flag alongside the building overlooking the famous Malecon seaside promenade. Meeting more than 54 years after the severing of diplomatic relations, Kerry and Cuban Foreign Minister Bruno Rodriguez set an early September date for the start of talks on full normalization of a relationship so long frozen in enmity. Not all the talk was as warm as the sunny summer day. Kerry and Rodriguez said their nations would continue to disagree over issues such as democracy and human rights. But they also said they hoped to make progress on issues ranging from maritime security and public health to the billions of dollars in dueling claims over confiscation of U.S. property and the U.S. economic embargo on the island. It seemed that virtually all of Cuba was glued to television or listening by cellphone as Kerry directly addressed the islands people on political reform. Thats a subject that has remained off-limits in Cuba even as the single-party government has implemented a series of economic reforms and re-established diplomatic ties with the U.S. \"We remain convinced the people of Cuba would be best served by a genuine democracy, where people are free to choose their leaders, express their ideas, practice their faith,\" Kerry said. He spoke before an audience of Cuban and U.S. diplomats on the embassy grounds and hundreds of thousands, perhaps millions, of islanders watching and listening live. Addressing reporters with Kerry after the ceremony, Rodriguez responded by indignantly opening his remarks with complaints of U.S. human rights transgressions  from police shootings of black men to mistreatment of prisoners at Guantanamo Bay, the U.S. naval base that Cuba says must be returned. \"Cuba isnt a place where theres racial discrimination, police brutality or deaths resulting from those problems,\" Rodriguez said. \"The territory where torture occurs and people are held in legal limbo isnt under Cuban jurisdiction.\", Many Cubans disagree with that assessment, including Afro-Cubans who say discrimination is still rampant despite the revolutions egalitarian ideals, and human rights groups who say regular, short-term arrests of government opponents aim to intimidate dissent and include beatings. In New York, Republican presidential contender Marco Rubio, a Cuban-American senator from Florida, said he would reverse the Obama administrations new Cuba policy on his first day in office, arguing it gives the Castro government international legitimacy and more resources to repress its people. Kerry acknowledged that the Obama administration would have a difficult fight in Congress to end the U.S. trade embargo of Cuba so that normal business ties between the two countries could resume. \"There is no way Congress will lift the embargo if we are not making progress on issues of conscience,\" Kerry said. President Barack Obama also called for change in Cuba when he announced the new U.S. policy of engagement in December, but his words were less pointed than Kerrys in Havana. Cuba formally reopened its Washington embassy last month. The U.S. raised its flag in Havana then, too, though saving the formal ceremony for Kerrys visit. Three Marines who took part in the flag-lowering in 1961 handed over the new flag to Marines who raised it on Friday. Kerry was the first secretary of state to visit since 1945, and his speech was remarkable for its bluntness and the national spotlight in which it came. Many Cubans lauded Kerrys call for reform, including greater access to technology on an island with one of the worlds lowest rates of internet penetration. They paired their praise with calls for the United States to lift the 53-year-old trade embargo and allow easier travel between the two countries. \"More democracy, elections, we hope for that to come with this diplomatic opening,\" said Julio Garcia, a 51-year-old mechanic. Self-employed graphic designers Danay Lopez, 28, and her husband Yosvel Martinez, 32, watched the ceremony with their 3-year-old son, singing both countries national anthems and shouting \"Long live Cuba!\" and \"Long live the United States!\" as the event drew to a close. \"Kerry spoke about democracy, freedom, Wi-Fi, and hes right,\" Lopez said. \"We want all that to be freed up, but (also) for the U.S. to free up travel, and I dont want my son to live under the embargo.\", Like Obama, Kerry said a longtime U.S. strategy of trying to isolate Cuba and provoke regime change by choking off trade and fomenting grass-roots agitation had failed. \"It would be equally unrealistic to expect normalizing relations to have a transformative impact in the short term,\" he said. \"After all, Cubas future is for Cubans to shape.\", After speaking to reporters with Rodriguez, Kerry briefly walked Old Havanas historic Plaza de San Francisco with Havana City Historian Eusebio Leal, stopping to look in shops and greet local residents and store owners before heading to an afternoon flag-raising at the home of the embassys chief of mission. He addressed a group of diplomats, Cuban-Americans and advocates of diplomacy with Cuba before a trio of Marines raised the Stars and Stripes in the stately homes back garden. The event was attended by dissidents including Jose Daniel Ferrer, Miriam Leiva and Yoani Sanchez, who tweeted a selfie with Kerry and a photo of the secretary of state meeting privately with a group of dissidents. The dissidents were not invited to the embassy ceremony, avoiding tensions with Cuban officials who typically boycott events attended by the countrys small political opposition. Soon after Kerry was heading home Friday evening, diplomats who negotiated the July 20 embassy reopening will launch full-time into discussing how to bring about measures such as re-establishing direct flights and mail service. ", "Date": "20150817", "Author": "[Bradley Klapper and Michael Weissenstein, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Top-US-diplomat-flies-to-Cuba-for-new-policy-6443806.php", "Title": "[Kerry calls for democracy as US flag is raised in Cuba]"}