{"Content": "[ Caption, Close, Rep. Sheila Jackson Lee, D-Houston, came under fire after claiming the Democratic-controlled House never tried to impeach President George W. Bush  even though she supported a resolution to do so in 2008. Rep. Sheila Jackson Lee, D-Texas, had an \"oops\" moment when she said the U.S. Constitution was some 400-years-old. Unfortunately, it was 173 some years off its actual creation date: Sep. 17, 1787. See other notable quotes from the polarizing Texas congresswoman. (Photo from C-SPAN / YouTube), , Rep. Sheila Jackson Lee made headlines for suggesting \"welfare\" should be called a \"transitional living fund.\"Related: Sheila Jackson Lee proposes new term for \"welfare\", In the wake of the oncoming sequester in early 2013, Lee demanded GOP leaders who saw President Barack Obama as being divisive to \"take the cotton out of their ears.\", \"Im a queen and demand to be treated like one,\" a former staffer recalled Lee saying. It was never officially recorded, but ex-aides to Lee went to the Daily Caller to complain about her being the worst boss in the Capitol. In response to a NRA ad that featured President Obamas two daughters, Lee said the NRA was \"reckless and irresponsible\" and may have \"jeopardized the security of the first family.\", In response to school safety, Lee says they should be fortresses but not armed. Conservatives quickly jumped on Lee after she said this on the house floor:, , Lee called for \"zero tolerance\" regarding the agents involved in the Secret Service prostitution scandal in 2012. Soon after Trayvon Martins death, Lee questioned George Zimmermans actions:, In response to allegations that there may have been fraud in the 2008 presidential elections, Lee brought race into play when she said the allegations probably startedmaybe because we elected the first African American president. In what is considered a big faux-paus on the House floor, Lee gave the University of Houston some props:, To all the bloggers, shut up and stop playing racial politics, Lee said on the PBS talk show program hosted by Tavis Smiley. \"This is not an idea of anyone over another person. Republican and Democratic Senators have already voted for this clean bill that we could vote on today. We have martial law. What that means - and my colleagues know what it means - is that you can put a bill on in just minutes,\" Rep. Sheila Jackson Lee, D-Houston.  Related: Read the full text of her speech here. Rep. Sheila Jackson Lee, D-Texas, had an \"oops\" moment on the House floor, as seen in C-Span video. The Houston representative declared the U.S. Constitution was some 400 years old. Unfortunately, thats incorrect. The Constitution was created in 1787 and ratified nearly a year later. Four hundred years ago, Jamestown, the first permanent English settlement in North America, was founded. \"Maybe I should offer a good thanks to the distinguished members of the majority, the Republicans, my chairman and others, for giving us an opportunity to have a deliberative constitutional discussion that reinforces the sanctity of this nation and how well it is that we have lasted some 400 years, operating under a Constitution that clearly defines what is constitutional and what is not,\" Lee said. (h/t Washington Free Beacon)]", "Date": "20140312", "Author": "[By John-Henry Perera]", "Link": "http://www.chron.com/news/houston-texas/article/Sheila-Jackson-Lee-says-Constitution-is-400-years-5312121.php", "Title": "[Sheila Jackson Lee says Constitution is 400 years old]"}