{"Content": "[ Caption, Close, From left: Sylvester Turner, Dr. William Flores, Judge Clarease Yates and Cary Yates at Celebrating 40 Years: University of Houston- Downtown Gala at the JW Marriott Downtown Friday Jan. 23,2015.(Dave Rossman For the Chronicle), The race to succeed Mayor Annise Parker is shaping up to be Houstons most crowded in decades, with a half dozen candidates already having declared they will run and another half dozen possibly joining them. Take a look at the candidates most likely to take the citys top job. , Declared Definite, , Likely, , Potential, Potential, , Potential, State Rep. Sylvester Turner announced his candidacy for Houston mayor today, formally adding the name of an influential lawmaker with deep ties to the African-American community to the growing field of contenders. For 25 years, Turner has risen through the ranks of the state House and twice before has looked to parlay that experience into the citys top job. Turner, who for the past year has openly talked about his plan to run a third time, made his decision public Friday in a video to supporters. \"People in my generation inherited a great city, with folks who have big dreams, and they made big things happen,\" Turner,  a Harvard-educated lawyer who grew up in low-income Acres Homes, will say in the video. \"I see a city still doing that.\", Turner likely will be the early front-runner, as much as there can be a leader at all in a field featuring a dozen potential candidates, nearly all of whom have elected experience. But few have reached out to the citys movers and shakers over the past 12 months like Turner. He first made his ambitions public last February and has won over many power players in the Democratic establishment, from Sen. John Whitmire to the lobbyists and donors who can steer endorsements, dollars and ultimately votes. $1 million in bank, He also has steadily raised mayoral money through his legislative account for at least six months. That fundraising - occurring while other mayoral candidates were subject to a fundraising blackout period - allowed Turner to enter 2015 with $1 million in the bank. On Friday, Turner is expected to name David Mincberg as his campaign treasurer of his mayoral account and inform the Texas Ethics Commission that his legislative account is effectively closed. He will begin the mayoral race with $900,000 of that $1 million to spend, according to his campaign, a head start that motivated a still-alive challenge by one of Turners opponents, Chris Bell, who argues that Turner is violating city campaign laws. Turner unveiled a policy proposal that tackles what is shaping up to be one of the most prominent debates in 2015: how to repair Houstons gaping potholes and dilapidated streets. Turners \"Road to the Future\" initiative would put Houston teenagers and college students to work by sending them to fix streets. \"With the condition of our roads right now, you cant just fix a pothole today and assume its not going to need work in the future,\" Turner said in an interview, though details of the plan remained scarce. Public works review, Turner also will emphasize a wholesale review of the Department of Public Works in order to speed up pothole repair, improving the relationship between police and minority communities and training workers for the jobs businesses need. Absent from Turners priorities was an indication as to how he would address Houstons looming pension liabilities. It is a problem that City Councilman Stephen Costello, a Turner opponent in the contest, challenged the mayoral field on Thursday to demand local control from the Legislature. That challenge came at a mayoral forum that Turner missed because of his obligations in Austin. Turner, a senior Democratic budget writer there, likely will put his legislative experience front and center during the campaign. But it also could be a liability: He cannot raise money now due to a legislative blackout period that runs until June. Meanwhile, his opponents this week released fundraising host committees that will help them inch toward the $2 million each likely needs to be competitive. Given the caliber and crowd of the field, most mayoral candidates likely will appeal to small slices of the electorate in order to earn the 40,000 votes that most campaigns expect they will need to earn a place in a December runoff. Complicated path, For Turner, that path is heavily dependent on strong support from the African-American community he has represented for two decades and which typically casts about 30 percent of the vote in municipal elections. Yet that path could be complicated by the entrance of Ben Hall, an African-American pastor who lost to Mayor Annise Parker in 2013, who also is running for the job again. Turner plans to kick off his candidacy on March 28 at Minute Maid Park.]", "Date": "20150220", "Author": "[By Theodore Schleifer]", "Link": "http://www.chron.com/news/article/Rep-Turner-to-jump-into-mayor-s-race-6091355.php", "Title": "[Turner jumps into Houston mayor's race]"}