{"Content": "[ CHARLESTON, W.Va. (AP)  Republican state Sen. Kent Leonhardt on Monday announced he will make another run for West Virginia agriculture commissioner. The bid will be Leonhardts second-straight against Democratic Agriculture Commissioner Walt Helmick. In 2012, Leonhardt lost the statewide race to Helmick, who won his first term as commissioner in that election. Helmick won by about 3 percent of the vote, or 19,500 votes. Leonhardt won his Senate seat last year. Because his Senate term lasts four years, he can keep that job even if he loses the agriculture commissioner race. Leonhardt is a Monongalia County farmer and a retired U.S. Marine Corps member. There are no term limits for the agriculture commissioner job. In the upcoming presidential election year, six partisan statewide offices will be on West Virginias ballot: governor, secretary of state, treasurer, auditor, agriculture commissioner and attorney general. Democrats currently fill all of those seats, except for attorney general. After last years elections, Republicans control of both chambers of the Legislature for the first time in more than eight decades. Senate President Bill Cole is the GOPs lead candidate for governor. Billionaire Jim Justice and Senate Minority Leader Jeff Kessler are running on the Democratic side. Republican Attorney General Patrick Morrisey is seeking re-election and doesnt have a Democratic challenger yet. GOP Del. JB McCuskey is challenging Democratic Auditor Glen Gainer. Republican Supreme Court Justice Brent Benjamin is also vying for re-election. But a change in state law this year will make judicial and magistrate races nonpartisan. Those elections will be held during the May 2016 primary. Beth Walker, a Morgantown attorney who lost in a 2008 Supreme Court run as a Republican, has announced a bid against Benjamin.]", "Date": "20150817", "Author": "[Jonathan Mattise, Associated Press]", "Link": "http://www.chron.com/news/article/WVa-Sen-Leonhardt-expected-to-announce-ag-6448044.php", "Title": "[West Virginia Sen. Leonhardt announces ag commissioner bid]"}