{"Content": "[ Caption, Close, In this Sept. 3, 2015, photo, Leigh Ann Crouse of Dubuque, Iowa, shows her support for Republican presidential candidate Donald Trump at a park along the Mississippi River in Dubuque. Trump insults. He exaggerates. He dismisses the need for public policy ideas, gets confused about world affairs and sometimes says things that flat out arent true. And the cheers from his supporters only grow louder. \"Its totally refreshing. Hes not politically correct. He has a backbone and he cannot be bought,\" said Crouse. FILE - In this Aug. 11, 2015, file photo, Republican presidential candidate Donald Trump appears before addressing a GOP fundraising event in Birch Run, Mich. Trump insults. He exaggerates. He dismisses the need for public policy ideas, gets confused about world affairs and sometimes says things that flat out arent true. And the cheers from his supporters only grow louder. FILE - In this Aug. 21, 2015, file photo, Republican presidential candidate businessman Donald Trump speaks during a campaign pep rally in Mobile, Ala. Trump insults. He exaggerates. He dismisses the need for public policy ideas, gets confused about world affairs and sometimes says things that flat out arent true. And the cheers from his supporters only grow louder. NORWOOD, Mass. (AP)  Donald Trump insults and exaggerates. He dismisses the need for public policy ideas, gets confused about world affairs and sometimes says things that flat-out arent true. And the cheers from his supporters only grow louder. By the standard that voters typically use to judge presidential candidates, Trump probably should not have survived his first day in the 2016 race. Yet as the summer draws to a close and the initial votes in the nominating calendar appear on the horizon, Trump has established himself as the Republican front-runner. Listen to these voters:, \"Its totally refreshing. Hes not politically correct. He has a backbone and he cannot be bought,\" said Leigh Ann Crouse, 55, of Dubuque, Iowa. \"This country needs a businessman just like him to put us back on track, to make us stop being the laughing stock of this world,\" said Ken Brand, 56, of Derry, New Hampshire. \"He says everything that I would like to say, but Im afraid to say. What comes out of his mouth is not what he thinks I want to hear,\" said Janet Boyden, 67, of Chester, Massachusetts. They are among the dozens of voters interviewed in the past two weeks by The Associated Press to understand how Trump has defied the laws of political gravity. Uniting them is a deep-rooted anger and frustration with the nations political leaders  President Barack Obama as well as conservative Republicans who, these voters say, havent sufficiently stood up to his Democratic administration. Some havent voted in years, or ever, and may not next year. But at this moment, they are entranced by Trumps combination of utter self-assurance, record of business success and a promise that his bank account is big enough to remain insulated from the forces they believe have poisoned Washington. By the way, they say its not that they are willing to look past Trumps flaws to fix what they believe ills the country. Its that those flaws are exactly what makes him the leader America needs. \"At least we know where he stands,\" said Kurt Esche, 49, an independent who was at Trumps recent rally outside Boston. \"These other guys, I dont trust anything that comes out of their mouths. Theyre lying to get elected. This guys at least saying what he believes.\", \"He may have started as a joke,\" Esche said, \"but he may be the real deal.\", ", "Date": "20150910", "Author": "[Jill Colvin, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Fed-up-and-angry-supporters-let-Trump-defy-6487972.php", "Title": "[Trump defies political gravity thanks to fed-up supporters]"}