{"Content": "[ Caption, Close, This May 16, 1991, file photo, shows an aerial view of the Houston Astrodome in Houston (AP Photo/Houston Chronicle, Larry Reese, File), Astrodome deal, Regarding \"New plan emerges to save Astrodome\" (Page A1, Wednesday) and \"County seeks funding for hot projects\" (Page B2, Wednesday), Harris County Judge Ed Emmett has apparently devised a proposal to finance a change-in-use restoration of the Astrodome through the issuance of tax credits to investors in the project. The proposal would bypass a second taxpayer vote on the fate of the Astrodome. The voters rejected the first proposal, expecting a plan to demolish the structure would be presented, but Emmett refused to honor the taxpayers decision. Its not mentioned which government(s) would agree to issue the tax credits. Further, were told the plan would \"not involve taxpayer money.\" This inference is misleading. Obviously, the issuance of a tax credit by any government reduces the amount of their tax collections and creates the exact same result as collecting the taxes and spending them on the project. Either way, the government(s) and taxpayers have less money to spend for other uses. Regarding the bond proposal on the Nov. 2015 election ballot, to pay the bond principal and interest taxes will necessarily have to increase, but it may not require a tax \"rate\" increase to repay the debt because of increasing property values. This is common sense. As with Emmetts Dome plan, there really is no free lunch. Don Sumners, Houston, , Mass transit, Regarding \"Metros new fast line off to a slow start\" (Page A1, July 11), critics are correct in saying, after spending $1.4 billion, the Green and Purple lines were unnecessary and expensive replacement of buses. Metro should have its highest priority moving large numbers of passengers between population and work and recreation centers, not to replace or augment bus service for \"underserved\" neighborhoods. Determining the population and work centers is not rocket science. Think airports, sports venues, downtown, Galleria, Greenway Plaza, the universities, etc. Anywhere there are HOV lanes indicate rail is needed. Overloaded freeways and absence of parking beg for rail options, which will get people out of cars and off freeways. Houston and Harris County need real mass transit options. HOV lanes should be converted to rail with buses feeding passengers to and from ADA-compliant Park & Ride or transit centers. Nelson Harbison, Houston, , Bad, bad deal, Regarding \"Diplomacy wins\" (Page B6, Wednesday), the Chronicle editorial board must have a different view of the \"nuclear deal\" than many of the ranking members of the Senate and the House of Representatives, since there is a widespread campaign to not approve the \"deal.\" And though none of us may want another Mideast war, what will Secretary of State John Kerry think should the Iranians not let the inspectors near the places of interest?, The editorial states; \"If the U.S. has learned anything, it is that the Mideast is not a place for its military to enter lightly.\" Yes, and it is not the place where once an advantage has been won militarily, that you cut and run like President Obama did and tell the enemy when you are leaving!, Lawrence Keen, Pearland]", "Date": "20150803", "Author": "[Copyright 2015: Houston Chronicle]", "Link": "http://www.chron.com/opinion/letters/article/Monday-letters-Astrodome-Metro-rail-Iran-6418460.php", "Title": "[Monday letters: Astrodome, Metro rail, Iran]"}