{"Content": "[ If you hang around the Capitol long enough, this is what youll see: Legislators who are also insurance agents carrying bills that would reduce the rights of insurance claimants; legislators involved in the oil and gas industry voting on laws that will keep cities from regulating fracking; and legislators who own payday lending services leading the opposition to bills that would regulate their businesses. Theyre using their offices to enrich themselves and their clients, often at the expense of Texas citizens. In the past decade, public officials have been involved in more than a dozen major scandals and controversies - paybacks to political donors, conflicts of interest and the revolving doors between the public and private sectors. When you add up all the money lost in kickbacks, bungled contracts and sheer bad management, the cost to taxpayers is colossal - more than $1 billion. Corruption has reached such immense proportions that Gov. Greg Abbott declared ethics reform an \"emergency\" issue for the 2015 legislative session. With only a week left, the Legislature has yet to pass a significant reform bill. But theres still time. Need ethics reform, This week, the House will debate the Senates ethics omnibus bill, SB 19. This legislation could bring the first major political reform in 20 years and relief for Texans from one of the highest corruption taxes in the nation. But the House must strengthen the bill. What emerges this week must go much further than the Senates package - legislation that House State Affairs Chairman Byron Cook described as a \"one of the most superficial efforts Ive ever seen with respect to an attempt to address ethics.\", Years of dirty politics during former Gov. Rick Perrys tenure has generated a laissez faire attitude toward even astonishing scandals. His Texas Enterprise Fund doled out $222 million to entities that did not submit formal applications or were not required to create jobs, according to the state auditor. Under Perrys administration, the state had to fire the firm it contracted for $899 million to use call centers to determine eligibility for benefits such as Medicaid, according to media reports. The firm failed to generate the savings it promised or address mounting backlogs. Twenty-one percent of Perrys campaign donations came from people who became his appointees. Parks and Wildlife commissioners gave Perry an average of $118,477 each. Texas A&M University Regents, one of Perrys largest sources of cash, averaged $113,127. That ought to be a crime. Campaign dark money - contributed by organizations that are not required to disclose the identity of the people or corporations that provide the funds - has continued to proliferate. Dark money contributions rose to over $2 million in Texas 2014 election cycle. Voters dont know who or what is backing the people running for high office. Even legislators say dark money has reached frightening levels. Shut the revolving door, When corruption is this big, it takes a big bill to confront it. SB 19 currently makes limited headway toward clarifying public officials financial interests, which would help expose conflicts of interest when public policy is being shaped. The bill also requires that public officials financial statements be posted electronically in an accessible, searchable format, so people can see them without having to drive to Austin to do so. It requires public officials to identify all sources of income, earned and unearned, and disclose compensation for legal referrals. All of that is good. But when the bill emerges from the House, it needs to do much more or it will dash any hope for real reform. It needs to shut all of the revolving doors between government and the private sector. For example, it should prohibit legislators from doing any work for state agencies for two years after they leave office. Similarly, it should prohibit public servants involved in awarding contracts to companies from working for those businesses for two years. To illuminate dark money, the bill should require identification of all sources of funds used for election campaigns. This principle should apply to direct expenditures by for-profit and nonprofit organizations designed to influence elections. We dont often have the opportunity for real reform. Now is one of those moments. But unless Texas citizens make a concerted and collective demand for reform by calling their legislators, it wont happen. Corruption will be swept under the rug, once again. Constituents must ask the people they elected to shut the revolving doors, end pay-to-play politics and shine a floodlight on dark money. The future of democracy in Texas is in your hands. , Smith, director of Public Citizens Texas office, has been working for reform in government and politics for 30 years. Birch, volunteer legislative counsel for Public Citizen, is a former administrative law judge. ]", "Date": "20150521", "Author": "[By Tom \"Smitty\" Smith  and Carol Birch]", "Link": "http://www.chron.com/opinion/outlook/article/Smith-Birch-Legislature-sold-to-biggest-6279392.php", "Title": "[Smith, Birch: Legislature sold to biggest political donors]"}