{"Content": "[ Caption, Close, Joe Straus accepts congratulations from Governor elect Greg Abbott and Lt. Governor elect Dan Patrick after being sworn in as Speaker of the House during the opening of the 2015 Legislature at the State Capitol on January 13, 2015. AUSTIN - Just days after state lawmakers signaled they hoped to move past political jockeying and work together on key policy priorities, House Republicans issued a letter directly to the Texas taxpayer arguing their tax relief plan was far better than what the Senate is proposing. \"Dear Taxpayer,\" reads the letter, which was signed by 90 of the 98 members of the House Republican Caucus. \"As conservative leaders in the Texas House, we write to you today to present to you why we support the House tax cut package authored by Rep. Dennis Bonnen, and why we think it is the most powerful plan for tax relief.\", The Senates $4.4 billion tax plan proposes handing property owners a bigger homestead exemption, while the House has pledged to cut the sales tax rate from 6.25 percent to 5.95 percent. In the Saturday letter, House Republicans argue their plan is the larger than the Senates (at around $4.9 billion) and would be better for all Texans since it would be permanent and would benefit not just property owners. The letter also argued the sales tax cut plan is the more fiscally conservative choice. \"Another attractive feature of the House plan is that it shrinks the size of government instead of shifting it. Unlike property tax cuts, which cost the state budget and grow in cost with time, the sales tax reduction simply means the state collects less,\" the letter reads. \"We came to Austin to shrink government, not shift the burden from local government to the state.\", The missive adds House Republicans \"look forward\" to working with Senate leaders on a comprehensive tax cut plan. But the sheer act of issuing the letter serves to once again draw a clear line in the sand between the two chambers, a line that could serve to further inflame tensions and lead to stalled legislative priorities in the last few weeks of the 2015 session. Eight Republicans did not sign the letter: House Speaker Joe Straus of San Antonio, Gary Elkins of Houston, GilbertPea of Pasadena, Matt Rinaldi of Irving, Mike Schofield of Katy, David Simpson of Longview, Jonathan Stickland of Bedford and John Smithee of Amarillo. While there is always a competitive relationship between the House and the Senate, tensions are running especially high this year with Lt. Gov. Dan Patrick seeking to cement his leadership and live up to his promise to bring a \"new day\" to Texas. This political wrangling reached a boiling point last Wednesday, when Gov. Greg Abbott had words with Patrick at a weekly leadership breakfast also attended by Straus. Abbott was upset his \"quality pre-kindergarten\" legislation - a House bill thats already passed the lower chamber - was called \"socialistic\" and \"godless\" by a group of tea party leaders Patrick appointed to advise him on policy. By weeks end, Patrick insisted the Senate was working with the House to address differences of opinion. The pre-K bill, and a number of other House proposals, was referred to Senate committees and detente seemed imminent, at least from the upper chamber. But Saturdays letter served to bring to an end this brief kumbaya moment, forecasting a stormy last few weeks before sine die. The only question now is whether enough common ground can be found to avoid triggering a special session.]", "Date": "20150425", "Author": "[By Lauren McGaughy]", "Link": "http://www.chron.com/news/politics/texas/article/House-Republicans-appeal-to-citizens-on-tax-plan-6223740.php", "Title": "[Kumbaya concluded: House Republicans draw line in the sand on tax cuts]"}