{"Content": "[ Caption, Close, , AlaskaRank: 50Federal aid as State General Revenue: 20 percentSource: Tax Foundation, North Dakota Rank: 49Federal aid as State General Revenue: 20.5 percentSource: Tax Foundation, Virginia Rank: 48Federal aid as State General Revenue: 23.5 percentSource: Tax Foundation, HawaiiRank: 47Federal aid as State General Revenue: 23.5 percentSource: Tax Foundation, ConnecticutRank: 46Federal aid as State General Revenue: 23.6 percentSource: Tax Foundation, Delaware Rank: 45Federal aid as State General Revenue: 24.5 percentSource: Tax Foundation, Nevada Rank: 44Federal aid as State General Revenue: 25.5 percentSource: Tax Foundation, Illinois Rank: 43Federal aid as State General Revenue: 25.7 percentSource: Tax Foundation, New Jersey Rank: 42Federal aid as State General Revenue: 26.2 percentSource: Tax Foundation, Kansas Rank: 41Federal aid as State General Revenue: 33.1 percentSource: Tax Foundation, California Rank: 40Federal aid as State General Revenue: 27.2 percentSource: Tax Foundation, Minnesota Rank: 39Federal aid as State General Revenue: 28.1 percentSource: Tax Foundation, Wisconsin Rank: 38Federal aid as State General Revenue: 28.2 percentSource: Tax Foundation, Washington Rank: 37Federal aid as State General Revenue: 28.6 percentSource: Tax Foundation, Massachusetts Rank: 36Federal aid as State General Revenue: 28.8 percentSource: Tax Foundation, ColoradoRank: 35Federal aid as State General Revenue: 28.8 percentSource: Tax Foundation, New Hampshire Rank: 34Federal aid as State General Revenue: 29 percentSource: Tax Foundation, Maryland Rank: 33Federal aid as State General Revenue: 30.2 percentSource: Tax Foundation, Pennsylvania Rank: 32Federal aid as State General Revenue: 30.6 percentSource: Tax Foundation, Utah Rank: 31Federal aid as State General Revenue: 31.6 percentSource: Tax Foundation, Florida Rank: 30Federal aid as State General Revenue: 32.1 percentSource: Tax Foundation, Indiana Rank: 29Federal aid as State General Revenue: 32.3 percentSource: Tax Foundation, South Carolina Rank: 28Federal aid as State General Revenue: 32.4 percentSource: Tax Foundation, New York Rank: 27Federal aid as State General Revenue: 32.8 percentSource: Tax Foundation, Iowa Rank: 26Federal aid as State General Revenue: 33.1 percentSource: Tax Foundation, North Carolina Rank: 25Federal aid as State General Revenue: 33.2 percentSource: Tax Foundation, Michigan Rank: 24Federal aid as State General Revenue: 33.8 percentSource: Tax Foundation, Rhode Island Rank: 23Federal aid as State General Revenue: 34 percentSource: Tax Foundation, Nebraska Rank: 22Federal aid as State General Revenue: 34.2 percentSource: Tax Foundation, Arkansas Rank: 21Federal aid as State General Revenue: 34.5 percentSource: Tax Foundation, Texas Rank: 20Federal aid as State General Revenue: 34.5 percentSource: Tax Foundation, West Virginia Rank: 19Federal aid as State General Revenue: 34.7 percentSource: Tax Foundation, Vermont Rank: 18Federal aid as State General Revenue: 34.8 percentSource: Tax Foundation, Ohio Rank: 17Federal aid as State General Revenue: 34.9 percentSource: Tax Foundation, Idaho Rank: 16Federal aid as State General Revenue: 34.9 percentSource: Tax Foundation, Oklahoma Rank: 15Federal aid as State General Revenue: 35.5 percentSource: Tax Foundation, Kentucky Rank: 14Federal aid as State General Revenue: 35.7 percentSource: Tax Foundation, Wyoming Rank: 13Federal aid as State General Revenue: 36 percentSource: Tax Foundation, Oregon Rank: 12Federal aid as State General Revenue: 36.1 percentSource: Tax Foundation, Maine Rank: 11Federal aid as State General Revenue: 36.2 percentSource: Tax Foundation, ArizonaRank: 10Federal aid as State General Revenue: 36.5 percentSource: Tax Foundation, Alabama Rank: 9Federal aid as State General Revenue: 36.5 percentSource: Tax Foundation, New Mexico Rank: 8Federal aid as State General Revenue: 36.6 percentSource: Tax Foundation, Georgia Rank: 7Federal aid as State General Revenue: 37.9 percentSource: Tax Foundation, Montana Rank: 6Federal aid as State General Revenue: 39 percentSource: Tax Foundation, Missouri Rank: 5Federal aid as State General Revenue: 39.4 percentSource: Tax Foundation, South Dakota Rank: 4Federal aid as State General Revenue: 40.8 percentSource: Tax Foundation, Tennessee Rank: 3Federal aid as State General Revenue: 41 percentSource: Tax Foundation, Louisiana Rank: 2Federal aid as State General Revenue: 44 percentSource: Tax Foundation, Mississippi Rank: 1Federal aid as State General Revenue: 45.3 percentSource: Tax Foundation, Over the Independence Day weekend, the popular conservative news and opinion website Breitbart put out some bold calls for dramatic changes in the United States. One article, published on the Fourth of July, announced \"time for the states to declare independence from the federal government.\" Another ran the next day and called for concerned states to convene an assembly apart from the U.S. Congress to discuss methods for maintaining autonomy from Washington, D.C. RELATED:Feds raid Texas secessionist meeting, Both pieces were authored by Michael Leahy, a Tennessee-based conservative author and a founding voice in the Tea Party movement. In an interview, he said his articles were not a call for secession but did amount to states organizing against the federal government. \"Its a move towards more state sovereignty,\" he said. \"The national government has usurped states rights on more occasions than we can count. The assembly would be for states to identify and share best practices for reassertion of their 10th Amendment rights.\", He cited much-touted issues like President Barack Obamas executive action on immigration and federal environmental regulationbut he said recent moved by the U.S. Supreme Court to uphold Obamacare subsidies and strike down same-sex marriage bans across every state amounted to a last straw. Breitbart, where Leahy has been a contributing writer since 2010, is among the most widely read conservative niche news operations. In February 2014, the New York Times reported it sported the 49th largest traffic for global news websites. Since then, the site opened a Texas bureau and an office in London. RELATED:Texas governor orders troops to monitor Jade Helm, Leahys proposed \"assembly\" would need one state to offer to host other delegates, and hes hoping for volunteers from the nations most loyal red states. \"It would seem to me to be a natural to think that Texas would be a likely state to host this event,\" he said. \"I know that this proposal has been sent to legislators in Texas, and Im told some of them are considering that.\", He did not say which Texas legislators may be considering the plan. But serious consideration of the plan might not be far-fetched in the Lone Star State, which has made recent headlines for moves with slightly separatist undertones. In April, Gov. Greg Abbott ordered members of the Texas Military to \"monitor\" members of the U.S. Military while the drilled in Texas this summer. In June, Texas declared it would \"repatriate\" almost $1 billion worth of gold bars from a bank in New York. The Associated Press reported \"the plan has kicked up chatter outside of Texas that its a step towards secession.\", RELATED:Abbott signs law creating Texas depository for state gold, And also in June, Politico brought Texas secession into headlines with a report that independence for the Lone Star State was a serious talking point for Russian president Vladimir Putin, and is regularly evoked in Russian media. A 2014 poll by Reuters, apparently the most recent on secession, found about one in four Americans supported the peaceful withdrawal of their state from the Union, with the highest support in Texas and the Southwest, 34 percent. But Leahy stressed he wasnt advocating secession. \"Its independence from the federal governments unconstitutional usurpation of each states sovereignty,\" he said. \"Not independence from our constitutional republic.\", RELATED:Report: Russias right wing is egging on Texas secessionist movement, Some federal agencies are useful and would stick around, he said, like the National Park Service, the National Highway System and agencies of national defense. But the proposed \"Assembly of States\" would be an alternative to the constitutionally-sanctioned Article V Conventiona gathering of state delegates, called by the national legislature and approved by the governor of each participating stateat which the constitution may be amended. Instead, he said states could send any representatives they choose to the assembly without consulting the governor or answering to the U.S. Congress. According to Leahys published proposal, the representatives would discuss which federal grants to reject, \"what specific actions shall be taken to resist unconstitutional Supreme Court decisions,\" how to resist \"unlawful federal regulations\" and how to supplant federal healthcare policies. Paul Brace, a professor of political science at Rice University, said that while tensions between the federal government and the states are as old as the Union, the idea of convening an assembly to address that tension is \"novel.\" He attributed it to heightened federal-state tension since the election of a Democratic president, even though he said the federal government has been expanding its powers steadily since the 1930s. \"Some states have become pretty rebellious,\" he said. \"Theres a perspective that the federal government is the root of most evils. Thats got a lot of traction in the current political environment.\", Leahy said he doesnt expect many left-leaning states to find interest in in his proposed assembly. On Monday, his proposal had almost 39,000 Facebook shares.]", "Date": "20150707", "Author": "[Dylan Baddour, Houston Chronicle]", "Link": "http://www.chron.com/news/politics/article/Breitbart-contributor-calls-for-independence-6369065.php", "Title": "[Breitbart contributor calls for 'independence from the federal government' and 'assembly of states']"}