{"Content": "[ Caption, Close, , Justice Sandee Bryan Marion, who has served on the 4th Court of Appeals since January 2002, plans to seek the courts chief justice position. Justice Sandee Bryan Marion, who has served on the 4th Court of... In 2014, shifting judicial sands could produce the first Republican chief justice ever elected to the 4th Court of Appeals. Highly respected Republican 4th Court Justice Sandee Bryan Marion has decided to seek the job being vacated by Democratic Chief Justice Catherine Stone. Notably, Marion has not been challenged by a Democrat in her three previous 4th Court races. With the emergence of partisan judicial waves, that is likely to change as she seeks the courts top spot and probably would have even if she stayed put and sought re-election when her term expires in 2016. Partisan waves have emerged in Bexar County and in the 4th Court region in the past three election cycles, ensuring that practically every judge on the ballot is challenged. Democrats won three of five 4th Court seats on the ballot last year as Democratic voters turned out for the presidential election. Prior to the 2012 election, Stone was the lone Democrat on the court, which Republicans had dominated in recent elections. Gubernatorial election years are more hospitable to Republicans, which shows Marion exercises good judgment politically as well as on the bench. I know that its going to be difficult, said Marion. Its going to be a hard race. I do believe 2014 will be better than 2016. Marion, who does not have to resign to seek the chief justice position, believes that the partisan sweeps are bad for the judiciary and prefers a more sensible judicial selection process. But judicial selection isnt likely to change anytime soon in Texas. And Marion is committed to serving on the bench. I was stunned that Cathy is not going to seek re-election. I wanted her to stay. Marion had high praise for Stones leadership style and the professional environment she created on the court. Marion intends to maintain the cooperative atmosphere if she is elected chief justice. Marion, 57, served as a probate judge for nine years before being appointed to the appellate court in 2002. The combination of trial and appellate experience gives her stellar qualifications for the job. Her reputation as a straight-shooting jurist will ensure that shell be able to tout legitimate bipartisan support in the campaign ahead. The St. Marys School of Law graduate also sharpened her leadership skills in recent years with a stint as president of the Rotary Club of San Antonio. Marion will begin raising money this summer with an event in July. And she expects to run an aggressive campaign across the 32-county 4th Court district. Ironically, Stone is departing amid an era of new Democratic strength, and Marion is preparing to make history by snaring the one 4th Court post the GOP didnt take during the partys ascendant years. The Express-News reported that David Peeples was the first Republican elected to the court in 1988. Under the leadership of previous chief justices, the court has maintained a solid track record by leaving partisanship behind after elections. And thats the way the judiciary should be. ]", "Date": "20130529", "Author": "[By Bruce Davidson]", "Link": "http://www.chron.com/opinion/columnists/bruce_davidson/article/Marion-could-make-history-on-4th-Court-4558441.php", "Title": "[Marion could make history on 4th Court]"}