{"Content": "[ Caption, Close, Martha Turner Sothebys International Real Estate associate Kim Walker shares a moment with Thailands Ambassasor Pisan Manaweapat. John Daugherty Realtors agents Christina Sacco and Lisa Parigi were among 60 JDR agents enjoying a get-together at Sullivans in River Oaks. Bernstein Realtys Scott Minchen and his son Matthew, 20, found the perfect place to escape Houston heat and share an incredible adventure. , Bernstein Realtys Scott Minchen and his son Matthew, 20, found the perfect place to escape Houston heat and share an incredible adventure. \"My son and I hiked from the Colorado State University Mountain Campus through the Camanche Wilderness and the Rocky Mountain National Parks back country and camped at Mirror Lake, miles from the nearest trail head,\" he said. \"The flowers were in bloom and scenery was spectacular. On the return hike, we summited two mountains, Camanche Mountain at 12,702 feet and Fall Mountain at 12,258 feet,\" Minchen said. They made the descent without a trail eventually finding Mummy Pass Trail which took the pair to \"a beautiful unnamed pond where we cooked dinner.\", They could see Wyoming in the distance when they hiked over the Alpine and after the sun went down they could see the lights of Fort Collins, almost 50 miles away. \"After three days and two nights in the back country with warnings to watch for bears and aggressive moose, we saw none,\" Michen recalled. It was only when they got back to Matthews college campus that they saw a large moose grazing and some deer. , The Champions office of Better Homes and Gardens Real Estate Gary Greene continues to build on its tradition of supporting the national work of the Houston-based Sunshine Kids. Mark your calendar for October 15 for their annual barbeque event - with a couple new features. \"We are moving it to a new place and expanding it to include the entire family,\" said Sharon Teusink, office manager and leader of the annual extravaganza. The Sunshine Kids Funfest will be held at the Gleannloch Pines Golf Course from 5 to 9 p.m. The barbeque dinner will feature music, games, a bounce house, sports memorabilia, live and silent auctions, charity black jack and more. , Martha Turner Sothebys International Real Estate agent Kim Walker recently attended a luncheon at the Greater Houston Partnership where she met Thailand Ambassador Pisan Manawapat, who was visiting the City of Houston Mayors Office of International Trade. He presented the benefits of doing business with Thailand at The Greater Houston Partnership International Trade Council. Earlier this summer Walker enjoyed the Future of Houston Luncheon on where she had the chance to listen to the views of a few of the Mayoral candidates. Kim said this was a very enjoyable and knowledgeable luncheon and she hopes to get to attend another luncheon like this before the election. , Everyone has been buzzing about the River Oaks District. Sullivans hosted a \"Meet the Neighbors\" happy hour for agents and management staff at John Daugherty, Realtors. The two-hour mix and mingle gave everyone a chance to experience the restaurants new menu and - most importantly - meet the man in charge, new general manager, Dylan Gotesky More than 60 guests turned out for the new program of monthly socials, where agents can interact and get to know one another during off site.]", "Date": "20150821", "Author": "[By Judi Griggs]", "Link": "http://www.chron.com/news/article/Real-people-Father-and-son-team-share-mountain-6457614.php", "Title": "[Real people: Father and son team share mountain trail adventure]"}