{"Content": "[ Caption, Close, FILE - In this May 27, 2008 file photo, the gurney in Huntsville, Texas, where Texas condemned are strapped down to receive a lethal dose of drugs. Wherever their summer travels have taken them, Supreme Court justices probably will weigh in over the next few days on Texas plans to execute two death row inmates in the week ahead. This undated handout photo provided by the Texas Department of Criminal Justice shows Daniel Lopez. Texas has scheduled back-to-back executions Wednesday and Thursday for Lopez and Tracy Lane Beatty. Lopez was convicted of running over a Texas police officer with his car during a high-speed chase. Lopez lawyer already has asked the court to stop the execution. (Texas Department of Criminal Justice via AP), This undated handout photo provided by the Texas Department of Criminal Justice shows Tracy Beatty. Texas has scheduled back-to-back executions Wednesday and Thursday for Daniel L Lopez and Beatty. Beatty strangled his 62-year-old mother, then stole her car and drained her bank accounts. He has an appeal pending in lower courts and could also end up at the Supreme Court. (Texas Department of Criminal Justice via AP), In this photo taken May 27, 2010, Supreme Court Justice Stephen Breyer and Ruth Bader Ginsburg are seen in the East Room of the White House in Washington. Wherever their summer travels have taken them, Supreme Court justices probably will weigh in over the next few days on Texas plans to execute two death row inmates in the week ahead. Breyer, joined by Ginsburg, was writing in dissent in a case involving death row inmates in Oklahoma, and five sitting justices, a majority of the court. FILE - In this People wait in line to go into the Supreme Court in Washington, Monday, June 22, 2015. Wherever their summer travels have taken them, Supreme Court justices probably will weigh in over the next few days on Texas plans to execute two death row inmates in the week ahead. WASHINGTON (AP)  Wherever their summer travels have taken them, Supreme Court justices probably will weigh in over the next few days on Texas plans to execute two death row inmates in the week ahead. If past practice is any guide, the court is much more likely to allow the lethal-injection executions to proceed than to halt them. Opponents of the death penalty took heart when Justices Stephen Breyer and Ruth Bader Ginsburg made the case against capital punishment in late June as arbitrary, prone to mistakes and time-consuming. Even if death penalty opponents eventually succeed, the timeline for abolition probably will be measured in years, not months. Thats because Breyer, joined by Ginsburg, was writing in dissent in a case involving death row inmates in Oklahoma, and five sitting justices, a majority of the court, believe \"it is settled that capital punishment is constitutional,\" as Justice Samuel Alito wrote in his opinion for the court in that same case. Texas has scheduled back-to-back executions Wednesday and Thursday for Daniel Lee Lopez and Tracy Lane Beatty. Lopez was convicted of running over a Texas police officer with his car during a high-speed chase. Lopez lawyer already has asked the court to stop the execution. Beatty strangled his 62-year-old mother, then stole her car and drained her bank accounts. He has an appeal pending in lower courts and could also end up at the Supreme Court. The justices rarely issue last-minute reprieves to death-row inmates. Even after Breyers opinion calling for a re-examination of capital punishment by the Supreme Court, no justice publicly backed a Missouri inmates plea to halt his execution to allow the court to take up the constitutionality of the death penalty. Similarly, the three Oklahoma inmates who lost their high court case now face execution in September and October and want the justices to reconsider the decision from June in light of Breyers dissent. The court almost never does that. The heightened attention on the death penalty comes amid declining use of capital punishment in the United States, and a sharp drop in the number of death penalty prosecutions. The 18 executions that have taken place so far this year have been carried out in just five states  Texas, Missouri, Georgia, Florida and Oklahoma. Nine of those were in Texas. Twelve states with the death penalty have not had an execution in more than five years. That list includes California and Pennsylvania, which between them have more than 900 death row inmates. The relatively small number of states that actively seek to carry out death sentences underscores what Ginsburg characterized in late July as \"the luck of the draw.\", \"If you happen to commit a crime in one county in Louisiana, the chances you will get the death penalty are very high. On the other hand, if you commit the same deed in Minnesota, the chances are almost nil,\" she said at a Duke University law school event in Washington. Texas is far and away the leader in carrying out executions, but it too has seen a drop in the number of new inmates on its death row. No new death sentences have been imposed in Texas this year, said Robert Dunham, executive director of the Death Penalty Information Center. Geographic disparity was among several defects Breyer and Ginsburg identified in June. Another is the length of time many inmates spend living under a sentence of death, which Breyer had previously suggested also might be a violation of the constitutional ban on cruel and unusual punishment. Six of the 18 men who have been executed in 2015 spent at least 20 years on death row, including one who served 31 years before his execution. Yet for all the systemic problems opponents of capital punishment can cite, they also have to reckon with what death penalty opponent Michael Meltsner called the \"world of brutality and the awful capacity of people to commit violent crimes.\" One example: The Justice Department, which has otherwise advocated for criminal justice reforms during the Obama administration, won a death sentence in the case of convicted Boston Marathon bomber Dzhokhar Tsarnaev. \"When awful things happen, people dont think about the costs and benefits. They react to circumstances. There is an ambivalence that has tracked the death penalty debate for many years,\" said Meltsner, a Northeastern University law professor and experienced civil rights lawyer. Among the questions surrounding the possibility that the Supreme Court would take up the constitutionality of the death penalty is the makeup of the court itself. With four justices in their late 70s or early 80s, the next president might have the chance to fill several vacancies and could change the courts direction. \"Obviously, the composition of the court matters greatly and the biggest unknown variable about the life of the American death penalty is the presidential election of 2016. My expected time frame for constitutional abolition varies greatly based on the result,\" said Jordan Steiker, a University of Texas law professor. It took Breyer and Ginsburg more than 20 years on the Supreme Court to voice their doubt about capital punishment. Justices Harry Blackmun and John Paul Stevens likewise spoke out at the very end of their time on the court. Steiker said he thinks Breyers dissent will serve as a road map for death penalty lawyers and future justices who may not feel constrained to wait before grappling with executions. \"It was invigorating to those whod like to see constitutional abolition,\" he said. \"The arguments not new, but they had not been marshaled as effectively by a justice until this opinion.\"]", "Date": "20150809", "Author": "[Mark Sherman, Associated Press]", "Link": "http://www.chron.com/news/texas/article/Justices-speak-out-about-death-penalty-but-6432603.php", "Title": "[Justices speak out about death penalty, but executions go on]"}