{"Content": "[ Caption, Close, Republican presidential candidate, former Florida Gov. Jeb Bush, greets attendees after speaking at a town hall style campaign stop, at the VFW in Englewood, Colo. Tuesday, Aug. 25, 2015. MIAMI (AP)  Republican presidential candidate Jeb Bush has written an e-book recalling his days as Florida governor, including the year 2004 when the state was struck by four hurricanes within a six-week span. Bush won widespread praise, even among critics, for his deft handling of the storms. During the hurricanes, Bush was ubiquitous around the state, warning Floridians about the approaching storms and offering consolation to those who lost their homes or were displaced from them. The e-book, \"Reply All,\" is to be released Oct. 30, but Bushs campaign made available a 43-page chapter entitled \"We Will Prevail\" to The Associated Press and other media outlets on Tuesday. The chapter deals with hurricanes Charlie, Frances, Ivan and Jeanne, which caused $42 billion in damages. Bush writes about the hurricanes by including email exchanges he had with everyday Floridians, the media and his staff. Each chapter will delve into each of the eight years Bush spent in office as governor. He served two terms, from 1999-2007. Amazon is taking pre-sale orders on the e-book starting Wednesday. On Wednesday, Bush visits Pensacola, where he will talk about his experience during the 2004 storms at a town hall meeting. The four hurricanes were devastating to Florida, leaving $42 billion in damages at a time when the state budget was only $57 billion. The storms damaged or destroyed 700,000 homes and forced Bush to declare a state of emergency in all 67 counties. In the e-book chapter about the storms, Bush mainly writes about his administrations response and includes a collection of mostly positive e-mails from people praising his leadership during the crisis. \"Thanks for being a strong leader in a time of need,\" wrote one woman who noted she was \"a loyal Democrat, but supporter of Jeb Bush.\", Another man wrote about his three-year-old daughter asking him question after question about the storms. He said the little girl then saw Bush on television and asked, \"Is that the Storm Governor, Daddy?\", \"This year, 2004, would test our mettle in Florida  you might even say our souls,\" Bush wrote at the start of the chapter. \"We were gloriously unaware of what was to come.\", He later wrote that he and fellow Floridians \"felt a little like the survivors of a shipwreck\" because the \"worst had happened, and we were still there.\", Quoting a speech he made to mark the end of hurricane season in November 2004, Bush wrote that he had \"never been prouder to be governor of Florida.\", As governor, Bush carried a Blackberry at all times, spending 25 to 30 hours a week emailing and responding to staff and Florida residents. Earlier this year, he released tens of thousands of those emails on a website to be more transparent in his quest for the White House. Bush has been citing his record and experiences as Florida governor as he tries to win over voters in his bid for the 2016 Republican presidential nomination.]", "Date": "20150825", "Author": "[Sergio Bustos, Associated Press]", "Link": "http://www.chron.com/news/politics/article/Bush-e-book-touts-crisis-management-skills-during-6465512.php", "Title": "[Bush e-book touts crisis management skills during '04 storms]"}