{"Content": "[ Citing growing political rancor that has roiled its community, West University Place Baptist Church has withdrawn from negotiations with the inner-loop enclaves City Council regarding a planned swap of property. The announcement came just one day before the lame duck West U. City Council was to meet in special session to consider - and likely approve - the exchange. Church members had been scheduled to vote on the proposal, which had unanimously been endorsed by the churchs executive council, finance committee and deacon body, on Sunday. The proposal by the city to exchange its property at 3826 Milton St. for a parcel of church-owned property adjacent to City Hall became the center of a fierce controversy that led to a slate of City Council candidates opposed to the swap being swept into office, replacing term limited officialsin a May 9 election. Mayor Bob Fry, who favored the proposal, said the church notified him of its decision at 9 p.m. Wednesday. The planned 6:30 p.m. Thursday special council session has been cancelled. \"I am very disappointed,\" said Fry, who did not seek re-election. \"It was obvious that this action would have been in the citys best long-term interest.\", In a letter to his congregation, West University Pastor Roger Patterson noted that, \"The last few months have been difficult. The political processes and dynamics were not of our own making. The church has suffered through numerous public and private attacks, which, while difficult to endure, were understandable considering the divisive political climate. Our prayer throughout this process has been that we fulfill His purpose and do nothing if it does not glorify God and His kingdom.\", City Councilman-elect Bob Kelly Thursday hailed the church decision, saying, \"I am very happy about this decision. It was the reasonable thing for the (church) to do.\", The controversy grew out of the citys 2014 decision to propose the land swap when it learned that West University Baptist planned to build a youth center on its property adjacent to City Hall. City leaders at that point were crafting a municipal master plan that envisioned the eventual relocation of the city library and other structures to a campus-like setting around City Hall. The city hoped to give the church its Milton Street property, which currently is the site of the municipal vehicle maintenance facility. Had the plan gone through, that shop would have been relocated. In battling the proposed swap, opponents launched a successful petition drive to force a November referendum on the issuance of $3 million in bonds needed to relocate the shop. Fry on Thursday said the maintenance facility now will remain at the Milton Street site.]", "Date": "20150515", "Author": "[By Allan Turner]", "Link": "http://www.chron.com/news/houston-texas/houston/article/Baptist-church-ends-negotiations-over-West-U-6263568.php", "Title": "[Baptist church ends negotiations over West U. land spat]"}