{"Content": "[ Caption, Close, FILE - In this May 16, 2015, file photo, Republican presidential candidate Rick Perry speaks in Des Moines, Iowa. Unlike during his presidential bid four years ago, the 2015 version of Perry is decidedly less cowboy, going for country humble instead of country strong. FILE - In this Jan. 15, 2012, file photo, the words \"Come and Take It\" can be seen on the boots of Republican presidential candidate Texas Gov. Rick Perry as he campaigns in Myrtle Beach, S.C. Unlike during his presidential bid four years ago, the 2015 version of Perry is decidedly less cowboy, going for country humble instead of country strong. FILE - In this June 4, 2015 file photo, Republican presidential candidate Rick Perry speaks to supporters after announcing the launch of his presidential campaign for the 2016 elections in Addison, Texas. Unlike during his presidential bid four years ago, the 2015 version of Perry is decidedly less cowboy, going for country humble instead of country strong. FILE - In this Jan. 13, 2012, file photo, Republican presidential candidate Texas Gov. Rick Perry waits to be introduced at a campaign stop in Hilton Head, S.C. Unlike during his presidential bid four years ago, the 2015 version of Perry is decidedly less cowboy, going for country humble instead of country strong. ELLSTON, Iowa (AP)  Rick Perry still prides himself on being a Bubba. The former Texas governor relishes laying on the country-boy charm, greeting voters with \"Howdy,\" talking of growing up on a cotton farm that had an outhouse until he was 6 and boasting that hes spent more time atop a John Deere tractor than anyone else running for the Republican presidential  nomination. Unlike during his short-lived presidential bid four years ago, though, todays Perry is decidedly less cowboy  going for country humble instead of country strong. Hes traded his brown ostrich boots, nicknamed \"Freedom\" and \"Liberty,\" for sensible shoes, diluted his rugged persona with professorial glasses and tempered the shoot-from-the-hip style that made him something of a gunslinger governor. Out among Iowas summer fields of not-yet-high corn, Perry is hoping he can stand out without his signature swagger. Some wonder, though, if Perry hasnt lost his distinctiveness, becoming just another middle-aged candidate in casual business attire. \"He looks so different from four years ago,\" said Nancy Klein Dykstra, 58, who accepted Perrys firm handshake at a community center in rural Ellston, about 80 miles southeast of Des Moines. \"I thought I remembered him being kind of a robust, big guy, big presence.\", Perry admits that hes ditched much of the bravado of his first presidential run. He hopes a more down-to-earth approach will help him in Iowa, where hes spent more time than any presidential candidate so far. He says of Iowans: \"I dont think they care whether its someone who has any swagger or not.\", Still, its been a mega-makeover for Perry, once given a \"Top Cowboy of Texas\" award, and who used a laser-sighted pistol to shoot a coyote while jogging in a sparsely populated corner of Austin during his time as governor. On Saturday, Perry walked on stage at a conservative forum in black dress shoes; no fewer than four of his Republican rivals wore cowboy boots at the same event. The transformation isnt sitting well with some back home. \"Hes gotta wear boots; hes from Texas,\" said Rocky Carroll, a Houston bootmaker who has been stitching together custom pairs for Perry since he became state agriculture commissioner in 2001. Perry wears size 10  E, the same size Carrolls fitted to another client, George W. Bush. But Perry stopped wearing the boots last year, saying they hurt his back. Thats an especially sore subject since Perry had stem cell surgery in July 2011 to fuse his spine and said post-op painkillers were partly to blame for the collapse of his first presidential campaign. Carroll said he lowered the heels on Perrys boots afterward to make them easier on his back. \"He said, They fit all right now,\" Carroll recalled. But Perry hasnt gone back to boots, instead often lacing up dress Oxfords, like most of his GOP rivals. He frequently wears dark suits and squirms uncomfortably in them at times. Also gone from 2012 is Perrys brash verbal style. In that campaign, he suggested Federal Reserve Chairman Ben Bernankes economic policies were \"treasonous\" and Social Security was a Ponzi scheme. This time, Perry largely sticks to talking points and centers his message on his strong job-creation record in Texas. His folksiness hasnt totally fallen away, however. Perry is fond of expressions like \"the horse is out of the barn,\" and he likes to joke that the 2.5 million people added to Texas population during his 14 years as governor meant \"a lot of new pickup trucks.\", In Ellston, where a Sunday evening crowd of about 80 sampled seven different varieties of homemade pie prepared for his visit, Perry asked 19-year-old Emily Green where the red, white and blue cowboy boots she was wearing were made. When she said Puerto Rico, he exclaimed: \"Good lord, girl! Weve got to get you some El Paso boots.\", Don Kass, chairman of western Iowas Plymouth County Republican Party, met Perry recently and said the two \"had a long conversation about a cow herd.\", To be sure, Texans Lyndon B. Johnson and George W. Bush governed with plenty of Texas swagger of their own  Bush is remembered for invoking the \"dead or alive\" poster of the Old West in the hunt for Osama bin Laden. But Dave Carney, top political strategist for Perrys 2012 campaign, said they toned down that brashness when campaigning in early primary states, and Texans who didnt  Perry in 2012 and Phil Gramm among them  saw their home-state style backfire. \"As a leader of a state like Texas, that is very effective, but it doesnt necessarily wear well in other states,\" Carney said. \"You talk about swagger, but theres not a lot of success there.\"]", "Date": "20150722", "Author": "[Will Weissert, Associated Press]", "Link": "http://www.chron.com/news/texas/article/Can-Perry-stand-out-in-2016-without-his-signature-6394194.php", "Title": "[Can Perry stand out in 2016 without his signature swagger?]"}