{"Content": "[A new profile of Ben Carson in GQ magazine quotes the presidential hopeful making some more controversial claims. The lengthy piece begins with Carson, a retired neurosurgeon and conservative favorite, reacting to President Barack Obamas State of the Union speech. One of Carsons advisers said Obama looked good and Carson responded by calling the president a \"psychopath.\", \"Like most psychopaths,\" Carson said. \"Thats why theyre successful. Thats the way they look. They all look great.\", Carson is no stranger to controversial statements. Earlier his month, the bestselling book author drew national headlines after he said men who come out as gay in prison prove homosexuality is a choice. And last year, Carson repeatedly compared the US to Nazi Germany. \"I mean, [our society is] very much like Nazi Germany,\" he said in one interview, according to Talking Points Memo. \"And I know youre not supposed to say Nazi Germany, but I dont care about political correctness. You know, you had a government using its tools to intimidate the population. We now live in a society where people are afraid to say what they actually believe.\", He repeated this position in the GQ profile  even while visiting Israels Holocaust museum. \"On several occasions, I tried to get Carson to concede that his analogy likening the U.S. to Nazi Germany was out of line,\" GQsJason Zengerle wrote. \"Our longest discussion about the matter came in Jerusalem, in the cafeteria of the Holocaust museum at Yad Vashem. Wed spent the previous ninety minutes touring the museum, followed by Carson entering Yad Vashems Hall of Remembrance and, black kippah atop his head, laying a wreath. ... Given all this, I asked Carson, did it make him reconsider his analogy?\", Carson again didnt budge. \"Not at all,\" he said. \"It makes [the Nazi comparison] even stronger.\", Also during his trip to Israel, Carson reportedly compared Syrian civil war to the racially charged riotsin Ferguson, Missouri, that erupted last year. Carson visited the Golan Heights, disputed territory under Israeli control, and an Israeli soldiertold him the Islamist fighters are from Morocco and Europe instead of Syria. Carson said the US had the same problem of outside \"troublemakers\" stirring up violence. \"Its just like the troublemakers in Ferguson,\" Carson replied. Click here to read the full profile in GQ magazine. (via Mediaite), Join the conversation about this story , NOW WATCH: 14 things you didnt know your iPhone headphones could do, See Also:]", "Date": "20150324", "Author": "[Colin Campbell, provided by]", "Link": "http://www.chron.com/default/article/Presidential-hopeful-Ben-Carson-thinks-Obama-is-a-6156143.php", "Title": "[Presidential hopeful Ben Carson thinks Obama is a 'psychopath' and America is like Nazi Germany]"}