{"Content": "[ Caption, Close, Voters  in the Harris County Courthouse branch  in Pasadena in 2013. In its recommendations for criminal district judge positions in Harris County, the Houston Chronicle noted that some candidates made comments indicating a lack of objectivity. (\"Criminal courts, Part 1,\" Page B10, Oct. 2 and \"Criminal courts, Part 2, Page B6, Oct. 3) The Harris County Criminal Lawyers Association applauds the Chronicles call for fairness and objectivity by our judges and judicial candidates. The largest local criminal-defense bar in the country, with over 800 members, the association does not endorse any individual or either party. Even though judges are forced to work within a partisan system of elections, they should be above politics and follow the Constitution and the law. Our criminal justice system is an emblem of our standards of humanity. Fair dealing must be certain for those who find themselves accused of crimes. Judges play an important role in this process and are the first and last check in a system that must keep its promise to give every accused person a fair trial, no matter which political party is in power. Political consultants typically advise judicial candidates to appear \"tough on crime\" because the voting public confuses justice with crime-fighting. Judges and candidates do our community a disservice by promoting this misguided view. Our current \"tough-on-crime\" mentality has caused Texas to lead the nation in exonerations of the wrongfully convicted. Judges should be neither tough on crime nor soft on crime but instead fair and impartial, following the law wherever it leads. The law requires judges to protect the citizens from their prosecutors. The public is only protected if our judges have the integrity to enforce the law despite contrary public opinion. The judiciary must be free to act on the law even when their decisions benefit defendants. Any judge who substitutes his or her own political beliefs for the law is not qualified to sit on the bench and certainly should not be given the tremendous responsibility of making life or death decisions. A judge who views himself or herself as doing the job of a prosecutor engages in the worst sort of judicial activism, impeding the separation of powers and insulting the memory of those who have fought to protect our constitutional freedoms. A judge serves the public by enforcing the Texas and U.S. Constitutions, which our forefathers wrote to protect us from an overreaching government. The job of a judge is critical: to protect us by enforcing the constitutions without regard to whether doing so will benefit a particular defendant. The public is protected - from unfairness, from false accusations and ultimately from tyranny - only when judges have the integrity to enforce the law despite the tide of public opinion. But it takes courage to do the right thing despite the weight of public opinion. While craven candidates pander to fear and ignorance, the courageous deserve our support, the endorsement of the Chronicle and most of all, the support of the public at large. We must return to a fair and independent judiciary rather than one that will help the government win by being, like yet another prosecutor in the courtroom, \"tough on crime.\", , Roe is president of the Harris County Criminal Lawyers Association.]", "Date": "20141013", "Author": "[By Carmen M. Roe]", "Link": "http://www.chron.com/opinion/outlook/article/Defining-a-fair-and-independent-judiciary-5815280.php", "Title": "[Defining a fair and independent judiciary]"}