{"Content": "[ Caption, Close, Check out these maps that show what defines the Lone Star State. From burger chains to NFL fans to gerrymandering, we look at the most fascinating maps about Texas. Just how big is Texas?  , Texans forced to sip Starbucks, , Greasy pizza everywhere!, ,  Source: Nathan Yau/Flowing Data  , King cotton in Texas See how the states borders have evolved. The borders of the Lone Star State have changed remarkably since its beginning as a Spanish colony in the 1500s. See how Texas distinctive shape developed over the years.Source: David Rumsey Map Collection, A 1718 map shows the Spanish colony of Texas, including various Native American villages and nations.Source: David Rumsey Map Collection, Overlapping the 1718 map with a satellite view of Texas today.Source: David Rumsey Map Collection, An 1835 edition of David H. Burrs map of Texas shows the borders of the region had expanded north of the Arkansas River. This edition was released on the same year as the Battle of Gonzales, the start of the Texas Revolution.Source: David Rumsey Map Collection, An overlap of Burrs 1835 map of a modern-day satellite view of Texas.Source: David Rumsey Map Collection, An 1836 map titled \"A New Map of Texas, With The Contiguous American & Mexican States.\" Unlike Burrs map, youll see the border between Texas and Louisiana is a bit more clearly defined. This year marked the beginning of the Republic of Texas.Source: David Rumsey Map Collection, An overlay of that 1836 map over a modern-day satellite view of Texas.Source: David Rumsey Map Collection, This 1838 map is cut from a larger atlas by Henry S. Tanner. This map was released one year after then-President Sam Houston had moved the republics capital to Houston. The move would be short-lived.Source: David Rumsey Map Collection, An overlay of that 1838 map over a modern-day satellite view of Texas.Source: David Rumsey Map Collection, This 1840 map is actually a reissue of an earlier Burr illustration done in 1836. The difference here is this map features railroad lines and several new counties. A year prior, Austin was named the new capitol of the republic.Source: David Rumsey Map Collection, An overlay of that 1840s map over a modern-day satellite view of Texas.Source: David Rumsey Map Collection, The year 1849 marked the California Gold Rush, which is partly the focus on this map released that same year. Zooming in on Texas northwestern border shows the cities of Santa Fe and Albuquerque were barely within our state. This map was released a year after the Treaty of Guadalupe-Hidalgo, which ended the Mexican-American War.Source: David Rumsey Map Collection, Cutting of a portion of that 1849 map and overlapping it with a modern-day satellite view of Texas.Source: David Rumsey Map Collection, An 1857 map of Texas shows the states distinctive shape has finally set in proper. Note the counties in the western portion of the state are much larger than their modern-day versions, including Bexar, El Paso, Presidio and Cooke counties.Source: David Rumsey Map Collection, Unfortunately, the map provided for the \"Georeferencer\" tool is an atlas version that cut off Texas distinctive Panhandle. Still, the rest of the map could be placed on top of a modern-day satellite view of the state.Source: David Rumsey Map Collection, Cartographers and data geeks have mapped Texas and the U.S. in all sorts of inventive ways. We pulled together a large collection of maps on the state to learn a little more about where we live. These maps chart a little bit of everything: Cowboys fans vs. Texans fans, the racial diversity in major Texas cities and the location of every Starbucks in the state. RELATED: Who runs this state: Rangers fans or Astros fans?, We found some maps from the 1800s and an image of Texas from space. See the gallery above to check out these maps and from many different perspectives. ]", "Date": "20150410", "Author": "[Matt Levin]", "Link": "http://www.chron.com/news/houston-texas/article/25-maps-that-help-explain-Texas-6190417.php", "Title": "[25 awesome maps that help explain Texas]"}