{"Content": "[Fresh off a victory in which they took control of both the U.S. Senate and House of Representatives, the GOP suddenly finds itself in a jam. The story of the moment is no longer President Obamas healthcare program, which Republicans have promised to blow up on the way to the presidency in 2016. Its Obamas immigration reform plan, which he delivered Thursday night in a short speech, laying out the terms by which 5 million or so immigrants who entered the U.S. illegally will have temporary legal protection. \"We are in great shape,\" Eliseo Medina, an immigration reform activist for many years, said to me in an email. \"People now have proof positive that they can make change, and the GOP is in a box  attack, and make their relations with Latinos worse, or do their own bill and tick off\" the more conservative wing of the party by compromising. When I wrote about Medina earlier this year and mentioned his 22-day fast in Washington, D.C. in 2013, he was optimistic that thered be reform this year. I didnt share his enthusiasm, but he said Obama  who visited him during the fast  struck him as sincerely determined to get something done. \"I had discussed it with him so many times that I was convinced he was going to do it. The only question was how far he was willing/able to go and when.\", The when is now. Advocates didnt get the whole package they wanted, and the scramble to determine who is eligible for protection and to process applications could be chaotic for months to come. But in making a first move toward change, Obama struck a blow to the duplicity and hypocrisy surrounding immigration law. It has never made sense that children without documents could attend school legally, but could be deported the moment they leave school. Nor has it made sense for us to then slam the door on the investment by refusing immigrants college or jobs in which theyd pay back the investment through taxes. It has never been fair to point a finger at those who fled poverty, crime and corruption for a chance at a better life, when all along, major U.S. industries have not only embraced them, but profited handsomely, as have consumers who demand the lowest prices for a head of lettuce, a restaurant meal, a hotel stay, a nanny, a gardener, a housekeeper. What about the rule of law, scream the opponents of immigration reform. Rule of law?, The wink-and-nod policies of the past were a sham. A firm set of rules on who gets to stay and who has to leave is long overdue.]", "Date": "20141121", "Title": "[Immigration reform: The when is now and it's long overdue]", "Link": "http://www.latimes.com/local/lanow/la-me-ln-lopez-immigration-reform-20141121-column.html", "Author": "NULL"}