{"Content": "[Former Florida Gov. Jeb Bush outlined his plan to fix the nations immigration system: Secure the borders, change the mix of immigrants who are allowed to enter the country, and finally, create a path to legalization for those in the country illegally. \"This is the only serious, thoughtful way of dealing with this, and we better start doing it,\" Bush told an audience at an agriculture gathering on Saturday. Hundreds of Iowa Republicans sat stone-faced in response. Bushs two-day trip to Iowa this weekend  his first foray to the state since he announced his interest in the 2016 presidential race  featured warm receptions from voters intrigued by his familiar connections and his record. It also provided hints of problems he could face in the state that will open presidential nominating next winter, particularly on a trio of issues  immigration, his support for federal education standards and his support for phasing out a renewable-fuels mandate responsible for an economic boom in Iowa. The son of one president and the brother of another, Bush is viewed as a national front-runner for the GOP nomination based on his fundraising prowess and name identification. And over two days in Iowa, Bush spared no effort to convince residents that he loves their state. But the unanswered question is whether they will love him back. \"He has a lot of work to do here, and hes got to start from scratch. He has to build relationships, and build a lot of them pretty quickly,\" said Craig Robinson, a former party official and founder of the Iowa Republican website. \"He might be the front-runner, but he may be the most vulnerable front-runner Ive seen.\", In what served as an unofficial campaign kickoff Friday and Saturday, Bush raised money for a congressman in Urbandale, addressed the agricultural forum along with several other potential candidates, met with supporters at a Waukee barbecue joint and greeted diners at a Pizza Ranch in Cedar Rapids. Iowa has been a boon and a bane to Bushs family. His father, former President George H. W. Bush, notched a surprise win in the states caucuses over Ronald Reagan in 1980, which positioned him to be Reagans running mate. But he dropped to an ignominious third place in 1988, though he eventually won the White House. Jeb Bushs brother, former President George W. Bush, won the caucuses twice, in 2000 and 2004. Jeb Bush fondly recalled stumping across Iowa on behalf of his father. \"Ive done it both ways,\" he told about 100 audience members (and 50 reporters) at the fundraiser. \"Ive been to Iowa where my dad lost, and Ive been there when he won. I like the winning part better, to be honest with you.\", Both father and brother had some deeply loyal supporters in the state. \"I was a super volunteer for his brother,\" said Megan Hippensteel, 39, who saw Bush speak Saturday in Cedar Rapids. \"I am Jeb Bush all the way.\", But those ties do not always transfer to the third Bush. \"The Bush name gives you entree, but it doesnt make the sale,\" said Doug Gross, a prominent GOP attorney who served as a finance chair for Bushs brother and is unaligned this cycle. He added that the last time any Bush ran a competitive race here was 2000, so any network long ago dispersed. \"We live long in Iowa, but eventually we do die,\" he said. Jeb Bushs effort is further complicated by the rightward move of the states Republicans since the last Bush campaign. A new dominance by conservative churchgoers in particular propelled former Sen. Rick Santorum of Pennsylvania and former Arkansas Gov. Mike Huckabee to their respective victories here in 2012 and 2008. Those voters are deeply skeptical of two issues in which Bush holds views contrary to theirs: his support for a pathway to legality for immigrants in the country illegally and his endorsement of the Common Core education standards. Popular conservative talk-radio host Steve Deace described those two matters as \"nonnegotiables.\", \"Those are sun-hot issues,\" he said during a commercial break at his West Des Moines studio. \"Well find out what percentage of Republicans really are in favor of open borders and having schools dictated to from elites on high. I dont suspect those numbers are very high.\", Tellingly, the first question Bush received from an Iowan in a public forum was about Common Core. Bush affirmed his support of it without using the words \"Common Core,\" and emphasized that he believes education decisions should be made at the state and local levels. \"Raising expectations and having accurate assessments of where kids are  it is tantamount, it is essential for success,\" Bush told the audience member in Urbandale. But \"the federal government shouldnt have a role influencing  directly or indirectly  standards or curriculum or content.\", Voters who were skeptical of Bushs positions on immigration and education said they were willing to listen to his rationale in the coming months. \"Im watching and observing,\" said attorney Eric Turner, 59, of Des Moines, who heard Bush at the fundraiser. \"I am here to learn and listen and decide later on.\", Gov. Terry Branstad, a fellow Republican, said he told Bush that a key to success would be replicating his fathers 1980 strategy. While Reagan held a handful of public events, the elder Bush, wife Barbara and three of their sons, including Jeb Bush, fanned out to Iowas 99 counties. \"I reminded Jeb Bush that he knows how to win Iowa because he saw what his father did here,\" Branstad said in an interview at the gold-domed Capitol. Branstad does the full tour every year, and he won 98 counties in his 2014 reelection. \"To win Iowa, youve got to go everywhere.\", Bush told reporters that he recognized he needed to differentiate himself from the 41st and 43rd presidents. \"There are people, including myself, that love my brother, love my dad,\" he said. \"But Im going to have to get this on my own.\", seema.mehta@latimes.com, Twitter: @latseema]", "Date": "20150308", "Title": "[Jeb Bush's Iowa visit hints at hurdles he could face in key state]", "Link": "http://www.latimes.com/nation/politics/la-na-jeb-bush-iowa-20150308-story.html", "Author": "[Seema Mehta]"}