{"Content": "[President Obama called years of racial targeting in Ferguson, Mo. \"oppressive and objectionable and worthy of protest\" but decried the gunfire that left two police officers injured there early Thursday. \"There was no excuse for criminal acts,\" Obama said during an otherwise joke-suffused appearance on ABCs \"Jimmy Kimmel Live.\", \"And whoever fired those shots shouldnt detract from the issue. Theyre criminals. They need to be arrested. And then, what we need to do is to make sure that like-minded, good-spirited people on both sides -- law enforcement who have a terrifically tough job and people who understandably dont want to be stopped and harassed just because of their race -- that were able to work together to try to come up with some good answers.\", \"What we have to make sure of is that the folks who disregard and disrespect the other side, people who resort to violence -- that theyre marginalized,\" he added later. \"They set us all back,\" Kimmel said. \"They do.\", \"But theyre not the majority,\" Obama replied. \"And in the same way that you cant generalize about police officers who do an extraordinarily tough job -- overwhelmingly, they do it professionally -- you cant generalize about protesters who it turns out had some very legitimate grievances.\", Obama called attention to a recent Justice Department report that showed that African American citizens were being stopped disproportionately in Ferguson, much of the time so that the city could benefit financially from the fines assessed against them. \"What was happening in Ferguson,\" Obama said, \"was you had city government telling the Police Department ... Stop more people. We need to raise more money. Folks would get stopped. Theyd get tickets. Then, theyd have to wait in line to pay it, take a day off work. Folks would lose their jobs. In some cases, they were thrown in jail because they didnt have enough money for the fines. And then theyd get fined for that. So there was a whole structure there, according to the Justice Department report, that indicated both racism and just a disregard for what law enforcements supposed to do.\", The president reiterated -- as he did on Saturday during an evocative speech commemorating the 50th anniversary of the beatings of civil rights protesters on the Edmund Pettus Bridge in Selma, Ala. -- that progress had been made in race relations, even in troubled areas. \"I said this at Selma: It is not unique, but its also not the norm,\" he said. \"And weve got to constantly, when were thinking about issues of racial progress, or any kind of issue, recognize that things can get better, but theres still more work to do. And we shouldnt be complacent about the very real existence of problems out there. But we shouldnt despair and think nothings changed.\", In his remarks about unrest in Ferguson, Obama sympathized with the two police officers caught in the gunfire Thursday. No one had yet been apprehended, though police searched throughout the day. \"Obviously,\" Obama said, \"we dont yet know what happened. Our thoughts and prayers are with the officers and their families, and thankfully ... theyre going to be OK.\", The appearance on Kimmels show -- Obamas first since 2008 -- was the only public event during the presidents whirlwind visit to Southern California. He landed late Thursday afternoon, visited Kimmels Hollywood set, and then traveled to Santa Monica for a gathering with key fundraisers. The off-the-record nighttime chat at the home of Chris Silbermann, co-founder of the talent agency ICM Partners, and Silbermanns wife, Julia Franz, a television executive producer, cost attendees $33,400 per couple. The gathering is one of the first major Hollywood fundraisers for the Democratic National Committee as it prepares for the 2016 presidential and congressional elections. The presidential visit also spawned the usual traffic complaints, although those were generally limited to the immediate environs of Obamas appearances. Twitter: @finneganLAT; @cathleendecker, ]", "Date": "20150312", "Title": "[Obama on 'Jimmy Kimmel Live': 'No excuse for criminal acts' in Ferguson]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-obama-ferguson-kimmel-20150312-story.html", "Author": "[Michael Finnegan, Cathleen Decker]"}