{"Content": "[Hillary Rodham Clinton is the front-runner in the Democratic presidential primary, and Jeb Bush is a front-runner in the Republican one. And although there is a lifetime of politics between now and the next election, theres a good chance that, on Nov. 8, 2016, Americans will choose between a Bush and a Clinton for the second time in 25 years. We could have our third Bush presidency or another turn for the Clintons. To many Americans, this is troubling. Last year, former First Lady Barbara Bush said that \"there are more than two or three families that should run for high office in America.\" Sixty-nine percent of Americans agree with that statement, according to a 2014 poll from NBC News and the Wall Street Journal. This March, in another NBC News/WSJ survey, 39% of voters said they would think more or somewhat more favorably of a candidate whose last name was not Bush or Clinton. Similarly, a majority said that electing Hillary Clinton or Jeb Bush would represent a return to the policies of the past. Theres no denying that the status quo  of a White House claimed by one or the other family  is unusual, and I wont criticize anyone disturbed by a pattern of \"Bush, Clinton, Bush, Obama, Bush\" or \"Bush, Clinton, Bush, Obama, Clinton.\", But I also dont think its as bad as it looks. Observers have called this a \"dynastic\" election. This headline from a January edition of the New York Times, is typical: \"Are Two Dynasties Our Destiny?\", \"Dynasty\" might apply to the Bush family. Indeed, Jeb Bush, in his announcement speech last Monday, described himself as \"a guy who met his first president on the day he was born and his second on the day he was brought home from the hospital,\" before declaring that \"not a one of us [presidential candidates] deserves the job by right of resume, party, seniority, family or family narrative. Its nobodys turn.\", But that term doesnt apply to the Clintons. Hillary Clinton neither came from a political family nor joined one. Instead, she entered politics as a partner to Bill, and after two decades as a political spouse, set out on her own career, first as a senator, then as a presidential candidate, then as a top diplomat, and now  again  as a presidential candidate. Given the degree to which shes built her career in tandem with her husbands, Clinton isnt a dynastic candidate as much as shes a tightly connected one. For some, of course, this is a distinction without a difference, which is why its important to note that national political dynasties are a recurring part of American life. The first father-son presidential duo, in the 19th century, was John Adams and his son, John Quincy Adams, the second and sixth presidents of the United States. The Harrison family also produced two presidents, William Henry and Benjamin. The Breckinridges dominated Kentucky politics and sent senators, House members, and a vice president to Washington. Two other antebellum presidents  John Tyler and Franklin Pierce  came from distinctly political families. The 20th century brings more familiar names: Theodore Roosevelt and his cousin Franklin Roosevelt; William Howard Taft, his son Sen. Robert A. Taft, his grandson Sen. Robert Taft Jr. and his great-grandson, former Ohio Gov. Robert Taft III. Most famously, theres the Kennedy clan. The fact that dynasties are normal  that Senate seats and governorships and presidencies have moved between and within families with ease  may be alarming (America isnt especially meritocratic) but its also mostly harmless. American democracy wasnt stronger after two Adams presidencies in quick succession, but it wasnt weaker, either. Besides, despite the frequency of dynasties, the vast majority of powerful positions in national politics go to people who arent connected to political families. One last point. George W. Bush was a very different president than his father, and if elected, Hillary Clinton will be a different president than her husband. Hillary faces a different Democratic Party than Bill did, and has to make different choices for different ends. The same is true for Jeb and the Republican Party. Their surnames aside, neither is \"more of the same.\", When you vote for president, youre voting for an administration of bureaucrats and assistants and a whole host of appointees. What matters most is the party and its network of operatives, activists, and policymakers, not the individual at the head of that party. If Clinton had won in 2008, her administration would have looked a lot like the one Obama put together. And on the same score, a Jeb Bush White House probably wouldnt look too different than a Scott Walker White House or a Marco Rubio White House. The aesthetics of another Clinton or Bush presidency dont look great. But optics have little bearing on what either candidate would do in office. Jamelle Bouie is a staff writer for Slate. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150622", "Title": "[Jeb Bush and Hillary Clinton: Neither would be 'more of the same']", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0622-bouie-bush-clinton-dynasties-20150622-story.html", "Author": "NULL"}