{"Content": "[President Obama proposed tougher regulations on investment brokers who handle retirement funds, saying it is time to curb hidden fees, \"backdoor\" payments and conflicts of interest that can cost middle-class Americans tens of thousands of dollars in retirement savings. Diving into another likely clash with a Republican-led Congress, Obama on Monday billed his proposed rules  a revival of an effort quashed amid industry opposition four years ago  as part of his renewed focus on a populist economic message. He dished out tough criticism of financial advisors who are \"bilking\" clients for their own benefit and selling \"snake oil.\" He delivered the message while standing with consumer advocates, retirees and Sen. Elizabeth Warren (D-Mass.), a favorite among liberals for her efforts to reform the financial system. \"Weve got a lot more work to do to make sure the recovery reaches every single American out there and not just those at the top,\" Obama said in remarks delivered at the headquarters of seniors advocacy group AARP. The proposed rules, which the administration can enact without congressional approval, would require some financial advisors to act as what the law calls fiduciaries for their clients. That would require them to put the clients interests ahead of other factors, such as their own compensation or company profits, when recommending or selling investments. The reforms, long backed by many consumer groups, are designed to crack down on advisors who steer investors to products that provide hidden payments or generate higher fees for the advisor but do not necessarily provide the best returns. Currently, advisors are required to recommend \"suitable\" investments for clients, but that standard leaves considerable room for abuses, according to consumer advocates. A report released Monday by Obamas Council of Economic Advisors estimated that investors receiving \"conflicted advice\" earn lower returns  by roughly 1 percentage point a year  than other investors. That adds up to roughly $17 billion in lost returns in individual retirement accounts each year, the report said. Over time, the losses can build to tens of thousands of dollars for the average worker. Financial services industry officials disputed those estimates and said new rules would require changes to their compensation structure that would undermine their business model. Professional guidance would become more expensive and out of reach for average investors, they warned. \"Middle- and lower-market investors would have a hard time finding wealth managers willing to work with them, and they would be left without any professional guidance to secure their financial future,\" said Jules Gaudreau, president-elect of the National Assn. of Insurance and Financial Advisors. The Department of Labor proposed similar regulations in 2010, only to back off after strong industry pushback and criticism from lawmakers in both parties. Opponents argued that rules as written would have inadvertently prevented investors from receiving important advice and would have dictated how firms could compensate their employees. Labor Secretary Thomas Perez promised in his confirmation hearings to take industry concerns into account when redrafting the regulations. Officials said the new version includes exemptions aimed at addressing those concerns. They did not detail the exemptions, which are certain to be debated during in the coming rule-making process. The new rule would not prohibit revenue-sharing or commissions, nor would it dictate how firms pay their advisors, officials said. The White House said the new higher standards would not apply to advisors providing \"general education\" about employer-sponsored retirement plans and IRAs. Obama said he believed that the majority of advisors try to give their customers good advice. But he cast some of the financial industrys complaints as overblown. Rules governing retirement investing are decades old and in need of updating, he said. Input from Wall Street will be welcome during the process of writing a final version of the regulation, he said, but \"what I wont accept is the notion that theres nothing we can do.\", \"These industry doomsday predictions have not come true in other countries that have taken even more aggressive action on this issue than were proposing,\" Obama said. \"And if your business model rests on taking advantage, bilking hardworking Americans out of their retirement money, then you shouldnt be in business.\", The tough talk came from a president trying to burnish his record on financial regulation as the clock ticks down on his tenure. The White House enlisted Warrens advice on this and other economic proposals  making a relatively rare attempt to win the public approval of an advocate who is beloved by many Democrat liberals, but not so much by Wall Street. The event was the first public appearance for Obama and Warren since a ceremony at the White House last June, when the president endorsed the senators legislative proposal on student loans. Warren more recently frustrated the White House by opposing the nomination of investment banker Antonio Weiss for a top post at the Treasury Department. Weiss withdrew, but was then brought into the department as counselor to Treasury Secretary Jacob J. Lew, a post that does not require Senate confirmation. As Obama tries to build momentum behind his partys economic message  and his legacy  the White House is showing its willingness to cooperate with Warren. Obamas top domestic policy advisor, Cecilia Munoz, recently met with the senator to discuss the proposal on retirement funds, as well as measures on community colleges and student loans, a White House official said. The Massachusetts Democrat, whom some liberals would like to see as a challenger to former Secretary of State Hillary Clinton for the presidential nomination, also has been in touch with Obamas economic advisor, Jeff Zients, and Perez on minimum wage and equal pay issues, the official said. The announcement of the tougher regulations comes as Republicans are preparing to outline their top economic proposals in a budget. Officials said the president will try to draw a stark contrast in the coming weeks by making announcements about proposals they say will boost wages, make college more affordable and protect consumers. kathleen.hennessey@latimes.com, Times staff writer Dean Starkman in New York contributed to this report.]", "Date": "20150223", "Title": "[Obama proposes tougher rules for retirement fund advice]", "Link": "http://www.latimes.com/business/la-fi-obama-retirement-funds-20150224-story.html", "Author": "[Kathleen Hennessey]"}