{"Content": "[As Republicans take control Tuesday of both chambers of Congress for the first time in eight years, party leaders hope to move quickly to confront President Obama and showcase their conservative ideology, including austere budget cuts and dismantling government regulation. But continuing GOP divisions, a lack of clear leadership and some recent high-profile scandals are already distracting from the partys ambitious policy agenda. First up, possibly this week, will be House votes to approve the controversial Keystone XL pipeline, followed later by moves to undo Obamas immigration policies and a budget battle with Democrats over lower tax rates and less government spending. Without a clear Republican presidential front-runner to guide the way, it will fall to House Speaker John A. Boehner and incoming Senate Majority Leader Mitch McConnell to set the course and keep the partys conservative wing in check. First Boehner must clear his own reelection as speaker Tuesday. Though a small number of Republicans have signaled displeasure with Boehner as party leader  rekindling memories of conservatives failed coup two years ago to oust the speaker  Boehner is expected to retain his hold on power. But despite expectations that he and McConnell would move swiftly to show Americans that a GOP-led Congress can govern effectively, it remains unclear how the leaders will proceed. As of Friday, the House schedule for the opening week was still not set. That stands in contrast to the \"100 hour\" agenda promised by then-House Speaker Nancy Pelosi (D-San Francisco) after Democrats seized control from Republicans in 2006 and delivered swift votes on ethics reform, a minimum wage hike and other campaign trail promises. Republican priorities will probably come into sharper focus later this month during a private out-of-state retreat to map the agenda for the year ahead. It is the first time in recent years that all Republicans from both chambers will huddle to plot strategy. \"The new American Congress will bring us an opportunity to begin anew, and as Sen. McConnell and I have pledged, the peoples priorities will be our priorities,\" Boehner said recently. \"Weve also made clear that early on, well make a direct challenge to the presidents unilateral actions on immigration.\", The difficult part will be finding a middle ground inside the Republican Party. On a series of issues, including immigration and tax reform, party leaders must bridge the divide between tea party supporters who want to use the new Republican majorities to move aggressively against the president and the more pragmatic wing that wants to avoid extreme positions, particularly in the run-up to the 2016 presidential race. Democrats are already dismissing Boehners \"new American Congress,\" pointing to recent headline-grabbing controversies that they say evoke familiar negative stereotypes about Republican thinking on minorities and women. The No. 3 House Republican, Rep. Steve Scalise of Louisiana, apologized last week for delivering a 2002 talk to a white-supremacist group headed by former Ku Klux Klan leader David Duke. So far, Scalises contrition has appeased many in his party, including Boehner and the No. 2 Republican, Rep. Kevin McCarthy of Bakersfield, who depend on the Louisianians conservative credentials and good-natured leadership to corral the Houses often rambunctious wing. But it is unclear whether Scalises recent ascent to party leadership will withstand this episode. \"It was a mistake I regret,\" Scalise said of his appearance before the European American Unity and Rights Organization, labeled a hate group by the Southern Poverty Law Center. \"And I emphatically oppose the divisive racial and religious views groups like these hold.\", Around the same time, New York Republican Rep. Michael G. Grimm announced he would resign after pleading guilty to tax evasion stemming from his past co-ownership of a Manhattan restaurant. Grimm won reelection in November, despite widespread negative media attention and a videotaped threat to throw a reporter who asked about his financial dealings off a Capitol balcony. Rep. Blake Farenthold (R-Texas) remains on the job after his former communications director sued his office for sexual harassment. A legal filing included lurid details about the congressmans alleged pursuit of red-headed women. \"The congressman will not let the outrageous claims of a disgruntled former employee interfere with his representing the people of Texas,\" spokesman Kurt Bardella said in an email late last week. \"He plans to continue to fight for lower taxes, more and better jobs and a smaller government.\", Like Grimm, the Corpus Christi-area congressman, elected in the 2010 tea party wave, won reelection last fall despite an opponents ad that recycled an earlier photo of him wearing pajamas with a scantily-clad woman. \"Republicans are off to a banner start for their new Congress,\" quipped a recent missive from the Democratic Congressional Campaign Committee, predicting they were \"on the path to break their own record for least popular Congress in history.\", To be sure, Democrats have their own hurdles ahead as the partys progressive wing, increasingly led by Sen. Elizabeth Warren of Massachusetts, is poised to block Obamas efforts to strike deals with Republicans. Divisions between the White House and Democrats on Capitol Hill came into stark focus after the damaging midterm election, when each blamed the other for the partys losses. Liberal Democrats have little interest in Obamas effort to work with the GOP to approve a far-reaching trans-Pacific trade agreement with Asian nations, which they say will cost American jobs. Neither do progressives back his pursuit of corporate tax cuts that they warn would deprive the government of needed revenue. But as the minority party now in both houses, Democrats role has diminished. For Republicans, their performance in the coming months will become a referendum not only on their ability to lead  a key question in the 2016 presidential race  but on what has become the partys increasingly conservative ideology. The incoming House Budget Chairman, Rep. Tom Price of Georgia, vows to deliver a spending blueprint that builds on the austerity outlined by his predecessor, Rep. Paul D. Ryan (R-Wis.), the former vice presidential nominee, with cuts to Medicare, Medicaid and other safety-net programs. With the first Republican congressional majority since 2006, social conservatives are expected to push for legislation to curtail abortions and limit same-sex marriage, though such bills would probably be blocked by Democratic filibusters in the Senate or presidential vetoes. Sen. Ted Cruz (R-Texas) and others with 2016 presidential aspirations are certain to jockey for influence among their conservative peers. One early battle will come next month when Congress must renew funding for the Homeland Security Department. Though other government operations have been funded until September, Republicans agreed to only a short-term extension for Homeland Security, which oversees immigration agencies, as a protest against Obamas plan to defer deportation for up to 5 million people living in the U.S. illegally. To minimize the infighting, Boehners team is hoping to start this week with an easy legislative lift: a modest bipartisan bill to encourage small businesses to hire military veterans. But in a volley to Obama, the bill does so by making a tweak to the Affordable Care Act, the first of what will probably be many attempts by the GOP-led Congress to scale back the presidents signature program. lisa.mascaro@latimes.com]", "Date": "20150105", "Title": "[Republicans take helm of Congress, but initial course is unclear]", "Link": "http://www.latimes.com/nation/la-na-congress-gop-20150105-story.html", "Author": "[Lisa Mascaro]"}