{"Content": "[Once Hillary Rodham Clintons charismatic rival, then her unpopular boss, President Obama was bound to pose a bit of quandary for Clinton as she once again pursues the presidency. The conflict between remaining loyal to a Democratic president and staking out her own turf was front and center this week as Clinton opened her campaign in Iowa  and particularly when she spoke about the economy. Clinton never directly criticized Obama, whom she served as secretary of State for four years. But she also didnt give him much credit for the nations economic recovery. Instead, during her two-day swing through the state, Clinton repeatedly struck populist notes about income inequality, stagnating wages and the drag on small businesses from tightened credit. The theme  a foundation of her campaign  was that hard-working Americans are responsible for what recovery has occurred and that much more needed to be done for those who continue to struggle. \"As good as it is that weve kind of dug ourselves out of the hole of the Great Recession, were not up and running yet,\" Clinton said Wednesday at a small-business roundtable at a fruit-packing warehouse in Norwalk, south of Des Moines. \"And, unfortunately, the deck is still stacked in favor of those at the top, and we need to reshuffle the cards and begin to play a different hand, a hand that includes everybody whos willing to work hard and do their part.\", The previous day, Clinton cited the wage disparity between big corporation CEOs and average workers, and the tax rate inequality between hedge fund managers and nurses. \"Weve got to figure out in our country how to get back on the right track,\" she said during an appearance in Monticello. All in all, it was a notable distancing from a Democratic president she served. (The former senator and first lady did praise Obamas signature healthcare overhaul, his proposal to make community college free and the first law he signed upon taking office the Lily Ledbetter Act, which benefitted women workers.), Clintons careful dance was driven by competing needs. As she embarks on her second White House run, its critical for her to capture the passion of the Obama supporters  notably the young voters  who helped him defeat her in 2008. But she must also win over the swing-state, rust-belt and white voters who have soured on him. Shes also up against the sentiments of voters, who typically seek a change in party, Democrat or Republican, after two presidential terms. (Winning a third successive term has happened only once since Harry Trumans 1948 victory, in 1988 when George H.W. Bush succeeded two-term Republican President Ronald Reagan.), Clintons challenge, running to succeed a two-term president she served, has been pursued twice in recent elections. In 2000, Vice President Al Gore backed almost completely away from President Bill Clinton and their shared economic record, fearful of the stain of Clintons sex scandal and impeachment. He lost and was widely criticized for failing to use Clinton to his advantage. In 1988, however, Bush won a third successive Republican term with this logic: If the country was switching horses after Ronald Reagans two terms, the least it could do was pick one going in the same direction. Both Reagan and Clinton were popular when they left office. Obama, so far, is less so. Candidates actively avoided him during the 2014 midterm elections, giving Hillary Clinton another reason to distance herself. Even before opening her campaign in Iowa, a state Obama twice won but where his favorability ratings have been underwater for two years, Clinton started to distinguish herself from Obama. In her memoir, \"Hard Choices,\" she wrote that they disagreed on whether to arm Syrian rebels. In an August interview, she went further, calling Obamas inaction on Syria a \"failure\" and directly criticizing his approach to foreign policy. In Iowa, Clinton did not mention Obama by name as she discussed the economy. But she struck at the limits of the economic recovery during his terms, and seemed as well to repudiate his approach. Obama, in a controversial 2012 comment, said that entrepreneurs success relied on help from government and others, a sentiment seized on by Republicans then trying to push him from office. \"If youve got a business, you didnt build that. Somebody else made that happen,\" Obama said in a speech in Roanoke, Va. Clinton, talking with the founder of a digital ad agency about her plans to reform the tax code and the discrepancy between the credits available for large and small businesses, reversed the emphasis. \"Youve built this company. Its your labor and your intelligence that made it what it is and youve got big plans for it, but youre being squeezed,\" she sympathized. Her riff about difficulties facing entrepreneurs and sobering statistics about the plight of small business start-ups in the U.S. seemed akin to what is routinely heard at GOP rallies. \"Its become more difficult, more expensive, more red tape, unnecessary regulations that has really put a damper and that was unfortunately exacerbated greatly by the effects of the Great Recession, where a lot of banks stopped lending,\" Clinton said. \"I want to make middle class mean something again.\", Twitter: @latseema]", "Date": "20150416", "Title": "[Hillary Clinton: Distancing from Obama while courting his supporters]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-clinton-obama-iowa-20150416-story.html", "Author": "[Seema Mehta]"}