{"Content": "[In 1947, U.S. historian Wilfred E. Binkley took stock of the 13 men who had been president since the end of the Civil War and reached a stark conclusion: Governorship was a training school for successful presidents. The seven ex-governors on the list  including both Roosevelts, Theodore and Franklin  were far more effective chief executives than the six others. New Jersey Gov. Chris Christie said pretty much the same thing during the Republican Governors Assn. meeting last month. Were better at it, Christie told his fellow state leaders. The American people are done with the experiment of having somebody [as president] whos never run anything before. He was preaching to the choir. The list of potential 2016 GOP presidential candidates is dominated by governors. Alongside Christie, theres John Kasich (Ohio), Scott Walker (Wisconsin), Bobby Jindal (Louisiana), Mike Pence (Indiana) and Rick Scott (Florida). And dont forget Floridas former Gov. Jeb Bush and Arkansas ex-Gov. Mike Huckabee, who are considering presidential runs as well. But if you look across our nations whole history, its hardly clear that former governors make the best presidents. The ranks of governors-turned-presidents include not just the Roosevelts, after all, but also Grover Cleveland, Calvin Coolidge and Jimmy Carter. Governors fate during presidential elections has ebbed and flowed, reflecting shifts in how Americans think about government itself. Before the American Revolution, colonial governors were appointed by the British crown. Americans in the early republic continued to view them with suspicion: In seven of the original 13 states, governors were elected for just one-year terms. The job was certainly no steppingstone to the White House. After George Washington, the next five presidents were vice presidents or secretaries of State when they ran. When Alexis de Tocqueville came to America in the 1830s to study its democracy, one politician told him, The governor counts for absolutely nothing and is only paid $1,200!, After the Civil War, governors started to come into popular favor. In 1876, both parties nominated a governor for president. Although New York Gov. Samuel Tilden won the popular vote, Ohio Gov. Rutherford B. Hayes received the majority in the electoral college. (It was the Bush vs. Gore election of its day.) For 52 of the next 68 years, the Oval Office was occupied by former governors. State governments in the early 1900s became laboratories of democracy, as future Supreme Court Justice Louis Brandeis called them, experimenting with workplace safety regulation and a host of other reforms. That made state governors like Theodore Roosevelt and Woodrow Wilson into much more prominent figures, who moved easily onto the national stage. But after World War II, experience in Washington came into vogue. All of our chief executives from Truman to Ford were former members of Congress, with the notable exception of ex-Gen. Dwight D. Eisenhower. Amid the national security concerns of the Cold War, voters wanted their commander in chief to be someone who knew his way around the federal government. Writing in 1959, pollster Louis Harris wondered whether an ex-governor could ever win the presidency again. In a cosmic, atomic, mass-media age, governors have shrunk to  local figures, Harris wrote. But the tide would turn again in the 1970s, when the Watergate scandal soured Americans on Washington pols. At the same time the rise of modern conservatism devolved many powers to the states and made Washington, D.C. a term of derision and scorn. Starting with Carter in 1976, four of the next five presidents were former governors. Then came a U.S. senator, Barack Obama, who beat the trend. He defeated a fellow senator (John McCain) the first time around and an ex-governor (Mitt Romney) the next. His party appears likely to select another ex-senator, Hillary Rodham Clinton, to run in 2016. So despite all the GOP governors lining up to be the presidential nominee, dont be surprised if Republicans choose instead a senator with a national profile  say, Ted Cruz, Marco Rubio or Rand Paul. The scope of the federal government has greatly expanded during the Obama years, in the realms of healthcare, the National Security Agency and immigration. And the more influence that the federal government exerts on voters, the more they see the advantages of a candidate from inside the Beltway. Like it or not, that makes Congress  not the statehouse  the more likely training school for our next president. Jonathan Zimmerman teaches history and education at New York University. He is the author of \"Too Hot to Handle: A Global History of Sex Education,\" which will be published in March 2015. Follow the Opinion section on Twitter @latimesopinion, ]", "Date": "20141223", "Title": "[Governors may not have edge in 2016 presidential race]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-1224-zimmerman-governors-turned-presidents-20141224-story.html", "Author": "NULL"}