{"Content": "[The Republican National Committees plans for the 2014 midterm election went far beyond taking control of Congress: They were to put in motion a massive technology push aimed at capturing the White House in 2016. The party vowed to catch up with  even leapfrog over  the Internet wizards who helped orchestrate Barack Obamas victories. The blueprint called for a nationally synchronized technology platform to collect every piece of information obtained about voters by every Republican running for office, whether for city council or the U.S. Senate. The eventual presidential nominee would be endowed with reams of real-time data that could be used to target voters with unprecedented efficiency and precision. But that promised innovation has run into the head winds of contract disputes, suspicions about data firms political loyalties and friction with the tea party. Voter information is being collected out in the field by a jumble of firms not always working in concert. Among them is a Koch brothers-funded outfit that one day could eclipse the national GOPs. As a result, Republicans are heading toward 2016 with that crucial data being collected in systems that dont communicate seamlessly, experts say  and may not by election day. There is a clear sense on the Republican side that they need to catch up, said Eitan Hersh, a Yale University political science professor and expert on political data mining. But there is not a clear sense of how they should be doing it, and who should take the lead. In Washington, RNC officials take exception to any suggestion that the party is lagging behind. They say Republicans are positioned exactly as they should be following an enormous investment in technology talent and infrastructure that helped them bolster their House majority and win control of the Senate in November. But the GOP doesnt have what the Democrats do. Candidates on that side, from the top of the ticket to the bottom, utilize the same computer platform in all 50 states. Every time a volunteer in the field talks to a voter, information is added to a mega-file. The party endorses one product that every state works through, called VoteBuilder. The honest truth is, Democrats are ahead of Republicans because of their fundamental belief in the collective, said Vincent Harris, digital director of last years reelection campaign for Senate Majority Leader Mitch McConnell (R-Ky.). This is very much a clash of ideologies, playing out through campaign tactics. Inside the Republican Party, it also has been a clash of consultants. A firm run by close associates of Karl Rove  advisor to President George W. Bush and a polarizing figure in the party  oversees the RNC project. But some activists worry the effort is out of touch with the Silicon Valley culture of information sharing, hampering efforts to overtake the Obama machine that so successfully embraced the tech industrys ethos. Rep. Dave Brat, for one, galvanized the grass roots with technology not integrated with the Rove-affiliated products when he unseated powerful and deep-pocketed House Majority Leader Eric Cantor of Virginia in last years GOP primary. There has been no arrangement made for the RNC to have access to this data, said Nancy Smith, who advised Brat, a tea party favorite, on software. She said that conservative activists see the national partys inability to unify all its candidates around a single system as a reason Republicans keep slipping in Virginia, a presidential battleground state. There is a real belief that we would do better in Virginia if we had the tools, Smith said. Brat used a company called rVotes; its owner, Steve Adler, helped invent the platform Obama used. You cant just say you are going to do something like this and expect it to happen, Adler said of RNC assurances that its technology effort will be able to outperform the Democratic National Committees VoteBuilder in 2016. Republican officials argue that their mash of technologies can easily be coordinated to collect, store and manipulate a central trove of data as effectively as VoteBuilder can. Most candidates who ran in 2014, they said, fed their data into a voter file that the national GOP says is now the most extensive and current in the country. We believe in free markets and innovation, said Katie Walsh, chief of staff at the RNC. We believe competition makes everything better. I dont believe the party or any company should be saying, This is the product, go use it, thats it., One thing is clear: The Republican Party does not have full control over data collected in the field. A growing chunk of it is under the stewardship of a firm bankrolled by the billionaire conservative activists Charles and David Koch. The company, i360, emerged as Republicans scrambled to rebuild their technology infrastructure. It takes a different approach than startups like rVotes, which help clients collect data and upload it to the RNC or anyone else the client wishes. i360 holds onto much of the data itself. In 2014, the company agreed to deposit that data into the RNCs national voter file. Such an agreement has not been reached for 2016. Its a source of anxiety for the RNC, because i360 is proving to be popular with candidates. As more use its technology, the Koch network gains influence over the voter data Republicans across the country need to mount their campaigns. Some worry that i360 could decide to block Republican candidates who dont hew to the Koch agenda from accessing key voter information. It is very dangerous to put a company that has no accountability to anyone and is not elected to anything in charge of the data people need to run for office, Walsh said. McConnell did not use i360 for his successful reelection effort. Nor did his campaign heed the call to embrace a platform named Beacon, which many were promoting as the answer to VoteBuilder. I am glad we didnt because, if we had, nothing would have been finished, Harris said of Beacon, since mothballed. McConnell instead embraced a hybrid approach that the RNC now encourages candidates to take, tapping into party data but using tools from an independent firm. But Harris said officials in Washington did not seem particularly excited about the pioneering firm McConnell chose, NationBuilder, which also does work for politicians who brand themselves as progressives. There is this concern that if your data is with a bipartisan company, it will slip into the hands of the enemy, Harris said. Paranoia is keeping us from progressing. Twitter: @evanhalper, , June 19, 10:55 p.m.: This article has been revised throughout for additional details and for clarity. The first version of this article was posted on June 18, 3:00 a.m.]", "Date": "20150619", "Title": "[Republicans lag behind on voter information]", "Link": "http://www.latimes.com/nation/la-na-republicans-voter-data-20150618-story.html", "Author": "[Evan Halper]"}