{"Content": "[With Mondays release of landmark rules to combat global warming, President Obama is putting into place what probably will be the last piece of his ambitioussecond-term agenda one that highlights deep divisions in the country and helps shape the race to succeed him. On immigration, healthcare, same-sex marriage and now climate change, Obama has aggressively used the powers of his office to align public policy with the values and aspirations of a largely urban, liberal and minority constituency heavily concentrated on the East and West coasts. In the process, he has courted a backlash from Republican constituencies and states  an older, whiter population concentrated in the South and the nations interior. That division was plain to see in reactions to the new rules, which aim to change how the nation generates electricity in order to cut emission of carbon dioxide and other gases blamed for warming the worlds climate. Over the next 15 years, the plan would aim to sharply reduce the use of coal and ramp up the use of wind and solar power. Currently, coal accounts for almost 40% of the nations electricity, while wind and solar produce about 5%. By 2030, if the administrations plan works, renewables would account for 28% of U.S. power generation, edging past coal at 27%. The plan would boost efforts already underway, mostly in coastal states, led by California, to greatly increase the use of renewable power. But for those parts of the country still heavily reliant on coal, nearly all of them Republican-governed states in the Midwest, Great Plains and South, the rules would force a major economic transition that many elected officials have vowed to resist. Interested in the stories shaping California? Sign up for the free Essential California newsletter >>, Democratic presidential hopefuls quickly lined up to praise the plan. Republicans, who have accused the administration of waging a war on coal, attacked it. Obama is scheduled to formally unveil the regulations on Monday, but administration officials released an outline on Sunday. Our countrys clean-energy transition is happening faster than anybody anticipated, Environmental Protection Agency chief Gina McCarthy told reporters in a conference call. The new rules will accelerate those trends and maintain the reliability and affordability of the nations electrical supply while slowing climate change, she said. The EPA will issue the rules using its authority under the Clean Air Act, meaning that Obama does not need to seek congressional approval. But opponents of the plan have already said they would try to block it in court. Anticipating lawsuits, the administration dropped some elements of a preliminary proposal it issued in June 2014 and gave states an additional two years, until 2022, to comply with the new rules. But administration officials say the new plan will deliver a somewhat bigger cut in carbon emissions than they had projected last year. Thats largely because emissions from power plants are already dropping, McCarthy said. Taking into account the improvements already underway made the lift we had to achieve a lot lower, she said. Overall, the EPA estimates the plan will reduce emissions from the nations electrical industry by 32% compared with the level in 2005, which is the baseline the administration uses. Because electricity generation accounts for about one-third of U.S. carbon emissions, reductions from power plants would be a major step toward the administrations goal of cutting total U.S. emissions by 26% to 28% over the next 15 years. The EPA estimates that the rule will add $8.4 billion to utility costs over that period, but will yield at least four times that amount in benefits, said White House senior advisor Brian Deese. The utility industry already spends about $100 billion a year on plants and equipment, McCarthy noted. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, Administration officials see the new rules as a significant enticement to get other countries to commit to reducing their greenhouse gas emissions in global talks. Negotiations are scheduled to convene in Paris in December with hopes of achieving a new international agreement on combating climate change. But some environmental advocates say the administrations plans are already too weak to stop the warming of the worlds climate. They are likely to carefully scrutinize the new plan for signs that the administration made too many concessions to industry. Major environmental organizations withheldmost comment on the new plan Sunday, saying they needed time to study the details. Political figures were less reticent. Hillary Rodham Clinton, the front-runner for the Democratic nomination to succeed Obama, issued a statement calling the plan a significant step forward and saying that as president, Id defend it. Other Democrats seeking the nomination followed Clintons lead. The main contenders for the Republican nomination, by contrast, were all already on record opposing the administrations plan, which has been under development for several years. Most have also expressed doubts about whether climate change is a significant problem that requires a government response. By a coincidence of the calendar, as the administration began publicly outlining its plans, many of the leading candidates for the Republican nomination were at a gathering of wealthy donors assembled by Charles and David Koch, the billionaire brothers who have heavily funded efforts to oppose government regulation of the economy, particularly the energy industry. Speaking to that gathering, at a resort hotel in Dana Point, Sen. Marco Rubio (R-Fla.), one of the presidential aspirants, said the new plan will make the cost of electricity higher for millions of Americans and will achieve nothing because any U.S. reductions will quickly be overwhelmed by increased emissions from other countries. As far as I can see, China and India and other developing countries are going to continue to burn anything they can get their hands on, Rubio said. We must balance our interests for the ecology, which is legitimate, with our interest for the economy, he added. Jeb Bush, in a statement, called the administrations plan irresponsible and overreaching and said it would throw countless people out of work and increase energy prices. The stark political divide means the administrations plan for reshaping the power industry will join an already lengthy list of major policies up for grabs in the 2016 election. In addition to Obamas big domestic initiatives, the list includes the proposed agreement to limit Irans nuclear programs and the warming of U.S. relations with Cuba. The administrations plan would give each state a target for reducing emissions and ask them to come up with detailed blueprints for achieving those goals. Those blueprints could include a wide range of techniques, including increased use of renewable fuels, expanded use of nuclear power, closing older coal-fired plants and improvements in energy efficiency. The plan will include incentives for states to expand renewable energy use early in the process and to invest in cleaning up dirty plants in low-income areas that have often suffered the worst effects of pollution. A new president who opposed the plan could try to repeal it entirely or give states waivers from compliance. In the meantime, both sides will head quickly to court. Opponents are urging states to go slow until that litigation is over  a strategy that could significantly delay the plans effects. Earlier this year, for example, Senate Majority Leader Mitch McConnell (R-Ky.), a major defender of the coal industry, sent a letter to governors urging them to refuse to comply. The administrations plan goes far beyond the EPAs legal authority, he said, predicting that the courts are likely to strike it down. ALSO:, Northern California fire explodes; 24 homes lost, thousands threatened, Second American is accused of illegally killing lion in Zimbabwe, Seeking safety in Mexico City, journalist found death]", "Date": "20150802", "Title": "[How Obama's new emissions rules will likely shape the White House race]", "Link": "http://www.latimes.com/nation/la-na-obama-climate-20150802-story.html", "Author": "[David Lauter]"}