{"Content": "[To the editor: Ralph Nader answered his own question in the 2000 presidential campaign: so a third party candidate can be a spoiler. (\"Ralph Nader: Why run for president if you dont have a real chance?,\" op-ed, May 15), George W. Bush won the popular vote in Florida by 537 votes, giving all of the states electoral votes to him rather than Vice President Al Gore. Nader received 97,488 votes in Florida, and several studies conducted after the election indicated that about half of Naders votes would have gone to Gore and about one quarter would have gone to Bush. Without Nader, Gore would have been elected president. Nader makes the case for third-party candidates, but there are clear downsides to such campaigns, as the 2000 election demonstrates. Dan Caldwell, Malibu, The writer is a distinguished professor of political science at Pepperdine University. .. To the editor: Naders astute reading of the 2016 presidential contest puts the blame on the media for focusing on the likely winner among the 50 shades of purple while ignoring alternatives. However, a voters role is not to pick the winner. Your vote does not \"belong\" to anyone. Your job is to choose the candidate who resonates with your interests, regardless of what others may say about his or her chances of winning. Third parties almost always offer that choice; they may not win, but more votes will get them  and your interests  on the stage or better, where they belong. Tim Clark, Los Angeles, .. To the editor: Apparently, Nader didnt ask himself his own question before his fourth ego-motivated run for president in 2000, when his candidacy played a major role in giving us Bush and the ensuing disastrous wars in the Middle East. It amazes me that he would now have the audacity to suggest that primary voters of each party dont have real choices in selecting their candidates for president. He is obviously bemoaning that third-party candidates dont have a chance at the presidency in the U.S. and perhaps one day there will be a third party strong enough to succeed. Until then, Nader should face his own losses and get over it. Diane Ohanian, San Diego, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150520", "Title": "[Ralph Nader can't escape it: His '00 candidacy gave us President Bush]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-0521-thursday-ralph-nader-20150521-story.html", "Author": "NULL"}