{"Content": "[The Summer of Sanders  as in Bernie, the Vermont socialist and long-shot presidential hopeful  has featured big crowds flocking to hear the U.S. senators fist-shaking message: 8,000 in Dallas, 10,000 in Madison, 11,000 in Phoenix. The impressive swarm recalls the hordes attracted by another underdog, then-Sen. Barack Obama in 2008, and, before that, Howard Dean, a Vermonter who climbed from nowhere to emerge, for a time, as the Democratic front-runner in 2004. It is, in many ways, familiar. In 1980, Sen. Edward M. Kennedy of Massachusetts rose from the left to torment the party establishment favorite, a role Californias Alan Cranston played in the 1984 race. Theres always restiveness on the left, said Joe Trippi, who managed Deans presidential campaign. Always. The challenge  one that outmatched all those insurgents, save Obama  is turning curiosity into support, and turning that support into something more than a protest movement, or a way for the discontented to let off steam. Politically, its the difference between long-term commitment and a summer fling. No two campaigns are alike. And if anyone has proved vulnerable to an upstart challenge, its Hillary Rodham Clinton, who seemed every bit as formidable a front-runner in 2007 as she appears today. But even Sanders senior campaign advisor concedes it will be hard to deny Clinton the Democratic nomination this time. Shes a great candidate, said Tad Devine. Shes going to have a broad base of support. But difficult is not impossible. Well have to convince voters [Sanders] program will make a much bigger difference in their lives than whats she talking about, Devine said, and proposals like free college tuition and a $1-trillion infrastructure program offer a lot to work with. Sanders, who plans a rally this Monday night at the Los Angeles Memorial Sports Arena, is no fringe candidate. His message condemning corporate power and Wall Street malfeasance, and decrying income inequality and lamenting the squeeze on the middle class, resonates with many in these still-anxious economic times. He benefits too from the explosion of social media. The Internet has opened the spigot to millions in donations and allowed anyone with an onlineconnection to hear the Vermont senators message first-hand. Unlike the olden days, way back in the 20th century, money and attention are no longer so hard to come by. The fact Sanders has been hammering populist themes his whole career  while modeling the fashion sense of an unmade bed  lends an authenticity that Clinton, with her reputation for political shiftiness, cannot hope to match. While she is staying as close to the center as she can and still be a Democrat, Bernie is pushing those topics that Democrats have represented for decades, said Ryan Ellsworth, 38, a Des Moines architect who plans to support Sanders when Iowa casts the first votes of 2016. He is speaking to things that people are passionate about and not calculating what people want to hear. Sanders platform is unreservedly liberal: higher taxes on the wealthy, government-run universal healthcare, a breakup of the nations big financial institutions. Pitching a $15 federal minimum wage, he calls the struggle of the working poor a national disgrace. Clinton, characteristically, is more measured. She, too, backs a higher minimum wage, but not $15 for workers everywhere. What you can do in L.A. or in New York may not work in other places, she says. There are many on the left  anywhere from a quarter to a third of those surveyed  who would like to see a Democrat other than Clinton elected president, or, at the least, make a serious run at the nomination. Partly thats human nature. People like a contest, said Anita Dunn, who helped former New JerseySen. Bill Bradley wage an uphill 2000 Democratic primary fight against Vice President Al Gore, the eventual nominee. These are elections, not coronations. Some, like Nadia Kayyali, a San Francisco privacy rights attorney and Sanders supporter, say they would rathersit out 2016 than back the former first lady. The only functional difference between Hillary and a Republican is reproductive rights, said Kayyali, 33, one of several thousand who attended the recent Netroots Nation progressive gathering in Phoenix. But there are many others like Chris Mills, 29, a political independent who helped create the Warren/Sanders 2016 Facebook page in the vain hope Massachusetts Sen. Elizabeth Warren would challenge Clinton from the left. Mills, an information technology worker in Grand Rapids, Mich. is pleased that Sanders, at least, is running. Clinton has a respectable history and an impressive record, he said, but is too beholden to corporations. That said, Mills could end up voting for Clinton in November 2016 if she moves Sanders way and adopts a more labor-friendly agenda. He is not alone. A June Wall Street Journal/NBC poll gave Clinton a 75%-15% lead over the independent senator, consistent with other polls. More importantly, 92% of those asked said they could eventually support Clinton, which suggests many on the left ultimately would rally behind the Democratic nominee, whoever it is. Clinton enjoys other advantages. She is no stranger to the black and Latino communities, two pillars of Democratic support and major voting blocs once the nominating fight moves past the largely white confines of Iowa and New Hampshire. Sanders, an independent most of his political life, is competing against a Democratic stalwart who has built relationships in the party going back more than 40 years. Thats not easy to overcome. Moreover, his policy prescriptions have gone largely unchallenged, which could change overnight if Sanders becomes a real threat to Clinton. Now is the high season for political activists, a time the purists and true believers engage while more casual voters focus on vacation, baseball and the like. That helps someone like Sanders who offers the boldest, most undiluted vision of where Democrats, and the country, ought to go. The true test will come when summer sets, to see if those big crowds keep turning out, or grow even bigger. mark.barabak@latimes.com, Follow  @markzbarabak fornational & California politics. Aug. 5, 9:21 p.m.: Updated with Sanders plan to hold a rally at the Sports Arena in Los Angeles.The first version of this articleposted July 28 at 3:00 a.m.]", "Date": "20150805", "Title": "[Bernie Sanders is drawing big crowds -- but how long will they stick around?]", "Link": "http://www.latimes.com/nation/politics/la-na-sanders-democrats-analysis-20150729-story.html", "Author": "[Mark Z. Barabak]"}