{"Content": "[With the White House nailing down crucial Democratic support for its nuclear deal with Iran this week, the fight in Congress about the agreement looked to be all over but the shouting. So on Wednesday, the shouting began. A lineup of conservative politicians and media figures, including rival GOP presidential candidates Donald Trump and Sen. Ted Cruz, rallied opponents of the deal on Capitol Hill with intense rhetoric and nuclear winter imagery. Inside the Capitol, Republicans struggled to agree on how to move forward with an all-but-doomed effort to block the multinational agreement. Meanwhile, Democratic candidate Hillary Rodham Clinton revealed how she plans to navigate the tricky politics of defending the pact, striking a newly hawkish stance. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, If the agreement goes forward as expected, \"the single most important issue in 2016 will be stopping Iran from acquiring a nuclear weapon,\" Cruz declared to thousands gathered under the sun on the West Lawn of the Capitol. \"And any commander-in-chief worthy of defending this nation should be prepared to stand up on Jan. 20, 2017, and rip to shreds this catastrophic deal.\", Its far from clear that voters will agree with Cruzs assessment of the role that the agreement, in which Iran agrees to limit its nuclear program and allow independent inspections in exchange for the U.S. and five other world powers lifting crippling economic sanctions, will play in the presidential election. Polling shows the public debate has not yet penetrated beyond pockets of passionate constituencies. A Pew Research poll released Tuesday found that support for the deal has fallen 12 percentage points since it was announced in July, to 21%, while opposition is holding essentially steady at around 45%. The number of people who have no opinion and little awareness of the deal, however, has grown. That group will be the target of both Democrats and Republicans as the presidential campaign kicks into high gear this fall, and Wednesday offered a preview of the persuasion tactics. In a speech at the Brookings Institution in Washington, Clinton sought to assuage the deep concerns of Israels supporters, whose money and votes she needs for her presidential bid, with an accord that she said is the worlds best hope to stop Iran from obtaining a nuclear bomb. \"Either we move forward on the path of diplomacy and seize this chance to block Irans path to a nuclear weapon or we turn down a more dangerous path leading to a far less certain and riskier future,\" Clinton said. But Clinton also made clear that \"there is absolutely no reason to trust Iran,\" as she offered a notably hawkish strategy for pressuring Tehran to abide by the agreement, shoring up Israeli security and thwarting the alliances Iran has with organizations the U.S. considers to be terrorist. \"This is not the start of some diplomatic opening,\" Clinton said. \"My starting point will be one of distrust.... We should anticipate that Iran will test the next president. They will want to see how far they can bend the rules. That will not work if I am in the White House.\", Such reassurances would probably have little impact on the conservatives gathered at the rally organized by the Tea Party Patriots, a group that helped arrange the protests against President Obamas healthcare law years earlier. Speakers argued that the deal could result in nuclear destruction, killing millions, and quoted Israeli Prime Minister Benjamin Netanyahus assertion that it represented an \"existential threat\" to Israel. Protesters carried signs reading \"What part of death to America, death to Israel, dont you understand?\", \"After World War II, the world made a promise after we saw the slaughter of innocents: never again,\" said TV host and author Glenn Beck. \"Never again is now. In time, Iran will be able to accomplish more than Hitler did.\" Former GOP vice presidential nominee Sarah Palin and former Rep. Michele Bachmann also addressed the group. Trump also cast the deal as a threat to Israel  but he did not go as far in his rhetoric or his promises as Cruz. Trump has not vowed to rip up the deal if elected, but to \"police\" and \"renegotiate\" it. \"Never, ever, ever in my life have I seen any transaction so incompetently negotiated as our deal with Iran. And I mean never,\" he said Wednesday. \"We are led by very, very stupid people.\", If elected, he would negotiate a deal that would free four American prisoners in Iran before he took office, he said, and America will start \"winning\" again. \"We will have so much winning if I get elected that you may get bored with winning,\" he said to cheers. \"Believe me. I agree. Youll never get bored with winning. We never get bored.\", The rally was Trumps first high-profile trip to Capitol Hill since becoming the front-runner for the GOP nomination, and it was little surprise that he chose not to visit with his partys increasingly unpopular congressional leadership, but instead to rally outside the Capitol. Senate Majority Leader Mitch McConnell of Kentucky and House Speaker John A. Boehner of Ohio were repeatedly booed by the crowd. Although 42 senators aligned with Democrats have declared their support for the deal, giving the White House enough votes to keep the Senate from even sending a disapproval resolution to the president, Cruz said the two Republican leaders could block the deal if they wanted. He argued that GOP leadership could claim that the White House had not met the deadline for disclosing the terms of the deal to Congress because \"side deals\" with Iran have not been detailed. Enough House Republicans agreed, in an unexpected setback for Boehner. The House was expected to move ahead with its disapproval resolution on Wednesday, but a key procedural vote was abruptly delayed as lawmakers debated new strategies to stop the deal. Despite the debate, the outcome seemed clear and the White House seemed confident of its success. Spokesman Eric Schultz mocked the House Republicans plan as something informally \"hatched up\" at the last minute. kathleen.hennessey@latimes.com;tomanmiller@latimes.com, Twitter: @khennessey;@tomanmiller, Times staff writers Evan Halper and Lisa Mascaro in Washington and Christi Parsons in Warren, Mich. contributed to this report.]", "Date": "20150909", "Title": "[Republicans rally to denounce Iran deal, despite dwindling chances of stopping it]", "Link": "http://www.latimes.com/nation/la-na-iran-deal-politics-20150910-story.html", "Author": "[Kathleen Hennessey]"}