{"Content": "[WASHINGTON -- The austere Republican budget proposal from Rep. Paul D. Ryan would slash federal spending to pre-Eisenhower levels, but the \"turbo cuts\" on every aspect of government -- except the military -- are still not enough to reach his promise of balancing in a decade. Ryan, the House Budget Committee chairman, relies on a combination of previously approved Obamacare savings and tax hikes, along with a new way of measuring economic growth, to reach the 10-year goal of ridding the budget of red ink. That approach does not sit well with hard-line budget hawks, and could make Ryans job even more difficult as the House prepares to vote on the budget next week. GOP leaders are confident this fourth annual budget from Ryan, the former vice presidential nominee from Wisconsin, will have enough Republican votes to pass the House -- despite weeks of internal debate over whether it was politically viable to roll out a do-over of his controversial reforms in an election year. \"We think we have an obligation to lead and show how we would do things differently,\" Ryan said Tuesday in a conference call. \"We think its important to show people our vision.\", The vote is essentially nonbinding, because the budget document is merely a statement of principles and does not carry the force of law. President Obamas own budget for fiscal 2015, released earlier this year, similarly comes with no strings attached. But the blueprints serve as defining documents before the midterm election, and Democrats all but thanked Ryan for reviving his signature ideas for changing Medicare, cutting spending and reducing taxes for the wealthy. \"Budgets are about choices and values,\" White House spokesman Jay Carney said. \"House Republicans have chosen to protect tax breaks for the wealthiest rather than create opportunities for middle-class families.\", \"We might as well call it the Koch budget,\" said Senate Majority Leader Harry Reid (D-Nev.), referring to David and Charles Koch, the billionaire industrialists who have spent millions to elect Republicans and pursue small-government principles -- a blueprint, Reid said, for a \"modern Kochtopia.\", Ryans budget is again long on vision but short on details, as he leaves many of the specifics to be decided later. For example, the budget fully repeals the Affordable Care Act, but counts $1 trillion in tax revenues and more than $700 billion in savings from Obamacare toward his bottom line. Ryan defended this approach, saying the Obamacare taxes would eventually be done away with because his budget also calls for an overhaul of the tax system. But finding consensus on tax policy, even within the Republican Party, has proved difficult. A sweeping outline from the GOP chairman of the tax committee, Rep. Dave Camp of Michigan, landed with a thud this year in the House. This week, Camp announced he would retire at the end of his term. Even more, tax experts have said Ryans quest to push down top individual tax rates to 25% from 39.6% for the wealthiest Americans cannot be done without incurring costs or doing away with tax breaks that would essentially raise taxes on middle-class earners. This was a key debate issue during the 2012 presidential campaign, when Ryan was on the ticket with Mitt Romney. At the same time, Ryan relied for the first time on a new measure of the benefits of deficit reduction that Democrats argued was applied selectively to ensure that his budget would balance. Ryan can afford to lose about 15 Republicans on the vote, and it remains uncertain whether GOP hawks who have pressed for a balanced budget will pan his accounting methods or simply support their partys document as a blueprint. Obamas budget never balanced. Democrats have already panned Ryans effort. Rep. Chris Van Hollen of Maryland, the top Democrat on the House Budget Committee, said the turbo cuts are more than twice as deep as those in the so-called sequester, which both parties backed away from last year as too draconian. Budget office record-keeping, the congressman added, does not appear to go back far enough to show a time before the Dwight Eisenhower administration when funding for education, roads, healthcare and the rest of the governments nondefense was proportionately as low. lisa.mascaro@latimes.com, Twitter: @lisamascaroinDC]", "Date": "20140401", "Title": "[Paul Ryan budget cuts deeply -- but will it balance as promised?]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-paul-ryan-budget-20140401-story.html", "Author": "NULL"}