{"Content": "[Does the 2016 presidential campaign seem chaotic? For good or ill, thats because it is. The rise of Donald Trump on the right and Bernie Sanders on the left is proof that the countrys two major political parties have lost their grip on the nominating process. They can still provide two guaranteed spots on the ballot, for a self-identified \"Republican\" and a self-identified \"Democrat.\" But thats pretty much all. It wasnt too long ago that party bosses picked candidates at the national conventions, in proverbial smoke-filled backrooms. The two parties also controlled everything crucial for winning the presidency: The money needed to fund a campaign, and the organization needed to build support. Primaries and caucuses of course killed the conventions; for at least 35 years theyve been purely ceremonial. The 1976 GOP convention fight in which Ronald Reagan challenged President Ford for the nomination was the last time there was any suspense in the outcome for Republicans. Nothing dramatic has happened at a Democratic National Convention since 1980, when Sen. Edward M. Kennedy sought a change in party rules to open a challenge on the floor to President Carter. Lately, technological change has disrupted fundraising and networking as surely as the primary system disrupted the conventions. In the 2004 cycle, Howard Dean stunned the Democratic Party by using the still fairly primitive Internet to demolish the party record for fundraising  set by President Clinton in his 1996 reelection campaign  and communicate with supporters. (I was Deans campaign manager.), Yes, Dean failed. But four years later, Barack Obama succeeded using the same techniques: leveraging online fundraising and nascent social media to defeat the Democratic establishments chosen candidate, Hillary Rodham Clinton. He brought in more money  half a billion dollars from millions of Americans giving less than $100 each online  and attracted more volunteers than any party-backed pol before him. This campaign season, a combination of small-dollar giving over the Internet and \"super PAC\" funding is sustaining the largest Republican field in history. Long-shot candidates typically do not leave the field because they are low in the polls; they leave because they cant afford an airplane ticket to the next debate or the next state. But the Republican Party cant cut off Ted Cruzs tea party revenue stream or prevent Rand Paul from soliciting money over Twitter. The parties can also do nothing to stop disfavored candidates from attracting attention. On the Democratic side, Sanders is a self-avowed democratic-socialist and independent senator from Vermont who has never before run as a Democrat. Running for the Democratic nomination is just the easiest path to a spot on the ballot in the general election. The establishment may not like his style, but, with Internet buzz, who needs an endorsement from party regulars?, Candidates relying on and playing to the party establishment are failing, while candidates adept at breaking party norms are gaining ground or taking the lead. Thats in part because the parties loss of control over the nominating process has coincided with the decline in their brands. People are almost embarrassed to call themselves Democrats or Republicans, so even candidates avoid party labels and are instead building their own brands. Brand Sanders is rolling. The Democratic Party couldnt stop his money or kill the energy in his campaign if it tried; and if it did try, it would only help Sanders raise more money and generate even more energy. Likewise, the master of personal branding, Trump, is dominating the fight for the GOP nomination. The establishment can react in horror when he insults crucial constituencies , Latinos, women  but his supporters rush to defend him on social media and Trump goes up in the polls. Now Ben Carson is surging, riding word-of-mouth to join Trump as co-front-runner in Iowa. None of this is to say that the establishment candidates will lose in 2016, but whoever wins wont have the establishment to thank. Jeb Bush or Clinton or whoever will win on the strength of a personal brand. The party brands have run out of steam. The only thing surprising about this situation is that it seems to have come as such a surprise to party leaders. Somehow they have been blind to how vulnerable they are to insurgents, and even more blind to a successful third-party independent candidacy at some point soon. If any candidate surprises in Iowa or New Hampshire, he or she will have millions of dollars within hours and hundreds of thousands of volunteers signing up within days  and like it or not, that is something the parties can no longer stop. Some are comparing the 2016 campaign with a circus. This isnt a circus. This is just what it looks like when political parties lose power. Democratic and Republican leaders alike should prepare to be surprised. Joe Trippi is a Democratic strategist and media consultant who ran Howard Deans campaign for president and was a media advisor to Gov. Jerry Brown in 2010. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150903", "Title": "[As Trump and Sanders rise, the two major parties fall]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0903-trippi-end-of-parties-20150903-story.html", "Author": "NULL"}