{"Content": "[When Jeb Bush was born, his big brother didnt exactly celebrate the news. As a kid, George viewed him as a completely unnecessary addition to the family, John Ellis, a Bush cousin, recounted years later. Jebbie was just a pain. I think that carried on for a long time. Sibling relations can be fraught, a tangle of love, envy and compassion. In that way, Jeb and George W. Bush  separated by nearly seven years and vastly different life experiences  are no different than any other set of brothers. But they are, of course, like no other: Theyre part of a political dynasty, and their dramas play out for the world to watch, their personal history entwined with that of their country. As he strives to become the third member of his family to win the White House, Jeb Bush bears the blessings as well as the burdens of that heritage and, especially, the legacy of his brother, who left the presidency a scant 6 years ago amid an unpopular war and the near-collapse of the U.S. economy. Conflating the two, however, masks a more complex relationship, marked by fierce rivalry, wounded feelings and long periods of estrangement. Though they share the same political philosophy  both are more conservative Republicans than their father, President George H.W. Bush  they have never been personally close. Stylistically, they stand poles apart: George W. Bush, 68, outgoing and gregarious, using gut instinct as a guide; Jeb Bush, 62, introverted, data-driven and happiest burrowing in the nooks of a briefing book. Ron Kaufman, an old family friend, remembers seeing the pair once at a black-tie dinner, where George W. Bush, then Texas governor, was in his back-slapping element. Jeb Bush, Floridas new governor, was politely pleasant but his eyes were saying hed rather be back in Tallahassee, Kaufman recalled, working on the state budget. One constant, though, has been loyalty, to the family cause and one another. Jeb Bushs most politically difficult moments of the 2016 campaign surround his fumbling response when asked whether he supported the Iraq war his brother started. Bush took several days, shaping and reshaping his answer, before flatly declaring that, in retrospect, the invasion should never have taken place. A few days later, it was news when Bush took issue with his brothers fiscal policies, suggesting he should have been quicker to wield his veto pen. He could have brought budget discipline to Washington, D.C. Bush said. Such public breaches, however, are extremely rare. I love my mom and dad, Bush recently told a New Hampshire audience. (He sometimes preempts questions about family and fealty by speaking up before asked.) I love my brother, and people are just going to have to get over that. Thats just the way it is. The sentiment, however, was not always reciprocated. When they were young, Jeb was somebody for George to torture, their cousin Ellis recounted in the 2004 book The Bushes: Portrait of a Dynasty. As adults, the two grew even further apart. One advisor to George W. Bushs 2000 presidential campaign recalls him rolling his eyes when his brother chimed in on conference calls, suggesting if they werent related they would probably have nothing to do with each other. From early on the brothers forged strikingly different paths. George W. Bush followed his fathers route through New England prep school and Yale, where he was an unimpressive student. After graduating, he eagerly partook of bachelor life in Houston  I was a spirited lad, he later said with wry understatement  and spent more than a decade knocking about the oil business, with middling success. Bush was married with twin daughters when he finally quit drinking, after a 40th birthday bash that was a haze, save for the hangover. John Ellis Bush, by contrast, breezed through the University of Texas in 2  years, married at age 21 and moved to Florida, partly because of the social ostracism faced by his wife, Columba, a native of Mexico. He became a father at 23  the couple has three children  and grew rich in Miamis booming real estate business. In the early 1980s, he became active in state Republican politics, helped along by the Bush name; his father was then vice president under Ronald Reagan. The year 1994 was pivotal for both brothers. Jeb Bush was running for Florida governor when George W. by then an executive with the Texas Rangers baseball team, unexpectedly launched an uphill bid for governor of his home state. Jeb Bush made no secret of his displeasure, griping that his brothers Texas candidacy turned their twin campaigns into a cute People magazine story. Jeb  the sober, dutiful son  had always been the one expected to assume the Bush political mantle. George W. was good for laughs, but not a lot more. It was a shock then, both inside the family and out, when Jeb lost his race and George W. won. The latter kept eager track of the competition with his sibling, checking the private Florida polling each morning to see where his race stood compared with his brothers. On election night, George W. was struck that his parents seemed more upset about Jebs loss than happy for his victory. Why do you feel bad about Jeb? he asked his father during a phone call that has become political lore. Why dont you feel good about me?, Still, four years later, Bush rallied to help his demoralized brother win a second try for Florida governor, tapping his Texas fundraising base and schooling his supposedly more astute sibling. There is a great lesson of humility ... that George has shown to his great popular benefit, Jeb Bush told the Dallas Morning News before winning his 1998 race. The ability to share credit, to include everybody, to make a point to talk to people who didnt support him. Thats a useful lesson in governance, but it also applies to campaigns. The evolution of the brothers relationship, from condescension to grudging respect, recalls that of another famous pair of dynastic offspring, John F. Kennedy and his younger brother Robert. The older Kennedy spent much of his life dismissing his sibling  he appointed him attorney general largely to appease their father  until they forged a strong bond during the crucible of the Cuban missile crisis. The trial that drew the Bush brothers closer was the 2000 Florida recount, in which Jeb played an important behind-the-scenes role helping deliver the electoral votes that put George W. Bush in the White House. Among Jebs first steps was ensuring his brother locked up the top legal talent in the state, hampering Democrat Al Gore in the rush to the courthouse. When George W. Bush was president, Jeb mostly muffled their differences, though he did speak out against a plan to expand oil drilling off the Florida coast  it was sharply cut back  and challenged aspects of the presidents No Child Left Behind education initiative. A rare social visitor to the White House, Jeb nonetheless benefited during his 2002 reelection campaign from a steady flow of federal dollars to Florida and a parade of Bush administration luminaries. Two years later, with George W. seeking a second term and Florida once more in play, Jeb laid low rather than hurt his brother by risking an association with his political problems. The president carried Florida easily. Their interactions reflect a pattern: Whatever hostilities or hard feelings built up, the two have been there for each other in their times of political need, publicly when it suited them, but more often in less obvious fashion. It is an arrangement, say those familiar with Bush family dynamics, that will likely persist. Sibling rivalry aside, blood is thicker than water, said David Beckwith, who worked in the administration of George H.W. Bush, where he got to know both brothers. W. will do whatever he can to help. Including being invisible, if need be. mark.barabak@latimes.com, Twitter: @markzbarabak, ALSO:, Jeb Bush calls Putin a bully, Once against a White House run for Jeb, Barbara Bush is all in, Not just another Bush? Jeb works to connect with New Hampshire voters as his own man]", "Date": "20150617", "Title": "[Bush brothers have a complex relationship, marked by fierce rivalry, wounded feelings ]", "Link": "http://www.latimes.com/nation/politics/la-na-bush-brothers-20150617-story.html", "Author": "[Mark Z. Barabak]"}