{"Content": "[Diplomats from Iran and six world powers completed what may be their final negotiating session after two years of talks Sunday amid signs that a comprehensive deal to keep Iran from building a nuclear bomb for at least a decade will be announced Monday. After 16 days of bargaining, top officials from the United States and five other world powers that have been negotiating with Iran met Sunday evening for a working dinner that lasted just over three hours. Before the meeting, diplomats said the foreign ministers were aiming to nail down the precise language of the agreement and of the United Nations Security Council resolution that will lay out its terms. The head of Irans nuclear agency, Ali Akbar Salehi, was quoted by an Iranian news agency as saying that technical discussions are almost over, and the text regarding the technical issues with their annexes is almost finished. Earlier in the day, diplomats said that if negotiators completed their work here, the lengthy final text of the deal would be sent to Washington and Tehran for a final review, with the expectation that the terms would be publicly revealed Monday, unless the talks hit a snag. We are working hard, but a deal tonight is simply logistically impossible, said Alireza Miryousefi, a senior Iranian official at the talks. This is a 100-page document, after all. But although the comments from all sides were optimistic throughout the day, the nuclear negotiations have hit last-minute roadblocks in the past, and officials from the U.S. and Iran cautioned that a deal was not yet certain. Secretary of State John F. Kerry and French Foreign Minister Laurent Fabius emphasized in public comments earlier Sunday that difficult decisions remained. Fabius described Sundays meetings as the final stage of talks. Negotiators have failed to meet two deadlines in this round of talks and are facing a third deadline Monday night. If a deal is not reached, Kerry would be under strong political pressure to call at least a temporary halt in the negotiations. If a deal is reached, Congress would have 60 days to review it. The Republican majorities in both houses virtually guarantee that a resolution disapproving the deal will pass, probably in September. President Obama would be certain to veto any such move, and vote counters currently do not think that Congress would have the votes to override a veto. That means the deal would take effect and probably become a significant issue in the 2016 elections, with nearly all the Republican presidential hopefuls pledging to overturn it if elected. Iran, the United States, France, Britain, Germany, Russia and China have spent almost two years trying to work out a deal that would lift sanctions on Iran if it agrees to restrictions intended to prevent it from obtaining a nuclear bomb for 10 to 15 years. Such a deal could resolve, at least for the next decade or more, one of the worlds most worrisome security issues and could bring far-reaching changes in the Middle East. In April, the negotiators, meeting in Lausanne, Switzerland, reached a preliminary agreement. Under it, Iran would mothball two-thirds of its newer high-speed centrifuges that enrich uranium, going from 19,000 devices to 6,104 older machines. It would reduce its stockpile of low-enriched uranium from 7,154 kilograms to 300 kilograms and not build any new facilities for enrichment for 15 years. Those limits, plus inspections to prevent Iran from using new, covert nuclear sites, would greatly restrain its ability to complete a bomb for at least a decade, U.S. and European officials said. Iran would be allowed to continue to enrich fuel, but only to a level useful for a commercial nuclear reactor producing electricity. It would be required to convert a reactor in Arak that was designed to produce plutonium, which can be used to fuel a nuclear bomb. In return, the U.S. and the other world powers would lift many of the economic sanctions that have strangled Irans economy. With those issues largely resolved, the final round of negotiations has focused on a few of the most difficult issues  what access international inspectors would have to Irans suspected nuclear sites, how quickly sanctions would be lifted and what procedures would be used to snap back sanctions if the U.S. and other countries decided Iran was cheating. Iran also insisted that the international embargo on its arms purchases be lifted. Even as they hashed out those issues, however, each side accused the other of trying to reopen issues that had been agreed upon earlier. The negotiators are believed to have settled on a process under which international inspectors will be able to obtain rapid, although not immediate, access to Iranian nuclear sites if they believe cheating has taken place. With those difficult issues under discussion, the process has often seemed close to a successful conclusion  and often close to collapse  in the last week. There were many indications Sunday that the process had swung back toward obtaining a deal. Russian Foreign Minister Sergei Lavrov, who has preferred to keep a distance from the laborious negotiations until decisions were needed, arrived in Vienna on Sunday afternoon. In Iran, Saeed Matazerulmahdi, chief of the Tehran police, announced that officers would provide security if Iranians wanted to celebrate. In Jerusalem, Israeli Prime Minister Benjamin Netanyahu, long an opponent of the negotiations, warned again that the deal was a bad one. To illustrate the risk, he showed Israeli officials a video of President Clintons promises about the 1994 nuclear agreement with North Korea. Clinton promised at the time that the agreement was a good deal that would lead to the dismantling of Pyongyangs nuclear infrastructure. Instead, North Korea soon began violating the agreement and ejected international inspectors. U.S. officials say that the North Korea deal was completed with few safeguards, in part because American officials at the time thought the North Korean government was on the verge of collapse. In the Iran negotiations, by contrast, months have been spent on the verification and enforcement procedures. In Washington, Senate Majority Leader Mitch McConnell (R-Ky.) said that the nuclear agreement would be a hard sell for the administration and that the Senate probably would pass a resolution to disapprove it. Sen. Bob Corker (R-Tenn.), chairman of the Foreign Relations Committee, said his main concern was that Iran would cheat by inches, avoiding any violations that would trigger renewed economic sanctions, but still progressing toward a nuclear weapon. Corker spoke on NBCs Meet the Press, and McConnell spoke on Fox News Sunday. Special correspondent Ramin Mostaghim in Tehran contributed to this report. For more on the Iran talks, follow @RichtPau. 5:52 p.m.: Updated with details on what was agreed to in Lausanne and what the key issues were in the final round in Vienna. 1:44 p.m.: This story was updated with the completion of the Foreign Ministers working dinner. 8:17 a.m.: This story was updated with quotes from Sens. Mitch McConnell and Bob Corker. The story was originally published at 8:08 a.m.]", "Date": "20150712", "Title": "[Iran nuclear deal appears close, announcement may come Monday]", "Link": "http://www.latimes.com/world/middleeast/la-fg-iran-talks-20150712-story.html", "Author": "[Paul Richter]"}