{"Content": "[Hillary Rodham Clinton stepped away from the carefully scripted stagecraft of her nascent presidential campaign Monday to engage with the press  and the questions were immediately unpleasant. The first questions asked by reporters who attended a round tablewith Clinton at a company here that manufactures furniture for small children were not about her economic policy or what she learned from talking with the factory workers. They were about the latest allegations surrounding her familys foundation. After a series of recent media reports detailing large contributions to the foundation from foreign governments seeking favor with the United States, Clinton now faces fresh allegations in a new book about the foundations connections. The candidate was dismissive of the publication, characterizing it as a hit job. We will be subjected to all kinds of distraction and attacks, she said. I am ready for that. That comes unfortunately with the territory. Clinton presided over a round tablewith workers at the company, called Whitney Bros. with the confidence of a front-runner. A newlyreleased CNN poll shows she is some 60 points ahead of the next closest likely Democratic challenger, Vermont socialist Sen. Bernie Sanders. But with a carefully honed humility,Clintonis also making good on the assurances of her campaign staff that she is taking nothing for granted. This is exactly what I want to do, hear from New Hampshire about what is on their minds, she told reporters after a discussion with company employees that touched on vocational education, child care, social security, drug abuse and other issues. I want people to know I am listening. I am accessible and I am running a campaign about them. New Hampshire has long been fond of the Clintons. It was here in 1992 that Bill Clinton coined himself the comeback kid. In the run-upto the New Hampshire primary, his campaign was flailing amid allegations of an extramarital affair with Gennifer Flowers. Clinton, though, endeared himself to New Hampshire voters by traveling tirelessly throughout the state, refusing to let a case of laryngitis get in the way of his nonstop talk-a-thon and charm offensive. He finished a strong second, a catalyst for Clinton to go on to capture the nomination. And it was here in New Hampshire, too, that Hillary Clinton found her footing after a very rough start in Iowa to her 2008 presidential run. The candidates political history in the state stretches back to 1968, when as student at Wellesley College she campaigned for Wisconsin Sen. Eugene McCarthy. McCarthys strong showing upended the race and factored into incumbent Lyndon Johnsons decision to later withdraw from the race altogether. By 2008, Clintons own surprise showing here revived a campaign in desperate need of a jolt. The win came after an emotional primary eve, when the polls showed Hillary Clinton down by double digits and the candidate famously impressed New Hampshire by the way she responded to a voter question about the rigors of the campaign. Seeming to choke back tears, she talked about what inspired her and showed voters a vulnerable, more human side to her personality, which resonated. Clinton is seeking to recreate some of her New Hampshire magic, built on personal interactions and the empathy the Clintons conveyed for their anxieties about the economy. But it is proving more of a challenge this time. As Clinton kicked off her New Hampshire effort Monday, the candidate could not go anywhere without being trailed by the media hordes. The lack of any serious Democratic challengers so far gives her little incentive to go off script, which means authentic moments on the campaign trail are proving infrequent. Clinton, of course, may not need them. Her arrival here was in stark contrast to visits over the weekend by the major GOP candidates, who made their pitches at a political summit. As Clinton limits her interaction with the media and carefully calibrates her time in the spotlight, Republican candidates aremaneuvering for attention. Most of them are garnering at least some by directing attacks at her. It is worth noting that Republicans seem to be talking only about me, Clinton said. I dont know what they would be talking about if I werent in the race. Twitter:@evanhalper]", "Date": "20150420", "Title": "[Hillary Clinton dismisses accusations over foundation's connections]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-clinton-women-new-hampshire-20150420-story.html", "Author": "[Evan Halper]"}