{"Content": "[The fact that Californias electoral logjam was breaking this winter after two decades of stability seemed to presage high drama: Big beams clattering violently downstream, a powerful rush of water, a cleansing whoosh to the political system in the state. Except it hasnt turned out that way. Heres the rundown so far: Barbara Boxer announced that she will retire after the 2016 election from the Senate seat she has held since 1993. Atty. Gen. Kamala Harris, also a Democrat, quickly jumped into the race. And then?, Nothing. A million and one candidates are \"seriously\" considering the Senate race  who would admit to doing so not seriously?  but no one else has formally stepped forward. The absence of visible drama does not mean, however, that nothing at all is happening. Californias political industrial complex was still moving inexorably last week, a little less dramatically but no less potently, as it always does. On Wednesday, Lt. Gov. Gavin Newsom launched his campaign for governor, for which votes will not be cast until 2018. His signal effort was to establish a fundraising committee  an implicit reminder of the preeminent role of campaign cash, and the need to corral it year round and every year. Newsom noted in an interview with The Times that he faced the possibility of super PACs arrayed against him, not to mention the deep pockets of a potential challenger such as billionaire political donor Tom Steyer, who recently took himself out of the Senate race and is believed to be eyeing the executive contest. That same day, former Los Angeles Mayor Antonio Villaraigosa popped up in Washington, posing for pictures in the lobby of a luxury hotel and later receiving a public service award from the League of United Latin American Citizens. It was his second trip to D.C. in three weeks, and in both visits he held meetings to discuss the Senate race  last week with the Latino Victory Project, which helps elect Latinos to all levels of office. He didnt particularly want to talk about whether hed run. \"Im not going to make a comment about the Senate race until I have something to say,\" Villaraigosa said. The third in the trio of candidates who had been kept in amber by the absence of opportunities upstream was engaged last week in what will likely be her status quo for some time: getting around the state for her day job in ways that benefit her Senate candidacy. Harris held a Thursday event in Los Angeles to announce a new Bureau of Childrens Justice within the state Department of Justice. The bureau will dive into a strikingly broad range of issues involving children, from foster care to truancy, childhood trauma to education inequalities. Asked why the attorney general would be taking that vast role, Harris replied: \"Im the top cop in the state. I took an oath to concern myself with the safety of everybody in this state.\", Six cameras captured Harris comments, as two rows of reporters held on through almost an hour of discussion about the dire circumstances facing many California children. Aides moved through the reporters ranks in advance to say that Harris would not talk about the Senate race, as she was on government property and speaking as attorney general, not candidate. She was asked, of course, whether her presence in the states largest media market had anything to do with the Senate race. \"Im all over the state. I happen to live in L.A. half the time; its definitely someplace that I am,\" said Harris, who recently married a Los Angeles attorney. \"You are likely to see me here because I live here half the time.\", When would she talk about the Senate race?, \"In the coming weeks and months for sure,\" she said. It was a decidedly less dramatic rendition  with the same result  of what happened earlier in the week when reporters gathered around Harris as she left an appearance at Facebooks Northern California headquarters. \"No, no, no questions right now,\" an energetic aide cried, before trying to physically block San Francisco Chronicle reporter Carla Marinucci from recording video of the exchange. \"No questions right now.\", Harris, seeking a de-escalation, stepped in to declare that she would talk, soon. \"I do have to leave, but Im happy to talk with you at some point,\" she said. When the questions resumed, so did the aide: \"Im sorry, we have to get her moving! Im sorry, she is in a hurry!\", Harris has not been in too much of a hurry to array a host of endorsements widely seen as attempts to persuade Villaraigosa that a Senate race is not in his best interest. First came an embrace of Harris by African American politicians from Southern California, then a second from Latino politicians. And, last week, the Los Angeles police union jumped into Harris camp. The net result: a declaration from Harris to Villaraigosa that he will not have a hold on the groups that ensured his two elections as mayor and prior legislative wins: organized labor, Latinos and African Americans. Its not hard to guess her other behind-the-scenes action: studying up on issues that havent crossed her desk as a prosecutor but would as a senator. Those might include whether to support the presidents request for congressional authorization to use military force against Islamic terrorists, or any of the myriad other subjects that rise as potential tripwires for candidates. As the political machinery moved invisibly around her, she smiled brightly and implied some patience was in order. \"Weve got 16 months before that election,\" she told reporters in Los Angeles. \"It is quite some time off.\", cathleen.decker@latimes.com, Twitter: @cathleendecker]", "Date": "20150215", "Title": "[Drama from Boxer's retirement plays behind the scenes, for now]", "Link": "http://www.latimes.com/local/politics/la-me-pol-california-politics-20150215-story.html", "Author": "[Cathleen Decker]"}