{"Content": "[A recent interview with Bloomberg Politics prompted Texas Sen. Ted Cruz to defend his Latino heritage-- an issue that could come up often in his quest for the Republican presidential nomination. In the interview with Bloomberg Politics editorMark Halperin, Cruz is repeatedly pressed on his Cuban background. \"When you filled out your application to Princeton, to Harvard Law School, did you list yourself as a Hispanic?\" asks Halperin. \"Oh, sure, Ive listed myself as Cuban American -- thats my heritageand my background,\" Cruz says in response. Halperin, who has since apologizedfor the interview, whichhas been widely criticized, also pressed Cruz on whetherhe likes Cuban music and who his favorite Cuban singer might be. \"I haveto admit in that Im much more of a Texan and I tend to listen to country music more than Cuban music,\" Cruz said. The Bloomberg interview came a day after Cruz spoke at a Hispanic Chamber of Commerce event. \"We wanted to talk with Sen. Cruz about his outreach to Latino voters the day after he spoke at the Hispanic Chamber of Commerce. My intent was to give the senator a chance to speak further about his heritage and personal connections to the community through some casual questions,\" Halperin said in a statement. \"I rushed through the questions, and that was a mistake  it led to poor tone and timing. I also understand why some felt the questions were inappropriate.\", In response, Cruz said the apology was unnecessary, and that he was not offended by the line of questioning. Cruz has faced an array of questions about his background since he entered the presidential race in March. Although Cruz grew up in Texas, he was born in Calgary, Canada. His mother was born in the United States and his father in Cuba and both were working in the oil industry at the time of his birth. Because his mother is an American, Cruz has U.S. citizenship. This election cycle the GOP may have its best chance in years of receivingsupport from Latino voters -- a crucial demographic that traditionally votes Democratic. Florida Sen. Marco Rubio, the son of Cuban immigrants, joins Cruz amongRepublicans vying for the partys nomination, and former Florida Gov. Jeb Bush, whose wife is Mexican-born and who is fluent in Spanish, is seriously considering a run. Bush in recent weeks has made several appearancesbefore Latino voters, includingtraveling to Puerto Rico to host a town hall meeting. The Democratic front-runner, Hillary Rodham Clinton, recently called for comprehensive immigration reform and a path toward citizenship for millions of immigrants in the country illegally. Immigration is not necessarily the most pressing issue for Latino voters, with several surveys showing economic issues at the forefront. Twitter:@kurtisalee]", "Date": "20150512", "Title": "[Effort to grill Ted Cruz about his Cuban heritage founders]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-ted-cruz-latino-interview-20150512-story.html", "Author": "[Kurtis Lee]"}