{"Content": "[GOP Assemblyman Rocky Chavez told supporters that he would have a great announcement about his potential U.S. Senate bid on Thursday, and strongly hinted that he was planning to run. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Be ready for a big announcement on Thursday, Chavez said in an interview Friday evening at a reception he was throwing for attendees of the state GOP convention in Sacramento. I think its going to go very well, positively. I think were going to run around the state and start the discussion about things we care about like jobs and education and foreign affairs. He said he had begun putting together a team that included consultants in California and Washington and a finance team around the state. Im putting everything together for the great announcement on Thursday, Chavez said. Chavez opened a fundraising committee to explore a bid this month, and he also met with Republican Party groups in the nations capital about a potential run. They said go put your team together and raise money and come back, Chavez said. The self-described fiscal conservative and social moderate served in the U.S. Marine Corps and on the Oceanside City Council before being elected to the Assembly in 2012. He is not well-known statewide. A USC Dornsife/Los Angeles Times poll released Friday found that 19% of registered voters could identify him by name. In a multi-candidate field, he received the backing of 6% of those surveyed. Given the Democratic Partys 15-point voter registration advantage and the GOPs inability to elect a statewide candidate since 2006, a Republican is not given a strong shot of winning the U.S. Senate seat being vacated by Barbara Boxer. Two other Republicans considering runs are former state party Chairmen Duf Sundheim and Tom Del Beccaro, both of whom were courting delegates at the convention. Democratic Atty. Gen. Kamala Harris is the sole major candidate in the race. Follow@LATSeemafor political news. seema.mehta@latimes.com]", "Date": "20150228", "Title": "[Assemblyman Chavez hints he will announce U.S. Senate bid on Thursday]", "Link": "http://www.latimes.com/local/political/la-me-pc-gop-assemblyman-chavez-20150228-story.html", "Author": "[Seema Mehta]"}