{"Content": "[Whos the most meaningful person that Hillary Rodham Clinton has met in her lifetime? Nelson Mandela. Her biggest influence? Her late mother. The first book that she will read to her new grandchild? Goodnight Moon. Her favorite book of all time? The Brothers Karamazov by Fyodor Dostoevsky (also a favorite of former First Lady Laura Bush). And yes  Clinton wants you all to know  she does love dogs and lets her own three pooches on the sofa from time to time, even though it may not be proper dog etiquette. Those were Mondays most revealing takeaways from Clintons live Q&A from the headquarters of Facebook in Menlo Park, the latest stop on her international book tour for her 635-page memoir Hard Choices. The former secretary of State took command of the keyboard for a half-hour as hundreds of questions rolled in from admirers and adversaries. Some inquiries were serious, some were hostile, and some were downright funny. On the serious side, Clinton said she still favors closing the prison at Guantanamo Bay. She said she would consider supporting a constitutional amendment overturning the Supreme Courts Citizens United ruling to limit the amount of money that corporations could contribute to campaigns if there is no other way to deal with the Citizens United decision. Clinton praised President Obamas statement Monday that President Putins promise of a full and fair investigation into the downing of Malaysia Airlines Flight 17 must be supported by actions. Clinton said the U.S. should do more to ensure a thorough investigation into the attack on the plane from the Ukrainian territory controlled by Russian-backed separatists. We should work to bring our European allies together with us on tougher sanctions that would make it clear to Putin that there is a price to pay for this kind of behavior and we should encourage Europeans to start immediately to make sure they are less dependent on Russian energy so they are not intimidated, Clinton wrote to one of her Facebook questioners. She added that she would like to see more support given to the Ukrainians to guard their borders and to protect themselves. Clinton also briefly weighed in on the conflict in Gaza, noting that she negotiated the last cease-fire in November 2012 and is fully supportive of Secretary [John F.] Kerrys efforts to work with the Egyptians to forge a new cease-fire. Many Facebook participants directed questions to Clinton about whether she would run for president in 2016. She answered one hypothetically, telling a participant that her first action itemif she was elected to the White House would be to work to grow the economy, increase upward mobility, and decrease inequality. Among the questions that (sadly) went unanswered:, Is OJ guilty?, Do you like Justin Bieber? Are you a Belieber?, Are you friends with Senator Elizabeth Warren?, And this gem: A triangle has a perimeter of 90 cm. The lengths of the three sides are in the ration of 5: 12: 13. What is the length of the shortest side?, Though Facebooks chat had a tight 30-minute window, the world might still have chance to find out whether Clinton is a Belieber. She had another live chat slated for Monday night on Twitter, which was, no doubt, the first of many. Twitter: @MaeveReston]", "Date": "20140721", "Title": "[Hillary Clinton on dogs, Dostoevsky and 'Goodnight Moon']", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-hillary-clinton-dogs-dostoevsky-goodnight-moon-20140721-story.html", "Author": "[Maeve Reston]"}