{"Content": "[Almost exactly two months after Hillary Rodham Clintons announcement that shes running for president, she will give her first \"official campaign announcement speech,\" on June 13, according to her Twitter account. In other words, the Clinton campaign wants a do-over. Her initial rollout was the most disastrous nonfatal presidential campaign debut in modern memory. Her initial announcement video in April  which most outlets accurately reported as her official announcement  was well done. After that, everything went downhill; a steady stream of news stories and damning allegations about her family foundation and tenure as secretary of State has dogged her almost daily. Her best moment since announcing was when she was captured on grainy security video at an Ohio Chipotle franchise buying a burrito bowl. ABC News and MarketWatch dubbed it an \"adventure.\" Bloombergs Mark Halperin explained that Clintons excellent adventure was \"fun\" and \"new.\" \"Weve never seen her get a burrito before.\", Put \"Burrito day\" in the win column. In the \"loss\" column: plummeting poll numbers. In March she enjoyed a 15-percentage-point lead over Jeb Bush, according to a CNN poll. She had roughly similar double-digit leads over Marco Rubio, Rand Paul and Scott Walker. Those leads have nearly evaporated. Bush, whose rollout has also been less than stellar, now trails Clinton by 8 percentage points, according to CNN (but only 3, according to an ABC/Washington Post poll). Walker and Rubio are 3 percentage points behind her and Paul is 1, i.e. statistically tied. Worse, the public is souring on her, like a carton of milk left out in the sun. A majority of Americans polled by CNN now view her unfavorably (50% to 46%), her worst polling performance in 14 years. Fifty-seven percent believe she is untrustworthy, and fewer than half (47%) said she cares about people like them. In 2008, her image took a beating in her long and bruising primary fight with Barack Obama. Her image is worse today. The Clinton campaign has now conveniently embraced a strategy that says none of this matters very much. Jonathan Martin and Maggie Haberman report in the New York Times that the Clinton campaign has turned its back on a \"nationwide electoral strategy,\" opting instead to reassemble the Obama coalition of 2008 and 2012. To do that, Clinton needs to run to the left and pick polarizing fights that galvanize low-information and hard-to-motivate voters. The days of trying to win swing voters and independents are apparently over. Today its all about that base. \"The highest-premium voter in 92 was a voter who would vote for one party some and for another party some,\" James Carville, a longtime advisor to the Clintons, told the New York Times. \"Now the highest-premium voter is somebody with a high probability to vote for you and low probability to turn out. Thats the golden list. And thats a humongous change in basic strategic doctrine.\", Carvilles right that it is a big change in doctrine, but its unclear whether the doctrine is right. So far the entire theory rests on the precedent of one candidate: Obama. \"If she won,\" Martin and Haberman write, \"it would suggest that the so-called Obama coalition of young, nonwhite and female voters is transferable to another Democrat.\", As Ive been writing for a while, Im extremely dubious. Here are four reasons. First, Obama didnt really run as a polarizing figure in 2008. He ran as a post-partisan reformer who would end gridlock and fix the failures of the two-term incumbent (as did George W. Bush and Bill Clinton before him). Second, Obama was a very good politician without much baggage (that the media were willing to report on). Clinton is a mediocre politician with mountainous baggage. Third, Obamas coalition has never been transferable to any other cause or politician, despite the presidents best efforts. And last, Clinton is running to stay the course. The Obama retreads around Clinton boast of their willingness to break with the practices of the past. But it looks more like they cant break out of their own Obama bubble. jgoldberg@latimescolumnists.com, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150609", "Title": "[Hillary Clinton needs a do-over ]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0609-goldberg-hillary-clinton-redo-20150609-column.html", "Author": "NULL"}