{"Content": "[As Republicans gather this week for a three-day strategy session at a Pennsylvania resort, the struggle over immigration is once again vexing their efforts to forge a unified front against President Obama. A year ago, the same retreat triggered an immigration clash after House Speaker John A. Boehner nudged the party to tackle the issue, but rank-and-file members slapped down the effort as not aligned with their priorities and too divisive in an election year. Now, with Republicans in control of Congress for the first time in eight years, the debate is over how to respond to Obamas executive action shielding up to 5 million immigrants in the country illegally from deportation. Republicans agree the program should be stopped but differ sharply on tactics. Republican leaders have adopted a Hippocratic-oath-like approach toward confronting Obama: First, do no harm to the party. Concerned that extreme positions or overly aggressive strategies could backfire with voters, GOP leaders advocate a pragmatic approach, preferring separate legislation that curtails the administrations new immigration program and provides a clear Republican alternative. But conservative rank-and-file Republican lawmakers are revolting, criticizing leaders for being too timid. They have unveiled legislative measures that would not only block the presidents latest program but unwind other immigration policies. One Republican initiative seeks to roll back the presidents 2012 action that has deferred deportation for more than 500,000 so-called Dreamers, young immigrants brought to the U.S. illegally as children. The conservatives effort, which goes further than the GOP leadership wanted or others expected, would be incorporated into a must-pass spending bill to renew funding for the Homeland Security Department, which otherwise runs out of money Feb. 28. That raises the specter of a departmental shutdown if a compromise cannot be reached. Homeland Security Secretary Jeh Johnson all but pleaded with Congress not to go down that road as he announced stepped-up security measures after the Paris terrorist attacks. \"I urge the full Congress to pass this appropriation quickly, unburdened by any restrictions on our ability to pursue executive actions to fix our broken immigration system,\" Johnson said Monday. In an apparent reference to the Paris attacks, he said his department could not function \"in these times\" with uncertain, short-term funding. \"There are homeland security and border security priorities that must be funded without delay.\", Although the rest of the governments funding was renewed last year through September, Republicans  at the insistence of the conservative wing  agreed to only a short-term extension for the Homeland Security Department, which oversees immigration agencies. This is not the way Boehner and Senate Majority Leader Mitch McConnell wanted to start the year. Both have set their sights on showing voters that the Republican-led Congress can lead effectively, in contrast with the past two divided congressional sessions that lurched from crisis to crisis. They are eager to move past shutdown politics and present a viable alternative to the Democratic agenda, particularly as the focus turns to the 2016 presidential election. But their troops feel burned by what many say are hollow promises from Republican leaders to engage the administration in a fight on immigration and other issues. \"Republicans in all these districts hate amnesty and they dont like the president  it just puts all the hot buttons together,\" said Roy Beck, executive director of NumbersUSA, an organization that favors limits on immigration. The group has been flooding lawmakers offices with calls from its 2-million-strong membership, urging Congress to stop the presidents program. \"What you hear from Republican voters is that their Republican leaders are spineless, wimpy  especially now that they control Congress,\" Beck said. \"Will Congress stand up as an equal part of government or will it continue to allow the executive branch to rule? Really, this is the first test.\", As the 114th Congress convened last week, there was no shortage of proposals to gut Obamas executive actions on immigration. The result was a five-amendment package. One Republican amendment would prevent any funds from being used for the immigration plan, including the fees immigrants pay to apply. Another would similarly halt funds for the presidents 2012 program that allows Dreamers to apply for temporary permission to stay. Others are more symbolic measures of protest against policies that lead to the hiring of legal immigrants over U.S. citizens, or give preference to immigrants who are in the country illegally over those awaiting legal entry. Conservatives view Obamas immigration program as an abuse of executive authority. But administration officials defend the policy, saying the president had to act because Congress failed to do so. The House put together a package of immigration bills mostly from lawmakers in Alabama, South Carolina and Tennessee. Each is expected to be easily approved in votes this week and tacked onto the Homeland Security funding bill. Prospects in the Senate are uncertain. Even if Senate Republicans could overcome a likely Democratic filibuster of the measure, the White House has already threatened to veto the $39.7-billion Homeland Security bill if it is loaded up with \"objectionable restrictions\" to the presidents immigration action. Administration officials have warned that stable security funds are vital in the aftermath of the Paris attacks. They also say that without newly approved funds, the department cannot launch new initiatives  including one to beef up the Secret Service, which faced criticism after an intruder last year was able to hop the fence and enter the White House. \"Theyre willing to put the Department of Homeland Securitys budget at risk,\" said Sen. Richard J. Durbin (D-Ill.), the minority whip, in the chamber Monday. \"Its just wrong to take out your frustration by putting at risk critical Homeland Security funding.\", The new Republican chairman of the Senate Homeland Security Committee, Ron Johnson (R-Wis.), has proposed a similarly tough immigration measure, despite the threat of a presidential veto. \"Sometimes you have to go through that process to show what our thought process is  to highlight the executive overreach,\" he said. \"We should fight hard for our beliefs. And we will.\", Some suspect that Republican leaders may be allowing hard-liners to present their proposals on the assumption that the Senate will quickly reject them, clearing the way for more measured legislation. Both McConnell and Boehner have said flatly that they will not allow the Homeland Security Department to run out of money. As Republicans head Wednesday to Hershey, Pa. known as \"the sweetest place on Earth,\" leaders find themselves in a familiar position. Even though this year marks the first time in 10 years that House and Senate Republicans will meet jointly, the gathering may only do more to solidify the conservative ranks than to temper them. lisa.mascaro@latimes.com, Twitter: @lisamascaro ]", "Date": "20150113", "Title": "[Immigration a major hurdle to Republican unity in Congress]", "Link": "http://www.latimes.com/nation/politics/la-na-gop-immigration-20150113-story.html", "Author": "[Lisa Mascaro]"}