{"Content": "[A new survey of young Americans by Harvards Institute of Politics casts doubt on the widely repeated statistic that one in five women in college are victims of sexual assault. The 1-in-5 figure comes from a surveyconducted in 2007 for the Justice Department at two large public universities, one in the Midwest and the other in the South. The researchers who conducted the study, who did not name the two schools, cautioned that their findings might not be applicable nationwide, but the figure has, nonetheless, been featured in presidential speeches, social media campaigns and numerous articles. The new survey, part of a series that the Institute of Politics has done on the attitudes and experiences of young Americans, reports that 11% of female respondents age 18 to 29 said they had been the victim of a sexual assault. Despite the attention focused on assaults on campus, the survey found that the rate of sexual assault was twice as highamong women who had not attended college than among college students. Among women age 18 to 29 who did not attend college, 12% said they had been sexually assaulted, while among those currently enrolled in college, 6% said they had been targets of such assaults. Of those who said they had been assaulted, 9% said the assault took place on a college or university campus. \"Its not just a college problem,\" said Mariel Klein, a Harvard sophomore who participated in conducting the survey. The work was overseen by John Della Volpe, the director of polling at the institute. The survey also reported that 3% of men age 18 to 29 said they had been sexual-assault victims. Researchers use surveys to try to determine the prevalence of sexual assaults because the crime remains significantly under-reported. In the Harvard survey, 38% of white women age 18 to 29, 36% of blacks and 55% of Latinos said they had never reported their assault to anyone. Both the current survey and the 2007 one were conducted using Internet-based computer interviews, rather than telephone calls. The use of Web-based surveying, which provides more anonymity to respondents, may result in more accurate reporting of assaults, researchers believe. The one-in-five statistic from 2007 includes both completed and attempted sexual assaults. In that study, just under 14% of the women surveyed said they had experienced a completed assault. For more on politics and policy, follow@DavidLauter on Twitter ]", "Date": "20150429", "Title": "[1 in 5 college women assaulted? New study casts doubt on statistic]", "Link": "http://www.latimes.com/nation/la-na-sexual-assault-poll-20150429-story.html", "Author": "[David Lauter]"}