{"Content": "[On a gray wintry day outside the Capitol, Sen. Ted Cruz (R-Texas) stood on the grassy East Lawn and denounced President Obamas plan to temporarily defer deportation for millions of immigrants in the country illegally. Gathered to hear the senator was a band of enthusiastic supporters, including a few like-minded lawmakers and a handful of self-described patriots. King Obama! shouted one person in the crowd, which included a man in a tri-cornered hat and others waving the yellow Dont Tread on Me flags of the tea party. Inside the Capitol dome, fiery events like this are met with a collective eye roll, deflating Cruzs currency as a power broker. More temperate legislators have grown weary of such events, which they say are effective at grabbing headlines but polarize positions and hurt the partys brand. That hardly matters out here in the drizzle  and across America, where Cruz is taking his distinct Republican orthodoxy to new heights. On Thursday, as his fellow senators struggled to end a standoff over money for the Homeland Security Department, a confrontation he helped set in motion, Cruz was across the river from the Capitol, at a conservative forum for potential presidential candidates. We need to take the power out of Washington and bring it back to the American people, he declared to the Conservative Political Action Conference, where audience members rushed with their phones to get pictures of him. Cruz seized on a technology metaphor he often uses, comparing himself to apps that have disrupted old ways of doing business, like Uber did to the taxi industry. What Im trying to do more than anything else is bring a disruptive app to politics, he said. His colleagues on Capitol Hill may not appreciate the disruption, but Cruzs backers see him as a rising political star who is redefining the conservative right. The discord between the senators increasing isolation on Capitol Hill and his emerging clout outside the Beltway will only grow louder as the junior senator from Texas steps up preparations for a possible run for the Republican presidential nomination. Can he become a viable 2016 presidential contender without the backing of Republican power brokers, or will Cruz be able to harness his grass-roots following to break into the national conversation without  or even despite  the GOP establishment?, In an interview, Cruz expressed no regrets at being seen as the cowboy-boot-wearing troublemaker of the Senate. You know, to be honest, that doesnt matter, Cruz said, his tall frame hunched in the back seat of a car as he returned from a recent appearance at a technology conference. In my time in the Senate, I have not focused my attention on Washington because Washington is broken, he said. What Ive focused my energy on doing is energizing and empowering the grass roots, because thats the only avenue of real change. Thats not always how established GOP leaders in Washington see it. Sen. John McCain (R-Ariz.) once famously dismissed Cruz and other tea party lawmakers as wacko birds. House Speaker John A. Boehner (R-Ohio) and Senate Majority Leader Mitch McConnell (R-Ky.) have made no secret of their displeasure with Cruzs habit of challenging their authority, which helped lead Republicans toward the 2013 government shutdown. For the last several weeks, Cruz has played a significant role in a standoff over funds for the Homeland Security Department. After that December rally on the Capitol lawn, he led conservatives in a strategy to use the departments budget as leverage to try to stop Obamas deportation plan. As the fight over Homeland Security money turned into a logjam that threatened to tag the GOP with causing another partial government shutdown, a frustrated Boehner publicly called on Cruz to step up and fix the problem he had helped create. Cruz, in turn, blamed the GOP leadership for the strategy. Supporters praise Cruzs goals. The disagreement that people had with him was more about tactics than about the substance of his positions, said fellow conservative Sen. Jeff Sessions (R-Ala.), one of the leaders of the immigration fight against Obama. Jenny Beth Martin, co-founder of the conservative advocacy group Tea Party Patriots, said, When it comes to Ted Cruz, hes a fighter and he has stuck to his values. But unlike fellow tea party favorites, including Sens. Rand Paul of Kentucky and Marco Rubio of Florida, Cruz has a penchant for alienating colleagues in pursuit of bold legislative strategies that often fail. Rather than climbing the GOP leadership ladder, Cruz covets his outsider status. His long-shot 2012 election to the Senate stunned the party. The nastier the reception in Washington, the more appreciation you receive outside of Washington, he said. Cruz honed his conservative philosophy as a teen debate star in Texas before heading off to Harvard Law School and then becoming the state of Texas chief appellate advocate. At 44, Cruz has tried to cultivate an image as being not only the smartest guy in the room, but the most conservative. Few can claim the space to his right, and he likes it that way. But his quirky style and pedantic manner sometimes grate on other Republicans, whom he amicably dismisses as graybeards. In the run-up to the 2013 government shutdown, Cruz delivered an all-night talk-a-thon against the Affordable Care Act during which he impersonated Darth Vader from Star Wars. On April Fools Day, he rolled up a shirtsleeve on Fox & Friends to reveal a faux tattoo of Winston Churchill, one of his heroes. And last fall, Cruz protested Obamas immigration executive action in a floor speech that recast, almost word for word, one by Cicero, the Roman orator. He has a softer side, as well. During his all-night speech, he read aloud from Dr. Seuss for his young daughters who were up late watching C-SPAN at home. An office end table displays a small bobblehead collection, which includes one of late Supreme Court Chief Justice William H. Rehnquist, for whom he clerked after law school. Cruz views his work as part of a longer strategy to bend the political agenda toward conservative values. His goals may not have been achieved  Obamacare remains law  but his methods clearly have jolted the conversation in Washington. His office logged 2,000 calls a day in support of the 16-day shutdown in 2013, his staff said, and his anti-Obamacare petition got more than 1 million backers. That attention hasnt hurt his national fundraising efforts, either, a key consideration for anyone hoping to be president. Cruz raked in more than $80,000 during the shutdown period, more than all but a few senators, most of whom were running for reelection or in leadership, according to the nonpartisan Center for Responsive Politics, which tracks money and politics. As the 2016 field takes shape, Cruz is trying to broaden his profile  writing a book about his life and policy preferences and burnishing his foreign policy credentials with a recent trip to a security conference in Munich, Germany, where he accompanied McCain. Though he hasnt announced plans to run for president, Cruz made an appearance in January at a gathering of wealthy donors aligned with the Koch brothers and was a conservative favorite at the first major Republican gathering of potential presidential contenders in Iowa. Ted Cruz had the highest bar to reach  and he exceeded it, said the Iowa events host, GOP Rep. Steve King, a Cruz ally and regular at his office pizza parties where they spitball strategy. Many believe Cruz understands his electoral limits in 2016, but will capitalize on the opportunity to insert himself as a major player and potential kingmaker. Not bad for a freshman senator whos never held elected office before. One scenario has Cruz taking a role more like that played by former Alaska Gov. Sarah Palin or perhaps Jim DeMint, a former senator from South Carolina who left office to become president of the conservative Heritage Foundation  outsiders who try to swing the game from unlikely centers of power. Cruz dismisses that idea as not remotely accurate. But his actions during a recent private retreat of House and Senate Republicans did not look like those of someone rolling up his sleeves for the hard work of legislating. Instead, several people noted, Cruz declined to join many of the panel sessions where lawmakers hammered out policy, preferring to chat one-on-one with a few lawmakers in the halls. Hes a very  obviously  bright, articulate person, and he commands quite a following, said fellow Texas Sen. John Cornyn, the second-ranking Republican in the chamber, who acknowledged having differences with his colleagues tactics. The question is: What do you want to do? Do you want to run for president, or do you want to be an effective senator?, More seasoned politicians suggest, sometimes paternalistically, that Cruz simply needs more time and experience. We just gotta keep working with Ted, Sen. Joe Manchin III (D-W.Va.), a conservative former governor, said with a sigh. You want all that intelligence and energy to be channeled. Meantime, Cruz continues his speechmaking, often to the frustration of potential allies. At a recent news conference, a robust group of House and Senate Republicans  including some party leaders  stood behind Cruz to voice support for his call to use Homeland Security funds to force Obama to back down on immigration. But as the questions dragged on, so did Cruzs answers. One by one, the other lawmakers slipped away, until Cruz, without even realizing it, stood almost alone. lisa.mascaro@latimes.com, Twitter: @lisamascaro, ]", "Date": "20150226", "Title": "[Sen. Ted Cruz seeks role of 'disruptive app'; some colleagues would hit delete]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-cruz-congress-20150226-story.html", "Author": "[Lisa Mascaro]"}