{"Content": "[A month after Charles Munger Jr. wrote his first $100,000 check to a political campaign, he got a taste of the chronic rejection familiar to Californias big Republican donors: The 2005 ballot measure he backed lost by a landslide. Yet Munger, the son of a billionaire, went on to spend almost $78 million on scores of other campaigns. The spending by the Palo Alto physicist has thrust him into an unlikely role for a man whose occupation is to research the fine points of protons and electrons: He is a central force in the Republican Partys attempted comeback from its two-decade slide in California. \"If it werent for Charles Munger, the California Republican Party would have been driven into the sea at this point,\" said Kevin Spillane, a GOP strategist. A courtly academic who fancies bow ties and suspenders, Munger, 58, spent more than $11 million last year to help put Republicans in Congress and the Legislature, making him by far the state partys biggest benefactor. His funding of Latino, female and moderate candidates has been crucial to the partys effort to shed its image as a league of conservative white men. Mungers spending on ballot measures illuminates other priorities. He has tried to block tax hikes, diminish the power of labor unions and stop lawmakers from drafting election maps to their liking. The scale of Mungers spending has drawn scorn from adversaries. The state Fair Political Practices Commission is investigating Democrats allegations that Munger skirted donation limits last year by funneling money through the state party to favored candidates. \"Theres a lot of smoke there,\" said Lance Olson, a Democratic Party lawyer. Munger declined to be interviewed. \"My actions speak louder than any words I could give you,\" he said in an email. Labor leaders fault Munger not just for backing ballot measures that would have hindered unions spending on politics, but also for fighting Gov. Jerry Browns 2012 measure to raise taxes and avert cuts in, among other things, public schools. Munger, who served four years on a state curriculum panel, has lamented the quality of public education in California. \"You cant profess to care about the education of children, and then spend millions of dollars to ensure that the funding for those children is never realized,\" said Willie Pelote Sr. who oversees California political affairs for the American Federation of State, County and Municipal Employees. Munger, a former Santa Clara County Republican Party chairman, has made enemies within his own party too, in part by bankrolling moderates in primaries against conservatives. He infuriated Orange County party leaders by spending more than $580,000 to try to bounce Republican Allan Mansoor from the state Assembly in 2012. The moderate Republican backed by Munger finished a distant third. Months later, his clash with conservatives spawned \"The Munger Games,\" a blog devoted to bashing what it calls a \"one-man maelstrom of money intent on remaking California Republicanism in his bow-tied image.\", Munger ally Harmeet Dhillon, state party vice chairman, scoffed at his critics, saying that he deserves credit for trying to rescue the party. \"Charles Munger made the cardinal sin of backing someone for Assembly who was not anointed by the Orange County machine as golden boy or girl,\" she said. Former state Republican Chairman Mike Schroeder, one of Mungers Orange County antagonists, said Munger was on \"a fools errand\" to mute the partys large conservative faction. \"Any time you try to purge one of the wings, you weaken the party,\" he said. At a 2013 conference at Cal Poly San Luis Obispo, Munger lamented the state partys failure to extend its reach beyond Republican rural and suburban areas. \"Its essentially been AWOL, as far as actually carrying a vision to try to convince people that Republican ideals and principles outside safe Republican [districts] actually matter and should matter,\" he said. Munger grew up in Hancock Park. He attended a local public school, Third Street Elementary, and a private high school, Harvard, now known as Harvard-Westlake. He is one of eight children of Charles T. Munger, 91, the vice chairman of Berkshire Hathaway Corp. The familys roots are in Nebraska, where Mungers father met his business partner, Warren Buffett. When Munger was a child, the family spent summer vacations in Minnesota at the same rustic lakeside cabin where his father and grandfather had long taken fishing holidays. By the time Forbes listed his father as a billionaire, Munger was an adult. With net worth pegged at $1.3 billion, his father is ranked today as the worlds 1,415th richest person. He still lives in the North June Street house where Munger was raised. Adept at math and science, Munger earned a bachelors degree in physics at Stanford University and a doctorate in physics at UC Berkeley. \"My thesis topic was The Lamb Shift in Heliumlike Uranium,\" he said by email. Munger settled in Palo Alto, where he and his wife, attorney Charlotte Lowell, have raised three children. He has not held a paid job since his research appointment at Stanfords Linear Accelerator Center ended about 1992. Family wealth has enabled him \"to have the sort of scientific career usually supported by a salaried position at a national laboratory,\" he wrote. His work at particle accelerators \"will make no ones toaster more efficient but seeks to answer fundamental questions about the universe.\", What inspired him to enter politics, he told the audience at San Luis Obispo, was the 2005 special election called by Republican Gov. Arnold Schwarzenegger. He liked Schwarzeneggers agenda  four ballot measures that would have curbed the power of unions and their Democratic allies. \"Governor,\" Munger recalled thinking after studying his ballot pamphlet, \"if this is where you want to take my state, you have just got yourself a soldier.\", Mungers first $100,000 donation was to back a Schwarzenegger proposal to take away state lawmakers power to draw election maps. Voters rejected it, along with the rest of the governors ballot measures. Munger went on to spend $14.2 million on other redistricting overhaul measures that succeeded, but an upcoming U.S. Supreme Court ruling threatens to restore lawmakers power over congressional maps. Most recently, Munger has turned to rebuilding the state party. For last years election, he gave the party $4.9 million  or 17% of what it raised, a huge share for a single donor. Munger also spent $6 million on campaigns to put Republicans in the Legislature, striking fear into Democrats. \"We kept having to move our chess pieces around because he would suddenly appear on the board in a big way,\" said Steve Maviglio, a Democratic strategist. Much of Mungers money went to losers. But his funding of a few winners  such as Assembly members Catharine Baker in the Bay Area and David Hadley in the South Bay  was critical in denying Democrats a legislative supermajority. With the $1.9 million he put behind moderates in Republican primaries last year, Munger also alarmed party operatives who prefer conservatives. Republican blogger Jon Fleischman said Mungers spending was deterring some conservatives from running. A campaign is less appealing, he said, when \"youre one heartbeat away from Charles Munger dropping $1 million on your head.\", michael.finnegan@latimes.com, maloy.moore@latimes.com, Twitter: @finneganLAT @maloym, Times staff writer Sandra Poindexter contributed to this report. Details on Mungers political spending are available at this link.]", "Date": "20150404", "Title": "[GOP donor Charles Munger Jr. finds wealth buys few friends]", "Link": "http://www.latimes.com/local/politics/la-me-adv-munger-20150304-story.html", "Author": "[Michael Finnegan, Maloy Moore]"}