{"Content": "[Alaska independent Bill Walker maintained a slim lead in the governors race over incumbent Republican Sean Parnell on Wednesday, while Democratic Sen.Mark Begichtrailed Republican challengerDan Sullivanafter a fierce campaign in which Begich sought to distance himself from PresidentObama. But with absentee ballots and some early ballots yet to be counted, both races remained too close to call. With 100% of the precincts reporting, Walker had 48% of the vote to Parnells 46.6% -- a 3,165-vote lead out of nearly 224,000 cast. Sullivan had 49% to Begichs 45.3%, and a lead of 8,149 votes. Absentee ballots must be received by Nov. 14, and officials have until Nov. 19 to count them. Begich noted Tuesday night that he had trailed on election night in 2008 too, but eventually defeated incumbentTed Stevenswhen all the votes were counted. Weve seen this play before, Begich told supporters. Its gonna be a long night. It might be a long week. Ill take a win however it comes. Walker, a former Republican running for governor as an independent, said his campaign would send observers to monitor election officials count of the absentee ballots and of the remaining early votes. In a statement Wednesday, Walker said he and his running mate, Democrat Byron Mallott, were \"humbled that so many Alaskans have put their trust in us.... We are invigorated by the optimism and dedication of so many Alaskans across party lines to move our state forward.\", Early in the race, Parnell was considered likely to win, but two developments ate away at his chances. After the primaries in late August, Parnell faced two opponents: Walker and Mallott. But the challengers realized they were destined to lose a three-way race, so they joined forces. Not long after Labor Day, the Walker-Mallott unity ticket was unveiled. Parnell was also hurt by the daily drumbeat of bad press about a wide sexual abuse scandal in the Alaska National Guard, of which the governor is commander in chief. Allegations of sexual assault and official stonewalling in the Guard were first reported in the Anchorage Daily News a year ago, when a group of Guard chaplains disclosed that victims of sexual assault had been coming to them for years. Many of the women said they had been raped by fellow Guard members. Some said they had been drugged and assaulted. The chaplains said they reported the allegations to Parnell in 2010, but nothing resulted from their conversations. A scathing, 229-page report by the National Guard Bureau Office of Complex Investigations released in September found that complaints by some sexual assault victims before 2012 were not properly documented, that victims were not referred to victim advocates, that their confidentiality was breached and that, \"in some cases, the victims were ostracized by their leaders, peers and units.\", Parnell spent the last two months of the campaign defending his actions in the spreading scandal. In theSenaterace, Sullivan, a former state attorney general, spent months attacking Begich as a tool of the Obama administration, a senator who voted with the president 97% of the time and who cast the deciding ballot in favor of the Affordable Care Act. For his part, Begich rarely uttered the presidents name unless prompted by a voter at a campaign event. But he told anyone who would listen that he voted with popular Alaska Sen. Lisa Murkowski, his Republican counterpart, 80% of the time. (Finally, Murkowski sent him a cease-and-desist order after an ad presented the duo as a unified team.), About that deciding Obamacare vote? Begich had a tart response, telling Republican challengers that every senator was the 60th deciding vote if that senator was an incumbent Democrat. I was No. 6 in the vote, if you want to be technical about it, Begich said at a town hall meeting in the waning weeks of the campaign. Because its a role call vote. A. B. C. I was No. 6. The race was the most expensive in Alaska history, with more than $40 million in outside spending alone, because it was one of a handful viewed as crucial in deciding control of the U.S. Senate. Before the polls had closed in the Last Frontier on Tuesday night, however, the Senate had already gone over to Republican hands. As of Wednesday, the GOP had won 52 seats, and three more states -- including Alaska -- remained to be decided. Staff writer Connie Stewart contributed to this report.]", "Date": "20141105", "Title": "[Alaska races for governor, senator to hinge on absentee ballots]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-alaska-20141105-story.html", "Author": "[Maria L. La Ganga]"}