{"Content": "[With Californias ban on plastic grocery bags likely to be put on hold by a referendum, one Southern California lawmaker is offering his colleagues an opportunity to repeal one of the most controversial aspects of the law  a provision requiring supermarkets to charge at least 10 cents for a paper bag. But supporters of the bag ban say the new legislation cannot be heard until a referendum is decided. The bag ban, approved by the Legislature last year and signed by the governor, would take effect July 1, but a plastics industry group has submitted petitions to put a referendum on the November 2016 ballot. The group submitted 800,000 signatures -- almost 300,000 more than required -- that are currently being verified by the state. If the referendum qualifies, the bag ban will be put on hold until voters decide the issue. This week, Republican Assemblyman Matthew Harper of Huntington Beach introduced two bills: One would repeal the plastic-bag ban and the other would repeal the 10-cent fee for paper bags. The two should always have been separate bills from the beginning, Harper said. Why is it even the governments role to be deciding the price of a product?, Harper is a former mayor of Huntington Beach, where the City Council recently voted, preliminarily, in favor of repealing its ban on plastic grocery bags after three incumbents who supported the ban were voted out of office. Proponents of the bag ban say Harpers bills cannot be taken up while a referendum is pending, so they see the measures as strictly symbolic. Steven Maviglio, a spokesman for California vs. Big Plastic, the group supporting the law, argues that the political tide is turning as the ban takes effect in cities that have adopted ordinances. The Legislature has spoken and the governor signed the bill and the people will speak again in November 2016, Maviglio said, adding that polls conducted on the ban show there is strong public support. Twitter: @mcgreevy99]", "Date": "20150130", "Title": "[Lawmaker seeks to repeal 10-cent fee on paper bags in plastic-bag ban]", "Link": "http://www.latimes.com/local/political/la-me-pc-referendum-paper-bag-fee-20150130-story.html", "Author": "[Patrick McGreevy]"}