{"Content": "[After weeks of determinedly avoiding the media altogether, Hillary Clinton was finally drawn into an exchange with journalists Tuesday, briefly answering questions about donations to her family foundation, her emails while secretary of State, the millions she earned giving speeches and the Iraq war. It was a rare unscripted five minutes for a campaign that leaves little to chance. It was not clear if the candidate intended to talk to reporters at all, but once drawn in, she sought to turn uncomfortable questions about her record and the controversies that continue to swirl around her and Bill Clinton to her advantage. Bill and I have been blessed, she said of the $25 million they earned over the last 17 months giving speeches to companies, many of which have business before the government. We are very grateful for the opportunities we have had. That income figure was disclosed last week, though Clintons team worked to bury it at the bottom of the news cycle, filing a required statement of financial interest with the Federal Elections Commission during the dinner hour Friday night. Clinton spoke about the fees publicly for the first time Tuesday, and she sought to use her personal windfall to emphasize an oft-repeated campaign talking point about the troubles of the middle class. We have never forgotten where we came from, never forgotten the kind of country that we want to see for our granddaughter, and that means we are going to fight to make sure that everybody has the same chances to live up to his or her own God-given potential, she said. Most Americans understand the deck is stacked for those at the top. I am running a campaign that has very clearly stated we want to reshuffle that deck. The candidate has been so averse to engaging directly with reporters that it had become a story in itself. An impatient Fox News reporter finally drew Clinton into a media gaggle Tuesday by disrupting her carefully planned round-table event with small-business owners at a bicycle shop, shouting from behind the rope line a request for her to please answer questions from journalists. The exchange lasted all of five minutes. Clinton took five questions before dashing off. I am so proud of the foundation and I am proud of the work it has done, Clinton said when asked about the controversial donations it has accepted. Of that money, she said: It goes to show people are very supportive of the life-saving and life-changing work it has done here at home and elsewhere. Then it was on to her vote while in the Senate to invade Iraq in 2003, a move that continues to haunt her with progressive Democrats. I made a mistake, Clinton said, once again repeating her mea culpa on that vote. What we now see is a very different, very dangerous situation. The U.S. is doing what it can, but ultimately this has to be a struggle for the Iraqi government and Iraqi people. Next question?, Clinton was asked about the latest potential headache for her campaign, involving emails from longtime friend and advisor Sidney Blumenthal, who appeared to be advising the former secretary of State on Libya while doing business with a firm seeking contracts in that country. I have many, many old friends, Clinton said with a smile and a laugh. I always think it is important when you get into politics that you have friends from before you got into politics and understand what is on their mind. Hes been a friend of mine for a long time. He sent me unsolicited emails, which I passed on in some instances. And about those other emails when Clinton was secretary of State, another reporter asked, why is the government taking so long to release them? On Tuesday, a federal judge rejected the departments request to take until January to review and release them, ordering it instead to release them in batches between now and then. Clinton said she is all for moving the process along. I want them out as soon as they can get out, she said. Leading up to the exchange with the media, some big-name Democrats had expressed bewilderment at Clintons strategy of media avoidance. Among them was David Axelrod, the former aide to President Obama, who warned Clinton had dodged the media so persistently for so long that she risked it becoming a big news event when she finally did engage. On Tuesday, he was proved right. Later on Tuesday, at a campaign stop at acafein the small town of Independence, Iowa, Clinton had one final comment -- about the media itself. Noting the cafeowners nervous look towardreporters followingClinton, the candidate joked, \"I get worried about all these people, too. Journalists were then escorted outside. Twitter: @evanhalper]", "Date": "20150519", "Title": "[Hillary Clinton, after avoiding media for weeks, finally takes questions]", "Link": "http://www.latimes.com/nation/la-na-hillary-clinton-answers-questions-20150519-story.html", "Author": "[Evan Halper]"}