{"Content": "[Former Los Angeles Mayor Antonio Villaraigosa announced Tuesday that he would not enter the race for Barbara Boxers seat in the U.S. Senate, leaving state Atty. Gen. Kamala Harris as the only major candidate. \"I am humbled by the encouragement Ive received from so many to serve in the United States Senate,\" Villaraigosa said in a written statement. \"But as I think about how best to serve the people of this great state, I know that my heart and my family are here in California, not Washington, D.C.\", Villaraigosas surprise decision followed weeks of meetings and phone conversations with Democratic luminaries, campaign consultants, fundraisers and potential supporters. Close allies had expected him to run. The June 2016 Senate primary would have been Villaraigosas first tough campaign since he unseated Los Angeles Mayor James K. Hahn in 2005. Win or lose, it would have put Villaraigosa back in the public spotlight after 19 months of keeping a low profile in the private sector. When he left office, Villaraigosa, a Democrat, told reporters he wanted to run for governor in 2018. But Boxers announcement in early January that she would not seek reelection provided an opening for a quicker return to public office, albeit as one of 100 senators in Washington. Some Villaraigosa advisors suggested he had a better shot at the Senate in 2016 than at governor in 2018. Voter turnout in Los Angeles County -- a crucial source of support for Villaraigosa -- can be dismal in years when theres no presidential contest on the ballot, so the relatively high turnout expected in 2016 made a Senate campaign particularly appealing. By 2018, it will have been five years since Villaraigosa held elected office, so his reentry into elective politics after such a long absence from regular news coverage could prove challenging. Villaraigosa, 62, hinted in his statement that a run for governor was still possible. \"I have decided not to run for the U.S. Senate and instead continue my efforts to make California a better place to live, work and raise a family,\" he said. \"We have come a long way, but our work is not done, and neither am I.\", Lt. Gov. Gavin Newsom, a former San Francisco mayor, has already opened a committee to start raising money for the 2018 governors race. In the Senate contest, Harris is the only major candidate, at least for now. Candidates have more than a year to file papers declaring they are running. For weeks, Harris supporters have tried to clear the field of potential competitors. Former San Francisco Mayor Willie Brown, who was romantically involved with Harris in the 1990s, told the Sacramento Bee that Villaraigosa should forgo the Senate race in deference to the attorney general. Villaraigosa allies suggested Democratic leaders in San Francisco were trying to anoint one of their own at the expense of Southern California Latinos. Harris is a former San Francisco district attorney. Villaraigosa, the first Latino mayor of modern Los Angeles, has 16 years of experience in elected office. He represented Los Angeles in the Assembly from 1994 to 2000, including two years as speaker, one of state governments most powerful positions. In 2001, he ran for mayor but lost to Hahn after a brutal campaign. Hahn attacked Villaraigosa for writing a letter to the Clinton White House on behalf of a convicted drug trafficker. After his defeat, Villaraigosa sought a platform to launch another campaign for mayor: He won an Eastside seat on the City Council in 2003. In his rematch with Hahn two years later, Villaraigosa benefited from the collapse of Hahns coalition of black voters in South Los Angeles and white voters in the San Fernando Valley. Twitter: @finneganLAT]", "Date": "20150224", "Title": "[Former L.A. Mayor Antonio Villaraigosa won't run for U.S. Senate]", "Link": "http://www.latimes.com/local/political/la-me-pc-villaraigosa-senate-harris-20150123-story.html", "Author": "[Michael Finnegan]"}