{"Content": "[After a pre-booking gathering that doubled as a campaign-style rally, Texas Gov. Rick Perry strode into a criminal justice center in Austin on Tuesday to be booked on two felony counts that pose for him both legal and political peril. Before entering to be fingerprinted and photographed, Perry defiantly insisted that he would fight the charges against him with every fiber of my being. Im here today because I believe in the rule of law, he said in brief remarks punctuated by repeated applause from his supporters. Im here today because I did the right thing. Im going to enter this courthouse with my head held high knowing the actions I took were not only lawful and legal, but right. As he has repeatedly since his indictment by a grand jury on Friday, Perry cast his legal fight as a struggle larger than him and centered on any citizens constitutional rights. I will not allow this attack on our system of government to stand, the Republican governor said. Im going to fight this injustice with every fiber of my being, and we will prevail. We will prevail because were standing for the rule of law. At that, he offered a wave and walked inside for the official processing and a mug shot that will undoubtedly ricochet around the political world. The charges accuse Perry of abusing his power by targeting the states ethics watchdog with a veto of its $7.5-million state funding. The Office of Public Integrity, which investigates elected officials in Texas, is housed in the office of Travis County Dist. Atty. Rosemary Lehmberg, a Democrat who has clashed with Republicans. After she was arrested on drunk-driving charges last year in a videotaped confrontation with police, Perry threatened the units funding unless Lehmberg stepped down. He said he could not support continued funding for an office with statewide jurisdiction at a time when the person charged with ultimate responsibility for that unit has lost the publics confidence.\", Lehmberg refused to quit, and Perry followed through on his veto threat, prompting a government watchdog group to file a complaint accusing Perry of improper intimidation. That led to the grand jury action announced Friday. Critics of Perry note that at the time funding for Lehmbergs office was cut, the public corruption unit was investigating one of the governors pet projects, the Cancer Prevention and Research Institute of Texas. Question have surfaced regarding funding of the institute and money given to some of the governors close allies; a former institute official has been indicted for his handling of an $11-million state grant. Perry was charged with one count of abuse of official capacity, which carries a penalty of five to 99 years in prison, and one count of coercion of a public servant, which carries a punishment of two to 10 years in prison. But the additional danger comes to Perrys political future. The longest-serving governor in Texas history, he had announced he would not seek another term and would step down in early January after 14 years in office. He has spent months visiting key political states, including money-heavy California and early-voting Iowa, trying to resurrect a political image damaged in his disastrous 2012 campaign for president. Since the indictment, he has worked to rally Republicans around himself as a symbol of government overreach  and even some Democrats have suggested that the indictment was far-fetched. For political news and analysis, follow me on Twitter: @cathleendecker]", "Date": "20140819", "Title": "[Texas Gov. Rick Perry is booked; he calls charges an 'injustice']", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-texas-gov-rick-perry-booked-felony-charges-20140819-story.html", "Author": "[Cathleen Decker]"}