{"Content": "[Most presidential campaigns focus mostly on domestic issues such as the economy, taxes and healthcare, not foreign policy. But the 2016 presidential campaign is already shaping up to be an exception to that rule. For one thing, the world is a mess. The United States is at war in Iraq, Syria and Afghanistan, even if we dont have combat troops on the ground, and opportunities for new wars keep cropping up. President Obama hasnt convinced most voters that his policies are working; in a Fox News poll released last week, a whopping 73% of respondents said they didnt think Obama had a clear strategy in the fight against the terrorist Islamic State. The likely Democratic candidate, Hillary Rodham Clinton, will need to show how she would do better than the president she served as secretary of State. Her Republican challengers will want to reassert their partys traditional advantage on national security, a phenomenon political scientists call \"issue ownership.\", But Republicans havent quite worked out what their foreign policy ought to be, beyond \"not Obama.\", Thats partly because its still early in the campaign and the GOP boasts a bumper crop of potential candidates, some of them governors who never needed a foreign policy until now. Its also because one probable GOP candidate, Sen. Rand Paul (R-Ky.), has already broken from the pack and argued for a minimalist foreign policy with lower defense spending and fewer military commitments. Some of Pauls opponents have charged that his views add up to isolationism; the senator prefers \"conservative realism.\", But the debate isnt only about Paul. Ever since President George W. Bushs long misadventure in Iraq, his Republican successors have been struggling to refashion conservative foreign policy in a way most voters would embrace. \"I dont think the debate exists because Rand Paul is there; Rand Paul is there because the debate exists,\" said Danielle Pletka, a foreign policy scholar at the conservative American Enterprise Institute. \"He represents people who are uncomfortable with American global engagement.\", Divisions have emerged over many issues (sanctions in Iran, arms for Ukraine, trade with Cuba) but the crucial question in the campaign will probably be military intervention in the Middle East, the terrain on which the last Republican administration came to grief. If airstrikes alone arent enough to defeat Islamic State, should ground troops be deployed? And should the United States do more to dislodge the government of President Bashar Assad in Syria, including aid to Syrian rebels, airstrikes and ground troops?, Three rough camps among potential Republican candidates can be discerned. There are interventionists, who want the United States to do more. Theres the lone anti-interventionist, Paul. And, in between, theres a big group of straddlers who say they would be tougher than Obama but, when pressed, dont offer much in the way of specifics. The interventionists include Sen. Marco Rubio of Florida, who has called for more U.S. aid to Syrian rebels. Last week, he dismissed Obamas request for authorization to fight Islamic State as too limited and suggested he would delete Obamas proposed prohibition on long-term ground combat. \"I think we ought to authorize the president to destroy ISIL, period,\" he said, using an acronym for Islamic State. They may also include Gov. Scott Walker of Wisconsin, who told ABC News, \"We have to go beyond just aggressive air strikes. We have to be prepared to put boots on the ground, if thats what it takes.\", The straddlers include Sen. Ted Cruz of Texas, who has demanded that the Obama administration fight its wars more aggressively but has also said he sees no need for U.S. ground troops. Last week, when Obama requested authorization for the air war in Iraq and Syria, Cruz sidestepped the question of limits and said the main defect of Obamas request was that it failed to identify the adversary as \"Islamic terrorists.\", Paul ducked questions last week about Obamas request  perhaps because it came uncomfortably close to a proposal he made last year that prohibited using U.S. troops in ground combat and carried a 12-month expiration date. Democrats were divided over the authorization request, too  perhaps even more deeply than Republicans. But their nomination seems all but settled, and Clinton declined to comment on the issue. Its not unusual for a political party to divide over foreign policy  not even Republicans. \"This debate has been going on for a century,\" Richard Norton Smith, a noted historian of the GOP, told me. \"It isnt snide to suggest that modern libertarians are the heirs of the old isolationists.\" The last time isolationists battled internationalists for the soul of the GOP, it was a very different era  around 1950, at the end of the 20-year-long, five-term Democratic presidencies of Franklin D. Roosevelt and Harry S. Truman. This time, the debate isnt over how to handle a world transformed by a war the United States and its allies won; its about the legacy of the last Republican president, George W. Bush, and a war most people think we lost. So the potential candidate in the most intriguing position is his brother Jeb, the former governor of Florida. He hasnt spelled out his foreign policy yet, but hes scheduled to give a speech on the subject this week in Chicago. On national security, Jeb Bush is the candidate to watch. doyle.mcmanus@latimes.com, Twitter: @DoyleMcManus, Follow the Opinion section on Twitter@latimesopinionandFacebook]", "Date": "20150213", "Title": "[Republicans haven't quite worked out a foreign policy beyond 'not Obama']", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0215-mcmanus-gop-candidates-foreign-policy-divide-20150215-column.html", "Author": "NULL"}