{"Content": "[President Obama defended his pursuit of a negotiated solution to limitIrans nuclear program against critics who he claimed would prefer to rush the U.S. back to war, arguing Tuesday that engaging in smart, principled diplomacy was the true test of American leadership. As Congress prepares to hold hearings on the deal this week, the president said in a speech to the Veterans of Foreign Wars convention in Pittsburgh that he welcomed a debate over the accord reached between Iran and a group of world powers led by the United States. But he warned that opponents were already offering upshaky information that recalled the policies and mindset that failed us in the past. Some of the same politicians and pundits that are so quick to reject the possibility of a diplomatic solution to Irans nuclear program are the same folks who were so quick to go to war in Iraq and said it would take a few months, he said. We know the consequences of that choice, and what it cost us in blood and treasure. So I believe theres a smarter, more responsible way to protect our national security. Obama vowed a vigorous effort to make sure that people know the facts, detailing some aspects of the deal while also offering a broader defense of his policy of engagement. Instead of chest-beating that rejects the idea of even talking to our adversaries, which sometimes sounds good in sound bites but accomplishes nothing, were seeing that strong and principled diplomacy can give hope of actually resolving a problem peacefully, he said. Instead of rushing into another conflict, I believe that sending our sons and daughters into harms way must always be a last resort, and that before we put their lives on the line we should exhaust every alternative. That is what we owe our troops. That is strength, and American leadership, he added. As Obama prepared to speak to the veterans group, the White House launched new efforts to sway the debate, including a Twitter account, @TheIranDeal. Secretary of State John F. Kerry and other officials are scheduled to testify before the Senate Foreign Relations Committee on Thursday in the first public hearing on the proposal, a day after the administration holds classified briefings for the full House and Senate. In his remarks in Pittsburgh, Obama also mourned the five victims of a shooting rampage targeting military personnel in Chattanooga last week as American heroes. We draw strength from yet another American community that has come together with an unmistakable message to those who would try to do us harm: We will not give into fear, you can not divide Americans. You can never change our way of life or the values of freedom and diversity that make us Americans, he said. Though the president said the full nature of the attack was still unknown, he noted that Al Qaeda and Islamic State have encouraged similar activities, and he warned that lone wolf attacks are hard to prevent. Our entire government, along with state and local partners -- we are going to keep doing everything in our power to protect the American people, including our men and women in uniform, he said. Follow @mikememoli for more news out of Washington, ALSO:, Explainer: What the Iran nuclear agreement means, The talking -- and arguing -- points of the Iran nuclear deal, Op-Ed: Opposition to Iran deal makes for some strange bedfellows]", "Date": "20150721", "Title": "[Obama: Critics of Iran deal are the same people who rushed to war with Iraq]", "Link": "http://www.latimes.com/world/la-fg-obama-iran-vfw-20150721-story.html", "Author": "[Michael A. Memoli]"}