{"Content": "[As the number of candidates seeking the Republican nomination nears a dozen, with more to come, the calendar of primaries has drawn increased attention, with party strategists trying to determine which contests will begin to winnow the field. Though the calendar remains unsettled, several Southern states, including Alabama and Arkansas, are looking to have an effect on the race by holding contests on the same date - creating a so-called SEC primary, named after the college sports Southeastern Conference. In Florida, Republicans have rallied around a winner-take-all primary that could be a jackpot in the race for delegates and potentially determine the electoral fate of the states former governor, Jeb Bush and its current Republican senator, Marco Rubio. And in Nevada, lawmakers weighed legislation -- championed by Republicans -- that would have allowed parties to choose between the current caucus system or a primary. Late Monday, the legislation stalled as the session came to a close, likely killing the proposal for this election cycle. What we have right now is a very compressed calendar with important contests taking place within several weeks of one another, said Josh Putnam, a visiting assistant professor of political science at Appalachian State University in North Carolina, who studies primaries and writes the blog FrontloadingHQ. It wont be nearly as elongated as the last cycle. The compression of the current calendar, with Iowa and New Hampshire likely to kick off the voting process in early February, followed by South Carolina and Nevada toward the middle and end of the month, creates a different dynamic than 2012, Putnam said. In the last cycle, Republicans blamed a faulty primary system for a protracted nomination contest that ran from early January to April. The rules last time allowed several weeks between contests and did not deter states, particularly Florida, from moving their primaries earlier than usual. In this cycle, Republicans have adopted tough rules to prevent states other than Iowa, New Hampshire, South Carolina and Nevada from holding contests in February. States that violate the rules and try to start early would see their number of convention delegates sharply reduced. With March 1 as the earliest time most states can vote, several Southern states are eyeing that date for a Super Tuesday battle that could give a boost to a Southern Republican such as former Arkansas Gov. Mike Huckabee or Sen. Ted Cruz of Texas. Arkansas and Texas, along with Alabama, Georgia, Oklahoma, Tennessee and Virginia, each plan to hold their primaries on that date. Alabamas 2012 primary was held in mid-March, which was still considered late in the cycle, said Brent Buchanan, aRepublican strategist based in Montgomery, Ala. Its going to really be historic in that presidential candidates will have to give serious attention to the South, said Buchanan, adding theres a buzz with people saying, Hey, we really matter this election. \", In Florida, which is set to hold its primary two weeks after, on March 15, Republicans last month voted to award all the states 99 delegates to the primary winner instead of distributing them proportionally. We know that Florida is a prize  and the candidate to win here is going to get a big prize, state GOP Chairman Blaise Ingoglia said. Were a swing state with large cities statewide. Bush and Rubio have deep roots in the state and many political observers believe the primary - which will cost candidates and outside groups several million dollars for advertising - will probably be a race between the two men. Joining Florida as a swing state in the general election is Nevada, which also has early state status in the primary. Legislators there debated a measure that would have allowed each party to decide whether to hold a caucus or a primary. Caucuses consist of local gatherings - in venues such as school gymnasiums or public libraries - where voters decide which candidate to support and also typically select delegates for state nominating conventions. A primary is a statewide election in which voters cast secret ballots. Nevada Assembly Speaker John Hambrick, a Republican from Las Vegas who co-sponsored the legislation, said a primary  run by the secretary of states office -- is what the state GOP needed to make the election more seamless and boost turnout. With so many Republicans running for the White House, we have to be certain each vote is counted with precision, especially as an early state, said Hambrick, prior to the legislation stalling out Monday. In 2012, fewer than 33,000 of the states 400,000 registered Republicans voted in the caucuses. That year libertarian supporters of former Rep. Ron Paul (R-Texas) helped him finish third in the voting, with about 19%. Keeping the caucus system for this election cycle is likely to aid Pauls son, Sen. Rand Paul (R-Ky.), who tweeted on Tuesday that hes looking forward to the caucuses. His tweet included a link to a story that noted the primary legislation had been spiked. Despite the condensed primary calendar, the nominating process could still stretch on because of the ability of mega-donors to keep favored candidates afloat by spending unlimited sums through \"super PACs.\" That was what occurred in 2012, when casino magnate Sheldon Adelson bankrolled a super PAC supporting former House Speaker Newt Gingrich and kept his campaign going well into the spring, even after it was clear his delegate total could not surpass Mitt Romneys. Still, Putnam, who researches primaries, sees the calendar as the driving force. Millionaires and billionaires are not going to want to give additional money and pay when its clear its for a losing cause, he said The compressed calendar will likely winnow the field faster, and thats certainly what the GOP wants headed into the general election. kurtis.lee@latimes.com, Twitter: kurtisalee, 12:25 p.m. This post has been updated with additional information. 7:50 a.m.: This post has been updated to clarify the status of the Nevada proposal. 6:25 a.m.: This post has been updated with information about Nevadas legislation. This post was originally published at 3 a.m.]", "Date": "20150602", "Title": "[With big field, unsettled primary calendar adds complexity to GOP race]", "Link": "http://www.latimes.com/nation/la-na-primary-schedule-20150602-story.html", "Author": "[Kurtis Lee]"}