{"Content": "[Californias top elections officer on Wednesday expanded his proposed overhaul of the way citizens vote, aiming to make it easier for them to cast ballots. Secretary of State Alex Padilla wants the state to mail all voters a ballot and allow them to use it at any of several voting centers during a 10-day period before elections. That would allow people to vote near their jobs or other convenient locations rather than limit them to visiting polling places near their homes on election day or mailing in their ballots. Voters also would be able to drop ballots off 24 hours a day at secure locations during a 14-day period before elections. California ranked 43rd in voter turnout nationally for the 2014 General Election. This problem cannot be ignored, Padilla said in a statement. Civic participation is the foundation of our democracy. His proposal has been put into legislation by Sens. Ben Allen (D-Santa Monica) and Bob Hertzberg (D-Van Nuys). In elections in California, government fundamentally thinks only about itself, Hertzberg said. This measure flips the situation on its head so that the convenience of voting is the top priority. The proposed changes are modeled after laws in Colorado, which has much higher voter participation than California. If passed and signed into law, the legislation, SB 450, would depend on the state completing a new computer voter registration system in June 2016. Padilla has sponsored another bill that would register to vote everyone who gets a drivers license in California, unless they opt out. The new legislation incorporates ideas previously included in other bills. A pending bill by Allen also calls for voting centers to be open before election day. A measure by Sen. Fran Pavley (D-Agoura Hills) would create secure drop-off sites where ballots could be left before election day. California officials were alarmed when just 30.9% of eligible citizens voted in the November 2014 state election. In Colorado, the number was 56.9%. Since voting days were added in Colorado, turnout there has averaged 20.7 percentage points higher than in California, Padilla said. SB 450 would provide citizens more options for when, where and how they vote, Padilla said. Providing more options will help more citizens vote, despite our often busy lives. Twitter:@mcgreevy99, ALSO:, California is flush with cash. So why the warnings to prepare for recession?, Ethics troubles could mount for ex-candidate who missed fine payment, Why its so hard to fake the smell of watermelon, , 7:02 p.m.: This article has been updated with more details of the proposal. This article was originally posted at 10:07 a.m.]", "Date": "20150610", "Title": "[California elections chief proposes making voting easier]", "Link": "http://www.latimes.com/local/political/la-me-pc-california-elections-chief-proposes-making-voting-easier-20150609-story.html", "Author": "[Patrick McGreevy]"}