{"Content": "[The first contest of the 2016 presidential race is only (!) a year away, and like most Americans, Ive been following the start of what promises to be a verrrry long political season with a mixture of anticipation and dread. Our process is just so exhausting. In addition to actually doing our civic duty--informing ourselves about the issues and the candidates--we have to expend a ridiculous amount of time evaluating each and every gaffe and controversy, deciding whether a) its real or ginned up; b) whether we have the energy to take our outrage to the next level; and c) how many Facebook friends we are willing to lose in the process. The campaign drags on for so long that I have come to appreciate, perhaps far more than I should admit, the entertainment value of the underdogs who jump in and keep swimming, even when it becomes clear they will drown (metaphorically) long before they reach the other shore. Who among us does not already miss businessman Herman Cain, whose blustery campaign for the Republican nomination came apart in late 2011 after several women said he had sexually harassed them when he was CEO of the National Restaurant Assn. in the late 1990s?, The Hermanator uttered one of my favorite all-time presidential campaign gaffes when, in an interview with the Christian Broadcasting Network, he called Uzbekistan uz beki beki beki beki stan stan. (That was almost  but not quite  as amazing as watching the 2012 presidential campaign of Texas Gov. Rick Perry implode on live television when, during a debate with other Republican candidates, he could not remember the third of three federal agencies hed shutter, and uttered the immortal Oops.), In 2007, ultra-liberal Rep. Dennis Kucinich, who seemed somber to the point of humorless sometimes, unexpectedly livened up the Democratic contest when a particularly prosecutorial Tim Russert went after him during a debate in Philadelphia. Russert: Shirley MacLaine, the godmother of your daughter, writes in her new book that you sighted a UFO over her home in Washington state, that you found the encounter extremely moving, that it was a triangular craft, silent and hovering, that you felt a connection to your heart and heard directions in your mind. Now, did you see a UFO?, Kucinich, to shocked laughter: I did....I saw something. Trying to recover, he joked about moving his campaign office to Roswell, N.M. then promptly threw as many presidents as he could think of under the bus. Now, you have to keep in mind that Jimmy Carter saw a UFO,\" said Kucinich, \"and also that more people in this country have seen UFOs than I think approve of George Bushs presidency. (Truthsquadding: Bush had an approval rating of about 30% at that point, while, as Russert pointed out, only 14% of Americans believed in UFOs.), This time around, we have a pretty good idea about who the major players will be. They are seasoned political players who, as far as I know, do not have a single UFO sighting among them. Democrat Hillary Clinton, who has said she will make her decision public probably after the first of the year (meaning now-ish) has been in campaign mode almost since she stepped down from her job as secretary of State after the 2012 election. Republican Jeb Bush, the former Florida governor, said last month he will actively explore a run, and, according to the Washington Post, has resigned all of his corporate and nonprofit board memberships, including with his own education foundation. The spontaneity was squeezed out of these folks long ago. So who will provide our colorful distractions?, Who will be our Newt Gingrich of 2016, talking about colonizing the moon? Who will be our Michelle Bachmann, telling us about how the HPV vaccination causes mental retardation?, On the Democratic side, Vermont Sen. Bernie Sanders is an actual socialist (as opposed to our current president, who is only accused of being one), but hes also a very seasoned political operator, and I see nothing in his history that hints at campaign trail loopiness. On the Republican side, Kentucky Sen. Rand Paul has some indefensible ideas, but he does not approach the crack pottiness of his Libertarian father, Ron Paul, the perennial favorite of Ayn Rand-loving college students, who said during a 2011 debate that Iran should be able to have nukes. There is one person who gives me hope. After her losing turn as vice presidential running mate on the 2008 Republican ticket, former Alaska Gov. Sarah Palin has made a mini-career of dangling the idea that she may run for president. I could not help but get a teensy bit excited over the weekend when she sparked a war of words with animal rights activists after praising her 6-year-old son for stepping on the back of his dog to reach the kitchen counter. PETA was not amused. But Palins response to PETAs criticism shows that she would be a formidable contender in 2016, simply for entertainment value:, Arent you the same anti-beef screamers blogging hate from your comfy leather office chairs, wrapped in your fashionable leather belts above your kickin new leather pumps you bought because your celebrity idols (who sport fur and crocodile purses) grinned in a tabloid wearing the exact same Louboutins exiting sleek cowhide covered limo seats on their way to some liberal fundraiser shindig at some sushi bar that features poor dead smelly roe (that I used to strip from our Bristol Bay-caught fish, and in a Dillingham cannery I packed those castoff fish eggs for you while laughing with co-workers about the suckers paying absurdly high prices to party with the throw away parts of our wild seafood)? I believe you call those discarded funky eggs caviar. Seriously, how do we get this woman to run?, Please follow me on Twitter: @robinabcarian]", "Date": "20150105", "Title": "[Um, could Sarah Palin please run for president?]", "Link": "http://www.latimes.com/local/abcarian/la-me-ra-sarah-palin-president-run-20150105-column.html", "Author": "NULL"}