{"Content": "[Setting up another veto showdown with President Obama, Congress on Thursday approved a measure that seeks to roll back a new labor rule that allows workers to conduct union elections more quickly. Labor organizers and Democrats said the rule was needed to prevent employers from using delay tactics to block union votes, but Republicans said it would clear the path for \"ambush elections\" in which companies would not have enough time to present an opposing point of view. The resolution had been a priority among business groups, including the U.S. Chamber of Commerce. The House approved the resolution, 232 to 186, on a largely party-line vote, with three Republicans from Northeastern states siding with Democrats to oppose it. The Senate had passed the measure on a similarly partisan vote, 53 to 46, this month. Those numbers fall short of the two-thirds needed to override a White House veto. It would mark Obamas second veto this year and fourth since he took office. \"Instead of seeking to undermine a streamlined democratic process for American workers to vote on whether or not they want to be represented, the Congress should join the president in strengthening protections for American workers and giving them more of a voice in the workplace and the economy,\" the White House said. Organized labor has been fighting for years to speed the process for conducting union elections, arguing that the delays can give employers an advantage and dissuade workers who face potential harassment. But Republicans in Congress have repeatedly halted efforts to change the rules. Late last year, the National Labor Relations Board stepped in with a rule to expedite workplace elections, shortening the process to as little as eight days. The new rule, which goes into effect April 14, also limits the time for reviews and appeals and makes it easier for union organizers to file election paperwork electronically, rather than by mail or messenger. The rule also gives unions access to employee phone numbers and addresses so they can contact workers after hours. Republicans vowed to roll back the new rule when they took control of Congress this year. \"Joining a union is a big choice,\" said Majority Leader Kevin McCarthy (R-Bakersfield) on the House floor Thursday. \"But to make an informed decision, workers need time to decide whats best for them and their family, and they shouldnt be pressured or rushed.\", McCarthy said \"ambush elections\" only serve to \"bully workers to accepting unionization as fast as possible. Thats not pro-worker. Thats pro-union, and theres a big difference.\", To block the rule, Congress relied on a little-used authority that allows the House and the Senate to block a federal agency from implementing a rule by issuing a joint resolution of disapproval. Union officials said it is unlikely elections would be as swift as eight days, but they argued the changes were needed to give workers an even playing field to organize. They welcomed the presidents veto threat. \"President Obama is right in his commitment to vetoing this harmful legislation,\" said AFL-CIO President Richard Trumka. \"Congressional Republicans should focus their efforts on lifting workers up instead of shutting them out.\", Forcing the president into issuing vetoes has been central strategy of the new Congress, which is under Republican control for the first time in eight years. Even though Republicans may not have enough votes in the House and the Senate to override Obamas vetoes, GOP leaders believe such showdowns will amplify the ideological difference between the parties. Obamas first substantial veto of his presidency was last month when Republicans  with the help of Democratic votes  approved legislation expediting the Keystone XL pipeline. lisa.mascaro@latimes.com]", "Date": "20150319", "Title": "[Congress sets up veto showdown with vote to roll back labor rule]", "Link": "http://www.latimes.com/business/la-fi-labor-rule-congress-20150320-story.html", "Author": "[Lisa Mascaro]"}