{"Content": "[The Pentagon would get $585 billion next year under the Obama administrations proposed budget, reversing a five-year decline in military spending and blowing past mandatory spending caps imposed by Congress. The plan would give the Pentagon a base budget of $534 billion in fiscal 2016, about $38 billion more than this year, with an additional $51 billion for the expanding U.S. military campaign against Islamic State forces in Iraq and Syria. Pentagon officials say the money is needed to enable the military to counter violent extremists in the Middle East, shift more military assets to the Asia-Pacific region, address a resurgent Russia in Ukraine, and invest in cyber-security and new weapons technology. \"The proposed budget helps ensure we can manage risk and meet near-term defense needs while preparing for the future,\" Gen. Martin Dempsey, chairman of the Joint Chiefs, said in a statement. \"However, it represents the minimum resource level necessary to remain a capable, ready and appropriately sized force able to meet our global commitments.\", The plan is likely to face stiff resistance in the Republican-controlled Congress, partly because it exceeds mandatory spending caps by $36 billion that are set to take effect this spring. Obama has repeatedly asked Congress to void the so-called sequestration cuts that took effect across the entire government in 2013 after lawmakers failed to reach a compromise to avert them. Pentagon budget documents argue that a return to sequester-level funding would be irresponsible and dangerous, resulting in a force too small and ill equipped to respond to the full range of potential threats to the nation. Many Republicans are eager to appropriate more money to the military, but are expected to demand equal cuts elsewhere in the federal budget to offset any increased spending, which the White House would oppose. The issue is likely to spark a sharp debate between defense and deficit hawks in the months ahead. The Pentagon also has set up a fight with Capitol Hill by proposing to close more military bases around the country. The issue is contentious because lawmakers in both parties ardently seek to protect military families, businesses and defense contractors in their districts even as they force the Pentagon to cut costs overall. It has been 10 years since the last round of domestic base closures and the Pentagon argues it now has a surplus of military facilities that should be shut down. In another proposed cut likely to face criticism, the Pentagon wants to phase out the A-10 Warthog attack plane. The low-flying, heavily armored aircraft was developed in the early 1970s primarily to destroy Soviet tanks. Its supporters in Congress have beaten back previous attempts to kill it despite possible savings of $3.5 billion. Defense officials argued Monday that base closures and program cuts are necessary to preserve more important military capabilities and to keep weapons systems that are vital to U.S. interests. \"Like it or not, America remains the global first security responder of choice,\" Deputy Defense Secretary Robert O. Work told reporters at the Pentagon. \"All this money has to come from somewhere, so even at the presidents budget level, its a constant Rubiks Cube trying to figure out what is the best mix of capabilities, capacities and readiness,\" Work said. \"We think this is the right budget.\", Critics on Capitol Hill wasted no time in blasting the budget as fiscally reckless. \"The president is asking for billions in additional spending without any realistic way of paying for it, said House Appropriations Chairman Rep. Hal Rogers (R-Ky.), The Southern California aerospace industry stands to benefit if Congress actually approves the plan. Spending for weapons would rise 15% to $108 billion next year, and research and development would grow 10% to $70 billion. About $11 billion would purchase 57 F-35 Joint Strike Fighter jets, which are assembled in Fort Worth, Texas. But many of its parts come from about 300 companies in California. In addition, the Air Force proposes to spend $1.2 billion for a new long-range strike bomber that is being developed by engineers at Lockheed Martin Corp. and Northrop Grumman Corp. in Palmdale. The Air Force also wants 29 MQ-9 Reaper drones costing $821 million. They are built in the San Diego area by General Atomics Aeronautical Systems Inc. Follow @wjhenn for military and defense info.]", "Date": "20150202", "Title": "[White House seeks big increase in Pentagon budget]", "Link": "http://www.latimes.com/nation/nationnow/la-na-pentagon-budget-20150202-story.html", "Author": "[W.J. Hennigan]"}