{"Content": "[Rising Republican hostility toward President Obamas impending immigration plan is as intense as has ever existed between the White House and the GOP. House Speaker John A. Boehner of Ohio says the presidents executive action  expected to be announced Thursday  will \"poison the well\" for cooperation with the upcoming Republican-controlled Congress. Incoming Senate Majority Leader Mitch McConnell of Kentucky compared it to \"waving a red flag in front of a bull.\" Tea party conservatives have renewed talk of censuring or impeaching the president. But the strong reaction by Republican leaders has less to do with opposition to the nuts and bolts of the presidents immigration policy and more to do with fear and anger that the issue will derail the agenda of the new Republican majority before the next Congress even convenes. Republican leaders who had hoped to focus on corporate tax reform, fast-track trade pacts, repealing the presidents healthcare law and loosening environmental restrictions on coal are instead being dragged into an immigration skirmish that theyve tried studiously to avoid for most of the last year. Thats largely because the question of how to handle the estimated 11 million immigrants living illegally in the U.S. bitterly divides Republicans, and the party has been unable to agree on an alternative to the presidents plan. To many, stark warnings from Boehner and McConnell sound more like pleas to the president to avoid reenergizing the GOPs conservative wing, whose leaders are already threatening to link the presidents immigration plan to upcoming budget talks. Another government shutdown is not what McConnell and Boehner had in mind when their party won control of Congress this month. In fact, McConnell said flatly a day after the election that another shutdown would not happen. But calls by firebrand Sen. Ted Cruz (R-Texas) to use \"all procedural means necessary\" during Congress lame-duck session to block the White Houses immigration plans have left leaders scrambling to tame their rebellious ranks. Republican leaders are increasingly concerned that if Obama follows through, the anti-immigrant fervor in their party will rise to an unappealing crescendo and the rank-and-files desire to confront the president will overtake other party priorities. Rep. Steve King (R-Iowa)  one of the harshest critics of Obamas program that defers deportation for immigrants brought to the U.S. illegally as children  said he canceled plans to return to his district Thursday night as soon as he heard the president would be making an announcement. Although King said he wanted to see the full details of the presidents plan, he said Republicans should respond by passing a resolution of disapproval of the new policy, censuring the president and cutting off funding to enforce the policy. He did not rule out impeachment. \"I dont want to go down that path, because we have lived through that and it puts the nation through a lot of drama,\" King said. \"But it is the president who is initiating these actions.\", GOP leaders concerns about getting distracted by immigration are shared by the business community and outside groups that bankrolled the partys recent electoral success. High hopes that the new Republican Congress would tackle economic and business issues could be dashed if the party were goaded into an immigration fight. \"Were urging Republicans, whatever happens on immigration, lets also stay focused,\" said Tim Phillips, president of Americans for Prosperity, which is aligned with the billionaire Koch brothers and spent millions in the midterm campaign supporting Republican candidates for Congress. The group has not taken a position on immigration. \"We just want to make sure this economic agenda is not lost, because theres an enormous opportunity next year with Republicans who control the Senate and the House to ... pass significant legislation,\" Phillips said. Opponents of Obamas impending executive action want Congress to rescind funds for his immigration programs or use the upcoming government spending bill to block what they see as amnesty for millions of immigrants who would no longer be a priority for deportation. Some Republican lawmakers want to approve only a series of short-term spending bills, so they can revisit the issue every few months and maintain some leverage over the White House. But GOP leaders worry the tactic will bog down the new Congress in an endless immigration fight and bring back the shutdown politics that badly bruised the partys image last year. \"Its always appropriate to use the power of the purse, but its important to remember that the president has an important trump card: Its called the veto pen,\" McConnell said Tuesday. \"Were not going to be able to get everything exactly the way we want it, and hes not going to be able to get everything exactly the way he wants it. Thats why we have compromise.\", The presidents expected announcement Thursday leaves Republican leaders with little time to contain the fallout before the Dec. 11 deadline to approve new funding to keep the government operating. One solution would be for Republicans to produce their own immigration bill to counter Obamas approach. That would accomplish two key party goals heading into the 2016 presidential election: help the party reach out to minority voters it needs to win the White House and show Americans the GOP can get Washington working again. But that is unlikely to happen. Although some lawmakers are quietly working on compromise immigration legislation, there are no immediate plans to bring those proposals forward amid deep differences in the Republican Party. A bipartisan immigration bill passed the Senate last year, but the GOP-controlled House refused to act on it. Rep. Tom Cole (R-Okla.), a Boehner ally, accused Obama of intentionally trying to provoke a fight with the new Republican Congress. \"Im mystified by the political calculation,\" he said. \"Theres a new Congress coming in. Why would you do this on the eve of Thanksgiving going into the holiday unless you just want to create a political crisis?\", lisa.mascaro@latimes.com, michael.memoli@latimes.com, @lisamascaro, @mikememoli]", "Date": "20141119", "Title": "[Obama's plan of action on immigration may derail Republican agenda ]", "Link": "http://www.latimes.com/nation/politics/la-na-immigration-fight-20141120-story.html", "Author": "[Lisa Mascaro, Michael A. Memoli]"}