{"Content": "[Democratic pollster Celinda Lake has been asking voters how much they trust Hillary Rodham Clinton for more than two decades. So when she recently asked a group of 10 young people about the issue, her questions naturally turned to Whitewater, the Arkansas land deal turned White House scandal of the 1990s. Instead of the heated answers the topic once invited, the focus group responded with confused silence. Is that a new type of vodka? one person finally offered. The participant was probably kidding, Lake said. But the answer is exemplary of a challenge confronting pollsters, ad-makers and strategists on both sides who are trying to shape Clintons image during her presidential run. The youngest eligible voters of 2016 were toddlers when Americas most prominent political power couple left the White House, and what Americans know about Clinton is increasingly defined by what stage of her career she was in when they first tuned in. For millennials -- and this is true of any cohort -- if they dont remember it, its ancient history, Lake said. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, And there are a lot of Hillary Clintons to remember. A constant presence on the national stage since her husband first ran for president nearly a quarter-century ago, Clinton has gone through several second acts: activist first lady and culture-war flashpoint, scorned wife, senator, jilted presidential primary front-runner, secretary of State and, again, the front-runner for the Democratic nomination for president. For some who lived through the battles of Clintons first years on the national stage, the culture wars and personal controversies of the 1990s are integral to understanding who she is. The recent controversy surrounding her emails offers an example. Liberal media outlet Mother Jones dubbed it the return of the Clinton media persecution complex, harking back to the days of Whitewater and the Monica Lewinsky sex scandal. On the campaign trail, candidate and Republican Sen. Lindsey Graham of South Carolina, who voted for Bill Clintons impeachment, highlighted his fluency in Clinton-speak honed during the Lewinsky controversy. Young people, though, are more likely to know of then-White House intern Lewinsky as a vague childhood memory and pop-culture fixture -- refracted through Beyonce lyrics, \"Saturday Night Live\" skits and Lewinskys Vanity Fair cover last year -- rather than a trust-shattering national scandal that originated in the Oval Office. Brooke Wojdynski, 25, communications director for Young Democrats of America, said the scandal seemed significant to her while it unfolded primarily because of the teasing of her third-grade classmates, who took pleasure in mocking her for having a last name that rhymed with Lewinsky. I dont think we understood what was happening, she said. Republicans also realize the need to frame Clinton in ways young voters can connect to their own experiences. The whole thing of scandal is much harder to pin on her with first- and second-time voters, said Frank Luntz, a GOP strategist who helped counsel House Republicans through their battles with the Clintons in the 1990s. The 90s are as irrelevant to 20-somethings as the 1950s are to 50-somethings. If you didnt see it and you didnt hear it and you didnt live it, it doesnt matter. To some young voters, even Clintons marriage seems irrelevant to how they think of her, which is mostly as a presidential candidate or secretary of State. Most of her career that I followed has been when she was operating by herself and hes been kind of a background piece, said Marilis Dugas, a 21-year-old student at Clintons alma mater, Wellesley College. I dont have nearly as many associations of the two of them together. Strategically, the first generation of post-Lewinsky voters offers both opportunities and challenges for Clinton. Her campaign pointed to the plan to make higher education more affordable that she released Monday as a key part of their strategy for targeting younger voters. Clinton told reporters she would make the plan the centerpiece of her campaign. Opponents are already looking to mobilize generational gaps in how voters see Clinton. Republican Sen. Marco Rubio of Florida labels her the candidate of yesterday and called her college affordability proposal outdated while noting he had more than $100,000 in student loans himself just four years ago. Supporters, meanwhile, hope she can capitalize on the above-the-fray image she cultivated ahead of her current run for office, perhaps best encapsulated by a now-famous image of her staring into her BlackBerry, expression obscured by large sunglasses, that bloomed into the \"Texts from Hillary\" meme. Everybody kind of looked at her as getting stuff done and she had transformed her image, said Stacy Lambe, the 30-year-old co-creator of the meme. We were riding on this cool factor. We only see her in this new era, so I think any preconceived notions that might have come out of her being first lady dont really apply to us. Among boomers, the Clintons contemporaries, a long history can inspire either intense opposition or loyalty. The couple burst onto the national stage as generational change-agents, becoming lightning rods for both sides of the debate about shifting cultural norms around gender and sex. Everything associated with the Clinton administration is wrapped up in the culture wars, in competing visions of American life, said Illinois State University associate professor Andrew Hartman, author of A War For the Soul of America: A History of the Culture Wars. They represented a lot of the changes that manifestly transformed American culture. The former first lady endeared herself to those who considered her a trailblazing feminist but inspired ire in those who saw the couple as complicit in a coarsening of the culture. For baby boomers, its very current, said Lake. They are the peers of the Clintons, and they went through it with them. Staff writer Michael A. Memoli in Exeter, N.H. contributed to this report. @cdiersing, ALSO, Hillary Clinton unveils $350-billion plan to make college more affordable, How Black Lives Matter forced campaigns to toss their strategies on black voters, New worry for tech firms that dont want to hand data to the government: Hillary Clinton]", "Date": "20150812", "Title": "[What's Whitewater? These voters know less than you think about Hillary Clinton]", "Link": "http://www.latimes.com/nation/politics/la-na-hillary-clinton-generations-20150812-story.html", "Author": "NULL"}