{"Content": "[Yes, this is the campaign season that just wont end. On Saturday, voters in Louisiana will gather, a month after most states voted, for a runoff for a U.S. Senate seat and some House races. But even then, its not over. Election officials in Arizona this week cranked up the machinery for a recount of one particularly close House seat that has Republican challenger Martha McSally 161 votes ahead of Democratic incumbent Ron Barber. The recount in the 2nd Congressional District race was required because the margin was fewer than 200 votes out of nearly 120,000 cast. Barber won the seat in the aftermath of tragedy. He was an aide to Rep. Gabrielle Giffords in January 2011 when she was shot in the head in an assassination attempt. Barber was one of 12 people injured by gunfire that day. After his recovery and Giffords resignation, Barber won the seat in a June 2012 special election. In the 2012 general election, when he narrowly defeated McSally, Barber benefited from a heavily Democratic electorate; this year, he was fighting a Republican surge. Since the election, Barbers lawyers have argued that election errors denied scores of Arizonans the right to cast ballots. McSallys representatives have countered that some of those voters would have been ineligible under state law. Its not the first time Arizona elections have run into overtime. In 2010 a statewide recount was held for an arcane measure, an initiative that would have lengthened the time before an election that prospective initiatives had to be filed with state authorities. (It lost.), Mind-numbing, said Matt Roberts, a spokesman for the Arizona secretary of state, said of that measure and the thousands spent to recount its votes. County officials in Pima and Cochise counties, where the Tucson-area congressional district is located, must turn in the recount tallies to the secretary of states office by Dec. 15. The results will remain confidential and be turned over to the Maricopa Superior Court, which will announce the results Dec. 16. Neither the McSally nor the Barber campaign responded to inquiries. For political news and analysis, follow me on Twitter: @cathleendecker]", "Date": "20141203", "Title": "[No end to 2014 election as House recount begins in Arizona]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-arizona-congress-election-recount-20141203-story.html", "Author": "[Cathleen Decker]"}