{"Content": "[Former Florida Gov. Jeb Bush defended his credentials as a reform-minded conservative Friday, even as he held firm to positions that threaten to undermine his standing with party activists, telling skeptics that he hoped to be their second choice to win the GOP presidential nomination. Speaking at the Conservative Political Action Conference, an annual proving ground for Republican candidates, the establishment favorite came with practiced quick answers and light quips for a 20-minute question-and-answer period with Fox News host Sean Hannity. He acknowledged his audiences suspicions, and laid out, gently, a case for broadening the partys appeal. There are a lot of other conservatives that havent been asked. They dont know that theyre conservative, Bush said. If we share our enthusiasm, love for our country and believe in our philosophy, we will be able to get Latinos and young people and other people that we need to win. Bushs appearance was his first before a large, conservative crowd since he began his still-undeclared quest for the 2016 nomination and was a showcase of whats to come if he hopes to win over primary voters. His top competitors for the nomination, including Sen. Rand Paul of Kentucky, Wisconsin Gov. Scott Walker, New Jersey Gov. Chris Christie and Sen. Marco Rubio of Florida, also addressed the group this week, each test-driving speeches and banter aimed at winning over, or at least quieting, some of the partys most ardent troops. For Bush, the challenge involved touting his conservative credentials, while holding firm to positions that are problematic for many core Republican conservatives, such as supporting immigration reform and the Common Core education standards. On immigration, he reiterated his support for some kind of path to legal status for those who have come to the U.S. illegally, saying there is no plan to deport 11 million people. We should give them a path to legal status where they work, where they dont receive government benefits, where they learn English and they make a contribution to our society, he said. But Bush also said he opposed President Obamas recent executive action that would shield up to 5 million immigrants from deportation. He supported a congressional effort to try to block the policy, he said, but not if doing so risked funds for the Department of Homeland Security, a strategy pursued by some congressional Republicans. Im not an expert on the ways of Washington. It makes no sense to me that were not funding control of our border, which is the whole argument, he said. He stood by his support for granting drivers licenses and in-state tuition to some immigrants living in the U.S. illegally. He also talked about the Common Core, saying he supported the idea of set standards, but suggested he was aligned with conservatives on his opposition to federal government involvement. The Obama administration, Bush said, has meddled in the process with its Race to the Top program that ties school money to achievement on standardized tests. Not all potential candidates had to approach the crowd on the defensive. Wisconsin Gov. Scott Walker, who spoke Thursday, was clearly a favorite, thanks to his confrontations with public employee unions and his survival of a recall election. Walkers speech received thunderous applause. We won in Wisconsin, a state that hasnt gone Republican for president since 1984, he said. We did it without compromising. We stood up and said what we were going to do, and we did it. The otherwise polished Walker stumbled, though, when he discussed whether voters should be concerned about his lack of foreign policy experience: He said his fights with labor unions equipped him to fight Islamic State militants. If I can take on 100,000 protesters, I can do the same across the globe, he said, causing even some supporters to wince. Paul, the junior senator from Kentucky, was another welcome face at the gathering. He also tried to defend his foreign policy vision, making clear he takes a more nuanced view than his famously noninterventionist father, former Rep. Ron Paul of Texas. In his speech Friday, Paul was grounded in libertarian principles but argued for a more traditional Republican line on defense. His views  unparalleled, undefeatable and unencumbered by nation-building  are an extension of President Reagans advocacy of peace through strength, Paul said, during remarks often interrupted by chants of President Paul!, The conference also included the outer rings of the partys reach. Duck Dynasty star Phil Robertson delivered a meandering speech that offered advice on legislative decorum and sexually transmitted diseases. Donald Trump offered a recent real estate deal with the federal government as proof that he has the mettle to lead the nation. Still, organizers said this years gathering was focused on trying to test the politicians likely to win the partys nod next year. Rather than just allow would-be candidates to deliver a red-meat speech, the group has required them to follow their opening remarks with a question-and-answer session. Conservative media figures including Hannity and Laura Ingraham have led the questioning. Hannity peppered Rubio with questions about the politically difficult parts of his record, particularly immigration. Rubios support for a bipartisan comprehensive immigration reform bill in 2013 was extremely unpopular with many conservatives. The senator said the lesson he had learned in the two years since helping to write that legislation was that you cant discuss pathways to citizenship until Americans believe that future illegal immigration will be controlled. Bush, too, was asked rapid-fire questions with thorny implications. He denied reports that he may be shifting his opposition to same-sex marriage as he courts gay donors, saying, No, I believe in traditional marriage. And he won cheers by declaring he opposes legalizing marijuana but believes states ought to have that right to do it. Hannity mentioned how, when he had said Bushs name in an earlier speech, many in the audience booed, and so offered the former governor a chance to defend his record. For those that made a ooo sound  is that what that was?  Im marking them down as neutral, and I want to be your second choice, Bush said. michael.memoli@latimes.com, kathleen.hennessey@latimes.com, Times staff writer Evan Halper contributed to this report. 7:48 p.m.: This story was updated throughout. 12:54 p.m.: This story was updated with quotes from former Gov. Jeb Bushs speech. 10:20 a.m.: This story was updated to include quotes from Sen. Rand Pauls speech. It was initially published at 7:28 a.m.]", "Date": "20150227", "Title": "[Jeb Bush tells conservative skeptics he hopes to be their 'second choice']", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-republicans-cpac-20150227-story.html", "Author": "[Michael A. Memoli, Kathleen Hennessey]"}