{"Content": "[Welcome to California Inc. the weekly newsletter of the Los Angeles Times Business section. Im Business columnist David Lazarus, and heres a rundown of upcoming stories this week and the highlights of last week. Hackers, ahoy: Computer hackers take over Las Vegas this week at two big conferences  Black Hat and DEF CON. Both events are especially timely in light of recent security breaches, including one at UCLA Health System that affected 4.5 million patients. The conferences will draw thousands of tech and cybersecurity professionals from businesses and government, as well as shadowy, anonymous sorts with a particular set of skills. DreamWorks earnings: DreamWorks Animation, the studio behind kids favorites \"Kung Fu Panda\" and \"How to Train Your Dragon,\" will release second-quarter earnings on Tuesday. Analysts polled by Thomson Reuters have estimated a loss of 28 cents a share for the company, which recently sold its headquarters in Glendale as part of a series of cost-cutting measures. DreamWorks shed 500 jobs earlier this year and installed new management following several box-office flops. Uber lawsuit: A federal judge in San Francisco will determine on Thursday whether a lawsuit filed by former Uber drivers qualifies for class-action status. The lawsuit alleges that the ride-sharing company misclassified drivers as independent contractors when they should have been classified as employees and reimbursed for expenses, including gas. Uber says the plaintiffs who filed the lawsuit arent representative of most Uber drivers and that the 160,000 drivers in California have \"little or nothing in common.\", GOP debate: Ten Republican presidential candidates will take the stage in Cleveland on Thursday for the first prime-time primary debate of the 2016 election cycle. The event, hosted by Fox News and Facebook, will offer (hopefully) a substantial glimpse at how each candidate would boost economic growth and address big-ticket financial issues such as Social Security and Medicare. Job creation likely will be a dominant theme, although it remains to be seen what concrete steps either Republicans or Democrats would take to put more people to work. Jobs numbers: The U.S. Labor Department will release jobs numbers for July on Friday. Economists will be looking once again for signs of a boost in wages for American workers. The U.S. labor market added a healthy 223,000 jobs in June, but many experts were disappointed that average hourly earnings remained flat -- even as the unemployment rate fell to 5.3%, the lowest level in seven years. Consumer spending accounts for about two-thirds of total economic activity, so higher earnings likely equates with growth. TodaysBusiness section focuses on the California Public Employees Retirement System, or CalPERS, which is finally about to reveal how much it pays Wall Street for its most rarefied services. At issue are the performance bonuses, known as carried interest, that for decades have been snatched up by Wall Street giants as part of their compensation. All pension funds are going to be embarrassed when they have to reveal just how much they are actually paying private equity in performance fees, says one economist. Here are some of the other stories that ran in the Times Business section in recent days that were continuing to follow:, Relativity bankruptcy: Beverly Hills-based movie studio Relativity Media has filed for Chapter 11 bankruptcy protection. This is quite a comedown for entertainment entrepreneur Ryan Kavanaugh, the financial whiz who piloted his own helicopter and sought to rewrite the Hollywood rules of engagement. The high-flying, hard-living mini-mogul, unable to make payment on $320 million owed to lenders, has laid off staff and is preparing to auction off his studio. Relativity was behind movies such as \"The Social Network\" and \"The Fighter.\" Relativity will continue to operate as it restructures its finances. Whole Foods: The first test for Whole Foods Market Inc.s newvalue-oriented stores will be in one of the nations most competitive grocery landscapes. The Texas-based chain said the first of its new 365 by Whole Foods Marketstores will open next year in Silver Lake, setting up a potential showdown with rival Trader Joes. The former site of a Ralphs was originally intended for a regular Whole Foods, but the company decided to renegotiate the lease to expedite the new stores opening. The store will be about 30,000 square feet and may have a wine bar. Film credits: The California Film Commission said 254 projects had applied for the second round of the states newly expanded film and television tax credit, underscoring strong demand for incentives intended to keep production in California. Between July 13 and July 25, the film commission said it received 32 applications for studio films and 222 for independent features projects. Due to limited funds, however, only a fraction of the applicants will be selected. The $55.2-million round includes $48.3 million for studio feature films, and $6.9 million for independent projects. Full-service investing: Mike Jones is chief executive and co-founder of Science Inc. a mash-up of venture capitalism, angel investing and business incubation. He calls his Santa Monica firm, founded in 2011, a \"start-up studio\" that distinguishes itself by investing more than money in young companies. Science Inc. fields fleets of experts in every aspect of operations  fundraising, marketing, app development, advertising, accounting  to hand-hold promising endeavors to profitability. The most successful start-up so far: Dollar Shave Club, an online retailer of mens grooming products that received $100,000 from Science in 2012. It had $65 million in sales in 2014. A slick company: Never mind smartphones, biotechnology and streaming video. If you wanted to handily beat the stock market over the last decade, you should have bought WD-40 Co. As CEO Garry Ridge tells it, the San Diego maker of the decidedly unglamorous WD-40 lubricant, rust protector and squeak eliminator keeps growing steadily, notably in foreign markets. And its stock keeps rising in lockstep with its sales. While the benchmark Standard & Poors 500 index has gained about 70% in the last 10 years, WD-40s stock is up more than 200%. Sales totaled $383 million in its fiscal year ended in August. And some recent stories from other publications that caught our eye:, Trumps wealth: Bloomberg News crunches the latest numbers on Donald Trumps wealth, and the figure it comes up with is $2.9 billion. The celebrity presidential candidate says hes worth more than $10 billion. The majority of Trumps fortune is derived from real-estate holdings such as resorts and office buildings. Other properties include Turnberry in Scotland and Doonbeg in Ireland, both golf courses. Rent to own: The Wall Street Journal says investors have found a new way to profit from consumers with blemished credit who cant qualify for a mortgage: let them rent a home first with the option to buy later. Rent-to-own programs were popular with cash-strapped consumers during the 1990s, but faded away when easy lending made it possible for almost anyone to buy a home with no money down. Cash is king: What makes for a great entrepreneur? Quartz says one trait shared by successful go-getters is ready access to cash  family money, an inheritance, or a pedigree and connections that allow for financial stability. While it seems that entrepreneurs tend to have an admirable penchant for risk, its their ability to scrape up money that allows them to take risks. And thats a big advantage. Tasty education: The Boston Globe Magazine looks at the changing face of college life. And those changes are most apparent in students dining experiences. These days, student meals are going not just gourmet, but also vegan, gluten-free, free-range and organic. The Princeton Review and others even rank dining halls, which have turned into food courts featuring such items as fondue, pho, lobster bakes and make-your-own pancakes. Pickled or not: As the New York Times puts it, the fate of South Koreaskimchi industry rests on whether China considers it pickled or not. When China reclassified the fermented cabbage dish several years ago, Korean exports of kimchi evaporated. As a pickled product, it did not meet Chinas strict import hygiene standards. Now China has pledged to reconsider the designation. For the latest money news, go to www.latimes.com/business. Until next time, Ill see you in the Business section.]", "Date": "20150803", "Title": "[California Inc.: CalPERS coming clean on Wall Street cash]", "Link": "http://www.latimes.com/la-fi-california-inc-html-20150803-htmlstory.html", "Author": "[David Lazarus]"}