{"Content": "[Republicans are waking up Wednesday morning with victories to celebrate but sobering realities to ponder. Winning control of the Senate after eight years of trying is a big prize, made more sweet by the fact that only two years ago, the party seemed on the ropes. Republicans also expanded their ranks in the House and, pending several late races, could end up with their biggest majority since Harry S. Truman left the White House. But even before the votes were counted, some of the GOPs leading strategists had begun to warn that those victories could blind Republicans to hard problems that the 2014 campaign had done almost nothing to solve. The barriers to a Republican victory in a presidential election remain formidable, they said. JOIN OUR VIDEO DISCUSSION THURSDAY AT NOON, \"We shouldnt be gloating over the fact of winning red states,\" said Republican pollster Neil Newhouse, noting that this years Senate battles mostly took place in reliably conservative states in the South and interior West. \"Thats not a very high bar.\", One-third of the Senate comes up for reelection every two years, and by luck of the draw, the states in this years batch are disproportionately conservative. Indeed, of the three classes of Senate seats, this years group has been the least representative of the country over the last few election cycles, according to an analysis of election data by Patrick J. Egan, a political scientist at New York University. A win is a win, no matter the caveats. The GOP has solidified its dominance of the South, strengthened its hand in Washington and further weakened President Obamas ability to influence the national agenda. And the GOP wave washed beyond red states. Republicans won Senate contests in Colorado, Iowa and North Carolina, all swing states. Two high-profile Republican governors, Scott Walker in Wisconsin and Rick Scott in Florida, won reelection in races shaped heavily by national partisan issues. But amid the victories, the limits of the Republican tide were also clear. In New Hampshire, a long-established swing state, GOP challenger Scott Brown failed to beat Sen. Jeanne Shaheen. Earlier in the election cycle, Republicans had largely given up their hopes of taking Democratic Senate seats in more solidly blue states, including Michigan, where longtime Sen. Carl Levin is retiring, and Minnesota, where incumbent Al Franken won an extremely narrow victory in 2008. Democrat Gary Peters prevailed in Michigan, and Franken easily won reelection. Newhouse, who was Mitt Romneys chief pollster, cautioned that the victories Republicans achieved Tuesday should not distract them from the reality that \"the image of the Republican Party has actually gotten worse since the end of 2012.\", The single biggest problem the party continues to face is the perception among many Americans that Republican elected officials dont recognize  or care much about  the challenges faced by people who arent white and affluent. Thats a severe handicap in a country where the electorate, particularly in presidential contests, is increasingly nonwhite and suspicious of wealthy businesspeople. \"The Republican Party brand sucks, and so people dont want to be a Republican,\" Sen. Rand Paul bluntly said last week during a campaign appearance in Detroit. \"Why?\" asked Paul, who hopes to become the partys presidential nominee in 2016. \"The problem is the perception ... that no one in the Republican Party cares.\", Polls show that view to be particularly common among younger Americans, minorities and unmarried women. Those three overlapping groups, along with college-educated white liberals, form the core of the coalition that elected Obama. And the Democrats already-huge advantage among some of those groups has expanded since the last midterm election. Just before the 2010 midterm, nonwhite likely voters preferred Democrats for Congress over Republicans by 70% to 21%, according to an analysis by the Pew Research Center. By last week, that preference had grown to 77% to 15%, a 62-percentage-point advantage. Smaller shifts toward the Democrats took place among likely voters earning less than $30,000, those with postgraduate degrees and those younger than 50. Among all voters, only 39% of registered voters had a favorable image of the GOP, with 55% viewing the party unfavorably. The Democrats standing, by contrast, is merely mediocre  48% unfavorable, 47% favorable in the Pew survey. \"No major party has ever been as unpopular in the history of polling as the Republican Party is,\" pollster Mark Mellman said at a recent discussion sponsored by the Bipartisan Policy Center, a Washington think tank. Mellman is one of the Democrats most prominent pollsters, which would make his judgment on the GOP suspect but for the fact that many Republican strategists share it. Republicans have been able to make gains this year in large part because voters tend to use midterm elections to vent frustrations at the party in the White House. Presidents Reagan, Clinton and George W. Bush all saw their party lose control of the Senate during midterm contests. The GOP has also benefited from the nature of the Democratic electoral coalition, built around younger voters and minorities, which suffers much more from the typical drop-off of voters between presidential and midterm contests. Take Milwaukee as an example. The largest city in one of the nations most closely divided states, its residents, 55% of whom are nonwhite, vote overwhelmingly for Democrats. In the 2012 presidential race, 72% of the citys voting-age citizens showed up to vote. Two years earlier, in the 2010 midterm, only 47% did, according to an analysis by the Milwaukee Journal-Sentinel. Similar swings can be seen in other urban centers in battleground states. Because the voting preferences of older and younger Americans diverge much more than they used to, and Democrats rely more heavily on the young, the country now has two very different electorates. One shows up during midterms and the other  younger, less white, less conservative and bigger  turns out in presidential years. None of that means a Republican cant win the next presidential contest. \"No party has a permanent lock,\" says GOP pollster Whit Ayres. But reorienting the party \"requires a presidential candidate running with a different message,\" much as \"Bill Clinton did in 1992,\" he said. Republicans had little incentive to forge that kind of message this year. Obamas unpopularity, particularly in conservative states, gave their candidates all the arguments they needed. But that meant the party had little incentive to resolve divisions on high-profile topics, including immigration and healthcare, or to persuade people other than committed partisans that Republicans have solutions for the nations problems. Instead, the campaign has only deepened a sense, expressed by voters repeatedly in polls and focus groups this year, that neither party has an answer to what ails the nation. In both the 2006 and 2010 midterms, polls showed that voters had a clear preference for which party should run the government. By contrast, a Gallup survey released Monday delivered a very different message. On the eve of the GOPs victory, the poll found that barely 1 in 4 voters thought Republican control of Congress would make the country better. The largest group of voters, 40%, said the country would be \"the same regardless of which party controls Congress.\", ]", "Date": "20141104", "Title": "[GOP triumph tempered by hard problems, now and in 2016]", "Link": "http://www.latimes.com/nation/politics/la-na-election-analysis-20141105-story.html", "Author": "[David Lauter]"}