{"Content": "[Americans have a hard time taking their meds. Prescription drugs get more sophisticated, expensive and even confusing. People commonly forget how many pills to take or dont understand how to schedule them. Some leave pricey drugs to languish at the pharmacy. And its costing the healthcare system billions of dollars. David Julian takes 26 pills a day, most of which help to manage his epilepsy. Keeping track of them all has become a challenge. \"With the seizures come loss of memory, and the side effects of medications also affect memory. I had to start keeping a log of what medications I took and when,\" says the 46-year-old former operations manager from Villa Park. He has missed doses before, which has put him in serious medical danger. As a result, he has begun using a smartphone app called MediSafe. Its designed to help people manage and stick to their medications. The tool reminds him to take his medicine on time, which drugs need to be taken with food and how many times a day. Without the app, he says, it would be impossible to stick with his treatment. Ed Harvey faces a different challenge: a hefty price tag. The 77-year-old retired contractor from Malibu was prescribed a medication he says he needs to rebuild lost bone density. Hes covered by Medicare. Yet the brand-name drug his doctor prescribed, and for which there is no generic alternative, costs nearly $500 a month after Medicare has covered its part. And thats just one of eight different pills he takes. \"I spend about $1,000 per month\" on prescription medication, Harvey says. Patients like Julian and Harvey face many barriers to taking prescribed medications as directed, and it has become a huge problem. Some experts estimate it may cost the U.S. as much as $290 billion in excess healthcare expenses when people get sick because they dont adhere to their doctors instructions. \"We know that patients who have non-adherence to medications are more likely to be sicker and have more complications from their chronic conditions,\" says Dr. Gerardo Moreno, assistant professor at UCLAs Department of Family Medicine. About 50% of patients with a chronic disease, such as high blood pressure or diabetes, eventually stop taking medications intended to stave off major health problems, such as heart attacks, according to the Centers for Disease Control and Prevention. More than 25% of newly written prescriptions are never even filled. Experts say there are many ways to manage the problem, and they offer tips for doing so:, Manage high-cost prescriptions. A few simple steps may help reduce the burden. One is to work with your doctor to use medications covered by your health plan. Print out a copy of the list of covered drugs and bring it to your next doctors visit. \"If the physician understands the cost structure, he or she may work with the patient to find an alternative\" to expensive medications, says Dr. Robert Carr, president-elect American College of Preventive Medicine in Washington. Generally, generics are much less expensive than brand-name drugs. So if one isnt offered, ask if its available. And, if you cant afford your medicine, look for help. Harvey, the Malibu resident, for example, with the assistance of a care coordinator at UCLA, received a $3,000 grant from the pharmaceutical company that makes his medication. NeedyMeds.org has information on thousands of low-cost or sliding-scale clinics, drug manufacturer discount coupons, and co-pay programs that help people with insurance pay high out-of-pocket drug costs. In addition, pharmaceutical companies offer patient assistance programs for those who are uninsured. RXAssist.org has a database of pharmaceutical company programs that provide free medications to people who cant afford to buy them. Reduce multiple meds. Many people are managing one or more chronic illnesses that require complicated medication regimens. Work with your doctor to simplify your routine. Ask if medications can be put on the same cycle and whether combination pills are available. If you take a lot of medications, its also a good idea to ask your doctor or pharmacist for an annual evaluation. Some may no longer be needed. Put reminders in place. Keep a list of your medications with you, and consider using pill organizers, timers and dispensers. Also, new smartphone apps such as Medisafe that Julian uses can be helpful. In addition to reminding him to take his medications, the app lets Julian allow his caregiver to tap into his account to help him stay on track. \"Any patient that goes onto Medisafe can add what we call a Medfriend who can view a patients schedule,\" says Jon Michaeli, an executive vice president with Medisafe. Caregivers receive notice if the patient misses a dose. Talk about side effects. If you experience uncomfortable side effects, dont just stop taking your medicine. Tell your doctor. Often there are alternatives. Knowing what to expect before you start taking a drug can also help. \"Ask your doctor: What can I expect from this medication? What should I look for to indicate its affecting me in an adverse way and that I should notify you and your nursing staff,\" Carr suggests. \"The informed consumer is the best consumer.\", And make sure your doctor and pharmacist are aware of all the medications you take. This helps avoid negative drug interactions. Add convenience. A recent Kaiser Permanente study found that using mail order pharmacy benefits and increasing the medication supply to 90 days had a positive effect. The study found that people are more likely to take their medication correctly and on time if its immediately available to them. If youre not already using mail order, call your insurer to inquire. Most offer the service. For Julian of Villa Park, missing a dose of epilepsy medication can be extremely dangerous. Thats why hes so vigilant about staying on track. \"For someone like me this is essential.\", healthcare@latimes.com, Twitter: @lisazamosky, Zamosky is the author of \"Healthcare, Insurance, and You: The Savvy Consumers Guide.\"]", "Date": "20150503", "Title": "[How to stick to a prescription drug regimen]", "Link": "http://www.latimes.com/business/la-fi-healthcare-watch-20150504-story.html", "Author": "NULL"}