{"Content": "[In many close election contests, candidates run to the middle. Not Paul Chabot. The Republican military veteran vying for a congressional seat in an increasingly Democratic Inland Empire district is trumpeting his conservative views. He is embracing endorsements from gun-rights advocates and anti-abortion groups. Analysts give a slight edge to his Democratic opponent, Redlands Mayor Pete Aguilar, in the spirited battle to succeed retiring Rep. Gary Miller (R-Rancho Cucamonga). Miller won the seat two years ago, after a surfeit of Democratic candidates splintered their partys vote in the top-two primary and he ended up on the fall ballot against another Republican. Democrats, who hold a six-point registration advantage over Republicans in the district, see the race as one of their best opportunities to pick up a House seat this year. That doesnt seem to faze Chabot. \"This district has a lot of Democrats,\" Chabot, 40, said in a recent interview. \"But theyre conservative, middle-class or working-class Democrats. \"....There are a lot of veterans, a lot of highly religious\" people with whom he believes his views and personal redemption story  he was an alcoholic at age 12  are resonating. Aguilar, 35, was one of the Democrats who ran for the seat in 2012, and party leaders urged him to try again this year. He has charted a middle course. He says his \"proven track record\" of balancing city budgets, fostering job growth and \"reaching across party lines to get things done\" is more in tune with the districts voters, 21% of whom are not affiliated with a political party. \"I have the same shared values that this district has,\" Aguilar said in an interview last week. \"They want someone they know they can trust on the important issues of the day that will move the middle class forward.\", Despite the Democrats registration edge and other factors that favor Aguilar, the political environment this year is unfavorable for the party, said Cal State San Bernardino political scientist Brian Janiskee. He pointed to President Obamas low standing in the polls and the fact that Democrats have historically been less consistent voters than Republicans  especially when there is no presidential race on the ballot. Those tendencies and the low voter turnout that most experts predict could give some Republicans an advantage. \"A low-turnout dynamic,\" Janiskee said, could help Chabot \"keep the race close.\", The contest is getting a lot of attention locally. A campaign forum featuring both candidates last week drew a near-capacity crowd to the 1,300-seat chapel at the University of Redlands. Both candidates have local roots  Chabot grew up in Riverside and Aguilar in San Bernardino. Chabot said his family was poor, and he was raised by his single mom and his grandmother. He started drinking and smoking marijuana when he was 10, ending up in rehab at 12. He cleaned up, later graduated from high school and eventually earned degrees from Cal State San Bernardino, USC and George Washington University. An Iraq War veteran, Chabot remains an officer in the Naval Reserve. He worked for the White House Office of National Drug Control Policy in both the Clinton and Bush administrations. He was a police officer at USC and is a reserve sheriffs deputy for San Bernardino County. He owns a consulting firm specializing in national security and counter-terrorism. Chabots endorsers include those from the National Right to Life Council, the National Rifle Assn. the Howard Jarvis Taxpayers Assn. and TEAPAC, a fundraising arm of the tea party movement. The NRA political arm spent $4,500 to support him, drawing an angry response from the California chapter of Moms Demand Action for Gun Sense in America. He lives in Rancho Cucamonga with his wife, a former probation officer, and four children. Aguilar is married and has two sons. As a teenager in a working-class neighborhood, he bussed tables and washed dishes in the county courthouse cafeteria, which was run by his legally blind grandfather. He attended the private University of Redlands, paying his way with partial scholarships and part-time jobs. After graduation, he went to work in an Inland Empire field office for then-Gov. Gray Davis, a Democrat. At 26, Aguilar became Redlands youngest-ever City Council member. In addition to backing from many Democratic elected officials, Aguilars endorsements include those of the Planned Parenthood Action Fund and the California League of Conservation Voters. The Democratic Congressional Campaign Committee has pitched in financially to support Aguilars candidacy. The committee has spent some $713,000 against Chabot, mostly in negative TV ads that portray him as harsh on immigration and chintzy on school spending. (Chabot said that a statement that he wanted a 20% cut in education funds, made during his unsuccessful run in a 2010 state Assembly primary, was taken out of context.), Another Democratic group, House Majority PAC, has pumped more than a quarter of a million dollars into a mail and TV ad campaign to try to defeat Chabot. And the Everytown for Gun Safety Action Fund spent around $5,000 to oppose him. Aguilar himself has raised significantly more campaign money than Chabot  $1.9 million to Chabots $275,000. The Republican National Congressional Committee has not put money into the race. But several GOP leaders, including House Speaker John Boehner and Majority Leader Kevin McCarthy, have appeared at fundraisers or other campaign events for Chabot. And most of Californias GOP Congress members, including Miller, have endorsed him. The 31st Congressional District stretches east from Upland and Rancho Cucamonga through San Bernardino, Colton and Redlands. Voters there chose President Obama in 2008 and 2012 and Jerry Brown for governor in 2010. They narrowly favored Browns state tax-increase measure in 2012 but resoundingly rejected an initiative to repeal the death penalty that same year, according to the nonpartisan California Target Book, which tracks state politics. jean.merl@latimes.com, Twitter: @jeanmerl]", "Date": "20141026", "Title": "[Views diverge in race for Inland Empire's 31st Congressional District]", "Link": "http://www.latimes.com/local/politics/la-me-pol-inland-empire-congress-20141026-story.html", "Author": "[Jean Merl]"}