{"Content": "[The federal appeals court in New Orleans handed a limited victory to voting rights advocates Wednesday, ruling that Texas strict voter ID law discriminates against minorities and violates the 1965 Voting Rights Act. But experts said the narrow decision could allow Texas to continue to enforce an amended version of the law. The appeals court rejected a lower court judges finding that the voter ID law had a discriminatory purpose, sending that issue back to the trial judge for reexamination under a more difficult standard of proof. Proving discriminatory purpose, as opposed to impact, was a key pillar in the Justice Departments attempt to resuscitate a provision of the Voting Rights Act that was struck down by the Supreme Court two years ago. It could have led to Texas being required to seek approval from the Justice Department or a court before making any voting changes. Still, the ruling from the normally conservative U.S. 5th Circuit Court of Appeals was celebrated by voting-rights advocates as a major victory. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, \"This is not only a triumph for voters of color in Texas who were explicitly targeted by this law, but for voters across the nation who face a rising tide of restrictive voter ID laws in their own states,\" said Penda Hair of the Advancement Project, a national civil rights organization. \"We recognize the charged nature of accusations of racism, particularly against a legislative body, but we also recognize the sad truth that racism continues to exist in our modern American society despite years of laws designed to eradicate it,\" the three-judge panel said in its unanimous decision. The panel found the laws requirement that voters present a photo ID discriminated disproportionally against blacks and Latinos. But Rick Hasen, a voting rights expert at UC Irvine, said the state might be able to preserve the law by allowing other forms of ID, such as a voter registration card. Reflecting the mixed nature of the decision, Texas Atty. Gen. Ken Paxton disputed that the ruling was a defeat for the state. \"Todays ruling was a victory on the fundamental question of Texas right to protect the integrity of our elections, and the states common-sense voter ID law remains in effect,\" he said. tim.phelps@latimes.com, ALSO:, New York City Legionnaires disease death toll rises to 8, Oops: Bounty hunters try to raid Phoenix police chiefs home, Head of pro-Rand Paul super PAC charged with 2012 campaign violations]", "Date": "20150805", "Title": "[U.S. appeals court declares Texas voter ID law discriminatory]", "Link": "http://www.latimes.com/nation/la-na-texas-voter-id-20150806-story.html", "Author": "[Timothy M. Phelps]"}