{"Content": "[The backlash over the Sodomite Suppression Act, the vicious anti-gay ballot initiative proposal, reached the ridiculous stage Wednesday when California Atty. Gen. Kamala Harris announced she would try to block it from the ballot. In a press release, she wrote that this proposal not only threatens public safety, it is patently unconstitutional, utterly reprehensible, and has no place in a civil society. Today, I am filing an action for declaratory relief with the court seeking judicial authorization for relief from the duty to prepare and issue the title and summary for the Sodomite Suppression Act. In so doing, Harris bestowed a level of gravity on a nutty proposal that would have otherwise probably died a quiet, ignoble death in some dark corner. We dont like the proposal any more than Harris does, and said so in an editorial this week urging her not to quash it. Not only does it appear that she doesnt have the authority to keep offensive proposals from voters, but it also just gives the idea and its creator, Huntington Beach attorney Matt McLaughlin, more power. His last initiative attempt in 2003, a measure requiring the Bible be used as a textbook in public K-12 schools, didnt go anywhere either, and with good reason. Maybe 365 people in California might sign the petition to put this on the ballot, but I cant  wont  believe that 365,880 of my fellow Californians are so small-minded and bloodthirsty that theyd want to see gay people put to death. Thats how many people it would take to qualify this or any initiative for the November 2016 ballot. Meanwhile, McLaughlin must be having a great time watching the states leaders scramble to denounce him and this initiative. With just the cost of $200 for the filing fee, hes gotten more attention for his deranged proposal than he could have with an $200,000 advertising budget. And the value of having the states top law enforcer, and possible next U.S. senator from California, use her bully pulpit to personally attack you? Priceless. Follow me on Twitter @MarielGarzaLA]", "Date": "20150325", "Title": "[Kamala Harris' (over)reaction to anti-sodomy initiative gives idea more power]", "Link": "http://www.latimes.com/opinion/opinion-la/la-ol-kamala-harris-anti-sodomy-bill-03252015-story.html", "Author": "[Mariel Garza]"}