{"Content": "[San Francisco billionaire Tom Steyer got a pungent sample Thursday of what awaits him if he runs for U.S. Senate as he fielded questions in an Ask Me Anything chat with an online audience. How many years of tax returns will you release so the climate community knows youre not invested in big oil or coal like you used to be? an interrogator identified as LetsTaxLicensePlates asked Steyer in the Reddit chat. The tart question was one of dozens lobbed at Steyer, a former hedge fund manager who gave $74 million last year to Democrats who pledged to fight global warming. Steyers adversaries in the oil and gas industry, along with the Republican Party, have suggested that his spending on the battle against climate change is hypocritical, given the wealth he built with investments in fossil fuels. The Reddit exchange gave Steyer an idea of what kind of charges opponents would make against him if he runs in the June 2016 primary for Barbara Boxers Senate seat. Boxer, who won the seat in 1992, announced last week that she would not seek reelection. Steyer told his online audience that he did not yet know whether he would enter the race. Question is, can I have more positive influence by running? Steyer wrote. Im trying hard to figure that out, and will do it pretty soon. Reddit offered a tightly controlled forum for Steyer for queries from the public and the media. Theformat enabled him to pick which questions to answer. He skipped many, including this one from xjohnrossx: Tom, please tell me how do you justify forcing others to reduce their energy use when you fly private jets and own several mansions? He didnt get to this one either: How much money did you make off coal?, Steyer sidestepped the question of whether he would release his tax returns, promising only \"transparency\" in general. But he did answer a question on his vow to shed coal, oil and gas investments. My money is now invested passively in funds, with instructions not to invest in fossil fuels, he wrote. But I have been putting my time and efforts and resources into fighting to prevent climate disaster and preserve American prosperity. I think thats investing, too. Steyer is not the only would-be candidate to face criticism before announcing a decision on whether to run. Former Los Angeles Mayor Antonio Villaraigosa, a Democrat who is exploring a potential candidacy, was the target of multiple tweets Wednesday night from a former Los Angeles state senator, Gloria Romero. Her tweets called attention to a letter that Villaraigosa wrote on behalf of Esteban Nuez, who was sentenced to 16 years in prison for his role in the 2008 stabbing death of a San Diego college student. Nuez is the son of former state Assembly Speaker Fabian Nuez, a longtime Villaraigosa ally who used his political connections to try to keep his son out of prison. On his last night in office, Gov. Arnold Schwarzenegger reduced the sentence to seven years. Political favors will become election issue, Romero tweeted. When Villaraigosa first ran for mayor in 2001, rival James K. Hahn attacked him in a TV ad for writing a letter to the Clinton White House on behalf of a convicted drug trafficker. The ad, which included scenes of a crack pipe being held against a flame and a hand cutting cocaine with a razor, helped Hahn defeat Villaraigosa. Four years later, Villaraigosa unseated Hahn in a rematch. For now, state Atty. Gen. Kamala Harris, a Democrat, is the only major candidate in the Senate race, but many others are considering a run. On Wednesday, Rep. Xavier Becerra (D-Los Angeles) told reporters in Washington that he was going to take a very close look at it and would decide in the next few weeks, according to The Washington Post. Ive got to get my wife and three daughters to say, Were there, Becerra said. Twitter: @finneganLAT]", "Date": "20150115", "Title": "[Hedge-fund riches challenged as Steyer weighs Senate bid]", "Link": "http://www.latimes.com/local/political/la-me-pc-steyer-senate-reddit-20150115-story.html", "Author": "[Michael Finnegan]"}