{"Content": "[The House vote to sue President Obama is the first such legal challenge by a chamber of Congress against a president and a historic foray in the fight over constitutional checks and balances. Wednesdays nearly party-line vote followed a feisty floor debate and offered a fresh example of how the capitals hyper-partisanship has led both parties into unprecedented territory, going to new and greater lengths to confront one another. Two years ago, the Republican-led House became the first to hold a sitting Cabinet secretary in contempt of Congress, after lawmakers accused Atty. Gen. Eric H. Holder Jr. of defying their request to turn over records about the Fast and Furious gun-running operation conducted by the Bureau of Alcohol, Tobacco, Firearms and Explosives. Last year, the Democratic-controlled Senate changed the bodys long-standing filibuster rules in response to what they said was blatant obstruction by the minority GOP of presidential nominations, including the first-ever filibuster of a nominee for Defense secretary. Novembers election could further exacerbate tensions in Washington, especially if Republicans  who already hold the House gain control of the Senate. They need a net gain of six seats to do so. The House approved the resolution in a near party-line vote, 225 to 201. It authorizes House Speaker John A. Boehner to file suit in federal court on behalf of the full body to seek appropriate relief for Obamas failure to enforce a provision of the Affordable Care Act that would penalize businesses that do not offer basic health insurance to their employees. That provisions effective date has been delayed by the administration twice and now wont fully take effect until 2016. The GOP-led House has voted to repeal the law, even as it seeks to sue Obama for failing to enforce it. When he unveiled the suit, Boehner insisted it was about more than just Obama. This isnt about Republicans and Democrats. Its about defending the Constitution that we swore an oath to uphold, and acting decisively when it may be compromised, Boehner said Wednesday. Lou Fisher, a constitutional scholar, said the House vote was a new iteration of the push-and-pull between the executive and legislative branches dating to the nations founding. Never before had either the House or the Senate sought to challenge a presidents authority in the courts. Traditionally, such disputes have been handled through political trade-offs or, in the most extreme cases, the impeachment process outlined in the Constitution. In 1834, the Senate voted to censure President Andrew Jackson, although Fisher said the legitimacy of that step was questioned and it was later expunged. Whether the lawsuit will become a new normal may depend on how it plays in November. Maybe that will be the test  who gets hurt more from this? said Fisher, a former analyst on the separation of powers for the Congressional Research Service. Individual members of Congress have sued presidents before. A special House panel has also represented the body in other lawsuits, most recently before the Supreme Court on the Defense of Marriage Act. The House or a House committee can sue an executive agency or White House officials to seek documents or testimony, since the House has an independent authority to investigate. But Rep. G.K. Butterfield (D-N.C.), a former judge, said the latest suit introduced a host of new legal questions. Do you really want to cede to the courts the authority to resolve disputes between the branches? he asked. Would you want the president to sue the House for missing a budget deadline? How would it end?, Legal experts note that the Supreme Court has previously refused to get involved in political spats between Congress and the president, and for that reason the House lawsuit is expected to fail. But Rep. Richard Nugent (R-Fla.) insisted that the House needed to make a stand and defend the Constitution. He cited Obamas own words as a senator challenging President George W. Bush for making \"laws as he goes along. Democrats called the suit a political stunt and defended Obamas use of his executive powers, blaming congressional inaction and gridlock. They warned that the House suit could be the first step toward impeachment, something that has become a staple of campaign messaging for the party and already generated millions in online donations. Speaking on the House floor, House Minority Leader Nancy Pelosi (D-San Francisco) noted how she, after being elected speaker in 2007, faced enormous pressure to launch impeachment proceedings against George W. Bush over the Iraq war. She said Boehners statement that the GOP had no plans to impeach the president did not go far enough. She questioned the use of the Houses time even on the lawsuit resolution. It is yet another Republican effort to pander to the most radical right-wing voters at taxpayers expense, she said. House Democrats used some of the time allotted for debate to press Republicans instead to allow votes on various proposals they say would boost the middle class. David G. Savage and Kathleen Hennessey in the Washington bureau contributed to this report. Follow @mikememoli for more news out of Washington. 4:05 p.m.: This story was updated with more context. The story was originally posted at 3:35 p.m. ]", "Date": "20140730", "Title": "[GOP-led House votes to sue Obama in first-of-its-kind lawsuit]", "Link": "http://www.latimes.com/nation/la-na-house-votes-to-sue-obama-20140730-story.html", "Author": "[Michael A. Memoli]"}