{"Content": "[To the editor: Theres an inherent flaw in basing ones prediction of a future election outcome on a few historical coincidences. And that is history doesnt necessarily repeat itself. (\"In 2016s presidential race, the winner will be ...,\" op-ed, May 26), I have found the collective wisdom of the crowd of those who are willing to wager their hard-earned money to be far more predictive of election results than hypothetical analysis, mathematical models, or even the polls. In Great Britain, where betting on U.S. elections is legal, the markets have been remarkably helpful in predicting who will be our next president, and they do not comport with Yale economist Ray C. Fairs analysis. Frank King, Coronado, .. To the editor: My equations predict that if the Democratic nominee loses in 2016, fewer than 2% of election postmortems will include Fairs phrase \"through no fault of her own.\", Hillary Rodham Clinton starts with a \"blue wall\" of states that have gone Democratic in six or more consecutive national elections, putting her within shouting distance of 270 electoral votes. She enjoys unrivaled name recognition, commands enough funding and personnel to run a small country, and consults with the most gifted politician of the last quarter-century at her dinner table. Michael Smith, Cynthiana, Ky. .. To the editor: Fair overlooks the impact that collective memory might have in 2016. Voters may end up deciding between Hillary Clinton and Jeb Bush, both of whom are closely linked to previous presidents. The outcome of the 2016 election might have as much to do with the current economic growth as with how well voters fared under past Bush and Clinton presidencies. Berta Graciano-Buchman, Beverly Hills, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150529", "Title": "[Don't write off the Democrats in 2016]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-0530-saturday-2016-election-20150530-story.html", "Author": "NULL"}