{"Content": "[Bernie Sanders is more likely to sport a rumpled suit than a hoodie, has no affinity for geeking out on the gadgets of Silicon Valley and may prefer the company of protesters over programmers  yet no candidate running for president is more successfully leveraging technology. The liberal Vermont senators rapid rise from a token leftist to a rival with the potential to disrupt Democratic front-runner Hillary Rodham Clintons path to the nomination confirms that technology, as political data wizards like to say, has become an equalizer in modern campaigns. It is extraordinary how this has revolutionized politics in America, Sanders said in an interview. He is the first to admit that he is no techie. I consider myself smart enough to hire excellent people who know its importance. The Sanders ascent is built on deft use of the campaign tools first developed a decade ago by fellow Vermonter Howard Dean. During his 2004 campaign for president, Dean also was not particularly tech-savvy, but his message resonated with those who were. Sanders is the same. Recently, he overtook Clinton in the number of people searching for his name on Google. His Senate Facebook page has 1.3 million followers, more than any other senator. An online effort to get volunteers to throw house parties in support of Sanders on a day this month has so many people signing upthatthe campaign is trying to figure out how to coordinate it all. Can you imagine 20 years ago anyone thinking you could sit down in front of your computer and talk to tens of thousands of people in America at once and do it at such a reasonable cost? Sanders said. Nobody doubts Sanders ability to draw a crowd. But until recently, a fiery liberal like him would have had considerable difficulty creating a durable campaign operation out of the large groups of peaceniks, environmentalists and college professors turning out to see him in liberal towns like Madison, Wis. and Iowa City, Iowa. Now, off-the-shelf technology is available to build detailed profiles of the thousands who come to rallies and use the data to find many thousands more just like them in early-voting states. Sanders staff can tap into a massive voter file the Democratic National Committee makes available to candidates to pinpoint with precision which people who show up at a rally are prospective precinct captains in Iowa. And instead of a balky, in-house online fundraising tool, Sanders can lean on the transformative liberal fundraising website ActBlue. Thousands of Sanders enthusiasts are playing the role of microbundler, enticing their friends to the Web page where making donations is as intuitive and addicting as shopping on Amazon. Most of these tools were not available until recently, at least not at a price affordable to a grass-roots candidate like Sanders, who disavows corporate money and refuses to launch a \"super PAC.\", We were trying to do this with bubble gum and Scotch tape, said Joe Trippi, who managed the Dean campaign. There is a Ferrari out there now for Bernie Sanders to use. He is doing well with it and can do even more than he has been. It can go even faster and a lot further. We will see where he takes it. Trippi cautions, though, that technology will only get Sanders so far. Like other strategists, he says the appeal of the democratic socialist drops off considerably once he is no longer competing in parts of the country where primary voters share the demographic profile of those in his home state, Vermont  overwhelmingly white, very liberal and older. Still, only weeks ago, there was little talk that Sanders could actually win in New Hampshire or Iowa or both. Now victory in those states is at least conceivable, particularly after about 250,000 mostly small-dollar donors sent the Sanders campaign $15 million during his first quarter as a candidate, an amount that far exceeded the expectations of operatives in Washington. Sanders staff is cagey about particular technologies they are using. But unlike the days of Dean, when the software had to be created on the fly, progressives now have a deep pool of experienced political data-miners from which to draw. The techies working for Sanders are veterans of President Obamas wildly successful digital team. Among them is Scott Goodstein, who was external director for Obama 08. We were looking for a candidate ... who could inspire a movement, he said in a statement. Sanders may be no techie, but the gruff independent with the thick Brooklyn accent has a cult of personality that spawns clicks. In a campaign where strategists are competing with one another to come up with the most clever 404 error page  the page that comes up when you hit on a bad link within a website  Sanders bested his rivals with a video message that mocks his Internet aptitude. Standing awkwardly before the camera in an unfashionable suit and tie, speaking too loudly and with the cadence of a grandparent trying to explain something extremely important and complicated, Sanders directs visitors on how to use the website. Swiping a meaty hand in front of the camera, he says, Just scoot down to the bottom of the page and you will find your way back home to where you should be. The Vermonters success at harnessing social media defies convention. What we do not do, the senator said, is say, Hi, I walked my dog this morning. What a beautiful day. And then tweet it out. Not even close. Sanders writes detailed ideas about such concepts as Americas grotesque level of income inequality and the moral responsibility we must accept to transform our energy system, and his people push it out to his growing mass of followers. In some cases, we will quote other people, Sanders said. Like the pope. I am a big fan of the pope. Digital strategists have seen this before. Howard Dean was thought of as a conservative Democrat who did not know much about the Internet, said John Hagner, a partner at the tech firm Clarity Campaign Labs in Washington and a veteran of the Dean campaign. People who had a lot of technical sense opposed the Iraq war, and they liked what he was saying. He fit the zeitgeist. For more campaigncoverage, follow@evanhalper]", "Date": "20150715", "Title": "[The savvy tech strategy fueling Bernie Sanders' upstart 2016 campaign]", "Link": "http://www.latimes.com/nation/la-na-sanders-campaign-technology-20150715-story.html", "Author": "[Evan Halper]"}