{"Content": "[Hundreds of California laws take effect with the new year, including several drafted in response to corruption scandals in the Legislature, the mass shooting in Isla Vista last spring and racially inflammatory comments by the former owner of the Los Angeles Clippers. Others address drug crimes, the use of aerial drones by paparazzi and rights for immigrants who are in the country illegally. California lawmakers have continued to aid immigrants and tighten gun controls even as Congress has remained gridlocked on those issues. They also passed a raft of bills aimed at winning back public trust in an election year (though the ruling Democrats, tarnished by criminal charges against several party legislators, failed to regain a supermajority in the Capitol). Democratic Gov. Jerry Brown, who meanwhile rode a wave of popularity to a historic fourth and final term, vetoed 143 bills the Legislature sent him, saying they cost too much money, did not improve the state or created unnecessary regulations. He signed 930 others into law. Most of those take effect Jan. 1. Others dont kick in until July, including a ban on single-use plastic grocery bags. Opponents have submitted petitions for a referendum on the law; if the referendum qualifies for the November 2016 ballot, the ban will be delayed until that vote. Also taking effect in July are a minimum of three days paid sick leave each year for workers and a $300-million annual tax break for Hollywood. One law being implemented now allows police or family members to seek a restraining order that bars a person deemed dangerous from possessing firearms for 21 days. Another requires law enforcement agencies to develop policies encouraging officers to consult a state database that shows who owns guns before checking on someone who is potentially dangerous. The measures followed the May massacre in Isla Vista, where Elliot Rodger killed six UC Santa Barbara students and wounded 13 others. Less than a month before, police had visited Rodger to check on his welfare but did not know he had guns. Also last year, federal bribery charges were leveled against two state senators, and Brown signed measures that extend the statute of limitations for prosecuting public bribery cases and double restitution fines for public officials who seek or accept bribes. In addition, public officials are now barred from using campaign funds to pay fines for improper personal use of political funds. The governor also approved a law prohibiting owners of professional sports teams from deducting league penalties from their taxes. In April, a record $2.5-million fine was levied by the National Basketball Assn. against then-Los Angeles Clippers owner Donald Sterling, whose disparaging comments about African Americans caused public outrage. Other new state laws include:, BABIES, Breast feeding: Large airports in California must provide, behind the security screening and separate from restrooms, a room where women can express breast milk. Maternity leave: State universities may not require female graduate students to take leaves of absence for pregnancies and must allow those who do take leaves to return in good standing. BUSINESS, Bitcoin: Digital currencies including bitcoin are legal for transactions in California. Online reviews: Nondisparagement clauses in consumer contracts for goods or services in the state of California are now unenforceable; therefore, businesses cannot use them for civil lawsuits against Californians offering opinions or reviews on Internet sites such as Yelp. CIVIL RIGHTS, Confederate flag: State entities are barred from displaying or selling copies of the Confederate flag or objects marked with it, unless the image appears in a book, digital medium or state museum for educational or historical purposes. CRIME, Badges: Those convicted of using a badge to impersonate a peace officer will pay a higher fine: $2,000 rather than $1,000. Drugs: Those convicted of possessing crack cocaine for sale, who previously could be sentenced to three to five years in jail, now face two to four years  the same penalty applied to offenses involving powder cocaine. Juvenile records: Juveniles convicted of crimes will have their records automatically sealed if they complete all court-imposed orders. Sex offenders: Paroled sex offenders who fail to report for fitting with a GPS monitoring device, or who willfully render such a device inoperable, face a mandatory 180 days in jail. EDUCATION, Allergies: Public schools must stock epinephrine injectors so medicine can be administered quickly to students who suffer serious allergic reactions. Bad behavior: Schools can no longer expel students who \"willfully defy\" teachers or administrators at any grade level and cannot suspend students for that misbehavior through third grade. Consent: Colleges and universities must adopt a standard of clear consent for students engaging in sexual activity. \"Affirmative consent\" is required by both participants. Equality: Public schools must publish the number of girls and boys participating in each sport to show whether the sexes have the required equal access to athletic programs. Genocide lessons: State education officials must consider incorporating lessons about the Armenian genocide and other mass killings, such as those in Rwanda and Darfur, into curriculum standards that will be updated in 2015. Lessons about genocide should include oral testimony from survivors, rescuers and witnesses. ELECTIONS, Absentee voting: Absentee ballots mailed on election day will be counted if they arrive within three days. Formerly the deadline was election day. Ballot initiatives: Proposed initiatives may now be amended after signed petitions are submitted, during a 30-day public-review period. Voter registration: Eligible Californians cannot be disqualified from registering to vote on the grounds that they sign the required affidavit with a mark, cross or signature stamp. ENVIRONMENT, Exide: The state must decide whether to grant a permit for Exide Technologies battery recycling plant in Vernon after determining whether it is complying with hazardous-waste laws, or shut the facility down. Fracking: Oil and gas companies must report the amount of water used in drilling operations that involve hydraulic fracturing, or fracking  a procedure in which water mixed with sand and chemicals is injected into rock. Frogs: The California red-legged frog (Rana draytonii), recognized by the federal government as a \"threatened\" species, becomes the official state amphibian. Mark Twain featured the creature in his story \"The Celebrated Jumping Frog of Calaveras County.\", Trains: Railroad operators must disclose more information to the state and public about crude oil and other hazardous materials being transported through California. That information includes the volume of material and routes taken. FOOD, Access: A new California Farm to Fork Office will be created to promote access to food and make more agricultural products available to schools and underserved communities. Gardens: Landlords may not prevent residents of condominiums and apartments from growing their own fruits and vegetables in portable containers. GUNS, Courts: Courts must report to the state Department of Justice within one business day when a person becomes barred from having a firearm. Standards: Single-shot pistols must comply with the states handgun safety requirements, including having certain safety devices or meeting specified firing tests. Toy weapons: In response to law enforcement shootings of minors brandishing toy guns, manufacturers now must make the toys brightly colored so officers can easily distinguish them from real firearms. HEALTH, Birth control: Most health plans are required to cover contraceptive drugs, devices and products for women, as well as related counseling, follow-up services and voluntary sterilization procedures. Sterilization: State prisons may not force or coerce inmates to be sterilized unless the inmates life is in danger. HUMAN TRAFFICKING, Prostitution: Those convicted of solicitation or prostitution may have the conviction set aside if he or she was a victim of human trafficking. Wiretaps: Courts may approve wiretaps for the investigation or prosecution of human trafficking. IMMIGRATION, Insurance: Immigrants with state drivers licenses are eligible for Californias Low Cost Auto Insurance Program, even if they reside here illegally. A 2013 law that takes effect Jan. 2 allows specially marked licenses for undocumented residents, and a separate new law prohibits employers from discriminating against anyone with such a license. Professional licenses: Those in the country illegally will no longer need a Social Security number to obtain state licenses to work as doctors, dentists, nurses, barbers, security guards or for many other jobs. Proposition 187: State law books will be stripped of provisions in the 1994 ballot measure that would have withheld public services from those in the country illegally but were ruled unconstitutional. Student loans: Immigrants residing in the country illegally are eligible to apply for student loans funded by the state to help them attend University of California or California State University campuses. INTERNET, Booking photos: Internet websites may no longer charge a fee to people who have been arrested in exchange for removing their booking photos from a website. Children: Businesses may no longer use personal information about minor students obtained through Internet education websites and mobile applications for any purpose other than online education. Court orders: Victims of \"revenge porn\" can seek court orders to have sexually explicit photos posted by others removed from the Internet and to ask for damages. Selfies: The law against posting sexually explicit photos of someone online as retaliation is extended to photos taken, though not posted, by the victim. JUSTICE SYSTEM, DNA: Imprisoned felons can get DNA tests of evidence if they show that such tests are relevant to their cases, replacing the current requirement of a demonstration that it would prove their innocence. Sentences: Those convicted of aggravated arson  in which damages and firefighting costs exceed $7 million  can be sentenced to prison for 10 years to life. Truants: Confinement in a juvenile detention facility, or juvenile hall, is no longer allowed as a penalty for minors who are found in contempt of court solely for failing to obey a judges order to attend school. PRIVACY, Data mining: State agencies are barred from cooperating with federal officials in the mass collection of phone and computer records unless a warrant has been issued. Drones: Prosecution for invasion of privacy is permitted when aerial drones are used to photograph or record another person in a private setting. Students: School districts collecting information on students through social media are limited to data involving student or school safety. Districts must allow parents to review and correct any such information collected. RESIDENTIAL CARE, Admissions: The state may block new admissions to a residential care facility that has been cited for violations posing a risk to the health and safety of residents. Carbon monoxide: All community care facilities, including child care establishments and residential care homes for the elderly, must have at least one carbon monoxide detector installed. Violations: Residential care facilities for the elderly must remedy license deficiencies within 10 days of notification. SEX AND GENDER, Births: Same-sex couples are allowed to identify themselves on state birth certificates as \"father,\" \"mother\" or the new gender-neutral option of \"parent.\", Death certificates: Transgender Californians will be able to have the gender they identify with listed on their death certificates. TRANSPORTATION, Bike trails: Local agencies, including cities and park districts, may place proposals on the ballot that, if two-thirds of local voters approve, would impose a vehicle registration surcharge of up to $5 to develop and maintain bikeways. Light rail: The Los Angeles County Metropolitan Transportation Authority is permitted to convert the Metro Orange Line busway to light rail in the San Fernando Valley. VETERANS, Cemetery: State and local officials can begin working to create a new veterans cemetery at the former El Toro Marine Corps Air Station in Irvine. Criminal convictions: Courts may create a diversion program for active military personnel or veterans who commit misdemeanors and are suffering from service-related trauma or drug abuse. patrick.mcgreevy@latimes.com, Twitter: @mcgreevy99]", "Date": "20150101", "Title": "[California's new laws for 2015: How are you affected?]", "Link": "http://www.latimes.com/local/politics/la-me-pol-new-state-laws-20150101-story.html", "Author": "[Patrick McGreevy]"}