{"Content": "[President Obama said Saturday that Hillary Rodham Clinton would make an excellent president, lauding his former secretary of States record on foreign and domestic policy on the eve of her long-expected announcement of another White House run. Though he didnt quite offer Clinton a full endorsement when asked about her candidacy at a news conference here, Obamas effusive praise of his former rival contrasted with his silence when asked about a still-possible campaign by Vice President Joe Biden. Clinton, Obama said, was a formidable candidate in 2008, and then a great supporter of mine after she ultimately conceded the Democratic nomination to him. She was an outstanding secretary of State. She is my friend. I think she would be an excellent president, he said. But when asked later about whether the Democratic field was wide-open, and about Bidens possible interest, Obama demurred. Not only have I run my last election, but I am not in the business of prognosticating on future of elections, he said. Obama was in Panama to attend the VII Americas Summit. Clinton is expected to make her candidacy official first through social media, perhaps Sunday afternoon, followed by campaign appearances in key states next week. Republicans will be quick to target Clinton not only for her own well-worn record in public life but also for her connection withthe outgoing president. But, in response to Republicans who might suggest a Hillary Clinton presidency would represent an Obama third term, Obama said: Im not on the ballot. Shes going to be able to handle herself very well in any conversations and debates around foreign policy, he said. And her track record with respect to domestic policy is, I think, one that cares about working families. If she decides to run, if she makes an announcement, shes going to have some strong messages to deliver. Follow @mikememolion Twitter.]", "Date": "20150411", "Title": "[Obama: Hillary Clinton would be an 'excellent president' ]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-obama-clinton-announce-20150411-story.html", "Author": "[Michael A. Memoli]"}