{"Content": "[Russias ruble has been on a roller-coaster ride, posting the second-biggest drop in value of world currencies in 2014, then bouncing back this year with the highest rise against the dollar, euro, pound and yen. The rubles dizzying comeback, though, is due neither to an economic boom nor to sustainable intervention by the Russian Central Bank. And it came at a steep price. Steadying the ruble at about 50 to the dollar has drained the countrys hard-currency trove of $150 billion, more than a quarter of the reserves on hand at the end of 2013. Those cash infusions have done little to cheer Russian consumers or businesses: Inflation remains at more than 16% and the European Bank for Reconstruction and Development predicts that the overall economy will shrink by 4.5% this year. And stabilizing the ruble was achieved only after President Vladimir Putin shook down Russias oligarchs for what he considered their fair share toward arresting the currencys tumble, a tactic unavailable to the stewards of a free-market democracy. \"There is no strategy and no vision. Its all live for today,\" said economist Sergei Guriev, a former rector of Moscows New Economic School living in self-imposed exile in Paris. Russias disappearing middle class and the working poor are paying the price for the Kremlins economic fiddling, Guriev said. He points to an average 10% drop in real income last year, a jump in mortgage defaults and rising food and utility prices. A $500-billion, decade-long military modernization program augurs even grimmer years to come. Car sales in Russia dropped 42% in April from the same month last year, the Assn. of European Businesses reported last month. The share of Russians who can afford no more than the absolute necessities has soared to 20%, the highest since polling on the subject began a decade ago, the Nielsen research firm reported last month. Even during the 2009 recession, the report noted, only 7% of respondents said they could afford nothing more than food and shelter. \"But people know not to blame Putin. They know it is all the fault of Obama and the Ukrainian fascists that they have to suffer economically to confront these evil people,\" Guriev said, mocking the prevailing public attitude molded by a lavishly funded propaganda campaign on state-run television. \"In Russia we say that theres the television and theres the fridge,\" said the economist, who until last year was part of the Kremlins financial inner circle. \"People believe what they see on television, but when they dont see anything in the fridge they stop believing. If the government doesnt have the cash it needs and sees that its propaganda is no longer convincing, it may embark on a new military adventure to make people believe again.\", The economy was ticking along with healthy growth in most recent years until Russian troops seized Ukraines Crimea region in 2014. The United States and the European Union imposed sanctions on Moscow for its violation of international law and its neighbors sovereignty. Those measures, which cut off international lending and blacklisted dozens of Kremlin kingpins, have coincided with the decline of world oil prices to half their value of a year ago. And in spite of repeated pledges by Putin to diversify the economy since he first took office in 2000, Russia remained dependent on oil and gas sales for more than half of its income when the latest financial crisis hit. The government in April revised its 2016 budget to take into consideration the decline in expected energy revenue, which originally had been calculated at $100 a barrel for oil. The deficit spending now envisioned for next year will eat up an additional $200 billion from the hard-currency reserves, and more if the military modernization project continues to be exempt from the budget cuts forced on almost every other economic sector. Putin has micromanaged the financial crisis in much the same away as he has guided the countrys geopolitical strategy. He summoned his nations captains of industry to the Kremlin for an emergency session Dec. 16, when the ruble was trading at 80 to the dollar. According to the RBK business journal, he told them that the rubles collapse threatened their welfare as well as that of the country and that they had an obligation to repatriate the money they had stashed in foreign banks. There was no official edict issued, and the journal observed that the Kremlin has limited means of controlling how oligarchs or ordinary citizens handle their finances. Putin did declare a \"capital amnesty\" after the December meeting, and the State Duma, the lower house of the parliament, has been struggling since then to draft legislation aimed at assuring offshore depositors that repatriating their capital wont lead to investigations of whether they came by it legally. A history of nationalizations, corruption and asset seizures has undermined faith in the security of Russia-based wealth, explaining the flight of more than $150 billion in capital last year alone. But lost on none of the oligarchs was the unspoken threat of reprisals if they failed to do their part to halt the rubles free-fall. Memories were still fresh of the September house arrest of oil magnate Vladimir Yevtushenkov and seizure of his assets, not to mention the 10 years that former billionaire Mikhail Khodorkovsky spent in prison for challenging Putins political domination. The billionaire owners of Lukoil, Severstal, Norilsk Nickel and three dozen other major enterprises had converted enough of their hard-currency holdings by late February to boost the rubles value to about 60 to the dollar. Igor Sechin, head of the oil monopoly Rosneft, told the Tass news agency that he had sold $93 billion for rubles in 2014. The winter run on the ruble was triggered by the converging effects of sanctions and the nadir in oil prices that flirted with $45 a barrel in December. Oil has lately traded for about $60 a barrel. Putin has brushed off sanctions as little more than an irritant and banned European food imports in retaliation. He has ordered major importers to buy Russian-made goods to replace the components they used to get from Western manufacturers, though domestic production cant ramp up to meet the new demand when the scant credit available from Russian banks comes with double-digit interest rates. As national coffers emptied late last year, Putin ordered 10% across-the-board cuts in government-funded services for regions and municipalities, with only pensions and the ambitious defense overhaul spared the budget ax. Government economists have revealed little about the brainstorming that goes on behind the Kremlins closed doors or their own candid views on Putins handling of the crisis. But academics and independent economists willing to comment from their lofty remove see little to suggest that the current problems will be short-lived. \"There is nothing good\" in the mid- or long-term forecast, concluded Alexander Savelyev, a senior scholar at the Russian Academy of Sciences Institute of World Economy and International Relations. \"And the majority of experts expect further decline.\", Twitter: @cjwilliamslat]", "Date": "20150625", "Title": "[Putin manages to stabilize ruble, but Russian economy still staggers]", "Link": "http://www.latimes.com/world/europe/la-fg-russia-resilient-ruble-20150625-story.html", "Author": "[Carol J. Williams]"}