{"Content": "[This isnt a glorious summer for Hillary Rodham Clinton. Shes running for president as hard as she can, rolling out wonky policy proposals, holding town meetings, even talking with reporters now and then. But her poll numbers are down, especially on whether shes trustworthy and honest. Surveys that once had her trouncing any Republican opponent (Florida Gov. Jeb Bush, for example) show the gap has narrowed. Her policy speeches on Wall Street regulation and climate change got mixed reviews, even among Democrats. Progressives are particularly unhappy that shes dodging the issues they care about: the proposed trade agreement with Asia and the Keystone XL oil pipeline. Clinton is neither for nor against, an awkward position for a candidate who needs a shot of trustworthiness. (Bernie Sanders, whose positions arent so hedged, is drawing ecstatic liberal crowds.), As if that werent enough, shes still got that email problem. The U.S. intelligence communitys inspector general found that, contrary to her claim, Clintons private emails did contain classified information, although the material apparently wasnt marked as secret. He has asked the Justice Department to investigate whether security regulations were broken. Its enough to make any campaign a little edgy. Some of her people are nervous, sure, a Democratic strategist with ties to the Clinton camp told me. But campaign people are always nervous. These setbacks wont block Clintons march to the Democratic nomination. She still commands a daunting margin of about 40% over Sanders in national polls. Polls are closer in Iowa and New Hampshire, where the first votes will be cast, but not close enough to make it a real contest yet. Rather, these glitches point to vulnerabilities for Clinton in a general election campaign. While voters views of her are predictably polarized by party affiliation, she faces skepticism among independents. A CNN poll last month, for example, found that 81% of Democrats said they had a favorable view of Clinton  and 82% of Republicans had an unfavorable view. Among independents, though, the balance was negative: 47% unfavorable, 37% favorable. Likewise, an earlier CNN poll that found 57% of voters did not consider Clinton to be honest, including 87% of Republicans  and 61% of independents. Can Clinton fix that kind of trust problem after more than 25 years in the public eye?, Not simply by talking about it, as became clear when she told CNN, People should and do trust me. There wasnt much else she could say, but her assertion of honesty was painfully awkward. Her campaigns response has been: Lets change the subject. Thats the wrong question to focus on, Clinton aide Jennifer Palmieri told me. The real question is: Do you believe shes going to fight for you? Her whole campaign is focused on proving that, and we do well on that question. So instead of focusing on bolstering her own trustworthiness, Clinton is working to shore up support among those who deeply distrust Republicans with their interests: unmarried women, African Americans and Latinos. Shes been emphasizing womens issues and playing up her new status as a grandmother  a big change from her campaign in 2008. And at the National Urban League last week, she came out swinging, telling her mostly African American audience: You cannot seriously talk about the right to rise  Bushs campaign slogan  and support laws that deny the right to vote. Still Clintons trust problem wont go away. The email controversy, set in motion by her decision to use a personal server when she was secretary of State, ensures that. In addition to the latest Justice Department investigation, the State Department has been ordered to continue to release copies of Clintons emails as they are declassified, month by month  meaning voters will be reminded of the issue over and over. Palmieri repeated the campaigns contention that the candidate did nothing wrong and pointed out that Clinton has weathered scandals before. Shes not Teflon, but shes cast iron, the aide said. Besides, as political analyst Charlie Cook recently pointed out, the trust question isnt always decisive. In 1992, the Democratic nominee won despite the fact that most voters didnt find him particularly honest. His name was Bill Clinton. doyle.mcmanus@latimes.com, Twitter: @doylemcmanus, Follow the Opinion section on Twitter @latimesopinion and Facebook, ALSO:, Trail Guide: Your daily tour along the road to the White House, Hillary Clinton takes a shot at Jeb Bush on race in front of black activists, Hillary Clinton amassed a lot of wealth in recent years -- and does yoga]", "Date": "20150802", "Title": "[Hillary Clinton's summer slump]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0802-mcmanus-hillary-clinton-summer-slump-20150803-column.html", "Author": "NULL"}