{"Content": "[Forty-five years after her first UCLA teaching gig attracted the wrath of Gov. Ronald Reagan, Angela Y. Davis is back on campus this semester, as regents lecturer in the gender studies department. Her Thursday address in Royce Hall, about feminism and prison abolition, sums up some but not all of her work  a long academic career paralleled by radical activism. President Nixon called her a \"dangerous terrorist\" when she was charged with murder and conspiracy after a deadly 1970 courthouse shootout. She was acquitted, and since then, the woman born in the Jim Crow minefield of Birmingham, Ala. has written, taught and lectured around the world. Her iconic Afro has morphed from its 1970s silhouette; her intensity has not. Congress is working on prison-sentence reform. Many states have banned capital punishment. Isnt this encouraging?, Ive associated myself with the prison abolition movement; that does not mean I refuse to endorse reforms. There is a very important campaign against solitary confinement, a reform that is absolutely necessary. The difference resides in whether the reforms help to make life more habitable for people in prison, or whether they further entrench the prison-industrial complex itself. So its not an either-or situation. What would a just prison system look like to you?, Its complicated. Most of us in the 21st century abolitionist movement look to W.E.B. Du Bois critique about the abolition of slavery  that it was not enough simply to throw away the chains. The real goal was to re-create a democratic society that would allow for the incorporation of former slaves. [Prison abolition] would be about building a new democracy: substantive rights to economic sustenance, to healthcare; more emphasis on education than incarceration; creating new institutions that would tend to make prisons obsolete. You think prisons wont be necessary one day?, It is possible, but even [if it doesnt happen], we can move to a very different kind of justice that does not require a retributive impulse when someone does something terrible. Do you watch the prison-themed comedy-drama \"Orange Is the New Black\"?, I not only saw the series but I read [Piper Kermans] memoir. She has a much deeper analysis than one sees in the series, but as a person who has looked at the role of womens prisons in visual culture, primarily films, I think [the series] isnt bad. There are so many aspects that often dont [appear in] depictions of people in those oppressive circumstances. \"12 Years a Slave,\" for example  one thing I missed in that film was some sense of joy, some sense of pleasure, some sense of humanity. You are back this semester at UCLA, the campus from which Gov. Ronald Reagan had you fired. This was an offer I could not refuse. The students are very different from the students of 1969, 1970. Theyre so much more sophisticated, in the sense of having more complicated questions. When you consider feminism today, do you think women have retreated, except maybe when it comes to boardroom feminism?, One can talk about multiple feminisms; it is not a unitary phenomenon. There are those who assume feminism is about moving up the hierarchy into positions of power, and thats OK, but thats not what feminism does best. If the women at the bottom move up, the whole structure moves up. The kind of feminism I identify with is a method for research but also for activism. Stokely Carmichael sort of joked that the position for women in the civil rights movements Student Nonviolent Coordinating Committee was \"prone.\" Are women full partners in politics today?, Perhaps not completely, but we have made a lot of progress. In the way we think about past movements, I encourage people to look beyond heroic male figures. While Martin Luther King is someone I revere, I dont like to allow his representation to erase the contributions of ordinary people. The 1955 Montgomery bus boycott was successful because black women, domestic workers, refused to ride the bus. Had they not, where would we be today?, You support free birth control and abortion, which is denounced in some quarters as genocidal. Sometimes [in] what might appear to be outlandish statements, we discover there may be a kernel of truth. While I would never argue that birth control or abortion rights constitute genocide, I have to take into consideration how sterilization has been imposed on poor people, especially people of color, and that someone like Margaret Sanger argued [birth control] was a privilege for affluent women but a duty for poorer women. What do you think of the nations first black president?, There are moments of enormous possibility, and the election was such a moment. People all over the world felt as if we were moving toward a new world. However brief that sense of euphoria was, we should not forget that. That allows us to understand what possibilities might reside in the future. [But] many people tended to deposit so many aspirations in this single individual that they failed  we failed  to do the work [to take] better advantage of that moment. People went to the polls and said, \"Weve done our job,\" and left it up to Obama. Is democracy a good chassis on which to build a political system?, I believe profoundly in the possibilities of democracy, but democracy needs to be emancipated from capitalism. As long as we inhabit a capitalist democracy, a future of racial equality, gender equality, economic equality will elude us. You ran for vice president on the Communist Party ticket in 1980 and 1984; was that about faith in the democratic process?, It was about suggesting that there are alternatives. No one believed it was possible to win, but the 80s [saw] the rise of the globalization of capital, the prison-industrial complex, and it was important to provide some alternative political analyses. Whats your thinking on communism now?, I still have a relationship, [but] Im not a member. I left the party because I didnt feel it was open to the kind of democratization that we needed. I still believe that capitalism is the most dangerous kind of future we can imagine. Why did communism fail where it did?, That would require a long conversation. There may have been economic democracy, which we lack in the West, but without political and social democracy, it just doesnt work. I dont think we should throw the baby out with the bathwater; it would be important to look at what really worked and what didnt. Like no free speech?, Yes. 2016 will be the 50th anniversary of the Black Panther Party; you were a member for a time. The civil rights movement tended to be focused on integration, but there were those who said, \"We dont want to assimilate into a sinking ship, so lets change the ship altogether.\" The emergence of the Black Panther Party marked a moment of rupture, and we are still in that moment. The party had two different kinds of activism: grass-roots activism that helped to create institutions that are still working  for example, the Agriculture Department now runs free breakfast programs. On the other hand, the posture of self-defense and monitoring the police. If one looks at the party 10-point program, every single point is as relevant or more relevant 50 years later. The 10th point includes community control of technology. That was very prescient. Its about using technologies rather than allowing them to use us. Some people must still see in you the young woman who endorsed violence against police, violence in political movements. Its important to understand the differences between that era and this era. Our relationship with guns was very different, largely revolving around self-defense. Today, when theres something like 300 million guns in the country, and weve experienced these horrendous shootings, we cant take the same position. I am totally in favor of gun control, of removing guns not only from civilians but also from police. Guns you owned were used in the 1970 kidnapping and shootout at the Marin County Civic Center. You were acquitted of all charges. I read you purchased the guns for self-defense. Yes, and I talked about the fact that my father had guns when I was growing up; our families needed to protect themselves from the Ku Klux Klan. We have laws against hate crimes [now]; I am ambivalent about [them] because oftentimes they end up being used against people who were initially the victims. Anti-lynching legislation is issued more against black kids and so-called gangs. Oftentimes the tools against racism are being used in the service of a kind of structural racism. The documentary \"Free Angela and All Political Prisoners\" makes much of your relationship with George Jackson, the prison activist killed in Soledad Prison. Too much?, I would have placed the emphasis elsewhere. If you talk to [director Shola Lynch], youll see she was working with conventional genres; she sees the film as a political drama, a crime thriller and a love story. Even so, the research she did was quite amazing. She found archival material I had never seen before. She interviewed one of the FBI agents who arrested me, and in that interview, I discovered how they caught me. Im impressed by the way the film has affected young people. It can help intergenerational conversations that teach me something and teach younger people something. What became of the radical, personal, confrontational writing of the 1960s and 70s?, Its an interesting question. In many ways we were on our own. We were experimenting. Those experiments are important because without moving into realms about which one knows nothing, there will never be any change. I expect people say to you, \"If you dont like it in America, why are you here?\", I have lived in other places but this is my home, and I feel committed to transforming this country. I have felt that way since I was a child. My mother was an activist believing in the possibilities of transforming the world. I still have not given that up. This interview was edited and excerpted from a transcription. ]", "Date": "20140506", "Title": "[Angela Y. Davis on what's radical in the 21st century ]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-morrison-davis-20140507-column.html", "Author": "NULL"}