{"Content": "[Ron Paul spent much of his presidential campaigns serving as the crank on the debate stage. But here in Iowa in 2012, he finished a strong third, the beneficiary of an outpouring of libertarian love. Now his son Rand Paul has embarked on his own run for the White House, and he hopes to be embraced by his fathers passionate followers. But to avoid his fathers fate  at the end, less a serious contender than an asterisk  Rand Paul must pull off a far harder task, convincingnot only his fathers backers but voters of other stripes that they should side with him. Already in Iowa, where Paul campaigned Friday, the difficulties are obvious. Drew Ivers, who ran the fathers Iowa campaigns in 2008 and 2012, is undecided about whether he will support the son. He cites policy changes Rand Paul has made in his effort to broaden his appeal. His \"voting record is good, but his rhetoric over the last two years as he ramped up for his announcement has deviated from his voting record,\" Ivers said. \"He is sending some mixed signals.\", In other states and in other presidential election years, solidifying libertarian support would not be a priority. But with an enormous potential field of GOP candidates and the outsized voice of Iowans, who hold the first presidential nominating contest in the nation, consolidating their support is critical for a self-described \"libertarian-ish\" candidate like Paul. Even a small amount of defection could harm his chances, given the tiny number of Iowans who actually participate in the states caucuses. In 2012, about 121,000 GOP voters caucused here, with Ron Paul claiming 21% of the vote, 3% less than the winner, former Sen. Rick Santorum. Pauls ardent backers then engineered a hostile takeover of the state Republican Party, leading the lions share of Iowas delegates to cast ballots for the Texas congressman at the Republican National Convention. Political observers and even operatives who are supporting other candidates widely expect Rand Paul to hold on to many of these activists. The Rev. Glen Bandel, a part-time pastor at Nora Springs Christian Church, is among those who endorsed the elder Paul and plan to caucus for the son. \"Hes No. 1 on my list,\" said Bandel, 86. \"Theyre not the same. Theyre not identical. Theyre two separate individuals but theyve both got some pretty good ideas.\" Rand Paul, he said, \"looks pretty conservative.\", The candidate says retaining such backers is key to his prospects. \"The core of our organization in Iowa remains from my fathers supporters,\" Paul said in an interview, noting that he followed a similar playbook in his 2010 Senate race in Kentucky. \"The strategy to winning is to expand the group of followers that we had. The goal is to unite coalitions and to bring people together. Thats what Ive spent a lot of the last two years showing.\", But Pauls efforts during the lasttwo years are precisely what are turning off some of his fathers backers, such as Joel Kurtinitis. The 30-year-old served as a regional director for Ron Paul in 2012; this year he has signed on as a state co-chairman for Sen. Ted Cruz. The Texan, a tea party favorite who is Rand Pauls main rival among those voters, is aggressively courting the elder Pauls Iowa supporters. Kurtinitis said he was disappointed by some of Pauls recent political moves, such as backing Senate Majority Leader Mitch McConnells reelection over a tea party challenger, and playing \"identity politics\" as he tries to broaden his base. \"In terms of courage and conviction and integrity -- the things people loved about Ron -- being against the establishment, standing up to leaders of both parties, Cruz has really pulled away from the pack,\" he said. Rand Paul \"has in some ways passed up that opportunity in attempting to reach to the middle and attempting to seemingly please everyone.\", The tension has been on display in recent months. Last week, Paulproposed increasing defense spending by $190 billion over the next two years, a stark contrast from his earlier calls to slash military budgets. In interviews since he launched his presidential bid on Tuesday, Paul has been questioned about shifting his foreign policy views from non-interventionist to something more muscular. He has stumbled when asked about his position on abortion and foreign aid to Israel -- both areas in whichan answer that would endear him to evangelical voters would alienate some libertarians and millennials. \"Hes struggling with several issues between his libertarian heritage and his attempts to appeal to social conservatives,\" said Dianne Bystrom, director of the Carrie Chapman Catt Center for Women and Politics at Iowa State University. \"Those always dont mesh so well.\", However, Paul may enjoy one advantage in Iowa that his father did not -- the youth vote. Ron Paul sparked palpable enthusiasm on college campuses, where he was greeted more like a rock god than a slight congressman who was old enough to be most students grandfather. But in the last two presidential cycles, the caucuses occurred Jan. 3, when students were home for winter break. But next year, if the GOP nominating schedule holds, Iowas caucuses will take place in early February, offering all the candidates an opportunity to mobilize young supporters. Pauls brand of libertarianism, opposition to government spying tactics, and calls for reducing penalties for nonviolent drug use could make him a natural Republican beneficiary of this scheduling change. In a nod to this scenario, Paul on Friday held his first Iowa event as an official candidate at the student union at the University of Iowa. Paul called for making college tuition tax-deductible, and highlighted his opposition to government surveillance of phone and computer records, and to jail sentences for nonviolent drug users. He pledged to be a different kind of politician than the entrenched representatives of both parties in Washington. \"If we elect politicians that will say or do anything to get elected, whats the point? Why bother?\" Paul asked. \"If all politicians look alike, sound alike, dress alike, [offer the same] platitudes, why even bother voting? If we want the Instagram generation to get up off their sofas, to leave their dorm rooms and vote, someone needs to come forward and make it worth their while.\", Twitter:@LATSeema]", "Date": "20150411", "Title": "[In Iowa, Rand Paul's disparate 2016 needs collide to his detriment]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rand-paul-2016-iowa-20150411-story.html", "Author": "[Seema Mehta]"}