{"Content": "[Hopscotching across fiercely divided terrain, candidates in the countrys hottest contests made their final urgent appeals Monday in a midterm election that will determine control of the U.S. Senate and the size of the Republican House majority. After record spending of about $4 billion and an avalanche of mostly negative ads, Republicans seemed certain to gain seats in the Senate, the key question being whether they win the six necessary to seize control from Democrats. The GOP was also expected to bolster its numbers in the House by a small number of seats. President Obama, who has been of little utility to fellow Democrats owing to his weak standing in polls, stayed largely out of sight Monday, though he was heard in a new radio spot for North Carolina Sen. Kay Hagan and in a get-out-the-vote call promoting underdog Texas gubernatorial hopeful Wendy Davis. Republican Greg Abbott was expected to easily win the Texas race. Other contests among Tuesdays 36 gubernatorial elections were far more competitive, including Wisconsin, where Republican Scott Walker hoped reelection to a second term would help launch him into a 2016 presidential run. The man who stands to benefit most from a Republican Senate takeover, Minority Leader Mitch McConnell, spent the day barreling across his home state of Kentucky, accompanied by Rand Paul, the states junior Republican senator and another likely White House contestant in 2016. \"I dont believe our state has ever had two senators in a better position to influence the course of events in our country than we have right now,\" McConnell told supporters at an event at the Cincinnati/Northern Kentucky International Airport. \"Were counting on you not to give that up.\", McConnells middling popularity after decades in Washington presented Democrats with a rare chance to gain a seat that would offset expected losses elsewhere. But after a costly and close-fought race against Democratic Secretary of State Alison Lundergan Grimes, McConnell appeared to have gained a bit of breathing room and glanced ahead to serving in the majority. \"Look, we need to get the Senate back to normal and we need to pass bills,\" said McConnell, blaming Obama for the Washington gridlock that Grimes sought to tie around his neck. \"We need to put them on his desk. We dont know whether hell sign them or not, but by golly were going to start functioning again.\", Grimes, staging her own last-minute statewide blitz, said she was poised to shock the presumed political experts. \"Were on our way to making history,\" she said at an outdoor rally in Newport, with the Cincinnati skyline behind her across the Ohio River. \"This will be a photo finish.\", In Colorado, scene of one of the nations hottest Senate races, the two contestants were among an untold army of candidates, political operatives and volunteers across the country focused on their No. 1 priority in the next 24 hours: getting voters to the polls. Democratic Sen. Mark Udall, battling for a second term, visited Metropolitan State University of Denver, where he made his pitch to Latino voters, a key party constituency that has shown signs of apathy this election season. Joined by former Interior Secretary Ken Salazar, a onetime Colorado senator, Udall called for an overhaul of the nations immigration laws and vowed to pressure Obama the day after the election to take executive action to keep families together. \"Your vote matters. Your vote is your voice. Su voto es su voz,\" Udall said. While the embattled incumbent rode his sky-blue campaign bus to multiple stops across the Denver region, his challenger, Republican Rep. Cory Gardner, made just one public appearance, rallying volunteers in the suburbs south of Denver. \"We have always said Colorado will be the tip of the spear,\" Gardner said. \"The fulcrum of power, the opportunity to change this direction around.\", In Iowa, another state key to control of the Senate, a final-day flap arose over comments retiring Democratic Sen. Tom Harkin made comparing the Republican nominee, state Sen. Joni Ernst, to ingenue singer Taylor Swift. \"Ive been watching some of these ads,\" Harkin said at a Story County barbecue, according to video posted Sunday night by Buzzfeed. \"And theres sort of this sense that, Well, I hear so much about Joni Ernst. She is really attractive, and she sounds nice., \"Well I got to thinking about that. I dont care if shes as good looking as Taylor Swift or as nice as Mr. Rogers ... if she votes like Michele Bachmann, shes wrong for the state of Iowa,\" Harkin said, referring to the fiercely conservative Minnesota congresswoman. Ernst, facing Democratic Rep. Bruce Braley in a closely fought contest, has campaigned as \"a southwest Iowa farm girl,\" citing her experience castrating pigs and promising to apply the same sharpened blade to Washington spending. After initially taking offense at Harkins remarks in a Fox News interview, Ernst later brushed aside the comments. \"You know what,\" Ernst said on KCCI TV in Des Moines, \"just as Taylor Swift would say: Shake it off.\", Later, Harkin issued a statement apologizing. \"I am only human and I can make mistakes sometimes in how I say something,\" he said. michael.memoli@latimes.com, kurtis.lee@latimes.com, Twitter: @mikememoli, @kurtisalee, Memoli reported from Kentucky and Lee from Colorado. Times staff writers Mark Z. Barabak and Maeve Reston in Los Angeles contributed to this report.]", "Date": "20141103", "Title": "[Candidates in hottest races make final appeals: 'Your vote matters']", "Link": "http://www.latimes.com/nation/la-na-election-campaign-20141104-story.html", "Author": "[Michael A. Memoli, Kurtis Lee]"}