{"Content": "[A mere two years after futilely shutting down much of the federal government in a doomed-from-the-start effort to defund Obamacare, congressional Republicans appear determined to force another shutdown in a doomed-from-the-start effort to defund Planned Parenthood. And with a few notable exceptions, the GOP presidential candidates have been cheering on this exercise in dysfunction. Republicans havent scored an outright win on Obamacare, taxes or virtually any other major issue since taking over the House in 2011  not even after they became the majority in the Senate this year. That experience is strengthening the impulse to dig in and fight now. As Louisiana Gov. Bobby Jindal put it during the warmup GOP debate at the Reagan Presidential Library on Wednesday, If we cant defund Planned Parenthood now, if we cant stand for innocent human life after these barbaric videos, it is time to be done with the Republican Party. Never mind that the barbaric videos are just a pretext to attack a group that social conservatives have long despised. The reality is that power remains divided and the parties polarized in the nations capital. Senate Democrats have enough members to filibuster any bill they dont like, and even when a disputed bill has made it through, President Obama has found enough allies in Congress to sustain a veto. Yet the GOPs tea party wing continues to agitate for more confrontation  for instance, by refusing to provide money for any government programs in fiscal 2016 unless every federal dollar for Planned Parenthood is cut off. If Republicans try to impose such a condition, theyll be met either with a Senate filibuster or a presidential veto, and the government will shut down. Assuming Congress finds a way around the Planned Parenthood impasse, the spending bills for the fiscal year that starts Oct. 1 face a bigger problem. A 2011 budget law imposed what was known as the sequester, a set of tough spending caps that Republicans have now proposed to circumvent, but only for defense. Obama told lawmakers months ago that he would veto any spending bill that doesnt lift the caps for non-defense programs as well, yet theres been no progress toward a deal. In fact, Republicans have shown little interest even in negotiating. The two-week shutdown that Republicans forced in 2013 didnt seem to hurt the party in the 2014 election, so its possible that lawmakers may not see a downside in forcing another one. But doing so would not only hurt the thousands of federal workers and contractors whod receive no pay; it would deny constituents all nonessential services, such as housing subsidies, small-business loans and environmental reviews of construction projects. And worse, it would hit the brakes on the U.S. economy and rattle global markets. Leaders from both parties and the Obama administration need to work out a compromise now, and spare us having to watch this bad movie again. Follow the Opinion section on Twitter @latimesopinion and Facebook]", "Date": "20150918", "Title": "[GOP, spare us another foolish government shutdown]", "Link": "http://www.latimes.com/opinion/editorials/la-ed-shutdown-20150918-story.html", "Author": "[The Times Editorial Board]"}