{"Content": "[Texas Gov. Rick Perry vigorously denounced on Saturday an indictment charging him with abusing his power by targeting the states ethics watchdog and said his accusers wrongly sought to criminalize the proper dispatch of his duties. I wholeheartedly and unequivocally stand behind my veto, Perry said in a brief appearance before reporters in Austin, breaking his public silence and defending his action on the state budget that led to Fridays indictment. \"And Ill continue to defend this lawful action of my executive authority as governor.\", We dont settle political differences with indictments in this country, said Perry, wagging an accusatory finger. It is outrageous that some would use partisan political theatrics to rip away at the very fabric of our states constitution. This indictment amounts to nothing more than abuse of power, Perry went on forcefully, and I cannot and will not allow that to happen. Perry was indicted Friday by a grand jury in the state capital of Austin on two felony counts that stemmed from his veto of $7.5 million in funding for the states ethics watchdog. Perry, the longest-serving governor in Texas history, has announced he would not seek another term and will step down in early January after 14 years in office. He has spent the past several months visiting key political states and traveling abroad, seeking to rehabilitate himself after his unsuccessful 2012 presidential bid and position himself for another try in 2016. His indictment poses a new hurdle to that comeback effort, but also presents an opportunity to rally support from those who may see him as the victim of a politically motivated persecution. The tendency is just to look at the headline first: Governor Perry indicted,  said Stuart Rothenberg, an independent campaign analyst and publisher of the Rothenberg Political Report. The question is does Rick Perry use this in a way to energize Republican primary voters, activists and contributors who may be receptive to a message of, Boy, those Democrats are trying to destroy me because Ive been effective and Im a threat to them down the road. , The Office of Public Integrity, which investigates elected officials in Texas, is housed in the office of Travis County Dist. Atty. Rosemary Lehmberg, a Democrat who had clashed with Republicans over her aggressive oversight. After her conviction last year on drunken driving charges, Perry threatened the units funding unless Lehmberg stepped down. He said he could not support continued funding for an office with statewide jurisdiction at a time when the person charged with ultimate responsibility for that unit has lost the publics confidence.\", Lehmberg served about half of a 45-day jail sentence but refused to quit, and Perry followed through on his veto threat, prompting a government watchdog group to file a complaint saying Perrys actions amounted to improper intimidation. A special prosecutor was appointed and several top aides to Perry appeared before the Austin grand jury for questioning. The governor did not testify. Critics of Perry note that at the time funding for Lehmbergs office was cut, the public corruption unit was investigating one of the governors pet projects, the Cancer Prevention and Research Institute of Texas. Question have surfaced regarding funding of the institute and money given to some of the governors close allies; a former institute official has been indicted for his handling of an $11-million state grant. Perry was charged with one count of abuse of official capacity, which carries a penalty of five to 99 years in prison, and one count of coercion of a public servant, which carries a punishment of two to 10 years in prison. The prospect of jail time was less acute, however, than the political ramifications for Perrys 2016 hopes. Fellow Republicans were quick to rally to Perrys side. Texas Sen. Ted Cruz called the governor a friend... a man of integrity and used a Twitter hashtag to say he was proud to #StandWithRickPerry. Republican Gov. Bobby Jindal of Louisiana posted a series of tweets defending Perry and calling his indictment a blatant misuse of the judicial system by liberal activists who couldnt defeat him at the polls. A third potential GOP candidate, former Florida Gov. Jeb Bush, agreed. \"The indictment of @GovernorPerry seems politically motivated and ridiculous,\" he tweeted. \"Major overreach and an encroachment on his veto authority.\", Even some Democrats questioned the case against Perry, for whom they otherwise have little regard. David Axelrod, the longtime Democratic strategist and advisor to President Obama, said on Twitter, Unless he was demonstrably trying to scrap the ethics unit for other than his stated reason, Perry indictment seems pretty sketchy. Follow @markzbarabak, if youd like, for more news and political analysis.]", "Date": "20140816", "Title": "[Texas Gov. Rick Perry: Felony indictment is 'outrageous' and partisan]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-rick-perry-indictment-response-20140816-story.html", "Author": "NULL"}