{"Content": "[Wisconsin Gov. Scott Walker, who has enjoyed several months of good news in his prospective quest for the Republican presidential nomination, hit a bump Thursday with a new poll showing a sharp drop in his popularity at home. Walkers job approval has fallen to 41%, with 56% disapproving, according to the latest Marquette Law School poll, which has been Wisconsins leading survey. Thats the lowest approval figure for Walker in several years of Marquettes surveys. The one piece of good news for Walker, who has not officially declared his candidacy, is that he has a healthy early lead over other Republican hopefuls in the states presidential primary. Walker is the first choice of 40% of Republicans and Republican-leaning independents, the survey showed, followed by Sen. Rand Paul of Kentucky at 10% and former Florida Gov. Jeb Bush at 8%. Winning his home-state primary, however, has not been a major worry for Walker. A more critical part of his campaign is his claim to have won three elections -- including a bitter recall battle driven by public employee unions -- in a state that has gone to the Democrats repeatedly in presidential elections. The new poll dents that image of success in a blue state. Not only has Walkers popularity declined, but voters have soured on the states outlook. The share who say the state is on the \"wrong track\" increased to 53%, up from 44% in October. By 38% to 33%, a plurality of voters said the states budget picture had gotten worse than several years ago, with 25% saying it was about the same. In the fall, shortly before Walker won election to a second term, voters by 44% to 22% said the budget situation was getting better. A majority also think Wisconsin is lagging behind other states in creating jobs. Improving the states budget and its competitiveness on jobs have been two of Walkers main claims. \"A big part of Scott Walkers narrative is not just beating the unions but effectively managing the state. Wisconsin voters dont think thats happening anymore,\" said Paul Maslin, a Democratic pollster who has worked for campaigns opposing Walker. \"All the other governors -- [Texas Rick] Perry, [Louisianas Bobby] Jindal, [New Jerseys Chris] Christie, [Ohios John] Kasich, Bush -- are going to be lining up saying, How can he be the partys nominee when his own state is turning on him?\", Voters also turned thumbs down on legislation Walker recently signed that made Wisconsin a \"right to work\" state. By 50% to 44%, voters said they oppose the law, which prevents unions from requiring workersto pay dues or representation fees. The states unions strongly opposed the law. The survey also reinforced the status of Wisconsins conservative Sen. Ron Johnson as the most-endangered Republican up for reelection in 2016. Only 32% of voters have a favorable view of Johnson, with 29% unfavorable and 39% uncertain. His likely Democratic opponent, former Sen. Russ Feingold, gets a warmer 47%-to-26% favorability rating. In an early head-to-head test, Feingold led Johnson, 54% to 38%, the survey found. On the Democratic side, the poll showed Hillary Rodham Clinton with a huge lead over potential rivals for the presidential nomination, much as she has in other states. Clinton had support of 58% of Democrats and independents who lean Democratic, followed by Sen. Elizabeth Warren of Massachusetts at 14% and Vice President Joe Biden at 12%. Two Democrats who have indicated they might run against Clinton, former Maryland Gov. Martin OMalley and former Virginia Sen. Jim Webb, each had 1%. In a head-to-head contest, Clinton beat Walker, 52% to 40%. The poll was released the same day that two longtime aides to Walker announced the formation of a so-called super PAC to support his candidacy. Nearly all serious presidential hopefuls now have such PACs, which are allowed to collect unlimited contributions, giving big-money donors a way to completely bypass the limits that theoretically control contributions to candidates. Walker, like former Florida Gov. Jeb Bush, is in a particularly advantageous position because he is not a federal officeholder and, as a result, can directly solicit potential donors to a super PAC and coordinate his activities with the group until he officially declares himself a candidate. Potential candidates who are federal officials face restrictions on soliciting. The new super PAC will be called Unintimidated, the title of Walkers book about his fight to limit collective bargaining by the states public employee unions. The poll of 803 registered voters, interviewed by land line and cellphones April 7-10, has a margin of error of plus or minus 3.5 percentage points. For more on politics and policy, follow@DavidLauter on Twitter. 6:45 p.m.: The story was updated to add information about the creation of a \"super PAC\" to support Walkers candidacy. The story was originally published at 3 p.m. ]", "Date": "20150416", "Title": "[Wisconsin Gov. Scott Walker facing trouble at home, poll shows]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-walker-poll-20150416-story.html", "Author": "[David Lauter]"}