{"Content": "[Louis Caldera, who resigned as a top military aide in the Obama White House after a botched Air Force One photo-op that led New Yorkers to fear the city was under attack, is considering a run for Barbara Boxers seat in the U.S. Senate. Caldera, a Democrat who represented downtown Los Angeles in the state Assembly in the 1990s, said in an interview that the Air Force One incident had no bearing on Californias future and should not be a problem if he runs. Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... Sen. Barbara Boxers announcement that she will not seek reelection put an end to years of frustration on the part of a younger generation of California politicians who can now start elbowing their way upward in the states first wide-open U.S. Senate race since 1992. Californias strongly Democratic... You learn from all your experiences, he said. That was a regrettable experience. My team and I, we let the president down. Caldera was in charge of the White House Military Office in April 2009 when Air Force One and a supersonic F-16 fighter jet circled the Statue of Liberty and the Lower Manhattan skyline at low altitude, with no prior warning to the public. The purpose was to take publicity photos of Air Force One as part of a series of shots showing the plane in front of national landmarks. Fearing a replay of the Sept. 11 attacks, startled financial workers streamed out of their office towers. President Obama and Michael Bloomberg, then mayor of New York, were furious that the public was not warned in advance. Eleven days after the flyover, Caldera resigned after less than five months on the job. The controversy, he toldObama in a letter,made it impossible for him to effectively lead the White House office that oversees about 2,000 military personnel assigned to the president. The incident was one of the most widely publicized of Calderas career. Caldera, 58, is a Harvard-educated lawyer and West Point graduate who took a leading role in anti-gun efforts as an assemblyman from 1992 to 1997. He was Army secretary under President Clinton from 1998 to 2001. Caldera is also a former president of the University of New Mexico. He is on the board of directors at two companies, A.H. Belo Corp. and Career Education Corp. Caldera lives in Bethesda, Md. but said he plans to return soon to California and settle in Los Angeles or Whittier, his hometown. In the Senate, he said, his priorities would be childhood poverty, diminishing economic opportunities for young people and the involvement of the U.S. in protracted wars. Im a serious person who takes policy issues seriously, and if I get into this race, it would be because I thought there were issues that needed to be addressed, he said. Calderas potential candidacy, first reported by KCBS radio in San Francisco, could interfere with the plans of Antonio Villaraigosa, who isconsidering the Senate race. ------------, For the Record, Feb. 18, 9:17 p.m.: An earlier version of this article incorrectly stated that Louis Calderas potential candidacy was first reported in the Sacramento Bee. It was reported first by KCBS radio in San Francisco. ------------, Villaraigosa allies hope the former Los Angeles mayor will establish himself as the sole prominent Latino Democrat in the June 2016 primary. They have accused supporters of state Atty. Gen. Kamala D. Harris, the only major Democrat already in the race, of trying to anoint her as Boxers successor. I dont think there should be a rush to crown a Latino candidate any more than there should be a rush to crown a Democratic candidate, Caldera said. Caldera said hed spoken about his potential candidacy with Boxer, Villaraigosa and two other Latino Democrats are weighing whether to run: Reps. Xavier Becerra of Los Angeles and Loretta Sanchez of Garden Grove. I think its important that there be a Latino in this race, he said. And I think there is room for more than one Latino in this race. Twitter: @finneganLAT]", "Date": "20150218", "Title": "[Former Obama military aide Caldera weighs Senate run]", "Link": "http://www.latimes.com/local/political/la-me-pc-caldera-senate-20150218-story.html", "Author": "[Michael Finnegan]"}