{"Content": "[Six prisoners held for 12 years at Guantanamo Bay have been sent to Uruguay to be resettled as refugees, the U.S. government announced Sunday  a deal that had been delayed for months by security concerns in the Pentagon and political considerations in the South American country. The six men  four Syrians, a Tunisian and a Palestinian  are the first prisoners transferred to South America from the U.S. base in Cuba, part of a flurry of recent releases amid a renewed push by President Barack Obama to close the prison. All were detained as suspected militants with ties to Al Qaeda in 2002 but were never charged. They had been cleared for release since at least 2010 but they could not be sent home and languished as the U.S. struggled to find countries willing to take them. Uruguayan President Jose Mujica agreed to accept the men as a humanitarian gesture and said they would be given help getting established in a country with a small Muslim population. Among those transferred is 43-year-old Syrian Abu Wael Dhiab, who was on a long-term hunger strike at Guantanamo to protest his confinement. He was at the center of a legal battle in U.S. courts over the militarys force-feeding of prisoners who refuse to eat. We are very grateful to Uruguay for this important humanitarian action, and to President Mujica for his strong leadership in providing a home for individuals who cannot return to their own countries, U.S. State Department envoy Clifford Sloan said. The other Syrians sent to Uruguay on Saturday were identified by the Pentagon as Ali Husain Shaaban, 32; Ahmed Adnan Ajuri, 37; and Abdelahdi Faraj, 39. Also released were Palestinian prisoner Mohammed Abdullah Taha Mattan, 35, and 49-year-old Adel bin Muhammad El Ouerghi of Tunisia. The mens release brings the total number of prisoners at Guantanamo to 136  the lowest number since the first month the prison opened in January 2002. Mujica had agreed to take the men in January. Obama administration officials, frustrated that the transfer took so long, blamed outgoing Defense Secretary Chuck Hagel for not approving the move sooner. They said the deal sat for months on Hagels desk, awaiting his signature as required by law, but the Pentagon didnt send the notification of the transfer to Congress until July. By then, the transfer had become an issue in Uruguays political election and officials there decided to postpone it until after the vote. Tabare Vazquez, a member of Mujicas ruling coalition and a former president, won a runoff election on Nov. 30. Obama had pledged to close the prison upon taking office but was blocked by Congress, which banned sending prisoners to the U.S. for any reason, including trial, and placed restrictions on sending them abroad. The slow pace of releases has created a tense atmosphere inside the prison. A hunger strike that began in February 2013 totaled about 100 prisoners at its peak, including Dhiab and Faraj. The restrictions on sending them overseas have been eased and the U.S. has released 19 prisoners so far this year. Officials say several more are expected by the end of the year. Prisoners have been sent around the world but this weekends transfer was the largest group sent to the Western Hemisphere. Four Guantanamo prisoners were sent to Bermuda in 2009. Two were sent to El Salvador in 2012, but have since left. 3:42 a.m.: This story was updated with the prisoners names. 3:17 a.m.: This story was updated with background and details. This story was first posted at 2:29 a.m.]", "Date": "20141207", "Title": "[6 Guantanamo prisoners sent to Uruguay as refugees]", "Link": "http://www.latimes.com/nation/nationnow/la-na-nn-guantanamo-uruguay-20141207-story.html", "Author": "NULL"}