{"Content": "[Despite optimistic talk from Democrats and Republicans about overhauling the tax code, General Electric Co. recently showed that corporate executives arent holding their breath for a bipartisan deal any time soon. GE said last week that as part of a major restructuring, it would bring back $36 billion in overseas cash and pay $6 billion in taxes to do it  even though changes long under discussion in Washington could have significantly reduced that tax bill. \"Its a clear indication that corporate America isnt waiting for D.C. to make the tax code any simpler,\" said Chris Krueger, a policy analyst at financial services firm Guggenheim Partners in Washington. Theres broad agreement the U.S. corporate tax rate, which at 35% is the highest among industrialized nations, needs to be lowered to make American companies more competitive with foreign firms and that loopholes need to be eliminated to make the code simpler and more fair. Given that President Obama and congressional Republican leaders want to show that they could work together in the aftermath of last falls elections, both sides have made a tax overhaul a top priority. The desire to find a way to lower the corporate tax rate also was fueled by a rash of so-called inversion maneuvers last year by U.S. companies to re-incorporate abroad to lower their tax bills. But the devil is in the details, and major differences remain in how to reform the code, particularly whether individual tax rates should be revised along with those paid by corporations. There isnt much time left to gain momentum. With elections looming again in 2016, its unlikely Congress could pass something as controversial as tax reform next year. And obstacles are mounting to getting anything passed this year. The two tax-writing committees in Congress are focused now on so-called fast-track trade legislation, another contentious issue that would speed a deal on a 12-nation Pacific Rim free trade agreement. Meantime, Republican presidential candidates have begun rolling out their own tax plans, further complicating the process. \"We really desperately need pro-growth tax reform, but that said, there are real political obstacles,\" said Caroline Harris, chief tax counsel for the U.S. Chamber of Commerce. \"We are very hopeful for more progress ... but youve got to be realistic.\", For multinational companies, loopholes and the ability to stash profits overseas help lower their overall tax rate to well below the 35% level. A study by the Government Accountability Office found that the average effective tax rate for profitable U.S. corporations was 16.6% in 2010. This week, politicians and officials at the White House and on congressional committees working on a tax overhaul said passing a bill still is possible this year. \"We very much stand ready and have continued to have discussions with members of both parties in Congress,\" said Jason Furman, chairman of the White House Council of Economic Advisors. \"Its something the president would love to see done.\", The Senate Finance Committee has five bipartisan working groups tackling different aspects of tax reform, including soliciting input from businesses, advocacy groups and the public. The groups recommendations are due by the end of May. \"Hopefully well come up with some very, very good answers,\" said Senate Finance Chairman Orrin Hatch (R-Utah). But there are big hurdles. Obama wants to focus only on corporate taxes. He has proposed lowering the rate to 28% by closing loopholes and making other reforms. And he would try to lure companies to bring back some of the $2 trillion they are holding overseas by offering a one-time break on the tax rate on that money. Companies can defer paying U.S. taxes on foreign earnings by keeping them abroad. Obama would levy a lower tax rate  14%  on accumulated overseas cash and use the revenue raised to pay for new roads, bridges and other public infrastructure. Future foreign earnings would be taxed at 19%. Republicans want the U.S. corporate tax rate cut to 25% and firms to be free to bring back any foreign cash without paying U.S. taxes on it. The money already is taxed in the country where it is earned  usually at a much lower rate. Many nations reduced their rates to attract business. Republicans want to cut individual tax rates as well because many small entrepreneurs run their business revenue and expenses through their individual tax returns. \"Just because both sides use the term tax reform does not mean theyre talking about the same thing,\" Krueger said. \"Obama and the Republicans really are speaking different languages on it.\", He called tax reform \"the greatest legislative unicorn of them all\" and put the odds of its passage this year at less than 10%. The U.S. Chamber and the Business Roundtable, a trade group of chief executives of major U.S. companies, side with Republicans on the need to lower corporate and individual rates. Congressional GOP tax writers are pushing ahead with an overhaul that includes both, which may prove to be a major stumbling block to bipartisan agreement. \"We dont see eye-to-eye with the president. But Im hopeful we can find some common ground,\" said Rep. Paul Ryan (R-Wis.), chairman of the tax-writing House Ways and Means Committee. The disagreement over how to tax foreign earnings also is a major obstacle. Republicans want the U.S. to join most other nations in adopting an international system that would not tax money earned abroad. GE decided to bring back $36 billion in overseas cash as it sells the bulk of its GE Capital financing unit to focus on its industrial and manufacturing businesses. The company opted against waiting for tax reform. \"This deal has no impact on our desire for tax reform,\" said Seth Martin, a company spokesman. A competitive international system, he said, would \"encourage U.S. multinationals to pursue sales around the world and would make it easier for them to reinvest earnings at home, both of which we believe are good for the U.S. economy and U.S. employment.\", Like many U.S. multinational companies, GEs foreign operations have helped reduce its overall tax rate well below 35%. GEs effective tax rate was 10.3% last year and 4.2% in 2013. GE estimated its effective tax rate would rise to about 20% this year because of the additional tax bill. Harris said even if an overhaul isnt passed this year, starting a bill moving through Congress is a positive step in a process that has taken several years to finish in the past. \"There is the need for it to be done,\" she said. \"I dont think anybody thinks our tax code is working well for anybody.\", jim.puzzanghera@latimes.com]", "Date": "20150417", "Title": "[Big differences divide Democrats, GOP on overhauling U.S. tax code]", "Link": "http://www.latimes.com/business/la-fi-tax-reform-20150418-story.html", "Author": "[Jim Puzzanghera]"}