{"Content": "[After waiting in a line that snaked on through the rain, enduring a security check, then waiting more while jammed into an orchard outbuilding packed with people, Deborah Bellefeuille said she was happy to see Hillary Clinton  but would also be happy to see her leave. The idea of Clintons coming back again and again to have repeated personal contact with voters did not thrill her. Bellefeuille gazed at the collection of wary Secret Service agents, gruff security guards, ill-mannered reporters and over-caffeinatedcampaign aides milling about the scene. She doesnt need to be here on a weekly basis, she said. She would bring all this b.s. with her. We dont need you people here every day, she added. Campaigns for the 2016 presidential election are underway and more than a dozen Republicans and Democrats are vying for the nomination of their respective parties. They include senators, former governors and even a reality TV star. And even more candidates expected to enter the wide-open race this summer. Staff writer Kurtis Lee explains.   , Campaigns for the 2016 presidential election are underway and more than a dozen Republicans and Democrats are vying for the nomination of their respective parties. They include senators, former governors and even a reality TV star. And even more candidates expected to enter the wide-open race this summer. Staff writer Kurtis Lee explains.   , Clintons celebrity gives her instant access to the media, unparalleledability to raise money and near-universal name recognition. But as the scene here showed, it also undermines her ability to forge one-on-one connections with voters, perhaps to her detriment in early primary states, where voters have come to expect close and repeated contact. Not that Clintons campaign isnt trying. There is no Hill-A-Copter thundering above farms and villages as there was in Iowa in 2008. Events are arranged to look more like community meetings than Bon Jovi concerts. The campaign mantra is humility. But no matter what else she does, she cannot escape being Hillary Clinton, with all the spectacle that implies. Even Jeb Bush, hardly an unknown, can slip into New Hampshire without anything close to the fuss that surrounds Clinton. The day after her event here, Bush, the former governor of Florida, held a town hall in Derry, at which one New Hampshire voter reminded the candidate that they had met three times. Im almost starting to have an opinion about you, the voter joked. The event bore little resemblance to Clintons New Hampshire appearances. It was advertised ahead of time on the marquee of the historic opera house in which it was held, tickets were easy to come by, there were no long lines, no Secret Service guards directed attendees to empty their pockets. Bush himself, dressed in practical trousers and a rumpled shirt, was hard to distinguish from the voters. Nor did the Bush organizers take the kind of precautions the Clinton campaign often does to avoid uncomfortable moments. The first question came from a veteran demanding to know if this Republican wanting to be commander in chief had ever served his country in the armed forces. Bush said he hadnt. A forum Clinton had held the day before with voters in the town of Rochester, N.H. had been more notable for who was not allowed in. Media access was restricted to a small pool of journalists who would share their notes with other organizations. But the campaign had turned away that days designated pool reporter, a writer from the Daily Mail, a London tabloid. The fuss over the pool detracted from Clintons message of the day  on childcare  and gave the New Hampshire GOP an opening to pounce, accusing Clinton of a secretive campaign based on a clear sense of entitlement and arrogance. The jabs arent just coming from opponents. A Nashua Telegraph editorial last month declared one Clinton event to be the antithesis of what New Hampshire is about. All that may be taking a toll, helping to create an opening, at least in this state, for Sen. Bernie Sanders, the independent socialist from neighboring Vermont, to approach within striking distance. The entourage, the Secret Service, and all that runs contrary to what New Hampshire voters expect, said David Paleologos, director of the Suffolk University Political Research Center in Boston. His latest survey of New Hampshire voters suggested that a 30- to 40-point lead Clinton had held over Sanders a couple of months ago had now shrunk to around 10 points. Another recent poll found much the same. There are many reasons for the narrowing. Sanders had not yet announced his run when the earlier polls were in the field, and much of his gain could be simply his consolidating the anti-Clinton vote at the expense of other rivals. But Paleologos believes the entourage factor undoubtedly has dampened Clintons popularity. People are saying they feel disconnected with her, she doesnt engage, she is running a poor campaign, he said. New Hampshire voters need to be courted often. At the Concord event, which was less restricted than the forum in Rochester, Doug Whitbeck, a resident of Mason, a town along the border with Massachusetts, expressed hope the day would provide a two-way interaction. We see Bernie all the time, Masons wife, Gwen, remarked. There was some. Clinton took no questions from the dais, but those who persevered were able to get a quick handshake as two Secret Service agents hovered. Some people had been at the event for three hours by then. Students of the New Hampshire primary say they have seen this before. In 2000, every step Vice President Al Gore took in New Hampshire seemed a major production, involving tedious advance planning and heavy handed security. His rival, former U.S. Sen. Bill Bradley of New Jersey, exploited that. Bradley could just show up in a minivan with a couple of staffers and start going through a crowd, said Christopher Galdieri, a professor of political science at St. Anselm College in Manchester. Galdieri suspects that after the latest polls, Clinton operatives are trying to pivot. There are probably people in Clintonland talking right now about how they can make it seem like less of a chore to go see her. Campaign officials say their plan all along was to get the candidate in front of more voters. Its still early in campaign season, they stress, adding that they always anticipated the race would tighten. At the moment, much of their focus has been on getting Clinton into house parties and other small groups where she can meet the activists who are key to spreading her message and building the get-out-the-vote machine the campaign will need. She is going to be doing forums and town halls, said Jennifer Palmieri, the campaign communications director. She is going to be doing all of that. The impression of Clinton as trapped in her entourage is largely a creation of the media scrum that surrounds her, Palmieri added. She does walk down the street, Palmieri said. Sometimes it is fine. Sometimes you guys are there. For more on politics and the Clinton campaign, follow @EvanHalper]", "Date": "20150619", "Title": "[For Clinton, there's no escaping the spectacle of celebrity]", "Link": "http://www.latimes.com/nation/la-na-clinton-spectacle-20150618-story.html", "Author": "[Evan Halper]"}