{"Content": "[Hillary Rodham Clinton was mobbed by fans when she spoke this week before a big crowd of Latino government officials from across the country. When another Democratic presidential hopeful, Sen. Bernie Sanders of Vermont, took the same stage here Friday, the room was about half-empty. \"I havent heard of him, to be honest,\" said Luciana Corrales, a school board member from San Ysidro, Calif. And anyway, she added, \"Im a Hillary supporter.\", Talk of a Sanders surge has enlivened the campaign in recent weeks, as bigger-than-expected crowds turned out for his fiery speeches about taking on the \"billionaire class\" amid promising polling in the early-primary state of New Hampshire. But the enthusiasm gap on display at the nations largest gathering of Latino policymakers highlights the reality of the major demographic challenges Sanders faces as he wages his long-shot bid for the presidency. \"His name recognition in the Latino community is somewhere in between zero and extremely low,\" said Matt Barreto, a pollster who focuses on Latino voters. \"And youre not going to win an election without Latino support.\", Nonwhite voters make up a third or more of the turnout in Democratic primaries in most states, according to exit polls. Sanders, who represents a state that is 94% white, has little experience campaigning for minority votes. That will pose a challenge as he travels to more-diverse early-voting states like Nevada, home to a large Latino population, and South Carolina, where African Americans make up roughly half of Democratic primary voters. \"If your only significant constituency is older white voters, thatll be good in Iowa and New Hampshire, but when you hit Nevada and South Carolina youre in another world,\" said Democratic strategist Bill Carrick. \"If youre going to be the nominee, youre going to have to do pretty well among Latino, African American voters, women, single women and millennials. Thats the challenge for Bernie Sanders  to become more than a niche candidate and become a candidate with a broad coalition of support.\", Sanders campaign advisors say his platform, which includes free college tuition and Medicare for all, has appeal across racial and ethnic lines. His speech Friday at the annual conference of the National Assn. of Latino Elected and Appointed Officials  his first to a Latino audience  was well-received. His pledges to raise the national minimum wage and reduce spending on jails and prisons drew standing ovations. After drawing heat from some Latino pundits in recent weeks for not talking enough about immigration, Sanders addressed the issue head-on Friday, matching Clintons pledge to go further than President Obama in shielding from deportation immigrants who are in the country illegally. A self-described socialist who has made growing class inequality the theme of his campaign, Sanders described immigration as an economic issue. \"We cannot continue to run an economy where millions are made so vulnerable because of their undocumented status,\" Sanders said, asking: \"Who benefits from this exploitation?\", In a departure for Sanders, who typically forgoes personal anecdotes for numbers-driven analysis, he paused for a moment to talk about his own experience as the son of an immigrant. \"My dad came to this country from Poland at the age of 17 without a nickel in his pocket,\" said Sanders. Immigration \"is the story of America, and we should be proud of that story,\" he said. His message appeared to resonate with listeners, including Andrew Rodriguez, a city councilman from Eloy, Ariz. who said he liked that Sanders \"spoke his mind.\", Still, Sanders has considerable ground to make up if he wants to be known to Latinos. In a recent CNN poll, just 5% of nonwhite Democratic voters said they were likely to support Sanders compared with 65% who backed Clinton. Clinton, who beat Obama 2 to 1 among Latino voters in the 2008 Democratic primary, has made an early and spirited pitch for Latino support this campaign cycle, laying out her immigration plan last month during a round-table discussion with young immigrant activists at a Las Vegas high school. Clinton, a former senator from New York and secretary of State, has named Latinos to top positions in her campaign. Last month she hired Lorella Praeli, a well-known \"Dreamer\" who was brought to the country illegally as a child. The campaigns political director, Amanda Renteria, arrived at the conference a day ahead of Clinton to talk up her candidate with officials gathered for several days of workshops and other events. Former Maryland Gov. Martin OMalley, another candidate seeking the Democratic presidential nomination, has also emphasized Latino outreach. His second interview after he announced his candidacy last month was with the Spanish-language news channel Univision, and he has promised to act on immigration reform within the first 100 days of his presidency. Tad Devine, Sanders campaign strategist, said the candidate would be talking more to Latinos in the coming months, highlighting his record in Congress on immigration issues. The campaign is also hiring people to focus on Latino outreach and communications. Garrison Nelson, a professor of political science at the University of Vermont, said it is not Sanders natural instinct to tailor his message to different audiences. \"Bernies not an identity politics candidate,\" said Nelson, who has been following Sanders political career for decades. \"Bernies is an economic message,\" Nelson said. \"He believes the underclass is not defined by their demography; theyre defined by their income. He finds this kind of demographic politics somewhat  well, he doesnt like it.\", Sanders had a different message at an earlier campaign stop Friday morning. At a boisterous rally at Treasure Island Casino, he brought an overwhelmingly white crowd of several hundred to their feet several times with calls for a \"political revolution\" that includes limiting the money that private companies can spend in elections. He didnt mention his support for a pathway to citizenship for immigrants in the country illegally until 45 minutes into his speech  and even then he only spoke a few lines. That didnt matter to 20-year-old Christian Herrera, who sat excitedly with his parents in the second row. The family had driven five hours that morning from Mexicali, Calif. to see Sanders speak. Herrera, who said he was drawn to Sanders support for free college tuition, said Latinos care about much more than just immigration. Latino issues are American issues, he said. \"Hes for the people,\" Herrera said of Sanders. \"Hes for the middle class.\", kate.linthicum@latimes.com]", "Date": "20150621", "Title": "[Bernie Sanders strives to sell his message to Latino voters in Nevada]", "Link": "http://www.latimes.com/nation/immigration/la-na-democrats-latinos-20150620-story.html", "Author": "[Kate Linthicum]"}