{"Content": "[Opponents of a ban on single-use plastic bags in grocery stores have qualified a referendum on the law, delaying its July 1 effective date until voters act on the measure in November 2016, the California secretary of states office said Tuesday. The trade group American Progressive Bag Alliance submitted more than 800,000 signatures on petitions for the referendum, and a random sample count by elections officials projected that they include at least 110% of the 504,760 signatures needed to put the measure on the ballot. California voters will now have the chance to vote down a terrible law that, if implemented, would kill 2,000 local manufacturing jobs and funnel obscene profits to big grocers without any money going to a public purpose or environmental initiative, said Lee Califf, executive director of the alliance. Get essential California coverage, Supporters of the bag ban said they are confident California voters will uphold the ban because the plastic bags are a costly burden to the environment, littering rivers, beaches and parks and posing threats to wildlife. Its not surprising that after spending more than $3.2 million, 98 percent of which is from out of state, the plastic bag industry has bought its way onto the California ballot to protect its profits, Mark Murray, a spokesman for the campaign group Californians vs. Big Plastic, said in a statement. The first state ban on plastic bags was approved by the Legislature and signed by Gov. Jerry Brown last year to take effect July 1 for large grocery stores and July 1, 2016 for most other retailers. Murray noted that 138 cities and counties have already enacted their own bans on plastic grocery bags and that those will stay in effect. Bag ordinances have been adopted for the Los Angeles County unincorporated areas and more than a dozen cities in the county including Beverly Hills, Glendale, Long Beach, Los Angeles, Malibu, Manhattan Beach, Pasadena, Santa Monica and West Hollywood. The new state law was stayed as soon as the referendum petitions were filed and the qualifying of the referendum continues that stay until voters act, officials said. Supporters of the bag ban expect to spend about $10 million on a campaign to get voters to uphold the ban by voting yes on the referendum. Murray cited a recent USC Dornsife/Los Angeles Times poll that indicated support for the law by 60% of Californians. Every poll shows that Californians strongly support the law, and the $30 million to $50 million it will cost the plastics industry to launch a full-fledged campaign in 2016 will be proven to be an act of political malpractice, particularly since nearly half the state will no longer have plastic bags by election day, Murray said. He estimated that the bag manufacturers will make $145 million in continued sales while the ban is on hold between July 1 and November 2016. His coalition includes Sierra Club California, the Surfrider Foundation, Californians Against Waste and the California Grocers Assn. SB 270 by former Sen. Alex Padilla (D-Pacoima) would allow grocers to charge 10 cents for reusable plastic or paper bags to shoppers who do not bring their own to the store. The alliance of bag makers argued that the real purpose of the law was to enrich supermarket chains and other retailers through collection of the 10-cent fee. The opponents said it was untrue that the plastic bags provided by supermarkets are single-use because many consumers use them again to line trash cans, pick up waste left by their pets or carry lunches to work. SB 270 was never a bill about the environment,\" Califf said. \"It was a backroom deal between the California Grocers Association and their union friends to scam consumers out of billions of dollars in bag fees  all under the guise of environmentalism.\"]", "Date": "20150224", "Title": "[California's plastic-bag ban put on hold by ballot referendum]", "Link": "http://www.latimes.com/local/political/la-me-pc-california-plastic-bag-ban-20150223-story.html", "Author": "[Patrick McGreevy]"}