{"Content": "[Thousands marched in peaceful May Day rallies in downtown Los Angeles, repeating their annual call for immigration reform but acknowledging that prospects for action in Washington remain grim. The crowd was a mere shadow of the hundreds of thousands who emerged nine years ago to march joyously down the streets of Los Angeles, demanding a path to citizenship for those who entered the country illegally or overstayed their visas. May Day 2015, May Day 2015, And there was no aggressive response from police, who eight years ago wielded batons and fired less than lethal rounds at demonstrators and reporters. Instead, Fridays event took on the air of a carnival on a hot afternoon, in one part led by Jornaleros del Norte  Laborers of the North  on a flatbed truck playing ranchera music and dozens of people holding up a U.S. flag the size of an intersection. They were trailed by people selling bacon-wrapped hot dogs and carts selling strawberry, coconut and lime treats. As speakers lamented a judges blockingof President Obamas effort to shield millions from deportation, they cheered former Florida Gov. Jeb Bushs supportfor a pathway to legality for immigrants who are in the U.S. illegally. And they pledged to make their voices heard on election day in 2016 against a Republican-controlled Congress that has stymied immigration reform. We will be there at the ballot box next year to make sure they pay a price, said Juan Jose Gutierrez, who helped organize the original 2006 May Day immigration march. Many families were among the marchers. Fatima Rios, 23, came with her mother, sister and two young daughters. She said Obamas effortto defer deportation for parents of Americans and lawful permanent residents would help protect her mother, who entered the country without permission. Rios said her mother wants the opportunity to earn a living here legally. And, Rios said, I want my daughters to have their grandmother here. Families expressed deep concern about the threat of deportation. Flor Muoz, 18, who received temporary deportation relief as part of a programto defer legal action against immigrants brought to the U.S. illegally as children, said she is the only one in her family who is not at risk of being sent out of the country. I want to be able to see my dad not be scared anymore. He doesnt want to travel around because hes scared to get deported, said Muoz, of Compton. Consuelo Soto, 38, feared for herself and her husband, who are here illegally and have a 5-year-old son who was born in the U.S. while their other child, 16, was recently given protection from deportation. We dont know what will happen to our family, she said in Spanish. It is hard: emotionally, economically. We are here to work and be a part of this country. As the crowd thinned out, Silvia Sandoval, 56, said she was disheartened by the turnout. If people protest, and they dont see the results they want, they get discouraged, she said in Spanish. But we have to keep the fight up. Twitter: @jpanzar,@brittny_mejia, Times staff writers Rong-Gong Lin IIand Veronica Rochacontributed to this report. 6:49 p.m.:Updated with the march appearing to wind down. 4:45 p.m.:This story has been updated with information on traffic issues. 2:58 p.m.: This story has been updated with interviewswith May Day participants. 12:24 p.m.: This story was updated with news that the Los Angeles Police Department was on a citywide tactical alert for the demonstrations. This story was originally published at 10:40 a.m.]", "Date": "20150501", "Title": "[L.A. marchers in peaceful May Day rally fear deportation]", "Link": "http://www.latimes.com/local/lanow/la-me-ln-may-day-20150501-story.html", "Author": "[Javier Panzar , Brittny Mejia]"}