{"Content": "[The year 2014 turned to 2015 with a fierce flip of the page, at least when it comes to national politics. The last year was dominated by a midterm election that proved to be an extravaganza for Republicans, who won control of the Senate and expanded their lock on the House. This year opens the next presidential contest, and Republicans are likely to have a much harder path to success. That is because we have become a nation divided, and a vastly different group of people shows up for off-year elections than those who vote in presidential elections. The electorate that voted in November  in big races held in predominantly red states, giving Republicans another advantage  was older, more white and more conservative than the electorate that will begin sizing up presidential candidates this year for the 2016 election. That one will be younger and more diverse, if history is any guide. Attitudinally, midterm elections are opportunities to slap down leaders who voters believe have done too much, or not done enough. Presidential elections, particularly incumbent-free ones like 2016 is going to be, are less a referendum than a choice between two new options. Still, there is a link between the two campaigns, and it centers on two perennial political issues that were in play in 2014 and will be again in 2015. One is the argument over the size of government and the tactics used to shrink it. The other is voters gut-level sense of economic well-being. In 2014, Iowa was a perfect test tube for both  just as the state will be, in 2015, the testing ground for the presidential candidates. The states marquee race in 2014 was for an open Senate seat, long held by retiring Democrat Tom Harkin. The Republican nominee was Joni Ernst, a state senator who gave herself national pizazz with her first big ad, which emphasized her heartland roots with a piquant suggestion of what shed do in Washington. \"I grew up castrating hogs on an Iowa farm, so when I get to Washington Ill know how to cut pork,\" she said in the ad. Its kicker: \"Lets make em squeal.\", Ernsts comment  delivered with a near-perfect mix of sauciness and humor  went directly to the GOPs argument for smaller government, a theme that ran through most of the races in November. For that Republican-leaning electorate, the argument encapsulated myriad complaints that President Obama has exceeded his powers and usurped Congress. Ernsts victory over a lackluster Democrat, Bruce Braley, rested on voters desire to elect someone willing to take a knife to Washington. But it also rested on the second perennial issue: their gut sense of the economy. By any numerical standard  the stock market, the unemployment rate, job offerings  the economy has improved since Obama took office in the depths of the worst economic collapse since the Great Depression. But numbers never trump fear. And in Iowa, as in so many other places, the economic recovery has been so patchy that great swaths may see improving numbers  but what they feel is persistent concern. A Los Angeles Times reporter traveling in Iowa just before Ernsts runaway win found voter after voter uneasy about the economy. \"They say its good  that it has turned around,\" said Jay Johnson, whose familys economic security rested, with some irony, on his wifes job as a foreclosure counselor. \"I guess most people just dont feel it.\", Those two elements will surface over and over again in 2015, as politicians on Capitol Hill, in statehouses and on the presidential campaign trail tussle over the role of government and the feel of the economy. In Washington, the GOP will face tension between leaders determined to show that Republicans can govern, and party members who favor more aggressive tactics, like government shutdowns. The presidential race only exaggerates the potential for conflict, since one major shutdown protagonist is Texas Sen. Ted Cruz, who appears to be planning a run for the White House. Even as the economy continues to improve, the feuding parties will work to influence voters perceptions about it. Their focus  and that of each partys presidential candidates  will be middle-class voters. The White House reflected that strategy  and linked the two big issues  in the recent release of the November unemployment report, which showed the creation of a whopping 321,000 jobs, the biggest monthly tally in almost three years. \"The economy has now already added more jobs in 2014 than in any full calendar year since the late 1990s,\" said Jason Furman, chairman of the presidents Council of Economic Advisors, in December. \"To create an environment in which this progress can continue, it is critical that Congress take the basic steps needed to fund the government and avoid creating disruptive and counterproductive fiscal uncertainty.\", And, not by accident, he pitched the Democratic agenda for 2015: \"We have an opportunity to work together to support the continued growth of higher-paying jobs by investing in infrastructure, reforming the business tax code, expanding markets for Americas goods and services, making common-sense reforms to the immigration system, and increasing the minimum wage.\", Republicans brushed aside the jobs numbers as meaningless. \"Creating 300,000 jobs in one month shouldnt be a new high; it should be the minimum we expect,\" said Republican National Committee chief Reince Priebus. Priebus, too, touted a 2015 agenda with a nod to the partys Senate takeover: \"Next year we can begin passing the pro-growth, pro-jobs legislation that has gone nowhere in the Democrat Senate.... Soon it will be up to President Obama to decide if he wants to stand with American workers, or continue siding with liberal special interests.\", cathleen.decker@latimes.com, Twitter: @cathleendecker]", "Date": "20150103", "Title": "[U.S. politics shift out of midterm mode in 2015, but 2014 issues remain]", "Link": "http://www.latimes.com/nation/politics/la-na-year-ahead-politics-20150104-story.html", "Author": "[Cathleen Decker]"}