{"Content": "[Rep. Kevin McCarthy of Bakersfield faced an immediate test as his ascension to House majority leader became official Thursday, as he and other Republican leaders struggled to build support for their bill to provide emergency funds for the immigration crisis on the southern border. The ominous start to McCarthys tenure as the No. 2 House Republican was not lost on many in the Capitol. The plan had been for Rep. Cathy McMorris Rodgers of Washington, the Republican Conference chairwoman, to notify the House clerk of the leadership change after the final scheduled vote Thursday, when most lawmakers would have been present in the House chamber. Instead, the chamber was nearly empty when the announcement was made formalizing the transition from outgoing leader Eric Cantor of Virginia, just moments before the House adjourned for the night. Cantor, whose defeat in a primary election last month stunned Washington and was blamed in part on his views on immigration reform, bid an emotional farewell to his colleagues earlier Thursday afternoon on the House floor. During the speech, he noted how members \"dont always see eye to eye, even within our own parties.\", Hours later, leaders scrambled to rearrange the schedule when it became clear that their border bill lacked the votes needed to ensure its passage. Members were first told that a vote on highway funding would be the last for the month, but soon after that a vote on the border package could still come. Republicans later held an emergency conference meeting to try and chart a path forward, deciding in the end to reconvene Friday. McCarthy had all but settled into his new role before Thursday. Though he will not be moving from his first-floor Capitol suite to the one Cantor had used just off the House chamber, McCarthy has hired new staff to build up his policy team, including some whod worked for his predecessor. During the day, he even updated his Twitter handle from @GOPWhip to @GOPLeader. Thursdays developments aside, few blamed the new leadership team of McCarthy and Rep. Steve Scalise of Louisiana, McCarthys successor as whip, for the breakdown. \"We run into the same road blocks every time,\" said Rep. Devin Nunes of California, blaming a small group that often votes against the leadership. \"Theres just a lot of people who are more concerned about the [outside] groups or their Senate colleagues than they are about actually leading and getting something done.\", Added Rep. John Fleming of Louisiana: I dont think this is any discredit to them, this was their first task  it just happens to be they were handed a Mt. Everest. In Thursdays closed-door meeting, many expressed their desire to stay in session until a resolution on the border issue could be found. One member told his colleagues he would be willing to stay in Washington through next week even if it meant missing his sons wedding. \"The way that theyre leading right now is the way leaders should lead,\" said Rep. Matt Salmon (R-Ariz.), who noted he has been a frequent critic of top Republicans. \"I am pleased to be part of a team thats actually going to stay until we fix [the problem].\", Follow @mikememoli for more news out of Washington.]", "Date": "20140801", "Title": "[Kevin McCarthy tested as he begins tenure as House majority leader]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-mccarthy-majority-leader-20140801-story.html", "Author": "[Michael A. Memoli]"}