{"Content": "[With the additions of Carly Fiorina and Ben Carson on Monday to the growing list of Republican presidential hopefuls, the GOP diversified its slate of candidates as it tries to promote an image of inclusion to appeal to a broader group of voters. Fiorina, a former chief executive of Hewlett-Packard, became the lone woman to enter the GOP primaries, announcing her candidacy in a video on her website. Carson, a pioneering African American neurosurgeon, returned to his native Detroit for an hourlong ceremony  which at times felt like a church service  touting his lack of political experience as a benefit to his candidacy. But neither Fiorina nor Carson, who have only outside chances of winning the nomination, possess the sort of widespread support among party officials and large fundraising bases enjoyed by top-tier hopefuls. They do, however, give Republicans a nod toward inclusiveness as the party tries to broaden its base from a core that is older, whiter and more male than the American population to one that is more reflective of the country. An issue Republicans face headed into 2016  which has dogged the party in past elections  is a perception that the party is not in tune with challenges faced by those who are not white and affluent. But the long-shot nature of Fiorinas and Carsons candidacies shows the party has further to go toward changing that view. Carson has done well in some early polls, but those numbers more likely reflect the admiration he receives among many conservatives than any serious chance of winning the nomination. And Fiorina has been dogged by criticism over the 30,000 layoffs she made while at Hewlett-Packard, an attack that may follow her into the primary. Anyone can throw their hat into the ring; it doesnt mean theyre going to get votes, said Michael Steele, a former chairman of the Republican National Committee, the first African American to hold that position. But to see the range of candidates currently in the Republican field makes it clear that our party is not monolithically white and male. Indeed, among the Republicans who poll better than Carson or Fiorina are Sens. Ted Cruz of Texas and Marco Rubio of Florida, both of Cuban descent. And Louisiana Gov. Bobby Jindal, who is exploring a presidential run, is Indian American. For her part, Fiorina focused not on other Republicans but on Hillary Rodham Clinton, the clear Democratic front-runner. She is of the professional political class. She creates a disconnect, Fiorina said in a call with reporters Monday. People of all political persuasions believe there is a huge gulf between their lives and those in Washington. Like much of the Republican field, Fiorina has also assailed Clinton on foreign policy, criticizing her actions related to the 2012 attack on an American diplomatic compound in Benghazi, Libya, and U.S. relations with Russia. Beth Miller, who was a senior advisor to Fiorinas failed 2010 campaign against Sen. Barbara Boxer of California, said that as a woman, Fiorina has a unique ability to take on Clinton without being perceived as condescending or overly aggressive. Carly is a great candidate and will be able to offer distinctions between herself and other candidates, but especially Hillary, Miller said. Fiorina also spoke of her own vision for job growth and creating and sustaining small business, new business and family-owned business. While Fiorina has run for public office, Carson largely remained out of politics until 2013. At a national prayer breakfast that year, Carson, who is retired from his position as director of pediatric neurosurgery at Johns Hopkins Hospital, gained plaudits from conservatives for castigating Obamas healthcare law while the president sat nearby. Some of his comments since then, however, such as calling Obamacare the worst thing that has happened in this nation since slavery, have drawn criticism from more moderate Republicans and Democrats. Im not politically correct, and Im probably never going to be politically correct, because Im not a politician, Carson said in Detroit on Monday, after a gospel choir sang several songs, including Eminems Lose Yourself, in the lead up to his speech. I want to do whats right. Carson described himself as supporting family values and having a deep belief in God, while he defended himself against critics who say he would cut into social welfare programs for the poorest Americans. Steele, who has known Carson from Maryland GOP political circles, said some voters would probably be drawn to the doctors personal story. Carson was raised by a single mother with a third-grade education who worked odd jobs to help provide for her children. In the world of national politics, he is certainly untested, Steele said. But his story and principles as a conservative are some that people will definitely gravitate toward. kurtis.lee@latimes.com, Twitter: @kurtisalee, 7:34 p.m.: The story was updated throughout with new details. 9:42 a.m.: The story was updated with comments from Carson. 8:06 a.m.: The story was updated with comments from Fiorina. 4:20 a.m.: The story was updated with Fiorinas release of her announcement video. The story was originally published at 4 a.m.]", "Date": "20150504", "Title": "[Carly Fiorina, Ben Carson add breadth to Republican presidential field]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-fiorina-carson-presidential-campaign-20150501-story.html", "Author": "[Kurtis Lee]"}