{"Content": "[House Speaker John A. Boehner (R-Ohio) on Wednesday threatened to file a lawsuit against President Obama later this year for \"not faithfully executing\" the nations laws, a new escalation in a Republican campaign against what it views as presidential overreach. Democrats dismissed the move as an election-year stunt intended to motivate GOP conservatives. Speaking to reporters, Boehner said he was acting \"on behalf of the institution\" to prevent a further erosion of power in the legislative branch. He said his action was not a precursor to impeachment. \"The Constitution makes it clear that the presidents job is to faithfully execute the laws. And in my view the president has not faithfully executed the laws,\" Boehner said. \"Fighting for this is in the best interests of the Congress.\", House Minority Leader Nancy Pelosi (D-San Francisco) called Boehners new action \"subterfuge\" meant to appeal to the most rabid elements of the partys conservative base. \"Theyre doing nothing here and so they have to give some aura of activity,\" Pelosi said. \"There really needs to be an adult in that room of the Republican caucus.\", Initiating a lawsuit of the type Boehner intends to file requires a vote of the Houses Bipartisan Legal Advisory Group, of which Republicans have a majority. The same group voted along party lines to act as the defense in the Supreme Courts consideration of the Defense of Marriage Act, after the Obama administration said it would no longer defend the law. In a memo sent to House colleagues Wednesday afternoon, Boehner said the full House would vote on authorizing the suit. The GOP-led House has already taken similar symbolic steps. In March, the chamber passed a bill that would require the Justice Department to notify Congress of any instance in which a federal official decides not to enforce a specific law or policy, and another that would give either the House or Senate standing in court to challenge an executive decision to not enforce a certain law. Boehner has long maintained that Obamas unilateral executive actions, including deferring deportation of young immigrants brought to the U.S. illegally as children, have made it harder to build support among Republicans for more significant legislative efforts. Follow @mikememoli for more news out of Washington.]", "Date": "20140625", "Title": "[Speaker Boehner says he will file suit over Obama's job performance]", "Link": "http://www.latimes.com/nation/la-na-boehner-suit-20140625-story.html", "Author": "[Michael A. Memoli]"}