{"Content": "[Theres no argument: Californias death penalty is shamefully inoperative. Its shameful that state politicians wont fix it. Wont even try. Taxpayers are dumping big money into a death row where, for years, no one has been executed. Rather, hundreds of murderers have been living out their lives in relative comfort compared with inmates who committed lesser crimes. Capital punishment in California is an illusion and should be either formally repealed or reformed so death sentences actually can be carried out. But Gov. Jerry Brown and the Democratic-dominated Legislature wont do either. And Republicans dont have the power. California voters had the opportunity to end the wasteful charade two years ago. They could have passed Proposition 34, which would have abolished the death penalty and substituted life in prison without the possibility of parole. But they didnt, rejecting the initiative by a narrow four percentage points. Brown, a lifelong opponent of capital punishment, didnt lift a finger or utter a peep until election day. \"Of course\" he voted for the initiative, he told reporters after leaving a voting booth. But if during the campaign the governor had showed any leadership  even interest  the measure might have passed. He didnt want to do anything that could hurt his efforts to sell voters on a tax increase. An Orange County federal judge performed a great public service recently by ruling that the interminable delays and uncertainties of Californias death penalty render it unconstitutional because of the 8th Amendment ban on cruel and unusual punishment. \"For all practical purposes,\" U.S. District Judge Cormac J. Carney wrote, \"a sentence of death in California is a sentence of life imprisonment with the remote possibility of death  a sentence no rational legislature or jury could ever impose.\", Right. But the California Legislature is not rational on this issue and, by its inaction, has imposed the irrational sentence. Carney, an appointee of President George W. Bush, continued:, \"In California, the execution of a death sentence is so infrequent, and the delays preceding it so extraordinary, that the death penalty is deprived of any deterrent or retributive effect it might once have had. Such an outcome is antithetical to any civilized notion of just punishment.... \"Under such a system, the death penalty is about as effective a deterrent to capital crime as the possibility of a lightning strike is to going outside in the rain.\", The judges decision overturned the death sentence of only one man: Ernest Dewayne Jones of Los Angeles, who raped and murdered his girlfriends mother in 1992. But it will have broad significance if upheld on appeal. These are the eye-opening numbers: More than 900 people have been sentenced to death since California reinstated capital punishment in 1978, but only 13 have been executed, none since 2006. The appeal process pokes along for 25 years, twice the national average. San Quentins death row keeps growing. At last count, there were 748 condemned killers, living in single-bunk cells with TVs and extensive yard privileges. They dont work. By far, their dominant cause of death is old age. Presently, 142 are over age 60; two in their 80s. Carney noted that the state would need to execute more than one a week for 14 years just to clear out the currently condemned. But, of course, California has no legal way of executing them. The states three-drug lethal cocktail was banned by courts in 2006. Brown has ordered prison officials to develop a one-drug injection. But given his anti-death penalty history, dont count on that ever emerging. Another federal jurist, 9th Circuit Chief Judge Alex Kozinski, recently called for employing firing squads. \"I personally think we should go to the guillotine, but shooting is probably the right way to go,\" he told Times reporter Maura Dolan. A firing squad would be \"messy but effective.\", Either would be fine with me, although a firing squad is more American. Thats right. As Ive written before, you wont read any arguments here about the death penalty being immoral, unfair or barbaric. These creeps  once proven guilty beyond a shadow of doubt  should be removed from our planet ASAP. Let the depraved killer turn to his God for redemption and mercy. The issue for me is not about the merits of capital punishment. Its about senselessly pouring money down a rathole and even coddling the worst of the worst. If were not going to execute these murderers, push them out into the general prison population with nasty cellmates and work duties. Three years ago, a study by U.S. 9th Circuit Judge Arthur L. Alarcon and Loyola Law School professor Paula M. Mitchell found that death row prisoners cost $184 million more per year than if they had been sentenced to life without parole. Until that time, they calculated, California had spent roughly $4 billion to administer capital punishment over the previous 33 years. That amounted to about $308 million per execution. The Legislature, on a simple majority vote, could place a death penalty repealer on the ballot. But it hasnt the courage to risk a backlash from capital punishment supporters. Neither has Brown. Or it could fix the system by shortening the appeals process and hiring more attorneys to serve the condemned. But Democrats wont do that either. A law enforcement-victims rights coalition hopes to sponsor a reform initiative in 2016. \"Opponents say the system cant be fixed,\" says Kent Scheidegger, legal director of the pro-death penalty Criminal Justice Legal Foundation. \"Well, weve never tried. Its not a case of cant. Its a case of wont.\", Fine. But lets either fix it or junk it. george.skelton@latimes.com]", "Date": "20140727", "Title": "[Scrap California's dysfunctional death penalty policy]", "Link": "http://www.latimes.com/local/crime/la-me-cap-death-penalty-20140728-column.html", "Author": "NULL"}