{"Content": "[Former Los Angeles Mayor Antonio Villaraigosa, a close ally of Hillary Clinton, voiced concern Friday that the Democratic Party was kind of stuck in last year, saying he expected the former secretary of state to face a very close election for president. Im not sure were a party of enough new ideas, Villaraigosa told several dozen finance executives at a private equity conference in Santa Monica. I think both parties kind of are married to their constituencies and their powerful interests, and theyre unwilling to challenge them in the way I did as mayor. Villaraigosa, who as mayor clashed with teachers unions, did not elaborate on what he meant by stuck in last year. But the context  answering an audience members question on the 2016 presidential race  suggested his focus was more on Clinton than on President Obama or Congress. Villaraigosa campaigned extensively for Clinton in her losing battle for the 2008 Democratic presidential nomination. Ultimately, he suggested, Clinton will prevail, even if she endures a lot of noise in a contested race for the party nomination. Democrats who might brave the long odds and challenge Clinton include former Maryland Gov. Martin OMalley and former Sen. Jim Webb of Virginia. Handicapping the crowded field of Republicans vying for president, Villaraigosa described former Florida Gov. Jeb Bush as the most formidable. But Im not sure he can get out of the primary, just because that primary vote has gone so far to the right, Villaraigosa said. The onetime state Assembly speaker called Wisconsin Gov. Scott Walker interesting, saying he appeals to the establishment, but also to more radical elements of the Republican Party. He also predicted that Florida Sen. Marco Rubio will be stronger than people think. Hes a smart guy, Villaraigosa said. Hes talented. But I think hell have the same problem that Jeb Bush does in terms of getting out of the primary. Villaraigosa, who raised millions of dollars from donors with an interest in public business when he was an elected official, said the huge sums of money that White House contenders from both parties are raising were a distortion and a perversion of the Democratic process. The interests end up kind of stopping us from doing the things we got to do, he said. Villaraigosas appearance at the Small Business Investor Alliance gathering also gave him a platform to explore themes of a potential 2018 gubernatorial campaign. (Another Democrat, Lt. Gov. Gavin Newsom, has already announced his candidacy.), He boasted of rupturing his longtime alliance with teachers unions and took credit for turning around some of the citys most underperforming schools in Watts and on the Eastside. He also took credit for doubling the size of the rail transit network in Los Angeles and expressed support for Gov. Jerry Browns plan to build a high-speed rail line between Los Angeles and San Francisco. Villaraigosa mentioned elaborate modern rail networks in Europe and Asia, saying, Were like in the dark ages when it comes to infrastructure. Twitter: @finneganLAT]", "Date": "20150426", "Title": "[Villaraigosa: Democrats stuck in past, Clinton faces tight race]", "Link": "http://www.latimes.com/local/political/la-me-pc-villaraigosa-clinton-president-20150424-story.html", "Author": "[Michael Finnegan]"}