{"Content": "[There is little that Hillary Rodham Clinton could have said or done to instantly quell the controversy surrounding her private email account and, by that meager standard, Tuesdays 20-minute news conference lived up to expectations. Supporters will seize upon her repeated assertions that she fully complied with every rule that I was governed by in defending the Democratic presidential front-runner and asserting that she is the victim of a partisan smear campaign. Clinton said working from the personal account while serving as secretary of State was a matter of convenience and repeatedly insisted that she has turned over every government communication so it could be made public by the State Department  save thousands of private emails she said she chose to delete. Those, she said, pertained to matters such as her daughters wedding, her mothers funeral and her yoga routine. Trust me, she essentially said, a fraught proposition at a time when so much of the public has so little faith in government. And an invitation that is all the more perilous given her familys mine-strewn political history. Critics were quick to seize upon Clintons legalistic statements  shades of the parsing done by President Clinton in the lead-up to his impeachment  to suggest the former first ladys session raised more questions than it answered. They mocked her suggestion that it was too much hassle to deal with two email accounts and to carry separate cellular devices for each. They pointed to inconsistencies between her actions and those of others serving in the Obama administration. They cited her body language, suggesting it telegraphed discomfort and hinted there were things she was hiding. More worrisome, an invitation to swear an oath and discuss the matter before Republicans on Capitol Hill seems certain  in the form of a subpoena, if necessary. The reaction had afamiliar to-their-corners feel, especially for any who remember the Clinton White House years. In fact, the controversy so far has done little to shake the former first ladys standing among Democratic voters, who overwhelmingly support her all-but-announced bid for the White House. A Wall Street Journal/NBC poll conducted as the episode was unfolding last week found that nearly 9 in 10 Democrats could see themselves backing Clinton for president, strong affirmation that cut across all subsets within the party: men and women, liberals and conservatives, white and minorities. Kathy Sullivan, a former head of the New Hampshire Democratic Party, spoke for many party activists when she brushed aside the controversy as a stew of Republican vengeance and media hype. If Hillary Clinton was seen jaywalking some Republican would call for an investigation, said Sullivan, a Manchester attorney. But a presidential campaign operates on multiple levels or, seen another way, in concentric circles, starting with the innermost layer of operatives, donors and political reporters who flyspeck the candidates and judge their actions in minute detail. It is their conclusions that tend to shape broader perceptions and it was largely that audience of opinion-makers that Clinton addressed in her news conference at the United Nations, which was attended by scores of reporters and broadcast live on several TV networks. More than two decades ago, Bill Clintons operation perfected the notion of rapid response after the 1988 presidential campaign when Democrat Michael Dukakis lost in good part because he refused to address political attacks he judged foolish or inconsequential. Hillary Clintons comparatively laggard reaction to the email controversy, allowing more than a week to pass before she offered a substantive response, contributed to concern among party professionals that her political operation had gone rusty  or, worse, was maladapted to the 24/7 demands of todays campaign world. Those watching closely  by nature not your typical voter  saw worrisome signs that Clinton was repeating some of the mistakes that undermined her 2008 presidential bid, relying on a coterie of loyalists who reinforced her hostility toward the media and instinct to hunker down and lash out rather than open up. The absence of a formal campaign structure, which awaits a Clinton declaration of candidacy, contributed to the slow response, Shades of deja vu again, said one Capitol Hill veteran of more than 25 years, speaking anonymously about the serial upheavals, including controversies over the Clintons personal finances and the secretive drafting of failed healthcare legislation, that roiled her husbands administration. It just brings flashbacks to all sorts of bad situations. Others worried that Clinton, who has limited her appearances to paid speeches and mostly friendly interlocutors since stepping down two years ago as secretary of State, would be ill-prepared for the kicking and clawing of a campaign. She did little to engender good will, or bat away questions about her openness, by scheduling her news conference on short notice at the U.N. an especially hard-to-access, high-security venue. (Clintons appearance followed a speech she delivered there on womens empowerment.), But her demeanor was cool and crisply efficient, even if the smile she flashed often seemed forced. She abruptly cut off the news conference after answering fewer than a dozen questions  several of them multi-partleaving many more hanging in the air. None of which suggests Clinton is likely to be denied the Democratic nomination because of the current controversy. Many Democrats have come to the conclusion that the former New York senator and secretary of State is by far the strongest candidate the party can field in 2016. Some believe that enthusiastically, others resignedly so. As such, there is a willingness to overlook, or at least accept, the roller-coaster drama and controversies that for decades have attended the nations most powerful and prominent Democratic family  taking, as it were, the good with the bad. Nobodys perfect, said Lou DAllesandro, a Democratic state senator and longtime Clinton ally in New Hampshire, which hosts the first presidential primary. Theyve made a contribution to the country, theyve stepped up to the plate, theyve done it repeatedly and I think the country is the beneficiary. Yes, DAllesandro said, for one reason or another the Clintons have visited many of their political problems upon themselves. But, he succinctly concluded, You take the leopard with their spots. mark.barabak@latimes.com, You dont need special access to follow  @markzbarabak fornational & California politics]", "Date": "20150310", "Title": "[Hillary Rodham Clinton news conference won't end email controversy]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-hillary-clinton-emails-analysis-20150310-story.html", "Author": "[Mark Z. Barabak]"}