{"Content": "[The red wave of the midterms means Republicans will have considerably greater leverage dealing with Barack Obamas waning presidency. In national security matters, however, unlike domestic affairs, Congress confronts important constitutional realities and limitations. How successful Republicans will be depends heavily on their appreciating the constraints regarding foreign and defense policy they face being in the legislative rather than the executive branch. In the vast external realm, the Supreme Court has explained, the Framers intended that the president would dominate: The President alone has the power to speak or listen as a representative of the nation. Congress, collectively and individually, has frequently chafed at this reality, but only on rare occasions have congressional majorities differed so substantively as todays Republicans do from Obamas White House. But it is precisely in such circumstances that Senate and House majorities must resist the temptation to squeeze into the chair behind the presidents Oval Office desk. There will come a time, one hopes sooner than later, when a conservative will occupy that chair. That president will certainly want and need to take advantageof what Alexander Hamilton, in Federalist No. 70, called the executives superior decision, activity, secrecy and dispatch, especially in foreign affairs. Accordingly, the next Congress should use its leg-islative powers as they were intended, and not aspire to be a Team B executive branch. Although Obama has not demonstrated Hamiltons prized qualities, neither will nearly 300 Re-publican legislators acting collectively. What, then, should Capitol Hill Republicans focus on internationally?, First, Congress should be the arena in which to highlight the broad national debate we need over Americas place in the world. Through hearings and floor debates on weapons proliferation, terrorism and broad strategic issues, House and Senate Republicans can drive the discussion: Do Americans buy Obamas view that the United States is too dominant, and that our vigorous global presence contributes to tensions and conflict? Or do they endorse Ronald Reagans vision that a strong America creates what minimal order and stability we have, a role critical to maintaining the liberal world economic order so vital to our way of life and domestic standard of living?, Second, Congress must be on guard that Obama, like many lame-duck presidents, will see the exercise of his foreign affairs authority as a way of escaping congressional interference. Senators must use the treaty ratification and confirmation processes to prevent Obama from imposing through international agreements what he could not otherwise obtain legislatively. We see this risk already in issues as diverse as gun control, climate change and the death penalty. We must not give Obama a pass on policy decisions that should be resolved through our constitutional processes, not via international organizations and treaties. Finally, Congress central responsibility lies in its appropriations power. Republicans priority must be reversing six years of Obamas catastrophic reductions in defense spending  well over a trillion dollars while domestic spending was exploding. Representatives and senators must understand and explain that deterrence rests on America operating from a position of strength, and that the best way to avoid conflict is to be so clearly superior that potential opponents reject threatening behavior reflexively. In 2017, a new president will need all the head start he can get in repairing the damage to the United States international reputation and credibility that Obama has gravely weakened. As Reagan said, Yes, the cost is high, but the price of neglect would be infinitely higher. There will undoubtedly be heated debates about the virtues of competing defense priorities, weapons systems and force levels; too many to address here. And there will be those, including Republicans, who cant tell the difference between dollars spent on soybean subsidies and dollars spent on carrier battle groups. There is waste in defense-related budgets that must be eliminated, with the savings plowed back into sensible military expenditures. Nowhere is the waste more evident than in the cumbersome, archaic, nearly incomprehensible defense-procurement system. Under new, incoming chairmen for both the House and Senate Armed Services committees, wide-ranging investigations and the complete reform of military procurement are a feasible prospect. Former Navy Secretary John Lehman believes the best course is to junk the present system and start from scratch, an entirely sensible reaction to the current systems bureaucratic anarchy. A clean start would improve the performance of both government and private contractors, and it is a project Obama has neither interest in nor competence to undertake. This is a more than ample foreign policy agenda for Congress for the next two years. And the underlying debate it will stimulate is an excellent precursor to the 2016 presidential campaign. John Bolton, former U.S. ambassador to the U.N. is a senior fellow at the American Enterprise Institute. Follow the Opinion section on Twitter @latimesopinion]", "Date": "20141113", "Title": "[A foreign affairs to-do list for the GOP]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-bolton-obama-congress-foreign-policy-20141114-story.html", "Author": "NULL"}