{"Content": "[Running for president is not quite what it used to be. Candidates once had to rely on the support of party leaders, who assessed their electability; on a broad fundraising base to sustain them until victory brought in fresh cash; and on a handful of national news outlets to spread the word of their candidacy. No more. Major changes in the political system  especially campaign finance laws that allow rich people to write unlimited checks to certain political action committees  have drastically lowered the barriers to entry, as has the proliferation of social media. \"If youve got a Twitter account, a Facebook page and a millionaire to fund your super PAC, why not?\" said Jim Dyke, a veteran Republican strategist working for candidate Jeb Bush in South Carolina. The Reelz Channel has acquired the rights to broadcast the Miss USA pageant. NBC dropped the pageant after co-owner Donald Trumps comments on Mexican immigrants. Reelz says the pageant will be broadcast on Sunday, July 12th. July 3, 2015. (AP), The Reelz Channel has acquired the rights to broadcast the Miss USA pageant. NBC dropped the pageant after co-owner Donald Trumps comments on Mexican immigrants. Reelz says the pageant will be broadcast on Sunday, July 12th. July 3, 2015. (AP), The result is more than a dozen declared Republican candidates  with others soon to follow  giving the party its largest pick of presidential contenders in memory and a roster of uncommon depth and experience. What the party lacks is a clear leader in the 2016 field  or anyone, for that matter, who can plausibly claim a meaningful advantage  producing what is arguably the most wide-open Republican race in more than 50 years. \"You have people who lead in polls,\" said Craig Robinson, a GOP analyst in Iowa, the state due to cast the first presidential votes in about seven months, \"but no front-runner.\", Indeed, an aggregate of surveys taken nationally as well as in Iowa and New Hampshire, the second state to vote, shows no candidate gaining the support of even a quarter of Republican voters interviewed. With the field likely to include at least four sitting governors, plus the ex-governors of three big states  Florida, New York and Texas  and four United States senators, the party hardly lacks for skilled and politically proven candidates. The faithful will inevitably rally around the eventual Republican nominee, uniting behind the shared goal of defeating the Democrats in November 2016 and winning back the White House after an eight-year absence. But until then, the supersized White House field points not just to the ease of entry but to the myriad fault lines within the party: between its establishment and insurgent wings, between social and economic conservatives, between its growing political base in the conservative South and shrinking toehold in the more moderate Northeast. \"We have polarization in the Republican Party,\" said Stuart Spencer, a GOP strategist with more than half a century of campaign experience. \"Just as we do in the nation.\", It is not unusual for a party out of power to look inward and debate what, if any, changes are needed to find its way back to success. (Republicans have lost the popular vote in five of the last six presidential contests and havent won a sizable electoral college majority since 1988.), In 1992, after a string of Democratic losses, Arkansas Gov. Bill Clinton won the White House running as \"a new kind of Democrat\" who was less beholden to the partys long-standing liberal orthodoxy. He declined to spare a death row inmate from execution, hoping to show his toughness on crime, and vowed to drastically overhaul the federal welfare system, which he did in his second term as president. No GOP candidates have gone as far as Clinton in taking on their own party. But several have nudged fellow Republicans in different ways: Bush, a former Florida governor, by urging the party to soften its tone on immigration; Kentucky Sen. Rand Paul by advocating a less assertive military policy; Ohio Gov. John Kasich by embracing the expansion of Medicaid under the Affordable Care Act, which is loathed by many Republicans. ------------, FOR THE RECORD, June 29, 12:15 p.m.: An earlier version of this articleincorrectly said Ohio Gov. John Kasich had embraced the expansion of Medicare. ------------, While those three and others seek to broaden the party and its appeal, some rivals, including Wisconsin Gov. Scott Walker and Texas Sen. Ted Cruz, have suggested Republicans hold true to their long-standing positions and do a better job of turning out supporters who, they suggest, have been dispirited by too-quick-to-compromise nominees like John McCain and Mitt Romney. \"What Jeb Bush is saying is that we need to hide our conservative ideals,\" Louisiana Gov. Bobby Jindal said Wednesday in launching his presidential bid. \"But the truth is, if we go down that road again, we will lose again.\", Bush, with his universal name recognition and ready-made national network of political and financial supporters, was once considered a strong favorite for the nomination. But his less-than-stellar performance as a candidate and resistance among Republicans toward the notion of another Bush in the White House  following his father and older brother  have pushed him back among the rest of the pack. That, in turn, has encouraged others to jump into the Republican race, among them Kasich, who is expected to formally declare his candidacy by the end of summer. \"I thought Jeb was just going to suck all the air out of the room,\" Ohios governor told a group of New Hampshire business leaders this month. \"And it just hasnt happened.\", The last presidential race is instructive. Former Pennsylvania Sen. Rick Santorum had lost his previous campaign, a 2006 Senate reelection bid, by a humiliating 18 points. He spent much of the early 2012 contest as a near-asterisk in polls. Still, Santorum nearly snatched the nomination away from the front-running Romney, thanks in good part to a lone financial benefactor who sustained Santorums campaign long after it once would have ended. Given that experience, there is every incentive for others, including several distinct long-shots, to hope they, too, can catch political lightning in 2016. (Santorum is among them, making his second try for the White House.), History is certainly on the Republicans side: It is rare for a party to win the White House three times in a row, and with President Obama stepping down, an open seat offers added enticement. \"If youre interested in running for president,\" said Steve Duprey, a longtime New Hampshire GOP activist, \"this is the time to do it.\", All but one of those seeking the Republican nomination will, of course, end up losing. But that may not be so bad, either: Save for the most off-putting candidates, the rewards may include higher speaking fees, a shot at their own cable TV show and maybe a slight edge should they run again four years from now. mark.barabak@latimes.com, Twitter:@markzbarabak, Declared major candidates, Jeb Bush, former Florida governor, Ben Carson, retired neurosurgeon, Ted Cruz, senator from Texas, Carly Fiorina, former Hewlett-Packard CEO, Lindsey Graham, senator from South Carolina, Mike Huckabee, former Arkansas governor, Bobby Jindal, Louisiana governor, George Pataki, former New York governor, Rand Paul, senator from Kentucky, Rick Perry, former Texas governor, Marco Rubio, senator from Florida, Rick Santorum, former senator from Pennsylvania, Donald Trump, real estate developer, Expected candidates, Chris Christie, governor of New Jersey, John Kasich, governor of Ohio, Scott Walker, governor of Wisconsin]", "Date": "20150629", "Title": "[Lack of clear front-runner in huge 2016 field highlights fractures within GOP]", "Link": "http://www.latimes.com/nation/politics/la-na-gop-race-20150629-story.html", "Author": "[Mark Z. Barabak]"}