{"Content": "[Less than two years into office, Prime Minister Benjamin Netanyahus government collapsed Tuesday as he fired two ministers who lead parties in his ruling coalition. Ending a protracted political crisis and speculation about early elections, Netanyahu dismissed Justice Minister Tzipi Livni and Finance Minister Yair Lapid and said he would move to dissolve parliament and call for elections. Addressing Israelis at a prime-time televised news conference, Netanyahu accused the two ministers of repeatedly challenging his policies and leadership, citing examples such as Lapids criticism of construction in East Jerusalem and Livnis meeting with Palestinian Authority President Mahmoud Abbas against the prime ministers instructions. I will no longer tolerate an opposition within the government, I will not tolerate ministers attacking the policy and head of the government from within, Netanyahu said in announcing the changes. He accused the two of waging ugly old politics. Four other ministers from Lapids centrist Yesh Atid party quit in protest of his dismissal. Yaakov Peri, resigning as science minister, called Netanyahus remarks hesitant, cowardly and even slightly hysterical. Livni also had harsh words, calling Netanyahu a petty politician and noting that other ministers had criticized him strongly without being fired. The head of the liberal Movement party, Livni has been Israels chief negotiator with the Palestinians. Netanyahu is the second-longest serving prime minister in Israels history. But the outgoing government, his third, is one of the shortest-lived. This government was contrarian from the start, Netanyahu said. An opposition bill to dissolve the Knesset, Israels 120-seat parliament, is already slated for discussion Wednesday and is expected to pass. Approval would start the clock ticking toward general elections, expected in March. The Cabinet would remain in place until a new government is formed after elections, although responsibilities of fired or resigned ministers would have to be entrusted to caretakers. Previously, elections were not expected until 2016. The five-party coalition Netanyahu formed after the last elections in January 2013 was divided from the beginning on a wide range of key issues, including the peace process with the Palestinians, settlements and economic policies, but managed to coexist on other matters. Political differences between liberal and hawkish members were further challenged over the last year by a chain of events including the peace talks and their collapse, the war in the Gaza Strip, settlement controversy and the recent wave of terrorist attacks. The fraying coalition unraveled rapidly in recent weeks amid fierce clashing between Netanyahu and his top ministers over increasingly contentious legislation, and the budget and economic issues. Coupled with an increasingly restive hawkish contingent within Netanyahus Likud Party, infighting in effect paralyzed the government. The latest deadlock was sparked by a bill declaring Israel to be a Jewish state, and a budget that put Livni and Lapid on a collision course with Netanyahu. The confrontation became increasingly personal. A series of last-minute meetings between Netanyahu and the leaders of his coalition partners failed to stop the downward spiral of his feuding government. Livni and Lapid charged that Netanyahus efforts were not sincere. Fierce accusations flew after a late-night meeting between Netanyahu and Lapid, after which the prime minister said elections would be preferable to the continued existence of a Cabinet whose ministers sabotage the governments actions against the public interest. Lapid accused Netanyahu of acting irresponsibly and reneging on promised support for the budget and economic reform, both geared to lowering the cost of living. We had an alternative, a good alternative, Lapid said, adding that billions of dollars will now be wasted on elections rather than going to education, welfare and health. The cost of elections is estimated to be about $500 million. In coming months, planned reforms will be suspended and government expenditures limited until the next government passes a budget. According to Livni, elections will not be about the economy but a choice between moderate Israeli Zionism and dangerous extremists that mustnt be allowed to take over the country. She called for a more centrist government that would fight terror but also make the necessary diplomatic decisions. At a news conference at NATO headquarters in Brussels, Secretary of State John F. Kerry declined to comment on Netanyahus actions but said he hoped elections would produce the possibility of a government that can negotiate and move towards resolving the differences between Israelis and Palestinians. The Labor Party, which heads the opposition, kicked off its campaign two weeks ago, with the slogan Israels stuck with Bibi, referring to the prime minister by his nickname and suggesting that the country cannot move forward under his leadership. This week, opposition leader Isaac Herzog said Netanyahu had failed in every parameter and brought the country to a dead end in diplomacy, security and the economy. Israels political system has taken sharp U-turns in similar situations in the past, but the crisis appeared beyond repair Tuesday. Israelis dont really understand why we are headed to elections after less than two years, but that doesnt matter. Its a fact, Foreign Minister Avigdor Lieberman said. Sobelman is a special correspondent, 4:53 p.m.: Updated with quotes from Netanyahu, Livni, Lapid and Kerry, and background details. This post was first published at 10:14 a.m.]", "Date": "20141202", "Title": "[In Israel, Netanyahu fires 2 ministers, plans to call for elections]", "Link": "http://www.latimes.com/world/middleeast/la-fg-netanyahu-ministers-elections-20141202-story.html", "Author": "NULL"}