{"Content": "[The Wisconsin Supreme Court on Thursday upheld state requirements that people show photo identification before being allowed to vote, the latest battle over how to regulate the polls. In a split ruling, the court backed the photo requirement, strongly pushed by Republican Gov. Scott Walker. However, there is still a pending suit on the issue which was initially struck down by a federal court in April. Earlier this week, the U.S. Justice Department filed a brief opposing the law, saying that the photo ID requirement unfairly limited participation by minority voters. Voter ID is a common sense reform that protects the integrity of our elections, Walker said in a statement. \"We look forward to the same result from the federal court of appeals. The issue of who gets to vote and under what circumstances goes to the heart of the political process, especially in the current election cycle on the federal level in which the GOP is seeking to retain control of the House of Representatives and win the Senate. There is also the presidential election coming up in 2016. In general, Democrats have sought to increase the voting base and oppose many regulations, arguing they discriminate against minorities and the elderly, both key constituencies. Republicans argue that tighter controls are needed to protect the process from voter fraud. The GOP also benefits in many cases from smaller turnouts. According to the National Conference of State Legislatures, 34 states have passed laws requiring some sort of identification from voters, but only 31 of them are in effect. Like in Wisconsin, a court has struck down Pennsylvanias law, and one passed in North Carolina wont take effect until 2016. Walker signed the voter identification law in 2011. Former Gov. Jim Doyle, a Democrat, had vetoed a similar requirement three times. On Thursday, the Wisconsin court ruled in two cases involving voter eligibility. One was brought by the League of Women Voters and the other came from the Milwaukee branch of the National Assn. for the Advancement of Colored People and immigrant rights group Voces de la Frontera. In the NAACP case, the Supreme Court said the state cant require people to pay fees to receive state-issued ID cards. Doing so would be a severe burden on the constitutional right to vote, Justice Pat Roggensack wrote. The court ruled 4-3 in favor of the law in the NAACP case and 5-2 in the League of Women Voters lawsuit. In April, U.S. District Judge Lynn Adelman struck down the photo identification law, arguing that the state couldnt prove the danger of fraud and that the law violated the U.S. Constitutions guarantee of equal protection. The case is pending before the 7th Circuit Court of Appeals. The U.S. Justice Department on Wednesday sided with challengers in that case, saying that the photo ID requirement unfairly affected minority voters. The department also took a similar stand on an Ohio law that limits when voters can cast an early ballot. These filings are necessary to confront the pernicious measures in Wisconsin and Ohio that would impose significant barriers to the most basic right of our democracy, Atty. Gen. Eric H. Holder Jr. said in a statement, calling the laws the latest, misguided attempts to fix a system that isnt broken. Follow @latimesmuskal for national news]", "Date": "20140731", "Title": "[Wisconsin Supreme Court backs GOP law on voter ID]", "Link": "http://www.latimes.com/nation/nationnow/la-na-nn-wisconsin-supreme-court-voter-id-20140731-story.html", "Author": "[Michael Muskal]"}