{"Content": "[Sen. Ted Cruz stood outside the Capitol on a dreary Wednesday, leading the charge against President Obamas immigration plan. But it was not entirely clear who was following him. The Texas Republican was imploring fellow GOP members to block money for Obamas immigration action as part of the upcoming legislative battle to fund the government by the Dec. 11 deadline or risk a federal shutdown. \"What Im urging my fellow Republicans to do is very, very simple,\" Cruz said, his speech punctuated by cheers from the modest crowd, including a man dressed in a Revolutionary period patriot outfit. \"We will fund the operation of the federal government, but we will not allocate taxpayer dollars for lawless and illegal amnesty.\", Last year, the Texas senators ability to influence core conservatives drew jokes that hed become \"Speaker Cruz,\" rivaling the power of actual House Speaker John A. Boehner (R-Ohio). The Cruz strategy of using the annual spending bill as leverage to fight Obama over the Affordable Care Act had largely been blamed for the politically unpopular 2013 government shutdown. Fresh from that episode, the Cruz clout began to dim. Now, the potential 2016 presidential hopeful is advocating a similar hardline approach against the presidents executive action on immigration, which would protect up to 5 million immigrants -- largely parents of U.S. citizens -- from deportation. Cruz wants to fund most of the government by the deadline, but withhold any money that could be used by the Department of Homeland Security to implement Obamas immigration plan. On the grassy east front of the Capitol, he was joined by a small group of GOP lawmakers well-known for their hard stances against illegal immigration -- Rep. Michele Bachmann of Minnesota, Rep. Steve King of Iowa and Rep. Tim Huelskamp of Kansas. One enthusiast in the crowd cheered \"Cruz 2016!\", But it appeared support for the Cruz strategy may not be enough to derail Boehners more tempered approach. The speakers leadership team was trying to round up votes Wednesday for legislation to fund the government through the fiscal year ending in September, but only provide temporary funding for the Department of Homeland Security, which handles the immigration agencies. Once the DHS funding runs out early next year, Republicans could revisit the immigration issue after the GOP majority is seated in January. Led by Boehner, the House Republican leaders are also offering a parallel bill that would simply oppose Obamas actions. That legislation would be largely symbolic, since Sen. Harry Reid (D-Nev.), the majority leader, has said he would not bring it forward in the Senate. But it could allow opponents of the president an opportunity to register their displeasure with his immigration plan. Cruz mocked such \"show-votes\" as ineffective. He suggested that many Republicans won re-election to Congress last month vowing to prevent Obamas immigration action, and now they need to keep their promises. For the latest from Congress follow @LisaMascaro]", "Date": "20141203", "Title": "[Sen. Ted Cruz wants to block funds for Obama's immigration plan]", "Link": "http://www.latimes.com/nation/politics/politicsnow/la-pn-ted-cruz-immigration-20141203-story.html", "Author": "[Lisa Mascaro]"}