{"Content": "[President Obama has talked about the deadly dogma infiltrating some Muslim communities and decried the acts of terrorism carried out in the name of what he calls a \"distorted\" version of Islam. But as he presides over three days of discussions at the White House about the fight against terrorism, he and his staff are studiously avoiding making their efforts sound like a religiously driven campaign against the faith of more than 1 billion people. Officially, the meeting is a summit on countering violent extremism. Nobody at the White House is talking about \"Islamic extremism\" or \"Muslim terrorists,\" a semantic distinction that has critics up in arms but that the administration contends is necessary to deprive extremist groups of the authenticity they crave. \"We must never accept the premise that they put forward because it is a lie,\" Obama said in an address at the summit Wednesday. \"They are not religious leaders. They are terrorists. And we are not at war with Islam. We are at war with people who have perverted Islam.\", More than 13 years after the Sept. 11 attacks, U.S. officials are still trying to speak fluently when talking about stateless enemies who cite Islam as their inspiration for terrorism. President George W. Bush talked briefly about \"Islamofascism,\" but it fell out of use amid the protests of Arab leaders. Republicans accuse Obama of tiptoeing around the issue out of an apparent reluctance to offend Muslims. And the question of how to define adversaries is certain to be posed to candidates in the 2016 presidential election. Bush and Obama have tried to balance three goals with their rhetoric: defining 21st century foes to build support for the fight among lawmakers and the public; bringing and keeping Muslim nations on board as partners in preventing the spread of violence and extremism; and avoiding alienating Muslims in the U.S. and elsewhere. Those competing priorities were seen in recent weeks when Obama used the word \"randomly\" in describing the attack on a kosher deli in Paris last month, which some seized on as evidence of his refusal to acknowledge the anti-Semitic motivations in the killings. He was also tweaked for his remarks at the National Prayer Breakfast this month about the Christian role in the Crusades. \"They wont even call the threat what it is. How can you talk about defeating an enemy you cannot name?\" said House Homeland Security Committee Chairman Michael McCaul, a Texas Republican. The White House said it was not limiting its discussion to groups that identify as Muslim but acknowledged that the recent spate of attacks had been by perpetrators promoting a \"warped\" interpretation of Islam. \"They need for this to be a war between the United States and Islam, for people to believe that they are religious figures and not just terrorists,\" deputy national security advisor Ben Rhodes said. \"We dont want to grant them that legitimacy.\", But deadly homegrown attacks this year in Europe and a video that surfaced this week of beheadings of Egyptian Christians in Libya by the Islamic State gave renewed urgency to the Wests response to terrorists who say they are acting in the name of Islam. James K. Glassman, who led the State Departments public diplomacy efforts at the end of the Bush administration, says he sees both similarities and differences in how the two presidents talked about fighting extremism. Like the current administration, Bush officials were mindful of linking terrorist ideologies too closely to the religious precepts of Islam and also used the phrase \"countering violent extremism\" to describe the challenge. \"We were very sensitive to that,\" said Glassman, a co-chair at the Bipartisan Policy Center. \"But it wasnt that we were worried about offending anybody. It was just more accurate.\", The ideology fueling the Islamic State appears to be a twisted version of centuries-old interpretations of the prophet Muhammad, he said, bearing little resemblance to contemporary Islam. The Obama administration should spend time understanding and articulating that, Glassman said. But that is where he sees the administration as coming late to the game. Unlike Bush, Obama and his top officials have appeared uncomfortable setting up the fight against terrorism as a \"war of ideas,\" Glassman said. \"The way President Bush put it was usually in terms of freedom and democracy. We need to stand up for those values, and democracy is for everybody,\" Glassman said. \"I just dont hear that from this administration. I think there is a discomfort with the notion that our ideas are in some ways superior to other peoples ideas and a discomfort with the notion of marshaling ideas and sending them into battle.\", Obama called Wednesday for a broader international effort to prevent alienated young people from taking up terrorist causes, including that of the Islamic State. \"This isnt our challenge alone. Its a challenge for the world.  Given the complexities of the challenge and the nature of the enemy, which is not a traditional army, this work takes time and will require vigilance and resilience and perspective,\" Obama said. For their part, Muslim groups worried that the conference would target their communities and their beliefs as the source of the problem. \"Associating violence and extremism with Islam, such as Islamic extremism or Islamic terrorism, is very dangerous, because it will put the U.S. and the West at odds with 1.7 billion Muslims around the world,\" said Radwan Masmoudi, president of the Center for the Study of Islam and Democracy. \"The overwhelming majority of them are against violence and extremism. This is exactly what the extremists want  portraying it as a war between Islam and the West  and it would be catastrophic to fall into this trap.\", In a rare departure from citing only peaceful Muslim voices, the White House pointed Wednesday to a letter from a secret trove written by the most hunted terrorist of all time  Osama bin Laden. Shortly before he was killed by U.S. special forces in 2011, Bin Laden wrote to co-conspirators arguing that they were losing the propaganda war by letting their full name, Al Qaeda al-Jihad, be shortened, thus losing the religious element, White House Press Secretary Josh Earnest recalled. Bin Ladens letter lamented that the branding problem allowed the West to claim that they were not at war with Islam, Earnest said. But \"this is not a religious war,\" Earnest said. \"This is not a war on Islam.\", kathleen.hennessey@latimes.com, christi.parsons@latimes.com]", "Date": "20150219", "Title": "[At summit on extremism, Obama defends his semantic choices regarding Islam]", "Link": "http://www.latimes.com/nation/politics/la-na-obama-extremism-language-20150219-story.html", "Author": "[Kathleen Hennessey, Christi Parsons]"}