{"Content": "[Dont know about anyone else, but my eyes glaze and ears go mute whenever theres media speculation about the looming presidential race. Thats because as a Californian, my opinion doesnt mean squat. My vote will be meaningless. It cant be cast until the June 2016 California primary, long after the nominating contests will have been decided by other states, too many of them pampered peewees. Thats just how it has been for about the last 40 years. Typically, a candidate breaks ahead of the pack, then increases the lead and becomes a speeding train. Politicians, donors and voters scamper aboard. Money dries up for challengers. And in the November general election, well, forget it. California is a virtual cinch to cast most of its votes for the Democrat, no matter who it is. And because of the ludicrously outdated winner-take-all Electoral College system, any vote cast for the Republican will be worthless. So California voters again will be watching from the nosebleed seats. We may as well be living in Guam, rather than the most populous state with the worlds eighth largest economy. Its too late to do anything about the November election. Theres a struggling national movement, which California government supports, to finally junk the Electoral College and elect the president based on who most Americans vote for across the country. Hardly a radical idea. But that wont happen for a while, if ever. We could, however, return to holding an earlier presidential primary. The Legislature and Gov. Jerry Brown could do that for next year. California tried early primaries in four presidential elections starting in 1996. It was a mixed bag. Usually, the nominations were all but nailed down before we voted. In 2008, California did rescue Hillary Rodham Clintons presidential candidacy by delivering a timely victory on Super Tuesday, Feb. 5, that kept her breathing for three more months. In the Republican primary, California all but clinched the nomination for John McCain. In 2012, we went back to our historic June primary, and California played no role in the nominating process. It would have been an ideal year for us to hold an early primary because the GOP contest dragged on longer than expected. Nationally, Republican voters werent at all excited about Mitt Romney, the eventual winner. But Brown and the Democratic-controlled Legislature decided to combine presidential balloting with the regular state primary in June. The majority party could not have cared less about a presidential primary, because President Obama was not being challenged for renomination. And it didnt want the California GOP to get energized. That wasnt what Democrats said out loud, of course. They claimed to be saving money. The last early presidential primary in 2008, according to the secretary of states office, cost counties $94 million to conduct. Add on $4.2 million for the state cost of printing and mailing a voter information guide. Thats a roughly $98-million tab for democracy. Actually, the real waste of money is tallying presidential votes in June. I asked new Secretary of State Alex Padilla how he feels about perhaps reviving the early primary  which no one Im aware of is suggesting, candidly, except me. Padilla sees pluses and minuses. \"It is painful to watch national candidates come to California constantly for fundraising,\" he says, \"but when it comes to reaching out to voters, we read and hear all about them in Iowa and New Hampshire and North Carolina and Nevada. Not in California, the most populous state.\", \"I wouldnt say that makes us completely irrelevant,\" Padilla adds, \"but it certainly doesnt give us the voice we ought to have given our population.\", Ah, yes, the California ATM. If youre rich, you get coddled and charmed. Obama and Romney carried away $137.8 million from California donors in 2012 while spending virtually nothing here. Presidential candidates, Padilla says, \"ought to figure out how to pay attention to voters, too, not just checkbooks.\", The only reason theyd do that is if voters had any real impact on their political fates. \"The flip side of an early primary,\" Padilla continues, \"is not just the cost of a separate election, but voter fatigue.\" After voting in a presidential primary, the theory goes, people wouldnt bother to turn out for the state primary three months later. So? Their choice. In the early 2008 presidential primary, the turnout was about 58%. And, yes, it dropped off to 28% in the June state primary. But in the combined presidential and state primary in June 2012, the turnout was only 31%. And last Junes state primary drew a mere 25% turnout, even with all statewide offices on the ballot. Critics of early presidential primaries contend California never attained the clout it had expected. \"It doesnt work,\" says longtime political analyst Tony Quinn. \"It had no effect.\", But clout shouldnt be the principal goal. It should be giving Californians the opportunity to participate in nominating a president when their vote still matters, sometime in February or March. We should never return to early primaries that combine presidential and state elections. We had three. They made for ridiculously long state campaigns and mucked up the states political rhythm. But separate primaries make sense. An unexpected tax windfall is rolling into state coffers. A fraction of it should be spent on enhancing democracy. george.skelton@latimes.com, Twitter: @LATimesSkelton, ]", "Date": "20150409", "Title": "[ Let's schedule ourselves back into the presidential nominating process]", "Link": "http://www.latimes.com/local/politics/la-me-cap-presidential-primary-20150409-column.html", "Author": "NULL"}