{"Content": "[To the editor: Stanford political scientist Jon A. Krosnick is puzzled that legislators ignore popular opinion on climate change. Years of polling data, he says, show a majority of people acknowledge climate change and that government needs to control greenhouse gas emissions. Krosnick wishes that \"polls played a more prominent role in governance.\" (\"Stanfords Jon Krosnick: On climate change, most Americans want action,\" op-ed, May 5), Does Krosnick think the \"people\" are the politicians constituency? Todays politicians answer mainly to the business lobbies that fund elections. These wealthy interests profit from the use of fossil fuels. They pay for climate-change-denying scientists to confuse enough people to keep their politicians in office. Krosnick says that \"public opinion does seem to be thoughtful and informed.\" Public opinion is not the politicians constituency. Lawrence Rotunno, North Hills, .. To the editor: Public opinion about the veracity of climate change, global warming, planet-altering greenhouse gas levels or whatever you want to call it is largely irrelevant if the U.S. system of constitutional democracy is essentially broken. There is little correlation between what people think is wrong and what lawmakers do. The biggest problems facing the average Californians are low wages, reductions in social services and so on. To ask them to stop taking a 15-minute shower is crazy talk. Thats the only thing that gets them motivated to push the boulder up the hill. If our governor were truly serving our people, California would not be giving millions of gallons of water a day to Chevron so that Chevron can sell it to our desperate farmers to irrigate the last of Californias agriculture economy. Australia just pulled out of a drought that lasted over a decade. Gov. Brown, find out how they did it. Pam Brennan, Newport Beach, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150508", "Title": "[Why public opinion on climate change doesn't matter]", "Link": "http://www.latimes.com/opinion/readersreact/la-le-0509-saturday-climate-change-20150509-story.html", "Author": "NULL"}