{"Content": "[Negotiators from Taiwan and China met Saturday in an effort to maintain momentum for better relations that have resulted in economic gains. The ministers, appearing keen to sustain seven years of closer ties, discussed privately topics such as tourism and the dredging of sand in their shared ocean strait, officials said. But there were no signs that they touched directly on sensitive issues concerning Taiwans 2016 presidential election. Taiwans chief opposition Democratic Progressive Party, whose nominee leads in early public opinion polls, advocates a more cautious approach to China, including no new dialogue without greater respect for the islands self-rule. The 2016 elections are the elephant in the room, said Sean King, senior vice president with the consultancy Park Strategies in New York and Taipei. China has claimed sovereignty over Taiwan since the Chinese civil war of the 1940s, when Chiang Kai-sheks Nationalists formed a rival government on the island as Mao Tse Tungs Communists consolidated control over the mainland. Mao and his successors long threatened to use force if the self-ruled island decalred de jure independence. Current Taiwanese President Ma Ying-jeou, who must step down next year due to term limits, has led his government to ease icy relations by setting aside political differences to pursue economic cooperation. The Nationalists have agreed to talk to Beijing as part of one country, though their interpretation of China differs from that of Beijing. The opposition opposes that basis for dialogue. Relations with China suddenly slowed last year when tens of thousands protested in Taipei over what they view as a lack of transparency in deal-making. Critics also have expressed fear that China would leverage agreements with Taiwan in order to eventually take control of the island. That backlash eroded the ruling partys approval ratings. Taiwans minister to Saturdays talks had little power to discuss relations with China after Ma leaves office, said Alan Romberg, East Asia Program director with the Stimson Institute, a think tank in Washington. The two sides signed no agreements. His position is already clearly laid out by the president, Romberg said. The two-hour meeting on the tiny Taiwan-controlled Kinmen islets just off the mainland followed a series of speeches by the president in Taipei supporting continued warm relations with China. In the future we shouldlook correctly at reality, set aside disputes, promote cross-Strait relations in a stable manner and produce results that more ordinary people can feel, said Taiwans minister, Andrew Hsia, of the governmental China policymaking body Mainland Affairs Council, in opening remarks Saturday. Ma wants Taiwan to join Chinas multi-country Asian Infrastructure Investment Bank in order to play a bigger role in regional affairs. He is pushing separately for the two sides to set up their first-ever consular-style offices to facilitate tourism and investment. The Chinese side said Saturday it welcomed Taiwan to join the bank and both sides agreed to talk further at an early date about the representative offices. Pacts with China under Ma have created 9,600 jobs and last year raised two-way trade to a record $130 billion, officials say. Chinese tourism accounted for $13 billion in revenue from 2008 to 2014, Ma said in a speech May 20. But critics say that economic gains have helped only wealthy business people. Some say the growing numbers of Chinese tourists, about 10 million since 2008, cause traffic jams, shout in public and bargain too forcefully with merchants over small items. At a beach in the southern city Kaohsiung, activists mounted a fake cannon last month to protest congestion by tour buses and the litter left behind. On Saturday, about 300 opponents as well as supporters of Taiwan-China dialogue demonstrated outside the meeting, with one protester injured in a scuffle. Jennings is a special correspondent. ]", "Date": "20150523", "Title": "[China, Taiwan meet to promote solid relations, economic gains]", "Link": "http://www.latimes.com/world/asia/la-fg-china-taiwan-meet-to-promote-solid-relations-economic-gains-20150523-story.html", "Author": "NULL"}