{"Content": "[For New Hampshires Republican Party, the swarm of likely presidential candidates about to blanket the state has been preceded by another much-appreciated influx: money. There was the recent contribution of $10,000 from Jeb Bushs leadership political action committee, Right to Rise, ahead of a visit this week to the Granite State, his first since announcing he is exploring a run for the White House. Months earlier, $5,000 each came from leadership PACs established by Republican Sens. Rand Paul of Kentucky and Marco Rubio of Florida, two other presidential prospects eager to make friends in the state that will hold the first 2016 primary. \"Were a pivotal state in the election process, so its no surprise candidates are showing interest here,\" said Jennifer Horn, the state GOP chairwoman. At this stage of the 2016 campaign, the leadership PAC has become a vehicle of choice for presidential candidates. Common among members of Congress, but a relatively new device for those not holding federal office, such PACs enable prospective candidates to build donor lists, travel to early primary states and court future support by contributing to local officials and state parties, without having to formally declare a candidacy. \"It can be used as a warm-up to the main attraction,\" said Anthony Corrado, a professor of government at Colby College in Maine who has done extensive research on campaign finance. Unlike independent super PACs, which can receive unlimited contributions, leadership PACs can accept $5,000 per year from individual donors or other political action committees. Limits to how much these PACs can donate vary from $10,000 to state parties to about $5,000 to candidates per election. In the two years leading up to Novembers midterm election, 496 leadership PACs spent $47 million on federal candidates, according to the nonpartisan Center for Responsive Politics. Money raised by the PACs cannot go toward the candidates formal campaign, although the currying of influence in early or influential states will certainly be beneficial. Last year, Reinventing a New Direction, or RANDPAC, established by Paul in 2011, contributed a combined $15,000 to the GOP in early voting states like Iowa, New Hampshire and South Carolina, according to Federal Election Commission reports. Meanwhile, Rubios Reclaim America donated a total of $10,000 to state parties in Iowa and New Hampshire. Former Texas Gov. Rick Perry, a Republican, launched his political action committee, RickPAC, last summer and gave $10,000 to the New Hampshire GOP and $5,000 to South Carolina Republicans. The money sent to influential politicians has been equally sizable. Bush announced he contributed about $31,200 to House and Senate candidates from early voting states. \"These are all candidates Gov. Bush is supportive of and who are up for reelection in 2016,\" spokeswoman Kristy Campbell said. \"Obviously they are in critical states, but its important to note that these are just the first round of contributions.\", Before the November election, RANDPAC gave about $14,300 to federal candidates from Iowa, New Hampshire and South Carolina; Reclaim America handed out about $22,000 and RickPAC $17,900 to candidates in those states. The Jobs, Growth and Freedom Fund, the leadership PAC of Texas Republican Sen. Ted Cruz, gave $30,000 to federal GOP candidates from those states. These totals do not include the tens of thousands that the PACs also handed out through independent expenditures to support candidates such as Joni Ernst of Iowa, who won a competitive Senate contest, and Scott Brown, who failed to unseat Democratic Sen. Jeanne Shaheen of New Hampshire. Candidates and state parties in places like California and Texas, where primary voters cast ballots much later, have seen almost no donations from these PACs. (Bush is the only candidate to release tallies from this year; in odd years, PACs have the option of filing quarterly or semiannually.), Because of federal limits, the sums given to candidates are relatively small compared with the millions these PACs rake in. In the last two years, RANDPAC raised about $3.7 million, and Reclaim America brought in $3.9 million  two of the highest sums of any Senate leadership PACs. \"Sen. Paul is proud to have crisscrossed the country in the 2014 cycle on behalf of his ideas and of candidates nationwide,\" Doug Stafford, executive director of RANDPAC, said in an email. \"The PAC also built a nationwide donor and activist network to support those endeavors.\", Much of the cash raised by the PACs has gone toward travel, fundraising, consulting, polling and research, according to the Center for Responsive Politics. Expenses for RANDPAC included $4,983 in equipment at an Arlington, Va. Apple store and $2,050 in hotel fees at Caesars Palace on the Las Vegas Strip. \"This is a good way to build name identification in critical states that helps down the road,\" said Viveca Novak, editorial and communications director at the Center for Responsive Politics. \"And when looking at the contributions, its clear that theyre targeted toward certain candidates in certain states.\", Republicans may have a more active palette of leadership PACs, because the party has far more presidential prospects than Democrats have, but they are not alone in their use. Former Maryland Gov. Martin OMalley, a Democrat who is exploring a presidential run, has made significant contributions through his leadership PAC, OSay Can You See. Before the November election, his PAC handed out $24,500 in Iowa and New Hampshire to Democratic organizations and federal candidates. The Democratic front-runner, Hillary Rodham Clinton, has not set up a leadership PAC, but a super PAC that is trying to rally support for her has given the maximum of $10,000 each to the Democratic parties in Iowa, New Hampshire and South Carolina. Because it is governed by rules different from those of leadership PACs, Ready for Hillary can receive unlimited donations. It has raised $12.9 million since it formed in 2013. Ready for Hillary and the various leadership PACs also serve another role in these early stages of the race: collecting lists of supporters, which they can then turn over to the campaigns for a price. Corrado, the Colby College professor, said the PACs served as the architecture for a political campaign that, for the nominee, could ultimately cost more than $1 billion. \"It makes for an easy transition when its time to actually get moving and hit the trail daily,\" he said. \"Those lists and established contacts will play heavily when it comes to raising money.\", kurtis.lee@latimes.com, Twitter:@kurtisalee]", "Date": "20150311", "Title": "[Campaign cash: 'Leadership PACs' becoming vehicle of choice for presidential candidates]", "Link": "http://www.latimes.com/nation/politics/la-na-presidential-pacs-2016-20150311-story.html", "Author": "[Kurtis Lee]"}