{"Content": "[Louisiana Gov. Bobby Jindal announced Wednesday that he would seek the 2016 Republican presidential nomination, joining a crowded field as a long-shot candidate with dismal polling numbers relative to his fellow candidates and with his constituents at home. Jindal, a two-term governor, highlighted his tenure in office, during which he downsized state government and fought for tax cuts, the type of acts that are widely popular among the GOP base. We did what they said could not be done. We shrank government. The big-government crowd fought us every step of the way, Jindal said, noting hed cut the number of state government workers by 34% and limited bureaucrats. Jindal said there were a lot of great talkers running for president, but that none of them could talk about limiting government the way he had in Louisiana. Weve had enough talkers. Its time for a doer, Jindal said in a speech outside New Orleans. Im not running for president to be somebody; Im running for president to do something. After the 2012 election, Jindal, an Indian American and the first sitting governor to enter the 2016 presidential contest, was trumpeted as a formidable contender for the coming election. But several national surveys of the 2016 field, which now includes more than a dozen candidates, have him receiving about 1% support. In Louisiana, Jindals approval ratings this spring hovered near 30%, stemming largely from how hes handled the states recent $1.6-billion budget shortfall. On Twitter on Wednesday, Louisiana Democrats began a hashtag that plays off the regions Creole heritage: #NeauxBobby. Gov. Jindal has failed Louisiana in every way possible, and theres no reason to believe he will have any more success as a candidate than he did as governor, said Karen Carter Peterson, chairwoman of the state Democratic Party. Prior to becoming governor, Jindal served one term in the U.S. House. In the last year, Jindal has traveled the country touting position papers that outline his stances on issues including oil and gas production and foreign policy. Jindals low polling numbers and weak name identification nationally could keep his campaign from ever gaining momentum. He might be left out of the first debates of the campaign in August and September. New rules allow only the 10 candidates with the highest polling numbers to participate. kurtis.lee@latimes.com, Follow @kurtisalee for political news, 3:15 p.m.: This story was updated with quotes from Jindals announcement speech. 11:51 a.m.: This story was updated with background on Jindal. This story was originally published at 10:10 a.m.]", "Date": "20150624", "Title": "[Louisiana Gov. Bobby Jindal enters crowded GOP presidential race]", "Link": "http://www.latimes.com/nation/politics/la-na-bobby-jindal-announce-20150624-story.html", "Author": "[Kurtis Lee]"}