{"Content": "[Sen. Barbara Boxer lashed out at Republican presidential candidate Carly Fiorina on Friday, saying that the woman she defeated in 2010 is a mean-spirited, failed business leader who cared more about enriching herself than about working Americans. Here is a woman who ran against me in the worst year Democrats ever had and we won in a landslide because the people of California didnt want her to do to the country what she did to Hewlett-Packard, Boxer said. Shes the face of income inequality and the face of corporate greed. She makes Mitt Romney look like a Democrat. Romney was the GOP presidential nominee in 2012. Fiorinas campaign responded with a jab at Boxer. California has the highest poverty rates in the nation under BarbaraBoxers policies. As president, Carly will challenge the status quo that has crushed Americans under the weight and corruption of this government, said Fiorina spokeswoman Sarah Isgur Flores. Boxer said Fiorina enriched herself as the chief of Hewlett-Packard, flying in private planes and buying a yacht as she oversaw the layoff of 30,000 workers, and sent jobs overseas. The senator pointed out that the value of H-P stock dropped sharply before Fiorina was fired. Fiorina has argued that she made difficult decisions that allowed H-P to survive the technology industry recession. Her track record at H-P became the centerpiece of Boxers campaign, which the Democrat won by 10 points. She was tested in a Republican year running against me, who was considered very vulnerable, and she got slaughtered not because of me but because of her, Boxer said. Because of her lack of compassion and even caring about working people. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Fiorina is the center of attention in the presidential race because of her strong performance at the second Republican debate Wednesday night in Simi Valley. Boxer, who on Thursday sent out an email using Fiorinas candidacy to raise money for her super PAC, said she was stunned when the former executive announced her White House bid. I thought, this is a new definition of chutzpah, Boxer said. She hasnt had a job since she was fired, no ones hired her, and she has the chutzpah to think with that record that shes going to be the president of the greatest country in the world and commander in chief?, Boxer recalled the viral videos Fiorinas campaign ran during the Senate campaign, including one called Hindenboxer where Boxers head expanded into a blimp-like vessel that smashed through the ceiling of the U.S. Capitol, cast dark shadows as it drifted across the nation and crashed into the Pacific Ocean. Ive had 11 consecutive victories. I have run against Democrats, Republicans, men, women, people of all ages, Boxer said. She was by far the most mean-spirited opponent I ever had. seema.mehta@latimes.com, Follow@LATSeemafor political news. MORE FROM POLITICS, This was the story of the GOP debate on the Internet, Kasichs remark on hotel maids shows GOPs struggle in reaching out to Latinos, Republican rivals join in on assailing Trump for supporters anti-Muslim remarks]", "Date": "20150918", "Title": "[Sen. Barbara Boxer lashes out at Carly Fiorina as 'mean-spirited' face of corporate greed]", "Link": "http://www.latimes.com/nation/politics/la-me-politics-boxer-fiorina-story.html", "Author": "[Seema Mehta]"}