{"Content": "[When President Obama began his second term  the time presidents traditionally build foreign policy legacies  he had two major projects in the Middle East: a nuclear agreement with Iran and a peace settlement based on a Palestinian state. Israeli Prime Minister Benjamin Netanyahu planted himself firmly in the way of both. Much has been made of how the two leaders lack personal chemistry. But its worse than that; on those two core issues, they collide head-on. On Iran, Netanyahu came to Washington to rally opposition to the deal Obama is seeking  even before an agreement was struck. On a Palestinian state, U.S. officials have concluded that the Israeli leader never intended to say yes, despite his on-again, off-again endorsement of the idea. So where does the U.S. go from here? I asked Martin Indyk of the Brookings Institution, the chief American negotiator in the last round of Israeli-Palestinian peace talks. His advice boils down to tough love and damage control. Give Netanyahu incentives to keep the door open to a two-state solution, even if he doesnt want one, Indyk said. During his reelection campaign, the prime minister said he would never agree to a Palestinian state. But once the election was over, he said he merely meant it was unsafe for Israel to agree to a state as long as Islamist terrorists are roaming the Arab world, Iran is funding extremists and the Palestinians tolerate the presence of Hamas. He sounded like the classic New Yorker cartoon about a lunch date: How about never  is never good for you?, Equally important, Indyk said, the U.S. should create clear disincentives for anything that would foreclose a two-state solution. A leading option: the threat of U.S. support for a United Nations resolution that would specify peace terms whether Israel agrees or not. The administration should judge the prime minister by his deeds  because it will be difficult, going forward, to rely upon his words, Indyk told me. What deeds? Netanyahu should release the Palestinian tax revenues it has seized and encourage Congress to continue funding the Palestinian Authority, as long as the Palestinians stop pursuing legal action against Israel in the International Criminal Court. On settlements, if Netanyahu really wants a two-state solution, he wont allow new settlement construction to go up beyond the Israeli security barrier. Hell also allow Palestinians to build in Area C, the roughly two-thirds of the West Bank where its prohibited. If Netanyahu acts in those positive ways, then Obama should  let Secretary of State Kerry try to relaunch negotiations, Indyk said. If not, then Obama will have no choice but to act to preserve the two-state solution through a U.N. Security Council resolution that lays out the principles of an agreement. Does a U.N. resolution matter that much? Bibi would do anything to avoid that, said David Makovsky, an Israel expert at the Washington Institute for Near East Policy. It opens the door to international sanctions against Israel in the future. Thats the direction the administration appears to be heading. Last week, White House and State Department spokesmen pointedly said that the United States is reconsidering whether it should support a U.N. resolution outlining the terms of an Israel-Palestine deal. On Obamas front burner, however, is protecting a nuclear deal with Iran  if his negotiators can get one. Administration officials expect that Netanyahu will denounce any achievable agreement with Tehran, just as he did in his speech to Congress earlier this month. And that could encourage congressional efforts to block or delay a deal. But Netanyahus intemperate campaign statements, followed by his retractions, has given the administration some room to maneuver. If the Israeli leader denounces a nuclear deal, you can expect U.S. officials to say, in effect, You cant believe a word that man says. Indeed, they already are pointing out that Netanyahu denounced an earlier, interim nuclear deal with Iran  one that other Israeli officials say turned out pretty well. Such tough talk suggests that the chill between Obama and Netanyahu will get worse before it gets better. One more factor presages a rough road ahead: the gathering presidential campaign. Republican candidates already are competing to demonstrate support for Netanyahu and opposition to Obama  to out-Bibi Bibi. (That leaves the leading Democratic candidate, Hillary Rodham Clinton, uncomfortably in the middle. Shes been studiously quiet, a luxury she wont be able to enjoy if she ever declares her candidacy.) Thats likely to intensify Obamas impulse to jab back. Were we talking about peace talks between Israel and the Palestinians? Maybe its time for peace talks between Israel and the United States, too. doyle.mcmanus@latimes.com, Twitter:@DoyleMcManus, Follow the Opinion section on Twitter @latimesopinionandFacebook]", "Date": "20150320", "Title": "[After Netanyahu's reelection, tough love and damage control by the U.S.]", "Link": "http://www.latimes.com/opinion/op-ed/la-oe-0322-mcmanus-netanyahu-israel-obama-20150322-column.html", "Author": "NULL"}