{"Content": "[Hillary Rodham Clinton will renew her focus this week on changing the countrys weak campaign finance laws to limit the influence of big donors, even as her supporters exploit those weaknesses to raise millions of dollars for her election effort. The Clinton campaign plans to release a video Tuesday that frames the candidates crusade against the dominance of corporate money in politics as personal. The two-minute production notes that the Supreme Courts decision to allow corporations and unions to pour unlimited amounts into independent political committees came in a case involving her. Citizens United, the conservative lobbying group at the center of the Supreme Court case, went to court to gain permission to pay for the broadcast of a movie attacking Clinton. It was called \"Hillary: The Movie.\", One of the things that people dont really realize is that Citizens United was actually started from a conservative organization that wanted to bring down Hillary Clintons candidacy, Kristin Schake, Clintons deputy communications director, says in the video. They didnt like who she is. They dont like what she stands for. TRAIL GUIDE: All the latest news on the 2016 presidential campaign >>, Still, Clinton is in an awkward position on campaign finance. She is calling for a reversal of the courts decision, vowing to nominate justices who would uphold limits on campaign spending. She has also said she would push for a constitutional amendment if the court will not bend. We have to end the flood of secret, unaccountable money that is distorting our elections, corrupting our political system, and drowning out the voices of too many everyday Americans,\" Clinton said in a statement. \"Our democracy should be about expanding the franchise, not charging an entrance fee.\", But the candidate herself is taking advantage of the openings the court created as well as the laxity of the Federal Election Commission to raise eye-popping amounts of cash. Clinton supporters say they have no choice. Unilateral disarmament, they often say, would only assure self-destruction. The candidates proposals for changing the system are unlikely to get much traction if Republicans maintain control of at least one house of Congress, as is widely expected. The GOP has shown no interest in rolling back Citizens United. Republican officials, led by Senate Majority Leader Mitch McConnell of Kentucky, argue that the high court was right when it held that the ability to spend money in support of a candidate is a key element of free speech, protected by the Constitutions 1st Amendment. NEWSLETTER:Get the days top headlines from Times Editor Davan Maharaj >>, Republicans also have little fondness for other items on Clintons campaign finance agenda, including a new system in which the federal government would match small campaign donations. Under that plan, contributions made by small donors would be matched up to an unspecified, modest amount. Candidates would only be eligible for such funds if they agree to new limits on the amount they receive from any individual donor. Clinton also is proposing new federal rules that would require publicly traded companies to disclose to shareholders any political contributions they make. The U.S. Chamber of Commerce has been urging companies to resist such disclosure amid several years of pressure from shareholder activists and academics. An annual report called theCPA-Zicklin Index of Corporate Political Disclosure and Accountability ranks companies for their transparency in disclosing political donations. The publicity around the report has pushed many firms to reform their practices. For more on the 2016 campaign, follow @evanhalper, ALSO, Would a presidential run by Joe Biden aim to knock Hillary Clinton out or serve as a standby?, Chants of Run, Joe, run as Biden marches in Labor Day parade, Obama orders paid sick leave for workers at federal contractors]", "Date": "20150907", "Title": "[Clinton to push for reducing the impact of big money in campaigns ]", "Link": "http://www.latimes.com/nation/politics/la-na-clinton-campaign-finance-20150907-story.html", "Author": "NULL"}