{"Content": "[A federal appeals court on Wednesday morning stayed the execution of a schizophrenic Texas man whose attorneys and supporters have argued is too mentally ill to legally be put to death. Scott Panetti, 56, was scheduled to be executed at 6 p.m. Central Time for murdering his wifes parents at their Central Texas home in 1992, a crime he confessed to at trial, where he wore a cowboy costume to court, subpoenaed the pope, Jesus, John F. Kennedy and more than 200 other witnesses. The three-judge panel ofthe U.S. 5th Circuit Court of Appeals in New Orleans that issued the order did not say how long the execution would be stayed or why, except to allow us to fully consider the late arriving and complex legal questions at issue, according to the filing. Panettis attorneys issued a statement saying they were grateful for the stay. \"Mr. Panettis illness, schizophrenia, was present for years prior to the crime, profoundly affected his trial, and appears to have worsened in recent years, attorneys Greg Wiercioch and Kathryn Kase said in a statement, adding, We believe that todays ruling is the first step in a process which will clearly demonstrate that Mr. Panetti is too severely mentally ill to be executed.\", Diagnosed with schizophrenia more than three decades ago, Panettis attorneys said he hears voices and suffers from delusions that prevent him from understanding why he is being executed as required by the 8th Amendment protection against cruel and unusual punishment. Prosecutors have disagreed, arguing that Panetti was competent to stand trial and be executed. They said his symptoms are less severe than he contends. Court-appointed state medical experts have repeatedly said they suspect Panetti faked or exaggerated symptoms of mental illness. The U.S. Supreme Court has attempted to clarify the criteria for executing the mentally ill. In 2007, they reviewed Panettis case and found inmates must be required to not only know that they are being punished, but to also have a \"rational understanding\" of why. Panettis attorneys also appealed to the state district court and the Texas Court of Criminal Appeals, requesting that they stay or delay his execution so his competency could be assessed. Both appeals were denied. Their appeal for clemency to the state Board of Pardons and Paroles was also denied, despite support from Texas legislators, former U.S. Rep. Ron Paul and former Texas Gov. Mark White and evangelicals. Other appeals were still pending Wednesday before Gov. Rick Perry and the U.S. Supreme Court. Spokeswomen for Perry and Texas Atty. Gen. and Gov.-elect Greg Abbott did not immediately respond to requests for comment Wednesday.]", "Date": "20141203", "Title": "[Federal appeals court stays execution of a schizophrenic Texas man]", "Link": "http://www.latimes.com/nation/la-na-nn-texas-execution-stayed-20141203-story.html", "Author": "[Molly Hennessy-Fiske]"}