{"Content": "[At his recent groundbreaking for the states high-speed train, Gov. Jerry Brown paused while extolling the project to laud the union workers who will build it. \"Youve got to put something in the ground,\" Brown said, riffing on what drives economic growth. \"Youve got to get these building trades men and women doing stuff. Thats what makes America  what makes the world  go round.\", If Brown has his way, the construction workers will soon be doing a lot of \"stuff.\" The governors final-term agenda is stacked with legacy-cementing projects, including the rail network, a replumbing of Californias waterworks and long-delayed repairs to state roads and bridges. Workers represented by the State Building and Construction Trades Council  an organization of 14 unionized trades including electricians, operating engineers and plumbers  are in prime position to benefit. \"The governors priorities are  enhanced by the fact that we have a strong trades movement,\" said former state Senate leader Darrell Steinberg (D-Sacramento). The workers \"have a sophisticated political force behind them.\", Touting their solidarity with others in the labor movement, the trades align themselves with public employee unions on legislation and political campaigns. But they also cultivate relationships with businesses that hire their members. They plow money into Democratic politics but court Republicans as well. The blue-collar workforce toils in oil refineries and solar fields, making the group a central player in the debate over the states energy future. The groups president, Robbie Hunter, says its unions are simply poised to gain from the end of a recession during which jobs disappeared and state projects piled up. \"The need is there, and the governor sees it,\" said Hunter, a crisply tailored ironworker with a suffer-no-fools Irish brogue. Unemployment surged as high as 60% for the groups 400,000 members during the economic crisis, Hunter said. Now, the job market is \"coming out of a coma.\", Theres work for his members in the $7.5-billion water bond approved by voters in November, mainly in water recycling projects and construction of dams and reservoirs. Therell be more work if Brown secures approval for his Sacramento-San Joaquin River Delta tunnels, a controversial $25-billion plan for sending water from Northern California to farmlands and cities farther south. The $68-billion bullet train project has been besieged by lawsuits, construction delays, uncertain funding and lackluster popular support. But the building trades have remained its most tenacious supporters, arm-twisting for key votes in the Capitol to move the project along and shelling out for billboards extolling high-speed rail, which will be built solely by union labor. \"Its a fantastic deal for them.... Youre not going to be able to get a job working on that unless you go through the union hiring hall,\" said Kevin Dayton, a public policy consultant who previously worked for Associated Builders and Contractors, a trade group for nonunion contractors. Last year, the governor breathed new financial life into the rail project by coupling it with another of his policy priorities: combating climate change. He persuaded the Legislature to designate to high-speed rail a quarter of the funds generated annually by state fees on polluters  more than half a billion dollars for the project by June 2016. The move also made the building trades an enthusiastic partner in Browns effort to reduce carbon emissions, which the labor group had previously backed, though much less forcefully. \"To get our support on that  [Brown] was pretty sharp,\" Hunter said. Now, as climate change policy dominates the Capitol, Hunters group has been a visible and gung-ho ally in the push for green energy. At the kick-off event for a package of climate bills by Sen. Kevin De Len (D-Los Angeles), Hunter was at the Senate leaders side, praising the plans emphasis on green jobs as hard-hatted workers stood behind him. Hunter takes pains to note that the governor \"says no to us, too.\" The group, seeking to maximize water infrastructure projects to build, pushed for a larger water bond measure than the one that appeared on the ballot, but lost that battle to the governors distaste for larger debt. Calls for a statewide school construction bond, which also would have meant jobs for the unions members, have so far been dismissed by Brown. The councils policy plays are bolstered by its campaign giving. It poured nearly $3 million into last years elections, including $1 million to Democratic Party committees and the maximum allowed to Browns reelection bid. In 2010, the group put $1.3 million into an independent effort supporting his run against Republican challenger Meg Whitman. The group has also given to Republican legislators and candidates, a rarity among labor unions. Many of the trades in the alliance also have their own lobbyists and political arms, amplifying their Capitol presence. That can lead to competing interests and turf wars; Hunter likened the consortium, which he has led since 2012, to a \"large Italian or Irish family.\", While elsewhere in the nation builder unions and environmentalists have clashed, most recently over the blocked Keystone XL pipeline, the California building trades forged an alliance with environmental groups around the states landmark environmental law, the California Environmental Quality Act. Still, the trades manage to maintain a relationship with business that, for a labor union, is uncommonly friendly. Rob Lapsley, president of the California Business Roundtable, invited Hunter to speak at his board meeting last year. And Lapsley praised the unions apprenticeship programs, which create more trained workers. \"They teach people a lifelong trade,\" he said. \"They take someone who may not be going to college and give them a skill set that is vital to Californias economy.\", Hunters trade spans his familys generations  a legacy evident in his Sacramento office. Behind his desk hangs a photo of John Quinn, his great-grandfather and a force in Belfasts labor history. Near the door is a photograph of Hunter himself, working on the then-unfinished Library Tower, a signature Los Angeles skyscraper. Recently, a new photo rested on the floor at the headquarters, waiting to be hung: the governor and first lady signing the bullet trains symbolic first beam, with Hunter, pen in hand, at their side. melanie.mason@latimes.comTwitter: @melmason]", "Date": "20150405", "Title": "[Trade workers set to benefit from Gov. Jerry Brown's project list]", "Link": "http://www.latimes.com/local/politics/la-me-pol-building-trades-20150405-story.html", "Author": "[Melanie Mason]"}