{"Content": "[President Obama returned from a tranquil vacation Sunday to stare down an end-of-the-year stretch that promises either to cement some of his biggest remaining goals  or hasten the arrival of dreaded irrelevance. Obama has talked often of his desire to finish the last two years of his presidency strongly, notching accomplishments until his last day in office in January 2017. In reality, the congressional and political calendars give him a narrower time frame to act, before the distractionsand pressures of the 2016 election encroach on Washington. To that end, hes packed his post-vacation schedule with trips and invited high-wattage guests to the White House to draw attention to a top-level priority, his fight on climate change  starting with a jaunt next week to Alaska, where hell become the first sitting U.S. president to visit the states Arctic region and meet with hunters and fishermen whose livelihoods are threatened by global warming. Then hell welcome both Pope Francis and Chinese President Xi Jinping to Washington in quick succession, with climate change likely on the agenda for both meetings. And all along hell be battling Congress over government spending and his landmark nuclear deal with Iran. A major Pacific trade agreement is yet to be finalized, as are other legacy-building issues for Obama, including a potential plan to close the prison at Guantanamo Bay. But the president heads into these fights seemingly ready for battle. The August congressional recess that has in past yearsleft this White House on defense heading into the fall instead came and went with little controversy, and Obama aides see a chance to build momentum into the election year. The president himself challenged the Republican-led Congress this weekend to do its part for the economy and resolve a number of issues including a new spending package that must be passed by the end of September. Americans expect Congress to help keep our country strong and growing  not threaten to shut down our government, Obama saidin his weekly address. When Congress gets back, they should prevent a shutdown, pass a responsible budget, and prove that this is a country that looks forward  a country that invests in our future and keeps our economy growing for all Americans. Obama returned to Washington on Sunday after two weeks on Marthas Vineyard. Hours later, he hits the road again to build support for his climate agenda. On Monday in Las Vegas, hell tout his administrations newly unveiled Clean Power Plan, which aims to reduce carbon emissions at U.S. power plants by 32% by 2030 while ramping up production from renewable sources like wind and solar. A week later he will tour the rapidly melting glaciers of the Alaskan Arctic. Responding to the threat of climate change was among the most prominent pledges of Obamas second inaugural address, when he said that failure to do so would betray our children and future generations. The administration has invested considerable attention toward ensuring that world powers can announce a sweeping and binding agreement to reduce emissions at the United Nations climate summit in Paris that begins in late November. Obama is likely to attend as the summit nears conclusion in December. Climate will also be on the agenda when Pope Francis and Xi come to the White House in succession in late September. Francis forceful advocacy on the issue, including an encyclical published this summer in which he warned that our contemporary lifestyle, unsustainable as it is, can only precipitate catastrophes, has been cited by the administration and other advocates in pressing their case. To the extent Obama has succeeded in realizing his legacy-building goals in the lastyear, it has been, as in the case of climate, through full useof executive powers. The prospects for success are less certain when he must rely on congressional cooperation  particularly as he seeks to reverse steep spending cuts ahead of a Sept. 30 deadline to fund government operations. The White House also plans to push Congress on a new infrastructure package, and try to advance criminal justice reform and cybersecurity legislation. Though Obama has sought to preemptively pin the blame for another fiscal impasse on Republicans, Don Stewart, a spokesman for Senate Majority Leader Mitch McConnell (R-Ky.), said the White House and congressional Democrats have clogged up the process demanding more spending. The most likely outcome, Stewart said, was a stopgap measure that maintains current spending levels on a short-term basis. Thats not a win, Stewart said. But a senior White House official argued that the administrations position on spending could be strengthened by the Republican divisions and the desire of GOP leaders to avoid another shutdown just as the presidential campaign is gearing up. Republicans in Congress have their work cut out for them, the official said on the condition of anonymity to preview Obamas fall agenda. At the same time, President Obama will not let up. The White House feels more confident after the recess about the fate of Obamas Iran nuclear agreement. The House and Senate are expected to immediately take up debate over a resolution to reject the accord. But despite heavy spendingby the accords opponents, and the high-profile defection of the Senate Democrats leader-in-waiting, Chuck Schumer, the administration sees enough support remaining to ultimately defeat the legislative attempt to halt the deals implementation. Obama continued to lobby key members of his party from his island retreat, including a four-page letter sent to another New York Democrat, Rep. Jerrold Nadler, that helped bring the lawmaker on board. But Stewart, the Senate spokesman, argued the outcome should hardly be considered a success for the Iran deal. Hes going to have bipartisan opposition  on the vote and the override. Hes hoping to keep one third of one house of Congress, he said. Thats momentum?, For more White House coverage, follow@mikememoli]", "Date": "20150823", "Title": "[Obama returns from vacation with a full agenda but a ticking clock]", "Link": "http://www.latimes.com/nation/politics/la-na-obama-agenda-20150823-story.html", "Author": "[Michael A. Memoli]"}