{"Content": "[ The nations struggle to grow stems from corporate executives pumping up the value of their own stock rather than taking initiatives to grow the companies they run, renowned investment manager Jeremy Grantham told a Chicago audience Wednesday evening. Speaking at the Morningstar Investment Conference, Grantham  the British-born co-founder and chief investment strategist of investment firm GMO  said the economy cant pick up traction without publicly traded companies investing in new production facilities and equipment. Instead, they are simply inflating their companys stock  and their own stock options. And theyre borrowing money to do it. \"Its a high price to pay to make senior officers rich,\" he said. \"It is a real drag on the economic growth.\", Grantham blames the Federal Reserve for providing the incentive for this kind of corporate behavior. Because the Fed is keeping interest rates artificially low, companies can borrow money to buy back their shares at very low rates. And since buybacks tend to make stock prices rise, its an easy way to keep shareholders happy, he said. Its less risky than taking a chance on building a new plant. Corporate capital spending, known as \"capex,\" is essential to the economys growth. \"The trouble with low capex,\" Grantham said, is that it \"lowers the growth rate, and pretty soon you have no demand.\", Companies that depend on other companies to buy their products dont have the customers they need, and their profits suffer. They curtail their spending too. It becomes a vicious circle. As one company holds back, other companies do the same. Grantham noted that the Federal Reserve seems content to see stock prices rising while failing to grasp the link between low interest rates and stunted economic growth. He said the Fed keeps predicting stronger growth that is yet to happen. As buybacks help inflate stock prices, Grantham said, the stock market is nearing a bubble. He is renowned as one of the outspoken few who spotted the 2000 stock market bubble before it burst, taking the stock market down 49 percent. Even though the current stock market is expensive and vulnerable, it has not reached the level of 2000, when it was priced at 35 times corporate earnings. Prices now are about 21.5 times earnings, which is far pricier than the 16 times norm, but not as dangerous as 2000, when the stock market plunged and left investors scarred for a decade. \"When you get crazy prices, it takes a crazy amount of time to correct it,\" he said. Investing in this environment is difficult because bonds are also greatly overvalued. As an investment manager, Grantham must invest his clients money somewhere. Because of the Federal Reserves massive stimulus, he said, stocks throughout the world are more expensive, although emerging market stocks are the least overpriced. Eventually, inflated prices on stocks and bonds will have to correct downward, and Grantham anticipates losses in both over the next seven years. How soon will that correction come? Grantham warned his audience of investment advisers: It could come after the 2016 presidential election. gmarksjarvis@tribpub.com, Twitter @gailmarksjarvis]", "Date": "20150625", "Author": "[ Gail MarksJarvis]", "Link": "http://www.chicagotribune.com/business/yourmoney/ct-marksjarvis-jeremy-grantham-morningstar-0626-biz-20150625-column.html", "Title": "[ Jeremy Grantham: Fed is pumping the economy's bubble. Will it pop?]"}