{"Content": "[ The problem with most civil rights movements is that they dont pay very well. Thats about to change, thanks to billionaire industrialist Charles Kochs weekend proclamation that the causes he and his network of uber-wealthy conservative political donors embrace are akin to \"past successful freedom movements.\", \"Look at the American revolution, the anti-slavery movement, the womens suffrage movement, the civil rights movement,\" Koch said. \"All of these struck a moral chord with the American people. They all sought to overcome an injustice. And we, too, are seeking to right injustices that are holding our country back.\", The injustices in need of righting include the minimum wage (get rid of it), environmental regulations (get rid of them), solar power (ick!), womens reproductive rights (they dont need those) and corporate taxes (booooo!). Charles and his brother David Koch allowed some reporters to attend the usually secretive weekend forum hosted by Freedom Partners Chamber of Commerce, the funding arm of the brothers political network, under the agreement that none of the 450 rich attendees would be identified without their consent. I was not one of the journalists invited, which is a shame, because I enjoy Southern California luxury resorts, \"sumptuous\" buffets and outdoor chandeliers dangling from metal poles. I also feel that wealthy people have a God-given right to make themselves wealthier under the guise of helping the non-wealthy (#RichLivesMatter) and I can be made to feel even more strongly about that for $1 million. (Koch Bros. shoot me a note at rhuppke@tribpub.com and Ill give you my PayPal account info.), \"First off,\" Scott Walker proclaimed, \"we took on the unions, and we won. We won!\", Taking on the unions is usually first off for Walker, the Wisconsin governor and Republican presidential candidate. It is the very rationale for his candidacy. And on Thursday, he took a detour from the campaign... \"First off,\" Scott Walker proclaimed, \"we took on the unions, and we won. We won!\", Taking on the unions is usually first off for Walker, the Wisconsin governor and Republican presidential candidate. It is the very rationale for his candidacy. And on Thursday, he took a detour from the campaign... According to a report by Politico, Charles Koch \"called on the assembled business leaders to reject corporate welfare, which, he said, is creating a two-tier society by creating a permanent underclass, crippling our economy and corrupting the business community  present company excepted, of course. \", Yes, present company excepted, except that, according to Good Jobs First, a group that promotes corporate and government accountability in economic development, Koch Industries has received $190 million in government subsidies since 1990. \"If we cannot unite the majority of Americans behind the vision, then were done for,\" Koch said, according to a Washington Post report. \"So that to me has to be our number-one objective. But to do so, weve got to do a much better job of understanding what matters most to people, and then to demonstrate that a free society gives them the best opportunity of achieving that.\", Its a simple process, really. Imagine this conversation between a person who can afford to buy an island and \"a poor.\" (Poor is defined as anyone who cannot afford to donate at least $100,000 to a Koch-backed group and receive an invitation to a forum like the one held  last weekend. I, for example, am a poor.), It took Ted Cruz three months to raise $10 million for his campaign for president, a springtime sprint of $1,000-per-plate dinners, hundreds of handshakes and a stream of emails asking supporters to chip in a few bucks. One check, from one donor, topped those results. New York hedge fund magnate... It took Ted Cruz three months to raise $10 million for his campaign for president, a springtime sprint of $1,000-per-plate dinners, hundreds of handshakes and a stream of emails asking supporters to chip in a few bucks. One check, from one donor, topped those results. New York hedge fund magnate... Island Buyer: \"What is it thats important to you, poor?\", Poor: \"I would like to work and see my career advance and have health care and be able to take care of my family.\", Island Buyer: \"OK, the best way to do that is to cut government regulations, lower corporate taxes and convince people that solar power causes cancer.\", Poor: \"Cool! Thanks!\", Island Buyer: \"Sure thing. Im going to go buy more islands.\", That exchange exemplifies the most important tool in this particular civil rights battle: lying. In  April of 2014, the fact-checking group PolitiFact ran a report on Americans for Prosperity, the Koch brothers main political group: \"While Americans for Prosperity has weighed in on a variety of issues throughout the years, its most frequent targets are President Barack Obamas health care law and environmental and energy regulations. Considering the Koch brothers holdings and stated positions, thats no surprise.  In 13 fact checks, Americans for Prosperity has never received higher than a Half True from the PolitiFact national team. The majority of their claims have registered as False or Mostly False.\", The arc of the moral universe is long, but it bends toward whatever extremely wealthy people want it to bend toward. Sen. Ted Cruz, who joined several other GOP presidential candidates at the weekend event, lured by the Koch brothers plan to spend close to $1 billion on political activity and issue promotion in the lead-up to the 2016 election, clearly felt for the struggles the extravagantly wealthy and bravely anonymous are forced to endure. \"The men and women in this room spilled gallons of blood and spent your fortunes retaking the Senate,\" Cruz said, presumably referring to blood lost from paper cuts while counting out crisp $100 bills. He also flatly denied that global warming is occurring, criticized new environmental regulations proposed by the Obama administration and, I imagine, presented a paper about the positive impact coughing can have on people who live near power plants. Another GOP candidate in attendance was Carly Fiorina. According to Politico, she was asked whether theres too much money in politics. That question came just one day after an Associated Press analysis of federal fundraising reports found that a mere 60 donors \"accounted for about a third of the more than $380 million brought in so far for the 2016 presidential election.\", \"I think its honestly the wrong question,\" Fiorina said. \"Whats too much; whats not enough? We have a right, everyone has a right, to speech in this country, and, as we all know, any kind of speech costs money in this country.\", Shes right. Free speech is free, except that it costs money. Corporations are people and people are corporations and oil companies can talk and facts are negotiable if the price is right. Why do we poor people have such a hard time understanding that? Why do we keep discriminating against wealthy people who just want the government to leave them alone so they can make ever-growing piles of money, piles that will inspire other Americans to lift themselves up by their bootstraps, assuming the aforementioned money piles can be seen through the smog-laden skies and that the bootstraps havent already been eaten for dinner?, Rich lives matter. Its time we all embraced the most unappreciated civil rights issue of our time. And Ill do just that, as soon as the Koch brothers deposit that $1 million in my PayPal account. rhuppke@tribpub.com]", "Date": "20150803", "Author": "[ Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-koch-brothers-forum-huppke-20150803-story.html", "Title": "[  Koch brothers' new mantra: #RichLivesMatter ]"}