{"Content": "[ Never underestimate the appeal of a politician who always overestimates himself. You may think real estate mogul and former reality TV star Donald Trump is a buffoon, a racist clown, a charlatan or just a dope  a cartoon ugly American come to life whose campaign for president is an exercise in vanity aimed at boosting his long-term business interests. I may think some of these things too. But after seeing him up close Monday for an hour during his interview with the Tribune Editorial Board, I also think hes going to be a significant factor in the upcoming Republican primary battle. Because he has swagger. Because he has money. Because hes well-educated. Because he gives voice to a common suspicion about traditional politicians. (\"The country is run by a group of people who dont know what theyre doing,\" he said.) And because he promises simple solutions to our most complicated problems. Those solutions, to sum them up, amount to getting tough and making deals. Chicagos crime problem? \"Youre not going to stop it by being nice. Youre going to stop it by being one tough son of a bitch,\" he said. \"You cant be so gentle with these people.\", ISIS? \"Blast the hell out of\" the oil production facilities that fund them. Jihad over. Containing the Iranian nuclear threat? \"I would double up the sanctions, triple up the sanctions, get them to the table.\" And if that didnt bring the mullahs to heel, Trump said hed take unspecified \"very drastic\" measures. Donald Trump visited the Tribune Editorial Boardon Monday, and his voice has been rattling around in my brain ever since. Hes a disarming conversationalist with one noticeable tic: Almost any topic becomes an opportunity for him to reference his own talents and accomplishments. Many of these... Donald Trump visited the Tribune Editorial Boardon Monday, and his voice has been rattling around in my brain ever since. Hes a disarming conversationalist with one noticeable tic: Almost any topic becomes an opportunity for him to reference his own talents and accomplishments. Many of these... Health coverage for the poor? Forget Obamacare. Allow health insurance companies to sell across state lines and then just \"work a deal with the hospitals\" to treat those who cant afford medical treatment, he said  though at greater length and with more serene self-assuredness than words on a screen can convey. Whos not drawn to a candidate with utter confidence? Who doesnt secretly believe or at least hope that there are easy, perhaps painless solutions to most of our problems, solutions that the self-interested glad-handers of the entrenched political classes are cynically ignoring?, And who doesnt admire iconoclasts, even wrong-headed ones, who arent afraid to wander off script, challenge conventional wisdom and butcher a few sacred cows along the way?, Think of Ross Perot, the freewheeling billionaire who, as an independent, novice presidential candidate, whose theme song was \"Crazy,\" led in the polls as late as June 1992, and wound up with 19 percent of the vote that November. Donald Trump meets with the Tribune Editorial Board, then makes a luncheon address at the City Club of Chicago on June 29, 2015. Trump addressed a wide range of topics, from gun violence to political worthiness. Demonstrators across from his speaking engagement had their say, too. Think of businessman Herman Cain, whose catchy but nutty \"9-9-9\" tax plan briefly put him on top in the Republican presidential primary horse race four years ago. Or think of any of the other candidates in races great and small who have gained at least temporary traction with voters by touting vague, fantasy proposals and preposterous notions that violate the rules of mathematics and the lessons of experience. In politics, simple sells. And Trump is a consummate salesman. I dont see him as a fearless truth-teller. I see him as a populist demagogue. But plenty of frustrated Americans will see him as a fearless truth-teller  a man bold enough to continue challenging the authenticity of President Barack Obamas birth certificate long after the nondemented had let the matter go; a man daring enough to violate party politesse by savaging, not just critiquing, his primary opponents; a man brave enough to risk offending Hispanic voters by stereotyping Mexican immigrants living in the country illegally; a man gutsy enough to all but endorse more police brutality at a time when, in many troubled communities, relations with law enforcement are fraying. Hes mad as hell, and hes not going to take it anymore. \"I can make the country great again,\" he said. \"I would take back our jobs. I would take back our manufacturing. I would take back things that nobodys even talking about.\", OK then!, With fortune, celebrity and shamelessness generating wind at his back, Trump will be in the top tier of Republican presidential hopefuls in at least the early caucus and primary states. And with his unfiltered rhetorical style, hell be a compellingly provocative and disruptive force in debates. I doubt hell end up as the nominee. Many GOP voters who are initially jazzed by his controversial, cocksure pronouncements will likely come to see them as a liability in the general election. But until then, the joke will be on those who dont take Donald Trumps presidential aspirations seriously. Post comments: www.chicagotribune.com/zorn. Twitter @EricZorn]", "Date": "20150630", "Author": "[ Eric Zorn]", "Link": "http://www.chicagotribune.com/news/opinion/zorn/ct-donald-trump-republicans-primary-perpect-0701-20150630-column.html", "Title": "[ Donald Trump? Seriously? Yes, seriously]"}