{"Content": "[ The Cog Hill and Gleneagles golf courses are at the center of a bitter land dispute between Palos Park and Lemont. Palos Park is intent on annexing those properties along with the historic Ludwig farm and the Mid-Iron driving range (all in unincorporated Cook County) and has the landowners complete support. At issue are an estimated 1,500 to 2,000 acres that could eventually be developed for residential or commercial use. But Lemont officials contend that all that land has been in its long-range development plan for years, that the annexation would physically divide Lemont and that only the intervention of Cook County government would allow Palos Park to legally annex the sites. Palos Park wants to obtain a piece of Cook County Forest Preserve District property near the Mid-Iron driving range, 126th Street and Bell Road, that Mayor John Mahoney contends would meet a requirement that a municipality be contiguous to property it annexes. Palos Park is surrounded by forest preserve district property. Mahoney said one-sixth of the districts land surrounds the small village. In exchange for taking the small portion of district land, Palos Park would provide Lake Michigan water free of charge to a forest preserve district police station nearby, Mahoney said, and would relinquish zoning rights back to the forest preserve district because the village has not intent to develop the land. Gov. Bruce Rauner has signed legislation that will give property tax breaks to disabled veterans and allow their families to make their homes handicapped accessible without fear of an immediate boost to their property values, which could cause their property taxes to increase. Veterans eager to... Gov. Bruce Rauner has signed legislation that will give property tax breaks to disabled veterans and allow their families to make their homes handicapped accessible without fear of an immediate boost to their property values, which could cause their property taxes to increase. Veterans eager to... However, according to at least one of the landowners involved, the village would place water lines on the forest preserve district land to connect the annexed properties to Palos Parks water system. Lemont Mayor Brian Reaves has written a letter to Cook County Board President Toni Preckwinkle and county commissioners, asking them not to annex the forest preserve land to Palos Park and remain neutral in the dispute. \"A cursory review of any map showing the boundaries of the municipalities in question will clearly show that Lemont is not only closer to this property but more readily available to service this territory,\" Reaves says in the letter. \"This annexation, if approved, would serve as a corridor for Palos Park to annex further into Lemont Township. That annexation would cause significant waste of taxpayers resources as well as require duplicate services to an area already served by the Village of Lemont, Lemont Park District and Lemont Library District.\", Three vacant and decrepit commercial buildings in Tinley Park  whose owners have been charged with nearly $150,000 in unpaid fines  will soon by going away. Village trustees on Tuesday night approved proceeding with tearing down the buildings, which include a vacant Clark gas station on Oak Park... Three vacant and decrepit commercial buildings in Tinley Park  whose owners have been charged with nearly $150,000 in unpaid fines  will soon by going away. Village trustees on Tuesday night approved proceeding with tearing down the buildings, which include a vacant Clark gas station on Oak Park... The Forest Preserve District Board (which is the same as the County Board) is scheduled to consider the annexation request next month, but a spokeswoman told me it would likely be referred to a committee for review. However, Sean Morrison, the new county commissioner for the 17th District, which includes Lemont and Palos Park, told me he has decided to support the Palos Park request. Morrison, who lives in Palos Park, said he has talked to all the interested parties, including the mayors and the landowners, and decided \"the case made by the landowners for annexation into Palos Park was compelling, in my view.\", Reaves said he met with Preckwinkle and Morrison, and that Preckwinkle indicated it was her policy to defer to the commissioner representing the communities involved in such matters and Morrison made it clear he favored the annexation. \"You have to understand what Palos Park is trying to do here,\" Reaves said. \"They have no contiguous land to any of these properties. By annexing that small forest preserve parcel, that would connect them to Mid-Iron and thats when the dominoes begin to fall. \"Through that they connect to Cog Hill and Gleneagles and the Ludwig farm. Without the forest preserve annexation, none of the dominoes fall.\", All of the parties seem to agree that the dispute goes back several years, beginning with the Ludwig farm, on 131st Street west of Bell Road. Reaves said Howard Ludwig came to Lemont with a plan to develop the property with \"very high density residential housing\" and it was rejected. \"We have very strict development standards and are very proud of how our community has controlled development, and he wasnt willing to accept them,\" Reaves said. Mike McNulty, a spokesman for the McNulty family that owns Gleneagles Country Club, 13070 McCarthy Road, has a different version of events. \"Howie Ludwig had been a community leader in Lemont for years and went to them with a plan, and they just turned him down flat,\" McNulty said. \"They were very rude. The mayor is very arrogant. \"And Howie came to the rest of us  Cog Hill, Gleneagles and Mid-Iron  and suggested annexing to Palos Park. That was around 2010 or 2011. Weve all been discussing this ever since. Its been in the planning stages a long time. \"Let me make one thing clear, there is no dispute over the land. It is a done deal. We all want to annex to Palos Park, weve signed the paperwork and Palos Park wants us. We would never, ever consider annexing to Lemont. \"For one thing, we dont trust the government officials there. When youve been lied to nine times, you dont go back to see if they will tell you the truth the 10th time. For another thing, Palos Park can give us access to Lake Michigan water. \"Lemont has well water. We dont want well water. Access to Lake Michigan water increases the value of our properties and would make them much easier to develop in the future.\", McNulty emphasized that his family has no plans to turn Gleneagles into anything but a golf course for \"at least the next 25 years.\" He said his wife, brother and children continue to be involved in the business and will be for the foreseeable future. Reaves said the landowners may have had difficulties with prior administrations, \"but since I have been mayor we have gone out of our way to cooperate with them. We want to annex their properties into our municipality if they are willing and would be content to have them remain unincorporated if they are not. \"But what you have here are properties owned by families that have been there a long, long time, and they want to do things their way. Palos Park will allow them to develop those properties however they want. We wont do that.\", Katherine Jemsek, the president of Cog Hill Golf and Country Club, 12294 Archer Ave. said her family chose Palos Park because of the lake water. Jemsek is the granddaughter of the legendary Joe Jemsek, who helped the club gain national recognition by attracting the Western Open and later the PGA Tours BMW Championship to its Dubsdread course. She said lake water would allow Cog Hill to make improvements that would not be possible with well water. Mahoney told me he is convinced that the Jemseks only priority is expanding and improving Cog Hill, but when I asked Jemsek if her family owned other land within the area targeted for annexation, she said, \"I would prefer not to comment.\", Mahoney said he had no estimate of the costs to Palos Park to annex the properties, but that the villages goal is to become known as the best place in the Chicago region for recreation. \"Were surrounded by the forest preserves and adding the Cog Hill and Gleneagles golf courses, which have such great reputations, would certainly improve that reputation,\" the mayor said. McNulty denied the statements by Mahoney and Reaves that Palos Park needs the forest preserve district property to annex the private properties. \"For the purposes of annexation, forest preserve land is viewed as if it doesnt exist,\" McNulty said. \"You just go from where a municipalitys borders end, skip over the forest preserve land to the next street or property. Palos Park is contiguous to our land, it just needs the forest preserve property to run the water lines through to our properties.\", Reaves said Lemont will \"keep all our options open\" if the Forest Preserve District Board approves the annexation agreement and will continue to oppose it. Lemont will present its plan of action to residents at a Village Board meeting Monday night, he said. pkadner@tribpub.com]", "Date": "20150821", "Author": "[ Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-lemont-palos-st-0823-20150821-story.html", "Title": "[ Cog Hill, Gleneagles at center of land dispute]"}