{"Content": "[ Treat the states crushing pension debt like a home mortgage and refinance it. Offer public workers a deal to cut pension bills. Fire them all. Let the dust settle on pensions and do nothing to change them. Raise more tax revenue  big time. Even as it clouds the states financial climate, Illinois pension crisis is spawning a cottage industry of sorts when it comes to promoting new, rehashed and even off-the-wall proposals to address it. And that activity has ramped up in the days since the state Supreme Court issued a landmark ruling clarifying some of the dos and donts of hacking away at Illinois worst-in-the-nation pension debt, now closing in on $105 billion. In short, the unanimous ruling told state leaders to stop acting like deadbeats and get serious about paying up on pension bills that they have been avoiding in fits and starts for a century. The decision is also having a spillover effect on Chicago, trapped in a parallel pension quagmire, which in the wake of the court action saw much of its debt downgraded to junk bond status by a major credit rating agency. The objective may be clear, but how to reach it without breaking the bank and siphoning significant resources away from schools, social services and other public programs is quite literally the multibillion-dollar question. Overhanging it all is a fierce battle colored by politics and ideology over who should wear the jacket for the states pension problems and resulting financial plight. Republican Gov. Bruce Rauner, a vocal critic of labor unions, said after the court decision that he would press ahead with a proposal to slash pension benefits for future work performed by veteran employees. But on Thursday, Rauner acknowledged for the first time that he had his own doubts about his plan passing constitutional muster. Gov. Bruce Rauner on Thursday admitted hes not sure his plan to cut government worker pension costs is legal and suggested legislators may need to pass a bunch of laws to see what sticks. Rauner also indicated hes \"taken a number of things off the table\"  though hes \"not ready\" yet to say which... Gov. Bruce Rauner on Thursday admitted hes not sure his plan to cut government worker pension costs is legal and suggested legislators may need to pass a bunch of laws to see what sticks. Rauner also indicated hes \"taken a number of things off the table\"  though hes \"not ready\" yet to say which... He said he will work with lawmakers to \"pursue several options simultaneously and see which ones end up flying and working, which ones not.\", Rauners idea is a nonstarter with Democrats who control the General Assembly. Such an action, they argue, would fly in the face of specific language in the high court ruling insulating from any cuts the retirement benefits promised a public worker from the first day on the job. One Democratic counter to Rauner is being floated by Senate President John Cullerton of Chicago. It is essentially a reworking of a plan that passed the Senate in 2013 but got left on the cutting room floor in negotiations that led to a more ambitious pension overhaul signed into law by then-Gov. Pat Quinn. It was that law that the court struck down May 8. Cullertons proposal also is aimed at reducing the scope and overall cost of pension benefits, but in a way the justices signaled they may be amenable to, he argues. It applies a Mary Poppins-like approach to pension reform, adding a spoonful of sugar to make the medicine go down. Each of the four Illinois public retirement systems is in deep financial trouble. In essence, Cullerton would give employees a choice in how, and if, future pay raises would be applied to the calculation of their retirement benefits. One option offers bigger annual cost-of-living raises for pensions while the other dangles the prospect of pension checks that are initially larger but have less generous inflation adjustments. A very different solution for the pension dilemma is being promoted by the Center for Tax and Budget Accountability, a nonpartisan Chicago-based fiscal group backed by unions. The group is proposing that the state re-amortize its entire pension debt, an action bearing similarities to the refinancing of a home loan. Under that plan, the state would scrap its current 50-year schedule aimed at restoring badly underfunded pension systems for teachers, university employees, state workers, judges and lawmakers to fiscal health. Ralph Martire, executive director of the center, said the repayment schedule launched in 1995 under then Republican Gov. Jim Edgar was poorly designed, deliberately backloaded costs and allowed the pension debt to dramatically grow from $17 billion at the time. \"The law had nothing to do with actuarial science,\" Martire said. \"What they did was fool everyone.\", The center would substitute a new repayment schedule that it says would put the pension systems on the path to being about 75 percent funded by 2045 and 100 percent funded by 2056. In laymans terms, it would impose something akin to a fixed rate mortgage to replace a variable rate mortgage with continuously escalating costs. The states pension bill next year is estimated at $7.6 billion, and Martire concedes that one downside of his proposal is that it would likely increase that cost by several hundred million dollars for a few years. After that, however, he says the lines cross, and his flat-rate plan becomes more affordable than the current payment schedule. Significant tax hikes also could be on the table in Springfield as an adjunct to any pension fix, though there is little so far in the way of consensus on their shape, size and political viability. In its pension opinion, the Supreme Court chastised lawmakers  and by inference Rauner  for aggravating fiscal problems and adding to pension chaos by embracing a recent rollback in the state income tax rate that costs $4 billion annually. Restoration of at least some of that tax rate cut is one of the revenue-generating ideas being gingerly floated by lawmakers. Other potential big-ticket items include a broadening of the state sales tax to include an array of consumer services, and at least partially doing away with a costly break that insulates retirement income from taxes. While the court ruling has clearly stoked anxiety in Springfield, there is also a school of thought that says inaction on pensions may be the most prudent path to follow, according to Charles N. Wheeler III, a University of Illinois at Springfield journalism professor whose specialty is analyzing state budgets. The logic, Wheeler explained, involves the peculiarities of the pension payment plan set out under Edgar in 1995. That schedule pegged annual pension costs to a set percentage of the state payroll and  while undeniably expensive  have by that measure largely peaked, he said. \"Because we are essentially at the height of the ramp, payments will no longer be growing by billions a year and will gradually consume a smaller slice of revenues,\" Wheeler said. Whats more, Wheeler added, demographic realities and the natural turnover of the workforce also will work to hold down pension costs. The state in reality has two pension regimens, a very expensive one that covers benefits for veteran workers and a far cheaper one for workers hired since 2011. \"Ultimately all the people who make up the bulk of the money we owe will be gone,\" he said. A radically different take on resolving the states pension headaches comes from an official of the Illinois Policy Institute, a conservative advocacy group that has Rauners ear and received significant financial support from him before he became governor. That scenario foresees an end run around the ban on pension cuts proclaimed by the court by having Rauner fire all state workers and then offer to rehire them with cheaper retirement benefits. One potential flaw in the argument is that the vast bulk of public workers covered by state pensions are local schoolteachers, state university employees, court workers and employees of other state elected officials over whom Rauner has no authority. It also raises the question of what would happen if some workers were fired and left work, said Ann Lousin, a constitutional law expert at John Marshall Law School in Chicago. \"I have a small nightmare: Every single one of the states prison guards walks off the job after they are fired,\" Lousin said. \"That would be interesting.\", rsecter@tribpub.com]", "Date": "20150516", "Author": "[ Bob Secter]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-illinois-pension-options-met-0515-20150516-story.html", "Title": "[ Brainstorming on pension fix abounds after Illinois high court rejected law ]"}