{"Content": "[ Republican presidential candidate Donald Trump met on Monday with the Tribune Editorial Board. Here are six points he made. 1. I will be honest. I think you have to take care of your crime situation. Im talking as an outsider but who has a big stake in Chicago. So maybe I can see it even better than you can, because sometimes you have to be an outsider to see it. Its all over the world that Chicagos like the crime capital of the world. I read that somebody said  it just stuck with me  that Chicago is more dangerous than Afghanistan. Thats a hell of a quote. Now, I dont know if it is. But when you look at all these kids being killed on a daily basis, it hurts Chicago very badly. What would I do about it? Id be so tough. You maybe have to go after stop-and-frisk stuff. These are not babies. These are tough, tough kids. Youve got to stop it. Youre not going to stop it by being nice. 2. I dont know Bruce (Rauner) but I do respect Rahm. I gave him a contribution because his brother is a great friend of mine  Ari, king of Hollywood. I love Ari. And Ari asked me to give him a contribution. I like Rahm very much. 3. Im in second place and not far behind (Jeb) Bush, who I think is a person that doesnt have what it takes to be a great president. I dont think he has the strength or the stamina. I dont think he has the aptitude to be a great president. And I think its just going to be more of the same. With that being said, hes a nice person. Im not sure that matters this time because people are so tired of incompetent that I think this is going to be an election based on competence more than anything. 4. I think it is tough, what happened to (Rod Blagojevich). I dont know him well, other than he was on \"The Apprentice,\" because he was a semi-celebrity who was good. Actually, it was good having him on. I found him to be a very nice guy. Not sophisticated. Had a little knowledge of computers and things. What he did is what politicians do all the time. They make deals. Ill do this, and Ill do that. Ive gotta be taken care of in some way. I havent heard the name since he left \"The Apprentice.\" I thought it was a really tough sentence for what he did. Frankly, when I read about him, he just sounds stupid more than anything else. I mean, how stupid can you be?, If Donald Trump were writing this column, it would be the finest newspaper column in the history of journalism. Anyone who thought otherwise would be a dope and a loser and would know nothing about column writing. The piece would be amazing  period  and it would probably win a Pulitzer. If it... If Donald Trump were writing this column, it would be the finest newspaper column in the history of journalism. Anyone who thought otherwise would be a dope and a loser and would know nothing about column writing. The piece would be amazing  period  and it would probably win a Pulitzer. If it... 5. I would double up the sanctions (on Iran), triple up the sanctions, get them to the table. It almost looks like were begging to make a deal. The United States looks like a total beggar. A bad deal is worse than no deal by a factor of 10. They talk about global warming is our biggest threat. The global warming we have to worry about is nuclear warming. Thats the global warming. You have a lot of mad men out there. We cant let Iran have a weapon. 6. (I admire) my father, who passed away. I loved Ronald Reagan. I worked with Ronald Reagan. I was a young guy, and he knew me and he liked me. I really think that he had something special. He had an ability to make you feel good about the country. I have great respect for Barack Obama, because when you think of his life and when you think of what hes done, its something I respect. The thing Im most disappointed about  I mean we disagree on policy  I thought hed be a great cheerleader for the country. I thought that he would be somebody that would really unite people. I think (Angela) Merkel in Germany, shes done an amazing job. Shes really the leader. As a woman, shes done a fantastic job in Germany, keeping it all together. Their economy is going great; theyre doing very well. Shes a great representative for women. Presidential candidate Donald Trump believes that Hillary Rodham Clintons email controversy is far worse than the conviction of former Illinois Gov.Rod Blagojevich. Presidential candidate Donald Trump believes that Hillary Rodham Clintons email controversy is far worse than the conviction of former Illinois Gov.Rod Blagojevich. Click hereto watchDonald Trumps full interview in front of the Tribune Editorial Board.]", "Date": "20150629", "Author": "[ Tribune Opinion Staff]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-rahm-emanuel-isis-blagojevich-perspec-0630-20150629-story.html", "Title": "[ Donald Trump unfiltered: 6 points he made during his Tribune visit]"}