{"Content": "[ The former home of a prominent gay rights activist on Chicagos North Side has been designated a National Historic Landmark. The Henry Gerber House in the Old Town Triangle neighborhood on Friday became only the second LGBT-related property in the country to receive the recognition. The iconic Stonewall Inn in New York City is the other building listed primarily for its impact in LGBT history, according to the U.S. Department of the Interior. The tribute comes in the midst of Lesbian, Gay, Bisexual and Transgender Pride Month, celebrated every year in June. Carrie Barnett, board president of the Gerber/Hart Library and Archives, said the spotlight on Gerber and his home helps to fill in the historical narrative of the gay rights movement. The library in Chicagos Rogers Park neighborhood is named for Gerber and Pearl M. Hart, an attorney who also fought for the rights of gays and lesbians. \"We know how important it is for people who come after us to know our stories and know what was going on then,\" Barnett said. \"Were just excited that more people can learn about Henry Gerber, imagine how it was to live then, and how lucky we are to live now.\", Gerber, originally from Germany, came to the United States in 1913. He became interested in gay rights while stationed in Germany with the U.S. Army in the 1920s and learned about the gay liberation movement in his native country, according to the Gerber/Hart Library and Archives. Not long after moving to Chicago and working for the post office, Gerber founded the Society for Human Rights in 1924, listing his residence at 1710 N. Crilly Court as its headquarters. Its members held lectures there and published a newsletter, Friendship and Freedom, in hopes of influencing the discourse about LGBT people. But the institution proved short-lived, according to the library. Underscoring the hostile sentiments toward homosexuality at the time, police raided the apartment of a society member after his wife reported the mans involvement. Police then raided Gerbers apartment and confiscated all materials dealing with his organization and the typewriter he used to produce his publications. The group disbanded in July 1925, less than eight months after incorporation. Gerber was brought to trial three times before a judge finally dismissed the charges. He then was fired from the postal service and moved to New York to resume serving in the Army. Gerber continued advocating for gay rights. He died in 1972, about a decade after Illinois struck down anti-sodomy laws. The Gerber House is constructed primarily of brick and masonry in the Queen Anne style of Victorian architecture, according to the landmark status application with the National Park Service. It was built as a two-story, single-family home in 1885, then converted into a rooming house after World War I, when Gerber resided there, according to the National Park Service. It since has reverted back into a single-family home containing nine rooms. Few structural changes have been made to the home throughout its 130-year history, despite the development and changing characteristics of the surrounding neighborhood. The city of Chicago listed it as a local landmark  in 2001. \"Given the often hidden and erased nature of gay and lesbian history, and the frequent difficulty of finding even basic documents pertaining to such history, it is doubly fortunate that this house has remained so well preserved,\" the landmark application states. The recognition of the Gerber House is part of an effort by the Interior Department to document a more complete story of the gay rights movement. Interior Secretary Sally Jewell announced the initiative in May 2014. cdrhodes@tribpub.com, Twitter @rhodes_dawn]", "Date": "20150619", "Author": "[ Dawn Rhodes]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-henry-gerber-house-national-landmark-20150619-story.html", "Title": "[ Henry Gerber House named as National Historic Landmark]"}