{"Content": "[ Mitsubishi Motors will stop making vehicles at its Normal, Ill. plant and will try to sell the facility, only a few years after the state tried to rescue the plant from closing. Mitsubishi is the sixth-biggest employer in the Bloomington-Normal area, with 1,280 full-time employees, according to the website for the Bloomington-Normal Economic Development Council. \"Following a review of Mitsubishi Motor Corporations global supply chain, we have been informed it is necessary to end production and seek a strategic buyer for the Normal plant,\" spokesman Alex Fedorak said in a statement Friday. The companys board will \"make a formal decision in the near future,\" he said, adding that Mitsubishis \"focus right now is to identify a buyer who would continue to operate and maintain employment  the best potential outcome for our employees and the community.\", The carmaker is ending production in the U.S. to focus on Asian markets, said a Japanese business newspaper, the Nikkei. Jim Schultz, director of the Illinois Department of Commerce and Economic Opportunity, said he was \"saddened\" to \"see a company as large and pivotal as Mitsubishi close their doors in Illinois.\", \"We will be taking the necessary steps on the ground to help with job training and placement for the workers,\" he said. \"We desperately need to improve the business climate here in Illinois.\", The Normal economic development board, Normals mayor, and union representatives couldnt be reached for comment Friday. Fiat Chrysler has decided to recall about 1.4 million cars and trucks in the U.S. after two hackers were able to take control of a Jeep over the Internet. The company will update software to insulate the vehicles from being remotely controlled. It also says in a statement that unauthorized remote... Fiat Chrysler has decided to recall about 1.4 million cars and trucks in the U.S. after two hackers were able to take control of a Jeep over the Internet. The company will update software to insulate the vehicles from being remotely controlled. It also says in a statement that unauthorized remote... Kyle Young, vice president of United Automobile, Aerospace and Agricultural Implement Workers of America Local 2488, which represents the plants workers, told Reuters on Thursday that the unions contract expires in August. \"We havent heard anything,\" he said. \"Were supposed to have negotiations coming up\" on a new contract. In the meantime, \"Its business as usual here.\", According to the locals website, it has nearly 1,000 active members employed at Mitsubishi Motors North America and about 600 retirees who are members. The locals website said the plant makes the Outlander Sport SUV. Ryan Gremore, general manager of OBrien Mitsubishi of Normal, told the Tribune on Friday that dealers know nothing beyond what has been reported in the Japanese media. \"People with the answers are deciding not to comment,\" he said. \"Were staying the course until then.\", Fedorak, the Mitsubishi spokesman, said the North American market remains a priority for Mitsubishi Motors. \"We will continue to sell Mitsubishi cars, including current and planned models, at Mitsubishi dealerships across the United States,\" he said. Red Frog Events, known for staging fun events from an equally lively workplace, has laid off a significant portion of its staff, the company said Tuesday. The Chicago-based event production company  founded in 2007 by Joe Reynolds, who is co-CEO with Ryan Kunkel  developed the Warrior Dash obstacle... Red Frog Events, known for staging fun events from an equally lively workplace, has laid off a significant portion of its staff, the company said Tuesday. The Chicago-based event production company  founded in 2007 by Joe Reynolds, who is co-CEO with Ryan Kunkel  developed the Warrior Dash obstacle... In January 2012, Mitsubishi Motors North America delivered six new electric vehicles to the town of Normal and its mayor, Chris Koos. Gremore, the Mitsubishi dealer, was among the speakers at the event. Mitsubishi is closing its plant despite years of local and state economic subsidies. The automakers decision is ammunition to tax-incentive critics who say subsidies cant prevent a plant from leaving. The plant opened in 1988, lured by $249 million in state and local subsidies. It was originally a joint venture between Mitsubishi Motors and Chrysler. Production began with sport coupes, but soon a second shift and four-door sedans were added. In the 1990s, Mitsubishi bought the 50 percent of the operation that it didnt already own from Chrysler. Annual production at the factory has fallen to 64,000 vehicles from more than 200,000 in 2002. The company sold only 82,000 vehicles in the U.S. last year, less than 1 percent of the total market. Staffing levels once reached 4,000. The plant has faced uncertain times before. In July 2004, according to Mitsubishis website, it went to one shift from two at the Normal plant and laid off 1,200 of 3,150 employees working there. In 2003, Mitsubishi had contributed about $320 million to the local economy in taxes, salaries and benefits, the company said on its website. About four years ago, after years of declining sales, Mitsubishi announced it would phase out production by 2014. In response, the state pledged nearly $30 million in tax incentives over 10 years. In exchange, the automaker pledged to invest $45 million to produce the Outlander Sport crossover and retain 1,200 jobs. The state has since doled out tax credit certificates, similar to a voucher, worth about $7.2 million and hundreds of thousands of dollars in training funds. Asked Friday if the state would recoup the incentives, the states Department of Commerce and Economic Opportunity said it would be \"premature\" to comment. On its website, Mitsubishi characterized the Normal facility as \"one of the most technologically advanced automotive manufacturing facilities in the world.\", Nikkei said Mitsubishi would be the first major Japanese automaker to end production in both the U.S. and Europe. The company has built a plant in Thailand, bought one from Ford in the Philippines and is building one in Indonesia. The Normal plant is the only Japanese-owned U.S. auto factory whose hourly workers are represented by the UAW, Reuters said. The Associated Press contributed. byerak@tribpub.com, acancino@tribpub.com, Twitter @beckyyerak, Twitter @writeralejandra]", "Date": "20150724", "Author": "[ Becky Yerak, Alejandra  Cancino]", "Link": "http://www.chicagotribune.com/business/ct-mitsubishi-normal-0725-biz-20150724-story.html", "Title": "[ Mitsubishi closing Normal plant in Illinois, ending U.S. production]"}