{"Content": "[ Seven years after losing her son to gun violence, Brenda Hale scanned the crowd before her Saturday with blank eyes and an expressionless face. She then held up a thick, cream-colored piece of paper. It was a signed letter from President Barack Obama, written in reply to a poem Hale wrote and sent to him. The poem, addressed to her sons shooter, captured her heartache. The last stanza read, \"Though I cannot find you, I want you to see; You took more than my son, you took part of me.\", Hale read aloud the presidents response. \"I am deeply saddened to hear about your loss and the pain you have experienced,\" she read. \"Our most fundamental right to life, and the pursuit of happiness, are at a stake when we lose a loved one taken from a bullet.\", A similar distress throbbed through the meeting room in the University of Illinois at Chicagos Student Center, as many of the nearly 100 residents Hale addressed also had lost loved ones to gun violence in Chicagos South and West side neighborhoods. They had gathered Saturday morning to weigh in on Cook County Commissioner Richard Boykins recently unveiled seven-point plan to stop gun violence and put a stop to what he referred to as \"domestic terrorism.\", To help present the plan, Boykin gathered a panel of aldermen, a sociology professor, a former Latin Kings gang member, a Chicago police official, a church elder and other community leaders to discuss the plans strengths and weaknesses. If only Mayor Rahm Emanuel responded to every homicide on the streets of Chicago with the same urgency and concern he showed in using his Hollywood contacts to reach a movie director with his complaints about a movie title he dislikes. Its been reported that Mayor Emanuel expressed displeasure... If only Mayor Rahm Emanuel responded to every homicide on the streets of Chicago with the same urgency and concern he showed in using his Hollywood contacts to reach a movie director with his complaints about a movie title he dislikes. Its been reported that Mayor Emanuel expressed displeasure... About 1,100 people have been shot in Chicago since Jan. 1, according to a Chicago Tribune database. \"This is one of the most urgent problems confronting our city and our country,\" Boykin said. \"Its a matter of life and death. You cant mention pensions if there arent any people.\", The seven points outlined in Boykins plan include: Creating parenting workshops throughout Chicago and Cook County; strictly enforcing curfew laws; expanding drug courts; charging co-conspirators and those responsible for the shootings; deploying the sheriffs police in high-crime city areas; instituting stiffer penalties for people illegally in possession of firearms; and providing job training for areas with high levels of violence, unemployment and poverty. Boykin said he doesnt have a cost estimate for his plan, but said some of the points, such as curfew enforcement, are already being funded. Many panelists agreed that proper parenting was an appropriate first step toward curbing gun violence, and believed that single parents in poor communities struggled to raise their kids while working to make minimum wage. Chicago police Deputy Chief Eric Washington suggested some teenagers may stay out past curfew to avoid possible neglect, abuse or drug use by their parents. An empty chair in the third row, adorned with a lavender cloth, purple ribbon and fresh flowers, marked the spot where Hadiya Pendleton would have sat at her high school graduation Tuesday night. The chair was one of the ways former classmates acknowledged the slain 15-year-old honors student at... An empty chair in the third row, adorned with a lavender cloth, purple ribbon and fresh flowers, marked the spot where Hadiya Pendleton would have sat at her high school graduation Tuesday night. The chair was one of the ways former classmates acknowledged the slain 15-year-old honors student at... \"As a parent, you should know where your kids are and when,\" he said. \"Theres some reason these kids arent going home.\", Panelists discussed different ways to effectively execute parenting workshops. Troy Harden, a sociology professor at Chicago State University, said the target parents would likely not go out of their way to attend a parenting workshop and advice should be brought \"to the streets,\" or directly to them. Ald. Willie Cochran, 20th, mentioned the disconnect between a positive educational atmosphere in schools and a detrimental home environment, and the necessity of enforcing a nurturing atmosphere in childrens homes. While residents and panelists seemed to agree with the plans emphasis on parenting and curfews, some in attendance disliked the plans focus on the concept of \"domestic terrorism,\" and the labeling of young gang members as \"terrorists.\", Panelist Clifton McFowler, a case manager for BUILD Chicago and a convicted felon who spent time in prison, said he works regularly with troubled kids. He said he believed the main solution to solving gun violence was providing job training and opportunities for young adults in poor neighborhoods. \"I dont see terrorists in them,\" he said. \"I see them as kids who need guidance and support. I take offense when you call these kids, my kids, terrorists.\", Other residents, like Milton Johnson, thought the seven-point plan should incorporate mental health treatment. \"When I look around, I know the person pulling the trigger is not of good mental health,\" he said. Boykin seemed to take note of residents concerns, but believed his seven-point plan to be holistic and comprehensive. For the few residents who believed his plan lacked a sense of urgency or immediate action, Boykin posed to them the question, \"If you dont support the plan, well, whats your plan?\", meltagouri@tribpub.com, Twitter @marwaeltagouri]", "Date": "20150613", "Author": "[ Marwa Eltagouri]", "Link": "http://www.chicagotribune.com/news/ct-chicago-gun-violence-summit-seven-point-plan-met-20150613-story.html", "Title": "[ Victims, community leaders discuss Boykin 7-point plan to end gun violence]"}