{"Content": "[ Did you hear the one about the comedian who could be Guatemalas next president? Dont laugh. Disgusted by a growing corruption scandal that forced their last president to resign, voters might not be kidding about electing a clown. Jimmy Morales, a former television comic, won the first round of voting Sept. 6. Its not clear who came in second. The other name on Octobers runoff ballot will be either businessman Manuel Baldizon, who ran and lost in 2011, or Sandra Torres, a former first lady. Guatemalas congress voted to strip President Otto Perez Molina of executive immunity so he could be prosecuted for allegedly taking bribes from importers who were allowed to avoid tariffs. His former vice president was forced out in May and also is awaiting trial. Guatemalas attorney general spent the summer charging dozens of public officials with corruption, aided by an investigative commission backed by the United Nations. Every Saturday night since April, protesters have swarmed the central plaza in Guatemala City, demanding Perez Molinas resignation. He was a short-timer anyway  the current term ends at the end of this year, and the constitution bars him from running again  but Guatemalans wanted him gone now. An Aug. 27 strike involving schools, businesses and unions in 140 cities drove that point home. Instead of the rumored voter strike, Septembers election saw a record 70 percent turnout. Its Guatemalan Spring. Nearly 20 years after the end of a decadeslong civil war, Guatemalans have lost patience with the pace of progress. Poverty and violent crime remain high. The drug trade flourishes. The people are tired of criminality at the highest levels of government and tired of the candidates  like Perez Molina  who promised to put an end to it. Since 2007, the International Commission Against Impunity in Guatemala  its Spanish acronym is CICIG  has been working alongside the countrys prosecutors to root out institutional corruption. The organization was created by agreement between Guatemala and the U.N. and is funded by other nations, including the U.S. Its been so successful at identifying and removing rogue officials that politicians talked about letting it sunset at the end of the year (Guatemalas legislature has to reauthorize it every two years). Guatemalans arent going to stand for that now that they know about the customs fraud scheme. Perez Molina and his underlings are accused of siphoning $300,000 a month from Guatemalas treasury. So yeah, why not vote for the comedian?, \"He may not be prepared to be president  but thats what we need!\" one Morales supporter told The Wall Street Journal. \"Someone new who doesnt know how this corrupt political system works.\", If only it were that easy. Morales campaign slogan  \"Not corrupt, not a thief\"  doesnt offer much real information about how he would govern, if elected. We hope Guatemalans new focus on accountability will encourage them to get to know all the candidates well before the next round of voting. Thats not to say we dont see where theyre coming from. Guatemalans are so disgusted with their government that theyre flirting with a candidate whose main qualification is that he has no experience. That sounds familiar. Public officials trading favors for personal gain? That part sounds familiar, too. So does the part about so-called reformers who turn out to be self-dealing insiders. Do dead people vote in Guatemala? Early and often?, We know what its like to be the punch line in all those jokes about corrupt public officials. Were laughing with you, Guatemala, not at you.]", "Date": "20150914", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-guatemala-election-comedian-edit-0914-20150911-story.html", "Title": "[ No joke: Guatemalans vote for comic for president]"}