{"Content": "[ Hi guys (and gal!),, I thought it was time we chatted. Ive been enormously impressed with the way many of you have attempted to handle Donald Trump, who is proving to be an unnervingly resilient force in this nascent Republican primary. I imagine you must be thinking: How can this arrogant, fact-agnostic, insult-hurling bar-stool bloviator be doing so well? Youve been reluctant to cross him, but no amount of ignoring will spare you from one day being called a \"dummy\" or an \"idiot\" by The Donald. So best to get it over with. Some of you have tried to point out that Trump doesnt seem all that conservative. Calling into question the heroism of our captured POWs, voting for and supporting Democrats, once even saying he thought the economy does better under Democrats  all compelling if you could jolt Trump supporters out of their love-drunk stupors long enough to care. It almost doesnt matter what he says  they are enamored of the way he says it. Lindsey, it must have been galling to be the subject of Trumps cellphone stunt. After 22 years in local and state politics, used to the rules- and etiquette-obsessed Congress, you must have let out a South Carolinian \"Well, I never!\" when he gave out your phone number. Great job making light of it later. Your \"How to destroy your cellphone video\" responded with the appropriate amount of dignity. Many people are wondering how Donald Trump, for all his excesses and eccentricities, could be doing so well in the presidential primary polls. The answer to that mystery may be found right here in Illinois, where voters elected a low-rent Trump doppelganger as governor not once but twice. The parallels... Many people are wondering how Donald Trump, for all his excesses and eccentricities, could be doing so well in the presidential primary polls. The answer to that mystery may be found right here in Illinois, where voters elected a low-rent Trump doppelganger as governor not once but twice. The parallels... Marco, your recent attempt at sidelining Trump was pretty creative, comparing him to Obama and calling them both classless. It doesnt seem as though \"class\" is something Trumps supporters are all that interested in, however. They seem to like that he sounds like a guy they know from down at the bar. Youre going to have to aim lower. Trump has become an embarrassing distraction for all of you. (Well, not you, Ted. You seem to find him adorable!) But hes also distracted voters from the awkward contortions Hillary Clinton is trying to make with progressives. With no end in sight, Trump could be around for a very long time. He even recently hinted he could run as an independent if Republicans try to marginalize him. The medias no help, because few attempt to ask Trump anything substantive, instead preferring to fixate on his outbursts for days, and then asking the rest of you to spend days responding to them. With questions like \"Would you go to a gay wedding?\" and \"Should Donald Trump apologize to John McCain?\" you must feel like all those years studying politics were a waste of time. Donald Trump criticized a reporter from the Spanish-language channel Telemundo for a question on immigration while speaking at a press confernece in Texas. July 23, 2015. (AP), Donald Trump criticized a reporter from the Spanish-language channel Telemundo for a question on immigration while speaking at a press confernece in Texas. July 23, 2015. (AP), Whenever someone does try to pin him down on policies  to his great credit, CNN host Anderson Cooper tried repeatedly in an interview recently for CNN  Trump is vague or punts completely. So what to do? You cant live like this forever, and all a Trump nomination means is another Clinton is in the White House. Its time for a new tack. Attacking him on style is pointless. Style is exactly what people like. What his supporters need to see is that theres no substance there. Knowing a guy in China isnt a foreign policy. Building a giant wall isnt a solution to a broken immigration system  its a 5-year-olds response. Bombing Iraqi oil fields sounds fun but does nothing to drive the Islamic State out of Syria, say. Voters may love Donald Trumps straight talk (which is a sad reflection of just how little affection they have for you all), but in the end they also want a commander in chief who knows some stuff. So I propose that whenever you are asked a substantive question about income inequality, immigration or terrorism, for example, instead of thoughtfully answering as you normally would, respond with, \"What would Donald do?\" Until reporters and voters force Trump to lay out an actual agenda, answering tough questions about real policies, why should you be held to a different standard?, And except to say, \"What would Donald do?\" I would also refuse to answer any questions related to Trump. He doesnt speak for you and you certainly shouldnt have to speak for him. All that happens when you weigh in, even if to criticize Trump, is that the whole of the party looks somehow responsible for him. And it shouldnt be. Youve put up with Trumps antics and the medias complicity long enough. Time to put your feet down and refuse to play his games. Sincerely,, S.E. Cupp, #WhatWouldDonaldDo?, Tribune Content Agency, S.E. Cupp is a Washington-based CNN contributor and author of \"Losing Our Religion.\", thesecupp.com]", "Date": "20150727", "Author": "[ S.E. Cupp]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-trump-lindsey-marco-cruz-perspec-0727-20150724-story.html", "Title": "[ How to solve your Trump problem: An open letter to the GOP candidates]"}