{"Content": "[ Jeb Bush has a legacy problem. Its name is George. Two presidents named George Bush, to be exact. The problem is that Jeb focuses attention on the wrong relative, his brother, President George W. Why not his father, President George H.W.? Isnt he the one with the more appealing legacy?, The former Florida governor, once considered the favorite to win the Republican presidential nomination but now stalled in polls after lackluster campaign performances, has declared that hes his own man. Fair enough. Yet his family comes up on the campaign trail, of course, and when it does the subject is usually his brother, the 43rd president. That turns the conversation to George W.s ill-fated 2003 Iraq war. Bad memories are fresh. Its a loser. By contrast, Jebs dad, the 41st president, left office almost a quarter century ago and looks pretty good today. The elder Bush also went to war with Iraq, but succeeded. The alliance he forged worked. Mission accomplished, he got out. He brilliantly managed the end of the Cold War and left a few notable domestic achievements. Thats not usually what Jeb talks about. He wont break with his brother and cant shake loose of his unpopular policies. When asked whether the 2003 invasion of Iraq was justified, hes struggled to give a clear answer. Last week Jeb blamed todays problems in Iraq on President Barack Obama. In an Aug. 11 speech at the Ronald Reagan Presidential Library in California, he hailed the Bush 43 record, particularly the brilliant and heroic 2007 troop surge that quelled sectarian violence for a time. In Jebs telling, the surge stabilized Iraq until 2009, when Obama pulled out American forces and paved the way for the spread of Islamic State. Never mind that it was Bush 43 who negotiated the American withdrawal. While you might think the Iraq war would be the last thing Jeb Bush would want to talk about, given the fact that his brothers war was probably the single greatest foreign policy catastrophe in U.S. history, and that Jeb Bush himself spent weeks trying to figure out whether he should say it was... While you might think the Iraq war would be the last thing Jeb Bush would want to talk about, given the fact that his brothers war was probably the single greatest foreign policy catastrophe in U.S. history, and that Jeb Bush himself spent weeks trying to figure out whether he should say it was... Subsequently, Jeb proclaimed that taking out Saddam Hussein turned out to be a pretty good deal. Hussein was a despot who ruled by vicious terror. Taking him out cost about 4,500 American lives and, conservatively, something like $1 trillion. University of Washington researchers, working with Baghdad officials, estimated last year that more than 460,000 Iraqis died in the war. Iran has more leverage in the region as a result of it. In 2006, William F. Buckley Jr. the godfather of contemporary conservatism, declared of Bush 43: Mr. Bush is in the hands of a fortune that will be unremitting on the point of Iraq. If hed invented the Bill of Rights, it wouldnt get him out of his jam. By contrast, when Hussein invaded Kuwait in 1990, Bush 41 assembled the largest global coalition since World War II, dispatched over half a million troops, and drove the Iraqis out in a quick war that was largely financed by others. He didnt occupy Iraq, anticipating the costs. Continuing to campaign in New Hampshire Thursday, GOP presidential candidate Jeb Bush appeared to go after rival Donald Trump another day, saying leadership is not about \"how great you are, how rich you are,\" its about connecting with people. Aug. 20, 2015. (AP), Continuing to campaign in New Hampshire Thursday, GOP presidential candidate Jeb Bush appeared to go after rival Donald Trump another day, saying leadership is not about \"how great you are, how rich you are,\" its about connecting with people. Aug. 20, 2015. (AP), Even on the domestic front, Bush 41 looks more successful. The candidates brother enacted huge tax cuts that contributed to spiraling deficits. His main domestic achievement, prescription drug coverage for seniors, was unfunded. George H.W. Bushs domestic triumph was the Americans with Disabilities Act, now 25 years old, among the most significant civil rights achievements since the 1960s. To be sure, Bush 41 also agreed to tax increases as part of the 1990 budget deal. Supply-side economic conservatives still assail him for it. Even though some economists say the tax hike was a step toward the good times and balanced budgets of the 1990s, embracing those increases carries real risks when it comes to todays Republican primary voters. But political strategy cant explain Jebs reluctance to model himself more on his father. Tactically it would make sense for Jeb to move smartly away from his brother. Embracing his dad might help consolidate support from the Republican Partys establishment wing, which he needs to dominate to win the nomination. So what is the explanation? Maybe its family psychology. Maybe its old-fashioned fraternal loyalty. Either way, its a legacy problem. Bloomberg, Albert Hunt is a Bloomberg columnist.]", "Date": "20150820", "Author": "[ Albert Hunt]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-jeb-bush-george-bush-iraq-war-20150820-story.html", "Title": "[ Jeb Bush is hugging the wrong President George]"}