{"Content": "[ The Islamic State group claimed responsibility Tuesday for the assault on a Texas cartoon contest that featured images of the Prophet Muhammad, but counterterrorism experts said IS has a history of asserting involvement in attacks in which it had no operational role. That suggests the two gunmen could have carried out their own lone wolf-style strike before they were shot and killed at the scene of Sundays shooting in the Dallas suburb of Garland. Federal officials identified the pair as Elton Simpson and Nadir Soofi, both Americans who lived in Phoenix. Rep. Michael McCaul, chairman of the House Homeland Security Committee, said a Twitter account linked to Simpson included images of Anwar al-Awlaki, an American-born radical cleric killed in a CIA drone strike in Yemen. Among the hashtags used by the account was \"#texasattack.\" And one of the final tweets was: \"May Allah accept us as mujahideen,\" or holy warriors. \"Was he on the radar? Sure he was,\" McCaul said from Turkey, where he was leading a congressional delegation. \"The FBI has got a pretty good program to monitor public social media.\", But McCaul said he is not ready to say law enforcement missed any red flags. The evidence does not indicate the attack was directed by the Islamic State group \"but rather inspired by them,\" said McCaul, who was briefed on the investigation by federal law enforcement officials. \"This is the textbook case of what were most concerned about.\", The Islamic State group on May 5, 2015,claimed responsibility for the shooting at a Texas cartoon contest featuring images of the Muslim Prophet Muhammad. The Islamic State group on May 5, 2015,claimed responsibility for the shooting at a Texas cartoon contest featuring images of the Muslim Prophet Muhammad. The Islamic State group on May 5, 2015,claimed responsibility for the shooting at a Texas cartoon contest featuring images of the Muslim Prophet Muhammad. The Islamic State group on May 5, 2015,claimed responsibility for the shooting at a Texas cartoon contest featuring images of the Muslim Prophet Muhammad. The grandmother of Dallas shooter Nadir Soofi says her grandson showed no prior signs of violence or extremism prior to Sundays shooting at a cartoon contest. (Associated Press), The grandmother of Dallas shooter Nadir Soofi says her grandson showed no prior signs of violence or extremism prior to Sundays shooting at a cartoon contest. (Associated Press), The White House said on Tuesday that it was still \"too early to tell\" if the two gunmen killed in Garland, Texas, on Sunday were tied to Islamic State. (Reuters), The White House said on Tuesday that it was still \"too early to tell\" if the two gunmen killed in Garland, Texas, on Sunday were tied to Islamic State. (Reuters), Two gunmen attacked a contest for cartoons depicting the Muslim Prophet Muhammad on May 3, 2015. Garland police officers returned fire and killed both gunmen. (Associated Press), Two gunmen attacked a contest for cartoons depicting the Muslim Prophet Muhammad on May 3, 2015. Garland police officers returned fire and killed both gunmen. (Associated Press), The nations largest muslim advocacy group spoke out against Sundays attack on a provocative contest for cartoons depicting the Prophet Muhammad. (May 4), The nations largest muslim advocacy group spoke out against Sundays attack on a provocative contest for cartoons depicting the Prophet Muhammad. (May 4), A federal law enforcement official told The Associated Press that authorities had an open investigation into Simpson at the time of the shooting. The official, who was not authorized to discuss the ongoing investigation by name and spoke on condition of anonymity, also said investigators will be studying the contacts the men had prior to the shooting, both with associates in the U.S. and abroad, to determine any additional terror-related ties. White House press secretary Josh Earnest said U.S. officials are working to counter terrorist efforts to use social media to radicalize individuals in the United States. IS recently urged those in the United States, Europe and Australia who cannot safely travel to fight in Syria and Iraq to carry out jihad in the countries where they live. An audio statement on the extremist groups Al Bayan radio station called the men \"two soldiers of the caliphate.\", The shooting appeared to be another example of a \"do-it-yourself\" jihadist whose plots are often hard for law enforcement and intelligence agencies to stop, said Mitchell Silber, an executive managing director for K2 Intelligence and former director of intelligence analysis for the New York City police department. Since 2006, the FBI had been investigating Elton Simpson  one of the men suspected in the Texas shootings outside a contest featuring cartoons of the Muslim Prophet Muhammad. Agents recorded the young man from Phoenix talking about fighting nonbelievers for Allah. About plans to travel to South... Since 2006, the FBI had been investigating Elton Simpson  one of the men suspected in the Texas shootings outside a contest featuring cartoons of the Muslim Prophet Muhammad. Agents recorded the young man from Phoenix talking about fighting nonbelievers for Allah. About plans to travel to South... \"Its very tough to detect in advance, which means we are and will continue to be susceptible to lone actors who dont give us much warning to thwart them,\" he said. The cartoon contest had been expected to draw outrage from the Muslim community. According to mainstream Islamic tradition, any physical depiction of the Prophet Muhammad  even a respectful one  is considered blasphemous, and drawings similar to those featured at the Texas event have sparked violence around the world. The 31-year-old Simpson and 34-year-old Soofi were wearing body armor, and one of the men shot a security officer in the leg before a single Garland police officer fired on the two gunmen. After his initial shots, nearby SWAT officers also fired, authorities said. The security officer was treated at a hospital and released. Simpson was arrested in 2010 after being the focus of a four-year terror investigation. But despite amassing more than 1,500 hours of recorded conversations, including Simpsons discussions about fighting nonbelievers for Allah and plans to link up with \"brothers\" in Somalia, the government prosecuted him on only one minor charge  lying to a federal agent. He was sentenced to three years of probation and ordered to pay $600 in fines and court fees. A University of Utah spokeswoman confirmed Tuesday that Soofi was an undergraduate pre-medicine major enrolled from fall of 1998 to the summer of 2003. Spokeswoman Maria OMara said Soofi did not earn a degree. Utah court records show Soofi had several brushes with police during his time in the state. He pleaded guilty to possession of alcohol by a minor, alcohol-related reckless driving and driving on a suspended license in 2001, court records show, and misdemeanor assault the following year. Simpson had worshipped at the Islamic Community Center of Phoenix for about a decade, but he quit showing up over the past two or three months, the president of the mosque told The Associated Press. The centers president, Usama Shami, said Simpson would play basketball with mosque members and was involved with the community. Soofi owned a nearby pizza business and would stop in to pray occasionally, he said. \"They didnt show any signs of radicalization,\" Shami said. Sharon Soofi, the mother of Soofi, told The Dallas Morning News that her son may have somehow snapped. \"The hard thing is to comprehend is why he would do this and leave an 8-year-old son behind,\" said his mother, who now lives in a small town southwest of Houston. In a statement released late Monday by Phoenix law firm Osborn Maledon, Simpsons family said it is \"struggling to understand\" what happened. \"We are sure many people in this country are curious to know if we had any idea of Eltons plans,\" the statement said. \"To that we say, without question, we did not.\", Terrorism expert Ben Venzke, who has been tracking terrorist groups for two decades, said jihadists have shifted their tactics to include not only major targets  like al-Qaidas attack on the World Trade Center  but also small ones that are more easily accessible. In December, for instance, Man Monis, an Iranian-born, self-styled cleric with a long criminal history, took 18 people hostage inside a Sydney cafe, forced them to hold up a flag bearing the Islamic declaration of faith and demanded he be delivered a flag of the Islamic State group. Monis and two hostages were killed. Associated Press]", "Date": "20150505", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-islamic-state-claims-responsibility-for-texas-attack-20150505-story.html", "Title": "[ Doubts raised about Islamic State's claim in Texas attack]"}