{"Content": "[ The Islamic State doesnt appear ready to follow our lead, so dont expect it to release its report on the morality of severing American heads any time soon. Though they call themselves a state, theyre actually a mob of terrorists in Iraq and Syria. And when theyre not severing the heads of Westerners and Syrian soldiers and putting the hideous acts on video, theyre raping women or shooting Christians and others and pushing them into ditches. But apparently they dont feel guilt, not the way American politicians feel it in Washington. Or at least the Democrats on the Senate Select Committee on Intelligence feel guilty enough to have released a report condemning the CIA for torturing suspects in the aftermath of the Sept. 11, 2001, terrorist attacks that killed thousands of Americans. Im certainly not advocating torture. Its cruel, its brutalizing  not only to the victims, obviously, but it also brutalizes the culture that supports such acts. But it might be useful to realize that while we might feel queasy about what we did, the Islamic State is immune from hand-wringing after they cut American throats. The recent murder of Peter Kassig, an American, was particularly brutal. Kidnapped, held hostage for months, he converted to Islam. Later, his head was cut from his body in an act broadcast last month on video. President Barack Obama called it an act of \"pure evil.\", I dont know how many of you have watched those videos. I havent. Ive seen one, years ago, the beheading of Wall Street Journal reporter Daniel Pearl, and that was enough. A friend whod spent time in the special forces told me it was important to watch it, in order to fully comprehend the cruelty of al-Qaida. He was right. There are ways to talk about such things and maintain distance. But seeing it is another matter. There is nothing abstract about the knife and the throat. Muslims in Indiana held a funeral service on Friday for Abdul- Rahman Kassig, formerly known as Peter, who was beheaded by Islamic State militants in Syria after being held captive for a year. Kassig adopted Islam while he was a hostage. His family said he made a sincere conversion in a process... Muslims in Indiana held a funeral service on Friday for Abdul- Rahman Kassig, formerly known as Peter, who was beheaded by Islamic State militants in Syria after being held captive for a year. Kassig adopted Islam while he was a hostage. His family said he made a sincere conversion in a process... Pearl had been kidnapped in Pakistan and decapitated by al-Qaida. We watched the video, and I still remember that sound. It was years ago, but that sound I cant shake. So Ive never watched anything like that again. But the Islamic State isnt squeamish about such things. The United Nations says the group is responsible for the deaths of more than 9,000 people. And still no internal report from them discussing the morality of cutting off the heads of those they consider the enemy. Yet we feel guilt, plenty of it, and spread it with shovels this week in Washington, and spread it some more, with plenty of hand-wringing and finger-pointing. Democrats in the Senate Select Committee on Intelligence released their report  six years in the making  which details CIA torture of suspects in the aftermath of the 9-11 terrorist attacks in the U.S. when thousands were killed in just hours in New York, Washington and a field in Pennsylvania. Sen. Dianne Feinstein, D-Calif. the outgoing committee chair, acknowledged in releasing the report that intelligence officials had been given a mandate by former Republican President George W. Bush to find those responsible. But she was also unequivocal in her condemnation of the intelligence service. The Senate Intelligence Committee released a 499-page executive summary Tuesday, which includes graphic details about sexual threats and other harsh interrogation techniques the CIA meted out to captured militants in the years after the Sept. 11, 2001, attacks on the United States. The report also... The Senate Intelligence Committee released a 499-page executive summary Tuesday, which includes graphic details about sexual threats and other harsh interrogation techniques the CIA meted out to captured militants in the years after the Sept. 11, 2001, attacks on the United States. The report also... \"Under any common meaning of the term, CIA detainees were tortured,\" said Feinstein, describing the era as \"one of the lowest points in our nations history.\", The report certainly is gruesome, listing waterboarding and other tortures (some Republicans call these \"enhanced interrogations\") and there was that dungeonlike site in Afghanistan nicknamed the Salt Pit where detainees were badly treated and some died. Detainees were shackled, sometimes hooded, and \"dragged up and down corridors while beings slapped and punched,\" according to the committee. One Afghan militant, a man named Gul Rahman, died of hypothermia in the pit after he was beaten, stripped naked and left chained to a concrete floor. There were many other details, but the gist of it has been known for years. Some members of the committee were critical of the release of the report, saying it would incite emotions and put Americans at risk. \"Weve known all this stuff for years,\" Sen. Dan Coats, the Indiana Republican and member of the committee, told me in an interview Tuesday on my WLS-AM radio program. \"Its been discussed on every news show, by every newspaper, by so many journalists. But the real question is: Why now?, \"Here the White House on the one hand issues out of the State Department a warning to every embassy, every intelligence agency, every intelligence agent, All right now, youre suddenly a target now, so take extra caution, and at the same time , theyre saying Oh no, this report needs to be released. It doesnt make sense. \"Why put Americans at risk when everything is already known?\" Coats asked. \"The program was terminated years ago.  As former ambassador I knew what it was like to be in a building in a foreign country with an American flag hanging outside.  There will be people out there, saying, See, I told you so, now Im justified in going out and killing an American or blowing up a building.\", If youre certain about all this, if your politics are tribal enough to know the unequivocal truth of things, congratulations. But I have no such certainty. The debate is of words, and it is compelling, but so was the sound of Daniel Pearls voice. He was screaming and then he stopped screaming. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20141210", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-cia-torture-report-islamic-state-kass-met-1210-20141210-column.html", "Title": "[ Will Islamic State wring its hands like us over torture? Not likely]"}