{"Content": "[ Greetings, American humans! Hello, advanced mammalian friends! Welcome to The Week of Hillary!, \"Wait, wait, wait,\" you might be thinking if youre a normal American human. \"Its not The Week of Hillary. Last I checked, it was The Week The Government Steals All Of My Money, Then Somehow Manages to Act Like Its The Victim. Also, isnt ISIS about to take over Ramadi? Also, didnt Russian warships just enter the English Channel? And what about  ?\", Pffftt. Pipe down. You havent been paying attention, friend. It is, at least in the cloistered world of the American media, The Week of Hillary. On Sunday, the former secretary of state announced her intention to enact her final, sweet, glorious revenge on the old ball and chain, Bill \"Mr. Fun\" Clinton  ahem, I mean \"run for president\"  and the coverage has been wall-to-wall since. So far, The Hillary Show has been consistently hilarious, complete with a bizarre Robocop-style, bulletproof, Secret Service-driven \"casual\" road-trip van  named, oddly, \"Scooby,\" which is the cartoon dog, and not \"The Mystery Machine,\" which is the actual cartoon van  and what may have been the weirdest Ohio Chipotle fast-food visit ever. (In short, Clinton wore sunglasses inside like a Vegas mobster, didnt talk to anyone, and The New York Times ran a full scientific microanalysis of the nutrition content of her order.), However, theres bad news. Behind the scenes, the Clinton campaign is even creepier than you might think. \"Americans have fought their way back from tough economic times, but the deck is still stacked in favor of those at the top,\" Clinton declared in her announcement video, which looked suspiciously like a 1990s Mentos commercial. \"Everyday Americans need a champion, and I want to be that champion.\", There are several things wrong with this, so well start with the obvious: Who in America older than the age of 12 wants a politician to be their \"champion\"? Moreover, if you do want a politician to be your champion  we can talk about your troubling experience-based cynicism deficit later  would you honestly choose one who has \"Creature of the D.C. Foreign Donor/Big Banking/Conflict-of-Interest/Question-Dodging/General Corruption Borg\" written all over her? (Im guessing Sen. Elizabeth Warren, D-Mass. is wondering this, too.), Theres a deeper question to consider: What does it really mean to be someones champion  and what do left-leaning politicians think it means? Interestingly, Clintons presidential announcement video features a young, single mother. \"My daughter is about to start kindergarten next year,\" the woman says, packing boxes and flexing Popeye muscles, \"and so were moving, just so she can belong to a better school.\", Honest question: Is this meant to be uplifting? Why should someone have to pack up and move in order to go to a better school? What about the people who dont have the resources to leave? In fact, wouldnt it be great if the people who ran our public education system would offer parents a choice, giving them access to multiple good schools, rather than walling them off in subpar districts based on wealth or lack thereof?, Jeepers, zoinks, and jinkies, gang! Something doesnt fit! Our schools are run by the government! Theyre run by politicians and entrenched bureaucrats! Arent they supposed to be our champions? Arent they supposed to free us through their growing control?, Being a conservative Republican, I have come to the conclusion that we cant possibly produce a candidate with enough moxie to win the 2016 presidency. I do have a plan that would make life easier for all of us and possibly get this country headedin the right direction before itstoo late. First,... Being a conservative Republican, I have come to the conclusion that we cant possibly produce a candidate with enough moxie to win the 2016 presidency. I do have a plan that would make life easier for all of us and possibly get this country headedin the right direction before itstoo late. First,... This, at its root, is the progressive paradox, and it applies to a whole slew of other issues, including health care, small business regulations, economic policy and free speech. Theres also no one who embodies it better than Hillary Clinton, who, for the past two decades, has championed herself right through the highest annals of power and straight to the bank. Perhaps its no coincidence that Sunday was also the biennial meeting of George Soros Democracy Alliance, which, as the conservative Washington Free Beacons Lachlan Markay reports, \"steers tens of millions of dollars each year\" to a grab bag of left-wing causes. Its a meeting without a hint of irony, where \"flashy sports cars ferry climate crusaders to a luxury hotel, a private security company shields prying eyes from speeches on political accountability, and billionaire Democratic donors denounce money in politics.\", What they dont denounce, of course, is growing government control, paired with creeping bureaucratic influence into an ever-expanding segment of the \"everyday Americans\" life. The progressive model celebrates control by a few, slickly packaged as the \"championing\" of the many. Who knows? Some progressives may honestly believe it, even though they shouldnt. Its like the classic ending to every Scooby Doo episode  flimsy, obvious mask and all. Heather Wilhelm is a writer based in Austin, Texas. This article first appeared on RealClearPolitics.com.]", "Date": "20150416", "Author": "[ Heather Wilhelm]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-hillary-clinton-perspec-0417-20150416-story.html", "Title": "[ Hillary Clinton's creepy presidential spin]"}