{"Content": "[ The National Labor Relations Boards ruling over whether football players at Northwestern University are employees of the school is expected later this month. The five-member board could affirm, modify or reverse a 2014 ruling by Peter Ohr, the regional director of the NLRB in Chicago, granting football players with scholarships employee status under federal law, which allowed them to form a union. Following Ohrs decision, the players voted on whether they wanted to be represented by the College Athletes Players Association, or CAPA, a union headed by former UCLA linebacker Ramogi Huma and financially backed by the United Steelworkers. Northwestern appealed Ohrs decision to the NLRB in Washington, so the ballots were immediately sealed inside a box after the election. If the board reverses the decision, the ballots will be destroyed. But if it affirms Ohrs decision, the box will be opened and the ballots counted, likely within a week of the decision. Some players have speculated that players would reject the union because of team peer pressure as well as university calls to players homes. A decision granting the football players employee status would open the door for athletes at other universities to unionize. Football players at public universities might be next, as state labor boards traditionally have followed NLRB decisions. The ruling is narrow in that it only applies to football players who receive scholarships, which the regional director found to be \"compensation\" for their football-related services. But experts say that, as long as the same conditions apply, athletes in other revenue-generating sports could also make the argument that they are employees of their universities. Basketball players, they say, are most likely to follow. Northwestern football player union effort to receive ruling soon. August 11, 2015. (WGN-TV), Northwestern football player union effort to receive ruling soon. August 11, 2015. (WGN-TV), Its unclear when the ruling will be made public. Democrats who currently hold a 3-2 voting advantage on the NLRB probably would want to disclose the ruling prior to Aug. 27, when Harry Johnsons seat expires. Some sources say if the position goes dark Republican lawmakers could stall President Barack Obamas replacement and, in turn, stall the NLRBs Northwestern decision. Northwestern has said its student-athletes are first and foremost students, and that the schools primary commitment is to their education. It also has argued that collective bargaining is not the appropriate method to address concerns raised by football players. Among the unions demands are financial coverage for former players with sports-related medical expenses, the creation of an educational trust fund to help former players graduate and commercial sponsorship compensation for players. CAPA has said it seeks to negotiate over health and safety issues and does not intend to push for \"pay-for-play\" wages, which are not allowed by the National Collegiate Athletic Association, a nonprofit that regulates college athletes of its member schools. In hearings last year by a regional officer of the NLRB in Chicago, CAPA argued that the players primarily have an economic relationship with the university. Former Northwestern quarterback Kain Colter described a grueling football schedule that led him to drop his pre-med course load and switch to a less-demanding major. Colter spoke of 50- to 60-hour workweeks and a coach who was the \"bossman.\" And he stressed that participating in football was a job, and as a result of it, he couldnt pursue his dream of becoming an orthopedic surgeon. The legal fight began in January of 2014, when the players filed an election petition with the Chicago office of the NLRB. acancino@tribpub.com, Twitter @WriterAlejandra]", "Date": "20150811", "Author": "[ Alejandra  Cancino]", "Link": "http://www.chicagotribune.com/business/ct-northwestern-football-union-0811-biz-20150811-story.html", "Title": "[ Northwestern football player union effort: Ruling expected soon ]"}