{"Content": "[ The cost of the Ventra transit fare-collection system has climbed to above $500 million, a 14 percent increase since the Chicago Transit Authority signed the original contract in late 2011, according to records obtained by the Tribune. A series of add-ons during that short span involving the CTA, Pace and Metra increased the contracts worth from roughly $454 million to nearly $519 million, fueling concerns that expenses could continue to escalate sharply. Transit officials said the single biggest new cost to the contract with Cubic Transportation Systems, which expires in January 2024, was adding Pace to the Ventra system. But they acknowledge that some of the almost $65 million in add-ons, called change orders, were needed to resolve problems that nagged the Ventra system since its rollout. Most notorious among them after the CTA and Cubic launched Ventra in September 2013 was the failed or delayed processing of fare payments when customers tapped their Ventra cards on readers. Other changes were for features that \"either werent finalized or anticipated when the original contract was signed,\" said CTA spokesman Brian Steele, but arguably should have been included. CTA officials contend that change orders, which the Tribune obtained through a Freedom of Information Act request, occur in almost all of the agencys major projects and procurements but do not always mean budget overruns. They warn, however, that more change orders in the Ventra contract are likely, noting that the agreement marks the first time the CTA has outsourced fare collection to a private contractor. \"Weve always known, as with any multi-year contract, there is always the opportunity to change that contract to meet whatever the needs are, Steele said. Other reasons for cost increases to the contract, the CTAs third agreement in a row with Cubic, include additional Ventra fare readers for new buses and technology that will make it easier for customers to get their balances as they swipe their cards, officials said. Ventras predecessor showed balances to customers, who still complain about the absence of that feature in the current system. A change order involving the fare payment snags, in which some CTA bus riders must tap their card on Ventra readers several times before getting the green \"Go\" screen, is paying for software that displays \"Stop\" and \"Please touch again, card not read\" messages to distinguish problems involving a lack of funds and the machine not reading the card. It will never be known how much money could have been saved if the CTA, Pace and Metra solicited bids simultaneously for the new fare-payment system and negotiated from a position of strength with either Cubic, a San Diego-based subsidiary of a defense contractor, or one of its competitors. Pace joined the Ventra system in August 2012, under what is by far the biggest change order since the contract was signed, $54.8 million. The suburban bus agency made a down payment on it then and continues to pay off in monthly installments, records show. And Metra, which declined to participate in Ventra when CTA first signed on, is finally dipping its toe in the water via a smartphone mobile-ticketing app that is set to go live in May or June. The cost to the three transit agencies to offer the app for free to riders totals $2.5 million. The CTA is paying $1.7 million of that to develop the app that will allow transit customers to use their smartphones to buy fares and passes, manage their Ventra accounts and obtain travel information, officials said. Metra and Pace are paying the remainder and also will pay monthly service fees for management of the app, which the three agencies created with mobile app developer GlobalSherpa, officials said. Currently, many bus-only customers who use the Ventra card make a trip to CTA rail stations to add value to their cards. Value also can be added online at http://www.ventrachicago.com, but not all CTA customers use computers or have access to computers or smartphones. The Regional Transportation Authority, which is responsible for providing financial oversight to the CTA, Metra and Pace, defended the handling of the Cubic contract. \"Change orders ... were always anticipated as part of the service boards shift to a regional fare-payment system,\" RTA spokeswoman Susan Massel said. The Illinois General Assembly set a Jan. 1 deadline for the RTA system to implement a regional fare-payment system. It was envisioned as a seamless process where riders could use a single fare card to transfer between CTA, Metra and Pace. RTA officials say the deadline has been met because Ventra allows the use of contactless credit cards, debit cards and prepaid cards to pay for all fixed-route public transportation. But Steve Schlickman, a former RTA executive director who now directs the Urban Transportation Center at the University of Illinois at Chicago, said the Ventra system represents \"the failure to achieve a universal fare card for the region in a coordinated and efficient manner\" and is \"Exhibit No. 1\" for the need of a single agency that merges the RTA, CTA, Metra and Pace. Cubic, the company that has been managing Ventra, has had its own bumps to navigate. The company agreed to reimburse the CTA roughly $1.2 million after malfunctions with Ventra equipment between Oct. 1 and Dec. 19 of 2013 resulted in the CTA giving away nearly 1 million free rides. Cubic also saw its revenue stream squeezed in late 2013 when the CTA slowed the full transition to Ventra from the old CTA-run fare-payment system and withheld payment to Cubic until the myriad shortcomings were substantially resolved. The problems included a flawed Ventra card activation process, customers experiencing difficulty paying fares and adding funds to the card, faulty card readers that double-charged fares, understaffing at Cubics customer service phone center, and hidden extra fees on an optional Ventra MasterCard debit account. Officials at Cubic and the CTA have declined to release information regarding how many of the 3.9 million registered Ventra card accounts include the optional debit card. But industry experts who spoke on condition of anonymity said the debit card feature was a bust for Cubic and that the overall Ventra card deal has turned out not to be the money-maker that Cubic had originally contemplated. Maximizing change orders is a way to recoup profits, the experts said. The Tribune has made several requests, as recently as March 19, asking the CTA to provide updated figures on uncollected fares and reimbursements by Cubic. Transit officials said last week that they were still working on the numbers. Last December, after receiving CTA board approval two months earlier, CTA President Forrest Claypool signed two changes to the Cubic contract totaling $7.3 million to upgrade Ventra software and hardware and purchase more equipment. One of those changes, which the CTA signed off on in December, was for $4.5 million to purchase new revenue equipment and spare parts to be installed at 15 transit stations over the next three years. The other, totaling almost $2.8 million, added the aforementioned technology that enables bus drivers to check Ventra card balances on a screen in the drivers compartment to resolve disputes with riders. The balances are not displayed on the fare reader that customers use. The fare system that the CTA retired and replaced with Ventra did display balances to customers during every transaction and it showed the expiration date of passes, on both buses and at rail stations. Under the old fare-collection system that the CTA operated internally, Cubic produced the magnetic-stripe transit cards that were introduced in 1997 and the Chicago Card smart card in 2003. CTA riders have complained about the elimination of the customer-facing fare-balance function under Ventra. In the wake of the change order, the CTA has not made it well known to riders that they can now ask drivers to double-check their card balances, which in addition to defusing tensions would reduce delays caused by arguments over fares. The change order noted that the upgrades were \"in addition to Cubics performance requirements under the original contract, and are needed to provide up-to-date equipment, software design and engineering services for CTA fare collection.\", Cubic is also using the extra billing to provide and maintain 40 portable Ventra fare card readers that can be deployed at rail stations to facilitate faster fare payment during major events like the Taste of Chicago, Lollapalooza, the Chicago Marathon and games at sports stadiums. The portable fare readers are also expected to be used at temporary entrances during station renovations, officials said. Cubic also sold the CTA a streamlined Ventra vending machine screen menu for customers at OHare International Airport, Midway Airport and other high-traffic CTA stations, the change order said. The simplified \"express\" menu screen will go into effect on some machines by the end of the year. They will sell only single-ride tickets and one-day unlimited ride passes, both of which are popular with tourists, officials said. When the CTA decided more than five years ago to start looking for a system to replace the popular Chicago Card smart card and transit cards with magnetic stripes, one factor cited was the high cost under the CTAs existing contract with Cubic to add more transit card vending machines and to upgrade software. The CTA discovered early on that it was locked in to purchasing extra equipment and software updates from Cubic, because the technology is proprietary. Yet in 2011, despite a competitive-bidding process that attracted several vendors, the CTA awarded another contract to Cubic to create Ventra. Contact Getting Aroundat jhilkevitch@tribpub.com orc/o the Chicago Tribune, 435 N. Michigan Ave. Chicago, IL 60611; on Twitter @jhilkevitch; and at facebook.com/jhilkevitch. Read recent columns at chicagotribune.com/gettingaround.]", "Date": "20150329", "Author": "[ Jon Hilkevitch]", "Link": "http://www.chicagotribune.com/news/columnists/ct-ventra-costs-getting-around-met-0330-20150329-column.html", "Title": "[ Ventra contract swells by about $65 million because of add-ons]"}