{"Content": "[ A Naperville Area Chamber of Commerce committee decided through a voice vote Monday not to formally oppose a plan by Naperville to add a 1 percent municipal sales tax, but that doesnt mean members are happy about the idea. \"Were pro-business,\" chamber President and CEO Nicki Anderson said, \"and this is not particularly pro-business.\", The vote came during the groups monthly legislative committee lunch Monday. The Naperville City Council was expected to discuss the issue at a special meeting Tuesday. Anderson said the chamber would send representatives to the meeting and then convene the groups legislative committee to craft a formal position before the councils regular meeting Aug. 18. \"I can tell you that as it is currently written we cannot support it,\" Anderson said. Because Naperville is a home rule municipality it is allowed to create a 1 percent sales tax without voter approval. City manager Doug Kriegers presentation to the luncheon crowd painted a picture of a city that has been consistently drawing down its reserves to both maintain services and keep property taxes low. In 2002, the citys cash reserves were about $180 million, as opposed to the current projection of $65 million for fiscal year 2016. Krieger indicated that it was a goal of the city going forward to bring that figure back up to at least $80 million. Naperville Mayor Steve Chirico will ask the City Council Tuesday to expand the Financial Advisory Board in an effort to add two people he believes will be valuable during the budgeting process. The move is set to be discussed during a special meeting set for Tuesday night. The session originally... Naperville Mayor Steve Chirico will ask the City Council Tuesday to expand the Financial Advisory Board in an effort to add two people he believes will be valuable during the budgeting process. The move is set to be discussed during a special meeting set for Tuesday night. The session originally... Moreover, the 2016 fiscal year operating fund faces a deficit of $6.8 million, a figure that Krieger called a \"structural deficit\" that would have to be addressed in the near future. The drawdown in cash reserves comes at the same time the city also carries $163.9 million in capital debt, which could add to a possible problem financing capital projects in the future. In addition to the 1 percent home rule sales tax, city staff has also proposed keeping expense increases in the operating fund to no more than 3 percent annually, and beginning to charge residents the full price for garbage and recycling fee. Currently households pay $2 per month and the city subsidizes the $10.35 to cover the rest. The increase in the garbage fee is projected to raise $5 million annually and, combined with smaller reductions in expenditures, will eliminate the deficit in the operating fund. The 1 percent sales tax is expected to raise an additional $18.1 million annually and, if approved, would be earmarked for paying down city debt and financing capital projects. Krieger pointed out that the citys current debt payment was $13 million annually, and that with the additional money from a home rule sales tax, some revenue from property taxes that now goes toward debt could now be used to build up the citys cash reserves. Krieger said that the practice of drawing down cash reserves for operations made sense in the earlier part of the century, when Napervilles growth was skyrocketing. \"It was a great short-term strategy,\" he said while noting that the high growth era is dead. Looming large in the discussion of Napervilles finances are the bond rating agencies that evaluate risks for municipalities. Although the city has long enjoyed a triple-A rating, recently two ratings agencies, Fitch and Standard & Poors, have made negative comments about Napervilles Electric Utilities financial status. \"The ratings agencies opinions are important,\" Krieger said. Naperville Mayor Steve Chirico stressed that he wanted to make sure that Napervilles finances were sound going forward and that he didnt want to keep, \"kicking the can down the road ... . I want to solve the problem long-term.\", Chirico said that he hadnt formed an opinion yet and that he was willing to listen to all sides, but made clear that he wanted \"the problem solved now.\", City Council member John Krummen also said he was willing to listen, but pointed out that that the undeniable fact was that the citys expenses were outpacing revenues. \"Were at a crossroads,\" he said. His council colleague, Kevin Coyne, said he was still researching the issue with city staff. \"Certainly something has to be done on the revenue side,\" he said. Coyne said that he had no problem with the idea of raising garbage fees, but was still undecided on the sales tax. Hank Beckman is a freelance reporter for the Naperville Sun.]", "Date": "20150813", "Author": "[ Hank Beckman]", "Link": "http://www.chicagotribune.com/suburbs/naperville-sun/news/ct-nvs-naperville-chamber-sales-tax-st-0812-20150810-story.html", "Title": "[ Chamber leaders vote not to oppose Naperville sales tax idea]"}