{"Content": "[ High school seniors taking Advanced Placement exams this coming school year could have a better chance of earning college credit before they enter as freshmen. Beginning with the 2016-17 school year, Illinois colleges and universities must provide course credit to students who score at least a 3 on an AP exam, according to a bill signed into law this week by Gov. Bruce Rauner. How colleges grant credit for AP test scores has varied in the past, with some giving credit only to students who score at least a 4 on the 5-point scale, while others granted credit to students who scored as low as 2, according to the College Board, which offers the tests. The change is designed to streamline the AP credit process across the states public universities, as well as make college more accessible and affordable. \"We didnt hear any reason why there was such a hodgepodge\" of AP score requirements, said state Sen. Pat McGuire, D-Crest Hill, who co-sponsored the bill after hearing from high school teachers in his district. \"Yet we heard convincing evidence from experts from other states. Granting college credit for a 3 on an AP test actually promotes student achievement in college.\", Some higher education officials were concerned that the law could affect academic standards by forcing colleges to give credit to students for courses they shouldnt skip. The officials were also concerned that granting students college credit could cut tuition revenues. But Charles Tucker, vice provost for undergraduate education and innovation at the University of Illinois at Urbana-Champaign, said the law allows universities and colleges to determine what kind of credit theyll offer for a score of 3, which will help maintain academic standards. McGuire said that was a compromise after hearing from higher education officials. After spending an entire morning last week taking Advanced Placement exams in hopes of earning college credit while still in high school, a group of northwest suburban students offered their own assessment:, The tests werent too hard, but some colleges are too strict about giving credit for them. After spending an entire morning last week taking Advanced Placement exams in hopes of earning college credit while still in high school, a group of northwest suburban students offered their own assessment:, The tests werent too hard, but some colleges are too strict about giving credit for them. \"Credit is good, but its bad if a student skips a course and is unprepared for the next one,\" Tucker said. Others praised the law because it will make college more accessible and could encourage more high school students to venture into AP course work. \"This is tremendous news for Illinois students, families and educators,\" Greg Walker, vice president of the College Boards Midwestern regional office, said in a statement. \"At a time when AP participation and performance has increased significantly in the state, this law provides more students with a greater opportunity to graduate college on time.\", \"We think its a big step forward in helping students,\" added James Applegate, executive director of the Illinois Board of Higher Education. \"I see this as a positive development in a larger effort in the state of Illinois to enable students to accelerate their progress toward college degrees in high school.\", The bill \"is one piece of a larger puzzle that were trying to put together in Illinois,\" he said. \"If were going to make college more affordable, this is one strategy.\", kthayer@tribpub.com, Twitter@knthayer]", "Date": "20150815", "Author": "[ Kate Thayer]", "Link": "http://www.chicagotribune.com/news/ct-college-credit-apclasses-met-20150814-story.html", "Title": "[ Illinois streamlines AP test score requirements for college credit]"}