{"Content": "[ While an increase in Cook Countys sales tax rate wont take effect until January, Southland communities that rely heavily on healthy retail sales to fund their operations are cautiously optimistic the hike wont seriously damage that revenue stream. Suburbs including Oak Lawn, Orland Park and Tinley Park have been down this road before, when the county last boosted the tax rate by a percentage point in 2008, which was rolled back over several years. At that time, the full effects of the recession were just starting to be felt, which depressed sales tax revenue. Cook County commissioners on Wednesdaynarrowly approved the increase, which was pushed as being necessary to shore up the pension system for county workers. With the economy healthier now than it was then, and consumers more confident and willing to spend, overall sales might not suffer too much, but where consumers spend their money could be a factor. With lower sales tax rates in the collar counties ringing Cook, shoppers might be tempted to travel a bit farther to avoid the higher tax, particularly on big-ticket items such as appliances and furniture. But consumer shopping habits could ultimately change to the point where cross-border shopping trips become routine, Tanya Triche, vice president and general counsel with the Illinois Retail Merchants Association, said. \"Were not just talking about an occasional purchase\" for a big-ticket item, she said. While the Chicago-area economy has, on the whole, rebounded since the end of the recession, sluggish job growth in south Cook County means that businesses in the region \"are having a fairly tepid recovery,\" Triche said. \"They are trying to figure out ways to recover from a tough economic downturn,\" she said. Triche noted that while consumer confidence has steadily improved since the depths of the depression, shoppers \"are still hesitant,\" particularly when it comes to big-ticket items, and will look at options to save money. At the end of June, her association polled county consumers to gauge how their shopping habits might shift should the higher tax be approved. Of the more than 1,000 people surveyed, 68 percent said they would more likely shop outside of Cook County, while more than 45 percent said they would shift to online purchases to avoid the county tax. \"People have a lot of choices,\" Triche said. In retail-intensive communities such as Oak Lawn, Orland Park and Tinley Park, the total sales tax rate on general merchandise would increase to 9.75 percent come Jan. 1. That takes into account the current state rate, the higher county rate and home rule sales taxes the communities levy. In Oak Lawn, the \"business community is doing well today in most sectors,\" with new businesses opening their doors, Larry Deetjen, village manager, said. \"Certainly there will be some impact (from the tax increase), but our established businesses both old and new have loyal customer bases,\" he said. Deetjen said Oak Lawn is fortunate to be home to \"pretty savvy entrepreneurs and family businesses that know how to work smarter and harder to survive and prosper.\", Orland Parks LaGrange Road retail corridor plays a large role in financing the villages annual budget, with sales tax revenue being Orlands single largest revenue source. For the current calendar year, the village estimates that sales tax revenue will be up 1.3 percent compared with 2014, to $20.7 million. \"We are confident that Orland offers lots of value and one-stop shopping for consumers, but this increase is certainly not helpful and does not position Cook County well in the regional and national marketplace,\" Joe La Margo, a village spokesman, said. Tinley Park is estimating that it will see $19.3 million in sales tax revenue for the current fiscal year, which ends next April. With retailers in both Cook and Will counties, there will be a 2-percentage-point variance in tax rates from the north end of the village to the south end, where the Brookside Marketplace retail center is located. \"Arguably, particularly for big-ticket purchases, it will place our Will County business locations into a slight tax advantaged position for retail sales,\" village treasurer Brad Bettenhausen said. He said there were no hard numbers to show that the last county tax increase, which created a similar disparity, resulted in any significant shift in shopping habits, and that \"it is a matter to be seen if shoppers will consciously change their buying habits to take advantage of the differential.,\" when the new increase takes effect. mnolan@tribpub.com]", "Date": "20150717", "Author": "[ Mike Nolan]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-cook-sales-tax-st-0719-20150717-story.html", "Title": "[ Towns brace for tax hike]"}