{"Content": "[ A U.S. appeals court in Chicago said on Monday that Wisconsins 2012 voter identification law is constitutional, allowing the state to put the new rule into effect at midterm elections on Nov. 4.  The ruling from a three-judge panel of the 7th U.S. Circuit Court of Appeals was expected because it follows a rush order made by the same judges on Sept. 12 giving a temporary green light to the law requiring voters to present photo identification at the ballot box.  \"Both the prevention of voter impersonation on election day and the preservation of public confidence in the integrity of elections justify a photo ID requirement,\" the judges said in their 23-page ruling.  The judges said the inconvenience of getting the requirements for an ID and getting the ID itself do not qualify as a substantial burden on the right to vote.  Similar voter ID rules have become a political and racial flashpoints across the United States.  Supporters of the rules say they are needed to prevent voter fraud. Opponents say they discriminate against the poor, elderly and minorities who are less likely than white voters to have photo IDs and the documents needed to obtain them.  \"This unfortunate ruling is of little surprise, given the panels previous order. The voters of Wisconsin deserve every opportunity to cast their ballot free of the obstacles imposed by this law. We are evaluating our next step,\" said Dale Ho, director of the Voting Rights Project of the American Civil Liberties Union. New polls have clarified the status of some of the nations most competitive races for governor, with Republican Gov. Scott Walker apparently gaining ground in Wisconsin and another prominent conservative Republican, Gov. Sam Brownback, receiving more bad news in Kansas. The battle for control... New polls have clarified the status of some of the nations most competitive races for governor, with Republican Gov. Scott Walker apparently gaining ground in Wisconsin and another prominent conservative Republican, Gov. Sam Brownback, receiving more bad news in Kansas. The battle for control...  The judges on the Circuit Court panel were Frank Easterbrook, appointed by Republican President Ronald Reagan, and Diane Sykes and John Daniel Tinder, both appointed by Republican President George W. Bush.  The U.S. Supreme Court has yet to act on a stay application that the opponents of the law filed prior to todays ruling.  ,  ]", "Date": "20141006", "Author": "[ Fiona Ortiz]", "Link": "http://www.chicagotribune.com/news/local/breaking/chi-wisconsin-voter-id-law-constitutional-20141006-story.html", "Title": "[ Appeals court says Wisconsin voter ID law constitutional]"}