{"Content": "[ Ted Cruz is a man with a plan. The Republican presidential candidate, bete noire of his partys establishment, has carefully calculated a path to becoming the right-wing standard-bearer. That makes him the most underestimated candidate in the field. Cruz is rising in some polls and attracting more attention after the Republican debates in Cleveland on Aug. 6. The chattering class focused more on how well John Kasich, Carly Fiorina, Marco Rubio or Ben Carson did in those encounters, along with the confounding staying power of Donald Trump. But Cruz, whose political cunning equals his sharp intellect, may have laid the best foundation for advancing in this wide-open race. He touched all the conservative erogenouszones at the Cleveland forum and strategically refuses to say anything negative about Trump, the front-runner in early national polls. Cruz relishes attacking his own party leaders. This makes him unpopular with congressional colleagues and other Republican eminences, but it delights many conservatives. He sees opportunities to delight them even more this fall with battles over spending and the debt ceiling. After debt-ceiling disputes shut down the government in 1995 and 2013, leaving Republicans reeling politically, party leaders want to avoid them. Not Cruz; for him, shutdown talk is a chance to thrill activists. Theres a reason hes avoided criticizing Trump and has been solicitous of Carson, the neurosurgeon and political neophyte with a strong conservative following. Cruz expects their novelty to wear off, and he wants their supporters, especially among evangelicals, to come to him. I spent Monday morning struggling to come up with an elegant description of Donald Trumps first official policy paper, a six-page document on immigration. After more than a decade of writing about politics and public policy, this should have been easy. That experience did finally lead me to the... I spent Monday morning struggling to come up with an elegant description of Donald Trumps first official policy paper, a six-page document on immigration. After more than a decade of writing about politics and public policy, this should have been easy. That experience did finally lead me to the... No candidate will get to the right of the freshman Texas senator on issues of importance to the Christian right, like defunding Planned Parenthood, condemning illegal immigration or bashing President Barack Obama. Cruzs campaign manager, Jeff Roe, says his team divides the Republican electorate into four parts: a relatively moderate and business-centered establishment faction, the Christian right, the tea party anti-government bloc, and libertarians. Cruz contends hes competitive in all but the establishment bracket. Born-again Christians receive special attention, starting with the Cruz campaign launch at Liberty University in March. Cruz has had 55 meetings with church leaders since late last year. His father, an evangelical minister, has had more. There is competition for this bloc, which is likely to make up 40 percent of the participants in the Iowa caucuses. Mike Huckabee and Rick Santorum, two others with special appeal to religious conservatives, won the most votes at the 2012 and 2008 Iowa contests. Cruz figures hes the fresh face, more aggressive and better financed, who can make the others seem like yesterdays news. Donald Trump has an immigration policy. Its based on dubious assertions and would be fabulously expensive, but as a statement of goals its largely coherent. And it may mark a very, very dangerous turning point in the Republican presidential primary.f, There are two main facets of illegal immigration:... Donald Trump has an immigration policy. Its based on dubious assertions and would be fabulously expensive, but as a statement of goals its largely coherent. And it may mark a very, very dangerous turning point in the Republican presidential primary.f, There are two main facets of illegal immigration:... His fundraising is strong. Cruz super-PACs have more money $52 million as of June 30, according to the most recent campaign-finance reports than any other candidates except Jeb Bushs. His campaign claims 225,000 donors, dwarfing most others. This, the campaign argues, gives him resources to go the distance. There are four contests in February Iowa, New Hampshire, South Carolina and Nevada. Polls show Cruz running respectably in Iowa. Last weekend, according to press reports, he dominated an event in Nevada. His brain trust figures that if he wins or places in a couple of the February tests, hell be well-positioned for the 10 contests of March 1, Super Tuesday. The bulk of Super Tuesday delegates come from Southern states, including Texas. No one has spent as much time as Cruz courting voters there, most recently on a seven-state August bus tour. \"We are better-positioned than anyone for March 1,\" says Roe, the campaign manager. \"If we win that day, were a finalist.\", No one doubts Cruzs brainpower; hes a graduate of Princeton and Harvard Law School, a champion debater and a Supreme Court clerk to former Chief Justice William Rehnquist. Hes also tough and relishes political combat. Hes fought bitterly with Republican congressional leaders, famously accusing Senate Majority Leader Mitch McConnell of lying. He made a similar charge in June against Republican guru Karl Rove, who fired back. The fracas involved a dispute over a 2009 campaign contribution to Cruz from former President George H.W. Bush (Cruz was considering a run for Texas attorney general at the time), and Cruzs relationship with the Bush family is now strained. Cruz worked as a policy adviser to George W. Bushs 2000 campaign. Veterans of that contest remember him as a conventional conservative who veered sharply to the right later. He was not offered a job in Washington after Bush became the 43rd president. Cruz took on the Texas establishment in 2012, knocking off the Republican lieutenant governor in a Senate primary and then winning the general election. Cruz strategists say their man has a genuine shot at winning the nomination, contrary to conventional wisdom. Democrats say his harsh oratory, hard-line views and disruptive behavior would make him an easy target, enabling them to win as many as 35 states. (Obama won 26 last time.), Well see. This Texan is a politician who methodically plots every move. If he falls short this time, some sources close to him say, he figures the Democrats win the presidency. Then he cashes in conservative chits and picks up the pieces afterwards. There is a model: Ronald Reagan who, as a conservative challenger, lost the Republican presidential nomination to President Gerald Ford in 1976; Ford lost the general election and Reagan won the presidency four years later. Bloomberg News, Albert Hunt is a Bloomberg columnist.]", "Date": "20150818", "Author": "[ Albert Hunt]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-ted-cruz-conservative-base-20150818-story.html", "Title": "[ Underestimating Ted Cruz is a mistake]"}