{"Content": "[ A prominent Republican consultant  who isnt working for any of the 2016 presidential candidates and has been right more times than I can count  said something that shocked me when we had lunch recently. He said that Texas Sen. Ted Cruz had about the same odds of becoming the Republican presidential nominee as former Florida governor Jeb Bush. Jaw-dropper, right? After all, the conventional wisdom is that Bush, the son and brother of presidents, is the front-runner to be the Republican standard-bearer, while Cruz, a conservatives conservative, is a factor, sure, but not someone who could actually win the nomination. How, I asked the consultant, could he say such a thing? He explained it this way. Think of the Republican field as a series of lanes. In this race, there are four of them: establishment, tea party, social conservative and libertarian. The four lanes are not of equal size: Establishment is the biggest, followed by tea party, social conservative and then libertarian. Obviously, the fight for the top spot in the establishment lane is crowded, with Bush and possibly Wisconsin Gov. Scott Walker leading at the moment. Ditto the social-conservative lane, with former Arkansas governor Mike Huckabee, Ben Carson and Rick Santorum pushing hard there. The libertarian lane is all Sen. Rand Pauls, but, as I noted above, its still not that big. This leaves the tea party lane, which is both relatively large and entirely Cruzs. While Paul looked as though he might try to fight Cruz for supremacy in that lane at one time, its clear from his recent moves that the senator from Kentucky is trying to become a player in a bunch of lanes, including social conservative and establishment. Last week New Jersey Gov. Chris Christie had a semi-disastrous week. Andrew Ferguson of the Weekly Standard is ready to drop him from the list of credible contenders. There was the bobble over the vaccination issue, but Ferguson is more worried about the Christie persona: \"The jets, the meals,... Last week New Jersey Gov. Chris Christie had a semi-disastrous week. Andrew Ferguson of the Weekly Standard is ready to drop him from the list of credible contenders. There was the bobble over the vaccination issue, but Ferguson is more worried about the Christie persona: \"The jets, the meals,... So, Cruz is, without question, the dominant figure in the tea party lane. What that means  particularly in the early stages of the primary process in places such as Iowa, New Hampshire and South Carolina  is that he will probably be able to win, place or show repeatedly, racking up enough strong-ish performances to keep going even as the establishment and social-conservative lanes thin out. (Cruzs ability to raise money, which remains a question, is less important for him than it is for other candidates  especially those in the establishment lane. His people are going to be for him no matter how much  or little  communicating he does with them.), The trick for Cruz, the consultant said, is to hang around long enough to be the preeminent figure not only in the tea party lane but also in the social-conservative lane. (Cruz is decidedly conservative on social issues and talks regularly about his faith on the campaign trail.) The complicating figure in that consolidation effort is Huckabee, who is (a) likely to run, (b) an ordained Southern Baptist minister and (c) likely to be able to stay in the race for an extended period because of the number of early Southern primaries. Its hard to believe that Gov. Scott Walkers proposal to cut $300 million from the University of Wisconsins budget over the next two years would allow the school to maintain its quality. Walker, a Republican, would prohibit the university from raising tuition during that period, but instead give... Its hard to believe that Gov. Scott Walkers proposal to cut $300 million from the University of Wisconsins budget over the next two years would allow the school to maintain its quality. Walker, a Republican, would prohibit the university from raising tuition during that period, but instead give... But lets assume, for the sake of argument, that Cruz is able to outlast Huckabee (as well as Carson and Santorum). If you combine the tea party and social-conservative lanes, thats a pretty wide berth for any candidate hoping to be the GOP nominee. Is it as wide as a consolidated establishment lane behind Bush or Walker or Florida Sen. Marco Rubio? No one knows just yet, but its probably pretty close. So watch Cruz. The combination of his running room as the races one true tea party candidate, his debating and oratorical skills, and his willingness to always, on every issue, stake out the most conservative position make him a real threat. The 10 candidates with the best chance of being the Republican candidate in 2016 are ranked below. The No. 1 ranked candidate has the best shot as of today. 10. Indiana Gov. Mike Pence. Pence hasnt ruled out a run, though hes probably got to choose between running for president and re-election in 2016. One recent development: Pence expanded Medicaid in Indiana after negotiating some concessions from the Obama administration  though were not sure whether this would help or hurt him in 2016. 9. Huckabee. The former Arkansas governor is giving every indication he is running. If he does, he will be a factor because of his strong following among social conservatives. An NBC-Marist poll released on Sunday showed him on top of the field in Iowa. 8. Louisiana Gov. Bobby Jindal. Jindal is the resume candidate in the GOP field. Hes shown us little besides that, though, apart from occasionally tossing some red meat to the conservative base. The latest example: not backing down from his comments on \"no-go zones\" for non-Muslims in Europe. 6. (tie) Cruz. See above. Remember that although he is roundly derided by his colleagues  Democrats and Republicans  in the Senate, he may be closer to how the GOP base feels on most issues than anyone else running. 6. (tie) Ohio Gov. John Kasich. After lying dormant for a few months after his convincing 2014 re-election victory, Kasich will spend two days this week in South Carolina. That trip will spark some buzz about whether he will run, but Kasich may have waited too long  Walker, another Midwestern governor from a swing state, is on the rise. 5. New Jersey Gov. Chris Christie. Increasingly, its looking as if Christie missed his window for running for president in 2012. A new Rutgers-Eagleton poll shows that his favorable rating in New Jersey has dropped to 37 percent  after topping out at nearly 70 percent. And its not just his home state. Polls of likely GOP voters in Iowa and New Jersey show that he is the most unliked Republican not named Donald Trump. 4. Paul. Speaking of people whose stock is dropping, the senators vaccine comments continue to baffle us  especially since he continues to play the victim card. Yes, there is a segment of the GOP that probably likes the idea that Paul is taking on the \"liberal media.\" But theres also a much bigger portion of the party that will look at his vaccine flap and see Ron Paul 2.0. 3. Rubio. Yes, his path to the nomination is complicated by Bushs all-but-announced candidacy. But if Republican voters are looking for a fresh face who could, theoretically, expand the partys appeal, then Rubio could be the dark horse in the race. 2. Walker. The Wisconsin governor is clearly ascendant right now, thanks in large part to his strong speech at an Iowa confab a few weekends ago. His ham-handed handling of an evolution question, however, and his decision not to answer questions in London during a trade mission are not good signs. 1. Bush. The former Florida governor remains the top dog , and he got a big break when Mitt Romney opted not to run. Bush probably would have remained No. 1 even if Romney had got in, but the 2012 nominees exit makes Bush the obvious choice for GOP establishment types  read: big donors_ to rally around. Washington Post]", "Date": "20150216", "Author": "[ Chris Cillizza and Aaron Blake]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-scott-walker-ted-cruz-jeb-bush-2016-20150216-story.html", "Title": "[ Ranking the 2016 Republican field]"}