{"Content": "[ All three College of DuPage board of trustee candidates who campaigned as a \"clean slate\" for the embattled institution claimed victory for open seats on the Glen Ellyn-based board Tuesday night, with most of the ballots counted in the crowded election. With more than 99 percent of precincts reporting, unofficial figures showed Deanne Marie Mazzochi, of Elmhurst, and Frank Napolitano, of Bloomingdale, leading with about 20 and 16 percent of the votes. Charles Bernstein, of Wheaton, also on the \"clean slate,\" appeared to have edged out Sandra M. Pihos, of Glen Ellyn, for the final seat, according to unofficial results. Mazzochi, Napolitano and Bernstein ran jointly for the board, which came under fire after Tribune investigations raised questions about the universitys financial and education policies. Board Vice Chairman Kathy Hamilton, a lone dissident on the previous board, endorsed the trio and contributed about $50,000 to their campaigns. \"We three on the clean slate saw many months ago that, while College of DuPage was gorging on your cash, drinking fine wine on your dime, it was starving for real leadership,\" Mazzochi said. \"Thanks to our wonderful volunteers and voters throughout this district, that problem is ending today.\", Napolitano said voters Tuesday clearly asked for reform. \"This is a true referendum on the status quo,\" he said. Fewer than 2,000 votes separated Bernstein and Pihos. \"I think its fairly clear with the constant drip drip drip of scandal, people are fed up, and they are mistrustful and cynical and they want a change,\" Bernstein said. \"And we need to deliver on good governance and transparency, on the educational excellence of the school and on our fiduciary responsibility to the taxpayer.\", Twelve people vied for one of the three six-year trustee terms at the embattled institution, the largest community college in Illinois. Kim Savage, of Darien, and Nancy Svoboda, of Downers Grove, sought re-election to the board Tuesday but were well behind the top four vote-getters. Neither could be reached for comment. Board Secretary Allison ODonnell opted not to seek another term. This years election drew the largest group of hopefuls in several years, with many citing repeated bungles from the schools administration and board on financial dealings and educational policies as their motivation to enter the race. The Tribune reported in January that the board planned to approve a $763,000 severance for college President Robert Breuder, a deal compelling the controversial leader to retire in March 2016, three years ahead of his contracts end. College officials did not publicly reveal the terms of that deal until after the boards vote, but the Tribune obtained and published the details of the agreement beforehand. The Tribune later showed that the board repeatedly approved pay raises for Breuder over the years, away from the public eye. Read ongoing coverage of issues at Illinois largest community college with more than 28,000 students and $108 million in local property tax dollars, located in west suburban Glen Ellyn. Read ongoing coverage of issues at Illinois largest community college with more than 28,000 students and $108 million in local property tax dollars, located in west suburban Glen Ellyn. The Tribune then revealed that the school routinely paid bills to the private company of its radio station engineer and that the engineer had been allowed to authorize his own invoices for equipment and work he never provided. John Valenta was charged with felony theft in February and is accused of stealing more than $200,000 from the school. The Tribune also uncovered that Breuder and his top administrators enjoyed almost $190,000 worth of meals at the campus high-end Waterleaf restaurant on the taxpayers dime. In light of the controversies, several state legislators have pushed for the Illinois auditor general to perform a fiscal review of the college. Such an audit requires the school to pay for it, which could come to as much as $234,000. Completing the ballot were Matt Gambs, of Naperville; Claire Ball, of Addison; Roger J. Kempa, of Darien; Joseph M. Wozniak, of Naperville; David Carlin, of Naperville; and Dan Bailey, of Wheaton. cdrhodes@tribpub.com, Twitter @rhodes_dawn]", "Date": "20150408", "Author": "[ Dawn Rhodes]", "Link": "http://www.chicagotribune.com/suburbs/glen-ellyn/news/ct-college-of-dupage-election-met-20150407-story.html", "Title": "[ 3 'clean slate' candidates claim seats on College of DuPage board]"}