{"Content": "[ Presidential candidate Scott Walker won a major legal victory Thursday when the Wisconsin Supreme Court ended a secret investigation into whether the Republicans gubernatorial campaign illegally coordinated with conservative groups during the 2012 recall election. No one has been charged in the so-called John Doe probe, Wisconsins version of a grand jury investigation in which information is tightly controlled. But questions about the investigation have dogged Walker for months. Barring an appeal to the U.S. Supreme Court, the ruling makes Walkers campaign for the White House that much smoother as he courts voters in early primary states. \"Todays ruling confirmed no laws were broken, a ruling that was previously stated by both a state and federal judge,\" Walker spokeswoman AshLee Strong said. \"It is time to move past this unwarranted investigation that has cost taxpayers hundreds of thousands of dollars.\", The case centers on political activity conducted by the Wisconsin Club for Growth and other conservative organizations during the recall, which was spurred by Democrats anger over Walkers law that effectively ended collective bargaining for most public workers. The justices cited free speech, ruling that state election law is overbroad and vague in defining what amounts to \"political purposes.\", In the majority opinion, Justice Michael Gableman, part of the courts conservative majority, praised conservative groups for challenging the investigation, saying it was fortunate that prosecutors targeted \"innocent citizens who had both the will and the means to fight the unlimited resources of an unjust prosecution.\", Wisconsin Gov. Scott Walker says he supported a policytheBoy Scouts of America recently overturned that banned gay leaders for all troops. Im an Eagle Scout. My kids were in Scouts. My mom was a den mother, he told reporters while campaigning for the 2016 presidential election in Las Vegas... Wisconsin Gov. Scott Walker says he supported a policytheBoy Scouts of America recently overturned that banned gay leaders for all troops. Im an Eagle Scout. My kids were in Scouts. My mom was a den mother, he told reporters while campaigning for the 2016 presidential election in Las Vegas... Prosecutors alleged the groups and the campaign coordinated on issue advocacy, communications that do not expressly call for a candidate to be elected or defeated, and should have reported their spending and abided by fundraising limits. They denied any wrongdoing. The court ruled that regulations governing coordination for political purposes must be limited to express advocacy that calls on voters to cast ballots for or against specific candidates. With that limitation in place, Wisconsins law does not prohibit any of the coordination the prosecutors believe was illegal. \"To be clear, this conclusion ends the John Doe investigation because the ... prosecutors legal theory is unsupported in either reason or law,\" Gableman wrote. \"Consequently, the investigation is closed.\", In an email to The Associated Press, lead prosecutor Francis Schmitz said he was disappointed with the ruling. \"The decision represents a loss for all of the citizens of Wisconsin,\" he said. \"It defies common sense that a Wisconsin resident of average means who gives $25 to a campaign has his or her name publicly reported under the law but, according to this decision, someone who gives, for example, $100,000 to a group which closely coordinates with the same campaign can remain anonymous.\", Scott Walker, who formally entered the 2016 presidential race Monday, is where he has been for months. Along with Jeb Bush and Marco Rubio, hes one of the three most likely to win the Republican nomination. After a brief surge early this year, the Wisconsin governor hasnt moved any further ahead.... Scott Walker, who formally entered the 2016 presidential race Monday, is where he has been for months. Along with Jeb Bush and Marco Rubio, hes one of the three most likely to win the Republican nomination. After a brief surge early this year, the Wisconsin governor hasnt moved any further ahead.... Justice Shirley Abrahamson, one of two liberals on the seven-member court, sharply disagreed in a dissent that accused the majority of a faulty interpretation of state law. \"The majority opinion delivers a significant blow to Wisconsins campaign finance law and to its paramount objectives of stimulating vigorous campaigns on a fair and equal basis and providing for a better informed electorate,\" Abrahamson wrote. Republicans had called the investigation, launched by Democratic Milwaukee County District Attorney John Chisholm, a partisan witch hunt. The Wisconsin Club for Growth and its director, Eric OKeefe, filed a federal civil rights lawsuit last year seeking to halt the probe, arguing that the investigation violated their free speech rights. U.S. District Judge Rudolph Randa sided with the club, but a federal appellate court later tossed out the lawsuit, saying the issue belonged in state courts. The club and OKeefe then turned to the state Supreme Court, which is controlled by a four-justice conservative majority. Todd Graves, an attorney for the club, cheered the ruling. He said the group and OKeefe were \"improperly forced to defend themselves against the wide-ranging investigation\" because of their support for Walkers policy agenda. The courts four conservatives  Gableman, David Prosser, Annette Ziegler and Patience Roggensack  formed the majority in Thursdays ruling. Abrahamson was joined in a separate dissent by swing justice Patrick Crooks. The courts other liberal justice, Ann Walsh Bradley, recused herself because her son works for a law firm involved in the case. The high courts partisan nature has long been exceptionally public, including a physical confrontation between Prosser and Bradley in 2011 and, just months ago, a bitter transition in leadership as Roggensack took over as chief justice from Abrahamson. At least three groups named in the probe spent millions in recent years to support the conservative justices in elections, and Schmitz in February asked at least two unnamed justices to recuse themselves to avoid the appearance of impropriety. The justices did not respond. Howard Schweber, an associate professor of political science and legal studies at the University of Wisconsin-Madison, said prosecutors could seek review by the U.S. Supreme Court, possibly arguing bias. Schmitz declined to comment on the prospects of an appeal. Associated Press]", "Date": "20150716", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-scott-walker-investigation-20150716-story.html", "Title": "[ Wisconsin court ends probe of presidential hopeful Scott Walker ]"}