{"Content": "[ More than three years ago, Rod Blagojevich stood with his family on the steps of his Chicago bungalow and vowed to dozens of supporters to fight to overturn his conviction on corruption charges and his 14-year prison sentence. On Tuesday, 1,224 days after the disgraced former governor checked in to a federal prison in Colorado, his lawyers staged a news conference at the same spot on the Northwest Side. This time, however, there were no cheering crowds or autographs to be signed. The pained look on the faces of Blagojevichs wife, Patti, and 18-year-old daughter, Amy, spoke volumes. In a long-awaited ruling just hours earlier, a federal appeals court in Chicago threw out five of the 18 counts against Blagojevich and ordered his sentence vacated. The three-judge panel tempered the small legal victory by calling the evidence against Blagojevich \"overwhelming\" and making it clear he will likely remain locked up for years to come. The same judge who imposed the original sentence  a frequent target of the defense for his alleged unfairness  will still decide his punishment. Calling her husband an eternal optimist, a somber Patti Blagojevich said she broke news of the ruling to the former governor, who is more than three years into his sentence. \"This has been a long road for our family. Weve waited a long time for this decision. We are very disappointed,\" Patti told reporters. \"Theres been so much in the last 3 years that Rods missed  high school graduations, proms, birthdays  and so if theres any silver lining for us its that possibly this is a step in the right direction to getting him home with us and with his girls where he belongs.\", As she listened, Amy began to cry, resting her head on her moms shoulder. Blagojevichs lawyers blasted the ruling as legally unsound and said theyd consider asking the full 7th Circuit U.S. Court of Appeals to rehear the case or possibly filing an appeal before the U.S. Supreme Court  both considered long shots at best. The ruling came 19 months after oral argument, and at 23 pages, it was surprisingly concise. Its author, Judge Frank Easterbrook, said the court could have produced \"a book-length opinion\" because of the complexities of Blagojevichs two trials but chose to stick to \"the most important facts\" and the \"principal arguments\" of the lawyers. Blagojevichs appellate attorney, Leonard Goodman, said he was stunned that the court didnt address many of the issues and alleged evidentiary errors that the former governors appeal raised. \"And the ones it does address it gets it wrong,\" said Goodman, referring in particular to the trial judges decision to exclude testimony from Blagojevich that he believed his actions were lawful. \"So its shocking to me that after a year and a half this could be the result of the courts work.\", The ruling left uncertain how Blagojevichs fate would ultimately be resolved. Prosecutors could opt against a third trial, throw out the five overturned counts and proceed to a resentencing on the remaining convictions. If prosecutors elect to drop the counts that were thrown out on appeal, then U.S. District Judge James Zagel, who presided over two criminal trials for Blagojevich, should \"proceed directly to resentencing,\" the opinion stated. \"It is not possible to call the 168 months unlawfully high for Blagojevichs crimes, but the district judge should consider on remand whether it is the most appropriate sentence,\" Easterbrook wrote in the unanimous opinion. In ordering a sentencing redo, the judges indicated that Blagojevich might not expect a more generous outcome from Zagel this time around. The U.S. attorneys office in Chicago had no immediate comment Tuesday. Both U.S. Attorney Zachary Fardon and his top assistant, Joel Levin, likely wont be involved in deciding how the office responds to the courts ruling because of conflicts of interest. Both represented clients connected to the Blagojevich case while in private practice. Jeffrey Cramer, a former federal prosecutor, said the ruling wasnt a vindication for Blagojevich \"by any stretch of the imagination,\" noting the court did not find that he was wrongfully convicted. \"This is a technicality on jury instructions,\" he said of the decision. Cramer said the government will almost certainly throw out the five counts reversed by the court and attempt to defend the 14-year prison sentence Zagel already handed down. In fact, the court noted that Zagel had already found that the original sentence called for under federal guidelines was too harsh. \"He had already given (Blagojevich) more than half off,\" Cramer said. Blagojevich, now 58, was convicted of misusing his powers as governor in an array of shakedown schemes, most famously for his alleged attempts to sell the U.S. Senate seat vacated by Barack Obama after his 2008 election as president. Blagojevich, incarcerated in a federal prison in suburban Denver since March 2012, is not scheduled to be released until May 2024, according to the Federal Bureau of Prisons website. The appellate court had mulled the ruling since holding oral arguments in December 2013, a delay that led to speculation over a split among the panel of three judges  Easterbrook, Ilana Diamond Rovner and Michael Kanne. Blagojevich has long claimed he was no different than other elected officials who leveraged their political power, and much of the appellate opinion focused on that sometimes gray line between traditional political horse-trading and flat-out bribery. The court ruled that the instructions given to the jury in Blagojevichs second trial should have differentiated between Blagojevichs various schemes to sell the Senate seat, in particular his idea to seek a position in Obamas Cabinet in exchange for appointing longtime Obama adviser Valerie Jarrett. The opinion called that a \"common exercise of logrolling,\" essentially the swapping of political favors. Another aspect of the scheme  to give the seat to Jarrett in exchange for money  represented a much brighter line of criminal activity, the court held. \"The (jury) instructions treated all proposals alike,\" the opinion stated. \"We conclude, however, that they are legally different: a proposal to trade one public act for another, a form of logrolling, is fundamentally unlike the swap of an official act for a private payment.\", The opinion also invoked a key exchange from the 2013 arguments when Easterbrook pressed a federal prosecutor on how Blagojevichs conduct differed from a famous political deal supposedly struck more than 60 years ago: President Dwight Eisenhowers nomination of Earl Warren to the U.S. Supreme Court in exchange for the California governors support in the 1952 election. \"If the prosecutor is right, and a swap of political favors involving a job for one of the politicians is a felony, then if the standard account is true both the President of the United States and the Chief Justice of the United States should have gone to prison,\" the opinion stated. But the opinion was also clear that the evidence against Blagojevich was overwhelming, \"much of it from Blagojevichs own mouth\" as a result of wiretaps on his phone and his rambling testimony in his second trial. The opinion also upheld what perhaps was the most brazen of Blagojevichs extortion and bribery convictions: a deal to name then-U.S. Rep. Jesse Jackson Jr. to the Senate seat in exchange for $1.5 million in campaign cash. While it was forced to reverse convictions on the five counts, the court wrote, prosecutors could focus at a retrial on the then-governors more straightforward efforts to swap Jarretts appointment for money, not a Cabinet post. In his remarks to reporters outside Blagojevichs home, Goodman said he had not yet spoken to Blagojevich so he wasnt sure about the next course of action. But he said his advice to Blagojevich will be to continue to fight the case. \"The evidence that would have acquitted him was excluded at trial, and my advice to the governor is that he should fight on,\" Goodman said. Patrick Collins, another former federal prosecutor who helped secure a corruption conviction against former Gov. George Ryan, said the opinions legacy may be in the way it attempts to draw a clearer distinction between logrolling and behavior that is clearly corrupt. \"It really tries to draw a bright line, and that gives some helpful guidance to politicians, particularly those who operate in the gray zone,\" Collins said. Chicago Tribunes Dawn Rhodes, John Chase and Jeff Coen contributed. jmeisner@tribpub.com, bsecter@tribpub.com, Twitter @jmetr22b]", "Date": "20150721", "Author": "[ Jason Meisner, Bob Secter]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rod-blagojevich-convictions-20150721-story.html", "Title": "[ Some Rod Blagojevich convictions tossed; wife tells him disappointing news ]"}