{"Content": "[ When we think of evil, we think of something violent or demonic, something filled with hatred and wretchedly hungry to devour the good. But what if evil eats a salad at lunch and is polite, speaking rationally with nice table manners?, Ive just seen a video where evil casually spears lettuce on a fork and calmly, scientifically, discusses the market for the body parts of aborted fetuses, while sipping a glass of wine. \"Id say a lot of people want liver,\" Dr. Deborah Nucatola, senior medical director for Planned Parenthood, says in the video. She was speaking of the livers of aborted fetuses and then she popped more greens into her mouth and gestured with her fork. She explained to her luncheon companions  people she apparently thought were buyers of body parts for research but who were secretly recording her  why ultrasound images are so important. Theyre important because they help doctors harvest the organs they want without damaging them. Who wants a crushed liver?, \"And for that reason, most providers will do this case under ultrasound evidence,\" she said, picking up her wine glass, \"so theyll know where theyre putting their forceps.\", Planned Parenthood needs to speak up. An anti-abortion group released a surreptitiously recorded video Tuesday showing a high-ranking Planned Parenthood official sipping wine and munching salad while casually discussing procuring tissue from aborted fetuses for scientific research. The video, which... Planned Parenthood needs to speak up. An anti-abortion group released a surreptitiously recorded video Tuesday showing a high-ranking Planned Parenthood official sipping wine and munching salad while casually discussing procuring tissue from aborted fetuses for scientific research. The video, which... This absolutely horrific video was recorded last year by investigators from the Center for Medical Progress, a California-based group that is opposed to abortion. They allege that federally subsidized Planned Parenthood, the nations largest abortion provider and abortion rights advocate, is illegally selling body parts in violation of the law. The group said it plans to release other video in coming days. Planned Parenthood denies the charge, says the video is heavily edited and says that women seeking abortions may volunteer to provide fetal body parts for research that furthers medical science. Whats chilling is the absolute calmness in her voice. Im certain Dr. Nucatola  enjoying a nice lunch of salad and red wine and discussing organ harvests of the unborn  doesnt consider herself to be evil. Perhaps you dont either. But I do. I have no other way to see it. Youre free to go online and see for yourself. You might see things differently. But the way I see it, the way I hear it, is that this is the way evil works best, not as a growling beast crouching in the darkness, but in a rational, scientific voice. It is the way its always worked, the way it worked years ago, the way it works now. The governors of Georgia and Indiana and Ohios attorney general on Thursday ordered investigations of PlannedParenthood facilities in their states to determine if organs from aborted fetuses were being sold. The state investigations  as well as probes announced Wednesday by three Republican-led... The governors of Georgia and Indiana and Ohios attorney general on Thursday ordered investigations of PlannedParenthood facilities in their states to determine if organs from aborted fetuses were being sold. The state investigations  as well as probes announced Wednesday by three Republican-led... If this were a video of someone roughed up or shot by cops, it would be all over the news. If it were a video of a celebrity wardrobe malfunction, or another chapter of celebrity gender confusion, it would be clicktastic. But this story, which came out Tuesday, was first downplayed by much of the media, then overshadowed, by President Barack Obamas Iran nuclear deal and by the killings of Marines in Chattanooga. Lately, the video has been discussed on safe ground. We talk tactics. What will the Republicans whove called for federal investigations do next? How will the Democrats play defense?, Its all process. And in the business of journalism and politics, the most successful people, the smoothest, know how to talk process. It is sanctuary when we dont wish to deal with the thing itself. Conservatives are publicly angry, but liberals havent handled this well at all. Some have argued for a more strident defense of Planned Parenthoods organ policy. Its obvious that theyd like a good dose of righteous moral indignation. But how do you invoke morality to defend this?, The left has recently celebrated Roman Catholic Pope Francis, who shares their position on global warming. Theyve used the pope as a cudgel in political debate, to mock those who think \"climate change\" is little more than a slogan for big government and redistribution of wealth. So heres my suggestion: Why doesnt the left call the Vatican and ask Pope Francis to weigh in on this one? Ask him when life begins, and if theres any morality in harvesting the organs of fetuses for research. One evolving argument of Planned Parenthood, parroted by their media and political advocates, is that if no profit is made, then it is legal to sell the parts for research, since payment goes to defray expenses in transportation of the fetal organs and other costs. But who cares if its legal? I dont care if its legal. Slavery was legal once too, and not just in America, but just about every other country in the world. The powerful have always legalized their subjugation of the less powerful. And in our the modern world, there is nothing less powerful than life in the womb. Science can make a good argument for harvesting the organs of fetuses. The best argument suggests possible cures for terrible diseases suffered by those whose organs arent harvested. The counter is the story of the drowning man. A dying man in a deep pool of water, drowning, is a terribly dangerous creature. Anyone who goes near can be pushed under as the drowning man tries to stay alive. Even children. Im not trying to convince you. Go find whatever argument you wish in the echo chamber of your choice. But first, take a look at the video again and listen to Planned Parenthoods medical director:, \"Weve been very good at getting heart, lung, liver, because we know that,\" she explains, \"so Im not going to crush that part, Im gonna basically crush below, Im gonna crush above, and Im gonna see if I can get it all intact.\", It is the voice of a professional, enjoying a salad, rationally discussing technique. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150719", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-planned-parenthood-met-0719-20150719-column.html", "Title": "[ Evil with salad and a nice red]"}