{"Content": "[ Ramadi falls. The Iraqi army flees. The great 60-nation anti-Islamic State group coalition so grandly proclaimed by the Obama administration is nowhere to be seen. Instead, its the defense minister of Iran who flies into Baghdad, an unsubtle demonstration of whos in charge  while the U.S. air campaign proves futile and Americas alleged strategy for combating the Islamic State is in free fall. It gets worse. The Gulf states top leaders, betrayed and bitter, ostentatiously boycott President Barack Obamas failed Camp David summit. \"We were Americas best friend in the Arab world for 50 years,\" laments Saudi Arabias former intelligence chief. Note: \"were,\" not \"are.\", We are scraping bottom. Following six years of President Barack Obamas steady and determined withdrawal from the Middle East, Americas standing in the region has collapsed. And yet the question incessantly asked of the various presidential candidates is not about that. Its a retrospective hypothetical: Would you have invaded Iraq in 2003 if you had known then what we know now?, First, the question Is not just a hypothetical, but an inherently impossible hypothetical. It contradicts itself. Had we known there were no weapons of mass destruction, the very question would not have arisen. The premise of the war  the basis for going to the U.N. to the Congress and, indeed, to the nation  was Iraqs possession of weapons of mass destruction in violation of the central condition for the cease-fire that ended the first Gulf War. No WMD, no hypothetical to answer in the first place. One by one, nearly a dozen GOP presidential hopefuls took the stage here last weekend for a Lincoln dinner, each different in style and stature but all joining a rising Republican chorus that lays blame for the Islamic State terrorist group squarely at the feet of President Barack Obama. \"If you... One by one, nearly a dozen GOP presidential hopefuls took the stage here last weekend for a Lincoln dinner, each different in style and stature but all joining a rising Republican chorus that lays blame for the Islamic State terrorist group squarely at the feet of President Barack Obama. \"If you... Second, the \"if you knew then\" question implicitly locates the origin and cause of the current disasters in 2003. As if the fall of Ramadi was predetermined then, as if the author of the current regional collapse is George W. Bush. This is nonsense. The fact is that by the end of Bushs tenure, the war had been won. You can argue that the price of that victory was too high. Fine. We can debate that until the end of time. But what is not debatable is that it was a victory. Bush bequeathed to Obama a success. By whose measure? By Obamas. As he told the troops at Fort Bragg on Dec. 14, 2011, \"We are leaving behind a sovereign, stable, and self-reliant Iraq, with a representative government that was elected by its people.\" This was, said the president, a \"moment of success.\", Which Obama proceeded to fully squander. With the 2012 election approaching, he chose to liquidate our military presence in Iraq. We didnt just withdraw our forces. We abandoned, destroyed or turned over our equipment, stores, installations and bases. We surrendered our most valuable strategic assets, such as control of Iraqi airspace, soon to become the indispensable conduit for Iran to supply and sustain the Assad regime in Syria and cement its influence all the way to the Mediterranean. And, most relevant to the fall of Ramadi, we abandoned the vast intelligence network we had so painstakingly constructed in Anbar province, without which our current patchwork operations there are largely blind and correspondingly feeble. Jeb Bush sharply criticized President Barack Obama on Tuesday for withdrawing troops from Iraq, but he declined to say whether he would order additional ground forces into the country to repel Islamic State militants.Speaking to about 60 business and Republican leaders in New Hampshire, the former... Jeb Bush sharply criticized President Barack Obama on Tuesday for withdrawing troops from Iraq, but he declined to say whether he would order additional ground forces into the country to repel Islamic State militants.Speaking to about 60 business and Republican leaders in New Hampshire, the former... The current collapse was not predetermined in 2003 but in 2011. Isnt that what should be asked of Hillary Clinton? We know you think the invasion of 2003 was a mistake. But what about the abandonment of 2011? Was that not a mistake?, Madam Secretary: When you arrived at State, al-Qaida in Iraq had been crushed and expelled from Anbar. The Iraqi government had, from Basra to Sadr City, fought and defeated the radical, Iranian-proxy Shiite militias. Yet today these militias are back, once again dominating Baghdad. On your watch, we gave up our position as the dominant influence over a \"sovereign, stable, and self-reliant Iraq\"  forfeiting that position gratuitously to Iran. Was that not a mistake? And where were you when it was made?, Iraq is now a battlefield between the Sunni jihadists of the Islamic State and the Shiite jihadists of Irans Islamic Republic. There is no viable center. We abandoned it. The Obama administrations unilateral pullout created a vacuum for the entry of the worst of the worst. And the damage was self-inflicted. The current situation in Iraq, says former CIA Director David Petraeus, \"is tragic foremost because it didnt have to turn out this way. The hard-earned progress of the surge was sustained for over three years.\", Do the math. Thats 2009 through 2011, the first three Obama years. And then came the unraveling. When? \"Starting in late 2011,\" says Petraeus. Want to do retrospective hypotheticals? Start there. Washington Post Writers Group, Charles Krauthammer is a Washington Post columnist. letters@charleskrauthammer.com]", "Date": "20150521", "Author": "[ Charles Krauthammer]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iraq-obama-iran-clinton-ramadi-krauthammer-perspec-0522-jm-20150521-story.html", "Title": "[ Why Obama deserves the bulk of the blame for Iraq]"}