{"Content": "[ Black leaders called Tuesday for Indianapolis to equip its police with body cameras, two days after officers fatally shot a 15-year-old carjacking suspect in a confrontation authorities said wasnt captured by any department cameras. The Rev. Charles Harrison of the anti-crime group Ten Point Coalition met Tuesday with Indianapolis police chief about Sundays shooting of Andre Green. He said afterward that outfitting the citys patrol officers with body cameras would serve both the police and the publics interests. After a successful pilot program with body cameras, Indianapolis proposed 2016 budget will in fact include a request for them as well as funding for \"small number\" of dashboard cameras for police cars when the spending plan is detailed Monday, said Jen Pittman, a spokeswoman for Mayor Greg Ballard. Harrison said hes concerned about the lack of police footage of Greens shooting, which police said took place when officers felt threatened when the teen accelerated toward them in a car that had been stolen at gunpoint. \"Because we dont have any video of that, theres some people who are going to be distrustful of the polices account of what happened, wondering what really happened,\" Harrison said. \"When you have a 15-year-old black male killed in a police action shooting, thats certainly a concern.\", The shooting happened the same weekend as events marking the one-year anniversary of the death of Michael Brown, an unarmed, black 18-year-old who was fatally shot by a white police officer in Ferguson, Missouri. Browns death galvanized the \"Black Lives Matter\" movement. Indianapolis Metropolitan police officers shot and killed a teenager on the citys northeast side late Sunday night. Police say the officers were following a car from a armed carjacking earlier in the night. (WXIN Indianapolis), Indianapolis Metropolitan police officers shot and killed a teenager on the citys northeast side late Sunday night. Police say the officers were following a car from a armed carjacking earlier in the night. (WXIN Indianapolis), Indiana Black Expo President Tanya Bell said equipping officers with body cameras would \"provide more transparency for our community.\", \"Body cams are also known to reduce officer shootings and deter officers from inappropriate conduct,\" Bell said in a joint statement with Dr. Michael Twyman, executive director of Your Life Matters. Harrison said he also wants the city to outfit its patrol cars with dashboard cameras to provide additional footage of police actions. Assistant Police Chief Lloyd Crowe has said only a small number of the departments vehicles currently have dashcams, and none was in use when officers shot Green. Pittman said Mondays budget request for police cameras will primarily seek to equip the citys roughly 900 patrol officers with body cameras. She said a recently completed pilot program was a success that opened the door to the citys planned, department-wide push for body cameras. Equipping those patrol officers with body cameras and implementing that program is expected to cost the city about $2 million over the programs first three to five years, she said. The proposed budget for that program will include both city funding and expected federal matching grants for the cameras, Pittman said. It begins with a relatively minor incident: A traffic stop. A burglary. A disturbance. Police arrive and tensions escalate. It ends with an unarmed black man shot dead. That pattern played out in March in Madison, Wisconsin, where police responded to reports of a man yelling and jumping in traffic. It begins with a relatively minor incident: A traffic stop. A burglary. A disturbance. Police arrive and tensions escalate. It ends with an unarmed black man shot dead. That pattern played out in March in Madison, Wisconsin, where police responded to reports of a man yelling and jumping in traffic. The three officers involved in the teenagers shooting are on administrative leave, and the internal affairs unit is investigating. Police said two passengers fled from the stolen car shortly before Green was fatally shot by officers after the car had struck the side of a police car and was accelerating again. Crowe said the teen had a handgun as he left the car after being shot, and that weapon was found near his body after he collapsed outside the car. Police said forensic tests are still being conducted to determine whether that gun was used to fire four shots from the car shortly after it was carjacked. No one was struck by those bullets. At the time of his death, Green was wearing an electronic ankle bracelet required under the terms of his probation after he pleaded guilty in May to juvenile charges of auto theft and criminal mischief, Marion County juvenile court records show. Those records show Green was a habitual runaway and was found in July to have violated the terms of his probation in the auto theft case. Associated Press]", "Date": "20150811", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-indianapolis-police-shooting-andre-green-20150811-story.html", "Title": "[ Indianapolis leaders seek body cameras for officers after fatal shooting of 15-year-old]"}