{"Content": "[ Each year, Lincoln-Way North High School kicks off the school year with an assembly where the principal burns a list of the previous years accomplishments to signify the possibilities the future year holds. This year was no different, but the tradition was a bit more poignant as students returned for the last first day of the school year at North. School board members last week voted to close North at the end of the academic year. The controversial decision was made to help the districts finances. During an assembly to welcome back students, Lincoln-Way North High School Principal Mark Cohen encouraged students to make Norths last year its best. \"It was therapeutic ... to put the past behind us,\" Cohen said of burning the accomplishments list. \"You cant continue to focus on the negative. This is a tough situation; theres no getting around it ... but our kids are tougher.\", The State Board of Education this spring placed District 210 on its watch list of financially troubled districts in light of its large budget shortfall. The district must submit a deficit reduction plan to the state board by September, explaining how it intends to eliminate the districts annual deficit spending within a three-year period. Lincoln-Way North Principal Dr. Mark Cohen greets students on the first day of the schools last year. Wednesday, Aug. 19, 2015, in Frankfort. (supplied photo), Lincoln-Way North Principal Dr. Mark Cohen greets students on the first day of the schools last year. Wednesday, Aug. 19, 2015, in Frankfort. (supplied photo), School board members were faced with limited options  closing a school, a 5 percent property tax rate increase in each of the next two years, or eliminating courses and extracurricular activities. District officials have estimated that closing a school will end the districts annual deficit spending by the 2017-18 school year. Earlier this month, the Lincoln-Way District 210 school board took the drastic measure of deciding to close North as a way to save $5.2 million annually, reverse the districts deficit spending and get it off the states financial watch list. Students Wednesday said while they were sad about the school closing, they were looking forward to the school year. Typical high school activities  like homecoming, sporting events and the Mr. and Miss Phoenix competition  topped this years anticipated highlights with students saying they expected all to be the best as North closed out its last school year before its students transition to Lincoln-Way East next school year. Despite 11th-hour pleas, Lincoln-Way District 210 officials decided to shutter Lincoln-Way North High School next year, in a drastic move aimed at shoring up the cash-strapped school districts finances. In a district that once thrived on new growth, the school board voted 5-2 to close the school.... Despite 11th-hour pleas, Lincoln-Way District 210 officials decided to shutter Lincoln-Way North High School next year, in a drastic move aimed at shoring up the cash-strapped school districts finances. In a district that once thrived on new growth, the school board voted 5-2 to close the school.... \"Our job is to make this the best year ever and to keep the spirits high so the juniors remember their days at North and continue with the same pride as they start at East (next year),\" student council President Matt Cooke said after Wednesdays assembly. Students said spirits were high during the assembly and that Cohens remarks to students drew many standing ovations. \"There were times I felt like I was going to cry,\" senior Kassidy Champlin said. Champlin, who is involved in several musical activities at North, said she plans to work in other activities  such as sporting events  she hasnt normally attended and hoped others would try getting involved in new groups or attend events they normally would not have in the past so that students could grow closer as a school family. \"Im looking forward to it,\" said senior Patrick Troike, who plays football and baseball. \"All the seniors know we have to go out with a bang; were going to make the best of every moment.\", Cohen said he plans to work with students to discuss events and activities for Norths last year. He already plans to bring back some of the school alumni for events at the school. Cohen also said he will be working with Lincoln-Way East to map out transition plans. \"We dont want people to be strangers,\" Cohen said. Cohen has encouraged students, letting them know that the building they are in is not as important as the relationships students and staff have with each other. \"Bricks and mortar make up the house,\" he said. \"It doesnt matter where you relocate as long as your family is together.\", Alicia Fabbre is a freelance reporter for the Daily Southtown.]", "Date": "20150819", "Author": "[ Alicia Fabbre]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-lincolnway-north-first-day-st-0820-20150819-story.html", "Title": "[ Entering final year for Lincoln-Way North, students stay positive]"}