{"Content": "[ The Hinsdale High School District 86 Board approved more than 30 protocols for how they will interact with district staff, community members and each other. But some board members are not in agreement, with board member Edward Corcoran saying the protocols are not necessary and merely create more bureaucracy. Board member Claudia Manley believes that some of the protocols violate the terms of a 2013 settlement agreement District 86 reached with former board member Dianne Barrett, who filed a lawsuit to listen to the tape of a closed session meeting she did not attend, and have access to special education documents. The agreement stated not only that board members may listen to recordings of closed sessions regardless of whether they attended the meeting, but also that board members shall have \"unlimited access to documents necessary and relevant\" to their official duties, with no requirement that any reason for the request be stated. Board President Kay Gallo said the purpose of the protocols was to establish \"some standards and norms\" so the board could operate more efficiently. For example, Gallo said, members should come to the meetings prepared. \"Its basic common sense which is not so common anymore, \" Gallo said. The protocols were drafted during special board meetings July 10 and July 11 at the districts administration center under the guidance of a representative of the Illinois Association of School Boards. The video of an encounter among Claudia Manley, a Hinsdale South High School senior and a Hinsdale South parent has been released by Hinsdale High School District 86. July 20, 2015. (Chicago Tribune), The video of an encounter among Claudia Manley, a Hinsdale South High School senior and a Hinsdale South parent has been released by Hinsdale High School District 86. July 20, 2015. (Chicago Tribune), Manley and Corcoran did not participate in the special meetings, but raised their concerns July 20 when a vote was taken. Board members Bill Carpenter and Ralph Beardsley attended the July 10 and July 11 meetings, but were not at the July 20 meeting. One protocol the board approved reads \"If one board members request is estimated to take more than 30 minutes of staff time to prepare the information, the request will go to the full board for consensus.\", Manley said a half-hour is not an unreasonable amount of time for an employee to spend on an issue that concerns a board member. The restriction infringes on a board members ability to do their fiduciary duty, Manley said. Corcoran said he thinks the time limit is a ploy to silence the minority and people looking for information. Board member Kathleen Hirsman said the intent was to conduct meetings more efficiently and not squelch anyones access to the staff. Manley and Corcoran also did not agree with the protocol that states \"board members will not email other board members stating their thoughts or opinions on any board-related matter.\", The Hinsdale High School District 86 Board still has not complied with an Illinois Attorney Generals Office directive to release a security camera video, and plans to discuss the matter behind closed doors on Monday. Board President Kay Gallo said the matter, which was not on Mondays agenda, will... The Hinsdale High School District 86 Board still has not complied with an Illinois Attorney Generals Office directive to release a security camera video, and plans to discuss the matter behind closed doors on Monday. Board President Kay Gallo said the matter, which was not on Mondays agenda, will... They said that protocol violates their constitutional rights to freedom of speech and freedom of association. However, Gallo said Tuesday, when board members start emailing each other its a slippery slope. \"Its so easy to get caught up in a dialogue,\" Gallo said. Two board members talking about district matters does not violate the Open Meetings Act, \"but we were thinking about the spirit of the Open Meetings Act,\" Gallo said. \"We should be having this conversation in public between all seven members, not in emails between board members.\", One protocol the board unanimously approved states the board president is the spokesperson for the board to the media and the superintendent is the spokesperson for the district. Manley voted in favor of those guidelines after she confirmed that individual board members are not prohibited from answering reporters questions individually. Regarding the protocol that says members have a right to disagree with a decision of the board, \"but will support the board in its decision by abiding by the will of the majority,\" Corcoran and Manley said they would not support an opinion with which they did not agree. Corcoran added he would not undermine the decision. Hirsman pointed out that Corcoran and Manley could have raised all these objections at the meetings when the board members debated in detail the wording, intent and possible effects of the protocols proposed. The July 10 meeting lasted two and a half hours, the vast majority in closed session. It covered the boards self-evaluation, protocols, roles and responsibilities, and legacy. The Saturday, July 11 meeting lasted nearly three hours, more than an hour of which was spent discussing the protocols. Corcoran went to the July 10 meeting and asked that the board conduct the meeting in public, not in executive session, because nothing on that agenda should be confidential. No one seconded his motion, so Corcoran did not participate in the executive session. The argument for doing self-evaluations behind closed doors is it may allow board members to more frankly discuss their personalities, habits and the way they work together. Manley said she had to work July 10 and could not attend. Corcoran said he was out of town on Saturday, July 11. He planned to participate by phone, but the board was unable to reach him. kfornek@pioneerlocal.com, Twitter: @kfdoings]", "Date": "20150722", "Author": "[ Kimberly Fornek]", "Link": "http://www.chicagotribune.com/suburbs/hinsdale/news/ct-dhd-d86-board-protocol-tl-0723-20150722-story.html", "Title": "[ New Hinsdale District 86 Board majority pushes new protocols]"}