{"Content": "[ Donald Trump couldnt resist being himself. That made him a dominant force in the first Republican presidential debate, reinforcing his image as a bully in an evening that produced fireworks, but probably changed nothing. The bombastic businessman, who had vowed to rise above the fray in this debate, got down and dirty from the beginning. He was the only candidate who refused to promise that he wouldnt run as a third-party candidate if he loses the nomination. He was negative, even insulting, particularly in response to a question about coarse things hed said about women. Trump certainly didnt broaden his appeal. His bluster made it more difficult for anyone else to make a strong impression, though Ted Cruz, the conservative Texas senator, made the most effective case to the partys powerful right wing. Gov. John Kasich of Ohio effectively conveyed his optimistic, can-do brand of moderate conservativism. Jeb Bush left virtually no mark. Others, from Mike Huckabee, the populist former Arkansas governor, to Ben Carson, a neurosurgeon, had their moments, but not enough of them to boost their relatively low poll ratings. Likewise, Gov. Chris Christie of New Jersey attacked Sen. Rand Paul of Kentucky for opposition to domestic government surveillance in pursuit of terrorists, with both probably appealing mainly to their limited bases of support. The candidates didnt break substantive new ground, echoing well-advertised stands and familiar attacks on President Barack Obama and Hillary Clinton, the front-runner for the 2016 Democratic presidential nomination. The best early guess and this is hazardous is that this heavily promoted debate left the race basically the same as it was a day ago, with Trump losing a little and Cruz gaining a bit. The debate, held in Cleveland, was limited to the top 10 contenders as measured by recent national polls. The other seven aspirants faced off separately four hours earlier, a contest also televised by Fox News. The Republican establishment got its wishes when Carly Fiorina won the most praise from the early event. Jeb Bush hadnt debated political foes since 2002. In the early months of this presidential race, hes at times seemed uncertain, out of practice. But in Thursday nights debate he spoke with candor and took risks. Why so? We credit the man to Bushs right, the carnival barker who  like or loathe... Jeb Bush hadnt debated political foes since 2002. In the early months of this presidential race, hes at times seemed uncertain, out of practice. But in Thursday nights debate he spoke with candor and took risks. Why so? We credit the man to Bushs right, the carnival barker who  like or loathe... Republicans want a woman in the contest and relish Fiorinas attacks on Hillary Clinton. But few think she has any chance to win the nomination; some in the party and the press have been pushing her for months, and she barely registers in polls. A former chief executive of Hewlett-Packard, she was clobbered in her one political race, for the Senate in California. Recent history cautions against attaching too much significance to the opening debating rounds. There will be at least eight more Republican debates. During the first Republican debate four years ago, Republican strategist Frank Luntz held a focus group to gauge the reaction. The runaway winner was Herman Cain, a pizza executive. In the next few sessions a big splash was made by Michele Bachmann, a Minnesota congresswoman at the time. These were fleeting moments. Cain dropped out before any votes were cast, and Bachmann quit after a dismal showing in the initial Iowa caucuses. Four years earlier, the first Democratic face-off, featuring Barack Obama, Hillary Clinton and six others, was also swiftly forgotten. The New York Times called it a \"surprisingly sedate and meandering affair.\" Polls subsequently showed Clinton with a 2-to-1 advantage over Obama. The theatrical drama of the first Republican debate Thursday focused on the man at center stage in Cleveland, Donald Trump, and the bombastic rhetoric he has used to propel himself to the front of the GOP field. But when the Republicans return to the same arena next summer for their convention,... The theatrical drama of the first Republican debate Thursday focused on the man at center stage in Cleveland, Donald Trump, and the bombastic rhetoric he has used to propel himself to the front of the GOP field. But when the Republicans return to the same arena next summer for their convention,... Bloomberg, Albert R. Hunt is a Bloomberg View columnist.]", "Date": "20150807", "Author": "[ Albert R. Hunt]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-republican-debate-20150807-story.html", "Title": "[ Debate fireworks that won't make much impact]"}