{"Content": "[ Illinois Senate President John Cullerton hopes to pass legislation Tuesday designed to \"crash\" the states public school funding formula in two years to save it. The measure, Senate Bill 318, would freeze the property tax for two years and create a panel of Democratic and Republican lawmakers (each with an equal number of votes) to devise a new system of funding public education that would not rely as heavily on the property tax  with the ultimate goal of raising more money for public schools and spending more of it in poorer school districts. If the bipartisan commission failed to come up with a solution, Illinois current school aid formula, which distributes hundreds of millions of dollars to public school districts, would sunset and be repealed on June 1, 2017. The idea is to create such a devastating crisis that lawmakers would devise a solution before the deadline arrived. The states school funding crisis, much like the pension crisis that Illinois faces, has been building for three decades. Illinois relies more heavily on the property tax to fund public education than any other state. That has resulted in skyrocketing property tax bills that have homeowners fuming and a disparity in school funding between rich and poor districts that has become a national embarrassment. Rikeesha Phelon, Cullertons spokeswoman, said Cullerton has been discussing his plan with Gov. Bruce Rauner for months. Rauner campaigned for office promising to freeze property tax levies and spend more money on public education, despite the states unresolved $100 billion-plus pension debt. But Cullerton, D-Chicago, has failed to get Rauners support for the measure, Phelon said, because the governor has demanded that changes in collective bargaining rights for government employees be included in the bill. Democratic legislators find those changes unacceptable. Chicago taxpayers shouldnt be forced to choose between educating our children and paying for the retirement of our teachers. But thats the position were in today. This week, Illinois Senate President John Cullerton, D-Chicago, will once again try to pass legislation providing some state help... Chicago taxpayers shouldnt be forced to choose between educating our children and paying for the retirement of our teachers. But thats the position were in today. This week, Illinois Senate President John Cullerton, D-Chicago, will once again try to pass legislation providing some state help... The problem of out-of-control property tax levies was acknowledged by former Gov. Pat Quinn, a Democrat, and created a political opportunity that was seized by Rauner, who vowed to freeze the levies if elected last November. Illinois school reform activists have been trying for many years to change the way the state finances its public schools, with thousands of parents marching on Springfield demanding change back in the 1990s. Governors of both political parties have formed blue-ribbon panels to study the issue and then rejected the recommended solutions, which always called for a massive increase in state education spending. You would be hard-pressed to find anyone in public office willing to defend the states current method of funding the schools. Thats likely one reason Cullerton feels confident he has the votes to pass his measure in the Senate, which has a Democratic majority, although hes unsure if any Republican will vote \"yes.\", Even if the Senate passes the bill, its fate in the House is far from certain. House Speaker Michael Madigan, D-Chicago, has repeatedly killed Senate attempts to pass school funding reform in the past. Illinois Senate President John Cullerton spent an hour with the Tribune Editorial Board on Wednesday. There were no injuries. Cullerton came with an agenda  more on that in a minute  and endured our questions on other matters. Not once did he use the word \"extreme\" to describe Gov. Bruce Rauner.... Illinois Senate President John Cullerton spent an hour with the Tribune Editorial Board on Wednesday. There were no injuries. Cullerton came with an agenda  more on that in a minute  and endured our questions on other matters. Not once did he use the word \"extreme\" to describe Gov. Bruce Rauner.... Madigan refused to call a Senate reform bill out of committee several years ago that would have increased the state income tax specifically to fund education. That measure was sponsored by former state Sen. James Meeks, D-Chicago, who ended up working on Rauners election campaign last year and is now president of the state board of education. Cullertons latest school reform proposal provides no new mechanism for raising money for public education. Yet it provides $74 million in new education spending for public schools, an attempt to match a figure for increased school funding that Rauner called for earlier this year. The bill also would require the state to pay the employers cost of Chicago teachers pensions as a continuing appropriation. In fiscal year 2015-16, that would be $197 million. As you may have heard, Illinois lacks enough money to pay for current services. A budget appropriation measure passed by the legislature this spring would spend nearly $4 billion more than the state anticipates in revenue. Rauner vetoed that budget, and he and Democratic legislative leaders have been in a stalemate ever since. But Cullerton apparently remains convinced that Rauner is so serious about improving education and freezing the property tax that he could eventually be moved to endorse such a proposal. I cant help feeling its yet another indication of just how political leaders in this state have failed the people they are elected to serve. At the heart of this argument over adequate state funding for education is the simple belief that every child, no matter where he is born, deserves a decent education. The playing field will never be level for every kid, and we all know that. But as a society, we owe each child a chance, if he or she is willing to take advantage of it, to succeed in life. That may simply mean staying in school longer. Or it could mean going on to college. In either case, it likely means mor earning power, which in turn means a citizen who can pay taxes, afford to raise a family and have a better chance of staying out of prison and off welfare. And that could even lead to fewer children having children, and more parents accepting their responsibilities as adults later in life. \"The school aid formula will crash if this bill passes, and the commission fails to come up with a replacement,\" Phelon said. Nearly 20 years ago, former state Sen. Patrick OMalley, a conservative Republican out of Palos Park, suggested something along similar lines. The only way to fix the school funding problem is to blow it up, OMalley told me. Wipe the slate clean. Get rid of the property tax, the school aid formula and start from ground zero. That sounded sort of crazy at the time. And Cullertons plan really doesnt go anywhere near that. The property tax would still be collected. And if the commission created by the bill fails to come up with a solution, the state board of education would likely still be allowed to distribute state funds to public schools, although whatever formula it would use to do that would likely be ripe for a legal challenge. Its unlikely this bill will go anywhere beyond the Senate. But its worth noting that Cullerton, considered something of a moderate in the Rauner-Madigan stand off, is proposing such an extreme measure. People who have yet to understand what a disaster the states school funding policy has been ought to take note. \"Why didnt anyone tell us about this pension crisis years ago?\" Ive heard residents of Illinois complain. For 30 years, Ive been trying to warn people that Illinois was failing its public schoolchildren. The Illinois Constitution makes the obligation plain: \"The State shall provide for an efficient system of high-quality public education institutions and services.\" It goes on to say that the state \"has the primary responsibility for financing the system of public education.\", The property tax pays for more than two-thirds of the cost of public schools in Illinois. The state kicks in less than one out of every $3 spent. Theres no way thats accepting the \"primary responsibility\" for financing its public schools. I remind you that Illinois was shorting the schools of money at the same time it was failing to make required payments into its pension plans for its employees. As for providing that \"high quality of education\" as promised in the state constitution, you be the judge of whether we have lived up to that. pkadner@tribpub.com]", "Date": "20150803", "Author": "[ Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-school-funding-st-0804-20150803-story.html", "Title": "[ Kadner: School reform bill threatens to 'crash' system]"}