{"Content": "[ A letter a detained Washington Post journalist wrote to U.S. President Barack Obama and a trip he made to the U.S. Consulate in Dubai have become major topics of his espionage trial in Iran. Jason Rezaian, the Posts 39-year-old bureau chief in Tehran, is being tried in a Revolutionary Court on allegations of \"espionage for the hostile government of the United States\" and propaganda against the Islamic Republic, Irans official IRNA news agency has reported. The Post has said he faces 10 to 20 years in prison if convicted. The Post, U.S. diplomats and media rights organizations have criticized Rezaians detention and the handling of the case. His trial also comes amid ongoing negotiations between Iran and world powers over its contested nuclear program. At his first hearing Tuesday, Irans semiofficial Mehr news agency reported that a Farsi translation of the letter Rezaian wrote to Obama was read aloud. The agency said one passage read: \"In Iran, Im in contact with simple laborers to influential mullahs.\", Mehr said the letter also talked about Rezaians \"network of contacts inside Iran.\" The agency also reported Judge Abolghassem Salavati questioned Rezaian about his contact with the U.S. Consulate in Dubai in the United Arab Emirates. Rezaians brother, Ali Rezaian, earlier told The Associated Press in Washington the letter was an online form letter his brother wrote after Obamas election in 2008 and that he visited the consulate to get a U.S. visa for his wife. Mehr said Rezaian rejected the charges against him during the hearing. Jason Rezaian, who attended Wheaton South High School, is on trial on charges of espionage in Iran for spying. On May 26, 2015, he began the first day of the closed-door trial. (WGN TV), Jason Rezaian, who attended Wheaton South High School, is on trial on charges of espionage in Iran for spying. On May 26, 2015, he began the first day of the closed-door trial. (WGN TV), \"Im only a journalist,\" Mehr quoted Rezaian as saying. \"All my activities were as a journalist and all were legal.\", Mehr also reported the judge questioned Rezaian about his contacts with American journalist Lara Setrakian, which the agency said asked him to provide reports on his assessment of the political, economic and social situation in Iran to her to be forwarded to U.S. government officials. Setrakian, a journalist who co-founded of the website SyriaDeeply, strongly rejected the allegation Wednesday. \"As journalists, Jason and I have spoken often about the Middle East, but at no point did we prepare reports for the White House or do anything aside from professional reporting,\" she said in a statement. Rezaian, his wife Yeganeh Salehi and two photojournalists were detained on July 22 in Tehran. All were later released except Rezaian, who was born and spent most of his life in the United States, and who holds both American and Iranian citizenship. Iran does not recognize other nationalities for its citizens. Brian Stetler and Matt Brandseth, graduates of Wheaton South High School, were stunned when they learned a long-time friend was imprisoned and accused of espionage by the Iranian government. During their first two years of high school, Stetler and Brandseth became fast friends with Jason Rezaian,... Brian Stetler and Matt Brandseth, graduates of Wheaton South High School, were stunned when they learned a long-time friend was imprisoned and accused of espionage by the Iranian government. During their first two years of high school, Stetler and Brandseth became fast friends with Jason Rezaian,... Salehi has been barred from traveling abroad, the Post said, adding that its requests for a visa for a senior editor to travel to Iran went unanswered. Last week, Rezaians lawyer said Salehi, who is a reporter for The National newspaper in the United Arab Emirates capital of Abu Dhabi, and a freelance photographer who worked for foreign media, also will stand trial. The photographers name has not been made public. Associated Press]", "Date": "20150527", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-iran-reporter-trial-20150527-story.html", "Title": "[ Letter to Obama discussed at Washington Post reporter's trial in Iran]"}