{"Content": "[ At midnight Sunday, several key provisions of the Patriot Act will expire. A vital electronic surveillance program will go dark. The program collects and stores metadata  records of Americans phone calls, but not the content of those calls  to help track terrorists and foil attacks. Other expiring provisions make it easier for federal authorities to track foreign terrorism suspects in the U.S. who act alone or who use several communications devices. Federal officials have already begun dismantling the most controversial of these programs  the bulk collection of phone records by the National Security Agency  in anticipation that a Senate stalemate wont be resolved by Sunday. Congress has been divided on how or whether to extend or amend the laws provisions. Earlier this month, the House tried to break the logjam by passing the USA Freedom Act, an updated version of these provisions. The vote was overwhelming and bipartisan: 338-88. That proposed law is crafted to protect Americas terrorist surveillance abilities and address serious privacy concerns. It would not permit the NSA to collect and store metadata. Those records would be housed by telecommunications firms. Federal agents could gain access to the records via an order from the Foreign Intelligence Surveillance Court. In a case of an emergency, authorities would not need a FISC order. But the Senate last weekend failed by three votes to reach a deal to revise the metadata program or extend it. One big reason: Republican Sen. Rand Paul of Kentucky filibustered for more than 10 hours while his presidential campaign hawked fundraising souvenirs. His website sells a \"Filibuster Starter Pack.\", Paul and his anti-Patriot battery say the USA Freedom Act wont protect privacy. Theyd rather see these Patriot provisions extinguished. Thats dangerously misguided, particularly at a time when threats of a U.S.-based terrorist attack are rising. Senators are scheduled to return to Washington on Sunday  hours before the deadline  to try again to reach an agreement. The political landscape is murky. The chances for a straight extension of the law are remote. The chances that the USA Freedom Act will pass without amendment are better, but not a cinch. Republican Sen. Richard Burr of North Carolina proposes a smart amendment  install a two-year transition to the new metadata collection system. The USA Freedom Act calls for a six-month switch. Republican Sen. Mark Kirk of Illinois tells us that he wants to revise the USA Freedom Act to make sure that law enforcement has \"quick access to data that can protect against ISIS threats in the United States.\" But he notes that \"a lapse or expiration of intelligence authorities would be the least desirable option.\", Republican presidential candidate Rand Paul commandeered the Senate floor Wednesday to deliver an hours-long protest against renewal of the Patriot Act, calling the post-Sept. 11 law government intrusion on Americans privacy. Congress faces a June 1 deadline for the laws expiration, and Pauls... Republican presidential candidate Rand Paul commandeered the Senate floor Wednesday to deliver an hours-long protest against renewal of the Patriot Act, calling the post-Sept. 11 law government intrusion on Americans privacy. Congress faces a June 1 deadline for the laws expiration, and Pauls... Were with him on that. Even if the Senate agrees on an amended version of the House bill, that would likely prompt at least a brief lapse until the House voted to accept the change. It seems the Senate is going to have to swallow hard and pass the House measure to ensure that U.S. law enforcement doesnt miss a step. What happens if the Senate fails to act Sunday? Some lawmakers believe that the White House will step in and seek legal approval from the FISC to renew the program, at least temporarily. Its not clear the White House would do that, or that the court would comply. Earlier this month, the U.S. Court of Appeals for the Second Circuit ruled that the bulk collection of phone metadata wasnt authorized by the Patriot Act. Thirteen years after the Sept. 11 terrorist attacks and passage of the Patriot Act, terrorists around the world still probe Americas vulnerabilities, try to recruit or inspire lone wolf jihadis, plan attacks on U.S. soil. Electronically blinding American intelligence operations will tip the odds that more plots will succeed. Lawmakers, dont play chicken with Americas security.]", "Date": "20150528", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-patriot-act-senate-edit-0529-20150528-story.html", "Title": "[ Playing chicken with national security]"}