{"Content": "[ Senior Senate Republicans lined up Sunday to rebuke Texas Republican Sen. Ted Cruz for harshly criticizing Majority Leader Mitch McConnell, an extraordinary display of intraparty division played out live on the Senate floor. As the Senate met for a rare Sunday session, Sens. Orrin Hatch of Utah, Lamar Alexander of Tennessee and John Cornyn of Texas each rose to counter a stunning floor speech Cruz gave on Friday accusing McConnell, R-Ky. of lying. None of them mentioned Cruz by name but the target of their remarks could not have been clearer. The drama came as the Senate defeated a procedural vote to repeal President Barack Obamas health care law and took a step toward reviving the federalExport-ImportBank, both amendments on a must-pass highway bill. \"Squabbling and sanctimony may be tolerated in other venues and perhaps on the campaign trail, but they have no place among colleagues in the United States Senate,\" said Hatch, the Senates president pro tempore. Cruz is running for president. \"The Senate floor has even become a place where senators have singled out colleagues by name to attack them in personal terms, to impugn their character, in blatant disregard for Senate rules,\" Hatch said. \"Such misuses of the Senate floor must not be tolerated.\", After Hatch spoke, Cruz rose to defend himself for making the accusation that McConnell had lied when he denied striking a deal to allow the vote to revive theExport-ImportBank. He said he agreed with Hatchs calls for civility but declared, \"Speaking the truth about actions is entirely consistent with civility.\", Phony applicants that investigators signed up last year under President Barack Obamas health care law got automatically re-enrolled for 2015. Some were rewarded with even bigger taxpayer subsidies for their insurance premiums, a congressional probe has found. The nonpartisan Government Accountability... Phony applicants that investigators signed up last year under President Barack Obamas health care law got automatically re-enrolled for 2015. Some were rewarded with even bigger taxpayer subsidies for their insurance premiums, a congressional probe has found. The nonpartisan Government Accountability... And far from backing down, Cruz reiterated his complaint about McConnell. \"My saying so may be uncomfortable but it is a simple fact, entirely consistent with decorum, and no member of this body has disputed that promise was made and that promise was broken.\", Around 20 senators of both parties were on the floor watching some of the speeches. Cruzs floor speech Friday had brought nearly unheard-of drama and discord to the Senate floor. But the responses to it were just as remarkable, as senior Republicans united to defend an institution they revere and take down a junior colleague of their own party whos gone from being an occasional nuisance, to a threat to the Senates very ability to function with order. No senator rose to Cruzs defense. And by voice vote, the Senate defeated an attempt by Cruz to overturn a ruling made Friday that blocked him from offering an amendment related to Iran. Cruzs behavior was the latest example of a Republican presidential candidate causing problems for McConnell. In May, Sen. Rand Paul, R-Ky. infuriated fellow Republicans when he forced the temporary expiration of the Patriot Act when it was up for renewal. Some of Hatchs remarks seemed to apply to him as well. The U.S. Supreme Court upheld a core component of President Barack Obamas health-care law, backing tax credits used by millions of Americans to buy insurance and preserving the landmark measure that will define his legacy. The 6-3 ruling eliminates the most potent legal challenge to the law, also... The U.S. Supreme Court upheld a core component of President Barack Obamas health-care law, backing tax credits used by millions of Americans to buy insurance and preserving the landmark measure that will define his legacy. The 6-3 ruling eliminates the most potent legal challenge to the law, also... For his part, McConnell said that given support for theExport-ImportBank, despite his own opposition no \"special deal\" was needed to bring it to a vote. The little-knownbankis a federal agency that helps foreign customers to buy U.S. goods. Conservatives oppose it as corporate welfare and are trying to end it. They won an early round, when congressional inaction allowed thebankto expire June 30 for the first time in 81 years. But on Sunday, senators voted, 67-26, to advance legislation to revive thebankacross a procedural hurdle, making it likely that it will be added to the highway bill. On a separate vote, legislation to repeal Obamas health care law failed to advance over a procedural hurdle. Sixty votes were needed but the total was 49-43. The action came as the Senate tries to complete work on the highway bill ahead of a July 31 deadline. If Congress doesnt act by then, states will lose money for highway and transit projects in the middle of the summer construction season. With theExport-ImportBanklikely added, the highway legislation faces an uncertain future in the House, where theres strong opposition to thebankas well as to the underlying highway measure. The Senates version of the highway bill, which is on track to pass later in the week, sets policy and authorizes transportation programs for six years. The House has passed a five-month extension of transportation programs without theExport-ImportBankincluded, and House leaders of both parties are reluctant to take up the Senates version. Complicating matters, Congress is entering its final days of legislative work before its annual August vacation, raising the prospect of unpredictable last-minute maneuvers to resolve the disputes on the highway bill and theExport-ImportBank. Associated Press]", "Date": "20150726", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-senate-sunday-session-20150726-story.html", "Title": "[ Senior Republicans rebuke Cruz over his attacks on McConnell]"}