{"Content": "[ When President Barack Obama releases his budget Monday, the words \"dead on arrival\" will be widely incanted because they are part of a quasi-religious Beltway ritual. This year, those words will be misleading. No one expects Obamas budget to be enacted as he proposes it. Republicans responded even to early outlines of his plan with a wall of opposition. But this time around is different because, paradoxically perhaps, the fact that Republicans control both the House and Senate makes Obamas role more  rather than less  important. For the last four years, the budget game was three-cornered. The president played alongside an often radically conservative Republican House and a Democratic Senate with views of its own. Now, Obamas plan will be the main public alternative to whatever the Republicans decide to do. Moreover, the Republicans are responsible for passing a budget through two houses, so differences within the GOP that could be finessed in the past will have to be dealt with openly. The most obvious will be on whether to continue cuts in the defense budget prescribed under the so-called sequester enacted in 2011. GOP defense advocates want to raise Pentagon spending substantially, libertarians want to keep both domestic and military spending low, and many mainstream conservatives will try to cut domestic spending even more to accommodate defense increases. The third option will almost certainly be a non-starter, not only with the president  he has a veto and will insist that any cuts be balanced between the two sides of the ledger  but also with many in the GOP rank-and-file. Chicagoans will soon elect a mayor to run a City Hall trapped in astonishing levels of taxpayer debts and pension burdens. Meanwhile, all Illinoisans have a new governor overseeing a statehouse thats in a comparable predicament: a bigger government, with bigger taxpayer debts and bigger pension... Chicagoans will soon elect a mayor to run a City Hall trapped in astonishing levels of taxpayer debts and pension burdens. Meanwhile, all Illinoisans have a new governor overseeing a statehouse thats in a comparable predicament: a bigger government, with bigger taxpayer debts and bigger pension... Obama has declined to offer premature concessions to the Republicans in his own proposal, which further clarifies the stakes. At the same time, he has made things trickier still for his opponents by putting many of his ideas in a form that Republicans have supported in the past. Thats true even of some of his tax proposals. The president is aware that the most damaging alliance in Washington has been the one between establishment deficit hawks, who continue to think that long-term deficits are the premier economic issue before the country, and Republican conservatives, who have used the legitimate concerns of the deficit hawks to justify deep cuts in government programs without any offsetting increases in revenues. The president will call this bluff by putting $1.8 trillion in long-term deficit reduction on the table. But most of it will come on the revenue side. His argument here is straightforward: The bulk of the deficit reduction in the deals reached since 2011 has come from cuts in discretionary spending  that is, almost everything except the big retirement programs  which is now at its lowest level as a share of GDP in decades. After aggravating Republicans with a defiant State of the Union address, President Barack Obama announced that hes eager to work with the GOP  \"to get to yes,\" as he put it. \"The answer cant just be no, he told a group of students in Kansas. \"I dont mind hearing no to some things, but it... After aggravating Republicans with a defiant State of the Union address, President Barack Obama announced that hes eager to work with the GOP  \"to get to yes,\" as he put it. \"The answer cant just be no, he told a group of students in Kansas. \"I dont mind hearing no to some things, but it... The deficit hawks who arent part of the ideological assault on the public sector know that the basic functions of government have already been cut too much and that some new domestic spending, particularly for infrastructure, is essential. Obama calls the question: If additional revenues are unacceptable, how is deficit reduction supposed to be achieved? There cant be any \"grand bargains\" until conservatives acknowledge upfront that tax increases of some kind need to be part of any long-term solution. But the biggest challenge to Republicans may be whether they are willing to go along with Obama on ideas that are plainly in their wheelhouse. One small but significant hope: Rep. Paul Ryan, R-Wis. and Sen. Patty Murray, D-Wash. have been pushing the idea that we need more evidence-based policymaking, and Obama is joining their campaign. This sounds like a no-brainer, but much needs to be done to integrate concerns about what works and what doesnt into our governing routines. Republicans have been trying hard to tout their concern about income stagnation and an increasingly frozen class structure. Obama will be pushing for a new initiative, \"The Upward Mobility Project,\" to provide more flexibility to local officials in a set of government programs if they can show how their efforts will help people climb occupational and income ladders. Projects of this sort are exactly what we should be thinking about. When budget fights become melodramas over whether the government will shut down or default, we lose track of what the exercise is supposed to be about. Obamas opening bid ought to be the start of a back-to-basics debate  an argument that will extend into the 2016 campaign  over what we actually want government to do, and how we propose to pay for it. Washington Post Writers Group, E.J. Dionne is a Washington Post columnist.]", "Date": "20150202", "Author": "[ E.J. Dionne Jr.]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-obama-ryan-murray-budget-perspec-0202-20150202-story.html", "Title": "[ This time, Obama's budget matters]"}