{"Content": "[ When incoming University of Illinois President Timothy Killeen recently met with students in Chicago to hear their concerns, senior Kimberly Hu lamented the reduced shuttle schedule that has made it more difficult to get around the city campus. \"There are cuts, as you know. Big budget issues,\" responded Killeen, a soft-spoken leader who will take over as the U. of I. systems 20th president next week. But, he added, \"Central to any decision making is the life of a student. That is what it is all about.\", On Monday, following this weekends student graduation ceremonies, Killeen will begin the massive undertaking of overseeing the states largest public university at a time of economic uncertainty. A researcher in geophysics and space science, Killeen has been the vice chancellor for research at the State University of New York and president of its $900 million research portfolio. To get ready for the U. of I. job, Killeen has spent increasingly more time in the state during the past few months, meeting with students, faculty, lawmakers and the governor to learn as much as he can about the universitys three campuses and its $5.6 billion operating budget. During his first week, he plans to travel around the state with the three chancellors, a show of unity after some previous administrations were marked by tension among top administrators. Killeen, 63, hopes to show a united front as the group travels from Urbana-Champaign to Chicago, Peoria and Rockford before winding up in Springfield on Friday. \"The four of us should be able to work very closely together,\" Killeen said. \"Together we should be a powerful force in the state and nationally. My instinct is to make that happen. Given the budget challenges that clearly are there, we need to work together.\", The University of Illinois marked a major turnover in leadership Thursday with the election of a new board of trustees chair and the official hiring of a new president and UIC chancellor. The board also approved a tuition freeze for new students this fall, the first time in two decades that tuition... The University of Illinois marked a major turnover in leadership Thursday with the election of a new board of trustees chair and the official hiring of a new president and UIC chancellor. The board also approved a tuition freeze for new students this fall, the first time in two decades that tuition... Those challenges include plans by Gov. Bruce Rauner for a 31.5 percent cut to state higher education funding. Under his proposal, U. of I. would see a $209 million reduction in general funds next fiscal year, money that is used to pay salaries and support teaching and research for 78,000 students across the three campuses. Indeed, budget concerns will be Killeens biggest hurdle, even for a self-described optimist. While he plans to lobby against the cuts, he also said he plans to start a long-term strategic planning process to shape the future of the university system  with cost reductions in mind. A small group of university employees has been meeting regularly to assess what is working, and what might need to change. He said that he plans to look at central administration for \"potential savings\" before examining the academic programs. \"We are not going to put our heads in the sand,\" Killeen said. \"We need to face these financial challenges and we are going to need to make very careful decisions, the kind of decisions that position us for the future as well.\", , , Killeen, who was born in Wales and speaks with an accent, will receive a base salary of $600,000 a year, up to $100,000 annually in performance bonuses, and also retention incentives if he stays for five years. He has spent three decades working in public higher education and received a doctorate in atomic and molecular physics when he was just 23. Killeen has emphasized that he wants to be a \"student-centered\" president, and on the day his selection was announced in November, he said he would dedicate his presidency to the students. That desire was at the core of nearly every discussion Killeen had as he toured the UIC campus one day earlier this month. On that day, he met with new Chancellor Michael Amiridis, visited the high-tech electronic visualization lab, met with student leaders, and toured one of the campus community health clinics. He asked questions as computer science graduate students shared their projects, and listened as undergraduates expressed concerns about transportation, balancing jobs with schoolwork and getting involved with the campus when they dont live there. \"I want to make students the focus of everything,\" he told them. \"Sounds like we need some more community building.\", At a City Club lunch that featured the state treasurer, a recent U. of I. graduate cornered Killeen to ask if he could help the underperforming basketball team. Killeen was quick with a politic answer: \"I am on that job,\" he said. \"Sports are really important.\", Killeen seemed particularly concerned with the needs of UICs large commuter population and safety on campus. In a discussion with Amiridis, the two discussed ways to welcome students to campus. \"That first day is a really important moment,\" Killeen said. \"I can remember my arrival on campus and I was scared out of my wits.\", If Killeen has any first-day jitters as his start date approaches Monday, he hasnt let on. \"There is a lot going on here,\" he acknowledged when asked if he had any trepidation. \"I think it is important, and, this is a bit of a cliche, to not let the urgent issue of the day damage the long-term outlook you are building toward.\", The U. of I. community is hopeful that Killeen will bring stability to the position. Outgoing President Robert Easter, a longtime U. of I. professor and administrator, left retirement in 2012 to take the position when his predecessor, Michael Hogan, departed after just two years in the job amid controversies in his administration. Hogans predecessor, B. Joseph White, resigned during an admissions scandal over preferential policies for well-connected students. Killeen \"has the support and trust of the entire university system as he navigates one of the states most rocky economic eras,\" said Michael Pagano, dean of UICs College of Urban Planning and Public Affairs. \"Its going to be a great ride.\", jscohen@tribpub.com, Twitter @higherednews]", "Date": "20150515", "Author": "[ Jodi S. Cohen]", "Link": "http://www.chicagotribune.com/news/ct-university-of-illinois-new-president-met-20150515-story.html", "Title": "[ New U. of I. president optimistic about building team to tackle challenges]"}