{"Content": "[ A coalition of 17 U.S. states sued the Obama administration on Wednesday saying it acted illegally by issuing an executive order to ease the threat of deportation for millions of immigrants who are in the country without the proper documents. The case being led by Texas and filed at the Federal Court in the Southern District of Texas said the executive order announced by Obama last month violated constitutional limits on presidential powers. Texas Attorney General Greg Abbott, a Republican and the Texas governor-elect, said the lawsuit is not asking for monetary damages but is seeking to have the order declared illegal. The White House has said the executive order falls within presidential powers, and has argued that the ultimate answer is for Congress to pass meaningful immigration reform. President Barack Obamas plan would let up to 4.7 million of the estimated 11 million undocumented immigrants in the United States stay without threat of deportation, including some 4.4 million who are parents of U.S. citizens and legal permanent residents. \"The President is abdicating his responsibility to faithfully enforce laws that were duly enacted by Congress and attempting to rewrite immigration laws, which he has no authority to do,\" Abbott said. Many of the states in the coalition are Republican strongholds and include Alabama, Idaho, Mississippi and Utah. North Carolina Governor Pat McCrory, a Republican, said his state joined the legal effort because \"the president has exceeded the balance of power provisions clearly laid out in the U.S. Constitution.\", Abbott said that as a border state Texas has sustained millions of dollars in costs related to illegal immigration. Separately, some conservative Republicans in Congress are hoping to thwart Obamas immigration action by tying it to a must-pass government spending bill, although the Republican leadership wants to avert a government shutdown over the issue. Conservatives stand firm against funding for immigration order, Conservative Republicans resisted a plan to avert a budget fight over President Obamas immigration order, raising the likelihood that the spending struggle in Congress could last right up to the Dec. 11 deadline for a government shutdown. Tea Party lawmakers stood firm against House of Representatives Speaker John Boehners plan to pass a spending bill keeping most of the government running through September 2015 and postponing the battle over immigration until early next year, when Republicans take control of the Senate and expand their House majority. Saying the American experience was formed by \"stitching together folks from different backgrounds,\" President Barack Obama used a Polish cultural center in Chicago as a backdrop Tuesday to draw a line between immigration reform and unease over a Missouri police shooting. Speaking to a multiethnic... Saying the American experience was formed by \"stitching together folks from different backgrounds,\" President Barack Obama used a Polish cultural center in Chicago as a backdrop Tuesday to draw a line between immigration reform and unease over a Missouri police shooting. Speaking to a multiethnic... That opposition could force Boehner once again to seek Democratic support to pass his spending proposal and avert a shutdown after the governments spending authority expires. Republican leaders are desperate to avoid that after a 16-day shutdown a year ago inflicted heavy political damage on the party. The small but unruly band of conservatives, who have been a persistent headache for Boehner and Senate Republican leader Mitch McConnell, said there was no reason to wait until next year to try to deny funding for Obamas order. \"Congress should stand up and use the power of the purse,\" said Republican Senator Ted Cruz of Texas. He and others argue that Obamas announcement last month that he was using executive powers to ease the threat of deportation for up to 4.7 million undocumented immigrants amounts to an illegal amnesty. \"We will not allocate taxpayers money to lawless and illegal amnesties,\" he said outside the Capitol, where a small crowd of Tea Party backers waving U.S. and Revolutionary War-era \"Dont Tread on Me\" flags offered support. A ringleader of the House resistance, Representative Steve King of Iowa, estimated a core group of 20 to 50 Republican House members supported the effort to use the must-pass government spending bill as leverage in the immigration fight. But Boehner has used Democrats to pass spending bills during previous showdowns, including the shutdown last year, and many conservatives acknowledged they were fighting an uphill battle. \"Theres likely to be Democratic support for it, which means they could pass it without us,\" said conservative Representative John Fleming, a Louisiana Republican. A bill to keep the government operating beyond Dec. 11 likely will not emerge in the House until Monday at the earliest, a senior House Republican aide said, meaning floor debate and a vote on passage would not come until Wednesday or Thursday, the deadline day. McConnell endorsed Boehners proposal to pass a full year of funding for most government agencies but give only a short-term extension to the Department of Homeland Security, which will implement the immigration order. That would give Republicans a chance to revisit funding for the plan next year when they will take control of both chambers of Congress after Novembers midterm elections. \"I think thats a pretty responsible way to go forward. It doesnt shut anything down but also doesnt give the Department of Homeland Security a full years funding and guarantees a kind of ongoing discussion about this whole issue,\" McConnell said on the Sirius radio program \"Yahoo News on POTUS.\", McConnell repeated his vow to avoid a shutdown, which he warned would rattle economic markets. The Dow and S&P 500 stock indexes dipped around 5 percent during last years shutdown, which was accompanied by a dispute over the countrys debt ceiling, but rebounded afterward. U.S. economic growth slowed slightly because of spending cuts. Homeland Security defends Obama immigration plan, Homeland Security Secretary Jeh Johnson defended the Obama administrations decision to allow millions of undocumented immigrants relief from deportation Tuesday even as Republicans in the House of Representatives said the move would encourage others to come. Johnson spoke at a hearing before the House Committee on Homeland Security that marked the first public airing of Republican resistance toward U.S. President Barack Obamas executive action, which is expected to allow 4.7 million undocumented immigrants to stay and work in the United States temporarily. Johnson told the committee he personally recommended each Obama took to shield the immigrants. \"The reality is that, given our limited resources, these people are not priorities for removal,\" Johnson said. Representative Michael McCaul, the Republican chair of the committee, said the presidents directive would be perceived as amnesty to those considering crossing the U.S. southern border. \"If we dont think that message is making its way back to Mexico and Central America, we are simply fooling ourselves,\" said McCaul. \"We will see a wave of illegal immigration because of the presidents actions.\", McCaul said Obama did not have the legal authority to make the order. Johnson defended the legality of the action, saying those who drafted the plan worked closely with the Justice Departments Office of Legal Counsel and ruled out some options that lawyers warned they would not have the authority to implement. Jeb Bush urges Republicans to lead, not just oppose Obama on immigration, Republicans need to take advantage of their majority in Congress to pass bills rather than simply opposing President Obamas priorities, potential presidential candidate Jeb Bush said Monday. Republicans last month trounced Democrats to win control of the Senate and extend their majority in the House, as exit polls showed Americans were fed up with partisan gridlock in Washington. \"Republicans need to show theyre not just against things, that theyre for a bunch of things,\" said Bush, 61, a former two-term governor of Florida who is considering entering the Republican presidential nomination race for 2016. \"We have to show that we can, in an adult-like way, lead,\" he said at a Wall Street Journal conference, pointing to issues such as the Keystone XL oil pipeline and a possible lifting of the ban on crude oil exports. Bush spoke as some Republicans are weighing shutting down the government in an attempt to stop Obama executive action on immigration policy. Obama last month decided to unilaterally ease the threat of deportation for some 4.7 million undocumented immigrants. Bush said Obama overstepped the bounds of his authority but that Republicans should focus less on what the president does and more on building consensus in Congress for their own proposals. He urged an immigration system that accepts newcomers based on the United States economic needs, rather than on the familial ties of those already in the United States - similar to the approach used in Canada. \"Its also probably the easiest way to get to sustained economic growth, which is what we desperately need,\" he said of his immigration approach. Bush said he would decide in \"short order\" whether he would run for president in 2016, adding he was still weighing whether the sacrifice his family would have to make would be worth it. \"Its the same decision-making process that Ive always had, which is ... do I have the skills to do it in a way that tries to lift peoples spirits, and not get sucked into the vortex,\" he said. Reuters]", "Date": "20141203", "Author": "[ Tribune wire report]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-texas-sues-obama-immigration-20141203-story.html", "Title": "[ 17 states sue Obama for executive order on immigration: Texas attorney general]"}