{"Content": "[ The first multi-year highway improvement plan proposed by the Rauner administration on Thursday continues a pattern of shrinking spending on roads and bridges, and state transportation officials warned about \"a rapid deterioration in the overall condition of Illinois infrastructure due to a lack of sustainable investment.\", The fiscal 2016-21 statewide construction plan estimates spending of $8.4 billion, according to the Illinois Department of Transportation. Thats roughly $200 million less than the spending level laid out in the fiscal 2015-20 highway program under Gov. Pat Quinn. Its also more than $1.1 billion less than the state roads program for fiscal 2014-19. During the next six years, the six-county Chicago area is slated to receive about $2 billion, IDOT said. The area has 2,774 miles of highways and 1,446 bridges, IDOT said. Acting Illinois Transportation Secretary Randy Blankenhorn said it will be hard enough to maintain the existing system. He said it will be \"extremely difficult\" to take on any new projects aimed at building new state roads and reducing traffic congestion on existing highways and arterial streets maintained by the state. The highway construction blueprint identified no major new road projects in the Chicago area. Work will continue on the $475 million overhaul of the Jane Byrne Interchange, formerly the Circle Interchange, which is the junction west of downtown Chicago where the Eisenhower, Kennedy and Dan Ryan expressways and Congress Parkway meet. The project is expected to be completed in 2019, IDOT said. Today, 83 percent of state highways and 93 percent of bridges are in acceptable condition, according to IDOT. Without action, the backlog of infrastructure thats in poor shape will increase by fiscal 2021, with only 62 percent of highways and 86 percent of bridges in acceptable condition, IDOT said. The highway program indirectly noted that the $31 billion in funding has run out from the Quinn administrations six-year Illinois Jobs Now! capital construction program. \"IDOTs revenue projections do not provide much hope moving forward,\" the programs executive summary said. It noted that the federal Highway Trust Fund, which finances transportation projects, is projected to be insolvent this year, and the state anticipates declining gas-tax revenue. Gov. Bruce Rauner is responding to the harsh realities of the state in its current fiscal climate, said Peter Skosey, executive vice president of the Metropolitan Planning Council, a nonprofit group that promotes solutions for regional growth in the Chicago area. \"Rauner, the General Assembly and I think everybody is in pretty uniform agreement that the state of Illinois needs more dollars for capital improvements, Skosey said. He said Blankenhorn, who led the Chicago Metropolitan Agency for Planning before Rauner appointed him to head IDOT, has emphasized the need for a long-term sustainable revenue stream, \"not one that is sort of fits and starts, giving five years of funding and then goes dry, Skosey said. Kristi Lafleur, the head of the Illinois Tollway, wont be leaving to take the top post at the toll agency in the Orlando, Fla. area. The board of the Central Florida Expressway Authority voted unanimously Thursday to hire that agencys No. 2 official to be the new executive director, instead of... Kristi Lafleur, the head of the Illinois Tollway, wont be leaving to take the top post at the toll agency in the Orlando, Fla. area. The board of the Central Florida Expressway Authority voted unanimously Thursday to hire that agencys No. 2 official to be the new executive director, instead of... Skosey said the statistics about the number of bridges in poor shape and the miles of roads that need repair are paralleled \"across every infrastructure class  schools and water mains and everything. \"The state and the country have just deferred maintenance on infrastructure far too long,\" he said. Skosey pointed to serious discussions in Springfield on passing a new capital bill aimed at infrastructure investment, building the Illinois economy and attracting more businesses and jobs to the state. \"Pensions, deficit, infrastructure are the top issues (state lawmakers) must resolve\" before the current legislative session ends May 31, Skosey said. The full 2016-21 highway program, including a list of individual projects, is online at goo.gl/gLOqt7. jhilkevitch@tribpub.com, Twitter @jhilkevitch]", "Date": "20150514", "Author": "[ Jon Hilkevitch]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-idot-highway-spending-plan-20150514-story.html", "Title": "[ State's 6-year highway spending plan warns of 'rapid deterioration']"}