{"Content": "[ On paper, Rand Paul offers a lot to appeal to me. My thinking is broadly libertarian; the greatest influence on my understanding of public policy has been Milton Friedman, whom I discovered at a young age. Paul is the most libertarian candidate in my lifetime to have a chance at a major party nomination. On many issues, hes at least pretty good.He doesnt share the reflexive Republican penchant for using military force at every turn. He doesnt disdain civil liberties as an unaffordable luxury in combating terrorism. He opposes the National Security Agencys phone records collection program. He raised questions about the domestic use of drones. He favors reform of drug laws and less reliance on incarceration. He shows some willingness to hear the concerns of black voters who distrust the GOP. But even on paper, he has plenty of flaws. He panders to conservatives on gay marriage, \"radical Islam\" and immigration. He refuses to deal seriously with global warming. He shares the partys theological worship of tax cuts. He says the U.S. has to \"destroy ISIS militarily.\", On matters of race, he has a tin ear. On issue after issue, from Benghazi to the Iran nuclear deal, he is indistinguishable from the most doctrinaire Republicans or Rush Limbaugh. In any case, presidential candidates are not pieces of paper. And the flesh-and-blood Paul doesnt inspire positive feelings in me. He may have been a smart student, but as a public policy thinker, he rarely says anything that impresses me with its insight, depth or originality. He does not strike me as intellectually or temperamentally superior to the average politician. With Ted Cruz announcing and Rand Paul and Marco Rubio soon to follow, its time to start handicapping the horses and making enemies. No point in wasting time on the Democratic field. There is none. The only thing that can stop Hillary Clinton is an act of God, and he seems otherwise occupied.... With Ted Cruz announcing and Rand Paul and Marco Rubio soon to follow, its time to start handicapping the horses and making enemies. No point in wasting time on the Democratic field. There is none. The only thing that can stop Hillary Clinton is an act of God, and he seems otherwise occupied.... He also gives the impression of someone who was raised on a particular set of ideological dogmas and has never considered that they might be wrong. Ideological precepts offer guidance to understanding the world. But they can also act to stifle thought and understanding. They can foster intellectual complacency. Ive known many libertarians (and other ideologues) afflicted with those shortcomings. And Paul usually sounds like one of them. Im glad hes running for president. Given the alternatives in either party, I havent ruled out voting for Paul. But he has a lot to do to persuade me hes anything more than the least bad of some lousy options. Steve Chapmanis a Chicago Tribune columnist anda member of the Tribune Editorial Board.]", "Date": "20150407", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/chi-the-good-and-bad-of-rand-paul-20150407-story.html", "Title": "[ The good and bad of Rand Paul]"}