{"Content": "[ Dear Democrats: Its too late to start over. As in, theres no replacing Hillary Rodham Clinton as your partys front-runner for the presidential nomination. Not with Vice President Joe Biden  even if he runs. Not with former Vice President Al Gore. (I mean, come on.) Not with your ideal rich-person-with-no-record-and-a-fresh-faced-appeal. This may come as a shock to some of you. After all, you argue, its only August! The Iowa caucuses wont be until February! Thats, like, four political lifetimes. Sure. But modern presidential politics isnt as simple as announcing that youve decided to run and watching yourself soar to the top of the polls. (Unless, of course, you are Donald Trump, who appears entirely immune to every political law of gravity.), Lets take Biden, for example. If he decides at the end of this month that he wants to run, he immediately begins in a $45 million (and probably much larger) hole against Clinton. Super PACs could make up some of that ground, but remember that virtually every major fundraiser in the party  including many who were once Biden people  is now on Clintons team. So whatever Biden raises, Clinton almost certainly raises double. Maybe triple. Organizationally, Biden would start even further behind. Via Ready for Hillary, a super PAC dedicated to preparing the way for her presidential bid, Clintons forces have been organizing in early states for well more than a year. And its not just the head start; its that Clinton had the pick of the staff in every single state. Outside of a few Biden loyalists who have been waiting for him to make up his mind, the talent pool has been drained. Democrats have had a lot of fun joking about the huge field of Republican presidential candidates and the clown car they keep piling out of. The Democrats, by contrast, couldnt fill a minivan. And the way things are going, that may be a big problem. Say what you will about the GOP, it has an abundance... Democrats have had a lot of fun joking about the huge field of Republican presidential candidates and the clown car they keep piling out of. The Democrats, by contrast, couldnt fill a minivan. And the way things are going, that may be a big problem. Say what you will about the GOP, it has an abundance... The simple fact is that getting into a presidential race this late  and, yes, August before the election year is very late  has a disastrous recent history. Then-Texas Gov. Rick Perry (R) entered the 2012 race in August 2011 and within three months had become irrelevant. Former Sen. Fred Thompson of Tennessee got into the 2008 Republican race late  and never went anywhere. Ditto Wes Clark in the 2004 Democratic nomination contest. What all of those failed candidacies have in common is that their best day  at least in terms of polling  was their first day. It was all downhill from there. Why? Because people like a new thing, particularly if they have been staring at the same old things for a while and are not totally sold on any of them. Sure, Biden might get an initial boost in the polls. But the structural problems inherent in his candidacy would probably assert themselves quite quickly. If Democrats wanted a serious primary fight between Clinton and someone else  its hard to imagine who  that decision needed to have happened a year ago. America isnt yearning for Al Gore, the $200 million man, to run for president and save us from those 1 percenters and their obnoxious carbon footprints. The same holds true for Crazy Uncle Joe Biden. The vice president has as much bad video in his past as Donald Trump, only his are worse, since... America isnt yearning for Al Gore, the $200 million man, to run for president and save us from those 1 percenters and their obnoxious carbon footprints. The same holds true for Crazy Uncle Joe Biden. The vice president has as much bad video in his past as Donald Trump, only his are worse, since... At that time, there was a lining up behind Clinton from the donor and establishment classes  a sort of mutually agreed upon decision that it was her time and that, despite the problems she might have, she represented the partys best chance to hold the White House in 2016. All of the Democratic eggs were put in Clintons basket, a remarkable and rare decision for someone who was neither a sitting president nor vice president. (Somewhere, Biden is nodding and muttering under his breath.), Every leading consultant, fundraiser, donor and staffer sought to get on board either her campaign or the super PAC dedicated to electing her. Amid that blur of bandwagon-jumping, the very real concerns that people (inside and outside the party) had about Clinton got lost  or ignored. But ignoring those doubts and worries didnt make them disappear. And so Democrats now find themselves  less than five months after Clinton declared her candidacy  faced with this stark reality: They have helped make Clinton, who is showing major weaknesses on honesty and trust issues and who could be a problematic general election candidate, very, very hard to beat in a Democratic primary. The race is the race. Its Clinton as favorite  wounded but not mortally  with Sen. Bernie Sanders of Vermont as the liberal alternative and former Maryland Gov. Martin OMalley leading a pack of also-rans and never-will-bes. If Biden runs, he could complicate Clintons unified establishment support but would be very unlikely to beat her. The idea of a late entrant reshaping the race  and unseating Clinton  might make sense to doubting Democrats. But the nature of the modern presidential contest makes it more fantasy than reality. Democrats threw their lots in with Clinton more than a year ago. Now they just have to try to ride it out. They dont have any choice. Not really. Washington Post, Chris Cillizzawrites \"The Fix,\" a politics blog for the Washington Post. He also covers the White House.]", "Date": "20150816", "Author": "[ Chris Cillizza]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-can-clinton-lose-the-primary-20150816-story.html", "Title": "[ It's too late for Democrats to rethink Clinton's 2016 viability]"}