{"Content": "[ Authorities suspected the Islamic State group was behind an apparent suicide bombing Monday in southeastern Turkey that killed 31 people and wounded nearly 100  a development that could represent a major expansion by the extremists at a time when the government is stepping up efforts against them. Turkish officials vowed to strike back at those behind the attack in the city of Suruc targeting a group of political activists who wanted to help the shattered Syrian city of Kobani, a bombing that turned a moment of hope into a scene of horror. \"We are face to face with a terrorism incident,\" Prime Minister Ahmet Davutoglu said. \"We have the willpower to find and certainly punish those who are responsible.\", There was no immediate claim of responsibility, but a senior government official told The Associated Press that Turkey suspected the IS group was behind the blast as retaliation for Turkeys steps against the militants. The midday explosion took place as the Federation of Socialist Youths was wrapping up a news conference on plans to help rebuild Kobani, a witness said. Suruc is just across the border from Kobani, the town that was the site of fierce battles between Kurdish groups and Islamic State fighters. The fall of Kobani, heavily populated by Syrian Kurds, was the biggest defeat last year for the militants since they established control over large parts of Iraq and Syria. Its ruins have become a symbol of Kurdish resistance. At least 28 people have been killed and nearly 100 injured in a midday blast near the Syrian border. No immediate claim of responsibility has been made. (AP), At least 28 people have been killed and nearly 100 injured in a midday blast near the Syrian border. No immediate claim of responsibility has been made. (AP), If IS was indeed behind the bombing, it would represent the groups most serious attack inside Turkey. A female suicide bomber with suspected ties to IS blew herself up in a tourist district of Istanbul in January, killing a police officer and wounding another. In recent weeks, Turkey has taken new steps against IS, blocking websites and arresting suspected followers in the country, officials said. Witnesses of Mondays blast described scenes of carnage and shock. Because the activists news conference was being recorded, the attack and its immediate aftermath were captured in widely circulated video. Fatma Edemen said the federation of about 200 youths had been pressing for more access to Kobani to help with reconstruction. The group was chanting \"Long live the resistance of Kobani!\" when the explosion tore through the crowd, she said. \"One of my friends protected me. First I thought, I am dying, but I was OK,\" the 22-year-old Edemen told the AP by phone as she headed to the hospital to get treatment for minor injuries to her legs. \"I started to run after I saw the bodies.\", The children each received a doll and a sword. Then they were lined up, more than 120 of them, and given their next lesson by their Islamic State group instructors: Behead the doll. A 14 year old who was among the line of abducted boys from Iraqs Yazidi religious minority said at first he couldnt... The children each received a doll and a sword. Then they were lined up, more than 120 of them, and given their next lesson by their Islamic State group instructors: Behead the doll. A 14 year old who was among the line of abducted boys from Iraqs Yazidi religious minority said at first he couldnt... Her voice shaking, she said her group had believed it was relatively safe to rebuild Kobani. \"Our friends went there, and it didnt seem dangerous at that time. We couldnt even think something like that would happen,\" she said, adding that they had hoped to build a kindergarten or something else for children in the devastated city. \"We wanted to do something, but they would not let us,\" she added. IS militants carried out surprise attacks in Kobani last month that killed more than 200 people. President Recep Tayyip Erdogan, who was in Cyprus on an official visit, was briefed on the investigation, according to the state-run Anadolu Agency. \"I personally and on behalf of my nation condemn and curse those who perpetrated this savagery,\" Erdogan said in a news conference broadcast on Turkish television. In a statement on Twitter, Deputy Prime Minister Yalcin Akdogan said such \"despicable terrorist attacks\" would never achieve their goal. The United States strongly condemned the attack, noting that many of the victims had stepped forward to help reconstruction efforts in Kobani. \"We express our solidarity with the Turkish government and the Turkish people and reaffirm our undeterred resolve to fight against the sheer threat of terrorism,\" White House Press Secretary Josh Earnest said. The casualty figures were released by the prime ministers office and the Interior Ministry. The senior Turkish official said authorities had evidence that the attack was a suicide bombing. He spoke on condition of anonymity because he was not authorized to speak on the record. Another explosion Monday south of Kobani killed three Kurdish officials and occurred as the militiamen were removing mortar shells from a dump, said Mustafa Bali, a Kurdish official. Another Kurdish official had initially described the blast as a bomb. Suruc also is the site of the largest refugee camp in Turkey. Nearly 2 million Syrians have crossed into the country to flee the fighting. More than 220,000 Syrians have been killed and at least 1 million wounded since the countrys crisis began in March 2011, according to the United Nations. Associated Press]", "Date": "20150720", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-turkey-blast-20150720-story.html", "Title": "[ Turkey suspects Islamic State behind bomb that killed 31]"}