{"Content": "[ While still in his 20s, Julian Bond was already one of the most charismatic and best-known figures of the civil rights movement. Tall, strikingly handsome and a gifted orator, he won a Supreme Court challenge in 1966 to be seated in the Georgia state legislature. He remained an outspoken voice against discrimination for more than 50 years as president of the Southern Poverty Law Center, chairman of the NAACP and a professor at American University and the University of Virginia. Bond died Aug. 15 at a hospital in Fort Walton Beach, Florida, at age 75. His wife, Pamela Horowitz, said he became ill while on vacation in Florida and died of complications from vascular disease. A onetime student of the Rev. Martin Luther King Jr. at Morehouse College in Atlanta, Bond became active in the civil rights movement in his teens. He was a founder of the Student Nonviolent Coordinating Committee in the early 1960s and was on the front lines of civil rights battles in the South. His name was briefly placed in nomination for the vice presidency at the 1968 Democratic National Convention, when he was too young to assume the office. For a time in the 1960s and 1970s, there was open talk that Bond could well be the nations first black president. President Barack Obama hailed Bond as a \"hero\" and as a friend to the first family. \"Justice and equality was the mission that spanned his life,\" the president said in a statement. \"Julian Bond helped change this country for the better. And what better way to be remembered than that.\", Other statements of sympathy were issued by former president Bill Clinton and former secretary of state Hillary Rodham Clinton, former vice president Al Gore, civil rights activist and television figure Al Sharpton, actress Kerry Washington and Southern Poverty Law Center co-founder Morris Dees, among others. Julian Bond, shown in 2006, talks to the media about the NAACP at the University of South Carolina in Columbia. Bond, a civil rights activist and longtime board chairman of the NAACP, died Aug. 15, 2015, according to the Southern Poverty Law Center. He was 75. Julian Bond, shown in 2006, talks to the media about the NAACP at the University of South Carolina in Columbia. Bond, a civil rights activist and longtime board chairman of the NAACP, died Aug. 15, 2015, according to the Southern Poverty Law Center. He was 75. In 1960, Bond was one of the founders of the Student Nonviolent Coordinating Committee, which he described as the \"shock troops\" who helped spread the fervor of the civil rights movement. As the communications director, he worked alongside the organizations chairman, now-Rep. John Lewis, D-Ga. who would become a friend and later a political rival. Bond first gained national acclaim in 1965, when he was elected to the Georgia House of Representatives at 25. Alone among the 11 African Americans elected to the Georgia legislature soon after the passage of far-reaching new civil rights laws, Bond was denied a seat in the chamber. On three occasions, the white leaders of the Georgia legislature sought to prevent Bond from taking his seat, citing his opposition to the military draft and the war in Vietnam. The legislature claimed it had the right to determine the qualifications of its members. Bond filed suit, saying, \"If they bar me again, Ill sue them again.\", In a unanimous decision, the U.S. Supreme Court ruled in 1966 that Bond was being denied freedom of speech and that he should be immediately seated in the legislature. For the next 20 years, while serving in the Georgia legislature, Bond spoke out nationally on issues of race, poverty and equality. He gave as many as 200 speeches a year, often on college campuses, and was seen as a likely national leader of the civil rights movement after Kings assassination in 1968. As a symbolic statement of protest at the divisive Democratic National Convention that year, a Wisconsin delegate nominated Bond for vice president even though he was only 28, seven years younger than the required age. By the early 1970s, The Washington Post reported he was one of the three highest-earning speakers on the national lecture circuit, along with consumer advocate Ralph Nader and comedian and activist Dick Gregory. Cosmopolitan magazine named him one of the 10 sexiest men in America. From 1971 to 1976, he served as the first president of the Southern Poverty Law Center, a legalorganization that fights discriminatory practices throughout the country. Bond was seen not just as the future of black America, but possibly of America as a whole. Surveys indicated that he was, by far, the most popular choice to be the countrys first African American president. \"Julian Bond is the only person since King to command a national constituency of blacks, whites and young people,\" columnist Nicholas von Hoffman wrote in 1972. By the time he was elected to the Georgia Senate in 1974, few people, least of all Bond, realized that he had reached his political peak. He launched a short-lived bid for the presidency in 1976 but would never hold a higher office. In 1986, after 20 years in the state legislature, Bond ran for the U.S. House of Representatives in a bitter Democratic primary race against Lewis, his former SNCC colleague. Lewis and other detractors charged that Bond was an ineffective legislator who spent too much of his time traveling around the country and appearing on television. \"Hes a taillight rather than a headlight,\" Lewis said in 1986. \"Theres nothing he ever took the initiative on.\", Bond had a strong edge in money and celebrity endorsements, but against all odds he lost a primary showdown with Lewis, 52 to 48 percent. During the campaign, Lewis called on Bond to take a drug test, which he refused to do. Months after the election, Bonds first wife accused him of using cocaine and claimed he was having an affair with a woman she said was his drug supplier. She recanted the allegations, but Bonds image was tarnished. With his political career ended at 46, Bond prematurely became something of a grand old man of the civil rights era. He moved from Atlanta to Washington, wrote a newspaper column, appeared as a television commentator and spoke on college campuses. Years later, he reconciled with Lewis, who still holds the same congressional seat from Georgia. In March, the two joined forces to lead a weeklong tour of civil rights landmarks in the South. It was sponsored by the University of Virginia, where Bond was an emeritus professor of history. \"We went through a difficult period during our campaign for Congress in 1986,\" Lewis said on Twitter, \"but many years ago we emerged even closer.\", In a separate interview with The Washington Post, Lewis said: \"He was my closest and dearest, most reliable friend within the civil rights movement. I loved him like a brother.\", Horace Julian Bond was born Jan. 14, 1940, in Nashville. His father, Horace Mann Bond, was an educator who became president of Lincoln University in Pennsylvania, where Julian Bond spent his youth. Guests in the family home during Bonds childhood included scientist Albert Einstein and prominent black figures W.E.B. DuBois and Paul Robeson. As a student at Morehouse, a private historically black mens college, Bond took a philosophy class co-taught by King. It was the only college course King ever taught. Bond dropped out of Morehouse before graduating but returned to receive his bachelors degree in 1971. He later received more than 25 honorary doctorates. In 1977, the same year Bond was the first black political figure to appear as a host of \"Saturday Night Live,\" political columnists Jack Germond and Jules Witcover were lamenting what they saw as a squandered career for a onetime rising star. They described Bond as \"a kind of political bonus baby of great potential who never has quite fulfilled the promise as a national leader that many of his admirers once envisioned.\", \"I cant live up to other peoples ambitions for me,\" Bond said in 1987. \"Im really flattered when somebody tells me you should be this or you should be that. But . . . I have to do what I have to do.\", From 1987 to 1990, Bond was the narrator of \"Eyes on the Prize,\" a 14-part PBS documentary series about the civil rightsperiod. He was featured in a 2012 documentary by Eduardo Montes-Bradley and appears in a new documentary by Washington filmmaker Aviva Kempner about Julius Rosenwald, who funded schools for African Americans in the South. In addition to teaching at the University of Virginia, Bond had been on the faculty at American University since 1991. He was scheduled to teach a course on the civil rights movement in the fall semester. His first marriage, to Alice Clopton Bond, ended in divorce. Survivors include his wife of 25 years, Pamela Horowitz, a former legal counsel for the Southern Poverty Law Center, of Washington; five children from his first marriage, Phyllis Jane Bond-McMillan, Horace Mann Bond II, Michael Julian Bond, Jeffrey A. Bond and Julia L. Bond, all of Atlanta; a sister; a brother; and eight grandchildren. From 1998 to 2010, Bond was board chairman of the NAACP. He spoke out against the policies of the administration of President George W. Bush and the tea party movement, which he repeatedly called \"the Taliban wing of American politics.\", As an early proponent of same-sex marriage, Bond was among the few veterans of the civil rights movement to draw a link between racial discrimination of the 1960s and the drive for marriage equality. In a video he made in 2011 for Marylanders for Marriage Equality, Bond said, \"As chairman emeritus of the NAACP, I know a little something about fighting for whats right and just.\", ]", "Date": "20150816", "Author": "[ Matt Schudel and Victoria St. Martin]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-julian-bond-dies-20150816-story.html", "Title": "[ Civil rights activist Julian Bond dies; Obama calls him a 'hero']"}