{"Content": "[ You could say the testimony Tuesday before the Senate Judiciary Committee on violence committed by immigrants here illegally was heartbreaking. But the killings are made all the worse by federal immigration law that is ignored so Democratic Party pols can hustle Latino votes through so-called sanctuary city policies. I could pretty that up some, but thats what it is. It isnt death by politics, exactly. But politics has blood on its hands. \"There was a lot of emotion in there,\" Brian McCann, brother of a Chicago victim, told me over the phone after his testimony on Tuesday. \"Its been a few years for me. But others are just going through it,\" he said. \"Its rough. Sitting there next to them, well, it was rough.\", The wife of a police officer whose husband was killed gave testimony. So did a mom whose son was killed and set on fire. The uncle of a young man shot to death for cigarettes told his story. And the father of Katie Steinle had his say. It is Katies killing that has reignited the debate over immigration and the sanctuary city movement. She was allegedly shot to death by Juan Francisco Lopez Sanchez, here illegally, a seven-time felon whod been deported to Mexico five times before. Hed been in the custody of the San Francisco sheriff on a marijuana charge. U.S. Immigration and Customs Enforcement officials wanted him held. But San Francisco is a sanctuary city, and the local sheriff ignored those requests and released him in April. Now the sheriff is blaming the feds. \"The day she was killed, we were walking arm in arm,\" Jim Steinle said about his daughter Katie. \"She said, Help me dad. Those are the last words I will ever hear from my daughter.\", When I heard that Brian McCann was going to testify, I turned on the computer to cspan.org to watch it live. Some of you may remember a few columns I wrote back in 2012, about Brians younger brother, William \"Dennis\" McCann. On June 8, 2011, William McCann was walking across Kedzie Avenue in the Logan Square neighborhood when he was struck by a black Dodge Neon driven by an alleged drunken driver. A witness, Alberto Aceves, told the Tribune he heard the impact, then saw William McCann land on the windshield. The driver stepped on the gas, McCann hit the ground and the underbelly of the car caught him and dragged him north on Kedzie. Aceves recalled screaming, \"Stop! The guys under your car!\", An off-duty police officer joined in the chase. Finally, after about a block and a half, the car stopped. The driver, Saul Chavez, then 35, tried to run. Urged on by anguished testimony from the father of a murder victim, Congress plunged into a heated debate over immigration on Tuesday as GOP lawmakers vowed to shut down funding for so-called sanctuary cities like San Francisco that shield immigrants from deportation by federal authorities. Immigrant... Urged on by anguished testimony from the father of a murder victim, Congress plunged into a heated debate over immigration on Tuesday as GOP lawmakers vowed to shut down funding for so-called sanctuary cities like San Francisco that shield immigrants from deportation by federal authorities. Immigrant... William McCann was dead. Chavez was charged with aggravated driving under the influence  a felony  and authorities said his blood-alcohol content was 0.29 percent, nearly four times the legal limit. Hed had already been convicted of drunken driving in 2009 and received two years probation. As he sat in jail on the 2011 charge, federal officials filed what is called an immigration detainer for Chavez, requesting that ICE be notified if Chavez was to be released. But the Cook County Board under President Toni Preckwinkle and Commissioner Jesus \"Chuy\" Garcia, pushing for votes, were coming up with a new sanctuary-city-style policy. It was aimed at ignoring federal detainer requests and allowing suspects in misdemeanor and felony cases to make bond, even if they were suspected flight risks. Cook County Commissioner Tim Schneider, who is now also the Illinois Republican Party chairman, warned that criminals would flee to Mexico. The Democrats laughed that off and voted for the new policy 10-5. Bond in Chavezs case was set at $250,000. Somehow he came up with $25,000 cash. He is thought to have fled back to Mexico. And that is what Brian McCann was in Washington to address at the hearing. He told the senators how he was notified that Chavez had been released. \"So here I am sitting at home the Sunday before Thanksgiving and get a recorded message from some kid at the jail that said that Chavez left,\" McCann told the committee. \"He posted bond and ran. And who do I call on a Sunday?, \"Its just a pathetic miscarriage of justice visited upon my family and hundreds of other families across the country,\" McCann said. \"Im convinced this (Congress) is where resolution rests. Because the sanctuary jurisdictions, theyre going to get away with literally murder, passing these policies and you guys gotta do it.\", The citizen from Illinois looked up and noted the chair of the senator from Illinois, Sen. Dick Durbin, the Democrat, was empty. \"Finally, I regret that my senator had to leave and couldnt hear my testimony,\" said McCann. \"But maybe Ill talk to him later. All right, thanks.\", Moments after McCann noted Durbins absence, we called Durbins office to ask why. We left a voice message. It was 10:24 a.m. CST. He didnt return the call. But a few minutes later, at 10:45 CST, Durbin rushed back into the hearing room, eager to explain. \"First, I was not able to stay at the hearing for Brian McCanns testimony. Brian McCann is from Chicago. I agreed to speak at an Alzheimers Association research meeting, came back, got him on the phone. Were working with him through the FBI to try to help bring this fugitive to justice who is responsible for this terrible tragedy in his family. I want to put that on the record.\", Youre on the record, Senator. Now what?, jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150721", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-sanctuary-cities-judiciary-hearing-met-0722-20150721-column.html", "Title": "[ A Chicago family hurt by sanctuary city politics]"}