{"Content": "[ For a long time, the U.S. ostracism of Cuba has been like the vintage American cars on the streets of Havana: obsolete but imperishable. It didnt topple the Castro government, didnt force human rights progress and didnt unite the world behind us. Yet failure was no enemy of longevity. There are many reasons for its endurance. But if youre parceling out responsibility, you have to start with a curious invention of the Founding Fathers that we know as the Electoral College. Without it, our Cuba policy never would have persisted for so many years  which is a reminder that our Cuba policy is not the only thing that needs changing. Shortly before the 2000 election, I was invited to be part of a local TV panel that included an Illinois state senator I had never heard of: Barack Obama. The topic was the novel possibility that George W. Bush might win the popular vote but lose in the Electoral College. We were on to something, but we had it backward: On Election Day, it was Al Gore who managed this sad feat. The outcome infuriated Democrats, who still bear a grudge against the Electoral College, but convinced Republicans that it is a priceless heirloom. They may change their minds once they grasp that its odd math now works to their distinct disadvantage. After the 2012 election, Nate Silver of The New York Times figured out that \"Mitt Romney may have had to win the national popular vote by three percentage points on Tuesday to be assured of winning the Electoral College.\", Political scientist Ben Highton of the University of California at Davis has calculated that if voters split 50-50 in 2016, the Democratic nominees chance of winning is at least 83 percent. What does the Electoral College have to do with our shunning of Cuba? Plenty. Cuban-Americans make up just 0.6 percent of the American population  hardly enough, youd think, to warrant much notice from politicians. But they have nonetheless been able to dictate Washingtons stance on Cuba. Why? First, because for a long time they were united in their strong antipathy toward the Castro regime. Second, because they let candidates know any deviation on that issue was a deal-breaker. None of this would have mattered, though, except for the Electoral College. Cuban-Americans are concentrated in Florida, where they make up more than 6 percent of the population  enough to decide an election. Its a crucial swing state that is rich in electoral votes. Presidential candidates of either party knew that if they urged a less hostile policy toward the Cuban regime, they would lose the Cuban-American vote, which could mean losing Florida, which could mean losing the election. They also knew that it cost them nothing to appease the Cuba lobby, because the issue is of minor importance to anyone else. So they did the politically prudent thing. As Texas A&M University political scientist George C. Edwards III, author of \"Why the Electoral College Is Bad For America,\" told me, \"The Electoral College allowed a minority in a large state to determine U.S. foreign policy.\", The fact that our Cuba policy didnt work was irrelevant. As long as it satisfied those voters, it was beyond alteration. What changed? The sentiments of Cuban-Americans changed. Many of them came to see the policy as blind and futile. In 2008, Obama went to Miami and dared to say he would meet with Raul Castro \"at a time and place of my choosing.\" In spite of that pledge  or because of it  he did much better among Cuban-Americans than John Kerry or Al Gore had done. Four years later, he got nearly half of their votes. That success emboldened him to adopt his new policy of engagement. But the shift doesnt vindicate the Electoral College. It still warps our democratic process by giving lopsided power to a handful of states  and small voting blocs in those states. It may be impossible to amend the Constitution to get rid of this mechanism. But its not impossible to circumvent. Eleven states, with 165 electoral votes, have passed measures to award their electoral votes to the winner of the national popular vote, regardless of who wins their respective states. The plan, known as the National Popular Vote, would not kick in until enough states sign on to deliver the 270 votes that constitute a majority. That way, the Electoral College vote would always uphold the choice of the voters. It may sound like a crazy way to elect a president, but trust me: Weve had crazier. Steve Chapman, a member of the Tribune Editorial Board, blogs at chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20141219", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-cuba-obama-castro-electoral-college-perspec-1221-jm-20141219-column.html", "Title": "[  The strange source of our Cuba policy]"}