{"Content": "[ Donald Trump, widely believed to be the wealthiest American ever to run for president, is nowhere among the ranks of the countrys most generous citizens, according to an Associated Press review of his financial records and other government filings. Trump has said he donated $102 million worth of cash and land to philanthropic and conservation organizations over the past five years. But his campaign has provided little documentation for most of these contributions, and tax filings of the Donald J. Trump foundation show Trump has made no charitable contributions to his own namesake nonprofit since 2008. Without an endowment, the fund has continued to give grants only as a result of contributions from others. Even the $102 million would not impress the wealthy elite whom Trump counts as his peers. Billionaires like Michael Bloomberg, George Lucas and Warren Buffett have both given far more and pledged to donate most of their wealth to charity during their lifetimes. It is possible that Trump has been donating money anonymously through avenues other than his foundation, whose tax records the AP reviewed. But pressed by the AP on the details of his contributions, Trump campaign spokeswoman Hope Hicks provided a partial list of donations that appeared to correspond with the foundations gifts  indicating that Trump may be counting other peoples charitable giving as his own. \"I give to hundreds of charities and people in need of help,\" Trump said in an emailed response to questions from the AP about how he tallied his own philanthropy. \"It is one of the things I most like doing and one of the great reasons to have made a lot of money.\", The Trump campaign did not respond to a request that it identify donations that Trump himself gave. Trump has not released his own tax records even though some other presidential candidates have disclosed theirs. Such documents would likely provide a clearer picture of his giving. Actual cash donations account for only around a tenth of the $102 million Trump says he has given in the last five years. Most of the total comes from land-related transactions. One major land donation from Trump earlier this year may result in a significant tax deduction for Trump for continuing to operate a commercial golf driving range. Trump announced in January he was providing a land conservancy in Rancho Palos Verdes, California, with a legal promise never to develop 16 luxury homes on what is now the driving range of the Trump National Golf Course Los Angeles. But city planning documents indicate Trump had no plans to use the land for anything other but a driving range  which he will continue to do under the terms of the easement. A possible multimillion dollar beneficiary of Trumps gift: Donald Trump. Easements  contractual limitations which formally devalue the land, even if they require no changes in its use or ownership  provide an avenue for federal tax write-offs. By committing to use his driving range as a driving range, Trump is likely entitled to a sizable tax deduction, said Dean Zerbe, a tax attorney for Alliant Group of Houston and who previously headed an investigation into easement write-offs for the Senate Finance Committee. \"Its shocking how much you see in the way of golf easements,\" he said. \"Are we comfortable that this is something we want to subsidize with tax policy?, Trumps foundation began in 1987 and exists to donate money to other charities. It has no staff, and its annual IRS filings have regularly listed Trumps average time spent on it as \"minimal\" or zero hours a week. The foundation has given out $3.6 million between 2011 and 2013, the most recent year in which its finances are available. The overwhelming majority of its recent gifts have been made with other peoples money. NBC Universal, World Wrestling Entertainment and high-end, sporting and entertainment event ticket-reseller Richard Ebers are among the largest donors; Trump made his last significant donation, of $30,000, in 2008. Until late last year, Trump was described as an \"ardent philanthropist\" in a biography posted to the Trump Organizations website. That language has since been removed. As with Trumps politics, his donations do not fit neatly within traditional ideological lines: In 2012, he donated to the Gay Mens Health Crisis  founded by gay rights activist Larry Kramer  and the Billy Graham Evangelical Association, which decries the influence of the \"gay lobby\" and offers support to people pushing loved ones to \"seek freedom from homosexuality.\", A sizable portion of Trumps giving appears to be geared toward charities prominently affiliated with celebrities or politicians. Trump has given to the Ronald Reagan Foundation and the Clinton Foundation, and has made donations to charities associated with former major league baseball manager Joe Torre, television personality Larry King and professional golf legend Arnold Palmer. Some celebrity-backed charities have pitched controversial causes. In 2010, Trumps foundation gave $10,000 to Generation Rescue, a nonprofit run by Jenny McCarthy to champion the widely discredited theory that vaccines cause autism. Trump also gave $1,000 to the New York Rescue Workers Detoxification Project, an organization co-founded by Tom Cruise that offered free Scientology-based cleansing to rescue workers after the 2001 terror attacks. Trumps tax returns would provide clearer information about any philanthropy he listed as deductible. In 2011, he indicated he might release his own tax returns when President Barack Obama released his birth certificate, something the president subsequently did. Trump took credit for pressuring Obama to release the document but did not release his tax records, promising he would do so at an appropriate time. Such returns could potentially shed light on the nature of some of Trumps noncash gifts, such as his donation of the easement on his Rancho Palos Verdes golf course. Trumps gift is to the local land conservancy, which maintains green space and undeveloped coastline owned by city of Rancho Palos Verdes. Trumps relationship with the city itself has been rocky. After years of battling with local government over a 70-foot flagpole erected without approval, and Trumps thwarted effort to have a prominent street renamed after himself, Trump sued the town of 46,000 for $100 million in 2008. He alleged it was wrongfully preventing him from building homes on land adjacent to his golf course. The city  which has a budget of roughly one-quarter the size of Trumps legal claim  settled with Trump in 2012 on confidential terms. But Trumps plan for the driving range on which he is donating an easement has been far less contentious. Though the land was still approved for the construction of 16 homes, Trump turned it into a driving range when he bought the property more than a decade ago, according to city planning documents. In the years since, Trump did not apply to build homes on the property, and he sought approval from the California Coastal Commission to permanently approve plans that left the land as a driving range. \"Sometimes hed make statements, saying, Well, maybe Id put homes there instead of the driving range,\" said Joel Rojas, the citys community development director. But there were never any concrete plans to build. Trump received that approval last year, Rojas said, which prevents him even from applying to build homes on the driving range. When Trump announced four months later that he will permanently forgo building on the range, he said the land was worth more than $25 million. Zerbe, the former Senate lawyer, said tax deductions for such projects are unquestionably legal but noted that building homes there instead would have complicated Trumps golf plans. \"Youre not going to have a golf course without a driving range,\" he said. Associated Press]", "Date": "20150802", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-donald-trump-charity-20150802-story.html", "Title": "[ Proof of Donald Trump's charity giving elusive ]"}