{"Content": "[ President Barack Obama usually plays it cool when faced with the occasional heckler, but when one of his own invited guests to the East Room of the White House turned on him at a LGBT pride month event on Wednesday he shut it down fast. Hey. Listen. Youre in my house, Obama told the lady in the black dress, who was identified in a press release from the anti-deportation group Not1More as Jennicet Gutierrez, transgender and undocumented. (The White House, of course, is also known as The Peoples House.), As a general rule I am just fine with a few hecklers, Obama said, while saying this was different. My attitude is if youre eating the hors doeuvres ... You know what Im saying? And drinking the booze. ... Obama told the heckler, Shame on ya. You shouldnt be doing this and asked his security detail, Can we escort this person out? You can either stay and be quiet or well have to take you out. Finally, he decided to make the call. OK, can we have this person removed please?, The anti-deportation group said that Gutierrez, who called on Obama to stop all deportations, felt she could not celebrate while transgender detainees were in U.S. Immigration and Customs Enforcement custody. The roughly two-minute disruption aside, the president, joined by Vice President Joe Biden and House Democratic Leader Nancy Pelosi and other lawmakers, seemed to enjoy the festive event. Weve got a lot to celebrate, he said, and added that he would be watching for a Supreme Court decision on gay marriage. Whatever the decision, he said, there had been an incredible shift toward accepting gay marriage in America. This is a rowdy crowd, he also said. I dont want you guys to break anything while youre here. President Barack Obama conceded Wednesday that the U.S. government had let down the families of Americans held hostage by terrorists and promised they would not face criminal prosecution for paying ransoms to their loved ones captors. \"These families have already suffered enough and they should... President Barack Obama conceded Wednesday that the U.S. government had let down the families of Americans held hostage by terrorists and promised they would not face criminal prosecution for paying ransoms to their loved ones captors. \"These families have already suffered enough and they should... Bloomberg News]", "Date": "20150624", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-obama-boots-transgender-heckler-20150624-story.html", "Title": "[ Obama spars with transgender heckler at White House]"}