{"Content": "[ As our Eurostar train zipped from London through the 30-mile Channel Tunnel, often referred to as the Chunnel, to Paris, I couldnt help thinking about the thousands of migrants languishing on both sides of the Channel. Once again, national and regional political systems are struggling to cope with a mounting human tragedy and its spillover effects involve disruptions to commerce; and all this is stoking a political crisis. The economics of the Channel migrant crisis are clear, being basically about supply, demand and regulatory failures. It also sheds light on potential solutions, though they will take time to materialize. The supply of migrants to Europe is fueled by waves of people fleeing the economic and social misery of their home countries  and, in some cases, political oppression, persecution and violence. They do so in hopes of a better future for themselves and their children. The temptation for some to try to make it all the way to the United Kingdom, often after a perilous sea crossing and a fraught trip through western Europe, is amplified by the attractiveness of an economy with low unemployment, comprehensive social services and a country where many already know the language. Although the supply of migrants has increased, the demand for migrant labor has gone the other way. Tougher laws have made it harder and more dangerous for employers to hire undocumented workers. And with a European unemployment rate of more than 10 percent, the demand is further damped. This imbalance in supply and demand isnt one that can be sorted out by the markets normal equilibrating mechanism. The market-clearing wage  that is, the price that would lower the migration incentive while facilitating the absorption of those still inclined to risk life and limb  is well below the minimum wage prevailing in Europe; and any meaningful reduction in the wage would involve significant and unacceptable social disruptions to local populations in Europe. The regulatory systems are not of much help either, pressured at multiple stages, from the countries of origin, to the points of transit and entry to Europe, to the final destinations. And where the regulatory system is aided by physical barriers  such as the English Channel  there are visible signs for all to see of migrants deprivation and desperation. In the process, the road transportation of all sorts of goods is disrupted, causing considerable economic losses. Food rots on trucks waiting to cross the Channel. Vehicles are immobilized, undermining supply chains. Private transportation, including tourism, is subject to long delays on account of congested roads and stepped-up security checks. And, even if the willingness were there, the social safety nets are too weak to cope with the human tragedies that play out every day. The European Union must urgently improve overcrowded migrant reception centers in Italy and Greece, a leading humanitarian group said Tuesday as ships from Denmark and Norway plucked nearly 1,000 people from the Mediterranean Sea. Conflict and poverty have driven more than 100,000 migrants to Europe... The European Union must urgently improve overcrowded migrant reception centers in Italy and Greece, a leading humanitarian group said Tuesday as ships from Denmark and Norway plucked nearly 1,000 people from the Mediterranean Sea. Conflict and poverty have driven more than 100,000 migrants to Europe... All this is increasing pressures on politicians to resolve the problem. Yet effective solutions continue to evade them, both at the national and regional levels. This isnt a problem that will go away anytime soon, and for a simple depressing reason: The economics of this tragic situation call for a comprehensive collaborative solution, but the best the political system is able to come up with is a piecemeal, weakly coordinated approach. It is an outcome that, at best, can alleviate some of the problems; it will not solve them in a decisive and durable fashion. In a perfect world, revamped national approaches would be accompanied by meaningful cooperation, not just among European destination countries but also between them and the countries of origin and those through which undocumented migrants travel. But, unfortunately and tragically, this probably is too much to expect in a world in which Europe struggles to solve its internal issues, including the Greece crisis, while the countries from which so many migrants flee are fragile, with some on the verge of becoming failed states  if they are not there already. Migrants rushed the tunnel linking France and England repeatedly for a second night on Wednesday and one man was crushed to death by a truck in the chaos, deepening tensions surrounding the thousands of people camped in this northern French port city. To get to the tunnel, migrants must cross a... Migrants rushed the tunnel linking France and England repeatedly for a second night on Wednesday and one man was crushed to death by a truck in the chaos, deepening tensions surrounding the thousands of people camped in this northern French port city. To get to the tunnel, migrants must cross a... Bloomberg, Mohamed A. El-Erian is chief economic adviser at Allianz, chairman of President Barack Obamas Global Development Council and the former chief executive officer and co-chief investment officer of Pimco.]", "Date": "20150804", "Author": "[ Mohamed A. El-Erian]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-europe-migrant-crisis-20150804-story.html", "Title": "[ The economics behind Europe's migrant crisis]"}