{"Content": "[ University of Illinois trustees Wednesday rejected a $400,000 bonus payment for outgoing Chancellor Phyllis Wise, backpedaling on a resignation deal made last week and instead choosing to begin dismissal proceedings against her. The unanimous decision to reject Wises resignation came six days after she announced she would step aside just ahead of the revelation that she had been using a personal email account to hide discussions of sensitive and controversial issues from the public. The deal had been recommended by new U. of I. President Timothy Killeen. But the terms of her resignation, including the bonus intended to acknowledge four years in the job, were roundly criticized by Gov. Bruce Rauner and others, and the boards three-member executive committee decided Wednesday to take the more contentious  and legally risky  path of firing Wise for cause instead. It is likely the first time a U. of I. university chancellor has faced dismissal for cause, a university spokesman said. The board will next provide Wise with \"a statement of the reasons\" for firing her and will hold a dismissal hearing, according to a letter U. of I. board Chair Edward McMillan sent Wise after Wednesdays meeting. Until then, Wise will be assigned as an adviser to the U. of I. president on biomedical affairs and continue to draw her salary of $549,069. She will retain her tenured faculty appointment, as the dismissal applies only to her administrative role. The board Wednesday appointed Dean Barbara Wilson as the acting interim chancellor. Gov. Bruce Rauners administration is urging University of Illinois trustees to reject a proposed $400,000 bonus for outgoing Chancellor Phyllis Wise  a move that puts heightened pressure on what could have been a rubber-stamp decision. University trustees are scheduled to vote Wednesday afternoon... Gov. Bruce Rauners administration is urging University of Illinois trustees to reject a proposed $400,000 bonus for outgoing Chancellor Phyllis Wise  a move that puts heightened pressure on what could have been a rubber-stamp decision. University trustees are scheduled to vote Wednesday afternoon... \"I had hoped to handle Chancellor Wises exit in the spirit in which the original contract was conferred,\" Killeen said after the boards decision. \"But the board, with a lot of discussion and a lot of analysis, has mandated a different track, which I fully respect. The board members have many considerations to bring to the table.\", Killeen said discussions about Wises resignation began early last week when she was presented with the findings of an investigation into her deliberate use of a personal email account to hide information. Killeen said he did not \"directly\" ask Wise to resign and that she \"indicated interest or willingness\" to do so. She publicly cited \"external issues\" as the reason after a tumultuous year at the states flagship public campus. McMillan said he was involved in discussions last week while the agreement was being negotiated by attorneys for Wise and the university, and thought then that it would be best for the deal to be \"consistent with the (original) employment agreement\" from 2011. DepartingUniversity of Illinois Chancellor Phyllis Wise. DepartingUniversity of Illinois Chancellor Phyllis Wise. However, he and the other two executive committee members  James Montgomery and Karen Hasara  ultimately voted against it, on behalf of the entire board, after a 90-minute closed session. McMillan did not specify why he changed his mind but said that after trustees shared their opinions, they collectively agreed on a different path. Wises original employment offer, signed in 2011, said she would receive a $500,000 retention bonus after \"the full five years\" in the job, or a prorated portion if she left the position sooner \"at the election of the Board of Trustees.\", With the board not accepting Wises resignation, she will not receive the perks including the $400,000 lump-sum retention bonus and also a one-year paid sabbatical. Wise has not returned calls from the Tribune since her resignation was announced. Killeen said she has been out of the country. Killeen said the resignation deal was a way to get a quick resolution while reducing \"reputational harm, harm to individuals,\" as well as \"litigation risk.\", However, it was met with widespread criticism, including from Rauner and several other legislators who were upset by the bonus payment, which would have been awarded at an inopportune time for the university. With the state budget undecided, lawmakers have been examining administrative compensation and perks at the states colleges and universities. Rauner has criticized bloated administrative spending as he has called for a 31.5 percent cut in state funding of higher education. Rauner, an ex officio member of the U. of I. board, is responsible for appointing trustees, and his administration on Tuesday sent a letter to McMillan expressing its \"deep reservations\" about the deal and urging trustees not to approve it. In January, Rauner reappointed McMillan to a second six-year term and named two new trustees. McMillan was subsequently named the new chairman by other board members. But the state Senate had not yet confirmed any of Rauners three appointees, and lawmakers said they were watching Wednesdays vote as they considered the confirmations. Killeen said Wednesday that Rauners position was considered, though McMillan said he would have voted against the deal regardless. \"His input was considered along with all the other input. The path we have chosen here has been under careful consideration as an alternative path,\" Killeen said. Killeen added that, going forward, the university will not include retention incentives as part of administrators contracts. A U. of I. spokesman said Killeen told McMillan on Wednesday that he wants to eliminate the retention incentive from his own employment agreement. Currently, he gets a retention bonus every year, and up to $225,000 after five years. \"Im glad the university trustees chose to side with taxpayers. The boards actions show they are willing to take a step in the right direction, but the bonus provisions should have never existed in the first place,\" said state Sen. Tom Cullerton, D-Villa Park. \"State-funded universities and community college administrators should not be rewarded for breaking the rules.\", U. of I. on Friday released about 1,100 pages of emails that showed Wise and other campus administrators used personal email accounts in an attempt to circumvent state public records laws, a violation of university policy. The emails were related to three of the universitys most significant and controversial decisions from the past year: the decision to withdraw a job offer to professor Steven Salaita, the hiring of felon James Kilgore and the proposal to open an engineering-based medical school on the Urbana-Champaign campus. School administrators initially failed to disclose the records, many of which were responsive to requests made under the Freedom of Information Act, the law designed to ensure the public can access information about government bodies and their decision-making processes. University officials learned about the omissions in April and began an internal ethics investigation with the help of outside legal counsel. Some students and faculty members commended the decision to not give Wise the bonus and said they hoped to turn the page on recent controversies. \"We, all the citizens of the state, have to start taking a closer look at lavishing huge amounts of money on administrators,\" said Jay Rosenstein, a professor of media and cinema studies at U. of I. \"Its one of the drivers of tuitions going up and up.\", Rosenstein said he had disagreed with how Wise handled the situation with Salaita, whose job offer was withdrawn last year after he wrote dozens of critical and sometimes profane comments on Twitter about Israel and its military policies. And Rosenstein said he was further disturbed by the content of some of the emails that Wise tried to keep private. \"Once the emails came to light, I think it would be very difficult to lead the campus anymore,\" Rosenstein said. Mitch Dickey, U. of I.s student body president, called the boards vote \"bittersweet.\" Dickey commended Wises efforts to raise the profile and donor base of the university, but said he was \"very disappointed\" about the email scandal and wrote a letter to trustees asking them to reconsider her bonus. Dickey said the vote signified that unethical behavior wont be tolerated after a series of scandals by top administrators since 2009. \"As good a university as this is, none of that will be known as long as we continue to have unethical leaders continuing to degrade our schools reputation,\" Dickey said. Wilson, dean of the universitys College of Liberal Arts and Sciences, took over Wednesday as the acting interim chancellor. Wilson will make an annual salary of $397,500 for her combined role as interim chancellor and dean. An experienced administrator, Wilson worked in the universitys provost office from 2009 until 2014, when she became dean of the College of Liberal Arts and Sciences, the largest college on campus with 11,000 students and a $232 million annual budget, according to the university. Wilson is also a professor of communication and, before joining U. of I. in 2000, taught at the University of California at Santa Barbara for 12 years. She said she looked forward to \"moving this institution forward.\", \"I am not a quiet person and I dont sit back and let other people make decisions,\" Wilson said. \"I am very much working in a team now and I will continue to do that.\", For his part, Killeen also said he hopes the university will soon get beyond the latest scandal and other high-profile controversies, including investigations and lawsuits about whether athletes in three sports have been mistreated. Salaita also is suing the university for breach of contract. \"This undoubtedly has been a difficult year for the University of Illinois,\" Killeen said. \"I think this is a time to turn the page at the university. The practices of the past are not going to be the practices of the future.\", Greg Trotter reported from Chicago. jscohen@tribpub.com, gtrotter@tribpub.com, Twitter @higherednews, Twitter @GregTrotterTrib]", "Date": "20150812", "Author": "[ Jodi S. Cohen, Greg Trotter]", "Link": "http://www.chicagotribune.com/news/ct-university-of-illinois-chancellor-bonus-vote-20150812-story.html", "Title": "[  U. of I. rejects bonus for chancellor, starts dismissal proceedings]"}