{"Content": "[ The first face-to-face meeting of the Chicago mayors race featured Rahm Emanuel offering a measured defense of his first term against a barrage of attacks from challengers who assailed his record on neighborhood development and crime and even his temperament. The 90-minute forum Tuesday before the Chicago Tribune editorial board saw many questions proffered but few politically realistic answers provided by the five candidates who are vying on Feb. 24 to run an economically struggling city facing a host of severe financial problems. With little new ground broken, the event at times appeared to be more of an opportunity for Emanuels rivals to posture for viability as his opponent for a runoff election in April should the mayor be kept below 50 percent support next month. Emanuel largely stayed above the fray amid the sniping of his rivals and benefited most from frequent interruptions of the other candidates by William Dock Walls, who got less than 1 percent of the vote four years ago. That dynamic created an undisciplined contrast to Emanuels demeanor in which the mayor portrayed himself as guiding the city through economic turmoil. At one point, businessman Willie Wilson asked Walls, a self-styled community activist, Are you mad at me or somebody?, The citys economy and finances were predominant themes, with Emanuel maintaining the key to revitalizing neighborhoods was to leverage the strengths and assets of city public works, from improvements to the southern stretch of the CTAs Red Line to the use of Tax Increment Financing funds, to provide an impetus for private investment. But Cook County Commissioner Jesus Chuy Garcia countered that Emanuel has focused on downtown development while most other city neighborhoods have been left behind. The neighborhoods continue to be starved for jobs, Garcia said. He later contended Emanuel, who was born in Chicago but raised in Wilmette, doesnt understand the breadth of what the city needs. Only when you work collaboratively and not confrontationally can you get ahead, Garcia said in a poke at Emanuels storied abrasiveness. Ald. Robert Fioretti, 2nd, contended many economic improvements Emanuel touted actually began under predecessor Mayor Richard M. Daley. In a jab at the recent endorsement Emanuel received from President Barack Obama, Fioretti said the mayor should ask Obama to designate the Pullman neighborhood as a national park to spur South Side development. You can make that call today, Fioretti said to Emanuel, who served as the hometown presidents first White House chief of staff before becoming mayor in 2011. Fioretti long was the head of the Historic Pullman Foundation. The candidates also clashed over the use of TIFs, special districts in which property tax growth from development is captured and supposed to be used to encourage further development. Emanuel said more than 75 percent of TIF funding is rolled back out in the form of public improvements, including funding for schools, libraries, transportation and streetscapes, to spur economic development. But Garcia, whose candidacy is backed by the anti-TIF Chicago Teachers Union, called the program a source of patronage and pay to play influence as well as a form of corporate welfare. We suffered from TIF mania in Chicago, said Garcia, who promised to conduct an audit of how the funds are used. Fioretti proposed spending TIF money to help combat the citys crime problem, saying it would be part of a holistic approach that includes hiring 500 more officers and $25 million to expand youth employment programs. Emanuel noted that Fioretti, a critic of the mayors use of TIF money, wrote a letter on behalf of the Chicago Mercantile Exchange getting $15 million in TIF dollars before Emanuel took office. When I met with the board then, they were going to be leaving, Fioretti responded, referring to the board that oversees the exchange. It wasnt a joke. Emanuel also criticized Fioretti for voting for the privatization of city parking meters during Daleys tenure, asking what the alderman was thinking on a deal that has received widespread public condemnation. Fioretti responded that the Daley administration misrepresented the deal and how the profits would be spent, then criticized Emanuel for refusing to reveal documents on controversial mayoral priorities. On the issue of crime, Emanuel said hes made a comprehensive effort that ranges from community policing to improving the availability of summer jobs and after school programs for youths to keep them off the streets. But the mayor said the biggest impediment to fighting crime was the availability of firearms. Fundamentally, to change the course, we need gun control legislation, he said, though Springfield has refused to embrace Emanuels previous calls as it had Daleys. Garcia proposed hiring 1,000 new police officers but his rivals maintained the city couldnt afford it. We cannot afford 10,000 shootings over four years, Garcia responded. Wilson found himself on the defensive about his plan to take squad cars away from police officers and force them to walk or use public transportation as both a way to hire more police and have them connect to the neighborhood. Asked how an officer on foot would respond to a shooting more than a mile away, Wilson said he would survey police on how many squad cars they actually need. On the issue of city finances, Garcia accused Emanuel of nickel-and-diming Chicago residents to a breaking point with various taxes, fees and fines. Later, Emanuel asked Garcia why he voted as alderman during the administration of the late Mayor Harold Washington for a major property tax increase. Garcia responded: Taking a vote from 30 years ago when we ended Council Wars and defeated the (Ald. Ed) Vrdolyak 29, we carried a deficit of $80 million from (former Mayor) Jane Byrne, we were going to let off 11,000 city employees, including 5,000 policemen, I did the right thing.Asked afterward if the city wasnt in a similar precarious position now requiring tax increases, Garcia said he believes needed revenues can be found in the current budget. Fioretti offered one plan to cover what would be a $550 million increase in city police and fire pension fund payments next year if the General Assembly doesnt make changes to those retirement plans. He proposed borrowing money and issuing bonds to make the initial payment, then paying off the bonds with a 1 percent income tax on suburban residents who work in the city  a controversial concept that would need state authorization. At one point, the candidates were asked if they wanted to question a rival. Wilson repeated his campaigns request for an apology from Emanuel for having challenged the validity of Wilsons candidacy petitions before withdrawing the objection. Emanuel didnt give one.]", "Date": "20150127", "Author": "[ Rick Pearson, Hal Dardick, John Byrne]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-chicago-mayor-candidates-forum-20150127-story.html", "Title": "[ Emanuel, mayoral challengers face off for first time]"}