{"Content": "[ Two sure signs that the fight for a fair legislative map is off to a strong start: Supporters of a proposed constitutional amendment have collected more than 263,000 signatures to get the measure on the ballot. And the attack mailers are already coming in. Opposition letters started hitting mailboxes a few days ago, soon after the Independent Map Amendment campaign announced that it was more than a third of the way to its goal of 600,000 voter signatures. (The group needs roughly 300,000 valid signatures before May 2016.), There are two versions of the letter. One says the effort to end partisan gerrymandering would \"put Illinois one step closer to enacting extreme policies that hurt minorities.\" The other goes further, calling the amendment a ploy to elect Republicans and destroy middle-class families, \"taking away their job protections and driving down their wages.\", Its bad information, with a whiff of warning thrown in: Both letters promise that \"we will take note of who assists in the destruction\" of minority and middle-class communities. The letters were sent by a group calling itself Peoples Map. Its chairman is John Hooker, a former ComEd lobbyist recently named by Mayor Rahm Emanuel to head the Chicago Housing Authority. Others who signed include Chicago businessman Elzie Higginbottom, former ComEd CEO Frank Clark and the Rev. Leon Finney Jr. CEO of The Woodlawn Organization. The targets of the mailing are people who supported a similar amendment that was knocked off the 2014 ballot by minions of Illinois House Speaker Michael Madigan. In Illinois, the current legislative maps were drawn by Democrats to elect Democrats. In Texas, they were drawn by Republicans to elect Republicans. Wherever politicians control the process of redistricting, the goal is to make sure some votes count more than others. The U.S. Supreme Court has... In Illinois, the current legislative maps were drawn by Democrats to elect Democrats. In Texas, they were drawn by Republicans to elect Republicans. Wherever politicians control the process of redistricting, the goal is to make sure some votes count more than others. The U.S. Supreme Court has... Defeating the measure on a legal technicality spared Madigan the need to debate it on its merits, but he floated his arguments anyway: In a mailer meant to drum up support for the lawsuit, Madigan said the amendment would \"diminish the number of minority districts.\", Later, he called it \"Republican politics.\", \"Put the Republicans in charge of something, and theres going to be an adverse effect on minorities,\" he said. Sound familiar?, The Independent Map Amendment is not a Republican initiative; its a good-government initiative. The groups board includes Democrats, Republicans and lifelong independents. There are five African-American and three Latino board members. The names include Cheryle Jackson, former Chicago Urban League president; Sylvia Puente, executive director of the Latino Policy Forum; the Rev. Byron T. Brazier, Apostolic Church of God; former U.S. Sen. Adlai E. Stevenson III; and William Daley, former chief of staff to President Barack Obama. Not so fast with those remap \"reform\" petitions. Sure, Illinois needs to change the hyper-partisan way its lawmakers redraw legislative districts every 10 years to reflect population changes recorded by the U.S. Census Bureau. Sure we ought to stop the party in power  Democrat or Republican ... Not so fast with those remap \"reform\" petitions. Sure, Illinois needs to change the hyper-partisan way its lawmakers redraw legislative districts every 10 years to reflect population changes recorded by the U.S. Census Bureau. Sure we ought to stop the party in power  Democrat or Republican ... You can check out the complete list here: chicagotribune.com/remapboard. A list of supporters is here: chicagotribune.com/remapsupporters. The Independent Map Amendment will not take the job of drawing maps away from Democrats and hand it to Republicans. It will take the job away from politicians and hand it to the people. It will dismantle the secret process through which partisan lawmakers rig the maps and replace it with one in which citizens are active participants. A fair map  produced by a diverse and independent panel, in broad daylight  will protect the interests of all voters, not just those of whichever party happens to be in power. A strong case can be made that the current maps, drawn by the Democrats who are supposedly the guardians of minority representation, significantly shortchange the states growing Latino population. Under the amendment, an 11-member panel would take over the once-a-decade redistricting job. The selection process spelled out in the amendment is designed to minimize the influence of political parties and produce a panel that is racially and geographically diverse. The public would be encouraged to weigh in before, during and after the mapmaking process. The panel would be required to respect boundaries of social, racial and geographic communities, instead of sorting voters into predictable Republican or Democratic districts. By keeping those communities intact, the maps would enable smaller groups of like-minded voters to form coalitions and elect representatives of their choice. Under the current system, the two most important considerations are the voting history of residents and the addresses of incumbents. The resulting maps are so diabolically manipulated that the outcome in most districts is all but guaranteed. Most seats are uncontested. Last November, for example, only one name appeared on the ballot in 58 percent of races for the Illinois House. Almost half of those elected had no opposition in the primary or the general election. Thats nothing to celebrate, regardless of your political leanings. A lawmaker who doesnt have to earn your vote doesnt have to listen to you. Competitive elections produce better candidates  and better, more responsive representatives. Thats why defending the current mapmaking process is an empty argument. Its objective is to protect partisan advantage, not to promote fair representation. It cant do both. A system that produces a ballot with so few choices fails its citizens. All of them.]", "Date": "20150830", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-remap-amendment-michael-madigan-emanuel-daley-stevenson-illinois-edit-0831-jm-20150828-story.html", "Title": "[ Who's afraid of a fair map for Illinois?]"}