{"Content": "[ On the threat list for Ukraine, Moscow is No. 1 with a bullet. The February cease-fire between Ukraine and Russian-backed rebels in the eastern part of the country is crumbling. Intense clashes in recent days could mark the start of a Russian-backed summer offensive by rebels seeking to consolidate and extend their hold on Eastern Ukraine. Russian President Vladimir Putin, playing the long game, still has his forces massed on Kievs border. Russia continues to prop up the rebels in Eastern Ukraine with arms and aid; the ruble is the preponderant currency in rebel-held areas and Putin has never shown an inclination to back down even as EU and U.S. economic sanctions continue to bite. Meanwhile, the U.S. is sending tanks, heavy artillery and other military aid across Eastern Europe to shore up security and deter another Russian land grab in Ukraine. NATO is mounting a Europe-based rapid-reaction force designed to respond to military crises within days. The Pentagon also is moving to supply Ukraine with bigger, longer-range radar to counter artillery deployed by the rebels. All good, but Ukraine still needs weaponry, not just non-lethal assistance, from the West. President Barack Obama believes that arming Ukrainians could provoke Putin and escalate the conflict. But Defense Secretary Ash Carter and Director of National Intelligence James Clapper disagree, publicly favoring or leaning toward arming Ukraine. Listen to them, Mr. President. Weve long urged that move to help Ukraines government punch back against Russian-supplied forces. The U.S. and its allies are pushing Ukraine President Petro Poroshenko and the Ukrainian parliament to push through key political changes under the terms of the February truce. Kiev has reluctantly begun to adopt constitutional changes and authorize elections that would effectively legitimize the Russian-backed rebels. Those changes would grant the rebel-held areas significant autonomy. If youre out for a hike and find a deep, wide chasm in your path, you have a few options. You might give up and turn back. You might devise a way to get over it. You might look for a way around it. What you would not do is jump halfway across. Half-measures are often worse than none. But when... If youre out for a hike and find a deep, wide chasm in your path, you have a few options. You might give up and turn back. You might devise a way to get over it. You might look for a way around it. What you would not do is jump halfway across. Half-measures are often worse than none. But when... But Ukrainian leaders fear that such measures wont satisfy Putin for long. They wont. Putin annexed Crimea as part of his larger plan to resurrect Soviet-style influence and draw Kiev closer to Moscows orbit. Russian forces and proxies in the east continue attacks and shelling. Theyre still fighting the war, truce or not. In June, Gen. Philip Breedlove, NATOs supreme allied commander, said Russia is building an efficient military supply line to increase its ability to send troops and tanks into Ukraine. \"I dont think that Mr. Putin is done in eastern Ukraine,\" he said. Poroshenko is clear-eyed about the stakes: \"If we do not stop the aggressor, that means global security doesnt exist. Any time, any plane or submarine can make a missile attack, including against the U.S.,\" he told The Wall Street Journal. \"We arent demanding that British, American or French soldiers come here and fight for us. Were doing this ourselves, paying the most difficult price  the lives of my soldiers. We need just solidarity.\", Russian President Vladimir Putins propaganda targeted at audiences outside Russia doesnt work, but neither will any Western counter-efforts directed at Russians. A new report from the Pew Research Center explains why. Pew surveyed public opinion among 45,435 respondents in 40 nations between... Russian President Vladimir Putins propaganda targeted at audiences outside Russia doesnt work, but neither will any Western counter-efforts directed at Russians. A new report from the Pew Research Center explains why. Pew surveyed public opinion among 45,435 respondents in 40 nations between... Ukraine cant and wont match Russian firepower. But sending more arms to Ukraine can make Russian-backed forces pay a higher price if they continue to attack Ukrainian soldiers and civilians. The U.S. and EU also have plenty of room to ratchet up economic sanctions against a weakened Russian economy. In June, Putin railed about the extension of tough EU economic sanctions against Russia for its military interference in Ukraine. But he hasnt yielded. Last month, Marine Gen. Joseph Dunford, the incoming chairman of the Joint Chiefs of Staff, said Russia topped the Pentagons national security threat list. \"If you want to talk about a nation that could pose an existential threat to the United States, Id have to point to Russia,\" he told the Senate Armed Services Committee. \"And if you look at their behavior, its nothing short of alarming.\", Strong words from a Pentagon chief who also assesses global threats from Islamic State, Iran, al-Qaida, and terror cells around the world. Some may quibble. But on the threat list for Ukraine and the wider Baltics, Moscow is No. 1 with a bullet.]", "Date": "20150814", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-ukraine-russia-putin-obama-edit-0816-20150814-story.html", "Title": "[ Ukraine's long, hot summer]"}