{"Content": "[ During the 2008 presidential primaries, when things were heating up, I penned one of my more controversial perspectives. Back then, my focus wasnt just Bill and Hillary Clinton, but other white politicians that cozy up to black clergy, for the sole purpose of garnering African-American voter support. I suggested that once elected, they pay little attention to the issues that impact the black community. The sudden appearance of glad-handing politicians in the pews brings to mind songwriter Carole Kings hit that asked, \"Will you still love me tomorrow?\", Heres a bit of the 2008 perspective that prompted a fair amount of discourse. \"Numbered are the days when white politicians, such as Bill and Hillary Clinton, can show up at a black church, clap and sway to the beat, and leave with a guarantee of votes. \"White politicians will have to rethink their political strategies in the black community. They will have to spend more time understanding problems and offering real solutions, \"As it is, white politicians offer little more than lip service to problems confronting the African-American community. Once anointed by black clergy, they deliver even less.\", Not very long ago, I wrote that Hillary Clintons use of a personal email account to conduct the official business of the United States would impact her presidential run. Look, it doesnt take someone with my adroit political savvy to figure out that Clintons foible is trust and secrecy. However,... Not very long ago, I wrote that Hillary Clintons use of a personal email account to conduct the official business of the United States would impact her presidential run. Look, it doesnt take someone with my adroit political savvy to figure out that Clintons foible is trust and secrecy. However,... Eight years later, as the 2016 presidential primaries head into full swing, Ive been thinking about that column and if my perspective has changed. The answer is yes. This time around, I would amend my position to include local elections and all politicians regardless of their ethnicity. Looking back, during the 2008 presidential primaries, I should have said more about the important role that the clergy plays in getting firm commitments from those seeking office. Having said that, its imperative that religious leaders dont, amid the hallelujahs, accept vague promises or lose sight of the larger picture. Look, Im not trying to preach to the pulpit. However, when the politicians come calling, and believe me they will, its not only a matter of how one congregation or community will benefit, but how supporting the candidate serves the interest of the larger community. For example, as it relates to local elections, issues like unemployment, crime, education and the tense relationship between blacks and law enforcement are paramount. The bottom line is that showing up just isnt enough. Candidates should be able to, in exchange for a pledge of support, offer a detailed strategy for dealing with problems. Anthony Stanford is an Aurora resident and Beacon-News columnist.]", "Date": "20150904", "Author": "[ Anthony Stanford]", "Link": "http://www.chicagotribune.com/suburbs/aurora-beacon-news/opinion/ct-abn-stanford-column-st-0906-20150904-story.html", "Title": "[ Candidates need to offer more than vague promises ]"}