{"Content": "[ After all the customers had left the stores, after most of the employees had gone home, Orland Park police invaded Orland Square Mall last Sunday night in what is known as an \"active shooter drill.\", \"The reality is that the sort of thing were trying to prepare for can occur anywhere at any time,\" Police Chief Tim McCarthy said. McCarthy mentioned the school shooting in Columbine, Colorado in 1999 as well as the recent attack on a freedom of speech cartoon contest in Texas (the Islamic State has claimed responsibility) and a mass shooting at a theater in Colorado as examples of why the most peaceful of communities have to be prepared these days for the worst-possible scenarios. Two years ago, former Gov. Pat Quinn signed a law requiring every school in the state to hold safety drills in cooperation with law enforcement agencies to prepare for the day that a gunman might threaten the lives of teachers and children. \"That means every year, in each of our 13 high school and elementary schools, we have to do an active shooter exercise,\" McCarthy said, emphasizing that given the potential threat such training is necessary. He said the drill at Orland Square Mall involved about 100 people, including police, firefighters, a regional SWAT unit and volunteers playing the roles of shooting victims and panicked store employees. Rounds that sound like gunshots were fired in the area of the Cheesecake Factory, he said, and fake blood spurted from the wounds of mock victims. Some of the most important political leaders in Illinois are finally talking about passing a casino expansion bill. Chicago Mayor Rahm Emanuel has had discussions with Gov. Bruce Rauner, House Speaker Michael Madigan and Senate President John Cullerton about the need for such legislation, according... Some of the most important political leaders in Illinois are finally talking about passing a casino expansion bill. Chicago Mayor Rahm Emanuel has had discussions with Gov. Bruce Rauner, House Speaker Michael Madigan and Senate President John Cullerton about the need for such legislation, according... \"Everyone was warned well in advance that we were planning to do this,\" the chief said. \"We sent out fliers, sent emails to all the stores, told all the mall officials and made announcements over loudspeakers as the drill was taking place. Of course, theres always going to be someone who doesnt get the word.\", That last comment came in response to my mention that someone had gone on social media to complain that the mall owners had not adequately notified store employees about the exercise. \"We scheduled the live action event from 7 p.m to 11 p.m. on a Sunday, when the mall would be closed to customers,\" McCarthy said. \"But there are always a few employees working late, and we understand that. We try to make sure everyone was notified in advance. \"Also, because part of the exercise that included the sounds of gunshots was taking place in an area of the mall not far from the Cheesecake Factory, which is a restaurant open after the rest of the mall closes, we tried to make sure everyone there was aware that this was not a real event.\", Counselors who work with traumatized children from birth to 5 years of age  youngsters who have seen murders, domestic violence and fires that destroyed their homes  fear the state is going to cut their funding. The program called Safe From The Start is financed through the Illinois Criminal... Counselors who work with traumatized children from birth to 5 years of age  youngsters who have seen murders, domestic violence and fires that destroyed their homes  fear the state is going to cut their funding. The program called Safe From The Start is financed through the Illinois Criminal... But its a reminder to anyone conducting such drills that there will always be something overlooked, someone forgotten and even people trained to do the right thing will forget their training. Thats why, no matter how many fire drills people conduct in office buildings, something unforeseen almost always happens. Doors are locked that should be open. People go up the stairs instead of down. When lives are actually at risk, flames creeping up through the baseboards or smoke pouring into a room, people often tend to forget the drill. McCarthy, a former Secret Service agent and a leader in this states law enforcement community, said he has done his best to make sure his police department is prepared for the day when a mass shooting might occur. The physical layout of each school has been digitalized and downloaded into computers that police have access to in their squad cars. So police responding to the scene will be able to download a map of every entrance/exit. McCarthy said that during one recent drill, police directed rescuers to an underground entrance beneath a swimming pool. In addition to the police and paramedics involved in a drill, McCarthy said area hospital are put on notice. The most seriously wounded in such an event would be taken to the nearest hospital  Palos Community Hospital in the case of Orland Square  and those having lesser wounds would go to other hospitals in the region. \"We anticipate that in a mass shooting incident no one hospital would be able to treat all the people who were injured,\" he said. I want to emphasize that I believe such training exercises are a good thing. As McCarthy said, we live in a world where mass shootings and bombings seem to occur every week, if not every day. In the U.S. far more of these incidents have been caused by people suffering from mental illness than from those acting on behalf of terrorist organizations or motivated by some political cause. But the 9/11 terrorist attacks and the Boston Marathon bombing will never be far from the thoughts of those of us who lived through them. That said, instead of merely preparing for a possible attack on a mall or a school, I cant help thinking we would all be better served by addressing mental illness. I dont know if hospitals, schools or law enforcement agencies hold any drills on how to react if a parent reports a child whos suffering from such problems or has concerns about the behavior of a spouse. Im not talking about the child who draws a picture of their teachers head exploding (although thats reason for concern), but the dilemmas faced by families who often discover that its difficult, if not impossible, to get a mentally ill relative the care they need to remain a stable, productive member of society. Cook County Sheriff Tom Dart seems to be the only public official repeatedly sounding the alarm about this in Illinois. He has been forced to emphasize the cost of using Cook County Jail to warehouse the mentally ill because, frankly, thats the only way to make most people care about the issue. I take that back. People care for 48 hours after a couple of dozen people get shot in a movie theater or at a mall. After that, the publics attention gets refocused on Bruce Jenners sex change. By comparison, I think people in this country are much too worried about the specter of terrorism. Not that it isnt a reality, as I pointed out earlier, but I keep thinking about the people of England, who during World War II had bombs dropped on their homes and places of business and later were the first victims of missile attacks. Their shipments of food were being sunk by German U-Boats. The threat of invasion by an army commanded by one of the craziest men in history was quite real. They huddled in bomb shelters not knowing what they would find upon coming up. Yet, they put out the fires. Cleaned up the rubble. Helped their homeless neighbors. Planted their Victory Gardens. And despite living in terror, refused to give in to it. We dont face anything like that. This current crop of terrorists are amateurs compared to Adolf Hitler. And like him, they will ultimately fail. As we do our best to prepare for the worst, even to the point of conducting extensive drills in shopping malls, its also important to remember that the best preparation for the future is to remember the past. Or, as Winston Churchill once said, \"I intend to live forever, or die trying.\" Sorry, that was actually Groucho Marx. I thought that if you got this far, you deserved a laugh. pkadner@tribpub.com]", "Date": "20150507", "Author": "[ Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-shooter-st-0508-20150507-column.html", "Title": "[ Preparing for tragedy at a shopping mall]"}