{"Content": "[ Democratic lawmakers and rights groups on Monday accused the State Department of politicizing its annual rankings of nations on their efforts to combat modern-day slavery, as key trading partner Malaysia was taken off a blacklist. Cuba was also given an upgrade, a week after the U.S. and Cuba formally restored diplomatic relations, ending a half-century of estrangement. But Thailand, downgraded with Malaysia last year because of pervasive labor abuses in its lucrative fishing industry, remained stuck on \"tier 3\"  the lowest ranking in the departments annual Trafficking in Persons Report. Undersecretary of State Sarah Sewall denied political considerations had come into play. Secretary of State John Kerry formally launched the annual U.S. assessment of how 188 governments around the world have performed in fighting the flesh trade and other forms of exploitative labor, which he described as a \"battle against money.\", He said the report was not intended to \"name and shame\" but to galvanize action against an illicit trade that the U.N. estimates generates $150 billion in profits each year, in industries also including mining, construction and domestic service. Critics contend that Malaysias upgrade is related to its participation in a U.S.-backed trade agreement among Pacific Rim countries. Thailand is not part of the proposed agreement. \"Upgrades for Malaysia and Cuba are a clear politicization of the report, and a stamp of approval for countries who have failed to take the basic actions to merit this upgrade,\" Democratic Sen. Robert Menendez said in a statement. Democratic Rep. Lloyd Doggett said of Malaysias upgrade: \"Bending the standards to reward a country that accepts trade in women, children, and forced laborers is wrong.\", Sewall cited a strengthening of Malaysias anti-trafficking law and an increase in trafficking investigations and prosecutions on the previous year, although convictions decreased. Malaysia is one of 12 nations seeking this week to finalize negotiations on the Trans-Pacific Partnership, the key economic plank of Obamas Asia policy. An anti-trafficking amendment to legislation crucial for the deals eventual ratification by Congress limits the presidents ability to secure free trade agreements with countries assigned to tier 3. Like Thailand, Malaysia has faced intense international criticism over trafficking of stateless Rohingya Muslims from Myanmar and Bangladesh aboard overcrowded boats. Dozens of graves as well as pens likely used as cages for migrants have been found in abandoned jungle camps on both sides of the Thai-Malaysian border. \"Migrants are being trafficked and abused with impunity, Rohingya victims bodies are being pulled from shallow graves at the border and convictions are down this year compared to last year  so how can the State Department call this progress?\" said Phil Robertson, deputy director of the Asia division at Human Rights Watch. Sewall said the discovery of the mass graves in Malaysia happened almost two months beyond the current reporting period that ended March 31. She said Malaysia still has \"much room for improvement.\", In Cubas case, Sewall cited progress in addressing sex trafficking but she voiced concern the island nations government has failed to recognize the problem of forced labor. Cuba, which had been on the blacklist for several years, has denied allegations of coerced labor on Cuban government work missions abroad. Among other nations upgraded from tier 3 were Uzbekistan, the Democratic Republic of Congo, Papua New Guinea and Saudi Arabia. Those downgraded to tier 3 were Belarus, Belize, Burundi, Comoros, the Marshall Islands and South Sudan. The 23 nations on the blacklist also include Iran, Libya, North Korea, Russia, Syria and Zimbabwe. President Barack Obama now has 90 days to determine whether to apply sanctions against tier 3 governments. The president can block various types of aid and could withdraw U.S. support for loans from the World Bank and International Monetary Fund. But the U.S. often chooses not to, based on its national security interests, as it did last year for both Thailand and Malaysia, which Washington views as important partners in its strategic outreach to Asia. The Thai Embassy in Washington \"strongly disagreed\" with its retention on tier 3, saying it didnt reflect reality and the governments efforts to combat human trafficking. On Friday, Thai state prosecutors recommended charges against more than 100 people, including a Thai army general, implicated in trafficking of migrants. Thailand also remains under the spotlight over slavery in Southeast Asias fishing industry. A year-long Associated Press investigation has led to more than 800 people being rescued or repatriated in recent months. Associated Press]", "Date": "20150727", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-malaysia-cuba-human-trafficking-blacklist-20150727-story.html", "Title": "[ Malaysia, Cuba taken off U.S. human trafficking blacklist ]"}