{"Content": "[ The Rev. Patrick Henry Reardon is getting out of the civil marriage business. The Orthodox Christian priest on Chicagos North Side says the U.S. Supreme Court ruling that legalizes same-sex matrimony reinforces his recent decision to no longer sign licenses that make marriages valid in the eyes of the state and now the nation. That doesnt mean Reardon wont do weddings. On the contrary, he gladly will bless the union of a Christian man and woman and perform the sacrament of marriage. But those couples must go to a courthouse if they want to be legally bound. He says he can no longer in good conscience serve as an agent of the state. \"The strange situation in the United States is clergymen not only act in the name of the church, they also act in the name of the state,\" said Reardon, the pastor of All Saints Antiochian Orthodox Church in Chicagos Irving Park community. \"The clergymen wear two hats. Im making a political statement in this sense: Im accusing the state of usurping the role of God. What Im saying is, I dont agree with you and Im going to change the way I do things. I will not act in your name.  I will not render unto Caesar that which belongs to God.\", The unusual protest has inspired other Christian clergy  Orthodox, Roman Catholic and Protestant  to consider following his lead, a shift Reardon hopes will lead the nation to a different model of marriage, one that no longer deputizes clergy to sign marriage licenses and, in his opinion, effectively uphold the states definition of marriage. In Illinois, couples typically go to the county clerk to apply for a marriage license no more than 60 days before they wed. Whoever officiates at the ceremony signs the license as a witness. The county then records the marriage. The couple also has the option of exchanging vows in front of a judge. Thats the only option now for Reardons parishioners if they want to be married in the eyes of the law. Episcopalians voted overwhelmingly Wednesday to allow religious weddings for same-sex couples, solidifying the churchs embrace of gay rights that began more than a decade ago with the pioneering election of the first openly gay bishop. The vote came in Salt Lake City at the Episcopal General Convention,... Episcopalians voted overwhelmingly Wednesday to allow religious weddings for same-sex couples, solidifying the churchs embrace of gay rights that began more than a decade ago with the pioneering election of the first openly gay bishop. The vote came in Salt Lake City at the Episcopal General Convention,... Archbishop Blase Cupich, Chicagos Roman Catholic leader, said in a recent interview that the idea has not come up among Americas Catholic bishops or Chicago priests, but he pointed out that a \"two-tiered type of marriage\" already exists in some places, including Europe. Regardless of who signs the license, he added, theres already a clear distinction between the two in the U.S. \"Civil marriage doesnt make people promise and keep the promise of permanence because of the ease of divorce,\" Cupich said. \"We ask people to be married until death do you part and we really mean that. ... Its important to recognize we already have a difference between civil marriage and church marriage because of the promises.\", Indeed, the governments view of marriage as a legally binding contract already contradicts the Orthodox Christian understanding of marriage as a sacrament  blessing a union that already existed because it was created by God. And therein lies the problem, Reardon said. With a handful of Alabama counties still refusing to grant gay marriages even as they issued licenses for straight weddings, a federal judge ruled Wednesday that all must abide by court decisions allowing same-sex unions. Opposition withered as some counties complied with the decision, and gay... With a handful of Alabama counties still refusing to grant gay marriages even as they issued licenses for straight weddings, a federal judge ruled Wednesday that all must abide by court decisions allowing same-sex unions. Opposition withered as some counties complied with the decision, and gay... \"Government has no authority whatsoever to alter that,\" Reardon said. \"Whence a judge, magistrate or a justice of the peace does the ceremony, thats just a legal act. As a priest I will no longer step in and serve in that function.\", Reardon, who was raised Roman Catholic and converted to the Episcopal faith, embraced Orthodox Christianity in the 1980s when Episcopalians began to change their prayer book and ordain gay clergy. He chose the Antiochian Orthodox Church because it was particularly open to converts. In fact, three-fourths of the members of the church in North America are American born, as are nearly all of Reardons parishioners. Thats not necessarily the case in the roughly two dozen ethnic Orthodox churches where many parishioners have immigrated to the U.S. from countries with a particular Orthodox patriarch. But the theology of marriage is the same in all branches, said the Rev. Johannes Jacobse, president of the American Orthodox Institute. Its considered to be much more than a partnership. \"We see the sacramental as the completion of the natural,\" said Jacobse, also an Antiochian Orthodox priest. \"We see marriage as a means of salvation, as a way one achieves salvation. Its not just a contract or agreement. It certainly is that. But its more.\", Clergy on both sides of the same-sex marriage debate support Reardons boycott, though based on a slightly different rationale. The Rev. Tony Jones, an evangelical author and proponent of same-sex marriage, has been advocating for a separation of religious and civil marriage since 2010. \"This social change happened a lot faster than anybody predicted,\" said Jones, who teaches at Fuller Theological Seminary in Pasadena, Calif. \"When I declared that I would no longer sign marriage licenses and encouraged other clergy to do the same, it was an attempt to actually buy the church some freedom to say we can sacralize a same-sex union and we dont need the state to legalize it. \"The other reason I did it was on behalf of people like Father Reardon,\" Jones added. \"I thought it would buy conservatives some time and some latitude and they could say the government can do whatever the government wants to do regarding marriage and weddings. But in our church were going to have a different standard.\", He said most clergy members he has surveyed agree in principle that they should not serve as arms of the government, but signing that certificate has become so much a part of the American marriage ritual that its difficult for them to see an alternative. Bishop Demetrios of Mokissos, chancellor of the Greek Orthodox Metropolis of Chicago, said he doesnt foresee such a boycott in Chicago. He even questions whether its legal. \"I cant imagine any of our priests doing that,\" he said. \"It hasnt happened yet and I dont anticipate it happening to make a political statement,\" he said. Jacobse said Reardon is the first Orthodox priest to take such a strong a political stand. But the recent Supreme Court ruling has sparked a discussion among other brethren, he said. \"It was a bold move on Father Patricks part,\" Jacobse said. \"A lot of priests are wondering and asking the same thing. To remove all conflict between the church and the state is to go the path that Father Reardon has chosen to go on. I anticipate more priests are going to go that way.\", Reardon emphasizes that he does not discourage couples from seeking licenses and legitimacy in the eyes of the law. But having that certificate will no longer be a condition of getting married at All Saints. \"If you want the tax advantages of marriage recognized by the state, youre going to have to do something else about it, like go down to a justice of the peace,\" he said. \"If you dont want that, thats perfectly OK. Im not going to require that at this parish.\", mbrachear@tribpub.com, Twitter @TribSeeker]", "Date": "20150703", "Author": "[ Manya Brachear Pashman]", "Link": "http://www.chicagotribune.com/news/ct-orthodox-priest-refuses-marriage-licenses-met-20150702-story.html", "Title": "[  Chicago priest protests same-sex marriage, won't sign civil marriage licenses]"}