{"Content": "[ Keeping the pronouns straight. In my experience, thats the hardest part of adjusting to a friends sex-change operation. My experience in this case consists of working in the same newsroom as Ridgely Hunt, an award-winning war correspondent for the Chicago Tribune, as he became Nancy Hunt in the mid-1970s. Or, as Nancy probably would prefer to hear me say, she was always Nancy; it only took the help of modern gender reassignment surgery to let her reveal her true feminine self in public. Thats my pronoun problem. Even today its hard for me to talk about \"her\" award-winning coverage of the Vietnam War, for example, when that coverage was published under \"his\" byline when he was still a \"he.\", A Yale graduate from a Social Register family and a veteran of two wars, Hunt was known for taking on dangerous assignments with gifted writing. His  her?  reputation for macho stories only made Hunts changes from a \"him\" to a \"her\" all the more astonishing to the rest of us. After her final operation in 1978, she feared her editors might try to fire her, but instead she was reassigned to inside work on the editing desks. She wrote an autobiography, \"Mirror Image,\" that year. She was profiled in People magazine and grilled by the audience on Phil Donahues TV show. She was even immortalized by Hollywood when a clip from that show was included in the Brian De Palma thriller \"Dressed to Kill\" to give a touch of real-life authenticity to its plot. Im all for Caitlyn Jenner living her truth, as I believe the saying goes. Not only for her sake but for the sake of those whove been, perhaps, too slow to get their minds around transgenderism. Its real, not a whim or fetish, and those who experience it deserve understanding, compassion and,... Im all for Caitlyn Jenner living her truth, as I believe the saying goes. Not only for her sake but for the sake of those whove been, perhaps, too slow to get their minds around transgenderism. Its real, not a whim or fetish, and those who experience it deserve understanding, compassion and,... Hunt retired in 1984, remarried and died in 1999 at age 72 as Nancy Hunt Bowman. \"All the years as a man, I would look in the mirror and hate myself,\" she told People in 1978. \"Now Im an avowed sexual freak. Yet I look in that mirror, and after a lifetime of self-loathing I can say, Hey, I like me.\", Those days come to mind as I once again wrestle with the proper pronouns for former Olympic decathlon champ Bruce Jenner, who famously has become the eerily familiar-looking Caitlyn Jenner. Like others who are way beyond tired of the self-promoting Kardashians, a famous-for-being-famous clan of which Caitlyn is a part, I tried to ignore her latest burst of glamorized controversy. But now I wonder: Will Caitlyn Jenners fame do for the gender rights cause what, for example, Rock Hudsons and Magic Johnsons revelations of their HIV infections did for the fight against AIDS?, A lot already has changed. The trans-rights movement, not to be confused with the gay and lesbian rights movement, is growing in power and appeal. Time headlined its cover featuring actress and former man Laverne Cox last year with the headline \"The Transgender Tipping Point\"  without a question mark. I am not normal. This, I learned from a news story 35 years ago. The details have faded with the passage of time, but the gist of it remains clear. Some expert had crunched a bunch of numbers in search of the average human being, the planetary norm, and found that she was an 8-year-old Japanese... I am not normal. This, I learned from a news story 35 years ago. The details have faded with the passage of time, but the gist of it remains clear. Some expert had crunched a bunch of numbers in search of the average human being, the planetary norm, and found that she was an 8-year-old Japanese... U.S. Sen. Lindsey Graham of South Carolina, now a presidential hopeful, seemed to get that message when he invited Jenner, who says he is a Republican, to vote for him as he pitched for a more inclusive GOP. Still, trans people endure enough discrimination to look like the final frontier in the civil rights revolution. In most states, it is still legal to fire someone for being transgender. Surveys by the National Center for Transgender Equality and the National Gay and Lesbian Task Force find huge levels of violence and persecution against transgender people  41 percent of respondents said that they had attempted suicide. As writer Michelle Goldberg reported last year in a piece in The New Yorker titled \"What Is A Woman?,\" transgender folks also are attacked by radical feminists on the left as being either inauthentic women, in the cases like Jenners, or sellout women, in the cases of women transitioning to men, who allegedly caved to the notion that its better to be a man. Cant we all get along? Jenner has added fuel to that radical feminist backlash by announcing that she is leaving her male genitalia intact. A large number of trans women do, surveys show. Thats their right, but it doesnt make my pronoun problem any easier. Page, a member of the Tribune Editorial Board, blogs at http://www.chicagotribune.com/pagespage. \"Culture Worrier,\" a collection of his columns, is available in print and at http://www.chicagotribune.com/ebooks. cpage@tribpub.com, Twitter @cptime]", "Date": "20150609", "Author": "[ Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-jenner-transgender-caitlyn-bruce-clarence-page-perspec-0610-20150609-column.html", "Title": "[ While society grapples with pronouns, transgenders fight for acceptance]"}