{"Content": "[ Irans support for international terrorist groups remained undiminished last year and even expanded in some respects, the Obama administration said Friday, less than two weeks before the deadline for completing a nuclear deal that could provide Tehran with billions of dollars in relief from economic sanctions. The assessment offered a worrying sign of even worse terror-related violence to come after a year in which extremists in the Middle East, Africa and Asia committed 35 percent more terrorist acts, killed nearly twice as many people and almost tripled the number of kidnappings worldwide. Statistics released by the State Department on Friday also pointed to a tenfold surge in the most lethal kinds of attacks. Yet even as the Islamic State and the Taliban were blamed for most of the death and destruction in 2014, the departments annual terrorism report underscored the ongoing threat posed by Iran and its proxies across the Islamic world and beyond. Tehran increased its assistance to Shiite militias fighting in Iraq and continued its long-standing military, intelligence and financial aid to Lebanons Hezbollah, Syrian President Bashar Assads embattled government and Palestinian groups Hamas and Islamic Jihad. While the 388-page study said Iran has lived up to interim nuclear deals with world powers thus far, it gave no prediction about how an Iran flush with cash from a final agreement would behave. World powers and Iran are trying to conclude an accord by the end of the month, setting 15 years of restrictions on Irans nuclear program in exchange for significant relief from the international sanctions that have crippled the Iranian economy. The negotiations dont involve Irans support for militant groups beyond its border. But Israel and the Sunni monarchies of the Persian Gulf, Irans regional rivals, fear a fresh wave of terrorism as a result of any pact. President Barack Obama, hoping to ease their fears, has said most of the money would go to Irans economic development. WikiLeaks is in the process of publishing more than 500,000 Saudi diplomatic documents to the Internet, the transparency website said Friday, a move that echoes its famous release of U.S. State Department cables in 2010. WikiLeaks said in a statement that it has already posted roughly 60,000 files.... WikiLeaks is in the process of publishing more than 500,000 Saudi diplomatic documents to the Internet, the transparency website said Friday, a move that echoes its famous release of U.S. State Department cables in 2010. WikiLeaks said in a statement that it has already posted roughly 60,000 files.... Americas \"grave concern about Irans support for terrorism remains unabated,\" White House spokesman Eric Shultz said. \"That is all the more reason that we need to make sure they dont obtain a nuclear weapon.\", In total last year, nearly 33,000 people were killed in almost 13,500 terrorist attacks around the world, according to the figures that were compiled for the State Department by the National Consortium for the Study of Terrorism and Responses to Terrorism at the University of Maryland. Thats up from just over 18,000 deaths in nearly 10,000 attacks in 2013. Twenty-four Americans were killed by extremists in 2014, the report said. And abductions soared to 9,428 in the calendar year from 3,137 in 2013. The report attributes the rise in attacks to increased terror activity in Iraq, Afghanistan and Nigeria and the sharp spike in deaths to a growth in exceptionally lethal attacks in those countries and elsewhere. There were 20 attacks that killed more than 100 people each in 2014, compared to just two a year earlier, the report said. Among those were Decembers attack by the Pakistani Taliban on a school in Peshawar that killed at least 150 people and the June attack by Islamic State militants on a prison in Mosul, Iraq, in which 670 Shiite prisoners died. Jason Rezaian, the Tehran bureau chief of the Washington Post, wrote two interesting stories from Iran last July  about fear of an epic water shortage and the cult popularity of baseball. Then Rezaian disappeared from the pages of the Post ... because he disappeared into an Iranian prison. After... Jason Rezaian, the Tehran bureau chief of the Washington Post, wrote two interesting stories from Iran last July  about fear of an epic water shortage and the cult popularity of baseball. Then Rezaian disappeared from the pages of the Post ... because he disappeared into an Iranian prison. After... At the end of 2014, the prison attack was the deadliest terrorist operation in the world since Sept. 11, 2001, according to the report. Despite all indications pointing toward increased violence, the State Departments counterterrorism coordinator said the numbers didnt reflect improvements by the U.S. and its partners in stamping out terrorism financing, improving information sharing, impeding foreign fighters and forming a coalition to fight the Islamic State. \"We have made progress,\" Ambassador Tina Kaidanow said. Attacks occurred in 95 countries last year but were concentrated in the Mideast, South Asia and West Africa. Iraq, Pakistan, Afghanistan, India and Nigeria accounted for more than 60 percent of the attacks. Adding Syria, they comprised roughly 80 percent of the fatalities, the report found. The rise in kidnappings is mainly attributable to the mass abductions by terrorist groups in Syria, notably the Islamic State and the al-Qaida-linked al-Nusra Front. In Nigeria, Boko Haram was responsible for most, if not all, of the nearly 1,300 abductions, including several hundred girls from a school in Chibok. By contrast, the report cited fewer than 100 terror-related kidnappings reported in Nigeria in 2013. The terrorism statistics are an annex to the State Departments \"Country Reports on Terrorism,\" an annual survey of attacks and trends mandated by Congress. Fridays reports noted the \"unprecedented seizure\" of territory in Iraq and Syria by the Islamic State, its ability to recruit foreign fighters to join its cause and the emergence of self-proclaimed affiliates, notably in Libya, Egypt and Nigeria. It cited a rise in so-called lone wolf attacks in the West and terrorists employing more extreme methods of violence to repress and frighten communities under their control. Associated Press]", "Date": "20150619", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-iran-threat-20150619-story.html", "Title": "[  US report finds Iran threat undiminished as nuke deal nears ]"}