{"Content": "[ The sandy shoreline of Montrose Beach early in the morning exudes tranquillity. But on several occasions in recent weeks, the calm has been broken by conflicts between two groups who love this spot for different reasons  bird watchers and dog walkers. Montrose Beach is the site of a protected bird sanctuary that is one of the premier birding spots in the Chicago area. Some 340 species have been seen here, including many rare ones. However, the sanctuary is adjacent to a large beach that is beloved by many dog owners as a spot to let their pets romp without a leash. That is an illegal pleasure. Dogs, leashed or not, are not permitted on Chicago beaches except for designated dog beaches like the one a little north of Montrose at the Wilson Avenue boat launch. Signs on the swimming beach at Montrose say that dogs are not allowed and warn of a minimum $300 fine. The prohibition is routinely ignored. Birders complain that off-leash dogs are chasing away birds foraging on the beach, and that sometimes the dogs even run into the protected bird sanctuary area. \"These dogs go after them like its a game,\" said Fran Morel, a Montrose birder who is a board member of the Chicago Ornithological Society and the Illinois Ornithological Society. \"The birds just cant take it, and leave.\", Hundreds of birders flocked to Chicagos Montrose Harbor over the weekend in hopes of catching a glimpse of a species so rare that it nearly went extinct. The Kirtlands warbler has been on the federal endangered species list since 1967, was once known to nest only in a small area of Michigan and... Hundreds of birders flocked to Chicagos Montrose Harbor over the weekend in hopes of catching a glimpse of a species so rare that it nearly went extinct. The Kirtlands warbler has been on the federal endangered species list since 1967, was once known to nest only in a small area of Michigan and... The presence of dogs infuriates birders, who spend hours at Montrose watching and photographing birds. \"Theres a lot of anger because people are missing out on rare birds because the dogs are running around chasing these birds on the beach,\" said Luis Munoz, president of the Chicago Ornithological Society and another Montrose regular. More important, he said, is the effect on migrating birds. \"Theyre there to feed and rest and continue on,\" he said. \"But they dont have that chance because of the dogs and people that disobey the rules.\", Dog owners note that the beach itself is not a bird sanctuary and therefore remains an appropriate place to walk a dog as long as it is under control. \"I pay taxes. I should be able to walk where I want with my dog,\" said Loni Perry, whose German shepherd/golden retriever mix was standing placidly in the water. She appreciates the bird sanctuary, she said, and keeps away from it. She said her dog has no interest in birds. The conflict between birders and dog owners here has been going on for years. But it reached a high pitch this spring, when migration brought a number of rare species to Montrose. Steve Jenear, for example, was thrilled to see a pair of rarely-spotted Wilsons phalaropes, a shore bird, on the sand a few weeks ago, but dismayed when they were quickly chased off. \"Someone came in with a dog from the beach house area, and as soon as they hit the sand let it off the leash,\" he said. \"The dog ran and flushed all the birds. \"I sat there for an hour and a half and waited for them to come back. They never did,\" he said. As he waited, he said, \"I counted 10 dogs off leash.\", Cathy Breitenbach, director of cultural and natural resources at the Chicago Park District, urged dog owners to obey the rules. \"The birders do have a valid point,\" she said. \"Its such a wonderful area, the Montrose dunes and the Magic Hedge. To have this kind of wildlife habitat in the city is such a resource for birders and people who love nature. \"I have to believe a lot of people dont realize the impact they may be having.\", She said the Park District has asked the Chicago Police Department, which provides security at Chicago parks in conjunction with park district security staff, to keep increased watch at Montrose. Still, \"its not possible to be in every spot all the time,\" Breitenbach said. \"We have to ask the public to help us out and respect this really critical and valuable habitat. We ask that people please help us out by following these rules.\", In a statement, police commander Robert Cesario of the Belmont District asked anyone observing a violation of the law or city ordinance to notify police. Dogs arent the only problem birders see affecting the Montrose sanctuary. Birders complain that bike riders ride into the sanctuary, despite the many signs explaining the rules. And the wooded thickets known as the Magic Hedge have long been a meeting place for gay men cruising for sex. The Chicago Ornithological Society has been trying for the last 18 months, with the support of the Park District, to get a grant to pay for a private security officer to look after the sanctuary. Tempers have occasionally flared. Munoz was watching a group of red knots, a shore bird he has seen at Montrose only once before in 20 years, when a woman began walking her dog toward the birds. Another birder asked her to take her dog away, Munoz said. The dog walker started shouting at her that the dog was not scaring the birds, swore at her, flipped Munoz the bird, and only left when the other birder threatened to call the police. Some dog owners think the birders are a bit fanatical in their mission to keep dogs off the beach. \"There are a lot of neurotic bird watchers,\" said Steve Lopez, who was watching his dog play in the fenced legal dog beach. \"They can be in a high rise on Sheridan Road and Montrose and look through their binoculars and see a dog on the beach, and theyll call police.\", \"Some people are obnoxious,\" said a woman walking a dog off-leash who declined to give her name lest she draw the birders ire. \"People will try to be police officers.\", \"The only birds here are pigeons and sea gulls,\" said Bob Little, who was walking his beagle/basset mix off-leash. He does not go to the dog beach, he said, because his dog has been attacked there twice by other dogs. Birders know there are many more species of birds than that landing on the beach, from dunlins and whimbrels to, this spring, a rare and endangered snowy plover. And even some gulls are protected migratory birds, said birder Alex Bloss. Not all dog owners are insensitive to the birders. Polly Reese was chagrined to see her Labrador-retriever mix run into the Magic Hedge one recent day. She ran after him, leashed him and made her apologies to a group of birders, with whom she ended up chatting amiably. \"I think most people are very respectful,\" she said. Bloss, the birder, agreed. \"I think most of the dog owners down there are pretty good at following the rules,\" he said. \"Its just one, two or three that are the annoying ones.\", blbrotman@tribpub.com]", "Date": "20150531", "Author": "[ Barbara Brotman]", "Link": "http://www.chicagotribune.com/news/ct-montrose-birders-dog-walkers-controversy-20150601-story.html", "Title": "[ Birders dismayed over unleashed dogs at Montrose Beach]"}