{"Content": "[ Cardinal Francis George, the first Chicago native to serve as the local archbishop and a man who during his 17-year tenure became the intellectual leader of the American church, died Friday after a yearslong struggle with cancer. \"This was the death of a very private, quiet man with people around him who cared about him,\" said longtime friend Colleen Dolan, who was called to the 78-year-old cardinals bedside and held his hand as he took his last breaths. George had been on home care since April 3 after being hospitalized late last month for hydration and pain management difficulties. He had stopped eating and returned to the hospital earlier this week but then left for his home at the archdiocesan residence and died there at 10:45 a.m. Friday. His longtime assistant, the Rev. Dan Flens, retired Auxiliary Bishop Raymond Goedert and a cousin, as well as two nuns who cared for George during his illness, also were at his side. \"He stood apart for his intelligence, his ability to make the churchs proposal in a compelling way to contemporary society, his deep faith, personal holiness and courage,\" said Catholic scholar and papal biographer George Weigel. \"I think he would want to be remembered as a good and faithful priest,\" Weigel said. \"Thats all he ever wanted to be.\", As head of the nations third-largest archdiocese, George shepherded the Chicago church through school closings and the priest sexual abuse scandal, striving to reconcile his support for the clergy with the pain of victims. He also became a point person between the U.S. church and the Vatican on the abuse scandal and matters such as liturgy of the Mass, playing a key role in revisions that brought the English translation closer to the original Latin. For all the things that polio took away from a young Francis George  running, playing baseball and riding his bicycle  it did little to derail his dreams of becoming a priest. Even after he entered his freshman year of Chicago high school seminary on crutches, only to be sent away with predictions... For all the things that polio took away from a young Francis George  running, playing baseball and riding his bicycle  it did little to derail his dreams of becoming a priest. Even after he entered his freshman year of Chicago high school seminary on crutches, only to be sent away with predictions... In November 2014, George became the first Chicago archbishop to retire, after his third cancer diagnosis, and was replaced by Archbishop Blase Cupich. On Friday, Cupich remembered George as \"always choosing the church over his own comfort, and the people over his own needs.\", \"A man of peace, tenacity and courage has been called home to the Lord,\" Cupich said Friday afternoon. He praised George for visiting every parish in the archdiocese, \"talking with the faithful and bringing kindness to every interaction.\", \"Let us heed his example and be a little more brave, a little more steadfast and a lot more loving,\" he added. \"This is the surest way to honor his life and celebrate his return to the presence of God.\", George received his first cancer diagnosis in 2006 and had surgery to remove his bladder and prostate. He was diagnosed with cancer again about six years later and underwent more surgery. His most recent diagnosis came in March 2014, when doctors found new cancer cells in his right kidney. He underwent chemotherapy, but the archdiocese announced in late 2014 that he had stopped taking an experimental drug because it had not been effective. As word spread of Cardinal Francis Georges death, Catholic parishes throughout the Chicago area and suburbs stopped classes in their schools, halted the workday at offices and paused to reflect on how the admired leader personally affected their communities. At St. Pascal Catholic Church in Chicagos... As word spread of Cardinal Francis Georges death, Catholic parishes throughout the Chicago area and suburbs stopped classes in their schools, halted the workday at offices and paused to reflect on how the admired leader personally affected their communities. At St. Pascal Catholic Church in Chicagos... From his childhood on the Northwest Side of Chicago, George embarked on a spiritual career that took him around the globe as a missionary, then brought him back home in 1997 when he was appointed as the eighth archbishop of the Chicago Archdiocese and spiritual leader of its more than 2 million Catholics. Born Jan. 16, 1937, George went to St. Pascal School in the Portage Park neighborhood, where he knew early on that he wanted to serve the church. \"The first time I thought about being a priest was my first Holy Communion, when I really came to appreciate the nature of that sacrament as much as a 7-year-old could,\" he said in a church documentary in December 2013 commemorating his 50th anniversary as a priest. George was 13, not even out of grammar school, when polio struck. When he arrived at Quigley Preparatory Seminary in Chicago on crutches, eager to begin his freshman year, George was told he could not stay and likely never would be ordained. His family enrolled him instead in the now-closed St. Henry Preparatory Seminary, a boarding school in Belleville, Ill. just outside of St. Louis. The school was run by the Missionary Oblates of Mary Immaculate religious order, whose mission is to evangelize the poor and to which he would devote his life. In 1973 he moved to St. Paul, Minn. to serve as head of the Oblates Midwestern province, which covers nine states. After just 18 months, at age 37, he was named the worldwide religious orders vicar general, its second in command, and moved to Rome. As vicar general from 1974 to 1986, George traveled widely, visiting many of the 68 countries where the orders 5,000 members perform their missionary work. George moved back to the U.S. in 1987 to become the coordinator of the Circle of Fellows at the Cambridge Center for the Study of Faith and Culture in Massachusetts. In 1990 he was installed as bishop of rural Yakima, Wash. Six years later he was promoted to lead the Archdiocese of Portland. He was there only 10 months when Pope John Paul II tapped him to replace the late Cardinal Joseph Bernardin as Chicagos archbishop. In 2002, at the height of the Catholic Churchs sexual abuse scandal, George emerged as a leading figure in negotiations with the Vatican over a zero-tolerance policy. The American bishops position was that any priest guilty of a single offense of sexual abuse of a minor should be removed from ministry. As his profile in the Catholic Church rose, the cardinal became more outspoken in articulating the churchs stand on national issues, insisting, for example, that Catholic institutions should be exempt from the contraception mandate in President Barack Obamas health care plan. After the death of John Paul II in 2005, George joined six other American cardinals in Rome for the pontiffs funeral and the conclave that would select Pope Benedict XVI. Eight years later he voted in another conclave that elected Pope Francis. The new popes popularity surprised George, who worried that people were developing unrealistic expectations that could lead to further disillusionment with the church. \"He sends out so many signals it gets a bit jumbled at times,\" George said. \"Im sure hes not confused, himself. Its confusing for a lot of people, including myself at times. For someone who appreciates clarity, I would like to get a few things clear so I can cooperate.\", The Rev. Bob Barron, rector of Mundelein Seminary, saw George last Saturday when he dropped off a book about the theology of death for the cardinal to read. Barron said their moving conversation about seeing God face to face was a classic George moment and allowed Barron the opportunity to say goodbye. \"As Im approaching death, my curiosity is awakened. Im so eager to see what its like,\" Barron recalled George saying. \"His mind was stirred to curiosity. It was so Cardinal George. He was readying himself.\", Dolan said George called her late Thursday night, inquiring about her family and a recent trip she took to South America. She reminded him that she had plans to visit the next morning, but he insisted on talking for an hour. She got a call Friday morning that his breathing had become labored and she should come sooner. \"He looked very peaceful. There was no pain on his face,\" she said. \"I was very fond of him. I will miss him tremendously.\", mbrachear@tribpub.com, Twitter @TribSeeker]", "Date": "20150417", "Author": "[ Manya Brachear Pashman]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-cardinal-george-dead-20150417-story.html", "Title": "[ Cardinal Francis George dies after long struggle with cancer]"}