{"Content": "[ President Barack Obama on Thursday condemned those who seek to use religion as a rationale for carrying out violence around the world. \"No god condones terror,\" he said. \"We are summoned to push back against those who would distort our religion for their nihilistic ends,\" Obama said at the National Prayer Breakfast. He singled out the Islamic State group in Iraq and Syria, calling the militants a \"death cult,\" as well as those responsible for last months attacks in Paris and deadly assault on a school in Pakistan. Obama offered a special welcome to a \"good friend,\" the Dalai Lama, seated at a table in front of the dais among the audience of 3,600. Earlier Obama, from the head table, pressed his hands together in a prayer-like position and bowed his head toward the Dalai Lama, then gave him a wave and a broad smile. It was the first time the president and the Tibetan Buddhist leader attended the same public event. China objects to foreign leaders meeting with the Dalai Lama because of his quest for greater Tibetan autonomy from Beijing. Obamas three previous meetings with the Dalai Lama have been private because of the sensitivity of the situation. But in a show of White House support for the Dalai Lama, he sat at a table with Obama adviser Valerie Jarrett. Actor Richard Gere, a friend and follower of the Dalai Lama, was nearby. Outside, hundreds of demonstrators banged drums and waved Tibetan flags under heavy police presence. The Dalai Lama fled to exile in India after a failed 1959 Tibetan uprising against Chinese rule. Obama called him \"a powerful example of what it means to practice compassion and who inspires us to speak up for the freedom and dignity of all human beings.\", The president joked that its a rare event that can bring together the Dalai Lama and NASCAR, after retired driver and commentator Darrell Waltrip gave the keynote address. Waltrip told how he had accepted Jesus Christ as his savior after a 1993 crash left him wondering what would happen if he died. \"If youve never gotten on your knees and asked him to forgive you of your sins, youre just a pretty good guy or a pretty good gal? Youre going to go to hell,\" Waltrip said. The White House issued its second veto threat in as many days Wednesday against top-priority legislation of the new, Republican-controlled Congress, and GOP leaders said they intend to keep challenging President Barack Obama to sign early measures that clear the House and Senate with bipartisan... The White House issued its second veto threat in as many days Wednesday against top-priority legislation of the new, Republican-controlled Congress, and GOP leaders said they intend to keep challenging President Barack Obama to sign early measures that clear the House and Senate with bipartisan... Obama had a more nondenominational message for the audience that also included prominent leaders of non-Christian faiths. The president said that while religion is a source for good around the world, people of all faiths have been willing to \"hijack religion for their own murderous ends.\", \"Unless we get on our high horse and think that this is unique to some other place, remember that during the Crusades and Inquisition, people committed terrible deeds in the name of Christ,\" Obama said. \"In our home country, slavery and Jim Crow all too often was justified in the name of Christ.\", \"So it is not unique to one group or one religion,\" Obama said. \"There is a tendency in us, a simple tendency that can pervert and distort our faith.\", Obama called for all people of faiths to show humility about their beliefs and reject the idea that \"God speaks only to us and doesnt speak to others.\", Jordans King Abdullah II canceled plans to attend the breakfast after Islamic State militants released a video this week showing a captured Jordanian pilot being burned to death. In his place, Sen. Roger Wicker, R-Miss. offered prayers for Jordan and read the New Testament parable of the Good Samaritan who saved a stranger who had been beaten and left for dead. Associated Press]", "Date": "20150205", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-obama-prayer-breakfast-terrorism-hijack-religion-20150205-story.html", "Title": "[ Obama condemns those who seek to 'hijack religion' ]"}