{"Content": "[ At a moment when many on the left are desperately trying to conjure up enthusiasm for Hillary Clintons bid to become the first woman president, others on the left want to turn the word woman into a term of exclusion and oppression. This is just one of the more amusing ironies on display as what passes for liberalism today eats itself. No doubt youve heard: Bruce Jenner has become Caitlyn Jenner. I cant muster much outrage about this. If someone born a man wants to live as a woman, or vice versa, they are free to do so as far as Im concerned. What does bother me is the way everyone is expected to celebrate Jenners decision and courage. Why cant I just not care? Or, maybe I just dont want to be part of a massive public relations effort tied to the rollout of yet another reality show?, While conservatives had their own list of complaints about this national celebration, the more intriguing ones came from the left. For instance, many people criticized the Vanity Fair cover of Jenner as a pinup. One step forward for Caitlyn Jenner, one step back for womankind, Eric Sasson complained in The New Republic. As a media sensation, Jenner had many choices for how to reveal herself to us, so the fact that she chose a way that only reinforces how much our society objectifies women is a bit distressing, he explained. Dana Beyer of Gender Rights Maryland argued fairly persuasively that it would have been better for her cause if Jenner had dressed as a businesswoman instead of as a sex symbol. One problem with this argument, as many of the people making it recognize, is that Jenners business is the reality show celebrity-buzz racket. The Sports Illustrated Swimsuit Issue surely objectifies women, but it wouldnt sell nearly as many copies if it was the Sports Illustrated Sensible Pantsuit Issue. As you may have heard, Bruce Jenner  former Olympian, raspy-voiced media showboat and newly manufactured creature of the Hollywood \"No, seriously, no one is ever going to watch this oh, Great Xenu, theyre actually watching it!\" reality TV factory  is now a woman. Hes not just any woman, of... As you may have heard, Bruce Jenner  former Olympian, raspy-voiced media showboat and newly manufactured creature of the Hollywood \"No, seriously, no one is ever going to watch this oh, Great Xenu, theyre actually watching it!\" reality TV factory  is now a woman. Hes not just any woman, of... Moreover, theres something gloriously perverse in celebrating someones courage to boldly smash sexual categories and then, in the same breath, castigating them for reinforcing gender stereotypes. If men are to be free to become women, surely they get to decide what kind of women they want to be. The first word in Vanity Fair is, after all, Vanity. The Sports Illustrated swimsuit models seem very happy to be paid lots of money to be objectified by the male gaze. Who am I to judge?, But the most fascinating argument comes from those who have no problem with Jenner changing genders, but have serious misgivings about the word woman. On a recent MSNBC panel celebrating the Jenner Effect, The Nations Michelle Goldberg (no relation), noted that many young feminists no longer want to use the word woman in relation to abortion because it excludes trans men. Theres a lot of conceptual murk to clear away, she added with admirable understatement, but among younger people that Ive talked to, it almost seems amazing to them that anybody would question the need to have gender-neutral language. Im all for Caitlyn Jenner living her truth, as I believe the saying goes. Not only for her sake but for the sake of those whove been, perhaps, too slow to get their minds around transgenderism. Its real, not a whim or fetish, and those who experience it deserve understanding, compassion and,... Im all for Caitlyn Jenner living her truth, as I believe the saying goes. Not only for her sake but for the sake of those whove been, perhaps, too slow to get their minds around transgenderism. Its real, not a whim or fetish, and those who experience it deserve understanding, compassion and,... In a fascinating piece for The New Yorker, Goldberg wrote about this growing schism. Rachel Ivey, a young feminist, told Goldberg, If I were to say in a typical womens-studies class today, Female people are oppressed on the basis of reproduction, I would get called out. Some students, she explained, would ask, What about women who are male?, Next stop: the other side of the looking glass. On most days of the week, liberals are fond of claiming that Republicans are anti-science on everything from global warming to evolution. Well, last I checked, biology hadnt been declared a branch of the humanities. Bruce Jenner was 65 years old when he decided to be a she, but thats not why Caitlyn cant have a baby. Figuratively speaking, removing the spigot wont change the rest of the plumbing. Thats not patriarchal oppression talking. Thats science. And no matter how fluid gender may or may not be, the biological category of female isnt going away anytime soon. I have sympathy for people who are convinced they were born the wrong sex. But feeling oppressed by a category doesnt render that category illegitimate or unreal (short people may resent being short, but that doesnt nullify the concept of height). Nevertheless, I will certainly enjoy watching this argument unfold as Hillary Clinton wraps herself in the new mantle of oppression called womanhood. Tribune Content Agency, Jonah Goldberg is an editor-at-large of National Review Online and a visiting fellow at the American Enterprise Institute. JonahsColumn@aol.com]", "Date": "20150605", "Author": "[ Jonah Goldberg]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-caitlyn-jenner-womanhood-hillary-clinton-20150605-column.html", "Title": "[ The end of 'woman'?]"}