{"Content": "[ Five months after the ACLU called the number of street stops by Chicago police \"shocking,\" the two sides have reached what they called a landmark agreement on the controversy, appointing a retired federal magistrate judge to oversee a number of reforms and instituting heightened training for the departments 12,000 officers and supervisors. As part of the agreement, Chicago police will keep track of all investigatory street stops and protective pat-downs, not just those that dont result in an arrest, as they have done in recent years. That practice had made it hard to assess the full impact of the street stops on the public, especially minorities, according to the ACLU. The two sides chose former Judge Arlander Keys, an African-American, to use the additional data to determine if the citys practices are lawful, issue public reports twice a year on his conclusions and make recommendations for changes in department policy and training. The agreement comes at a time that police across the country are under scrutiny for racial profiling and their use of force, particularly with African-Americans. As first reported by the Tribune in a front-page story in March, the ACLU found Chicago police made more than a quarter-million stops from May through August 2014, a far higher rate than New York City cops did at the height of their controversial stop-and-frisk policy. The analysis of the departments own data showed Chicago police stopped African-Americans at a disproportionately higher rate than Hispanics and whites, especially in predominantly white neighborhoods. The ACLU called the numbers \"a troubling sign\" of an illegal policy on the departments part. At the time, the department said it flatly prohibited racial profiling and cited its improved officer training. Chicagos Jefferson Park police district is drawn around a leafy residential area on the Northwest Side, home to about one-fifth of the citys police officers and their families. The district, which is predominantly white, also has one of the highest rates of drunken driving accidents and fatalities,... Chicagos Jefferson Park police district is drawn around a leafy residential area on the Northwest Side, home to about one-fifth of the citys police officers and their families. The district, which is predominantly white, also has one of the highest rates of drunken driving accidents and fatalities,... But under Thursdays agreement, the department agreed to heightened training to ensure its officers made stops only when they had \"reasonable suspicion of criminal conduct.\" They are also to carry out protective pat-downs only if they are reasonably suspicious the citizen is armed and dangerous. The department also agreed to implement training to ensure that officers not use race, ethnicity, gender or sexual orientation in making street stops and pat-downs. In a telephone interview, police Superintendent Garry McCarthy hailed the agreement as groundbreaking, considering civil libertarians and law enforcement are often on opposing sides. He was particularly pleased the deal resulted from negotiations, not a lawsuit. \"Im certainly open to improving our performance and satisfying those questions that are being asked,\" McCarthy said. Harvey Grossman, legal director of the ACLU of Illinois, expressed hope the agreement will lead police to make lawful investigatory stops, in the process improving the departments often wary relationship with the minority community. The Rev. Ira Acree says he was stopped at a red light on the West Side on a warm night this past summer when a Chicago police officer in a squad car suddenly cursed and shouted at him to pull over. The officer accused him of texting on his cell phone while driving, Acree said, but Acree said he... The Rev. Ira Acree says he was stopped at a red light on the West Side on a warm night this past summer when a Chicago police officer in a squad car suddenly cursed and shouted at him to pull over. The officer accused him of texting on his cell phone while driving, Acree said, but Acree said he... \"We think the city has agreed to a set of terms that, when implemented, will achieve not only constitutional stops but also will achieve transparency and improve community relations,\" Grossman said. The president of the union that represents rank-and-file officers questioned why Keys or the ACLU need to be involved in telling officers how to do their jobs. Dean Angelo, president of the Fraternal Order of Police, said that documenting more stops will keep officers off the streets, not a smart move with all the gun violence in Chicago. \"I dont see this as an answer to the violence,\" he said. \"This could be a contributor to the violence.\", Keys, 71, who will play a critical role in carrying out the agreement, worked for about two decades as a federal magistrate judge in Chicago before stepping down from the bench last year. He was born in rural Mississippi and raised by his grandparents. He came to Chicago after high school, joined the Marines in 1963 and fought in Vietnam. In an interview posted by the U.S. District Court in 2011, Keys spoke about how he grew up in a time and place when African-Americans couldnt vote and were discouraged from going to school. Racism was just a part of growing up, he said. \"I started working in the fields when I was 6 years old. And it was full time, from sunup to sundown, it wasnt this eight-hour or 10-hour period,\" he said. \"You were expected to pick at least 100 pounds of cotton in a day. ... It was backbreaking, very hard arduous work. Those were very painful times for me and for my family.\", \"My grandfather would tell me when we were driving not to look out the window but to look at him, the reason being he didnt want anybody to accuse me of looking at a white woman,\" he said. Grossman praised Keys selection, saying he will \"call the balls and strikes fairly.\", Asked if Keys race played a factor in the appointment, Grossman replied, \"I think we certainly wanted somebody who had enough life experience to be able to understand the dynamics of (Chicago).\", Before Thursdays agreement, officers who carried out a street stop without making an arrest or writing a ticket were required to fill out \"contact cards,\" listing the citizens age, address, race, any distinguishable marks or tattoos, as well as the time, location and reason for the stop. Police did not record if they frisked the person. Police use the contact cards to gather street intelligence, keep track of gang members and solve crimes. But a recent ACLU analysis of 250 stops from 2012 and 2013 found that in about half, officers either gave an unlawful reason for the stop or failed to provide enough information to justify the stop. According to Grossman, the new agreement could help ensure that officers perform street stops and pat-downs lawfully. \"What were looking for now is to get past any notion of conflict or acrimony and get it fixed,\" he said. Grossman said a key change with the agreement will be that investigatory stops that lead to arrests or citations will be tracked for the first time. He said they represent an untold number of stop-and-frisks that were never detailed by the department. The agreement is effective immediately, but Keys role will begin in earnest next year when he and his staff begin to analyze the data collected by the department. Keys will issue public reports twice a year assessing the legality of the street stops and making recommendations for changes in department policy and training. As part of the agreement, officers will be asked not only to keep track of all streets stops but also to record how often they then conduct pat-downs, the reason for taking that action and whether the citizen gave permission. Officers who make illegal stops will be retrained, receive closer supervision or face discipline, the department said. McCarthy said he had opposed documenting every street stop because he fears it will create too much paperwork for officers and may keep them off the street for lengthy periods. \"I acquiesced to it because, you know, Im trying to work with (the ACLU), theyre trying to work with us,\" McCarthy said. The Tribune in 2013 highlighted how the departments increasing use of contact cards had raised the ACLUs concerns. At the time, sources within the department told the newspaper that district commanders felt the pressure to have their officers make street stops  and fill out the contact cards  or risk incurring McCarthys wrath in front of peers at weekly meetings on CompStat, the departments data-driven strategy that uses crime statistics and street intelligence to hold police brass accountable for the neighborhoods they oversee. McCarthy on Thursday strongly disagreed with that characterization and expressed confidence that street stops made by his officers are constitutional. \"Dont tell me about officers feeling this or that or the other thing because you know you can give me anecdotes, I can give you anecdotes also,\" he said. \"We expect police officers to do their job. Theyre collecting their salary, and we expect them to give an honest days work for an honest days salary.\", Chicago Tribunes Jason Meisner contributed. jgorner@tribpub.com, Twitter @JeremyGorner]", "Date": "20150807", "Author": "[ Jeremy Gorner]", "Link": "http://www.chicagotribune.com/news/ct-chicago-police-aclu-street-stops-met-20150807-story.html", "Title": "[  ACLU, Chicago police agree to changes on controversial street stops]"}