{"Content": "[ Gov. Bruce Rauner on Monday once again held out the possibility of pension relief for cash-strapped Chicago Public Schools, tying it to a property tax freeze, new education funding formula and anti-union measures. This time, the first-year Republican governor added to the mix another potential poison pill for Democrats: limits on public workers rights to compensation for job-related injuries. Rauner, whose fight with ruling Democrats in the General Assembly has left state government operating without a full budget, has spent recent weeks trying to persuade lawmakers to go along with his agenda, often tying CPS money woes to the effort. On Monday, Rauner floated a proposal that combines his push to freeze property taxes and strip unions of their local collective bargaining rights with the promise of a new funding formula for schools and more than $400 million in immediate financial relief for CPS. It would also allow CPS to force teachers to pick up the cost of their own pension contributions, a key sticking point between Mayor Rahm Emanuel and the Chicago Teachers Union. Rauner also would let school districts use outside contractors for services like janitorial work and transportation. The governor called it \"the most important single piece of legislation that we can pass this year.\", \"Weve got to get control on this budget,\" Rauner said at a news conference at the Thompson Center in Chicago. \"Weve got to take action. And were asking the General Assembly to focus, lets focus on one piece of legislation in good faith, and lets get this done.\", Chicago business bailing on Illinois, the owner blames the cost of doing business. Aug. 18, 2015. (CBSChicago), Chicago business bailing on Illinois, the owner blames the cost of doing business. Aug. 18, 2015. (CBSChicago), A spokesman for Democratic Senate President John Cullerton called Rauners latest pitch \"totally unacceptable.\", \"Its a thinly veiled series of half measures attempting to mask his intent to slash middle-class wages and benefits,\" Cullerton spokesman John Patterson said. The Emanuel administration declined to comment. CPS spokeswoman Emily Bittner issued a statement that said the district doesnt \"believe that mixing labor issues into this legislation will help address CPS fiscal situation.\", The new legislation does not replace a handful of other bills Rauner has been pushing as a condition of finding revenue to close a budget gap of more than $3 billion. Rauner also wants to make it tougher for injured workers to win claims against private employers, to limit big-dollar damage awards in civil suits and to enact term limits and a new political map-drawing process that would make it harder for Democrats to hold onto power at the Statehouse. Democrats and Republicans in the House found common ground amid the budget stalemate Wednesday when they supported legislation to free up $5.2 billion in federal funds  though not before more of the ubiquitous partisan bickering thats marked the summer-long overtime session. Under the measure... Democrats and Republicans in the House found common ground amid the budget stalemate Wednesday when they supported legislation to free up $5.2 billion in federal funds  though not before more of the ubiquitous partisan bickering thats marked the summer-long overtime session. Under the measure... \"Were not taking anything off the table,\" Rauner said. \"What were trying to do is actually get movement. Right now, we have done nothing. We are in crisis mode.\", Democrats have long resisted Rauners attempts to link collective bargaining to a property tax freeze. Both the House and Senate have approved two-year property tax freezes that mirror Rauners request but dont include the anti-union provisions. Sen. Kwame Raoul, D-Chicago, said the addition of injury compensation limits for public sector workers would meet the same resistance. \"Its a recurring theme of connecting unrelated things,\" said Raoul, who acts as a key negotiator on workers compensation issues. \"Whats the rationale for differentiating public employees from employees in the private sector? Its just going to be more unfair to a public employee who may have been legitimately injured on the job and you are going to deprive them of protections.\", Rauners new proposal comes as a number of Democrat-led bills aimed at countering his agenda have been moving through the General Assembly. A Senate-passed bill that would freeze property taxes and provide pension relief to CPS is now up in the House, where Speaker Michael Madigan has said the chamber will consider the measure. Meanwhile, both the House and Senate have passed differing measures on injury claims that do not go far enough on a key change Rauner wants: requiring workers to prove a stronger link between their injury and their job in order to receive compensation. Democrats in both chambers are trying to reach an agreement on legislation they could send to Rauners desk. Tribunes Juan Perez Jr. and Bill Ruthhart contributed from Chicago. Monique Garcia reported from Springfield. kgeiger@tribpub.com, mcgarcia@tribpub.com]", "Date": "20150817", "Author": "[ Kim Geiger, Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-bruce-rauner-cps-pensions-met-0818-20150817-story.html", "Title": "[ Rauner again ties CPS bailout to property tax freeze, anti-union measures]"}