{"Content": "[ The Lincolnshire-Prairie View Elementary District 103 School Board dreamed an extra-large dream on Feb. 17a $42 million, construction-everywhere dream. \"Theres not a number bigger than that number,\" Dan Stanley, assistant superintendent for business, told the board members. \"Thats the dream scenario.\", Sure, there may be bigger numbers  but Stanley was referring to the cost of funding every reasonable classroom addition, roof repair, wall knockdown and 21st-Century-wiring project the district would like to have. The sum of every capital improvement effort, at all three buildings, that the board could find a use for would be approximately $42 million. But even that figure does not include the iPads. During one of the longest board meetings in recent memory, district officials listened to a 75-minute presentation from PMA Consultants about the status of their existing debts and the possible means of funding major construction projects. No plans are in the works  the board formed no specifics, approved nothing, and it put nothing out to bid. But some of the general ideas they discussed appear inevitable: the roofs over the Half Day and Daniel Wright Junior High schools are leaking, and when the economy turns around, Lake Countys population is likely to climb again, making additional classrooms a necessity. PMAs speakers gave the board more than a dozen charts about possibilities for refunding existing debts and taking on new debt. One month after returning for a second term in Congress, U.S. Rep. Bob Dold told a Waukegan Chamber of Commerce breakfast crowd on Wednesday, Feb. 18, that the climate hadnt changed much during his two years out of office. \"It was interesting, because when I came back (six weeks ago), one of my... One month after returning for a second term in Congress, U.S. Rep. Bob Dold told a Waukegan Chamber of Commerce breakfast crowd on Wednesday, Feb. 18, that the climate hadnt changed much during his two years out of office. \"It was interesting, because when I came back (six weeks ago), one of my... Their suggestion for the \"dream scenario\" included $3.4 million in working cash bonds, $13.6 million in debt certificates (averaging about $1 million in annual debt service payments for 20 years) and $25 million from a bond referendum. The district moved the meeting from Daniel Wrights library (its usual location) to Half Day School to accommodate a larger crowd, and board president Gary Gordon stressed to them that the board had not begun any referendum process. But Stanley told the board that they will achieve only limited goals without it. \"This is showing you clearly cant do that, without that R-word,\" he said. Gordon noted that, even in a dream scenario, the nearest construction project would be two years away  and that the board has immediate operational needs to think about as well. \"This is incredibly important background information, as we look at other budget requests,\" he said. \"This is helpful context for us.\", When Mary Carmody put the word out that she was collecting Valentines Day cards for veterans, she never expected to have hundreds pile up so quickly. Carmody is the president of the Midwest Veterans Closet, a nonprofit organization that takes in donated items in good condition and gives them to... When Mary Carmody put the word out that she was collecting Valentines Day cards for veterans, she never expected to have hundreds pile up so quickly. Carmody is the president of the Midwest Veterans Closet, a nonprofit organization that takes in donated items in good condition and gives them to... One upcoming budget request will likely be additional iPads. District 103 already issues about 1,000 to its older students, and every district in the northwest suburbs is moving toward handing one out to each. After the meeting, Stanley said Lincolnshire-Prairie View would need about 750 more to outfit every third- through eighth-grader. The board juggled several technology-related questions. If every student has a small screen in their hands, would a library need a giant, central screen? When most of the districts families can afford to buy a tablet for each of their children, should the district be supplying them?, \"We get less bang for our buck from something like this than a lot of our other districts do,\" board member Ben Yomtoob noted. \"We have to keep moving down this road, the question is just At what pace?\", Superintendent Scott Warren said that answer would have to be developed with time. \"I dont know how to prioritize that, with the buildings we need to do,\" he said. \"Every dollar we spend there is a dollar were not spending somewhere else.\", rwachter@pioneerlocal.com]", "Date": "20150219", "Author": "[ Ronnie Wachter]", "Link": "http://www.chicagotribune.com/suburbs/lincolnshire/news/ct-lsr-103-budget-tl-0226-20150219-story.html", "Title": "[ Dist. 103 examines $42 million 'dream' list]"}