{"Content": "[ The release of videos of Planned Parenthood physicians discussing the market for tissue harvested in abortions has produced varied and strong reactions, and has, ironically, given us a reason for hope and an opportunity as a nation. The tapes have generated a visceral reaction independent of how they were made or whether Planned Parenthood was making a profit. Rather, the widespread revulsion over the tapes arose because they unmasked the fact that, in our public conversation about abortion, we have so muted the humanity of the unborn child that some consider it quite acceptable to speak freely of crushing a childs skull to preserve valuable body parts and to have that discussion over lunch. Yet, the outrage expressed by many at the physicians callous and flippant attitude toward trafficking in human body parts is evidence that American hearts have not been irreparably hardened by the steady devaluing of human dignity in our society. This awakening of our conscience gives hope that deep within the hearts and souls of Americans there still resides the truth that an unborn child manifestly is a human being, entitled to rights and respect. This newest evidence about the disregard for the value of human life also offers the opportunity to reaffirm our commitment as a nation to a consistent ethic of life. While commerce in the remains of defenseless children is particularly repulsive, we should be no less appalled by the indifference toward the thousands of people who die daily for lack of decent medical care; who are denied rights by a broken immigration system and by racism; who suffer in hunger, joblessness and want; who pay the price of violence in gun-saturated neighborhoods; or who are executed by the state in the name of justice. The open and generous nature of the American people has the capacity to astonish and push boundaries. We crowdfund, sign petitions, dump buckets of ice on ourselves and embrace new ways of relating to our environment. Can we use our shared outrage at all these affronts to human dignity to unite us and begin a national dialogue on the worth of human life?, If we create a framework for decision-making that is biased toward life, supportive of families and fair to people of all circumstances, our policies, legislation and commercial decisions will be vastly different. We then can begin to take needed actions and reforms that make a difference in the lives of those who are discarded and considered disposable. Confronting reality is not always a pleasant experience, but it is always a useful one. The surreptitious videos of Planned Parenthood officials are a reminder that destroying fetuses is an ugly process with fatal results. In private, these abortion providers dont conceal what the procedure entails.... Confronting reality is not always a pleasant experience, but it is always a useful one. The surreptitious videos of Planned Parenthood officials are a reminder that destroying fetuses is an ugly process with fatal results. In private, these abortion providers dont conceal what the procedure entails.... The nations children, families, poor, workers and senior citizens deserve more than lip service. They deserve more than outrage. They deserve real support, protection and solid action. And so do we to be true to what is best in us. Blase Cupich is the archbishop of the Archdiocese of Chicago.]", "Date": "20150803", "Author": "[ Blase Cupich]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-blase-cupich-abortion-planned-parenthood-perspec-0804-20150803-story.html", "Title": "[ Blase Cupich op-ed: Planned Parenthood and the muted humanity of the unborn child]"}