{"Content": "[ Socialism has had a rough few decades, but its enjoying a rare success. Bernie Sanders, who calls himself a socialist, is running for president, drawing big crowds and leading Hillary Clinton in one poll in New Hampshire. All this leads some people to a damning conclusion: Democrats love Sanders because Democrats are socialists. Democratic National Committee Chairwoman Debbie Wasserman Schultz has encouraged this claim by declining to spell out the differences between a Democrat and a socialist. \"These days, its largely a distinction without a difference,\" Jason Riley, a senior fellow at the conservative Manhattan Institute, wrote in The Wall Street Journal. Sen. Ted Cruz, R-Texas, asserts that Clinton \"is just as much of a socialist as Bernie Sanders.\", Norman Thomas, the perennial presidential candidate of the Socialist Party back when socialism was considered a serious alternative, got only 2.2 percent of the vote in 1932, his best showing in six tries. So how can someone sporting the label today muster a serious bid for the Democratic nomination? There are three factors at work. To start with, Democrats and socialists have always had some overlap on matters like collective bargaining, anti-poverty programs and civil rights. Back in the 1930s, socialists and liberal Democrats joined in a push for anti-lynching laws, which President Franklin Roosevelt refused to endorse. Both Democrats and socialists favored unemployment insurance, guaranteed pensions and the end of child labor. But they have always had major differences as well. Socialists have long endorsed nationalization of important industries, steeply graduated income taxes, a 30-hour workweek, drastic cuts in military spending and the abolition of the CIA. Democrats, as a rule, have not. Democrats have had a lot of fun joking about the huge field of Republican presidential candidates and the clown car they keep piling out of. The Democrats, by contrast, couldnt fill a minivan. And the way things are going, that may be a big problem. Say what you will about the GOP, it has an abundance... Democrats have had a lot of fun joking about the huge field of Republican presidential candidates and the clown car they keep piling out of. The Democrats, by contrast, couldnt fill a minivan. And the way things are going, that may be a big problem. Say what you will about the GOP, it has an abundance... One big reason for the Sanders surge has escaped conservatives. Many of them think all their opponents are captives of the same dangerous statist mentality. In that view, a moderate is a liberal is a socialist is a communist. But the truth is that Sanders isnt really much of a socialist. Ask one. Plenty of leftists think he is not really one of them. Last month, David Fahrenthold reported in The Washington Post that \"Vermont is strewn with dissatisfied socialists, denouncing Sanders for perceived sins that go back to the 70s.\", In Politico, socialist academic Fredrik deBoer writes that Sanders \"might just be the first SINO in American politics, the first Socialist In Name Only.\" At the recent Socialism 2015 convention in Chicago, deBoer found some attendees fear this candidacy \"is a trick to bring socialists back into the Democratic fold.\", Cruz sees no difference between Sanders and many Senate Democrats. Though he has a point, he overlooks the possibility that the reason is that Sanders is not as far left as he pretends to be. He can call himself a socialist, just as Mitt Romney could call himself \"severely conservative.\" But self-portrayals are not always reliable. Riley is struck that calling yourself a socialist is not fatal with voters. That premise has yet to be tested at the polls. And if the stigma the term once carried has diminished, Riley should blame his friends on the right. They used to think it was enough to accuse Democrats of being liberals. In 1988, George H.W. Bush made voters think \"liberal\" was Michael Dukakis first name. But ever since the 2008 campaign, conservatives have been depicting Barack Obama as a fanatical Marxist bent on dismantling our economic system. Early in Obamas presidency, John Boehner said he was undertaking \"a new American socialist experiment.\" Investors Business Daily published an overheated series of 21 editorials  yes, 21  called \"The Audacity of Socialism.\", In office, though, Obama repeatedly pursued policies that were within the mainstream of public opinion. His tax increases paralleled those of Bill Clinton. Domestic oil production has climbed. The federal budget deficit has dropped by two-thirds. His health care overhaul preserved the dominant role of private insurance companies  disappointing those on the left, including Sanders, who wanted \"Medicare for all.\" The Dow Jones industrial average, which fell by 25 percent under George W. Bush, has more than doubled. Corporate profits have soared. If Obama is out to destroy capitalism, hes got a funny way of going about it. At this stage of his presidency, with this economic record, the charge that Obama is a kindred spirit of Karl Marx has lost its sting. Bernie Sanders success is actually a reflection of what conservatives have accomplished under the past seven years: They have made socialism respectable. Steve Chapman, a member of the Tribune Editorial Board, blogs at www.chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150819", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-socialist-democrat-bernie-sanders-vermont-clinton-perspec-0820-jm-20150819-column.html", "Title": "[ Are Democrats really socialists?]"}