{"Content": "[ President Barack Obama is lobbying hard for the preliminary nuclear deal the U.S. and five other world powers reached with Iran. He touts it as \"our best bet by far to make sure Iran doesnt get a nuclear weapon.\" But he doesnt yet have a deal in hand  or evidently even an airtight understanding with Iran about what has been settled. Scant hours after the U.S. released some details of the framework, the two sides clashed over  what else?  differing interpretations of the terms. Most prominent: Would economic sanctions be lifted immediately, as Iran said, or in stages, as the U.S. insisted?, Obama faces another significant hurdle as negotiations continue toward a June 30 deadline. There is growing bipartisan support in Congress for a measure introduced by Republican Sen. Bob Corker of Tennessee that would force the administration to submit a final agreement to lawmakers for approval. On Monday, influential Democratic Sen. Charles Schumer of New York signed on to that measure. \"I strongly believe Congress should have the right to disapprove any agreement,\" Schumer told Politico. Note that Schumer said disapprove, not approve. Schumer is a generally reliable White House ally. But he and many other lawmakers in Washington have seen the preliminary outlines of this deal and theyre worried that it wont thwart Irans nuclear ambitions. Thats why Obama cant just barnstorm the country, pitching this framework as rock-solid and the best terms he could get. He needs to use the next rounds of negotiation to clarify and significantly strengthen the terms. There are steps that could be achieved without tossing out the basic framework. Some of those steps even come from Obamas old, ah, friend, Israeli Prime Minister Benjamin Netanyahu. One of the key arguments used by the United States and the Western powers to justify the recent Iran nuclear deal is that the alternative to this deal is war. This is simply not true. There is a third option. It is called waiting. For several years, Iran has been on the threshold of developing... One of the key arguments used by the United States and the Western powers to justify the recent Iran nuclear deal is that the alternative to this deal is war. This is simply not true. There is a third option. It is called waiting. For several years, Iran has been on the threshold of developing... Take it as a good sign, perhaps a bow to reality, that Israel has shifted ever so slightly from pure enmity toward the deal to suggesting how it could provide genuine protection. On Monday, Israeli intelligence chief Yuval Steinitz listed several key asks:, Allow international inspectors access to Irans declared and suspected nuclear-related facilities anytime, anywhere. Thats key to ferreting out any secret efforts by Iran to break out and build a bomb. The preliminary agreement is  no surprise  fuzzy on this point. Force Iran to disclose its past research into nuclear weapons. Iran has answered only 1 of 12 questions from international inspectors. The agreement framework apparently doesnt require that Iran answer them all. Two other ideas would be enormously helpful, though theyre probably now beyond reach in these talks:, Ship Irans entire stockpile of enriched uranium out of the country. Thats the best way to ensure that Iran wont have a ready supply of material should it decide to toss out inspectors and make a dash for the bomb. The preliminary agreement doesnt require this. Close the Fordo enrichment plant. Iran secretly built this underground enrichment fortress to withstand Western bombing attacks. The preliminary agreement allows Fordo to remain open but bars uranium enrichment there. As long as centrifuges spin there, it remains a serious security threat. Obama will risk creating more momentum for intervention by Congress if the U.S. and its negotiating partners approach the June 30 deadline only as time to clean up some ambiguities in this framework. There are too many unanswered questions, too many potential weaknesses. The president didnt win any hearts and minds in the House and Senate when he said that if Congress blocks this agreement, \"it is the U.S. that will be blamed for the failure of diplomacy.\", Members of Congress should recognize, though, that if they ultimately reject a deal and the U.S. attempts to continue or enhance economic sanctions against Iran, the five negotiating partners probably wont go along. They, apparently, are satisfied with the terms. International cooperation on tough sanctions has been key to forcing Iran to the concessions it has made to date. There is still a lot of heavy lifting to do on the Iran agreement  in Switzerland, where the negotiations have taken place, and on Capitol Hill. Mr. President, press the advantage.]", "Date": "20150408", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-iran-congress-corker-edit-0409-bd-20150408-story.html", "Title": "[ Obama can drive a stronger deal with Iran]"}