{"Content": "[ You should have heard this first from my own fingers, but yes, the rumors are true:, Ive decided to take another job. Any moment now, I plan to accept the presidency of the notoriously corrupt international multi-billion dollar soccer empire called FIFA. Several top FIFA officials were indicted and arrested in Switzerland, at their five-star hotel, the kind that usually puts real Swiss chocolates on your pillow. That started a soccer bureaucratic panic and worries about who wore a wire. Based on my calculations, there should be a vacancy at the top very soon. Once Im crowned the boss, I promise to bring the corrupt world soccer headquarters to Chicago, a city that knows a thing or two about corruption. And then the world will kick their balls only one way:, The Chicago Way. \"Youre still going to take bribes, right?\" asked my young colleague, Old School. Dont be silly. The minute Im named FIFA president  any day now  Ill be called by my new FIFA title:, As defiant as ever, Sepp Blatter resisted calls to resign as FIFA president Thursday and deflected blame for the massive bribery and corruption scandal engulfing soccers world governing body. \"We, or I, cannot monitor everyone all of the time,\" Blatter said in his first public remarks on the crisis... As defiant as ever, Sepp Blatter resisted calls to resign as FIFA president Thursday and deflected blame for the massive bribery and corruption scandal engulfing soccers world governing body. \"We, or I, cannot monitor everyone all of the time,\" Blatter said in his first public remarks on the crisis... Monsieur 30 Percent. One of the soccer bosses who ended up wearing a wire was called Mr. 10 Percent. He wet his beak so thoroughly that he had a $6,000-per-month apartment in New Yorks Trump Towers just for his cats. But Im allergic to cats. Besides, 10 Percent isnt enough for what Ive got in mind. And with two kids in college, Im still going to keep my day job at the Tribune. Heck, I might even buy the Tribune with the extra cash and endorse President Barack Obama for a third term, just to see if hed oppose it on constitutional grounds. Dont worry. Itll be a good thing. Sadly, not too many have paid attention to this international sporting intrigue, what with the Bulls firing their beloved head coach Tom Thibodeau and the Blackhawks forcing a dramatic Game 7 in Anaheim against the fearsome Ducks. But its big news in the rest of the world, even bigger than the baby rabbit killing in Denmark. \"This really is the World Cup of fraud,\" said Richard Weber, head of the IRS criminal division, when the FIFA indictments were announced this week. As many amateur humorists on social media noted Wednesday morning, theres a certain appropriateness to the United States having been the country to articulate and disrupt alleged corruption within the governing body of international soccer. There are few secrets so poorly kept that billions of... As many amateur humorists on social media noted Wednesday morning, theres a certain appropriateness to the United States having been the country to articulate and disrupt alleged corruption within the governing body of international soccer. There are few secrets so poorly kept that billions of... \"And today we are issuing FIFA a red card,\" Weber said. I can see him sitting in a canvas chair like the rest of us in our Dad Cargo Shorts on Saturday afternoons, sipping iced lattes, talking about the \"pitch\" and thinking that everyone with an English accent is a soccer expert. But Americans would feel a lot better if the IRS gave itself a red card for harassing political groups into silence  especially in Ohio  before Obamas re-election campaign. Right now, though, the main thing is to get rid of FIFA President Sepp Blatter so I can take over. Blatter keeps getting elected time and time again, as if he were a Chicago political boss. And like the bosses, Blatter has developed an insulting habit. He speaks to people as if theyre blithering idiots and hes Mayor Untouchable. \"I know many people hold me ultimately responsible,\" Blatter said about the corruption probe. \"We, or I, cannot monitor everyone all of the time. If people want to do wrong, they will also try to hide it.\", Then he ran off and hid from reporters and refused to take any questions. The episode has really angered Russian strongman Vladimir Putin, a man of action who rides horses without his shirt on. Putin complained that the U.S. Justice Department has launched the FIFA probe to topple Blatter and take the 2018 World Cup away from Russia. \"It looks very strange to say the least,\" said Putin. \"Because the arrests have been made on the request of the American side, on charges of corruption. And who were charged? International officials  This is yet another blatant attempt to extend its jurisdiction to other states.\", Well, its Putins turn to cry. Because as the new FIFA president I plan to take the World Cup  and all the money it generates  and bring it all to Chicago. Only Chicago. Not the rest of the United States. We dont need games in Los Angeles or Boston or Orlando. All World Cup games will be held right here in Chicago. We have Toyota Park, Wrigley Field, Sox Park and Soldier Field. I might add a smaller venue in Rockford, which deserves to host at least one World Cup game, since it is home to the Stockholm Inn and its great Swedish pancakes with lingonberries, feeding soccer families at youth soccer tournaments for years. If we need any new stadiums, we can build them on Chicago parkland since were building everything else in public parks these days. Ill also decree that well get rid of those crappy politically clouted food services and hire decent mom & pop restaurants featured on \"Check, Please!\" to make our sporting snacks. And all beer and wine and other beverage sellers, come see Monsieur 30 Percent. Yes, Ill gather all the graft, but I wont spend a dime on myself. Instead, I will donate the billions of dollars in World Cup revenue  and my own 30 percent off the top in cash bribes  to the taxpayers of Illinois. And Ill be lenient. There will be only one condition:, Henceforth, by the decree of Monsieur 30 Percent, there shall be only one sport that will played at all the schools and parks. All other sports must leave. Go on, git. Soccer is really such a beautiful game, when you take all the politics out of it. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150528", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-fifa-boss-met-0529-20150528-column.html", "Title": "[ FIFA needs a new boss, and Kass has just the person]"}