{"Content": "[ Scott Walkers suggestion that building a wall between Canada and the U.S. might be a \"legitimate\" idea prompted swift derision from fellow Republicans on Monday and an attempt by his campaign to clarify what he meant. It was the latest misstep for a 2016 presidential candidate who got off to a strong start but has fallen back into the pack after a series of fumbles and a lackluster performance in the first GOP debate. The Wisconsin governor was asked on NBCs \"Meet the Press\" on Sunday whether he thought a wall should be built along the more than 5,000 miles of border with Canada. \"Some people have asked us about that in New Hampshire,\" he said. \"They raised some very legitimate concerns, including some law enforcement folks that brought that up to me at one of our town hall meetings about a week and a half ago. So that is a legitimate issue for us to look at.\", Walkers campaign spokeswoman, AshLee Strong, said Monday his comments were being misunderstood. \"Despite the attempts of some to put words in his mouth, Gov. Walker wasnt advocating for a wall along our northern border,\" Strong said. She said he meant that border security was a legitimate issue. But the fact he appeared to entertain the notion of a northern wall brought a swift response. \"Thats a pretty dumb idea,\" Sen. Rand Paul of Kentucky, a 2016 rival, told Boston Herald Radio. \"There have been a lot of dumb ideas put out. One, that the Mexicans will pay for a wall, was probably the dumbest of dumb ideas. But putting a wall up between us and Canada is sort of a ridiculous notion.\" Donald Trump has proposed pressure tactics to persuade Mexico to pay for a wall along its border with the U.S. Wisconsin Gov. Scott Walker is putting a new twist on the topic of securing the border, a staple among the GOP candidates running for president, by pointing north. Walkersaid in an interview that aired Sunday that building a wall along the countrys northern border with Canada is a legitimate... Wisconsin Gov. Scott Walker is putting a new twist on the topic of securing the border, a staple among the GOP candidates running for president, by pointing north. Walkersaid in an interview that aired Sunday that building a wall along the countrys northern border with Canada is a legitimate... Mike Murphy, a Republican strategist who leads the Right to Rise political action committee supporting Jeb Bush, said on Twitter that Walker was distracted by \"his plan\" to build a wall along the Canadian border. Democratic Sen. Patrick Leahy from the border state of Vermont piled on, too. \"Terrible idea,\" he said. \"Election season always brings out crazy ideas, but this is one of the craziest.\", The latest struggle for Walker comes after hes had to backtrack and clarify his positions on immigration and terrorism, reassure jittery donors after his performance in the first GOP debate and reshape his campaign to try to rekindle the spark he showed months ago, when he quickly climbed into the top tier of candidates after impressing Iowans in a January appearance. Thats meant trying to get back to basics in Iowa, where hes aiming to visit all 99 counties. \"A lot changes between now and the caucuses,\" he said last week after a two-day tour. \"I think the most important thing we can do is get out and tell our story.\", This is what happens when you try to trump The Donald. Scott Walker has for two decades won primary elections by refusing to allow any Republican to outmaneuver him on the right. So when Donald Trump, father of the Central Park ice rink, began skating circles around the Republican presidential... This is what happens when you try to trump The Donald. Scott Walker has for two decades won primary elections by refusing to allow any Republican to outmaneuver him on the right. So when Donald Trump, father of the Central Park ice rink, began skating circles around the Republican presidential... In his latest swing, he pitched himself as the only Republican who has fought and won without compromising his core conservative principles. He also outlined his foreign policy goals, criticized President Barack Obama and Democratic front-runner Hillary Rodham Clinton as \"leading from behind\" and called for a state visit with the Chinese president to be canceled. Yet in the past 10 days, Walker also changed his stance three times on whether he, like Trump, favored doing away with the constitutional right to citizenship granted to people born in the U.S. Walker finally said he had no position on the issue and would not seek repeal of the 14th Amendment that provides that right. In New Hampshire, Walker also said recently there were only a \"handful\" of moderate followers of Islam  a religion followed by more than a billion people worldwide. His campaign issued a statement saying Walker knows that most Muslims \"want to live in peace.\", The super PAC backing Walker plans to start broadcasting television ads in Iowa after Labor Day. Associated Press]", "Date": "20150831", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-scott-walker-canada-wall-20150831-story.html", "Title": "[ Scott Walker's talk about Canadian border wall draws derision from GOP candidates ]"}