{"Content": "[ This months scramble by Chicago school officials to find enough cash to pay the bills is the result of \"an appalling situation\" years in the making  a cascading financial crisis that could hit classrooms this fall when nearly 400,000 kids return to school. To pay the huge tab owed to the Chicago Teachers Pension Fund, make payroll and cover other costs, the nations third-largest school system would have to drain its checking account, max out its line of credit and burn cash set aside to pay other debts, according to outlines of school finances presented in city documents. If CPS resorts to those steps, the district has no clear way to close next school years $1 billion budget gap without teacher layoffs, increased class sizes and perhaps even a late opening of schools. Such measures may be unavoidable even if CPS significantly increases property taxes, the state provides more school funding and the teachers union agrees to concessions. Consultants hired this spring to examine the districts finances found that even if all those things happen, the district would still be hundreds of millions of dollars short of what it needs to pay for the coming school year. The district has for years put off finding a sustainable solution to its annual budget shortfalls, opting instead for tapping its rainy day fund and, under former Mayor Richard M. Daley, stiffing the pension fund for an entire decade. \"Over the years weve kept hoping and hoping, like Mr. Micawber in Dickens, that something would turn up. And nothing has turned up,\" said Henry Bienen, president emeritus of Northwestern University and a departing member of the Chicago Board of Education. The resulting financial situation, Bienen said, is \"pretty appalling.\", \"If you look at the so-called solutions, the only solution thats to my mind fully in control of the school board are cutting solutions, and theyre not pleasant,\" Bienen said. \"Nobodys wanted to do them, for very good reasons  because nobodys wanted to damage the enterprise of teaching students.\", Potentially worsening the situation are unexpected bank penalty payments, the costly legacy of a series of complex financial deals masterminded by school board President David Vitale. Those deals fell apart earlier this year as the districts credit deteriorated, meaning CPS could be forced to pay $228 million if the banks demand their money. The district has set aside only $174 million to cover such costs. Officials from City Hall, CPS and the Chicago Teachers Union have begun meeting to discuss how the school district might manage its financial situation, and union representatives and state lawmakers have received presentations summarizing the districts cash flows. Those documents contend that even if CPS taps its entire $500 million line of short-term credit, akin to a district credit card, it still might not have enough money to cover all the bills coming due by the end of the month, meaning it will start the new budget year July 1 with past-due bills and an empty checking account. The biggest expense is a bill for more than $600 million due to the teachers pension fund on June 30. CPS portrayal of its finances was slightly less dire in an April presentation to investors  a document required to be accurate under federal law. In that presentation, CPS expected to have $227 million left in its operating account on June 30. But an internal report by the Ernst & Young consulting firm this month predicts the district could run out of cash as early as this summer. The report said CPS requires a long-term solution to its finances that includes new revenue, legislative support and \"aggressive cost-cutting measures.\", When Mayor Rahm Emanuel was asked Wednesday whether Chicago would be able to make its pension payment, he responded by reiterating the citys case for additional state pension funding. Emanuel has long argued that Illinois shortchanges CPS on pension funding when compared with the rest of the state. \"Springfield has to step up and help in this case, not only as it relates to just the pension payment, (but also) the educational opportunities of our children,\" Emanuel said. \"Because a payment will then begin to impact ... the classroom.\", The mayors remarks came the same day pension fund officials issued a public statement demanding that CPS pay in full and on time, noting that years of delayed pension contributions led to the current budget-busting payment. Emphasizing the bleak details of the districts finances strengthens the citys arguments that the school system needs additional state pension funding and that it cannot give teachers the kind of raises theyve had in the past. The CTU is negotiating with the Board of Education to draw up a new labor contract after the current one expires at the end of the month. Despite differences over some contract terms, union officials acknowledge that the districts financial situation is serious. \"They absolutely are deep in an imminent crisis,\" CTU Vice President Jesse Sharkey said. \"Maybe they wont be able to open, and maybe the state of schools when they do open is going to be miserable.\", The union is willing to help lobby lawmakers for help, he added. \"Right now, the district needs us,\" Sharkey said. \"The politics of Rahm Emanuel going to Springfield are a lot different than the politics of Rahm Emanuel and Karen Lewis going to Springfield.\", CPS until this year has managed to cover its rapidly increasing pension payments by tapping into its rainy day fund, along with other maneuvers. But with property tax collections limited by state law, the school district has not found a sustainable way to cover pension costs. Now City Hall officials say making the payment could result in classroom cuts. A spokesman for the district did not respond to questions from the Tribune about CPS finances. Rodney Estvan, education policy analyst for the disability advocacy group Access Living and a longtime observer of CPS, predicted that even budget cuts of a few hundred million dollars could force the district to cut teachers and increase class sizes. \"Thats their biggest area of cost savings is by laying off teachers,\" Estvan said. \"Personnel. Its the number one expense.\", Despite the mayors hopes, pension help will be difficult to secure from Springfield, where the Democrat-controlled legislature and Republican governor are deadlocked over their own budget gap and pension problems. In the past, City Hall has found ways to help CPS meet its financial obligations. Past assistance has included declaring surpluses in special taxing districts, with more than half of the money going to public schools; using money collected in those taxing district funds for school construction; and subsidizing the cost of police service at city schools. Under state law, the City Council also has the power to grant CPS the authority to collect what city finance officials estimated would be about $50 million more in property taxes each year for infrastructure expenses  above and beyond the limited annual increases the district can already make. That money would free up operating revenue now used to cover building projects and payments on the school districts massive construction debt. Enacting a so-called capital improvement tax is one idea suggested in the documents presented to state legislators. But even if CPS wins concessions from the City Council, state lawmakers and the CTU, the district wont be able to close its annual $1 billion budget gap, according to the May 22 report by Ernst & Young, which spent four weeks meeting with school finance officials and analyzing budget documents. The report shows that even with a capital improvement tax, a separate, even-larger property tax increase, additional state aid, increased state funding of teachers pensions, concessions from the CTU and $150 million worth of budget cuts, CPS would still face an annual $350 million shortfall. With the school district also facing $228 million in potential costs related to its interest rate swap contracts, officials have been trying for months to persuade the banks to postpone the payments or negotiate a discounted price. In the swap agreements, which provide for an exchange of interest payments over several decades, CPS promised that its debt rating would not drop below an agreed-upon level. Moodys Investors Service and Fitch Ratings downgraded the school district below that level in March, allowing banks to demand the full value of the contracts. The deals date back to the early 2000s, when Vitale  who will lead the board as it responds to the current financial crisis  began advising the school district on its borrowing strategy, first as chief administrative officer and then as chief operating officer. At the encouragement of Vitale, a former vice chairman and director of Bank One Corp. the district paired the swaps with floating-rate bonds in an attempt to borrow at cheaper rates than traditional fixed-rate debt would allow. \"We wanted to take advantage of the cheapest structures available to us,\" Vitale told the Tribune in an interview last year. \"If that meant using structures that were innovative and new, that was OK.\", Market conditions make this a particularly bad time for the district to have to pay up on the swaps. The dollar value of a swap contract can change dramatically from year to year because some interest payments exchanged under the deals are tied to fluctuating short-term rates. A bank will charge more to cash out if bank officials predict those rates will move in their favor over the remaining life of the contracts  and those predictions change weekly. Had CPS cashed out of the same 10 swaps in 2011, it would have cost $132 million, instead of the most recent $228 million estimate. City finance officials said Thursday that some swaps already have been paid off. CPS has so far declined to release to the Tribune the dollar amount of those payments, saying that making the information public could jeopardize current negotiations. A third ratings agency, Standard & Poors, noted in a recent analysis that in order to pay off the swaps and maintain \"at least adequate reserves,\" the school district would either have to cut more costs or find additional revenues. Meanwhile, Moodys, which last month downgraded CPS creditworthiness to junk status, warned that additional \"reductions in the districts operating reserves and liquidity\" could lead to a further downgrade. That, in turn, would push up the districts borrowing costs and exacerbate its financial problems. The district doesnt have a lot of time to address any of these issues, as it must craft a 2016 budget by the end of the summer. That includes finding a way to cover an even larger pension payment next June: about $700 million. jjperez@tribpub.com, hgillers@tribpub.com, hdardick@tribpub.com, Twitter @perezjr, Twitter @hgillers, Twitter @ReporterHal]", "Date": "20150621", "Author": "[ Juan Perez Jr., Heather Gillers, Hal Dardick]", "Link": "http://www.chicagotribune.com/news/ct-cps-financial-crisis-met-20150622-story.html", "Title": "[ Chicago Public Schools faces cash crunch now, possible crisis in the fall]"}