{"Content": "[ Secretary of State John Kerry headed home Monday to Boston from Geneva, Switzerland, for surgery on his broken leg, as U.S. officials insisted that his injury would not hinder his participation in nuclear negotiations with Iran. With an end-of-June deadline for an Iranian deal fast approaching, the 71-year-old Kerry left Geneva aboard a U.S. military plane accompanied by his orthopedic surgeon Dennis Burke and additional medical personnel. Officials said Burke is expected in the coming days to perform surgery on Kerrys right femur, which Kerry fractured on Sunday in a bicycle accident when he struck a curb and fell on a regular Tour de France route in France located southeast of the Swiss city. He had been receiving treatment at Genevas main medical center, HUG, and is to receive further care at Massachusetts General Hospital once he returns home. Kerry, an avid cyclist, had hip replacement surgery several years ago. The fracture was near the hip, leading to speculation that his recovery would be lengthy and prevent him from being as involved in the Iran negotiations as he has been over the past two years. The State Department sought to tamp down such suggestions, saying that Kerry is committed \"to pursuing an aggressive recovery schedule\" and had spent much of Sunday and Monday on the phone with colleagues, including President Barack Obama and counterparts, including the French, Spanish and Iranian foreign ministers. Kerry had spent six hours with Iranian Foreign Minister Mohamad Javad Zarif on Saturday in Geneva before his bike accident. \"Secretary Kerrys main focus for the month of June remains squarely on the Iran negotiations,\" spokeswoman Marie Harf told reporters. \"His injury does not change that. He and the entire team are absolutely committed to the same timetable and are working toward June 30th as the deadline for these talks.\", Kerry himself expressed optimism as his plane took off from Geneva, saying on Twitter that that was eager to return to work. \"Look fwd to getting leg set & getting back to @StateDept!\" he tweeted. \"Meantime, work goes on. Big thanks for well-wishes. #Onward.\" In a French-language tweet, Kerry thanked the local Swiss and French police and emergency workers, calling them \"real professionals.\", U.S. Secretary of State John Kerry broke his leg in bike crash Sunday, apparently after hitting a curb, and scrapped the rest of a four-nation trip that included an international conference on combating the Islamic State group. (AP), U.S. Secretary of State John Kerry broke his leg in bike crash Sunday, apparently after hitting a curb, and scrapped the rest of a four-nation trip that included an international conference on combating the Islamic State group. (AP), The State Department referred questions about Kerrys treatment and recovery time to his physicians. But Harf stressed that Kerry expects to participate in person in upcoming rounds of negotiations with Iran. At the White House, spokesman Josh Earnest appeared less certain but maintained that Kerrys broken leg wouldnt derail the talks. \"We do continue to believe that we have the time and resources necessary to pursue and hopefully complete the Iran negotiations,\" Earnest said, expressing confidence that Kerry will continue to play a \"critically important and leading role\" with hopes of completing the deal by the end of the month. He said, however, that it was unlikely Kerry would be able to return to his previous pace of travel for the talks. And, the broken leg has already hit his travel plans. Kerry had planned to travel to Madrid on Sunday for meetings with Spains king and prime minister, before spending two days in Paris for an international gathering to combat the Islamic State. He will now participate in the Paris conference remotely. U.S. Secretary of State John Kerry broke his leg in a bicycle crash Sunday after striking a curb and scrapped the rest of a four-nation trip that included an international conference on combating the Islamic State group. He planned to return to the United States on Monday. Kerry was staying overnight... U.S. Secretary of State John Kerry broke his leg in a bicycle crash Sunday after striking a curb and scrapped the rest of a four-nation trip that included an international conference on combating the Islamic State group. He planned to return to the United States on Monday. Kerry was staying overnight... Kerry had been taken by helicopter to the Geneva hospital following the accident on Sunday after a paramedic and a physician who were traveling in his motorcade at the time of crash provided him with immediate attention. X-rays confirmed the extent of his injury. His regular government plane returned Sunday night to the United States carrying much of his staff and reporters who had accompanied him on the trip. He had hoped to leave later in the day on a plane fitted with special medical equipment. Kerrys cycling rides have been a regular occurrence on his trips. He often takes his bike with him on the plane and was riding that bicycle Sunday. Associated Press]", "Date": "20150601", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-john-kerry-breaks-leg-20150601-story.html", "Title": "[ U.S. insists John Kerry's broken leg won't hinder Iran talks ]"}