{"Content": "[ After only a couple of hours, the Sunday morning hunt unearthed an animals face in the center of a metal rosette, a brass plate from an old door, pieces of a cast iron wood-burning stove and a kerosene lamp, a dogs tag, the top to an old metal razor, a harmonica reed and a dime. This odd assortment offered glimpses into the lives of those who once lived in the farmhouse that no longer stands on this patch of open space in Orland Park. \"This is an average day,\" summed up Ed \"Mad Dog\" McNamara, of Chicago Heights, who found the items with Bob Culver of Crestwood, both members of the Will County Historical Research and Recovery Association  aka metal detectorists. This is much more than searching for money on sandy beaches but is a treasure hunt of sorts, as members literally dig into the past for more unusual items, armed with old maps pinpointing former sites of old farms and homes. They travel everywhere, looking for bits of history. \"Beaches are a given because there are hundreds of people there every day. But here, youll find more unusual stuff,\" said Culver, who pores over old township maps  one of which led him to this site on 139th Street. \"You have to do your research in selecting a site. Your chances are better of finding something.\", Many times additional research is needed to identify what they found, like the foot-long piece of iron with a wide ratcheted edge  the largest find of the day. \"I try to find something every time,\" Culver said, explaining that this site \"should be loaded\" with items from the old house, barn and tool shed. Goodbye dials, hello digital. Thousands of homes and businesses in the south and southwest suburbs have seen analog electric meters replaced with new \"smart\" meters that read themselves and that ComEd says could ultimately help customers better control what they spend on electricity. The meters... Goodbye dials, hello digital. Thousands of homes and businesses in the south and southwest suburbs have seen analog electric meters replaced with new \"smart\" meters that read themselves and that ComEd says could ultimately help customers better control what they spend on electricity. The meters... \"Someone has been here before,\" McNamara said. \"There should have been more coins.\", Culver has been here a few times and discovered two old coins, hand-forged mule shoes and a barn trolley  which is now part of his personal museum of relics. Many get into metal detecting because they are history buffs, said WCHRRA president Chester Kiernicki. \"It gets us outdoors. Its a form of relaxation,\" he said. \"It gives me alone time in my head, a chance to reset my brain cells.\", \"I love history. If you can go five inches below your feet, youll discover a lot of history,\" said David Midlick, of Woodridge, who collects Civil War relics and travels to Tennessee and Mississippi looking for them. His collection includes 3,000 bullets, 6 breastplates, a bayonet, belt buckles, and an 1840 muzzle loader, some of which are on display in museums. \"When you find something, you think you are the first person to touch this since the Civil War,\" he said. It wouldnt be stretching the truth to say that Steve Weisman is poised to become the medical pot kingpin of the Southland. True, he would hate that characterization, and little about him resembles the sort one might guess would fit it. Nevertheless, Weisman, a bespectacled 29-year-old, is transitioning... It wouldnt be stretching the truth to say that Steve Weisman is poised to become the medical pot kingpin of the Southland. True, he would hate that characterization, and little about him resembles the sort one might guess would fit it. Nevertheless, Weisman, a bespectacled 29-year-old, is transitioning... WCHRRA is one of the largest clubs in Illinois with about 80 members, brought together from all over the area by a love of history and the thrill of the find, said Kiernicki. They meet monthly at the American Legion Hall, in Joliet on the fourth Thursday to show off their found items, swap stories, and enjoy a brew over some friendly bantering. There are contests for the \"find of the month,\" and how much trash they pack out. They host monthly club hunts, annual picnics and holiday parties. Members field calls from people to help locate lost jewelry and other metal objects. According to its website, wchrra.org, they also assist insurance companies, police agencies, historians and archaeologists. \"Its a strange hobby, a fun hobby, and a misunderstood hobby,\" said Kiernicki. Culver agreed, recalling a hunt several years ago in a wooded area near an Orland Park school. He and his comrades were dressed in camouflage (because thorns and bugs dont penetrate it), had their long-handled equipment in hand and were headed for the woods when the eight squad cars with canine units pulled into the lot. \"They thought we were terrorists, and shut down the school,\" said Culver. Club members are careful to follow the laws and abide by a code of ethics that requires them to leave no visible signs of being there, to leave a site better than they found it and to remove any trash. They respect private property, seeking owners permission before going on site. In recent years they have been banned from Cook County forest preserves and are allowed in Will County forest preserves by permit only, and are restricted to designated mowed areas. Club members abide, but lament that wooded areas are where they find \"the good stuff.\", Before the ban, Culver said his detector located chicken wire  deep in the forest  surrounding a patch of marijuana plants, which he reported to authorities. Members said they also have discovered pistols, needles, and drug paraphernalia. Tony Lisy, of Crest Hill, likes to search playgrounds for coins and jewelry, but he also found unexpected items, such as live bullets, he said. Another member found a voodoo doll stuck with pins. As McNamara said, \"You never know where you will find something.\", In an old house that was being demolished, he discovered his greatest find to date  which merited a brief article in Treasures Magazine  a pewter medallion depicting the sinking of the Lusitania, dated May 5, 1915. The ship was torpedoed by a German U-boat on May 7, 1915. McNamara figured many more medallions were made  with the correct date. After obtaining permission from the owner of a sheep farm, Barbara Hermanowicz of New Lenox, found an 1873 Indian head penny buried in sheep droppings . On a snowy trail in January, Culver found a Nepalese army knife, with a curved blade and a bone handle. Joliet resident Leo Drescher, 85, who has been detecting since 1965, finds 7,000 to 8,000 items each year, and has an extensive collection of rings. But his prized find, he said, is a Korean urn, which dates back to 200 BC to 200 AD, according to an antique expert he consulted. \"I go whenever I feel like it. I just have fun doing it. It keeps me young,\" Drescher said, adding that so far this year, he has unearthed 1,981 items. \"Im not good. I go out so much I am bound to find something,\" he said modestly. It also helps to have the proper equipment  which can range in price from $250 to $1,500. Better detectors have signals that can go deeper and provide a more accurate guess as to what lies below, members said. The best items are usually deeper because they have been there longer, they said. Hunters become attuned to their own equipment and learn to read its signals, which generally locate a target within a three-inch circle. Detectorists have their own methods of searching, too. Drescher works methodically, thoroughly, in a grid pattern. Culver said he likes to meander. They walk along slowly until they hear the beeping signal through their headphones and check the meter before deciding to dig. \"The machine is guessing, too. You have to get a feel for it  like fishing,\" Culver said as he roamed the grassy grounds. His detector gave off a signal, indicating a coin. After carefully cutting a plug of grass with his digging tool, leaving the roots attached on one side, he sifts through the dirt, alas, to find a big piece of aluminum. \"You learn to live with disappointment,\" he said, with a laugh, as he puts the garbage into a separate pouch on his belt, replaces the dirt and plug, and pats it back down with his foot. Detectors often mistake aluminum pull tabs for rings, but members collect those, too, and have already donated over 30 pounds of pull tabs to the Ronald McDonald House. Pennies  the most commonly lost coin  also are collected and donated to charity. Discovered items are brought to the club meetings, where members vote for the \"find of the month\" in several categories, such as coins, jewelry, and relics, earning points toward prizes. In June, monthly finds included an 1881 Indian head penny, a 1938 Buffalo nickel, a Tiffany tag, a 10 karat diamond ring with 26 tiny diamonds and a 1947 class ring from the University of Notre Dame, which will be returned if the owner can be found. They share their items, save some, toss them, or recycle them, and love to tell their stories over and over. \"Its the hobby that is important,\" Culver said. \"Its all fun.\", slafferty@tribpub.com]", "Date": "20150709", "Author": "[ Susan DeMar Lafferty]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-metal-detectors-st-0707-3-20150709-story.html", "Title": "[ Buried treasures reveal history of the area]"}