{"Content": "[ The capture of drug lord Joaquin Guzman was the crowning achievement of President Enrique Pena Nietos government in its war against drug cartels, a beacon of success amid domestic woes. That makes the bold escape by \"El Chapo\" from a maximum security prison all the more devastating. A widespread manhunt that included highway checkpoints, stepped up border security and closure of an international airport failed to turn up any trace of Guzman by Monday, more than 24 hours after he got away. Widely considered the worlds richest and most powerful drug trafficker before his capture last year, Guzman slipped down a shaft from his prison cells shower area late Saturday and disappeared into a sophisticated mile-long (1.5 kilometer-long) tunnel with ventilation, lighting and a motorcycle apparently used to move dirt. \"All the accolades that Mexico has received in their counter-drug efforts will be erased by this one event\" if Guzman is not recaptured, said Michael Vigil, a retired U.S. Drug Enforcement Administration chief of international operations. More than anything else, the escape undermined Mexicos assertion it can deal with top drug lords at home and doesnt need to extradite them to the U.S. The national pride that appeared to motivate Pena Nietos administration to prosecute drug lords like Guzman through its own court system has now turned into a national embarrassment. \"This is regrettable, very bad, because it without doubt affects the image of Mexico in the world,\" Mexican Sen. Luis Miguel Barbosa told journalists in Paris on Monday. He was part of a delegation traveling with the Mexican president to the French capital. Mexicos security commission says top drug lord Joaquin El Chapo Guzman has escaped from a maximum security prison for the second time. (AP), Mexicos security commission says top drug lord Joaquin El Chapo Guzman has escaped from a maximum security prison for the second time. (AP), \"You have to completely renew the Mexican prison system. The arrest of all warders and managers is not enough,\" he said. \"This happened due to collaboration from within the jail at the highest level.\", According to a report from the Congressional Research Service in May, extraditions from Mexico to the U.S. peaked at 115 in 2012, the last year of Pena Nietos predecessor, Felipe Calderon. There were 66 last year. The escape route apparently was built over the last year right under authorities noses into a supposedly escape-proof lockup. Its scale has raised suspicions of corruption that could most discourage the U.S. Mexicos main ally that has poured more than $1 billion into joint efforts at battling organized crime cartels, much of it focused on reforming the criminal justice system. The United States was already stinging from a court decision in August 2013 to free drug lord Rafael Caro Quintero on procedural grounds, overturning his conviction in the 1985 kidnapping, torture and murder of DEA agent Enrique \"Kiki\" Camarena. Caro Quintero hasnt been seen in public since then. Chicago compared him to Al Capone. Forbes Magazine listed him as one of the richest men in the world. And in Mexico, he was a renegade outlaw whose exploits were the stuff of legend and song. Joaquin El Chapo Guzman, one of the worlds biggest drug kingpins, gained folklore status during his... Chicago compared him to Al Capone. Forbes Magazine listed him as one of the richest men in the world. And in Mexico, he was a renegade outlaw whose exploits were the stuff of legend and song. Joaquin El Chapo Guzman, one of the worlds biggest drug kingpins, gained folklore status during his... \"For the most-wanted criminal to escape from the highest-security prison is going to create conflicts, the first of them with the United States,\" Mexican security expert Jorge Chabat said Sunday. The escape also hurt Pena Nieto domestically. He had campaigned on one main promise  to diminish drug cartel violence  and claimed success in attacking drug gang capos like no administration before, arresting or killing essentially all the top leadership of the Zetas, Beltran Leyva and Knights Templar cartels. It was a highlight for an administration struggling on other fronts, including a lackluster economy and scandals over the disappearance of 43 college students, and the purchase by the presidents wife of a mansion, known as the \"white house,\" from a government contractor. \"This hurts him a lot. It is an administration that already has a lot of image problems, with the scandals over the students and the white house, and now this comes along and paints them as an administration with serious problems of inefficiency and corruption,\" Chabat said. Just as painful are memories of the cocksure way officials reacted after they captured Guzman in February 2014, some 13 years after the Sinaloa Cartel boss managed to flee from Mexicos only other maximum-security prison. Pena Nieto said in a televised interview that allowing him to escape again would be \"unforgiveable.\" Jesus Murillo Karam, his attorney general at the time, said the possibility of another Guzman escape \"does not exist.\", Manuel Ballbe, director of School of Risk Prevention at Spains Autonomous University of Barcelona, said it was important for the U.S. to push for extraditions. \"International pressure is the check and balance against the states corrupt powers,\" Ballbe said. The bold and well-engineered escape also illustrates that simply capturing such a powerful figure without dismantling his financial network is insufficient, he said. \"Holding a drug lord inside the country does not affect his financial capacity,\" Ballbe said. \"It is very difficult for the state to do something against the size of the bribes that these networks can produce.\", U.S. Attorney General Loretta Lynch said in a statement that \"we share the government of Mexicos concern regarding the escape of Joaquin Guzman,\" adding that \"the U.S. government stands ready to work with our Mexican partners to provide any assistance that may help support his swift recapture.\", But Peter Bensinger, a former administrator of the DEA, said he expects that U.S. officials have expressed their anger to their Mexican counterparts. \"He ought to have been housed in an American prison,\" Bensinger said. \"Mexican authorities will come in for tremendous criticism, as they should.\", Raul Benitez, a security expert at Mexicos National Autonomous University, said Guzmans second escape is even worse for Pena Nieto than if he had never captured him. \"In the context of the drug war it is the presidents worst failure,\" Benitez said. Associated Press]", "Date": "20150713", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-el-chapo-prison-escape-20150713-story.html", "Title": "[ 'El Chapo' prison escape a strong blow to Mexico's government ]"}