{"Content": "[ With a background in horse racing, the Duchossois family knows how to hedge its bets, something its doing when it comes to the 2016 Republican presidential race. Arlington International Racecourse Chairman Richard L. Duchossois has given money to super political action committees behind former Florida Gov. Jeb Bush, Wisconsin Gov. Scott Walker and Louisiana Gov. Bobby Jindal. Daughter Kimberly Duchossois gave money to PACs supporting Bush and Walker. And son Craig Duchossois gave $500,000 to Bushs PAC. All told, the more than $695,000 contributed by the Duchossois family represents almost one-tenth of the more than $7.5 million Illinois donors have given to the PACs behind nine Republican presidential contenders, a review of Federal Election Commission records shows. Tops in collecting campaign cash in Illinois is Bush  his Right to Rise USA fund has received more than $4.1 million from more than 200 donors here. Behind Bush is Walker, whose Unintimidated super PAC raised $2.9 million from 27 Illinois residents and businesses. Far behind those two is Florida Sen. Marco Rubio, who collected $225,000. For Bush, the money shows he has been able to secure the early backing of many elite Chicago-area donors. For Walker, nearly all of the Illinois money came from one donor, leaving room to raise more in a neighboring state thats easy for him to get to. On the Democratic side, the Priorities USA Action super PAC backing Hillary Rodham Clintons bid for the presidency reported no Illinois donors among the $15.6 million it raised. Candidate super PACs are an outgrowth of the 2010 U.S. Supreme Court ruling that rejected a ban on corporations and unions from making independent expenditures in support of political issues and candidates. The decision allowed unlimited contributions for ads and other ways to try to support or defeat a candidate. Though candidates still raise their own money directly, individual contributions are limited to $5,400. Its the super PAC donations that give a more realistic dollar standpoint of a candidates viability. While there isnt supposed to be any coordination between a candidates campaign and a supportive super PAC, one campaign finance expert called that a \"polite fiction,\" with the PACs often being run by candidates friends or longtime political operatives. \"(Super PACS) have become the campaign, where the money gets raised and where the campaign takes place in terms of the expensive stuff like ads, direct mail, phone banking and get-out-the-vote,\" said Kent Redfield, a professor emeritus of political science at the University of Illinois at Springfield. In the old days, candidate fundraising was dependent upon strong showings in early primary and caucus states. Not anymore. \"It has completely changed the dynamics. You still have to win delegates and win primaries, but to a certain extent, it de-emphasized the importance of Iowa and New Hampshire,\" Redfield said. The heavily funded super PAC backing Republican Jeb Bush will spend at least $10 million on television time in the earliest voting presidential primary states, the first salvo in a massive TV ad campaign to support the former Florida governors bid for the Republican nomination. Officials with... The heavily funded super PAC backing Republican Jeb Bush will spend at least $10 million on television time in the earliest voting presidential primary states, the first salvo in a massive TV ad campaign to support the former Florida governors bid for the Republican nomination. Officials with... Illinois donations to Bushs super PAC represented only a small portion of the $103 million it generated nationally on behalf of the son and brother of two former presidents. But the reports for the first half of 2015 filed this month show that Chicago remains a financial wellspring for him. \"Illinois is an example of what Bush has across the country  that network thats been around since literally the late 1980s when (President George) H.W. (Bush) first started in this state,\" said Greg Baise, president and CEO of the Illinois Manufacturers Association and a Jeb Bush donor. President George W. Bush \"certainly had a very strong (donor) core, so I think in the big industrial states and where the money centers are for Republican politics in the country, Illinois is a classic example that Bush had  (significant) people to make phone calls, and it didnt take long to raise money,\" Baise said. The top Illinois donor to Bushs PAC is Muneer Satter, who runs his own investment management firm. Satter gave $550,000, part of the more than $1.4 million hes contributed to super PACs in the last five years. Hes also given $976,750 in direct federal candidate and candidate committee donations since 1999, records show. The second-largest Illinois Bush donor, at $500,000, was Craig Duchossois, CEO of the privately held family business The Duchossois Group. Overall, the family has given more than $1.5 million to super PACs since 2010. The Satter and Duchossois contributions to the Right to Rise PAC represent the confluence of money and politics when it comes to major Chicago-area donors. Both are longtime GOP political contributors, but each also has given money to Rahm Emanuel, the citys Democratic mayor. Both serve on Emanuels World Business Chicago economic development board. The Bush PACs third-largest donor from Illinois is Christopher Galvin, chairman, CEO and co-founder of Harrison Street Capital. The former chairman and CEO heir of Motorola, which his grandfather founded, gave $265,000. He has made more than $1.8 million in donations to federal candidates since 1997. Also on the big donor list for Bushs super PAC is Byron Trott, at more than $260,000. Trott, also an Emanuel donor and World Business Chicago appointee, is managing partner of BDT Capital Partners LLC, which bought and redeveloped the Wrigley Building. Wife Tina Trott gave $50,000 to the Bush PAC. Citadel LLC hedge-fund founder and CEO Kenneth Griffin was among 10 Illinois residents and businesses who gave $100,000 to Bushs PAC. Griffin, who gave more than $400,000 to Emanuels two mayoral campaigns and $13.6 million to Republican Gov. Bruce Rauner, has contributed more than $6.5 million to super PACs in the last five years. That includes $2.25 million to American Crossroads, co-founded by President George W. Bush adviser Karl Rove, federal records showed. But Griffin also put $100,000 into Conservative Solutions, the super PAC backing Rubio, Jeb Bushs chief Florida rival. Also giving $100,000 to the Rubio PAC was David Herro, investment manager for Harris Associates LP. Herro, a longtime Republican donor, also gave $65,000 to Emanuels first mayoral bid. In addition, Herro has donated $25,000 to America Leads, the super PAC behind New Jersey Gov. Chris Christie. Herro has given more than $1.6 million to super PACS since 2010, including $260,000 to American Crossroads. The largest presidential super PAC donation from Illinois so far went to the Unintimidated PAC that supports Walker, the Wisconsin governor. Of the $20 million it reported raising nationally, conservative businessman Richard Uihlein of Lake Forest and wife Elizabeth together gave $2.5 million. The Uihleins donation represented 86 percent of the money the Walker fund got from Illinois. The couple own Uline Inc. a distributor of shipping materials, that in 2008 agreed to move 15 minutes across the border from Waukegan to Pleasant Prairie, Wis. after getting more than $6 million in incentives from the administration of Walkers predecessor, Jim Doyle. The Uihleins also have a strong family connection to Wisconsin  a relative founded the Jos. Schlitz Brewing Co. in Milwaukee. Richard Uihlein has donated more than $9.6 million to federal super PACs since 2010 and given almost $650,000 to federal candidates and committees since 1997. At the state level, he and his wife have given nearly $8 million to candidates and committees, including more than $2.6 million to Rauner. Walkers other major donors were Daniel Arnold of Rockford, the owner of Road Ranger truck stops and travel centers, at $51,000, and investor Richard Colburn of Northbrook, at $50,000. Donating $2,485 to the PAC backing Walker was Todd Ricketts, part of the family that owns the Chicago Cubs. Matriarch Marlene Ricketts of Nebraska was one of the Walker PACs top overall donors, giving nearly $5 million. She also gave $10,000 to PACs backing Bush, Rubio, Christie, former Texas Gov. Rick Perry and South Carolina Sen. Lindsey Graham. Besides donations from Griffin and Herro, the only other Illinois-based contribution to Rubios super PAC came from William D. Perez of Chicago, the former president and CEO of William Wrigley Jr. Co. who gave $25,000. Nationally, the Rubio PAC raised more than $16 million. Among other Republican presidential candidates, the Believe Again PAC behind Jindal, the Louisiana governor, received only two Illinois-based donations  $50,000 from Richard Duchossois and $25,000 from the Large Urology Group Practice Association of Schaumburg. Nationally, the PAC raised $3.7 million. The America Leads PAC supporting Christie, the New Jersey governor, got three Illinois donations, including Herros. Also donating were Anna Brown of Barrington Hills with $25,000, and $20,000 from Steven Roodman of Marion, a physician and owner of Anesthesia Associates of Southern Illinois. The PAC backing Christie received $11 million across the country. Kentucky Sen. Rand Paul has three different super PACs supporting his candidacy that raised a combined $6.2 million nationally. One of them, Americas Liberty, got the lone donation from Illinois, $15,000 from ICC Holdings LLC, a health care firm in Homer Glen. Texas Sen. Ted Cruz has four Keep the Promise super PACs backing his candidacy, which received a lone $10,000 contribution from Matthew Rice of Downstate Harrisburg, who is involved with a mining equipment company. Overall, Cruzs PACs raised nearly $38 million. Neurosurgeon Ben Carson has two associated super PACs, the Draft Ben Carson PAC and The 2016 Committee, which have raised a combined $6.7 million. More than 1,000 Illinois residents, mostly making small contributions, donated a combined $51,338 to the draft political committee, while Carson received $7,350 from Illinoisans to the 2016 PAC. Carly Fiorina, the former Hewlett-Packard CEO and unsuccessful California Senate candidate, is being helped by CARLY for America PAC  shorthand for Conservative, Authentic, Responsive Leadership for You and for America  which has raised nearly $3.5 million nationally. She received three Illinois donations totaling $1,000. No Illinois donations were reported to super PACS representing Ohio Gov. John Kasich, former Govs. Perry, Mike Huckabee of Arkansas, George Pataki of New York and Jim Gilmore of Virginia, former Pennsylvania Sen. Rick Santorum, Graham and billionaire businessman Donald Trump. On the Democratic side, though Clintons super PAC had no Illinois donations, there is a Chicago-based super PAC backing an effort to draft Vice President Joe Biden into the presidential contest. The Draft Biden 2016 PAC has raised $85,880, with its executive director, William Pierce III, donating $4,597 of in-kind expenses. Two other Illinois donors contributed a combined $1,020. rap30@aol.com, Twitter @rap30]", "Date": "20150817", "Author": "[ Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-illinois-presidential-race-super-pac-donors-met-20150816-story.html", "Title": "[ Bush, Walker rack up super PAC cash in Illinois]"}