{"Content": "[ President BarackObamaportrayed the U.S.-led coalition Monday as gaining ground against theIslamicStateamid an expanded U.S. effort and ample signs of progress, but conceded more difficulties ahead in fighting what he described as a nimble and opportunistic enemy. \"Were starting to see some progress,\" the president said during a rare visit to the Pentagon, ticking off a list of towns in Iraq and Syria he said had been wrested from IS control in recent weeks. Flanked by top military commanders,Obamaalso warned of theIslamicStatesefforts to recruit and inspire vulnerable people in the UnitedStates, and called on the American-Muslim community to \"step up in terms of pushing back as hard as they can.\" He said that while the U.S. is now better prepared to thwart large-scale terrorist attacks like 9/11, the threat from individual \"lone wolves\" or small terrorist cells has increased. \"Were going to have to pick up our game to prevent these attacks,\"Obamasaid. The Pentagon visit followed a wave of weekend airstrikes by the U.S.-led coalition in eastern Syria  one of the most sustained aerial operations carried out in Syria to date, the U.S.-led coalition said.Obamapointed to those and other airstrikes as proof of an intensified U.S. effort to undermine the militant groups base of operations and cut off their sources of funding. Obamasafternoon visit to the Pentagon offered a public display of presidential support for the military one day before Defense Secretary Ash Carter and Joint Chiefs of Staff Chairman Martin Dempsey were expected to be grilled on Capitol Hill. Senate Armed Services Chairman John McCain, R-Ariz. has sharply criticizedObamafor not doing more militarily to defeat IS, and said Monday that the U.S. is losing the battle as the extremist group continues to gain territory in Iraq and Syria. U.S. President Obama says recent territory losses by IS show the extremist group will be defeated, but must include local forces on the ground. July 6, 2015. (Reuters), U.S. President Obama says recent territory losses by IS show the extremist group will be defeated, but must include local forces on the ground. July 6, 2015. (Reuters), \"PresidentObamascomments today reveal the disturbing degree of self-delusion that characterizes the administrations campaign against ISIL,\" McCain said. Although the president said there were \"no current plans\" to send more U.S. troops to Iraq, he did not rule out that possibility in the future.Obamahas vowed to keep American service members out of direct combat, but has sent more than 3,000 U.S. troops to advise and assist the beleaguered Iraqi military  including the deployment of 450 additional service members announced last month. Efforts to train local forces in Iraq and Syria, however, have been slow to take shape. Last month,Obamaacknowledged that the U.S. lacks a \"complete strategy\" for training Iraqi troops to carry out ground missions. And in Syria, fewer than 100 rebels are being trained by the U.S. far fewer than the goal of producing 5,400 fighters a year. Associated Press, After weeks of setbacks, militants from the Islamic State group launched swift counteroffensives Thursday on predominantly Kurdish areas of northern Syria, killing and wounding dozens and setting off car bombs, activists and officials said. The two-pronged attack on the northeastern city of Hassakeh... After weeks of setbacks, militants from the Islamic State group launched swift counteroffensives Thursday on predominantly Kurdish areas of northern Syria, killing and wounding dozens and setting off car bombs, activists and officials said. The two-pronged attack on the northeastern city of Hassakeh...]", "Date": "20150706", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-obama-islamic-state-20150706-story.html", "Title": "[ Obama: Fight against Islamic State progressing, but still a long slog ]"}