{"Content": "[ Republican presidential candidate Scott Walker said in a television interview Friday he is not taking a position on whether children born to immigrants here illegally should automatically be citizens. Andhe said in a separate campaign stop that there are only a \"handful\" of moderate followers of Islam. The Wisconsin governorsaid in a CNBC interview that he wouldnt take a stand \"one way or the other\" on the constitutional guarantee of birthright citizenship. Walkers statement comes after he gave mixed answers on the issue earlier in the week, including saying that the U.S. should \"absolutely\" end birthright citizenship. Rival Donald Trump has said he wants to end the automatic granting of citizenship to children of people here illegally. Since then, Walker and other candidates have been asked their positions on it. Walker later Friday issued a statement on Twitter saying, \"Truly secure border & enforce laws. Nothing else matters on immigration issue if you dont do this first. Thats my point.\", Walker previously reversed his position on allowing a chance for legal status for those in the country illegally. Also on Friday, at a campaign event in Derby, New Hampshire, Walker responded to a question about fighting terrorism by saying he believes there are only a \"handful\" of moderate followers of Islam who dont have radical beliefs. Gov. Scott Walker leads other Republican presidential candidates in his home state of Wisconsin but trails Democrat Hillary Rodham Clinton there in a potential general election matchup, according to the first statewide poll since Walker announced his candidacy. The Marquette University Law School... Gov. Scott Walker leads other Republican presidential candidates in his home state of Wisconsin but trails Democrat Hillary Rodham Clinton there in a potential general election matchup, according to the first statewide poll since Walker announced his candidacy. The Marquette University Law School... \"If youre fighting a war, youve gotta identify who the enemy is loud and clear,\" Walker said. \"Weve said it repeatedly, its radical Islamic terrorism, it is a war not against only America and Israel, its a war against Christians, its a war against Jews, its a war against even the handful of reasonable, moderate followers of Islam who dont share the radical beliefs that these radical Islamic terrorists have.\", Walkers campaign spokeswoman AshLee Strong said later that Walker knows that most Muslims want to live in peace. \"The governor knows that the majority of ISISs victims are Muslims,\" Strong said in a statement. \"Muslims who want to live in peace  the majority of Muslims  are the first target of radical Islamic terrorists. Under the Obama-Clinton foreign policy doctrine, weve been abandoning our traditional Muslim allies in the Middle East and allowing ISIS, al Qaeda, and Iran to fill the void.\", The Council on American-Islamic Relations, a Muslim civil liberties and advocacy organization, released a statement calling on Walker to apologize. Republican presidential candidate Scott Walker on Tuesday offered an alternative to President Barack Obamas health care law that would provide tax credits and restructure Medicaid, and took a swipe at GOP rivals in Congress for their inability to repeal the law. \"Im willing to stand up against... Republican presidential candidate Scott Walker on Tuesday offered an alternative to President Barack Obamas health care law that would provide tax credits and restructure Medicaid, and took a swipe at GOP rivals in Congress for their inability to repeal the law. \"Im willing to stand up against... \"These types of inaccurate statements reflect a lack of understanding of Islam and Muslims that is, frankly, not presidential,\" said the councils government affairs manager Robert McCaw. \"If Mr. Walker believes only a handful of Muslims are moderate or reasonable, then he is ignoring the very clear reality that violent extremists murder more Muslims than they do people of any other faith.\", Walker has faced criticism before for his comments about foreign policy. Back in February, Walker said his experience taking on thousands of protesters in Wisconsin helped prepare him to take on terrorists across the world. Associated Press, ]", "Date": "20150821", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-scott-walker-birthright-citizenship-20150821-story.html", "Title": "[ Scott Walker gives conflicting answers on birthright citizenship ]"}