{"Content": "[ MADRID  Spain is winning the battle for gay tourists. Gay and lesbian visitors contribute about $6.8 billion to the Spanish economy, according to a report by LGBT Capital last month, edging out France as Europes top destination. Gay people spend about 30 percent more on average than mainstream tourists in Spain, according to government estimates, boosting an economy where tourism accounts for 12 percent of jobs. While a growing number of countries like France and Britain are introducing equal-rights legislation and promoting themselves to gay visitors, Spain is out in front. Even the conservative leadership of Madrid is embracing the phenomenon. Spain in 2005 became the third European nation to legalize gay marriage -- after Belgium and the Netherlands -- emerging from the shadow of the Roman Catholic dictatorship of General Francisco Franco who died in 1975. That move established Spains credentials as a holiday destination where people can feel relaxed about their sexuality, sometimes in a way they cant back home. \"Its very tolerant and its fun,\" said Fabiano Ribeiro, a 32-year-old Brazilian visiting Barcelona with two male friends. \"You hold hands and thats no problem.\", Each August, Spains second city hosts Europes largest gay festival, attracting 71,000 visitors this year. During the two- week party Barcelona is plastered in posters featuring male models advertising parties aimed at gay visitors and stores carry signs with special offers, from sun-beds to free gym passes as the city is taken over by non-stop clubbing and pool parties. With full-access tickets selling for 360 euros ($406), organizers say the events generates 150 million euros for the local economy. After eight years, the festival is expanding to Ibiza this year and the Canaries in 2016, catering to increasing demand for gay and lesbian events. \"This influx of visitors trickles down to local bars, gyms, even taxi drivers want to be involved,\" said organizer Tes Cuadreny in an interview from his office in Barcelona. \"They know this benefits everyone.\", Such initiatives have made Spain Europes market leader ahead of France which generates $6.6 billion of revenue, according to LGBT Capital, an investment firm based in the British Virgin Islands that focuses on gay-themed assets. The U.S. is the global leader with $21.5 billion of revenue. In Madrid, even the conservative regional government is jumping on the bandwagon. Regional President Cristina Cifuentes flew the rainbow flag, symbolizing support for gay people, from institutional buildings for the first time following her election victory in May. In 2005, her colleagues from Prime Minister Mariano Rajoys Peoples Party led 100,000 protesters in a march against legalizing gay marriage. The Spanish capital generated about 120 million euros from Europes biggest gay-pride parade at the start of the summer, according to nightlife organization Noche Madrid. \"This is a high-income travel market that is not tied down by school holidays and is generally more adventurous,\" said Carlos Kytka, executive director at the Gay European Tourism Association, which works with more than 4,000 industry members, mainly hotels in Europe. \"Its easy to fill up hotels in Barcelona in summer, what makes us different is that we travel all year round and spend the money, and that keeps the cash flow going.\"]", "Date": "20150906", "Author": "[ Maria Tadeo, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-spain-gay06-20150906-story.html", "Title": "[ Rich gay men wanted: Spain's conservatives make tourist appeal]"}