{"Content": "[ Biggest. Best. Classiest. Maybe a little cheap. Donald Trump, a maestro of ego and Republican presidential frontrunner, brags about political donations, but gives a slim fraction of the cash tossed around by other New York bigwigs. \"When they call, I give,\" Trump said at the Republican debate this month. \"And you know what? When I need something from them, two years, three years later, I call them. They are there for me.\", But he doesnt give much. In Trumps hometown, hes given only about $144,000 to candidates since 1989, filings show. The developer and his associated companies have given $710,000 to state politicians and committees since 1999. By comparison, fellow New York real-estate mogul Leonard Litwin and his companies donated more than $10 million. Trump, his family and companies have also given about $2.5 million on the federal level and to nonprofit political groups since 1989. Yet his largesse pales in comparison with that of his peers, said Blair Horner, legislative director for New York Public Interest Research Group, a government watchdog. \"Trumps donations are relatively small potatoes,\" Horner said. Corey Lewandowski, Trumps campaign manager, said the candidate is a generous man. \"Its been a pattern of giving over a long period of time,\" he said. \"He says publicly he gives to everybody who came to his office and asked.\", Among the beneficiaries was Hillary Clinton, whos leading the pack of Democrats vying for the presidency. Trump and relatives have given $9,500 to her federal campaigns. He also gave between $100,001 and $250,000 to the Clinton Foundation, which has raised about $2 billion since its creation in 2001. For that, Trump said, she showed up at his 2005 nuptials with husband and former President Bill Clinton in tow:, \"I said, be at my wedding and she came to my wedding. You know why? She had no choice. Because I gave to a foundation.\", Clinton told reporters in New Hampshire that she went because she \"thought it would be fun.\", New York Gov. Andrew Cuomo has received $84,000 from Trump and his companies since 1999, when records start. The Democrat has received nothing since 2011, his first year in office. Trumps contributions were relatively insignificant: Cuomo raised $46.9 million just for his 2014 re-election campaign. In New York City, Trump, his two ex-wives, three children and business entities have given $167,000 since 1989, according to the New York City Campaign Finance Board, whose records begin that year. Of that, 43 percent went to mayoral candidates, 20 percent for borough-president races, 18 percent to comptroller hopefuls and 14 percent for City Council contests. The largest aggregate amount was $23,000 to former Comptroller Harrison J. Goldin for his 1989 Democratic race for mayor, which he lost to David Dinkins. Before 1989, as Trump was building his empire, he and his companies gave far more, including $185,000 to New York candidates in 1985 alone, according to testimony before a state commission probing campaign donations in 1988. Since 2007, New York City has limited contributions from people who do business with the municipality to reduce influence peddling. Trump runs the carousel in Central Park. Trump and his family have given only about $7,500 since the limits were enacted, data show. Trumps federal donations are also minuscule when compared with those of others, especially after the Citizens United ruling from the U.S. Supreme Court in 2010 allowed unlimited contributions from individuals and corporations to political committees. About 60 people have already donated at least $1 million to independent political committees supporting Democratic and Republican presidential candidates in 2016, federal data show. Yet Trump, his ex-wives, children and business entities have given only $1.9 million to national candidates and committees since 1989, according to the Center for Responsive Politics in Washington, which documents the influence of money. Trump also has given $640,500 to the Republican Governors Association and other nonprofit political groups. \"The facts dont really line up with the bluster,\" said Viveca Novak, a spokeswoman for the center. Trump has power beyond mere cash, said Barbara Bartoletti, legislative director for the League of Women Voters of New York State, which advocates public financing of campaigns. As a billionaire and entertainer, his double shot of celebrity is a singular phenomenon. \"He doesnt need to spend the money,\" Bartoletti said. \"The name recognition alone carries him pretty far.\", , _ Henry Goldman contributed.]", "Date": "20150831", "Author": "[ Freeman Klopott and Mark Niquette, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-trump-donate31-20150831-story.html", "Title": "[ Campaign donations by big-spender Trump expose a tightfisted side]"}