{"Content": "[ In a party that produced such talented speakers as Mario Cuomo, Ted Kennedy, Bill Clinton and Barack Obama, this years presidential race looks like a slog through an oratorical desert. Yet last week, the Iowa Democratic Party hosted a dinner so masochists could hear five White House aspirants deliver speeches. Former Rhode Island Gov. Lincoln Chafee and former Virginia Sen. Jim Webb read their remarks like dutiful students. Vermont Sen. Bernie Sanders brought to mind a punk band that knows only three chords and plays them all the same way: loud. Hillary Clinton uttered every sentence as though she were addressing third-graders. There was one respite, from Martin OMalley. The former governor of Maryland apparently heard somewhere that fluent public speaking is a useful skill in politics. If you couldnt pick him out of a lineup, dont feel bad. A new Washington Post-ABC News poll gives him 2 percent of Democratic voters. He was lampooned in an April Twitter post with a photo of the gyrocopter that landed on the White House lawn and the caption: \"MARTIN OMALLEY WILL NOT BE IGNORED.\", Clinton may have had the most supporters in the room, and Sanders populist fury stirred the most anticipation. But if there had been impartial judges giving scores, OMalley would have been the clear winner  and a sound meter probably would have confirmed it. His lines about redeeming the American Dream and promoting a stronger middle class are standard fare. His selling point was: \"I am the only candidate for president with 15 years of executive experience.\" He stands out, he said, for turning \"progressive values into action.\", If anything is certain about Donald Trumps bizarre bid for the Republican presidential nomination, it is the huge favors he does for the Democrats. That thought occurred to me last weekend, for example, as Trump was lobbing verbal mud balls at the heroic war record of Sen. John McCain, R-Ariz.,... If anything is certain about Donald Trumps bizarre bid for the Republican presidential nomination, it is the huge favors he does for the Democrats. That thought occurred to me last weekend, for example, as Trump was lobbing verbal mud balls at the heroic war record of Sen. John McCain, R-Ariz.,... This was where his earnest speech became impassioned, his voice rising over building cheers: \"In Baltimore, we took action to save lives by reducing record-high violence to record lows. We increased drug treatment to free thousands of our courageous neighbors from the scourge of drug addiction. ... Drivers licenses for new American immigrants, marriage equality and a ban on assault weapons: and we didnt just talk about it, we actually got it done!\", On his mayoral record, OMalley can point to documented changes that, in the post-Ferguson, Mo. era, seem incompatible. Overall crime fell more in Baltimore than in any other big city. At the same time, shootings by police dropped sharply. But he is not above massaging the truth, as his comment on international trade revealed: \"I am fundamentally opposed  as an American  to secret trade deals that our Congress is forced to vote on before were even allowed to read them.\" In fact, the texts of the trade deals now being negotiated will be public months before Congress has to vote on them. OMalley speaks at the Iowa Democratic Party Hall of Fame Dinner, \"Our economy is not money, our economy is people.\" Published July 21, 2015. (YouTube), OMalley speaks at the Iowa Democratic Party Hall of Fame Dinner, \"Our economy is not money, our economy is people.\" Published July 21, 2015. (YouTube), Stressing his executive record highlights a difference with his rivals. For all her years in public life, Clinton has trouble with the question: What have you actually accomplished? Sanders is the quintessential maverick, better at indicting the system than transforming it. OMalley, 52, has other things going for him. With his athletic frame and thick gray hair, he looks like he walked out of a Cialis commercial. In 2013, The Washington Monthly called him \"the best manager in government today.\", And he seems to enjoy the part of the campaign that involves chatting and posing for selfies with voters. At the nearby White Star Ale House, before the dinner, I arrived 10 minutes early for his \"meet-and-greet,\" only to find OMalley already working a crowd whose numbers would have alarmed the fire marshal. He was still at it when I left an hour later. Does any of this matter in a race against two far more famous candidates? Maybe not. He lacks Clintons money and incomparable name recognition, and he lacks Sanders visceral appeal to the Occupy Wall Street crowd. His narrow path to victory lies in convincing Democrats hes a fresh alternative to the recycled Clinton, but unlike Sanders can be elected. If nominated, OMalley would offer plenty of targets for Republicans, who would portray him as a coal-hating, gun-grabbing abortion rights zealot who has embraced unauthorized immigrants and raised taxes over and over. Rebutting that portrayal is a problem he would love to have. If old-fashioned retail campaigning still works in Iowa  and Rick Santorums Republican victory four years ago suggests it does  his candidacy is more plausible than may be apparent. Its safe to bet that by February, even without a gyrocopter, Martin OMalley will not be ignored. Steve Chapman, a member of the Tribune Editorial Board, blogs at www.chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150722", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-omalley-president-iowa-democratic-perspec-0723-20150722-column.html", "Title": "[ Martin O'Malley: Obscure but not implausible]"}