{"Content": "[ The meltdown in Yemen is pushing the Middle East dangerously closer toward the wider regional conflagration many long have feared would arise from the chaos unleashed by the Arab Spring revolts. What began as a peaceful struggle to unseat a Tunisian dictator four years ago and then mutated into civil strife now risks spiraling into a full-blown war between regional rivals Saudi Arabia and Iran over a country that lies at the choke point of one of the worlds major oil supply routes. With negotiators chasing a Tuesday deadline for the framework of a deal to curb Irans nuclear program, it seems unlikely that Iran would immediately respond militarily to this weeks Saudi airstrikes in Yemen, analysts say. But the confrontation has added a new layer of unpredictability  and confusion  to the many, multidimensional conflicts that have turned large swathes of the Middle East into war zones over the past four years, analysts say. The United States is aligned alongside Iranian-backed militias in Iraq and against them in Yemen. Egypt and the United Arab Emirates, who have joined in the Saudi offensive in Yemen, are bombing factions in Libya backed by Turkey and Qatar, who also support the Saudi offensive in Yemen. The Syrian conflict has been fueled by competition among all regional powers to outmaneuver one another on battlefields far from home. Not since the 1960s  and perhaps going back further  has there been a time when so many Arab states and factions were engaged in so many wars, in quite such confusing configurations, said Frederic Wehrey of the Carnegie Endowment for International Peace. A weapons storage facility in the Yemeni capital Sanaa was targeted by Saudi-led coalition airstrikes on Monday evening. A weapons storage facility in the Yemeni capital Sanaa was targeted by Saudi-led coalition airstrikes on Monday evening. \"Its so dangerous,\" he said. The trigger for this latest flare-up was the march toward the headquarters of Yemens president in the southern port city of Aden by the Shiite Houthi militia, which overran the capital, Sanaa, several months ago. By Thursday, when the Saudi-led coalitions strikes were launched, President Abed Rabbo Mansour Hadi had fled to Riyadh, and the Houthi militia seemed poised to seize control of most of the rest of the country. For Saudi Arabia, which regards itself as the guardian of Sunni interests in the region, the advance of the Shiite Houthis represented far more than a threat to a Sunni ally, analysts say. It was the culmination of years of humiliating Iranian expansion throughout the Middle East that has seen Sunni influence shrink at the expense of Iran and its allies, and Saudi interests seemingly abandoned by the United States, said Mustafa Alani of the Dubai-based Gulf Research Council. The Iranian-backed Hezbollah movement holds sway in Lebanon; Iranian-backed fighters have been instrumental in propping up President Bashar al-Assad in Syria; and in Iraq, Iranian-backed militias now wield power over more territory than the Iraqi army. President Abed Rabbo Mansour Hadi fled Yemen by sea Wednesday as Shiite rebels and their allies moved on his last refuge in the south, captured its airport and put a bounty on his head, officials said. Hours later, Saudi Arabia announced it had begun airstrikes against the Houthi rebels. The departure... President Abed Rabbo Mansour Hadi fled Yemen by sea Wednesday as Shiite rebels and their allies moved on his last refuge in the south, captured its airport and put a bounty on his head, officials said. Hours later, Saudi Arabia announced it had begun airstrikes against the Houthi rebels. The departure... With its intervention in Yemen, Saudi Arabia is serving notice that it will no longer tolerate Irans unchecked expansion  nor will it count on the United States to protect its interests in the Middle East, Alani said. \"It started with Lebanon, then Syria, then Iraq and now Yemen. Its like a domino, and Yemen is the first attempt to stop the domino,\" he said. \"Now there is an awakening in the region, a counter-strategy, and Yemen is the testing ground. It is not just about Yemen, it is about changing the balance of power in the region.\", He blamed the United States and its pursuit of a deal with Iran for the expansion of Iranian influence that triggered the Saudi intervention. \"It is not only the Iranian nuclear bomb that is an issue, it is Iranian behavior that is equal to a nuclear bomb,\" he said. - - -, Another motive cited by Saudi officials for the intervention was the fear that the advance of an Iranian-allied Shiite militia through the mostly Sunni southern part of Yemen might trigger a stampede of support among Yemens Sunnis for al-Qaida  and perhaps even for the Islamic State, or ISIS. The official al-Qaida affiliate, al-Qaida in the Arabian Peninsula, already loosely controls a large swath of the country. Islamic States claim of responsibility for a wave of attacks against Shiite mosques in Sanaa last week suggested the Sunni group is also gaining a foothold there. As Egyptian warships steamed toward the Yemeni coast and the United Arab Emirates joined the Saudi air force in bombing targets in Yemen on Friday, veiled threats from Iran underscored the potential for escalation. An Iranian parliamentarian told the semi-official Fars News Agency that the Houthis possess missiles capable of hitting up to 500 kilometers, or about 300 miles, inside Saudi Arabia. An unidentified official quoted by the agency said the Houthis were preparing to block access to the Bab al-Mandeb strait, which commands access to the Red Sea through which the Egyptian warships are sailing. The United States has pledged that it will act to ensure no interruption to shipping through the strategically vital seaway, which links the Arabian Gulf to the Mediterranean through the Suez Canal. So far however, Irans threats have been largely rhetorical. Analysts doubt Iran would be prepared to jeopardize the substantial influence it has acquired elsewhere in the region for the sake of Yemen, a far lesser prize than Iraq, Syria or Lebanon, where its network of alliances bring access to the Mediterranean and the borders of Israel. In a lengthy speech on Friday night, the Hezbollah leader Hassan Nasrallah poured scorn on Saudi Arabias attempt to influence the outcome of the Yemeni conflict, saying that it is doomed to fail \"because these are the laws of God.\", Nasrallah stressed that he did not speak for Iran, but also said Iranian and Hezbollah viewpoints usually coincide. He suggested that negotiations would be preferable to an escalating war. \"There is still time. There is still a chance. Arab countries . . . instead of becoming partners in spilling the blood of the Yemeni people, let there be an initiative to go to a political solution,\" he appealed. Saudi officials have also indicated they are hoping the strikes will persuade the Houthi leaders to call off their advance and return to talks intended to form a government in which they are represented along with Hadi. Saudi officials said on Friday there were no immediate plans for a ground incursion, though they said one could not be ruled out. But there has as yet been no indication the defiant Houthis are willing to return to the negotiating table, and there is also a risk that the air strikes, which have so far killed dozens of people, will only further polarize Yemen. \"What if the strikes dont stop the advance? A ground campaign is absolutely the last thing the Saudis want. Where is the political track? How will it be formed?\" asked John Jenkins, a former British ambassador to Iraq and Saudi Arabia, who is now the Bahrain-based executive director of the Institute for International and Strategic Studies in the Middle East. Failure to reach a deal in Lausanne, Switzerland, where the Iran nuclear talks are under way, would only further increase the uncertainties, and perhaps encourage Iran to retaliate, he said. \"The negotiations are one of the guarantees that things wont blow up,\" said Jenkins. A failed offensive in Yemen would also risk further empowering extremists, much as the Egyptian and Emirati airstrikes in Libya have served to deepen and widen that countrys civil war, said Wehrey of the Carnegie Endowment. \"Its hard for me to see how the Saudis will bring this to a decisive end that will restore their people in Saana and diminish ISIS and al-Qaida,\" he said. \"In Libya, airstrikes polarized the exisiting civil war and opened the way for ISIS, and Im afraid of the same thing happening in Yemen.\"]", "Date": "20150328", "Author": "[ Liz Sly]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-yemen-conflict-20150328-story.html", "Title": "[ How the Yemen conflict risks new chaos in the Middle East]"}