{"Content": "[ When Terry Frett goes to Pick n Save in suburban Milwaukee for his weekly groceries, he gives the cashier his loyalty card to take advantage of in-store discounts. He then pulls out another card that can cut his grocery bill by an extra $10 to $15. The second card, for a program called Healthy Savings, is an unusual perk offered by UnitedHealthcare. Starting in August, the insurer will begin offering the same benefit to some Chicago-area participants. Insurers often tell their customers to eat healthier and exercise, and they have a financial motive: Promoting health and wellness may reduce illness and medical costs. But its not easy to reach consumers. UnitedHealthcare is trying something different. The nations largest health insurer has launched a digital coupon program with select supermarkets in which members save money when they buy fruits, vegetables, whole-grain bread, lean proteins and other qualified foods. The goal is to make healthier food more affordable, said Craig Bartholomew, vice president of account management in UnitedHealthcares Illinois market. The USDA encourages higher consumption of fruits and vegetables, which are typically more expensive than processed foods. A 2011 study found that purchasing foods that provide important nutrients such as potassium, dietary fiber, vitamin D and calcium could add up to $380 annually to consumers grocery bills. Papa Johns International Inc. is spending $100 million a year to eliminate artificial ingredients and other additives from its menu, underscoring the cost of the restaurant industrys shift to more natural foods. The company removed monosodium glutamate, or MSG, from its ranch dressing last year... Papa Johns International Inc. is spending $100 million a year to eliminate artificial ingredients and other additives from its menu, underscoring the cost of the restaurant industrys shift to more natural foods. The company removed monosodium glutamate, or MSG, from its ranch dressing last year... Public policymakers have made efforts to help consumers eat healthier  food-assistance programs, for example, provide coupons to buy fruits and vegetables. Now the private sector is starting to put its money where its mouth is. Chicago is the second market where UnitedHealthcare is testing the Healthy Savings card. It is working with Jewel-Osco, Marianos and Shop n Save, which have a cumulative 261 locations in Illinois and northwest Indiana. The program is initially limited to customers who bought insurance through an individual exchange or work for a employer insured by UnitedHealthcare. The company says about 100,000 participants qualify for the discount card, representing about 20 percent of its commercial base in Illinois. As in Wisconsin, the discount card is free for Chicago-area customers, Bartholomew said. A company spokesman said the programs administrative costs will not be reflected in premiums. The feedback from Wisconsin, where UnitedHealthcare rolled out the discount card in February, has been positive, Bartholomew said. Whats on the menu? Extremely unhealthy meals. Especially combo platters. The Center for Science in the Public Interest, a watchdog group, is out with its latest list of \"Xtreme Eating\" meals, a summary of some of the high-calorie, high-fat, high-sodium meals at chain restaurants across the United... Whats on the menu? Extremely unhealthy meals. Especially combo platters. The Center for Science in the Public Interest, a watchdog group, is out with its latest list of \"Xtreme Eating\" meals, a summary of some of the high-calorie, high-fat, high-sodium meals at chain restaurants across the United... Melissa Baxter, a communications director at Carroll University in Waukesha, likes that there is no coupon clipping. Every week, she receives a list of discounts via email that are preloaded on her Healthy Savings card. This week, for example, the offers included $1 off a package of organicgirl salad greens and Sunset tomatoes. She also could get $2 off a package of No Name salmon and $2 off Organic Prairie ground beef, ground chicken or ground turkey. Baxter, a mother of three college-aged boys, checks the email before making her weekly shopping list. She said she was \"already pretty picky about looking at ingredients and trying to eat healthy\" but that she did switch some brands because of the discounts. What she likes most about the program is that she receives a 25 percent discount on fresh bulk produce, up to $5 a week. This benefit is not available to everyone in the program; employers have to buy the produce discount. Baxter said the Healthy Savings card trims her weekly grocery bill by $7 to $10. \"Its something I appreciate,\" she said. \"I think any time you have more support to be healthy, thats a good thing.\", UnitedHealthcare doesnt select the products that are on sale every week. The Healthy Savings program was designed by Solutran, a Minnesota-based payments processor with experience in the Women, Infants and Children food-assistance program. In 2012, Solutran began soliciting food manufacturers to include their products in the Healthy Savings program. Food companies reimburse retailers. Solutran coordinates all of the payments. Solutran uses food-rating company Guiding Stars to select products using the companys formula to rate nutritional quality based on information from food labels. Solutran promotes only products that are rated in the top third of each food group, said Chad Kelly, general manager of the Healthy Savings program. Dozens of national brands, from Sara Lee to Ocean Spray, sell items that meet Solutrans criteria. Thats why the weekly promotions have included items like a box of Betty Crockers Ranch & Bacon pasta salad kit even though Betty Crocker is not necessarily the first brand that comes to mind when consumers think of healthy food. Health insurer Medica, another company in the Twin Cities, was the first to buy the discount card for its members. A Medica executive called the program \"unique.\", \"There are a lot of tools available that provide information on healthy eating,\" said Ken Dickson, Medicas director of health strategy and consultation. \"We werent able to find others that reward people for making healthy food purchases.\", Medica also sells the program to employers who have self-funded insurance plans. \"Our customers want this program,\" Dickson said. \"They see investing in people eating healthier is going to be a payoff for them in worker productivity and in their health care costs.\", New studies have cast doubt on whether workplace wellness programs save employers money. But even Al Lewis, a critic of wellness programs, found little to fault with the concept of the Healthy Savings card. \"If they plan to sell something that they are using on fully insured members, then Im all for it,\" said Lewis, CEO of Quizzify, a consumer health education company. In Wisconsin, UnitedHealthcare expanded the program this month to an additional 550,000 participants, including Medicaid beneficiaries and people who receive coverage through self-funded employer health plans. Frett, president of an insurance agency, is selling the Healthy Savings program to employers. He said it costs companies about $5 per employee annually. The program is much cheaper than the health evaluations known as biometric screenings, which can $65 to $70 per employee, Frett said. When hes pitching the Healthy Savings card to clients, he can speak from personal experience. Frett, 56, does most of the grocery shopping in his household. In addition to the savings, the card helps him navigate through the store. \"One time I gave the checkout person my loyalty card and then I gave her my Healthy Savings card,\" Frett said. \"She swiped it and I ended up getting another $15 of savings. She asked me, How do I get one of these? \", asachdev@tribpub.com, Twitter @ameetsachdev]", "Date": "20150730", "Author": "[ Ameet Sachdev]", "Link": "http://www.chicagotribune.com/business/ct-healthy-savings-0731-biz-20150730-story.html", "Title": "[ UnitedHealthcare offers savings for shopping healthy at the grocery ]"}