{"Content": "[ Documents swept up in the raid on Osama bin Ladens compound portray a leader cut off from his underlings, disappointed by their failures, beset by their complaints and regretting years of separation from much of his extensive family. Focus your fighting on America, not each other, the sidelined al-Qaida chief exhorts his followers. In a videotaped will, he urges one of his wives, should she remarry after his death, to still choose to live beside him in paradise. He also directs her to send their son to the battlefield. Despite some surprising quirks in the collection, the overall message of the 103 letters, videos and reports made public Wednesday hews to the terror groups familiar mission: In the name of God, find a way to kill Americans. Kill Europeans. Kill Jews. \"Uproot the obnoxious tree by concentrating on its American trunk,\" bin Laden writes in a letter urging al-Qaida affiliates in North Africa to not be distracted by fighting local security forces and to avoid Muslim infighting. The U.S. Office of the Director of National Intelligence said the documents, released as online images, were among a collection of books, U.S. think tank reports and other materials recovered in the May 2011 raid that killed bin Laden at his compound in Abbottabad, Pakistan. The information was declassified and made public after a review by government agencies, as required by a 2014 law. Hundreds more documents found at the compound will be reviewed for possible declassification and release, the office said Wednesday, four years after bin Ladens death. Al-Qaida leader Osama bin Laden in Afghanistan. Al-Qaida leader Osama bin Laden in Afghanistan. The documents, as translated by U.S. intelligence officials, mix the mundane language of business  personnel training, budget matters, financing for \"workshops and collaborating groups\"  with fervent religious appeals and updates on terrorism plots, all written in flowery language full of praise for God. The documents include a fill-in-the-blanks job application for al-Qaida candidates that not only asks typical human resources questions about education and hobbies but also, \"Do you wish to execute a suicide operation?\" It requests an emergency contact should the applicant become a martyr. Drone strikes against al-Qaida leaders in Pakistan, the near-suffocation of the groups affiliate in Iraq beginning in 2007, and other developments severely undercut bin Laden in the years before his death. The terrorist threat shifted to al-Qaida affiliates in other areas, including in Yemen and North Africa. U.S. officials have said that at the time of bin Ladens death al-Qaida no longer exercised the same level of control he once had. A May 2007 letter to bin Laden from \"the Jihad and Reform Front\" implores him to disavow \"the ongoing catastrophes and disasters\" committed by al-Qaida in Iraq, the forerunner of todays Islamic State group, which strayed from al-Qaidas orders with its brutal attacks on fellow Muslims. \"If you still can, then this is your last chance to remedy the Jihad breakdown that is about to take place in Iraq,\" the letter warns bin Laden. Al-Qaida did reject the splinter group, but the Islamic State kept growing, and after bin Ladens death it went on to seize a swath of Syria and Iraq, killing Muslims and Christians, beheading Westerners and drawing warplanes from a U.S.-led international coalition to the region. At one point, an undated \"Report on External Operations\" presented bin Laden with a litany of excuses for failure to reach al-Qaidas violent goals for the year, including orders to kill Jews. \"First of them was bad luck and God wasnt on our side,\" it says, before running through complaints about a lack of well-trained personnel, poor communications, trouble with transportation, insufficient weapons and difficulty evading security forces. \"We are not asking for a convenient atmosphere to work ... but God knows that we have not done our best to create the correct atmosphere of work to reach our goal,\" the report says. Among the terrorists goals was an operation targeting Americans in Denmark. Three European men were sent to carry out the plan, they report, \"but we have lost our communication with them,\" and they may have been captured. Their plan to overcome these obstacles was to \"use new methods like using house knifes, gas or gasoline or diesel tanks, and other means, such as airplanes, trains, cars as killing tools.\", One letter from bin Laden mocks President George W. Bushs \"war on terror,\" saying it had not achieved stability in Iraq or Afghanistan and questioning why U.S. troops were \"searching for the lost phantom\"  weapons of mass destruction in Iraq. No date is on the U.S. translation. In a video to one of his wives, also described as bin Ladens \"last will,\" he tells her \"you are the apple of my eye, and the most precious thing that I have in this world.\" Bin Laden says he has no objection to her remarrying after his death, \"but I really want for you to be my wife in paradise\" and reminds her that a wife who has married twice \"is given a choice on Judgment Day.\", The documents are full of telling tidbits, such as references to \"anti-crusader devices,\" the al-Qaida term for the homemade explosives that the American military calls improvised explosive devices, or IEDs. The documents were released a week after publication of an article by investigative journalist Seymour Hersh claiming the Obama administration had vastly overstated the importance of materials and files seized in the Abbottabad raid. The Obama administration has denied that claim. Associated Press]", "Date": "20150520", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-osama-bin-laden-documents-20150520-story.html", "Title": "[ Bin Laden papers include loving notes, terrorist application ]"}