{"Content": "[ The School Board of Community Consolidated Elementary District 21 is mulling three options for how to handle music education in sixth grade. For the 150 parents who filled the board room to standing-room capacity during its April 16 meeting, the three options on the table all have a major flaw: they wipe out their childrens small-group music instruction. \"I hope this isnt the swan song,\" said Jennifer Brennan, the mother of a student percussionist. \"Cant there be an Option Zero, where nothing is changed?\", The viability of \"Option Zero\" is unknown, but board members did take an impromptu move. They held off on a decision until they receive more information about how music education impacts the full grade spectrum. With that delay, the consistently award-winning music programs of District 21s three middle schools will remain unchanged for 2015-16. \"You cant un-ring the bell,\" said board member Staci Allan, who supported pushing a decision back until they had a better feel for what the future of District 21 music could sound like. At issue was the practice of pulling sixth-grade music students out of \"core\" classes once or twice a week for instrumental or singing instruction with a teacher and a handful of other students. The extra small-group time helps the bands of London, Holmes and Cooper Middle Schools shine, as shown by their success at Rolling Meadows High Schools renowned Jazz in the Meadows competition in February  Cooper won the middle school division, with Holmes in second place. But board members said they have heard growing concerns from their teachers of English, math, history and such that lost time in their classrooms hurts the young musicians overall growth. \"I dont think Option Zero listens to them,\" board president Bill Harrison said. \"We need to honor the concerns of our core teachers, who have all fairly uniformly spoken,\" he added later. But it was Harrison, noting that the board had no consensus on the music program, who pushed a decision back until sometime in the next school year. In District 21s long-standing \"pull-out\" system, all students are enrolled in a full-time schedule of \"core\" classes reading, writing, math, gym and more. In the older grades, students can overlay their basics with extra instruction in certain disciplines that particularly interest them. Band, orchestra and chorus are among those offerings. Three times in a two-week period  once in one week, twice in the next  those students are \"pulled out\" of a \"core\" class. One week it might be social studies, the next might be science. This gives them a chance to spend an extra period with a pull-out instructor and one or two other students. Several disciplines and grade levels are offered as pull-outs, and during the meeting, the board gave approval to changes in some of those programs. But the board was also studying the pull-out system for sixth-graders in music, and looking at three options for how to change it  all of which would have eliminated the thrice-in-two-weeks extra instruction coming at the expense of core classes. The options do not affect budgeting: None called for hiring, firing, cut-backs of staff hours or additions. At issue is the ancient debate of what effect the study of something extra  and interesting  has on a students grasp of subjects that are integral. Of the dozen parents who spoke in defense of the existing pull-out music system, several said the additional excitement of music gave their students an incentive to keep up with other classes. \"The arts are subjective, and not standardized,\" said Laura McKevitt. \"Do we really want to be part of a district that limits these options?\", Rosemarie Meyer, the assistant superintendent for curriculum and instruction, presented some of the findings of the surveys and focus groups, which included the worries of core-class teachers that time with their subjects cannot be replaced. She pointed out the drop-out rates in sixth-grade music: not every student is meant for the arts, and some of the pull-outs lose half their kids by years end. Board member Phil Pritzker said a program with that kind of attrition needs scrutiny, and board member Arlen Gould asked Meyer for statistics about how sixth-graders would fare without pull-out music. \"Do we have any evidence that they arent doing as well as they might otherwise do?\" he asked. Meyer said she had not such data. After more than an hour of discussion, Harrison advised the staff to hold off on sixth-grade music changes. He said after the meeting that the subject will come up again sometime in the next school year which will likely prompt a return from still-concerned parents. rwachter@pioneerlocal.com]", "Date": "20150420", "Author": "[ Ronnie Wachter]", "Link": "http://www.chicagotribune.com/suburbs/buffalo-grove/news/ct-bgc-21-music-tl-0423-20150420-story.html", "Title": "[ District 21 keeps sixth-grade music format, for now]"}