{"Content": "[ According to polls, the No. 1 thing Donald Trumps fans like about him is that he tells it like it is. I think his fans are wrong about this. But thats a column  actually a lot of columns  for another time. It is true, however, that there is something refreshing about the way Trump talks. Its not actually candor, though lots of people mistake it for that. Rather, hes unfiltered. The one thing you can be sure of is that he hasnt consulted with a political consultant about how to talk. He doesnt worry what the liberal editors at The New York Times or The Washington Post  or, for that matter, the conservative editors at National Review  think of him. Id be willing to bet that if theres a single newspaper in the country that Trump cares about, its The New York Post. The Big Apple narcissus has spent his entire career looking for his reflection on Page Six of New Yorks true paper of record. And thats because the Post actually cares about not only informing its readers but entertaining them as well. Its no-holds-barred, New York tabloid style comes closest to Trumps own way of talking. His recent rant about former Rep. Anthony Weiner being a sleazeball and a perv was not only accurate, but it reflects the way normal people talk. Thats refreshing. I wish more Republicans would take the hint. Every couple of years I write a column on the infuriating habit Republican politicians have of reading their own stage direction. I dont revisit the topic for lack of other issues to write about; I keep coming back to it because Republicans just cant help themselves. The worst offender was George H.W. Bush, a thoroughly decent and committed public servant who was always uncomfortable with the demands of the TV age. He was better suited to the 19th century style of politics, where you didnt have to connect emotionally with millions of people in their living rooms. Out of frustration, hed often cut to the chase and tell people how he wanted to be perceived. The 2016 campaign picture is crowded, jumbled and still coming into focus. But one thing is already clear: Theres a big hole in the middle, and it looks like a silhouette of Elizabeth Warren. Hillary Clinton has problems: She doesnt really inspire most Democrats, she offers no compelling rationale... The 2016 campaign picture is crowded, jumbled and still coming into focus. But one thing is already clear: Theres a big hole in the middle, and it looks like a silhouette of Elizabeth Warren. Hillary Clinton has problems: She doesnt really inspire most Democrats, she offers no compelling rationale... When he ran against Bill Clinton  a man capable of crying on cue if you just told him which camera to look at  Bush was hopelessly outmatched. So he simply proclaimed, Message: I care. Bob Dole, another old-school politician, had the same problem. He once said at a meeting of the Republican National Committee, If thats what you want, Ill be another Ronald Reagan. His aides told the press that his strategy was to act presidential. Jeb Bush has the same tendency. In 2014, he told people he would only run for president if he could do so joyfully. The problem is that hes good at telling but pretty bad at showing. To date, hes displayed all the joy of a man waiting to get called for his colonoscopy. But all of the professional politicians have this problem to one extent or another. Chris Christie talks about how he tells it like it is as often as he actually tells it like it is. There are a few existential questions that man has struggled but failed to answer conclusively, despite Sisyphean efforts, such as: Why are we here? What happens when we die? And why do kids go ape for \"Frozen\"?, To these we may add another, which will go down as one of the great enigmas of modern... There are a few existential questions that man has struggled but failed to answer conclusively, despite Sisyphean efforts, such as: Why are we here? What happens when we die? And why do kids go ape for \"Frozen\"?, To these we may add another, which will go down as one of the great enigmas of modern... Christie recently told Tonight Show host Jimmy Fallon about his plans for the next GOP debate: Stay tuned on Sept. 16th. We may be changing tactics. If the moderators ask 15 questions in a row without asking Christie any, the New Jersey governor explained, youre going to go, Uh oh, hes going to go nuclear now. If you have to tell people that going nuclear is just a tactic, it makes going nuclear seem a hell of a lot less authentic. Ohio Gov. John Kasich has a policy of not attacking Hillary Clinton. Thats weird enough. But he also feels compelled to explain that his refusal is a tactic. Ted Cruz, Marco Rubio, Mike Huckabee, Scott Walker et al. cant resist telling audiences about the importance of being optimistic. Why not just try being optimistic? Voters will notice. I promise. There are many reasons the non-politicians  Trump, Ben Carson and Carly Fiorina  are doing so well, but near the top is the fact that they havent internalized the language of political consultants and pundits. They understand something the politicians have forgotten: Politics is about sales. Good salesmen dont say, I need to sell you this car today because I need to make my quota. They also dont say, I need to convince you that you need this car even though its more than you think you can afford. That may be their motivation, but they concentrate on the actual convincing. Tribune Content Agency, Jonah Goldberg is a fellow at the American Enterprise Institute and a senior editor of National Review. goldbergcolumn@gmail.com, Twitter @JonahNRO]", "Date": "20150902", "Author": "[ Jonah Goldberg]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-entertaining-salesman-20150902-column.html", "Title": "[ What the other GOP candidates can learn from Donald Trump ]"}