{"Content": "[ Kentucky U.S. Sen. Rand Paul brought his presidential campaign to Chicago on Wednesday, appealing to African-Americans on the South Side, entrepreneurs downtown and Republicans in the suburbs. On a stage set up on a blacktop parking lot in front of an American flag mural at 66th Street and South King Drive, Paul continued a unique approach for GOP White House contenders  making an appeal to African-Americans who tend to favor Democrats. Paul opened his speech by referring to the \"black lives matter\" refrain used by protesters after the controversial deaths of African-American men at the hands of police. Paul said the phrase reminds him of the deaths of Eric Garner, who was choked to death by officers in New York, and Freddie Gray, who was fatally injured in police custody in Baltimore. But Paul said the phrase also has meaning in Chicago. \"When I hear people say, Black lives matter, I think of Jacele Johnson, who is 4 years old and got shot this weekend just a few blocks from here,\" Paul said of the Englewood girl who doctors say is swiftly recovering after being shot on the left side of her head Friday night outside a family gathering. \"You may be saying to yourself, Why is this white guy saying black lives matter, what does he know about crime in my neighborhood? Well, Ive got crime in my neighborhood too.  Weve got some kind of thing going on in our country, and we need to come to grips with it.\", Paul then talked about a horrific 2011 case in his home state. \"In my little town in Kentucky, a white woman cut a baby out of another white woman. \"There is crime going on all across America. It is not a racial thing, it is a spiritual problem,\" Paul said. \"I think government can play a role in public safety, but I dont think government can mend a broken spirit. Government cant provide you salvation, government cant save you.  Ultimately, salvation is something you accept yourselves.\", Sen. Rand Paullaunched his 2016 presidential campaign Tuesday with a combative challenge both to Washington and his fellow Republicans, cataloguing a lengthy list of what ails America and pledging to \"take our country back.\", Pauls fiery message, delivered in his home state of Kentucky before... Sen. Rand Paullaunched his 2016 presidential campaign Tuesday with a combative challenge both to Washington and his fellow Republicans, cataloguing a lengthy list of what ails America and pledging to \"take our country back.\", Pauls fiery message, delivered in his home state of Kentucky before... A white, libertarian Republican senator from the South urging African-American voters in an impoverished, heavily Democratic neighborhood on the citys South Side to look within themselves to \"find your inner grace\" isnt a typical scene in a GOP presidential bid. Paul, though, isnt running a conventional campaign. His stop in Chicago came a day after the release of his book \"Taking a Stand,\" in which he makes the case for a new, more inclusive Republican Party, proclaiming the \"Republican brand sucks.\", On Wednesday, Paul sought to bring that theme to the stump. He advocated for reclassifying nonviolent felonies to misdemeanors as part of his call to end \"mass incarceration\" in America. \"Weve got to rethink the war on drugs. Weve got to find a better way,\" Paul said. \"Weve got to treat drugs as a health problem, not an incarceration problem.\", Paul also called for providing \"second chances\" for felons to vote and seek jobs. And he pitched a tax-cutting program for businesses in low-income areas. \"If you want more jobs in your communities, if you want more businesses in your communities, we cant keep doing the same thing,\" Paul said. \"For years, weve had this war on poverty, and all we have is more poverty.\", Paul proposed what he called \"economic freedom zones\" to dramatically lower corporate and income taxes for businesses in impoverished areas while also cutting the payroll taxes of their employees. He said the program would represent a $400 million tax cut for South Side businesses and could have prevented a nearby McDonalds from closing. The presidential candidates appearance was organized by the Rev. Corey Brooks, the pastor of New Beginnings Church of Chicago who backed Republican Gov. Bruce Rauner last year. Paul has hired Chip Englander, Rauners campaign manager, to run his presidential campaign. Later, appearing at a question-and-answer session at the tech incubator 1871 in the Merchandise Mart, Paul again touted his \"economic freedom zone\" proposal, saying tax cuts tied to business creation and hiring would provide incentives for economic development in downtrodden neighborhoods. \"My idea is not to take money from Washington and send it to the South Side of Chicago, but take money from the South Side of Chicago and never send it to Washington,\" Paul said. At an afternoon session sponsored by the conservative Illinois Policy Institute, the senator also answered a question on his recent push to allow portions of the Patriot Act to expire and thus end the mass collection of cellphone data from the government for surveillance. Pauls recent Senate filibuster on the issue has drawn criticism from hawkish Senate Republicans and fellow presidential contenders, including New Jersey Gov. Chris Christie. On Wednesday, Christie said Pauls position equates to having sided with Edward Snowden, who leaked classified information about the National Security Agencys surveillance. \"Im not against spying. Im just against spying indiscriminately against Americans,\" said Paul, who argued such phone data should not be turned over under general warrants to phone providers, but ones for specific people, reviewed by a judge. \"Im not against surveillance and Im not against attacking terrorists,\" Paul said. \"I want the check and balance of the government, or the police, having to call a dispassionate judge.\", Paul wrapped up his day by giving the keynote speech at the DuPage County Republican Partys Lincoln Day Dinner in Lisle, receiving a standing ovation from about 500 as he was introduced to an instrumental version of Survivors \"Eye of the Tiger.\", During his 30-minute speech, Paul talked foreign policy, noting that many GOP presidential candidates have been asked in recent days if in hindsight they would have invaded Iraq, a not-so-veiled reference to Jeb Bushs recent struggle to answer the question. Paul, who has opposed U.S. involvement in many foreign conflicts, said \"without question, no,\" he would not have invaded Iraq. But he also argued Democratic front-runner Hillary Clinton should be facing the same questions about U.S. involvement in ousting Libyan dictator Moammar Gadhafi and her handling of the lead-up to and fallout from the attack on the U.S. compound in Benghazi. \"If theyre going to ask Republicans questions, we need to ask Hillary Clinton, If you had to do it over again, would you topple Gadhafi in Libya? Libya is now a failed state,\" Paul said. \"A failed state is a strong word for a really, really bad situation. Its a jihadist wonderland.  When you allow chaos, you get radical Islam.\", Paul, though, closed his speech on his partys future at home, giving a blunt assessment of the GOPs outreach efforts. \"We have to be a party that has hope and has a cheerful message that says everyone is welcome. We dont have to change our policy, we have to change our attitude,\" Paul said. \"If you talk to a lot of young African-American men or women, theyll say, Youre a Republican, you dont like me. Its the same with Hispanic voters, with almost any minority you can think of. Weve got to conquer that with a better attitude, which is so much more important than policy.\", Pauls trip wasnt all about campaign speeches. He did some fundraising while in town, but his campaign declined to say how many fundraisers he attended, where they were or who hosted them. bruthhart@tribpub.com, Twitter @BillRuthhart]", "Date": "20150528", "Author": "[ Bill Ruthhart]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rand-paul-chicago-visit-met-0528-20150527-story.html", "Title": "[ Rand Paul in Chicago: Crime 'not a racial thing, it is a spiritual problem']"}