{"Content": "[ Did Denny Hastert, former speaker of the U.S. House of Representatives, really think he could get away with it?, He must have. He kept paying and paying, until the FBI came knocking, asking about all that cash he was withdrawing from his bank accounts. And you know the rest. Whether you consider it hush money to cover up sexual misconduct when he was a teacher and coach, or an attempt to right what he considered to be the wrongs of his past, theres one thing we do know:, It was no accident. And now Hasterts sins buzz around him like wasps on meat. Hastert isnt naive. Hes spent a lifetime using leverage to get what he wants. As speaker, he traded support for war for congressional earmarks to make his Republican colleagues look good. The Republican Party has yet to recover from that arrangement. Still, he knows about power. So it is impossible to think of him as a hapless victim. Dennis Hastert is a Republican boss of the infamous Illinois Combine that has run this politically corrupt state. Indicted former U.S. House Speaker Dennis Hastert was paying off a man to conceal sexual abuse from decades earlier, when Hastert taught and coached at a high school in Chicagos far west suburbs, federal law enforcement sources said Friday. Federal agents also have interviewed a second person... Indicted former U.S. House Speaker Dennis Hastert was paying off a man to conceal sexual abuse from decades earlier, when Hastert taught and coached at a high school in Chicagos far west suburbs, federal law enforcement sources said Friday. Federal agents also have interviewed a second person... As such, Hastert even tried to influence the selection of federal prosecutors and prevent politically independent outsiders from wielding federal subpoena power. I know he says otherwise. Thats his public stance. And heres mine: He pushed and a few of us pushed back hard, and readers of this column pushed back even harder, and he dropped it. He lost that public battle to the conservative Republican reformer, Sen. Peter Fitzgerald, and to those of us who supported Fitzgerald against the Combine. Fitzgerald got his choice for the top federal prosecutor here. And top aides to the mayor of Chicago went to prison and Outfit bosses, too, and all sorts of political figures who fed off the public trust. Governors, too, went away. The Republican governor is now out of federal prison. And the Democratic governor  who let top Illinois Republican Party guys wet their beaks in pension cash  is still in prison. Hastert knows all this. He knows the players. He wasnt accused of wrongdoing, but he was there, watching. More than 100 times in 2 1/2 years, former U.S. House Speaker Dennis Hastert withdrew cash from his bank accounts to pay down a $3.5 million hush-money bargain, federal prosecutors say. They dont say why. The formal charges against the affable Illinois Republican are as baffling as they are astonishing.... More than 100 times in 2 1/2 years, former U.S. House Speaker Dennis Hastert withdrew cash from his bank accounts to pay down a $3.5 million hush-money bargain, federal prosecutors say. They dont say why. The formal charges against the affable Illinois Republican are as baffling as they are astonishing.... Yet through his mouthpieces and spinners, hes presented as an \"aw shucks,\" down-to-earth high school wrestling coach, a guy who likes to work on his own cars. But there isnt anything aw shucks about him. He was installed in Congress for one thing: To deliver. And he delivered. And he certainly must have known it would end this way:, Disgrace upon his family name; shame for himself if hes still capable of feeling it; a sad end to a long political career. And when the FBI came knocking  asking him why he withdrew $1.7 million in cash  Hastert said, allegedly, that he kept that cash. He told them, according to his indictment, that he didnt trust banks, so he had to gather that cash and keep it safe. \"Yeah,\" Hastert said. \"I kept the cash. Thats what Im doing.\", No, what he was doing, law enforcement sources say, was paying off a man whos known Hastert for years, back to the days Hastert was a wrestling coach at Yorkville High School. The indictment states that Hastert was prepared to pay $3.5 million to compensate the other man for certain, unspecified wrongs. \"It was sex,\" a federal source told reporters Friday, adding that the payments had \"nothing to do with public corruption or a corruption scandal.\", Im told Hastert could have kept the entire thing covered up, if hed gone to certain lawyers, the kind who are practiced in paying off sexual partners. The technical problem, if youve followed the story, is that Hastert set off alarm bells by first withdrawing too much at one time, and later, by consistently withdrawing less than $10,000. And Im sure there are lawyers good enough to arrange hush money payoffs and call it legal. Thats what they do. But Hastert didnt go to the lawyers known for this work. He didnt trust them. If he had, then his secret would have been theirs and apparently, he couldnt handle it. So he did it himself. And though Im speculating here, I think we can see why:, He was ashamed. An odd thing about this is that it apparently happened years and years ago, back in his wrestling coach days. And still he was willing to pay $3.5 million. That means there is proof of it somewhere, which means the proof ostensibly existed when Hastert was speaker of the House. When he was second in succession to become president. It was secret. But now his family knows and his friends. His lobbying firms have dropped him. Hes been knocked off various paid boards. And we wont seethat planned $500,000 statue of Hastert in Springfield. Our politicians never get enough of honoring themselves, do they?, Unfortunately, we wont see an old Denny in white marble, with his comb-it-forward Caesar look, like the bust of actor Charles Laughton, who played a Roman senator in \"Spartacus.\", We wont see a bronze of young Denny, as Yorkville High School wrestling coach. But will we ever see the political class setting $500,000 aside to commission a statue of Fitzgerald, who led the fight to install politically independent federal prosecutors in Illinois?, I dont think so. In American politics, some things are just not done. NOTE: Would you like to have coffee with me and talk about this column or any others? Great. Then please join me at the Printers Row Lit Fest, 10 a.m. Sunday, June 7, at the Good Eating tent. See you there. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150529", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-hastert-met-0531-20150529-column.html", "Title": "[  Dennis Hastert and the Illinois Combine]"}