{"Content": "[ Celebrating All That Is Feminine (C.A.T.I.F.) is a Palatine-based non-profit that raises funds for organizations that support, empower and encourage women and children in crisis.----Since 2009, Palatine-based C.A.T.I.F. (Celebrating All That Is Feminine) has raised nearly $130,000 and then donated to the funds to established non-profits whose mission mirror that of its own: to encourage and empower women and children in the Chicagoland area who are experiencing crisis. On Sunday, September 13, 2015, C.A.T.I.F. will hosts it 5th annual Family Picnic Rib Cook-Off fundraiser on Station Street in downtown Palatine. Charity beneficiaries include the ROLE program at the Palatine Opportunity Center and the Well of Mercy. \"We invite area residents to join us for our 5th year event - C.A.T.I.F. truly celebrates the opportunity we all have to help others who need a hand up, those who are going through dark times but can improve their circumstances with some support,\" said Kara Cermak, C.A.T.I.F. president and founder. The event will include live entertainment from the band Unconstitutional, with appearances by Bag O Jammers and Hard Lockdown. A wide array of family-friendly activities also will be available, including a bouncy house and dunk tank and lots of entertainment for the kids. A Rib Cook-Off contest will be held - the winner will claim a cash prize and bragging rights until next years event!, For those who want to cheer on the Chicago Bears as they battle the Green Bay Packers, the game will broadcast live on a big screen TV during the event. Admission is free, and food and entertainment tickets are $1 each. Sponsorship opportunities are currently available. Over the last five years, the Family Picnic and Cook-Off has drawn hundreds of area residents. Sponsorship opportunities are currently available to area businesses. Over the last five years, the Family Picnic and Cook-Off has drawn hundreds of area residents to this event. For more information, visit www.CatifCharity.com. Charity beneficiaries: The ROLE program at POC provides services for women who live in abusive homes and are working toward becoming safe, independent and healthy. POC provides education, employment opportunities and encourages these women to become leaders in their community.The Well of Mercy provides caring and cooperative home environments to single, pregnant women who have no place else to turn for support. These women and provided with education and support so that they become empowered as future mother and contributors to society. About C.A.T.I.F. Celebrating All That Is Feminine is a Palatine, Illinois-based not-for-profit public charity which was founded in 2009. The organization achieved its official 501 (c) (3) charitable organization status is 2012. Over the last six years, C.A.T.I.F. has raised nearly $130,000 from a purely grass-roots level for other non-profits whose mission mirrors that of its own:, \"To encourage and empower women and children in the greater Chicagoland area who are experiencing crisis. The ways in which these aims are accomplished are by raising funds that in turn, are donated to established organizations dedicated to assisting these populations in their greatest time of need.\", This item was posted by a community contributor. To read more about community contributors, click here.]", "Date": "20150809", "Author": "[ Community Contributor VP Public Relations]", "Link": "http://www.chicagotribune.com/suburbs/barrington/community/chi-ugc-article-attend-family-picnic-and-rib-cook-off-in-nw-s-2015-08-09-story.html", "Title": "[ Attend Family Picnic and Rib Cook-Off in NW Suburb Sunday, September 13]"}