{"Content": "[ Moving beyond rhetoric, Republican Gov. Bruce Rauner on Monday issued an executive order that aims at absolving state workers who dont want to join a union from paying fees that support collective bargaining. The new governors decree effectively attempts to impose right-to-work rules on public employees, an idea Rauner and his pro-business allies also are pursuing for private-sector unions. Anticipating a strong pushback from organized labor, Rauner filed a pre-emptive federal lawsuit in Chicago seeking to have his decision declared legal. But the move likely will spark additional court battles as unions quickly decried the effort as an illegal abuse of power. Its also possible Democratic lawmakers could vote to overturn Rauners executive order. Under state law, employees can decline to join a union but are still on the hook for fair share fees related to collective bargaining and contract negotiations. The idea is that if all employees are getting the benefits from a new contract, everyone should contribute to the cost. Illinois statute prohibits those fees from being used to support political activities, but Rauner contended its nearly impossible to draw a distinction because public sector unions directly negotiate with the government. Government union bargaining and government union political activity are inextricably linked, Rauner said. As a result, an employee who is forced to pay unfair share dues is being forced to fund political activity with which they disagree. That is a clear violation of First Amendment rights and something that, as governor, I am duty-bound to correct. As Republican Gov. Bruce Rauner sets his sights on limiting the influence of unions in Illinois, hes pushing an idea hes dubbed \"empowerment zones\"  areas across the state where voters could decide if workers in their communities should be forced to join a union or pay associated dues. Its... As Republican Gov. Bruce Rauner sets his sights on limiting the influence of unions in Illinois, hes pushing an idea hes dubbed \"empowerment zones\"  areas across the state where voters could decide if workers in their communities should be forced to join a union or pay associated dues. Its... The Republican further argued that the fees were a critical cog in the corrupt bargain that is crushing taxpayers, saying they helped finance wage and pension packages that contributed to the states massive debt. Unions say attempts to limit fair share fees are aimed at dismantling their power, saying that fewer dollars means they wont have the resources to negotiate as strongly, leading to fewer rights for workers at the benefit of employers. They countered that Rauner is blaming those who care for some of the states most vulnerable for the states budget issues, calling it a paper-thin excuse that cant hide his real agenda: silencing working people and their unions who stand up for the middle class, said Roberta Lynch, executive director of the American Federation of State, County and Municipal Employees Council 31, the largest state employee union. Bruce Rauners scheme to strip the rights of state workers and weaken their unions by executive order is a blatantly illegal abuse of power. Meanwhile, Democrats questioned Rauners desire to pick such a big fight so soon after calling for bipartisanship to work through the states many problems, including the need to find money to keep child care programs running and pay prison workers. Id like to try and focus on the budget at this time and not have to have these type of squabbles, said Democratic Rep. Jay Hoffman of downstate Swansea, who is House labor chairman. I remain hopeful that we can get that done, but these type of actions unfortunately dont make it any easier. Rauners executive order follows his call last week for banning campaign contributions by unions and a push for what hes dubbed empowerment zones, areas across the state where voters could decide if workers in their communities should be forced to join a union or pay related dues. Its a tweak on what is more commonly called right to work  rules put in place at a statewide level to prevent unions from receiving those fees. But that proposal only applied to private sector unions, and Rauners action Monday indicated hes also willing to challenge the power of government unions that backed his Democratic predecessor during the fall campaign. Rauners move is a nod to similar action by one of his political idols, former Indiana Gov. Mitch Daniels, who in 2005 used his executive power to eliminate collective bargaining rights for state workers. Daniels was able to act unilaterally because those rights had never been written into state law. While collective bargaining is guaranteed by the Illinois Constitution, Rauners executive order could serve as a warning shot to AFSCME as negotiations begin ahead of expiration of the unions contract on July 1. Rauner predicted his moves would create some bumps along the way but said he was confident he was doing the right thing  the fair thing for the people of Illinois. Rauners legal strategy draws on a U.S. Supreme Court decision last year in a case involving Illinois home health care assistants. In that case, lawyers argued that the workers, who were designated public employees and organized by the Service Employees International Union, were not true state employees and therefore couldnt be required to pay the union fees. By a 5-4 majority, the justices agreed, and ruled that compelling the home health care workers to pay union fees violated the First Amendment. The justices stopped short of ruling on the larger question of whether any public-sector workers can be compelled to pay the fees. The five-member majority definitely left the door wide open for a constitutional challenge of public employee forced dues, said Patrick Semmens, vice president for public information at the National Right to Work Legal Defense Foundation, which brought the suit. Probably half of that opinion is about that issue, which they ultimately didnt even decide in the case. But (there was) a lot of language in there saying ... We want to talk about how this is a problem. Mandatory union fees were upheld by the Supreme Courts 1977 decision in a Detroit school board case that concluded fair share dues were constitutional as long as the fees were not used to support a unions political activities like lobbying or campaign contributions. But in ruling on the 2014 home health care case, Justice Samuel A. Alito argued that the courts analysis in the Detroit case had been questionable on several grounds. In the public sector, core issues such as wages, pensions and benefits are important political issues, but that is generally not so in the private sector, Alito wrote. In the years since (the ruling), as state and local expenditures on employee wages and benefits have mushroomed, the importance of the difference between bargaining in the public and private sectors has been driven home. That argument was mirrored by Rauners team in its lawsuit filed Monday. The suit asserts that indeed, the significant impact that Illinois public sector labor costs have imposed and will continue to impose on the states financial condition clearly demonstrates the degree to which Illinois state employee collective bargaining is an inherently political activity. Rauners suit joins another case brought by union opponents in California that was appealed to the U.S. Supreme Court this year. That suit was brought on behalf of an Orange County, Calif. elementary school teacher, who objects to being required to pay about $650 a year to the teachers union. The governor estimated that of 46,573 state workers covered by collective bargaining, about 6,580 are not in a union but pay an average of $577 a year in fees. That money will be put into a special account until a final court ruling, when Rauner said it would then be returned to workers if he prevails. Tribune reporter Jessie Hellmann contributed. Geiger reported from Chicago. mcgarcia@tribpub.com, kgeiger@tribpub.com, rlong@tribpub.com]", "Date": "20150210", "Author": "[ Monique Garcia, Kim Geiger, Ray Long]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-bruce-rauner-tries-to-block-fees-for-state-workers-who-dont-want-to-join-union-20150209-story.html", "Title": "[ Rauner moves to exempt public workers from paying union fees]"}