{"Content": "[ OHare International Airport doesnt need to replicate Singapores Changi Airport to become world-class. But its landlord  the city of Chicago  should recognize that OHare has problems. \"OHares terminals are cramped. You really notice it when you discover there is nowhere to sit, nowhere to read, nowhere to eat the sandwich you just purchased, said Michael Fieweger, who chairs the Global Connections Council at the Chicagoland Chamber of Commerce. Fieweger, an attorney who travels internationally on business, said he worries about the opinions of foreign travelers who may have a four-hour flight layover at OHare. \"Your view of Chicago is, I had to sit on the ground in a crummy little place,\" Fieweger added. \"This is not a good way to show our city., OHare does have room to grow. The annexation of land from Bensenville and Elk Grove Village for the ongoing runway expansion project means OHare has space to create a more welcoming experience for travelers. But the city and the major airlines serving OHare remain deadlocked over how to proceed. Despite the citys opposition, the carriers have insisted on postponing the final phase of airfield additions and put off building new terminal space, including proposed passenger facilities and aircraft gates on the west side of the airfield, until consensus is reached about the need for them. Chicago and this tiny but financially powerful city-state in Southeast Asia both showcase themselves as \"a city in a garden draped by a dazzling skyline. Both are home to airport expansion projects aimed at revving up their global profiles. But the similarities end there. OHare International... Chicago and this tiny but financially powerful city-state in Southeast Asia both showcase themselves as \"a city in a garden draped by a dazzling skyline. Both are home to airport expansion projects aimed at revving up their global profiles. But the similarities end there. OHare International... OHare has used the former military side of the airport to consolidate cargo facilities onto a multibuilding site containing about 820,000 square feet of storage. In addition, politicians and business executives in DuPage County are hopeful that work to finish the long dormant Elgin-OHare Expressway, possibly creating a western route into OHare one day, will spur construction of gas stations, hotels, restaurants and other aviation support services along the corridor. But progress would appear to hinge on future construction on the west side of the airport. Construction of two new OHare runways since 2008 to ease flight congestion hasnt yet solved a chronic delay problem, even more troubling because the annual number of flights today is much lower than it was 10 years ago. Through November of last year, OHare was dead last for on-time arrivals among the busiest U.S. hub airports, and second to last (ahead of Midway Airport) for departures. OHare, which this year is marking 60 years of regularly scheduled airline service, commands some of the highest airline fees in the U.S. because of the airports dominant position. But those high fees contribute to the friction between the city and the carriers when it comes time to ask the airlines to invest in OHares facilities. United Airlines and American Airlines sued the city four years ago over its financing strategy to move forward on the OHare runway expansion project and defer payment on that investment until later. Some construction resumed after the U.S. Department of Transportation increased federal funding, but the one-time infusion of several hundred million dollars did not resolve the basic disagreement. The ongoing standoff at OHare \"suggests that the incentives are not aligned for one or both parties to be interested in solving the problem, said Joshua Schank, president and chief executive officer of the Eno Center for Transportation, a nonpartisan think tank in Washington that promotes policy innovation. He said airlines are \"nervous about airports using money that is paid by their passengers (through taxes and fees) on improvements like new terminals that their competitors will use., But ultimately, as the de facto airport landlord, \"it is the job of the city to decide what people want from the airport, what their mission is and what they want to achieve, Schank said. While he said there is no dispute that Changi is a world-class airport, Schank pointed out that decision-making appears to be much easier in countries run by authoritarian and semiauthoritarian governments as opposed to the U.S. where there is much less centralized planning. At Changi, airport officials and representatives from the airlines work together \"like two hands clapping, said Tan Lye Teck, executive vice president of airport management for Changi Airport Group, the government-owned corporation that operates the airport. Changi, a shoppers paradise like Singapore itself, attempts to minimize airline charges associated with infrastructure improvements, officials said. In the equivalent of U.S. dollars, annual retail sales at Changi total roughly $1.5 billion from 350 retail stores and 120 food and beverage outlets, according to the airports budget report. Most of the rental charges and other fees the airport collects from vendors are reinvested to subsidize airport operations, officials said. In comparison, concessions sales at OHare in 2014 totaled $432.6 million, up from $389 million in 2013, according to the Chicago Department of Aviation. At OHare, there are 84 retail outlets and 122 food and beverage locations. The ability to count heavily on nonaviation revenue helps Changi management to not only hold down landing fees and other charges paid by the airlines but also to offer incentives for the carriers to increase their passenger traffic through the airport, officials said. Some aviation experts suggest that airports in the U.S. are at a competitive disadvantage because they were built when there were fewer air travelers and not as many amenities offered anywhere. No major airport has been built in the U.S. since Denver International Airport opened in 1995, replacing Stapleton International. \"Elsewhere in the world they are building airport infrastructure for the first time and wherever they want, regardless of public opinion, said John Carpenter, who was a top executive at American Airlines for 20 years and, more recently, was a senior public policy adviser at the Chicagoland Chamber of Commerce. \"Its not as easy to build a new airport here, and therefore its harder to keep up with the competition., Hani Mahmassani, director of Northwestern Universitys Transportation Center, suggested that Chicagos next aviation commissioner bring in a team of \"user experience architects, transportation behavior experts and marketing consultants \"to make OHare more beautiful and more symbolic of what Chicago really is. It would not be a bad investment to at least go through that exercise, re-examine the entire user experience and implement solutions., One of OHares biggest advantages is that it sits in the heart of the U.S. and currently offers more than 130 daily nonstop flights to more than 60 international destinations. Thats a result of the air service and airline partnerships built up by Chicago-based United and American, headquartered in Fort Worth, Texas. The two carriers OHare operations constitute the only dual airline hub at a U.S. airport. And with Southwest Airlines essentially operating a hub at Midway Airport, Chicago is in a class of its own in this respect. \"Everyone else in the U.S. would kill to have the hub position that OHare has, said Fieweger, the Global Connections Council chairman. \"The issue is not to squander it. You must clean up the terminals, get more seating, get rid of the airport mystery food  basically enhance the overall experience of OHare passengers to make it consistently easier to get in and out of the airport and easier for airlines to do business at OHare., jhilkevitch@tribpub.com, Twitter @jhilkevitch]", "Date": "20150227", "Author": "[ Jon Hilkevitch]", "Link": "http://www.chicagotribune.com/news/globalcity/ct-ohare-problems-chicago-sidebar-met-20150227-story.html", "Title": "[ O'Hare's problems surmountable -- if city will face up to them]"}