{"Content": "[ Homeowners appealing their Cook County property tax assessments now can complete the entire process online, officials announced Monday. Appeals of assessments  which are used to determine property tax bills  were first accepted online four years ago. But homeowners and other property owners now can upload all of their backup documents to the Board of Appeals website instead of mailing in paperwork or dropping it off at board offices. As the appeal evaluation wends its way through the system, property owners will be able to track the progress, said Larry Rogers, a tax appeals commissioner. \"What weve done is completely re-engineer our process,\" said Commissioner Dan Patlak, the boards chairman. \"Its going to be more efficient, its going to be more transparent and its going to be more convenient for taxpayers.\", To use the online system, property owners must have an email address and access to a computer. Those who dont can still go to board offices to file their paperwork. There also will be internal advantages with the new system. Instead of rolling around carts of voluminous files among the three board commissioners and their analysts, all of the work will be done on computers, reducing the need for warehouse space and employee overtime, Commissioner Michael Cabonargi said. The improvement comes at a three-year cost of $781,000 under a competitively bid contract with DataBank, officials said. About 319,000 county property owners appealed their 2014 assessments after 428,000 did so the year before. On Monday, the board began accepting appeals of 2015 assessments. On hand to herald the announcement was County Board President Toni Preckwinkle, who has worked with the appeals board, county assessor, clerk, treasurer and recorder of deeds to speed up the property tax billing process. All of those officials also have set up a one-stop property tax website at www.cookcountypropertyinfo.com. hdardick@tribune.com, Twitter @ReporterHal]", "Date": "20150803", "Author": "[ Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cook-property-tax-appeals-met-0804-20150803-story.html", "Title": "[ Cook County homeowners can now complete property tax assessment appeals online]"}