{"Content": "[ Some residents on the north side of Main Street in Calumet Township would love for Griffith to offer them a lifelong commitment. Musetta Yaeger, who lives in the Koedykers Oak Crest Manor subdivision, asked the Griffith Town Council at its Tuesday night meeting if the town would consider annexing the 10 to 12 houses on that side of of the street. The subdivision is neighbor to construction company Walsh & Kelly, which is currently working with the town to install water and sewer utilities. Town Council President Rick Ryfa said the town wouldnt be opposed to annexing, saying the town would \"like the taxes on\" Walsh & Kelly as well as the houses. But annexation wouldnt necessarily be a slam dunk; the town would have to go before the city of Gary to get permission, according to Town Attorney Bob Schwerd. \"According to the state, any land thats within two miles of the closest city, you need to get permission to annex. We had to several years ago when we annexed land south on Colfax,\" Schwerd said. \"Wed also need to have an engineering analysis done in the area.\", Later, during the meetings public portion, resident Michael Reese took the town to task for entertaining the idea of putting a big-box retailer on the former Griffith Golf Course property, especially when part of the property is wetlands. Ryfa said the town is currently working with the Army Corps of Engineers to mitigate the property, starting with rebuilding part of the levy on the propertys north side. \"Our levy is in good working condition, but its uncertified by the Army Corps. Until we get that work done, the property wont be certified,\" he said. \"The permitting for that will take between 18 and 24 months, but until it happens, we cant touch the property.\", Whether the Porter County Administration Building needs greater security in light of a threat made by a man unhappy with his property tax assessment who allegedly threatened to return with a gun is up for debate. On Aug. 13, a Westville man, 67, went into the treasurers office to pay his property... Whether the Porter County Administration Building needs greater security in light of a threat made by a man unhappy with his property tax assessment who allegedly threatened to return with a gun is up for debate. On Aug. 13, a Westville man, 67, went into the treasurers office to pay his property... Reese also brought up the old Pactiv building, which Ryfa said has been bought by the Royal Brush company of Merrillville; and the dilapidated condition of Griffith Plaza. \"Were working with consultants in Indianapolis for economic development in that sector; 187,000 cars go through that corridor per day,\" Ryfa said. \"But we dont own that property, so we cant force them to do anything.\", In other business, the council unanimously approved an electric message sign for the corner of Broad Street and Ridge Road at a cost of $2,876. Itll sit on the Valdes Engineering property and will be available to any town organizations to use. The council also approved up to $50,000 of overtime money for the Griffith Police Department so that it may increase patrols as needed. The money will come out of the towns Public Safety funds and not the towns budget. Michelle L. Quinn is a freelance reporter for the Post-Tribune.]", "Date": "20150819", "Author": "[ Michelle L. Quinn]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-griffith-annexation-st-0820-20150819-story.html", "Title": "[ Resident asks Griffith to annex homes ]"}