{"Content": "[ If New Jersey Gov. Chris Christie has his way, the unfolding presidential campaign will focus on generational fairness. It will seek to curb spending on the elderly  mainly Social Security and Medicare  without putting the elderly at risk. This debate would be good for the country, but whether the country can conduct it without an orgy of bombast and distortion is an open question. In case you missed it, Christie gave a speech in New Hampshire in mid-April proposing the following:, Social Security benefits would be gradually reduced for those with non-Social Security incomes above $80,000 and ended at incomes exceeding $200,000, a plan Christie said would affect less than 2 percent of beneficiaries. Social Securitys eligibility age would slowly be raised (two months a year, beginning in 2022) to 69 for full benefits and 64 for early retirement (from the present 62); Medicares eligibility age would be raised to 67 in 2040 and 69 in 2064 from todays 65. Wealthier retirees with incomes above $85,000, who already pay higher Medicare premiums, would have their premiums raised on a sliding scale so that beneficiaries with incomes above $196,000 would pay 90 percent of the premiums for Medicare Part B (doctors bills) and Part D (drug coverage). Presumably, this also would be phased in, though Christie gave no details. Medicaid  the federal-state health insurance program for the poor  would be cut by putting a ceiling on federal payments to states. Republican presidential hopeful Chris Christie proposed pushing back the age of eligibility for Social Security and Medicare for future retirees on Tuesday as part of a plan to cut deficits by $1 trillion over a decade, an approach he said would confront the nations \"biggest challenges in an honest... Republican presidential hopeful Chris Christie proposed pushing back the age of eligibility for Social Security and Medicare for future retirees on Tuesday as part of a plan to cut deficits by $1 trillion over a decade, an approach he said would confront the nations \"biggest challenges in an honest... Lets concede that Christies gambit is self-serving. His presidential prospects are said to lag. He strives to differentiate himself from the herd of Republican contenders. What better way to demonstrate \"leadership\" qualities than to tackle an issue that, according to conventional wisdom, is political suicide. Its a high-risk/high-reward strategy. Let me also add: Christie has hedged his bets. He pledges that his proposals would \"not affect seniors currently in these programs or seniors approaching retirement.\" Why not? Raising eligibility ages now by two months a year wouldnt impose major hardship. Neither would trimming benefits for richer recipients. Instead, Christie would exempt most baby boomers, no matter how wealthy, from cuts. Boomers children and grandchildren would pay for these more generous benefits while their own future benefits would drop. Christies Medicaid plan is also undesirable; it could saddle states with higher costs for long-term care. This could squeeze state spending for schools, roads and other traditional functions. A kindergarten teacher on Tuesday urged Gov. Chris Christie to tone down his combative style, warning the potential presidential contender that his temper wouldnt play well across the country. Christie, who built his national reputation as a straight-talker unafraid to mince words, said in part... A kindergarten teacher on Tuesday urged Gov. Chris Christie to tone down his combative style, warning the potential presidential contender that his temper wouldnt play well across the country. Christie, who built his national reputation as a straight-talker unafraid to mince words, said in part... But the virtue of Christies proposal outweighs its vices: A major political figure  and likely presidential candidate  is discussing the central budget problem in refreshing detail. Hes said things that need saying. To wit: Higher eligibility ages are justified by longer life expectancies. People can and should work longer. Unchecked spending on the elderly threatens \"every other national priority,\" including national defense. Younger generations face higher taxes, continuous deficits and reduced public services. But we also need to protect the dependent elderly against poverty. The choices are discomforting. Can we debate them honestly?, So far, the answer has been \"no.\" Rational discussion has been conspicuously absent. Proposals for modest cuts have been portrayed as threatening Social Securitys or Medicares very existence. Democrats especially have pummeled Republicans. Christies speech might change the context. It creates an opening for reporters and commentators to ask other presidential aspirants  Hillary Clinton and the Republican swarm  how, or whether, they would alter these programs. We need this debate, however it concludes. It could simply validate the status quo: Dont touch the elderlys benefits. Or it could build a political foundation for reasonable cuts favoring the young. The Washington Post Writers Group, Robert Samuelson is a Washington Post columnist.]", "Date": "20150423", "Author": "[ Robert Samuelson]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-social-security-retirees-chris-christie-perspec-0424-20150423-story.html", "Title": "[ Chris Christie dares discuss Social Security, Medicaid]"}