{"Content": "[ Several bed-and-breakfast owners told the Cook County assessors office during a contentious meeting Monday that they would be forced to close their businesses by years end as the result of a planned tax reclassification. Cook County Assessor Joseph Berrios announced plans to reclassify all Cook County bed-and-breakfast establishments as commercial rather than residential properties beginning Jan. 1. The establishments owners say the change could potentially add thousands of dollars to their property tax bills. The change was initially scheduled to take effect last January, but Deputy Assessor Thomas Jaconetty said the office postponed the rollout after fielding complaints. Bed-and-breakfast owners complained that they had not been informed of the change, and had no opportunity to evaluate their next steps and seek counsel. \"Heres whats going to happen: Towards the beginning of the year, were all not going to get a (bed-and-breakfast) license,\" said Mell Monroe, owner of the Welcome Inn Manor in ChicagosBronzeville neighborhood. Jaconetty said his office called Mondays meeting to discuss an appropriate methodology for determining the assessed value of bed-and-breakfast properties based on a number of factors, including their income-generating potential. The practice of taxing bed-and-breakfast properties as purely residential properties needs to stop, he said. Residential properties are taxed at 10 percent of their assessed value, as opposed to being taxed at 25 percent of their assessed value if deemed commercial. Chicago bed-and-breakfast owner Kapra Fleming was baffled and shocked when she heard the news: Her taxes and costs to do business could double or even triple before the years end. That was in April, when she first learned that the Cook County assessor planned to reclassify all bed-and-breakfasts... Chicago bed-and-breakfast owner Kapra Fleming was baffled and shocked when she heard the news: Her taxes and costs to do business could double or even triple before the years end. That was in April, when she first learned that the Cook County assessor planned to reclassify all bed-and-breakfasts... \"These are not just homes, these are economic enterprises,\" Jaconetty said. Chicago Bed and Breakfast Association President Kapra Fleming urged the assessors office to delay the reclassification for an additional year. Fleming, who owns the House of Two Urns in Chicagos Wicker Park neighborhood, also requested that the office classify all existing bed-and-breakfasts as mixed-use commercial/residential properties to prevent owners from losing their homeowner and senior exemptions. Jaconetty said he couldnt say for sure how many bed-and-breakfasts would qualify for mixed-use commercial and residential status, nor could he say which establishments would lose or retain their homeowner exemptions. His office estimated that there are about 40 licensed bed-and-breakfasts in Cook County, the majority of which are in Chicago. Oak Park Township Assessor Ali ElSaffar said he believes most Cook County bed-and-breakfast owners would support an assessed valuation based in part on the net income they receive from their establishments. But he suggested that they continue to be taxed at the 10 percent of assessed valuation rather than 25 percent. If Cook County businesses are worried about losing shoppers to Northwest Indiana when their sales tax bumps up 1 percentage point on Jan. 1, Indiana business leaders want them to know its already happened. When Cook County sales tax on general merchandise rises to 10.25 percent in Chicago, 10 percent... If Cook County businesses are worried about losing shoppers to Northwest Indiana when their sales tax bumps up 1 percentage point on Jan. 1, Indiana business leaders want them to know its already happened. When Cook County sales tax on general merchandise rises to 10.25 percent in Chicago, 10 percent... Fleming and others attending the meeting also took issue with the fact that countys licensed vacation rentals and those renting rooms on websites like Airbnb.com would remain unaffected by the tax reclassification. Marc Gordon, president and CEO of the Illinois Hotel & Lodging Association, implored the assessors office to tackle the issue by also assessing properties that post listings on Airbnb.com and similar websites based at least in part upon the amount of income they generate. \"Youve got millions and millions of dollars that are being totally ignored here,\" Gordon said. But Jaconetty argued that the issue at hand is how best to assess bed-and-breakfasts. Tom Shaer, a spokesman for the Cook County assessors office, however, reassured those attending the meeting that the assessors office was not \"shutting the door\" on the Airbnb component of the industry. But bed-and-breakfast owners appeared to take little comfort in the officials comments. Monroe said if the reclassification takes effect as planned, hed consider signing up with Airbnb rather than remaining as a licensed bed-and-breakfast in Chicago. Jaconetty said the assessors office will host a second meeting, possibly a closed session, to discuss the issue in more detail late next month. Lee Gaines is a freelance reporter.]", "Date": "20150810", "Author": "[ Lee V. Gaines]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-bed-breakfast-tax-folo-met-20150810-5-story.html", "Title": "[ Cook County B&B owners oppose assessor's tax reclassification plan]"}