{"Content": "[ The Illinois Supreme Court on Friday unanimously ruled unconstitutional a landmark state pension law that aimed to scale back government worker benefits to erase a massive $105 billion retirement system debt, sending lawmakers and the new governor back to the negotiating table to try to solve the pressing financial issue. The ruling also reverberated at City Hall, imperiling a similar law Mayor Rahm Emanuel pushed through to shore up two of the four city worker retirement funds and making it more difficult for him to find fixes for police, fire and teacher pension funds that are short billions of dollars. At issue was a December 2013 state law signed by then-Democratic Gov. Pat Quinn that stopped automatic, compounded yearly cost-of-living increases for retirees, extended retirement ages for current state workers and limited the amount of salary used to calculate pension benefits. Employee unions sued, arguing that the state constitution holds that pension benefits amount to a contractual agreement and once theyre bestowed, they cannot be \"diminished or impaired.\" A circuit court judge in Springfield agreed with that assessment in November. State government appealed that decision to the Illinois Supreme Court, arguing that economic necessity forced curbing retirement benefits. On Friday the justices rejected that argument, saying the law clearly violated whats known as the pension protection clause in the 1970 Illinois Constitution. \"Our economy is and has always been subject to fluctuations, sometimes very extreme fluctuations,\" Republican Justice Lloyd Karmeier wrote on behalf of all seven justices. \"The law was clear that the promised benefits would therefore have to be paid and that the responsibility for providing the states share of the necessary funding fell squarely on the legislatures shoulders. Each of the four Illinois public retirement systems is in deep financial trouble. \"The General Assembly may find itself in crisis, but it is a crisis which other public pension systems managed to avoid and ... it is a crisis for which the General Assembly itself is largely responsible,\" Karmeier wrote. \"It is our obligation, however, just as it is theirs, to ensure that the law is followed. That is true at all times. It is especially important in times of crisis when, as this case demonstrates, even clear principles and long-standing precedent are threatened. Crisis is not an excuse to abandon the rule of law. It is a summons to defend it,\" he wrote. The ruling means Republican Gov. Bruce Rauner and the Democrat-controlled General Assembly will have to come up with a new solution after justices appeared to offer little in the way of wiggle room beyond paying whats owed, which likely would require a tax increase. Coming up with a way to bridge a budget gap of more than $6 billion already was going to be difficult with little more than three weeks before a scheduled May 31 adjournment, and now the pension mess has been added to the mix. Rauner, who argued during last years campaign that the law was unconstitutional and didnt go far enough to reduce the pension debt, said the court ruling only reinforces his approach of getting voters to approve a constitutional amendment that \"would allow the state to move forward on common-sense pension reforms.\", The governor has proposed allowing veteran state workers to keep the current benefits theyve earned through a certain date, then move them into a lower-paying benefit plan created for newer state workers. To try to make that approach pass legal muster, he wants lawmakers to put on the ballot a proposed constitutional amendment to clarify that future retirement benefits could be changed. In its ruling, the court restated that state worker retirement benefits that are promised on the first day of work cannot be later reduced during their term of employment, only increased. But it is unclear whether a change in the constitution could be applied to existing state workers. Even if reluctant lawmakers were to put a measure on the ballot and voters approved it, such a change would spur years of litigation that could involve both state and federal courts. A coalition of unions that represent government workers and retirees applauded the ruling as protecting \"the hard-earned life savings of teachers, police, firefighters, nurses, caregivers and other public service workers and retirees.\", \"Public service workers are helpers and problem solvers by trade. With the Supreme Courts unanimous ruling, we urge lawmakers to join us in developing a fair and constitutional solution to pension funding, and we remain ready to work with anyone of good faith to do so,\" Illinois AFL-CIO President Michael Carrigan said in a statement. Democratic Senate President John Cullerton issued a statement noting concerns he raised at the time the bill was passed. \"Today, the Illinois Supreme Court declared that regardless of political considerations or fiscal circumstances, state leaders cannot renege on pension obligations,\" the statement read. \"This ruling is a victory for retirees, public employees and everyone who respects the plain language of our constitution.\", The court decision affects not only state government but also taxpayers in Chicago and municipalities throughout Illinois struggling to cope with growing pension debts that are straining government budgets. At City Hall, the ruling stands to loom large in lawsuits that unions and retirees filed against Emanuels changes to pension systems for city workers and laborers. Like the state law, the city measure reduced annual cost-of-living increases. The ruling also could hurt Emanuels leverage as he negotiates a pension fix for the retirement systems covering Chicago police and firefighters. At the state level, for decades governors and lawmakers failed to put enough money into the pension systems covering most state workers and university employees, as well as suburban and downstate teachers. In playing catch-up, spending on pensions now amounts to almost a quarter of every tax dollar that goes into the states general bank account. The justices went so far as to fault lawmakers for failing to keep in place a 2011 temporary income tax hike that boosted the personal tax rate to 5 percent. At the start of the year, the tax increase automatically phased down to 3.75 percent for individuals, costing the state $4 billion in annual revenue. Much of the tax increase was used to make the states share of pension payments during those four years. \"The General Assembly could also have sought additional tax revenue. While it did pass a temporary income tax increase, it allowed the increased rate to lapse to a lower rate even as pension funding was being debated and litigated,\" Karmeier wrote. Now Rauner and lawmakers must figure out a pension solution. \"Our path forward from here is now much more difficult, and every direction will be more painful than the balance we struck (in the pension law that was thrown out),\" Rep. Elaine Nekritz, a Northbrook Democrat who helped negotiate the pension law, said in a statement Friday. Chicago Tribunes Hal Dardick contributed. rap30@aol.com, kgeiger@tribpub.com]", "Date": "20150508", "Author": "[ Rick Pearson, Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-illinois-pension-law-court-ruling-20150508-story.html", "Title": "[ Illinois Supreme Court rules landmark pension law unconstitutional]"}