{"Content": "[ Democratic Gov. Pat Quinn on Friday appointed a longtime friend and aide to succeed the late Judy Baar Topinka as Illinois comptroller, saying Jerry Stermer will serve for just three weeks until new statewide office holders are sworn in Jan. 12. The short-term nature of the appointment allows Quinn to avoid at least one legal battle with Republican Gov.-elect Bruce Rauner, who will get to name his own person to serve what was to be Topinkas second term. Left brewing, however, is a potential court fight over whether Rauners choice for comptroller will be able to fill out the full four-year term. Quinn is hoping to convince lawmakers during a Jan. 8 special session to approve a special election in 2016 for voters to choose a new comptroller to serve the final two years of Topinkas term. The outgoing governor argues the people should have the ultimate say on a comptroller, but the strategy also seeks to blunt Rauners power. In addition, 2016 is a presidential election year, which usually favors Democratic candidates in Illinois. Rauner has said a special election is unnecessary and would violate the state constitution, meaning the matter could end up in court. Topinka, a veteran Republican, died this month following complications from a stroke. On Friday, Quinn said there is no way to replace somebody as effervescent as Topinka, but suggested Stermer will serve as a good caretaker for the office to ensure workers get their paychecks and bills get paid. We have to make sure the job is done and done right, Quinn said. Stermer took the oath of office Friday afternoon as numerous members of Topinkas team looked on, including chief of staff Nancy Kimme, who will continue to manage the offices day-to-day operations.Rauner had called on Quinn to appoint Kimme, who also is a top deputy in Rauners transition team. Quinn dismissed the idea that he didnt name Kimme comptroller for political reasons, saying he picked Stermer to show that Democrats and Republicans could work together in the best interest of the state.Rauner thanked Quinn for keeping Topinkas staff in place, saying in a statement that it was an appropriate decision. Stermer, 71, had been serving as Quinns budget director. He joined the administration as chief of staff in February 2009, shortly after Quinn took over impeached ex-Gov. Rod Blagojevich, who is now in federal prison. In 2010, Stermer briefly left the Quinn administration after reporting to ethics officials he had sent an email related to Quinns campaign from a state cellphone. Stermer, who paid a $500 fine, was brought back by Quinn a few weeks after the November 2010 election, but the governor required Stermer to work his first week without pay as a form of discipline. Tim Blair, who oversees pensions for lawmakers and statewide officeholders, said that serving as comptroller for less than a month will have negligible impact on Stermers state pension. Stermer made $125,000 a year as budget director and the comptrollers annual salary is $135,669. A 2011 law put limits on how much a person taking office can count toward a pension, and it likely wouldnt even be worth it for Stermer to join the additional retirement plan for statewide officeholders, Blair said. Before going to work for Quinn, Stermer was the president of advocacy group Voices for Illinois Children, and he worked at the Illinois Department of Children and Family Services for seven years for both Republican and Democratic governors, according to the administration. Stermer said he didnt expect to make any big shake ups during his short tenure, saying he viewed his job as providing operational continuity.]", "Date": "20141219", "Author": "[ Monique Garcia, Ray Long]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-quinn-to-name-topinka-successor-20141219-story.html", "Title": "[ Quinn names longtime aide Stermer to succeed Topinka as comptroller]"}