{"Content": "[ A veteran insider will be nominated Wednesday to be Cook Countys next public defender, making her only the second woman to hold the post in its 85-year history if the County Board approves. Amy Campanelli, who now manages the offices suburban operations, said in an interview Tuesday with the Tribune that her priorities will be encouraging the use of \"therapeutic specialty courts\" like drug court as well as community outreach to help students understand legal consequences. She intends to visit every high school in Chicago, talking to students about a range of issues, including that they can be criminally charged just for riding in a stolen car or that if they are pulled over while driving and have even trace amounts of marijuana in their system they can be charged with DUI. \"I think its a pretty exciting time to be in the criminal justice system,\" said Campanelli, 52, of La Grange. \"Attitudes are changing to incarceration and how we treat nonviolent offenders and people addicted to drugs.\", The public defenders office, with more than 500 attorneys and an annual budget of $61.6 million, provides free legal representation for defendants who cant afford it. Rita Fry was the first woman to serve as public defender for two terms starting in 1992. Campanelli worked 11 years as an assistant public defender before she quit in 1998 to raise her children. By then she had risen from the juvenile division to first chair at a courtroom in the Criminal Court Building. The caseloads were too much, with her juggling 150 felony cases at a time, she recalled telling the author of the book \"Courtroom 302\"  the courtroom where she was assigned. JoAnn Thompson was remembered Tuesday at a special Chicago City Council meeting as a fierce fighter for the South Side neighborhoods she represented, an alderman whose quiet demeanor masked her disdain for dishonesty. Colleagues said Thompsons low-key presence and infrequent floor speeches in... JoAnn Thompson was remembered Tuesday at a special Chicago City Council meeting as a fierce fighter for the South Side neighborhoods she represented, an alderman whose quiet demeanor masked her disdain for dishonesty. Colleagues said Thompsons low-key presence and infrequent floor speeches in... \"My job was rewarding to me, but I didnt really see my youngest children,\" said the mother of three. \"I worked late; I worked weekends; I went to the jail (to confer with clients). At one point I decided I had to make a choice. It was definitely one of the most difficult choices Id made in my life.\", Campanelli, who is married to attorney Patrick Campanelli, began working part time in her husbands office, and in 2003, then-Public Defender Edwin Burnette brought her back into the office as a felony trial supervisor. Campanelli continued to defend cases even as she moved up the ranks of management  trying a case in the Maywood courthouse last year  but she said she will likely give that up once shes the public defender. County Board President Toni Preckwinkle, who made the nomination, praised Campanelli for her experience and commitment to reforming the criminal justice system. She was the insider from among three finalists recommended by a five-person committee led by Appellate Court Justice Joy Cunningham. \"Our goal is really to see that those who need it have a quality defense but also to reduce the number of people in the criminal justice system and the number of people in the jail,\" Preckwinkle said in a phone interview. Campanelli, whose nomination is expected to be taken up by the County Board on April 1, will succeed Abishi Cunningham Jr. 68, a former judge and prosecutor whose term ends March 31. The public defender is appointed to a six-year term. \"Youve got to have a lot of passion and dedication to do this because youre not going to have a lot of pats on the back,\" Cunningham said. One of many pressing issues for the office continues to be that unionized assistant public defenders have worked without a contract since 2012. Some of them picketed outside the county building last year. Even though many defendants who pass through the Leighton Criminal Court Building dont consider public defenders \"real attorneys,\" Cunningham said, the office plays an extremely important role in making sure constitutional rights for poor defendants are upheld. \"It saddens me as well to hear a client say that we are penitentiary deliverers,\" Campanelli said in reference to an acronym that clients sometimes use for PD. \"Or not a real lawyer or were paid by the state, so were not going to do a good job.\", \"We gain their trust through our actions, through our investigation, just working in the trenches,\" she said. The sixth of seven children, Campanelli grew up in the western suburbs and graduated from the University of Illinois at Urbana-Champaign and Chicago-Kent College of Law. sschmadeke@tribpub.com, Twitter @SteveSchmadeke]", "Date": "20150310", "Author": "[ Steve Schmadeke]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-cook-county-public-defender-met-20150310-story.html", "Title": "[ Veteran defense lawyer nominated to be Cook County public defender]"}