{"Content": "[ The case against the U.S. nuclear deal with Iran is easy to make. It doesnt ensure that Iran will never get the bomb; it doesnt require Iran to renounce terrorism; it doesnt end Irans hostility toward Israel. Each of these things is highly desirable, and the agreement provides none of them. What it will do, if all the right details are nailed down and the terms are firmly enforced, is make it harder for Iran to acquire nukes, while postponing that possibility for a decade or more. Before the agreement under which the talks began, Tehrans \"breakout time\" was estimated at about a month. Under the tentative deal, it will be more like a year. There is a basic dispute on this accord. The opponents see Iran as a deadly disease that must be cured once and for all. The supporters regard Iran as a troublesome condition that may not be eliminated but can be managed. The fantasy of permanently eliminating a security problem is a recurrent one in American foreign policy. It wasnt enough to topple the Taliban and smash al-Qaida in Afghanistan. We had to undertake a long-term military effort to guarantee it would never again harbor terrorists. It wasnt enough to keep Saddam Hussein in a cage, where he posed minimal danger. We had to remove him and make his country a model for the Middle East. It wasnt enough to get Moammar Gadhafi to swear off terrorism and give up his nuclear program. We had to bring about regime change. None of these ended well. In each case, smaller ambitions would have provided adequate protection at a reasonable cost. But the temptation to banish a danger once and for all caused us to overreach, with painful consequences that we are still suffering. \"Reagan has accelerated the moral disarmament of the West by elevating wishful thinking to the status of political philosophy.\",  George F. Will, 1987, on the United States nuclear weapons negotiations with the Soviet Union. Amid all the criticism of President Barack Obamas proposed agreement... \"Reagan has accelerated the moral disarmament of the West by elevating wishful thinking to the status of political philosophy.\",  George F. Will, 1987, on the United States nuclear weapons negotiations with the Soviet Union. Amid all the criticism of President Barack Obamas proposed agreement... Iran is likely to turn out the same way if diehard opponents of a nuclear deal get their way. Not that the deal is definitely a good thing. Until all the specifics are resolved, its impossible to know. But the most vehement critics have already made up their minds. Even if Iran abides by the Obama administrations interpretation of whats to be done, they believe we have given away too much. Compared with what? Its not as if the detractors have any promising alternatives. \"You can ratchet up the sanctions,\" insists Israeli Prime Minister Benjamin Netanyahu. But sanctions are not so potent as all that. North Korea eats sanctions for breakfast. Saddam laughed at our sanctions. Sanctions may induce a regime to consider compromises with its enemies. But they have never forced the complete capitulation imagined by American hawks. Nor does economic pressure offer quick relief. If we walked away from the deal, wed find ourselves waiting for the sanctions to force Iran to surrender  while Iran might embark on an all-out race to build a nuclear arsenal. In that case, the hawks would urge that we launch airstrikes on Irans nuclear facilities. There are two chief shortcomings in this course. First, it would merely delay what we hope to prevent. Iran could kick out inspectors and rebuild its nuclear program in hidden sites. Second, it would mean a real live shooting war with Iran. Obamas critics, notably Sen. Tom Cotton, R-Ark. act as though military action would be quick and easy. He told The Atlantic he has in mind \"something like Operation Desert Fox\"  referring to a 70-hour bombing campaign the U.S. carried out against Saddam in 1998. But it was not a rousing success, even though Iraqs regime was far weaker than Irans is today. Afterward, a NATO diplomat told The New York Times, \"Nothing has changed, and no one seems to know where we go from here.\" Where we went from there was the 2003 invasion, to solve a problem the airstrikes hadnt. Cotton and his allies think we can achieve a victorious conclusion in short order. Where on Earth do they get that idea? Against far weaker foes in Afghanistan and Iraq, we found ourselves up to our necks in trouble we didnt foresee, incurring far more casualties than the architects had imagined. Iran is not the only threat here. Our own hubris is equally dangerous. The tentative Iran deal falls short of a complete cure of the Iran problem. But by now, we should know that some cures are worse than the disease. Steve Chapman, a member of the Tribune Editorial Board, blogs at chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150417", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-iran-nuclear-netanyahu-sanctions-al-qaida-afghanistan-perspec-0419-jm-20150417-column.html", "Title": "[ The dangers of overreach on a nuclear Iran]"}