{"Content": "[ The National Security Agency lost its authority at midnight to collect Americans phone records in bulk, after GOP Sen. Rand Paul stood in the way of extending the fiercely contested program in an extraordinary Sunday Senate session. But that program and several other post-Sept. 11 counter-terror measures look likely to be revived in a matter of days. With no other options, Senate Majority Leader Mitch McConnell, in an about-face, reluctantly embraced a House-passed bill that would extend the anti-terror provisions, while also remaking the bulk phone collections program. Although the lapse in the programs may be brief, intelligence officials warned that it could jeopardize Americans safety and amount to a win for terrorists. But civil liberties groups applauded as Paul, who is running for president, forced the expiration of the once-secret program made public by NSA contractor Edward Snowden, which critics say is an unconstitutional intrusion into Americans privacy. The Senate voted 77-17 to move ahead on the House-passed bill, the USA Freedom Act, which only last weekend fell three votes short of the 60 needed to advance in the Senate. For McConnell, it was a remarkable retreat after objecting ferociously that the House bill would make the bulk phone collections program dangerously unwieldy by requiring the government to search records maintained by phone companies. \"Its not ideal but, along with votes on some modest amendments that attempt to ensure the program can actually work as promised, its now the only realistic way forward,\" McConnell said. The White House backs the House bill. White House Press Secretary Josh Earnest said in a statement: \"The Senate took an important  if late  step forward tonight. We call on the Senate to ensure this irresponsible lapse in authorities is as short-lived as possible. On a matter as critical as our national security, individual senators must put aside their partisan motivations and act swiftly.\", The Senate struggled unsuccessfully to prevent an interruption in critical government surveillance programs early Saturday, blocking a House-passed bill and several short-term extensions of the USA Patriot Act. The main stumbling block was a House-passed provision to end the National Security Agencys... The Senate struggled unsuccessfully to prevent an interruption in critical government surveillance programs early Saturday, blocking a House-passed bill and several short-term extensions of the USA Patriot Act. The main stumbling block was a House-passed provision to end the National Security Agencys... But the Senate adjourned without final action on the bill after Paul asserted his prerogative under Senate rules to delay a final vote for a couple of days. And a couple of hours later, the midnight deadline came and went. \"This is what we fought the revolution over, are we going to so blithely give up our freedom? ... Im not going to take it anymore,\" Paul declared on the Senate floor hours earlier, as supporters wearing red \"Stand With Rand\" T-shirts packed the spectator gallery. Pauls moves greatly complicated matters for fellow Kentuckian McConnell, who has endorsed him for president, and infuriated fellow Republicans. They exited the Senate chamber en masse when Paul stood up to speak following the procedural vote on the House bill. Sen. John McCain, R-Ariz. complained to reporters that Paul places \"a higher priority on his fundraising and his ambitions than on the security of the nation.\", Paul, for his part, asserted that, \"People here in town think Im making a huge mistake. Some of them I think secretly want there to be an attack on the United States so they can blame it on me.\", At midnight Sunday, several key provisions of the Patriot Act will expire. A vital electronic surveillance program will go dark. The program collects and stores metadata  records of Americans phone calls, but not the content of those calls  to help track terrorists and foil attacks. Other expiring... At midnight Sunday, several key provisions of the Patriot Act will expire. A vital electronic surveillance program will go dark. The program collects and stores metadata  records of Americans phone calls, but not the content of those calls  to help track terrorists and foil attacks. Other expiring... In addition to the bulk phone collections provision, two lesser-known Patriot Act provisions also lapsed at midnight: one, so far unused, helps track \"lone wolf\" terrorism suspects unconnected to a foreign power; the second allows the government to eavesdrop on suspects who continually discard their cellphones. McConnell tried Sunday to extend just those provisions for two weeks, but Paul objected. The House bill extends those two provisions unchanged, while remaking the bulk collection program so that the NSA would stop collecting the phone records after a six month transition period, but would be authorized under court order to search records held by phone companies. The FBIs use of the Patriot Act to collect hotel, travel, credit card, banking and other business records in national security investigations would also be extended under the House bill. Law enforcement officials say the collection of those business records is more valuable than the better-known bulk phone collections program. Ongoing investigations would be permitted to continue even though authority for the programs has lapsed. Rebooting the phone collections program would take about a day. CIA Director John Brennan was among those warning that letting the authorities lapse, even for a time, will make America less safe. Terrorists \"are looking for the seams to operate within,\" Brennan said on CBS \"Face the Nation.\" This is something that we cant afford to do right now.\" He bemoaned \"too much political grandstanding and crusading for ideological causes that have skewed the debate on this issue\" and said the terrorism-fighting tools are important to American lives. For Paul, the issue represents a potent political opportunity, and his presidential campaign has been sending out numerous fundraising appeals focused on it. A super PAC supporting him even produced an over-the-top video casting the dispute as a professional wrestling-style \"Brawl for Liberty\" between Paul and President Barack Obama  even though Pauls main opponent on the issue is McConnell. Associated Press]", "Date": "20150601", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-nsa-phone-collection-program-20150531-story.html", "Title": "[ Surveillance powers lapse with no deal in Senate ]"}