{"Content": "[ In the end, the NFL said it was an easy pick. After exceeding expectations as host of the NFL draft this spring, Chicago has once again been selected by the league as the site of the event in 2016. Mayor Rahm Emanuel and NFL Commissioner Roger Goodell announced the decision Tuesday afternoon during an NFL owners meeting in Schaumburg. \"Were coming back to Chicago for the draft in 2016,\" Goodell said. \"Theyve earned it. The success we had last year set a new bar for the draft, it set a new opportunity for fans to interact with the NFL. It had a tremendous impact on this community.\", The league announced last month that the 2016 draft would be conducted April 28-30 but didnt name the location at that time. Goodell said Chicago, which played host for the first time in more than 50 years, did an extraordinary job, but the league expects the city to promote the events continued growth in 2016. That may include a larger footprint and similar accommodations by the city, which provided several venues this year at no cost. The league also said the event will be up for competitive bidding beginning in 2017. NFL Draft is returning to Chicago in April 2016. Chicago raised the bar in May 2015 according to NFL Commissioner Roger Goodell. August 11, 2015. (WGN-TV), NFL Draft is returning to Chicago in April 2016. Chicago raised the bar in May 2015 according to NFL Commissioner Roger Goodell. August 11, 2015. (WGN-TV), Some 200,000 visitors attended the free fan festival, which transformed Grant Park into \"Draft Town\" from April 30 to May 2. A study by the Sport Industry Research Center at Temple University released last month pegged direct economic impact to Chicago at nearly $44 million, including hotel revenue, dining, sales tax revenue and temporary jobs. The study was commissioned by Choose Chicago, the citys convention and tourism bureau, which lured the draft back to Chicago after a 50-year run in New York. Previously a televised theatrical presentation attended mostly by hard-core jersey-clad fans, Chicagos expanded event covered 900,000 square feet of the park with concessions, activities and \"fan caves\" for all 32 NFL teams. While not quite the Super Bowl, Chicago was the backdrop for 8.8 million TV viewers on ESPN and NFL Network during the first day of the draft alone, according to Nielsen. With other major networks also camped out in Grant Park, Choose Chicago said the value of the TV and digital media was nearly $115 million. Lollapalooza will fill Grant Park with hundreds of thousands of people next weekend, the latest event that  like the Pitchfork Musical Festival and the Grateful Deads farewell concerts at Soldier Field before it  puts Chicago center stage. With springs NFL draft, which transformed itself and... Lollapalooza will fill Grant Park with hundreds of thousands of people next weekend, the latest event that  like the Pitchfork Musical Festival and the Grateful Deads farewell concerts at Soldier Field before it  puts Chicago center stage. With springs NFL draft, which transformed itself and...  Chicago submitted its proposal for next years draft on July 31, and signed the deal to bring it back on Tuesday, according to Don Welsh, Choose Chicagos president. \"I think its a great day for Chicago,\" Welsh said. \"The city performed extremely well and were fortunate that the NFL has chosen us to come back for one more year.\", Welsh said the format will likely remain the same, using Grant Park for the outdoor festival and Roosevelt Universitys Auditorium Theatre to host the actual draft. It was unclear if any facilities will once again be made available to the NFL at no cost. The Chicago Park District this year waived a $937,000 rental fee. The league will be looking for more from the city next year, according to Peter OReilly, senior vice president of events for the NFL. \"We have every confidence that well raise the bar in 2016, getting more fans in Grant Park for Draft Town,\" OReilly said. \"It is a new normal in the draft, and we think well only build on that as we head to 2016.\", OReilly said that several cities were in the running to host the draft in 2016, but an analysis of this years successful event ended the competition quickly. He said the league will open up bidding for the 2017 draft this fall, creating a \"more formal process\" to allow all NFL cities to participate. \"Chicago clearly will be part of that process as well,\" OReilly said. The draft announcement was not even on the agenda for NFL owners, who were in Chicago for a special meeting to consider bringing pro football back to Los Angeles, a city that hasnt had a franchise since the Rams left for St. Louis in 1995. The Oakland Raiders, St. Louis Rams and San Diego Chargers are all in play to build a new stadium and move to the nations second-largest market. City officials are hoping the drafts return engagement will be as successful for Chicago, and the league. \"We plan on 2016 being another benchmark year, just like 2015,\" Emanuel said. rchannick@tribpub.com, Twitter @RobertChannick]", "Date": "20150811", "Author": "[ Robert Channick]", "Link": "http://www.chicagotribune.com/business/ct-nfl-draft-decision-0812-biz-20150811-story.html", "Title": "[  NFL draft returning to Chicago in 2016]"}