{"Content": "[ The frail school district that educates nearly 400,000 young Chicagoans is gasping to lower its personnel costs. City Hall, too, fears the remote but real specter of bankruptcy. Cook County and many suburbs have awakened to their own debt crises. On high, the grossly overspent state government that temporarily and notoriously hiked taxes to pay overdue bills ... still cant pay overdue bills. Pass an honestly balanced budget? Bah. Some of the politicians who run these flailing governments are mulling unorthodox solutions that make them uncomfortable: Increasingly, the public officials quest to keep delivering services puts them at odds with public-sector unions that have long been their political allies, donors and Election Day warriors. On Monday, Chicago Public Schools unveils a budget for the coming school year. How drastic is CPS emergency? So drastic that even the Chicago Teachers Union, which long accused CPS of exaggerating its shortfalls, now admits that the district has no money. As a result, true-blue Democrats Rahm Emanuel and schools CEO Forrest Claypool find themselves asking union educators in heavily Democratic and union-friendly Chicago to pay their full employees share of their pension contributions. Never mind that CPS has been paying most of the employees share for 34 years. The big story is that tectonic plates are shifting: Finance crises are roiling old political relationships, and rocking policy postures that are now obsolete. How else to view Republican Gov. Bruce Rauners elaborate offer to help CPS live to teach another day: The governor would help the district meet pension costs, delay some of those costs and keep sending other state money to Chicagos schools. Rauner says Emanuels administration wants Springfield to exclude topics, such as pension benefits, from CPS collective bargaining with the union. Rauners retort: If we give so much to Chicago, then help us give local governments statewide the same freedom to decide whats negotiable in their labor contracts. As he put it Thursday, \"Were eager to help the city of Chicago. ... But at this point, the city of Chicago and the mayor have been unwilling to help us in our reform agenda to help the state.\" Thats a fair ask. Gov. Bruce Rauner wants local governments empowered to decide what topics will, or wont, be subject to collective bargaining with their employees. To see why that admittedly dramatic proposal could help Chicago and its school system stave off financial disaster, return with us to ... 1981. How... Gov. Bruce Rauner wants local governments empowered to decide what topics will, or wont, be subject to collective bargaining with their employees. To see why that admittedly dramatic proposal could help Chicago and its school system stave off financial disaster, return with us to ... 1981. How... Rauners strange bedfellow in seeking fixes, although he disagrees with some of Rauners goals, is Senate President John Cullerton. The Chicago Democrat has been working feverishly to broker solutions. Yes, Cullerton was present at the creation of many pension and other spending sprees that have damaged Illinois governments. But as the crises intensify, Cullerton has tried to balance the demands of wildly warring foes. Conspicuous by his isolation is House Speaker Michael Madigan. He emerges from somewhere every few days to stand before cameras and lash at Rauner and whoever else displeases him. For all we know, Madigan is still on his game, plotting a move that will again make him relevant. As things stand, though, hes nurturing the image of a grouch angry that novice Rauner dares challenge him. Citizens know that Illinois pols and their union allies have built a structure of governance that is too vast for taxpayers to afford, and too rigid to willingly accept reinvention. Weve written of the deals that stuck taxpayers with spectacularly unsustainable pension costs as suicide pacts: Politicians committed hundreds of billions of dollars that might pay for schools, care for the disabled and other priorities to future retirement benefits of public employees. Unless we curb that burden going forward, we will bequeath to next-generation Illinoisans an infrastructure of services and facilities that is grossly inferior to what our grandparents and parents bequeathed to us. Rauner is thinking long-term: If Illinois doesnt restore economic growth and rising incomes, legacy costs will continue to strangle this states 7,000 governments. Empowering those governments to control their own costs is one way to give them a chance of survival in the form their constituents expect. Tax hikes will drive even more employers and other taxpayers to more competitive states. But dont think history started the day Rauner took his oath of office. Tension between organized labor and ruling Democrats has been building in Illinois for five years. Many union members unhappily recall how Gov. Pat Quinn nudged Democratic leaders to pass public pension and retiree health reforms, some of which the Illinois Supreme Court negated. And some Dems wary of Rauners effort to permit local right-to-work zones admit privately that the unions may have to relent: Four of the six states bordering Illinois  Indiana, Iowa, Michigan and Wisconsin  now are right-to-work states, poaching businesses from jobs-starved Illinois. Until now the survival strategy at CPS, City Hall and elsewhere has been to beg help from Springfield, duck cost reforms and keep borrowing by the billions. But the credit markets, which already charge huge interest penalties to indebted governments here, wont let that go forever. At some point  maybe now  Democratic leaders have to decide: Will we keep blocking reforms that would cut government costs? Or will we tell our union allies the truth? We can compromise to rescue failing governments. Or we can let them, and many union jobs, implode.]", "Date": "20150807", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-emanuel-rauner-cullerton-madigan-cps-unions-afscme-edit-20150807-story.html", "Title": "[ The debt bomb: Survival, suicide pacts and Illinois]"}