{"Content": "[ Republican Gov. Bruce Rauner tried to isolate House Speaker Michael Madigan on Wednesday, suggesting the veteran legislative leader was \"in charge\" and should wrangle Democrats into passing a $4 billion tax hike on their own or strike a deal with the governor to support his economic agenda and put an end to a budget impasse. As part of his latest move against Madigan, Rauner unveiled a mammoth, cost-cutting pension bill he said was aimed at solving government worker retirement system funding problems from the Capitol to City Hall to Downstate and suburban village halls. The plan, Rauner said, incorporated ideas from Mayor Rahm Emanuel, Cook County Board President Toni Preckwinkle and Senate President John Cullerton  like Madigan, all Democrats. But the governors attempt to spotlight Madigan as the reason for the dysfunction did little to disrupt the united front put forth by Democrats, who dismissed the governors latest plans as an insincere effort that didnt offer much toward reaching a middle ground. They pointed to the numerous poison pill provisions sprinkled throughout Rauners pension plan that would make approval difficult, with labor unions blasting the governors approach as unconstitutional. In addition, House Democrats are poised Thursday to send Rauner a one-month emergency services budget. Its a temporary fix Rauner said he will not sign into law, even as the state has been without full spending authority since July 1 and paychecks and social service programs hang in the balance. And so the Springfield stalemate continues. Rauner is using the budget to gain leverage for his pro-business, union-weakening \"turnaround agenda,\" but Madigan has refused to engage the governors push for what the speaker has called \"nonbudget\" items. The first-term governor wants to make it tougher for injured workers to win claims against employers, limit lawsuit damages and curb union power, saying the changes are directly linked to improving the states financial health. Rauner dug in further Wednesday, unveiling slightly revamped versions of those plans he said were partly based on negotiations with Cullerton. The governor said Madigan has been unwilling to compromise. Its time for a good Samaritan to blindfold House Speaker Michael Madigan and escort him to the governors office. Promise him an apple, sliced thin, and a Palermos pizza. Hell comply. Its time for him to deal. State government is headed for a shutdown. Taxpayer-funded lawyers from the attorney... Its time for a good Samaritan to blindfold House Speaker Michael Madigan and escort him to the governors office. Promise him an apple, sliced thin, and a Palermos pizza. Hell comply. Its time for him to deal. State government is headed for a shutdown. Taxpayer-funded lawyers from the attorney... \"Speaker Madigan needs to make a decision,\" Rauner said. \"(Are you) going to support reforms or support a tax hike? Its one or the other.\", Madigan did not take reporters questions Wednesday, but a key ally summed up how many Democrats view Rauners positions. \"Weve said well talk about those things, but we dont believe that you hold hostage these important services because he wants to have a conversation about an entirely unrelated matter,\" said House Majority Leader Barbara Flynn Currie, D-Chicago. Rauner countered that it was time for Democrats to give in on some key issues if they wanted him to agree to a tax increase to blunt the need for cuts and end the budget standoff. \"I dont like taxes, period, I dont like to ever raise taxes. Im willing to do it as part of reform,\" Rauner said. \"Im willing to do something that goes against my core beliefs. I can ask the folks on the other side of the aisle to vote for some things theyd rather not.\", Collateral damage. That would be the appropriate term for people in Illinois suffering from mental illness, the developmentally disabled, the homebound elderly and the working poor who rely on the social safety net provided by the state. The programs they depend on face an uncertain future as the... Collateral damage. That would be the appropriate term for people in Illinois suffering from mental illness, the developmentally disabled, the homebound elderly and the working poor who rely on the social safety net provided by the state. The programs they depend on face an uncertain future as the... Rauner would not say what sort of tax hike he would support, but did pitch specifics on a wide-ranging plan to overhaul cash-strapped pension systems that have all but decimated state, city and county budgets. The proposal comes after the Illinois Supreme Court struck down changes to the state retirement systems lawmakers approved in 2012, ruling the law violated a clause in the constitution that protects benefits from being diminished or impaired. Some view the ruling as leaving the door open for changes under a legal theory known as consideration, arguing that the state can offer something of considerable value to entice workers to accept less generous pension benefits. But pension policy experts said Rauners plan did not appear to pass muster because it would offer workers the choice between \"a cut, or a cut,\" said Ralph Martire, executive director of the Center for Tax and Budget Accountability, a union-backed research center. \"No matter what happens, theyre going to get diminished benefits,\" Martire said. \"Theres no way to even call that consideration.\", Rauners plan for state and Cook County workers would set a new baseline on vacation and overtime rules while guaranteeing that wages would not decline for five years. Such matters are currently collectively bargained, not dictated by the state. Employees would then be offered bonuses, one-time salary bumps, overtime priority or extra vacation time in exchange for transitioning into a pension plan with lower benefits. Additionally, Rauner wants to amend state law to remove wages and hours as issues that can be bargained and explicitly prohibit bargaining on pensions, salaries, overtime compensation and several other items. Unions were not amused. \"Gov. Rauners obsession with destroying the collective bargaining rights of working people in Illinois is exposed for all to see,\" said Anders Lindall, a spokesman for the American Federation of State, County and Municipal Employees Council 31, the largest state employee union, which is currently battling with Rauner over a new contract. \"This legislation attempts to use the pension issue to wipe out the right of public service workers to have a voice on the job and bargain for a better life.\", The We Are One union coalition suggested Rauner should work on securing a state budget \"instead of continuing his one-man political campaign to stomp out the rights of average people.\", Also included in Rauners pension measure is Emanuels approach to the citys police and fire pension shortfall that would allow the mayor to stretch out the payments needed to restore financial health to the systems. But it would require that the definition of catastrophic injury for public safety workers be changed to make it clear they cant hold outside jobs while receiving disability benefits  a move that could be opposed by the unions that already agreed to Emanuels plan, which already has cleared the legislature as a stand-alone bill. The Republican governors legislation also would require Chicago Public Schools to stop paying most of teachers required contribution to the pension fund  an idea the Chicago Teachers Union already has rejected  and only provide Emanuel with the pension relief he wants for the next two years. \"Its a repackaging of lots of blatantly unconstitutional ideas, all of which are cuts,\" CTU Vice President Jesse Sharkey said. \"Really, hes saying Ill either hit you with a rock, or Ill hit you with a stick.\", Emanuel spokeswoman Kelley Quinn issued a measured response. \"While we are encouraged that the governor has incorporated elements of both the city and CPS agenda, some of these items have already been adopted by the General Assembly, including pensions for both police and fire,\" Quinn said in a statement, noting that the city has yet to review the entire 485-page bill. Like the mayor, Preckwinkle was cautious, with spokesman Frank Shuftan saying only that his boss stands by the pension bill she introduced. Rauners bill includes Preckwinkles pension ideas, but also would severely limit county union bargaining rights. Suburban and Downstate police and fire departments would get the same deal as Chicago under Rauners plan, but some of those officers and firefighters could be forced to accept lower retirement benefits. Another provision in the bill would allow local governments to declare bankruptcy, an idea Emanuel has rejected for both the city and CPS. Illinois Municipal League Executive Director Brad Cole said his group was supportive of Rauners bankruptcy idea, provided it was \"a very, very last resort.\", But Rauners plans would need significant support from Democrats who control the legislature, and they dismissed many of the governors suggestions as unworkable. \"It seems very much to me like the current situation with the budget. Theres a whole bunch of stuff in here that does not feel like a compromise and is not designed to be pension reform but designed to pursue the anti-union politics that the governor seems so insistent upon,\" said Rep. Elaine Nekritz, D-Northbrook. \"It frankly sad, ens me that we continue to use the most vulnerable as pawns in a game that seems to have no way to resolve itself. I dont know what event or cliff has to happen in order to change that dynamic.\", Chicago Tribunes Rick Pearson and Juan Perez Jr. contributed. Dardick, Geiger, Pearson and Perez reported from Chicago. mcgarcia@tribpub.com, hdardick@tribpub.com, kgeiger@tribpub.com]", "Date": "20150708", "Author": "[ Hal Dardick, Kim Geiger, Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-rauner-madigan-state-budget-met-0709-20150708-story.html", "Title": "[ Rauner tries to isolate Madigan as Democrats hold firm]"}