{"Content": "[ Twenty percent of young women who attended college during the past four years say they were sexually assaulted, according to a Washington Post-Kaiser Family Foundation poll. But the circle of victims on the nations campuses is probably even larger. Many others endured attempted attacks, the poll found, or suspect that someone violated them while they were unable to consent. Some say they were coerced into sex through verbal threats or promises. In all, the poll found, 25 percent of young women and 7 percent of young men say they suffered unwanted sexual incidents in college. The Post-Kaiser poll, one of the most comprehensive to date on an issue roiling the nations colleges, provides evidence that sexual assault is often connected to factors woven deeply into campus culture. Most notably, two-thirds of victims say they had been drinking alcohol just before the incidents. Other potential risk factors, the poll found, are casual romantic encounters known as \"hookups\" and the presence on campus of fraternities and sororities. The findings illuminate the difficulty colleges face in preventing violence that is widespread but rarely reported to authorities. Cases that do land on the deans desk or in the criminal justice system raise what often proves a vexing question: Did both people involved agree to have sex?, The poll yields insights from current and recent students on that issue and others:, She remembers doing shots of liquor in her dorm room before heading out to a football tailgate party, where she got blackout drunk. When she came to, she was groggy, standing in the bathroom of her dorm room, looking in the mirror. Her hair was a mess. Behind her was a man she didnt recognize,... She remembers doing shots of liquor in her dorm room before heading out to a football tailgate party, where she got blackout drunk. When she came to, she was groggy, standing in the bathroom of her dorm room, looking in the mirror. Her hair was a mess. Behind her was a man she didnt recognize,... -- They are torn over sexual consent. Forty-six percent said its unclear whether sexual activity when both people have not given clear agreement is sexual assault. Forty-seven percent called that scenario sexual assault. -- They do not put sexual assault atop a list of possible concerns about their school. Thirty-seven percent described it as a problem on campus. By contrast, 56 percent viewed alcohol and drug use as a problem. -- They express confidence in how colleges deal with sexual-assault reports. More than two-thirds gave their schools an A or a B for their handling of complaints. Just 8 percent gave their schools a D or an F. The Post generally does not identify victims of alleged sexual crimes, but numerous poll participants who were interviewed chose to be named. Conducted by telephone from January through March, the poll surveyed a random national sample of 1,053 women and men ages 17 to 26 who were undergraduates at a four-year college  living on campus or nearby  or had been at some point since 2011. They attended more than 500 colleges and universities, public and private, large and small, elite and obscure, located in every state and the District of Columbia. Sexual violence against college students is not just an urgent issue; its something that school officials acknowledge also spans generations. Kristina Erickson, a recent graduate of Beloit College, told The Washington Post she had been sexually assaulted twice in her time as a student at the Wisconsin... Sexual violence against college students is not just an urgent issue; its something that school officials acknowledge also spans generations. Kristina Erickson, a recent graduate of Beloit College, told The Washington Post she had been sexually assaulted twice in her time as a student at the Wisconsin... Post reporters also conducted dozens of follow-up interviews with men and women who say they experienced completed, attempted or suspected assaults. Their accounts reveal anguish, fury and confusion about incidents, on and off campus, that haunt a time of discovery and growth. In their first years away from home, while exploring the freedom and opportunity of college life, these students learned the pain of sexual violence. A 21-year-old at a public university in the Southeast who participated in the poll said she was raped by a male student who escorted her out of a nightclub after she suddenly became woozy and separated from a group of friends. Someone, she suspects, had slipped a drug into her rum drink. \"In the morning, I woke up and my lip was so swollen,\" the woman said. \"I just remember sobbing and sobbing and sobbing the next day. You learn a lot of lessons.\", Like most who said they had been assaulted, the woman did not report the incident to university officials or police. She said she worried about whether she would ruin the mans future and wondered what to make of what had happened: Had there been a misunderstanding? Should she have been more vehement in saying no? She remembers clearly crying during the attack. She knew it was rape. But how would others see it?, \"Something very wrong happened,\" she said. \"I would never wish what happened to me to happen to anyone.\", The poll defined sexual assault to include five types of unwanted contact: forced touching of a sexual nature, oral sex, vaginal sexual intercourse, anal sex and sexual penetration with a finger or object. After they were read this definition, 5 percent of men and 20 percent of women said they had been sexually assaulted in college. Their assailants used force or threats of force, or they attacked while their victims were incapacitated. The effect on campuses is even broader. Three in 10 said friends or acquaintances had confided to them in college that they were victims of sexual assault. Katie MacPherson, 20, a student at Kent State University in Ohio, said she was heading to a concert one evening when a drunk friend attacked her inside a car. She was in the front passenger seat. Suddenly he lunged forward, MacPherson recalled, grabbed her head and hair violently and tried to kiss her. \"Get your hands off me!\" she yelled. The struggle continued until MacPherson managed to open the door and flee. \"Immediately I knew,\" she said. \"That was sexual assault.\", She didnt report the attack to authorities. But through an intermediary, she told the mans fraternity. \"I wanted him to get a wake-up call,\" she said. \"I never expected that from my friend.\", How big is the problem?, College sexual assault, a long-hidden problem, emerged as an issue in the 1980s along with the term \"date rape,\" describing a certain kind of sexual crime involving friends or acquaintances. The date rapist  someone who ignored a \"no\" or never sought a \"yes\"  contrasted with the stereotype of the rapist as a predator lurking in the dark. The issue has gained new urgency in recent years as the number of reports of forcible sex offenses on campus has surged. The Obama administration has opened civil rights investigations of more than 110 colleges and universities for their handling of sexual-violence complaints. Survivors are pressing colleges for some measure of justice, such as expulsion, even when offenses are not reported to police. Accused students, bewildered by the scrutiny of sexual encounters they thought were consensual, complain that internal inquiries are stacked against them. Overhanging the debate are questions about the extent of the problem. President Obama, relying in large part on a 2007 federally funded study of students at two unidentified public universities, said last year that \"an estimated one in five women has been sexually assaulted during her college years.\", Skeptics call that statistic misleading, citing a 2014 study from the federal Bureau of Justice Statistics (BJS) that found college women were victims of rape or sexual assault at an annual rate of 6.1 per 1,000. Non-students, the BJS said, were raped or sexually assaulted more often than students. The 2007 and 2014 studies differed significantly in methodology. The earlier survey, by RTI International, asked about specific scenarios of unwanted sexual contact. The BJS study, more focused on crime, asked directly about rape, attempted rape and other sexual attacks. Last year, a blue-ribbon panel said it was \"highly likely\" the BJS method underestimates victimization. The Post-Kaiser poll used questions and definitions similar to those in the 2007 study. The polls margin of sampling error overall was plus or minus 3.5 percentage points. For answers from women or men only, it was five points. More than two dozen major universities, from Harvard to the University of Southern California, are surveying their own students this year to learn how often sexual assault occurs and what they can do to prevent it. The Massachusetts Institute of Technology last fall said 17 percent of female undergraduates who replied to a survey experienced unwanted sexual behavior at MIT, from touching or kissing to incidents that fit the definition of sexual assault and rape. Researchers reported in May that 19 percent of female freshmen at an upstate New York university said they were raped or victims of attempted rape within a year of starting at school. The Post-Kaiser poll found that 58 percent of men believe the share of women sexually assaulted at their school is less than 1 in 5. An identical majority of women believe the share assaulted is 1 in 5 or greater. Students seem less worried about sexual assault than the general public. The poll found 12 percent view it as a big problem at their school. But a separate Kaiser survey in March found 57 percent of the public at large saw college sexual assault as a big problem. Many students point to another problem: alcohol. Booze, from cheap beer to odd concoctions of liquor and juice, creates major risks. Analysis of the poll found that women who say they sometimes or often drink more than they should are twice as likely to be victims of completed, attempted or suspected sexual assault compared with those who rarely or never do. A 25-year-old woman recalled a date in her freshman year with a classmate at the University of Pittsburgh. They went to a friends house. He handed her a drink. It might have been a juiced vodka. A very strong one. \"I woke up the next morning without any pants on,\" the woman said, \"and without any recollection.\" A few weeks later, she said, the man \"made a comment about wanting to see me again and do what he did before. It led me to believe we had some sort of sexual contact.\", If so, the woman said, it was without her consent; she was incapacitated. \"I was in no state of mind\" to say yes to sex, she said. \"The memory is so, so foggy.\", A question of consent, Another risk factor: hookups. Sixteen percent of women described their dating status during most of college as \"hooking up from time to time.\" They were more likely to report being sexually assaulted or experiencing an attempted or suspected assault than those who were mostly in relationships or those who were not in relationships and not hooking up with anyone. The poll results suggested that women at colleges with fraternities and sororities were more likely to be assaulted. But statistical analysis found that several other campus characteristics were non-factors. It apparently made little difference whether the school was large or small, public or private, religiously affiliated or described by students as a \"party school.\" Nothing about the race, ethnicity, social class, study habits or religious practices of students predicted whether they would be victims. Three-fourths of all victims said they told someone about the incident  but only 11 percent told police or college authorities. This finding echoes what experts have long said: Sexual assault is a vastly underreported crime. Even though 73 percent of those polled said sexual-assault claims are rarely or almost never fabricated, many victims are reluctant to step forward because they fear repercussions. More than 4 in 10 women said it is very or somewhat likely that a woman will be criticized by other students if she reports an assault. A 19-year-old at the University of Michigan who suspects she was sexually assaulted after she got blackout drunk at a fraternity party explained why she didnt report it to authorities: \"I didnt want to start an entire thing. I didnt want that whole frat to have a backlash against me.\", She did, however, tell a male friend. His response ended their friendship. He said her suspicion about what happened was wrong: \"Theres a difference between having drunk, regrettable sex, and being raped,\" she recalls him saying. The students experience underscored one of the most divisive aspects of college sexual assault: The facts of any given incident, especially those left uninvestigated, are often in dispute. That gives rise to speculation about what happened and who was to blame. The poll found evidence that myths about sexual assault persist among students despite efforts in recent years to dispel them. Six in 10 women said it was a common attitude on their campuses that if a woman is sexually assaulted while drunk she is \"at least somewhat responsible.\" Nearly 6 in 10 women also said it was commonly believed that when women go to parties wearing revealing clothes, they are \"asking for trouble.\", Slight majorities of men said those attitudes were not common on their campuses. When posed a hypothetical situation in which they hear that a man is accused of sexually assaulting a woman on campus, about two-thirds of those polled said they generally believe the man is more to blame. About 3 in 10 said both people share blame. Almost none said the woman is more to blame. A 24-year-old woman who recently graduated from a private university in the Northeast said there were times as a student when she was so drunk that she was unable to consent to sex. She would wake up in bed with someone the next day and say to herself: \"What? This is not OK. I didnt agree to this.\", But she said the men involved might also have been too drunk. \"Whether the other person had the capacity to consent either is something to take into account,\" she said. \"So its like were both raping each other.\", In the past two years, colleges have begun urgent campaigns to prevent sexual assault. The poll found deep skepticism about some proposals. Seventy-three percent of those at schools with Greek-letter organizations said eliminating fraternities or sororities would have little to no effect. About half of all respondents voiced doubts about the effectiveness of a crackdown on alcohol. Instead, 9 in 10 said training students to disrupt potentially harmful situations would be effective  a technique known as bystander intervention. Nearly as many  85 percent  favored harsher punishments for those found guilty of sexual assault. Colleges have come under fire for leniency toward students they find responsible for sexual assault in disciplinary probes. Federal data show that colleges often reprimand or suspend students in such cases, or order them to undergo counseling, rather than expel them. Debate has emerged in recent years over whether colleges should be involved in sexual-assault probes at all. Nearly half endorsed the view that as a serious crime, sexual assault should be investigated only by the police. But 83 percent said that if a victim chooses not to go to police but still wants an incident investigated, schools should be required to do so. There was a gender split on another key question: whether it is more unfair for an innocent person to get kicked out of college after a sexual-assault accusation, or for a person who commits a sexual assault to get away with it. Men were divided, with 49 percent seeing expulsion of the innocent as the greater injustice and 42 percent taking the other side. But by a decisive 20-point margin, women viewed it as more unfair for an assailant to go unpunished. Kristina Erickson, 23, said she pursued punishment after her second sexual assault at Beloit College in Wisconsin. The first time, she said, she was \"kind of wrestling around\" in a dorm with a man she knew when things turned sexual. \"I told him to stop,\" she said. \"He thought I was joking. I froze.\", Erickson never reported that incident even though she later concluded it was rape. The second time, she said, a drunk man stuck his hand up her skirt in January 2013 as she walked past him in the crowded basement of a fraternity house. She shoved his hand away and yelled at him. Soon after, she filed a complaint with the college. A sanctions letter shows the alleged assailant received a suspension. Shortly before she graduated, Erickson decided enough was enough. She wanted to push the issue into the open. She wrote an essay for the student newspaper about her experience with sexual assault. It revealed that her mother also had been raped while she was a student at Beloit in the 1980s. \"I got a lot of texts, a lot of e-mails,\" Erickson said. \"People contacting me, saying, Hey, it happened to me, too. \", Anderson reported from Los Angeles, Washington and Kent, Ohio. Washington Post staff writers Emma Brown, Peyton M. Craighill, Steve Hendrix and Susan Svrluga in Washington contributed to this report. , Measuring sexual assault, Post/Kaiser survey was conducted by phone with professionally trained interviewers, A Washington Post/Kaiser Family Foundation survey found that 20 percent of current and recent female college students living on or near campus report being sexually assaulted while attending school. How did the survey arrive at this statistic?, Measuring the prevalence of sexual assault is a tricky task in surveys for two reasons. The first is definitional: Asking plainly whether a person has been sexually assaulted can produce unreliable results, as people disagree about what exactly that entails. The second is that respondents might not be willing to report a highly sensitive event such as sexual assault in a survey. In both cases, the most common potential error is that prevalence of sexual assault will be underestimated. \"Terms like sexual assault and rape  there are legal definitions for what those things are, and peoples understandings of what those things are often are not consistent with the legal definitions,\" said Christopher Krebs, a researcher at RTI International who led federally sponsored studies of sexual assault on college campuses. \"If you use those terms, youll dramatically undercount those incidents.\", To avoid ambiguity about terminology, the Post-Kaiser survey asked respondents about specific types of unwanted sexual contact or sexual assault and the scenarios in which they occurred. Respondents were each provided the same definition of relevant types of sexual contact, which included five different types of assault: forced sexual touching, oral sex, sexual intercourse, anal sex and sexual penetration with a finger or object. (Exact question wording and descriptions can be found after Question 49 in the survey instrument.) These descriptions were modeled off of the 2007 Campus Sexual Assault Study sponsored by the National Institute of Justice and led by Krebs. After receiving this definition, respondents were asked about circumstances in which they might have experienced these types of unwanted sexual contact. These included physical force or threat of force (Q52) and sexual contact when incapacitated and unable to provide consent or stop it from happening due to being passed out, asleep, drugged or drunk (Q54), including only incidents they are certain occurred. Both of these scenarios fit common legal definitions of sexual assault, and they are the source of the Post-Kaiser 20 percent estimate of sexual-assault prevalence among college women. Beyond these situations, the survey also asked about attempted sexual contact by physical harm, suspected (but uncertain) contact while incapacitated, and sexual contact stemming from non-physical threats or promises of rewards. In total, 25 percent of college women reported either sexual assault or another type of unwanted sexual contact. Reluctance of respondents to report sexual attacks is another challenge for measuring prevalence accurately. Sensitivity is \"based on the shame a woman or a man might feel, the fear of being isolated from your social groups,\" according to Ken Rasinski, an expert on measuring sensitive issues in surveys. \"There is a lot of publicity around the fear of not being taken seriously or being humiliated by officials who you might report this to or other authorities who might be trying to wash it under the table.\", In surveys about sexual assault, who is asking can matter in whether a victim is willing to report an incident. Rasinski, who did not review the survey prior to publication, described a worst-case scenario in asking about rape as \"youre a man and youre talking with a woman, and you come off as an authoritarian man and you say have you ever been raped recently, and it may be even worse in-person asking the same thing.\", \"Even under ideal circumstances, we still expect under-reporting,\" Rasinski says of surveys measuring sexual-assault experiences. But he notes that good measures of sexual-assault experiences will respect a persons privacy and self-esteem, carefully establishing a time frame in which incidents occurred and avoiding terms that might bring up fears of stigmatization. An ideal way to accomplish this is through an anonymous, self-administered survey, where respondents fill out an online survey or paper-and-pencil questionnaire in private. The Post-Kaiser survey was conducted by telephone (almost entirely reaching respondents on their cellphones) with professionally trained interviewers, as it was determined to be the best method to reach a random national sample of current and recent college students. Nearly all female respondents were matched to female interviewers to reduce sensitivity of reporting an unwanted sexual experience, and most male respondents were interviewed by men. Questions about unwanted sexual experiences were asked later in the questionnaire to ensure interviewers had an opportunity to establish rapport with respondents. Interviewers also received training on how to administer the questions accurately and handle respondents who were apprehensive about answering questions about sexual assault. For instance, trigger warnings were given noting that wording is explicit and could be upsetting and offering contact information for support services if needed. pre-testing of the questionnaire found interviewers could administer questions clearly and respondents were able to answer them. Breakoffs were relatively rare for respondents who began the survey: 89 percent of respondents completed the full interview. Most breakoffs occurred during the middle of the 25-minute interview, while about one-tenth of breakoffs occurred following questions about individual sexual-assault experiences. A potential limitation to the Post-Kaiser survey includes \"non-response\" bias, or the idea that survey respondents are different from non-respondents. As Krebs of RTI noted after reviewing the survey, low response rates can threaten a surveys ability to represent a population. The survey used random sampling procedures to identify young adults from national weekly polls of adults, for which the typical response rate is 8 percent to 10 percent. This is a common response rate for Random Digit Dial telephone surveys. To combat potential non-response bias, the final sample was weighted to population estimates for current and recent students at colleges and universities. A second potential limitation noted by Krebs is question order. Questions about sexual-assault experiences were asked after many questions about campus life, effective prevention methods for sexual assault and what qualifies as consent for sexual activity as well as demographics. While this ordering was aimed at building respondent rapport prior to asking sensitive questions on sexual experiences, Krebs notes it also could have primed respondents to think only about their preconceived definition of sexual assault rather than the definition provided in the survey. \"Since it used lots of those terms, it sent the message to respondents that this is what youre interested in,\" Krebs said. Asked how this might impact results, Krebs suggested \"it could have resulted in a suppression of the prevalence estimate.\", Despite challenges in measuring sexual-assault prevalence, one striking finding is the similarity in estimates from the Post-Kaiser survey reaching a nationally representative sample of respondents from more than 500 schools and the 2007 Campus Sexual Assault Study conducted at two unidentified universities in the Midwest and South. The Post-Kaiser survey found 20 percent of current and recent female students report being assaulted by force or while incapacitated, compared with 13.7 percent in the 2007 survey among current college students only. In a more apples-to-apples comparison, the Post-Kaiser survey found 21 percent of seniors and those who have left school said they were assaulted, compared with 19.8 percent of seniors in the two-university study. Given the margin of sampling error of both surveys, the difference between these two estimates is not statistically significant. Washington Post polling analyst Peyton M. Craighill contributed to this report. Link to complete poll results:, https://www.washingtonpost.com/graphics/local/sexual-assault-poll/]", "Date": "20150613", "Author": "[ Nick Anderson and Scott Clement]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-post-kaiser-poll-college-sexual-assault-20150613-story.html", "Title": "[ Post-Kaiser poll: 1 in 5 women say they were violated]"}