{"Content": "[ There is a segment of the American public  goodness knows if they are Republicans, ideological conservatives or even registered voters  that revels in raucous rhetoric, anti-government conspiracies and just plain nastiness in the name of anti-establishment politics. For a time they organized themselves into what became known as the tea party movement. They formed the audience for the most vicious and xenophobic talk radio hosts. They built micro-blogs and proclaimed themselves leaders of the \"conservative movement.\", They gave birth to groups such as Heritage Action, whose mission (aside from raising gobs of money) is to promote the idea that compromise and good governance are antithetical to conservatism. They aimed their fire on insufficiently pure conservatives and declared congressional leadership to be a threat to the party. They are populists on steroids for whom \"conservatism\" amounts to a reactionary strain of political entertainment. Their ideas  which include protectionism, opposition to free trade, defiance of the courts, isolationism and a return to pre-New Deal America  bear little resemblance to the modern conservative movement of Russell Kirk and Ronald Reagan. It is dark, pessimistic, angry and radical. Its this faction that brought us to the era of Donald Trump, the utter debasement of politics and the celebration of impulsive, aggressive sentiments in place of reasoned political debate. Its not much of a leap from Rush Limbaugh calling Sandra Fluke a \"slut\" to Trumps misogynistic tirades. While the subject matter may be different, the sophomoric escapade to shut down the government or calls to defy the Supreme Courts rulings are just one step away from Trumps stupid scheme to charge Mexico for each illegal immigrant. Its all of a piece  high-testosterone rhetoric percolating in a toxic brew of xenophobia and willful ignorance. Its not surprising that the predecessors of Trumpism in the GOP presidential race  e.g. Sen. Ted Cruz, R-Texas  are not only afraid to take him on but also have been eclipsed by him. The mainstream mediawould like us to believe that Trumpism is the essence of the GOP and of conservatism more generally. But the phalanx of thoughtful and accomplished 2016 presidential contestants, people who have actually accomplished conservative goals, refutes that. The class of freshman Senate grown-ups including Ben Sasse (Neb.), Dan Sullivan (Alaska) and Cory Gardner (Colo.) and the across-the-board defeat of wacky right-wing primary competitors in 2014 tells us that admirers of Trump are not the majority of the GOP. Trump now threatens to gobble up Trumpisms antecedents. The beast has turned on them. RedState founder Erick Erickson, who for years peddled in nasty rhetoric and defamed the \"establishment,\" discovers, \"Listen, if having common decency to other people makes you part of the establishment, I guess I am. I mean, if you cant be nice to someone who asks you a tough question, then okay, I guess I am. If being a member of the establishment is recognizing that there are bounds you shouldnt cross, and if you do you should apologize, then I guess I am.\" Well, isnt that rich? Erickson would like to blame the Republican Party for Trump, but the responsibility lies with him and others who promoted this style of politics and discourse for years. This time, hes gone too far. Thats what Republicans said after Donald Trump insulted Sen. John McCain, R-Ariz. over his military record, people lined up to criticize Trump and the partys leaders hoped this ridiculous (if entertaining) political reality show could finally be wound down. But... This time, hes gone too far. Thats what Republicans said after Donald Trump insulted Sen. John McCain, R-Ariz. over his military record, people lined up to criticize Trump and the partys leaders hoped this ridiculous (if entertaining) political reality show could finally be wound down. But... Serious conservatives who dabbled in Trumpism now see its full flowering. Less serious conservative racketeers (e.g. the groups who cheered the shutdown) see the limitations of its appeal and its embarrassing attributes. And GOP primary voters may have been roused from their slumber, aware there is, as former Texas Gov. Rick Perry put it, a \"cancer\" growing on conservatism. The presidential debates in this regard are a godsend. Trump and Trumpism are on full display. If one believes sunlight is an antiseptic to scurrilous characters, then Trump and his brand of politics will burn up and shrivel. There are at least a handful of accomplished, serious and conservative candidates who are capable of winning the nomination, leading the party and steering the right away from Trumpism. We will see who, in the weeks and months ahead, rises to the occasion. Washington Post, Jennifer Rubinwrites the Right Turn blog for The Post, offering reported opinion from a conservative perspective. For decades, Donald Trump has made flippant misogyny as much a part of his trademark as his ostentatious lifestyle. Now, the former reality-television host and current front-runner in the polls for the 2016 GOP presidential nomination may be paying a price for a boorish barb that also renewed his... For decades, Donald Trump has made flippant misogyny as much a part of his trademark as his ostentatious lifestyle. Now, the former reality-television host and current front-runner in the polls for the 2016 GOP presidential nomination may be paying a price for a boorish barb that also renewed his...]", "Date": "20150811", "Author": "[ Jennifer Rubin]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-anti-establishment-xenophobia-20150811-story.html", "Title": "[ How we got to Trumpism]"}