{"Content": "[ \"They have to do it. It will be done. If theres going to be a deal, it will be done.\", Secretary of State John Kerry on Iran coming clean about its past nuclear weapons work, PBS, April 8, 2015. One of the bedrock principles of the nuclear deal with Iran is that international inspectors are supposed to finally learn how far Iran advanced in building a nuclear bomb. Theyre supposed to verify Irans account by interviewing scientists and inspecting sites to ensure that Iran is telling the whole truth. All that is supposed to happen before the U.S. and its allies lift economic sanctions. But now U.S. officials tell Congress that Iran probably wont come clean on its covert nuclear weapons program now or ever. \"An Iranian admission of its past nuclear weapons program is unlikely and is not necessary for purposes of verifying (nuclear deal) commitments going forward,\" says the Obama administrations report to Congress. \"U.S. confidence on this front is based in large part on what we believe we already know about Irans past activities.\", Translation: The Iranians will probably lie or give incomplete information to the International Atomic Energy Agency about their past activities. And the U.S. and its allies will give Iran a pass, even though the IAEA has spent nearly a decade haranguing, threatening and cajoling Iran to come clean on its past nuclear weapons work. When President Barack Obama took office, he faced an Iran that had mastered the nuclear fuel cycle, had constructed a covert uranium enrichment facility inside a mountain, was on its way to installing nearly 20,000 centrifuges for uranium enrichment, was developing advanced centrifuges and was... When President Barack Obama took office, he faced an Iran that had mastered the nuclear fuel cycle, had constructed a covert uranium enrichment facility inside a mountain, was on its way to installing nearly 20,000 centrifuges for uranium enrichment, was developing advanced centrifuges and was... We dont know yet what Iran will or wont tell the IAEA. What we do know is this isnt a game of political gotcha with Iran. Its key to ensuring Iran cant quickly build a nuclear weapon. Obama and other Western leaders have touted this deal as a way to push back Irans break-out time  the weeks or months it would need to build a bomb should it decide to do so. But theres no way to make that break-out calculation accurately unless inspectors know precisely when Iran began work on nuclear weapons and how far that work progressed. That information will provide a baseline so the IAEA can design an effective verification program to assure that nuclear material isnt used for a bomb. Letting Iran slide on this before the deal goes into effect \"will signal to Iran, and any other state for this matter, that it can expect that intransigence on verification issues will succeed,\" \"writes nuclear expert David Albright of the Institute for Science and International Security. \"The agreement would start off already weakened and set a dangerous precedent.\", Tuesday dawned with word that Western and Iranian negotiators in Vienna produced an agreement to curb Tehrans outlaw nuclear program, after a 17-day negotiating marathon that capped 18 months of talks. President Barack Obama declared that the deal would shut off all pathways for Iran to build... Tuesday dawned with word that Western and Iranian negotiators in Vienna produced an agreement to curb Tehrans outlaw nuclear program, after a 17-day negotiating marathon that capped 18 months of talks. President Barack Obama declared that the deal would shut off all pathways for Iran to build... Theres another potentially dangerous precedent that has emerged in administration officials testimony before Congress. Under the main agreement, Iran is supposed to allow access to its military or civilian sites where IAEA inspectors suspect Iran has done nuclear weapons research and development. High on the list is Parchin, a military complex that the IAEA has tried to inspect for the last three years because experts believe Iran tested nuclear weapons-related equipment there before 2004. But now we learn from Congressional hearings that a separate Iran-IAEA accord could put Iran, not international inspectors, in charge of taking environmental samples at Parchin, under still-to-be-determined IAEA supervision. Sen. James Risch of Idaho of the Senate Foreign Relations Committee aptly compared that arrangement to allowing professional athletes suspected of drug abuse to mail in their own urine samples. Wed guess the Parchin inspection probably wont turn up much. Since the IAEA demanded to visit Parchin in 2012, Iran has had plenty of time to scrub and reconstruct the base. But Parchin is just one military facility that the IAEA should visit. What are the ground rules for all the others? Will Iran call the shots? Or will the IAEA? Thats unclear. Kerry and other U.S. officials tell Congress they dont have the confidential IAEA-Iran document so they cant turn it over. Please. Heres a simple two-step process for the administration to resolve these questions. Step one: Get the document from the IAEA. Step two: Turn it over to Congress. Congress must know whats in the deal and the separate side agreements before it votes. No surprises. No secret handshakes. If this bargain is as strong as the administration insists, it can withstand a burst of sunlight.]", "Date": "20150731", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-iran-nuclear-obama-congress-edit-20150731-story.html", "Title": "[ Iran deal: Trust. Maybe verify.]"}