{"Content": "[ As the dog days of summer wind down, its fun, at least in a self-flagellating way, to look back at the political antics of the past month. Yes, you may complain, but you also have to admit the following: In terms of entertainment value, August 2015 has actually been quite stellar. The obvious highlight, of course, is our nations most lovable billionaire/rotating policy smorgasbord, Donald Trump, a man who pinballs around the national consciousness like a wild-eyed, zesty, presanitarium Zelda Fitzgerald. When hes not giving free helicopter rides to kids at the Iowa State Fair and inspiring panic among weaker-kneed GOP competitors on immigration policy, hes bellowing through newsprint at people like supermodel Heidi Klum, an international treasure who, you might be saddened to hear, is apparently \"no longer a 10.\", Trump is often ridiculous, but in a fun way. American politics is always ridiculous, but almost never in a fun way. So you can see why we are where we are. Take Hillary Clinton, whose disastrous Tuesday press conference made us all rewonder what weve been quietly wondering for the past four months: How did this lady make it this far? Is she a robot behind that pantsuit? Why is she still here?, The answer to those questions, alas, may also explain why many Americans appear close to throwing up their hands, building a still in the backyard, putting up a permanent hammock and Slip N Slide network next to said still, and waiting for the meteor to come. In recent days, after all, it was discovered that in addition to using a shady private email account while acting as secretary of state, then hosting that account on an insecure \"homebrew\" server in her Chappaqua, N.Y. basement, and then sending sensitive information on the digital equivalent of a wayward homing pigeon, Clinton also chose a shady \"mom and pop\" IT shop in Denver to manage her private email system in 2013. That shops servers, employees report, were housed in an ultrasecure bathroom closet, presumably right next to the plunger, the Swiffer WetJet and a handful of listless, half-dead spiders. Heidi Klum Trumps Trump responding with Instagram video to his comment that Shes no longer a 10. Aug. 18, 2015 (Reuters), Heidi Klum Trumps Trump responding with Instagram video to his comment that Shes no longer a 10. Aug. 18, 2015 (Reuters), Seriously, who does this, especially someone as high-level as Hillary Clinton? Its almost like she had something to hide, you know? You cant make this stuff up, but when its revealed to the public, you can certainly dissemble. The FBI seized Clintons server last week, with sources telling NBC they were \"optimistic\" some data would be retrieved, despite an apparent attempt  or more  to wipe the server clean. Lets face it: \"Email-gate\" is Byzantine, bizarre and confusing. Its clear that Hillarys ultimate hope is that people will inevitably get so bored or fatigued that they a) no longer care, b) simply give up or c) reluctantly trudge to the moonshine and Slip N Slide out back. Hey, why not? Its not a terrible strategy. After all, with the Clintons, isnt that what happens every time?, Asked if her server had been wiped  and trust me, despite her apparent inability to work a fax machine, Americas diligent, self-made rogue email queen knows exactly what this means  the former secretary of state offered an exaggerated shrug: \"Like with a cloth or something?\" Yes, Hillary, like with a cloth. Lord knows we need to get all those bathroom closet spiders out! (Where are those nuclear codes again?), Donald Trump isnt the reason that Republican presidential candidates are taking positions on immigration that could harm the nominee in 2016. Trump or no, Republicans were sure to compete over who possesses True Conservative credentials, because, well, thats what Republicans do. Indeed, its... Donald Trump isnt the reason that Republican presidential candidates are taking positions on immigration that could harm the nominee in 2016. Trump or no, Republicans were sure to compete over who possesses True Conservative credentials, because, well, thats what Republicans do. Indeed, its... Hillarys email issues may come and go; they may also, if some glorious shift in the space/time continuum occurs, unseat her from power. But her server also serves as a powerful metaphor for our sprawling, increasingly absurdist and largely unaccountable federal government. Its a government that often makes things way more complicated than they need to be. Its also a government that inspires, at least for the average, outside-the-Beltway American, a dominant, growing sense of utter futility, paired with a quiet \"you cant be serious\" disbelief. Clinton would be happy to chat with you about it, of course, but shes off to her $100,000 Hamptons rental  two times the median household income in America  while the rest of us watch in wonder as immense wealth continues to flow into the hands of two obviously shady \"public servants.\" D.C. influence doesnt come cheap, of course. Neither do personal appearances at Goldman Sachs events. However, now that I think about it, Hillary did just release a vaguely imperious campaign ad about how she would personally \"reshuffle\" Americas economic deck. Given her family fortune, Im sure she would be somewhere in that card pile, too, right? Right?, That, of course, is a joke question. When you think about it, in comparison to the murky world of Hillary Clinton, it looks almost admirable to inherit a bunch of money from your dad, go bankrupt several times, build some hotels and golf courses, star in a few odd wrestling performances and reality shows, and single-handedly entertain America for a solid chunk of the summer. Take heart, everyone: Its only August. This, too, shall pass  but you might not want to put away that Slip N Slide just yet. RealClearPolitics, Heather Wilhelm is a writer based in Austin, Texas.]", "Date": "20150821", "Author": "[ Heather Wilhelm]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-hillary-clinton-perspec-0821-jm-20150821-story.html", "Title": "[ The summer of our discontent]"}