{"Content": "[ Whoever the woman is on the next $10 bill, heres who it shouldnt be:, A politician. A Cabinet member. A first lady. Put a poet there. A scientist. A musician with a social cause. A social worker. A teacher. A suffragette. An abolitionist. But, please, not someone primarily associated with politics. Since Wednesday, when the U.S. Treasury Department announced that a woman will finally star on our paper money, opinions have heated up over who that woman should be. The excitement is fun to watch, even if this is hardly an advance on par with the first moon landing. In fact, its a bit of a letdown to some people. The honoree will be on a $10 bill instead of on a $20, a disappointment to those who wanted to oust Andrew Jackson. The lucky winner wont have the whole bill to herself either. Shell have to co-habit with its current occupant, Alexander Hamilton. Move over Alexander Hamilton, a woman will soon grace the $10 note. The challenge will be figuring out just who fits the bill. And theres a caveat: She must be dead. The Treasury Department said this week that it plans to redesign the note, which now features Hamilton, to include a woman in history... Move over Alexander Hamilton, a woman will soon grace the $10 note. The challenge will be figuring out just who fits the bill. And theres a caveat: She must be dead. The Treasury Department said this week that it plans to redesign the note, which now features Hamilton, to include a woman in history... And the redesign wont arrive until 2020. Still, its a breakthrough. As others have cracked, a woman is about to shatter the cash ceiling, at least for the first time since Martha Washington, wife of George, appeared on a silver certificate in the late 1800s. But which woman?, A few women in the political realm are strong contenders. One is Frances Perkins. Perkins was U.S. secretary of Labor under President Franklin D. Roosevelt. She fought for child labor laws. She established the countrys first minimum wage and overtime laws. Ive heard her referred to as kickass, and she was. If she became the face on the next $10 bill, Id be proud to carry that cash. But the new currency is the perfect opportunity to think beyond Washington, D.C. to consider the fact that people with power and courage exist beyond the narrow political realm. Thats why first lady Eleanor Roosevelt, grand as she was, wouldnt get my vote. When I was thinking about this topic, someone asked me why we put peoples faces on our money at all. Whats one thing all the cash in your wallet has in common? The face of an old, white man. Granted, all of the men who adorn paper currency are historically significant to our nation. George Washington bravely led the troops during the Revolutionary War and was our first president. Abraham Lincoln... Whats one thing all the cash in your wallet has in common? The face of an old, white man. Granted, all of the men who adorn paper currency are historically significant to our nation. George Washington bravely led the troops during the Revolutionary War and was our first president. Abraham Lincoln... Why not put an excerpt of the Constitution instead?, Why not birds or butterflies, the way the Costa Ricans do?, Why not pizza?, The best answer, I think, is that people contain stories. Through individual stories we get to tell our bigger, collective ones. As Jacob Lew, the Treasury secretary, put it, \"Americas currency is a way for our nation to make a statement about who we are and what we stand for.\", Who we are extends into art and culture, the environment and education, social work, and while all of those overlap with politics, theyre different too. Other countries have acknowledged that fact on their money for a long time. The women on the Swedish krona include an opera singer and a Nobel Prize-winning writer. Turkey, Mexico, New Zealand and Australia all have women on their paper money. England plans to put the 19th-century writer Jane Austen on its 10-pound note. Regardless of which woman winds up on our money, the discussion about it is useful. Thinking and talking about it is a way to review history and learn it. I was entertained by the names that popped into my mind when I pondered candidates. What about Louisa May Alcott?, She was a feminist, abolitionist and the author of \"Little Women,\" a book that has inspired generations of plucky girls. I wouldnt mind carrying her around in my wallet. How about Jane Addams?, That woman did everything. She was a writer and philosopher. She campaigned for womens right to vote. As the co-founder of Hull House in Chicago, she helped immigrants and the poor. She won the 1931 Nobel Peace Prize. Handing Jane Addams to a cashier would make me stand up taller. Rosa Parks, who bravely rode that segregated bus in Alabama? Shes high on my list too. But when the argument is over, I hope the winner is the apparent front-runner, Harriet Tubman. I hadnt thought of Tubman in years, frankly, but reminded of her life  an abolitionist born to slaves  I cant imagine anyone better to represent who weve been and who we hope to be. Whoever it is, its good to be reminded that the cash we carry represents the stories we tell ourselves. mschmich@tribpub.com, Twitter @MarySchmich]", "Date": "20150618", "Author": "[ Mary Schmich]", "Link": "http://www.chicagotribune.com/news/columnists/schmich/ct-who-on-10-bill-mary-schmich-met-20150618-column.html", "Title": "[ Woman's face on U.S. currency shouldn't be a politician's face]"}