{"Content": "[ The Community Unit School District 95 School Board of Education has welcomed two new board members, Chris Ketcham and Tony Schneider, who aim to use their unique talents to help sustain the positive momentum started by the existing and former members of the board. Ketcham and Schneider, who ran to fill the four-year terms that former school board member Jim Burke and former board president Tony Pietro left behind, were sworn into their respective roles at an April 30 meeting. As the parent of a special needs child, Ketcham said that he plans to advocate for special education within the district, \"armed with the unique experiences and perspective of a special needs parent.\", Though he joined without any agenda in mind, Ketcham said, \"in particular, the continued adoption and integration of technology within the district is an important priority established by the previous board that I hope to maintain.\", This is also a priority for Schneider, who noted that \"investment in the latest technology to enhance the districts record of academic excellence\" was one of his key issues. Another key issue for Schneider is to ensure that the district maintains fiscal discipline with respect to its annual budget. Schneider, who received a bachelors degree in business administration from the University of Iowa and a masters degree from Central Michigan University, is currently general manager of a privately-held financial services firm in Downers Grove, a position that hes held for the past nine years. He and wife Celia have lived in Hawthorn Woods for the past 13 years. One of their two children, now adults, attended school in District 95, graduating from Lake Zurich High School in 2005. Ketcham is currently vice president of underwriting for Great American Insurance Group. He has worked within the companys executive liability division for the past 19 years. He holds a bachelors degree in business administration from Miami University in Oxford, Ohio, and an MBA from the University of Illinois at Chicago. Ketcham, wife Kim and their three children have also lived in Lake Zurich for 13 years. All of their children attend different schools within the district--Lake Zurich High School, Middle School North and May Whitney Elementary School. Laura Pavin is a freelance reporter for Pioneer Press.]", "Date": "20150511", "Author": "[ Laura Pavin]", "Link": "http://www.chicagotribune.com/suburbs/lake-zurich/news/ct-dfr-new-d95-members-tl-0514-20150511-story.html", "Title": "[ Newcomers outline priorities for District 95 board]"}