{"Content": "[ What is the best lie that Hillary Clinton has ever told?, Can you pick just one?, Shes the inevitable Democratic presidential candidate even though 60 percent of Americans consider her a liar. So her pants suits are always on fire, and only a Hillary Meat Puppet would say otherwise. Yet rather than criticize her  like those other men who just dont get it  Id like to celebrate her amazing truth-bending superpowers. Weve had males in high office who were great liars, like her husband. So why cant we have an awesome female liar, say a shrewd Mistress of Big Fat Whoppers?, Whats more, Hillary can speak in accents. Shes as adept in dialects as any student of Professor Henry Higgins: Hillary watchers have already heard Hillary speak Chicago, New York, Tammy Wynette and that famous imitation of the Rev. James Clevelands \"I Dont Feel No Ways Tired\" to name but a few. Accents are her special talent. Instead of X-ray eyes or the ability to command storms, or move metal like Magneto, Hillary has her own superpower: She can pander to black audiences by talking like an African-American preacher singing a spiritual and get away with it. Hillary Clinton lies. This is a widely acknowledged fact among people who pay attention and arent on her payroll. Nearly 20 years ago, New York Times columnist William Safire wrote: Americans of all political persuasions are coming to the sad realization that our first lady  a woman of undoubted... Hillary Clinton lies. This is a widely acknowledged fact among people who pay attention and arent on her payroll. Nearly 20 years ago, New York Times columnist William Safire wrote: Americans of all political persuasions are coming to the sad realization that our first lady  a woman of undoubted... If thats not an amazing power, what is?, Some might call her shameless. But Id call her Homeric. Just last April, in Iowa, she wowed the locals with the saga of her immigrant grandparents struggling to make it in the New World. \"I think if we were to just go around this room, there are a lot of immigrant stories,\" Clinton said at an Iowa produce distributor. \"All my grandparents, you know, came over here.\", In reality, except for her paternal grandfather, her grandparents were born here. Her campaign acknowledged the error. Oops. In a March 5, 2008, interview with CNN, she claimed that as first lady in the 1990s, \"I helped bring peace to Northern Ireland.\", Others at the negotiations remembered her not. \"Hillary Clinton was totally invisible at the actual negotiations,\" the Daily Telegraph quoted Peter King, an Ulster Unionist Party negotiator, as saying. Lord David Trimble of Lisnagarvey  who shared the Nobel Peace Prize afterward  said Hillarys boasts were a \"wee bit silly.\", Republican Chris Christie has just announced he doesnt want to be elected prom king of America. Whew! Thats a relief. The nation was terrified hed put on a white dinner jacket, red cummerbund and fox trot across Iowa in patent leather pumps. Meanwhile, Democrat Hillary Clinton has got to be... Republican Chris Christie has just announced he doesnt want to be elected prom king of America. Whew! Thats a relief. The nation was terrified hed put on a white dinner jacket, red cummerbund and fox trot across Iowa in patent leather pumps. Meanwhile, Democrat Hillary Clinton has got to be... \"I negotiated open borders to let fleeing refugees into safety from Kosovo,\" Mrs. Clinton told CNN in 2008. But she wouldnt go that far in her own biography, \"Living History,\" in which she described her trip as one of support and little more. Nothing matches her hair-raising account of landing in Bosnia and dodging sniper fire. \"I remember landing under sniper fire,\" then-Sen. Clinton said during a 2008 foreign policy speech at George Washington University. \"There was supposed to be some kind of a greeting ceremony at the airport, but instead we just ran with our heads down to get into the vehicles to get to our base.\", But no one could remember that she was shot at in Bosnia. Why? Because it never happened. Politifact.com slapped her with the dreaded \"Pants on Fire\" rating for that one. And even though her pants suits were smoking, Hillary made it all about her humble nature, saying it \"proves Im human.\", If shes truly human, she can prove it by hiring fibber Brian Williams as her press secretary and he can someday tell the tale of how he and Hillary helped the 300 Spartans defeat Iran. There are her lies about Benghazi of course, when she was secretary of state, the worst being that the deadly attack in Libya that left four Americans dead  including the ambassador  was prompted by a homemade video. Now, at this point, what difference does it make?, Another alleged Benghazi lie was her recent assertion (again on CNN) that she did not receive a congressional subpoena for thousands of deleted emails that she kept on a private server in apparent violation of federal law. \"Youre starting with so many assumptions,\" Clinton said about subpoenas. \"Ive never had a subpoena. Again, lets take a deep breath here.\", While we waited to exhale, it turned out that Hillary had indeed been subpoenaed by Congress. Holy Lois Lerner!, Then there was that time of extreme poverty, when she left the White House with Bill on that cold winter in 2001. \"You have no reason to remember, but we came out of the White House not only dead broke, but in debt,\" Clinton told ABC News. But she could afford a $2.85 million home. And four years later, according to Politifact, she was the 10th wealthiest member of the Senate. \"You know if you find a turtle on a fence post, it didnt get there by accident,\" Hillary said in a 1998 interview on \"Good Morning America\" referring to those conspirators out there who were just dying to get her and Bill. \"And I just look at the landscape around here, and I see just lots of big ol turtles sitting on lots of fence posts. And I think we need to find out how those ol turtles got on those fence posts,\" she said. Hillary spoke in a nice, rounded Southern accent and her eyes were big, like that friendly Southern TV cook who fried just about everything. Now, with the media consumed by Donald Trumps carnival geek show, Clinton raises cash and waits. I figure that if she is elected president with Americans believing her to be a liar, youll see something amazing:, Youll see a mess of turtles wigging out in silent turtillian panic on fence posts all across America. And Hillary will have put them there. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150714", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-hillary-lies-met-0715-20150715-column.html", "Title": "[ Our hero: Hillary Clinton, the last truth bender]"}