{"Content": "[ One day when I was 23 years old, back in 1977, I was hanging out at Lake Michigan when my friends dog knocked my shoes in the lake. I dove in to retrieve them and broke my neck, leaving me paralyzed from the chest down. It didnt take long to realize my world had changed. People immediately treated me differently because of my wheelchair  I lost my job as a nurse, I lost my home, I lost my health insurance. I couldnt use public transit, and I couldnt get into many public places without entering through the service entrance  that happened more times than I care to remember. America in 1977 was a completely different country for those with disabilities. The prevailing message I kept hearing was that I needed to \"adjust to my disability.\" It never occurred to me that society had it wrong. In spite of my activist spirit and the historical civil rights context in which I was raised, I was on my own to \"cope\" with this new reality. Then a life-altering thing happened  I went to Berkeley, Calif. to attend a conference on disability. The world was different there. People with disabilities were visible everywhere; curb cuts, accessible buildings and accessible bathrooms were the norm. Even the bus had a wheelchair lift. Activists made those changes happen. No longer did I see curbs or stairs or inaccessible buses and bathrooms as a problem around which I needed to navigate. Rather, I saw them as examples of societal discrimination  and felt a responsibility to get involved to help people with disabilities, in Illinois and beyond. Life can change in a second. Marca Bristo knows that. Her second happened in 1977. The then-23-year-old world traveler and career woman inhaled deeply as she watched the waves on Lake Michigan. Next, she dove headfirst into the blue water and  suddenly  into life with a disability. \"Zap,\" she said,... Life can change in a second. Marca Bristo knows that. Her second happened in 1977. The then-23-year-old world traveler and career woman inhaled deeply as she watched the waves on Lake Michigan. Next, she dove headfirst into the blue water and  suddenly  into life with a disability. \"Zap,\" she said,... My story is not unique. People with all different disabilities were connecting and creating the movement that would change the world as we knew it. Hundreds of people with disabilities were organizing, claiming our disabilities and speaking out against discrimination we faced in everyday life. Having shed the stigma which trapped us, we set about to correct that. This ragtag army of people who couldnt see, hear, walk and talk did what everyone said couldnt be done  we passed the most comprehensive civil rights law since the passage of the 1964 Civil Rights Act. Signed into law on July 26, 1990, by President George H.W. Bush, the Americans with Disabilities Act ushered in a new paradigm of disability policy  inclusion, not exclusion; independence, not dependence; and empowerment, not paternalism. This law called for lifts on buses; accessible facilities, streets and public services; accessible ATMs; access to telecommunications and the workplace and so much more. The ADA gave us the legal tools we needed to fight discrimination, but it also represented a symbolic victory. We had a new national policy on disability that recognized  in law for the first time  that disability is a natural part of the human condition, and the world had to change to let us in. The Americans with Disabilities Act will be 25 years old on July 26 and those who have labored to develop it and raise consciousness of it continue to fret over continuing barriers to transportation; employment and communication. \"Im fortunate to drive,\" said Stella Guzman, Project Coordinator... The Americans with Disabilities Act will be 25 years old on July 26 and those who have labored to develop it and raise consciousness of it continue to fret over continuing barriers to transportation; employment and communication. \"Im fortunate to drive,\" said Stella Guzman, Project Coordinator... Today, 25 years after that day, America has changed so much that we almost take some of the changes for granted. The lives of people with all types of disabilities  physical, developmental, psychosocial  have significantly changed for the better. I can already see perceptional transformation in my children and their friends  who dont think twice about my disability  which gives me great hope in this next generation. But there is still much room for progress before the true promise of the ADA is fulfilled. Too many people remain shuttered away in institutions despite the right to live in the most integrated settings. A large gap in education and degree attainment persists between students with and without disabilities. People with disabilities by and large remain the most unemployed and underemployed constituency within the country. In addition to the education systems that fail to prepare us to transition out of school, we confront a stigma that equates disability with an inability to work. Despite that stigma, the majority of people with disabilities want to work. And when hired, their supervisors rank them as among their highest contributing and most loyal employees. Similar challenges exist within community living and technology  and those doors must not remain closed to people with disabilities. Though we have accomplished so much in the past 25 years, we have an enormous responsibility to preserve what we have gained, particularly in light of recent proposed budget cuts that would devastate special education services and community-based services. Its vital that the next 25 years bring full inclusiveness and equality of opportunity for all. When we do that, we will break down barriers and create a community envisioned by the original champions of the Americans with Disabilities Act. Marca Bristo is the CEO of Access Living, a disability services and advocacy organization, and a co-chair of ADA25 Chicago, a regional partnership initiative leveraging the 25th anniversary of the ADA to improve access, inclusion and equality of opportunities for people with disabilities.]", "Date": "20150723", "Author": "[ Marca Bristo]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-ada-disabilities-act-bristo-perspec-0724-jm-20150723-story.html", "Title": "[ For people with disabilities, 25 years under the ADA has opened a new world]"}