{"Content": "[ The prosecutor on the University of Notre Dames home turf has a message for victims of campus sexual attacks: Rather than go to university police, they should directly report sex crimes to a county special victims unit. Amid a growing national discussion of campus sex assault, St. Joseph County Prosecutor Ken Cotter said he would prefer that all campus sex assaults be handled by the countys special victims unit rather than the campus police, which the university recommends. Notre Dame has declined to participate in the unit, although Cotter and his predecessor have previously asked it to join. \"I would feel more comfortable if they were part of the special victims unit,\" Cotter said. \"I would rather have those cases investigated by the (unit).\", Cotters comments to the local paper, the South Bend Tribune, come as Vice President Joe Biden makes the rounds at college campuses to promote the Obama administrations \"Its On Us\" initiative, which asks college administrators and others to stand up against sexual violence. Its part of a push to give victims more rights and hold colleges and universities accountable for how they respond to sexual attacks. According to a White House task force on sexual assault, 1 in 5 women are sexually attacked in college, most often by someone the woman knows. Twelve percent of those assaults are reported, and charges are only brought in a fraction of those cases. Tom Seeberg, whose daughter Elizabeth \"Lizzy\" Seeberg reported in 2010 that a Notre Dame football player sexually attacked her, said Monday he is convinced the special victims unit would have done a more thorough investigation. \"These cases should be investigated not just for independence and transparency, but also for competence,\" Seeberg said. \"If a special victims unit had been involved in Lizzys case, I am certain they would have immediately seized and investigated all communications, including the phone records, of all those involved.\", Cotter, in his published interview, did not mention past criticism from some students, parents and victim advocates about how Notre Dame has handled complaints of campus sexual attacks. Vice President Joe Biden stood in front of a room of University of Illinois students Thursday and talked candidly about a subject that has long been taboo on college campuses. His message was clear: It is up to them  particularly young men  to reject the quiet tolerance of sex assault and stand... Vice President Joe Biden stood in front of a room of University of Illinois students Thursday and talked candidly about a subject that has long been taboo on college campuses. His message was clear: It is up to them  particularly young men  to reject the quiet tolerance of sex assault and stand... In particular, the women and their families complained that campus police delayed interviewing suspects and that months passed before the university resolved cases. They also accused the universitys internal discipline process of being cold and demeaning toward alleged victims. Notre Dame spokesman Paul Browne said Monday the university has declined invitations to join the victims unit because the school can handle the investigations itself. He said victims always have been free to report crimes to any police department. \"Locally, St. Josephs County and the Indiana State Police have jurisdiction to investigate crimes, including sex crimes, anywhere in the county, including college campuses,\" Browne said in an email. \"In addition to professional services provided routinely and expertly by the Notre Dame Security Police Department, the county prosecutors investigative resources are always available to the Notre Dame community. Notre Dame Security Police promptly notifies the countys special victims unit of sexual assaults on campus, and works closely with the prosecutor on these and other criminal matters.\", The unit, made up of 11 detectives drawn from the countys major police departments, last year investigated 139 allegations of adult sex crimes. Notre Dame campus police handled 15 reported sex crimes in 2013, according to school figures supplied to the federal government. Jessica McBrier, a spokeswoman for Cotter, said he was not doing any further media interviews on the topic. \"We have broached the subject to Notre Dame and would welcome their participation in the unit,\" McBrier said. Perhaps no case better exposed the shortcomings of how Notre Dame campus police have handled reports of sexual attacks than that of Seebergs daughter. Lizzy Seeberg was a freshman at neighboring Saint Marys College when she met Notre Dame football player Prince Shembo. Seeberg, who battled depression and an anxiety disorder, provided her account of what happened Aug. 31, 2010, in a typed statement to campus police. She said she was alone with Shembo in his room when she began to feel uncomfortable with the conversation. \"I started feeling as though I was in danger,\" she wrote. \"I didnt feel safe in his room.\", Seeberg described how she cried and her body froze as the alleged attack began. Her allegations did not describe penetration; the campus police log listed the complaint as an alleged sexual battery. She said Shembo licked her breast. The incident ended when the players cellphone distracted him, Seeberg said. On Sept. 2, she received a text message from one of Shembos friends, telling her, \"Dont do anything you would regret. Messing with notre dame football is a bad idea.\", She killed herself Sept. 10, overdosing on prescription medication. She was 19. Shembo, who is now with the NFLs Atlanta Falcons, has said that he did nothing wrong, had \"nothing to hide\" and that he stayed silent about the accusations under orders from Notre Dame head football coach Brian Kelly. The Tribune in November 2010 reported that campus authorities did not initially tell county police about Seebergs report, nor did campus police refer the case to the countys special victims unit. Seebergs parents questioned the campus police departments delay in interviewing Shembo, their reluctance to obtain phone records related to her case and the lack of transparency in the investigation. Police didnt interview Shembo until Sept. 15  14 days after Seeberg reported the alleged attack and five days after her suicide. Tom Seeberg said Notre Dame conducted a superficial investigation into his daughters accusations. \"Of course, anyone could have done a better job than campus police,\" Seeberg said. Connie Adams, director of the Belles Against Violence Office at Saint Marys, said the groups standard guidance to victims of a sexual attack on Notre Dames campus has included the option to notify university police. Now, she said, her group plans to tell victims they can also go to the special victims unit. \"Knowing those options could be very significant,\" said Adams, who is on Notre Dames Committee on Sexual Assault Prevention. Pat Cottrell, a former investigator on Notre Dames police force, said he agreed with Cotter. Cottrell was featured in the documentary film, \"The Hunting Ground,\" which chronicled problems in the handling of sex assault cases on college campuses, including Notre Dame. \"I think (Notre Dame) should change their policy and have the county (special victims unit) lead all sex assault investigations on campus,\" Cottrell wrote in a text message, noting that an outside unit already handles homicide investigations. \"Why not sexual assaults?\" he asked. tlighty@tribpub.com, cdizikes@tribpub.com, Twitter @tlighty, Twitter @cdizikes]", "Date": "20150511", "Author": "[ Todd Lighty, Cynthia Dizikes]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-notre-dame-prosecutor-met-20150511-story.html", "Title": "[  Prosecutor has message for victims of sexual assault at Notre Dame]"}