{"Content": "[ The U.S. will fall way short of meeting its goal of training 24,000 Iraqi forces to fight Islamic State militants by this fall, Defense Secretary Ash Carter said Wednesday on Capitol Hill where lawmakers are already skeptical of the Obama administrations strategy to address threats in the Mideast. Carter told the House Armed Services Committee that the U.S. has received only enough recruits to train about 7,000  in addition to about 2,000 counterterrorism service personnel. \"Our training efforts in Iraq have thus far been slowed by a lack of trainees. We simply havent received enough recruits,\" Carter said at a nearly three-hour hearing. \"Our train and equip mission in Syria has been challenging, but the requirement for capable and motivated counter-IS ground force there also means we must persist in our efforts.\", Obama withdrew U.S. forces from Iraq in late 2011 and has vowed not to send Americans back into combat there. The Iraqi military, which was equipped and trained by the United States, has struggled to recover from its collapse a year ago when IS militants captured the countrys second largest city, Mosul, and swept over much of northern and western Iraq. Iraqi commanders fled, pleas for more ammunition went unanswered, and in some cases soldiers stripped off their uniforms and ran. The U.S. is again training Iraqi forces and conducting airstrikes in both Iraq and Syria. The White House announced last week that it was sending up to 450 more U.S. troops to a new base in the Anbar province of western Iraq, mainly to advise the Iraqis on planning and execution of a counteroffensive to retake Ramadi, the provincial capital. A White House spokesman said Iraq is a chaotic place on June 17, 2015, but U.S. forces are winning more support from Sunnis. (Reuters), A White House spokesman said Iraq is a chaotic place on June 17, 2015, but U.S. forces are winning more support from Sunnis. (Reuters), Gen. Martin Dempsey, chairman of the Joint Chiefs of Staff, has said that more such U.S. hubs could be opened elsewhere in Iraq as the campaign advances. Staunch critics in Congress have argued that the current strategy is weak and that it could be strengthened by deploying U.S. troops as spotters for airstrikes. The Pentagon thus far has avoided putting tactical air controllers in the field with Iraqi ground forces and remains opposed to putting U.S. boots on the ground. \"I would not recommend that we put U.S. forces in harms way simply to stiffen the spine of local forces,\" Dempsey told the committee. \"If their spine is not stiffened by the threat of ISIL on their way of life, nothing we do is going to stiffen their spine,\" he said using an acronym for the Islamic State. Dempsey, who is finishing a four-year stint as the Pentagons top general, said that when the local forces are going against a strategic target, the Pentagon might see how U.S. forces could help ensure the local forces chances of success  \"but not just to stiffen their spine.\", Asked whether the 450 extra troops will make a difference in the fight against IS, Carter said the numbers are not as significant as the location, which is in the heart of Sunni territory. The U.S. is pushing for a more inclusive government in Baghdad that is representative of Sunnis, Shiites and Kurds, Iraqs three major ethnic groups. At the White House, press secretary Josh Earnest defended the White House strategy in Iraq, saying 1,000 new Sunni fighters were inducted into the Iraqi popular mobilization force last week. \"I understand that even just today, another ceremony was held where several hundred additional Sunni local fighters were inducted,\" he said. After the hearing, Republican Rep. Mac Thornberry of Texas, the panels chairman, that hes not sure that Carter or Dempsey persuaded the committee that the U.S. strategy would be successful in battling IS. \"So were opening a new facility in a different part of Iraq to train and we hope they come flooding in and they will be trained and effective and then well see if we can support them. It just doesnt give you a lot of confidence that this thing is on the right track,\" Thornberry said. Rep. Adam Smith, the committees ranking Democrat questioned whether its not time to admit that Iraq is too fractured to continue trying to work through the central government in combating IS. He asked whether Baghdad should be told, \"times up,\" and the U.S. cannot afford to continue hoping a government of national unity can be established. \"As Ive said many times before, that cow has left the barn. Iraq is fractured. You can make a pretty powerful argument, in fact, that Iraq is no more,\" Smith said. Rep. James Langevin, D-Rhode Island, also wondered aloud if U.S. involvement in Iraq was a futile exercise given the divisions between the Kurds, Shiites and Sunnis. \"Are we trying to artificially hold together an Iraq that doesnt want to be held together?\" he asked. Carter said there are indications that there can be a decentralized but multi-sectarian one Iraq under Iraqi Prime Minister Haider al-Abadi, who the U.S. believes is more willing to set up a representative government than his pro-Shia predecessor, Nouri al-Maliki. \"I think we ought to give them a chance because thats the best outcome,\" Carter said. \"Sectarianism is not a good outcome there. Weve been to that movie.\", Rep. Tammy Duckworth, a former Army National Guard helicopter pilot who lost her legs when her aircraft was hit by a rocket-propelled grenade in 2004 in Iraq, said she had deep reservations\" about the U.S.-led mission to train and equip Syrian opposition forces. She said she was especially concerned about the vetting of the trainees and what happens when they are attacked by IS militants or forces loyal to Syrian President Bashar Assad. Carter said that in Syria, there are enough training sites, but not enough trainees to fill them because its difficult to make sure the recruits are people who can be counted on and are not aligned with groups like IS. \"It turns out to be very hard to identify people who meet both of those criteria,\" Carter said. Associated Press]", "Date": "20150617", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-training-iraq-troops-20150617-story.html", "Title": "[ U.S. to train just one-third of expected Iraqi troops to combat Islamic State: official]"}