{"Content": "[ Vermont U.S. Sen. Bernie Sanders took his upstart campaign to the home state of his front-running rival Monday night, packing a boutique Chicago theater to capacity as he made his pitch for the Democratic presidential nomination. A crowd sipping beers and cocktails under the glow of a disco ball chanted and cheered as the liberal firebrand railed against \"establishment politics ... establishment economics and establishment media.\", Sanders is riding an unlikely wave of popularity in the early days of the Democrats presidential nominating contest, which many have considered a lock for Park Ridge native Hillary Rodham Clinton. The veteran senator has packed stadiums on the West Coast and drawn hordes at the Iowa State Fair. By comparison, Mondays event was a low-key affair  a $50-per-person fundraiser that drew more than 600 people. But attendees still got the Sanders experience that has come to define his campaign: a nearly hourlong speech punctuated by repeated references to the countrys growing wealth divide. Appeals to the crowd as \"brothers and sisters.\" Pledges to provide tuition-free college, enact a $15-an-hour federal minimum wage and go after corporations that avoid paying taxes by parking money overseas. \"When we talk and use words like greed, fraud, dishonesty and arrogance, these are just a few of the adjectives to describe Wall Street,\" Sanders said. \"I find it very interesting that some kid who gets picked up for smoking marijuana can have an arrest record, but the crooks who destroyed our economy dont.\", Bernie Sanders draws a big crowd in his first appearance in Chicago as a presidential candidate. CBS 2s Jim Williams reports the crowds came to the Park West curious and committed. Bernie Sanders draws a big crowd in his first appearance in Chicago as a presidential candidate. CBS 2s Jim Williams reports the crowds came to the Park West curious and committed. While he made no mention of Clinton by name, Sanders sought to differentiate himself from the former secretary of state, asserting that he was one of the few candidates in the race who had refused to establish a super PAC  a much-maligned campaign finance vehicle that allows for the collection of unlimited contributions from corporations, unions, associations and individuals. \"I dont believe in the agenda of corporate America, I dont believe in the agenda of the billionaire class, and I dont want their money,\" Sanders said. Sanders focus on economic issues has drawn criticism recently from activists who argue that it ignores problems of institutional racism. Earlier this month, a Sanders rally in Seattle was interrupted when members of Black Lives Matter stormed the stage and took over his microphone. The incident sparked a wave of chatter on social media over Sanders platform and its appeal to minorities. In Chicago, Sanders devoted a portion of his speech to the issue, saying he was \"appalled and outraged\" by police shootings of unarmed African-Americans. With a background in horse racing, the Duchossois family knows how to hedge its bets, something its doing when it comes to the 2016 Republican presidential race. Arlington International Racecourse Chairman Richard L. Duchossois has given money to super political action committees behind former... With a background in horse racing, the Duchossois family knows how to hedge its bets, something its doing when it comes to the 2016 Republican presidential race. Arlington International Racecourse Chairman Richard L. Duchossois has given money to super political action committees behind former... \"I know you do not want to see any more of those videos of a black woman thrown out of her car,\" Sanders said, a reference to a Naperville woman who was found dead in a Texas jail cell after she was arrested during a traffic stop. \"Whats her name, Bernie?\" someone in the crowd shouted. Reciting the names of victims of police violence is a hallmark of the Black Lives Matter movement. \"Her name is Sandra Bland,\" Sanders said. kgeiger@tribupub.com, @kimgeiger]", "Date": "20150818", "Author": "[ Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-bernie-sanders-chicago-fundraiser-met-0818-20150817-story.html", "Title": "[ Bernie Sanders rails against establishment politics during Chicago stop]"}