{"Content": "[ The Iranian nuclear deal is a historic agreement that could significantly delay, and perhaps prevent, Iran from getting nuclear weapons. But what if the deal fails? Either Iran or a future U.S. administration could walk away from this deal. What could Iran do with nuclear weapons if it were to acquire them?, Pundits and scholars have tended toward extremes in answering this question. Optimists argue that nuclear weapons are not much use for anything other than deterring nuclear attack. Nuclear weapons, therefore, would not enable Iran to do much in international politics that it cannot already do. Pessimists argue that nuclear weapons are powerful tools of international statecraft. According to this view, acquiring nuclear weapons would enable Iran to engage in a range of behaviors that are currently too dangerous for Iran to undertake. In truth, the picture is more complicated than the optimists or pessimists suggest. How might Iran use nuclear weapons?, First, Iran might use the weapons as a shield behind which to engage in aggression  the more belligerent pursuit of existing goals. For example, Pakistan uses nuclear weapons as a shield behind which it can more aggressively pursue long-standing territorial claims against India without fear of retaliation. Historically, however, states facing severe territorial threats are most likely to behave more aggressively after nuclear acquisition. Iran, by contrast, is a reasonably powerful state surrounded by weak and unstable neighbors  and so it is less likely to use nuclear weapons to become more aggressive. Iraqs prime minister, Haider al-Abadi, is taking severe steps to rid himself of his troublesome predecessor, Nouri al-Maliki. On the heels of government shakeup, the latest move is a parliamentary report blaming al-Maliki and many of his political and military leaders for the fall of Mosul to... Iraqs prime minister, Haider al-Abadi, is taking severe steps to rid himself of his troublesome predecessor, Nouri al-Maliki. On the heels of government shakeup, the latest move is a parliamentary report blaming al-Maliki and many of his political and military leaders for the fall of Mosul to... Second, nuclear weapons can be used to facilitate expansion  the widening of a states goals and interests in international politics. The United States is an example. After World War II, the U.S. used its nuclear capabilities to undergird an expansive and historically unprecedented set of alliances that spanned the world and endure to this day. But post-war America faced a uniquely favorable strategic environment that made widespread expansion feasible and attractive. Iran does not. Third, many states  including Britain, France and North Korea  have used nuclear weapons to permit greater independence from their senior allies. Indeed, fear of that independence has frequently driven the United States surprisingly vigorous efforts to prevent even its allies from acquiring nuclear weapons, as several scholars have documented. To the extent that Irans senior allies  Russia and China  now constrain Iranian behavior, we might expect Iran to behave more independently upon acquiring nuclear weapons. But Russia and China are (at best) loose allies of Iran, so this effect is likely to be limited. \"This is one of the most serious national security, nuclear nonproliferation, arms control issues of our time,\" Senator Menendez says, rejecting a proposed nuclear deal with Iran. Aug. 18, 2015. (Reuters), \"This is one of the most serious national security, nuclear nonproliferation, arms control issues of our time,\" Senator Menendez says, rejecting a proposed nuclear deal with Iran. Aug. 18, 2015. (Reuters), Fourth, many states, including China and the United States, have used their nuclear weapons to strengthen or bolster their allies. For example, states can transfer nuclear technologies, offer extended nuclear deterrence, or funnel conventional military resources to their allies. Iran might try to bolster its allies and regional proxies to a greater degree after nuclear acquisition. But Iran supporting its proxies in the region is nothing new, and U.S. policymakers are well-versed in efforts to contain and counter these efforts. Finally, states have often used nuclear weapons to more steadfastly defend the status quo and resist challenges to their position. This may be the most likely outcome if Iran gets nuclear weapons, but it should also be the least worrying. Nuclear states work hard to preventnuclear proliferation, Nevertheless, the United States would probably vigorously work to prevent Iran from acquiring nuclear weapons even if it could somehow be assured that greater steadfastness would be the only change in Irans behavior. A greater Iranian inclination to resist challenges would constrain U.S. freedom of action in Irans neighborhood and make it harder to push Iran around or use military force against Iran  all options that U.S. policymakers would like to retain. In fact, the fear that proliferation would constrain Americas freedom of action has been a powerful motivation for U.S. nonproliferation policies since the start of the nuclear era. Each nuclear state has behaved somewhat differently with nuclear weapons. However, history suggests that if Iran were to acquire nuclear weapons, it would be less universally emboldened than the pessimists fear, nor would it find nuclear weapons to be useless. Ultimately, the fact that nuclear weapons are useful tools of international statecraft makes it hard to persuade countries to give up nuclear weapons once they have them. But that has also motivated vigorous and often successful U.S. efforts to prevent their spread. Washington Post, Mark S. Bell is a Ph.D. candidate in political science at the Massachusetts Institute of Technology, and a research fellow in the Managing the Atom and International Security Projects at the Belfer Center for Science and International Affairs at Harvard Kennedy School.]", "Date": "20150820", "Author": "[ Mark S. Bell]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-nuclear-weapons-20150820-story.html", "Title": "[ So what if Iran does get nuclear weapons?]"}