{"Content": "[ The Boy Scouts of America, which approved a new policy Monday to allow its chartered organizations to select leaders without regard to sexual orientation, still leaves the decision in the hands of local groups and their beliefs. Nationally, many troops are chartered by the local American Legion Post, Lions Club, Parent Teacher Organization or others. However, more than 70 percent of troops in the U.S. are chartered by a faith-based organization such as a church, synagogue or private school. It remains to be seen how various organizations will respond at the local level. \"In Indiana, we do not have a law that prevents discrimination based on sexual orientation,\" said Rosalie Berger Levinson, Phyllis and Richard Duesenberg professor of law at Valparaiso University Law School. The Indiana Religious Freedom Restoration Act was amended in April to say it cant be used to defend against sexual discrimination, however, \"the amended version does not apply to churches and religious organizations. They can assert a RFRA defense,\" said Levinson. Nonetheless, the ball is in the court of the local charter. Gay youth have been permitted as members since 2013. The Diocese of Gary, for example, has a policy regarding gay leadership in church-sponsored activities. \"We would hold that the diocesan policy in terms of a Boy Scout troop under the sponsorship of a Catholic entity is no different than that which would be followed in the hiring of an employee or the utilization of the services of a volunteer, such as a Boy Scout leader,\" said Debbie Bosak, director of communications for the Diocese of Gary. \"There would be an expectation that the person in question would be living a life in accordance with the teachings of the Catholic Church. The church welcomes anybody, but as an unmarried person would abstain from sex outside of marriage, the expectation is that a gay man or woman would abstain from sex outside of marriage. This is different from dont ask, dont tell. This is a very complex issue. And we are talking theoretic, because it is not an issue that has come up.\", The executive committee of the Boy Scouts of America has unanimously approved a resolution that would end the organizations blanket ban on gay adult leaders and let individual Scout units set their own policy on the long-divisive issue. Units sponsored by churches opposed to the change could maintain... The executive committee of the Boy Scouts of America has unanimously approved a resolution that would end the organizations blanket ban on gay adult leaders and let individual Scout units set their own policy on the long-divisive issue. Units sponsored by churches opposed to the change could maintain... According to 2013 data on the Boy Scouts of America website, of the 25 faith-based institutions with charters, the largest is the Church of Jesus Christ of the Latter-day Saints with 437,160 Scouts; the United Methodist Church has 349,614; and the Catholic Church has 259,297 Scouts. The largest of the 20 civic organizations are the American Legion and Auxiliary with 84,497 Scouts and the Lions Club International with 2,477 Scouts. Parent-teacher groups, other than PTAs, account for 126,207 Scouts. \"Boy Scouts of America is based on a 105-year-old relationship with these community organizations that adopt the Scouts as part of their mission or outreach,\" said Marc Ryan, deputy scout executive for the Pathway to Adventure Council. \"We act as the partner that provides the program and expertise. It has always been the responsibility and the honor of the chartered organization to choose and approve its leadership  whether it is someone from their organization or someone who comes through them. They are responsible for them. This isnt theoretical.\", Lions Club International doesnt have an official position, said Christopher Bunch, corporate communications manager for the civic organization. \"The final decision made by Boy Scouts of America on this issue will have no impact on whether individual Lions clubs may sponsor Scout troops. Instead, the decision to continue sponsoring a Scout troop will be made by each Lions club on a local, individual basis,\" Bunch said. In Hobart, Rebecca Smith, pastor of the United Methodist Church, which holds the charter for Boy Scout Troop 42, said her congregation does not yet have a position on the issue, but she is aware of the national resolution. Boy Scouts of America President Robert M. Gates, the former U.S. secretary of defense, said at the annual meeting this summer, the Boy Scouts refusal to allow gay adults to participate at the leadership level was \"an unsustainable position\" due to employment laws being passed in states that \"protect employment rights on the basis of sexual orientation.\", \"I remind you of the recent debates we have seen in places like Indiana and Arkansas over discrimination based on sexual orientation,\" Gates said at the meeting. The move to allow charter partners to set their own standards for Scout leaders, \"would allow all churches, which sponsor some 70 percent of our Scout units, to establish leadership standards consistent with their faith. We must, at all costs, preserve the religious freedom of our church partners to do this,\" Gates said in his address. Nancy Coltun Webster is a freelance reporter for the Post-Tribune.]", "Date": "20150728", "Author": "[ Nancy Coltun Webster]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-boy-scouts-ratify-st-0727-20150727-story.html", "Title": "[ Local groups still key after Boy Scouts decision ]"}