{"Content": "[ Congress is heading out for a five-week summer recess in anything but a cheerful vacation mood, leaving behind a pile of unfinished business that all but guarantees a painful fall. Not long after they return in September, lawmakers must vote on President Barack Obamas nuclear deal with Iran, a brutally divisive issue that many lawmakers expect will dominate voter town halls during their annual August break. And, as more videos emerge showing disturbing fetal tissue collection practices, Republicans are increasingly focused on cutting off funding for Planned Parenthood, raising the prospect that Congress will spend September tied in knots over how to avoid shutting down the government over that issue. Later in the fall or winter, Congress will have to raise the federal debt limit, another issue ripe for brinkmanship, especially given the presence in the Senate of several presidential candidates adamantly opposed to an increase. The House wrapped up its summer session on Thursday by approving only a three-month extension of highway and transit spending and authority, kicking negotiations on that into the fall, as well. Add in deadlines to renew authorities for the Federal Aviation Administration, child nutrition payments and pipeline safety, and its shaping up as a monster of a fall. \"If you take a look at all of the things on the list, itll be a lot of traffic going through one toll booth,\" said Sen. John Barrasso, R-Wyo. U.S. Sen. Lindsey Graham of South Carolina brought his Republican presidential campaign to Chicagos Pilsen neighborhood Thursday, where he received accolades for backing a comprehensive immigration reform plan that includes an eventual pathway to citizenship. \"Its not about the Republican Party.... U.S. Sen. Lindsey Graham of South Carolina brought his Republican presidential campaign to Chicagos Pilsen neighborhood Thursday, where he received accolades for backing a comprehensive immigration reform plan that includes an eventual pathway to citizenship. \"Its not about the Republican Party.... Republican Rep. Mick Mulvaney of South Carolina, who leads a group of 18 conservatives vowing to oppose any spending bill that funds Planned Parenthood, says, \"This is one of those line-in-the-sand-type of issues.\", \"We have to figure out a way to fund the government without giving any more money to this institution.\", The effort could prevent leaders from extending current spending levels come the new budget year Oct. 1, since Planned Parenthood now receives more than $500 million in government assistance. Yet if Republicans try to use must-pass spending legislation to kill off the organizations funding, they would have trouble getting past Senate Democrats and the White House. And that could leave Republicans who took control of Congress this year promising to avoid shutdowns and \"fiscal cliffs\" backed into a very uncomfortable corner. \"Democrats will unite against them,\" says Chuck Schumer of New York, the No. 3 Senate Democrat. \"This is a Republican path to shutdown.\", Three months into her second presidential bid, Hillary Rodham Clinton has succeeded at an important goal  pivoting away from a highly restricted campaign style that threatened to cut her off from voters in key early-votingstates. When Clinton started her campaign after announcing her candidacy... Three months into her second presidential bid, Hillary Rodham Clinton has succeeded at an important goal  pivoting away from a highly restricted campaign style that threatened to cut her off from voters in key early-votingstates. When Clinton started her campaign after announcing her candidacy... While the House has left town, the Senate plans one more week before leaving, with a largely symbolic vote on defunding Planned Parenthood. Along with Iran, the government spending issue tops a long list of thorny disputes that threaten to have Republicans and Democrats at loggerheads for months. The 12 annual spending bills that fund the government are hung up on a variety of disagreements, including a dust-up in the House over the Confederate flag and Democrats demands to increase domestic spending. That leaves Congress facing the likelihood of temporarily extending current spending levels, which gets lawmakers back to the prospect of a shutdown showdown over Planned Parenthood. On Iran, Republicans are largely united against the nuclear deal, while those Democrats whove not yet declared their position are under enormous pressure from both sides. The White House is imploring them to back the president, while groups allied with the Israeli government are warning against the deal in apocalyptic terms. Congress is widely expected to vote down the deal, at which point attention would turn to whether opponents could muster the two-thirds vote in each chamber to override Obamas certain veto. Republicans are entering their recess after a nasty spate of intraparty brawls laid bare the ongoing conflict between tea party-backed conservatives and more pragmatic party leaders on Capitol Hill. That fault line promises to aggravate attempts at compromise throughout the fall. Lawmakers of both parties point to a need for high-level budget negotiations to come up with a deal that could resolve some of the major issues  and perhaps even include a tax code rewrite and an answer to Democratic demands for domestic spending increases to match those on the military side pushed by Republicans. Yet for now, nothing like that is under way. \"Were going to discuss how to fund the government after the August recess,\" Senate Majority Leader Mitch McConnell, R-Ky. said Thursday. Republicans are painfully aware that each previous shutdown showdown theyve gotten into with Obama and the Democrats has ended in defeat, along with vows never to try it again. Obamas health care law and executive actions on immigration survived their attempts to use budget bills to end them. Come September, it remains to be seen whether they go down the same road with Planned Parenthood, or find an off-ramp. \"I do hope that Republicans will do more than just rest and relax during their 39-day vacation,\" said White House Press Secretary Josh Earnest. \"Because when they do finally show up again in September, there wont be a lot of patience or a lot of sympathy for the claim that they dont have time to do their job.\", Associated Press]", "Date": "20150730", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-congress-goes-on-vacation-20150730-story.html", "Title": "[  Congress heads off on vacation, putting off messy decisions ]"}