{"Content": "[ Suhas Khamgaonkar has worked around the world  in her native India as a flight attendant, in Taiwan as a copywriter and in Australia as a banker. But almost 10 years ago, when her husband was sponsored by a corporation to work in the United States on an H-1B visa, Khamgaonkars efforts to patch together a work history behind his career came to an end. As the dependent spouse of the H-1B visa holder, she entered the United States on an H-4 visa. Referred to as a \"golden cage\" by the mostly South Asian women who hold it, the visa has barred her from working, denied her a Social Security number and intensified the isolation that comes with moving to a foreign country. \"Its a land of opportunity. Its like youre outside a candy shop, and you cant indulge in it,\" said Khamgaonkar, 51. \"You cant avail of those opportunities, and you cant enrich yourself. And that is the bane of H-4. That is the worst kind of visa.\", But because of a recently implemented, lesser-known provision in the executive actions on immigration that President Barack Obama issued in November, Khamgaonkar will be able to work in the United States for the first time this year. \"Its going to change lives really,\" Khamgaonkar said about the change, \"mine for sure.\", Roughly 80 percent of those on an H-4 visa in the United States are from South Asian countries including India, Pakistan, Bangladesh and Nepal, and most are women whose spouses work in science, technology, engineering and mathematics, or STEM fields, according to leaders in Chicagos South Asian community. Like their spouses, most on the visa are highly skilled and educated. Donald Trump sees himself as a martyr to the truth. All he did was point out that among the foreigners who have come to this country are some who do not scrupulously abide by all our criminal laws  only to be pilloried for his honesty. \"When Mexico sends its people, theyre not sending their best,\"... Donald Trump sees himself as a martyr to the truth. All he did was point out that among the foreigners who have come to this country are some who do not scrupulously abide by all our criminal laws  only to be pilloried for his honesty. \"When Mexico sends its people, theyre not sending their best,\"... The work authorization came about after years of grass-roots and social media advocacy, and it has been driven by the immense growth of the South Asian community in the United States in the past decade, according to Ami Gandhi, executive director of the Chicago-based South Asian American Policy and Research Institute. In Illinois, the South Asian-American population grew by more than 55 percent to 242,000 from 2000 to 2010, according to data in a 2013 report by the institute. In the six-county area of Cook, DuPage, Will, Lake, Kane and McHenry, the growth has been higher at 64 percent in the same 10-year period. That is compared with a 32 percent growth rate in the states Hispanic community in the same period. The South Asian-American population in Illinois is still just shy of 2 percent of the states total population; the Hispanic community makes up 15 percent. Only those whose spouses are applying for a green card or who have received extensions beyond the six-year limit of their H-1B visa can apply for the new work authorization, according to information provided by U.S. Citizenship and Immigration Services. The agency expects to receive as many as 179,600 applications within the first year and 55,000 annually in subsequent years. Khamgaonkar considers herself one of the H-4 visa holders more qualified than most to handle the trials of moving to the United States, as she graduated from a top art college in Mumbai, worked at an international advertising agency and traveled the world as a flight attendant before getting married at age 26. Many on the visa, particularly in her generation, come from cultures that do not encourage women to speak up for themselves. \"All this stuff about follow your dreams are phrases we learned in the U.S.,\" Khamgaonkar said. Limitations of the H-4 visa have taken a mental health toll, with many spouses describing falling into depression, especially as they are forced to depend on their partners for basic needs. Attorneys who work with H-4 visa holders also have seen that they are more vulnerable to domestic violence. The fact that many dont know the language or culture allows an abuser to isolate a spouse to maintain control, according to Nubia Willman, an attorney with the Immigrants and Workers Rights Practice Group. \"You dont have the legal authority to work, so it bolsters the abuser,\" Willman said. \"If they are able to get some autonomy, that helps them escape the relationship.\", Not having the option to add another income also adds financial strain and stress to the family, Khamgaonkar said. \"Theres more conflict,\" she said. \"Theres more dissatisfaction. Theres more stress  all because there is no (outside) contact.\", Pressure to change the rule mounted as H-4 spouses began to share their stories on social media, particularly Facebook, according to Meghna Damani, who in 2010 produced a documentary about her struggles while on the visa. Damani said she was naive about how hard it would be to find a corporation to sponsor her for a work visa in the United States when she followed her husband here after earning a masters degree and working at a multinational advertising agency in India. Her low point came after a move to a bigger city, several unfruitful applications and finally a company that stopped talking to her once they discovered her H-4 visa status. \"The women who are coming on this visa, they are not uneducated housewives,\" Damani said. \"They are professional women, and they dont want to give that up.\", Damani meant to stop her advocacy work on the issue as soon as she received her green card in 2010, after five years on the visa, but she continued to receive emails from those in the situation she had just escaped. Advocates like Damani are continuing the campaign so that permission to work will soon be expanded to all H-4 visa holders and not just ones who have been here several years. \"I just felt like its not over till theres an absolute change,\" Damani said. At the same time, however, a lawsuit is challenging the rule change. Shortly before the May 26 start of the application process a lawsuit was filed, arguing that the Department of Homeland Security lacks the authority to alter the provisions of the visa. The suit, filed by the group Save Jobs USA, claims that allowing H-4 spouses to work would make it harder for its members to find work. The court did not grant an injunction, but John Miano, the lead attorney in the lawsuit, said that if the suit is successful later, Homeland Security could force H-4 holders to stop working. The suit was filed as part of \"one battle in a larger war,\" Miano said. The permission given to H-4 visa holders to work, he said, is one example of the government trying to circumvent protections for American workers by allowing people to work on visas that are not intended as working visas. \"Its a continuous regulatory war against American workers right now,\" Miano said. \"Immigration policy, especially in the tech industry, has been the main battle ax being used to stomp down the American middle class.\", Damani said she is not worried about the challenge in court. Most workers on the H-4 visa will not go into STEM fields, advocates argue. Many will find work in other industries, start their own companies or work part time while they take care of children. \"I feel like its been well thought through,\" Damani said. \"Its about time, and its going to be win-win for everybody and create a better society overall.\", As she looks back on the past decade, Khamgaonkar acknowledges the gains of moving to the United States. Her husband has a thriving career. Her daughter happily studies engineering in their former home state of New Jersey, and she can claim friends and great experiences around the world. Yet she cant help but feel the unanticipated losses. \"It takes you back, your confidence level, everything  your personality  and it can be quite the depression,\" Khamgaonkar said. \"I wasnt aware of how it would affect me. Ive hung in there, tried to make the most of the situation and take whats good in it for me and try to make it work. I wouldnt say Ive succeeded fully, but I have tried.\", She has also filled time by volunteering as a teacher for domestic violence survivors, creating art and keeping up her Mandarin language skills. To start making a living in the U.S. after being out of work for three to 10 years will be daunting for H-4 spouses, Damani said, as their skills are outdated and their resumes spotty. But overall, there is excitement in the community. \"Women are saying things like, I feel like Im a free bird,\" Damani said. \"Im released from prison.\", mmrodriguez@tribpub.com, Twitter @merjourn]", "Date": "20150704", "Author": "[ Meredith Rodriguez]", "Link": "http://www.chicagotribune.com/news/ct-h4-work-authorization-met-20150704-story.html", "Title": "[   New visa rule to benefit South Asian immigrants ]"}