{"Content": "[ Though Im sitting in the sanctuary city of Chicago, far from the angry immigration debates in Washington, D.C. and San Francisco, Ive got a radical idea:, That in order to vote in elections in the United States, you must be a citizen of the United States. Some may call this subversive, or mean. Others may quickly slap me with the Card of Intolerance, the new war hammer of the left. Once youre bonked on the head with the dreaded Card of Intolerance, youre expected to curl up in the fetal position and scream for forgiveness lest you be paired with Donald Trump. But Trump is a fool and, as Ive written before, a useful idiot of Jeb Bush. Trump is a cartoon of a candidate, sucking oxygen from other worthy Republican presidential contenders and dominating the news cycle with his idiotic comments about Mexicans. Im not the son of privilege. Im the son of immigrants, from a small village at the root of a mountain far away in a troubled and poor country. Im the first of my family born on this soil. My father washed dishes in his first job. His second job was as a waiter. The one thing he stressed is that citizens of America owe their country everything, because it was a place of laws. \"I came here so no one could step on your necks,\" hed tell us. And hed seen it, boots on necks, in Europe. So I dont need a sideshow geek like Trump to inform my views. Its a no-brainer. When youre looking for a place where a child has been gunned down in Chicago, you look for the shrine. So in the morning after the rain, I went out to the Humboldt Park street where 7-year-old Amari Brown was shot to death on the Fourth of July, and found it. The shrine on the 1100 block of North... When youre looking for a place where a child has been gunned down in Chicago, you look for the shrine. So in the morning after the rain, I went out to the Humboldt Park street where 7-year-old Amari Brown was shot to death on the Fourth of July, and found it. The shrine on the 1100 block of North... Citizens can vote. Noncitizens cant vote. Period. End of story. Yet not everyone agrees with me, including David Grosso, the Washington, D.C. council member at large who made a stir this week pushing a controversial plan to allow permanent noncitizens the right to vote in local municipal elections in the nations capital. \"The idea is very simple: You should have a say of whos going to make these tough decisions like how much money is spent on schools or fixing potholes,\" Grosso said in a telephone interview. He dismissed my view that allowing anyone but a citizen to vote  even in a local election  would cheapen American citizenship. His plan only deals with legal residents who arent citizens. It wouldnt allow people who are here illegally the right to vote. The bill he introduced is \"not for people who have come in undocumented. Its for people who are here with legal status,\" people who live here legally, with green cards, yet arent naturalized citizens. Conservative fears are finally coming true. Back when President Barack Obama was deporting large numbers of undocumented immigrants  409,849 individuals in 2012  conservatives presented an alternate reality. The federal government has reached a point now where virtually no one is being deported,... Conservative fears are finally coming true. Back when President Barack Obama was deporting large numbers of undocumented immigrants  409,849 individuals in 2012  conservatives presented an alternate reality. The federal government has reached a point now where virtually no one is being deported,... But undocumented or documented, theyre not citizens. \"There are 50,000 who are here in the district,\" Grosso said of his plan, which failed during a previous try in 2013. \"They use our streets, go to our schools and pay our taxes, but have no say in our local government. Id say it was an injustice.\", \"We have no problem letting them fight in our wars. You can go fight in our wars for us, and were not going to let you vote? Cmon that makes no sense.\", Actually, it makes perfect sense. Citizenship isnt just another ham or turkey to be passed out by Democratic ward bosses in exchange for votes. Citizenship is sacred, and allowing those who arent citizens to vote dilutes the whole idea. Noncitizens can vote in Chicago, but only in local public school council elections. School officials told me that the only thing a voter in those elections has to establish is that they live in the school district, or have a child in the schools. Those are the only two questions, so it follows logically that even undocumented immigrants may vote in the school elections in Chicago. And I havent yet heard one Democrat or chamber of commerce-approved Republican saying its not a good idea. \"Its like the PTA,\" said a friend. \"Youre going to stop people from voting for the PTA?\", I hold no ill will for people who are dedicated enough to support their childrens education. But this is America, a country of immigrants, and only Americans should vote. Now I cant very well go to Mexico and establish residency and expect to vote. There are no political parties or big business interests helping me gain political power there. If you want to vote in Mexico youre required to have a national identification card, with a hologram photo. You push that idea here, and youre called a racist. I cant go to Britain and cast a ballot either, or Spain, or any other country that values citizenship. Because to be a citizen isnt only about what you can leverage from government in the form of benefits and payoffs. Being a citizen is about responsibility, at least ideally. But here, for political purposes, allowing noncitizens to vote is being seriously considered in the nations capital. Whats telling is that the concept isnt being ridiculed by Democrats who rule the cities. U.S. Rep. Luis Gutierrez, the Chicago Democrat and a leader in Latino immigrant politics, surprised me by coming out Thursday against Grossos plan. \"Im not in favor of what they are proposing for D.C. elections,\" Gutierrez said in a statement to me. \"Green card holders have citizenship and democracy within their grasp and should be encouraged to become citizens. Then they can vote in D.C. or anywhere else. D.C. should spend their money on citizenship drives and voter registration for citizens.\", Win or lose, Grosso said he hopes his attempt would \"provoke some sort of greater immigration\" debate on a national level. Good job, Mr. Grosso. Youve succeeded. jskass@tribpub.com, Twitter @John_Kass]", "Date": "20150710", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-immigration-met-0710-20150710-column.html", "Title": "[ It's a no-brainer: Only citizens should vote, period]"}