{"Content": "[ In separate strikes last week on veteran al-Qaida leaders, the United States demonstrated again the extent to which it has perfected an almost eerie capability to find the worlds most wanted terrorism suspects in some of the worlds most chaotic environments and deliver lethal blows from above. But the continued spread of al-Qaidas ideology and the emergence of brutal new off-shoots, including the Islamic State, have underscored the limitations of a U.S. strategy that remains largely reliant on \"decapitation\" strikes. U.S. officials confirmed Tuesday that Nasir al-Wuhayshi, leader of al-Qaidas affiliate in Yemen, was killed last week by a missile fired from a CIA drone. The announcement came one day after U.S. military officials said that a former al-Qaida operative in Libya had been killed in a bombing Saturday by U.S. fighter jets. Obama administration officials touted the potential impact of the operations. White House spokesman Ned Price said that Wuhayshis death \"removes from the battlefield an experienced terrorist leader and brings us closer to degrading and ultimately defeating these groups.\", How much closer, however, remains unclear. Many officials and experts in the U.S. counterterrorism community now see the destruction of al-Qaida and its progeny as a more distant goal than at any time since the Sept. 11, 2001, attacks. Islamist terror groups have taken advantage of political turmoil in the Middle East to make gains in recruitment, territory and influence. The locations of the latest U.S. strikes  Yemen and Libya  are countries where the collapse of central governments has enabled radical Islamist elements to flourish. A U.S. airstrike has killed Al-Qaidas No. 2 leader, who commanded its powerful Yemeni affiliate, dealing the global network its biggest blow since the killing of Osama bin Laden and eliminating a charismatic leader at a time when it is vying with the Islamic State group for the mantle of global... A U.S. airstrike has killed Al-Qaidas No. 2 leader, who commanded its powerful Yemeni affiliate, dealing the global network its biggest blow since the killing of Osama bin Laden and eliminating a charismatic leader at a time when it is vying with the Islamic State group for the mantle of global... Even with no presence or partners on the ground in those places, the United States has managed to maintain its lethal reach. But in a measure of how the expectations that follow such operations have shifted, U.S. officials and experts said the strikes may prove to be as advantageous to ascendent groups like the Islamic State as they are damaging to al-Qaida. \"The decapitation campaign of AQ senior leadership has left the group with diminishing capabilities to drive the global terrorist movement and to threaten the West as they once did,\" said Juan Zarate, a former senior counterterrorism adviser to President George W. Bush. But the latest U.S. operations \"have little relevance to what ISIS is building and growing in the heart of the Middle East,\" Zarate said, using an alternate term for the Islamic State, \"and may actually strengthen their hand in Yemen, Saudi Arabia and Libya.\", The targets last week were members of a dwindling generation of militants with links to al-Qaidas founders. White House spokesman Josh Earnest said that the Department of Defense confirmed that long-wanted Mokhtar Belmokhtar was the target of a U.S. airstrike June 15, 2015. (Reuters), White House spokesman Josh Earnest said that the Department of Defense confirmed that long-wanted Mokhtar Belmokhtar was the target of a U.S. airstrike June 15, 2015. (Reuters), Wuhayshi once served as a senior aide to Osama bin Laden and escaped from a Yemeni prison in 2006 to form an al-Qaida franchise that eventually eclipsed its parent organization as a threat to the United States. Al-Qaida in the Arabian Peninsula (AQAP) has been linked to plots including the attempted bombing of a Detroit-bound plane in 2009 and the attacks on the Charlie Hebdo satirical newspaper in Paris this year. Mokhtar Belmokhtar, killed in Libya, was a former member of al-Qaida in the Islamic Maghreb, the networks North African affiliate, but formed a breakaway group in 2012. A year later he staged a bloody siege of a gas complex in eastern Algeria that killed 40 people, including three Americans. Both men were seen as drivers of their respective terror groups anti-Western agendas, and Wuhayshi had been designated al-Qaidas second in command, meaning he would lead the global network if Ayman al-Zawahiri, bin Ladens successor, were captured or killed. Their deaths extend a remarkable U.S. record against high-value al-Qaida targets, a run that extends back to the killing of Abu Musab al-Zarqawi in Iraq in 2006, and the deaths of bin Laden and Anwar al-Awlaki  a U.S. citizen who became a senior operative for AQAP  in 2011. All were seen as potentially staggering blows to terrorist organizations that nevertheless managed to regroup  although al-Qaidas core in Pakistan remains significantly weakened. Bruce Riedel, a former CIA analyst and terrorism expert at the Brookings Institution, said Islamist groups have been able to turn to a new generation of leaders, many of whom rose through their organizations ranks without surfacing on U.S. target lists. \"Look at Baghdadi,\" Riedel said, referring to Abu Bakr al-Baghdadi, the leader of the Islamic State, which has seized territory across Iraq and Syria and declared itself a caliphate. \"Nobody knew who Baghdadi was two or three years ago. But clearly people on the inside in Iraq knew.\", U.S. officials said Wuhayshis subordinates in AQAP  including his apparent successor, Qassim al-Raimi  are seen as committed to al-Qaida and unlikely to shift the organizations course or pursue an affiliation with the Islamic State. But in interviews Tuesday, Yemeni citizens in the district where Wuhayshi was killed said there have been growing indications of Islamic State activity in the region, and they voiced concern that the group  also known as Daesh  might now be emboldened. \"Theres more concern now about Daesh,\" said Salem al-Hamoomi, a radio journalist in Mukalla, a city in southern Yemen near where Wuhayshi was reportedly killed. \"People fear its ideology, and people fear the group is here.\", Seth Jones, a terrorism analyst at the Rand Corporation, said that Wuhayshis death should \"be viewed in the context of the struggle between al-Qaida and the Islamic State over the leadership of the broader Salafi-Jihadi movement.\" Even before the AQAP leaders demise, Jones said, the Islamic State had \"co-opted a few small, local jihadist networks in Yemen.\", The Obama administrations dependence on drone surveillance and airstrikes against al-Qaida and other terrorist groups reflects, in part, a reluctance to be drawn more directly into Middle East conflicts. But the policy has also been driven by developments that derailed administration attempts to build a new counterterrorism strategy around providing support to regional partners. The collapse of the U.S.-backed government in Yemen this year forced the CIA and the U.S. military to pull out dozens of officers who had worked closely with Yemeni security agencies on counterterrorism operations. The Yemeni government was effectively deposed by Shiite rebels known as Houthis who are antagonistic toward the United States as well as the largely Sunni membership of al-Qaida. California Rep. Adam Schiff, the ranking Democrat on the House Intelligence Committee, said that AQAPs efforts to take advantage of the turmoil and fend off advances by the Houthis may have made its leadership more vulnerable to U.S. intelligence-gathering. \"The disintegration of Yemen has just been utterly catastrophic in terms of letting al-Qaida out of the box,\" Schiff said. \"Theres no question our intelligence has suffered. But there are residual intelligence capabilities that are still potent.\", ]", "Date": "20150616", "Author": "[ Greg Miller]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-us-airstrikes-al-qaida-20150616-story.html", "Title": "[ U.S. 'decapitation' strikes have killed terrorist leaders, but not al-Qaida]"}