{"Content": "[ Shortly after she moved to Chicago in 1999, Aurora Ibarra, recently widowed and caring for her three young children, spent time at the hospital bedside of an aunt who had fallen ill. Ibarra, who had previously worked in the fields harvesting onions in New Mexico and Texas, and as a painter on construction projects in Denver, remembers her aunt asking her why she worked so hard at painting houses when she was so good at nursing her back to health. A career in health care sounded interesting  but Ibarra didnt know where to begin. And with limited English, the native of Mexico worried she couldnt do it. A program through the nonprofit Instituto del Progreso Latino that prepares immigrants for health care jobs helped get her on the starting line. Last month, after a long journey of studying and working her way up the ranks, Ibarra earned her associates degree and certification as a registered nurse, landing one of the high-growth, middle-skill jobs that workforce industry leaders say are key to the Chicago areas economic recovery and the revival of the middle class. Middle-skill jobs, defined as requiring training beyond a high school diploma but less than a bachelors degree, have played a seemingly paradoxical role in the national conversation about income stagnation and the shrinking middle class. While displacement by globalization and technology has led to the steady decline of many traditional middle-skill jobs in the U.S. others requiring more post-secondary training are growing, presenting opportunities for people who have been left behind in the labor markets recovery  if they can be trained to fill them. Middle-skill jobs, which require more than a high school degree but less than a bachelors degree, offer a pathway for workers to achieve higher wages, according to a report from JPMorgan Chase. The transportation, distribution and logistics, and health care sectors make up a large concentration of the 28,000 high-demand middle-skill jobs that pay a living wage and are projected every year from 2014-2019. A report to be released Tuesday by JPMorgan Chase found that about 44 percent of jobs in the Chicago region are middle-skill, and half of them are high-demand occupations that also pay a living wage. Those \"target\" middle-skill jobs pay a median hourly wage of $26.93 and are projected to have 28,000 openings annually in the Chicago region through 2019. Nearly 20,000 of those annual openings are in two sectors: health care, and transportation, distribution and logistics. \"These are the jobs that are within reach of folks who for whatever reason find themselves in the lower-skilled areas right now,\" said Juan Salgado, president and CEO of Instituto del Progreso Latino. For example, a truck driver earning $16.74 an hour can become a diesel mechanic making $22.60 with a bit more training  and the report offers recommendations for how educators and workforce development organizations can better collaborate to shine a light on those paths. It also highlights the importance of using employer data so that training systems can adapt to rapidly evolving skill needs. Chicago is one of nine markets that JPMorgan Chase examined as part of a $250 million global initiative launched last year to help address the skills gap that has left millions of people un- and underemployed while millions of jobs go unfilled. Some 8.7 million people in the U.S. were unemployed in May, more than a quarter of them for longer than 26 weeks, and 6.7 million others were part-timers unable to find a full-time job, according to the Bureau of Labor Statistics. Meanwhile, as of March, there were nearly 5 million jobs open, according to the agencys most recent statistics. In the Chicago area, which is expected to exceed pre-recession employment levels by 2017, health care jobs are projected to grow 10 percent annually through 2019, said the JPMorgan Chase report, which highlighted several well-paying middle-skill jobs in need of qualified applicants. Transportation, distribution and logistics is expected to grow 4 percent annually, more modest than other sectors, but it was highlighted because it represents 13 percent of the target middle-skill jobs in the region and because Chicagos key transportation infrastructure, including its airports and proximity to major railroads, suggests those jobs are likely to remain important in the future. The challenge, laid out in the new report as well as many others, is getting people prepared for these kinds of jobs. Thats where groups like Instituto del Progreso Latino come in. The organization, founded in 1977, finds adults who lack English, math and computer skills but have other talents and drive, and provides free remedial education to get them college-ready quickly, often advancing a 4th-grade-level reader to eighth-grade-level in a little over year, Salgado said. Its Carreras en Salud (Careers in Health) program has produced 400 licensed practical nurses and 200 registered nurses, with a job placement rate of 100 percent, he said. Ibarra, who is 48 and lives in the Back of the Yards, said the program gave her a critical support system and offered a place to study as she progressed through her college courses. She earned her Spanish GED certificate there and took classes to prepare her for a certified nursing assistant course, her first step into the health care field. The path was seldom easy. While working as a certified nursing assistant, a support job that entails tasks like bathing patients and serving their meals, Ibarra was taking classes at Wright Community College to become a licensed practical nurse, plus working a side gig delivering newspapers before dawn to supplement her income (her certified nursing assistant pay never exceeded $9.30 an hour, she said). Her day started at 3:30 a.m. and she would get home from class around 9:30 p.m. after which time there was homework to do. For about a year, she was getting two to three hours of sleep a night, she said. Ibarra remembers a colleague asking if it was hard. It was, Ibarra told her, but \"it is going to be a lot harder to live with the money you make here all your life. I told her, try to go back to school because you can do something else.\", As a licensed practical nurse, Ibarra works for a home health aide agency earning $40 per visit. As a registered nurse, her per-visit pay through the agency will rise to $65. She is planning to pursue her bachelors degree in nursing, which expands her pay and job opportunities, and is waiting for her daughter, also a nurse, to be ready so they can do it together. Another challenged demographic are people with criminal records, like Tommy Hicks, 43, who had a hard time finding a stable job. A friend introduced him to the North Lawndale Employment Network, where through a job readiness program Hicks learned how to write a resume and conduct himself in interviews and was selected to participate in the Chicago Transit Authoritys Second Chance apprenticeship program. Through the Second Chance program, launched in 2011, the CTA partners with 13 social service agencies to hire people with tough pasts  typically ex-offenders, people coming out of substance abuse programs or victims of domestic abuse  to be car servicers, deep-cleaning buses and rail cars, for $9.50 an hour. It recently added training for diesel mechanics, which are in high demand. Of the 525 people who have gone through the program, where they typically stay one to two years, 116 have been hired full time at higher salaries  and in March, Hicks became one of them. He now earns $13.71 an hour working overnight at the 98th Street railyard cleaning Red Line trains and hopes to keep moving up the CTA ladder. \"Its been just wonderful,\" said Hicks, adding that the income has allowed him to better care for his children. \"Whatever the past is, there is always a brighter day.\", aelejalderuiz@tribpub.com, Twitter @alexiaer]", "Date": "20150608", "Author": "[ Alexia Elejalde-Ruiz]", "Link": "http://www.chicagotribune.com/business/ct-jp-morgan-chase-middle-skill-jobs-0609-biz-20150608-story.html", "Title": "[ Learning middle-skills to snag living wages]"}