{"Content": "[ After finishing third place in Chicagos February mayoral election, Willie Wilson announced he is exploring a presidential run. Wilson, who garnered 10.7 percent of the vote, ran for mayor despite having no political experience. He campaigned by trying to sell his rags-to-riches success story of a former janitor who rose to own McDonalds franchises and now a multimillion-dollar plastic glove distribution business. That run planted the seeds for this new venture, Wilson said Tuesday. \"One of the things I learned during my campaign for mayor is that people are hungry for truth, honesty and opportunity,\" Wilson said. \"The people have lost faith in their government. I believe the reason they have is because the United States itself has lost its way and its faith.\", Wilson has formed an exploratory committee for a presidential run, he said. \"People are sending rockets and things to the moon and dollars out there,\" Wilson said. \"Why cant we have free education in America for those who cant afford it? Why are we fighting all these wars overseas? These religion wars  we arent going to change things when we should be taking care of our home here and people should be making a living.\", Valerie Johnson, associate professor and chair of the political science department at DePaul University, said it is unlikely Wilson would make it onto the presidential ballot. On a website that lists hundreds of presidential hopefuls, she said, Wilson would be among about 50 listed under \"Other Democrat.\", \"Oftentimes a person ... who doesnt stand a snowballs chance in hell of winning, they do it to call attention to a political issue or to increase black voter participation,\" Johnson said. Wilson, however, insists that he is running to win. \"What qualifies me is Im down to earth,\" he said. \"I talk Americas language.\", mmrodriguez@tribpub.com]", "Date": "20150512", "Author": "[ Meredith Rodriguez]", "Link": "http://www.chicagotribune.com/news/ct-wilson-presidential-bid-met-20150512-story.html", "Title": "[  Willie Wilson, third in Chicago mayor's race, exploring presidential run]"}