{"Content": "[ Mayor Rahm Emanuel once billed the Chicago Infrastructure Trust as \"the breakout strategy for the city,\" a way to establish him as a national leader in creatively bankrolling big-ticket public works projects during an era of shrinking federal funding and dwindling state resources. But the nonprofit agencys board hasnt met in nearly 10 months, nor did it ever green-light the slew of important items envisioned when the mayor brought former President Bill Clinton to town to launch it in March 2012. Emanuel has been disappointed and frustrated at the trusts failure to drive private investment into public projects, according to sources close to the mayor, so he has decided to reboot the initiative. Chicago Infrastructure Trust 2.0 is a version more attuned to how City Hall functions and set up to boost the political fortunes of an up-and-comer and Emanuel protege. Gone, however, is the scrutiny that came with having a former federal prosecutor and city watchdog on the board. Out as the trusts executive director is Stephen Beitler, a former venture capital executive. In is Leslie Darling, a City Hall fixer who has worked as a top attorney in the citys Law Department since Emanuel was elected after beginning her career as an assistant to then-Mayor Richard M. Daley. Nearly the entire board has been replaced ahead of a Friday meeting. Former Boeing Co. executive James Bell quietly resigned as the trusts chairman in January with a year left on his term. The new chairman is Kurt Summers, who was an executive at the private equity firm of the mayors top campaign donor when Emanuel named him city treasurer late last year. By putting Darling and Summers in charge, Emanuel has installed two close allies to try to change course. Summers, who already has spent campaign money to promote the trust on Facebook, said the new leadership team has been given the directive to transition from just exploring projects to getting them done. Asked if Emanuel has pushed for more urgency from the trust, Darling said she had a private talk with the mayor about expectations. \"Were doing some things that havent been done before, and that takes time,\" Darling said. \"But Im not a patient person, and I like to get things done quickly, so thats on me. Obviously, we want to deliver for the city and the residents of our great city, and Im excited to do that.\", Failure to launch, Proclaiming \"our needs are bigger than what Washington or Springfield can do any more,\" Emanuel unveiled the infrastructure trust as a city instrument that would leverage private investment so the city could build public projects it otherwise could not afford. Since then, the trust has completed only one project and started another. The first was a project to make city buildings more energy-efficient. But a lack of interest from investors meant the projects scope dropped from $115 million in improvements at 104 city buildings to $13 million in work at 62 city properties  only 11 percent of what was proposed. The second is an ongoing Chicago Transit Authority initiative for major cellular providers to build $32 million in 4G wireless coverage in the citys subway tunnels. Following a series of fits and starts, Mayor Rahm Emanuel won approval Wednesday for his first Chicago Infrastructure Trust project, but only after the work was scaled back again due to lack of interest from investors. The trusts initial venture was to ask private investors to pay for energy efficiency... Following a series of fits and starts, Mayor Rahm Emanuel won approval Wednesday for his first Chicago Infrastructure Trust project, but only after the work was scaled back again due to lack of interest from investors. The trusts initial venture was to ask private investors to pay for energy efficiency... Beitler and the board sought bids on other projects, from reclamation work at old steel plant sites and construction ofcompressed natural gas stations to development ofsolar energy projects on public land and energy-efficiency improvements at the citys museums and zoos. Its unclear where progress on those bids stands since the trust has not met since October and Beitler declined to be interviewed. He did, however, release a statement about his departure. \"I promised the board I would stay for two years. It has been 2 1/2. That board no longer exists, and it is time for me to move on,\" Beitler said. \"I am proud of the hard work we have done to lay the groundwork for the future projects.\", Joining Bell in resigning this year was former Sara Lee executive Diana Ferguson, trust spokeswoman Tracey Mendrek said. Bell and Ferguson could not be reached for comment. Former 10th Ward Ald. John Pope lost his seat on the trust board after his defeat in the April election, and former city Inspector General David Hoffmans term expired at the end of 2014. Hoffmans presence on the board was key as it assuaged concerns from many aldermen about transparency, becausethe ordinance creating the trust only suggests that it should follow the states open records laws instead of requiring it. During meetings, Hoffmans often-lengthy string of detailed questions at times perturbed other board members, who rarely asked questions of their own. When Bell and the board wereready to quickly move forward with its energy efficiency project in 2013, Hoffman was not satisfied the project had been properly vetted and threatened to vote against it. The rest of the board agreed to delay the vote until more information was provided about the projects financing. Hoffman called the trust a \"good idea\" but warned potential pitfalls remain for taxpayers. \"If the trust keeps a reasonably conservative approach that protects city taxpayers, only considers deals where the purpose is to improve city infrastructure rather than raise funds, doesnt rush based on political pressures and ensures transparency by having a full public discussion of the details and potential risks sufficiently in advance so people can consider it, then Im confident it will find other prudent deals in the future,\" he said. The way forward, Emanuel has expanded the board to seven seats from five. Most of the new appointments have deep experience in the financial sector, but none has a background similar to Hoffmans. In addition to Summers, the city treasurer, the new appointees are Debra Cafaro, chairman and CEO of Ventas, a health care real estate investment trust who gave $15,300 to Emanuels re-election fund; Carl Lingenfelter, chief administration officer of Northern Trust Hedge Fund Services; Kym Hubbard, global head of investments for Ernst & Young Global; Miguel Zarate, managing partner for investment consulting firm Marquette Associates; and Ald. Matt OShea, 19th. The lone holdover is Chicago Federation of Labor President Jorge Ramirez. \"I think the trust is unique, relative to opportunities we have to invest in infrastructure in this country, and Im very excited, because its an opportunity to shape the landscape of the city for generations to come and provide public goods,\" said Summers, the new chairman whose campaign fund gave $36,574 to Emanuels re-election bid. In Summers, the mayor has tapped an ambitious politician eager to make a name for himself. Before taking over as treasurer, Summers was a senior vice president at Grosvenor Capital Management, an investment firm run by top Emanuel donor and close confidant Michael Sacks. Summers has been eager to get the news of his appointment out. He spent campaign money to buy an ad on Facebook to promote a Chicago Sun-Times story that noted his appointment as chairman of the trust. He said the ad was about making sure \"as many people in the city to know that there are efforts happening to invest in our long-term infrastructure.\", The trust at first will be charged with sorting out which projects already under consideration are viable, Summers said, but board members also likely would consider bigger, \"pie-in-the-sky projects\" such as express \"L\" service to OHare International Airport. \"I think there are really large opportunities that will be made available, and those are going to grow as we deliver and as we establish credibility and people see it,\" Summers said. \"Investors have to see it can happen, operators have to see it can happen and most importantly, the people of Chicago have to see it in their neighborhoods.\", An early contender, according to Summers, is a proposal to replace all of the citys nearly 400,000 street lights with more energy-efficient LED lights. The idea would be for an investor to replace the lights up front and get paid back with interest from proceeds from energy savings on the citys electric bill. But that alone wont be enough to finance the project, Summers said. An investor could partner with wireless providers to use light poles to strengthen signals or get money from attaching electric car docking stations. Summers also is enthused about making the 141 swimming pools at Chicago Public Schools and Chicago Park District facilities more energy-efficient. If that sounds familiar, thats because the infrastructure trust voted to approve that project, pegged at $30 million to $50 million, in June 2014. At the time, Beitler and the trust refused to identify the investor, saying doing so could jeopardize the financing of the project. The parks board later signed off, but the Board of Education delayed action and the \"financing company withdrew from the project,\" citing CPS sinking credit rating, said Mendrek, the trust spokeswoman. Even with that deal dead, the infrastructure trust still declines to identify that investor. bruthhart@tribpub.com, Twitter@BillRuthhart]", "Date": "20150814", "Author": "[ Bill Ruthhart]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rahm-emanuel-chicago-infrastructure-trust-met-0814-20150814-story.html", "Title": "[ Frustrated Emanuel takes second crack at infrastructure trust]"}