{"Content": "[  RIO DE JANEIRO - Sidney Levy, the man responsible for organizing next years Olympics in Rio de Janeiro, doesnt hesitate when asked what his biggest worry is. Sitting on a plastic chair in the canteen of his committees headquarters, Levy bangs his palm on a Formica table top and says: \"The crisis.\", South Americas biggest economy is in the midst of a downward spiral that has led to accelerating inflation and a plunging currency. Thats left Levy and his team of number crunchers at the Rio 2016 organizing committee scrambling to ensure they can balance their $7 billion budget to run the summer games. \"Right now the exchange rate is changing daily, inflation levels are changing daily and this of course affects us,\" said Levy, flanked by a wall chart counting down the 48 weeks until the start of the Olympics. \"Its very hard. You need to be very worried.\", Last week Standard and Poors downgraded Brazil to junk status amid the countrys biggest budget deficit in at least two decades. The real has weakened more than 31 percent against the dollar in the past year, more than any other major currency tracked by Bloomberg. Inflation is running at nearly 10 percent. While not responsible for the multibillion-dollar infrastructure works the coastal city is undertaking ahead of the games, Levy is in charge of everything related to the smooth running of the 17-day event. With revenue coming in dollars and reais from sponsorship, ticket sales and a contribution by the International Olympic Committee, currency volatility complicates procurement decisions, said Levy. While all the uncertainty makes life difficult for the organizers, the reals decline could turn out to be a plus. The IOCs contribution of about $1 billion, which includes $335 million from its sponsorship revenue, is worth 3.86 billion reais today, more than double what its value when Rio was awarded the games on Oct. 2, 2009. The money has been arriving in installments. \"On the other hand, lots of things that we are renting are more expensive because of inflation,\" said Levy, a petroleum engineer by training who came to Rio 2016 from his post as CEO of Valid Solucoes e Servicos de Seguranca em Meios de Pagamento e Identificacao, a commercial banking services company. \"So how those things are going to balance up we are going to know very soon.\", With inflation running 9.53 percent in the year through August, Levy said he may pare down costs of local purchases by buying buying lower-quality goods and services for non-essential items. Preparing Rio to become the first South American Olympic host has been bumpy. Massive public protests over the countrys spending priorities in 2013, ahead of last years soccer World Cup, jolted local politicians and President Dilma Rousseffs government. That led to squabbling over who should pay what for the Olympics, which has a total price tag of almost 39 billion reais ($10 billion), and criticism from the IOC over delays to key works. With that situation resolved, Levy expressed concern over the wider economic and political crisis that has gripped the country. Following her re-election last year, Rousseffs poll numbers have tumbled to single digits, and a spreading corruption scandal linked to state-controlled oil giant Petrobras has led to accusations against senior politicians and business leaders. \"The country has been shaking for a while now,\" he said. \"We open the papers every day and see something new.\", Still, Levy said hes optimistic the games will be a success, saying despite everything he manages to get eight hours sleep. \"The money will add up, we are going to make it add up, thats my job,\" he said.]", "Date": "20150915", "Author": "[ Tariq Panja, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-oly-brazil15-20150915-story.html", "Title": "[ Brazil's crisis has Rio 2016 Olympics boss worrying over costs]"}