{"Content": "[ Cook County Board President Toni Preckwinkle is within striking distance of securing the votes needed to raise the county sales tax by a penny on the dollar, but shell have to be persuasive to get there, a Tribune survey of county commissioners indicates. So far, only two commissioners say they are firm \"yes\" votes and only three say they are firm \"no\" votes, with a wide spectrum of opinion between. That leaves plenty of wiggle room on the 17-member board for Preckwinkle to have a shot at the nine votes needed for passage. Two of the undecided commissioners said they were leaning toward voting for the tax increase. One said hes undecided but called it a \"viable option.\" And three others either arent talking or wont show their hand but are Preckwinkle allies who have supported a higher sales tax in the past. That count, with eight potential \"yes\" votes, is the early read as Preckwinkle prepares to introduce the proposal at Wednesdays board meeting. The tally comes before opponents launch a  full-scale effort to defeat the measure or Preckwinkle makes her full case for the controversial tax. \"Its in play, but I dont know if theres nine votes for it,\" said veteran Commissioner Peter Silvestri, R-Elmwood Park. \"I dont know how Im voting on it, to be honest.  I want to see what the options are.\", Preckwinkle began meeting with each commissioner individually to seek support a few days before her tax plan became public June 22, telling them it was needed to shore up the countys underfunded public worker retirement system. Struggling to round up County Board votes for a sales tax hike is not uncharted territory. Seven years ago, former board President Todd Stroger scored his ninth vote for an identical tax increase by agreeing to a demand from Commissioner Larry Suffredin, D-Evanston, that the county set up an independently run public health system. Up until that vote, shortly before a midnight deadline, Suffredin opposed the increase. In the long run, that short-term victory contributed mightily to Strogers political downfall, when he placed last in the four-way Democratic primary in 2010. Preckwinkle, who campaigned largely on a pledge to wipe out Strogers tax increase, won that contest and cruised to victory in the general election. Then she kept her pledge. Now, she finds herself backing the same tax she deemed unnecessary in a much-noted TV campaign ad that invoked the adage \"a penny saved is a penny earned,\" long attributed to Benjamin Franklin. But the dynamics are different than they were during Strogers single term, which was tarnished by several patronage scandals that diminished his credibility. By contrast, Preckwinkles first term was marked by spending cuts and an overall tax reduction, with no major scandals. There also are four Republicans, one less than during Strogers term, on the board, and this time they are not united in outright opposition to the tax. Commissioners Gregg Goslin, of Glenview, and Tim Schneider, of Bartlett, are committed \"no\" votes. But Republican Commissioner Liz  Gorman, of Orland Park, like Silvestri, noted Preckwinkles earlier spending cuts and said that she has yet to decide how shell vote. \"The Preckwinkle administration has been a better steward, absolutely, with government cuts and reforms, and they understand that theyre still not there, that theres still other work to be done,\" Gorman said. Even stalwart opponents, such as  the Illinois Retail Merchants Association, express appreciation for how Preckwinkle has handled county finances to date. \"The countys made a lot of strides,\" said Tanya Triche, the associations spokeswoman. \"We definitely want to make sure that we get that out, but at the same time, she ran on a platform of rolling back that increased sales tax that her predecessor had put in, and we feel that the reasons for rolling that back were valid then and theyre valid now.\", Still, the lessons of Strogers defeat could work against Preckwinkle. Suffredin, for one, says hes a firm \"no\" this time after the heat he took in 2008. The fallout pain was prolonged, with commissioners bowing to public furor by taking a series of votes to roll back the tax in increments under Stroger and Preckwinkle. That, in part, could explain why Preckwinkle is struggling to persuade four fellow Chicago Democrats who said they were leaning against the tax hike: Richard Boykin, Luis Arroyo Jr. Bridget Gainer and John Fritchey. The two commissioners who said they are definite \"yes\" votes, Deborah Sims, D-Chicago, and Joan Murphy, D-Crestwood, were stalwart backers of the increase under Stroger, who opposed the sales tax rollback early in Preckwinkles first term. Also voting against the rollback was Commissioner Robert Steele, D-Chicago, who has mostly been a loyal Preckwinkle backer. Steele did not return calls for comment. Commissioner Jerry Butler, D-Chicago, warned his colleagues that the sales tax would be missed, but nevertheless voted with Preckwinkle to roll back the sales tax. He said he believes Preckwinkle will win enough support to pass the increase this time, but declined to say how hell vote. \"Sometimes its best to hold your cards until its time to play them,\" he said. Commissioners Jesus \"Chuy\" Garcia, D-Chicago, who is Preckwinkles floor leader, and Jeffrey Tobolski, D-McCook, another close Preckwinkle ally, said they are leaning toward supporting the tax increase. Commissioner Stanley Moore, D-Chicago, said he was undecided, but went on to say he believes \"the 1 percent county sales tax is a viable option.\" Commissioner John Daley, D-Chicago, who is chairman of the Finance Committee, did not return calls to answer how hell vote. But Preckwinkle and Daley have consistently presented a united front on financial issues, and he supported the tax increase seven years ago. Suffredin stands alone as the one Democrat making it clear theres no way he can be persuaded to vote \"yes.\", \"Weve tried this and it didnt work,\" Suffredin said, adding that hes not convinced the extra $473 million a year it could raise is needed. \"It is regressive and it hurt many of our citizens and businesses in our communities.\", Suffredin also said that not enough has been done to find additional savings beyond Preckwinkles efforts to pare the county payroll, secure  more federal health care funding and prod changes that reduced the daily jail count. As part of her pitch, Preckwinkle also plans to propose additional ways to save the county money. She said during an interview that a new countywide employee work-tracking system, the elimination of ineligible dependents from county health care rolls, further reductions in the jail population, the demolition of old jail buildings and continued consolidation of county offices could save tens of millions of dollars next year. But even with those reductions, the county still will face a significant budget shortfall, mostly because of obligations to its worker pension fund, which is $6.5 billion short of what is needed to cover future costs, Preckwinkle said. That amount grows by $30 million a month, and Preckwinkle said she wants to halt the slide \"before the hill becomes too steep to climb.\", Only two taxes  property or sales  could raise the amount of money needed to address that issue, and there was no way she could muster the votes for a property tax increase, she said. But \"there is a path for getting nine votes for a sales tax increase,\" Preckwinkle said. hdardick@tribpub.com, Twitter @ReporterHal]", "Date": "20150628", "Author": "[ Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-preckwinkle-sales-tax-support-met-20150628-story.html", "Title": "[ Vote could be close on Preckwinkle sales tax]"}