{"Content": "[ Neither of the two emails sent to Hillary Rodham Clinton now labeled by intelligence agencies as \"top secret,\" contained information that would jump out to experts as particularly sensitive, according to several government officials. One included a discussion of a U.S. drone strike, part of a covert program that is widely known and discussed. A second conversation could have improperly referred to highly classified material, but it also could have reflected information collected independently, U.S. officials who have reviewed the correspondence told The Associated Press. Still, its looking increasingly likely the issue of whether Clinton mishandled classified information on her home-brew email server will have significant political implications in the 2016 presidential campaign. Clinton, who has been seen from the outset as the front-runner for the Democratic nomination, agreed this week to turn over to the FBI the private server she used as secretary of state. And Republicans in Congress have seized on the involvement of federal law enforcement in the matter as a sign she was negligent in handling the nations secrets. On Monday, the inspector general for the 17 spy agencies that make up what is known as the intelligence community told Congress that two of 40 emails, in a random sample of 30,000 messages that Clinton gave the State Department for review, contained information deemed \"Top Secret,\" one of the governments highest levels of classification. While neither of the emails was marked classified at the time they were sent, they have since been slapped with a \"TK\" marking, for \"Talent Keyhole,\" suggesting material obtained by spy satellites. And they also were marked \"NOFORN,\" meaning information that can only be shared with Americans with security clearances. Try as she might to focus on the policies she wants to enact if elected president, Hillary Rodham Clinton just cant dig out of her inbox. Clintons email problems are getting worse. She agreed to turn over her private server to the Justice Department this week on the same day Congress got word... Try as she might to focus on the policies she wants to enact if elected president, Hillary Rodham Clinton just cant dig out of her inbox. Clintons email problems are getting worse. She agreed to turn over her private server to the Justice Department this week on the same day Congress got word... The two emails got those markings after consultations with the CIA and other agencies where the material originated, officials said. Some officials said they believed the designations were a stretch  a knee-jerk move in a bureaucracy rife with over-classification. The officials who spoke to the AP on condition of anonymity work in intelligence and other agencies. They wouldnt detail the full contents of the emails because of ongoing questions about classification level. Clinton didnt transmit the sensitive information herself, they said, and nothing in the emails she received makes direct reference to communications intercepts, confidential intelligence methods or any other form of sensitive sourcing. The drone exchange, the officials said, begins with a copy of a news article about the CIA drone program that targets terrorists in Pakistan and elsewhere. While that program is technically top secret, it is well-known and often reported on. Former CIA director Leon Panetta and Sen. Dianne Feinstein of California, the top Democrat on the Senate Intelligence Committee, have openly discussed it. Trump and Sanders lead the polls on August 12, 2015. Bernie Sanders, a Vermont senator, has attracted thousands of supporters, which comes at the expense of Hillary Clinton. (WGN-TV), Trump and Sanders lead the polls on August 12, 2015. Bernie Sanders, a Vermont senator, has attracted thousands of supporters, which comes at the expense of Hillary Clinton. (WGN-TV), The copy makes reference to classified information, and a Clinton adviser follows up by dancing around a top secret in a way that could possibly be inferred as confirmation, the officials said. Several people, however, described this claim as tenuous. But a second email reviewed by Charles McCullough, the intelligence community inspector general, appears more problematic, officials said. Nothing in the message is \"lifted\" from classified documents, they said, though they differed on where the information in it was sourced. Some said it improperly points back to highly classified material, while others countered that it was a classic case of what the government calls \"parallel reporting\"  receiving information the government considers secret through \"open source\" channels. The issue came to light Tuesday after Sen. Chuck Grassley, R-Iowa, said McCullough found four \"highly classified\" emails on the unusual private server that Clinton used while she was secretary of state. Two were sent back to the State Department for review, but Grassley said the other two were, in fact, classified at the closely guarded \"Top Secret/SCI level.\" SCI stands for \"sensitive compartmented information,\" which can only be examined under strict security protocols. In a four-page fact sheet that accompanied a letter to Clinton supporters, Clinton spokeswoman Jennifer Palmieri stressed that Clinton was permitted to use her own email account as a government employee and that the same process concerning classification reviews would still be taking place had she used the standard \"state.gov\" email account used by most department employees. The State Department, meanwhile, stressed that it wasnt clear if the material at issue ought to be considered classified at all. \"None of the emails alleged to contain classified information include any markings that indicate classified content,\" Sen. Dianne Feinstein a California Democrat who is the ranking member on the intelligence committee, said in a statement. But even if the emails highlighted by the intelligence community prove innocuous, Clinton will still face questions about whether she set up the private server with the aim of avoiding scrutiny, whether emails she deleted because she said they were personal were actually work-related, and whether she appropriately shielded such emails from possible foreign spies and hackers. Former intelligence officials say its a certainty that her server was compromised by former intelligence services. Unless they were encrypted to U.S. government standards, \"In my opinion there is a 100% chance that all emails sent and received by her, including all the electronic correspondence stored on her server in her Chappaqua residence, were targeted and collected by the Russian equivalent of NSA,\" said former CIA case officer Jason Matthews, an expert in Russian intelligence. Then again, Clinton defenders point out, the State Departments unclassified email system also has been penetrated by Russian hackers, so its unclear her use of home server made a difference. Clinton says she exchanged about 60,000 emails in her four years as secretary of state. She turned over all but what she said were personal emails late last year. The department has been making those public after scrubbing sensitive material. The State Department advised employees not to use personal email accounts for work, but it wasnt prohibited. Associated Press]", "Date": "20150814", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-clinton-emails-drones-20150814-story.html", "Title": "[ 'Top secret' Clinton emails include discussion of drone operation]"}