{"Content": "[ Texas moved Monday to ban its own cities from imposing prohibitions on hydraulic fracturing and other potentially environmentally harmful oil and natural gas drilling activities within their boundaries  a major victory for industry groups and top conservatives who have decried rampant local \"overregulation.\", Lawmakers in Americas largest oil-producing state scrambled to limit local energy exploration prohibitions after Denton, a university town near Dallas, passed an ordinance in November against hydraulic fracturing or fracking, attempting to keep encroaching drilling bonanzas outside their community. Fracking is the practice of blasting huge volumes of water and chemicals underground to release tight deposits of oil and gas. Denton voters opposition was driven by recurring small earthquakes and safety worries from gas wells that have become ubiquitous near urban area during the energy boom of the last few years. But energy lobbyists argued that local regulations shouldnt trump property rights and effectively choke off natural gas drilling underground. The measure by San Angelo Republican Rep. Drew Darby, chairman of the House Energy Resources Committee, allows local communities to regulate things above ground such as noise, traffic and lighting associated with fracking, drilling and other oil and gas activities. But it forbids limits on any drilling or activity below the surface, except for some regulations, such as bans on exploration on Sundays, that are already in place. Any limits imposed by communities would have to be \"commercially reasonable,\" which critics say allows the energy industry wide sway. As most of you already know, the U.S. military will soon be invading Texas, confiscating everyones guns, implementing martial law and mandating that barbecue restaurants serve only vegan food. Im not actually sure if that last parts correct, but the rest of it is an absolute fact, according... As most of you already know, the U.S. military will soon be invading Texas, confiscating everyones guns, implementing martial law and mandating that barbecue restaurants serve only vegan food. Im not actually sure if that last parts correct, but the rest of it is an absolute fact, according... \"The burden is laid upon the cities, and frankly were handing the keys to the oil and gas industry to decide whats commercially reasonable,\" said Rita Beving, coordinator of Alliance for Clean Texas, a coalition of more than a dozen faith-based, policy and environmental groups. Major municipal lobbies originally opposed Darbys bill, but changed their position after he softened it to allow some local regulation. Supporters say its necessary to prevent a patchwork of local rules from spreading around the state. As oil prices have sunk in recent months, they argue that ensuring energy interests arent vexed is more important than ever. The bill last month overwhelmingly cleared the House, which Republicans control by a 2-to-1 margin, and passed the GOP-dominated Senate almost as easily Monday  sending it to Gov. Greg Abbott, who is expected to sign it into law. The issue has been among the most contentious in the new Republican governors first legislative session, and while Abbott has stayed publicly out of the debate, he has criticized local regulations that he says limit individual liberty. The proposal \"enjoys widespread support because the legislation provides cities with authority to reasonably regulate surface level oil and gas activities, while affirming that regulation of oil and gas operations like fracking and production is under the exclusive jurisdiction of the state,\" Texas Oil and Gas Association President Todd Staples said in a statement Monday. A former Texas agriculture commissioner, Staples added that the measure is \"a fair bill that balances local control and property rights.\", But Luke Metzger, director of the advocacy group Environment Texas, said he was \"outraged by this assault on local control and the environment.\", \"Clearly, Big Oil got its moneys worth this legislative session,\" Metzger said in a statement. Drilling operations contributed more than $12 billion to Texas state coffers in 2013 alone, accounting for about 4.5 percent of the biannual budget. The oil and gas sector made more than $400 million in political contributions statewide during the last election cycle, according to the National Institute on Money in State Politics. In April, scientists with real-time monitors linked a rash of small earthquakes west of Fort Worth to nearby natural gas wells and wastewater injection.]", "Date": "20150504", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-texas-fracking-bans-20150504-story.html", "Title": "[ Texas Legislature acts to stop cities from limiting drilling ]"}