{"Content": "[ Theres a certain demographic in this country  its unseemly to mention the specific population by name  that has no sense of personal responsibility. I dont know whether their problem is cultural or biological. But these people refuse to acknowledge any bad decisions they have ever made, or the many times others have bailed them out. They want everyone else to pay for their failures, and sometimes even their successes. By now I think you know which deadbeats Im talking about: the people running for president. Im not saying theyre all bad; there are a few personally responsible outliers to cherry-pick from an otherwise mooch-y bunch. But, as a whole, this group is unusually adept at ducking deserved blame, claiming unearned credit and hoovering up O.P.M. (Other Peoples Money). First, theres Hillary Clinton, who refused to answer questions about whether she had her email server erased before handing it over to the FBI. Perhaps laying the groundwork to later throw some poor underling under the bus, she simply shrugged and feigned ignorance about what it even means to \"wipe\" a server. \"What, like with a cloth or something?\" she said, her self-professed digital illiteracy absolving her of any responsibility. Then there are Republican governors who promise blockbuster economic growth, despite denying responsibility for the busted economies in their own home states. Viewed through the lens of Americas civil rights history, Donald Trumps new call to repeal birthright citizenship chimes with an ominous ring. Spoiler alert: It sounds like racism. It sounds like the Supreme Courts declaration in 1857 that African-Americans were \"so far inferior that they had... Viewed through the lens of Americas civil rights history, Donald Trumps new call to repeal birthright citizenship chimes with an ominous ring. Spoiler alert: It sounds like racism. It sounds like the Supreme Courts declaration in 1857 that African-Americans were \"so far inferior that they had... Asked in the presidential primary debate to justify holding himself up as an economic sage when, under his leadership, his state has undergone nine credit rating downgrades and is ranked 44th in private-sector growth, New Jersey Gov. Chris Christie responded: \"If you think its bad now, you shouldve seen it when I got there.\", Likewise, when prompted to explain why hed delivered fewer than half the jobs hed promised in his gubernatorial campaign and had overseen a state ranking 35th in the country in job growth, Wisconsin Gov. Scott Walker also shirked. He said voters elected him because he \"aimed high, not aimed low,\" declining to acknowledge that low was where he eventually landed. On the other side of the spectrum lies former Florida Gov. Jeb Bush, who likes to take credit for a state job boom created by a gigantic housing bubble, which conveniently burst after he left office. Success has a thousand fathers, indeed. But by far, the leader of the personal responsibility deadbeats is Donald Trump, a welfare queen if there ever was one. Republican presidential candidates often invoke Jesus, but lately they sound more like Jehovah. The Old Testament says, \"I, the Lord your God, am a jealous God, punishing the children for the sin of the parents to the third and fourth generation.\" Punishing kids for their parents sins is the idea... Republican presidential candidates often invoke Jesus, but lately they sound more like Jehovah. The Old Testament says, \"I, the Lord your God, am a jealous God, punishing the children for the sin of the parents to the third and fourth generation.\" Punishing kids for their parents sins is the idea... This is a man who has proudly \"used the laws of the country to (his) advantage.\" That means racking up hundreds of millions of dollars in tax abatements  that is, government subsidies  to finance his real estate empire. That means using \"governments incompetence as a wedge to increase his private fortune,\" as one former New York City tax auditor put it. It means borrowing lots of money that he never paid back, because it was discharged in four (corporate) bankruptcies, which he now looks back on with pride. That means trying to use eminent domain to seize an elderly widows property so he could build a limousine parking lot, or pressuring a city to condemn several businesses so he could buy the land on the cheap to build a \"combined amusement park, shipping terminal and seaport village and office complex.\" That means slapping his name on all sorts of other projects he had relatively little involvement in and then swooping in to take credit when things went well  or suing to have his name removed when things went badly. None of this is illegal, of course. But its also maybe not the track record of someone who wants to lead the party that has fashioned itself the party of personal responsibility, of freedom from government dependence, of the makers rather than the takers. Yes, Trumps been \"making,\" but that making has been enabled by a fair amount of taking too. At least Trumps business record provides a useful lens for understanding the few concrete policy proposals hes offered: (1) Force Mexico to pay for a border wall he wants to build and (2) force Middle Eastern countries to pay for U.S. military operations he wants to engage in. \"Get someone else to pay for it\" has been his business strategy all along, now newly applied to public policy. To be sure, theres a long and storied American tradition of shunting responsibilities, and costs, onto other parties (most creatively, though not exclusively, through the tax code). So maybe this crop of candidates is just what we deserve  if not exactly what we need. Washington Post Writers Group, Catherine Rampells email address is crampell@washpost.com, Twitter @crampell]", "Date": "20150821", "Author": "[ Catherine Rampell]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-deadbeat-trump-christie-bush-hillary-clinton-fbi-email--perspec-0824-jm-20150821-story.html", "Title": "[ The 2016 field is full of deadbeats]"}