{"Content": "[ Great news, America: Chelsea Clinton is writing a book! In September, Penguin Random House will publish \"Its Your World: Get Informed, Get Inspired & Get Going\" The book, according to its enthusiastic news release, \"will address some of the worlds most challenging issues including Poverty, Homelessness, Food Insecurity, Access to Education, Gender Equality, Epidemics, Non-Communicable Diseases, Climate Change and Endangered Species.\", Whew! That is a long, important and ponderous list. It is so long, important and ponderous that the excited intern who typed up that news release apparently forgot the basic writing rule that you dont need to capitalize Broad, General Terms like \"food insecurity\" and \"non-communicable diseases.\" When you do, you see, it makes those terms look Slightly Farcical, not More Important. Regardless, lets move on to this sure-to-be monumental book, written by a noted expert on absolutely everything  and by \"expert on absolutely everything,\" I mean \"expert on making $600,000 a year for doing pretty much nothing at all.\" Anticipating the frenzied, clawing-at-the-bookstore-doors reception \"Its Your World\" will undoubtedly inspire (or, as in the case of \"Hard Choices,\" her mothers book, a subdued, mildly depressed chorus of crickets), Chelsea also wrote a helpful \"open letter\" to her fans. This open letter, available on the publishers website, includes the following line: \"We have a saying in my family  its always better to get caught trying (rather than not try at all).\", Full disclosure: When I first read that sentence, I laughed out loud. Next, I read it two more times, just to make sure it was not some glorious figment of my imagination. \"Get caught trying\"? Who makes this their family motto? Concerned that I was missing the popular resurgence of this wise old adage  a saying that ranks right up there with \"Theres more than one way to obliterate an old email server\" and \"If the silverware is missing, Sandy Bergers pants are a-jangling\"  I decided to Google \"get caught trying.\" If youre looking for lots of advice on how to do things like hide an affair from your spouse, illegally sneak over the border or fight off a wild crow that is trying to eat your lunch, I suggest you do the same. Heres the thing: If you \"get caught\" doing something, it implies that you are doing something secretive, underhanded or out-and-out bad. What kind of family, outside of the Corleone crime syndicate, instinctively associates \"trying\" with doing something surreptitious, or an action where one can get caught? Moreover, is there any one-liner in the history of the world  with the exception, of course, of \"It depends what the meaning of is is\"  that better sums up the Clinton ethos?, BillClinton, George W. Bush and other former presidents who earn lucrative speaking fees and draw other income would no longer be able to count on taxpayer dollars to pay for their post-White House office space and staff under a bill in the House. On a voice vote, the House Oversight panel backed... BillClinton, George W. Bush and other former presidents who earn lucrative speaking fees and draw other income would no longer be able to count on taxpayer dollars to pay for their post-White House office space and staff under a bill in the House. On a voice vote, the House Oversight panel backed... Each and every week, Americans get a bigger glimpse at the mysterious layers, shady connections and apparent payoffs that power the Clinton family business  a slow drip of \"getting caught trying,\" if you will  and, amazingly, most people seem not to care. Last week, a passionate Hillary Clinton lambasted efforts to end the Export-Import Bank, which many Republicans have criticized as corporate welfare. The bank, Clinton declared, righteously indignant, is \"a vital lifeline for American small businesses.\" But as Lachlan Markay of the Washington Free Beacon reported last week, its also the darndest thing: Many of the largest contributors to the Clinton Foundation, including \"small businesses\" like Boeing, General Electric and Emirates Airline, are beneficiaries of generous Ex-Im subsidies. These days, of course, its getting hard to find anyone who hasnt donated to the Clinton Foundation. Former Clinton lackey, current ABC News anchor and \"neutral\" news personality George Stephanopoulos? Check. Foreign governments like those of Saudi Arabia and Algeria, which \"coincidentally\" got bigger arms deals when Clinton was secretary of state? Check. FIFA, soccers international governing body, which recently burst into a corruption scandal  complete with convoluted ties to Bill Clinton and the government of Qatar? Check. One could go on, noting that Chelseas future publisher also donated to the Clinton Foundation in 2007, but you probably saw that one coming from miles away. Ill be honest: For a while, this sort of thing bothered me. With truckloads of cronyism on national parade, paired with a growing pile of shady and mysterious payoffs  not to mention a rash of deleted emails and a newly discovered, undisclosed shell corporation  how could anyone in America take Hillary Clinton seriously as an uncorrupted presidential candidate?, But that question, of course, misses the point: After all, very few Hillary fans are Hillary fans because they see her, first and foremost, as \"uncorrupted.\" The issue of corruption, in fact, is barely a blip on their radar screens. Many hard-core Clintonites are just fine with growing, interconnected, technocratic, managerial government and the quiet crony capitalism that naturally accompanies it. Clintons campaign, being a business of sorts, knows and understands this, embracing the candidates core competency and ultimate projected image: the \"connected,\" well-known grandmother queen who \"knows the ropes\" and can help us all. Who knows? Perhaps, in the upcoming weeks, a Clinton scandal will emerge to top all Clinton scandals, effectively knocking Hillary out of the nomination. In the meantime, however, perhaps we should all sit back, relax and try to enjoy The Clinton Show. There will be times to laugh, assuredly; there will also be times to weep. Occasionally, there might even be valuable lessons to learn. But at this point, one things for sure: Thus far, its been a remarkably hard show to stop. RealClearPolitics, Wilhelm is a writer based in Austin, Texas.]", "Date": "20150529", "Author": "[ Heather Wilhelm]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-bill-hillary-chelsea-clinton-foundation-perspec-0529-jm-20150529-story.html", "Title": "[ The endless Clinton rerun loop]"}