{"Content": "[ There is a deep economic anxiety driving Republican voters toward the blunt-spoken presidential campaign of Donald J. Trump. It is more than just anger at the political class or rebellion against political correctness. It reflects decades of lost jobs and falling wages for a swath of blue-collar Americans, who saw their opportunities diminish and developed a sense that someone has stolen something from them. Rick Buchanan explains it by talking about his industry, construction, where the share of Hispanic workers has doubled over the last 15 years, to more than a quarter of all workers, according to the Labor Department. \"The Hispanics have taken over the construction industry,\" Buchanan, a general contractor, said on a recent afternoon at a gathering of conservative activists near the Shenandoah Valley. \"All my drywall guys are Hispanic. Plumbers, painters, framers, theyre at least half Hispanic.\" For white workers, he said, \"these people are taking their jobs. Literally, taking their jobs. I see it. Almost all the white guys are gone. Theres almost no black guys.\", Trump, he added, is the only candidate in the swollen Republican field willing to call out that shift and how it hurts native-born, blue-collar workers: \"He is hitting a chord with not only the lower-income people  I consider myself middle class, and hes resonating with me, too.\", Buchanan and his fellow activists blame illegal immigration for suppressing American wages, for bleeding money from taxpayers, for sapping young workers hope and pushing them on to welfare. Its a perspective shared by many of Trumps supporters, who, polls show, are drawn from a group that has taken an economic beating throughout the 21st century. Those supporters appear to be responding to Trumps rhetoric against Mexicans, the Chinese and especially establishment Republicans, whom they blame for not doing enough to turn their fortunes around. Jeb Bush has been practicing all summer for this moment: his first big chance to convince voters he is a reliable problem solver fit to sit in the Oval Office. Scott Walker has been boning up on issues foreign and domestic, eager to prove that after a rocky debut this spring he has amassed the... Jeb Bush has been practicing all summer for this moment: his first big chance to convince voters he is a reliable problem solver fit to sit in the Oval Office. Scott Walker has been boning up on issues foreign and domestic, eager to prove that after a rocky debut this spring he has amassed the... The big question hanging over Thursday nights televised debate in Cleveland, the first major debate of this GOP primary, is not just who is able to steal the show -- but whether anyone but Trump can speak to the anxieties that are animating so many of the partys core voters. Recent polls suggest Trump is finding the broad majority of his support among voters who did not earn a college degree and those who see immigrants as detrimental to America  groups that overlap, but not completely. In a recent Washington Post/ABC News poll, Trump won support from nearly a third of Republican voters and Republican-leaning independents without college degrees, compared to just 8 percent of Republican college grads. (That education gap has been smaller, but still prevalent, in other surveys.), Non-college grads have struggled since the turn of the century: economist Robert Shapiro estimates that incomes stagnated or declined from 2002 to 2013 for American households headed by workers without a degree, a marked departure from prior decades. Republicans are in a funk on the eve of the first presidential primary debate. The partys popularity has dipped, largely because Republican voters are souring on it. Their lack of confidence in their party surely has something to do with Donald Trumps rise in the polls. Bitterness between conservative... Republicans are in a funk on the eve of the first presidential primary debate. The partys popularity has dipped, largely because Republican voters are souring on it. Their lack of confidence in their party surely has something to do with Donald Trumps rise in the polls. Bitterness between conservative... By more than a 2 to 1 margin, Republicans who supported Trump in the poll said immigrants weaken society. Thats the opposite view of Americans overall, who said by a 25-point margin that immigrants mainly strengthen America. (To get a sense of how those groups overlap, Republicans without college degrees are 19 percentage points more likely to say immigrants weaken American society than Republicans-leaning college graduates.), A CBS poll this week showed more than 7 in 10 Republican voters are confident in Trumps economic decisions, well above any other Republican candidate. He also leads, though by a small margin, on confidence in his decisions on illegal immigration. Trump is selling an economic message that unifies growing concerns among liberals and conservatives alike, \"which is that growing GDP doesnt necessarily help people on the bottom,\" said Mickey Kaus, the author of the Kausfiles blog, who writes frequently and critically about the effects of illegal immigration on the U.S. economy. \"Immigration may grow GDP, but I dont see how it helps workers who (immigrants) compete with, and the people competing dont see that, either.\", Hes not the only Republican candidate talking tough on immigration, activists say, but hes the one framing the argument as \"were being taken advantage of\" - and that appears to be connecting. \"Think about Trump,\" said James V. Capua, one of the activists who gathered to talk with a reporter about Trump in rural Rappahannock County late last month. \"Hes a huckster. Hes a loudmouth New Yorker. People dont like people like that.\" But voters like Trump, he said, \"Because he just seems like the guy who can take on the people who Trump supporters think have been screwing with them for so long.\", The idea that foreigners are to blame for your personal economic woes is prevalent around the world, giving rise to anti-immigration strains in Europe and other places suffering from an economic malaise, said Bryan Caplan, an economist at George Mason University, and especially so among less-educated people. As a billionaire, and a political outsider, Trump may have more ability to connect with those \"anti-foreign\" voters, as Caplan calls them, because he isnt afraid of being judged by other political elites. \"If youre immersed in this elite culture, it tends to be embarrassing to be more like Trump,\" Caplan said. \"He feels a freedom to demagogue that other people dont. By virtue of being a mogul, he doesnt feel the same social pressure to go along with what other (elites) think.\", Trump supporters say its even more than that. Many of them loathe political elites, especially leading Republicans, whom they accuse of breaking promises to secure the border and boost American workers. Trump loves to make fun of those elites, the activists in Rappahannock County said, and they love him for it.]", "Date": "20150806", "Author": "[ Jim Tankersley, Scott Clement, Peyton Craighill]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-why-donald-trump-is-winning-20150806-story.html", "Title": "[ Why Donald Trump is winning]"}