{"Content": "[ Some of you are probably done with ABC News over the George Stephanopoulos embarrassment. Of course, you wouldnt be wrong to boycott ABC News. You might be a fool not to. If you have any pretension to intellectual honesty, you either boycott ABC News over this Stephanopoulos mess, or you take a pair of hairy donkey ears and pin them to your temples. Its possible that you wish to keep on watching the ethically-challenged ABC News but youd really like to skip the hassle of searching for authentic hairy donkey ears. In that case just wear a kilt, a tartan, like the kind former President Bill Clinton might wear as \"First Laddie\" of the United States, should his wife be elected our president and hes left to milk their cash cow, the Clinton Foundation. Or better yet, if you really, really want to watch ABC News, then paste a Planet Hillary photo to your forehead, like the one from the New York Times magazine a while back. Ive written countless words in praise of and, more often, criticism of politicians and candidates. But in my decades at The Chicago Tribune, Ive never made a political contribution. Why not? Because Im part of a news organization that prides itself on a commitment to fairness and impartiality.... Ive written countless words in praise of and, more often, criticism of politicians and candidates. But in my decades at The Chicago Tribune, Ive never made a political contribution. Why not? Because Im part of a news organization that prides itself on a commitment to fairness and impartiality.... The ABC News promotions department should be able to print up a few million of these: A gigantic orbiting Hillary head floating in space, kind of like Mrs. Moon but its Hillary, with a wry grin, stars twinkling, perfect for posters. But Id really like to take that ABC News boycott notion a step further. Why boycott just ABC News? Why not boycott all American TV news? You think youll miss something important?, What do you get for watching TV news anyway besides a gnawing sense that youre being manipulated by Machiavellis? Nothing. So try my experiment. Ive decided to take a break from TV news  cable and network  and spend that extra time reading, tending my tomatoes, having conversations with my loved ones, and drinking whiskey. I dont have a problem with panel discussion programs  the kind on CSPAN, where panelists have much gravitas  but Im sick of glitzy network and cable scream fests. I just cant take the emoting of the anchors, their posing and pouting, their head shaking and other broad pantomimes. ABC News anchor George Stephanopoulos will not moderate a Republican presidential debate next winter, part of the fallout after revelations that the networks top political anchor contributed $75,000 over a three-year period to the Clinton Foundation. Stephanopoulos voluntarily stepped away from... ABC News anchor George Stephanopoulos will not moderate a Republican presidential debate next winter, part of the fallout after revelations that the networks top political anchor contributed $75,000 over a three-year period to the Clinton Foundation. Stephanopoulos voluntarily stepped away from... And forgive me, but I really dont think they need to slap on more lip gloss to tell me, breathlessly, about more ISIS beheadings. So Im gone. If its not sports, or a big-budget medieval fantasy drama about dragons and a profoundly-heroic yet sarcastic dwarf who visits bordellos and gets kidnapped by a disgraced knight seeking to win back favor of his queen, then Im not interested. Of course that goes for FOX News, which has become the Jeb Bush Republican Neocon Establishment Network, along with high frequencies of female anchor thigh display. But it also goes for all the other broadcast and cable shops. They serve as Democratic Establishment News, priming voters in the class wars, especially the turgid lefts show pony, Al Sharpton. I have friends who are TV reporters and Ill go online to see their stories. Some do excellent and even dangerous work. But I just cant stand American TV news divas and Republican and Democratic operatives masquerading as journalists, spinning, spinning, spinning. It got old. So Ill read to get my news, or listen, or go on the Internet for copy and video but I wont waste time on a creaky old news show. Certainly some will say this is all self serving. Others will no doubt skewer me if Im invited to appear on a news program. But dont worry. I promise not to watch. And I may disclose someday that yes, I once boycotted TV news in the summer of 2015 but have since \"evolved.\", Thats what were talking about here: disclosure. Stephanopoulos is the face of ABC News political coverage. Hes host of the networks morning program \"Good Morning America\" and host of the networks Sunday morning political talk show, \"This Week with George Stephanopoulos.\", But hes not a journalist. Hes a spinner, a former top Bill Clinton staffer. And while skewering former Republican operative and \"Clinton Cash\" author Peter Schweizer about the Clinton Foundation and pay-to-play allegations, Stephanopoulos omitted something. He didnt disclose to his audience the fact that hed donated $75,000 to the Clinton Foundation. Instead, Stephanopoulos defended Hillary Clinton rather vigorously, insisting the former U.S. Secretary of State was being tarred for no good reason. STEPHANOPOULOS: Based on what? Based on what? Do you have any direct evidence that she actually intervened on this issue?, SCHWEIZER: \"No we dont have direct evidence but it warrants further investigation because again, George, this is part of the broader pattern. You either have to come to the conclusion that these are all coincidences or something else is afoot.\", STEPHANOPOULOS: And that is what the Clintons do say, its coincidence, they say you have produced no evidence and I still havent heard any direct evidence and you just said you have no evidence that she intervened here, but I do want to ask a broader question: Its been reported that youve briefed several Republicans on the Senate Foreign Relations committee including the Chairman Bob Corker; did you offer any briefings to Democrats?, SCHWEIZER: No, but Id be glad to brief them before the books released. It went on like this for several painful minutes. If Stephanopoulos had disclosed his gift to the Clinton Foundation, the discussion would be about his bias, and remain political. But he didnt disclose. And so, his news organization tells us not to bother with their ethical issues. Stephanopoulos later apologized for not disclosing his contributions. ABC News congratulated him and left it at that. Ill leave it at that too. TV news? Im going to look for summer. Im out of here. jskass@tribpub.com, Twitter: @John_Kass]", "Date": "20150515", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-kass-stephanopoulos-met-0517-20150515-column.html", "Title": "[  After Stephanopoulos, I am boycotting all the talking heads]"}