{"Content": "[ U.S. Rep. Tammy Duckworths bid to challenge Republican U.S. Sen. Mark Kirk next year received a major boost Thursday when she won the backing of the Democratic Senatorial Campaign Committee. The endorsement gives Duckworth the official backing of the Democratic Partys Senate campaign in her primary bid against Andrea Zopp, former head of the Chicago Urban League. In a statement, U.S. Sen. Jon Tester, the Montana Democrat who heads the Senate campaign, said Duckworth \"has a proven record of advocating for veterans, women and working families. \"Tammys incredible story reflects her persistence and tenacity, even when the odds are stacked against her, and she brings that same determination to her work on behalf of her constituents every single day,\" Tester said of the two-term congresswoman who was injured during the Iraq War. In a statement, Zopp said she was \"saddened and shocked that the DSCC would issue an endorsement without even interviewing me\" and accused the group of displaying \"total insensitivity to Chicago, African-American women and the democratic process.\", The committees endorsement represents the latest action by the Democratic establishment to back Duckworth for the 2016 nomination. Duckworth already has the support of Illinois senior U.S. Sen. Dick Durbin, a Democrat, and she was backed by Senate Minority Leader Harry Reid, D-Nev. in a fundraising solicitation last month.  Rep. Tammy Duckworths challenge to Republican Sen. Mark Kirk portends a costly battle in what figures to be one of the most closely watched 2016 Senate contests. Duckworth, 47, a two-term Democrat from Hoffman Estates who lost her legs in the Iraq War in 2004, announced her bid Monday in a two-minute...  Rep. Tammy Duckworths challenge to Republican Sen. Mark Kirk portends a costly battle in what figures to be one of the most closely watched 2016 Senate contests. Duckworth, 47, a two-term Democrat from Hoffman Estates who lost her legs in the Iraq War in 2004, announced her bid Monday in a two-minute... Kirk, a first-term Republican senator, is one of the top national Democratic targets in a state that trends for Democrats in presidential election years. Though fundraising reports have yet to be officially filed, Kirks camp said it will report raising $1.35 million from April through June and starting this month with $3.2 million on hand. That compares to the $1.2 million raised during the three-month period by Duckworth, who had $2.2 million available to begin July, according to her campaign. Duckworth, of Hoffman Estates, announced her Senate candidacy at the end of March. Zopp, a former top Cook County prosecutor, launched her campaign in May and has said she expected to report raising more than $665,000. rap30@aol.com, Twitter @rap30]", "Date": "20150709", "Author": "[ Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-tammy-duckworth-national-democratic-endorsement-met-0710-20150709-story.html", "Title": "[ Rep. Tammy Duckworth gets boost from national Senate Democratic endorsement]"}