{"Content": "[ When a white Ferguson policeman fatally shot a black 18-year-old nearly a year ago, the St. Louis suburb erupted in violent protests and the nation took notice. Since then, legislators in almost every state have proposed changes to the way police interact with the public. The result: Twenty-four states have passed at least 40 new measures addressing such things as officer-worn cameras, training about racial bias, independent investigations when police use force and new limits on the flow of surplus military equipment to local law enforcement agencies, according to an analysis by The Associated Press. Despite all that action, far more proposals have stalled or failed, the AP review found. And few states have done anything to change their laws on when police are justified to use deadly force. National civil rights leaders praised the steps taken by states but said they arent enough to solve the racial tensions and economic disparities that have fueled protests in Ferguson, Baltimore, New York and elsewhere following instances in which people died in police custody or shootings. \"What we have right now in the country is an emerging consensus as to the need to act,\" said NAACP President Cornell William Brooks. \"What we dont have is a consensus as to how to act, what to act on and how to do this in some kind of priority order.\", The Aug. 9 shooting of Michael Brown, an unarmed 18-year-old who had scuffled withFerguson officer Darren Wilson, came just a few weeks after Eric Garner  an unarmed black man accused of illegally selling cigarettes  died in a struggle with white New York City officers. Garners death was captured by an onlookers video. Browns was not, and word quickly spread that he had been shot while surrendering with his hands up  an assertion uncorroborated by state and federal investigations. The fatal shooting of Michael Brown, a black 18-year-old, by a white Ferguson, Missouri, policeman was a catalyst for change in the St. Louis suburb. Other cities also have made changes over the past year following high-profile cases in which civilians were fatally shot by officers or died in police... The fatal shooting of Michael Brown, a black 18-year-old, by a white Ferguson, Missouri, policeman was a catalyst for change in the St. Louis suburb. Other cities also have made changes over the past year following high-profile cases in which civilians were fatally shot by officers or died in police... Some Ferguson protesters burned stores and threw rocks and Molotov cocktails at heavily armored police, who fired tear gas and rubber bullets to disperse crowds  all under the lens of live, national media coverage. The protests again turned violent when a Missouri grand jury decided not to charge Wilson. And similar riots broke out in Baltimore in April following the funeral of Freddie Gray, a 25-year-old black man who died after being injured in police custody. The AP analysis of legislation passed in all 50 states found the greatest interest in officer cameras that can capture what transpires between police and civilians. Sixteen states passed body-camera measures this year, ranging from resolutions merely creating study panels to state grants subsidizing cameras and new laws on how they can be used. Numerous cities from coast-to-coast, includingFerguso, also began using the cameras without waiting for legislative direction. \"Right now, all law enforcement has an image problem,\" said California Assemblyman Reginald Jones-Sawyer, a Democrat from Los Angeles whose budget subcommittee allotted $1 million for a pilot project outfitting some Highway Patrol troopers with cameras. \"Theyve got to show that they can police their own.\", As the Sabbath sun reached its highest point in the sky Saturday, Chicago Rabbi Seth Limmer shouldered a Torah and helped lead a crowd across a bridge that has come to symbolize Americas deepest divide. In doing so, Limmer, the spiritual leader of Chicago Sinai Congregation, reenacted a moment... As the Sabbath sun reached its highest point in the sky Saturday, Chicago Rabbi Seth Limmer shouldered a Torah and helped lead a crowd across a bridge that has come to symbolize Americas deepest divide. In doing so, Limmer, the spiritual leader of Chicago Sinai Congregation, reenacted a moment... Just three states  Colorado, Connecticut and Illinois  have passed comprehensive packages of legislation encouraging body cameras, boosting police training on such things as racial biases and requiring independent investigations when police shoot people. Colorado and Connecticut also are among several states that bolstered citizen rights to take videos of police. Police groups have been urging lawmakers to proceed with caution when altering laws on the way they do their jobs. They stress that officers involved in shootings deserve fair investigations and that surplus military equipment typically is used by police for defensive purposes. Any Ferguson-inspired changes should focus on training police commanders to make better decisions on when and how to use their officers and equipment, said Jim Pasco, executive director of the Fraternal Order of Police. Police are frustrated by the tone of the national debate, he said. \"While were trying to save lives, politicians are trying to save their jobs,\" he said. Police unions still hold considerable sway in some states, including in Missouri, where lawmakers filed about 65 bills stemming from the events inFerguson. Legislators passed just one of them  a measure limiting municipal court fines and traffic tickets in response to complaints about aggressive law enforcement designed to generate revenue. Most notably, Missouri made no change to its law on when police can use deadly force, even though it apparently doesnt comply with a 1985 U.S. Supreme Court ruling barring deadly force against unarmed fleeing suspects who pose no serious danger. \"As a state, we have not done much,\" said Missouri state Sen. Maria Chappelle-Nadal, who representsFerguson and was among the protesters who were tear-gassed by police. \"We have a bunch of chumps who are elected right now who are more comfortable keeping the status quo.\", The Rev. Al Sharpton, who has rallied with relatives of Brown and Garner, described Missouris response as \"disappointing\" and indicative of an \"institutional denial\" of the need for change. But Missouri Gov. Jay Nixon says the \"landmark\" municipal courts bill is an \"important step.\" A commission he created has proposed 148 steps to improve police and court policies, racial and economic equality and local schools. Nixon also created an Office of Community Engagement and a summer jobs program for young people in the St. Louis area. Other governors also have acted without waiting for legislators. After a rookie Cleveland patrolman fatally shot a 12-year-old boy who was holding a pellet gun in November, Ohio Gov. John Kasich created a panel to develop the states first-ever standards for police use of deadly force. And New York Gov. Andrew Cuomo signed an executive order directing appointment of special prosecutors to investigate police killings of unarmed civilians. In South Carolina, the Ferguson-inspired bills didnt pick up steam until the issue hit closer to home, when a bystanders cellphone video showed a white North Charleston officer fatally shooting an unarmed black man in the back in April. Two months later, Gov. Nikki Haley signed a bill allowing state aid for police agencies to buy body cameras. Advocates for police accountability pushed hard in Maryland this legislative session with limited success, winning passage of bills covering body camera policies and fatal incident reporting. Grays death occurred shortly after the session ended. Now Maryland lawmakers have formed a panel to further examine public safety and police practices, and civil rights activists there are urging lawmakers to do more. Ezekiel Edwards, director of the ACLUs criminal law reform project, said states cant expect to make real progress by merely equipping officers with cameras or providing more training. He said states must also provide better education, employment and housing opportunities for residents. \"Theres been a tremendous amount done over the past year,\" Edwards said, \"but there is a massive amount of work that is left to do going forward.\", Associated Press]", "Date": "20150802", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-ferguson-state-measures-20150802-story.html", "Title": "[ Ferguson spurs 40 new state measures; activists want more ]"}