{"Content": "[ Chicago Public Schools will increase organized sports opportunities for girls at a minimum of 12 high schools for the coming school year as part of a broader settlement with federal investigators who found \"significant\" gender-based participation gaps in district sports programs. In addition, by the 2018-19 school year, CPS must survey students on their athletic interests in order to add new sports or squads until all district high schools comply with a portion of federal regulations barring sex discrimination, often referred to as Title IX. Such steps will give an additional 6,200 girls a greater opportunity to participate in high school sports, the civil rights division of the U.S. Department of Education concluded. The district will have to find a way to comply amid its perennial budget problems. The federal inquiry into CPS was spurred by a 2010 complaint from the National Womens Law Center filed against the district and other school systems where the percentage of girls in organized sports was significantly smaller than the percentage of girls in the student body. Fatima Goss Graves, the organizations vice president for education and employment, said Thursday that while the agreement doesnt call for CPS to hit a specific participation level for girls, she expected to see the numbers rise. \"Chicago had a pretty large gap, so I think theres no place to go but up,\" she said. In all, the federal Education Department found girls were underrepresented in 84 of the districts high school athletic programs during the 2013-14 school year. Some of the largest gaps were recorded at Lane Tech High School, Simeon Career Academy, Young Magnet High School and Westinghouse College Prep. Lane Tech had the largest gap in terms of the number of girls participating in sports, according to statistics distributed by the government. Girls made up 55 percent of the student body, those figures said, but only 40 percent of its athletes. The school would have to add 477 girls to its athletic rosters to bridge that gap. Lane Tech Athletic Director Brian Hofman declined to comment. The school has one of the citys most robust sports programs. Charter schools were not included in the federal review, though they are still subject to Title IX requirements. CPS spokesman Bill McCaffrey said the district hired a Title IX sports compliance coordinator two years ago and \"continues to follow a plan to come into compliance with this agreement.\", \"Chicago Public Schools recognizes the importance that sports programs play in the lives of all student athletes and does not tolerate discrimination of any kind,\" McCaffrey said in a statement. CPS asked for a settlement before the federal investigation was complete, according to a letter the Education Department sent Thursday to interim schools chief Jesse Ruiz. The agreement between CPS and the government was signed at the beginning of July. High school football could cease to exist in some towns if a concussion lawsuit filed against the Illinois High School Association succeeds, officials with the organization said Friday. IHSA Executive Director Marty Hickman said some schools would not be able to afford on-call doctors for practices,... High school football could cease to exist in some towns if a concussion lawsuit filed against the Illinois High School Association succeeds, officials with the organization said Friday. IHSA Executive Director Marty Hickman said some schools would not be able to afford on-call doctors for practices,... The government said CPS asked in May that its coed cheer and dance teams be counted as \"athletic participants\" for Title IX purposes. But civil rights investigators did not include those teams in their analysis. The complaint over gender gaps in sports participation at CPS stems from Title IX of the Education Amendments of 1972, the expansive legal provisions to bar sex discrimination in federally funded education programs. In its 2013-14 fiscal year, the civil rights division of the Education Department said it investigated more than 3,600 sports-related Title IX complaints. Deborah Slaner Larkin of the Womens Sports Foundation, an advocacy group that pushes for athletic equality, said its not enough for schools to establish girls teams and hope for the best  they need to recruit girls to join. \"There is a difference between boys and girls, men and women,\" she said. \"Girls need to be asked. That doesnt mean were not interested. It doesnt mean we dont want to play. When were asked, and we feel that were wanted, we sign up big time.\", jjperez@tribpub.com, jkeilman@tribpub.com, Twitter @PerezJr , Twitter @JohnKeilman]", "Date": "20150710", "Author": "[ Juan Perez Jr., John Keilman]", "Link": "http://www.chicagotribune.com/news/ct-cps-title-ix-settlement-met-20150709-story.html", "Title": "[ CPS must add girls sports at 12 high schools to resolve federal probe]"}