{"Content": "[ Scott Walker, who formally entered the 2016 presidential race Monday, is where he has been for months. Along with Jeb Bush and Marco Rubio, hes one of the three most likely to win the Republican nomination. After a brief surge early this year, the Wisconsin governor hasnt moved any further ahead. He remains potentially formidable. He offers plenty for any faction of conservatives to get excited about, without appearing to have an overly divisive or extremist reputation  and, therefore, may not scare off Republicans who care most about winning in November 2016. Conservative writer Philip Klein wrote last week that the presidential nomination fight will be a true test of tea party conservatives: If Republicans choose a legacy candidate such as Bush, or a champion of big government such as John Kasich, it would be a fatal blow to the tea party. It would mean that whatever the influence the movement has or had, it could never hope to break the highest glass ceiling. Thats wrong. A faction can be important within a party even if a candidate outside its ranks captures the presidential nomination. Had Mitt Romney been elected in 2012, for example, he would have governed as an opponent of the health care act because of tea party and other conservative influence in the Republican Party, regardless of his record in Massachusetts and his personal views (whatever they really are) on health care policy. Still, Klein is correct that a Bush or Kasich nomination would be a setback for the tea party, in no small part because both candidates have specifically spoken out against some of its priorities and attitudes. What Klein leaves out is what tea partyers and other conservatives should be doing if they really want influence in their party. The true test is whether they can settle on a viable candidate (such as Walker, among other options) and avoid the distractions out there. They failed utterly in 2012, falling in and out of love with Michele Bachmann and Herman Cain. They are off to a bad start this time, chasing after Ben Carson and Donald Trump. Sometimes, of course, supporting a protest candidate who isnt going to win the nomination makes sense. True libertarians were not wrong to support Ron Paul in 2008 and 2012, even though Paul had little chance of winning. Their policy preferences were simply in the minority in the party, and Pauls campaign was, potentially at least, an avenue for finding new support. But getting excited about no-chance candidates when there are strong alternatives isnt going to do conservatives any good. Unless, of course, the whole purpose of the tea party movement is affect, not action. In that case, the hard work of sorting through Walker, Rubio and other plausible nominees  and of working hard to extract as many promises from those candidates as possible on what policies they will adhere to  is beside the point. If thats true, no one should expect tea partyers to have any important influence on the Republican Party in the future  beyond forcing its candidates to update their birther jokes to whatever gets them revved up about Hillary Clinton. If all they want is style, then thats all theyll get. Today, we are all Rick Perry. At least insofar as we are being confronted with a list that has too many items in it for us to remember with ease or convenience: the list of candidates for president in 2016. But never fear! I have come up with a couple of mnemonic devices that may or may not be... Today, we are all Rick Perry. At least insofar as we are being confronted with a list that has too many items in it for us to remember with ease or convenience: the list of candidates for president in 2016. But never fear! I have come up with a couple of mnemonic devices that may or may not be... Bloomberg, Jonathan Bernstein is a Bloomberg View columnist covering U.S. politics.]", "Date": "20150713", "Author": "[ Jonathan Bernstein]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-scott-walker-tea-party-candidate-20150713-story.html", "Title": "[ Scott Walker tests tea party's seriousness]"}