{"Content": "[ Hillary Clinton is a world figure who seeks to be the first female president of the U.S. Shes an experienced politician with matchless connections and a huge campaign war chest. She is a former secretary of state and U.S. senator. She is married to a former president who presided over what now looks like an economic golden age. For those and other reasons, shes the clear front-runner for the Democratic nomination. In the latest ABC News/Washington Post poll of Democrats, she leads her closest rival, U.S. Sen. Bernie Sanders, 63 percent to 14 percent. But theres something about this campaign that brings back memories of her last one. In August 2007, CNN reported: \"Sen. Hillary Clinton of New York retains her position firmly at the front of the pack of Democratic presidential candidates, with a poll Thursday giving her 44 percent of the vote, nearly double the 24 percent garnered by the next-closest candidate, Sen. Barack Obama of Illinois.\" We all know how that movie ended. And now? A new Gallup poll indicates that since 2012, the percentage of voters with a favorable view of Clinton has fallen from 66 percent to 43 percent  while her unfavorable number has jumped from 29 percent to 46 percent. The same weaknesses  the same public misgivings  that made her vulnerable to Obamas challenge could defeat her again. Based on long exposure to the Clintons, most Americans simply dont trust her. A recent CNN/ORC poll found that 57 percent of voters do not regard her as \"honest and trustworthy.\", This is based partly on the scandals involving her during the 1990s, such as Whitewater and Travelgate. She could chalk that up to ancient history, except more recent history provides additional reasons for distrust, particularly questions about her use of a private email server when she was secretary of state, and donations made to the Clinton Foundation by people who had a stake in State Department decisions. Was I alone in having my heart jump when, this past Sunday, I read in Maureen Dowds column in The New York Times that Vice President Joe Biden is seriously contemplating getting into the presidential race? According to Dowd, Bidens son Beau, shortly before his death, told his father he must do... Was I alone in having my heart jump when, this past Sunday, I read in Maureen Dowds column in The New York Times that Vice President Joe Biden is seriously contemplating getting into the presidential race? According to Dowd, Bidens son Beau, shortly before his death, told his father he must do... Consider the email affair. In violation of an administration policy against the use of unofficial email accounts for government business, Clinton used a private account  and failed to preserve all the emails, despite a federal regulation mandating their retention. She said none of them contained classified secrets  but two inspectors general concluded there was classified material that \"never should have been transmitted via an unclassified personal system.\", A House committee investigating the 2012 attack on the U.S. diplomatic mission in Benghazi, Libya, said she failed to turn over emails as required, reinforcing the sense that Clinton looks for ways to conceal the truth. She has a maddening penchant for information control. There was a classic Clinton moment last week when a voter asked if she was for or against the Keystone XL pipeline from Canada. \"If its undecided when I become president, I will answer your question,\" she replied. Debating Donald Trump is like boxing with smoke. You may have the facts on your side, but for this Republican presidential candidate, facts are mostly beside the point. Take, for example, his recent slap at President Barack Obamas legacy. Americans wont elect another black president for a long... Debating Donald Trump is like boxing with smoke. You may have the facts on your side, but for this Republican presidential candidate, facts are mostly beside the point. Take, for example, his recent slap at President Barack Obamas legacy. Americans wont elect another black president for a long... Beyond all that, she leaves many voters cold. Her campaign has rolled out ads designed to acquaint people with the human side of the candidate. Where have we heard that before? In December 2007, The New York Times reported that she \"has embarked this week on a warm-and-fuzzy tour, blitzing full throttle by helicopter across Iowa to present herself as likable and heartwarming.\" It didnt work then. Some voters are excited about Clinton. But Sanders seems to have an intensity edge among his supporters. As a self-styled socialist, the Vermont senator has an appeal that is probably too narrow to win the nomination. But a strong showing by him in Iowa and New Hampshire could do serious damage to Clintons campaign. Then what? The bright side for Clinton is that, as of now, no charismatic mainstream challenger such as Obama or another 2008 candidate, former Sen. John Edwards, is poised to run. Interesting, though, that Vice President Joe Biden is looking at getting in the race. He certainly knows that theres nothing inevitable about the next Democratic nomination for president. In the coming months, Clinton will do her best to reshape and upgrade the image that has emerged over the decades she has spent on the national stage. But she is finding that reputations are more easily acquired than transformed.]", "Date": "20150803", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct--hillary-clinton-campaign-trust-edit-0804-20150803-story.html", "Title": "[ Shades of 2008 for Hillary Clinton]"}