{"Content": "[ Normally quarrelsome House Republicans came together Wednesday night and passed a boldly conservative budget that relies on nearly $5 trillion in cuts to eliminate deficits over the next decade, calls for repealing the health care law and envisions transformations of the tax code and Medicare. Final passage, 228-199, came shortly after Republicans bumped up recommended defense spending to levels proposed by President Barack Obama. Much of the budgets savings would come from Medicaid, food stamps and welfare, programs that aid the low-income, although details were sketchy. Rep. Tom Price, R-Ga. chairman of the House Budget Committee, called the plan a \"balanced budget for a stronger America\"  and one that would \"get this economy rolling again.\", Democrats rebutted that the GOP numbers didnt add up and called their policies wrong-headed. \"People who are running in place today are not going to be moving forward under the Republican budget, theyre going to be falling back,\" said Rep. Chris Van Hollen of Maryland. The Republican-controlled Senate is likely to approve its version of a budget by weeks end. The plans themselves are non-binding and do not require a presidential signature. Instead, once the House and Senate agree on a common approach, lawmakers will have to draft legislation to carry out the program that Republicans have vowed to follow in the wake of campaign victories last fall that gave them control of both houses of Congress. Still, House passage of a budget marked a significant victory for Speaker John Boehner and the GOP leadership, which have struggled mightily to overcome differences within a fractious rank and file. An equally notable second triumph appeared on the horizon. Legislation to stabilize the system of payments to doctors who treat Medicare patients is expected to clear the House Thursday, and Obamas declaration of support enhanced its chances in the Senate. It includes a requirement for upper-income Medicare beneficiaries to pay more for their coverage, a provision Republicans hailed as a triumph in their drive to curtail the growth of benefit programs. There was nothing bipartisan about the budget debate, though. Republicans supported it, 228-17, while all 182 Democrats who voted were opposed. The House plan calls for $5.4 trillion in deficit reduction over a decade, including about $2 trillion from repeal of the law known as Obamacare. Nearly $1 trillion would be saved from from Medicaid and CHIP, health care programs for the low-income, and $1 billion from other unspecified benefit programs. Another $500 billion would come from general government programs that already have been squeezed in recent years by deficit-reduction agreements between Congress and the White House. This week offers a make-or-break moment for Republican leaders on Capitol Hill. After stumbling several times since taking control of Congress earlier this year, House Speaker John A. Boehner (R-Ohio) and Senate Majority Leader Mitch McConnell (R-Ky.) have an opportunity to demonstrate on two important... This week offers a make-or-break moment for Republican leaders on Capitol Hill. After stumbling several times since taking control of Congress earlier this year, House Speaker John A. Boehner (R-Ohio) and Senate Majority Leader Mitch McConnell (R-Ky.) have an opportunity to demonstrate on two important... The budget outline itself provides few if any details of the cuts envisioned, although once they appear in legislation they are highly likely to spark a veto showdown with Obama. The president has also vowed to defend the health care law that stands as his signature domestic achievement. The House has already voted more than 60 times to repeal it in part or whole, but for the first time since the law passed, House members have a willing partner in the Senate. The prospect of sending Obama legislation to repeal the health care law contributed to the unusual degree of unity among House conservatives. Without a budget in place, they noted, the repeal measure would not have special protection against a Senate filibuster  and would not reach the White House. As they have in recent years, House Republicans call for the transformation of Medicare into a voucher-like program. Senate Republicans, already worried about defending their majority in 2016, omitted that from their plan. Both the House and Senate plans call for an overhaul of the tax code. Defense spending caused a few anxious moments for Boehner and the leadership as the budget moved through the House Budget Committee and across the floor. As drafted by the panel, it called for $610 billion for the Pentagon for the coming budget year. Of that, $87 billion would come from an account that supports overseas military operations, and $21.5 billion would be dependent on offsetting spending cuts elsewhere. On a vote of 219-208, Republicans raised the overall level to $612 billion, none of it contingent on offsetting savings. Obamas budget called for $612 billion in defense spending. Republicans are eager to exceed his recommendation, and may decide to raise their level further in House-Senate compromise talks. House Republicans said their budget would yield a surplus of $13 billion in 2024 and $33 billion in 2025. Democrats scoffed at the claim. They pointed out such an outcome would rely in part on allowing $900 billion in popular tax breaks to expire as scheduled, and also assumed that tax hikes would be retained from the health care law that Republicans want to repeal. By contrast, Obamas budget would fail to eliminate deficits, despite the presence of nearly $2 trillion in higher taxes. In a years-old ritual, much of the day was consumed by debate and rejection of alternatives. House Democrats, progressives and the Congressional Black Caucus all advanced no-balance budgets that called for more domestic spending and higher taxes on the wealthy and corporations. The Democratic alternative drew more votes than the others, but failed 264-160. The conservative Republican Study Committee proposed far deeper spending cuts than the Budget Committee recommended, a delay in Medicare eligibility to age 67 for younger workers, and a balanced budget in six years. Republicans voted for it 132-112, but all 182 Democrats opposed it, and it went down to defeat. Associated Press]", "Date": "20150325", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-republican-house-budget-20150325-story.html", "Title": "[ GOP-led House passes budget with nearly $5 trillion in cuts]"}