{"Content": "[ The U.S. Supreme Court on Monday turned away a challenge to Wisconsins voter identification law, allowing the law to stand and handing a victory to Gov. Scott Walker following a long fight by opponents who say its a thinly veiled attempt to make it more difficult for Democratic backers to vote. The law wont be enforced for an April 7 election because its only two weeks away, but it will be in subsequent elections, the state attorney general said. Walker, a likely 2016 Republican presidential candidate, is a longtime proponent of voter ID requirements and signed Wisconsins into law in 2011. But it was only in effect for one low-turnout primary in 2012 before legal challenges kept it on hold. The Supreme Courts decision not to take up the case ends the legal fight, for now. \"This is great news for Wisconsin voters,\" Walker said in a statement. \"As weve said, this is a common sense reform that protects the integrity of our voting process, making it easy to vote and hard to cheat.\", Democratic critics, as well as a federal judge in Milwaukee who last year declared the law to be unconstitutional, say in-person voting fraud is extremely rare. In his ruling striking down the law, U.S. District Judge Lynn Adelman said there appears to have been one documented case of voter fraud in Wisconsin between 2004 and 2012, and that was committed by a man who obtained a ballot in the name of his deceased wife. TheU.S. Supreme Courton Thursday blocked a newvoteridentification law inWisconsinfrom going into effect. The nine-justice court, with three conservative members dissenting, granted a last-minute request by civil rights groups seeking to block an appeals court ruling that the law could be implemented. TheU.S. Supreme Courton Thursday blocked a newvoteridentification law inWisconsinfrom going into effect. The nine-justice court, with three conservative members dissenting, granted a last-minute request by civil rights groups seeking to block an appeals court ruling that the law could be implemented. Opponents of the law say its true intent is to make it more difficult for older, poor and minority voters who tend to support Democrats and are more likely not to have the proper ID. The American Civil Liberties Union and allied groups persuaded Adelman to declare the law unconstitutional last year. But the 7th U.S. Circuit Court of Appeals in Chicago later ruled that the law did not violate the Constitution. The Supreme Court got involved last fall, temporarily blocking the state from requiring photo IDs in Novembers general election, in which Walker won another term. While the court did not comment Monday on why it declined to take the case, its decision is further evidence that it put the law on hold only because the election was close at hand and absentee ballots already had been mailed with no notification of the need to present photo IDs. For much the same reasons, photo IDs will not be required for an election just two weeks away in which a state Supreme Court justice will be elected, said Republican Attorney General Brad Schimel. \"Absentee ballots are already in the hands of voters, therefore, the law cannot be implemented for the April 7 election,\" Schimel said in a statement. \"The Voter ID law will be in place for future elections - this decision is final.\", The ACLU asked a federal appeals court, in an emergency motion, to stay enforcement of the law. Wisconsins chief elections officer, Kevin Kennedy, said the state will not block that request because trying to require photo IDs so close to the election \"wouldnt work and would add a lot of chaos and confusion.\", The next statewide general election where the voter ID law will be in place is the February 2016 spring primary, although its anticipated there will be local special elections before then where IDs will be required, Kennedy said. Dale Ho, director of the ACLUs Voting Rights project, said he was pleased the law wont be in effect for the April 7 election and next steps were being evaluated to block the law permanently. \"The last thing we need is laws that erect barriers for people who have been good voters for decades,\" said Andrea Kaminski, executive director of the League of Women Voters of Wisconsin. Wisconsin was one of four states in which a dispute over voting rules reached the Supreme Court last fall. The other states were North Carolina, Ohio and Texas. Of the four states, only Wisconsins new rules were blocked. Associated Press]", "Date": "20150323", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-wisconsin-voter-id-law-20150323-story.html", "Title": "[ Supreme Court rejects challenge to Wisconsin voter ID law]"}