{"Content": "[ Former Gov. Rod Blagojevich will seek justice from the U.S. Supreme Court after losing his bid Wednesday for the full 7th Circuit U.S. Court of Appeals in Chicago to reconsider its refusal to overturn his conviction and 14-year prison sentence. In a statement, Blagojevichs wife, Patti, said she was disappointed the 7th Circuit would not rehear the appeal but thankful the decision came so quickly \"because the waiting is awful.\", \"Whats clear is that in order for us to see justice, the appeal needs to be taken out of Illinois and be in the hands of the U.S. Supreme Court where we can find fairness and impartial justices,\" her statement said. In announcing its decision, the 7th Circuit said that each of the three judges on the original panel voted to deny the rehearing and that none of its other active judges requested a vote. That left Blagojevich, who has served a little more than three years of his sentence at a Colorado prison, with one option: a long-shot appeal with the nations highest court. In a statement, Blagojevichs attorney, Leonard Goodman, confirmed he would now appeal to the Supreme Court. Goodman called the three-judge panels decision \"flawed,\" saying it \"puts every public official, who must raise campaign funds to stay in office and be effective, at the mercy of an ambitious or politically motivated federal prosecutor.\", A full appellate court in Chicago will not rehear the appeal of former Illinois Gov. Rod Blagojevichs corruption convictions. The 7th U.S. Circuit Court of Appeals posted a notice Wednesday indicating there would be no rehearing for the imprisoned Democrat. Aug. 19, 2015. (WGN-TV), A full appellate court in Chicago will not rehear the appeal of former Illinois Gov. Rod Blagojevichs corruption convictions. The 7th U.S. Circuit Court of Appeals posted a notice Wednesday indicating there would be no rehearing for the imprisoned Democrat. Aug. 19, 2015. (WGN-TV), The denial for an en banc hearing was not a surprise, especially since the original panels opinion was unanimous. \"The bottom line is, there really wasnt anything else for the 7th Circuit to decide,\" said Jeffrey Cramer, a former federal prosecutor who heads the Kroll security company in Chicago. \"The three-member panel  all very well-respected judges  was patently clear that there was overwhelming evidence of guilt and a full en banc hearing wasnt going to change that.\", Cramer said Blagojevichs attorneys have \"nothing to lose\" in filing a petition with the U.S. Supreme Court, but its highly unlikely the justices would agree to take up Blagojevichs case. \"The Supreme Court takes things of national interest where there is a split among the federal circuits,\" said Cramer, citing media mogul Conrad Blacks case or questions surrounding the nations \"honest services\" law. \"You dont have that here. Hed basically be asking them to overturn a jurys verdict, and the Supreme Court isnt interested in that.\", Former Gov. Rod Blagojevichs wife, Patti, and his attorney expressed disappointment at the appellate court ruling that was handed down Tuesday. At a news conference outside the family home in the citys Ravenswood Manor neighborhood, Patti Blagojevich said she had told her husband of the ruling.... Former Gov. Rod Blagojevichs wife, Patti, and his attorney expressed disappointment at the appellate court ruling that was handed down Tuesday. At a news conference outside the family home in the citys Ravenswood Manor neighborhood, Patti Blagojevich said she had told her husband of the ruling.... Blagojevich, 58, was convicted of misusing his powers as governor in an array of shakedown schemes, most famously for his alleged attempts to sell the U.S. Senate seat vacated by Barack Obama after his 2008 election as president. Blagojevich, incarcerated in a federal prison in suburban Denver since March 2012, is not scheduled to be released until May 2024, according to the Federal Bureau of Prisons website. In its July 21 decision, the original appeals panel threw out five of Blagojevichs extortion convictions on technical grounds and ordered the former governors sentence vacated. If prosecutors opted not to retry Blagojevich on the five dismissed counts, the court held that the former governor should be resentenced by U.S. District Judge James Zagel, the same judge who imposed the original 14-year prison term. But that small legal victory was tempered by the court calling the evidence against Blagojevich \"overwhelming\" and making it clear that Zagels original sentence was not out of bounds. In petitioning for the en banc hearing earlier this month, Blagojevichs lawyers found fault with the panel for backing Zagels approval of jury instructions on the extortion statute. The defense had argued that those instructions violated a recent Supreme Court ruling. At the time, a statement attributed to Blagojevich said that \"what is at stake is nothing less than the rule of the law.\", Blagojevichs lawyers also argued that the decision lowers the standard of proof for what constitutes a bribe so far that politicians, who must raise campaign money to get elected and to be effective in office, could not possibly adhere to it. \"Fundraising is a part of the job of every politician,\" Blagojevich said in the statement. \"The jury instructions used to convict me in my case are not the law. It makes the standard so low that any politician can be jailed at the whim of an ambitious prosecutor. That standard is wrong and needs to be corrected.\", Cramer said Wednesday that it could take months for the petition to the Supreme Court to play out. If the court denies hearing the case, the likelihood of prosecutors opting to retry Blagojevich on the five vacated counts is remote, making a resentencing hearing likely sometime in 2016, he said. \"And then, youll have finality,\" Cramer said. jmeisner@tribpub.com, Twitter @jmetr22b]", "Date": "20150819", "Author": "[ Jason Meisner]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-blagojevich-appeal-20150819-story.html", "Title": "[  Blagojevich to appeal to Supreme Court after 7th Circuit denies rehearing]"}