{"Content": "[ University of Illinois Chancellor Phyllis Wise abruptly announced her resignation Thursday, citing \"external issues\" after a tumultuous year at the states flagship public university. Wise, chancellor and vice president of the Urbana-Champaign campus since 2011, will receive $400,000 as part of her resignation agreement. The decision follows discussions between U. of I. President Timothy Killeen and Wise that began earlier this week, and even the chancellors closest colleagues were caught off guard by the announcement. She plans to join the faculty after the resignation is effective Aug. 12 and, according to her contract, is also eligible for a one-year paid sabbatical before that assignment begins. \"External issues have arisen over the past year that have distracted us from the important tasks at hand,\" Wise wrote in a statement. \"I have concluded that these issues are diverting much needed energy and attention from our goals. I therefore believe the time is right for me to step aside.\", Wise, 70, has been under fire over several issues in the past year. Most recently, athletes in three programs  including football and womens basketball  have alleged that they were mistreated by coaches and other staff. But the harshest criticism against Wise focused on the decision last summer to withdraw a job offer to professor Steven Salaita after he made a series of critical and profane comments about Israel on social media. U. of I. rescinded Salaitas offer for a tenured faculty position in the American Indian studies department weeks before he was scheduled to start teaching. The University of Illinois has spent $843,000 defending itself in a pair of lawsuits filed by a professor who was denied a job at the school after posting anti-Israel messages on Twitter. WDWS radio obtained invoices showing how much the school paid to two outside law firms in the Steven Salaita... The University of Illinois has spent $843,000 defending itself in a pair of lawsuits filed by a professor who was denied a job at the school after posting anti-Israel messages on Twitter. WDWS radio obtained invoices showing how much the school paid to two outside law firms in the Steven Salaita... That decision led to much fallout, including a recent censure by the American Association of University Professors, a prominent professors group, which said U. of I. violated the principles of academic freedom. More than a dozen U. of I. academic departments voted no confidence in Wises leadership, and faculty across the country have boycotted the campus and canceled events there. Salaita has filed a federal lawsuit alleging breach of contract and violation of his free speech rights. Those controversies apparently came to a head this week, and Wise submitted a one-sentence resignation letter Thursday. Wise, whose salary is $549,069 this year, will receive a $400,000 lump-sum payment as part of her decision to step aside, said U. of I. spokesman Thomas Hardy. According to her employment agreement, signed in 2011, Wise only would have been eligible for a $500,000 retention bonus if she served for five years or if the board of trustees decided to end her contract sooner. In January 2012, shortly after being hired as the new Illinois football coach, Tim Beckman introduced himself to his players at Memorial Stadium wearing a blue suit with an orange tie. He quickly tossed the suit coat to the side. Suits were not his style. \"He was really pumped. He was excited.... In January 2012, shortly after being hired as the new Illinois football coach, Tim Beckman introduced himself to his players at Memorial Stadium wearing a blue suit with an orange tie. He quickly tossed the suit coat to the side. Suits were not his style. \"He was really pumped. He was excited.... \"The university agreed to pay her the $400,000 ... as part of an agreement for her resignation as chancellor and vice president,\" Hardy said. Wise also can take the one-year paid sabbatical guaranteed in her contract before assuming her faculty appointment at the U. of I.s School of Molecular and Cellular Biology. Her faculty salary has not been set, but her contract stipulates that it will be equal to the highest faculty salary in that department  about $300,000, Hardy said. Wise and Killeen could not be reached for comment. Killeen said he will name an interim chancellor within the week. Wises accomplishments include spearheading efforts to start an engineering-based medical school on the campus. The school, which could enroll students as soon as fall 2017, will likely be her longest-lasting legacy. Wise overcame internal battles to get the school approved, and has called it a \"game changer\" and one that is necessary for the university to compete in fields such as biomedicine. \"Chancellor Wises energy and commitment to the University of Illinois at Urbana-Champaign have never flagged,\" Killeen said in a statement. \"In addition to other accomplishments too numerous to list, her vision and advocacy for a new College of Medicine represents a major contribution and provides for a lasting legacy.\", Kinesiology professor Kim Graber, vice chair of the campus Senate Executive Committee, called it a \"sad day\" and said Wise was put in a \"lose-lose situation\" in regard to hiring Salaita. \"She was caught in the middle of a very difficult situation. I hope she will be remembered for her positive contributions, which were significant,\" Graber said. She praised Wises leadership in starting large-scale online courses and spearheading the College of Medicine. \"She made that possible. She was committed from the get-go and she saw it successfully through,\" Graber said. But in the short term, the recent controversies have overshadowed her accomplishments. Faculty, especially those in the humanities, have criticized her leadership, and there have been efforts to form a union for tenure-track faculty members. \"It is the right thing for her to step down. I wish that I could be more supportive of her, but unfortunately during the last year, she has made so many missteps that have cost the university so many hundreds of thousands of dollars in legal fees,\" said U. of I. religion professor Bruce Rosenstock, president of the Campus Faculty Association, a faculty advocacy group. Seven former basketball players filed a $10 million lawsuit against the university last month, alleging that the head coach and a former assistant coach created a racially hostile environment. Earlier this week, the university announced that an independent investigation done by a Chicago law firm concluded there was no basis to the claims. Wise said earlier this week that the school would create more opportunities for student-athletes to report their concerns. An investigation into the football program is ongoing, and in June, a former female soccer player sued the school for negligence in the way it handled her complex concussion. On Thursday, hours before the resignation announcement, a federal judge rejected U. of I.s efforts to dismiss Salaitas lawsuit. The university claims it did not have a contract with Salaita. Despite the ongoing concerns, campus leaders said they were stunned by the resignation. Computer science professor Roy Campbell, outgoing chair of U. of I.s Senate Executive Committee, said the news of Wises resignation came as a shock. While he praised Wises leadership, Campbell also said her resignation was a sign that the recent controversies were too overwhelming. \"The majority of people at the university thought she was doing an excellent job,\" Campbell said. \"Theres so much opportunity for the university that any leader would want to be doing their best all the time and not be distracted by problems. And I would suspect that thats how she feels, that she cant give her full attention to those opportunities right now.\", Education professor Nicholas Burbules said he thought Wise \"deserved a better fate.\", \"There is no doubt that there were controversies that we have been dealing with and are still dealing with. This is what happens to good leaders sometimes. You have to take responsibility,\" Burbules said. \"I know the decisions she made, she made with nothing but the best interest of the campus in mind.\", Chicago Tribunes Dawn Rhodes and Christy Gutowski contributed. jscohen@tribpub.com, Twitter @higherednews]", "Date": "20150806", "Author": "[ Jodi S. Cohen]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-university-of-illinois-chancellor-resigns-20150806-story.html", "Title": "[ After tumultuous year, U. of I. chancellor abruptly steps down ]"}