{"Content": "[ Mayor Rahm Emanuel on Thursday would not provide a full financial picture of his administrations deal to redevelop the Malcolm X College site into a Blackhawks practice center and a Rush University expansion. As part of the musical chairs on the Near West Side, City Colleges of Chicago will move into a new $251 million campus for Malcolm X on a parcel just north of the colleges current site. When that project is completed in January, Emanuel said the city will take steps to start redeveloping the 11-acre campus on West Van Buren Street for the Blackhawks and Rush. The city would pay to tear down the old Malcolm X buildings and prepare the site for construction. The Blackhawks will purchase four acres for its practice facility, while Rush would buy the remaining seven acres. Asked what the Blackhawks would pay for the land, Emanuel responded: \"Theyre going to be paying market rate. ... Our job as the city will be making the land available, which means taking down the old Malcolm X.\", When the mayor was asked how much it would cost to tear down the old college, he responded, \"Well get you all that information. Know that the net result will be resources that come back to the city, because when youre done with the demolition of the facility, (with the Blackhawks) paying market rate, there will be additional resources for the city.\", Emanuel also was asked whether the Blackhawks would get a discount on the purchase price for the land in exchange for making its rinks available to the public. The West Side is about to get a big dose of hockey. Chicago Mayor Rahm Emanuel will announce Thursday the city has come to an agreement with the Blackhawks for the team to build its new practice facility and community ice center on the site currently occupied by Malcolm X College, which is just... The West Side is about to get a big dose of hockey. Chicago Mayor Rahm Emanuel will announce Thursday the city has come to an agreement with the Blackhawks for the team to build its new practice facility and community ice center on the site currently occupied by Malcolm X College, which is just... \"Theyll have all the information on that,\" Emanuel said of his staff. \"Know that it will be a net gain for the city from a financial standpoint, not even counting what theyre doing in the sense of community work.\", Later, however, Emanuel spokeswoman Elizabeth Langsdorf declined to say how much the demolition work would cost the city. And Langsdorf declined to say how much the site preparation would cost because bids had not gone out yet. She declined to provide an estimate. Langsdorf also would not disclose how much Rush and the Blackhawks will pay for the land, other than to say it would \"exceed market value with a mix of cash and community benefits.\" Langsdorf would not identify the specific community benefits or their value. \"Nothing is being hidden,\" Langsdorf said. \"The final paperwork isnt done. As soon as the purchase agreement is finalized, the details will be made available. No one is rushing anything.\", Chicago has come to an agreement with the Blackhawks to build its new practice facility and community ice center on the site currently occupied by Malcolm X College, which is just south of the United Center. (WGN-TV), Chicago has come to an agreement with the Blackhawks to build its new practice facility and community ice center on the site currently occupied by Malcolm X College, which is just south of the United Center. (WGN-TV), On the four-acre parcel, Blackhawks chairman Rocky Wirtz said the team would build what he called the Chicago Blackhawks Community Center. The building would cost the team $50 million and contain two NHL-regulation-size rinks and spectator seating. The Blackhawks estimated that 94 percent of the time the new facility is in use it will be serving the surrounding community, including \"young adult, youth and community programs that may not have the means to play otherwise.\", Ald. Walter Burnett Jr. 27th, said this was not the first parcel the Blackhawks considered for the facility and that the team had been persistent about striking a deal. Wirtz and Bulls owner Jerry Reinsdorf, whose teams jointly own the United Center, previously had talked about building a $100 million entertainment and retail complex next to the arena, but sought a replacement for current tax incentives set to expire in 2016. When the city didnt agree to such a change, the teams pursued a more modest office complex plan near the stadium. There also has been talk of the teams seeking a guaranteed freeze in the citys amusement tax on sports tickets in exchange for future development by the teams. Wirtz said Thursday that such a freeze was not discussed as part of the deal to build the Blackhawks practice center. On the remaining seven acres of the Malcolm X site, Rush University plans to build an educational facility that will include dorms, said Dr. Larry Goodman, the universitys president and CEO. Ald. Burnett said the university had agreed to house Malcolm Xs basketball players in the future dorms on the site. Goodman did not provide details on what else the university might use the site for, other than to note the universitys enrollment has doubled to 2,500 students in the last 10 years. Rush has assisted in developing curriculum for Malcolm X, a two-year college that offers a focus in health care. \"We have the Blackhawks training facility aligned with health sciences, sports and making sure the community as a whole gets a chance to have an economic shot in the arm and continue to involve the community in sports and wellness,\" Emanuel said in lauding the project. \"This is a great day for the city of Chicago.\", bruthhart@tribpub.com, Twitter @BillRuthhart]", "Date": "20150730", "Author": "[ Bill Ruthhart]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rahm-emanuel-blackhawks-malcolm-x-met-0731-20150730-story.html", "Title": "[ Emanuel administration: 'Nothing is being hidden' on Blackhawks practice site]"}