{"Content": "[ A renewed petition drive aimed at asking voters to take much of the politics out of the drawing of state legislative boundaries was launched Tuesday, nearly a year after a similar effort was struck down by a Cook County judge. The independent map amendment effort, intended to try to change the Illinois Constitution, is an attempt to secure more valid petition signatures and reword the proposal to try to conform with Judge Mary Mikvas ruling in June, advocates said. At issue is the every-decade process of redrawing the states 118 House and 59 Senate districts to conform to population changes in the U.S. census  a process that now puts a premium on political protection for incumbents and leads to many uncontested legislative elections. We believe this reform will lead to more competitive elections, give voters greater choice and ultimately will improve Illinois government and make it more responsive to the citizens of Illinois, said Dennis FitzSimons, the former chairman and CEO of Tribune Co. and chair of the Robert R. McCormick Foundation, who is leading the remap coalition. Our state government  will work best when legislators represent and are accountable to the people who elect them and not the politicians who draw the maps, FitzSimons said. Other leaders of the broad-based remap effort include former Republican Gov. Jim Edgar and Bill Daley, brother and son of former Chicago mayors and a former chief of staff to Democratic President Barack Obama. Currently, state lawmakers are charged with drawing a new map thats subject to approval of the governor. Thats what happened after the 2010 census when the Democrat-controlled General Assembly drew a map signed by then-Gov. Pat Quinn, a Democrat. Union officials lodged their opposition Tuesday to Gov. Bruce Rauners proposed right-to-work zones as part of Mayor Rahm Emanuels effort to send a message to state lawmakers that City Hall opposes the idea. The testimony came at a City Council hearing on a symbolic resolution sponsored by Emanuel... Union officials lodged their opposition Tuesday to Gov. Bruce Rauners proposed right-to-work zones as part of Mayor Rahm Emanuels effort to send a message to state lawmakers that City Hall opposes the idea. The testimony came at a City Council hearing on a symbolic resolution sponsored by Emanuel... Under the constitution, if lawmakers are unable to put together a map that could be signed into law, an eight-member panel of equal numbers of Democrats and Republicans is charged with drawing the new boundaries. If they failed to reach agreement, a ninth, tiebreaking member would be chosen in a random drawing. Democrats won the tiebreaker and the map in 1981 and 2001, while a Republican name was drawn in 1991. The proposed state constitutional amendment, which would be submitted to voters in the November 2016 election if it is found valid, closely resembles the proposal that failed to make the ballot last fall. It would create a multistage process culminating with the appointment of an 11-member commission with seven culled from a pool of 100 potential members along with four members chosen by each of the General Assemblys leaders. After public hearings, any map would require the approval of seven commissioners, including two Republicans and two Democrats. If the commission failed to approve a map, the chief justice of the Illinois Supreme Court and the top-ranking justice of the opposite party would jointly appoint a special master to draw the new boundaries. An independent review of the Illinois state treasurers office released Monday found problems with internship hiring that favored those with political connections and other programs in need of overhaul. Democrat Mike Frerichs, having reached the symbolic benchmark 100 days in office, released the... An independent review of the Illinois state treasurers office released Monday found problems with internship hiring that favored those with political connections and other programs in need of overhaul. Democrat Mike Frerichs, having reached the symbolic benchmark 100 days in office, released the... Petition-driven efforts to ask voters to change the states governing document are extremely limited by the Illinois Constitution. In striking down the redistricting proposal last year, Mikva ruled that provisions that would prevent any of the commissioners from holding various appointed or elected offices for 10 years was an unconstitutional limitation on qualifications to serve in the legislature. That provision was removed in the renewed effort. To get on the ballot, the proposal would require the valid signatures of 290,216 Illinois voters. A State Board of Elections review of signatures in the previous effort found it likely that the proposal lacked the number needed. This time around, supporters have hired a paid petition-gathering group that has shown success in getting signatures. We know were going to have challenges in the court system on the constitutionality of the amendment. We know were going to have challenges to the petition signatures. Were very confident well get through that, FitzSimons said. Can things go wrong? Things can always go wrong. But again, building on the earlier campaigns, we definitely feel we have an advantage.]", "Date": "20150428", "Author": "[ Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/chi-illinois-redistricting-reform-effort-starts-over-20150428-story.html", "Title": "[ New push to change Illinois remap process begins]"}