{"Content": "[ Mayor Rahm Emanuel once again tried to write \"the next chapter\" for Chicago Public Schools on Thursday, this time turning to a trusted ally and political insider he hopes can repair the damaged district. While Forrest Claypool lacks the education policy pedigree of Emanuels first two picks to run the schools, his experience is suited for two of CPS greatest short-term problems: finances and ethics. Claypool made his reputation as a city administrator slashing budgets and issuing pink slips, which could prove helpful as CPS faces a $1.1 billion budget shortfall. And Claypool tried to establish himself as a political reformer by taking on the old-school Stroger family on the Cook County Board, an image in need at a school district facing a federal probe into a $20.5 million, no-bid principal training contract. At CPS, Claypool appears content to let others handle classroom details while he tries to figure out how to keep the district afloat financially. \"You can see the magnitude of the crisis, where the dollars that should be going into the classroom are not there or are being diverted for other purposes. Thats something that is an enormous challenge for us on many levels,\" Claypool said. \"Im grateful for the mayors confidence in me. I believe my main challenge is to manage the system and make it as efficient as it possibly can be.\", Efficiency is political speak for budget cuts and layoffs, and CPS has faced plenty of those in recent days. And more await if Democratic lawmakers and Republican Gov. Bruce Rauner dont break their summerlong stalemate and grant the district some form of financial relief. Frank Clarks reputation as a savvy business leader with political smarts will be tested as president of the Chicago Board of Education. Clark, the former chairman and CEO of Commonwealth Edison, will oversee a school system reeling from a massive budget deficit, an underfunded pension and tense... Frank Clarks reputation as a savvy business leader with political smarts will be tested as president of the Chicago Board of Education. Clark, the former chairman and CEO of Commonwealth Edison, will oversee a school system reeling from a massive budget deficit, an underfunded pension and tense... The mayor announced Claypool as his City Hall chief of staff in late April, a week after reports surfaced that then-CPS CEO Barbara Byrd-Bennett was at the center of a federal grand jury investigation into a contract Emanuels school board had issued. Once it became clear he would have to replace Byrd-Bennett, Emanuel focused on naming Claypool as her successor, said a City Hall source familiar with the decision who was not authorized to speak publicly. Emanuel interviewed internal candidates at CPS to surround Claypool on the districts senior leadership team but did not consider other options for CEO, the source said. Unlike his previous two hirings for the job, the mayor did not conduct a national search, the source added. The mayor sought to take the attention off of Claypools lack of education expertise by announcing other new leadership posts at CPS and the Chicago Board of Education. Emanuel named Janice Jackson, a fast-rising middle manager at CPS, as the districts new chief education officer. And Denise Little, a longtime CPS educator, was picked to serve as Claypools senior adviser. Mayor Emanuel claims he has put together a team of experts to run CPS. Without help Emanuel says things will only get worse. Parents just want the best education possible for their children. July 16, 2015. (WGN-TV), Mayor Emanuel claims he has put together a team of experts to run CPS. Without help Emanuel says things will only get worse. Parents just want the best education possible for their children. July 16, 2015. (WGN-TV), In addition, Emanuel chose Frank Clark, a retired ComEd executive who helped lead the mayors 2013 school closing process, as the new school board chairman. Asked Thursday about Claypools qualifications for the top CPS post, Emanuel repeatedly referred to the whole teams expertise. But Emanuel also sought to bring cachet to Claypools hiring, even though the mayor only had to walk down a fifth-floor hallway at City Hall to make it. \"Ive worked with some of the countrys great Cabinet secretaries at the federal level. Ive worked with a number of people at different levels in corporate America, but Ive never seen a manager with Forrest Claypools capacity for leadership,\" Emanuel said, referring to his stints as White House chief of staff and senior adviser. \"Hes a unique talent with unique capabilities in public service.\", But the Chicago Teachers Union dismissed Claypools appointment as nothing more than Emanuel turning to a \"political fixer.\" During her own news conference Thursday, CTU President Karen Lewis spoke pointedly about Clarks role in closing schools and said Claypools reputation as a mayoral insider didnt leave her confident that the district would make many positive changes. Still, Claypool characterized a Thursday morning phone call he had with Lewis as \"a very good conversation\" and added that he hoped both sides could look past their differences and political rhetoric to unite in lobbying state lawmakers for the financial relief the district needs. \"I did talk to him this morning and I said, Run, Forrest, run! away from this,\" Lewis said of Claypool. \" This will be a mistake for you. \", Its not the first time a Chicago mayor has turned to Claypool to steady the ship at a time of crisis. When Richard M. Daley called him back to City Hall in early 1998 for his second stint as chief of staff, the mayor was facing difficulties shortly before seeking re-election. Then-Chicago police Superintendent Matt Rodriguez had resigned two months earlier amid revelations about his relationship with an Old Town restaurateur who had pleaded guilty to mail fraud, had been questioned in the slaying of an oil company executive and was being investigated in two other killings. Daleys City Council floor leader, Bridgeport Ald. Patrick Huels, had stepped down the previous fall when it came to light that his security firm got a big loan from a politically connected trucking firm that received a Huels-backed city subsidy to build a new headquarters in Huels ward. And Operation Silver Shovel, a federal probe into bribery and illegal dumping that ensnared several aldermen, was in full swing. Before then, Claypool had run Daleys Chicago Park District, where from 1993 through 1997 he cut the payroll of full-time and part-time employees by about 20 percent, a reduction he achieved largely through hundreds of layoffs and by privatizing many Park District services. for handing out lots of pink slips at the CTA, where as Emanuels hand-picked president he dismissed about 900 employees, roughly 8 percent of the CTAs total positions, from 2011 to mid-2014. Despite his close relationships with Daley and Emanuel, and his insider status in successive mayoral administrations, Claypool has positioned himself as a political reformer. After leaving the Daley administration, Claypool won a county board seat and became a vocal opponent of both John Stroger and Todd Stroger, the father and son who served as presidents of the board while Claypool was there. But Claypool lost a board president bid to John Stroger in 2006. Four years later, Claypool mounted an unsuccessful independent bid for assessor against Democrat Joe Berrios  a close ally of Democratic House Speaker Michael Madigan. Now Claypool must try to negotiate pension help for CPS in a legislature Madigan controls. Claypool takes over as CPS grapples with a budget shortfall of about $1.1 billion in the coming school year. Cuts already have been made, but school officials say it could get much more difficult come midyear. Preliminary budgets for individual schools released this week depend on $500 million in relief from state lawmakers and the governor, who are deadlocked on their own budget amid partisan battle. \"I know Forrest is exactly the right person at the right time to lead CPS at this moment,\" Emanuel said. \"With the financial crisis at CPS having reached the doors of our schools, Forrest has the skills, but also the relationships in Springfield, to work through these challenges to ensure the gains weve made educationally continue on the right path and that the financial challenges do not threaten them.\", But when Claypool was asked Thursday how he would approach state lawmakers to obtain a deal to rescue CPS from some of its financial obligations, Claypool quickly backed away from the podium and looked toward Emanuel. \"I would defer to those political ones,\" Claypool said. \"Not my bailiwick.\", Emanuels quick switch to Claypool also shows that the talent pool of people the mayor trusts does not run particularly deep. The mayor also announced Thursday that longtime senior adviser David Spielfogel will serve as his acting chief of staff. At the school board, Clarks arrival marked the departure of David Vitale, who has served as president for the last four and a half years. Vitale presided over the districts financially disastrous auction-rate borrowing strategy beginning in 2003, first as chief administration officer, then as chief operating officer, the Tribune has reported. As board president, Vitale signed off on the no-bid principal training contract at the center of the federal investigation. Emanuel was asked Thursday whether the board presidents role in the borrowing losses and contract scandal led him to replace Vitale. \"The idea was Davids,\" Emanuel said. \"David offered the idea that he step down at this time, because the tradition at CPS has been a new CEO and a new chair. When David offered to step down, I was reluctant to accept it.\", Vitale stood quietly at Thursdays news conference at Westinghouse College Preps campus in East Garfield Park as Emanuel heaped praise on him for his leadership and accomplishments at the board. Afterward, as Claypool and Clark stuck around at the high school to greet well-wishers and answer questions, Vitale walked out as reporters followed him. \"I dont think it has anything to do with controversy,\" Vitale said when asked what role the school closings he oversaw and the federal investigation hanging over CPS played in his departure. \"I think its building a working relationship thats really important going forward.\", As reporters continued to ask Vitale about the principal training contract, Vitale walked up and down the sidewalk in front of the high school looking for his ride, at one point quietly holding up his hands rather than respond to questions about the no-bid deal. \"We were closing 50 schools, trying to make sure we had 12,000 kids in the right place,\" Vitale eventually said about the controversial contract. \"We did everything we were supposed to do, but we did not spend enormous amounts of time on every single contract that came through. We had a lot going on. We were closing 50 schools and we were making sure 12,000 kids ended up in the right place.\", Then Vitale finally found the black SUV he was looking for, climbed in and rode off. Chicago Tribunes Juan Perez Jr. and Jasper Craven contributed. bruthhart@tribpub.com, jebyrne@tribpub.com]", "Date": "20150716", "Author": "[ Bill Ruthhart, John Byrne]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-forrest-claypool-cps-met-0717-20150717-story.html", "Title": "[ Emanuel again looks to Claypool amid troubles at CPS]"}