{"Content": "[  Taking action on dozens of bills, Gov. Bruce Rauner signed measures into law that would allow nursing home residents to put cameras in their rooms to protect against abuse and require high school students to take a civics class in order to graduate. The Republican governor also made liberal use of his veto pen, rejecting proposals that would extend key services to wards of the state until they were 21 instead of 18, and require doctors to provide hepatitis C screenings for people born from  1945 to  1965. Rauner also sought to rewrite a bill that would have put in place tougher consumer protections in the case of data breaches, saying the measure went too far and would place \"burdensome requirements\" on businesses. The Rauner administration announced the bill signings and vetoes late on a Friday afternoon, a time politicians traditionally dump unflattering news in the hope it will get less attention over the weekend as the publics focus shifts from the workweek to weekend plans. Among the bills Rauner dealt with:, Signed a bill backed by Democratic Attorney General Lisa Madigan that would allow nursing home residents to put cameras in their rooms if they pay for them. The effort comes as the Illinois Department of Public Health receives roughly 19,000 calls a year alleging neglect or abuse in nursing homes, and the bill specifies that the footage could be used in court. Nursing homes will be required to post a sign at main entrances warning that rooms could be electronically monitored. Everyone living in a room would need to consent to a camera being installed. If one resident of a shared room wants a camera and the other doesnt, the resident who wants the camera would be moved to another room. Legal guardians and family members would be able to give consent for residents whose mental condition prevents them from giving it themselves. A physician would need to determine whether the resident is capable of consenting. Approved a bill that would require high school students to take at least one semester of civics in order to graduate. The law goes into effect Jan. 1, but its expected that schools would not incorporate the requirement until the 2016-17 school year begins next fall.  Signed a bill that would create a test program in Cook County setting up a special court system to deal with offenders charged with low-level crimes like shoplifting and trespassing. The effort is aimed at easing jail overcrowding while shifting nonviolent criminals into treatment programs to keep them out of the criminal justice system. Used his veto pen to reject an attempt by lawmakers to protect funding for foster care services for adult wards of the state, something Rauner had sought to cut in his budget proposal. Illinois Democrats on Thursday pledged to stay united against Republican Gov. Bruce Rauners union-weakening agenda, but divided in their support of a challenger to take on GOP U.S. Sen. Mark Kirk next year. Several speakers, including recipients of state subsidized social services, took to the... Illinois Democrats on Thursday pledged to stay united against Republican Gov. Bruce Rauners union-weakening agenda, but divided in their support of a challenger to take on GOP U.S. Sen. Mark Kirk next year. Several speakers, including recipients of state subsidized social services, took to the... The Department of Children and Family Services provides extended services to wards ages 18 to  21, including job placement, help finding living arrangements and scholarship funding. In his February budget proposal, Rauner said he wanted to eliminate funding for those services. Lawmakers responded by sending him a bill that would require that foster care cases remain open until wards reach the age of 21, instead of 18. \"Age is often very much an arbitrary thing, especially when youre dealing with children who have been exposed to trauma, abused or neglected,\" said sponsoring Rep. Sara Feigenholtz, D-Chicago. Rauners proposed cuts \"just absolutely went through the child welfare community like a lightning rod. We collectively made a decision that it was worth fighting to help these kids.\", Rauner vetoed the bill, saying it was an \"unfunded mandate\" that \"places a significant financial burden on the department, particularly because the department would not be eligible for matching federal funds for all these services.\", Feigenholtz said she hoped the General Assembly would try to override the veto. \"We made a decision to make them wards of the state. That means were their parents,\" Feigenholtz said of the DCFS wards. \"I think a lot of us felt very strongly about doing what this bill did, and well figure out what were going to do.\", Rauner also cited concerns over the cost to the state in his veto of a measure that would require doctors to provide hepatitis C screenings to baby boomers, who make up the bulk of those diagnosed with the liver disease. Rauner said the states Medicaid system for the poor could not take on the \"significant short-term financial obligations\" required under the bill, and argued the measure amounted to \"government-mandated medical care\" that could expose doctors to lawsuits. The proposal was opposed by the Illinois State Medical Society, which donated more than $250,000 to Rauners campaign last year. Made adjustments to a bill that would update the states requirements of companies to notify consumers when a data breach has occurred. Currently, companies dont have to disclose if theyve had a data breach where hackers have stolen certain types of information, such as user names and passwords. The bill that was sent to Rauner would have required such breaches to be disclosed, and would have also required companies to inform the state attorney general if hackers made off with marketing or geolocation data. The Illinois Chamber of Commerce objected to the marketing and geolocation provisions, saying they were an overreach that would burden businesses without protecting consumers. Rauner sent the bill back to the General Assembly with recommendations to remove those requirements. \"If someone has access to your bank accounts, thats a clear danger,\" said Todd Maisch, the chambers president and CEO. \"If a thief gains access to your preference of Oreos over Chips Ahoy, its hard to see that theres really any risk to the consumer.\", mcgarcia@tribpub.com, kgeiger@tribpub.com]", "Date": "20150821", "Author": "[ Monique Garcia, Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-bruce-rauner-signs-vetoes-legislation-met-0823-20150821-story.html", "Title": "[ Rauner signs bill allowing nursing home residents to install cameras]"}