{"Content": "[ \"How many must die in Illinois?\", Thats the frightening headline on a large, glossy mailer sent to peoples homes throughout the state by a political action committee representing road builders. In a twist on the old \"sky is falling\" cry of Chicken Little, the mailer warns that 2,311 bridges in Illinois \"are already considered structurally unsafe\" and then adds, \"did your family cross one today?\", The mailings target state legislators who recently voted in favor of a $400 million road fund sweep to help plug a roughly $1.6 billion hole in the states current budget. \"Illinois Families Are at Risk Every Day,\" the mailer I saw reads. \"Yet, Rep. Robert Rita Hijacked Our Road Funds.\", State Sen. Michael Hastings, D-Orland Hills, said hes received reports that residents throughout his district have received the same literature in the mail, only his name is on it instead of Ritas. \"I shake my head sometimes,\" said an obviously frustrated and agitated Hastings. \"Some people refuse to open their ears. They dont understand whats going on in this state. Republican Gov. Bruce Rauner on Wednesday dubbed his first spending plan a turnaround budget for a financially shaky state, but Democrats rebuffed his proposed cuts to health care for the poor, government worker pensions, state universities, mass transit and cities across Illinois. This is our... Republican Gov. Bruce Rauner on Wednesday dubbed his first spending plan a turnaround budget for a financially shaky state, but Democrats rebuffed his proposed cuts to health care for the poor, government worker pensions, state universities, mass transit and cities across Illinois. This is our... \"We have a $1.6 billion budget deficit in fiscal year 2015 (which ends June 30). Last year I voted no on a lot of fund sweeps. But this year we have a real problem, a worse problem, because the temporary state income tax expired. \"In the 19th Senate District alone (Hastings district) I have 100 child care facilities,\" he said, referring to potential cuts in those programs, \"and I have Stateville Penitentiary employees living in my district. Im trying to protect their jobs and the social service programs people need. \"Do you know how much money the road fund had in it? More than $1 billion. So, yes, we swept money from that fund and other funds to plug the holes in the budget. Do you know how much money the road fund will have in it next fiscal year, starting in July? More than $1 billion. \"I would rather sweep money from the road fund than take half the income tax money the state shares with local governments, which was in the governors budget proposal. If we cut the money going to higher education, Governors State University will lose 31 percent of its funding and the president of the university says she will have to turn off the lights. Gov. Bruce Rauner and legislative leaders appear on track to resolve an immediate $1.6 billion deficit and avoid running out of money for prison guards and day care programs, though theres no guarantee the rare show of bipartisan cooperation will hold up when the stakes get higher over a new budget... Gov. Bruce Rauner and legislative leaders appear on track to resolve an immediate $1.6 billion deficit and avoid running out of money for prison guards and day care programs, though theres no guarantee the rare show of bipartisan cooperation will hold up when the stakes get higher over a new budget... \"Those are the kinds of choices were faced with, and things are only going to get worse in fiscal year 2016.\", I dont recall ever seeing a political mailer in a non-election year for the legislature like the one paid for by Better Roads Ahead  the political action committee representing the road builders and the unions that represent the companies workers. \"This is what life is going to be like for us from now on,\" Hastings predicted, noting that both the state Democratic and Republican organizations have well-funded political action committees, as do a number of other organizations in the state prepared to go to war to protect their interests as Gov. Bruce Rauner and the Democratic-controlled legislature start slashing away at the budget. \"No matter how I vote, yes or no, on an issue, I expect someone to be sending out a mailing to people attacking me,\" Hastings said. \"I was in the military (he is a West Point graduate). Im used to people taking shots at me. Im used to people criticizing my actions. But someone has to make the difficult choices ,and thats what I will keep doing. You just hope the voters will educate themselves and understand what the problems are when the next election rolls around.\", Ed Maher, a spokesman for Local 150 of the International Union of Operating Engineers, one member of the coalition behind the BetterRoadsAhead.orgPAC, said the mailing was distributed in every legislative district where a Senate or House member voted \"yes\" on the road fund sweep. The mailer tells readers that \"You may remember the 2007 bridge collapse in Minneapolis: 13 dead and 145 injured. What you may not know is how easily it could happen in Illinois, thanks to Governor Rauner and state legislators who have put our families at risk by performing the biggest road funding sweep in Illinois history. Nearly $400 million meant for our roads and bridges will now be used for other purposes. \"For years, Illinois legislators have used your gas tax dollars  intended to keep roads and bridges safe  to pay for pet projects and plug budget holes.\", The mailer then urges residents to call their state legislator, providing the phone numbers in Springfield. Rita said hes worked to get funding for a long-closed Blue Island bridge, where work will start in July, and to obtain money for the Interstate 57/I-294 interchange that opened last year. \"Yes, we swept (road) funds to get money for vital state programs that were going to be cut, but just look at my record on transportation issues,\" Rita said. \"I think it (the mailing) is just ridiculous.\", A spokesman for the Illinois Department of Transportation said \"safety is always going to be the top priority at the Illinois Department of Transportation. As we work closely with the governors team to maximize the states investment in infrastructure and turn around the Illinois economy, that priority will not change.\", Hastings said he has received 37 phone calls about the mailer, although it just started arriving at homes this week. Both Hastings and Rita said some of the phone calls they received seemed to have been \"patched\" through from a central location because when their office staff answered, the callers didnt know who they were calling. Theres certainly some truth to the mailing. Illinois has a lot of infrastructure needs, including road and bridge repairs. But this state, you may recall, also failed to make payments into its pension funds for decades (using some of that money to build roads and bridges). Illinois has also underfunded public education, programs to help the mentally ill and social services for the developmentally disabled. No one has ever been able to tell me where all that money went, although people I respect contend that the state has been short of needed revenue for years and should have raised the income tax and adopted more taxes on professional services long ago. Most Illinois residents dont want to hear that and supported Rauners campaign for governor because he promised to cut spending, reduce taxes and create a more business-friendly environment in Illinois. No matter what you think of that, serious cuts are going to get made, and its unlikely that any agency, group, union or special interest is going to be spared. Several weeks ago, I told readers this was going to happen. I asked them if they really wanted to cut funding from programs that helped victims of domestic abuse, people who had bipolar disorder, children suffering from autism or their local public schools. I dont recall anyone giving a specific answer, although several readers simply said the state was corrupt, the Democrats had wasted too much tax money over the years and there had to be fat somewhere in the state budget. Well, maybe that fat is in the road fund, maybe not. We will cross that bridge when we come to it, quite literally. But when people get a mailing with a giant photograph of a bridge collapse on the front of it, many are going to call their legislators and tell them thats not the kind of state government they want. I doubt that many are going to call and say, \"Way to go! Dont waste money on those bridges in need of repair.\", Politically motivated mailings are actually going to be just a small part of the blowback from these budget cuts. Every legislator out there knows some family personally that relies on state services to stay afloat. They know some public employee or construction worker who may lose a job due to the budget cutbacks. They are going to hear from parents who want to make sure that their childrens classrooms remain funded and who oppose cutting teachers or increasing class sizes. Handing money out is easy and rewarding. Cutting programs and jobs is hard and produces nothing but grief. But thats the reality in Illinois. Voters, having made that choice, now owe it to the governor and legislators to understand what cuts they are making and why. And when you get propaganda literature in the mail, recognize it for what it is. pkadner@tribpub.com]", "Date": "20150421", "Author": "[ Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/opinion/ct-sta-kadner-mailers-st-0422-20150421-column.html", "Title": "[ PAC targets lawmakers for road fund sweep]"}