{"Content": "[ With so many candidates on stage at the Republican primary presidential debate, it was difficult to take accurate notes, but here are my recollections of the event. Q: Do any of you talk to God?, U.S. Senator: I read his book and saw the movie. Governor: Are you referring to Ronald Reagan? I spoke to him. Neurosurgeon: I am the only one here who has ever opened up the head of a human being. Q: Mr. Trump, you have given campaign contributions to almost every elected official in the nation and say the money is given in exchange for favors. Can you give us an example of an elected official who did something for you in exchange for money?, Trump: Hillary Clinton. I said, \"Be at my wedding,\" and she came to my wedding. She had no choice because I gave to her foundation. There is no cure for the Touch of Death, or Dim Mak as its known in those cheesy martial arts movies. Legend and comic books tell us that it is a precise and forceful strike, with delayed yet fatal result, sometimes taking days or weeks to do its work. It is subtle, quick, almost unseen, and usually... There is no cure for the Touch of Death, or Dim Mak as its known in those cheesy martial arts movies. Legend and comic books tell us that it is a precise and forceful strike, with delayed yet fatal result, sometimes taking days or weeks to do its work. It is subtle, quick, almost unseen, and usually... Q: Could any of you explain whats wrong with this country?, Former Governor: Hillary Clinton. Shes a terrible, horrible person who would come to Donald Trumps wedding to get a campaign contribution. (Cheers from the crowd), Another Former Governor: Barack Obama is whats wrong with America!, (Louder cheers), U.S. Senator: Liberals and Democrats are going to give Iran nuclear weapons and they are going to kill us all. I dont want us to die. (Applause), Q: Mr. Trump, youve called women fat pigs, dogs, disgusting animals ... Trump: Only Rosie ODonnell. Q: Social Security is in big trouble; what would you do to save it?, Governor: We have made a promise to people that they have an income in their old age. We need to honor that commitment. All we have to do is delay the age of retirement to, say, 90, and Social Security will be fine. The leading Republican presidential candidates used their first face-to-face encounter Thursday night to accuse Donald Trump  and one another  of diverging from conservative principles as they tried to reverse the surprising dominance of the billionaire celebrity and gain a foothold in the crowded... The leading Republican presidential candidates used their first face-to-face encounter Thursday night to accuse Donald Trump  and one another  of diverging from conservative principles as they tried to reverse the surprising dominance of the billionaire celebrity and gain a foothold in the crowded... Different Governor: Old people are saving too much money and if they are making, say $150,000 a year off their investments, no Social Security for them. Its all the old people making $150,000 a year in retirement that are draining the lifes blood out of Social Security. Former Governor: Tax pimps, prostitutes and drug dealers and you will have plenty of money for Social Security. Neurosurgeon: I am the only one here who has operated on old people. Q: How would you improve public education in this country?, Former Governor: I would get rid of the teachers unions. Current Governor: I got rid of the teachers unions, so you know I will keep my word. Another Governor: I would get rid of the U.S. Department of Education. Q: Russia has hacked into the Pentagon computer system. The Chinese stole information about federal employees from the U.S. Office of Personnel Management computers. What would you do to stop that sort of cyber spying?, U.S. Senator: Spend more money on our Navy, give the U.S. Air Force new bombers and train more Marines to hit the beaches. Former Governor: Blame Barack Obama. Current Governor: The Chinese now have more of Hillary Clintons emails as secretary of state than the American people. (Loud laughter), Q: One of the more pressing questions facing this nation, as everyone who has followed the Bruce Jenner story understands, is whether the federal government should pay for transgender surgical procedures for members of the armed forces. What is your position on that issue?, Sitting governor: The role of our military is to kill people. I mean, destroy them. Blow them to kingdom come. I wouldnt waste a dime of taxpayer money on a transgender operation unless it made a soldier a more efficient killing machine. Q: While were on the subject of killing, what do you think of Planned Parenthood, governor?, Governor: I wouldnt fund them. I am pro life. Every life is precious, unless it is the life of someone we hate. Then you blow them to kingdom come and I would do that because I am not a pansy like Barack Obama. U.S. Senator: With all due respect to my colleague, I have already proposed legislation to end funding for Planned Parenthood. I believe people will look back on our culture years from now and consider us barbarians when they see all the lives we have taken. And when it comes to foreign affairs, I would kill anyone who tried to steal my photos off of Facebook. Yet Another Governor: I am made of steel. When the Russians come up against me, they will see a giant \"S\" on my chest. They wont mess with me cause Im not mush, like Barack Obama. Q: Is there anyone here who thinks the other candidates are so scary you couldnt possibly vote for one of them if they were the nominee for president?, (Donald Trump raises his hand and people boo), Trump: Let me explain. I want leverage. Q: Hillary Clinton is going to go after the Republican presidential nominee by saying they cant relate to the poor and dont care about minorities. How would you respond if you were her opponent?, U.S. Senator: How is Hillary Clinton going to lecture me about being poor? My family was so poor that when I taught my dog to beg he came back with $2.70. We were so poor that when Christmas came my father went outside, fired a shotgun and announced, \"No presents this year. Santa just committed suicide.\", Former Governor: My grandmother used to tell me that everyone in her family was poor. Their maid was poor, their cook was poor, their butler was poor. They were all poor. Governor: My father worked for the post office. Q: Mr. Trump, you have said your business experience qualifies you to be president. But you filed for bankruptcy four times. Trump: I haver never gone bankrupt. I own hundreds of businesses and have done hundreds of deals, and four times, four times (he holds up four fingers) I filed for bankruptcy. I have used the laws of this country  just like the greatest people you read about every day in business have used the laws of this country, to do a great job for my company, for myself. ... I built a net worth of $10 billion. By the way, if Iran was a stock, I would go out and buy it. That may sound strange, but a lot of big companies and investors are eyeing Iran. Its value is going to quadruple. If elected president, I would borrow money from China and invest it in Iran. Thats how you make money. Q.: Is there anyone on the stage with half a brain?, Neurosurgeon: I took half a brain out of a patients skull once. I dont have it on me. That wouldnt be ethical. But I am only the candidate running for president in 2016 who can claim I was once in possession of half a brain. Q: How would you alter our nations tax system?, Neurosurgeon: Tithing is how we do it in church. His answer was so long and convoluted I couldnt follow it, but it sounded like he was grasping in vain for the old joke about a Catholic priest, the Methodist minister and the Jewish rabbi. They were discussing how they divide the take each Sabbath and the priest said, \"What I do is draw a line down the center of the room and then throw the money up in the air. Whatever lands on the left side is Gods, and whatever lands on the right side is mine.\" The preacher said, \"Well, I do almost the same thing, only I draw a circle in the middle of the room and what lands in the circle is mine and the rest belongs to God.\" The rabbi says, \"No, you both got it wrong. I take the money and throw it up in the air. Then I yell, \"God, take what you want!\" Whatever comes back down is mine. Sounded like a reasonable federal tax plan to me. There were so many candidates in the debate and they had so little time to respond to questions that its probably unfair to come to any conclusion about them. But I did decide you really dont have to be a brain surgeon to be president. pkadner@tribpub.com]", "Date": "20150807", "Author": "[ Phil Kadner]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/news/ct-sta-kadner-gop-debate-st-0809-20150807-story.html", "Title": "[ Kadner: At least one GOP candidate had half a brain]"}