{"Content": "[ WikiLeakspublished documents late Tuesday that it says show the U.S. National Security Agency eavesdropped on the last three French presidents, releasing material which appeared to capture officials in Paris talking candidly about Greeces economy, relations with Germany  and, ironically, American espionage. There was no instant confirmation of the accuracy of the documents released in collaboration with French daily newspaper Liberation and investigative website Mediapart, butWikiLeakshas a track record of publishing intelligence and diplomatic material and the release appeared serious enough to prompt an emergency meeting of President Francois Hollandes defense council, according to a presidential aide. The council, meeting Wednesday morning, includes Frances top security officials. WikiLeaksspokesman Kristinn Hrafnsson told The Associated Press he was confident the documents were authentic, noting thatWikiLeaks previous mass disclosures  including a large cache of Saudi diplomatic memos released last week  have proven to be accurate. The timing of the release was not accidental: It came a day before the French Parliament is expected to definitively pass a controversial security bill legalizing broad surveillance, particularly of terrorism suspects. Hollandes office did not comment on the reports other than to announce the security meeting. An aide to Hollandes predecessor Nicolas Sarkozy told the AP that the former president considers these methods unacceptable, generally speaking and especially from an ally. The aide was not authorized to be publicly named. There was no comment Tuesday from former President Jacques Chirac, also reportedly targeted by the eavesdropping. U.S. National Security Council spokesman Ned Price said in a statement that the American government would not comment on the specifics of the leak. President Barack Obama has signed legislation reviving and reshaping surveillance laws that expired temporarily Sunday night. The White House says Obama signed the bill late Tuesday evening, hours after the Senate gave its final approval. Obama says in a statement that hes gratified Congress finally... President Barack Obama has signed legislation reviving and reshaping surveillance laws that expired temporarily Sunday night. The White House says Obama signed the bill late Tuesday evening, hours after the Senate gave its final approval. Obama says in a statement that hes gratified Congress finally... \"As a general matter, we do not conduct any foreign intelligence surveillance activities unless there is a specific and validated national security purpose. This applies to ordinary citizens and world leaders alike,\" he said. Ever since documents leaked by former NSA contractor Edward Snowden showed in 2013 that the NSA had been eavesdropping on the cellphone of Angela Merkel, it had been understood that the U.S. had been using the digital spying agency to intercept the conversations of allied politicians. The new revelations are bound to cause diplomatic embarrassment for the Americans, even though friends have been spying on friends for thousands of years. Late on Tuesday, several French politicians posted messages to social media voicing their disgust with the reports. \"And one more time we find out that the U.S. has no allies, they only have targets or vassals,\" Socialist lawmaker Jean-Jacques Urvoas said in messages posted on Twitter in both French and English. The House voted by a wide margin Wednesday to end the National Security Agencys bulk collection of Americans phone records and replace it with a system to search the data held by telephone companies on a case-by-case basis. The 338-to-88 vote set the stage for a Senate showdown just weeks before... The House voted by a wide margin Wednesday to end the National Security Agencys bulk collection of Americans phone records and replace it with a system to search the data held by telephone companies on a case-by-case basis. The 338-to-88 vote set the stage for a Senate showdown just weeks before... Hollande said last year that he discussed his concerns about NSA surveillance with President Barack Obama during a visit to the U.S. and they patched up their differences. After the Merkel disclosures, Obama ordered a wholesale review of NSA spying on allies, after officials suggested that senior White House officials had not approved many operations that were largely on auto-pilot. After the review, American officials said Obama had ordered a halt to spying on the leaders of allied countries, if not their aides. WikiLeaks, on its website, listed the contents of what it said were five selected \"top\" intercepts of communications involving French presidents  on subjects including a top U.N. appointment, the Middle East peace process, and the handling of the euro crisis  between 2006 and 2012. The site also listed in a chart what were said to be phone numbers listed by NSA as top French official \"intercept targets,\" including that of the French presidents own cellphone, with some digits crossed out. Hrafnsson refused to comment on howWikiLeakshad obtained the documents and declined to go into specifics about what else might be appearing in the French press, but said that \"they can expect more revelations in the near future.\", Privacy advocates and human rights groups have protested the new French surveillance bill, which allows intelligence services to vacuum up metadata in hopes of preventing imminent attacks. But the government argues that it is just updating a 1991 law to grapple with modern threats and has tried to distance itself from U.S.-style mass surveillance. The bill was proposed last year but deadly Paris attacks by Islamic extremists in January gave it added urgency for the government. Associated Press]", "Date": "20150623", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-wikileaks-nsa-france-20150623-story.html", "Title": "[ WikiLeaks: NSA eavesdropped on last 3 French presidents ]"}