{"Content": "[ State housing officials say dozens of affluent suburbs have missed a recent deadline to create plans for increasing the supply of affordable housing within their borders. Under a 2004 Illinois law, 68 municipalities identified as having too little affordable housing were required to file plans with the Illinois Housing Development Authority by June 2, according to spokeswoman Man Yee Lee. She said the state granted 60-day extensions to a small number of municipal bodies that asked for additional time. Forty of the towns required to submit plans have not done so, according to the IHDA, the agency that administers the states Affordable Housing Planning and Appeals Act. The law targets towns in which less than 10 percent of the housing stock is considered to be affordable under state guidelines. Lee acknowledged that the agency has no authority to enforce the mandate if municipalities do not submit affordable housing plans. \"We do feel that our hands are very much tied,\" Lee said. \"We are not a regulatory body. We dont have a stick.\", Suburbs that have not filed plans for meeting the states affordable housing goals include some of the most prestigious zip codes in the Chicago area, such as Winnetka, Lake Forest, Deerfield, River Forest, Northbrook and Hinsdale. Wilmette also was listed by the state as a town that did not submit a plan. \"The village is not under any obligation to submit a plan,\" said Wilmette Village Manager Timothy Frenzer, citing the suburbs home rule status  a common response among municipalities in the same position. Fifty years after Martin Luther King Jr. spoke out about segregation in the area, residents of Deerfield are perfectly content to close their doors, again, to affordable housing that might allow those not so lucky to be born with a 60015 ZIP code and a silver spoon to enjoy the opportunities of... Fifty years after Martin Luther King Jr. spoke out about segregation in the area, residents of Deerfield are perfectly content to close their doors, again, to affordable housing that might allow those not so lucky to be born with a 60015 ZIP code and a silver spoon to enjoy the opportunities of... Frenzer said that \"as a courtesy\", Wilmette resubmitted the plan it originally filed with the state in 2005, along with a new letter from the villages attorney, on June 4. \"Even if you believe the village is covered by the state act, the law says you should file a plan when you are first identified\" as having less than 10 percent affordable housing, Frenzer said. \"It doesnt say you have to go through the work of submitting plan after plan after plan, if your status has not changed.\", Officials from River Forest and Northbrook did not return calls seeking comment. Like Wilmette, Deerfield maintains that it is exempt because of its home-rule status. Village officials say they are basing their position on a legal opinion obtained by the Metropolitan Mayors Caucus at the time the law was enacted. \"We do monitor workforce housing on our own and value all types of housing,\" said Deerfield Mayor Harriet Rosenthal. The state says 4 percent of Deerfields housing qualifies as affordable. The availability and price of Naperville neighborhoods suited to an aging population ranks as a top concern of the citys senior task force. The task force, set up a year ago to study ways to make Naperville more senior-friendly, has covered a lot of ground  and its just getting started. Co-chairwomen... The availability and price of Naperville neighborhoods suited to an aging population ranks as a top concern of the citys senior task force. The task force, set up a year ago to study ways to make Naperville more senior-friendly, has covered a lot of ground  and its just getting started. Co-chairwomen... Hinsdale Village President Thomas Cauley Jr. said his suburb is in the process of updating its 2005 affordable housing plan, but a high degree of turnover in the village managers office prevented Hinsdale from meeting the deadline. The number of suburbs choosing to ignore the mandate is up dramatically from a decade ago, when all but 10 of the 49 towns required to file plans complied with the law, according to state figures. Some suburbs that filed plans that year stressed that they were doing so voluntarily and cited a legal opinion from the law firm of Holland and Knight. \"I think the main reason towns responded the first time around 10 years ago is that they did not realize the law did not really have too many teeth,\" said Gail Schechter, executive director of Open Communities, which advocates for affordable and fair housing in 16 northern suburbs. \"If you didnt file a plan, there really were not any consequences,\" she said. \"They figured that out.\", Frankfort Mayor Jim Holland said there was no question his village would comply with the law. \"We submitted a plan because that is what the state law calls for,\" said Holland, whose town of 18,000 in Will County does not have home-rule authority. The state puts Frankforts affordable housing at 2 percent. The Village of Barrington also was among the 28 municipalities to file an affordable housing plan with the state. After meeting the states threshold a decade ago, the villages total of affordable housing dipped to 8 percent. Village Manager Jeff Lawler attributes the change in part to a drop in income levels, which meant housing needed to be cheaper to qualify as \"affordable.\", In the case of rental housing, the state considers an apartment \"affordable\" if a household earning 60 percent or less of the areas median income, $61,045, can live there without spending more than 30 percent of income on housing. The income figure is based on census data for the Chicago metropolitan area. The agency found that a monthly rent of $916 or less would be affordable to a family earning 60 percent of the median income. Owner-occupied homes and condominiums are considered \"affordable\" if monthly mortgage payments, including property taxes, consume no more than 30 percent of income for a family earning 80 percent or less of the median income. That came out to be $1,221 a month in the most recent analysis, state data showed. Ricca Slone, a former Peoria legislator who co-sponsored the Affordable Housing Planning and Appeals Act, recalled the circumstances that spawned the legislation. \"This was before the housing bubble and the housing crash,\" Slone said in April. \"In the early 2000s, there really were affordability issues for public service people  police, firefighters and teachers who were working in many of these communities and couldnt afford to live there.\", Schechter said the law was weakened to the point of becoming a planning statute along the lines of, \"It would be nice if you considered having housing that met the needs of your workforce and people with disabilities and people with fixed incomes and seniors.\", Lee, the IHDA spokesperson, expressed hope that the Illinois legislature would revisit the 2004 law to make it a more effective mechanism for creating affordable housing. kberkowitz@pioneerlocal.com, Twitter: @KarenABerkowitz]", "Date": "20150807", "Author": "[ Karen Berkowitz]", "Link": "http://www.chicagotribune.com/suburbs/highland-park/news/ct-hpn-suburbs-affordable-housing-mandate-tl-0813-20150807-story.html", "Title": "[ Many towns snub state's affordable housing mandate]"}