{"Content": "[ Chicago Public Schools on Monday unveiled school spending plans that rely on a half-billion dollars more than the district has on hand  an approach the head of the citys principals association compared to writing a bad check. To make the individual school budgets work, CPS is banking on help from Springfield, which has so far been uncooperative. Without that, the district said it will have to resort to \"unsustainable borrowing and additional cuts\" midway through the coming school year. Theyre not the budgets that we would like to be presenting, the districts interim CEO Jesse Ruizsaid in a conference call with reporters. But they reflect the reality of where we are today: facing a budget deficit of more than $1 billion, the increasing costs of a broken pension system, and a state government that slashed education funding. The preliminary budgets distributed to school principals for the coming school year assume state lawmakers will free CPS from having to make $500 million of a $700 million pension payment due June 30, 2016, either by giving the district more money or by allowing CPS to delay the payment until 2017 or later. CPS had tried to persuade the Chicago Teachers Pension Fund to agree to an extension until 2017. The pension fund rejected the idea Friday. The decision to push ahead with a spending plan that assumes that half-billion dollars will be available makes the preliminary budgets distributed Monday of limited use to principals, said Clarice Berry, the president of the Chicago Principals and Administrators Association. \"They have issued budgets that have no money to back them,\" Berry said. \"They are giving the principals a check that is going to bounce right now.\", Interim Chicago Public Schools CEO Jesse Ruiz, left, speaks as he and Board of EducationPresident David Vitale attenda board meeting April 22, 2015, in Chicago. Interim Chicago Public Schools CEO Jesse Ruiz, left, speaks as he and Board of EducationPresident David Vitale attenda board meeting April 22, 2015, in Chicago. Berry warned that the disconnect between the budgets and the districts financial reality could lead to massive school disruptions, including layoffs and program closures. She also noted that the spending plan does not factor in the potential cost of a new teacher contract with the Chicago Teachers Union for the coming school year. Negotiations with the CTU are ongoing. Individual school budgets are issued in advance of the passage of a districtwide budget, which the school board must approve by the end of August. Last years operating budget totaled about $5.8 billion. Even if Springfield does provide the $500 million the district is banking on, many schools will still see cuts under the budgets issued Monday. While the preliminary budgets do not reduce per-pupil spending levels, CPS will not continue its past practice of maintaining funding levels to schools whose enrollment drops. Schools that have experienced enrollment declines will receive about $100 million less than last year. A majority of those cuts will affect district-run community schools, which have seen greater enrollment declines than privately run charters. At least 65 schools will have $200,000 cut from their budgets, Chief Financial Officer Ginger Ostro said. The district has already said it will cut $200 million by eliminating 1,400 positions, ending coaching stipends for elementary school sports teams and consolidating bus stops for students transported to magnet schools. Despite the cuts, city and school officials say school will start on time and class sizes will not increase this fall. So far, CPS attempts to get help from Springfield have failed. The state legislature rejected Mayor Rahm Emanuels push this summer to allow CPS to delay making its 2015 pension payment until August. Ruiz declined to offer details about what would happen if state lawmakers do not grant the school district pension relief. \"Were going to continue to work with Springfield, banging that drum,\" Ruiz said in response to questions from reporters. \"Otherwise, would we be facing additional alternatives and options and additional borrowing and cuts? We may.\", Rodney Estvan, education policy analyst for the disability advocacy group Access Living, said he had already fielded calls from several principals asking about how they could set aside money in case of more cuts later this year. Interviewed while waiting to receive his budget Monday afternoon, Principal Troy LaRaviere of Blaine Elementary School in Lakeview, a frequent critic of Emanuels education policies, said his school has already dealt with significant cuts. He worries that further cuts at Blaine  where students test well-above the state average in reading and math  would erode the core services that help students thrive. \"We have a classroom, for example, of first graders and there are 24 or 25 students per class,\" LaRaviere said. \"If we lose a position were going to have to make those four classrooms three classrooms.\", Blaines budget was cut by about $140,000. LaRaviere criticized school and city leaders for leaving schools at the mercy of the state. \"Inaction in Springfield is no excuse for inaction in Chicago,\" he said. Emanuel, meanwhile, continued to blame the school funding predicament on the state, calling the cuts CPS principals would face in their budgets without help from Springfield \"unconscionable.\" He again called on state lawmakers and Gov. Bruce Rauner to change the way the districts teacher pension system is funded. \"In major part, in my view, (the cuts are) because Springfield is unreasonable,\" Emanuel said Monday after an unrelated event on the West Side. \"You are asking the system to continue an inequity.\", CPS recent budget-busting pension payments follow years in which the district paid less than its required annual contribution into the pension fund, including an entire decade when then-Mayor Richard M. Daley made no payments at all. CTU Vice President Jesse Sharkey criticized the school spending plans released Monday as something \"based on fantasy.\", \"This is going to have an actual harmful effect on the quality of our schools overall in the city,\" Sharkey said. Emanuel aides confirmed Monday that the mayor is taking one step to ever-so-slightly ease CPS financial woes. The mayor has decided to limit spending in seven controversial downtown special taxing districts to projects that already have been approved or are \"in the final stages of approval,\" aides said. The move will free up at least $250 million over five years, they said. More than half of the money would go to CPS and about 20 percent to the city, with the rest being distributed to other local governmental entities. CPS own ability to raise revenues is limited by statutorily imposed tax caps. The district said Monday that, as in most recent years, it will raise taxes by the maximum amount allowed. That increase, which will net CPS an additional $61 million, equates to about $57 for a $250,000 home, according to a calculation by the Cook County clerks office based on 2014 information. The Chicago Tribunes John Byrne, Hal Dardick, Kim Geiger and Abraham Epton contributed. hgillers@tribpub.com, cdizikes@tribpub.com]", "Date": "20150713", "Author": "[ Heather Gillers, Cynthia Dizikes]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-public-schools-budgets-20150713-story.html", "Title": "[ Chicago Public Schools' budgets spend $500 million district doesn't have]"}