{"Content": "[ Freshman Texas Sen. Ted Cruz is running for president, hoping to gain the Republican nomination by bringing together conservatives, libertarians and evangelicals. On foreign policy, thats a tough balance to strike. Yet Cruz has crafted his own brand of hawkishness tailored to please even his tea party supporters. In a long interview at the Halifax International Security Conference late last year, Cruz walked me through his strategy for staking out a position that falls somewhere between the isolationism of Sen. Rand Paul and the neoconservatism of Sen. John McCain. When asked which foreign policy experts he trusts, he named three: John Bolton, ambassador to the United Nations under President George W. Bush; Elliott Abrams, who served in top foreign policy posts under Bush and President Ronald Reagan; and former CIA Director James Woolsey, a hawkish Democrat. He framed his worldview as one that spares no effort in defending American national security but limits adventurism abroad. \"The central touchstone for U.S. foreign policy should be defending the vital national security interests of the United States,\" he said. He called weakness on that obligation \"the most central failing\" of the foreign policies of President Barack Obama and Hillary Clinton. In his brief Senate career, Cruz has sometimes sided with libertarians such as Paul on big national security issues, as when he opposed Obamas request for authorization to attack Syria after Bashar al-Assads alleged use of chemical weapons (Obama later withdrew that request). But Cruz has also sided with the hawks in opposing Obamas nuclear negotiations with Iran and pushing for more sanctions on the Tehran regime. \"I believe both of those positions are consistent because both are driven by national security interests,\" Cruz told me. \"There are a range of views within the Republican Party, but there is an overwhelming consensus that the Obama-Clinton foreign policy is a manifest disaster, that leading from behind does not work.\", Cruz reconciles his advocacy for American power with his aversion to using military force by trumpeting democracy promotion and human-rights advocacy. In the Senate, he has taken up the causes of individual human rights activists such as Mariem Ibrahim, the Sudanese Christian woman who was sentenced to death for her faith and later released. If you like straight marriage, God (the Christian kind, not one of those off-brand deities) and the good old days (circa the Revolutionary War), then Ive got the presidential candidate for you. His name is Rafael Edward \"Ted\" Cruz, a Republican senator from the great state of Texas, who on Monday... If you like straight marriage, God (the Christian kind, not one of those off-brand deities) and the good old days (circa the Revolutionary War), then Ive got the presidential candidate for you. His name is Rafael Edward \"Ted\" Cruz, a Republican senator from the great state of Texas, who on Monday... \"It is inexplicable and indefensible that this president will almost never speak out for dissidents,\" Cruz said. \"I dont believe that shining light and speaking truth is soft power, its often far more effective than dropping bombs.\", Cruz wants the U.S. to publicly confront the Iranian regime for its treatment of its own citizens, and as president he would lend support to human rights and democracy movements around the world, although not through the use of the U.S. armed forces. As for the conflicts in the Middle East, Cruz said he doesnt necessarily want the U.S. to take a side. Like many Republicans (and apparently David Petraeus), he sees Iran as the major threat to U.S. security. \"As serious a threat as ISIS presents, the threat from Iran is qualitatively greater. And the Obama administration has it backwards, they are trying to use ISIS to weaken our stance against Iran,\" he said. \"The growing potency of ISIS should be used to put even greater pressure on Iran.\", U.S. Sens. Mark Kirk and John McCain, in Chicago on Sunday for an event at the Ukrainian Cultural Center, reacted diplomatically to news reports that their Republican Senate colleague Ted Cruz was expected to announce a presidential bid. Cruz is expected to announce Monday, according to published... U.S. Sens. Mark Kirk and John McCain, in Chicago on Sunday for an event at the Ukrainian Cultural Center, reacted diplomatically to news reports that their Republican Senate colleague Ted Cruz was expected to announce a presidential bid. Cruz is expected to announce Monday, according to published... Cruz doesnt think the U.S. should risk lives sorting out the conflict between Sunni and Shiite Muslims. \"It is the height of hubris and ignorance to think that after 1,500 years of sectarian civil war that the U.S. can come in and convince Sunnis and Shiites to put down their arms and embrace,\" he said. Cruz insisted that Obamas Syria policy has been an incoherent mess, but he doesnt advocate more support for the Syrian rebels or the use of U.S. power to help remove the regime. He said Assad is a \"monster,\" but that if the rebels won and extremists came to power, that could be worse for Americas national security. In the rare cases where the U.S. must use force, Cruz said, it should be used sparingly and only for a limited mission: \"We should not engage in long-term nation building.\", On defense spending, Cruz tries to bridge the divide between the defense hawks and the budget hawks by decrying the sequestration under the 2011 Budget Control Act while also calling for reforms in Pentagon spending and a crackdown on waste, fraud and abuse. Overall, expect Cruz to focus his foreign policy criticism on what he sees as Hillary Clintons reticence to take tough international stands. \"The Obama administration negotiates a potentially catastrophic Iran deal, where is Hillary Clinton? Utterly silent. If she desires to be commander in chief, now is the time to stand up and speak,\" he said. \"I understand theres political risk in her party to saying anything out loud. But in a time of great challenges, leadership matters.\", Cruz is not the first tea party-friendly candidate to strike a hawkish tone: Sarah Palin tried to walk that line after her failed vice presidency bid in 2008. Cruz can make a case for the policies. The question is whether hawkish and libertarian Republicans will sign on. Bloomberg View, Josh Rogin is a Bloomberg View columnist who writes about national security and foreign affairs.]", "Date": "20150323", "Author": "[ Josh Rogin]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-ted-cruz-president-tea-party-20150323-story.html", "Title": "[ Can Ted Cruz get elected as first tea party hawk?]"}