{"Content": "[ Democratic U.S. Rep. Tammy Duckworth on Tuesday criticized Republican U.S. Sen. Mark Kirk as \"irresponsible\" for recently signing an open letter to the government of Iran regarding ongoing nuclear talks. The remark came at Duckworths first news conference since announcing via video on Monday that she would seek the Democratic nomination next year in a run for Kirks seat. Duckworth was referencing a letter signed this month by 47 Republican senators who warned Iranian officials that any nuclear deal negotiated by the Obama administration could expire as soon as the president leaves office. Democrats argue the letter interferes with talks to curtail Irans nuclear activities. \"To come together in a very partisan way and send a letter to a foreign nation that does not have Americas best interest at its heart, that undermines our nations unity, I think is very irresponsible and its certainly not befitting of a United States senator,\" said Duckworth, a two-term lawmaker from Hoffman Estates. Kirks campaign would not directly address Duckworths criticism, instead pointing to an earlier statement in which the senator said sanctions against Iran should not be weakened until the country \"stops its nuclear weapons program, stops supporting and exporting terrorism, stops aggression against its neighbors, stops egregious human rights abuses, and stops threatening to annihilate Israel. \"A better deal, with bipartisan congressional backing, is the best insurance policy against a nuclear Iran, a destructive arms race, and war in the Middle East,\" the statement read in part. Illinois Congresswoman Tammy Duckworth has announced her candidacy for the U.S. Senate against Republican Mark Kirk. Illinois Congresswoman Tammy Duckworth has announced her candidacy for the U.S. Senate against Republican Mark Kirk. Duckworth addressed reporters for about 15 minutes, her first time doing so since announcing Monday in a two-minute video that she would run against Kirk, who was elected to the Senate in 2010 after nearly 10 years in the U.S. House. Kirk had a massive stoke in 2012 that kept him out of Congress for nearly a year. She opened her remarks echoing much of the video, reading from a script in which she detailed her version of the \"American Dream.\" Duckworth described how she went to college with the help of government grants before she lost both legs flying a military helicopter in Iraq and returned home to Hoffman Estates, where friends and strangers adapted her home to make it wheelchair accessible. Duckworth could face Democratic primary challengers in Reps. Bill Foster of Naperville and Robin Kelly of Matteson. Duckworth shrugged off a possible primary, saying Democrats will remain \"united\" in efforts to defeat Kirk, who she argued is more interested in protecting tax breaks for corporations than helping working families. Second-term U.S. Rep. Tammy Duckworth is expected to announce her candidacy Monday for the U.S. Senate and a potential challenge to Republican Sen. Mark Kirk, a source familiar with her plans said. Duckworth, an Iraq War veteran, will be the first Democrat to formally announce for the 2016 U.S.... Second-term U.S. Rep. Tammy Duckworth is expected to announce her candidacy Monday for the U.S. Senate and a potential challenge to Republican Sen. Mark Kirk, a source familiar with her plans said. Duckworth, an Iraq War veteran, will be the first Democrat to formally announce for the 2016 U.S.... A Kirk spokesman contended Duckworth has \"zero credibility\" on tax issues, noting Duckworth improperly claimed a homestead exemption on two homes. In 2012, Duckworth, who lives in Hoffman Estates, also claimed a homestead exemption on a home in DeKalb, Ill. she rents out. DeKalb County records showed then that Duckworth paid a $1,928 adjustment and $612 penalty. \"On the first day of her campaign for U.S. Senate, Tammy Duckworth is already proving you cant trust anything she says,\" said Kevin Artl, campaign spokesman for Kirk. Critics have questioned Duckworths involvement as veterans affairs chief for Gov. Rod Blagojevich, which she tried to dismiss Tuesday by saying she was proud of her work on behalf of Illinois veterans. She also pushed back against Republican criticism that she voted in lockstep with Democratic leadership while in Washington, arguing she acted independently by voting to repeal the medical device tax put in place under the Affordable Care Act. Duckworth noted she also voted against a plan backed by President Barack Obama to arm Syrian rebels in the fight against Islamic State militants. \"In Washington, I know I have only been there a short time, but let me tell you, Ive stood up to my own party multiple times,\" Duckworth said. Kirk began the year with $2 million in campaign funds while Duckworth had more than $1 million. Winning Senate candidates in 2014 spent an average of about $9.65 million each, according to The Campaign Finance Institute in Washington. The race is expected to be among the most closely watched in 2016, a presidential election year, which historically is favorable to Democratic candidates. Still, it is Duckworths first statewide contest, and she predicted huge amounts of money would pour in from outside interest groups. \"I expect that therell be a lot of outside money coming into this race, but Ive seen that before,\" Duckworth said. \"Thats why I am here in Springfield today launching my campaign. Because its about the people. And so what if the money comes in.\", mcgarcia@tribpub.com, Twitter @moniquegarcia]", "Date": "20150331", "Author": "[ Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-tammy-duckworth-met-0401-20150331-story.html", "Title": "[ Duckworth blasts Kirk on Iran letter; his campaign dings her tax mistake]"}