{"Content": "[ Republican presidential hopeful Scott Walker made a Chicago campaign stop Monday at the Billy Goat Tavern, where he found himself talking about the guy whose last name is plastered in large, stainless steel letters across a skyscraper a couple of blocks away. Donald Trump, whose controversial remarks du jour have dominated much of the discussion in the GOP presidential field, took to Twitter on Monday to take a shot at his rival from Wisconsin, saying \"when people find out how bad a job Scott Walker has done in WI, they wont be voting for him. Massive deficit, bad jobs forecast, a mess.\", By the time the Wisconsin governor reached the Billy Goat in the late afternoon, he was well aware of the tweet. Peppered with questions about Trump, Walker at first tried to steer clear but eventually responded. \"Hes using the talking points of the Democrats last year,\" Walker said. \"The public in my state re-elected me for the third time in four years because they realized those talking points were not the facts. ... I dont know where hes getting his facts from, other than the talking points of state Democrats.\", Walker said he inherited a $3.6 billion budget deficit and turned his state around, pointing to a decrease in unemployment rates that mirrors improvements across the nation since the recession. What Walker didnt mention: Wisconsins once-projected $1 billion surplus for 2015 instead has sunk to a $2.2 billion deficit. Asked whether he was frustrated that Trump and his series of comments had sucked the air out of the GOP race lately, Walker replied: \"Its sucked the air out of the media, but I dont care about the media; I care about the voters.\", Wisconsin Gov. Scott Walker has advice for Illinois Gov. Bruce Rauner on July 27, 2015. (WGN-TV), Wisconsin Gov. Scott Walker has advice for Illinois Gov. Bruce Rauner on July 27, 2015. (WGN-TV), \"In the end, you all have an obsession for the next couple months with somebody else,\" Walker told a throng of reporters, his back facing the Billy Goats grill. \"Thats fine with me. My obsession is with the voters of this great country.\", Walker also took a dim view of former Arkansas governor and fellow presidential candidate Mike Huckabees recent comments that President Barack Obamas nuclear pact with Iran would \"take the Israelis and march them to the door of the oven.\", \"I certainly dont use language like that,\" Walker said of Huckabees comments. \"I tell people why Im against the Iran deal, because its a bad deal.\", Walker insisted Obamas agreement with Iran would lead the Middle Eastern country to better fund terrorist organizations and said hed put an end to the pact if elected president. When he wasnt answering questions about others in the field, Walker stuck to his message that he is the only candidate who has won both elections and difficult political fights, references to his battle with Wisconsin unions and his defeat of a recall attempt in 2012. Republican presidential candidate Donald Trump opened up a line of attack Saturday on Wisconsin Gov. Scott Walker, accusing the leader in recent polls in Iowa of running his neighboring state into financial trouble. Its the latest broadside against a rival of the outspoken New York billionaire.... Republican presidential candidate Donald Trump opened up a line of attack Saturday on Wisconsin Gov. Scott Walker, accusing the leader in recent polls in Iowa of running his neighboring state into financial trouble. Its the latest broadside against a rival of the outspoken New York billionaire.... \"Im the only one in this race who has done both. I have fought, and I have won,\" Walker said. \"Peoples lives are better because of it.\", The governor spent the rest of his 50 minutes at the famous subterranean haunt on Lower Michigan Avenue glad-handing customers, joking with owner Sam Sianis and chomping on a double cheeseburger with pickles, ketchup and mustard. Just before leaving, Walker stepped behind the bar to take a photo with the bartender and noticed the Schlitz beer tap that long has been a fixture. \"Schlitz! Thats great!\" Walker said with a grin. \"This is the beer that made Milwaukee famous right here.\", The governor then downed most of a mug of the now relatively obscure beer, before heading up the stairs to daylight and the campaign trail. bruthhart@tribpub.com , Twitter@BillRuthhart]", "Date": "20150727", "Author": "[ Bill Ruthhart]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-scott-walker-billy-goat-met-0728-20150727-story.html", "Title": "[ Walker chomps double cheeseburger, Trump's tweet]"}