{"Content": "[ First-term Republican U.S. Sen. Mark Kirk will start airing the first TV ad of his re-election campaign Thursday, a spot that uses his recovery from a January 2012 stroke as a metaphor for his work for Illinois constituents. The ad marks the beginning of the 2016 election campaign for television viewers, who have gotten little break from the political TV air wars in recent years. Chicago-area voters have been inundated with thousands of political commercials costing millions of dollars since November 2013, when Bruce Rauner launched TV ads, through April 7, when Mayor Rahm Emanuel won re-election. In the 60-second ad, Kirk narrates footage of his physical rehabilitation coupled with his military history as a former intelligence officer in the Naval Reserve. The ad is interspersed with video of his climb up the steps of the Capitol in Washington almost a year after having the stroke. \"As I learned to walk and climb again, I thought of our Illinois families struggling to get by. I thought of our veterans and our heroic men and women who are serving in harms way. Theyre the reason why I fought so hard to get back,\" Kirk tells viewers. \"Theyre why I never doubted that I would climb the Capitol steps again. I climb the steps for everyone facing their own challenges,\" he said. On the January 2013 day he made it up the steps, one of those who greeted him at the top was Tammy Duckworth, then a soon-to-be- inaugurated Democratic congresswoman and now a potential challenger to Kirk for Senate. Duckworth, who lost her legs during the Iraq War, said Kirks journey represented a \"fantastic day\" for people with disabilities. Kirk also was assisted up the stairs that day by a pair of Democrats: Vice President Joe Biden and Sen. Joe Manchin of West Virginia, a close colleague. See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. Kirk has stressed an effort toward bipartisanship in Illinois as he finds himself one of the top targets of Democrats in next years elections. The senator also has promoted moderate social positions such as support for same-sex marriage and a renewed effort to pass the Equal Rights Amendment to the U.S. Constitution. Despite the recent election of the Republican Rauner as governor, Illinois is typically a Democratic-tilting state in presidential election years, meaning the Kirk re-election bid will be among the costliest U.S. Senate races in the country. Kirk also has forged an alliance with Rauner. No Chicago TV stations posted information about the ad buy, which Kirk aides said was well over six figures. Comcast reported that the Kirk campaign spent $135,170 for local cable spots to run on CNN, Fox News and MSNBC from Thursday through June 6. In addition to Chicago broadcast and cable TV, the ad will air in the central Illinois market of Champaign, Decatur and Springfield. rap30@aol.com, Twitter @rap30]", "Date": "20150513", "Author": "[ Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-mark-kirk-illinois-senate-race-met-0514-20150514-story.html", "Title": "[ Mark Kirk launches first ad of 2016 U.S. Senate race]"}