{"Content": "[ When Rabbi Capers Funnye Jr. enters an unfamiliar synagogue at dawn to join the daily recitation of Hebrew prayers, his presence inevitably prompts questions. The 63-year-old African-American occasionally shares his story about growing up in the AME church on Chicagos South Side, then discovering Judaism as an adult. Or he makes light of the suggestion that he doesnt belong by telling bemused skeptics he picked up a prayer shawl and skullcap outside and wanted to see how they worked. Funnye (pronounced fun-AY) knows why people ask, but he wants that to change. \"Unfortunately, by and large, when you see any imagery of Jews in the United States, very seldom do you see members of my community,\" said Funnye, who lives in Beverly. \"But we have African-American Jews, African Jews, Filipino Jews, Mexican Jews, white Jews and biracial Jews. It is really what the Jewish people, in fact, have always looked like.  We have to promote that Jews have always been a global people.\", Funnye, the spiritual leader of Beth Shalom Bnai Zaken Ethiopian Hebrew Congregation in the Marquette Park neighborhood, soon could have the platform to set the record straight about race and diversity within the American Jewish community. A cousin to first lady Michelle Obama who spent many a Sunday afternoon with her family while growing up on the South Side, Funnye is poised to become the titular head of the International Israelite Board of Rabbis, which includes black Jews in the U.S. Caribbean, South Africa, Uganda and Nigeria. Just as his cousin by marriage, Barack Obama, has used his platform as commander in chief to address race relations in the U.S. Funnye hopes to use his prominence as chief rabbi to improve race relations in Jewish communities around the world. The Ethiopian Hebrew movement to which Funnye belongs is one of a few black Jewish movements now under the Israelite umbrella, all of which believe they are Jews of African descent. But Israelites have remained largely outside the mainstream Jewish community because they often arent considered Jewish without a traditional Jewish conversion. \"The community is not willing to have anybody dictate our right to practice Torah and have our own community,\" said Rabbi Baruch Yehudah, international secretary of the Israelite board. \"Over the years it has been a teeth-grinding situation.\", Funnye entered the Chicago Jewish scene in the mid-1980s, against a backdrop of particular tension between African-Americans and American Jews. The solidarity established during the civil rights era had begun to erode as affirmative action debates unfolded and prominent black leaders blamed the Jewish establishment for oppression. A low point came in 1984 when Democratic presidential candidate the Rev. Jesse Jackson referred to New York as \"Hymietown.\" He later apologized for using the derogatory term. Jane Ramsey, then-executive director of the Jewish Council on Urban Affairs, said the council had gone out of its way to galvanize communities around social justice but, until Funnye came along, hadnt considered engaging the African-American Jewish community. \"Hes deeply religious and deeply devoted to Judaism and also deeply devoted to creating jobs and housing and addressing racism and anti-Semitism,\" Ramsey said. \"It was very much a shared agenda.\", But his leadership and congregants raised eyebrows, Ramsey said. \"The predominately Caucasian community wasnt quite sure what to make of the African-American Jewish congregations in Chicago,\" she said. \"There was a lot of questioning. Are they Jews?\", The same kind of skepticism surfaced when Funnye became the first and only black rabbi to join the Chicago Board of Rabbis in 1997. Rabbi Ira Youdovin, then-executive vice president of the board, said at the time that the board admitted only graduates from the handful of American seminaries that ordained Reform, Conservative, Orthodox and Reconstructionist leaders. Funnye had earned his smicha, or ordination, from New Yorks Israelite Academy. But he also had earned a reputation for engaging the Jewish community in matters of social justice and opening minds. \"He had made a tremendous mark on the community,\" Youdovin said. \"We had to stretch, and we felt since he was a special person, he would be a good guy to stretch with.\", Since then, the number of seminaries whose graduates are admitted to the board has expanded. Funnye is expected to assume his international duties during a formal installation in Chicago this fall. However, his appointment is not automatic. The dozens of rabbis who make up the board must overwhelmingly approve him as \"the rabbi to the rabbis.\" In fact, the position has been vacant for 16 years. But over the past year, congregations have had the opportunity to review Funnyes proposed agenda, which many support. He intends to add women to the Israelite board, establish closer ties with the Ethiopian Jews now in Israel and publish a common prayer book that honors victims of the Holocaust as well as the Middle Passage, when millions of Africans were transported cross the Atlantic to become slaves. Funnye already has traveled to Israel to meet with Prime Minister Benjamin Netanyahu to press for more acceptance of black Jews around the world. Although Funnye took what he considered the extra step of converting to Judaism  or reverting, as he prefers to call it  he says that isnt necessary for other Israelites and their rabbis. He had his own reasons. \"I was already a Jew in my heart,\" he said. \"It validated for those around me my degree of sincerity of saying  I am a Jew. \", \"What I wanted to do was arrest any fears you have because I have no fears.\", mbrachear@tribpub.com, Twitter @TribSeeker]", "Date": "20150709", "Author": "[ Manya Brachear Pashman]", "Link": "http://www.chicagotribune.com/news/ct-chief-rabbi-israelite-met-20150709-story.html", "Title": "[ Chicago rabbi set to become chief of black Jews group]"}