{"Content": "[ Donald Trump pulled up in a long black limousine and gave a very presidential wave as he made his way into the building. Then the billionaire promptly found himself seated next to ordinary, wage-earning, subway-riding New Yorkers, forced to wait  and wait some more  for the wheels of justice to turn. The Republican presidential candidate reported for jury duty in Manhattan on Monday and spent much of the day like everyone else, filling out forms and wondering whether he would get picked. By late afternoon, he was released without getting selected for a trial, his civic obligation fulfilled. Trump had high praise for the public servants at the courthouse, saying: \"The people in the court system are really professional. It was an honor to see how it worked.\", The businessmans limo arrived in the morning at the foot of the courthouse steps familiar to viewers of TVs \"Law & Order,\" and he was met by a throng of camera crews, reporters and onlookers. Some booed, while others greeted him with fist bumps and books for him to sign. Inside, a lawyer posed for a selfie with him, a sketch artist presented him with a drawing to sign and a bystander exhorted him to \"save this country!\", A murmur went through the 75 or so other prospective jurors when Trump walked in. But they largely kept a respectful distance from the real estate mogul, reality TV star and GOP front-runner. \"He makes it a little more bearable,\" said Christian Johnson, 21, a University at Albany student doing jury duty for the first time. \"Hes giving me a lot of material for my Snapchat.\", Another juror, retiree Renee Shapiro, said: \"Im looking at him, and Im saying, Are my eyes deceiving me?\" She said he looked taller than she expected. The civic duty was somewhat overdue for Trump, who had been summoned but didnt appear five times before. His campaign explained that Trump never got those summonses because they had been sent to the wrong address. After filing through security, Trump was escorted to a front-row seat in a juror waiting room to fill out a questionnaire about biographical basics, hobbies, experiences with crime and the courts and occupation. Trump said he listed real estate, \"only because I refuse to say politician.\", Jury assembly supervisor Irene Laracuenta told the prospective jurors that celebrities are entitled to the same privacy  and face the same selection process  as anyone else. \"No one  no one  gets special treatment,\" she said. Still, from a security standpoint, Trump wasnt treated entirely like everyone else. A special team of uniformed and plainclothes officers shadowed him to make sure he could get around the courthouse easily, as is standard when high-profile people come to court, court officers union leader Dennis Quirk said. Trump also brought his own, unarmed bodyguard. \"Its a system, and we go through it. And its a great system. Its a system that works,\" Trump said at midday. \"They do a fantastic job, and I met some wonderful people.\", After sitting silently through much of the morning, Trump returned from a lunch break with copies of The New York Times, USA Today and The Wall Street Journal. Not bringing reading material earlier \"was a mistake,\" he said. Trump said he hadnt asked for a postponement because serving jury duty is \"the right thing to do.\" But asked whether he hoped to get cut loose after only one day, he said: \"I hope so.\", During the afternoon session, Trump held court with a group of reporters in the back of the jury assembly room in what can only be described as a hang-out session, offering them Tic Tacs and showing off the single key he carries in his pocket  to his home. \"I like to be lean,\" he said. Over the years, many celebrities, including Madonna, Spike Lee and Woody Allen, have been called for jury duty in New York. Indeed, \"Saturday Night Live\" cast member Bobby Moynihan was in the jury pool with Trump. Moynihan had no comment. While it was once de rigueur for doctors, lawyers, various other professionals and elected officials to get out of jury duty, the state eliminated their exemptions in 1996. Associated Press]", "Date": "20150817", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-donald-trump-jury-duty-20150817-story.html", "Title": "[ Trump released from jury duty, now back to campaign]"}