{"Content": "[ Mayor Rahm Emanuel on Tuesday said he supports President Barack Obamas nuclear deal with Iran, but dodged a question on whether he believes Israels fears that the agreement will empower Irans backing of terrorism are legitimate. \"The simplest way to say it is, if I was in Congress, I would support the presidents initiative,\" said Emanuel, who then quipped, \"But Im not in Congress, thank God.\", In supporting his former boss nuclear pact, Emanuel said that sanctions the U.S. and its allies placed on Iran have produced exactly the kind of agreement they hoped the crippling penalties would generate. \"I was there as his chief of staff when he painstakingly built an international coalition to for the first time put withering sanctions in place, all so you could leverage negotiations that were had,\" Emanuel said. \"And I think the product of those negotiations, based on all the alternatives  bombing, youre the only one with sanctions because the international coalition would fall apart  or a way that actually finally would get inspectors into Iran and dealing with the nuclear material. I would vote for that, because thats the best alternative, and not only that, it is exactly the end point that the original coalition and sanctions were intended to produce.\", Emanuels remarks come as Obama works to earn congressional approval of the deal. Many Republicans and U.S. Sen. Charles Schumer, a prominent New York Democrat, have come out in opposition, arguing the proposal isnt strict enough on Iran. Some lawmakers have argued the deal would leave Iran flush with cash to ramp up its support of terrorist organizations in the Middle East. That argument supports Israeli Prime Minister Benjamin Netanyahu, who has angrily rejected Obamas deal as a \"historic mistake\" that will \"fuel Irans terrorism worldwide, its aggression in the region and its efforts to destroy Israel, which are ongoing.\", New Jersey Sen. Bob Menendez announced on Tuesday his opposition to the Iran nuclear deal, the second Democratic senator to go against President Barack Obama, who is heavily lobbying for a congressional endorsement of the international accord. Under the agreement, which the U.S. and other world... New Jersey Sen. Bob Menendez announced on Tuesday his opposition to the Iran nuclear deal, the second Democratic senator to go against President Barack Obama, who is heavily lobbying for a congressional endorsement of the international accord. Under the agreement, which the U.S. and other world... Emanuel said he has not made any calls on behalf of the White House to Jewish members of Congress or anyone else. The mayor was asked about the nuclear deal at a Tuesday news conference to announce the return of express bus service on Ashland and Western avenues  two major north-south thoroughfares in the city. The mayor noted he was being asked about foreign policy after he had just taken a question on Chicagos stalled bus rapid transit, or BRT, project for the same two major streets. \"You went from BRT to Iran? I look forward to downtown Tehran having a bus rapid transit system,\" Emanuel joked to reporters. But the mayors tone turned serious when he was asked whether Israels fears that Obamas nuclear deal would empower Iran and threaten its security were legitimate. Emanuel, one of the nations most prominent Jewish politicians, did not give a direct answer. \"Let me tell you this. Im not joking. I told you what I would do if I was there (in Congress),\" Emanuel said. \"Im focused on my job, and thats right here as mayor, making sure that the communities, individuals, residents and businesses that rely on the investments were making on Western and Ashland receive those investments.  I told you, out of the periphery of my eye as a former congressman and chief of staff, what I would do in my view. But it is not my day-to-day focus at all.\", The September vote on the Iran nuclear deal is billed as a titanic standoff between President Barack Obama and Congress. Yet even if lawmakers reject the agreement, its not game-over for the White House.A congressional vote of disapproval would not prevent Obama from acting on his own to start... The September vote on the Iran nuclear deal is billed as a titanic standoff between President Barack Obama and Congress. Yet even if lawmakers reject the agreement, its not game-over for the White House.A congressional vote of disapproval would not prevent Obama from acting on his own to start... bruthhart@tribpub.com, Twitter @BillRuthhart]", "Date": "20150818", "Author": "[ Bill Ruthhart]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-rahm-emanuel-obama-iran-met-0819-20150818-story.html", "Title": "[ Emanuel supports Obama on Iran, ducks question on Israel concerns]"}