{"Content": "[ Mayoral challenger Bob Fioretti stood in the kitchen of a South Side firehouse on a recent morning and explained to a small group of firefighters and paramedics why he would be a better steward of their interests than Rahm Emanuel. Take pension benefits, which some in the room feared Emanuel could cut to ease budget woes. \"I understand what you guys, and gal, are talking about, and I agree that youve been making your contributions and the city needs to honor that,\" said Fioretti, an alderman who represents the 2nd Ward in the South Loop and Near West Side. \"People talk about the firefighters in this city, but you all need to vote.\", That Fioretti found himself inside the firehouse at all illustrates the central challenge of his uphill, sparsely funded quest to unseat Emanuel. A big supporter of organized labor on the City Council, Fioretti had reason to hope hed win the backing of the firefighters union. But that endorsement, along with a $25,000 campaign contribution, went to Emanuel. So Fioretti instead has had to try to win votes six or seven at a time in firehouses around the city. Its a political dynamic that has turned up time and again as the outspoken champion of issues dear to city worker unions and progressive liberals campaigns ahead of the Feb. 24 election: The very groups that welcomed his voice on the council are largely throwing in their lot with other candidates for mayor. Fioretti was a strong backer of the Chicago Teachers Union when its members went on strike in autumn 2012. In the mayors race, however, the CTU has bypassed Fioretti in favor of Cook County Commissioner Jesus \"Chuy\" Garcia. CTU President Karen Lewis was preparing her own challenge of Emanuel before an October cancer diagnosis, then talked Garcia into becoming her replacement even though Fioretti already had declared his candidacy. It was nothing personal, Lewis explained. \"His polling was horrible,\" Lewis said of Fioretti. \"I just didnt think he could win. Chuy is just a better candidate, better at building coalitions, better at dealing with everyday people.\", Such snubs, argues Fioretti, are byproducts of an independent streak and evidence hes beholden to no interest group, be it organized labor or corporations whose large donations to Emanuel the alderman regularly derides. That said, Fioretti acknowledges his campaign would have been in a better place if armed with some big union checks. \"Oh, most definitely,\" he said. \"You know why (the unions havent endorsed me)? Its because they know I wont toe the line,\" he added while campaigning at a CTA stop. \"I wont toe the union line, just like I wont toe the line of all these corporations that are always giving money to the mayor. So they dont endorse me. But thats OK, because I know the rank-and-file is behind me. I hear it from them everywhere I go.\", Current job: Alderman, 2nd Ward, Age: 61, Born in: Pullman, Lives in: West Loop, Personal: Engaged to Nicki Pecori. Previous positions: Attorney for City Hall; attorney in private practice; president of the Historic Pullman Foundation, Education: University of Illinois, B.A. in political science (1975);... Current job: Alderman, 2nd Ward, Age: 61, Born in: Pullman, Lives in: West Loop, Personal: Engaged to Nicki Pecori. Previous positions: Attorney for City Hall; attorney in private practice; president of the Historic Pullman Foundation, Education: University of Illinois, B.A. in political science (1975);... As Fioretti talked, he walked up to people getting on and off buses near a Green Line stop in Woodlawn on a cold, blustery morning, asking for their support. The candidate was surprisingly well known. \"Fioretti, I know you,\" one man said. \"You got some ideas, but you need to hit Emanuel harder in those debates.\", After dodging patches of ice outside the station for several minutes, Fioretti told a campaign aide to call the city to try to get a crew over to shovel and salt the area \"before someone breaks his neck.\", Raised in the Pullman neighborhood on the Far South Side, the 61-year-old Fioretti often touts his roots in the working-class enclave that once housed a company town built around the manufacture of famous Pullman train sleeper cars. Hes been a community leader in pressing for restoration of the historic Pullman factory and surrounding structures, and he brought up the issue last month during a Chicago Tribune Editorial Board forum. Interrupting Emanuel, who was talking about economic development in Pullman, Fioretti said, \"We need to have that made into a national park. You could make that call since you got the endorsement from the president, ask him to make it a national park today. \", On Thursday, President Barack Obama will do just that. Hes scheduled to travel to Chicago to officially designate it a national monument with Emanuel at his side. Coming a few days before the election, its a reminder to Chicago voters of Emanuels connection to the president and his ability to deliver from Washington. While Fioretti will achieve a goal hes long worked toward, credit will be harder to come by. Fiorettis run for mayor is his first, but he strongly considered seeking the post in 2010 when the race was wide-open after Mayor Richard M. Daley announced he would not run again. But a diagnosis of tonsil cancer prompted Fioretti to drop his mayoral plans and run for re-election as alderman. After treatment, he says he is \"100 percent cancer-free.\", Fiorettis political career is in many ways an outgrowth of a legal career marked by activism and controversy. After earning a law degree from Northern Illinois University, Fioretti began working as a lawyer for the city in 1979 during the final days of the administration of Mayor Michael Bilandic, city records show. He remained on the citys legal staff through the often tumultuous mayoral term of Jane Byrne and continued on under her successor, Harold Washington, before striking out into private practice. On the campaign trail, Fioretti refers to himself as a \"civil rights lawyer.\" He once won a high-stakes interstate custody battle involving an African-American infant from Chicago whose mother said she had been improperly pressured to give up the child for adoption in Utah. Another time he won a $9 million judgment from the city for a client in a wrongful conviction case. In a very different manner, Fioretti also has been at the center of legal bills incurred by the city. Records show the taxpayer tab topped $800,000 to defend and settle two federal lawsuits over building permits in his ward that Fioretti tried to block by using his aldermanic privilege. One involved the Congress Plaza Hotel on South Michigan Avenue, which wanted to open a sidewalk cafe but had drawn Fiorettis ire because of a long-standing labor dispute. Another involved the controversial Felony Franks hot dog stand. Over Fiorettis objection, both establishments eventually got their permits, though Felony Franks has since closed. Despite such successes, Fioretti and two of his prior law firms have faced legal action from 12 individuals and companies alleging they werent paid for their work. Lawyers have sued for paychecks, campaign workers for back wages. Some of the complaints were settled out of court. Another legal problem for Fioretti caused the Chicago chapter of the National Organization for Women to yank its endorsement of his 2007 aldermanic campaign. The incident involved shifting explanations he had given about a court order of protection once briefly imposed against him by a female court reporter who claimed he was harassing her. Fioretti denied the allegation and a judge vacated the order after only a week. As he runs for mayor, theres a measure of irony in the difficulties Fioretti has faced in gaining traction. In the City Council, he has been among the mayors most vocal and frequent critics. Emanuel rarely has trouble bending council members to his agenda. Not so for Fioretti, who has not been shy about opposing the mayors initiatives as well as lambasting him for a lack of openness about spending plans the alderman contends tilt toward downtown at the expense of neighborhoods. On occasion, Fioretti will take to the council floor to upbraid colleagues for being sheepish about demanding more accountability from Emanuel. \"What are we doing here?\" he has asked of fellow aldermen more than once. Fiorettis willingness to draw the mayors ire has endeared him to some council members, most notably 32nd Ward Ald. Scott Waguespack, a fellow member of the progressive caucus. \"I dont understand why they arent backing him,\" Waguespack said of the many unions and community groups that arent rallying to Fiorettis campaign. \"Hes the guy whos been in there, hes been fighting the fight, he knows how the city works and hes been putting forward ideas to fix things.\", But Fiorettis fiery style, as well as a reputation as a go-to alderman for reporters looking for someone to bad-mouth Emanuel, also have earned a large share of detractors. Some aldermen roll their eyes or walk off the floor when he stands to speak. Ald. Proco \"Joe\" Moreno sits next to Fioretti at council meetings. The 1st Ward alderman charged Fioretti with being more interested in getting attention than in getting things done. \"He doesnt try to educate other aldermen about his positions. He doesnt work issues to try to bring people around to his point of view,\" said Moreno, who joined a handful of aldermen in forming a rival progressive group on the council. Indeed, Fioretti has rubbed so many council colleagues the wrong way that they drew him out of his current ward when the boundaries for the 50 City Council seats were remapped after the 2010 census. Fioretti, who is white, beat an African-American incumbent in a traditionally black-majority ward that had a growing white population thanks to a South Loop building boom. By 2012, when the new ward map was drawn up, whites had come to make up about as much of the population of Fiorettis ward as African-Americans. As council members fought in private about how to redraw the ward lines, many found it easy to sacrifice Fiorettis territory. Fioretti, who opted to run for mayor instead of alderman in the new ward, defended his outspokenness despite the political price he appears to have paid. \"When we take these positions, we get (Emanuel) to change his positions because he doesnt want to look like hes standing against doing the right thing,\" Fioretti said. \"Of course, he doesnt want to give us any credit, but then you see him come out with something and think, I wonder where he came up with that idea?\", He pointed to the support he and other aldermen showed for raising the minimum wage as an example of an issue on which they got the mayor to move. Emanuel eventually supported a plan to gradually raise the minimum wage in Chicago to $13 by 2019. While hes running for the citys highest office and clashed with the last two to hold it, Fioretti has only ever served as an alderman. As such, hes given to slipping into long digressions about graffiti removal or ideas for fixing up viaducts as he drives through neighborhoods. In the end, he said, his success as alderman should be judged on those nuts-and-bolts services. \"Ill put my ward record up against anybodys.\", jebyrne@tribpub.com, bsecter@tribub.com]", "Date": "20150216", "Author": "[ John Byrne, Bob Secter]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-bob-fioretti-chicago-mayor-met-0216-20150216-story.html", "Title": "[  Fioretti running down lonely road for Chicago mayor]"}