{"Content": "[ Gov. Scott Walker said in 2013 that he envisioned a path to citizenship for the 11 million immigrants living in the country illegally. But now the Wisconsin Republican calls that position \"amnesty\" and says his view has changed. \"I dont believe in amnesty,\" Walker told \"Fox News Sunday.\" My view has changed. Im flat out saying it. Candidates can say that.\", Walker, who emerged this past week in the top tier of potential candidates for the Republican presidential nomination for 2016, says the U.S. needs to secure the border and ultimately put in place \"a legal immigration system that works.\", That means, in part, putting the onus on employers and getting them the tools to do that, like E-Verify, an existing federal program that allows businesses to check the immigration status of new hires, Walker said. Walker told the Wausau, Wisconsin, Daily Herald newspaper in 2013 that \"it makes sense\" when he was asked whether he could see a world where \"those people\" could get citizenship, with the right penalties, waiting periods and requirements in place. At the time, he supported a bipartisan approach to overhauling immigration, with people waiting to get citizenship having priority and others having a legal pathway to live here legally. Kentucky Sen. Rand Paul has won the Conservative Political Action Conferences annual presidential preference straw poll. Pollsters announced Saturday that Paul won 25.7 percent of the votes in the annual survey, giving Paul his third consecutive win in as many years. Wisconsin Gov. Scott Walker... Kentucky Sen. Rand Paul has won the Conservative Political Action Conferences annual presidential preference straw poll. Pollsters announced Saturday that Paul won 25.7 percent of the votes in the annual survey, giving Paul his third consecutive win in as many years. Wisconsin Gov. Scott Walker... Also Sunday, Walker told \"Fox News Sunday\" that President Barack Obama or \"anybody else who is willing to put their name on the ballot certainly has to have the love for country to do that.\", Walker drew criticism last month after former New York Mayor Rudy Giuliani questioned Obamas patriotism during a speech at a Walker fundraiser. When asked about the former mayors comments, Walker sidestepped the question by saying he hadnt asked Obama about his love of country. With the nominating conventions more than a year away, Walker emerged this week in the top tier of possible candidates. He came in second in a straw poll conducted by the Conservative Political Action Conference. Kentucky Sen. Rand Paul won 25.7 percent of the votes in the annual survey, giving Paul his third consecutive win in as many years. Walker came in second with 21.4 percent. Sen. Ted Cruz came in third in the contest with 11.5 percent, followed by retired neurosurgeon Ben Carson with 11.4 percent and former Florida Gov. Jeb Bush with 8.3 percent. All of the other names listed received under 5 percent. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. The three-day CPAC conference in suburban Washington draws many libertarian-leaning college students whose views and priorities differ significantly from the Republican Party at large. But it is nonetheless seen as a barometer of certain conservative activists early leanings. Pollsters said just over 3,000 attendees voted. Nearly half identified as between the ages of 18 and 25. Respondents said economic issues, like jobs and taxes, were most important to them in deciding whom to support as the Republican nominee for president in 2016.]", "Date": "20150301", "Author": "[ Associated Press]", "Link": "http://www.chicagotribune.com/news/local/breaking/chi-wis-gov-walker-sure-obama-loves-his-country-20150301-story.html", "Title": "[ Wis. Gov. Walker changes mind about immigration, now rejects 'amnesty']"}