{"Content": "[ The killing of a woman at a sightseeing pier has brought criticism down on this liberal city because the Mexican man under arrest was in the U.S. illegally, had been deported five times and was out on the streets after San Francisco officials disregarded a request from immigration authorities to keep him locked up. San Francisco is one of dozens of cities and counties across the country that do not fully cooperate with federal immigration authorities. The city goes so far as to promote itself as a \"sanctuary\" for people in the country illegally. In a jailhouse interview with a TV station, Francisco Sanchez, the 45-year-old repeat drug offender arrested in the shooting Wednesday of Kathryn Steinle, appeared to confirm that he came to the city because of its status as a sanctuary. Prosecutors on Monday charged Sanchez with murder as San Francisco Sheriff Ross Mirkarimi strongly defended his offices release of Sanchez and pointed the finger back at U.S. Immigration and Customs Enforcement. He said the federal agency should have issued an arrest warrant for Sanchez. \"ICE knew that he had been deported five times,\" Mirkarimi said. \"You would have thought he met a threshold that he required a court order or a warrant. They did not do that.\", The case has prompted a flurry of criticism from ICE officials, politicians and commenters on social media, all of whom portrayed the slaying as a preventable tragedy. \"Most of the blame should fall squarely on the shoulders of the San Francisco sheriff, because his department had custody of him and made the choice to let him go without notifying ICE,\" said Jessica Vaughan, director of policy studies at the Washington-based Center for Immigration Studies, which wants tougher immigration enforcement. Father Cameron Faller, right, associate pastor at the Church of the Epiphany, and Julio Escobar of the Archdiocese of San Francisco Restorative Justice Ministry conduct a prayer service at the site where 32-year-old Kathryn Steinle was killed. Father Cameron Faller, right, associate pastor at the Church of the Epiphany, and Julio Escobar of the Archdiocese of San Francisco Restorative Justice Ministry conduct a prayer service at the site where 32-year-old Kathryn Steinle was killed. Rep. Bob Goodlatte, the Virginia Republican who chairs the House Judiciary Committee, blamed sanctuary practices and the Obama administration, saying: \"The tragic murder of Kate Steinle once again underscores the need to end these reckless policies.\", Mayor Ed Lee issued a statement saying city policy was never intended to protect \"repeat, serious and violent felons.\" He asked for federal and local agencies to review what happened. California Attorney General Kamala Harris, a former San Francisco district attorney who is running for U.S. Senate, cautioned that when it comes to immigration, \"our policy should not be informed by our collective outrage about one mans conduct.\", Many other San Francisco politicians stayed quiet as mourners held a late morning vigil at Pier 14 on the downtown waterfront, where the 32-year-old Steinle was gunned down Wednesday, seemingly at random, during an evening stroll with her father and a family friend. She had recently moved to San Francisco. While many cities have scaled back cooperation with ICE, few have gone as far as San Francisco. For more than two decades, San Francisco has been considered a sanctuary for people in the U.S. illegally. The citys sanctuary law prohibits city employees from helping federal authorities with immigration investigations or arrests unless required by law or warrant. That said, the ordinance does not prohibit local law enforcement from informing ICE that theyve arrested someone in the country illegally for a felony offense or who has prior felony convictions. In 2013, Mirkarimis office started turning over fewer people under arrest to federal immigration authorities for deportation. Mirkarimi on Monday stood behind the citys sanctuary law as a way to fight crime and promote trust. His office routinely ignores such federal immigration requests unless backed by an active warrant. He said ICE was aware of San Franciscos policy. Earlier this year, Sanchez was released from federal prison  where he had served a sentence for re-entering the country after deportation  and turned over to the Sheriffs Department on an outstanding drug-related warrant. The San Francisco district attorneys office declined to prosecute what authorities said was a decade-old marijuana possession case, and Sanchez was freed on April 15. Before he was set free, ICE had filed a so-called detainer with San Francisco authorities, asking to be informed if they intended to let him go, ICE spokeswoman Gillian Christensen said. But she said ICE was never notified. \"Were not asking local law enforcement to do our job,\" she said in a statement. \"All were asking is that they notify us when a serious foreign national criminal offender is being released to the street so we can arrange to take custody.\", In the past 21 months, immigration authorities have issued more than 230,000 detainers, according to ICE. Since January 2014, law enforcement agencies around the country have failed to honor about 17,000 detainers, 61 percent of them in California, ICE said. Sanchez has been deported five times, most recently in 2009, and has seven felony convictions, four involving drug charges, according to ICE. From jail, Sanchez told a KGO-TV reporter in a mix of Spanish and English that he found the gun wrapped in a T-shirt while sitting on a bench at the pier. \"So I picked it up and ... it started to fire on its own,\" Sanchez said, adding that he heard three shots go off. Asked if he came to San Francisco because of its sanctuary status, he said yes. \"I only want to say that if the court wants to find me guilty, I wouldnt get mad,\" Sanchez said during the interview, in which he appeared confused and spoke incoherently at times. The American Civil Liberties Union of Northern California supports sanctuary protections, saying people are more willing to cooperate with police if theres no fear of deportation. Julia Harumi Mass, a senior staff attorney with the organization, called the details of this case exceptional and put the blame on ICE. \"It is still unclear why the federal government turned over someone who is known to be deportable to the city of San Francisco, knowing that San Francisco is one of the oldest sanctuary cities in the country,\" she said. Associated Press]", "Date": "20150707", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-san-francisco-pier-slaying-20150706-story.html", "Title": "[ San Francisco's status as 'sanctuary' criticized after slaying on pier]"}