{"Content": "[ Hundreds of Syrian refugees poured into a Turkish-Syrian border crossing Saturday, fleeing intense fighting as Syrian Kurds closed in on an Islamic State-held town  the only passageway linking Turkey with the extremist groups stronghold of Raqqa. Some 13,000 refugees have already crossed into Turkey in the last 10 days, according to the Turkish Foreign Ministry. Hundreds more could be seen Saturday on the Syrian side of the Akcakale border crossing, waiting to cross into Turkey. A statement by the main Syrian Kurdish fighting force, known as the YPG, said its fighters have encircled the Islamic State-held town of Suluk, a few kilometers (miles) southwest of the strategically important town of Tal Abyad. It said IS militants have \"lost control\" over Suluk and Kurdish forces were advancing toward Tal Abyad. It also said the road linking Tal Abyad with Raqqa was under YPG control. The report could not be immediately confirmed. The Britain-based Syrian Observatory for Human Rights said the Kurds were less than 10 kilometers (six miles) away from Tal Abyad. The loss of Tal Abyad would be a major blow to the IS group. The border town is a major avenue for commerce for the extremist group  through which it smuggles in foreign fighters and sells black-market oil. The city is also a key link between Turkey and the northern Syrian city of Raqqa, the de-facto capital of the Islamic State groups self-declared caliphate. In Syria, a country now split mostly between Islamic militants and forces loyal to President Bashar Assad, the U.S. has found a reliable partner in the countrys strongest Kurdish militia, the YPG. They are moderate, mostly secular fighters, driven by revolutionary fervor and deep conviction in their cause. Several months ago, Keith Broomfield informed startled relatives that he had decided to join the fight against Islamic State. The 36-year-old Massachusetts native, who worked at the family manufacturing business, didnt know anyone in Syria or Iraq and had no battlefield experience. But he was... Several months ago, Keith Broomfield informed startled relatives that he had decided to join the fight against Islamic State. The 36-year-old Massachusetts native, who worked at the family manufacturing business, didnt know anyone in Syria or Iraq and had no battlefield experience. But he was... Since the beginning of May, they have wrested back more than 200 Kurdish and Christian towns in northeastern Syria, as well as strategic mountains seized earlier by the IS group. They have recently pushed into Raqqa province, a stronghold of the Islamic State group. Along the way, they have picked up ammunition, weapons and vehicles left behind by the jihadis. At the Akcakale border crossing, an Associated Press team witnessed hundreds of Syrians, many of them with suitcases and other belongings, standing on the other side. At one point, a group of armed, masked men  likely IS militants  approached them and ordered them to return to the town. Fearful, many of them turned back, only to return after about 15 minutes. Capturing Tal Abyad would open a direct line between Kurdish-controlled territories along the border with Turkey, linking up Kurdish-controlled areas in Hasaka province to the west with Kobani to the east. Such a move is likely to anger Turkey, which sees the YPG as part of the Kurdish PKK movement that has waged an anti-government insurgency in southeastern Turkey. At least one blast struck the famed ancient quarter of Yemens capital before dawn Friday, destroying centuries-old structures that had been considered jewels of traditional Islamic architecture. The intricately crafted tower-houses of Sanas Old City, adorned with fanciful geometric patterns,... At least one blast struck the famed ancient quarter of Yemens capital before dawn Friday, destroying centuries-old structures that had been considered jewels of traditional Islamic architecture. The intricately crafted tower-houses of Sanas Old City, adorned with fanciful geometric patterns,... The Islamic State group still holds about a third of Iraq and Syria, including Iraqs second-largest city, Mosul. IS fighters continue to battle Iraqi security forces and Shiite militiamen for territory north and east of the capital, Baghdad. In Iraq, coordinated Islamic State suicide attacks targeting Iraqi government security posts killed 13 people Saturday north of Baghdad, as security forces repelled more suicide attacks by the extremists in Anbar province, authorities said. Four suicide bombers driving explosive-laden cars rammed into two security checkpoints and a military headquarters in the al-Hajaj area within a 15-minute span, killing 13 Shiite militiamen and troops and wounding 24, police said. Al-Hajaj lies on the road between Beiji and Tikrit in Salahuddin province. The key refinery town of Beiji has been the scene of fierce fighting between Islamic State militants and government troops, backed by Shiite militias, who took control of the towns center a few days ago. The suicide bombings were claimed by the radical IS group on its twitter account, which said the four attacks were perpetrated by British, German, Kuwaiti and Palestinian militants. The statement, which was translated by the U.S.-based SITE Intelligence Group, said the men targeted the posts for Iraqi army and Shiite militias. Pictures of the alleged suicide bombers were shown in the statement. Meanwhile, police said security forces repelled Islamic State suicide attacks near the town of Garma, east of militant-held city of Fallujah. The attackers used four suicide cars in the assault that left no casualties among the government forces, they said. Recently received U.S. anti-tank missiles were used to destroy the suicide cars, police and military officials there said. Hospital officials confirmed the casualty figures from the Salahuddin province attacks. All officials spoke on condition of anonymity as they werent authorized to speak to journalists. Iraqi forces, backed by Shiite militias and U.S.-led airstrikes, have been struggling to regain control of the vast areas lost to the Islamic State group during its stunning blitz last year. Associated Press]", "Date": "20150613", "Author": "NULL", "Link": "http://www.chicagotribune.com/news/nationworld/ct-syrian-kurds-islamic-state-20150613-story.html", "Title": "[  Syrian Kurds nearing Islamic State border stronghold, thousands flee ]"}