{"Content": "[ Supporters of immigration reform should share their stories with legislators and register Hispanic voters, Democratic U.S. Sen. Dick Durbin and Chicago Archbishop Blase Cupich said over the weekend in Northfield. Applause often punctuated the remarks of Durbin and Cupich, who spoke Sunday, May 3, to an audience of more than 300 people at the Temple Jeremiah synagogue. When asked the best way for Chicago area residents to voice support, Cupich asked them to share their views with friends and neighbors, the first step toward changing hearts and minds. \"Look for ways to tell our heritage stories and tell your representatives how you feel,\" he said. \"Speak out, and dont let racist comments go by.\", Durbin, the second ranking Democrat in the Senate, urged reformers to press candidates for their views on immigration and register Hispanics to vote through a nonpartisan effort. \"If we add 2 million new voters, that would change the debate for president,\" he said of the 2016 election. \"They will have an impact.\", Durbin, who has led efforts to pass the DREAM Act for more than a decade, outlined developments leading to the current impasse in Congress. Although the measure passed the Senate in 2013 with 14 Republicans crossing party lines in support of the measure, the proposal hasnt been called for a vote in the Republican-controlled House. The Development, Relief and Education for Alien Minors Act proposes a pathway to citizenship for undocumented residents. In the meantime, a court challenge in Texas has blocked two components of executive action from President Obama allowing a temporary reprieve from deportation. \"If supporters would bring this bill to the floor, there are plenty of votes in Congress to have this passed,\" Cupich said. \"We should allow people to be able to speak through their representatives. There is consensus, but we need the opportunity to express consensus.\", Cupich and Durbin shared their own family stories, underscoring their strong views on the need to give newcomers to America a chance. The senators family came from Lithuania and settled in East St. Louis. The archbishops four grandparents from Croatia moved to Omaha, Neb. after World War I. Both speakers said experiences with young people facing immigration challenges contributed to their views. Cupich noted a lack of ambition from undocumented teens, who say they have no chance of attending college. Thirteen candidates for the seminary were turned away due to uncertain legal status, he said. Archbishop Blase Cupich, who took the helm of the Chicago Archdiocese on Nov. 18 as the spiritual leader of 2.2 million Roman Catholics, met Thursday with the Tribune Editorial Board. Here are five points he made:, I think that parents, no matter what their economic background is, should have a... Archbishop Blase Cupich, who took the helm of the Chicago Archdiocese on Nov. 18 as the spiritual leader of 2.2 million Roman Catholics, met Thursday with the Tribune Editorial Board. Here are five points he made:, I think that parents, no matter what their economic background is, should have a... Durbin cited the case of a talented Korean pianist  a Chicago resident since the age of 2  who was encouraged to apply to the Juilliard School in New York City, but lacked legal status. Without assistance, she would have had to leave the country for 10 years, he said. He offered help through a benefactor provided tuition, and the young woman married, became a citizen and is enjoying a successful career, Durbin said. \"The longer we delay, the deeper the hopelessness were creating in the lives of young people about their future,\" Cupich said. \"We will lose our center, our identity and our youth.\", Both leaders said they oppose deportation, which, they said, breaks up families. \"Those with a criminal record should leave because they have squandered their opportunity, but why break up a family?\" Durbin said. Durbin said the toughest critics he has faced are labor unions concerned that undocumented workers are taking American jobs. He said he has advocated for an orderly system registering workers who must report and pay taxes. Several audience members said they want to hear more concrete steps to for immigration reform. \"The DREAM Act is great, but what structures can be put in place so this never happens again?\" said Tonya Wallach from Northfield. \"The problems are all connected, and how do we get them to work across the aisle?\", Margaret Hastings from Kenilworth said she was encouraged so many people turned out to hear what can be done. \"Twenty years ago, many people in this room would have been reluctant to be outspoken in favor of immigration reform and think we all ought to be doing something,\" Hastings said. \"There are some right things to do, but its definitely a complex issue.\", Robert Castagna of Glenview said he sees parallels to a dark chapter in American history. \"This is a critical issue affecting the lives of millions of children and families,\" Castagna said. \"Families are being torn apart through deportation, just like slaves were sold. What have we learned in 150 years?\", jmichaels@pioneerlocal.com, Twitter: @janemichaels22]", "Date": "20150504", "Author": "[ Jane Michaels]", "Link": "http://www.chicagotribune.com/suburbs/winnetka/news/ct-wtk-immigration-panel-tl-0507-20150504-story.html", "Title": "[ Durbin, Cupich urge supporters of immigration reform to speak out, vote]"}