{"Content": "[ Republicans have been saying \"repeal and replace Obamacare\" for so long that it has started to sound like one of those ceremonial phrases that drop out automatically at opportune moments, like \"hellohowareyou\" or \"thankyouhaveaniceday.\" The party has conspicuously failed to actually coalesce around a plausible replacement plan, however, which has given these words the hollow sound of a Southern matron greeting a mortal enemy over mint juleps. Unfortunately, when youre running for president, polite nods to social necessity arent quite enough. Weve known for a while that the serious contenders were going to have to release an actual plan, one with enough details to critique. And sure enough, on Wednesday Scott Walker has done so, while Marco Rubio has penned a moderately detailed essayin Politico that tells us where his plan is likely to go. So what do they tell us about what the GOP is thinking?, Both Walker and Rubio are endorsing some version of the plan advanced by the 2017 Project, which would repeal the health-care plan in its entirety, and then use age-rated, advance-refundable tax credits to help people buy health insurance. Both would allow people to shop for insurance across state lines, which liberals argue would lead to a \"race to the bottom\" of insurers locating in the most lightly regulated states, and conservatives believe would cut back the cost tangle of regulatory burdens and ever-increasing legislative mandates to cover this service or that. Both candidates endorse high-risk pools for people with pre-existing conditions, and would beef up health savings accounts in Walkers case, by adding a $1,000 refundable tax credit for anyone who opens one. Both also have nasty things to say about bailing out insurance companies. The biggest difference so far is in how they would reform our current, very expensive entitlements for the elderly and the poor. Rubio endorses moving Medicare to a premium support model, which you might think of as a sort of health-care plan for the elderly. Walker focuses his reform efforts on Medicaid, which would be converted to a program for poor families like CHIP, which has a capped funding level rather than providing matching grants, with a more open-ended entitlement for people with disabilities and low-income seniors. Walker also has some blandly-nice-but-unlikely-to-change-much things to say about unleashing innovation and encouraging wellness, which Rubio doesnt have the space for in an op-ed format. These are two of the three or four plausible front-runners, which suggests that this broad idea converting the health-care plan to a simpler, flatter tax creditis gathering the momentum needed to make it the likely alternative Republicans profess come next year. Which means two things: the health-care plan is now setting the terms of the debate. And that debate will ultimately be fought over who the health-care plan is for. The first thing to observe about the structure of this plan is that it is not necessarily what you would come up with if you were looking for a bold, game-changing reform. It tinkers around the edges in possibly productive ways, shifting power out of the hands of regulators and into the hands of consumers. And thanks to the health-care plan, thats pretty much what Republicans are stuck with. The health-care plan was itself a large reform, but not a bold one: It won expanded coverage by buying off existing stakeholders with the assurance that nothing substantial would change. Republican presidential candidate Scott Walker on Tuesday offered an alternative to President Barack Obamas health care law that would provide tax credits and restructure Medicaid, and took a swipe at GOP rivals in Congress for their inability to repeal the law. \"Im willing to stand up against... Republican presidential candidate Scott Walker on Tuesday offered an alternative to President Barack Obamas health care law that would provide tax credits and restructure Medicaid, and took a swipe at GOP rivals in Congress for their inability to repeal the law. \"Im willing to stand up against... In the process, of course, it entrenched many of the biggest problems with the system more deeply. All the bad incentives of our fragmented and inefficient third-party-payer system are now not merely legal, but mandatory. Consolidation of providers and insurers into bigger and more opaque entities is not merely desirable, but necessary. An even bigger regulatory bureaucracy makes innovation in payment systems even harder, and responsibility for bad decisions even more diffuse. One can imagine reforms that would address some of these problems, but one cannot imagine them being enacted in the wake of the health-care plan, because the problems are now attached to a coverage expansion that would be politically difficult to undo. So we wont debate those reforms. What we will debate instead is who the health-care plan should be for. The health-care plan promised that it was for the middle class. In practice, it has overwhelmingly been a program for the poor and near-poor. Its two main features were a Medicaid expansion for everyone earning up to 133 percent of the federal poverty line and exchange policies for anyone else who wasnt eligible for employer insurance or another government program. As it turns out, exchange policies have been extremely popular among people whose policies are heavily subsidized, but not so popular with anyone who has to pay a significant chunk of the bill. This was basically a poverty program that was sold by playing to the anxieties of middle-class people worried about losing their health insurance. It may not seem like it, but this week has seen the most significant development yet in the immigration debates role in the 2016 election. Id go even farther  its possible that the entire presidential election just got decided. Is that an overstatement? Maybe. But hear me out. For months, people... It may not seem like it, but this week has seen the most significant development yet in the immigration debates role in the 2016 election. Id go even farther  its possible that the entire presidential election just got decided. Is that an overstatement? Maybe. But hear me out. For months, people... The Republican plan is, in fact, a program for the middle class. As such, it will be much less generous toward the poor. It will redistribute money upward, from those struggling very hard to ordinary Joes who are not rich, but not quite so desperate either. Dont get me wrong: It will also do other things, and theres a lot to like about regulating more lightly and putting more power into consumers hands. But this redistribution is one of the obvious effects, and it is the ideological divide over which the battle will be fought. In this debate, you can see the shape of where our politics may go over the next 20 years. Many Republicans would like a much smaller entitlement state; some Democrats would like a much bigger one, with Sweden-style universal coverage of virtually everything, crib to grave. Neither one is going to get what they want, because Americans are not prepared to give up their Social Security checks, or 60 percent of their paychecks either and no, there is not enough money to fund these ambitions, or even our existing entitlements, by simply taxing \"the rich.\", There are a lot of ways this could play out, but the Republican proposals for a post-Obamacare world sketch a very plausible one: Republicans become the party of universal, but lean, benefits that wont be enough to lift people out of poverty, while Democrats become the party of generous benefits for the poor, redistributing money and benefits downwards from the middle class while paying lip service to middle-class problems. Who wins that debate will tell us a lot about what kind of government well have in 50 years. Bloomberg, Megan McArdle is a Bloomberg View columnist who writes on economics, business and public policy.]", "Date": "20150819", "Author": "[ Megan McArdle]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-republicans-repeal-replace-obamacare-20150819-story.html", "Title": "[ Republicans sketch a health care alternative, finally]"}