{"Content": "[ Daniel J. Walkers career took him from a Chicago corporate boardroom to an attention-grabbing political trek across Illinois that led to the governors mansion, before closing with a federal prison term for bank fraud and self-exile in California. The states 36th governor, who served from 1973 to 1977, died Wednesday at his home outside of San Diego, according to family. He was 92. Proud of his accomplishments in the one term he served as governor  he authorized the Illinois Lottery and the Regional Transportation Authority  Walker confided in a 1993 interview that he left Illinois after his prison term in part because of shame. I also really felt I let a lot of people down, he said then to WGN-AM 720. I did wrong. I wanted to admit that and go forward. Walker proved to be a transitional figure in Illinois politics despite at one time having aspirations for the White House. One of his top patronage aides, Pat Quinn, adopted Walkers populist style and went on to the Illinois governors office  though Walker staunchly maintained there was no political patronage during his tenure. He fervently believed in the power of democracy and the importance of including everyone in our democracy, Quinn, who was defeated last fall after six years as governor, said in a statement. He loved his family and leaves behind many friends. His patriotism, service and compassion will never be forgotten. Former Gov. Dan Walker dies at 92 early Wednesday, April 29, 2015, in his Chula Vista home. (WGN TV), Former Gov. Dan Walker dies at 92 early Wednesday, April 29, 2015, in his Chula Vista home. (WGN TV), Former Gov. Dan Walker dies at 92 early Wednesday, April 29, 2015, in his Chula Vista home. (WGN TV), Former Gov. Dan Walker dies at 92 early Wednesday, April 29, 2015, in his Chula Vista home. (WGN TV), , , Lauded as a natural campaigner, Walker later confided that while he could work a room better than some candidates, he was shy and never good at cocktail parties and never good at small talk. That self-assessment was backed up by former Cook County Assessor James Houlihan, who entered the legislature the same year Walker became governor and served as the new chief executives de facto House floor leader. He was a great first meeting, Houlihan recalled. He would look into your eyes and grab your hand and say, Im so glad to meet you. But he didnt have flexibility after he met you to build on it. Walker ran as a political outsider, gaining initial success by regularly railing at the political machine controlled by the late Mayor Richard J. Daley. But it was confrontation with the regular Democrats under Daley that ultimately led to his political downfall. Walker, who wrote seven books in his retirement, titled his 2007 memoirs The Maverick and the Machine. News this morning of the death of former Illinois Gov. Dan Walker at age 92 prompts me to re-post the column I wrote after interviewing him in July, 2010:, More than 33 years and 1,600 miles separate Dan Walker from his days in the governors mansion in Springfield. Yet hes bracing to have his... News this morning of the death of former Illinois Gov. Dan Walker at age 92 prompts me to re-post the column I wrote after interviewing him in July, 2010:, More than 33 years and 1,600 miles separate Dan Walker from his days in the governors mansion in Springfield. Yet hes bracing to have his... Walker was vice president and general counsel of Montgomery Ward & Co. the now-defunct department store chain, when he first gained national recognition as author of a study of the violent protests that racked the 1968 Democratic National Convention in Chicago. The Walker Report labeled the chaos surrounding the convention a police riot. Daley, who ordered police into the streets and applauded their efforts to combat the protesters, was incensed  and the mayor had a long memory. In 1971, Walker launched a campaign for governor. Using a tactic borrowed from Lawton Chiles, then a U.S. senator from Florida, Walker donned his trademark red bandanna around his neck and with hiking boots on his feet and a lock of hair falling across his forehead, the political unknown campaigned for governor by walking 1,197 miles across Illinois. He greeted voters on their home turf with a handshake, a smile and a promise to bring government back to the people, then astonished the pundits by upsetting veteran politicians in the primary and general elections in 1972. But Walkers single term was a stormy one as he tried to fulfill the populist promises he had made on the campaign trail. His confrontational politics and continued warring with Daley led to numerous defeats in the legislature and a general inability to get his major proposals passed into law. Walker dared Daley to challenge his 1976 re-election, which was a bad move. Walker lost the Democratic primary to the Daley-backed Illinois Secretary of State Michael Howlett, who went on to lose the general election to Republican James Thompson by a wide margin. Democrats failed to regain control of the governors mansion for 26 years, until Rod Blagojevich won in the wake of a scandal involving then-Republican Gov. George Ryan. Both Ryan and Blagojevich went to federal prison, leaving Illinois with four of its last eight previously elected governors spending time behind bars. Though Walkers crimes were not related to his official elected duties but rather private business dealings, his prison time was routinely lumped into campaign attacks and late-night talk show jokes about Illinois lack of ethical leadership. Walker did get through the legislature a measure to create the RTA, which brought mass transportation in the Chicago metropolitan area under one umbrella for the first time. It marked one of the few times that he obtained Daleys cooperation. As part of the RTA deal, Walker also signed the bill creating the lottery, though he opposed it during his campaign. He also was credited with making major cuts in the state payroll, authorizing state workers to unionize, cracking down on welfare cheats and opening state jobs and contracts to minorities. The day before he left office in 1977, Walker reflected on the lack of empathy people have for politicians. Few people understand the travail involved in being in public office, he said. This kind of travail and the problems of fundraising give me second thoughts. A major part of my thinking is: Do I want to go through it again? Im not power-oriented. Power doesnt mean that much to me. Re-entering the business world, Walkers first ventures, a statewide chain of law offices and a hunting and fishing lodge, were unsuccessful. In 1981, Walker joined his second wife and millionaire Frank Butler in setting up a chain of quick oil change garages. In 1983 the Walkers acquired First American Savings Loan Association of Oak Brook. It proved to be his undoing. Federal regulators seized it in 1986, charging that Walker had bankrupted it through unsafe and unsound lending practices. On Aug. 5, 1987, a day before his 65th birthday, he pleaded guilty to bank fraud, misapplication of bank funds and perjury. He admitted using surrogates to take out loans from his own savings and loan at a time when he and his companies had reached their borrowing limits and were barred from receiving further loans. He used the loan proceeds to help finance his oil change business and personal expenses, including an 80-foot yacht, the Governors Lady. In his memoir, Walker acknowledged lapsing into a feeling of entitlement after his re-election defeat. He admitted the personal flaw destroyed his first marriage, drew him to a lavish and embarrassing lifestyle and led him to break the law as a private businessman. After serving less than 18 months, Walker was released from a federal prison camp in Duluth, Minn. in 1989 after his attorney told a judge that Walker was in failing health. He lived for another 26 years, eventually making his way back to the San Diego area. A son, Dan Walker Jr. called the former governor an impact player who will be greatly missed by all his family. He will be celebrated for his strength, his compassion, his loyalty and his love for his family, his son said. Walker is survived by his wife, Lily Stewart, and seven children. No services were announced. Chicago Tribunes Jessie Hellmann and Liam Ford and former Tribune reporters Douglas Frantz and John Camper contributed.]", "Date": "20150429", "Author": "[ Rick Pearson, Bob Secter]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-dan-walker-dead-20150429-story.html", "Title": "[  Former Gov. Dan Walker, colorful populist, dies at 92]"}