{"Content": "[ A Montana woman says the FBI interviewed her last month about her allegations that her brother was sexually abused while in high school by Dennis Hastert, the wrestling coach who would become speaker of the House. Jolene Burdge, of Billings, Mont. told The Associated Press on Thursday that the FBI interviewed her last month about Hastert, who was charged last week in a federal indictment alleging that he agreed in 2010 to pay $3.5 million to someone so that person would stay quiet about \"prior misconduct.\", Burdges brother died in 1995, 15 years before Hastert allegedly promised to pay that money. But years before his death, his sister said, he told her that his first homosexual contact was with Hastert and that it lasted throughout his high school years. Burdge would not disclose her brothers name to the AP but said he graduated from Yorkville High School in 1971 and that Hastert was his teacher and wrestling coach. Hastert was a teacher and coach in Yorkville from 1965 to 1981, according to the indictment. In an interview aired Friday on ABCs \"Good Morning America,\" Burdge identified her brother as Stephen Reinboldt, and said Hastert had been a father figure to him at high school. But she also said she believed that relationship had caused irreparable harm. \"He damaged Steve, I think, more than any of us will ever know,\" she told the morning show. The AP could not independently verify her allegations. A person familiar with the allegations in the indictment has told the AP that the payments mentioned in the indictment were intended to conceal claims that the Illinois Republican sexually molested someone decades ago. The person spoke to the AP on the condition of anonymity because the investigation is ongoing. Jolene Burdge reveals during an interview that Dennis Hastert was her deceased brothers first sexual encounter. June 4, 2015. (WGN TV), Jolene Burdge reveals during an interview that Dennis Hastert was her deceased brothers first sexual encounter. June 4, 2015. (WGN TV), Hastert has not been charged with sexual abuse. But Burdges story indicates there could be more victims beyond the \"Individual A\" named in the indictment. Hastert did not respond to a message left on his cellphone early Friday. Emails and phone messages sent to his son, Ethan Hastert, were also not answered. The FBI did not respond to a request for comment on Burdges allegations. Reinboldt died in Los Angeles in 1995 at age 42. Burdge told ABC that he died of AIDS. An obituary published in The (Aurora) Beacon-News said Reinboldt had \"a unique and fascinating mind\" and was drawn to the arts, especially film, drama and music. He was a manager of the wrestling team that Hastert coached, the AP found. He was also manager of the football team, student council president and a member of the pep club, lettermans club, the French club and the yearbook staff. He graduated in 1971 and later moved to the Los Angeles area, where he worked for Columbia Pictures in sales and distribution. He also worked for several software companies. Allegations that Dennis Hastert paid hush money to cover up years-old sexual misconduct have put a new light on criticism that, as House speaker, he failed to take action against a congressman who was making improper advances toward underage male pages. The scandal involving former U.S. Rep. Mark... Allegations that Dennis Hastert paid hush money to cover up years-old sexual misconduct have put a new light on criticism that, as House speaker, he failed to take action against a congressman who was making improper advances toward underage male pages. The scandal involving former U.S. Rep. Mark... \"He wanted to be in TV and film and all that,\" his brother, Daniel Reinboldt, told the AP on Thursday. \"He went to New York and LA, back and forth trying to get into the movie business.\", Reinboldt, who still lives in Yorkville, refused to talk to the AP about whether his brother was abused by Hastert. Another sister, Carol Reinboldt, of Lakewood, Colo. did not respond to messages from the AP. Burdge said her brother told her about his past with Hastert in 1979, after she graduated high school, but never brought his story out into the open because he feared \"nobody would believe him.\", The relationship with Hastert affected him \"in a big way,\" Burdge said. \"He never had a life,\" she said. \"He spent his life trying to run away from it and trying to dull the pain.\", The federal indictment, announced May 28, accuses Hastert of evading bank regulations in withdrawing hundreds of thousands of dollars and lying to the FBI about the reason for the withdrawals. Hastert is scheduled to be arraigned on the charges Tuesday. The document says Hastert agreed to pay a total of $3.5 million to someone identified only as \"Individual A\" to \"compensate for and conceal (Hasterts) prior misconduct\" against that person. But it does not go into any detail about the alleged misconduct. The former congressman, who has a home in the Chicago suburb of Plano, hasnt been seen in public since the indictment was announced. He resigned from the Washington lobbying firm where he worked. Burdge considered telling her brothers story in 2006, as a scandal involving Rep. Mark Foley unfolded. Foley, a Florida Republican, was discovered sending inappropriate emails and sexually explicit instant messages to former House pages while Hastert was speaker. Burdge spoke briefly with news outlets, including the AP, but she ultimately decided against coming forward with a statement at that time. Hastert stepped down in 2007. She said in the last six months, she had started to put her brothers story \"on the shelf\" trying to move past it. Then the FBI visited her home. Today, she says she is hopeful that any other victims come forward. \"We can help each other,\" Burdge said. Neither Burdge nor Daniel Reinboldt responded to Chicago Tribune requests for comment. Former Yorkville High School Class of 1971 student Tom Dirst, who was in a school comedic play with Stephen Reinboldt their senior year, remembered his pal as one of the most popular kids in their class. If he had a dark secret, Dirst said Friday, Reinboldt never shared it with him. \"There was a group of four or five us who hung around all the time,\" said Dirst, 61, who lives in Florida. \"He was real outgoing and fun to be around. I had no clue whatsoever. He never gave any indication there was anything going on.\", Dirst also knew Hastert well. Besides having him as his teacher, Dirst said, his mother taught French at the high school and Hastert often came over to their home to play cards and socialize with his parents. \"No one ever had a bad word to say about Denny,\" he said. Tribune reporters Christy Gutowski and David Heinzmann contributed.]", "Date": "20150605", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-dennis-hastert-20150605-story.html", "Title": "[ Woman says Hastert molested her brother during high school years]"}