{"Content": "[ The Episcopal Church elected its first African-American presiding bishop, choosing Bishop Michael Curry of North Carolina during the denominations national assembly Saturday. Curry was elected by a landslide in a vote at the Episcopal General Convention, the top legislative body of the church. Curry earned 121 of 174 votes from bishops on the first ballot. The other three candidates had 21 votes each or less. The decision was affirmed on an 800-12 vote by the House of Deputies, the voting body of clergy and lay participants at the meeting. Currys election is the second consecutive historic choice for the New York-based church of nearly 1.9 million members. He will succeed Presiding Bishop Katharine Jefferts Schori, who was the first female presiding bishop and the first woman to lead an Anglican national church. The Episcopal Church is the U.S. body of the Anglican Communion, an 80-million member worldwide fellowship of churches with roots in the Church of England. At a news conference, Curry said his selection as the first black leader of the denomination was \"a sign of our church growing more deeply in the spirit of God and in the movement of Gods spirit in our world.\" He will be installed Nov. 1 in a service at the Washington National Cathedral, the day Jefferts Schori completes her nine-year term. \"Weve got a society where there are challenges before us. We know that. And there are crises all around us. And the church has challenges before us,\" Curry told the assembly, when he was introduced as presiding bishop-elect. \"We are part of the Jesus movement, and nothing can stop the movement of Gods love in this world.\", Curry was elected as the nation is grappling with the aftermath of last weeks massacre of nine congregants at a historic black church in Charleston, South Carolina, and amid the Black Lives Matter movement over the deaths of black men in police shootings and in police custody. Chicago Archbishop Blase Cupich met privately with Pope Francis for the first time Friday, the Vatican announced Saturday. Cupich is one of 46 bishops in Rome this weekend to receive their palliums, symbols of their offices as bishops. The pallium will be placed on Cupichs shoulders by the popes... Chicago Archbishop Blase Cupich met privately with Pope Francis for the first time Friday, the Vatican announced Saturday. Cupich is one of 46 bishops in Rome this weekend to receive their palliums, symbols of their offices as bishops. The pallium will be placed on Cupichs shoulders by the popes... The Episcopal Church, the faith home of many Founding Fathers and U.S. presidents, has been trying to confront its own history of racism. The church has asked dioceses to research their own links to slavery because many Episcopalians were slaveholders whose donations were used to build churches, cathedrals and schools. In 2008, Jefferts Schori held a national service of repentance to apologize for the churchs complicity with slavery, segregation and racism. \"The truth is we are brothers and sisters of each other,\" Curry said. \"The hard work is to figure out how we live as a beloved community, as the human family of God.\", At the Salt Lake City assembly, deputies cheered and high-fived when the election results were announced in the convention hall. Norberto \"Bert\" Jones, 65, of Newark, New Jersey, hugged friends and marveled at being alive to see a black U.S. president and black Episcopal presiding bishop. \"This is beautiful,\" said Jones, a lay deputy and African American. \"God works awesome wonders man.\", Answering a plea from Pope Francis to protect the planet, Chicagoans  Catholics and non-Catholics alike  pledged Thursday to collect rainfall, conserve tap water, recycle their cans and bottles, and switch off the lights when they leave a room. Its an unusually tangible, immediate and ecumenical... Answering a plea from Pope Francis to protect the planet, Chicagoans  Catholics and non-Catholics alike  pledged Thursday to collect rainfall, conserve tap water, recycle their cans and bottles, and switch off the lights when they leave a room. Its an unusually tangible, immediate and ecumenical... Curry, 62, has been bishop of North Carolina since 2000, leading a diocese of 48,000 church members, 112 congregations and a network of ministries. A Chicago native who has two daughters with his wife, Sharon, Curry grew up in Buffalo, New York, and graduated from Hobart College and Yale Divinity School. He was ordained as a priest in North Carolina, leading parishes there and in Ohio. He then served for 12 years at St. James Church in Baltimore, Maryland, which was established in 1824 as the third black Episcopal congregation in the U.S. Curry is known for his emphasis on evangelism, public service and social justice. Author of \"Crazy Christians: A Call to Follow Jesus,\" he has said he prays \"for a church passionately committed to making disciples.\", He takes charge at a time when fewer Americans are formally affiliating with a particular religious group, contributing to steady membership declines in the Episcopal Church and other liberal Protestant groups, as well as some conservative churches. Membership in the Episcopal Church has dropped by 18 percent over the last decade. Curry supports gay rights, speaking against North Carolinas 2012 constitutional amendment that banned same-sex marriage, which is now invalid, and allowing same-sex church weddings in the North Carolina diocese. Curry said the U.S. Supreme Court \"affirmed the authenticity of love\" Friday by legalizing gay marriage nationwide. The denomination has emerged from a period of turmoil after the 2003 election of Bishop Gene Robinson, the first openly gay bishop in the Anglican Communion. Many Episcopal conservatives left or distanced themselves from the national church after his election, which strained relations in the Anglican world. Next week, the convention will vote on eliminating gender-specific language from church laws on marriage so religious weddings can also be performed for same-sex couples. Clergy could decline to perform the ceremonies. Right now, each bishop decides whether his or her priests may conduct gay marriages. Associated Press, ]", "Date": "20150627", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-episcopal-church-first-black-bishop-michael-curry-20150627-story.html", "Title": "[  Episcopal Church elects first black presiding bishop ]"}