{"Content": "[ Merge Healthcare, a Chicago-based medical software company, said Thursday that it has agreed to be acquired by IBM for about $705 million in cash plus the assumption of debt. The deal is an exit strategy for Merrick Ventures, an investment fund led by Chicago technology entrepreneur Michael Ferro. Ferro also heads another investor group that acquired the Chicago Sun-Times in 2011. Merrick Ventures bought a controlling stake in Merge for $20 million in 2008. Through Merrick, Ferro had a 24 percent stake in Merge, as of April 20, according to securities filings. His stake is worth about $188 million at the $7.13 per share takeover price. IBMs price represents a 31.7 percent premium over Merges closing price of $5.41 on Wednesday. IBM said it expects to close the deal later this year. Merge has yet to turn a yearly profit under Ferros tenure. In 2014, the company reported a loss of $447,000, a big improvement over the $38.9 million loss the year before. But 2014 sales fell 8.3 percent to $212.3 million. IBM said it will add Merge to its growing health platform and the capabilities of Watson, the companys artificial intelligence computing system famous for competing on \"Jeopardy.\" Merges software helps health care providers manage medical images. IBM said it can now bring Watsons computing power to help doctors analyze images and incorporate them with other health information, like lab tests. IBM Headuarters. IBM Headuarters. \"Medical images are some of the most complicated data sets imaginable, and there is perhaps no more important area in which researchers can apply machine learning and cognitive computing,\" John Kelly, an IBM senior vice president, said in a statement. Merge looked for a buyer in 2012 but took itself off the market a year later. Ferro abruptly resigned as chairman in August 2013 but rejoined the board in November. asachdev@tribpub.com, Twitter @ameetsachdev]", "Date": "20150806", "Author": "[ Ameet Sachdev]", "Link": "http://www.chicagotribune.com/business/ct-ibm-merge-health-0807-biz-20150806-story.html", "Title": "[ Merge Healthcare to be sold to IBM]"}