{"Content": "[ Sometimes the punch to the gut is what saves you, even if you dont realize it immediately. When youre doubled over, the bullet headed for your head whizzes harmlessly past. So it was with Chicagos bid to host the 2016 Olympics. Remember that?, The bad news: We didnt get the Games. The good news: We didnt get the Games. Whatever Chicago felt about six years ago when International Olympic Committee voters quickly ousted it from finalist contention, ultimately selecting Rio de Janeiro, imagine if they had actually chosen this city. The legacy of Olympics for hosts is that of unneeded venues, debt and tightly focused short-term economic boosts that are hard to discern long-term. Would Chicago 2016 have been a point of civic pride? Undoubtedly. A magnet for job creation? For a time. Exciting? For many. Profitable? For a very select few. Chicago will pay expensive taxable rates on the bulk of Mayor Rahm Emanuels upcoming $1.1 billion bond deal  a costly sign of how much the city has come to rely on long-term debt to cover short-term expenditures. Governments must resort to taxable bonds when they want to borrow for costs with... Chicago will pay expensive taxable rates on the bulk of Mayor Rahm Emanuels upcoming $1.1 billion bond deal  a costly sign of how much the city has come to rely on long-term debt to cover short-term expenditures. Governments must resort to taxable bonds when they want to borrow for costs with... And then the bills come due. Take the concentric circles of fiscal hell in which Chicago finds itself and multiply them by five, as in the five interlocking rings of the Olympic logo, with the opening ceremony just about a year away. Boosters to this day swear we could have pulled it off and been the better for it. That was more plausible back when we didnt know how many other things we enjoyed under Mayor Richard M. Daley but couldnt really afford, excesses for which we still pay dearly. The metropolitan area, the state, perhaps neighboring states and the federal government would not just be racking up more bills they could ill-afford to pay for the 2016 Olympics, diverting resources needed elsewhere. They would be struggling to get preparations done in time because thats the way it always goes, even in places where money and labor are no object. And, Olympics or not, theyre always an object. Being a spectator is cheaper and more enjoyable. Seriously, watch Wisconsin legislators contort themselves like world-class gymnasts to justify what theyre doing to, say, education in the state while potentially funneling hundreds of millions of dollars to support a new arena for the wealthy owners of pro basketballs Milwaukee Bucks. Mayor Rahm Emanuels plan to manage the citys burdensome liabilities with more borrowing is moving forward. The city on Wednesday sold $745 million worth of taxable bonds to more than 70 investors, Chicago finance officials said. The deal will allow the city to pay back over decades expenses such... Mayor Rahm Emanuels plan to manage the citys burdensome liabilities with more borrowing is moving forward. The city on Wednesday sold $745 million worth of taxable bonds to more than 70 investors, Chicago finance officials said. The deal will allow the city to pay back over decades expenses such... In the Tribunes recent account of how costly it is for Chicago under Mayor Rahm Emanuel to use long-term bonds for short-term financial relief, we were reminded again how the city grapples still with the profligate tab Mayor Daley ran up on his way out of office. Among expenses mentioned were those associated with the Daley-backed Olympics bid, the bid that Daley said wouldnt cost the taxpayers. As if. Such is the history of budget-busting overspending connected with hosting the Games that there are a lot of smart people in Boston, selected as the U.S. contender for hosting the 2024 Olympics, already trying to get out of its commitment even to compete in the IOC sweepstakes. Government officials in Tokyo, already picked as 2020 host, said Friday they will scrap their long-touted plans for the centerpiece venue and start over in response to pragmatism and righteous public outrage as costs ballooned past $2 billion. Thats just for the main Olympic stadium. Beyond the expense for Chicago, consider the anxiousness among residents and businesses about security, safety and sacrifice. If the upside far outweighs the much-trumpeted turn as host of the 2012 NATO summit that too many people have forgotten, so too would the risks. Some Chicagoans flipped out when a few streets and a bit of parkland were surrendered to the National Football League for its three-day draft this spring. Ever read what the IOC requires of host cities? Invading countries demand less deference, control and real estate. Chicago hosting an Olympics would be like staging its own wake. Best-case scenario, its a great party where everyone says wonderful things about it. But no matter what, when its over, the citys buried. Montreal needed decades to pay off the 1976 Olympics, and things have only gotten more expensive since then. Los Angeles, the 1984 site, is probably the only U.S. city that should ever try to host the Summer Games, because the footprint is in place. A couple of weeks or so ahead of the 1996 Games in Atlanta, I remember running into Mayor Daley at Moody Bible Institutes Solheim Center, where the U.S. Olympic mens basketball team was holding a practice. Already he was contemplating a future Olympics bid. Daley downplayed the expense and other potential downsides, as he did with way too many things. He said Atlanta was fortunate to have beaten the heritage pick of Athens (eventually picked for 2004) for 96. It was an excuse to build. \"They need it,\" Daley said. Theres room for debate on that point, in all Olympic cities and not just in Atlanta, where the Olympic Stadium was to be a functional legacy landmark once downsized into a home for the Atlanta Braves. The Braves plan to abandon it after next season for a new ballpark now under construction. Chicagoans knew all this going in, or should have, and yet ultimately we were stung when the IOC knocked the wind out of us on the first ballot almost six years ago. Most of us didnt realize the campaign was doomed by internecine IOC politics well before President Barack Obama, Daley, Oprah Winfrey and other Chicago boosters arrived in Copenhagen, Denmark, to show their support. That this group in particular could so badly read an audience, so completely misjudge their electorate, was staggering at the time. Today its cause for gratitude. Fairly or not, Chicago and Illinois are linked with Athens and Greece in enough ways. We dont need another. philrosenthal@tribpub.com, Twitter @phil_rosenthal]", "Date": "20150718", "Author": "[ Phil Rosenthal]", "Link": "http://www.chicagotribune.com/business/columnists/ct-rosenthal-0719-biz-20150717-column.html", "Title": "[ Imagine what hosting 2016 Olympics would've cost cash-strapped Chicago]"}