{"Content": "[ Today, we are all Rick Perry. At least insofar as we are being confronted with a list that has too many items in it for us to remember with ease or convenience: the list of candidates for president in 2016. But never fear! I have come up with a couple of mnemonic devices that may or may not be helpful. Democratic Candidates:, Really, the task on this side of the aisle is to remind yourself that people who are not Hillary Clinton are also running. It is hard to remember this. Lincoln Chafee wants us to use the metric system, so can we really rule him out? (This would be a good slogan for Chafee if anyone knew he was running.) I would be more likely to remember that Martin OMalley were running if he had leaned into MOM-themed merchandise and tattoos earlier, but, alas, he has not. \"Martin OMalley  you might already have his initials tattooed on your bicep!\" would have worked well. Bernie Sanders has actually managed to convince people he exists, a remarkable feat, but I would still prefer some sort of KFC-adjacent slogan, such as \"Sanders  hes no chicken!\", Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. A good mnemonic suggested to me by a source that definitely at no point attempted to lasso me with rope was, \"Hillary! Hillary! No one else is running.\", GOP Candidates:, 1. (sung to the tune of \"Frere Jacques\") CHRISTIE PERRY CHRISTIE PERRY PAUL BUSH CRUZ PAUL BUSH CRUZ CARSON FIORINA CARSON FIORINA RUBIO (Unfortunately, this is only half the field, but you can do the other half, too, with a little sleight of hand.) TRUMP SANTORUM TRUMP SANTORUM HUCKABEE HUCKABEE JINDAL GRAHAM PATAKI JINDAL GRAHAM PATAKI WALKER SOON, 2. \"BCCCFGHJPPPRST!\" which is conveniently also the sound your head makes hitting your desk after seeing all these names. 3. Clumping: Your brain apparently remembers things better in clumps, which is why we keep our phone numbers in those handy strings of three or four digits. (Who am I kidding? The last time someone remembered a phone number was in the late 90s.) This being so, how about: Triple-C, Triple-P, BF-GH-RST! And Jindal!, 4. Whole Sentences: Inspired by that planetary mnemonic sentence, \"My Very Educated Mother Just Sat Upon Nine Porcupines,\" how about: \"Compassionate Conservatives Just Cannot Stand This Purportedly-Foreign-Born President! Gays? Poo! RRRR!! Hisss!!\" or \"Help! Rabid Grizzlies! For Petes Sake, Call Someone! Please! Call The Police! Just Call!\" or \"How Can Chris Christie Still Run For President Post-Bridge-Gate? Thanks, Jersey!\" or \"Considering Chances, Hillary Clinton Feels Justly Great. Boy Howdy, They Picked Some Peculiar People.\", 5. Visualization: Imagine a hot tub. Now picture the 14 people you would least like to climb into the hot tub with you. 6. Trauma: A good way to be mildly traumatized by any of the candidates to the point that you might remember them is to turn on the TV and see how many of them there are. Dont traumatic experiences help you remember things?, 7. Memory House: Apparently this is a technique people use to remember things. Imagine you are walking through the White House. Now Carly Fiorina leaps out at you from behind a fern! Oh no, here comes Rand Paul and hes holding a welding torch! You walk further down the hall and theres Mike Huckabee with a candlestick. As you run to escape him, Rick Santorum comes sliding down the banister. And whos that trying to blend into a portrait of Thomas Jefferson? Is it Marco Rubio? No, its Jeb Bush! You pass what you thought was a knight in a suit of armor, but the visor opens and Ted Cruz peers out. Suddenly, BATS! You beat them off and see Donald Trump fly away into the night. How are there still six more candidates left? You cant do this anymore. An even greater tragedy is that when Scott Walker enters the race in just a week, this mnemonic will be completely obsolete. Sigh. Washington Post, Alexandra Petriwrites the Washington Posts ComPost blog, offering a lighter take on the news and opinions of the day. She is the author of \"A Field Guide to Awkward Silences\".]", "Date": "20150713", "Author": "[ Alexandra Petri]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-2016-presidential-candidates-20150713-story.html", "Title": "[ How to remember all the people running for president in 2016]"}