{"Content": "[ Chicagoans who pay to stream movies and music from services like Netflix and Spotify will now need to fork over an additional 9 percent for the privilege, as will Chicago businesses that pay to use everything from real estate to court databases online, under a decision the city quietly made recently to expand its taxing power. The added costs are the result of a ruling by the city Finance Department that extends the reach of ordinances governing two types of taxes  the city amusement tax and the city personal property lease transaction tax  to cover many products streamed to businesses and residents alike. The city expects the June ruling to bring in about $12 million each year in the latest example of Mayor Rahm Emanuel relying on boosting various smaller fees and fines to try to help close the citys yawning budget hole. Companies will have until Sept. 1 to begin paying the taxes, but the changes allow for them to start collecting them sooner, according to the new rules. Companies that deliver cloud-based services will be responsible for collecting taxes from their Chicago customers, according to the rules, and those eligible to be taxed cover a broad spectrum. \"In an environment in which technologies and emerging industries evolve quickly, the City periodically issues rulings that clarify the application of existing laws to these technologies and industries,\" mayoral spokeswoman Elizabeth Langsdorf said in a statement issued Wednesday. \"These two rulings are consistent with the Citys current tax laws and are not an expansion of the laws. \"These ensure that city taxation is uniformly and fairly applied and that businesses are given clear guidance on the applicability of the Citys tax laws to their operations, and they clarify that the amusement tax and personal property lease tax apply to digital services.\", Chicagoans who pay to stream movies and music from services like Netflix and Spotify will now need to fork over an additional 9 percent for the privilege. The city expects the June ruling to bring in about $12 million each year according to the Chicago Tribune. July 1, 2015. (WGN TV), Chicagoans who pay to stream movies and music from services like Netflix and Spotify will now need to fork over an additional 9 percent for the privilege. The city expects the June ruling to bring in about $12 million each year according to the Chicago Tribune. July 1, 2015. (WGN TV), According to the Finance Department changes, the 9 percent amusement tax, which has mostly been tacked onto tickets to concerts and sporting events, also now applies to paid subscriptions for streamed digital music and to streamed rental movies or TV shows, and \"for the privilege of participating in games, on-line or otherwise,\" if the person paying to receive the data is in Chicago. The expansion of the amusement tax does not apply under this new interpretation to music, movies or games that are bought electronically, such as individual albums, songs or movies bought on iTunes. A Netflix spokeswoman confirmed that the company will pass the additional cost onto subscribers but said no other details were available. The personal property lease transaction tax expansion also applies to professional services, like electronic property databases real estate agents use, court case databases lawyers rely on and various financial information networks. Ald. Ameya Pawar, 47th, said the tax expansion is a sensible way for the city to hold online businesses to the same standards as bricks-and-mortar stores in Chicago. He said the Emanuel administration has been clear that it was looking for ways to use existing statutes to try to even the playing field. \"A lot of these online companies, their whole business model seems to be to get around the tax code, and to me thats no business model at all,\" Pawar said. \"This is a step toward trying to correct that situation, and toward making sure the existing code reflects the realities of the marketplace.\", Michael Reever, vice president of government affairs at the Chicago Chamber of Commerce, criticized the rulings, particularly in the context of what it means to be a business in Chicago. He referred to Wednesdays increase in the minimum wage in the city and the proposed Cook County sales tax increase as additional burdens. \"This is one piece of a whole picture that impacts why businesses would not want to locate here,\" Reever said. He also took issue with the approach of finding new, smaller revenue streams rather than seeking a comprehensive fix to the citys larger fiscal problems. Reever said his group would continue to look at the issue but that legal action had not been discussed. \"I think they have taken the existing lease transaction tax and existing amusement tax as far as you can take them,\" said Michael Wynne, a partner and attorney in the Chicago office of the law firm Reed Smith. He expressed concern that the tax expansion, applied in a city already known for high taxes and fees, could be enough to push residents and companies to find ways to dodge them. Since the taxes will be levied based on Chicago billing addresses, Wynne said theres nothing to stop people and businesses from moving outside the city limits or listing billing addresses in other towns. \"Lets say I sign up for streaming business data in the city but I have offices throughout the country,\" Wynne said. \"I will definitely make sure my billing goes through a different office.\", The only way to access data without incurring the personal property lease transaction tax is to do it passively, such as by watching a stock ticker, he said. Anything that requires a user to do a search or make a request is subject to the tax. \"There is nothing you can access thats not taxable,\" he said. Shawn Carpenter, co-founder and CEO of the Chicago-based financial software company YCharts, said he has expected this sort of tax for a few years and knew he would have to factor it into the cost of doing business. He has no plans to leave Chicago, but he isnt pleased with the trend. \"We already have a fair amount of expense with various regulations,\" Carpenter said. \"As more and more get added, it makes it that much tougher to do business.\", He said YCharts has customers all over the world and that he hopes collecting taxes from those in Chicago wont be a complex process. Carpenter said he does not yet know how YCharts will do that. Emanuel has turned repeatedly to increasing smaller taxes and fees to help fill the citys coffers. Last month he introduced a plan to require off-site parking companies at Chicagos airports to share their revenue with the city in exchange for pickup privileges at OHare and Midway airports. The mayor also has tried targeted fee increases on parking at downtown garages, cable TV taxes and telephone line 911 costs, among others. That approach has allowed him so far to avoid increasing broader, potentially more politically unpalatable taxes but runs the risk of making Chicagoans feel like hes nickel-and-diming them. jebyrne@tribpub.com, aelahi@tribpub.com]", "Date": "20150702", "Author": "[ John Byrne, Amina Elahi]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-cloud-tax-met-0702-20150701-story.html", "Title": "[ Chicago extends taxing power to online movies, music, more]"}