{"Content": "[ When Gary voters show up either at the Genesis Convention Center for early voting or at their neighborhood polling place on May 5 to vote in the primary, it might take Democratic voters a while to get through the Common Council at-large ballot. There are 10 Democrats running for the nomination for three at-large posts. With only two Republican candidates for the partys nomination for three slots, there is no contested race. The GOP candidates  former city court judge Douglas Grimes and engineer Jayson Reeves  will wind up running in the Nov. 3 general election against whichever three of the Democratic Party candidates come out on top May 5. Sharon Mallory, a community activist who helped to coordinate a series of debates that gave residents a chance to question council hopefuls, said she considers the at-large position of particular importance because those three officials will represent Gary city interests as a whole. She said they serve as a go-between role from the mayor to the council members who represent specific districts. \"They are ancillary tentacles to the mayor,\" she said. \"They are the closest part (of government) to the mayor, and it is important to understand what those candidates are feeling about the issues.\", There will be at least one more debate-like forum for those candidates. WLTH-AM radio will hold interview programs all next week with the council and mayoral candidates in their downtown Gary studios. The at-large council candidates currently are scheduled to appear on the air on April 30. Several candidates for the three at-large positions on the Gary Common Council up for election on May 5 said theyd like to bolster the police and fire departments in Gary as a way of helping to improve the local quality of life. Those improvements went so far as some candidates suggesting pay... Several candidates for the three at-large positions on the Gary Common Council up for election on May 5 said theyd like to bolster the police and fire departments in Gary as a way of helping to improve the local quality of life. Those improvements went so far as some candidates suggesting pay... As for the at-large positions, current Council President Kyle Allen and Vice President Ronald Brewer are seeking re-election. But long-time council member Roy Pratt is retiring  creating at least one spot for a new person on the council. That is why Ragen Hatcher  the daughter of long-time Mayor Richard Hatcher and a council member in her own right from 2008-12  is hoping for a political comeback. Shes not alone in hoping a family name means something. Irene King, the wife of former Mayor Scott King, also is on the ballot. Hatcher said she thinks her past political experience is a plus because she thinks she often challenged the government structure. \"I would vote yes (on an ordinance before the Common Council) if it was good for Gary,\" she said. \"That wasnt always the case.\", She also said she would try to serve as the council member willing to provide explanations to the public about what the various ordinances written in arcane legal language actually mean. \"I (will) work hard to inform constituents and to vote appropriately.\", Three people are vying for the Democratic 7th Ward seat nomination, currently held by Councilman Ron Widing, in the May 5 Democratic primary. Widing, an employee of the towns public works department, cant run for re-election under new state rules. Candidate Nathaniel Cain said public safety is... Three people are vying for the Democratic 7th Ward seat nomination, currently held by Councilman Ron Widing, in the May 5 Democratic primary. Widing, an employee of the towns public works department, cant run for re-election under new state rules. Candidate Nathaniel Cain said public safety is... But Allen said there is a degree to which council members must cooperate if things are to be accomplished. \"Were joined at the hip, and we have to be able to work together,\" he said. Richard Ligon, a parole officer and long-time Army and Army Reserves officer who is going about campaigning and emphasizing his title of \"colonel\"  the rank to which he rose during 36 years of military experience, also is on the ballot. He says he thinks city government should support policies and programs that help develop youth into respectable citizens. \"We need to make sure families come first,\" he said. Attorney and former federal prosecutor MacArthur Drake is seeking an at-large post, as is Calumet Township member Alter Jean Moss and Jason Arndt, who moved to Gary 10 years ago, says he has fallen in love with the city and is now raising his family there. Moss said she wants to encourage community involvement, saying people need to take a stronger interest in Gary if the municipality is to improve. She also said local government officials need to pay stricter attention to where money is spent to ensure it is not wasted. \"We need to put money where money is supposed to go,\" Moss said. \"We are the people who make the (city) budget.\", Paris Harris and Carlos Tolliver are filling out the Democratic primary ballot for an at-large council post. Gregory Tejeda is a freelance reporter.]", "Date": "20150424", "Author": "[ Gregory Tejeda]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-gary-at-large-st-0426-20150424-story.html", "Title": "[  Voters have 10 Dem choices in Gary at-large council race]"}