{"Content": "[ Donald Trumps financial disclosure report shows that the Trump International Hotel & Tower Chicago has generated about $43.3 million in condo sales and more than $5 million in rent since the beginning of 2014. The 92-page disclosure report, released Wednesday by the Federal Election Commission, showed that Trumps wealth is derived from a diverse portfolio: gold, real estate, casinos, golf courses, a vineyard, pageants, a menswear line, mattress sales, book royalties, a Screen Actors Guild pension, hefty speaking fees and big-name stocks. The Republican presidential candidate is a member and president of 401 North Wabash Venture LLC, which owns residential and commercial real estate and received the Chicago condo sale proceeds and rents, the report said. The riverfront skyscraper opened in 2008. Two multimillion-dollar loans were taken out on Trumps Chicago property in 2012, the report said. A term loan from Deutsche Bank Trust Company Americas was made in the range of $25 million to $50 million, the report said. The note has a variable interest rate and matures in 2024. A second loan was for more than $50 million. Trump is a member and president of Chicago Unit Acquisition LLC, the New York based-creditor on the larger loan, the report said. The interest rate on the larger loan is the prime rate plus 5 percent. Another Trump concern, Trump Chicago Hotel Manager LLC, took in more than $1.8 million in management fees, the report said. Prompted by Donald Trumps rants about Mexican immigrants and his comments questioning Sen. John McCains status as a war hero, readers have emailed me with a question:, Is now the time for Mayor Rahm Emanuel to force the bloviating, bombastic New Yorker to take down the ugly sign on his Chicago... Prompted by Donald Trumps rants about Mexican immigrants and his comments questioning Sen. John McCains status as a war hero, readers have emailed me with a question:, Is now the time for Mayor Rahm Emanuel to force the bloviating, bombastic New Yorker to take down the ugly sign on his Chicago... In addition, Trump Chicago Residential Manager LLC took in more than $500,000 in management fees, according to the report. The two management companies also are based in New York. Trumps report was filed July 15. In their financial disclosures, presidential candidates must state income received beginning in the preceding calendar year up to the date of filing the report, an Office of Government Ethics spokesman said. That means Trumps report covers all of 2014 and part of 2015. The report also shows that Trump has investments in a handful of Illinois-based firms, including Boeing, Caterpillar, Kraft Foods Group and McDonalds. kskiba@tribpub.com, Twitter @KatherineSkiba]", "Date": "20150722", "Author": "[ Katherine Skiba]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-trump-chicago-holdings-met-07-23-20150722-story.html", "Title": "[ Donald Trump's financial disclosure report lists Chicago holdings]"}