{"Content": "[ The Tribune Editorial Board has expressed skepticism about the Iran nuclear deal. An editorial Sundayclaimed that the deal allows Iran to keep secret some of its earlier nuclear weapons program and hinders full access to nuclear sites by the International Atomic Energy Agency. Unfortunately, the Tribune editorial cites problems that dont exist and demands new conditions that arent necessary. Let me explain. This deal between the United States and other great powers and Iran commits Iran not to develop or acquire a nuclear weapon. President Barack Obama and, I expect, future presidents will hold Iran to this commitment. Congress shares this resolve. The Joint Comprehensive Plan of Action, commonly known as the JCPOA, provides the tools to follow through by preventing Iran from producing or stockpiling the necessary weapons-grade material for a considerable period, substantially enhancing compliance verification measures, and preserving administration and congressional options for a response diplomatically, economically and, if necessary, militarily. It expands the current two- to three-month breakout period to at least a year  enough time for a strong allied preventive response  and will not provide sanctions relief until Iran complies with the nuclear restrictions in the JCPOA. Quite the opposite of enabling Iran to move to a bomb, it pulls Iran away from the threshold of being able to do so. The unity of purpose by the signatories  China, Russia, France, Germany, the United Kingdom, the European Union and the United States  should not be underestimated. \"They have to do it. It will be done. If theres going to be a deal, it will be done.\", Secretary of State John Kerry on Iran coming clean about its past nuclear weapons work, PBS, April 8, 2015. One of the bedrock principles of the nuclear deal with Iran is that international inspectors are supposed... \"They have to do it. It will be done. If theres going to be a deal, it will be done.\", Secretary of State John Kerry on Iran coming clean about its past nuclear weapons work, PBS, April 8, 2015. One of the bedrock principles of the nuclear deal with Iran is that international inspectors are supposed... It is rooted in a self-interest in preserving a strong nonproliferation regime based on the Nuclear Non-Proliferation Treaty. It was this unity of the international community that imposed severe economic sanctions on Iran for the purpose of forcing negotiations that would eliminate the Iranian nuclear weapon threat. This gives us confidence that the international community would again be united in a swift and strong response to Iranian cheating toward a nuclear weapon. The flip side is that a unilateral undercutting of the JCPOA by the United States would instantaneously squander our position of advantage gained through years of diplomacy. The deal is based on sound science. I spent 40 years on the nuclear physics faculty at the Massachusetts Institute of Technology and drew heavily on the nuclear expertise built up over decades in the Department of Energys national laboratories, including the Argonne National Laboratory. The JCPOA blocks Irans pathways to the nuclear material needed for a nuclear weapon. It drastically reduces Irans enriched uranium stockpile, currently enough for at least 10 weapons, by 98 percent and eliminates all stockpiled 20 percent-enriched uranium not required for its current research reactor. The latest Quinnipiac poll shows that the American public rejects President Barack Obamas Iran deal by more than 2-to-1. This is astonishing. The public generally gives the president deference on major treaties. Just a few weeks ago, a majority supported the deal. What happened? People learned... The latest Quinnipiac poll shows that the American public rejects President Barack Obamas Iran deal by more than 2-to-1. This is astonishing. The public generally gives the president deference on major treaties. Just a few weeks ago, a majority supported the deal. What happened? People learned... It cuts back installed centrifuges by well over two-thirds, allows enrichment only with Irans least capable centrifuge for 10 years and nearly eliminates the extensive ongoing research and development program on the next-generation centrifuge for that period. Iran will convert the Arak reactor, capable of producing enough weapons-grade plutonium for one to two weapons per year, to produce an order of magnitude less plutonium. For added protection, Iran will send out of the country all spent fuel that could be used for plutonium production. It also establishes unprecedented verification measures. At all of Irans nuclear facilities, IAEA inspectors will have regular access with short notice. At undeclared locations, inspectors will have access in as few as 24 hours. If Iran tries to stall, this agreement provides a first: a process to provide access within a fixed time, 24 days  well within our window of high confidence to detect the traces of nuclear materials used. This includes military sites suspected of nuclear related activity. The IAEA will be able to use advanced monitoring technologies, many developed at U.S. labs. The Los Alamos lab also provides training courses for every IAEA inspector. As the director of national intelligence has said, while no agreement could give us 100 percent certainty, the JCPOA gives us better visibility into Irans program, providing a strong deterrent to cheating. The Tribune editorials characterization of secret side deals is a myth. The JCPOA requires Iran to finally cooperate with the IAEA to allow it to complete its work on the possible military dimensions of Irans previous nuclear activity and to carry out its responsibilities by Oct. 15. As with any country, the IAEA then works out a confidential protocol to carry out the needed inspections. The IAEA can then complete its report, which has been many years in the making, by mid-December for submission to its board of governors, including the United States. The entire global nonproliferation regime rests on countries willingness to share their sensitive nuclear information with the IAEA and in turn the assurance that the organization will safeguard that information. In order for the IAEA to accomplish its critical nuclear security and nonproliferation work in the 188 countries that are parties to the Non-Proliferation Treaty, the IAEA must uphold its reputation as an impartial and independent organization. Make no mistake, Iran was a nuclear threshold state before the negotiations, and this deal moves it back from that threshold. The United States remains the worlds economic, military and diplomatic leader, and Israel and the Gulf Cooperation Council countries remain our friends and allies in the region. This deal draws on that collective strength to ensure that Iran will never be allowed to have a nuclear weapon. U.S. Energy Secretary Ernest Moniz was a negotiator on the nuclear agreement with Iran. ]", "Date": "20150806", "Author": "[ Ernest Moniz]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-iran-nuclear-deal-moniz-obama-perspec-0807-20150806-story.html", "Title": "[ Ernest Moniz: Why the Iran deal will work]"}