{"Content": "[ Hillary Clinton is in deep, deep (I almost wrote \"yogurt\" but I really like yogurt) for her lies and pending investigations that will inevitably drag her down. Hillary can still save her fellow Democrats in 2016. But only if she quits the presidential race this minute and backs another candidate:, Oprah. Thats right: Oprah! 2016, And why not?, Yes, I know, as soon as you read that, you smacked your forehead, saying to yourself, \"This is an aha moment for me.\" Of course it is. And heres why it will work. Oprah Winfrey is the biggest of celebrities in a country that cares more about celebrity than anything. Shes beloved by women. Shes not loathed by men. Shes doesnt threaten anybody, like Hillary. Shes not some icy river. Shes warm and shes Oprah and people love her when she cries. But shes no pushover. Say some foreign ambassadors who hate America showed up in the Oprah Oval Office demanding nukes. Shed give them a nice slice of pie. Or a hug. What is the best lie that Hillary Clinton has ever told?, Can you pick just one?, Shes the inevitable Democratic presidential candidate even though 60 percent of Americans consider her a liar. So her pants suits are always on fire, and only a Hillary Meat Puppet would say otherwise. Yet rather than... What is the best lie that Hillary Clinton has ever told?, Can you pick just one?, Shes the inevitable Democratic presidential candidate even though 60 percent of Americans consider her a liar. So her pants suits are always on fire, and only a Hillary Meat Puppet would say otherwise. Yet rather than... But she wouldnt give them nukes. Shes not some moron. Just imagine if President Oprah were in office today. \"Can we have nuclear weapons please, President Oprah?\" the Iranian ambassadors might ask. \"And intercontinental ballistic missiles too? You promised!\", \"No, welcome to Oprah country,\" says Oprah, shaking her head, her hair bouncing, frowning first then flashing her brilliant smile. \"Death to America!\" the Iranians say. \"OK, now look under your chairs,\" Oprah will say. Theyll find prizes, like cosmetics or Pontiacs under there. Maybe even health care, or fabulous, fun-filled vacations. \"Thanks, President Winfrey!\" the ambassadors will say. \"Prizes! Prizes! We love you, Oprah!\", If Hillary is elected, well always have to worry about Bill. If youre not worried, then send your daughter to be his aide. But if Oprah is president, we wont have to worry about her longtime friend Stedman Graham. At least Stedman wont show up on \"The Ellen DeGeneres Show\" to do pushups, showing off his triceps, like Michelle Obama. Hell keep his mouth shut and walk the dogs the way men are supposed to. Many people are wondering how Donald Trump, for all his excesses and eccentricities, could be doing so well in the presidential primary polls. The answer to that mystery may be found right here in Illinois, where voters elected a low-rent Trump doppelganger as governor not once but twice. The parallels... Many people are wondering how Donald Trump, for all his excesses and eccentricities, could be doing so well in the presidential primary polls. The answer to that mystery may be found right here in Illinois, where voters elected a low-rent Trump doppelganger as governor not once but twice. The parallels... And another thing. According to her publicity agents, Oprah is kind. Hillary has been known to peel the bark off her husband when shes angry. And that fake-happy-but-really-angry Hillary laugh can curdle milk. \"I dont yell at people, I dont mistreat people,\" Oprah is credited with saying. \"I dont talk down to people, so no one else in this building, in this vicinity, has the right to do it.\", And America believed. Can Hillary say that? No way. America believes Hillary is ruthless enough and desperate enough to be president. But months of ruthless and desperate isnt really a good marketing plan for a campaign. Oprah is considered trustworthy. Hillary is considered a liar. And now inspector generals in the Obama administration are calling for investigations into Hillarys email scandal when she was secretary of state. They wont call for an investigation of the IRS targeting conservatives. But theyre calling for an investigation of Hillary. Just chew on that a piece. Hillarys poll numbers are dropping in key states like Colorado and Virginia, and Democrats know that a federal investigation will supply the media with meat for months. Now, I know that some of you more devoted Hillary supporters wont think much of my President Oprah idea. Some of you probably think Im not sincere. But I am, really. Other Hillaryistas must be saying, \"What difference, at this point, does it make?\", What difference? Well, the Democratic front-runner is in deep trouble, imploding. And while the punditocracy focuses the bright media lights on sideshow geek and Republican Donald Trump, its my duty to consider the Democratic field. Is Sen. Bernie Sanders an alternative to Hillary? Really?, I hate to tell you this, but presidential politics isnt a Frank Capra movie. You dont know Frank Capra? Dont worry about it. And Martin OMalley? Just the other day, a crowd of people even further to the left than OMalley  if thats even possible  demanded he agree with them that \"black lives matter.\", OMalley said yes, black lives matter, but he also dared to say \"all lives matter,\" as if all lives really do matter to the those crazies. He was shouted down, and OMalley crumbled like your Nonnas biscotti. He apologized for his foolishness in saying \"all lives matter.\", There is nothing as malleable as white liberals terrified theyll be denounced as racist by angry black protesters. If youre older than 12 and can read without moving your lips, you already know this. Enough said. Now dont get me started on that Vice President Joe Biden presidential fantasy. Biden has been allowed to say stupid stuff for years. Biden is the crazy uncle you keep locked in the basement except for holidays, and when you let him off the silver chain, he ends up throwing Jell-O at the guests. So if Biden runs for president, all that ridiculous video will come out, endless loops of years of absurd Bidenosities  him wondering about requiring an Indian accent to go into a 7-Eleven, warning black voters that Republicans will \"put yall back in chains!\", Thats too painful for the nation to bear. The Republicans have too many candidates, the Democrats have too few. The Republicans even have the Donald for now, and if theres one Democrat that can comb his hair, its Oprah. Hillary, admit it. Its time to step down. Its Oprah time. jkass@tribpub.com, Twitter @John_Kass]", "Date": "20150724", "Author": "[ John Kass]", "Link": "http://www.chicagotribune.com/news/columnists/kass/ct-hillary-oprah-kass-met-0726-20150724-column.html", "Title": "[ Move out of the way, Hillary. It's time for Oprah 2016]"}