{"Content": "[ Political decisions often are about standing on the right side of history, which is why South Carolina is confronting its treatment of the Confederate battle flag. So heres a related choice: Should America stand with a courageous patriot who led slaves to freedom on the Underground Railroad? Or with a slave owner who offered bounty hunters $50 for the return of a runaway, plus 10 bucks extra \"for every hundred lashes\" inflicted?, Hint: The fearless abolitionist is Harriet Tubman, an escaped slave who spied for the Union during the Civil War. The ruthless slave owner is Andrew Jackson, seventh president of the United States. The answer isnt difficult. Go with Tubman. The context is the long-overdue inclusion of a woman on Americas paper currency. From Washingtons face on the dollar bill to Ben Franklins on the $100 note, Americas bills are men-only. Women have been relegated to coins, such as the unpopular Susan B. Anthony dollar. Jacksons portrait is on the $20 bill, and its his slot that should go to a woman. The Treasury Department is under pressure to address the gender inequity, but the offer on the table by Treasury Secretary Jack Lew feels wrong. He plans to add a not-yet-identified womans portrait to the $10 bill, taking the spot held by Alexander Hamilton during the next scheduled redesign, due by 2020. Lew said Hamilton wont disappear; hell also be honored on the new sawbuck in some fashion. That would be a slap to Hamilton, the nations first treasury secretary and an author of the Federalist Papers, and a second-class honor for women. What, they need a chaperone?, The historic gain for women in landing a promised spot on U.S. paper currency stands to be a big loss for one founding father  and his supporters arent pleased. The announcement that a woman would grace a greenback for the first time in more than a century has been widely applauded. But the decision... The historic gain for women in landing a promised spot on U.S. paper currency stands to be a big loss for one founding father  and his supporters arent pleased. The announcement that a woman would grace a greenback for the first time in more than a century has been widely applauded. But the decision... There is nothing written in stone about who should appear on paper. The currency lineup changes over time. Andrew Jackson appeared on the $20 bill beginning in the late 1920s, replacing Grover Cleveland. Jackson also was once on the $10, until he was succeeded by Hamilton. Jackson is one of those historical figures whose status should be classified as \"its complicated.\" He was a hero of the War of 1812 who defeated the British at New Orleans. He also was a plantation owner and slave trader who fought several duels, killing a man. As president, he forced the relocation of Native American tribes. He also defended federal authority to keep the states in line and introduced the spoils system of patronage, which (hey!) makes him the patron saint of Chicago-style clouting. But what makes Jackson ripe for replacement on the $20 is the irony that he hated paper money. He believed in the gold standard and torpedoed the Federal Reserve of his time, the Second Bank of the United States. This reckless act set off the Panic of 1837. With the announcement last week by Treasury Secretary Jack Lew that there will be a woman on the $10 bill, I found myself daydreaming about all the new equality that will presumably come with such a historic and meaningful honor. Because, surely, with all the current economic problems were attempting... With the announcement last week by Treasury Secretary Jack Lew that there will be a woman on the $10 bill, I found myself daydreaming about all the new equality that will presumably come with such a historic and meaningful honor. Because, surely, with all the current economic problems were attempting... The idea for jettisoning Jackson gained traction through a grass-roots group called Women on 20s, which wants the change made by 2020, the 100th anniversary of womens suffrage. Lots of candidates have been suggested, including civil rights protester Rosa Parks, first lady Eleanor Roosevelt and Jeannette Rankin, the first woman elected to Congress. Tubman, who won the Women on 20s online poll, was a remarkable woman. An escaped slave from Maryland, she was a conductor on the Underground Railroad who returned to the South an estimated 19 times to free as many as 300 slaves. She packed a pistol and collaborated with John Brownin planning the Harpers Ferry raid of 1859, an attempted slave revolt. During the war she was a spy, scout and nurse for the North. In later years she advocated for education and womens suffrage. Lew said the government wants the publics input on the redesign of the $10, at thenew10.treasury.gov or on social media via #TheNew10. Tell him instead you support Tubman for the $20.]", "Date": "20150626", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-money-twenty-tubman-hamilton-jackson-20150625-story.html", "Title": "[ Currency conversion: Harriet Tubman for the $20 bill, not the $10]"}