{"Content": "[ Madison Street was calm on a recent weekday, the purr of passing traffic and the hiss of CTA bus brakes providing the rhythmic soundtrack of a city neighborhood. Vanished were the celebrating Blackhawks faithful, hugging and waving team flags in the middle of the cordoned-off street. In their place were residents waiting for the bus on the street corner and a young woman jogging past the glow of the exterior video boards of the towering United Center. \"2015 Stanley Cup Champions,\" they proclaimed. At a nearby park, kids wore bright red Hawks T-shirts, playing basketball and jumping rope. The action on the ice has taken a summer respite, and the neighborhood has returned to its natural cadences of daily commutes, summer camps and Bible study sessions. But activity at the United Center continues with an eye on the future. Construction has begun on a new six-story office complex, to eventually include a Hawks and Bulls team store, on the east side of the United Center. And the surrounding neighborhood, while still populated by weed-choked empty lots and boarded-up buildings, looks different than it did 10 and 20 years ago, with pockets of development popping up across the vicinity. On Thursday, Hawks Chairman Rocky Wirtz and Bulls Chairman Jerry Reinsdorf, who together co-chair the group that operates the United Center, sent Mayor Rahm Emanuel and other city and state officials a report titled \"The Economic Impact of United Center,\" touting the arena as a job and opportunity creator. The report, compiled by accounting firm KPMG, had been in the works for more than a year, and it was released publicly to coincide with Wirtzs appearance before the Chicago Tribune Editorial Board. There was no hidden motive behind the report, Wirtzs representatives said. It is meant to underscore the value of the arena to the city and the surrounding community, which the report says generates $2 billion in economic activity annually. Blackhawks Chairman Rocky Wirtz visited the Chicago Tribunes Editorial Board on Thursday to discuss his myriad business dealings, including operating the Stanley Cup champions. Here is Wirtz on some of the hockey-related topics discussed:, On a new practice facility for the Blackhawks: \"We want... Blackhawks Chairman Rocky Wirtz visited the Chicago Tribunes Editorial Board on Thursday to discuss his myriad business dealings, including operating the Stanley Cup champions. Here is Wirtz on some of the hockey-related topics discussed:, On a new practice facility for the Blackhawks: \"We want... Wirtz, though, said he wants to build a new practice facility for the Hawks that will double as a community center where local kids can learn to ice skate and exercise. In January, Emanuel, appearing at a news conference with the two owners to announce the office complex project, said the extension of a property tax break for United Center-related developments was off the table. Before the editorial board, Wirtz pitched the practice facility concept as another building block in the community. When fans came to the neighborhood 25 years ago, Wirtz said, \"being a blighted area might have been an understatement. No one talks today of going to the United Center and talking about your safety.\" Today, Wirtz said, families bring their children to games, free of concerns. Those in the community tend to agree that the neighborhood is on the upswing but said the trickle-down effect of hockey success has its limits. Gone are the liquor stores and grimy fast-food restaurants that populated the area around the old Chicago Stadium, before the United Center was completed with private money in 1994. A new sports apparel shop has opened near the United Center, but Madison Street and Damen Avenue are still a far cry from business meccas. A new sports apparel shop has opened near the United Center, but Madison Street and Damen Avenue are still a far cry from business meccas. A new sports apparel shop has opened near the area, and the corner of Madison and Ashland and Ogden avenues has seen a resurgence. Madison and Damen Avenue, however, are still a far cry from business meccas. To John Spence, the longtime custodian and member at Greater Union Baptist Church, on West Warren Boulevard nearly in the United Centers shadow, the biggest difference is the trash and discarded beer bottles on the ground outside. With the hockey fans gone, Spence said, \"I can rest a little bit.\", The success of the citys hockey team is generally good for the neighborhood, and many church members in the nearly all-black congregation who previously didnt pay attention to hockey now sport Hawks gear, Spence and the Rev. Willie Morris Jr. said. But whats good for the United Center  more parking lots, more restaurants catering to suburban fans, luxury accommodations for millionaire players and owners  isnt necessarily a good thing for the neighborhood, they said. Morris is resistant to the prospect of more bars, or any establishment that serves alcohol, coming to the area, especially in the coveted corner across the street from his church. There needs to be a balance, he said, between business development in the area that caters to sports fans and what is in the best interests of the residents who live and worship there year-round. \"The challenge is, how can we coexist?\" Morris said. Morris said more than one developer has pitched building a sports bar or pizzeria on Damen across from the church, but he and the other members of the church have pushed back, saying any place that would serve alcohol would harm the neighborhood, drawing people who cant control themselves, will purchase liquor for minors or because it will open the door for more crime. \"Certainly were for business, but business that wont bring any more destructive behavior from residents,\" Morris said. What the neighborhood needs, Spence said, are more service-oriented businesses like laundromats or cleaners that benefit residents going about their daily lives. Mike Quinlan, who lives a few blocks from the United Center, said aside from a few shops, the Hawks winning ways havent had much of an impact. \"The target market isnt the surrounding neighborhood,\" Quinlan said, \"its regionally based.\", And with public transportation access to the area spotty  the nearest \"L\" stop to the United Center is three-quarters of a mile away  Spence said \"its designed for you to come to the United Center, then you get in your car and you go home.\", The Hawks and Bulls tried to change that. But a proposed \"entertainment district,\" like those found near sports arenas in cities like St. Louis and Detroit, never got off the ground. Plans were scaled back to include the emerging office complex, scheduled for completion in a year and a half, and an atrium for fans. When staff moves into the office building, it will free up space inside the arena that may be used for other features, said United Center Executive Vice President Howard Pizer. In the report released Thursday, Wirtz and Reinsdorf said the United Center supports 21,000 jobs each year and in 2013 paid $35 million in city, Cook County and Illinois taxes. The arena, they said, generates about $115 million in additional tax revenue for the city, county and state. Wirtz said a new practice facility would be used sparingly by the Hawks, who usually practice only a few times a week during the season when the team is not on the road. The remainder of the time it could be used by community members. \"For all intents and purposes, its a community rink that the Hawks will occasionally practice at,\" Wirtz said. In previous discussions with Emanuel, Wirtz said the mayor has been \"very, very good\" in supporting the United Center plans. poconnell@tribpub.com, Twitter @pmocwriter]", "Date": "20150723", "Author": "[ Patrick M. O'Connell]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-uc-neighborhood-met-20150723-story.html", "Title": "[ Development around United Center skates onward]"}