{"Content": "[ I have one thing to say to Donald Trump, the newest Republican candidate for president: I am so, so, so very sorry. Over the years, I have made some unflattering remarks about Mr. Trump and his routine flirtations with a presidential run, never expecting he would actually throw his orange toupee (oops, I apologize for that) in the ring. But on Tuesday, the real estate mogul actually launched a campaign. When I heard him say those magical words  \"I am officially running for president of the United States\"  I emitted the kind of high-pitch squeal a child lets out when he unwraps the toy he always dreamed about but never thought he would receive. This changes everything. Donald Trump is running for president, and I want access. I want to be on the tastefully decorated campaign bus. I want a face-to-face interview with the candidate. I want to be there when he accepts the GOP nomination and when he unveils a neon \"TRUMP\" sign atop the White House. But to have any hope of entering Mr. Trumps inner circle, I must extend to him a heartfelt apology for the things Ive written in past columns. So here goes. Mr. Trump:, I want you to know I am deeply sorry for once referring to you as \"the honorable archduke of Egotown.\" That was historically inaccurate and unkind. I apologize for once suggesting that the First Amendment be updated to prevent you from tweeting. That was legislatively unlikely and, in retrospect, mean-spirited. On that same note, Im now embarrassed that I once suggested a constitutional amendment allowing President Barack Obama to take all of your money and leave you with \"a one-way plane ticket to a country we hate.\" I was likely under the influence of some hallucinogenic drug at the time, and I have since sought counseling. Referring to you as \"my personal financial adviser\" was a flat-out lie, and proposing a Kickstarter campaign that would pay for \"a cannon to launch Donald Trump into space\" was clearly out of bounds. Please accept my most sincere apology for both of those. I also once devoted a column to the theory that you were using the Trump International Hotel & Tower in Chicago to breed a race of warrior rhinoceroses that you would use to take over the world. While the evidence seemed compelling at the time, clearly none of that has happened at your lovely building, and I hereby retract the entire ludicrous column. Sorry for suggesting that you are \"dumber than a lobotomized ferret,\" \"an insufferable wretch\" and \"a braggart of inestimable proportions.\" Sorry I wrote that every time I see the giant \"TRUMP\" sign you put on your downtown Chicago skyscraper, I \"conjure an image of The Donald being eaten by a bear.\" And sorry that I suggested you skipped out on the last presidential race so you could devote more time to tweeting nasty comments from atop your solid-gold toilet. WASHINGTON  The balance sheet that Donald Trump used as a prop for his announcement Tuesday morning has impressive-looking numbers. But for those of us who deal with numbers for a living  and who have dealt with Trump in the past  his claim of a net worth of $8.7 billion as of last June makes... WASHINGTON  The balance sheet that Donald Trump used as a prop for his announcement Tuesday morning has impressive-looking numbers. But for those of us who deal with numbers for a living  and who have dealt with Trump in the past  his claim of a net worth of $8.7 billion as of last June makes... All of that was childish and utterly unprofessional. Please know I am deeply ashamed and ask only that you will consider giving me another chance. To that end, Id like to congratulate you on the insightful and engaging campaign launch speech you gave Tuesday in the lobby of Trump Tower in New York City. While I may have sent a tweet saying your hourlong speech sounded \"like it was plagiarized from an old drunk man mumbling to himself in a bar\" (sorry about that, I was not in my right mind), I have reviewed the transcript and actually think it was the finest campaign speech ever delivered. It was bold of you to address the issue of immigration early on by saying: \"When Mexico sends its people, theyre not sending their best. Theyre not sending you.  Theyre sending people that have lots of problems, and theyre bringing those problems with us. Theyre bringing drugs. Theyre bringing crime. Theyre rapists. And some, I assume, are good people.\", Your plan to win the Latino vote by suggesting theres a possibility that not all Mexican immigrants are drug dealers and rapists is brilliant and will set you apart from other candidates. Well done. Im sure many Americans also appreciated you letting us in on the fact that websites can be built for three dollars. In criticizing the high cost of the Obamacare website, you said: \"I have so many websites, I have them all over the place. I hire people, they do a website. It costs me $3.\", We look forward to taking advantage of your affordable website design company. That smart tip alone will win you votes. Also, you eloquently addressed the topic of your personal finances by saying, \"Im really rich.\" That proves to voters that you are a straight shooter, honest and really rich. I would consider the phrase a contender for your campaign slogan. You had the guts to point out that people who make political contributions are the only ones who get jobs because that \"is the way all jobs, just about, are gotten.\" (Sorry about my tweet that suggested you are a \"graduate of the Sarah Palin School of Saying Stuff.\" There is no such school, and even if it did exist, Im sure you would be accepted to a much more reputable institution.), Finally, you left us on a positive note by saying: \"Sadly, the American dream is dead.\" Outstanding. Im sure others were feeling the same emotion I was: hope. Hope that you, a really rich man, can un-dead the American dream, sort the good immigrants from the drug-dealing rapist immigrants and hook all of us up with supercheap websites and good jobs to have been gotten. Mr. Trump, I see you in a new light now, and I beg you to forgive me. And please  PLEASE  let me ride on your campaign bus. Sincerely,, Rex, rhuppke@tribpub.com]", "Date": "20150617", "Author": "[ Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-huppke-trump-presidential-campaign-20150617-story.html", "Title": "[ A deeply humble, profoundly contrite apology to Donald Trump]"}