{"Content": "[ I was on vacation the past couple weeks, spending time in Canada for three specific reasons:, 1) They put cheese curds and gravy on french fries and call it dinner. (They also call it poutine. How was this not invented by an American?), 2) You can ask for maple syrup anywhere and a bear will rush over and start pouring it in your mouth. 3) Donald Trump doesnt live there. (I assure you, those are not ranked in order of importance.), I assumed I would return, refreshed, to a country in which Trump  Americas car alarm going off for no reason  had faded from view and been overtaken by more serious presidential candidates. It looks like I shouldve stayed in Canada eating poutine with the maple syrup delivery bears. Not only is Trump very much still around, hes driving the conversation on the GOP side of things, goading his fellow candidates into awkward stances on everything from birthright citizenship and the 14th Amendment to the appropriateness of the term \"anchor babies.\", Republican front-runner Donald Trump rallied thousands of supporters in south Alabama by telling them: \"I would like to have the election tomorrow. I dont want to wait.\"\"I know how Billy Graham felt,\" he said Friday night as he addressed the largest crowd yet of his thriving presidential campaign.... Republican front-runner Donald Trump rallied thousands of supporters in south Alabama by telling them: \"I would like to have the election tomorrow. I dont want to wait.\"\"I know how Billy Graham felt,\" he said Friday night as he addressed the largest crowd yet of his thriving presidential campaign.... Hes not just leading the GOP field, hes within striking distance of Democratic front-runner Hillary Clinton  down only 6 percentage points  in a recent CNN/ORC national poll. To echo what the Canadian people, and probably many of their bears, are asking: How is this happening?, Its certainly not because Trump is laying out a concrete explanation of how hell manage immigration, which has become his signature issue/yelling point. On ABCs \"This Week\" on Sunday, host George Stephanopoulos repeatedly asked Trump for specifics on how he would round up and deport millions of immigrants who entered the country illegally. \"What are the specifics here?\" the host asked. Trump said: \"George, its called management.\", Thats as specific as he got. Its management, dummy. Ill just do it and itll work  next question. Trumps answer would make sense if all we demanded of politicians were one-word policy platforms. Viewed through the lens of Americas civil rights history, Donald Trumps new call to repeal birthright citizenship chimes with an ominous ring. Spoiler alert: It sounds like racism. It sounds like the Supreme Courts declaration in 1857 that African-Americans were \"so far inferior that they had... Viewed through the lens of Americas civil rights history, Donald Trumps new call to repeal birthright citizenship chimes with an ominous ring. Spoiler alert: It sounds like racism. It sounds like the Supreme Courts declaration in 1857 that African-Americans were \"so far inferior that they had... \"How will you improve the economy?\", \"Jobs!\", \"What about national security?\", \"Military!\", \"How will you deal with health care?\", \"Doctors!\", Historically, we have asked for a bit more than that, but Trump continues to impress, ostensibly because hes a straight shooter who thinks political correctness is for dumb loser meatheads. A New York Times article over the weekend looked at Trumps fans: \"Tellingly, when asked to explain support for Mr. Trump in their own words, voters of varying backgrounds used much the same language, calling him ballsy and saying they admired that he tells it like it is and relished how he isnt politically correct.\", The story quoted retired New York City police Officer Carl Tomanelli: \"People are starting to see, I believe, that all this political correctness is garbage.\", A recent Politico story quoted Bob House, a maintenance manager, saying of Trump: \"He tells it like it is. None of this political correct stuff.\", And, of course, Trump himself said during the first GOP presidential primary debate: \"I think the big problem this country has is being politically correct.\", Yes, clearly the big problem we face right now is an outbreak of Americans being too nice to each other. Thank goodness Trump has come along to call Mexican immigrants rapists and women he doesnt like dogs or disgusting pigs and anyone who disagrees with him a dope, a loser or, in the case of fellow candidate Sen. Rand Paul, \"a spoiled brat without a properly functioning brain.\", Saying that youre sick of political correctness is another way of saying, \"Im sick of using the part of my brain that keeps me from being a complete jerk.\" (Sorry if thats politically incorrect.) So what Trump has proved is what most already suspected: There is a sizable coalition of Americans who are jerks. (Again, sorry for the lack of political correctness.), If we all started walking around saying whatever popped into our heads, with no regard for how our words might offend others, the entire country would break out into an Old West-style saloon brawl within minutes. The reason we need political correctness is because there are people out there  you can spot them by looking for the \"Trump 2016!\" bumper stickers  who think being nice to other humans is a waste of time. Were it not for those people, political correctness wouldnt be called political correctness  it would just be called normal behavior. Come to think of it, that sounds delightful. If the other GOP candidates want to pull ahead of Trump in the polls and build a truly broad coalition, they need a different deportation plan: Round up all the Trump supporters and send them to Canada. (Sorry, Canada. Youre welcome, Canadian bears.), I realize it might not be politically correct to suggest deporting millions of people en masse, but sometimes you have to do whats best for the country. A sweeping jerk removal will make America a kinder, happier place to live. Granted, there might still be problems with jerks sneaking across the Canadian border to have babies on U.S. soil  anchor jerks  but we can deal with that later. And if asked how this jerk deportation will be accomplished, a candidate need only say: \"Management!\", Because apparently thats all it takes. rhuppke@tribpub.com]", "Date": "20150824", "Author": "[ Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-trump-immigration-huppke-20150824-story.html", "Title": "[  Deport Trump supporters? It might work.]"}