{"Content": "[ Mohammed Hamzah Khan, 19, rose before dawn on Oct. 4 to pray with his father and 16-year-old brother at their neighborhood mosque in Bolingbrook. When they returned home just before 6 a.m. the father went back to bed and the Khan teens secretly launched a plan they had been hatching for months: to abandon their family and country and travel to Syria to join the Islamic State. While his parents slept, Khan gathered three newly issued U.S. passports and $2,600 worth of airline tickets to Turkey that he had gotten for himself, his brother and their 17-year-old sister. The three teens slipped out of the house, called a taxi and rode to OHare International Airport. Khan was due at work at 6:30 a.m. at a local home-supply store, so he knew his parents wouldnt miss him when they woke up. The two younger siblings bunched up comforters under their sheets to make it look like they were asleep in their beds. Their plan was to fly to Istanbul, then drive into Syria to live in the Islamic homeland, or caliphate, established by the Islamic State, the militant group that has massacred civilians in Iraq and Syria and beheaded Western journalists and aid workers. The Khan teens, U.S.-born children of Indian immigrants, each left letters for their parents explaining their motives. \"An Islamic State has been established and it is thus obligatory upon every able-bodied male and female to migrate there,\" Khan wrote. \"Muslims have been crushed under foot for too long. ... This nation is openly against Islam and Muslims. ... I do not want my progeny to be raised in a filthy environment like this.\", Bollingbrook teens had a secret plan to join ISIS. (WGN TV), Bollingbrook teens had a secret plan to join ISIS. (WGN TV), His sister wrote: \"Death is inevitable, and all of the times we enjoyed will not matter as we lay on our death beds. Death is an appointment, and we cannot delay or postpone, and what we did to prepare for our death is what will matter.\", In their letters, all three teens, who had grown up playing basketball and watching \"Dragon Tales\" and \"Batman,\" told their parents how much they loved them and asked them to join them in Syria but made it clear they would probably never see them again, except in the afterlife. They begged them not to call the police. In the afternoon, FBI agents knocked on the Khans front door, armed with a search warrant. \"For what?\" asked the teens shocked father, Shafi Khan. \"Your kids have been detained at the airport, trying to go to Turkey,\" an agent said. \"We were stunned,\" said Zarine Khan, their mother. \"More like frozen. We were just frozen.\", The Khan teens are part of a growing number of young Americans who are joining or attempting to travel to Syria or Iraq to join the Islamic State. This year alone, officials have detained at least 15 U.S. citizens, nine of them female, who were trying to travel to Syria to join the militants. Almost all of them were Muslims in their teens or early 20s, and almost all were arrested at airports waiting to board flights. A senior U.S. official said the government expects more arrests. Authorities are closely monitoring Twitter, Facebook and other social media networks, where recruiters from the Islamic State aggressively target youths as young as 14. \"Their propaganda is unusually slick. They are broadcasting their poison in something like 23 languages,\" FBI Director James Comey said in a recent speech, adding that the terrorist group is trying to attract \"both fighters and people who would be the spouses ... to their warped world.\", When the Khan teens reached the airport, FBI officials were waiting for them. A U.S. law enforcement official said authorities had been monitoring the communications of at least one of the teens, although the FBI has not disclosed how they initially became aware of them. Mohammed Hamzah Khan has been charged with providing material support to a designated terrorist organization and faces up to 15 years in prison. At a federal court hearing last month, a judge ordered him held without bail, calling him a flight risk and a danger to the community. His two siblings, minors whose names have not been made public, were released to their parents but are under investigation and could face charges. The Justice Department is not eager to prosecute juveniles, but it will do so when they are so radicalized that they pose a potential threat, a senior U.S. official said. \"There are not a lot of good options,\" the official said. \"You will see more young and juvenile cases in the future.\", In court last month, Assistant U.S. Attorney Matthew Hiller said Khan and his two siblings \"believe they are religiously obliged to support violent jihad.\", \"This was not a spur-of-the-moment trip but rather a carefully calculated plan to abandon their family, to abandon their community, and abandon their country and join a foreign terrorist organization,\" Hiller told the judge. He said Mohammed Hamzah Khan was \"attempting to join an organization that has called for attacks against the United States and has already killed U.S. citizens and is dedicated to genocide.\", But Khans lawyer, Thomas Anthony Durkin, told the judge that the government was prosecuting Khan for what amounted to the \"thought crime\" of rejecting America and supporting the establishment of an Islamic homeland. He said the Khan teens wanted to go live in that homeland but not become fighters, a desire that he said was naive and misguided but not criminal. Durkin cited a speech President Barack Obama gave in September at the United Nations, where he said the Islamic States \"propaganda has coerced young people to travel abroad to fight their wars and turned ... young people full of potential into suicide bombers. We must offer an alternative vision.\", \"This is the alternative vision were getting today: jail,\" Durkin told the judge. \"If we want to solve this problem, we are not going to solve it by threatening to lock people up forever. ... We have to find a solution, because these are American children. ... They are not barbarians. They are our children.\", Khans parents, in an interview at Durkins Chicago law office one recent evening, said they were bewildered by what their children tried to do. \"What they wrote in those letters is not from us,\" Zarine Khan said, her voice rising behind a colorful veil that covered her face, except for her eyes. \"Those are not our teachings. Thats not what we believe in. This didnt even come from our family, friends, neighbors, nobody.\", \"We tried to be the best parents we could,\" she said. \"Thats all I can say, we tried our best. And they are good kids. This thing came out of the blue. We are still trying to figure it out.\", Mohammed Hamzah Khan grew up in a suburban American home with pretty shrubs out front and a basketball hoop in the backyard. He earned a Presidential Physical Fitness Award in eighth grade and loved Naruto, the Japanese manga. He volunteered at his local mosque and represented Argentina in the National Model United Nations. He graduated from a local Islamic high school in 2013 and enrolled last year at Benedictine University, a Roman Catholic school about 10 miles from his home, where he studied engineering and computer science. Shafi Khan, who came to Chicago from India almost 30 years ago, and Zarine Khan, who followed her husband 20 years ago, said they consider themselves \"average\" Muslims, no more or less religious than any of their friends and neighbors in Bolingbrook, a suburb of about 73,000 people southwest of Chicago. They try to pray five times a day but said they often dont. Shafi Khan wears a bushy beard and a white knit skullcap, which he said is an attempt to follow the example of the Prophet Muhammad. Zarine Khan covers her head and most of her face, which she considers a sign of modesty, not extreme piety. Like millions of American Muslims, the Khans, who are both U.S. citizens, said they have raised their children to love their country and their religion. Shafi Khan, 48, earned a degree in environmental science from Northeastern Illinois University and has worked for many years as an event planner for a humanitarian aid organization. Zarine Khan, 41, studied genetics and microbiology at an Indian university but gave it up to move to Chicago with her new husband. They have four children: the three who were arrested, plus a 3-year-old girl. Zarine Khan has worked for many years as a teacher at a local Islamic school. The Khans tried to shield their children from unwanted influences. They had a TV when the children were younger, but they had no cable service. The TV was used solely for showing DVDs, mainly cartoons and educational JumpStart CDs from the public library. When Mohammed was about 8 years old, the family got rid of the TV, because by then they had a computer with Internet access, which the parents carefully monitored, they said. The children were allowed to watch cartoons and read news online, but they were not allowed to browse the Internet by themselves. \"We didnt want to expose them to adult stuff,\" Zarine Khan said. \"We wanted to preserve their innocence. We wanted to channel their intelligence into their studies and to becoming good human beings.\", The children studied at a local Islamic school, which offered a standard U.S. curriculum of English, math and science but also classes on Islam. The Khans daughter, who turned 18 shortly after her arrest, was being home-schooled by her mother so she could graduate early from high school and begin studies to become a physician. All three Khan children also became Hafiz, which means they completely memorized the Koran in Arabic. Each went to Islamic school through the fourth grade, then spent the next 2 1/2 years immersed in all-day memorization classes, augmented by evening programs to keep up with basics such as English and math. The memorization process is common among Muslims and is not considered a sign of religious extremism, said Habeeb Quadri, principal of the Islamic school Mohammed attended until the fourth grade and who frequently writes and lectures on Muslim youth. Zarine Khan said the family took many vacations together, driving to Niagara Falls and Connecticut. She said they shopped at Wal-Mart and acted \"like any other normal American family.\", \"We tried to have them grounded and exposed to everything,\" Zarine Khan said. \"We tried to give them good morals. But it was not just Islam, Islam, Islam. We tried to expose them to different ideas as well.\", Omer Mozaffar, a Muslim community leader who teaches theology at Loyola University Chicago and the University of Chicago, said many Muslim families appear to have sheltered their children from the culture around them. He said that since the 1991 Persian Gulf War and especially since the attacks of Sept. 11, 2001, some Muslims have felt \"under siege\" in the U.S. communities where they live. \"Theres a defensiveness that compels parents to pull their kids out of everything,\" Mozaffar said. \"A lot of parents feel overwhelmed and dont know what to do, so they try to isolate their children.\", The process is often called \"cocooning,\" shielding children from as much American culture as possible, by banning TV, the Internet and newspapers and sending them to Islamic schools. \"Parents send them less for the Islamic tutelage and more for the sense of protecting them,\" Mozaffar said. \"They think American equals immoral, and theres a common belief that if its more strict, its more pious. This is something I have to preach against all the time.\", The result is often that American Muslim children find themselves caught between two worlds. They are American, but they feel their parents and their religious leaders trying to steer them away from American culture. That can leave them vulnerable to those who promise something better, a place where they are celebrated for their religion. And recently, that message often comes in the form of the network of anonymous, persuasive recruiters on social media who lure vulnerable youths to join the Islamic State. Quadri calls them \"Sheik Google.\", According to Shafi and Zarine Khan and court documents, the Khan childrens \"Sheik Google\" appears to have been a man with the nom du guerre Abu Qaqa, whom they met on Twitter. Mohammed Hamzah Khan and his sister both had Twitter accounts, which they accessed on their cellphones because their parents closely controlled their Internet use on their home computer. In court, Hiller, the prosecutor, said the Khan teens intended to meet with Abu Qaqa when they arrived in Turkey and then travel with him to Syria. Notes found by FBI agents searching the Khan house suggested the teens were ultimately headed for Raqqah, an Islamic State stronghold in Syria. Khans sister went by the Twitter name \"Umm Bara\" and signed her tweets with @deathisvnear. Prosecutors said that in May, she tweeted about watching an hourlong Islamic State propaganda video called \"Saleel Sawarim,\" which features photos and videos of beheadings and other gruesome violence. Hiller told the judge that on May 28, apparently after watching the video, she tweeted that she had reached \"The end of Saleel Sawarim,\" followed by emoticons of a heart and a smiley face. Hiller described her reaction to the video as \"twisted delight,\" which he presented as evidence that the Khan teens supported the Islamic States violence and intended to participate in it. Durkin said it was \"inflammatory nonsense to say somehow, because somebody downloaded that video, that somehow theyre dangerous to the community.\" He said the young woman wrote that her role in the caliphate would probably be to marry a fighter, not become one herself. The letters the three teens left behind were filled with rhetoric their parents said was so out of character it could only have come from Islamic State recruiters. \"I am ... obliged to pay taxes to the (U.S.) government,\" Mohammed Hamzah Khan wrote. \"This in turn will be used automatically to kill my Muslim brothers and sisters. ... I simply cannot sit here and let my brothers and sisters get killed, with my own hard-earned money. ... I cannot live under a law in which Im afraid to speak my beliefs. I want to be ruled by the Sharia (Islamic law).  Me living in comfort with my family while my other family are getting killed is plain selfish.\", He continued: \"We are all witness that the western societies are getting more immoral day by day. I extend an invitation to my family to join me in the Islamic States. True, it is getting bombed, but let us not forget that we didnt come to this world for comfort.\", Sitting in Durkins office while their two younger teens worked on homework in the other room, Shafi and Zarine Khan said they are struggling to understand how their children could write such things. Durkin would not permit interviews with the younger siblings. The Khans knew their kids were on Twitter and Kik, a messaging service, but they said they didnt know they were communicating with strangers overseas. The evening before the teens tried to fly away forever, Zarine Khan said, she and her daughter sat together putting henna dye on each other in celebration of the upcoming Eid al-Adha holiday. \"I think they were completely brainwashed by whatever online things they were reading,\" she said. \"I wouldnt want any parent to go through what we are going through; its a nightmare. We just thank God that our kids are with us here, and not over there.\"]", "Date": "20141209", "Author": "[ Kevin Sullivan]", "Link": "http://www.chicagotribune.com/suburbs/bolingbrook-plainfield/ct-chicago-islamic-state-met-20141208-story.html", "Title": "[ Bolingbrook teens' parents 'stunned' by Islamic State recruitment claims ]"}