{"Content": "[ Republican Wisconsin Gov. Scott Walker announced Tuesday that he formed a political organization to help boost a potential 2016 presidential run, the first concrete step toward a possible campaign that comes as others are also ramping up efforts to seek the GOP nomination. The tax-exempt group, Our American Revival, was formed on Jan. 16 and its website and Twitter accounts became public on Tuesday. \"Our American Revival encompasses the shared values that make our country great: limiting the powers of the federal government to those defined in the Constitution while creating a leaner, more efficient, more effective and more accountable government to the American people,\" Walker said in a statement. Walker has used rhetoric elsewhere, talking about \"our American revival\" in recent speeches to conservatives, including one Saturday night in Iowa. Walker, the 47-year-old son of a preacher, began his second term as governor this month and is best known for taking on public union rights four years ago. That fight led to Walker standing for a recall election in 2012, which he won, making him the first governor in U.S. history to survive such a vote. Creation of the committee caps a busy month for Walker as he considers a White House bid. Earlier this month he hired a strategist to oversee his work in Iowa and brought into his tightly-knit circle of advisers former Republican National Committee political director Rick Wiley. Walker said Wiley will oversee the newly formed organization, which could be a presidential campaign-in-waiting. Walker also is leaning on familiar faces to get the new organization up and running. The groups treasurer is Andrew Hitt, who worked for the Walker administration from January 2011 until late last year. Hitt spent more than two years in the governors office as a senior adviser and counsel, and later moved to the state Department of Health Services as a top aide. Another aide named on the IRS form is Molly Weininger, a vice president at Aspect Consulting, a Madison fundraising firm that has ties to Walkers campaigns. Likely presidential candidates have already started laying the groundwork for White House bids, especially current and former governors. Those officials lack federal campaign accounts that members of Congress already have in place, and those would-be candidates who call state capitals home are playing catch-up. Their rivals with day jobs in the U.S. House or Senate have been raising dollars in accordance with federal rules, not state ones. Former Florida Gov. Jeb Bush sparked the still-forming 2016 contenders with the announcement he was forming a political committee. Former Massachusetts Gov. Mitt Romney signaled to past donors that he, too, was considering a White House campaign. And just this week, New Jersey Gov. Chris Christie announced he also would be forming a federal political committee. Such political committees allow likely candidates to travel to early nominating states, hire the shell of a presidential campaign and meet with donors. Ostensibly, the committees are designed to help like-minded candidates, but in practice they help expected contenders build credibility. For instance, Sen. Marco Rubio of Florida raised $3.8 million through his committee, Sen. Rand Paul of Kentucky has raised $3.6 million and Sen. Ted Cruz of Texas has raised $2 million. All are considering White House bids and have sent millions more into early nominating states such as Iowa, New Hampshire and South Carolina. Associated Press]", "Date": "20150127", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/local/breaking/chi-wisconsin-gov-walker-forms-group-to-boost-possible-presidential-bid-20150127-story.html", "Title": "[ Wisconsin Gov. Walker forms group to boost possible presidential bid]"}