{"Content": "[ Debating Chris Christie is a formidable task because hes quick-witted, sharp-tongued and slightly intimidating. Those qualities helped him get the best of Rand Paul in the first Republican presidential debate. But Christies best weapon is one that may catch up with him: He never lets the truth get in his way. Earlier this year, Paul led a successful effort to end the National Security Agencys mass collection of Americans telephone records. During the debate, Christie was asked whether he stands by his assertion that Paul should be blamed if the United States suffers another terrorist attack. He does, of course: He is not one for second thoughts. Launching into a favorite soliloquy, Christie bragged that he is the only candidate \"who has prosecuted and investigated and jailed terrorists after Sept. 11.\" He said, \"We lost friends of ours in the Trade Center that day. My own wife was two blocks from the Trade Center that day, at her office, having gone through it that morning.\", And finally, he declared, \"I will make no apologies, ever, for protecting the lives and the safety of the American people. We have to give more tools to our folks to be able to do that, not fewer.\" He brought to mind Joe Bidens crack that Rudy Giuliani needed only three things to make a sentence: \"a noun, a verb and 9/11.\", None of Christies self-dramatization shed any light on the NSA program. But it made him sound like he has a deep understanding of the issue that is pitifully absent in Paul. When Paul invoked the Fourth Amendment, which forbids unreasonable searches and seizures, and urged the use of search warrants, Christie showered him in contempt. \"Listen, Senator, you know, when youre sitting in a subcommittee, just blowing hot air about this, you can say things like that,\" he snorted. When his rival derided him for allegedly hugging President Barack Obama, Christie once again played the 9/11 card: \"The hugs that I remember are the hugs that I gave to the families who lost their people on Sept. 11th.\", Chris Christie bills himself as the candidate willing to speak the truth even if his audience doesnt want to hear it. Opening his talk at Becks Sports Grill, he wastes no time inviting a negative reaction. \"The last time I was here was to go to the UNI-Dome,\" he recalls, referring to the University... Chris Christie bills himself as the candidate willing to speak the truth even if his audience doesnt want to hear it. Opening his talk at Becks Sports Grill, he wastes no time inviting a negative reaction. \"The last time I was here was to go to the UNI-Dome,\" he recalls, referring to the University... Paul was left lamely smirking. If it had been a boxing match, the referee would have stopped it before he suffered a fatal injury. But some arguments that look imposing in the heat of battle shrivel up under cold examination. What is clear from Christies claims about NSA surveillance is that he 1) doesnt know what hes talking about, or 2) doesnt care. The domestic phone records program amassed a vast pile of data that has been very useful in proving the uselessness of vast piles of data. In 2013, U.S. District Judge Richard Leon, appointed by President George W. Bush, found it to be not only unconstitutional but ineffectual. \"The government,\" he noted, \"does not cite a single instance in which analysis of the NSAs bulk metadata collection actually stopped an imminent attack, or otherwise aided the government in achieving any objective that was time-sensitive in nature.\", Obama appointed a panel of experts to assess the NSA program, which Bush started and he continued, and it reached the same conclusion. The information about terrorism it produced, said the group, \"was not essential to preventing attacks and could readily have been obtained\" through other means. Jeb Bush hadnt debated political foes since 2002. In the early months of this presidential race, hes at times seemed uncertain, out of practice. But in Thursday nights debate he spoke with candor and took risks. Why so? We credit the man to Bushs right, the carnival barker who  like or loathe... Jeb Bush hadnt debated political foes since 2002. In the early months of this presidential race, hes at times seemed uncertain, out of practice. But in Thursday nights debate he spoke with candor and took risks. Why so? We credit the man to Bushs right, the carnival barker who  like or loathe... A study by the New America Foundation, a centrist Washington think tank, concluded: \"Surveillance of American phone metadata has had no discernible impact on preventing acts of terrorism.\" Marshall Erwin, a former Senate Republican staffer who is now a research fellow at the right-of-center Hoover Institution, has testified, \"There does not appear to be a case in which Section 215 bulk phone records played an important role in stopping a terrorist attack.\", Paul didnt cite all this evidence in the debate, and even if he had, it might not have blunted the attack. Christie is not the sort to be rattled by the sudden appearance of verified facts. Nor is he trying to attract voters who demand evidence before granting the government more power in the name of fighting terrorism. He appeals to people who are impressed by a loud voice and an aggressive manner. He appeals to visceral instincts, not logic. The message he conveyed is that Paul doesnt know how to stop our enemies because hes had no contact with grim reality. Its an odd charge coming from Christie, whose remedy for terrorism works only in theory. Steve Chapman, a member of the Tribune Editorial Board, blogs at www.chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150816", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-chris-christie-rand-paul-nsa-metadata-telephone-perspec-0816-jm-20150814-column.html", "Title": "[ Chris Christie's fact-free attack on Rand Paul]"}