{"Content": "[ Cook County Democratic leaders are leaning against backing States Attorney Anita Alvarez as she seeks a third term against three potential challengers next March. During Tuesdays endorsement session, a panel recommended an \"open primary.\" A final decision will come Wednesday, but its rare for the party to reject a committee recommendation. County Board President Toni Preckwinkle is backing her onetime chief of staff, Kim Foxx, a former assistant states attorney who helped Preckwinkle lead an effort to lower the jail population and reform the juvenile justice system. Other committeemen backed Donna More, a lawyer who was a county and federal prosecutor and Illinois Gaming Board attorney. Cook County Commissioner John Fritchey, a former assistant attorney general and state representative, said hes running but did not ask for an endorsement. With the loyalties of ward and township committeemen divided, Preckwinkle suggested the open-primary recommendation. To get an endorsement, a candidate must secure more than half of the weighted vote of the committeemen. The weighted vote is determined by how well each ward and township turned out Democratic voters in the March 2014 primary election. If no candidate meets that mark, theres no endorsement. Alvarez, backed by House Speaker Michael Madigan of Chicago and 14th Ward Ald. Ed Burke, called herself \"the most innovative states attorney ever in the history of the states attorneys office,\" while also saying she would be \"the only Latina on this ticket.\", See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. See Chicago Tribune reports on Illinois Republican Sen. Mark Kirks bid for reelection next year and his early challengers including Democratic U.S. Rep. Tammy Duckworth and Chicago Democrat Andrea Zopp. Foxx played up her by-the-bootstraps life story as the daughter of a single mother living in the Cabrini Green housing complex. She touted her work for Preckwinkle. \"Weve seen what happens when you collaborate, when you are thoughtful and you think about not just crime and violence, but about community,\" Foxx said. More touted her prosecutorial and regulatory experience. \"Im running because it is time that we restore and rebuild our communities faith in how we prosecute crime and how we dispense justice,\" More said. The committee was able to make a recommendation for circuit court clerk, narrowly backing Dorothy Brown in her bid for re-election after calling 21st Ward Ald. Howard Brookins away from a lunch break and back into the room to put Brown over the top. But committeemen said that vote could change when all 80 committeemen vote  Wednesday. Jacob Meister, who also sought the court clerk endorsement, said afterward that he would be satisfied if committeemen chose to endorse an open primary in that race. Brown, long criticized for not bringing court records up to date for a digital age, said she was making progress in that direction and wanted to \"finish what we started\" in a fifth term. Meister said some work is still done with typewriters on carbon paper in an office that \"is broken and dysfunctional.\", Down the ballot, the committee backed incumbents Mariyana Spyropoulos and Barbara McGowen as well as Josina Morita for six-year terms on the Metropolitan Water Reclamation District of Chicago board. Theres also a two-year spot on the ballot, but the committee made no recommendation after hearing from former 31st Ward Ald. Ray Suarez, former Cook County Board President Todd Stroger and sustainability advocate Tom Greenhaw. On Wednesday, the Democratic leaders will consider candidates for U.S. Senate and comptroller. hdardick@tribpub.com, Twitter @ReporterHal]", "Date": "20150818", "Author": "[ Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cook-democrats-slating-met-0819-20150818-story.html", "Title": "[ Cook County Democrats fail to endorse in state's attorney race]"}