{"Content": "[ Well this spin certainly ought to put a damper on Sundays pride parades:, \"It is worth acknowledging what (proponents of same-sex marriage) have lost, and lost forever,\" wrote Chief Justice John Roberts in his dissent to the Supreme Courts 5-4 ruling Friday upholding the right of gay and lesbian couples to wed. That loss? \"The opportunity to win the true acceptance that comes from persuading their fellow citizens of the justice of their cause. And they lose this just when the winds of change were freshening at their backs.\", In time, I suppose, they will get over this loss. The sting of not having put their basic rights to popular or legislative votes in every single state and finally prevailing. The shame at having to settle for a resounding majority opinion concluding that gay couples \"ask for equal dignity in the eyes of the law (and) the Constitution grants them that right.\", The Supreme Court has denied gay people the opportunity to go from village to village, town to town all across America trying to win over those who regard them with contempt and disgust, who compare their loving relationships to bestial and incestuous couplings and argue that their agenda has nothing to do with love and everything to do with destroying the family. With Fridays ruling in Obergefell v. Hodges, same-sex couples are compelled to cancel their plans to engage in numerous poisonous debates with Bible-thumpers and hankie-twisters who equate legal recognition of their unions with the downfall of society as we know it, and describe those unions as unnatural affronts to God. Christie Jones, Teresa Moreno and Michelle Gregory react to the Supreme Courts ruling to legalizegay marriage in all 50 states in the Boystown section of Chicagos Lakeview neighborhood, Friday, June 26, 2015. (Antonio Perez, Chicago Tribune), Christie Jones, Teresa Moreno and Michelle Gregory react to the Supreme Courts ruling to legalizegay marriage in all 50 states in the Boystown section of Chicagos Lakeview neighborhood, Friday, June 26, 2015. (Antonio Perez, Chicago Tribune), Proponents of same-sex marriage will not be able to invest tens of millions of dollars and hundreds of thousands of work hours in grass-roots campaigns to achieve equality nationwide. And, in what was probably an inadvertent twist of this knife, Roberts trotted out, for one last, nostalgic spin, the \"What next? Polygamy?\" argument favored by the most desperate, sophomoric opponents of gay marriage. \"Although the majority randomly inserts the adjective two in various places, it offers no reason at all why the two-person element of the core definition of marriage may be preserved while the man-woman element may not,\" Roberts wrote. \"Indeed, from the standpoint of history and tradition, a leap from opposite-sex marriage to same-sex marriage is much greater than one from a two-person union to plural unions, which have deep roots in some cultures around the world. If the majority is willing to take the big leap, it is hard to see how it can say no to the shorter one.\", TheSupremeCourtdeclared June 26, 2015, that same-sex couples have a right to marry anywhere in the United States. , There is an answer to this argument. It has to do with the vast difference between same-sex marriage and plural marriage when it comes to social and legal implications and the civic reverberations that would make legalizing plural marriage a far bigger leap than the leap the court took Friday. But Justice Anthony Kennedys majority opinion effectively muzzled advocates who still want to counter the polygamy argument and its philosophical cousin, the \"Well, then, why cant a man marry his dog?\" argument by short-circuiting the debate. Sympathies tendered. The debate is over. Oh, sure, dead-enders will rail on talk shows and social media for a while. Isolated skirmishes will break out when assorted service businesses and local officials decline to enable same-sex weddings on religious-freedom grounds. But this is not one of those rare issues like abortion that will never resolve and fade away no matter what the Supreme Court says. Its more like the issue of integration of public schools, an idea that was deeply polarizing at the time of the 1954 Brown v. Board of Education ruling but opposed today only by the most virulent racists. That landmark opinion was unanimous, and any justice who had written a fretful, pointy-headed, obtuse, technical dissent explaining why it should be up to voters whether black children attended school with white children would soon have been recognized as one of historys fools. Thats why I wrongly predicted in April that the 2015 court would sense the gimlet eye of posterity over its shoulder and unanimously endorse marriage equality. I regret the error. But not as much as I expect Justice Samuel Alito or his descendants will regret the passage in his dissent where he stuck up for those unfortunate people now being compelled to loosen just a bit their hold on privilege and cultural domination:, \"I assume that those who cling to old beliefs will be able to whisper their thoughts in the recesses of their homes,\" he wrote, \"but if they repeat those views in public, they will risk being labeled as bigots and treated as such by governments, employers and schools.\", Imagine. People being marginalized simply for wishing to marginalize others. So much loss in such a great victory. Thanks for the mummeries, In his dissent, Justice Antonin Scalia derided \"the mummeries\" in the majority opinion. I had to look it up. Its defined as things that are \"absurd, false or ostentatious.\" Obviously a useful word for writing about Chicago and Illinois. On the download, The least adventurous podcasts I know are also some of the most useful: Audio feeds from the network newscasts. I listen most nights to Lester Holt on NBC  its commercial free and only 20 minutes long  and its surprising how little I miss the video. CBS and ABC have similar podcasts. Search for them on whatever podcast app you prefer. Retweets, This weeks winning offering in our reader poll is allusion of Steve Millers 1973 hit, \"The Joker.\", That song begins, \"Some people call me the space cowboy/Some call me the gangster of love/Some people call me Maurice/ Cause I speak of the pompatus of love.\", Thus @jwPencilAndPads winning tweet: \"Amount of people who called him The Space Cowboy: 1 The Gangster of Love: 1 Maurice: 4,783.\", If youre into the pompatus of Twitter, send email to ericzorn@gmail.com and Ill sign you up for the newsletter that alerts you when the weeks poll is posted. But I will not tell you what \"pompatus\" means because I dont know.]", "Date": "20150626", "Author": "[ Eric Zorn]", "Link": "http://www.chicagotribune.com/news/opinion/zorn/ct-supreme-court-john-roberts-gay-marriage--perspec-0628-20150626-column.html", "Title": "[ What same-sex marriage backers 'lost']"}