{"Content": "[ In the business of low political blows, gun rights advocate Wayne LaPierre reminds us of Hillary Clintons best not-so-secret weapon: her amazing ability to drive her rivals and critics nuts. \"I have to tell ya,\" said the National Rifle Associations executive vice president and CEO to thundering applause at the groups annual meeting Saturday, \"eight years of one demographically symbolic president is enough.\", Oh? Well, at least no one can say he was playing the race card or gender card. He was playing the \"demographically symbolic\" card, leaving it up to his audience to figure out whats so bad about being \"demographically symbolic\" anyway. One wonders, for example, what U.S. Sen. Marco Rubio thinks about that. The Florida Republican threw his own hat in the ring for president Monday with a speech loaded with demographic symbolism  and significance. Staged at Miamis Freedom Tower, a richly symbolic landmark for Cuban refugees from Fidel Castros Cuba  many of whom were processed at this \"Ellis Island of the South\"  Rubio spoke movingly about his own Cuban immigrant parents and a major theme of his political career: restoring the American Dream. The examples of his father, a bartender, and his mother, a maid, symbolized his message on income inequality, which has risen as a driving issue for both parties in this early stage of the presidential race. The 2016 presidential campaign is quickening, with candidates popping up like daffodils. If youre a political junkie, this will be one of those leap years you live for, when no incumbent president is up for re-election. If youre a concerned citizen, this should be an unusually stimulating and... The 2016 presidential campaign is quickening, with candidates popping up like daffodils. If youre a political junkie, this will be one of those leap years you live for, when no incumbent president is up for re-election. If youre a concerned citizen, this should be an unusually stimulating and... And, in ways that reminded me of President Barack Obama when he was a U.S. senator from Illinois and on the rise eight years ago, Rubio turned his comparative youth and inexperience into an asset against Clinton, who had declared her own candidacy a day earlier. \"Yesterday, a leader from yesterday began a campaign for president by promising to take us back to yesterday,\" he said. \"But yesterday is over, and we are never going back.\", He delivered that message so movingly that one almost could forget that on major issues like Obamacare, climate change and Obamas executive actions on immigration and Cuba, he favors what many reformers would call steps backward to the yesterday before Obama took office. But as a fresh face, a rising talent and a conservative who aims to reinvent government while many of his fellow Republicans want only to shrink it, Rubio stands out as a significant, not just symbolic, candidate. Like Obama before him, he beat long odds to win his 2010 Senate election and seems energized by the tough challenge he faces now. With that in mind, Clinton must feel a sense of deja vu about Rubios rapid rise. If her best ally is the tendency of her opponents to overreact in attacking her, which makes her look more sympathetic to others, her worst enemy could be overconfidence. Instead, she displayed excessive caution in the breathtakingly bland Internet video with which she announced her candidacy. More than two minutes of happy racially, ethnically, maritally, age- and gender-diverse Americans embarking on new ventures (planting a garden, starting retirement, applying for a new job, keeping the dog out of the trash, etc.) preceded Clinton announcing her new venture, which is her campaign for president. If anything, this launch of her campaign suffers from looking too pre-packaged. As a gauzy example of everything voters complain about in the age of slick, expensive advertising, it could make even Don Draper of AMCs \"Mad Men\" wince. But its early. Everyone knows that the former first lady, for all her accomplishments as a senator, secretary of state and advocate for various causes, lacks her husbands seemingly effortless ability to connect with audiences, big and small. Her strategy appears to be one of avoiding overexposure in these early stages while she works small crowds in Iowa and elsewhere from her van nicknamed \"Scooby Doo.\" Welcome the new cuddly Hillary, coming to a coffee shop near you. Meanwhile, as her path to the Democratic nomination appears to be even more devoid of strong opponents than it was in 2008, she can keep her speeches brief while Republicans make her and Obama the invisible opponents in the room. In other words, she can run a general election campaign, reaching out to moderate swing voters, while her Republican rivals battle each other for the opportunity to run against her. By then, she may have good reasons to feel overconfident, but shed best not let it go to her head. Shes snatched defeat out of the jaws of victory before. Clarence Page, a member of the Tribune Editorial Board, blogs at chicagotribune.com/pagespage. \"Culture Worrier,\" a collection of his best columns, is available in print and at chicagotribune.com/ebooks. cpage@tribpub.com, Twitter @cptime]", "Date": "20150414", "Author": "[ Clarence Page]", "Link": "http://www.chicagotribune.com/news/opinion/page/ct-hillary-clinton-marco-rubio-barack-obama-president-election-perspec-0415-jm-20150414-column.html", "Title": "[ Rubio evokes flashbacks of another young Clinton foe]"}