{"Content": "[ A report says the high-rankingFIFAofficial who allegedly made a $10-million payment central to a U.S. probe into soccer corruption is believed to be Sepp Blatters right-hand man, Jerome Valcke. The New York Timesreported late Monday that American law enforcement officials believe Valcke,FIFAssecretary general, transferred the money in 2008 to accounts controlled by Jack Warner, the former CONCACAF president andFIFAvice president who faces corruption charges in the U.S. The report cited unidentified law enforcement officials. American investigators believe the money was paid as a bribe in exchange for Warner and others voting to give the 2010 World Cup to South Africa. The Times said Valcke said in an email that he did not authorize the payment and did not have the power to do so. In a statement, aFIFAspokesperson said the payment was authorized by the then-finance committee chairman, perFIFAregulations. The chairman, Julio Grondona, died last year. The payment is at the heart of a probe by the U.S. Department of Justice that led to sevenFIFAmembers arrested last week and a total of 14 people named in a racketeering indictment accusing soccer officials of accepting more than $150 million in bribes. Blatter, who won re-election Friday for a fifth term asFIFApresident despite the scandal, has denied being the unidentified high-ranking official named in the indictment as having \"caused\" the payment. \"Definitely that is not me,\" Blatter said at a news conference. As defiant as ever, Sepp Blatter resisted calls to resign as FIFA president Thursday and deflected blame for the massive bribery and corruption scandal engulfing soccers world governing body. \"We, or I, cannot monitor everyone all of the time,\" Blatter said in his first public remarks on the crisis... As defiant as ever, Sepp Blatter resisted calls to resign as FIFA president Thursday and deflected blame for the massive bribery and corruption scandal engulfing soccers world governing body. \"We, or I, cannot monitor everyone all of the time,\" Blatter said in his first public remarks on the crisis... Former South African President Thabo Mbeki on Monday denied his government paid bribes to secure the World Cup. Danny Jordaan, the bid chief for the 2010 tournament, told a South African newspaper that the money was sent to Warners regional confederation to help with soccer development in the Caribbean. FIFAannounced earlier Monday that Valcke had canceled his planned trip to attend the opening of the Womens World Cup in Canada on Saturday \"due to the current situation.\", Associated Press]", "Date": "20150601", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-fifa-investigation-valcke-20150601-story.html", "Title": "[ Report: FIFA president's right-hand man believed to be behind $10M payment]"}