{"Content": "[ A new chapter in American politics has begun. Millions of Americans on the right and left have lost faith in their political parties, their government and even the economic system. Only 1 in 4 Americans is satisfied with the way things are going. Policy experts will offer various arguments why at least some of these people are wrong to feel this way, but the discontented will not tolerate arguments that amount to dont believe your lying eyes  or wallets. In politics, feelings are more important than hard numbers. Consider immigration. I still believe that immigration is a net benefit for America, but those benefits arent felt uniformly throughout society. Obviously, immigration is a huge boon to the immigrants themselves, something nobody disputes. Employers, whether in the tech sector or in agriculture, also reap disproportionate rewards. But for the typical consumer, the positive effects (cheaper food, construction, software, etc.) are hard to tie to the causes (the importation of cheaper labor). Meanwhile, the negative effects seem all too apparent, at least for many Americans. This is true not just for people who believe, accurately or not, that their wages are lower and jobs are more scarce because of immigration (legal and illegal), but also for people who dislike the cultural disruptions that come with millions of non-English-speaking migrants pouring into the country. Similarly, free trade has been an enormous boon to American consumers, but it doesnt feel like it, particularly to the workers who lost good jobs theyll never replace. I spent Monday morning struggling to come up with an elegant description of Donald Trumps first official policy paper, a six-page document on immigration. After more than a decade of writing about politics and public policy, this should have been easy. That experience did finally lead me to the... I spent Monday morning struggling to come up with an elegant description of Donald Trumps first official policy paper, a six-page document on immigration. After more than a decade of writing about politics and public policy, this should have been easy. That experience did finally lead me to the... Add in the very understandable impression that the government is lying about  and incompetent at  taking these problems seriously, and you have the perfect preconditions for a populist backlash. And thats exactly what we are seeing. On the left, U.S. Sen. Bernie Sanders of Vermont is unapologetic about his socialist views. He offers a searing indictment of modern capitalism and vows to transform the country. On the right, Donald Trump, the GOP front-runner, is equally unapologetic about, well, everything, but in particular his nationalism. He lacks the vernacular of your standard nationalist, but the message comes through. He boasts that he is the most militaristic person in the world. His favorite national security idea is to build a wall  and to punitively make Mexico pay for it. His second favorite idea is to use the U.S. military to take Middle Eastern oil at gunpoint (30 years ago, he wanted to seize Iranian oil; now its Iraqs oil where its under the control of Islamic State). If Donald Trump were president, he would have Mexico pay to build a wall along its 2,000-mile border to keep itself out. Hed block the billions of dollars that Mexicans illegally in the United States send home to their families. And prevent their children born in America from automatically becoming... If Donald Trump were president, he would have Mexico pay to build a wall along its 2,000-mile border to keep itself out. Hed block the billions of dollars that Mexicans illegally in the United States send home to their families. And prevent their children born in America from automatically becoming... In his just-released immigration plan, which is not the joke many of its critics claim, one of his core principles reads: A nation that does not serve its own citizens is not a nation. Any immigration plan must improve jobs, wages and security for all Americans. The first part is nonsense. A great many nations do not serve their own citizens; no one would seriously argue that North Korea or Panama isnt a nation. But the second part taps into a very real perception about the moment we are in. Millions of people are convinced that the system is rigged against them. We constantly hear that income inequality is our greatest problem, and yet the Democrats insist there is essentially no downside to ever more poor people coming here legally or illegally. Republicans concede that illegal immigration is a problem, but they have proven feckless at fixing it. What is fascinating is that although Sanders and Trump couldnt be more different culturally, their programs overlap a great deal. What right-wing people in this country would love is an open-border policy, Sanders said recently. Bring in all kinds of people, work for $2 or $3 an hour, that would be great for them. I dont believe in that. Trumps immigration paper states that real immigration reform puts the needs of working people first  not wealthy globe-trotting donors. Trump has said that theres little daylight between them on the issue of trade, while Sanders has praised Trumps favorable statements on single-payer health care. The establishments of both parties have proved pitifully inept in fending off their respective nationalist and socialist insurgencies. I suspect theyll eventually succeed. But I also suspect this is not the end of the challenge, merely the beginning. Tribune Content Agency, Jonah Goldberg is a fellow at the American Enterprise Institute and a senior editor of National Review. goldbergcolumn@gmail.com, Twitter @JonahNRO]", "Date": "20150819", "Author": "[ Jonah Goldberg]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-bernie-sanders-donald-trump-20150819-column.html", "Title": "[ Bernie Sanders and Donald Trump: Two peas in a pod?]"}