{"Content": "[ The heavily funded super PAC backing Republican Jeb Bush will spend at least $10 million on television time in the earliest voting presidential primary states, the first salvo in a massive TV ad campaign to support the former Florida governors bid for the Republican nomination. Officials with Right to Rise USA say they will buy time in Iowa, New Hampshire and South Carolina TV markets and on cable television in the three states. Ads are scheduled to begin in Iowa and New Hampshire on Sept. 15, in South Carolina a week later and then run continuously through the end of the year. The plan, shared by the group with The Associated Press prior to Mondays buy, is the first evidence of Right to Rise USAs major strategic spending of the roughly $100 million it had on hand last month. Its also the first major move by the group, which was developed by longtime Bush adviser and California ad maker Mike Murphy, to run alongside Bushs own campaign organization, which is bound by federal fundraising limits. \"We believe Jeb Bush has the strongest record of conservative accomplishments in the race, and we plan to tell that story,\" Paul Lindsay, communication director for Right to Rise USA, told the AP. The first ads will be positive spots promoting Bush in a field that includes 16 other major GOP candidates. They will resemble videos on the groups website, promoting Bush and his accomplishments as Florida governor from 1999 to 2007. One piece was taken from clips of Bush from the Aug. 6 Republican debate in Cleveland, Lindsay said. That does not mean the groups ads wont turn to criticizing Republican rivals once the first contests draw near. The group has already aired one online ad that points to Bushs release of decades of tax returns and publication of thousands of emails sent during his time as governor, to draw comparisons with Democratic front-runner Hillary Rodham Clinton, who recently turned over her private email server to the FBI under pressure. Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. To date, the group, based in southern California, has spent roughly $200,000 on online advertising. The new expenditure, which Lindsay described as an \"eight-figure\" buy, is significant because its the first big expense for the group that Bush helped raise more than $103 million to finance, and which is expected to perform other campaign functions in support of the former governor. Under Federal Election Commission rules, Bush, having declared his candidacy on June 15, is now forbidden as a candidate from directly soliciting money for the group or advising how to spend it. However, before declaring his candidacy, Bush was involved in fundraising for Right to Rise USA, while Murphy planned a long-term strategy where the super PAC would complement the campaign, which is bound by fundraising restrictions that dont apply to super PACs. The idea of a parallel outside group that can raise unlimited sums from individuals, corporations and groups is not new. Mitt Romney, the 2012 GOP nominee, attempted it later in his campaign. And other GOP candidates for the 2016 GOP nomination have formed super PACs and have begun buying advertising time in early states. Republican presidential candidate Jeb Bush said Tuesday the U.S. may need to send more ground troops into Iraq to defeat Islamic State militants, but he stopped short of saying how many as he outlined his strategy for combating a threat thats \"spreading like a pandemic.\", In the first major foreign... Republican presidential candidate Jeb Bush said Tuesday the U.S. may need to send more ground troops into Iraq to defeat Islamic State militants, but he stopped short of saying how many as he outlined his strategy for combating a threat thats \"spreading like a pandemic.\", In the first major foreign... However, none has combined the planning strategy with the sums of money Bushs super PAC has been able to raise, making it a pioneering effort in the super PAC era of presidential campaigning. In June, the group announced it had met its ambitious goal of raising more than $100 million, taking full advantage of the nations campaign finance laws to collect $103 million over the first six months of 2015. In June, the group had a balance of $98 million. No candidate for president has benefited from so much money so early in a campaign. Aides to the super PAC noted that similar groups supporting other candidates have purchased advertising time in early states. Some have also aired spots aimed at bumping up a candidates national poll numbers to help them gain entry into debates that require top-10 standing. Right to Rise USA aides said their strategy is long-term, aimed at building sustained name identification and support heading into the Iowa caucuses, which begin the 2016 voting on Feb. 1, followed by the New Hampshire and South Carolina primaries. Associated Press]", "Date": "20150816", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-jeb-bush-super-pac-10-million-20150816-story.html", "Title": "[ Jeb Bush super PAC spending $10 million on ads in early primary states]"}