{"Content": "[ Mayor Rahm Emanuel soundly defeated challenger Jesus Chuy Garcia on Tuesday, capturing a second term in Chicagos first runoff election and striking a note of humility by thanking voters for a second term and a second chance. The win followed six weeks of a hard-fought, nationally watched second round in which Garcia tried to cast the contest as the latest proxy battle between establishment Democrats and the partys progressive wing. Emanuels overwhelming financial advantage ultimately helped save the mayor as he fought for his political life. To all the voters, I want to thank you for putting me through my paces, Emanuel said after springing to the stage as U2s Beautiful Day blared at the plumbers union hall. I will be a better mayor because of that. I will carry your voices, your concerns into  the mayors office. With 98 percent of the citys precincts reporting, Emanuel had 55.7 percent of the unofficial vote to 44.3 percent for Garcia. Emanuel congratulated the Cook County commissioner on running an excellent campaign and said a contest that featured an immigrant and the grandson of an immigrant showed why Chicago is the greatest city in America. Garcia spoke to a raucous crowd at the UIC Forum about his journey from humble beginnings as a 5-year-old who came to the U.S. from Durango, Mexico, to eventually run for mayor of the nations third-largest city. To all the little boys and girls watching: We didnt lose today. We tried today. We fought hard for what we believe in, Garcia said. You dont succeed at this or anything else unless you try. So keep trying. Keep standing up for yourselves and what you believe in. With his re-election victory Tuesday, Mayor Rahm Emanuel renewed his lease on a municipal fixer-upper, one with buckling and painful-to-repair financial underpinnings caused by decades of deferred maintenance. Some of the mayors first-term repairs were modest, aimed at papering over any need for... With his re-election victory Tuesday, Mayor Rahm Emanuel renewed his lease on a municipal fixer-upper, one with buckling and painful-to-repair financial underpinnings caused by decades of deferred maintenance. Some of the mayors first-term repairs were modest, aimed at papering over any need for... Emanuel portrayed the win as allowing him to continue a public life that has included senior roles for Presidents Bill Clinton and Barack Obama and leading the 2006 Democratic takeover of the U.S. House while serving in Congress. While a lot of people describe Chicago in a lot of ways, all of us describe it as home. To the Second City that voted for a second term and a second chance: I have had the good fortune to serve two presidents. I have had the good fortune of being elected to Congress, said a hoarse Emanuel, who soon after received a congratulatory call from Obama. Being elected mayor of the city of Chicago is the greatest job Ive ever had and the greatest job in the world. Im humbled by the opportunity to serve you. Elections traditionally serve as a referendum on the officeholder, but Emanuel was effective at turning the tables on Garcia. The mayor painted the challenger as making costly promises and questioned whether Garcia had the credentials to lead a city facing enormous financial problems. The tactic also was a way to deflect attention from Emanuels own controversial decisions and abrasive style that marked his first term. Jesus \"Chuy\" Garcia concedes defeat in the mayoral runoff election against incumbent Mayor Rahm Emanuel on Tuesday, April 7, 2015. (Chicago Tribune, Terrence Antonio James), Jesus \"Chuy\" Garcia concedes defeat in the mayoral runoff election against incumbent Mayor Rahm Emanuel on Tuesday, April 7, 2015. (Chicago Tribune, Terrence Antonio James), Left unsaid by the mayor was that his financial plans count on quick help from Springfield, an approach that has proved politically difficult in the past. That reliance on a state government bailout is likely to be even more problematic, given the states own financial challenges and Republican Gov. Bruce Rauners focus on cutting aid to cities. For an election that followed a weekend of religious holidays and fell during a week when most of the citys schools are out on spring break, turnout approached 40 percent. That exceeded the near-record low of 34 percent in Februarys first round. Four years ago, turnout was 42 percent for the open-seat contest after the retirement of former Mayor Richard M. Daley. Emanuel suffered the national political embarrassment of being forced into the runoff after failing to eclipse 50 percent of the vote against a far lesser known field of four candidates in February. In that race, Emanuel garnered 45.6 percent, while Garcia finished second with 33.5 percent. After the February election, Emanuel aides privately acknowledged they were not happy with the campaigns ground game. The mayor largely relied on the ward organizations of supportive aldermen and a host of trade unions, including plumbers, pipe fitters, laborers, painters and operating engineers as well as the hospitality workers and firefighters unions. Garcia leaned heavily on the Chicago Teachers Union and the Service Employees International Union to turn out the vote. His goal was to win over those who voted for someone other than Emanuel in February. But after spending weeks courting the citys black voters, Garcia had trouble connecting well enough to make a difference. Emanuel held a lead in all of the citys 18 African-American-majority wards and in all but one of the majority-white wards. Garcia maintained a lead in 12 of the citys 13 majority-Latino wards, the exception being the Southwest Side 13th Ward run by powerful Illinois House Speaker Michael Madigan, where Emanuel racked up a big margin. Tuesdays balloting came after Emanuel spent the runoff campaign doubling down on his strategy to soften his image with Chicagos voters. In his first commercial of the runoff, Emanuel offered an apology of sorts to voters, saying he heard their message but stopping short of saying what he did wrong. They say your greatest strength is also your greatest weakness. Im living proof of that. I can rub people the wrong way or talk when I should listen. I own that, Emanuel said in the ad. In the closing TV spot of his campaign, Emanuel was even more direct. Chicagos a great city, but we can do even better, the mayor said in the ad, before pointing a finger at his chest. And yeah, I hear ya. So can I. All told, Emanuel raised about $23.6 million compared with a little more than $6 million for Garcia. That allowed Emanuel to get on the air quickly after the first round of balloting to define Garcia for voters before the challenger had a chance to define himself and capitalize on the momentum generated by forcing the mayor into a runoff. About an hour after Emanuel wrapped up his victory speech, his campaign reported another $800,000 in contributions, including $300,000 from close confidant and wealthy finance executive Michael Sacks and his wife, Cari. In addition, the Emanuel-aligned Chicago Forward super political action committee reported another $200,000 from the couple Tuesday, increasing their total contribution to $1.9 million to that committee alone. The super PAC spent $2.6 million on the mayors race. The mayor ran a nonstop stream of TV ads since November, more than 20 spots that aired more than 7,000 times. For the runoff, Emanuel ran more than 2,000 ads on Chicago TV stations, double Garcias total. How much did he spend? Do the math. How much per vote? said 22nd Ward Ald. Ric Munoz, one of just two of the citys 50 aldermen to publicly back Garcia. With unlimited resources like that, its almost impossible. Garcia aired ads in which he criticized Emanuel for his decision to close 50 neighborhood schools and for presiding over a spike in shootings and homicides. The challenger closed his campaign with an ad that sought to convey an air of excitement around his candidacy. People arent asking for much. Just a little. For our families to be a little more secure, our streets a little safer, our schools a little better. Its not too much to ask, but nobodys listening, Garcia said in the commercial. Its like theres one Chicago for the powerful and another one for the rest of us. It doesnt have to be this way. We can change Chicago. Garcia also received an assist from the SEIU, which aired an attack ad against Emanuel that slammed the mayor for what it contended was looking out for the citys downtown and the wealthy at expense of the citys neighborhoods. Chicago Forward, the Emanuel-aligned super PAC, aired attack ads against Garcia that alleged the challenger would raise taxes dramatically if elected, citing the various promises hed made on the campaign trail. A little more than six months ago, Garcia wasnt even considering running for mayor. Chicago Teachers Union President Karen Lewis had started raising money and preparing a bid to challenge Emanuel until she was diagnosed with brain cancer in October. In the wake of her illness, Lewis recruited Garcia to run and the CTU and its parent union, the American Federation of Teachers, have been among the top contributors to his campaign. With the time for lobbing attacks over, Emanuel on Tuesday night sought to address Garcias message that it was time Chicagos mayor put the citys neighborhoods first. We are the city that works and that means it has to work for everyone, in every neighborhood in every part of the city of Chicago. And in an era of hard choices, I cant promise everybody will be pleased with every decision, but the challenges we face, we face as one community, one city, one voice where every voice counts, Emanuel said. Make no mistakes, the challenges we face were not campaign talking points. The decisions we make over the next four years will determine what Chicago looks like over the next 40 years. With a second term now secured, the attention will turn to whether Emanuel softens his style of running the city. As the mayor had lunch Tuesday afternoon at Mannys, an iconic political hangout in the South Loop, close friend and political strategist David Axelrod talked about the importance of Emanuel airing the TV ads in which he alluded to voter frustration and admitted he could do better. I think it was important for people to hear it, but I think its also important for him to act on it. I dont think that the message of those ads should end at 7 oclock on election night, said Axelrod, a former White House senior adviser and campaign strategist to President Barack Obama. For his success in the next four years, he needs to take to heart the message that voters were sending. I dont think they wanted him not to be the mayor, but they wanted him to be a more inclusive mayor. And hed be foolish not to take that to heart. A few minutes later, after finishing a salad and bowl of matzo ball soup, Emanuel was asked what he learned from the runoff and whether he would, in fact, be a more inclusive mayor in his second term. Emanuel responded by confidently saying the feedback hed gotten from voters during the campaign would serve as his North Star. Asked by the Tribune if that meant he would take a different approach to running the city, Emanuel instead deflected the question by telling the reporter: Youll evaluate that, and my guess is youll tell me on a 24-hour basis. Pressed again on whether he had heard the voters and would change his often brusque style, Emanuel responded with just one word:, Yeah. Chicago Tribunes Cynthia Dizikes, Juan Perez Jr. and John Chase contributed. bruthhart@tribpub.com, rap30@aol.com]", "Date": "20150408", "Author": "[ Bill Ruthhart, Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-chicago-mayoral-election-20150407-story.html", "Title": "[ 'Second chance.' Emanuel says he's 'humbled' by victory]"}