{"Content": "[ \"Im really rich,\" Donald Trump informed supporters at his presidential campaign announcement. \"Im proud of my net worth. Ive done an amazing job.\", \"Im really proud of my success. I really am.\", \"I have the best golf courses in the world ... I have one right next to the White House.\", \"One of the big banks came to me and said, Donald, you dont have enough borrowings. Could we loan you $4 billion? I said, I dont need it.\", \"I have ... the greatest assets: Trump Tower, 1290 Avenue of the Americas, Bank of America building in San Francisco, 40 Wall Street, sometimes referred to as the Trump Building ... many other places all over the world.\", And why, pray tell, was he reciting all of this in a presidential announcement speech?, \"Im not doing that to brag,\" he said (heaven forbid!), \"because you know what? I dont have to brag.\", I have one thing to say to Donald Trump, the newest Republican candidate for president: I am so, so, so very sorry. Over the years, I have made some unflattering remarks about Mr. Trump and his routine flirtations with a presidential run, never expecting he would actually throw his orange toupee... I have one thing to say to Donald Trump, the newest Republican candidate for president: I am so, so, so very sorry. Over the years, I have made some unflattering remarks about Mr. Trump and his routine flirtations with a presidential run, never expecting he would actually throw his orange toupee... But he cant seem to stop himself. Trumps announcement (from Trump Tower, natch) that he is seeking the Republican presidential nomination was a veritable festival of the first person. A search of the transcript finds that he uttered \"I\" 195 times, \"my\" or \"mine\" 28 times, \"me\" 22 times and \"Ive\" or \"Id\" 12 times  for a grand total of 257 self-references. This compares with seven mentions of \"America\" or \"American,\" most of which were references to his holdings (\"I own a big chunk of the Bank of America Building at 1290 Avenue of the Americas, that I got from China in a war. Very valuable\") and his declaration that \"the American Dream is dead.\", If the American Dream werent already dead, it would have killed itself listening to Trumps 45-minute greed-is-good speech at a time when the gap between rich and poor is wider than it has been since the Great Depression. But dont blame Trump, the doughy showman President Barack Obama dubbed a \"carnival barker\" for his role in the birther movement. This reality TV star is simply exploiting the political system as it exists. Trump is the Frankenstein monster created by our campaign-finance system in which money trumps all. The Supreme Court has equated money with free speech (by letting first candidates and then contributors spend unlimited sums), which means the more money you have, the more speech you get. Trump may be preposterous, but there are 8,737,540,000 reasons we have to listen to him  the figure Trump claimed is his net worth. So lets hear about Trumps qualifications to hold the nations highest office. \"I beat China all the time  all the time.\", \"I have so many websites, I have them all over the place.\", \"I have lobbyists that can produce anything for me. Theyre great.\", \"I did a lot of great deals, and I did them early and young. And now Im building all over the world.\", \"I just sold an apartment for $15 million to somebody from China.\", \"Were building on Pennsylvania Avenue, the Old Post Office ... Its going to be the best hotel in Washington.\", \"We need a truly great leader now. We need a leader that wrote The Art of the Deal.\", Trumps speech had the feel of a lonely bar patrons monologue to the captive saloonkeeper. He bounced among stray thoughts about China, the Islamic State, conversations he had with friends, Obamas golf game, John Kerrys bicycle accident, Bowe Bergdahl and a fanciful negotiation between President Trump and Ford Motor Co. At one point, music started up as if Trumps speech had ended, but the candidate kept going  invariably returning to his favorite subject. \"I give a lot of money away to charities and other things. I think Im actually a very nice person.\", \"I love my life. I have a wonderful family.\", \"I love the Saudis. Many are in this building.\", \"I love China. The biggest bank in the world is from China. You know where their United States headquarters is located? In this building, in Trump Tower.\", \"I will be the greatest jobs president that God ever created.\", \"Nobody would be tougher on ISIS than Donald Trump. Nobody.\", \"Rebuild the countrys infrastructure? Nobody can do that like me.\", \"I would build a great wall, and nobody builds walls better than me ... on our southern border. And I will have Mexico pay.\", \"I know the smartest negotiators in the world. ... Believe me, folks, we will do very, very well, very, very well.\", We? Unlikely. But certainly Donald Trump will. Washington Post Writers Group, Dana Milbank is a Washington Post columnist. Twitter @Milbank]", "Date": "20150617", "Author": "[ Dana Milbank]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-presidential-campaign-perspec-0618-20150617-story.html", "Title": "[ Donald Trump's vanity fest]"}