{"Content": "[ Minutes after Iran and world powers said they completed a historic deal to curtail Irans nuclear ambitions in exchange for an easing of crippling economic sanctions, a funny text message began making the rounds on Iranian mobile phones. \"Goodbye falafel, hello McDonalds,\" it read. Another joked that the countrys ATMs would soon be dispensing U.S. dollars instead of the Iranian rials. There may not be a McDonalds yet, but ordinary Iranians were quick to welcome the countrys historic nuclear deal as a chance to end their nations isolation and improve Irans economy after years of stifling sanctions. \"Feel reborn! My grandchildren and younger people will have a better life, thanks to (Foreign Minister Mohammad Javad) Zarif and his men,\" said a tearful Aslan Rajabi, a 75-year-old retired bank employee. There were no signs of people pouring into the streets of Tehran after the deal was announced on Tuesday  but that may have more to do with the stifling summer heat and the fact that most Iranians are fasting during the last days of Ramadan. Many instead were glued to television coverage of the deal, which included a rare live feed of President Barack Obamas address on state TV. It was only the second time he has appeared live on Iranian television, the first time being after an interim deal that paved the way for the latest agreement was reached earlier this year. At one Tehran electronics shop, men who had gathered around TV screens at the store clapped as Iranian President Hassan Rouhani started to address the nation. Among them was shopkeeper Ali Hosseini, 29, who watched both leaders speeches live. \"I am proud that may country has resolved this critical issue through talks not war,\" he said. For many, the deal offered prospects for a better economy. In exchange for agreeing to limits on its nuclear program and new provisions for inspections of Iranian facilities, the Islamic Republic stands to receive a broad lifting of international sanctions and more than $100 billion in assets frozen overseas. \"The sanctions have worsened the economic situation of the people, and it was Rouhanis first priority to address this,\" said Tehran-based political analyst Mojtaba Fathi. The rials value has been strengthening against the dollar in recent days as the prospects for a successful deal increased. Pouya Alizadeh, a shop owner in northern Tehran, was handing out free sweets to his customers to celebrate the agreement. He hailed Zarif as a hero for his role in sealing the deal. \"Whats important for me is that it will bring improvement in business and trade with the outside world,\" he said. Some also saw the nuclear deal as a victory for Iran against the U.S. and other world powers. \"Iran defeated the world! We are the champions,\" gushed Ghasem Kashani, 19, a freshman in Tehran Azad University. \"The West learned Iran is right in its position!\", Associated Press]", "Date": "20150714", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-iran-nuclear-deal-reation-20150714-story.html", "Title": "[ Iranians welcome nuclear deal, hope for brighter economy ]"}