{"Content": "[ On the June day he drove a Harley-Davidson Road King north up Iowa 17 at the head of a column of hundreds of bikers, Scott Walker owned the state that casts the first votes in the race for the Republican presidential nomination. The Wisconsin governor, wearing a black leather jacket and fingerless gloves, enjoyed a fat lead in the polls - his union-killing record, evangelical background, and outside-the-Beltway persona considered a perfect fit for the 2016 Iowa caucuses. Since then, the road has turned washboard rough. Walker was backed by just 8 percent of likely GOP caucus-goers in the Aug. 27 Iowa Poll, less than half what he had recorded in the poll in late May. He was eclipsed by businessman Donald Trump, who had 23 percent, and retired neurosurgeon Ben Carson, who had 18 percent, in the latest Iowa Poll, conducted for the Des Moines Register and Bloomberg Politics. \"Hes been underwhelming as a campaigner in terms of getting people excited,\" said Christopher Larimer, a political scientist at the University of Northern Iowa in Waterloo. Walker played it safe in the first GOP televised debate last month, Larimer said, making little impression, and since has spent a lot of time reacting to Trump. \"Donald Trump is squeezing him out,\" he said. Expectations were high for Walker in Iowa. Not only did he dominate the early polls, he was a fellow Midwesterner. Surveys showed Walker appealing across the spectrum of party factions - from tea party activists to Christian conservatives to business types and establishment GOP insiders. With 16 other candidates from whom to choose, though, each segment of the party can find a simpatico candidate. For instance, nobodys going to out-Trump Trump for the \"mad as hell\" outsider conservative vote. Its harder to patch together a broad coalition. Moreover, Walker is a low-key leader who embraces the title \"aggressively normal\" bestowed by a magazine writer. He buys shirts on sale at Kohls, doesnt mind drinking a Leinenkugel, and of course, there is the made-in-Wisconsin Harley. Walker also has had a series of missteps that have led some analysts to question his preparation or readiness for the presidency. For instance, Walker raised eyebrows in February when he cited as a foreign policy credential his ability to stand up to angry demonstrators against the law he pushed through eliminating collective bargaining for most public employees in Wisconsin. \"If I can stand up to 100,000 protesters, I can do the same across the world.\", Last month, he executed the rare flip-flop-flip maneuver on immigration within a week. When Trump proposed ending automatic citizenship for children of illegal immigrants, Walker said he \"absolutely\" agreed, contradicting his earlier statements on the subject. A few days later, the governor said, \"Im not going to take a position on that one way or another\" when asked in a TV interview about the so-called birthright citizenship guaranteed by the 14th amendment. And then, finally, he said he did not want to end or limit the right. How about building a wall along the 5,500-mile northern border with Canada? \"So that is a legitimate issue for us to look at,\" Walker said last week in an appearance on NBCs Meet the Press. Kentucky Sen. Rand Paul, another GOP contender, mocked the \"ridiculous\" idea. \"Its sort of like everybody is competing to say, Oh no, Ill put them in camps. Oh no, Ill throw them out. Oh no, Ill put everyone in jail. And Ill have an electric fence, and Ill do this, \" Paul said on Boston Herald radio. Walkers campaign and the candidate himself later clarified the northern border comment. He was talking about concerns he had heard from some law enforcement officials in New Hampshire about border security. Iowa GOP insiders note that Walker, bogged down with his states budget and campaigning in other states, did not spend much time in the state over the summer, and he had been focusing mostly on trying to make inroads among activists on the right. The consensus is Walker still has strengths. In the latest Iowa Poll, despite his drop in the horse race, 71 percent of likely caucus-goers had a favorable view of Walker - second only to Carson. Unintimidated, a super PAC favoring Walker has collected $20 million from 300 donors, and Our American Revival, another independent group aligned with the governor, brought in $6.2 million. The Unintimidated group is starting a $7 million Iowa ad blitz on Walkers behalf, beginning Tuesday and continuing through the Feb. 1 caucuses. Last week, the group released the first ad in the series, titled \"Fight and Win.\" It features demonstrators storming the Wisconsin Capitol in Madison to oppose Walkers collective-bargaining limits. The idea: Remind Iowa Republicans of one reason Walker shot to the top of the polls in the first place. He takes on \"special interests\" and \"big government union bosses,\" the spot says. And wins. \"Scott Walker never backs down,\" the ad says.]", "Date": "20150908", "Author": "[ Thomas Fitzgerald]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-scott-walker-getting-pushed-back-in-polls-but-not-backing-down-20150908-story.html", "Title": "[ Scott Walker getting pushed back in polls but not backing down]"}