{"Content": "[ \"We are doing virtually nothing over our Illinois email addresses. I am even being careful with this email address and deleting after sending.\", University of Illinois Chancellor Phyllis Wise, in a September 2014 exchange with a law school faculty member, The U. of I.s chancellor resigned abruptly on Thursday. On Friday, we got a good idea why. The university released 1,100 pages of emails, many of which should have been handed over in response to earlier requests made under the states Freedom of Information Act. The records covered three topics that have gotten a lot of ink in the Tribune and elsewhere: the decision to rescind a job offer to professor Steven Salaita over his offensive social media posts about Israel, the hiring of felon James Kilgore and a proposed medical school for the Urbana-Champaign campus. In a news release, the university admitted that keeping the emails under wraps was no accident. Senior administrators deliberately used their personal email addresses to keep their correspondence from public view. University of Illinois senior administrators used personal email accounts to discuss sensitive and controversial issues, and then failed to disclose the records when they were requested by the public. U. of I. released 1,100 pages of emails Friday on three hot-button issues, some of which would... University of Illinois senior administrators used personal email accounts to discuss sensitive and controversial issues, and then failed to disclose the records when they were requested by the public. U. of I. released 1,100 pages of emails Friday on three hot-button issues, some of which would... The good news is that someone in a position of authority ordered up an outside ethics inquiry when the practice came to light. The bad news is that heads didnt roll over the findings. Quite the contrary. The university has agreed to give Wise a whopping $400,000 for stepping down. Wise, whos been chancellor since 2011, would have been eligible for a $500,000 retention bonus if shed lasted five years in the job. Then theres the soft landing: Wise is expected to join the U. of I. faculty, at a salary of $300,000 a year. And the even softer landing: Shes eligible for a one-year sabbatical before she steps into the classroom. All of this for someone whose tenure was marked by one controversy after another, as documented in her serial avoidance of the Freedom of Information Act. Why do people who get paid with public money keep getting rewarded with giant piles of it to go away?, Freshest in memory is the $763,000 that the College of DuPage agreed to pay President Robert Breuder to leave three years early. There was the $871,000 the Metra rail systems board of trustees agreed to pay former CEO Alex Clifford to leave (and not tell anyone why). University of Illinois Chancellor Phyllis Wise abruptly announced her resignation Thursday, citing \"external issues\" after a tumultuous year at the states flagship public university. Wise, chancellor and vice president of the Urbana-Champaign campus since 2011, will receive $400,000 as part of... University of Illinois Chancellor Phyllis Wise abruptly announced her resignation Thursday, citing \"external issues\" after a tumultuous year at the states flagship public university. Wise, chancellor and vice president of the Urbana-Champaign campus since 2011, will receive $400,000 as part of... But there are other examples. Lots of them. In recent years the U. of I. has sweetly induced several leaders to depart from management ranks in the midst of controversy. The excuse, typically, is that huge buyouts are cheaper than the lawsuits they pre-empt. Perhaps thats because the contracts are absurdly one-sided. That $500,000 retention bonus, for example  on top of Wises $549,000 salary as chancellor?, The university has a new board chair and a new president, but this sounds like the same old nonsense. To borrow a line from one of Wises under-the-radar emails: \"This place is so messed up.\", No kidding.]", "Date": "20150807", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-university-illinois-email-chancellor-edit-0809-20150807-story.html", "Title": "[  Another mess at U. of I.]"}