{"Content": "[ The Democratic Party, whose presidential race has been mostly overshadowed by Donald Trump and the Republicans, heads into the fall with its nomination contest far less certain than it once appeared and braced for a series of events that will have a significant effect on Hillary Rodham Clintons campaign. Clintons standing has been eroded both by her own shaky handling of the e-mail controversy and by the populist energy fueling the challenge of Sen. Bernie Sanders, I-Vt. Her weakened position in the polls has stoked talk about a possible late entry from Vice President Joe Biden, which could dramatically change the dynamic of the race. As the Democratic National Committee wrapped up its summer meeting here Saturday, members were left with a series of questions not just about Clinton, but also Biden, Sanders and the party as a whole. What can Clinton do to regain the trust of voters, generate genuine enthusiasm among grass-roots activists and reassure nervous Democrats that she will be a strong nominee atop the partys ticket in November next year?, Will Biden get in the race? Or, as many party leaders privately asserted, is it already too late? DNC members who were on a conference call with the vice president last week came away with significant doubts that he was emotionally ready to run as he and his family still grieve the death of his son, Beau. \"People love him,\" Ohio Democratic Party Chairman David Pepper said. \"But I think it would take one incredible sales pitch to convince the people right now who are energized about Bernie Sanders to move away from him or the people who are gung-ho about Hillary to move away from her.\", Hillary Rodham Clintons once-commanding lead in Iowa has shrunk to just seven percentage points, while Sen. Bernie Sanders, I-Vt. has surged in the state whose caucuses will kick off the race for the 2016 Democratic presidential nomination, according to a poll released Saturday evening. The Des... Hillary Rodham Clintons once-commanding lead in Iowa has shrunk to just seven percentage points, while Sen. Bernie Sanders, I-Vt. has surged in the state whose caucuses will kick off the race for the 2016 Democratic presidential nomination, according to a poll released Saturday evening. The Des... A new poll released Saturday night showed Clinton on a dangerously downward trajectory in Iowa, whose caucuses will kick off the nominating contest. She leads Sanders there 37 percent to 30 percent, according to the Des Moines Register-Bloomberg Politics poll, with Biden in third with 14 percent. The questions hovering over Sanders include whether he can convince enough Democrats that he is electable and, if he falls short, whether the movement behind him would shift its allegiance willingly to Clinton or the eventual nominee. And can Democrats capitalize long-term on what they see as significant vulnerabilities that Trump and other Republican candidates have exposed in recent weeks, especially with women and Hispanic voters?, \"Every single day, another one of them says something outrageous or offensive to alienate key constituencies that matter,\" DNC Chair Debbie Wasserman Schultz said. \"It leaves me and my fellow Democrats not needing to say very much.\", It was a meeting of Democrats, their heroes, their hopes and their neuroses. All were there under one roof but one  Vice President Joe Biden, whose deliberations over making a late entry in the presidential race injected unexpected intrigue into the partys summer meeting in Minneapolis this week.... It was a meeting of Democrats, their heroes, their hopes and their neuroses. All were there under one roof but one  Vice President Joe Biden, whose deliberations over making a late entry in the presidential race injected unexpected intrigue into the partys summer meeting in Minneapolis this week.... For all their glee at watching the Republicans, Democratic leaders are more inwardly focused today than they have been all year, with Clinton at the center of attention. The former secretary of state has responded to the doubts about her candidacy with muscle-flexing moves and, more significantly, a new tone in talking about the e-mail controversy. Senior Clinton advisers set up shop here last week and tried to show Democrats that she has learned the lessons of her unsuccessful 2008 campaign. They are almost singularly focused on winning the early primaries and caucuses. On the DNC meetings opening day, her campaign released memos outlining its ground game in the four early states. Clinton has adopted a strategy focused on the accumulation of delegates to next summers national convention. She received pledges from more than 400 superdelegates, roughly one-fifth the total required to clinch the nomination, a campaign official confirmed. That feat was first reported by Bloomberg News. Inside the Clinton team, there is an acknowledgment that the issue has been badly handled and that it has given rise to broader worries about her trustworthiness and sense of entitlement. \"Stuff is coming in from outer space to us and thats challenging, but I think what she did a few days ago was important in terms of acknowledging that people have questions,\" said Robby Mook, Clintons campaign manager. \"Shes taken responsibility for this, and I think at this point now we have a lot of supporters on Capitol Hill and our activists who are ready to really call this for what it is.\", Still, a senior Democratic official said the email story was \"an absolutely self-inflicted wound.\" Democrats are crying out, \"Just talk to me, tell me whats going on. She just cant ever do that. I just dont understand it. It seems so easy, and I think its maybe not in her makeup to go there,\" said this official, who requested anonymity to speak candidly. Clinton has tried to reassure her fellow Democrats that the email issue will not spiral out of control. She also has enthusiastically gone after Trump and other Republicans. Her speech here on Friday was a rhetorical mixture of scorn, humor and outright attack, all designed to say to Democrats that she is their strongest general-election candidate. Maria Elena Durazo, a labor leader from California and a DNC vice chair, said: \"She certainly needs to let loose with what she believes in. She does have very strong progressive values. I believe in her in terms of her values. But theres that side of her that needs to come across.\", All the questions about Clinton would come into starker relief if Biden were to decide to run. Yet for all the talk in Minneapolis about his future, there were not widespread calls for him to jump in. In fact, many leaders said the obstacles he would face are substantial, if not insurmountable. \"Its awfully late in light of the fact that in a place like Iowa youve got 1,700 precincts you need to organize in,\" said Scott Brennan, a DNC member and former Iowa Democratic Party chairman. \"You need to find a cheerleader or a voice in each of those. Thats a hard thing to do in a short amount of time.\", As the vice president goes through a process of consideration, party leaders from some key states said they were surprised at the absence of direct outreach by him. \"The vice president would have a difficult time finding well-known surrogates,\" said one state party chair who requested anonymity out of deference to Biden. \"Had we had this conversation nine months ago, it would be different. Everything in politics is about timing. But tragically, timing is not really on his side.\", Clinton has been diplomatic in dealing with a possible Biden candidacy. At a news conference Friday, she declined to spell out differences she has had with him during their years in office together. \"This is a difficult decision for him to make,\" she said. \"As Ive said before, I want him to have the space and time to do it.\", For now, Clinton is laboring to cement her support within the party firmament. One Clinton supporter who is a member of the DNC said that Biden, even as the sitting vice president, would be starting almost from scratch. \"Theres not really an opening thats calling out for him,\" said this person, who is steeped in the mechanics of presidential primaries and requested anonymity to give a frank assessment. \"He is a great guy and does have the personal charm, but I dont think that creates a lane in and of itself.\", Irrespective of Bidens decision, the summer has highlighted the challenges for Clinton in finding a way to convert the anti-establishment sentiment coursing through the electorate  magnified not only by Sanders, but also by Trump  into an asset. \"The American public thirsts for authentic and genuine candidates,\" said Ken Martin, the party chairman in Minnesota and a Clinton supporter. \"When you strip away the issues, really what people are looking for is authentic leadership, that people do things for principled reasons and not some self-serving political reason.\", The prominence of the outsider message was on display Friday as Sanders argued that Democrats would struggle to keep the White House if they relied on \"same old, same old\" establishment politics, and as former Maryland governor Martin OMalley effectively declared war on the DNC leadership for what he called a \"rigged\" debate process favoring Clinton. For all of the surprise strength of the Sanders insurgency, however, even he acknowledged here that he still must convince Democrats that he can win a general election. \"The issue of electability  Can we win this election? Can we defeat the Republicans?  I think the answer is becoming more and more clear that we can,\" Sanders told reporters. Former Minneapolis mayor R.T. Rybak, a prominent supporter of Obama in 2008 and previous liberal insurgent candidates, said channeling the passion Sanders has stirred in the progressive base is both a challenge and opportunity for Clinton should she become the nominee. \"Party politics is often like a funnel,\" said Rybak, a DNC vice chair. \"You want to get as much coming in, and then the partys job is to figure out a way to pull all that together and direct it where you need it.\", Anne Gearan contributed to this report.]", "Date": "20150830", "Author": "[ Dan Balz and Philip Rucker]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-hillary-clinton-democrats-20150830-story.html", "Title": "[ A summer of Clinton stumbles gives way to an uncertain fall for Democrats]"}