{"Content": "[ Hillary Clintons poll numbers in head-to-head matchups with Republicans have fallen, and in a recent Quinnipiac University poll, only 37 percent of Americans considered her honest and trustworthy, compared with 52 percent for Jeb Bush. To be sure, other candidates in both parties have similar trust ratings, but the difference is that many people simply dont have an opinion about the trustworthiness of Scott Walker or Bernie Sanders. Only 6 percent of Americans are unsure about Clinton; the remaining 57 percent say they dont trust her. These numbers have held basically steady since April, but CNN suggests that she had good trustworthiness ratings before the scandal broke about the security of her email when she was secretary of state. I cited the email mess in April as evidence for my belief that the Clinton campaign was going to dredge up everything we hated about the Clintons when Bill was in office: the cavalier belief that rules are for other, smaller people; the aggressive image management; the financial scandals. Subsequent polling seems to have borne this out. Now Clinton has agreed to turn over her email server to the Justice Department in the wake of disclosures that some of her emails apparently contained classified material. She had previously claimed that no classified material went through that email account. Like many other things she has said about that email server, this was false, and to complicate matters, she deleted emails from it. At The Washington Post, Chris Cillizza suggests that shes turning over the server because the Justice Department is forcing her to and writes, Its impossible to see this as anything but a bad thing for her presidential prospects. Democrats have had a lot of fun joking about the huge field of Republican presidential candidates and the clown car they keep piling out of. The Democrats, by contrast, couldnt fill a minivan. And the way things are going, that may be a big problem. Say what you will about the GOP, it has an abundance... Democrats have had a lot of fun joking about the huge field of Republican presidential candidates and the clown car they keep piling out of. The Democrats, by contrast, couldnt fill a minivan. And the way things are going, that may be a big problem. Say what you will about the GOP, it has an abundance... Once Justice Department officials have the server, they should be able to recover the deleted emails  or else establish that strenuous efforts were made to make those emails unrecoverable. At that point, one of three things will happen:, 1. The deleted emails will turn out to be full of top-secret recipes for barbecued tofu, yoga poses and pictures of possible flower arrangements for Chelseas wedding. This would probably not give a big boost to the Clinton campaign, but by confirming her claims that she deleted only personal emails, it would at least lift the suspicion that she fed a lot of shady stuff through the electronic version of a shredder. That might help her trustworthiness ratings recover, at least a little. 2. The email server, or the deleted emails, will turn out to have been fed through the electronic version of a shredder. Its relatively easy to make files unrecoverable. Its relatively difficult, however, to conceal that you have done so. This would be very bad for Clintons image  possibly worse than actually finding shady stuff on the server. Remember Richard Nixon and the missing 18 minutes of tape? Probably whatever he said was bad. But the gap could be filled with all sorts of imagined offenses that were even worse than what he actually said. Even loyal Democrats would have to strain to explain why she needed to take extreme actions to conceal the details of her mothers funeral arrangements from government officials. Hillary Clintons problems dont seem to be going away. Aside from poll numbers showing her slipping in Iowa against potential competitors, she has not been able to figure out how to respond either to her e-mail scandal or the consequences of her foreign policy. And her email scandal just got a... Hillary Clintons problems dont seem to be going away. Aside from poll numbers showing her slipping in Iowa against potential competitors, she has not been able to figure out how to respond either to her e-mail scandal or the consequences of her foreign policy. And her email scandal just got a... 3. The deleted emails will turn out to contain a number of work-related emails. Presumably, they will be the stuff they didnt want Republicans to see, for reasons ranging from mildly embarrassing (intemperate comments about colleagues, the president or foreign leaders), to moderately problematic (stupid but not immoral stuff like, er, sending classified material through a not-very-secure server), to potentially campaign-ending (say, if there were some less-than-savory communications with Clinton Foundation donors). This certainly wouldnt help anything. How likely is the first scenario? To put it another way, how likely is it that Hillary Clinton adamantly refused to turn over the server to authorities because she feared Republicans might discover the secret ingredient in her grandmothers pound cake recipe? If insignificant personal matters were all that was on that server, why did she cling to it like a barnacle rather than just give it up?, I think thats actually more likely than it sounds. My emails with my family are full of insignificant details of my life, bickering about petty questions of no possible interest to anyone else and similar ephemera. You would still have to pry the password to my Gmail account out of my cold, dead hands with a crowbar, or at least a subpoena. And Im just talking about a neutral third party. If handing it over meant that those emails might end up in the hands of someone who said nasty things about me in public and clearly wished to end my career? Better bring the extra-large crowbar. On the other hand, I wouldnt say its unlikely that the Justice Department will find stuff on the server that shouldnt have been there  possibly along with stuff that should have been in the pile of documents that Clinton has already turned over to the government. Or we could learn the server has been assiduously scrubbed of its old contents, and those missing emails are now goner than the passenger pigeon. And if either of those things turns out to be true, then Hillary Clintons trust problem is about to get worse. Bloomberg, Bloomberg View columnist Megan McArdle writes on economics, business and public policy.]", "Date": "20150814", "Author": "[ Megan McArdle]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-hillary-clinton-trust-emails-20150814-story.html", "Title": "[ Hillary Clinton's trust problem]"}