{"Content": "[ In a speech light on policy details but heavy on flair, Donald Trump told a raucous New Hampshire crowd Friday that hed make a smarter president than any of his competitors when it comes to the economy, the military and everything else. \"We will make great trade deals, we will save Social Security without cuts, we will come up with health care plans that will be phenomenal  phenomenal,\" Trump told a packed high school auditorium. Trumps trip to the first primary state comes as he continues to hold a commanding lead in the Republican presidential primary, despite a spat with Fox News personality Megyn Kelly, staff shakeups and continued criticism over his comments about Mexican immigrants. Although he speaks without a script, Trumps talking points here echoed those hes made on the campaign trail for months, namely touting his skills as a negotiator. The crowd ate it up. \"Hes a breath of fresh air thats deviating from the traditional political talk and focusing on things that I think many Americans want to hear,\" said Stephen Boeddinghaus, who attended the rally with his wife. \"Weve been to several political rallies through the years and never  never  have we seen enthusiasm as displayed here tonight.\", Boeddinghaus said he is a fan of Trump, but hed eventually like to hear more specifics on how Trump would achieve his goals. So far, Trump has yet to release specific policies on any of the subjects he touts on the campaign trail. Speaking to reporters before the rally, he said his campaign is in the process of crafting policies and will likely release details in September. \"I have some of the most brilliant people in the country working on tax,\" he said. \"We have some amazing people working on immigration.\", Trump hasnt shied away from attacking his Republican primary rivals, and he kept the heat on Friday, taking on former Florida Gov. Jeb Bush on foreign policy, saying Kentucky Sen. Rand Paul has no chance at the nomination and criticizing former technology executive Carly Fiorinas tenure leading Hewlett-Packard. \"After the debate our poll numbers went up,\" he said, referencing the first Fox News debate, for which 24 million viewers tuned in. \"Do you think they were there for Jeb Bush or Rand Paul?\", Often drawing laughs, loud applause and sustained cheers from the crowd, Trump relished his role as the GOPs hottest candidate. \"You know,\" Trump told the crowd. \"Theyre calling it the summer of Trump.\", Associated Press, ]", "Date": "20150814", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-donald-trump-20150814-story.html", "Title": "[ Trump promises 'great trade deals,' 'phenomenal' health care plans]"}