{"Content": "[ WASHINGTON  It could be a tough fall for Rep. Scott Garrett. Corporate and Wall Street donors have already been shying away from the New Jersey Republican since he reportedly made anti-gay remarks at a private gathering in July. Now, some key Washington insiders are coalescing around his likely 2016 challenger, Democrat Josh Gottheimer. Later this month, James Cicconi, the Republican head of external affairs at AT&T, and JPMorgan Chases Peter Scher, a Democrat, will host a breakfast \"meet and greet for Gottheimer. The invitation doesnt mince words.    , The race is \"an excellent opportunity to oust one of the most conservative members of the House of Representatives, the invitation says. It also praises Gottheimer, a Microsoft executive and former Federal Communications Commission official, as \"a moderate, pro-growth, fiscal conservative and social progressive, concluding that he is \"a friend of the business, financial and technology communities., Such an open revolt against an incumbent shows the precarious position Garrett may be in heading into the election. The backlash is even more notable considering the power he wields as the head of the House subcommittee on capital markets-a panel known informally among financial lobbyists as the ATM, mainly because of the money lawmakers can extract from the industry. Garretts biggest donors, including banks, hedge funds and exchanges, have generally been pleased by his deregulatory agenda. But some of his recent policy decisions have prompted corporations to rethink their support. Chief among them was his decision to vote against John Boehner as Speaker of the House, as well as his opposition to the Export-Import Bank. Additionally, many financial companies were troubled after Politico reported that Garrett, at a private meeting of Republican lawmakers in July, said he was upset that the partys campaign committee recruited and supported homosexual candidates. His remarks came on the heels of a Supreme Court decision legalizing same-sex marriage, a ruling that much of corporate America supported. Shortly after, Bloomberg News reported that the Big 4 accounting firms canceled a fundraiser they were scheduled to host for Garrett, and Goldman Sachs decided to stop making political action committee donations to him. Garrett, who was first elected in 2002, may also face an uphill battle to win the backing of the U.S. Chamber of Commerce, which is known for influencing races by spending hundreds of thousands of dollars on advertising. The group, which tends to back Republicans, has been looking for pro- business Democrats to support-a stance that could benefit Gottheimer. The group endorsed six Democrats last election. Five of them won. In an annual ranking of key business votes, the Chamber found that Garrett only supported its position 50 percent of the time in 2014. Thats 20 percentage points below the level that garners the Chambers endorsement. As of June 30, the most recent date federal numbers are available, Garretts campaign committee had raised $367,110 and had a total of $2.2 million in the bank. (Political action committees from AT&T and JPMorgan are among his donors this year, though the contributions came before his reported remarks on gay candidates.), Still, financial lobbyists say that theyve been pressed recently by Garrett staff members to attend one of several fundraisers the lawmaker has scheduled at high-priced Washington restaurants in September and October. Neither a spokesman for Garrett nor his fundraiser returned messages seeking comment. Gottheimer has brought in $631,023, also as of the end of June. That is one of the top hauls for congressional challengers and almost twice as much as Garrett this year. The breakfast scheduled for Sept. 21 with Scher and Cicconi is expected to draw a wide range of corporate officials from both parties to AT&Ts Washington offices, though it isnt a fundraiser. Scher worked in the Clinton administration, and Cicconi served in the White House under Presidents Ronald Reagan and George H.W. Bush. Both are longtime friends of Gottheimer. Steve OHalloran, a spokesman for JPMorgan, declined to comment. Cicconi, who worked in the White House for former President George H.W. Bush and rarely supports Democrats, said he has no qualms about backing the \"business friendly Gottheimer. \"While we have some philosophical differences, theyre not major, Cicconi said in an interview. \"He would be a definite upgrade in that seat.]", "Date": "20150910", "Author": "[ Robert Schmidt and Silla Brush, Bloomberg News]", "Link": "http://www.chicagotribune.com/news/sns-wp-blm-news-bc-garrett10-20150910-story.html", "Title": "[ AT&T, JPMorgan executives look to oust Garrett for Democrat]"}