{"Content": "[ A pop quiz ahead of Thursdays national elections in Britain: Can you identify which two of the following three topics have been major campaign issues?, The economy. Russias incursion into Ukraine. Bacon sandwiches. Maybe you guessed it. Theres been lots of discussion about government spending, and about Labour Party leader Ed Milibands awkward attempt to scarf down a working class breakfast for the cameras, but nothing much about Ukraine. And nothing much on the campaign trail about other pressing international issues, such as the Iran nuclear negotiations, even though the U.K. is part of the talks. Or on the Islamic State, though many radicalized British Muslims have joined up. This parliamentary election, which will determine who is prime minister, reveals a United Kingdom looking inward, away from its traditional outsized role in global affairs. Thats a concern because the world shows no signs of becoming less complex or dangerous. And the United States is better off when the U.K. is an active partner in the special relationship that binds the two countries. The international issue getting the most campaign notice reinforces the view of British retrenchment: Prime Minister David Cameron of the Conservative Party vows that if he retains his job he will set a referendum by 2017 asking the public if the U.K. should leave the European Union. Britains relationship with the continent has always run hot and cold; now that discomfort is at the heart of Britains broader question about where it fits in the world. \"I think undoubtedly the U.K. as a country is on the back foot right now,\" Robin Niblett, a prominent British voice on international issues, said in London last week. Niblett, director of Chatham House, a think tank, talked about a British identity crisis and a \"post-Vietnam tired phase\" after interventions alongside the U.S. in Iraq and Afghanistan. Britain didnt project a strong voice in the Wests confrontation with Russian President Vladimir Putin over Ukraine, or in dealing with Nigerias Boko Haram or war in Yemen (the latter two countries are former British colonies). Britain is, though, part of the U.S.-led coalition battling Islamic State, flying missions against the insurgents in Iraq. AsBritainspolitical leaders spent a final day campaigning Wednesday, theelectionrace drew to a bumpy close for the U.K. Independence Party, which suspended a candidate for saying he would shoot his Conservative opponent. Robert Blay, who was running in the southern English seat of North East... AsBritainspolitical leaders spent a final day campaigning Wednesday, theelectionrace drew to a bumpy close for the U.K. Independence Party, which suspended a candidate for saying he would shoot his Conservative opponent. Robert Blay, who was running in the southern English seat of North East... Its hard to get a handle on how seriously Britain is rethinking its global status because its the unasked question on the campaign trail. Theres no reason to expect a sudden stretch toward global issues, whoever becomes prime minister, because neither Cameron nor Miliband is seen as an internationalist. (Nor as a populist: People scoffed at Milibands losing battle with that bacon sandwich and at Cameron for wielding a knife and fork to eat a hot dog at a family barbecue.), In general, the right-leaning Cameron wants to keep Britain on a tight spending leash, which includes less for defense, while the left-leaning Miliband wants to use a heavier government hand and higher taxes on the wealthy to address what he sees as inequalities in British society. Miliband helped defeat a parliamentary vote in 2013 that would have authorized force against Syrian President Bashar Assad. What a choice: \"On May 7 voters must weigh the certainty of economic damage under Labour against the possibility of a costly EU exit under the Tories,\" The Economist wrote. Election polling suggests no party will win a majority because of surprising shifts in voter sentiment, mostly toward narrower interests. The biggest shock is how the Scottish National Party, which came up short in last years referendum on independence for Scotland, has roared back under new leadership. The SNP could sweep every seat in Scotland, reigniting conversations about independence much sooner than expected. It could wind up in a coalition government with Labour, though Miliband said Monday that wont happen. As for Britains future in the European Union, there are skeptics in both the Conservative Party and in the anti-immigration UK Independence Party. Cameron said he would renegotiate the terms of Britains membership in the EU and then put the issue to a referendum. Britain never adopted the euro and is skeptical of open immigration and power-sharing with the continent. If Cameron stays in power, the debate over the EU threatens to occupy Britain for the next two years. If Miliband wins, the fundamental social and economic changes he advocates could turn Britain into the new France. (Hint: Thats not a path to prosperity.), The best hope is that Camerons party prevails, and he forgets the impulse to dig a vastly deeper moat around the island kingdom.]", "Date": "20150505", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-britain-election-0506-20150505-story.html", "Title": "[ Tired of the world, the British go to vote  ]"}