{"Content": "[ A truck driver once under surveillance for radical Islamic ties crashed into an American-owned chemical warehouse in southeastern France on Friday and hung his employers severed head on a factory gate, along with banners with Arabic inscriptions. The attack, which triggered an explosion that wounded two people, came on a day of violence that spanned three continents. The suspect, who was apprehended soon after setting off the blast, is the latest French citizen implicated in extremist bloodshed in recent years after being flagged to authorities, then falling off the radar. Police were put on higher alert in the Lyon area after the assault, which revived fearful memories of attacks in January on a kosher market and satirical newspaper that left 20 dead. \"Islamist terrorism has again struck France,\" Prime Minister Manuel Valls said. The attack in France came on the same day that a gunman mowed down scores of European tourists on a beach in Tunisia and a suicide bomber killed more than two dozen worshippers at a Shiite mosque in Kuwait  violence that followed a call by Islamic State extremists to target \"nonbelievers.\", No group immediately claimed responsibility for the factory attack in France. The severed head appeared to mimic the Islamic State groups practice of beheading prisoners and displaying their heads for all to see, and came days after the militants urged attacks during the Muslim holy month of Ramadan. A young man pulled a Kalashnikov from a beach umbrella and sprayed gunfire at European sunbathers at a Tunisian resort, killing at least 39 people  one of three deadly attacks Friday from Europe to North Africa to the Middle East that followed a call to violence by Islamic State extremists. The... A young man pulled a Kalashnikov from a beach umbrella and sprayed gunfire at European sunbathers at a Tunisian resort, killing at least 39 people  one of three deadly attacks Friday from Europe to North Africa to the Middle East that followed a call to violence by Islamic State extremists. The... The bloodshed was condemned by the United Nations, the United States, Israel and others. The French attack began about 9:30 a.m. when Yassine Salhi drove a utility truck to the gate of the Air Products factory in Saint-Quentin-Fallavier, southeast of Lyon, authorities said. Prosecutor Francois Molins said Salhi was known to factory staff because he regularly made deliveries there, and they let him in the gate. Once beyond the sight of security cameras, Salhi plowed his truck into gas canisters in a factory warehouse, touching off an explosion, Molins said. A knife and the decapitated body of Salhis employer were found at the site of the explosion, and the severed head was posted on a gate at the factory entrance with two flags bearing proclamations of Islamic faith, the prosecutor said. Firefighters apprehended Salhi, and he was in custody Friday night along with his wife, sister and another person, while police sweeps of the vehicle and the suspects apartment were continuing, the prosecutor said. At least one man attacked a gas factory Friday in southeastern France, posting a severed head at the factorys entrance along with banners covered with Arabic writing, officials said. (AP), At least one man attacked a gas factory Friday in southeastern France, posting a severed head at the factorys entrance along with banners covered with Arabic writing, officials said. (AP), Authorities described Salhi as a father of three who was married for more than 10 years, and who had been monitored for links to radical Islam from 2006-2008. \"He continued to attract the attention of intelligence services from time to time from 2011 to 2014 for his links to the Salafist movement in the Lyon region,\" Molins said. He is the latest Frenchman to have been on authorities radar before staging attacks in recent years. Others include Mohamed Merah, who attacked a Jewish school in 2012, Mehdi Nemmouche, chief suspect in a 2014 attack on Brussels Jewish Museum, and two of the gunmen in the January shootings in Paris. \"We are dealing with sleeper terrorists who are able to disappear from the surveillance radar for years and then reappear,\" Parliament member Georges Fenech, on a commission for surveillance of jihadist networks, told reporters near the factory. \"Its really important to reflect and act to make sure that this surveillance lasts as long as possible. If not, we can have perpetrators of attacks who have been located, but who disappear off all surveillance.\", President Francois Hollande raised the security alert for the southeastern region to its highest level for the next three days. Interior Minister Bernard Cazeneuve said security was tightened at religious sites around the country. Three French officials said the man who was decapitated ran a local transportation company that employed Salhi. The victims name was not released. One official said the businessman was believed to have been killed before the attack on the factory. The officials were not authorized to speak to the media and requested anonymity, Hollande said the key question was determining whether there were any accomplices. Others, including Salhis wife, were seen on television being taken into custody from his apartment building in the Lyon suburb of Saint Priest hours after the attack. The Paris Mosque condemned the attack, and a Muslim forklift operator who lives next to the factory described his horror and fear of reprisals. \"Doing this during Ramadan is disrespectful,\" said Mehdi, a 23-year-old who did not want his full name published out of security concerns. Wearing a long white Muslim robe, he said: \"There are Muslims who have nothing to do with these things. Now they find themselves mixed up in this story for nothing.\", No further details were released about the two people injured in the explosion, though Hollande said their injuries were light. The gas factory belongs to Air Products, an American chemical company based in Allentown, Pennsylvania, and owned by Seifi Ghasemi, an Iranian immigrant. The company said all its employees had been accounted for and were evacuated from the premises but did not say if any had been injured. Air Products makes gases used by a wide range of industries, including food production, medicine and the oil and gas industry. It has more than 20,000 employees in 50 countries, mostly in the Americas, Europe and Asia. A French security official told The Associated Press that the suspect apparently miscalculated about how explosive the chemicals he smashed into would be. Hollande said a major explosion appeared to have been the goal. The international police agency Interpol was offering its investigative help to Tunisia, France and Kuwait, as well as Somalia, where extremists also struck Friday, in attacks that Interpol Secretary-General Juergen Stock said \"show the truly global dimension to current terrorist threats.\", In Washington, Pentagon spokesman Col. Steve Warren said it was too soon to tell whether Fridays violence was the work of Islamic State extremists. He said U.S. Defense Secretary Ash Carter had been briefed. Associated Press]", "Date": "20150626", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-france-beheading-attack-20150626-story.html", "Title": "[ Beheading, explosion at U.S. factory in France]"}