{"Content": "[ Rick Perry is out of money, has been laying off staff, sits at about 1 percent in national polls, and probably wont survive the month as an active Republican presidential candidate. Donald Trump is leading the polls in the GOP race and has all the money he needs. But I believe the former Texas governor has a better chance of winning the nomination than Trump does. Let me explain. I still think the Republican nominee will be one of the nine candidates who have conventional qualifications for the job and whose positions on the issues are within the partys mainstream. Theres the first tier (in no particular order) of Marco Rubio, Scott Walker and Jeb Bush; a second tier of John Kasich and Mike Huckabee, and a long-shot third group consisting of Bobby Jindal, Rick Santorum, Chris Christie and Perry. This leaves the other candidates Trump, Ben Carson, Carly Fiorina, Ted Cruz, Rand Paul and the rest with smaller chances. How could Perry win? Any candidate can have a public-opinion surge. Trump, Carson and, on the Democratic side, Bernie Sanders will confirm that. Perry may well not get one before he feels he has to face (seeming) reality and drop out. But until then, \"youneverknow,\" as the late Joaquin Andujar said. Perry will (unless he exits in the next few days) participate in the matinee version of the second Republican debate, which is next week. Theres always a chance he could \"win\" that contest (meaning, he is perceived as having won). If he does, it could generate positive publicity, move him up a bit in the polls and generate enough new fundraising to reboot his campaign. If so, it could spark more positive press, and move him back into the conversation that the party actors, still searching for a consensus candidate, are having. Former Texas Gov. Rick Perry has stopped paying his 2016 presidential campaigns staff in the key early primary state of South Carolina, amid flagging poling numbers and sluggish fundraising.Spokesman Lucy Nashed said late Monday that \"tough decisions have to be made in respect to both monetary... Former Texas Gov. Rick Perry has stopped paying his 2016 presidential campaigns staff in the key early primary state of South Carolina, amid flagging poling numbers and sluggish fundraising.Spokesman Lucy Nashed said late Monday that \"tough decisions have to be made in respect to both monetary... And if Perry remains in a position to take advantage of a potential surge, then so are the eight other candidates I consider viable, even though none of them has broken out either. So why not Trump? Early polling doesnt predict nomination outcomes. The Fix at the Washington Post has been pointing this out regularly. On Sept. 9 in 2011, Perry was leading in national polling of the Republican presidential field. In September 2007, Hillary Clinton was in front for the Democrats, and Rudolph Giuliani led on the Republican side. In 2003 at this point, polls showed Joe Lieberman as the Democratic front-runner. True, Clinton almost won in 2008. But Perry, Giuliani and Lieberman combined to win a grand total of zero primaries and caucuses in their races. Lets look at the numbers for other leading candidates as well. In the race for the 2008 nomination, while Giuliani was the polling leader a position he would hold for another 120 days with a solid 28 percent of the vote, former Sen. Fred Thompson was in second place at 18 percent and rising. Thompson went nowhere in 2008, too. Mitt Romney was in third, with 14 percent. The eventual nominee, John McCain, was down at 10 percent. Huckabee, who won in Iowa and many other states, was at 4 percent in the RealClearPolitics poll average at that point. I applaud Republican presidential candidate Rick Perrys call for the Grand Old Party to patch up its differences with African-Americans, among other voters of color. Although I eagerly wait to hear how he would follow up his words with deeds, lip service is better than no service at all. The former... I applaud Republican presidential candidate Rick Perrys call for the Grand Old Party to patch up its differences with African-Americans, among other voters of color. Although I eagerly wait to hear how he would follow up his words with deeds, lip service is better than no service at all. The former... Ill say it again: Trumps great polling numbers are mainly about name recognition and media attention. Republican voters havent made hard-and-firm decisions to vote for him. They are just much more likely to think of him, when pollsters catch them at dinnertime, than they are of the other 16 candidates. And Republican voters are predisposed to like Republican candidates, even fairly odd ones. Beyond that, all the explanations about the appeal of his style or his positions are mostly beside the point just as those explaining the allure of Giuliani and Thompson were off point in 2007. Trump has shown a reality stars ability to draw attention to himself and to keep the spotlight there for an extended period. Thats great for producing results in the summer before the primaries and caucuses. But it wont be nearly as effective in the run-up to the Iowa caucuses and New Hampshire primary, when voters are inundated with information about many candidates. And at that point, the opinion leadership of high-profile Republicans is likely to be important whether its organized against Trump, or in favor of one or two or three other candidates. Its certainly not going to be in favor of Trump. Despite his polling surge, he hasnt picked up the support of a single governor or member of Congress. As Nate Silver reminded us at FiveThiryEight, Trump has \"profound potential differences with the Republican orthodoxy on major issues ranging from taxation to health care to reproductive rights.\" The closer he comes to winning, the more organized Republicans will fight back against him. And given that almost all of his support is weak to begin with as it is for most candidates at this point in the process  it wont take much for his polling lead to dissipate. Bloomberg View, Jonathan Bernstein is a Bloomberg View columnist covering U.S. politics.]", "Date": "20150909", "Author": "[ Jonathan Bernstein]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-rick-perry-staff-donald-trump20150909-story.html", "Title": "[ Rick Perry's chances remain better than Donald Trump's]"}