{"Content": "[ Long content to wield his power largely behind the scenes, House Speaker Michael Madigan has in recent weeks become the very public face of the Democratic majority at the statehouse in a budget standoff with Republican Gov. Bruce Rauner thats engulfed the government. The change in visibility is hardly an accident given that Rauner has sought to make Madigan the flash point in the budget fight, running weeks of television ads blaming him for the impasse. The efforts mirror the anti-Madigan campaign that was a key part of Rauners run for governor in 2014. The usually press-averse speaker has responded with weekly media briefings, taking advantage of free broadcast time to repeatedly label the governor \"extreme\" for tying budget negotiations to his broader business agenda that seeks to lessen the influence of labor unions, a key Democratic constituency. \"The governors advocacy of nonbudget issues goes right to the core beliefs of many Democrats and many Republicans because his advocacy of those ideas reduce wages for Illinoisans and brings down the standard of living for middle-class families,\" Madigan said in a briefing with reporters this week. \"Concerning the governors advocacy of nonbudget issues, Ive argued that to the extent he does that he is functioning in the extreme, not in the moderation that will be needed to solve the problem of the budget deficit.\", Madigan so rarely wavers from his message that he joked about it with reporters before launching into another attack on Rauner. \"Those of you who have been here for the last few weeks, I know youll be very happy to know that I have a prepared statement to deliver, a lot of new stuff,\" Madigan quipped. Madigan says hes willing to work \"cooperatively and professionally\" but balks at the governors insistence that \"nonbudget issues\" must be included in an overall spending agreement. He argues that hes met Rauner \"halfway\" on a number of measures, referencing House approval of a plan to privatize the states economic development agency. The Illinois budget stalemate moved from the statehouse to the courthouse Thursday when Attorney General Lisa Madigan asked a judge to rule on what bills can be paid and Republican Gov. Bruce Rauner accused her of trying to prevent state workers from getting their full paychecks. Madigan, daughter... The Illinois budget stalemate moved from the statehouse to the courthouse Thursday when Attorney General Lisa Madigan asked a judge to rule on what bills can be paid and Republican Gov. Bruce Rauner accused her of trying to prevent state workers from getting their full paychecks. Madigan, daughter... But in an example of partisan gamesmanship, the proposal includes a poison pill and would sunset after a few years, which Rauner opposes. Madigan has drawn a hard line against other Rauner proposals, such as a plan that would tighten workers compensation standards for an employee to prove an injury happened on the job. Rauner contends his ideas are \"extreme common sense,\" saying Democrats simply want to raise taxes without taking steps to overhaul the states larger economic structure. The governors agenda centers on freezing local property taxes, enacting term limits, curbing collective bargaining rights, reducing how much businesses pay for injured workers and limiting awards in civil cases. \"It would be a huge mistake for Illinois to only raise taxes at this time,\" Rauner said this week. \"We would shake the confidence of the business community, homeowners, and we will continue to chase our tail down in decline. \"What is extreme in Illinois is our property tax burden, what is extreme is our deficit and our debt, what is extreme is our low economic growth, our low job creation and our high rate of conflicts of interest inside state government,\" Rauner added. The rancor between Republican Gov. Bruce Rauner and Democratic lawmakers showed no signs of letting up Wednesday as Rauner used his veto power to take aim at legislative pay raises and the state started a new budget year without a plan to fund basic operations of government. Political positioning... The rancor between Republican Gov. Bruce Rauner and Democratic lawmakers showed no signs of letting up Wednesday as Rauner used his veto power to take aim at legislative pay raises and the state started a new budget year without a plan to fund basic operations of government. Political positioning... While Rauner has taken particular aim at Madigan, who has served as speaker since 1983 except for two years when Republicans had control of the chamber, the governor has taken a more pragmatic approach in his relationship with Democratic Senate President John Cullerton. Hes credited Cullerton for working with him to strike a deal on portions of his agenda, including pension relief for cash-strapped Chicago Public Schools. Rauner and Cullerton backed a plan to allow CPS to delay a massive pension payment by 40 days, but the idea failed in the Madigan-controlled House. The stalemate shows no sign of easing anytime soon, even as the state entered July without the ability to spend money on most day-to-day functions of government because the yearly budget expired and the sides could not agree on a new spending plan. The speakers daughter, Attorney General Lisa Madigan, entered the fray this week, asking a Cook County judge to decide what bills the state can pay and what, if anything, can be done to get paychecks to state workers. She argues there is no authority to pay most state workers without the budget in place, countering Rauners calls for Comptroller Leslie Munger to keep meeting payroll. The House speaker is backing a temporary, one-month budget to funnel money to key services such as health care and salaries for state police, which the House is expected to vote on when members return to the Capitol next week. The measure has already cleared the Senate. Its a financial patch the Rauner administration opposes, saying it spends too much and mirrors the larger Democratic budget he already vetoed because it was more than $3 billion out of balance. Should the measure reach Rauners desk, it may set the stage for Madigan to try to flex his veto-proof majority. The governor could deny him that opportunity by simply not acting on the stopgap measure within 30 days, at which point the bill would expire. At every turn, however, Madigan reinforces the message that he is in control, as he did this week when he ticked through a list of Republican and Democratic governors he has seen come and go. He noted that there were legislative battles with many of them. \"Ive been through these things before,\" Madigan said. \"I even survived Blagojevich.\", mcgarcia@tribpub.com]", "Date": "20150703", "Author": "[ Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-madigan-bruce-rauner-budget-0705-20150703-story.html", "Title": "[ Madigan is face of Democrats in battle with Rauner]"}