{"Content": "[ Donald Trump has an immigration policy. Its based on dubious assertions and would be fabulously expensive, but as a statement of goals its largely coherent. And it may mark a very, very dangerous turning point in the Republican presidential primary.f, There are two main facets of illegal immigration: border security, encompassing both the nations geographic border and its ports and airports, and the fate of the estimated 11 million undocumented immigrants already living in the U.S. All Republican candidates support varying degrees of increased border enforcement, repeating \"secure the border\" as a charm to ward off the evil eye of the right wing. The party is otherwise fractured. Legal immigration is a sticky point, pitting Republican donors against the partys sizable wing of immigration restrictionists. And the question of what to do about the 11 million undocumented immigrants in the U.S. most of whom have been here for a decade or more, is even stickier. Polls show that a majority of Americans support some kind of path to legalization. But Republicans are more opposed and opponents are particularly vocal. Among the top presidential contenders, former Florida Gov. Jeb Bush and Ohio Gov. John Kasich seem squarely in the legalization camp. But many of their competitors oppose such \"amnesty\" for undocumented immigrants. They have plenty of support. Earlier this year, Republicans in the House of Representatives voted to rescind President Barack Obamas executive actions easing deportation for millions of undocumented immigrants. If a path to legalization or citizenship is foreclosed, two options remain: continuing the status quo, leaving 11 million people residing illegally in the U.S. Or deporting them. Even the most virulently restrictionist Republicans have avoided explicitly calling for the latter. Instead, they typically suggest that the fate of the 11 million is an issue to be addressed only once \"a secure border\" is in place. \"A secure border\" being largely a matter of conjecture, there is no way to know how or when the second phase dealing with the 11 million might ever be attempted, let alone resolved. Wisconsin Gov. Scott Walker and Florida Sen. Marco Rubio each have offered muddy views on the issue. Republican presidential candidate Donald Trump wants to deny citizenship to the babies of immigrants living in the U.S. illegally as part of an immigration plan that emphasizes border security and deportation for millions. He would also rescind Obama administration executive orders on immigration. Republican presidential candidate Donald Trump wants to deny citizenship to the babies of immigrants living in the U.S. illegally as part of an immigration plan that emphasizes border security and deportation for millions. He would also rescind Obama administration executive orders on immigration. The dodge works so long as Republicans are allowed to remain vague. But Trump just broke the party compact: He got specific. Trumps plan is an assault on legal and illegal immigration across multiple fronts. He wants to shut off employment to illegal immigrants by expanding the e-verify system, which checks the legal status of job applicants (and job holders), nationwide. He wants to \"impound\" remittance payments from illegal wages, undermining a key rationale of illegal employment. He calls for an end to birthright citizenship, but also a limit on issuing new green cards and new restrictions on hiring high-skills immigrants. He wants to triple the number of Immigration and Customs Enforcement agents working to root out undocumented immigrants. If your goal is to drive millions of undocumented immigrants south across the border, Trumps plan looks like a winner. In effect, Trump would significantly increase deportations while enacting enforcement policies intended to bring about Mitt Romneys vision of mass \"self-deportation.\" Its an easy set of concepts for voters to grasp and for debate moderators to probe. Which of the other candidates will sign on? Which side are they on: mass deportation or mass law-breaking? Walker said Tuesday that Trumps blueprint is \"very similar\" to his own plan. The conversations are furious and exasperated: \"When will it end?\" \"How is he leading?\" \"What do we do about him?\", These are the sounds in campaign headquarters of candidates not named Trump. In these offices, solving for the Donald has become a major distraction and disruption. Who are his supporters?... The conversations are furious and exasperated: \"When will it end?\" \"How is he leading?\" \"What do we do about him?\", These are the sounds in campaign headquarters of candidates not named Trump. In these offices, solving for the Donald has become a major distraction and disruption. Who are his supporters?... Amusingly, Bush and Kasich may be the chief beneficiaries of Trumps astringent effect. Theyve already defined the soft side of the party on immigration. But now the hardliners must come clean: Do they ratify what establishmentarian Bush has been saying all along? Endorse Trumps new standard? A hypocrites dodge threatens to become a Hobsons choice. Trump has been leading the Republican pack in polls, with about a quarter of the vote. Now, with his first real policy proposal, he has almost certainly solidified his hold on the partys most virulently anti-immigrant voters. Only 9percent of Republicans in a July CNN/ORC poll said illegal immigration would be their top issue in voting for a president. But drawing hard, punitive lines against people on the margins never seems to lose its appeal to the Republican base. It will be difficult for an eventual Republican nominee to navigate Trumps challenge without alienating either the anti-immigrant cohort that he is energizing or mainstream voters. And it could get worse. What if Trump gets specific on other policies? Taxes. Health care. Retirement security. Climate change. Bombing Iran. My Bloomberg View colleague Jonathan Bernstein calls Republicans a \"post-policy\" party for their reliable reluctance to fashion policies that are structurally sound and politically viable. The key is maintaining a perpetual fog. (Repeal and replace Obamacare! With something. Pass Paul Ryans budget! As long as it doesnt become law.), In the greatest irony, Trump has the capacity to exploit the void, forcing vaguer Republican candidates to respond to his specific proposals. He is making immigration a nightmare for Republicans. Other bad dreams could follow. Bloomberg, Francis Wilkinson writes on politics and domestic policy for Bloomberg View.]", "Date": "20150818", "Author": "[ Francis Wilkinson]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-donald-trump-immigration-deportation-20150818-story.html", "Title": "[ Donald Trump is making immigration a nightmare for Republicans]"}