{"Content": "[ Jeb Bush is asking us to do the impossible  forget that hes the son of one president and the brother of another. Im my own man, he protested at a much-heralded meet-the-Bush-you-dont-know speech on foreign affairs in Chicago last week. Alas, this declaration of independence didnt withstand his first major effort to address the dynasty question. Instead of getting us to see a different kind of Bush, he reminded us his big brother had made precisely the same point in almost the same language at roughly the same juncture in an election. And George W. was half right. When it came to separating from his father, he was his own man. He may have taken the separation business a bit too far, leaving his real dad so far behind in favor of a surrogate father, Dick Cheney. As Jeb wages his own struggle with his last name, his problem isnt so much to differentiate himself from his fathers one-term presidency as it is to avoid reminding voters of the trauma of the eight years his brother was in office. You have to follow the bouncing Bushes here. George W. played out the father problem, treating dads presidency as a template for what not to do. No way did he approve of Dad resisting calls to take the Gulf War beyond Kuwait, or doing the right thing by raising taxes to tackle dangerous deficits. For his trouble, Dad got booted out of office. George W. got to act out his separation fantasies after Sept. 11. Whether he was overcompensating psychologically or politically for his fathers alleged wimpiness, or merely acting under bad-dad Cheneys influence, George W. undertook the disastrously misbegotten invasion and occupation of Iraq, a catastrophe that would define his presidency. Jeb Bush was mere seconds into his speech Wednesday informing the world that hes his \"own man\" and not his brother or his dad, when he did something reminiscent of both. He flubbed his line. \"We definitely no longer inspire fear in our enemies,\" the nominal front-runner for the Republican presidential... Jeb Bush was mere seconds into his speech Wednesday informing the world that hes his \"own man\" and not his brother or his dad, when he did something reminiscent of both. He flubbed his line. \"We definitely no longer inspire fear in our enemies,\" the nominal front-runner for the Republican presidential... We still live with the consequences  and Jeb is left with some explaining to do, even as his brother peacefully whiles away the days with his paints and brushes in his art studio in Texas. In Jebs Chicago speech, there was a moment when it looked as if he might admit that George W. had made a boo-boo in Iraq even if it was couched in an unsatisfying mistakes-were-made way. There were mistakes made in Iraq, for sure, Jeb declared. But then he quickly blame-shifted, attributing the mistakes in question to the intelligence community in multiple countries whose information on weapons of mass destruction turned out not to be accurate. In any case, he added, whatever mistakes were made under his brothers watch were mere peccadillos compared with the mess President Barack Obama has made by withdrawing U.S. troops from Iraq. Slam-dunk. Jeb isnt the first presidential hopeful to be burdened with an albatross of a brother. Think beer pitchman Billy Carter or rock musician/felon Roger Clinton, named Headache by the Secret Service on account of all the trouble he stirred up. For much of his adult life, W. seemed on the road to becoming a rich mans Billy Carter  and these days, Jeb is probably wishing he had kept on that path. But instead George W. stopped drinking, found religion and the rest is history  ours, unfortunately. By and large, presidential siblings only hurt themselves, not the candidate or the country. W. is a one-man weapon of mass destruction for Jeb. Foreign policy is a complicated and bottomless topic, which forces politicians to address it with abstract words and punchy sound bites. Smart politicians know the difference between the messy realities and the simple pictures they paint. The danger lies with politicians who mistake the slogans... Foreign policy is a complicated and bottomless topic, which forces politicians to address it with abstract words and punchy sound bites. Smart politicians know the difference between the messy realities and the simple pictures they paint. The danger lies with politicians who mistake the slogans... That his older brother got to the White House first must be particularly galling for Jeb, who was groomed as the good brother who was destined to go furthest. George was the party-hearty sort during the first 20 years of a checkered career, coasting through school on the gentlemans C plan, getting bailed out of oil busts. Meanwhile, Jeb worked hard and played by the rules. As his dad George H.W. advised, Jeb made his fortune before making a bid for office, and slowly climbed the party ladder in South Florida. Then, W.s career took a sudden spike upward when he became part owner of the Texas Rangers. He won his 1994 race to become Texas governor in a walk. That same year, Jeb lost his first bid for governor in Florida. Barbara Bush went around exclaiming, Can you believe it?, By the time Jeb won, in 1999, it was too late. In 2000, he was relegated to the post of warm-up act, introducing W. as my older, smarter and wiser brother. George joked that if Jeb didnt deliver the Sunshine State, hed be washing my car over vacation. Scrubbing Georges pickup might have been preferable to the self-abnegation that was in store for Jeb. The vote in Florida seesawed with W. naming his brother the controlling legal authority, a role the governor-brother initially shunned but eventually accepted. I cant recuse myself from my constitutional duties as governor, he said. I cant recuse myself frankly of being my brothers brother, either. The longer the recount went on, the more Florida came in for ridicule for its seniors who drive too slowly, eat too early and can manage 12 bingo cards but not a butterfly ballot. Antiquated voting machines churned out chads, raising suspicion that the Bush clan had rigged the election like some banana republic dynasty. Consideration was given to the idea of resolving the recount by Jeb naming a slate of electors to defeat the popular vote, which would have made him the first governor to award the presidency to his own brother. Instead, Jeb punted to Secretary of State Katherine Harris, who relished the fight. In the end, the U.S. Supreme Court pulled George across the finish line. The good news for Jeb is that unlike Billy Carter and Roger Clinton, George W. seems happy to stay out of the spotlight. Maybe in exchange for his continued silence, Jeb can promise George that he will be commissioned to execute the official portrait of the 45th president. Bloomberg News, Margaret Carlson is a columnist for Bloomberg View.]", "Date": "20150223", "Author": "[ Margaret Carlson]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/chi-jeb-bush-george-bush-president-election-2016-20150223-story.html", "Title": "[ Jeb Bush struggles under the dynasty thing]"}