{"Content": "[ Convicted child killer arrested at Indianapolis library, INDIANAPOLIS  A LaPorte County man once convicted of killing two young siblings has been arrested in Indianapolis. A Marion County Sheriffs Office spokeswoman says Richard Dobeski was arrested for failing to register as a sex offender. Sheriffs deputies captured the 67-year-old Dobeski at the Central Library downtown. Dobeski was released from prison July 16 after serving more than seven years on 2008 convictions for molesting a 7-year-old boy and possessing child pornography. He was required to register as a sex offender within seven days of his release. Dobeski originally was released from prison in 2003 after serving less than half of a 40-year sentence for the murders of 6- and 3-year-old siblings in Long Beach. It wasnt immediately clear whether Dobeski has a lawyer. Authorities round up 20 bison that escaped from Indiana farm, PIERCETON, Ind.  Police and animal control officers rounded up a herd of about 20 bison Thursday that escaped from their enclosure. The bison, including five calves, escaped Wednesday night from a farm near the town of Pierceton, about 30 miles northwest of Fort Wayne, Kosciusko County Sheriffs Department spokesman Sgt. Chad Hill said. Authorities learned of roaming buffalo when a homeowner called to report three of them walking across her yard, Hill said, Police and animal control officers  some on horseback and others on all-terrain vehicles  traversed a large rural property trying to round up the bison. Hill said crews herded them into pens and were bringing in trucks and trailers so they could be returned to their farm. Kosciusko County issued a traffic advisory Thursday morning for State Route 13 to keep drivers on alert while the bison were still loose. The county also closed one rural road. Hill reported the owner said the bison can be extremely mean and aggressive, especially with calves in the herd. \"Even without that, they are aggressive,\" he said. Suit: S. Indiana worker fired for opposing same-sex marriage, INDIANAPOLIS  A former employee of a southern Indiana county clerk says she was fired over her religious objection to processing a same-sex couples marriage application. Linda G. Summers of Corydon says in a federal lawsuit filed last week that Harrison County Clerk Sally Whitis violated her civil and religious rights by firing her last year after Summers raised objections. Indiana had a same-sex marriage ban that was struck down by a federal court last year. The suit alleges that Whitis told employees after the ruling that they were \"only doing the paperwork and not performing their ceremony.\", Whitis and the Harrison County attorney declined to comment. Summers says she is a Christian with a \"sincerely held religious belief\" against gay marriage. Indianapolis to host 2016s US Conference of Mayors meeting, INDIANAPOLIS  Indianapolis has been chosen to host next years annual meeting of the U.S. Conference of Mayors and officials say the event could attract presidential candidates. Mayor Greg Ballard and Visit Indy President Leonard Hoops announced Tuesday that the annual gathering of mayors will be held in Indianas capital in June 2016. The convention will draw nearly 300 leaders from the nations largest cities and is projected to generate nearly $1 million in revenue for city businesses. Hoops says the conference is expected to draw presidential candidates and national media because it will come not long before the Democratic and Republican national conventions. He says that when this years meeting was held last month in San Francisco, both President Barack Obama and Hillary Clinton spoke. Woman in recorded Indiana Wal-Mart fight pleads guilty, INIDIANAPOLIS  One of two women whose fight at an Indiana Wal-Mart was caught on cellphone video has pleaded guilty to disorderly conduct. WISH-TV and WXIN-TV report 39-year-old Rebecca Mills accepted a plea deal to the charge stemming from a June fight in a Wal-Mart store in the Indianapolis suburb of Beech Grove. A judge sentenced her to 40 hours of community service and ordered her to stay away from all Wal-Mart stores in Marion County. A court hearing is scheduled later this month for 34-year-old Amber Stephenson, the other woman who authorities say was involved in the fight. Cellphone video of the fight showed two women yelling and then punching and kicking each other, and a young boy hitting one with a shampoo bottle. --Associated Press]", "Date": "20150723", "Author": "NULL", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-state-briefs-st-0724-20150723-story.html", "Title": "[ State briefs]"}