{"Content": "[ Glenbard Township High School District 87 made a little-noticed wire transfer to the state two years ago, $164,198 that was never discussed in public. What taxpayers werent told was that the payment was required by state law because the west suburban district had given hefty pay hikes to two retiring educators, helping fatten their pensions. A 2005 pension law was intended to rein in big salary spikes that boost retiree benefits and pension costs statewide, imposing cash penalties on districts that gave raises larger than 6 percent to outgoing educators. But over the last decade, hundreds of school districts paid the so-called penalties and doled out steeper raises anyway, state data show, pushing some administrator salaries higher than $300,000, and, in one case, $400,000. In a double whammy, local taxpayers had to foot the bill for those salary spikes, as well as the special penalty payments required to cover higher pensions from the raises. Those payments ran as high as hundreds of thousands of dollars in some districts, and the penalty price tag statewide rose to $38 million by 2014  money that could have been used for student instruction or to cover deficits as schools struggled in a tough economy. As Illinois grapples with its massive pension obligations, the 2005 law sticks out as one reform that did not run afoul of constitutional mandates to safeguard pension benefits. Key provisions targeted the Teachers Retirement System of the State of Illinois for suburban and downstate teachers  the largest state pension system and among the worst-funded in the nation. The intention was to give no more than 6 percent salary increases to retiring teachers, administrators and other educators, because higher salaries boost benefits in retirement calculations. Districts going over the 6 percent could face extra payments to the Teachers Retirement System  commonly referred to as penalties though TRS uses the term \"excess salary increase\" contributions. Gov. Bruce Rauner has recommended changing the law to restrict the raises to no larger than the rate of inflation, typically far lower than 6 percent. Theoretically, that would give districts more incentive to curtail big raises. But history shows that under the original law, the vast majority of districts were willing to exceed the salary caps, whether for one or dozens of educators. Of some 48,000 educators who have retired since the law was enacted in mid-2005, about 4,800 got raises of 20 percent or higher, and some 15,000 got raises of more than 6 percent just before retiring, according to a Tribune review of TRS pension and salary data for each retiree. Some districts found the law confusing  thinking the raises wouldnt trigger penalties  and an array of exemptions allowed other districts to get out of paying penalties. Pay hikes above 6 percent for about 7,600 educators did trigger payments to TRS  some tiny but others massive  though taxpayers may not have known about them. \"They didnt want any of this to see the light of day,\" said former school board candidate Don Popravak, who is critical of what he calls \"reckless spending\" in the one-school Homewood-Flossmoor Community High School District 233. The school board gave then-Superintendent Laura Murray 20 percent raises two years in a row leading up to her retirement in 2008, records show, pushing her final earnings to $402,331. She now gets an annual pension of about $288,000. \"It was crazy. What they forget is that it was taxpayer money,\" said Popravak, who failed in his campaign for a spot on the District 233 school board this year. Murrays pay increases triggered an excess salary penalty of $225,884  the largest such penalty in the state since the 2005 law was enacted. The district contested the penalty in various hearings and court cases but failed in its appeal. When it came time to pay up in 2009, the districts business manager wrote to the Teachers Retirement System: \"Please note that this payment is being made under protest.\", Murray did not return phone calls and was unavailable when a reporter requested to speak to her at her home in Olympia Fields. District spokeswoman Jodi Bryant said the board properly discussed litigation matters in closed session and didnt vote on the TRS penalty because it had no choice in the matter  the penalty was required. In Glenbard 87, officials acknowledge that a penalty of $133,943 in connection with former principal and district administrator Pamela Zimmermann was never discussed in public or voted on by the school board. It was treated as a routine, retirement-related payment, they said, and it was the bulk of a wire transfer to the Teachers Retirement System in March 2013. \"Had there been a practice in place to approve TRS payments, we would have had the board vote on it,\" said Superintendent David Larson. \"There was no intent to mislead or not follow the protocol.\", Larson said he would discuss with staff whether penalty payments in the future should be approved in public by the board. He came to the district after Zimmermann retired in 2009. Glenbard had made penalty pension payments for 13 educators over the years, but the biggest by far was connected to Zimmermann. Her annual earnings rose by about 15 and 27 percent in the two years before retirement, boosting her final salary to about $226,000, according to TRS records. The resulting penalty was the third highest in the state since 2005. The district challenged the penalty, believing the raises shouldnt trigger a special payment, but it lost its appeal. In an email to the Tribune, Zimmermann said administrators were offered the same salary boosts as teachers in the two years before retiring, and she didnt know her case had triggered penalties. \"I was not aware of any penalties until you brought them to my attention,\" said Zimmermann, who receives an annual pension of $156,206. She began working at a private college after retiring from Glenbard. The sprawling Schaumburg-based School District 54 also went to court to challenge penalties in connection with several administrators, but it, too, was unsuccessful. In all, the district paid penalties for 56 educators, totaling $1.27 million  the highest price tag in the Chicago area. The next highest payments were in Elgin-based School District U-46, Valley View School District 365U in Will County and Waukegans School District 60 in Lake County, all spending more than $700,000 on penalties. The payments in Schaumburg included a penalty of $122,386, the fifth highest in the state since 2005. It was related to Mohsin Dada, a top financial administrator who got salary boosts exceeding 20 percent during his tenure, pumping up his final earnings to about $352,000 before retiring in 2011. His annual TRS pension is about $262,000. Dada is now a chief financial officer in North Shore School District 112, earning more than $200,000 and contributing to another, non-educator pension system. He did not return messages left for him at his district office. District 54 spokeswoman Terri McHugh said the district believed Dada and other educators were exempted from the penalties based on a reading of the law. In south Cook Countys West Harvey-Dixmoor School District 147, where nearly all students are low-income, the district paid a penalty of $104,653, the states eighth highest special payment since the law took effect. The district gave then-Superintendent Alex Boyd Jr. at least two double-digit percentage pay increases, boosting his salary to about $260,000 by the time he retired in 2011. Boyd was able to keep his annual pension, now at about $212,000, after a criminal case related to spending irregularities in the district. He pleaded guilty to misdemeanor charges of official misconduct. TRS spokesman David Urbanek said the system would suspend a members pension upon conviction of a felony, but \"under the law, (Boyd) would not lose his pension if he was found guilty and sentenced under a misdemeanor.\", Boyd could not be reached. He did not return a message left with a relative. That districts have continued to give hefty raises, despite the law, came as a surprise to state Rep. Thomas Morrison, R-Palatine. He filed a bill in late January for Rauner on reducing the 6 percent raises used in the law. The bill has stalled in the General Assembly, but Morrison still feels strongly about pursuing the change. In the past, \"I have had cases in my district where retirees have gotten 20 percent increases for each of the four years prior to retirement. ... It is just crazy, crazy,\" Morrison said. Even 6 percent raises are significant, he said. \"Twenty percent was a platinum parachute; this (6 percent) is still a golden parachute\" for educators, Morrison said. Last fall, about 70 percent of voters in the Hinsdale Township High School District 86 rejected the notion that educators should get 6 percent raises prior to retirement. The advisory referendum asked voters: \"Shall the Board of Education of Hinsdale Township High School District 86 continue to offer eligible teachers the opportunity to earn six percent (6%) salary increases in each of four (4) school years prior to retirement?\", Rick Skoda was the school board president at the time of the referendum but is no longer serving on the board. He told the Tribune: \"To give any kind of bump over 6 percent is just irresponsible.\", The 2005 law affected not only TRS educators in suburban and downstate school districts but employees at other education entities such as the Illinois State Board of Education, the Illinois Association of School Boards, special education cooperatives and regional offices of education. In all, 825 education entities, mostly school districts, paid one or more penalties to cover enhanced pensions for educators who got raises of more than 6 percent. Chicago Public Schools has its own pension system and was not included in the law. The 6 percent raises come into play when the Teachers Retirement System calculates how much an educator will get in retirement checks. Typically, the educators four highest consecutive salaries in the last 10 years are used in the formula. A penalty can kick in if any one of those salaries increased by more than 6 percent from one year to the next in the same district. Using several factors, TRS first determines the pension with the exact raises included. Then it calculates what the pension would have been had all salary increases been capped at 6 percent. The difference between the pension amounts is used to calculate the penalty. However, several exemptions in the law, which was updated in 2006 to add more exemptions, allowed districts to avoid paying penalties. For example, if a contract was in place prior to the original law taking effect June 1, 2005, \"grandfathering\" provisions would be used to exempt the district from penalties. In some cases, the grandfathering could last for several years. A 2011 memo by a legislative commission noted that about $70 million wasnt paid to TRS because of the exemptions and \"extended grandfathering\" between 2007 and 2009. Roger Eddy, a former lawmaker who now heads the Illinois Association of School Boards, recalls the debate over the 2005 legislation and the \"hundreds of scenarios\" and unintended consequences that he anticipated would make the law very complicated to carry out. \"I think its going to take a long time to unravel the effects of it all,\" Eddy said. drado@tribpub.com, Twitter @diane_rado]", "Date": "20150522", "Author": "[ Diane Rado]", "Link": "http://www.chicagotribune.com/news/watchdog/ct-school-pension-spikes-met-20150522-story.html", "Title": "[ School districts still fatten pensions, pay millions in penalties ]"}