{"Content": "[ Jason Rezaian, the Tehran bureau chief of the Washington Post, wrote two interesting stories from Iran last July  about fear of an epic water shortage and the cult popularity of baseball. Then Rezaian disappeared from the pages of the Post ... because he disappeared into an Iranian prison. After nearly 10 months in custody and just one substantive meeting with a lawyer, Rezaian, an American citizen, is scheduled to go on trial Tuesday in Irans Revolutionary Court on espionage charges. Hes accused of spying for the United States and \"propaganda activities against the system.\" Hes also charged with gathering information \"about internal and foreign policy\" and providing it to \"individuals with hostile intent,\" according to the Post. Those vague catch-all phrases could mean anything a judge decides in a country that guarantees few rights to individuals or the news media and is hostile to foreign journalists. It sounds like hes accused of the crime of being a reporter. No evidence has been presented against Rezaian, leaving little doubt hes on trial because elements of Irans leadership want it that way. He is a hostage. Since his arrest, Rezaian has faced long periods of solitary confinement and severe interrogation, according to the Post. His trial is likely to be closed to observers. The lawyer representing Rezaian and his wife told The New York Times she learned of the trial date from the news media. The Post says it has been asking for months for a visa to allow a senior editor to be present, but it has gotten no response. Martin Baron, the Posts executive editor, said in a statement Tuesday: \"The proceedings against him have been anything but fair and open  if they had been, Jason would never have been subjected to outrageous prison conditions, obstacles to selecting a lawyer, limited time to prepare a defense, and an inadequate window on the case that Iran plans to bring against him. The absence of evidence against him should have led to dismissal of the case long ago.\", The trial of a Washington Post Iran reporter detained in Iran for nearly 10 months will begin next week, a defense lawyer representing the Iranian-American journalist said Tuesday. State TV and other news outlets quoted an unnamed judiciary official as saying the first session of the trial of Jason... The trial of a Washington Post Iran reporter detained in Iran for nearly 10 months will begin next week, a defense lawyer representing the Iranian-American journalist said Tuesday. State TV and other news outlets quoted an unnamed judiciary official as saying the first session of the trial of Jason... President Barack Obama and Secretary of State John Kerry have called on Irans government to drop the charges and release him. It seems obvious the Post correspondent is being railroaded. What no one outside Iran has figured out is why Rezaian was singled out, what the presumed message is behind it all. The most likely scenario is one familiar to Iran watchers: some kind of dispute in the constant tug of war between religious hard-liners and comparatively moderate government figures. The conservatives, including the intelligence services, are generally suspicious of Irans engagement with the outside world  that includes the nuclear talks, academic exchanges and the work of foreign reporters. Both sides compete for the support of Irans supreme leader, Ayatollah Ali Khamenei. The Times said some Iranian news reports accused Rezaian of being a spy with links to Iranian expatriates in the U.S. and Europe. Rezaian, 39, born in California to an Iranian father, is a vulnerable target because Irans government doesnt recognize dual nationality. He is being treated as Iranian. Brian Stetler and Matt Brandseth, graduates of Wheaton South High School, were stunned when they learned a long-time friend was imprisoned and accused of espionage by the Iranian government. During their first two years of high school, Stetler and Brandseth became fast friends with Jason Rezaian,... Brian Stetler and Matt Brandseth, graduates of Wheaton South High School, were stunned when they learned a long-time friend was imprisoned and accused of espionage by the Iranian government. During their first two years of high school, Stetler and Brandseth became fast friends with Jason Rezaian,... Rezaians wife, Yeganeh Salehi, a journalist who writes for an Abu Dhabi newspaper, also faces prosecution, along with an unidentified photographer. They are being tried in Revolutionary Court, which is distinct from the regular court system. The judge in the case, Abolghassem Salavati, is no friend of justice. He has been known as \"the hanging judge\" since he imposed death sentences on at least a half-dozen defendants accused of participating in protests after disputed 2009 elections. The European Union accuses him of human rights violations. American reporters abroad, and reporters in many countries that dont protect press freedoms, take risks every day to report the news. They should not be punished for doing their jobs. Irans prosecution of these cases is shameful. Follow the Tribune Editorial Board on Twitter and Facebook.]", "Date": "20150520", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-iran-jason-rezaian-edit-0521-20150520-story.html", "Title": "[ An American reporter, hostage in Iran ]"}