{"Content": "[ With Illinois in its second month without a budget, the standoff between Republican Gov. Bruce Rauner and Democrats who control the General Assembly hasnt resulted in a government shutdown. Roads are being paved. Schools are funded for the upcoming year. The poor are getting health care. Drivers licenses are being renewed. State workers are being paid. And state parks remain open. Its estimated that 8 out of every 10 state tax dollars has been freed from the limbo of the budget impasse, much of it either by law or a judges ruling. As for the money thats tied up in the fight, many companies and social service providers are still doing business with the state, taking it on blind faith that eventually there will be a budget and theyll get reimbursed. Others, like state universities, can afford to move money around for several months as they wait for a resolution. Call it the new normal, where money continues to flow despite the absence of a budget. So far, that political dynamic is leaving little incentive for one side or the other to try to strike a deal. \"The governor had an opportunity to create pressure, and he went out of his way to avoid crisis,\" said Chris Mooney, director of the Institute of Government and Public Affairs at the University of Illinois. \"Most chief executives in the past usually set about to make the pain felt, to put the blame on the legislature to force them to come to the table. Not here.\", Gov. Bruce Rauner promised a leaner, more transparent administration than his predecessors, yet hes rigorously following their time-honored practice of asking other departments to sign paychecks for his staff.Among employees doing significant work for Rauner, half their combined salaries  about... Gov. Bruce Rauner promised a leaner, more transparent administration than his predecessors, yet hes rigorously following their time-honored practice of asking other departments to sign paychecks for his staff.Among employees doing significant work for Rauner, half their combined salaries  about... Meanwhile, the state is spending and racking up bills at roughly the same rate as it did last year  $38 billion  while it only expects to take in about $32 billion after much of a 2011 temporary income tax hike expired in January. Both sides agree the state should be more frugal this year, which means that even if a budget deal is reached, spending cuts are likely. But the longer Rauner and lawmakers wait, the sharper the reductions in services will be because theres less time left on the calendar to make them. The battle in Springfield, however, is only partly about budget numbers. Rauner wants lawmakers to take up his broader pro-business, anti-union policy agenda, and vetoed much of the budget to try to get some leverage. That is driving the stalemate. \"The budget piece of this is the easy part of the problem. Thats a math problem,\" said Senate Republican leader Christine Radogno of Lemont last month. \"We need engagement on the reforms.\", Protest downtown August 10, 2015, due to lack of social services during budget battle in Springfield. (WGN-TV), Protest downtown August 10, 2015, due to lack of social services during budget battle in Springfield. (WGN-TV), Money going out, As he vetoed the vast majority of a Democrat-passed budget at the end of June, Rauner approved nearly $7 billion in spending on K-12 education. Thats slightly more than what the state spent last year but less than what the governor called for in his February budget proposal. Rauner campaigned on a pledge to put more money into the states education system. Besides education, a number of recent court actions have allowed Republican Comptroller Leslie Munger to send out money for other key functions of state government. The states approximately 60,000-person workforce is being paid on time and in full after a judge in downstate St. Clair County ruled that withholding worker pay would violate collective bargaining agreements. Salaries and health benefits for state employees amount to about $6 billion a year. Similarly, a federal judge last month ordered the state to make payments to doctors, hospitals and clinics that provide health care to poor people in Cook County. The Rauner administration has since decided to apply that decision statewide and to nursing homes, freeing up the nearly $8 billion that Illinois is projected to spend on Medicaid in the next year. Courts also have stepped in to keep money flowing for foster care services and some human service programs, at a projected yearly cost of $1.1 billion. Its likely that others who rely on state assistance will pursue similar orders if the budget impasse continues. Also going out the door are payments on state debt, pension contributions for teachers and state and university employees, salaries for lawmakers and their staffs, and tax distributions to local governments and mass transit agencies. Each is written into law, meaning the payments are made whether or not a budget is in place. They total more than $9 billion. The court system also is immune from the immediate budget problem. Judges are being paid and the approximately 130,000 people on probation continue to be monitored. Money held up, Tied up in the budget mess is about $3.1 billion in projected spending on early childhood education, senior services, mental health, emergency housing and care for the disabled, among other human service programs. Many social service providers are still getting paid, but thats largely because the state is so far behind on its bills that it is issuing checks for work performed before July 1. But the comptroller is expected to catch up with invoices racked up after that date by the end of August, so payments will start to dry up. That doesnt mean providers will suddenly close their doors, but some already are cutting back to preserve money. A new survey conducted by the United Way of Illinois found that one-third of human service providers have cut the number of people they serve and one-quarter have tapped into lines of credit. One in 5 of the more than 400 human service providers surveyed said they will deplete their cash reserves by the end of the month. \"Right now, were just going to dig into our reserves and ask the bank for more money,\" said Cheryl Prins, owner of Chicago-based Active Visions Inc. which serves more than 500 children and adults with developmental and intellectual disabilities. The series of court orders also sets up a system of winners and losers where some providers are only receiving partial funding. Thats the case for facilities that help people who have developmental disabilities to live at home or in a small group setting instead of a large state facility. While judges have declared that funding should continue to flow to support those services, the Rauner administration says the orders apply only to certain people. Of the nearly 12,000 people living in group home settings, the state can only pay costs for the 1,400 people who receive services that are specifically covered by the orders, the administration has said. If community care providers exhaust their reserves and lines of credit before a budget deal is reached, they could be forced to close down the homes, which would send many people into more costly state facilities. \"A partial payment in no way guarantees that an organization is going to be able to maintain that home,\" said Janet Stover, president of the Illinois Association of Rehabilitation Facilities. Some lawmakers worry that a prolonged stalemate could force an unraveling of the safety net  a vast network of nonprofit organizations that exist to catch people when theyre down on their luck. \"You cant just rebuild that infrastructure once its lost,\" said Sen. Heather Steans, D-Chicago. The situation underscores what some view as a pick-and-choose approach to what gets paid and what doesnt. For instance, the governors office has approved sending towns and counties their share of state income tax dollars, but has held up funding that cities are scheduled to receive from casinos and video gambling machines. Local officials say all of those payments should fall under a law allowing them to go through without a budget in place, but the governors office says the state doesnt have the authority to send out the money. Also held up is nearly $2 billion thats used to support state universities. School officials say they are doing what they can to limit the impact on students, and representatives for both the University of Illinois and Southern Illinois University say classes are set to start on time this fall. Thats because the schools plan to dip into reserves in the hope that a budget deal will eventually be reached. And the states bill backlog means payments from last year are still rolling in. Still, schools are weighing various contingency plans should the budget impasse go into December or beyond. Already, U. of I. has implemented an administrative hiring freeze, while SIU has sent layoff notices to some employees whose paychecks are funded by research grants the Rauner administration cut. SIU is running scenarios in which it would have to close school museums or cut help for regional economic development groups. In addition, the school is hiring graduate assistants for a semester at a time instead of the usual yearlong agreement. \"We have a plan to keep ourselves going and to meet payroll and continue to offer classes, and we can do that for about half of the year. If we get to December and January and we dont have funds, then we will have a bigger problem,\" said SIU spokeswoman Rae Goldsmith. \"Its just hard to reach a conclusion when we cant predict the outcome.\", Whats next, Even in the politically charged environment of Washington, D.C. where full budgets are rarely passed in time for the start of a new financial year, feuds between the two branches of government rarely spill beyond the halls of Congress and the White House. Typically, the two sides will grant a short-term extension that keeps money flowing to the people who depend on it while the political fight plays out. That hasnt been the case in Springfield. House Speaker Michael Madigan and Senate President John Cullerton sent Rauner a one-month temporary budget in July, but Rauner didnt act on it. Even with so much money flowing out of the states main checking account, Illinois will eventually need a budget, said Charles Wheeler III, an expert on state government at the University of Illinois at Springfield. \"For example, at the state prisons, there is money to pay guard salaries. How about to buy food for the prisoners? Or gas for the state troopers cars?\" Wheeler said. \"The salaries are just a portion of operations.\", As a candidate, Rauner pledged to \"shake up Springfield,\" and indicated he was willing to force a government shutdown to push through his agenda. Rauner wants to make it tougher for injured workers to win claims against employers, to limit big-dollar damage awards in civil suits, and to eliminate requirements for school districts and cities to collectively bargain wages with employees, saying the changes would spur economic growth. Democrats allied with organized labor say the governors agenda is bad for the middle class. Without the calamity of a shutdown to force either sides hand, Democrats and Rauner-led Republicans appear poised to test how long the state can live without a deal. \"I suppose what it will take is people dying or buildings collapsing or prison riots, something to jolt these people into sitting down and making a reasonable compromise,\" Wheeler said. The two sides do seem to agree on legislation to free up nearly $5 billion in federal funds for programs that help senior citizens, low-income families, domestic violence victims, refugees and kids. That money, which is separate from the state tax dollars at issue in the budget fight, could provide much-needed cash for some programs caught in the middle of the stalemate. But for those whove been unable to get their bills paid, the situation feels like a \"death march,\" said Al Riddley, a board member for the Illinois Partners for Human Service. \"Perhaps its time we change our state motto from Land of Lincoln to We Dont Care,\" Riddley said. Garcia reported from Springfield. kgeiger@tribpub.com, mcgarcia@tribpub.com]", "Date": "20150810", "Author": "[ Kim Geiger, Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-illinois-budget-new-normal-met-20150809-story.html", "Title": "[ Illinois' new normal: No budget, but money still flowing]"}