{"Content": "[ Jim Lurgio worked for the Chicago Park District for 35 years, starting out as a seasonal laborer before eventually being hired on as a full-time driver for most of his career. Now 76, Lurgio wants to know how its legal for the Park District to take away his cost-of-living adjustment, commonly known as a COLA, when judges recently determined similar reductions to pension benefits for state and city workers to be unconstitutional. \"They violated our contract,\" said Lurgio, who now lives in southwest suburban Frankfort. \"I dont know why they did this to us.\", The law allowing cuts to pension benefits for Park District employees and retirees, signed by then-Gov. Pat Quinn in 2014, could be the next to face a legal challenge. For the first time, Park District retirees arent receiving a COLA, which is suspended this year as part of the overall package aimed at making the pension fund whole. That part of the pension law, which also required increased contributions from both the Park District and its employees, is now the focus of opposition for SEIU Local 73, the Park Districts largest union representing about 2,000 year-round employees. While most of the law was negotiated with the unions, Local 73 officials claim that the reduction to retirees benefits was not. Buoyed by the recent court rulings on other pension funds, the union is exploring its legal options. A flier foreshadowing a lawsuit that hasnt yet been filed circulated this week, generating excitement among union members, said Adam Rosen, Local 73 spokesman. When Lombards village manager cut a deal to retire, he not only got $103,000 in end-of-career payouts, but tucked into his exit agreement was a provision that could eventually be far more lucrative. The deal included language that let him take his payouts for severance and unused vacation time... When Lombards village manager cut a deal to retire, he not only got $103,000 in end-of-career payouts, but tucked into his exit agreement was a provision that could eventually be far more lucrative. The deal included language that let him take his payouts for severance and unused vacation time... \"We have a change thats affecting our members in a really negative way,\" Rosen said. \"And if its unconstitutional, we have to challenge that.\", Why sue now?, Rosen said Local 73, which was a plaintiff in the case regarding the state pension law, was waiting for resolution on that case before filing another. In May, Illinois Supreme Court justices ruled that the landmark pension law for four pension systems operated by the state was in violation of a clause in the 1970 Illinois Constitution, which states pension benefits \"shall not be diminished or impaired.\", More recently, last month, a Cook County Circuit Court judge rendered a similar judgment on reductions to pension benefits for some of Chicagos municipal workers. The city is appealing that decision to the Illinois Supreme Court. Local 73, which represents more than 28,000 workers in total, actually supported the citys plan, even though it similarly reduced benefits for retirees. The difference, according to Rosen, is that those reductions were negotiated, whereas the Park District laws reduction of COLAs for retirees was not. The Illinois Supreme Court on Thursday agreed to quickly consider an appeal of a lower court ruling that struck down pension fund changes Mayor Rahm Emanuel engineered to lower taxpayer costs but also hit current and retired city workers in the pocketbook. In a brief order, the court agreed to... The Illinois Supreme Court on Thursday agreed to quickly consider an appeal of a lower court ruling that struck down pension fund changes Mayor Rahm Emanuel engineered to lower taxpayer costs but also hit current and retired city workers in the pocketbook. In a brief order, the court agreed to... Illinois is one of only six states in the country to have a constitutional provision specifically protecting against changes to pension benefits, said Peter Kiernan, a national expert on public finance and an attorney with Schiff Hardin. The others are New York, Arizona, Michigan, Alaska and Hawaii. \"Given Illinois constitutional guarantee, recent court decisions, and its union-dominated politics, it clearly is one of the hardest places to solve a pension funding problem,\" Kiernan said. \"I dont see how real pain to many can be avoided.\", Kiernan said he considered the Park Districts pension reform to be \"fairly innovative\" with increased contributions from both sides and a closed amortization period. But the recent court ruling with the city pension fund, in particular, could mean the Park Districts own reduction to retiree benefits would be considered unconstitutional. Retirees have the strongest legal rights, he said, because they cant go back to work. \"The pattern here is so similar to the Chicago pension case,\" Kiernan said, \"I would imagine the court is not going to uphold it.\", The Park District declined to make Chief Financial Officer Steve Lux available for questions, Dean Niedospial, executive director of the Park Districts pension fund  the Park Employees Annuity and Benefit Fund  also could not be reached. But after the Illinois Supreme Court decision in May, Niedospial wrote a letter to Park District employees explaining the ruling had no bearing on recent changes to their benefits. \"The problem with the Park Employees Fund was that even with the employees and the employer making their required contributions, the fund would be insolvent in 10 years or less,\" Niedospial wrote. Pension reform has largely saved it from that fate, said Lawrence Msall, president of the Civic Federation, a nonpartisan budget watchdog group. If the law is overturned, the benefits for Park Districts employees and retirees would be more vulnerable in the future, he said. \"The reform in place is far better than the status quo,\" Msall said. The benefit changes resulted in a decrease of $109.4 million in unfunded liability in fiscal year 2013 from what it would have been had the law not been enacted, according to the Civic Federations analysis. By Dec. 31, 2014, the Park Districts pension fund was 43.7 percent funded, down from 45.5 percent in the previous year, according to the pension funds 2014 annual financial report. But that decrease just reflects that the Park Districts contributions were still less than the amount needed to fully fund the pension fund in the future, according to Civic Federation officials. The increased contributions under the new law, from both employers and employees, didnt go into effect until this year. The plan is designed for the pension fund to be 90 percent funded by 2049 and 100 percent funded by 2054. To get there, the package includes increased contributions from the Park District  including $75 million in supplemental contributions by 2019  and phased-in increases in employee contributions. It also raises the early retirement age for some employees from 50 to 58, while decreasing the normal retirement age for others. And theres the COLA issue. The flat, 3 percent increase is suspended in 2015, 2017 and 2019. In other years and going forward, its the lesser of 3 percent or half the rate of inflation. A legal challenge could mean a very uncertain future for all parties involved. \"If the union sues and wins, you could be going back to square one where you have a situation where the pension fund could collapse in 2023,\" Kiernan said. From Lurgios perspective, its a matter of fairness. He paid toward his pension COLA for years as a Park District employee. Last month, for the first time since reaching the eligible age in retirement, he didnt receive his COLA, which usually amounts to a $900 annual increase. \"I would say I did my part for 35 years,\" Lurgio said. gtrotter@tribpub.com, Twitter @GregTrotterTrib]", "Date": "20150817", "Author": "[ Greg Trotter]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-chicago-park-district-pension-reform-met-20150817-story.html", "Title": "[  Chicago Park District pension law could face challenge]"}