{"Content": "[ Roman Catholic leaders in the early voting state of Iowa implored candidates for president Thursday to take up Pope Francis call for \"profound political courage\" by focusing their campaigns as much on improving the environment and income inequality as they have on opposing gay marriage and abortion in past elections. The vocal pivot from such traditional social issues marks the first time U.S. Catholic bishops have publicly asked those seeking the White House to heed the admonitions of Francis June encyclical, said Bishop Richard Pates of Des Moines. In Francis major teaching document, the leader of the worlds 1.2 billion Catholics called for a \"sweeping revolution\" to correct a \"structurally perverse\" economic system that allows the rich to exploit the poor and has turned the Earth into an \"immense pile of filth.\", \"These are going to be difficult decisions that have to be made,\" said the Rev. Bud Grant of Davenport, joined at a news conference by bishops from central and eastern Iowa. \"Politicians have to have the courage to do the right thing, and not necessarily the politically expedient thing.\", The push from bishops threatens to disrupt the historically reliable alliance of evangelical Christians and conservative Roman Catholic voters, putting pressure on Republicans who have leaned on their religious faith to guide them on social issues. It will also focus attention on how the six Roman Catholics seeking the 2016 Republican presidential nomination will wrestle with a popes teachings on economics and climate change that clash with traditional Republican ideology. While Francis has condemned abortion and upheld marriage as the union of a man and a woman, he has not done so with anything approaching the frequency of his two predecessors. Instead, Francis has urged church leaders to talk less about such social issues and more about mercy and compassion, so that wayward Catholics would feel welcome to return to the church. Pope Francis will meet with homeless people, immigrants and prisoners during his upcoming trip to Cuba and the United States. Hell also preside over a meeting about religious liberty a major issue for the U.S. Catholic Church in the wake of the Supreme Courts gay marriage decision. The Vatican... Pope Francis will meet with homeless people, immigrants and prisoners during his upcoming trip to Cuba and the United States. Hell also preside over a meeting about religious liberty a major issue for the U.S. Catholic Church in the wake of the Supreme Courts gay marriage decision. The Vatican... \"Pope Francis hasnt changed church teaching, but he has given greater salience to social welfare and environmental issues, which has put Catholic Republicans in an awkward position,\" said John Green, director of the University of Akrons Bliss Institute of Applied Politics, \"particularly if they want to also claim, like many of them do, that religion is important to them.\", Francis is expected to highlight the issues in September when he makes his first visit to the U.S. where he will address a joint session of Congress and the U.N. General Assembly. Bishops beyond politically important Iowa plan to do so as well. Church leaders in Cincinnati, Ohio, and Richmond, Virginia, plan events related to the encyclical in August, according to the Catholic Climate Covenant, which works with American bishops on the environment. In Florida, Miami Archbishop Thomas Wenski is planning sermons and events to amplify the popes call for action to curb global warming. Wenski is the U.S. bishops point person on the environment. Pope Francis was about to take a major step backing the science behind human-driven global warming, and Philippe de Larminat was determined to change his mind. A French doubter who authored a book arguing that solar activity  not greenhouse gases  was driving global warming, de Larminat sought... Pope Francis was about to take a major step backing the science behind human-driven global warming, and Philippe de Larminat was determined to change his mind. A French doubter who authored a book arguing that solar activity  not greenhouse gases  was driving global warming, de Larminat sought... \"There is today broad consensus among scientists that climate change presents real threat to human flourishing on this planet,\" Wenski said after the encyclical was released. \"The church cannot be indifferent,\". The GOP candidates vary marginally in their approach to the issues Francis addressed in the encyclical, in which he criticized deregulated free-market economics and argued that climate change was predominantly caused by humans. To date, most have taken the approach that Francis crossed beyond spiritual matters and into public policy. Jeb Bush, for example, said he agrees with Francis that human activity has contributed to global warming, but does not go as far as the pope, who holds people, not nature, mainly responsible. \"I dont go to Mass for economic policy or for things in politics,\" Bush added. Campaigning in Iowa on Thursday, GOP presidential contender Bobby Jindal said Francis call to regulate the economy to assist the poor overlooks the principle that a less constrained economy can benefit the poor. \"The best way to lift people out of poverty and improve incomes for men and women is to provide more good paying jobs,\" the Louisiana governor said in an emailed statement. And he said thats done with policies that help small businesses grow, not by government \"edicts.\", Bush and Jindal are Roman Catholic. Their opinion is echoed by many conservative Republican activists in Iowa and elsewhere. \"I think hes got it all wrong,\" Loras Schulte, a Catholic and a state Republican committee member from northeast Iowa, said of Francis. \"On matters of faith, I will certainly hear him. But these are not matters of faith.\", Steve Scheffler, a Republican and leader in the states evangelical Christian community, said Francis writings may peel some Catholics away from the coalition of evangelical pastors and conservative priests united by their position on issues like abortion. While Scheffler said that would be unlikely to affect the states Republican caucuses in February, it could impact how Iowa votes in November 2016. \"You see a lot of coalitions of Catholics and evangelicals working on the life issue together,\" Scheffler said. \"You could lose some Catholics to this. Some priests buy into that whole social justice, income distribution thing. But not all of them.\", Associated Press]", "Date": "20150702", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-catholics-republicans-pope-francis-20150702-story.html", "Title": "[  Catholic leaders to GOP: Heed pope on climate, poor ]"}