{"Content": "[ They showed up by the hundreds. They stood in line under the hot sun for hours. They carried paper cut-outs of Donald Trumps face. They folded into the seats of a high school auditorium here, hard rock music pulsating, and got ready to ask questions of the bombastic billionaire they hope to elect president. This was Trumps first New Hampshire town hall meeting, and the place was crackling. A few minutes in, a man in the crowd shouted, \"Isnt Jeb sinking to the bottom of [Lake] Winnipesaukee by now?\", \"Ahh,\" Trump replied, \"these are my people.\", Jeb Bush wasnt at the bottom of any lake. He was 19 miles down the road from Derry, giving a workman-like performance before a sedate crowd of about 150 at a Veterans of Foreign Wars post in Merrimack. Then Bush went on the attack. He fired his toughest shots to date at Trump, saying the businessman \"doesnt have a proven conservative record\" because he is a former Democrat who once supported tax hikes and a single-payer healthcare system. In this first-in-the-nation primary state tailor-made for a center-right, business-friendly, establishment-approved candidate, Bush is caught uncomfortably between the rising forces on his right and left. He has been unable to assert himself as the alpha candidate that many Republicans expected he would be. The dynamic here reflects the extent of the broader tumult that has gripped the Republican race nationally, with 17 candidates vying for overlapping factions of the party. At the moment, the campaign is dominated by Trump and other political neophytes drawing enthusiastic crowds and preaching an anti-establishment message, though party strategists anticipate attention will shift to more traditional candidates eventually. But for now, at least, Bush faces a squeeze. Ohio Gov. John Kasich is moving swiftly to take advantage of the former Florida governors difficulties and make inroads with the kind of mainstream voters who otherwise would migrate to Bush. Other candidates are trying to creep up as well. New Jersey Gov. Chris Christie, fighting to gain traction here, parried questions at a tavern outside of Manchester. Wisconsin Gov. Scott Walker did the same over in Barrington, while Carly Fiorina  the former Hewlett-Packard executive also rising in the polls  convened a give-and-take with voters in Laconia. Feeling a sense of \"urgency\"  and witnessing the surge of Donald Trump  Wisconsin Gov. Scott Walker said Wednesday hes more willing to take on his own party and to draw clear distinctions between himself and the rest of the Republican presidential field. \"I think before I was trying to be respectful... Feeling a sense of \"urgency\"  and witnessing the surge of Donald Trump  Wisconsin Gov. Scott Walker said Wednesday hes more willing to take on his own party and to draw clear distinctions between himself and the rest of the Republican presidential field. \"I think before I was trying to be respectful... Trump has swooped in to galvanize many on the right here and nationally with his candid tough talk against political correctness and illegal immigration. Trump led the field in New Hampshire with 18 percent, followed by Bush at 13 percent and Kasich right behind at 12 percent, according to a recent Boston Herald/Franklin Pierce University poll of likely GOP primary voters. Trump taunted Bush with his visit Wednesday. Only after Bush had announced his Merrimack town hall meeting did Trump schedule his for the same time in nearby Derry, inviting comparisons between their crowd sizes and performance levels. As Trumps capacity crowd grew restless  chanting \"We want Trump!\"  the candidate held court backstage for a half hour with reporters. He slammed Bush for past comments about immigration, the Iraq war and womens health. \"I dont see how hes electable,\" he said. He added: \"Jeb Bush is a low-energy person. For him to get things done is hard.\", When Trump took the stage, he told the crowd: \"You know whats happening to Jebs crowd just down the street? Theyre sleeping!\", The juxtaposition is not helpful for Bush, who, at a moment when voters want to feel electricity from their politicians, has been criticized for having no spark. But what Bush lacks in populist bravado he makes up for in policy know-how. He deftly discussed the intricacies of education policy for 45 minutes at a forum in Londonderry on Wednesday morning. And at his town hall meeting in Merrimack, Bush went after Trump in response to a voters question. \"He was a Democrat longer in the last decade than he was a Republican,\" Bush said. \"Look, Mr. Trump has clearly got talent. . .But when people look at his record, it is not a conservative record. Even on immigration where. . .the language is pretty vitriolic for sure, but hundreds of millions of dollars of costs to implement his plans is not a conservative plan.\", Still, Bush has failed to consolidate the center-right coalition that made up the base of support here for 2012 primary winner Mitt Romney. There has been no movement en masse toward Bush  especially among activists who have been in the trenches without him during President Barack Obama-era political fights. At an Elks Lodge in Salem, Wednesday, Kasich talked about his record of pragmatism in Congress and as governor as well as his compassion for the poor, the drug addicted and the mentally ill. The message voters came away with: Hes as experienced, practical and fit for office as Bush, but hes the son of a mailman instead of a president. \"Trump doesnt have a clue about government,\" Alan Doak, an undecided Republican, said as he left Kasichs event. \"Bush and Kasich are the only ones with any real experience. And Bush has that name.\", Bushs advisers and supporters say he has a \"long-term\" strategy designed to peak early next year and then carry him through a potentially long nominating contest. \"Hes not turning to page 47 of his policy positions to check his answers,\" said Jamie Burnett, a GOP operative here backing Bush. \"Hes engaging people and giving them real answers.\", Right to Rise USA, the pro-Bush super PAC that raised more than $100 million, is set to begin airing millions of dollars worth of television advertisements in New Hampshire and other early voting states. The first ads are expected to be positive biographical portrayals of Bushs eight years as Florida governor, which advisers believe will help show voters that he is his own man with his own record distinct from his brother and father. A late entrant, Kasich is winning buzzed-about endorsements and has shot up in the polls here amid a multimillion-dollar ad campaign by his allied super PAC, New Day for America. Over the past week, two important members of Romneys New Hampshire team  senior adviser Tom Rath and former state House speaker Doug Scamman  have signed on with Kasich. \"People are thinking, Enough dynasty politics,\" said Jeb Bradley, the state Senate majority leader and a former congressman. Another prominent Romney supporter in 2012, Bradley has not endorsed anyone yet. \"People are looking for new faces.\", Like Bush, Kasichs pitch to voters rests squarely on his record as a center-right conservative governor of a large battleground state. The Ohioan is accused of being overly brusque  during the Salem town hall, he repeatedly cut off verbose questioners  but his animated and unscripted style has resonated with voters averse to political doublespeak. Pacing anxiously, Kasich told the crowd of about 100 that \"Im a conservative with conservative principles, but you just cant do this alone.\", \"Im going to tell you what I think is practical and what I think we can get done,\" he said as he discussed immigration reform. Asked whether Bushs struggles to consolidate the party establishment gave him an opening, Kasich told reporters, \"If you think Im going to answer that question youre nuts.\", Washington Post staff writer Ed OKeefe contributed to this report.]", "Date": "20150819", "Author": "[ Philip Rucker and Jose A. DelReal]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-trump-bush-new-hampshire-town-halls-20150819-story.html", "Title": "[ Bush and Trump face off in New Hampshire - and The Donald is winning]"}