{"Content": "[ After two nights of testimony, suspended Glenview police Officer James Horn awaits a ruling from the village Board of Fire and Police Commissioners on Police Chief William Fitzpatricks request to fire Horn in connection with allegations he lied on the stand during a 2014 Chicago drug trial. Horn, Chicago police Sgt. James Padar and Chicago police officers William Pruente and Vince Morgan have been charged in the criminal matter with felony perjury. The charges stem from a June 2013 drug arrest in Glenview of resident Joseph Sperling and from Sperlings March 2014 trial on charges from that arrest. Horn was put on paid leave starting April 9, 2014, which was then changed to unpaid leave July 2, according to village officials. During the second night of an administrative hearing at Glenview Village Hall, Horns attorney, Daniel Herbert, told the board that the assistant states attorneys prosecuting Sperlings case never gave Horn the chance to see a Glenview squad car video that appeared to directly contradict testimony he gave during the trial. Thus, Herbert said, Horns incorrect testimony was in part because he had not seen the video. Herbert made the statements while questioning Assistant States Attorney Jennifer Dillman, who was also present at the hearing. Glenviews three-person Board of Fire and Police Commissioners will continue hearing testimony tonight in the disciplinary hearing of police Officer James Horn, who has been accused, along with three Chicago police officers, of lying under oath during a 2014 drug trial. Horn has been charged with... Glenviews three-person Board of Fire and Police Commissioners will continue hearing testimony tonight in the disciplinary hearing of police Officer James Horn, who has been accused, along with three Chicago police officers, of lying under oath during a 2014 drug trial. Horn has been charged with... During the trial last March, Sperlings defense attorney introduced the video, which shows a Chicago police officer walking up to the car, reaching through the open drivers window, unlocking the door and having Sperling step out of the car. Sperling then was frisked, handcuffed and led to a squad car while his car was searched. Those details from the video contradicted Horns and other officers testimony that the officer smelled marijuana in the car while waiting for Sperling to hand over his drivers license and insurance, and the officer then ordered Sperling out of the car and found the marijuana inside a backpack on the back seat. After viewing the video, Judge Catherine Haberkorn agreed to quash the search and arrest evidence, leading prosecutors to drop the felony charges against Sperling. Dillman, one of two prosecutors involved in the Sperling trial the day the video surfaced, testified Tuesday before the police board that she wasnt involved in the case before March 31, 2014. She said she prepared all the testifying officers, including Horn, for about 40 minutes and found all their recollections to be substantially consistent. She told the board she had expected a defense motion to quash evidence during the trial to be based on what she called a \"pretextual traffic stop,\" or one that wasnt made because of a real traffic violation. Dillman said she questioned Horn about the way he wrote his traffic stop report as part of her preparation and told Herbert she ultimately believed Horn. But Dillman said she didnt expect the video to appear in court. She said she didnt recall asking whether there was any audio or video evidence, but said her office subpoenaed both Glenview and Chicago police and that Chicago police said there was no video. Another witness Herbert questioned on Tuesday was Jeffrey Rogers, the villages business process manager, whose department is in charge of sending subpoenaed information to prosecutors and defense attorneys. Rogers testified that records show the video, shot from the squad car of former Glenview Sgt. Theresa Urbanowski, was requested by Sperlings lawyer. Although evidence is normally sent to both the defense and the prosecution in such cases, that did not happen in the Sperling case, which was unusual, Rogers said. Rogers said the video might not have been sent to prosecutors because his departments records show the request designated a criminal court branch address with which Glenview officials were unfamiliar. Herberts line of questioning to Dillman prompted objections from Fitzpatricks attorney, Jason Guisinger, who questioned its relevance to the termination hearing. \"Officer Horn made a mistake when he testified. It happens all the time,\" Herbert responded. He said if the states attorneys had reviewed the video and given it to Horn, he would have been able to correct his testimony. Fitzpatrick has not accused Horn of willful perjury, board Chairman Gino DiVito said. \"Were not engaged here about the perjury charge,\" DiVito said. Rather, Fitzpatrick has accused Horn of making false or untrue statement that violated Glenview Police Department regulations, DiVito said. Horn also was accused of, among other things, failing to be properly prepared for court testimony, DiVito said. Fitzpatricks motion asks for Horns termination on the grounds that he violated department regulations by making false or untrue statements, violated the constitutional rights of others and behaved with \"conduct unbecoming a Glenview police officer.\", \"That you say there was somehow a failing in the states attorneys part that is responsible for the charges [Horn] is now facing? I dont see that,\" DiVito said. Horn testified briefly on Tuesday, saying he is a 16-year veteran of the Glenview Police Department who has never received poor reviews or complaints. He said his 2014 court testimony was mistaken, and he agreed that it was based in part on discussions with the other officers involved in the traffic stop. But Horn said it isnt unusual for his memory be refreshed by such conversations, noting that in the Sperling case \"it was a traffic response 10 months prior\" to the court date. \"Did you believe when you testified, that it was a factual testimony?\" Herbert asked. \"Yes, when I testified, that was what I believed had occurred,\" Horn responded. If he had seen the video before the trial, he would have testified differently, Horn said. Horns hearing began Monday and included testimony from him and Fitzpatrick. At that time, the board ruled that all testimony would be heard in open session, denying a motion from prosecutors to hear testimony in closed session. The board also denied their request that testimony be sealed until Horns criminal case is completed. Herbert and Guisinger have until Aug. 4 to deliver closing briefs to the board, DiVito said. Although he did not set a date for rendering a decision, DiVito said the panel has enough information to do so without waiting for transcripts of the hearing. kroutliffe@pioneerlocal.com, Twitter: @pioneer_kathy]", "Date": "20150729", "Author": "[ Kathy Routliffe]", "Link": "http://www.chicagotribune.com/suburbs/glenview/news/ct-gla-horn-discipline-hearing-tl-0806-20150729-story.html", "Title": "[ Glenview officer accused of perjury awaits ruling from police board]"}