{"Content": "[ Given the Fahrenheit follies outdoors, you may not have felt the hot breath from many legislators since Gov. Bruce Rauner proposed a budget for the deadbeat state of Illinois. We sensed that state Sen. Donne Trotter, D-Chicago, was peeved when he said the \"slash-and-burn budget\" positioned Rauner \"as if he was an ISIS warrior fighting a battle, not against the state of Illinois but against the people of Illinois.\" Thanks for your constructive contribution, Senator. Cooler voices won more attentive audiences with more useful arguments, which come down to this: The governors plan for state operating funds would seriously reduce spending on numerous services that benefit good causes and needy Illinoisans. That, unfortunately, is true. Many of Rauners critics, though, voice that declaration but not two others that ought to always travel with it:, First, Rauners budget is his opening volley to Democratic legislators. They know they own the states disastrous financial condition. Yet they can answer Rauner with proposals of their own. Fine. Second, some of the spending the governor would cut has been appreciated by recipients ... but lawmakers never did possess much of the money they spent. Instead they either mortgaged Illinois future to cover their profligacy  or, just as bad, stalled payments to providers for health care and other services already rendered. The result is the capital citys only mountain, a heap of debts snowcapped by still more billions in unpaid bills. We, too, wish state government could do all that legislators have been pretending it could do. But it cant. They spent the money. What they owe  more precisely, the debt theyve imposed on todays taxpayers, their children and grandchildren  is enormous. If we had to reduce Rauners budget for the year that starts July 1 to seven words, wed go with: Enough. Illinois will stop living the lie. If, though, you generously gave us a whole paragraph to synthesize all that Rauners team is telling legislators, wed offer this  not a message his critics will love, but not an ISIS assault either:, Budget staffers from both parties think Springfield will collect $32 billion in revenue in fiscal 2016. Heres our proposal on how to spend it. Youll have other ideas on whats most important. Lets talk. But what we cant do is spend more than our income. In the past you decided what to spend and worried later about whether to pay for it. Were instead pegging revenue, then planning to spend that much (minus $500 million to pay down your old bills). This spring we all may agree on a different spending plan. But if the revenue expectation remains at $32 billion, we intend to cap spending at $32 billion. Thats a difficult message for lawmakers who knew they could overspend in order to please the voters, and the organizations, that would get them re-elected. The companion fiction was that ever-rising revenues from pliant, happy taxpayers could perpetually propel this spending binge forward. In their combined 80 years in state government, House Speaker Michael Madigan and Senate President John Cullerton have seen several governors. They have not seen a governor the likes of Bruce Rauner. Rauner delivered his budget address Wednesday, his 38th day in office. It was an opportunity for... In their combined 80 years in state government, House Speaker Michael Madigan and Senate President John Cullerton have seen several governors. They have not seen a governor the likes of Bruce Rauner. Rauner delivered his budget address Wednesday, his 38th day in office. It was an opportunity for... That hasnt worked. Illinois is broke and broken: Too many children now receive middling educations, too many new jobs now land in more competitive states, too many families and employers now vote with their moving vans. Thats one reason we think Rauner is right to insist that spending match revenue. And, by extension, we think hes right to say that lawmakers have to reform how Illinois spends tax money before asking citizens for more of it. None of which is a rebuke to Chicago Mayor Rahm Emanuel and others who have ideas on how to rearrange Rauners numbers. Emanuel would curtail what he sees as loopholes that benefit healthy, wealthy corporations. During his campaign, Rauner supported what he called \"corporate welfare reform\" as part of overall tax reform. Have at it, provided: Whatever happens has to happen within Springfields realistic revenue projection. We can see that number changing too. Suppose Democratic majorities want more spending for this or that priority. Fine, Rauner can exchange second, third and fourth volleys in which he asks the Democrats to offset more spending with more cuts. Or he can offer to make room for spending more than $32 billion by, say, inviting lawmakers to broaden the sales tax base to services. The challenge for Democratic leaders who want different levels of spending is to negotiate for that, to find a better way. Maybe they will bargain effectively with a Republican governor who, remember, played no role whatsoever in their state finance debacles, this years egregiously bogus budget included. That said:, The principle Rauner is imposing with this proposal is neither cruel nor complex. Millions of households and businesses in this state live by it: We can spend what we make, but we cant spend more.]", "Date": "20150219", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-rauner-budget-illinois-madigan-cullerton-edit-20150219-story.html", "Title": "[ Don't like Gov. Rauner's budget? Make a counter.]"}