{"Content": "[ Pope Francis denounced the \"throwaway\" culture of todays society that discards anyone who is unproductive as he celebrated his first public Mass in Bolivia on Thursday, one of the key days of his South American pilgrimage. It was to culminate with a summit of farmers, fishermen and indigenous whose causes have long been championed by historys first Latin American pope. The government declared a national holiday so workers and students could attend the Mass, which featured prayers in Guarani and Aimara, two of Bolivias indigenous languages, and an altar carved from wood by artisans of the Chiquitano people. In a blending of the native and new, the famously unpretentious pope changed into his vestments for the Mass in a nearby Burger King. Speaking to the crowd in South Americas poorest country, Francis decried the prevailing mentality of the world economy where so many people are \"discarded\" today  the poor, the elderly, those who are unproductive. \"It is a mentality in which everything has a price, everything can be bought, everything is negotiable,\" he said. \"This way of thinking has room only for a select few, while it discards all those who are unproductive.\", Its a theme he was expected to expand on later in the day at the summit of \"popular movements,\" a collection of non-governmental organizations representing street sellers, indigenous groups, mining cooperatives and \"cartoneros,\" who sift through garbage looking for recyclable goods. His keynote speech was expected to be one of the highlights of the trip, outlining some of his core priorities about a church that cares most for the poor and marginalized. Pope Francis historic speech to Congress in September will be viewed by tens of thousands on the National Mall in a landmark event to rival any presidential inauguration. House Speaker John Boehner, R-Ohio, said Wednesday the pontiffs Sept. 24 address to a joint meeting of Congress will be broadcast... Pope Francis historic speech to Congress in September will be viewed by tens of thousands on the National Mall in a landmark event to rival any presidential inauguration. House Speaker John Boehner, R-Ohio, said Wednesday the pontiffs Sept. 24 address to a joint meeting of Congress will be broadcast... When Francis headlined the first such summit at the Vatican last October, he issued a remarkable, off-the-cuff monologue on the injustice of unemployment, the scandal of poverty and the obligation to care for the Earth. \"Tierra, Techo, Trabajo,\" was his mantra then. \"Land, Lodging, Labor.\", The scene in Santa Cruzs Christ the Redeemer plaza was festive, with street-sellers hawking digital watches with the popes face on them and indigenous in feathered headdresses mingling with mestizos, or Bolivians of mixed indigenous-Spanish ancestry. One group of 25 Trinitarios indigenous from Beni, Bolivia tried to perform a traditional dance near the altar and were removed. Hundreds of faithful came from Argentina, Brazil and Colombia as well, hoping to catch a glimpse of their pope. \"The pope is Argentine and we came to see him, we wanted to make him feel at home,\" said engineering student Emilio Domesan, who came to Santa Cruz with a group of friends. , The day, however, threatened to be overshadowed by President Evo Morales controversial gift to Francis upon his arrival: a crucifix carved into a hammer and sickle. Both the Vatican and the Bolivian government insisted Morales wasnt making a heretical or political statement with the gift. They said the cross, dubbed the \"Communist crucifix,\" had originally been designed by a Jesuit activist, the Rev. Luis Espinal, who was assassinated in 1980 by suspected paramilitaries during the months that preceded a violent military coup in Bolivia. On Wednesday, Francis, a fellow Jesuit, prayed at the site where Espinals body was dumped. \"You can dispute the significance and use of the symbol now, but the origin is from Espinal and the sense of it was about an open dialogue, not about a specific ideology,\" said the Vatican spokesman, the Rev. Federico Lombardi. The Bolivian government insisted the gift wasnt a political maneuver of any sort, but was a profound symbol that Morales thought the \"pope of the poor\" would appreciate. \"That was the intention of this gift, and it was not any sort of maneuver ... It was really from great affection, a work designed by the very hands of Luis Espinal,\" Communications Minister Marianela Paco told Patria Nueva radio. Associated Press]", "Date": "20150709", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-pope-bolivia-20150709-story.html", "Title": "[  Pope denounces 'throwaway' culture of consumer society ]"}