{"Content": "[ Lawmakers this week will take a second shot at approving short-term relief for Chicagos teacher pension nightmare amid a deepening fight between Democratic leaders and Republican Gov. Bruce Rauner, who vetoed their spending plans days before the start of the states new budget year. While House Speaker Michael Madigan said he would call the pension measure for another vote when lawmakers return to the Capitol on Tuesday, it may be mired in the budget gridlock. Rauner previously supported Mayor Rahm Emanuels proposal to delay a $634 million pension payment due Tuesday, but he has since tied the idea into a more comprehensive pension package he proposed as part of his budget veto last week. With a last-minute spending agreement unlikely, the state would lose the authority to spend taxpayer dollars on much of governments day-to-day functions beginning Wednesday. The governor did approve spending to ensure elementary and high schools open on time in the fall, but for everything else its a high-stakes waiting game. Legislators have a few options to counter the governor. They could vote to override the veto, but that would take three-fifths of lawmakers in both the House and Senate. While Democrats hold veto-proof majorities in both chambers, taking advantage of that power is often easier said than done. Beyond that, some lawmakers say theres no reason to help Rauner politically by overriding his veto. They argue that while they sent him a budget thats unbalanced by more than $3 billion, he could have put in place targeted cuts to try to close the gap rather than rejecting the budget outright. \"Its his decision, now hes going to have to come explain to us how were going to cope with that,\" said Rep. Greg Harris, a Chicago Democrat who chairs the human services committee. Rauner and Democrats who control the legislature have been deadlocked as he seeks to use the yearly budget-making process to push through a sweeping legislative agenda, saying he wont consider a tax increase to offset the deficit unless lawmakers approve his ideas. Choose Chicago pulled the plug Friday on the last two months of its \"Chicago Epic\" tourism campaign amid a state budget stalemate that threatens the nonprofit agencys funding. The agency, which serves as the citys convention and tourism bureau, sent out an \"action alert\" email Friday explaining... Choose Chicago pulled the plug Friday on the last two months of its \"Chicago Epic\" tourism campaign amid a state budget stalemate that threatens the nonprofit agencys funding. The agency, which serves as the citys convention and tourism bureau, sent out an \"action alert\" email Friday explaining... Democrats have spent months repeatedly shooting down his proposals, which are aimed at scaling back union influence, weakening Democrats hold on the legislature and delivering pro-business changes to the way worker injuries and civil lawsuits are handled. They argue the governor should not hold the budget hostage to advance a political agenda. As he issued his veto Thursday, Rauner reiterated his demands in a written statement that he cast as an attempt at compromise but that Democrats dismissed as largely the same agenda hes been pushing for months. Aides for Madigan and Senate President John Cullerton said both are weighing how to proceed. Lawmakers have some time to figure out their strategy. Under state law, each chamber has 15 days to override a veto. In theory, they could wait it out for a few weeks to assess the initial damage before attempting to override. Its also possible that lawmakers may pursue a stopgap measure to keep core services operating while a larger plan is worked out, a decision that could come after the House holds a hearing Tuesday to interview agency heads about the administrations contingency plans. Republican Gov. Bruce Rauner sought Thursday to ratchet up pressure on Democratic lawmakers to approve his pro-business, anti-union agenda, vetoing the bulk of the state budget while dangling an offer of pension relief for Chicago and Cook County. While Rauner argued that the pension help was part... Republican Gov. Bruce Rauner sought Thursday to ratchet up pressure on Democratic lawmakers to approve his pro-business, anti-union agenda, vetoing the bulk of the state budget while dangling an offer of pension relief for Chicago and Cook County. While Rauner argued that the pension help was part... \"Theres all kinds of options. A short-term approach, something that funds core services, but I am not sure what the consensus might be,\" said Madigan spokesman Steve Brown. \"Well have the committee (hearing) to understand if preparations are being made for a shutdown, and there may be some reaction as a result of that.\", If the Wednesday start of the new financial year arrives without a budget in place, state government wont come to an immediate halt. Still, the absence of a budget means agencies will have to plan for the possibility of a prolonged money drought. Rauners budget office says it has taken steps to ensure most operations will continue for the short term. Prisons have stocked up on food, and the state is looking to sign contracts with workers in key areas, such as homes for the developmentally disabled, to make sure employees show up and know they will eventually get paid. Because of the states backlog in paying bills, many vendors wont feel a disruption for several months. Thats because the state can continue to pay for services provided prior to July 1, and checks are already going out months behind schedule. But nonprofit providers of social services who have been receiving expedited payments could feel the pinch in a matter of weeks, they say. Also up in the air is the Emanuel proposal to delay until Aug. 10 a massive Chicago Public Schools pension payment thats due Tuesday, the same day lawmakers return. The measure appeared to be fast-tracked last week before it was shot down in the House, the victim of the partisan mistrust thats forced an overtime session now entering its fifth week. The idea is to give the school district time to find money, cut costs or seek a more comprehensive reprieve from lawmakers. Making the payment now could threaten the school systems ability to pay other bills or even open schools on time, officials have warned. Emanuel, Rauner and legislative leaders have been in constantly evolving talks to strike a deal that can win the overwhelming majorities needed to pass the General Assembly, according to a source familiar with the negotiations who was not authorized to speak publicly. An agreement could end up being a repeat of the original plan or could involve new elements, the source said. The push to delay the CPS payment became more complicated Thursday when the governor tied it to his broader call for pension changes and a new formula for funding public schools. City Hall initially balked at the proposal, saying it could cost the city hundreds of millions of dollars over time. But after more details of Rauners plan surfaced Friday, Emanuel officials softened their criticism and said Emanuel is supportive of Rauners proposal to come up with a new formula to distribute the states pool of education money. \"We believe the governors commitment to a framework is a positive first step toward a long-term solution to the fiscal crisis looming over the Chicago Public Schools,\" Emanuel spokeswoman Kelley Quinn said in an email. Chicago Tribunes Bill Ruthhart contributed. Geiger reported from Chicago. mcgarcia@tribpub.com, kgeiger@tribpub.com]", "Date": "20150627", "Author": "[ Monique Garcia, Kim Geiger]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-bruce-rauner-budget-legislature-0628-20150628-story.html", "Title": "[ Rauner, Emanuel and Democratic lawmakers look for pension delay deal]"}