{"Content": "[  Its a matter of moving from expansion to stewardship. Napervilles first city sales tax and a sharp hike in residents bills for garbage collection are among the ideas on the table as city staff look for new income streams that will help end a trend of budgets running in the red. The potential proposals are part of a larger effort to craft new fiscal policies that are a better fit for a community no longer experiencing rapid growth. City Manager Doug Krieger said during the building boom that predominated through most of the past three decades, spending was driven by the money coming in from new development. Now, instead of a growth mode, the citys financial practices need to be more in a build out/maintenance frame of mind. \"The days of double-digit revenue growth are done,\" Krieger said. \"Since Naperville was founded, weve amassed about a billion dollars worth of assets, and now we have to take care of that.\", A set of suggestions for addressing budget shortfalls will be taken to policy makers in a July 27 City Council workshop. In the meantime, staff has been sitting down with assorted entities that have a stake in the possibilities, to draw their input. \"Its community dialogue. Its a matter of, Here are our challenges,\" said Marcie Schatz, deputy city manager. \"Were really interested in hearing from the community on this.\", At the heart of the effort are the dwindling reserves emerging in nearly every annual spending cycle, as the budget has drawn down cash balances to cover operating expenses in 12 of the past 13 years. Traced in large part to the national economic downturn, the practice peaked in 2009, when the citys spending outpaced its income by $38 million. The sum represented more than 19 percent of the total operating expenses for that year, city documents show. Rachel Mayer, the citys finance director, said she and other administrative staff are aiming for budgeting parameters that will prove sustainable in an era when income from development is far below what it was in the growth boom of the new millennium. \"While we need to address the structural imbalances, its about setting up a whole new set of principles,\" Mayer said. Internal discussions of the concerns have been underway for some time, she said. The focus is sharpening with predictions putting the 2016 budget shortfall at $6.8 million. \"Weve been projecting that this day would come for at least the last five years,\" Mayer said. The approach being shared with local business people and other community members is anchored in principles that commit the city to maintaining current service levels by increasing user fees, passing a structurally balanced budget every year and cutting its debt load by 25 percent over the next five years. \"We are pretty much average when it comes to our debt level,\" Mayer said, though she noted that the obligation, now standing at $121.3 million, will go up without income growth. \"Right now, as part of our tax levy, we are paying roughly $13 million (yearly) to reduce our debt levels.\", Increasing the real estate tax levy is among the options that have been ruled out by planners, largely because it would have to go up 14 percent in order for the added income to fill the budget gap. Also nixed so far was a .25 percent hike in the food and beverage tax, which would bring in an estimated $900,000 in new revenue each year but would put Naperville food and beverage businesses at a disadvantage in a competitive industry, staff say. They dont predict the business community would experience the same ill effects from a new 1 percent sales tax collected by the city through its authority as a home-rule municipality. Naperville is one of few home-rule communities in the region that dont add their own share to retail sales purchases. Among those in the area, locally collected home rule taxes range from .5 percent to 1.75 percent. If enacted in Naperville, it would bring the total retail tax rate to 8.25 percent. Food and beverage taxes are added separately at businesses that serve those goods. Currently the state receives 6.25 percent of most purchases made in the city, and Will and DuPage County each collect an additional 1 percent from Naperville businesses operating within their respective boundaries. The estimated $18.1 million income flowing from the new revenue stream would be used exclusively to cover debt service and to fund capital projects, some of which the city has deferred since finances tightened during the recession. \"Nobody likes putting in new fees or taxes,\" said Krieger, adding that the proposal would come with a 10-year sunset for the added retail tax. \"If its put in place to retire debt, it really makes sense.\", Capping the citys spending increases at 3 percent annually, another potential piece of the strategy, would be intended to help achieve the goal of a balanced budget. Krieger noted that some costs are generally beyond local control, including health benefits, pension expenses and unusual weather that adds to overtime costs or reduces income for the utilities. Other things can be done to cut costs, however, such as allowing vacated staff positions to remain unfilled for a period of time and leaving them that way when it is feasible. And maintaining services can best be done, staff suggest, by passing on more of their cost to those who receive them. They are looking at increasing the $2 fee residents now pay monthly for garbage and recycling collection to $12.35, which would reflect its actual cost  a policy already in place for such things as ambulance billing and water consumption. The city now pays nearly 84 percent of the cost for refuse services, drawing the funds from real estate tax receipts. The proposals have been forwarded to the Naperville Area Chamber of Commerce. Nicki Anderson, the chambers president and CEO, said the home rule sales tax possibility will be discussed Monday during a specially called meeting of the legislative committee. Krieger said feedback from the business community so far has been generally positive, particularly relating to the sunset provision for the tax. \"I think they like the fact that were approaching (the budgeting challenge) in much the same way as they would with their own businesses,\" he said. Christine Jeffries, president of the Naperville Development Partnership, said her board has yet to take a stance on the new tax, but its being discussed. She noted that the 1/4 cent sales tax that has been collected locally for the DuPage Water Commission will soon sunset. Combined with a 1/4 cent home rule retail tax, Jeffries said, it would have a net effect of adding more than $9 million to city coffers each year. \"What we would like to see is taking down the long-term debt and the quarter-cent home rule tax, with a sunset,\" she said. She expressed confidence in the citys commercial vitality, noting that Illinois Department of Revenue data shows Naperville with the highest retail sales volumes in the state outside of Chicago. \"We have achieved the No. 1 position, which is pretty remarkable, because we dont have a mall,\" Jeffries said. The Naperville Area Homeowners Confederation is another of the local organizations that have been briefed on the new policy discussions. Bob Fischer, president of the confederations board, said the group also has not yet adopted a position on the measures. Depending on what transpires at next weeks workshop, the organization might host a town hall-type meeting to focus on the budget issues, he said. \"Personally, in the overall scheme of things, and considering the various revenue alternatives (sales tax, property tax, increased garbage fees) on the table for income enhancement, I find a sales tax increase the least onerous,\" Fischer said in an email. \"If nothing else, it is one that the payer has some control over.\", scarlman@tribpub.com, Twitter @scarlman]", "Date": "20150711", "Author": "[ Susan Frick Carlman]", "Link": "http://www.chicagotribune.com/ct-nvs-sales-tax-st-0712-20150710-story.html", "Title": "[ Staff eye sales tax, garbage fee hikes to address budget gaps]"}