{"Content": "[ One serves in the Air Force, another recently served in Afghanistan in the National Guard, another is studying physical therapy in Sacramento  and all three Americans are being hailed as heroes for tackling and disarming a gunman they happened to encounter on a high-speed Amsterdam-Paris train. Air Force serviceman Spencer Stone remained hospitalized Saturday after being stabbed, though the Pentagon said the injury was not life-threatening. Another passenger was wounded by a handgun in the attack Friday night, according to a police union official. Its unclear whether there was a political motive to the gunmans actions. French authorities are questioning the attacker, identified by police as a 26-year-old of Moroccan origin, and are expected to speak to at least one of the Americans on Saturday about what happened. Counterterrorism police are leading the investigation, according to the Paris prosecutors office. French Interior Minister Bernard Cazeneuve, speaking in the northern French city of Arras where the train was diverted, said the Americans \"were particularly courageous and showed great bravery in very difficult circumstances,\" and that \"without their sangfroid we could have been confronted with a terrible drama.\", He called for caution before jumping to conclusions. French authorities are on heightened alert after Islamic extremist attacks in January left 20 people dead, including the three gunmen. In June, a lone attacker claiming allegiance to Islamic radicals beheaded his employer and set off an explosion at an American-owned factory in France, raising concerns about other scattered, hard-to-predict attacks. Anthony Sadler, a senior at Sacramento State University, was traveling with childhood friends Stone, of Carmichael, California, and Alek Skarlatos, a National Guardsman from Roseburg, Oregon, when they heard a gunshot and breaking glass. Sadler told The Associated Press that they saw a train employee sprint down the aisle followed by a gunman with an automatic rifle. Frances Interior Minister says the countrys anti-terrorism prosecutor is investigating a shooting that left three people wounded on a train between Paris and Amsterdam, in which two U.S. citizens helped disarm the attacker. Aug. 21, 2015. (Reuters), Frances Interior Minister says the countrys anti-terrorism prosecutor is investigating a shooting that left three people wounded on a train between Paris and Amsterdam, in which two U.S. citizens helped disarm the attacker. Aug. 21, 2015. (Reuters), \"As he was cocking it to shoot it, Alek just yells, Spencer, go! And Spencer runs down the aisle,\" Sadler said. \"Spencer makes first contact, he tackles the guy, Alek wrestles the gun away from him, and the gunman pulls out a boxcutter and slices Spencer a few times. And the three of us beat him until he was unconscious.\", Another passenger helped tie the gunman up, and Stone then quickly turned to help another passenger who had been wounded in the throat, stopping his bleeding until paramedics came, Sadler said. The identity of the person with the gun wound has not been released, and it is unclear whether the victim was intentionally targeted. Throughout the brief but terrifying episode, Sadler said, \"The gunman never said a word.\", Sadler said French authorities were to speak with him Saturday in Arras, where scientific police circulated around the cordoned-off train and train station. The Pentagon confirmed that \"one U.S. military member was injured in the incident. The injury is not life-threatening.\", President Barack Obama was briefed on the shooting, and said in a statement, \"While the investigation into the attack is in its early stages, it is clear that their heroic actions may have prevented a far worse tragedy.\", Skarlatos, 22, had returned from a deployment in Afghanistan in July, and Stone is stationed in the Azores, according to Skarlatos step-mother Karen Skarlatos. She spoke with her step-son immediately after the incident. \"He sounded fine, but he was intense  he sounded like he had just thwarted a terrorist attack.\", \"Alek and Spencer, theyre big, brave, strong guys and they decided they were going to tackle him. And they did,\" she told the AP from Oregon. \"Spencer got a couple good slices on him. But they were able to subdue him while the train was still moving.\", The attacker did not fire his automatic weapon but wounded one man with a handgun and the other with a blade, said Philippe Lorthiois, an official with the Alliance police union. The suspect is a 26-year-old Moroccan, according to Sliman Hamzi, an official with the Alliance police union who spoke on French television i-Tele. Europes major rail stations, such as Paris Gare du Nord and Brussels Gare du Midi, are patrolled by soldiers armed with rifles, but passengers can board most high-speed trains without passing through metal detectors or having their bags searched or showing their passports. Shaken passengers from the train that was attacked arrived early Saturday at Paris Gare du Nord train station, several hours later than schedule. They were greeted by a large group of SNCF staff with water and meals and help finding hotels and taxis. Associated Press]", "Date": "20150822", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-france-high-speed-train-shooting-20150821-story.html", "Title": "[ France: 3 Americans subdue gunman on high-speed train ]"}