{"Content": "[ It was painfully easy, and just plain painful, to watch the countrys latest high-profile shooting. This one was captured on live television as a gunman killed a news reporter and a cameraman and injured the woman they were interviewing. Within hours, a person believed to be the shooter tweeted what looked like a first-person video of the slayings. The staccato pops of the gunshots made my heart leap. The stories of the victims  Alison Parker, a 24-year-old reporter for a Roanoke, Va. television station, and Adam Ward, 27, a cameraman  made anyone with an ounce of humanity hurt. And the repetition of tragedies like this, which always seem to find a new way to shock us  children gunned down in a school, people gunned down in a movie theater, journalists gunned down on live TV  made me angry. I thought about this slogan from the National Rifle Association:, \"The only thing that stops a bad guy with a gun is a good guy with a gun.\", NRA Executive Vice President Wayne LaPierre came up with that line. You can even buy T-shirts emblazoned with those words for $17.95 on the NRAs online store. I always saw that sentence as generic tough-guy blather, a one-line advertising slogan from a man whose job is to get people to buy more guns. But that video of two innocent people swiftly killed and another injured made me examine the sentence more closely and recognize it for what it is: pure selfishness. Flowers and balloons are gathering outside the studio of WDBJ-TV in Roanoke, Virginia, one day after an angry former reporter and cameraman shot and killed them during a live broadcast. (AP), Flowers and balloons are gathering outside the studio of WDBJ-TV in Roanoke, Virginia, one day after an angry former reporter and cameraman shot and killed them during a live broadcast. (AP), Theres an absoluteness about it  ONLY one thing will stop a bad guy with a gun. And that one thing is someone who is armed. Nothing else matters. The only way to protect yourself is to have a gun. Thats very convenient if you love guns. You, the gun lover, can feel safe and secure with a pistol at your hip. But what about the rest of us? What if we dont want to walk around armed at all times?, And what if that TV reporter or the videographer had been armed? In the video she doesnt appear to even see the gunman coming. And her colleague has a video camera on his shoulder. In what way would those good guys, had they been armed, have stopped the bad guy with the gun?, And when does a person who owns a gun become a bad guy? People who may not seem bad, who dont have criminal records or any of the red flags that might halt a gun purchase, can easily buy guns. And those guns dont evaporate the moment a person becomes unstable. They stick around. And they get used. He planned it all so carefully  a choreographed execution of two former colleagues, broadcast live to a horrified television audience. Hours later, he shared his own recording of the killing worldwide on social media. Vester Lee Flanagans video shows him approaching WDBJ reporter Alison Parker... He planned it all so carefully  a choreographed execution of two former colleagues, broadcast live to a horrified television audience. Hours later, he shared his own recording of the killing worldwide on social media. Vester Lee Flanagans video shows him approaching WDBJ reporter Alison Parker... That fact, according to LaPierres bad-guy-with-gun/good-guy-with-gun theory, requires all of us to have guns in order to truly be safe. Because the common theme in our countrys almost rhythmic stream of shocking shootings is a bad guy carrying a device that propels bullets, and with the massive number of firearms owned or available, you never know when someone with a gun is going to turn bad. So were left with this: Accept the violence so gun enthusiasts can feel safe and protected with guns on their hips. In order to abide someones gun hobby, or their inner-Dirty-Harry envy or whatever it is, we must live in a world where guns abound. Thats selfish. And its ridiculous. And its the heart of the NRAs self-serving slogan. The only thing that stops a bad guy with a gun is a good guy with a gun, so we cant implement stricter gun control laws or ban assault rifles, and the NRA vehemently opposes things like high-capacity magazine bans. They dont think the government should be telling people what to do with their guns. Well guess what? I dont think gun advocates should be telling people  good-guy Americans  that they need guns and holsters to feel safe. Not that a sidearm wouldve done Parker or Ward any good. They were outside a shopping center at 6:45 a.m. Doing their jobs. They shouldnt have to think: Is there a lunatic with a gun looking for us? Should I keep one hand on my pistol and another on the microphone, one eye out for attackers and another on the camera?, Their young lives are over now because a bad guy with a gun came along. Adding another gun to that scenario wouldnt have changed a thing. Take the phrase \"with a gun\" out of the NRAs favorite sentence: The only thing that stops a bad guy is a good guy. Thats a more reasonable, less lethal and less selfish statement. Remove one gun  the one in the bad guys hand, the one his first-person video shows recoiling as it shatters lives  and this story from Virginia would have been different. Keep the gun there and its the same tragic story we hear over and over and over again. rhuppke@tribpub.com]", "Date": "20150826", "Author": "[ Rex W. Huppke]", "Link": "http://www.chicagotribune.com/news/opinion/huppke/ct-virginia-tv-crew-shooting-huppke-20150826-story.html", "Title": "[  At Virginia shooting, NRA, where were the good guys?]"}