{"Content": "[ Tuesday is visitors day for Jason Rezaian, the day that Iranian authorities permit the imprisoned Washington Post journalist to see his mother and his wife. As they have every Tuesday for the past few weeks, Mary Rezaian and Yeganeh Salehi arrived at Tehrans Evin Prison in the morning and walked through a labyrinth of halls to a waiting car that drove them to another building housing a small salon furnished with chairs around a coffee table. There they met, the two women sitting on either side of Rezaian, each holding one of his hands. But this Tuesdays visit was unlike any other over the past month and a half that Mary Rezaian has been in Iran for her son. They are waiting for an imminent verdict in the case against The Posts Tehran bureau chief, who has been held for 13 months and is accused of espionage and other crimes. The judges verdict could be handed down Wednesday. Or it may be next week. They have no hint when it will come, but they fear Rezaian will not be coming home anytime soon. \"Its safe to say hes steeling himself,\" said Mary Rezaian in a phone call after the weekly visit. \"Hes preparing himself to hear a verdict other than acquittal. A severe verdict, with a long sentence. Were preparing ourselves for anything. It would be wonderful, a miracle, if he were acquitted, but I think its highly unlikely.\", The Iranian-American reporter for the Washington Post detained in Tehran for more than a year on charges including espionage spoke in his own defense Monday during a final closed-door hearing in a trial that has been criticized by the paper and press freedom advocates. A verdict in journalist Jason... The Iranian-American reporter for the Washington Post detained in Tehran for more than a year on charges including espionage spoke in his own defense Monday during a final closed-door hearing in a trial that has been criticized by the paper and press freedom advocates. A verdict in journalist Jason... During months of negotiations with Iran over its nuclear program, the United States repeatedly pressed Tehran to release Rezaian, 39, and at least two other Americans of Iranian heritage imprisoned there, plus provide information on a fourth man who disappeared during a 2007 visit. U.N. human rights officials also have called for Rezaians immediate release, saying his arrest on July 22, 2014, lengthy detention and secret trial are intimidating to journalists working in Iran. Senior Post editors and Rezaians family have said Rezaian is innocent, and that he was acting solely as a journalist before his arrest. His final court hearing was Aug. 10, and Iranian authorities gave conflicting accounts of when a verdict may come down. His lawyer said she expected it within a week. A judiciary spokesman said Sunday that it would be announced this week or next. But the head of Tehrans justice department said that no verdict has been decided, and it may be some time before his fate is determined. A Washington Post journalist detained for almost six months in Iran has been indicted on unspecified charges, the countrys official news agency said Wednesday.The case against Jason Rezaian, the Posts Tehran bureau chief, is in the hands of the Revolutionary Court, reported the Islamic Republic... A Washington Post journalist detained for almost six months in Iran has been indicted on unspecified charges, the countrys official news agency said Wednesday.The case against Jason Rezaian, the Posts Tehran bureau chief, is in the hands of the Revolutionary Court, reported the Islamic Republic... The wait is excruciating. \"The past week was the hardest for me,\" said Mary Rezaian. \"I see the stress within everybody, including myself. We get up, we go walking. We go around looking for books for Jason. We find ways to do something different. Were trying to maintain as much sanity as we can.\", Mary Rezaian and Salehi, a journalist who was arrested with her husband but was released on bond until her own case comes up, have been allowed twice-weekly contacts with Rezaian. Every Friday, each woman is permitted four minutes on a phone call with him, though Mary Rezaian said that the regularity of that depends to some degree on who the guard is on any given Friday. Then there are the Tuesday visits. When Mary Rezaian came to Iran early this summer, she initially was separated from her son by a glass window and could speak to him only on a telephone. About a month ago, the judge issued an order that they be allowed to meet in the visiting salon. Mary Rezaian said they know they are being watched and listened to. She said Jason frequently asks about his brother, Ali, who has put his life on hold as he campaigns for Iran to release Rezaian. \"He lives for his contact with us,\" Mary Rezaian said of Jason. \"Most of the time were together, we try to talk about happy things. Friends Ive been in contact with. He wants to know about Ali and his family. We know there are cameras in the room. We figure our conversations are picked up.\", Although Rezaian has lost a lot of weight during his lengthy imprisonment, he is able to exercise regularly, \"just trying to make himself healthy for when hes released,\" Mary Rezaian said. Asked if her son believes he will be released, eventually, she said: \"Hope springs eternal. Hes always been an optimistic person. It may not be this week, or next month. But hes innocent, I know that.\"]", "Date": "20150818", "Author": "[ Carol Morello]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-post-reporter-jailed-in-iran-20150818-story.html", "Title": "[ Mom, wife of Post reporter jailed in Iran brace for verdict]"}