{"Content": "[ At almost the same time last week that a Florida mailman was landing a gyrocopter in front of the U.S. Capitol to protest the influence of the wealthy on politics, New Jersey Gov. Chris Christie, Republican, was getting pressed about the same topic at a town hall meeting in Londonderry, New Hampshire. \"I think what is corrupting in this potentially is we dont know where the money is coming from,\" Christie told Valerie Roman of Windham, New Hampshire. The two moments, occurring 466 miles apart, crystallized how money in politics is unexpectedly a rising issue in the 2016 campaign. Hillary Rodham Clinton announced last week that one of the top planks of her bid for the Democratic presidential nomination will be reforming a \"dysfunctional\" campaign finance system. And several of her GOP rivals  quizzed by voters in town hall meetings  have begun lodging their own criticisms of how big-money interests dominate politics. Turning disgust with billionaire super PAC benefactors into a platform that moves voters has been an elusive goal for activists seeking to curb the massive sums sloshing through campaigns. But five years after the Supreme Courts Citizens United v. Federal Election Commission decision  which held it was unconstitutional to ban independent political spending by corporations and unions, and helped set off a financial arms race  there are signs that politicians are beginning to confront a voter backlash. The letter carrier who caused a full-scale security review in Washington when he violated national airspace by landing his gyrocopter on Capitol Hill expressed frustration Sunday that his message wasnt getting through. Doug Hughes had hoped to raise awareness about the influence of big money in... The letter carrier who caused a full-scale security review in Washington when he violated national airspace by landing his gyrocopter on Capitol Hill expressed frustration Sunday that his message wasnt getting through. Doug Hughes had hoped to raise awareness about the influence of big money in... \"I certainly dont condone people flying mini-helicopters around government buildings, but I think its a powerful statement when a person is willing to actually risk his life for campaign finance reform,\" said Daniel Weeks, executive director of the New Hampshire Rebellion, a project to make money in politics a major topic in the states presidential primary. \"This is becoming an issue du jour, where people who are not part of any established group are really taking it into their own hands.\", On Saturday, the group led a 15-mile march of about 100 people from Lowell, Massachusetts, to Nashua, New Hampshire, where nearly 20 GOP presidential hopefuls gathered for a state party forum. The activists retraced Paul Reveres famous ride to alert citizens about \"the threat of big money,\" Rebellion organizers said. Conservatives who favor less regulation of political money scoffed at the notion that distaste for the growing role of wealthy donors will galvanize voters. Postal worker Doug Hughes is on mission to draw attention to campaign finance reform. He plans to land his gyrocopter in front of the US Capitol to deliver 535 letters to Congress calling for reform. Postal worker Doug Hughes is on mission to draw attention to campaign finance reform. He plans to land his gyrocopter in front of the US Capitol to deliver 535 letters to Congress calling for reform. \"That most Americans think money in politics is corrupting is nothing new,\" said Bradley Smith, founder of the Center for Competitive Politics, which supports loosening campaign finance restrictions. \"But when the rubber hits the road, most people say, I dont think my contribution should be disclosed. I dont think my group should be hassled. \", \"There remains a major public disposition to not like money in politics, but a real small group of people for which this is a dominant issue,\" Smith added. A January survey by the Pew Research Center found that 42 percent of adults rated dealing with money in politics a top priority for the president and Congress; but among a 23-item list of priorities, it ranked fourth from the bottom. Still, thats up from the 28 percent in 2012 who said reforming the campaign finance system should be a top priority. For those who feel strongly about it, the 2016 primaries and caucuses  and the up-close access they bring to the presidential contenders  offer a ripe opportunity to elevate the topic. In New Hampshire, nearly 500 people have volunteered to attend public forums and press the White House hopefuls about money in politics, Weeks said. At the town hall in Londonderry, Roman, a 58-year-old retired IT director, asked Christie about the \"corrupting\" influence of big donations. In response, Christie called fundraising \"one of the most difficult, distasteful parts of the job\" and endorsed a system of unlimited contributions with immediate disclosure. \"There has to be an absolute rule that 24 hours later you will reveal those contributions on the Internet, publicly available, so members of the public can scroll down on their computer,\" he said. Other Rebellion volunteers have elicited strong reactions from the likes of Sen. Rand Paul, R-Ky. who suggested a limit on political spending by federal contractors; and Sen. Lindsey O. Graham, R-S.C. who called for a constitutional amendment to overturn Citizens United. \"Its the wild, wild West,\" Graham told voters in Barrington, New Hampshire, this month, adding: \"What I worry about is that we are turning campaigns over to about 100 people in this country, and they are going to be able to advocate their cause at the expense of your cause.\", Former Arkansas governor Mike Huckabee, Republican, said Friday that he also favors removing caps on campaign donations and instant disclosure, a move he said would yank control back from super PACs. \"The candidate would have to go out and defend whether he was a wholly owned subsidiary of the $100 million donor, but that would be a campaign decision and it would mean a far more accountable and frankly more honest approach than we have,\" he told reporters in Washington. For her part, Clinton declared in Iowa on Tuesday that one of her top goals is \"to fix our dysfunctional political system and get unaccountable money out of it once and for all, even if that takes a constitutional amendment.\", Clinton has not yet offered any specifics about how she would propose changing the current system. David Donnelly, president of Every Voice, an advocacy group working to reduce the political influence of the wealthy, said Clinton and other contenders have to do more than just raise the topic on the campaign trail. \"It has gotten to a point where candidates cant just complain about it and point out what their opponents are doing  theyre going to have to offer tangible, practical solutions,\" he said. Some veteran activists remain skeptical, noting that previous campaign promises to remake the system  including by former president Bill Clinton  later fizzled. \"Both President Clinton and President Obama talked a good game about campaign finance reform in their campaigns, and then never really did very much to make it happen,\" said longtime reform advocate Fred Wertheimer. Even as Hillary Clinton pledged to tackle the influence of big money on politics, her campaign confirmed that she will accept donations from lobbyists and PACs, unlike Obama. She is also counting on support from Priorities USA Action, a super PAC raising seven-figure checks to back her bid. \"She strongly supports campaign finance reform and has voted for tough lobbying reform, but as long as Republican groups and candidates are going to spend millions attacking Hillary, we need the resources to fight back,\" Clinton spokesman Jesse Ferguson said in a statement. But critics on the right called her support for reform hollow. \"If its so destructive, then why use a super PAC?\" asked David Bossie, president of the conservative advocacy group Citizens United. \"Its just a cheap talking point.\", It was his organizations movie about Hillary Clinton that spurred the original Supreme Court case. Citizens United sued the Federal Election Commission after the panel said that advertising the film would amount to an illegal corporate political expenditure. The Supreme Courts opinion in the case unleashed an era of expanded political participation by big-money groups, allowing certain nonprofit organizations to engage in politics directly and paving the way for the creation of super PACs. But Bossie dismissed the idea that the decision has deepened public concerns that too much money is flooding into campaigns. \"Its not what makes people vote for or against a candidate,\" he said. Activists on the other side hope to change that. Leaders of the New Hampshire Rebellion have been talking to organizers in Iowa about launching a similar effort there and plan to release an online tool kit to help others around the country bird-dog the 2016 contenders. \"The candidates are not going to lead on this,\" Weeks said, \"but will follow when the public demands it.\", Washington Post staff writers Peyton Craighill, Robert Costa, Mike DeBonis, Karen Tumulty and Philip Rucker contributed to this report. Costa reported from Londonderry, New Hampshire.]", "Date": "20150419", "Author": "[ Matea Gold]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-big-money-in-politics-2016-campaign-20150419-story.html", "Title": "[ Big money in politics emerges as a rising issue in 2016 campaign]"}