{"Content": "[ The Defense Department is taking another look at the military prison in Kansas and the Navy Brig in South Carolina as it evaluates potential U.S. facilities to house detainees from the prison at Guantanamo Bay, Cuba, part of the Obama administrations controversial push to close the detention center. Navy Capt. Jeff Davis, a Pentagon spokesman, said a team was surveying the Disciplinary Barracks at Fort Leavenworth on Friday and will do a similar assessment at the Naval Consolidated Brig in Charleston later this month. Davis said the team will assess the costs associated with construction and other changes that would be needed in order to use the facility to house the detainees as well as conduct military commission trials for those accused of war crimes. The closure of the Guantanamo Bay detention center has been a top priority for President Barack Obama, who pledged on his first day in office to shut it down. But that effort has faced persistent hurdles, including staunch opposition from Republicans and some Democrats in Congress and ongoing difficulties transferring out the dozens of detainees who have been cleared to leave. Officials have to identify countries to take the detainees and must get assurances that they will be appropriately monitored and will not pose a security threat. About 52 of the 116 current detainees have been cleared for release, but Defense Secretary Ash Carter and his predecessors have made it clear they will not release any detainees until they have all the needed security assurances. The remaining 64 have been deemed too dangerous to be released. The latest surveys come a week after a draft Pentagon plan to provide potential locations for the detainees was stymied when the administration said the Thomson Correctional Center in Illinois was off the table, according to officials. The draft plan had focused largely on Thomson and Charleston, said the officials, who spoke on condition of anonymity because they were not authorized to discuss the matter publicly. We are confronted every week by stories of the most barbaric crimes committed by Muslim terrorists. We want to do everything we can to protect ourselves and catch and punish these evil people. In these circumstances, Arkansas Sen. Tom Cottons recent statement that every last prisoner detained... We are confronted every week by stories of the most barbaric crimes committed by Muslim terrorists. We want to do everything we can to protect ourselves and catch and punish these evil people. In these circumstances, Arkansas Sen. Tom Cottons recent statement that every last prisoner detained... The officials said that early versions of the Pentagon report had made it clear that Thomson and Charleston were the most viable choices based on costs and the timeline needed to renovate the facilities to the maximum security levels required. Officials have acknowledged, however, that there were divisions within the Pentagon and across the administration over which military and federal facilities to highlight and how many options to assess and include in the report. At the Aspen Institutes recent national security conference in Colorado, Lisa Monaco, Obamas homeland security adviser, said the administration wants to move out the 52 detainees. But, she added, \"That doesnt mean just unlocking the door and having someone go willy-nilly to another country. ... It means a painstaking establishment of security protocols that would govern the transfer of that individual.\", Davis said that there are other sites, in addition to those in Kansas and South Carolina, that the team will visit. Although previous surveys and reviews have been done of many of the prison facilities, Davis said the latest visits are aimed at getting consistent evaluations and establishing a baseline of information. Five men from Yemen were freed from the U.S. Navy base at Guantanamo Bay, Cuba, after more than a dozen years of captivity and sent to Estonia and Oman for resettlement, U.S. officials said Wednesday, the latest in a wave of releases that have alarmed congressional opponents of closing the detention... Five men from Yemen were freed from the U.S. Navy base at Guantanamo Bay, Cuba, after more than a dozen years of captivity and sent to Estonia and Oman for resettlement, U.S. officials said Wednesday, the latest in a wave of releases that have alarmed congressional opponents of closing the detention... He said the assessments will cover a range of factors, including the costs associated with holding the additional detainees, holding the military trials, engineering and construction, force protection, housing for troops and security. Transportation and other operating issues also are factors. The assessments, he said, will help determine which facilities can be considered potential candidates to house the detainees. While the team is looking first at some military detention centers, the U.S. Bureau of Prisons is also identifying potential civilian facilities. Congressional opposition has been fierce. Both the House and Senate versions of the 2016 defense policy bill maintain prohibitions on transferring detainees to U.S. facilities. The Senate legislation, however, states that the restrictions could be lifted if the White House submits a plan to close the facility and the plan is approved by Congress. House and Senate negotiators are working to reconcile the two bills. Lawmakers from Kansas on Friday quickly denounced the survey. In a letter to Carter, Sen. Pat Roberts, R-Kan. said he has consistently objected \"to the idea of moving these terrorists to the mainland, and more especially to Kansas. I will continue to be a vocal and staunch advocate against closing our current detainment facilities due to the high security risks and economic waste doing so would cost the American public.\", He said Leavenworth is not the right location because it sits on the Missouri River, \"providing terrorists with the possibility of covert travel underwater and attempting access to the detention facility.\", Sen. Jerry Moran, R-Kan. said, \"Terrorists should not be living down the road from Fort Leavenworth - home to thousands of Army soldiers and their families, as well as military personnel from across the globe who study at the Intellectual Center of the Army.\", Associated Press, ]", "Date": "20150815", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-guantanamo-bay-20150815-story.html", "Title": "[  Pentagon looks at stateside prisons as alternatives to Gitmo ]"}