{"Content": "[  The owner of a suburban sewer repair company with ties to Cicero Town President Larry Dominick was sentenced Thursday to six months in prison followed by another six months of home detention for tax evasion. U.S. District Judge Amy St. Eve also ordered that George Hunter, 60 of Stickney, pay restitution of more than $487,000. \"I take responsibility. I was wrong,\" Hunter told the judge. New details  came out at the sentencing, among them that Hunter gambled away much of the money that should have gone toward taxes. \"I would go daily to the bank and pull out $4,000 or $5,000 like nothing and rush over to a casino and lose it, not caring because I was working steady,\" Hunter said in a written statement to the court.  As part of the sentence, St. Eve also ordered that Hunter attend Gamblers Anonymous meetings after hes released from prison and is serving his three years of probation. \"It is clear to me that the root of your problem is your gambling,\" the judge told Hunter. Prosecutors sought up to 21/2 years in prison for Hunter, while his attorneys asked for probation, noting that he had no previous criminal record. Prosecutors alleged that Hunter, who owns Superior Sewer Solution in Stickney, schemed to avoid paying a total of nearly $500,000 in federal income taxes from 2007 to 2009. Hunter pleaded guilty in December to writing more than $400,000 in checks in 2007 and 2008 to two undisclosed people in exchange for cash, then paying his employees in cash and directing them to not report their income. On his tax returns, Hunter then failed to claim wages paid to employees as an expense, the charges alleged. State election records show that from 2006 to 2008, Hunter and Superior Sewer Solution donated more than $3,000 to a campaign fund controlled by Dominick. Meanwhile, Superior Sewer Solution received more than $1.8 million in no-bid work from Cicero. Dominick was not accused of any wrongdoing. Rose Lindsay-Guimaraes, Hunters attorney, said her client did not intentionally shirk his tax responsibilities but was overwhelmed by the toxic combination of his gambling addiction and all the money he was making. \"He was living on a high, a constant rush of adrenaline,\" she said. Assistant U.S. Attorney Michael Donovan acknowledged that the gambling addiction was tragic, but he argued that prison time was necessary to provide a deterrent for others who might consider tax evasion. Donovan also noted that Hunter continued his wrongdoing after he was first confronted by the Internal Revenue Service. \"Once confronted by the IRS directly, (Hunter) still didnt turn around and make good,\" Donovan said. Hunter said in court that he was committed to erasing his $487,000 debt and brought $800 to court Thursday as an initial payment. \"A smart man would have got an accountant at the beginning,\" Hunter said moments before the sentence was handed down. jacraven@tribpub.com, Twitter @jasper_craven]", "Date": "20150625", "Author": "[ Jasper Craven]", "Link": "http://www.chicagotribune.com/news/local/breaking/ct-cicero-tax-evasion-sentencing-met-20150625-7-story.html", "Title": "[  Businessman with ties to Cicero president gets prison for tax evasion]"}