{"Content": "[ Well, he certainly isnt leaving quietly. Gov. Pat Quinn, who lost his re-election bid last month, announced Thursday that hes calling the lame duck General Assembly to Springfield for a special session on Jan. 8, just a few days before a new governor and new legislature will be inaugurated. Why on earth? Quinn wants lawmakers to pass a bill scheduling an election for comptroller in 2016, the next chance to run candidates for a statewide ballot. The unfortunate and untimely death of Comptroller Judy Baar Topinka before she was sworn in for another term has created a debate  OK, call it a scramble  over the selection of a successor. Quinn apparently wants to deliver a kick in the pants to the man who beat him, Gov.-elect Bruce Rauner. According to Attorney General Lisa Madigans reading of the law and the Illinois Constitution, the next governor has the authority to appoint a comptroller for the full four years of the term Topinka won in the Nov. 4 election. Rauner wants to make a four-year appointment. Quinn wants to short-circuit that by rushing in a law to hold a special election in 2016. Boys, boys, boys. Its ridiculous for Quinn to call a special session, to haul the lawmakers to Springfield at an expected cost of $50,000. This is Quinns final insult to taxpayers. (Unless he dreams up another insult in the 31/2 weeks he has left in office.), There is no public interest in a rush to decide on a special election. This should be decided in time by the incoming governor and legislature. Rauner could defuse this by appointing a comptroller who agrees to resign in two years. He should encourage the legislature to put a referendum proposal on the 2016 ballot for a constitutional amendment to combine the offices of comptroller and treasurer. If voters approve that  were sure they would  then Rauner could extend the appointment of the comptroller for the time needed to shut down the office. Rauner could negotiate an agreement on a two-year appointment with House Speaker Michael Madigan and Senate President John Cullerton, and quash the last hint of credibility behind Quinns needless and costly demand for a special session. Quinn is expected to make a short-term appointment for the comptroller vacancy, someone who will sign the payroll checks and complete the other day-to-day duties of the office until inauguration day. Rauner would then make an appointment when he takes office in January. Filling an elective position by appointment for four years isnt ideal. But Rauner is right on this  legislation on a special election should not be hurried. It should be carefully considered, and it should establish law for all statewide offices. It should not be a rush job done for political advantage or to assist a lame duck governor grasping for relevancy. Republican Gov.-elect Bruce Rauner on Monday dismissed the idea of holding a special election for Illinois comptroller following Judy Baar Topinkas death, saying a legal analysis by the attorney general makes it clear he can appoint a replacement to serve out the entirety of her new four-year... Republican Gov.-elect Bruce Rauner on Monday dismissed the idea of holding a special election for Illinois comptroller following Judy Baar Topinkas death, saying a legal analysis by the attorney general makes it clear he can appoint a replacement to serve out the entirety of her new four-year... Quinn has been nothing but petulant since he lost his re-election. He stalled on conceding to Rauner. He slipped his campaign manager into a plum state job with a two-year term. He signed onto a questionable Lottery contract that locks in the new governor. His Department of Transportation continues to pursue construction of the massively expensive Illiana Expressway, even though Rauner may opt to drop the project. Residents living along the expressway path received letters this week notifying them that appraisers will be at their homes during the holidays to set a price to buy them out. Now this, a special session to deal with a matter that is not an emergency. Come on, Governor. Quit using your final days to punk the people of Illinois.]", "Date": "20141218", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-edit-session-1219-20141218-story.html", "Title": "[ Gov. Quinn's last stand (stunt)]"}