{"Content": "[ Each academic year, students from Saint Xavier University (SXU) graduate and leave memories of their time in school. Most graduates find jobs, others look for new schools to receive higher degrees; but some end up returning to their alma mater as faculty and staff members. The same can be said for the following SXU alumni: Marvin Fourte, Brandon Swanson, Brian Bartelment, Rebekah Marshall, Laura Richardella, and Romana Amato. As students, these six alumni embraced their academic excellence to achieve their degrees; now, they embrace SXUs core value of service as they help pay-it-forward to the next generation of students. Marvin Fourte, 22, graduated in May 2015 with a Bachelor of Arts degree in English and writing and philosophy minor. As a student, he was actively involved on campus - guitarist, jazz combo, and in both education and chess clubs. Fourte was a well distinguished sigma tau delta national honor student and appointed by SXU President Christine Wiseman to give private campus tours to guests: Gery Chico, chairman of the Illinois State Board of Education; and SXU Board of Trustee member Roger O. Crockett. Now, Fourte returns to SXU as an administrative assistant for University Advancement. He brings much enthusiasm to his new role as a University staff member, while also working on his Master of Business Administration degree with a concentration in marketing. \"My goal is to be an effective member of the University Advancement staff and produce reliable and positive work,\" said Fourte. Brandon Swanson, 22, also graduated in May 2015 with a Bachelor of Arts degree in communication and business management minor. He was heavily involved in SXU Council and Student Senate. During his senior year, he contributed to SXU Alumni and Parent Relations first-ever Comics for Cougars, a now annual Homecoming event. Swanson was elated to serve as an emcee and introduce rising-star and comedian Pat McGann, who will return for SXUs 2015 event. As an avid sports enthusiast, Swanson served as sports director of WXAV 88.3 FM, SXUs student radio program. While working with WXAV, he announced the home and away games for basketball and football. In 2012, he received the Student Silverdome Award for \"Best Live Game Sports Broadcast\" by the Illinois Broadcasters Association. Swanson thoroughly enjoyed his time at SXU and anxiously wanted to give back to the University that gave him so much. Currently, he serves as assistant director for Alumni and Parent Relations. Swanson hopes to increase the number of young donors by creating a culture of philanthropy from the time students walk into SXU to the time they graduate and beyond. \"I am so passionate about my position here at SXU and I could not ask for a better group of people to work with who also want to make the university a better place for our amazing students,\" said Swanson. Brian Bartelment, 26, graduated from SXU in December 2014 with a Bachelor of Arts degree in English and writing minor. While being a full-time student, Bartelment served as an intern for University Relations, where he proofread and edited various web pages, emails, newsletters, fliers, and brochures. This opportunity gave him a chance to build an impressive portfolio and resume. Bartelment wanted to return to SXU because of how great the staff and faculty were throughout his experience on campus. As a web marketing specialist for University Relations, he hopes to make SXUs web pages and email marketing more engaging and user friendly. \"SXU has a great community that supports the universitys mission,\" said Bartelment. \"I am thrilled to work here and hope I can really help the web team make our website something special.\", Rebekah Marshall, 29, graduated magna cum laude from SXU in May 2014 with a Bachelor of Arts degree in communication. As a student, she worked closely with Dr. Jacqueline Battalora, professor of sociology, anthropology and criminal justice, on womens rights activities. Marshall also participated in a yearlong campaign entitled, \"She is Made,\" which promoted healthy body images for women and removed the sexual implications of women and girls from advertisements. Now, Marshall works as a media project manager for University Relations. She wanted to return to her alma mater because she loved the atmosphere of the campus and wanted to contribute to future students education. Starting in fall 2015, Marshall will have completed her Master of Science degree in communication from Northwestern University and begin teaching Speech 101 at SXU. \"The people you encounter at SXU are truly passionate about teaching and being there for students and I am thrilled that I get to be a part of that,\" said Marshall. Laura Richardella, 24, graduated in May 2013 with a Bachelor of Arts degree in communication with concentrations in online communication, media production and journalism. As a student, she excelled academically with a 4.0 GPA, but also worked in conjunction with University Relations for her senior seminar project. Additionally, Richardella worked as a clerical assistant for Community High School District 218. As marketing communication manager for University Relations, Richardella aspires to increase awareness of the opportunities available at SXU. She enjoyed witnessing the university grow and expand while she was a student and wanted to be involved in the growth of SXUs future. \"As a student, you form a certain kind of relationship with faculty, staff and your peers,\" said Richardella. \"Once you become a staff member, your perception changes - it allows you to realize the effort that it takes to provide the opportunities and education you appreciated as a student.\", Romana Amato, 26, graduated summa cum laude from SXU in May 2010 with a Bachelor of Arts degree in English and writing minor. As a student, she was actively involved on campus - literary editor for OPUS, literary magazine; English tutor; and copy editor for the Xaverite, student newspaper. Amato was on the Deans list all four years and received an \"Excellence in Writing\" award for her creative writing skills. Amato has been working at SXU since she graduated but was recently promoted to director of web strategy for University Relations. During her five years of employment, she obtained her masters in writing and publishing from DePaul University and graduated with honors in 2012. Amato wanted to work at SXU because she knew the University would allow her to follow her passions and achieve her career goals. As director of web strategy, she hopes to make the website more interactive and dynamic, as it plays a large role in prospective student recruitment. In fall 2015, Amato will continue teaching at SXU as she has been since 2013. She always knew she wanted to teach and has thoroughly enjoyed being an adjunct professor at SXU. \"Our students are so passionate, motivated and full of big dreams; they study hard, bring thoughtful ideas and questions to class and support one another,\" said Amato. \"Ultimately, my goal is to help students transition smoothly from college to the professional world, especially in regard to writing well on the job.\", For more information regarding the universitys network of alumni, visit SXUs website: http://www.sxu.edu/alumni/, This item was posted by a community contributor. To read more about community contributors, click here.]", "Date": "20150805", "Author": "[ Community Contributor Saint Xavier University]", "Link": "http://www.chicagotribune.com/suburbs/daily-southtown/community/chi-ugc-article-saint-xavier-university-alumni-return-to-alma-2015-08-06-story.html", "Title": "[ Saint Xavier University alumni return to alma mater]"}