{"Content": "[ When state lawmakers approved broad changes to Illinois workers compensation insurance system in 2011, supporters hoped employers would save at least $500 million a year after medical fees for doctors who treat injured employees were scaled back and changes were put in place aimed at reducing fraud. Four years later, major business groups say theyve seen just a fraction of those savings. Theyre pushing for more stringent regulations in the system that doles out money to workers injured on the job. And this time, theyve got a new power player on their side  Gov. Bruce Rauner. The Republican governor has made workers compensation changes part of his pro-business agenda, a sweeping series of proposals that include limiting damage awards in civil lawsuits, scaling back the influence of labor unions and doing away with prevailing wage laws that set pay for taxpayer-funded construction programs. Much of Rauners agenda is a tough sell to Democratic lawmakers allied with labor unions and trial lawyers that are staunchly opposed to it, and as a result few at the Capitol expect hell get all of it passed. But one area that might be ripe for compromise is workers compensation reform, given that lawmakers already agreed to an overhaul in recent years and theres wiggle room to negotiate further changes. On Tuesday, Democratic House Speaker Michael Madigan will convene the chamber in a rare committee of the whole meeting to allow all 118 members to hear testimony on the workers compensation issue. Meanwhile, Rauner has put together his own group of lawmakers to examine the topic. Rauner hopes to toughen standards workers must meet to prove their injury happened on the job, limit the ability of employees to claim an injury when traveling to or from work, and dramatically reduce reimbursement rates for doctors, hospitals and pharmacies that treat workers. Gov. Bruce Rauner plans to restore approximately $26 million in grant cuts for services ranging from autism treatment to burial services for the poor after a new revenue forecast estimates the state is expected to bring in more money this year than initially anticipated. The move comes after weeks... Gov. Bruce Rauner plans to restore approximately $26 million in grant cuts for services ranging from autism treatment to burial services for the poor after a new revenue forecast estimates the state is expected to bring in more money this year than initially anticipated. The move comes after weeks... He also wants to grant arbitrators the ability to use American Medical Association guidelines as the sole factor in determining how much a seriously injured worker is paid. Those guidelines are considered more conservative than other factors arbitrators can consider, such as a medical records from a treating physician who stands to make money off an injury. Rauner contends Illinois position as the nations seventh-most costly workers compensation system pushes businesses to other states, along with jobs and the accompanying tax dollars that feed into the states coffers. \"Weve got massive problems, and we cannot fix a single one if were not growin,\" Rauner said during a recent speech to the Illinois Chamber of Commerce. \"Weve got to change workers comp so its competitive, its reasonable, its balanced.\", Opponents led by employee unions consider the issue to be part of what they say is Rauners attempt to strip away employee rights to the benefit of corporate bosses. Foes say more time is needed to fully gauge the impact of the 2011 changes and suggest that the intended savings arent being passed along to business but absorbed as profit by insurance companies that are allowed to set their own rates. A month ago, new Republican Gov. Bruce Rauner and state lawmakers agreed to $300 million in cuts as part of a plan to fix a budget passed last year that didnt have enough money to cover 12 months of spending. On Thursday, a few details of what those cuts are started to emerge at the Capitol, though... A month ago, new Republican Gov. Bruce Rauner and state lawmakers agreed to $300 million in cuts as part of a plan to fix a budget passed last year that didnt have enough money to cover 12 months of spending. On Thursday, a few details of what those cuts are started to emerge at the Capitol, though... \"When you say workers comp reform real fast you think, Oh, OK,\" said Michael Carrigan, president of the Illinois AFL-CIO. \"But what it really means to Gov. Bruce Rauners administration is reducing benefits that injured workers receive and reducing injured worker rights. We gave enough in 2011.\", To try to sway Democrats, Rauner has tied the issue to several other high-profile proposals theyve sought, including a minimum wage increase and the possibility hed support a tax hike to offset the need for drastic budget cuts. Its part of the new governors strategy to leverage the annual budget-making process into a broader deal to put in place large parts of his agenda. That tactic already has rankled some Democrats. \"I dont have a problem having a conversation about how to improve policy,\" said Sen. Kwame Raoul, D-Chicago, who previously defended City Colleges of Chicago in workers compensation cases and helped negotiate the 2011 state legislation. \"But I dont think that our budget process ought to be held hostage given the time that we put in four years ago.\", New system, While praised at the time as a step in the right direction, supporters of the previous legislation still compared it with lawmakers offering up a sandwich instead of a steak dinner to a business community hungry for help. Key changes were aimed at preventing abuse and included replacing most of the arbitrators who hear cases for the Illinois Workers Compensation Commission. The idea was to do away with hearing officers who may have had close relationships with attorneys representing workers, leading to more favorable rulings on their behalf. Hearing officers also must be licensed attorneys and undergo ongoing training on fraud, ethics and medical best practices. A limit was set on how much money workers can get for carpal tunnel claims, and new limits were put in place on payouts employees receive for injuries that require them to get a new job with less pay. Arbitrators can now use AMA guidelines as one factor in determining a workers impairment after an injury, and a new review process is aimed at providing some standardization in the type and amount of treatment a worker receives. The majority of savings, however, came from a 30 percent cut in the fees doctors, hospitals and pharmacies get for treating workers. Those groups, which have considerable lobbying strength in Springfield, werent happy about it. In all, the changes saved Illinois employers $315 million during the first few years they were in effect, according to the state workers compensation commission. Employers say thats nowhere close to the minimum $500 million a year in savings billed by then-Democratic Gov. Pat Quinn when he signed the measure into law. Further changes, Business interests point the blame at proposed changes left on the cutting-room floor last time around. Chief among those is whats known as \"causation\"  or proof that an injury happened on the job and not, for example, at a weekend softball game. As it stands, an employee must prove an injury \"arises out of\" and \"in the course of\" employment. Business groups say that standard means they are responsible for covering all injuries, no matter how indirectly related to a job. They cite examples of employees aggravating pre-existing conditions that may have happened before they started working, but companies are on the hook for injuries that werent directly caused by the job. Rauner wants to toughen that standard so a worker must prove work was a \"major contributing cause\" to an injury. \"We feel that is the game-changer,\" said Kim Clarke Maisch, Illinois state director for the National Federation of Independent Business, who argued that efforts to strengthen that standard in 2011 were blocked by labor unions. \"It was pure statehouse politics. I recognize its the job of organized labor to protect their constituents,\" Maisch said. \"And I am sympathetic to the employee who is injured. But if that employee worked in the same industry for 20 years with five different companies, but its the last company they work for who has to pay all the cost for something developed over 20 years, its not really a fair system.\", Rauner also says arbitrators should be able to base awards for permanent partial disability solely on AMA guidelines, which are considered more conservative in determining how much an injured worker is owed. Under the 2011 law, the guidelines are just one of five factors an arbitrator can use in setting an award. In addition, the governor is seeking to tighten the definition of a \"traveling employee.\" He notes recent court decisions have expanded it to include an employee who slipped and fell on the way into work. Rauner wants to law to make clear an employee could only receive compensation if \"the travel was necessary for the performance of job duties.\", Beyond that, Rauner is once again taking aim at the fees doctors and hospitals are paid, contending they still rank among the highest in the nation and should be slashed by an additional 30 percent. That one will be a tough sell for lawmakers who faced blowback from powerful hospital and doctors groups in 2011, which contended they were unfairly asked to bear the brunt of past changes. The Illinois Hospital Association warned that further cuts to medical fees could impact the level of care injured workers receive, saying some doctors and hospitals may simply turn away patients if reimbursement rates drop too low. \"If further reforms happen, it should be a comprehensive solution, not simply looking at the medical fee schedule,\" said Danny Chun, a spokesman for the association. \"You cant just target one factor and that thats going to solve the larger problem.\", Carrigan, the Illinois AFL-CIO president, said many of the ideas pushed by Rauner and business groups would undermine a workers ability to be made whole after being hurt. He said current law already does enough to require a worker to prove an injury happened on the job and says another big business  the insurance industry  is to blame for employers who say the 2011 law had minimal impact on their bottom line. Carrigan notes that since those changes, the National Council on Compensation Insurance, which studies workers compensation and makes insurance rate recommendations, has suggested premiums in Illinois should be reduced by almost 20 percent  an amount he says would have saved companies an estimated $1 billion. Because insurance companies are largely free to set their own rates in Illinois, Carrigan argues that instead of passing along lower premiums, theyre pocketing almost $700 million that should trickle down to employers in the form of lower premiums. But Terri Robinson, state relations executive for the compensation insurance council, said the math isnt quite that simple. She says because Illinois has been adding jobs following the recession, businesses are now paying new premiums they didnt have to account for before. Still, both labor and business groups say its likely time to take a look at how insurance companies set rates for workers compensation. Suggestions include requiring rates to more closely reflect recommendations from the national council or establishing a state-run insurance program. Insurance industry representatives argue the changes put in place in 2011 were modest and did little to ease the expensive nature of Illinois workers compensation system, driven in part by higher wages and benefit packages compared with other states. The idea being the more generous the pay and benefits, the more employees are required to cover. They argue suggestions to limit their ability to set rates would only decrease competition and could have the effect of instead driving up premiums. \"It would be a horrendous step backward,\" said Steve Schneider, vice president for state affairs for the Midwest region of the American Insurance Association. Schneider said its not surprising the industry is being targeted as the bad guy after previous reforms didnt save as much as was billed, but said those taking aim may stand in the way of changes that could bring about more savings. Whether the first-year governor ultimately can strike a deal with lawmakers is an open question. In announcing Tuesdays big House hearing, Madigans team framed up the issue as a discussion of \"the compensation received by workers injured while on the job through no fault of their own.\", \"Numbers on paper alone cant tell the full story of men and women who are hurt at work through no fault of their own and whose families must cope with lost wages and massive medical bills,\" Madigan said in a statement. \"These workers and their families are the reason we have an injured workers compensation system, and they deserve to have their voices heard.\", mcgarcia@tribpub.com]", "Date": "20150504", "Author": "[ Monique Garcia]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-illinois-workers-compensation-rauner-met-20150504-story.html", "Title": "[  Rauner, business groups push for Illinois workers' compensation changes]"}