{"Content": "[ The United Steelworkers union said it has received an initial three-year contract proposal from ArcelorMittal management that includes no wage increases, reduced incentive payments and increased costs for health care for active and retired workers. The current USW contract with both ArcelorMittal and U.S. Steel expires on Sept. 1. \"Overall, (ArcelorMittal) has cherry-picked parts of other USW contracts from a variety of industries to form the basis of a labor agreement that management believes will make the company more profitable,\" the USW stated in a prepared release. An ArcelorMittal spokeswoman said the proposals were made in an effort to close the labor cost gap with the companys competitors without reducing wage rates, which she said are among the highest in the industry. According to a 2014 ArcelorMittal fact sheet, the average annual wage for its union-represented employees is $97,946. The company said union employees currently pay no health care premiums. USWs negotiating committee and ArcelorMittal management are working on a new three-year contract for the steel giants employees at 27 facilities in the U.S. including ArcelorMittal mills in East Chicago and Burns Harbor. The East Chicago mill has 4,124 hourly employees and the Burns Harbor mill has 3,445 hourly employees. Burns Harbor Police Chief Mike Heckman said Tuesday his department is investigating why there was a time lag between when a contractor at ArcelorMittal fell to his death in an elevator shaft and the steel mills call to local authorities. Gregory J. Sebahar, 53, of Schererville, a contract employee... Burns Harbor Police Chief Mike Heckman said Tuesday his department is investigating why there was a time lag between when a contractor at ArcelorMittal fell to his death in an elevator shaft and the steel mills call to local authorities. Gregory J. Sebahar, 53, of Schererville, a contract employee... A USW spokesman said he has no first-hand knowledge about U.S. Steel bargaining, but expects to get an update once the unions bargaining committee receives a proposal from the company. U.S. Steel operates mills in Gary, East Chicago and Portage. Negotiations are taking place as the U.S. steel industry continues to be hurt by steel dumping by foreign countries, resulting in mass layoffs at mills across the country and in Northwest Indiana. Earlier this year, U.S. Steel announced as many as 752 employees would be laid off at its Northwest Indiana facilities by mid-May. According to the USW, ArcelorMittal is also seeking major reductions in vacation pay and sickness and accident benefits and is proposing a lower, two-tier system of compensation and benefits for new hires. The company has also reserved the right to ask for more concessions. Lonnie Asher, president of USW Local 1011, representing workers at ArcelorMittals Indiana Harbor West mill, declined comment. Tom Hargrove, president of USW Local 1010, representing workers at Indiana Harbor East, could not be reached for comment. Both are members of the USW negotiating committee. Representatives for both ArcelorMittal and USW said they will continue to negotiate. \"We are committed to negotiating a fair agreement that does not include drastic reductions in compensation for active and retired employees,\" the USW stated. ArcelorMittals spokeswoman said the company \"is committed to working with the USW to reach a fair agreement that creates a sustainable future for our USA business, workforce and the communities where we operate.\", Karen Caffarini is a freelance reporter for the Post-Tribune.]", "Date": "20150722", "Author": "[ Karen Caffarini]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/news/ct-ptb-mittal-contract-offer-st-0722-20150722-story.html", "Title": "[ USW critical of ArcelorMittal contract proposal ]"}