{"Content": "[ U.S. Sen. Lindsey Graham of South Carolina brought his Republican presidential campaign to Chicagos Pilsen neighborhood Thursday, where he received accolades for backing a comprehensive immigration reform plan that includes an eventual pathway to citizenship. \"Its not about the Republican Party. Its about us as a nation, right? If we dont get immigration right, were going to die on the vine as a nation,\" Graham told more than 100 people at a forum hosted by the Illinois Business Immigration Coalition. Graham has long backed a Senate-passed comprehensive reform plan that would require immigrants living in the country illegally to learn English, pay a fine and pay taxes in order to gain legal status and would eventually allow them a way to become citizens. \"(If Im elected) president of the United States, dont send me a bill without a pathway to citizenship or Ill veto it,\" he said. Graham criticized GOP national front-runner, real estate tycoon and reality TV celebrity Donald Trump for his attacks on immigrants and for a vow Trump made a day earlier to deport the nations estimated 11 million immigrants living in the U.S. illegally. \"Theyre not being made to come here, Mr. Trump. They want to come here. They risk their lives to come here,\" Graham said of Trumps contention that the Mexican government is sending criminals to cross the border into the U.S. Graham, who has served in the Senate for a dozen years, trails in national polls among the 17 major Republican presidential contenders, with a Quinnipiac University survey released Thursday showing him with 1 percent support. His national poll standing makes it unlikely that he will be among the top 10 contenders who get to participate in the first prime-time GOP debate of the presidential campaign Aug. 6. Donald Trump pushed back ever harder Tuesday against Republicans fed up with his provocations, disclosing one opponents cell number in a fiery speech and lashing out at an influential newspaper as part of an in-your-face escalation of the feud. Fellow GOP presidential contender Sen. Lindsey Graham... Donald Trump pushed back ever harder Tuesday against Republicans fed up with his provocations, disclosing one opponents cell number in a fiery speech and lashing out at an influential newspaper as part of an in-your-face escalation of the feud. Fellow GOP presidential contender Sen. Lindsey Graham... \"National polling means nothing at this point. I think its a dumb idea by the Republican Party to limit admission to a debate based on national polling in 2015. It rewards those who have run before from large states and people who are celebrities,\" he said. \"Over time, Im going to rise in Iowa and New Hampshire, where Im spending my time.\", Graham also stood by Illinois Republican U.S. Sen. Mark Kirk, who has been under fire from some elements of the state GOP over a series of verbal gaffes. In June, Kirk referred to Graham, who is single, as a \"bro with no ho\" into an open committee hearing microphone. Kirk later apologized. \"I am totally in Marks camp,\" Graham said of Kirk, who is seeking re-election next year in whats expected to be a top-tier contest. \"Hes a good friend. Hes very knowledgeable on foreign policy. Hes a problem-solver. He has supported comprehensive immigration reform. I think he has a lot to offer the people of Illinois.\", U.S. Sen. and Republican presidential candidate Lindsey Graham arrives at La Casas The Resurrection Project in Pilsen to speak about immigration reform, Thursday July 30, 2015. U.S. Sen. and Republican presidential candidate Lindsey Graham arrives at La Casas The Resurrection Project in Pilsen to speak about immigration reform, Thursday July 30, 2015. rap30@aol.com, Twitter @rap30]", "Date": "20150730", "Author": "[ Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-lindsey-graham-immigration-chicago-met-0731-20150730-story.html", "Title": "[ GOP presidential hopeful Lindsey Graham talks immigration in Pilsen]"}