{"Content": "[ With the announcement last week by Treasury Secretary Jack Lew that there will be a woman on the $10 bill, I found myself daydreaming about all the new equality that will presumably come with such a historic and meaningful honor. Because, surely, with all the current economic problems were attempting to solve  a still unstable job market, widening income inequality, rising poverty  the United States government wouldnt waste its valuable time on some kind of empty symbolic gesture. Surely, putting a woman on a U.S. banknote will be an important step forward for gender equality and advancing womens rights, with a tangible, measurable return on investment, so to speak. Sorry to be sarcastic, but I just cant summon the excitement to celebrate something so trivial and, in a way, insulting to women. The idea that putting a historically important woman  like Hillary Clintons choice, Harriet Tubman, or Nancy Pelosis choice, Frances Perkins  on the $10 bill is a gift of some sort is setting the bar pretty low. Especially for feminists, who youd think would be pretty wary of these kinds of symbolic giveaways that look more like appeasement than action. The movement to put a woman on U.S. currency has been pushed forward by a group called Women On 20s. According to its website, the organization \"aims to compel historic change by convincing President Barack Obama that now is the time to put a womans face on our paper currency\"  namely, by kicking Andrew Jackson off the $20 bill. Alas, not only must women settle for the $10; the Treasury Department also has stated that \"the image of Alexander Hamilton will remain part of the $10 note.\" Hows that for historic, substantive change? As feminist Heather Landy pointed out on Quartz, \"Of course they couldnt just give a woman her own note, right? She can just share it.\" And, she added, referring to the oft-cited but not entirely accurate liberal talking point that women make less than men for equal work, \"While were at it, why doesnt the government just give women a 78-cent note and call it a dollar?\", Whoever the woman is on the next $10 bill, heres who it shouldnt be:, A politician. A Cabinet member. A first lady. Put a poet there. A scientist. A musician with a social cause. A social worker. A teacher. A suffragette. An abolitionist. But, please, not someone primarily associated with politics. Whoever the woman is on the next $10 bill, heres who it shouldnt be:, A politician. A Cabinet member. A first lady. Put a poet there. A scientist. A musician with a social cause. A social worker. A teacher. A suffragette. An abolitionist. But, please, not someone primarily associated with politics. I always thought feminism had a pretty complicated relationship with capitalism. Just two years ago, feminist Nancy Fraser wrote critically that feminists had grown too comfortable with capitalism. She fretted that the womens lib movement \"has become entangled in a dangerous liaison with neoliberal efforts to build a free-market society,\" and lamented that feminists who once \"criticized a society that promoted careerism\" now \"celebrate female entrepreneurs.\", Why, after decades of complaining that our American economic system is oppressive, male-organized, unfair and broken, are modern feminists now begging to be featured on its most famous symbol?, Moreover, what good are symbols in confronting reality? Putting a woman on the $10 bill has nothing to do with ending domestic violence, for example, or with preventing college rape. It wont change the difficulties a woman faces balancing work and home life. If only that were the case. Im sure in Nigeria, women would gladly trade in their spot on the 50 naira note for the right not to be legally assaulted by their husbands. And I imagine Chadian women would relinquish their spot on various franc notes for a higher literacy rate.  I move that, by unanimous consent, the American people approve Harriet Tubman for the re-designed $10 bill. Ultimately, U.S.Treasury Secretary Jack Lew will make the decision, but in announcing this week that a portrait of a notable American woman would take the place of Alexander Hamilton on...  I move that, by unanimous consent, the American people approve Harriet Tubman for the re-designed $10 bill. Ultimately, U.S.Treasury Secretary Jack Lew will make the decision, but in announcing this week that a portrait of a notable American woman would take the place of Alexander Hamilton on... Or in the Bahamas, where its legal for a husband to sexually assault his wife if she is over the age of 14, I doubt theyd say having the Queen of England on their banknotes has vastly improved their position in society. Women in our own country face actual injustices every day, too. Glancing at Frances Perkins on the $10 bill as I quickly pass it to a cashier wont do much to solve them. Aim higher, gals. Tribune Content Agency, S.E. Cupp is a Washington-based CNN contributor and author of \"Losing Our Religion.\", thesecupp.com]", "Date": "20150622", "Author": "[ S.E. Cupp]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-10-lew-tubman-pelosi-hillary-clinton-hamilton-naira--andrew-jackson-perspec--20150622-story.html", "Title": "[ A woman on the $10 bill? Big deal]"}