{"Content": "[ If you dont recognize the name Juan Francisco Lopez Sanchez, dont worry: You will. Hes not a candidate for president, but before long hell have higher name recognition than Jeb Bush. A felon convicted on several drug charges, the Mexican national had been deported five times but managed to get back into the U.S. He has been charged with the apparently random murder of 32-year-old Kate Steinle in San Francisco on July 1. For anti-immigration advocates, his case starkly exposes everything that is wrong with our immigration policies. Those flaws would be: First, Sanchez was here  illustrating our unwillingness to secure the border. Second, he was (allegedly) violent, proving the danger that unauthorized immigrants pose to American citizens. Third, he was not held for federal immigration agents by the sheriff, an indictment of San Franciscos \"sanctuary city\" policy. Donald Trump used this episode to buttress his claim that Mexico is sending criminals to the United States. Mark Krikorian, head of the conservative Center for Immigration Studies, said the tycoons \"widely mocked warnings of this very danger have been vindicated.\", But what does this prove, exactly? Its no secret that anyone who is sufficiently determined to sneak into the country from Mexico can probably do so sooner or later. Thats not because enforcement is lax. Spending on border security has tripled, after adjustment for inflation, since 2000. The number of Border Patrol agents has risen fivefold in the past two decades. Politicians act as though we could make the Mexican border impermeable. But recent experience shows thats a fantasy. The accused is anything but representative of Mexican immigrants, documented or otherwise. Contrary to myth, this group is averse to violent crime as well as property crime. Noncitizens, who make up about 13 percent of the population, account for about 6 percent of all federal and state prison inmates. Many of them, of course, are not undocumented immigrants but legal ones. A law enforcement official says the weapon used in the shooting death of a woman on a San Francisco pier belonged to a federal agent. The suspect in the shooting, Juan Francisco Lopez Sanchez, pleaded not guilty to murder July 6, 2015. (AP), A law enforcement official says the weapon used in the shooting death of a woman on a San Francisco pier belonged to a federal agent. The suspect in the shooting, Juan Francisco Lopez Sanchez, pleaded not guilty to murder July 6, 2015. (AP), A 2008 study by economists Kristin Butcher of Wellesley College and Anne Morrison Piehl of Rutgers University for the Public Policy Institute of California reported that people born abroad make up 35 percent of that states adult population  but only 17 percent of state prisoners. \"Noncitizen men from Mexico ages 18-40  a group disproportionately likely to have entered the United States illegally  are more than eight times less likely than U.S.-born men in the same age group to be in a correctional setting,\" the authors found. Its true that if Sanchez were not in the country, he would not have been able to kill anyone. But if the presence of immigrants has a protective effect against crime in the neighborhoods where they live, as the evidence suggests, then there are murders that would have occurred but didnt because of their presence. San Francisco does have a \"sanctuary\" law that prohibits local police from working with the federal Immigration and Customs Enforcement without a court order or warrant. Maybe in this case the city went too far  or maybe the feds simply dropped the ball. Long before he was arrested in the shooting death of a woman at one of San Franciscos most popular tourist sites, Juan Francisco Lopez Sanchez was using the U.S.-Mexican border like a revolving door. He was arrested while in the U.S. illegally and deported to his native Mexico five times from... Long before he was arrested in the shooting death of a woman at one of San Franciscos most popular tourist sites, Juan Francisco Lopez Sanchez was using the U.S.-Mexican border like a revolving door. He was arrested while in the U.S. illegally and deported to his native Mexico five times from... They had turned the suspect over after he completed a federal prison term for trying to enter the country illegally. It would have made more sense to deport him. In any case, they apparently didnt take legal steps to make sure of getting him back when the city was done with him. Instead, they merely asked the city to hold him. A local court dismissed an outstanding charge against Sanchez. Sheriff Ross Mirkarimi said he would have given him back to ICE if it had issued a warrant. Since it didnt, he let him go. Given that the inmates record showed no violent crime convictions, though, his implication in a killing was hardly foreseeable. The sanctuary policy, in any event, is not a mindless favor to felons but an attempt to promote valuable cooperation between local immigrants and police. If otherwise law-abiding undocumented foreigners fear being apprehended by local cops on immigration violations, they arent likely to help solve crimes. If they are assured the cops wont report them, they are more likely to come forward. Mirkarimi knows something Trump and his allies refuse to learn: In advancing public safety, undocumented immigrants, when treated generously, are more helpful than harmful. Its a shame that Sanchez, if guilty, was not deported before he could commit this crime. But he proves no more about undocumented immigrants than John Lennons killer proves about white guys named Chapman. Steve Chapman, a member of the Tribune Editorial Board, blogs at http://www.chicagotribune.com/chapman. schapman@tribpub.com, Twitter @SteveChapman13]", "Date": "20150710", "Author": "[ Steve Chapman]", "Link": "http://www.chicagotribune.com/news/opinion/chapman/ct-san-francisco-murder-immigration-lopez-sanchez-perspec-0712-jm-20150710-column.html", "Title": "[ An undocumented immigrant and a killing ]"}