{"Content": "[ Republican presidential candidate Jeb Bush said Tuesday the U.S. may need to send more ground troops into Iraq to defeat Islamic State militants, but he stopped short of saying how many as he outlined his strategy for combating a threat thats \"spreading like a pandemic.\", In the first major foreign policy speech of his White House bid, Bush sharply criticized Hillary Rodham Clintons tenure as secretary of state and accused the Democratic front-runner and President Barack Obama of allowing the militant group to take hold in the Middle East. \"Who can seriously argue that America and our friends are safer today than in 2009, when the president and Secretary Clinton  the storied team of rivals  took office?\" Bush said. \"So eager to be the history-makers, they failed to be the peacemakers.\", Along with saying he would potentially boost the number of U.S. troops in Iraq, where roughly 3,500 American military trainers and advisers are already helping Iraqi forces fight the Islamic State group, Bush offered a broad look at how he would take on the group in neighboring Syria  which Bush and Middle East experts agree is a far more complicated task. Beating back IS there will require the removal of that countrys president, Bashar Assad, Bush said. To do so, he said he would aim to unite the moderate forces fighting IS in that country and for U.S. troops to \"back them up as one force.\", \"And we should back that force up all the way through  not just in taking the fight to the enemy, but in helping them to form a stable, moderate government,\" he said. \"Its a tough, complicated diplomatic and military proposition, even more so than the current situation in Iraq. But it can be done.\", Jeb Bush blames Clinton for ISIS and Trump complains about mistreatment. August 11, 2015. (WGN-TV), Jeb Bush blames Clinton for ISIS and Trump complains about mistreatment. August 11, 2015. (WGN-TV), Bush has previously touched on aspects of his strategy for Iraq, such as allowing the training and advisory troops already in the country to join Iraqi forces on the battlefield and help in better guiding airstrikes. He again expressed support for a no-fly zone in Syria. In his speech at the Ronald Reagan Presidential Library, Bush tied the rise of IS, a militant Sunni group that occupies a large swath of Iraq and Syria and has a presence elsewhere in the region, to the departure of U.S. forces from Iraq in 2011. \"ISIS grew while the United States disengaged from the Middle East and ignored the threat,\" he said. \"And where was Secretary of State Clinton in all of this?\" Answering his own question, he said Clinton \"stood by as that hard-won victory by American and allied forces was thrown away. In all her record-setting travels, she stopped by Iraq exactly once.\", Clinton has said she supported keeping a residual force behind in Iraq, but a proposal to do so fell through after Baghdad refused to give the troops immunity from legal charges, as Washington demanded. Jeb Bush sharply criticized President Barack Obama on Tuesday for withdrawing troops from Iraq, but he declined to say whether he would order additional ground forces into the country to repel Islamic State militants.Speaking to about 60 business and Republican leaders in New Hampshire, the former... Jeb Bush sharply criticized President Barack Obama on Tuesday for withdrawing troops from Iraq, but he declined to say whether he would order additional ground forces into the country to repel Islamic State militants.Speaking to about 60 business and Republican leaders in New Hampshire, the former... \"Thats the position we all agreed to,\" said James Jeffrey, the former U.S. ambassador to Iraq and a deputy national security adviser under President George W. Bush, whose administration set the withdrawal deadline in a 2008 security agreement. By blaming Clinton for the rise of Islamic State militants, Bush is trying to divert attention from the actions of his brother, who pushed for the invasion of Iraq in 2003, Clinton campaign senior policy adviser Jake Sullivan said. \"This is a pretty bold attempt to rewrite history and reassign responsibility,\" Sullivan said. \"President Bush signed an agreement that required us to be out by 2011.\", The alternative would have been for the U.S. to maintain troops in Iraq who were subject to the Iraqi legal system and there against the will of the host country. Obama, who campaigned for president on ending the Iraq war, took the opportunity to remove all U.S. forces. \"It was a case of blind haste to get out and to call the tragic consequences somebody elses problem,\" Jeb Bush told a group of about 1,000 supporters at the Reagan library. \"Rushing away from danger can be every bit as unwise as rushing into danger, and the costs have been grievous.\", Despite 6,000 airstrikes flown by U.S. and allied forces on Islamic State positions over the past year, American intelligence agencies recently concluded the militants remain a well-funded extremist army able to replenish their ranks with foreign fighters as quickly as the U.S.-led coalition can eliminate them. Bush addressed what polls show to be Republicans top concern, national security and terrorism. But while 60 percent of Americans said the effort to stop IS was going badly in a CBS News poll taken the first week in August, they were basically tied on whether U.S. ground troops were the answer: 46 percent for, 45 percent against. \"American voters are worried about getting back in,\" said Elliott Abrams, a deputy national security adviser under George W. Bush who is advising Jeb Bush, among other Republicans. \"But Gov. Bush is certainly making no effort to avoid the issue. And he doesnt seem to think he ought to shy away from it because his name is Bush.\", Several other GOP candidates have criticized Obamas actions and called generally for a more aggressive U.S. posture. South Carolina Sen. Lindsey Graham has been the most specific, calling for up to 20,000 U.S. ground troops in Iraq and Syria and a U.S.-led force to maintain stability afterward. \"If you dont do what Im talking about, youre not serious about destroying ISIL,\" Graham told The Associated Press on Saturday, using one of the Islamic States several acronyms. Associated Press]", "Date": "20150812", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-jeb-bush-hillary-clinton-islamic-state-20150811-story.html", "Title": "[ Bush says we may need more troops in Iraq, blames Clinton for Islamic State]"}