{"Content": "[ After years of negotiation and, yes, restoration, a Restoration Hardware is scheduled to open in the middle of Chicagos ritziest neighborhood this fall. The 62,000-square-foot former Three Arts Club building at 1300 N. Dearborn St. has been vacant since 2003 and, since 2010, owned by Don Wilson, a wealthy Chicago trader and top donor to Mayor Rahm Emanuel who bought up an enormous amount of prime real estate during the downturn. For nearly a century, the four-story brick building was a residence and hub for young female artists. It was zoned residential. It has no parking. Its in the middle of the Gold Coasts residential area. And its going to be a Restoration Hardware? With a restaurant? How in the world did Wilson pull this off?, Wilson, who bought the property out of foreclosure for less than $13 million, wasnt available to explain, according to his spokesman. But after I spoke with five parties involved, one of whom declined to speak on the record, it became clear Wilson made many compromises to win the support of neighbors for a zoning change from a residential to commercial use. To be precise, 13 pages worth of detailed signed and notarized compromises. The most unusual aspect of the deal is that within 30 days of Restoration Hardware getting its occupancy permit, Wilson is required to file a request to rezone the property back to residential. And if his team for some reason fails to do so, the North Dearborn Association, a neighborhood group, has the right to do so for him. The projects most compelling feature is that it is not going to be a typical Restoration Hardware. Its going to be called something grandiose: \"RH Chicago, The Gallery at the Historic Three Arts Club.\" And its going to be grandiose. \"The building will include dramatic artistic installations featuring collections from renowned designers and artisans across the globe, as well as RH Contemporary Art, a full-service RH Design Atelier and a Rooftop Park & Conservatory with sweeping views of historic Chicago in the distance,\" the company said in a statement. If the brands similar \"galleries\" in Boston and Atlanta are any indication, it may very well be the most extravagant, or at least the most extravagant-looking, retail project in Chicago history. The part thats appealing to the neighbors is that the only thing customers will be able to carry out of it are to-go boxes from the restaurant. Its a showroom a la a Merchandise Mart showroom. That means no delivery trucks and no people parked out on Dearborn for hours with their flashers blinking. These days, even food courts are being \"curated.\", Take the planned makeover at the Ogilvie Transportation Center at 500 W. Madison St. Over the next several months, patrons will say goodbye to traditional food court fare as Burger Joint, Robinsons No. 1 Ribs and Caribou Coffee are replaced by... These days, even food courts are being \"curated.\", Take the planned makeover at the Ogilvie Transportation Center at 500 W. Madison St. Over the next several months, patrons will say goodbye to traditional food court fare as Burger Joint, Robinsons No. 1 Ribs and Caribou Coffee are replaced by... Still, where are people going to park?, The covenant agreement with the three closest neighborhood associations  Sutton Place, North Dearborn and Whitney Condominium  spells out that Restoration Hardware must provide valet service with access to at least 50 nearby parking spots. Furthermore, the restaurant must close no later than 9 p.m. on Saturdays and 8 p.m. on Sundays. It can seat no more than 100 guests. It can serve wine and beer only. No liquor. Exhaust from the kitchen hoods has to be blown upward at exit points that are higher than the buildings roofline. The store can host no more than six charitable events a year. No spotlights or floodlights on the roof or audio speakers anywhere on the exterior, except the roof. The trash needs to be picked up seven days a week and only between 8 a.m. and 5 p.m. The signs on the building \"shall not exceed 20 square feet.\", The windows on the north side of the building and the first floor of the west side of the building have to be covered in an \"opaque material.\", No deliveries or delivery trucks in the alley, and \"not more than one delivery of furniture or other large merchandise per month by not more than one box truck.\", These are a fraction of the requirements. These people seemingly thought of everything. It is a tour de force of legal power. Malcolm Kamin signed as president of the Sutton Place Association. He is an attorney and was a delegate to Illinois 1970 Constitutional Convention. (Full disclosure: His wife, Kay, is my financial adviser and a lawyer.), The North Dearborn Association hired Chicago land use and zoning attorney Steven Elrod to draft and negotiate the agreement for all of the parties. \"The toughest negotiations were amongst the neighbors,\" Kamin said. \"One of the reasons that we, Sutton Place, jumped in is that the North Dearborn Association didnt care what happened in the alley. From the perspective of Dearborn Street, theyd like to ship everything in and out of the alley.\", Both Kamin and North Dearborn Association zoning committee chairman Robert Newman said the neighbors got what they wanted. \"Then and still (today), they were cooperative and negotiated in good faith,\" Newman said, referring to Wilsons team. \"There werent very many, if any, terms or conditions we werent able to agree upon.\", Kamin also had the benefit of living next door when the club was still active. \"A lot of things in the covenant are all things people hated about the Three Arts Club when it functioned as the Three Arts Club,\" Kamin said. No surprise that dumpsters in the alley full of food waste were at the top of Kamins list of concerns. \"Ultimately, the project is still somewhat controversial, but everybody recognized the building was sitting there falling down,\" he said. \"It was just in horrendous shape, and that was going to be a worse problem for the neighborhood than this kind of proposed use.\", Newman said the same thing. Both come across as savvy yet practical. In most cases, Id worry about how all of these rules are going to be enforced, but Section 5 of the agreement covers \"Enforcement.\" And they seem to have an abundance of lawyers available to assist. Nicely done, neighbors. mmharris@tribpub.com, Twitter @chiconfidential]", "Date": "20150708", "Author": "[ Melissa Harris]", "Link": "http://www.chicagotribune.com/business/ct-harris-restoration-hardware-0709-biz-20150708-column.html", "Title": "[ How Restoration Hardware landed in the Gold Coast]"}