{"Content": "[ A German woman fighting with Kurdish militiamen was killed battling Islamic State in Syria, Kurdish officials and activists said Monday. Ivana Hoffman, 19, died Saturday while fighting alongside the Kurdish Peoples Protection Units, known as the YPG, near the Syrian village of Tel Tamr, YPG spokesman Nawaf Khalil said. Hoffman, a member of the Marxist-Leninist Communist Party in Turkey, joined YPG fighters about six months ago, Khalil said. Serdar Sitr, president of the Kurdish Solution Party in Iraq, and the Britain-based Syrian Observatory for Human Rights also confirmed Hoffmans slaying. The exact circumstances of her death werent immediately clear. Hoffman, born in Germany to South African parents, is the third foreign national  and the first female foreign fighter  known to be killed fighting with Kurdish forces against the Islamic State group. Elsewhere in Syria, airstrikes by the U.S.-led coalition hit an oil refinery held by the Islamic State group outside the town of Tel Abyad, activists said. Video from the Turkish Dogan News Agency showed the strikes Sunday night, which saw an enormous fireball engulf the refinery. The Observatory, which relies on a network of activists inside Syria, estimated the strikes killed about 30 people  including Islamic State militants and refinery workers. The Syrian activist group Raqqa is Being Slaughtered Silently also reported the strikes, but offered no casualty figure. Islamic State militants continued their campaign targeting cultural heritage sites in territories they control in northern Iraq, looting and damaging the ancient city of Hatra just one day after bulldozing the historic city of Nimrud, according to Iraqi government officials and local residents.... Islamic State militants continued their campaign targeting cultural heritage sites in territories they control in northern Iraq, looting and damaging the ancient city of Hatra just one day after bulldozing the historic city of Nimrud, according to Iraqi government officials and local residents.... The Islamic State group, which controls a self-declared caliphate on captured territory covering about a third of Syria and Iraq, partially funds its conquests through the sale of black market oil. The U.S.-led coalition did not immediately acknowledge launching the strike.  Associated Press]", "Date": "20150309", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-german-woman-killed-islamic-state-20150309-story.html", "Title": "[ German woman fighting with Kurds killed battling Islamic State]"}