{"Content": "[ On the eve of the Supreme Court decision that made same-sex marriage the law of the land, Esurance has weighed in with an online video in support of marriage equality. The online insurance company, part of Northbrook-based Allstate, took an unequivocal stance on the controversial subject with the release this week of the #EqualDreams video, which was shot at a traditional Chicago wedding earlier this month. \"We created this online film to show, in an emotionally compelling way, our belief that all dreams should be equal,\" Esurance chief marketing officer Alan Gellman said in a statement. \"But its not just a belief. As a modern company, we act on that belief through our products and insurance offerings.\", Before the ruling, same-sex couples could marry in 37 states, including Illinois. The Supreme Court ruled Friday on six marriage equality cases from Kentucky, Michigan, Ohio and Tennessee, a decision that upheld the rights of same-sex couples to wed across the U.S. The Supreme Court decision, and the Esurance video, coincide with gay pride month events taking place across the country, including Sundays annual Pride Parade in Chicago. The nearly three-minute video was created by ad agency Leo Burnett and filmed at the wedding of Heidi Hewitt and Chris Rogers on June 13 at Greenhouse Loft on Diversey. It includes interviews with children imagining what their own weddings will be like, while several gay teens in attendance express doubts that such a day will come for them. Esurance has yet to turn a profit since Allstate bought the online insurer for $1 billion in 2011, but the Northbrook-based company remains committed to the business. \"We could obviously make that business profitable by shutting down advertising and growth, and were choosing not to do that because... Esurance has yet to turn a profit since Allstate bought the online insurer for $1 billion in 2011, but the Northbrook-based company remains committed to the business. \"We could obviously make that business profitable by shutting down advertising and growth, and were choosing not to do that because... \"Sometimes children can make complex issues so simple,\" Brian Shembeda, creative director at Leo Burnett, said in a statement. \"They remind us what its like to have dreams.\", Esurance, acquired by Allstate for $1 billion in 2011, has been ahead of the curve on marriage equality issues, at least when it comes to car insurance. The company has offered gay couples a married rate since 2011, even in states that do not allow same-sex marriages. \"Esurance recognizes all marriages. Plain and simple,\" said Nancy Abraham, vice president of marketing for the company. rchannick@tribpub.com, Twitter @RobertChannick]", "Date": "20150626", "Author": "[ Robert Channick]", "Link": "http://www.chicagotribune.com/business/ct-esurance-gay-marriage-video-0626-biz-20150625-story.html", "Title": "[ Esurance shows support for gay marriage with \"Equal Dreams\" video]"}