{"Content": "[ Wisconsin Gov. Scott Walker, who was once considered a formidable candidate for the Republican presidential nomination, announced on Monday that he will quit the GOP race in the face of plummeting support and mounting financial difficulties that left him with slim hopes of finding a path to victory. The stunning announcement came after two months of mounting problems that had put his once-highflying campaign into a downward spiral. Walker led the polls in Iowa earlier this year, but his standing in recent surveys dropped into single digits. Nationally, his numbers suffered even more. Walker bowed out with explicit criticism of the negative tone of the Republican race, which he said had descended into personal attacks, and with thinly veiled criticism of front-runner Donald Trump. \"Today I believe I am being called to lead by helping to clear the field in this race so that a positive conservative message can rise to the top of the field,\" Walker said in Madison, Wisconsin. He urged others to do the same to give voters a choice among a limited number of people who can offer \"a positive conservative alternative to the current front-runner.\", Walkers candidacy, like those of other elected and former elected officials, began to erode because of the growing support for three non-politicians - Trump, retired neurosurgeon Ben Carson and former Hewlett-Packard chief executive Carly Fiorina. But Walkers plight was compounded by strategic mistakes and self-inflicted wounds that raised questions about his readiness to serve as president. Walkers departure comes less than two weeks after former Texas governor Rick Perry announced that he would suspend his candidacy. Both decisions reflect the unforgiving impact of public opinion polls in this early stage of the campaign and the apparent role that the candidate debates are playing in shaping attitudes. Wisconsin governor Scott Walker has dropped out of the Republican race for president. One of the last Republicans to enter the race, Walker joins former Texas Governor Rick Perry as one of the first to leave it. Sept. 21, 2015. (AP), Wisconsin governor Scott Walker has dropped out of the Republican race for president. One of the last Republicans to enter the race, Walker joins former Texas Governor Rick Perry as one of the first to leave it. Sept. 21, 2015. (AP), Walkers decision, like that of Perry, points to another reality of campaigning in this cycle: Having a well-funded super PAC is no insurance that a candidate can survive in the face of poor poll numbers. In the vicious cycle of modern-day campaigning, weak poll numbers quickly dry up fundraising, making it difficult to pay for everyday operations, which brings further retrenchment and, in the case of Walker, eventual extinction. In an era of reality-TV politics, Walker, a Harley-riding Midwest everyman, suffered as well from a personality that was easily overshadowed. His advisers believed he had performed adequately in last weeks debate, but he was judged more harshly by critics who said he seemed to fade into the background through long portions of the forum. Gary Marx, who coordinated Walkers outreach to conservative movement groups, said on Monday that it had been hard to generate enthusiasm from the start. \"The conservative governor who is a fighter with results wasnt the right message for these times,\" Marx said. \"It has not been resonating at all this year, across the board and throughout this process.\", Here are presidential candidates who have announced, talked about announcing or drawn serious interest for possible runs in 2016. Its a long list. Walker can bequeath few supporters to other candidates, but he has something of great value: a national network of major contributors who had flocked to him during his battles against labor unions in Wisconsin and who helped his super PAC raise $20 million in just two months this summer. Other teams were already at work to woo those contributors as Walker bowed out. Walkers campaign had been reeling for the past month, and there were calls from donors and others for a shake-up among his top staff. The large cadre of staff members and paid consultants around Walker had been on what one called a \"death watch\" for the past several weeks. The governors political team had been bracing for spending cuts, layoffs and a change in leadership, according to one Republican operative working with the Walker team. Still, the candidate kept his deliberations very close, with most staff, including senior aides, finding out only Monday that he had decided to end his campaign. It was Walker, apparently, who concluded that the effort was no longer viable. Several Walker donors, prominent supporters and fundraisers said they first learned Walker was dropping out from media reports. Minnesota businessman Stanley Hubbard and his wife have been longtime supporters of the Wisconsin governor, but they began to lose faith as Walker fell in the polls. Over the weekend, the Hubbards decided to start donating to other GOP candidates - Fiorina, Carson, Florida Sen. Marco Rubio and New Jersey Gov. Chris Christie. \"We could see this coming, although we hoped Scott could do something to turn it around,\" Hubbard said in an interview on Monday evening. \"Its like picking a TV anchor: You can have five people and give them each the same script, and they will say the exact same thing, and at the end of the day everyone will say, That one was the best. I guess its called star power.\", New York investment broker Eric Anton, a top Walker donor, said he was surprised Walker dropped out as quickly as he did, adding that he had thought the campaign would try to make changes first. Anton said he was \"so depressed\" by the news. \"My heart is broken,\" he said. Asked whom he plans to support now, Anton named three favorites: Rubio, Texas Sen. Ted Cruz and Fiorina. Elected governor in 2010 after having served as Milwaukee County executive, Walker came to national attention in early 2011 when he sought to restrict collective-bargaining rights for public employee unions in Wisconsin. The confrontation brought thousands of angry demonstrators to the state capitol in Madison and generated threats against Walker and his family. In that clash, Walker held firm, and the GOP-controlled legislature enacted his spending cuts and union restrictions. But that did not end the battle. In 2012, Walker was forced into a recall election and another brutal confrontation with the unions and the left. Walker survived that recall and won reelection in 2014. He came into the presidential campaign with unexpected force, delivering a fiery and well-received speech at a gathering of conservatives in Iowa in January. But he became a victim of his sudden success, proving quickly that he was not well prepared for the rigors of a presidential campaign. \"It was nice for him to get that attention in the short run, but it set up expectations he couldnt hope to maintain,\" said Vin Weber, a former Minnesota congressman and an adviser to Jeb Bushs presidential campaign. Some Republicans believe that Walker drew the wrong lessons - and a false sense of confidence - from his battles in Wisconsin. He stumbled when asked about evolution. He appeared to suggest that his clashes at home prepared him to take on Islamic State terrorists. He changed his position on comprehensive immigration reform. He formally announced his candidacy just two months ago, pledging that he alone among the GOP candidates had demonstrated that he could fight and win against the Democrats. At the time, he was leading polls in Iowa, the state that he and his campaign saw as critical to winning the nomination. That changed after Trump got into the race. Faced with renewed scrutiny, Walker again wobbled. In recent weeks, he suggested that he favored ending birthright citizenship, which is guaranteed by the Constitution, then spent days working his way out of it. A final blow came on Sunday when a new national CNN-ORC poll showed Walker registering at less than 1 percent. Jamie Johnson, who had been Perrys Iowa state director, was in the audience for Walkers weekend Faith and Freedom dinner speech. He said the onetime front-runner seemed listless and lost. \"Someone asked me: Whats happened to Walker? \" Johnson recalled. \"I said: You know how some candidates are trying to find his voice? Hes trying to find his core. And boy, you could see that onstage. The old blue shirt with sleeves rolled up twice wasnt cutting it anymore.\", More than one Republican said over the past weeks that a politician known for his discipline and focus had lost his balance as troubles mounted. As Johnson put it: \"Walker changed the direction of his ship so many times that he created a whirlpool, and the ship went down.\", Washington Post staff writers Robert Costa, Philip Rucker, David Weigel and Sean Sullivan contributed to this report. ]", "Date": "20150921", "Author": "[ Dan Balz, Jenna Johnson, Matea Gold]", "Link": "http://www.chicagotribune.com/news/nationworld/politics/ct-scott-walker-ends-presidential-campaign-20150921-story.html", "Title": "[ Wisconsin Gov. Scott Walker exits presidential race with harsh words for Trump]"}