{"Content": "[ While you might think the Iraq war would be the last thing Jeb Bush would want to talk about, given the fact that his brothers war was probably the single greatest foreign policy catastrophe in U.S. history, and that Jeb Bush himself spent weeks trying to figure out whether he should say it was a mistake, he has not shied away from the topic. Just the opposite, in fact. He keeps bringing it up, and his latest remarks make clear just how little he understands about what happened there and what lessons it holds for the future. Heres what Bush said Thursday, as he continued to push the line that the war was won until President Barack Obama messed everything up by leaving prematurely:, He notably used wording similar to the Mission Accomplished banner that hung behind the 43rd president as he gave a speech on an aircraft carrier in 2003. The speech was one of the biggest embarrassments of his administration, since the war went on for years after that. Ive been critical and I think people have every right to be critical of decisions that were made, Bush said Thursday. In 2009, Iraq was fragile but secure. It was ... mission was accomplished in the way that there was security there and it was because of the heroic efforts of the men and women in the United States military that it was so. In a question and answer session hosted by Americans for Peace, Prosperity and Security held on a college campus here, the Republican presidential hopeful said the removal of Iraqi president Saddam Hussein from power turned out to be a pretty good deal, and he praised the 2007 troop surge his brother pushed as an extraordinarily effective strategy. The idea that removing Hussein turned out to be a pretty good deal is so deranged that it boggles the mind. Imagine if his brother had said to the country in 2003, Let me offer you this deal: Well take out Saddam Hussein, and itll only cost us 4,000 American lives, tens of thousands more Americans gravely wounded in body and spirit, around $2 trillion, a worldwide surge in anti-Americanism, and years of chaos in the Middle East. Whaddya say? Sounds like a pretty good deal, right?, Republican Jeb Bush couldnt fully escape questions about his familys political legacy as he spoke from the Iowa State Fairs political soapbox on Friday. The former Florida governor took several heated foreign policy questions as he spoke before hundreds gathered around the soapbox hosted by... Republican Jeb Bush couldnt fully escape questions about his familys political legacy as he spoke from the Iowa State Fairs political soapbox on Friday. The former Florida governor took several heated foreign policy questions as he spoke before hundreds gathered around the soapbox hosted by... But lets set that aside. What about the idea that everything in Iraq was going great  fragile but secure  until Obama prematurely pulled the United States out? Bush is wrong on both counts. First, theres one absolutely vital fact one needs to understand on this topic, a fact that Bush doesnt mention: The timing of the departure of U.S. troops from Iraq was not decided by Obama; it was decided by George W. Bush. The Status of Forces Agreement negotiated between the American and Iraqi governments declares in Article 24, All the United States forces shall withdraw from all the Iraqi territory no later than December 31, 2011. It was signed on Nov. 17, 2008, when Jeb Bushs brother  not Obama  was president of the United States. Conservatives argue that, well, Obama could have negotiated a new SOFA, one that allowed plenty of U.S. troops to stay. And there was such a negotiation, but it foundered over the issue of immunity for U.S. troops. The administration refused to leave a residual force there without a guarantee that our troops would not be arrested and tried by Iraqi authorities  something no U.S. president, Democrat or Republican, would tolerate. When it became clear that the Iraqi parliament wasnt going to approve such a guarantee, the negotiations broke down. Republican presidential contender Jeb Bush will be an opening-night guest on Stephen Colberts late-night show. In a tweet posted Tuesday, the former \"Colbert Report\" host said Bush will join him on the Sept. 8 debut of CBS \"The Late Show with Stephen Colbert.\", \"My first GOP candidate!\" his Twitter... Republican presidential contender Jeb Bush will be an opening-night guest on Stephen Colberts late-night show. In a tweet posted Tuesday, the former \"Colbert Report\" host said Bush will join him on the Sept. 8 debut of CBS \"The Late Show with Stephen Colbert.\", \"My first GOP candidate!\" his Twitter... Its certainly true that Obama was eager to abide by George W. Bushs schedule and have the United States out of Iraq by the end of 2011. And it may be true that if we had left thousands of troops there, they might have been able to keep some of the ensuing violence from happening. But they couldnt have altered Iraqi politics, and thats the second thing Bush gets wrong. What Iraq needed to secure its future was the one thing Americans couldnt give it: a political reconciliation. Without that, there would continue to be endless conflict, just as there has been. It was the Maliki governments relentless sectarianism that created the opening for the Islamic State to emerge. And this is perhaps the most dangerous thing about Bushs perspective on Iraq, which can also be said of his primary opponents. They display absolutely no grasp of the internal politics of Iraq, now or in the past, not to mention the internal politics of other countries in the region, including Iran. Indeed, most Republicans dont seem to even believe that these countries have internal politics that can shape what the countries choose to do and how they might react to our actions. This was one of the key failures of imagination that led to the Iraq disaster in the first place. The Bush administration barely bothered to consider that removing Hussein could trigger internal strife within the country as different factions emerged to struggle for power. It just assumed that wed bomb the hell out of the place, and then all Iraqis would crawl from the rubble and join hands to create a flourishing, peaceful liberal democracy. And incredibly, after all that has happened, so many Republicans still dont get it. They continue to believe that the only factor that matters when we approach any new challenge in the Middle East is whether were sufficiently strong. Any victory can be achieved, any intricately complex knot can be unraveled, any unintended consequence can be avoided, if only we remain strong and project our strength. Theyve learned absolutely nothing. If theres any good news here, its that well have an ongoing opportunity to debate the Iraq war disaster. Bush seems perfectly willing to talk about it, and the fact that its his brothers war means that hell continue to get questions  particularly when each new statement he makes is so shockingly obtuse. Washington Post, Paul Waldman is a contributor to The Plum Line blog at The Washington Post, and a senior writer at The American Prospect.]", "Date": "20150814", "Author": "[ Paul Waldman]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-jeb-bush-iraq-war-20150814-story.html", "Title": "[ Jeb Bush keeps finding new ways to be wrong about Iraq]"}