{"Content": "[ Amy Sandler has been waiting since April for Munster, the town where she lives, to enact a human rights ordinance. After a long, painful and highly publicized battle against the state for marital rights with her legal partner, Niki Quasney, who died of cancer in February, Sandler is tired of waiting for social progress. Again. \"This delay tactic is an embarrassment to our town and a slap in the face to those who want to know that Munster residents are protected from discrimination,\" Sandler said. The Munster Town Council has heard stories of \"blatant discrimination and personal harms committed to residents\" in her town, she said. There have also been letters of support from community leaders -- including the ministers of two well known and longtime churches in town -- and educational material on such ordinances, called HROs, she said. \"We thought the Town Council would see the support for an HRO and do the right thing,\" said Sandler, who has support from the towns Jewish community and Quasneys surviving family, among others. \"Niki would be beyond sickened by how the Town Council members and attorneys have mishandled this opportunity,\" she said. \"I dont understand what would delay them from making a statement that Munster will not tolerate discrimination against any class of citizens.\", Standard legal language in a typical HRO offers protections in employment, housing and public accommodation. For example, you cant be fired, denied a place to live, or turned away as a customer for being gay or transgendered. Jim Bellar continues to insist his pending lawsuit against River Forest Community School Corp. is strictly about principle, not payoff, even after his attorney outlined a possible settlement option. So much so that earlier this month Bellar agreed to file an amended 16-page legal complaint against... Jim Bellar continues to insist his pending lawsuit against River Forest Community School Corp. is strictly about principle, not payoff, even after his attorney outlined a possible settlement option. So much so that earlier this month Bellar agreed to file an amended 16-page legal complaint against... According to Freedom Indiana, an Indianapolis-based organization advocating equal rights for the states gay community, 16 Hoosier cities and counties have enacted these ordinances. In this area, this includes Hammond and Michigan City. Eight other communities, including Munster, are currently considering an HRO. One, however, recently tabled an HRO ordinance. According to WNDU.com, Goshen Mayor Allen Kauffman on Aug. 13 said he would issue an executive order to extend protections to that citys LGBT community after the City Council there tabled an HRO. In a statement, Kauffman said, \"We must take action on behalf of Goshens vulnerable residents,\" WNDU reported. Stopping the instances of discrimination is part of Freedom Indianas mission. \"As it stands, roughly 31 percent of Hoosiers  a little more than 2 million residents who live in these communities  are currently protected to some extent, though some ordinances are stronger than others,\" said Jennifer Wagner, communications director for Freedom Indiana. Remember the day you received your first drivers license? How about your first drive behind the wheel without a parent or adult? Your first vehicle?, Of course you did. Those were memorable milestones in our lives. We couldnt wait to hit the open road and explore our newfound freedom to anywhere. Remember the day you received your first drivers license? How about your first drive behind the wheel without a parent or adult? Your first vehicle?, Of course you did. Those were memorable milestones in our lives. We couldnt wait to hit the open road and explore our newfound freedom to anywhere. Will Munster soon be on this list?, \"We have had a work study on the topic,\" replied Town Council President Andy Koultourides. I told him about Sandlers frustration over this lingering issue, and her claims that town officials are purposely dragging their feet to enact an HRO. \"She has a right to her opinion. We all do,\" he replied. \"I have a responsibility to the entire town.\", At a June 4 meeting with town officials and a town attorney, Sandler and other community members outlined a possible HRO. The group also provided samples of other HROs in the state, as well as resources to explore for more information. No progress has been made since then. \"Ive met with them three times. Others have joined me,\" Sandler said. \"Does (Koultourides) realize this is not about my opinion?\", In a letter to Munster Town Manager Dustin Anderson, resident Ann Bochnowski wrote, \"Although same sex marriage is now legal throughout our country, many important protections are not in place for people in the LGBT community.\", \"Such an ordinance would include all of the federal and state protected classes as well. I, along with many others, would love to see Munster become a leader in protecting all of its citizens, its workers and its visitors,\" she wrote. Anderson told Sandler in a July 31 email: \"The Town Council does not plan to have a second work study on the Human Rights Ordinance in the foreseeable future.\", That same day, Koultourides sent an email to Sandler, saying, \"The town attorneys are looking into the matter at this time. It will not be on the next town council meeting agenda. I will keep you posted on any upcoming dates in regards to the HRO proposal.\", Sandler asked, \"So who are they really protecting?\", Good question, I thought. What reason would the town have to not pass such an ordinance? So I posed it to Koultourides. On Wednesday, he told me he would get back to me with an explanation. I never heard back from him. \"Niki, who grew up here, would not have been this patient,\" Sandler said. \"Her genuine concern for all people and her tenacity continues to be my inspiration. I think its time to expose to the public what we are trying to do and why.\", One of the key principles critically important in any HRO was outlined in Sandlers information to the town: \"Full protection from discrimination on the basis of both sexual orientation and gender identity means that sexual orientation and gender identity are treated the same as other protected classes. There is no reason for a different standard for LGBT discrimination.\", Another piece of information provided to the town came from Robert Katz, an Indiana University law professor in Indianapolis. He wrote, \"The short answer is that while the states Civil Rights Act does not ban discrimination based on sexual orientation and gender identity, it empowers them to adopt ordinances (HROs) and create human rights commissions to effectuate the public policy declared in the act, which is to promote equal opportunity for Indiana residents but without conflict with any of the provisions of this chapter.\", The town can certainly enact an HRO. So far, it chooses not to. Are town officials feeling pressure from its conservative residents? Are partisan politics involved? A bias against same-sex rights? Im not sure. On April 13, while much of the state and the nation were talking about the states ill-fated Religious Freedom Restoration Act, Sandler first approached officials at a Town Council meeting about an HRO. That night, Koultourides made the comment, \"Whats good enough for Indiana is good enough for Munster,\" according to the meeting minutes. But that was four months ago. And by now we know that it wasnt good enough for Indiana. Well, Munster?, Jdavich@post-trib.com, @jdavich]", "Date": "20150821", "Author": "[ Jerry Davich]", "Link": "http://www.chicagotribune.com/suburbs/post-tribune/opinion/ct-ptb-davich-human-rights-ordinance-0824-20150821-story.html", "Title": "[ Town of Munster accused of dragging feet on human rights ordinance]"}