{"Content": "[ Republican U.S. Sen. Mark Kirk, a chief critic of efforts by the White House to strike a nuclear agreement with Iran, condemned the Obama administration-led deal announced Tuesday as an approach that will \"enrich and empower\" a country that is \"the worlds foremost sponsor of terrorism.\", But the two Democrats who have announced 2016 bids to challenge Kirk took a more cautious and supportive approach to the agreement reached between Iran and a coalition of six international partners led by the U.S. Second-term U.S. Rep. Tammy Duckworth, a Democrat from Hoffman Estates, said she was \"encouraged\" by President Barack Obamas explanation of the agreement, and Chicago Democrat Andrea Zopp offered \"congratulations\" to Obama and Secretary of State John Kerry. Still, Duckworth cautioned that it was too early to embrace the agreement without reading the fine print. \"It is imperative that members of Congress and the general public not rush to judgment on an agreement that will have enormous consequences not only for the Iranian nuclear program, but for U.S. national security interests throughout the region,\" Duckworth said in a statement. Duckworth said she was committed to standing by Israel and indicated that her support for the relief of economic sanctions on Iran was tied to a \"strong, verifiable inspection regime.\" She criticized those who attacked the deal \"without a viable alternative short of going to war\" as being \"reckless and irresponsible.\", Overcoming decades of hostility, Iran, the United States, and five other world powers struck a historic accord Tuesday to check Tehrans nuclear efforts short of building a bomb. The agreement could give Iran access to billions in frozen assets and oil revenue, stave off more U.S. military action... Overcoming decades of hostility, Iran, the United States, and five other world powers struck a historic accord Tuesday to check Tehrans nuclear efforts short of building a bomb. The agreement could give Iran access to billions in frozen assets and oil revenue, stave off more U.S. military action... Zopp said she believed the agreement \"appears to contain the important and critical factors of nonproliferation and verification to ensure that Iran does not develop a nuclear weapon.\", \"Negotiations are the best pathway to security. The rejectionist path suggested by some Republicans is a reckless one  all too reminiscent of the overly aggressive attitudes that mired our nation in war since 2003,\" Zopp said in a statement. Kirk, seeking a second Senate term next year, warned against lifting sanctions, returning assets frozen by the U.S. and its allies, and ending a United Nations embargo on selling military weaponry to Iran as part of the agreement. \"I am gravely concerned that the nuclear agreement will condemn the next generation to living with an Iranian nuclear power in the Persian Gulf and ultimately endanger the security of the United States, Israel and other regional allies in the long term,\" said Kirk, who has viewed a deal reached by the Obama administration as destabilizing the Middle East. President Barack Obama discussed the landmark Iran nuclear deal at the White House on July 14, 2015: \"We were determined to get this right, and I believe our persistence paid off.\"(White House), President Barack Obama discussed the landmark Iran nuclear deal at the White House on July 14, 2015: \"We were determined to get this right, and I believe our persistence paid off.\"(White House), \"This agreement will pave Irans path to nuclear weapons because it requires Iran to take temporary and reversible steps that keep it at the threshold of acquiring nuclear weapons and will allow Iran to obstruct and veto inspections at suspect nuclear facilities,\" Kirk said. Congress will now begin a 60-day review of the agreement. But Obama, appearing at the White House to announce the deal, served notice to critics. \"I will veto any legislation that prevents the successful implementation of this deal,\" the president said. rap30@aol.com, Twitter @rap30]", "Date": "20150714", "Author": "[ Rick Pearson]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-iran-reaction-kirk-durbin-duckworth-met-0715-20150714-story.html", "Title": "[ Kirk opposes Iran deal, Democratic challengers stay cautious]"}