{"Content": "[ A few months ago, I was giving a talk about journalism  explaining why I do what I do  and I said that when I started writing the column, I didnt want to write about race. An audience member  a Lebanese French man who has become a dear friend  said he had felt similarly about writing or speaking on Arab issues. When you are the \"other,\" you wonder how much more attention you want to bring to yourself. Do you want to carry that extra weight? It can be exhausting, especially when the other \"others\" dont seem to get you. (Ill return to that in a bit.), I didnt want to write about race because it just felt so cliched for the black columnist to do so. As a person who loves writing, the only thing worse than having cliches slip into your stories is illuminating the ones in your life. So, I wrote the column for  I dont know how long  trying to write about other stuff. And when I did take on race, I was hyper-conscious about it. Then a man of color decided to run for president, and he won the 2008 Democratic Iowa caucus. Remember that? I asked my editors if I could create an online forum where folks spoke openly and honestly about race. For a while, it worked swimmingly until the trolls found it. I write about race because I want you to try to understand my perspective, which isnt necessarily the \"black perspective,\" because I cant speak for everyone with darker skin. And, I want to know what youre thinking. (I must add that it helps if you read the entire column first before you tell me.), I know. I know. We think we know each other because of what our diode screens tell us. But we dont. Earlier this week, I wrote a column on the movie \"Straight Outta Compton.\" I heard from a lot of you. A lot! But I want to speak to those of you who responded about an excerpt of an email I included in the column and my response to it. Heres the excerpt:, Dawn, Im a white guy who was pulled over for the exact same offense (as Sandra Bland). Believe me, I was f***ing furious. The reason I wasnt arrested or shot was because I still respected the officer and I was courteous. ... Why cant blacks understand this?, Heres my response:, Im not sure if this type of advice is wishful or magical thinking. It suggests that the only thing black people have to do is act like white people and everything would be fine and just. My advice: See the movie, because apparently real-life videos arent enough. The part of my response that got people riled was the \"act like white people\" part. Some of you thought I was saying that to \"act like white people\" meant to be courteous. I didnt mean that at all. (White people dont corner the market on courteousness; I happen to be quite courteous.), It occurred to me that some of you were recalling that old-school phrase that black students used to use about peers who were \"acting white.\" In a world in which everybody kind of acts like each other  trying on the best and worst of stereotypes  I dont believe folks think in those terms anymore. But heres what I meant: White skin confers certain privileges. Thats just the way it is in America (and other places as well). So, even if a black person acts like a white person  which white person, Im not exactly sure  that doesnt guarantee he will be treated like that white person. As a result of police-involved shootings, a lot of black people are feeling fearful and vulnerable. A 29-year-old black woman recently told me about driving through her suburb and being pulled over by the police for a routine traffic stop. She said she was terrified. She has a masters degree from the prestigious Manhattan School of Music and has studied classical music in Vienna. Maybe a year ago, she would have thought: My father is a Harvard University grad. My mother is a Northwestern grad. My brother has an undergraduate degree from Morehouse and a masters degree from Northwestern. Its a fallacy to believe that the ONLY THING a black person has to do is act like a white person and all will be well. It is magical thinking. The reality is that inasmuch as I would love something prescriptive regarding how to deal with, say, police interactions, there isnt one surefire answer. The deaths of Eric Garner, John Crawford, Tamir Rice, Walter Scott, Eric Harris, Freddie Gray, Samuel DuBose and Sandra Bland have taught us that. It reminds me of the way most Americans felt after the 9/11 attacks  vulnerable, exposed, angry, hungry for justice. Weve tried to come up with some solutions. We take our shoes off now while going through airport security. But we know that safety is too often more  a state of mind than a state of being. So, yes, I continue to tell my daughter that if she ever has to engage a police officer during a traffic stop, she must be courteous. She must telegraph every move  \"I am reaching for my drivers license.\" She must save whatever justice she believes shes due for later. I tell her this not because I want her to act white, but because I want her to act alive. dmturner@tribpub.com]", "Date": "20150820", "Author": "[ Dawn M. Turner]", "Link": "http://www.chicagotribune.com/news/columnists/ct-race-acting-white-turner-met-20150820-column.html", "Title": "[ Writing about race and 'acting white']"}