{"Content": "[ Ever sure of himself, Donald Trump paid a visit to the Mexico border Thursday and predicted Hispanics would love him  \"they already do\"  because as president hed grab jobs back from overseas and give more opportunity to those who live in the U.S. legally. \"Theres great danger with the illegals,\" the Republican presidential contender told reporters. But he claimed a \"great relationship\" with Hispanics, even as Latino leaders have come at him with blistering criticism for his painting Mexican immigrants as criminals. \"Ill take jobs back from China, Ill take jobs back from Japan,\" Trump said. \"The Hispanics are going to get those jobs, and theyre going to love Trump.\", The in-and-out border visit came as Trump continued to dominate attention in the GOP presidential race, to the growing exasperation of his rivals. Campaigning in Gorham, New Hampshire, Jeb Bush offered a distinctly different message in the immigration debate  and spoke partly in Spanish. \"A Republican will never be elected president of the United States again unless we campaign like this,\" Bush said, gesturing with open arms. \"Unless we campaign openly  where we campaign in every nook and cranny of this country, where we go campaign in the Latino communities, fast-growing communities all across this country that will make a difference in who the next president is going to be.\", Trump, a businessman and reality TV host, set up a dramatic scene in advance of his own campaign trip, saying he was putting himself in \"great danger\" by coming to the border area across from the volatile Mexican city of Nuevo Laredo. But, he said, \"I have to do it. I have to do it.\", Republican presidential candidate Donald Trump says he expects to win the presidential nomination and run against Democratic candidate Hillary Clinton. (AP), Republican presidential candidate Donald Trump says he expects to win the presidential nomination and run against Democratic candidate Hillary Clinton. (AP), As he spoke to reporters with his back to the out-of-sight Rio Grande, a huge stream of transport trucks inched peacefully from the Mexican side onto the World Trade Bridge and into Texas at a bustling commercial hub routinely visited by officials. Trump traveled in a massive police-escorted motorcade on roads closed for his entourage. A local border patrol union pulled out of events involving him. Patrol agents had planned to accompany Trump to the border and hold a meeting with him but canceled after consultations with their national union, the National Border Patrol Council, said Hector Garza, president of Local 2455. Trump stepped off his plane in Laredo and said the union members backed out because they were \"petrified and theyre afraid of saying whats happening\" at the border. Dozens of people were on hand, a mix of protesters and supporters. Some chanted \"fuera,\" telling him to get out; a supporter waved a sign, \"no era insulto,\" meaning his remarks about immigrants that touched off a feud with Republican rivals were not an insult. It was the spring of 1968 and Donald Trump had it good. He was 21 years old and handsome with a full head of hair. He avoided the Vietnam War draft on his way to earning an Ivy League degree. He was fond of fancy dinners, beautiful women and outrageous clubs. Most important, he had a job in his... It was the spring of 1968 and Donald Trump had it good. He was 21 years old and handsome with a full head of hair. He avoided the Vietnam War draft on his way to earning an Ivy League degree. He was fond of fancy dinners, beautiful women and outrageous clubs. Most important, he had a job in his... His visit drew strong reaction from some residents of Laredo, which has an overwhelmingly Hispanic population. Pedro Omar Castillo, 72, suggested that Trump needs the growing Hispanic vote to be successful in 2016. \"But hes not going to get it because of his words,\" Castillo said in Spanish as he walked through a downtown park. \"He is a racist.\", But Karina Villalba, 26, waited for Trump at the airport and held a sign saying \"I heard your speech & I am NOT offended.\", A Hispanic oil-field worker, she said she appreciates Trumps in-your-face tone. \"Sometimes honesty hurts,\" she said. Trump roiled the presidential race weeks ago when he branded Mexican immigrants rapists and criminals, sparking a feud with his GOP rivals that intensified after his dismissive comments about Arizona Sen. John McCains military service in the Vietnam War. From party heavyweights like former Bush to relative newcomers to the national scene like Wisconsin Gov. Scott Walker. Trumps rivals face his tactics of calling out his critics by name, vilifying the GOP establishment and injecting inflammatory rhetoric into the immigration debate. In Washington on Wednesday, former Texas Gov. Rick Perry denounced Trumps campaign as a \"cancer on conservatism\" and a \"barking carnival act\" in a speech that defined \"Trumpism\" as \"a toxic mix of demagoguery, mean-spiritedness and nonsense that will lead the Republican Party to perdition if pursued.\", Indeed, the insults flying between Trump and his rivals have been caustic. Sen. Lindsey Graham, R-S.C. said Thursday, \"The only way were going to be able to lose the election is continue to say things like Donald Trump is saying.\", \"I think hes sort of a political car wreck where people slow down and watch,\" Graham told MSNBC. Associated Press, ]", "Date": "20150723", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/ct-donald-trump-mexico-border-20150723-story.html", "Title": "[  Trump visits Mexico border, claims Hispanics love him ]"}