{"Content": "[ I am a principal in Chicago Public Schools. A reporter called me recently and asked what the impact of CPS proposed 1,400 job cuts would be on my school, Blaine Elementary. I could not answer without seeing a specific budget, but the cuts will chip away at the quality of CPS schools. There are non-negotiable budget requirements just to get a school to the point of being functional, such as teachers in classrooms, an administrative team, basic curriculum and supplies. However  as I understand it  we do not want to stop at just being functional. We want to be effective. We want to be excellent. For that to happen, we need early at-home interventions for preschool-age children from low-income households, smaller student-to-teacher ratios, thoughtful training for teachers, a competitive compensation and benefits package to attract skilled professionals. We need a rich arts curriculum, exceptional educators whose efforts are focused on the children who come to us less prepared than their peers, a rigorous curriculum tailored to local student needs and the thoughtful use of technology in schools. The 2013 budget cuts meant that many of our students lost some of those things  the resources that move a school from being functional to being excellent. The 2015 budget cuts will mean that my students  and students across Chicago  will lose even more. Politicians frame this as pension payment vs. classroom investment  as if those were the only two expenses our tax dollars are used for and one of them has to be sacrificed. This is patently false. City Hall has had many opportunities for sacrifice in other areas, but it has refused to make those sacrifices. Mayor Rahm Emanuel and Chicago Public Schools officials would have you think the financial catastrophe they face can be entirely blamed on a scapegoat named Springfield. \"We wouldnt be here if Springfield were prioritizing education funding,\" CPS interim CEO Jesse Ruiz said Thursday, as Chicago... Mayor Rahm Emanuel and Chicago Public Schools officials would have you think the financial catastrophe they face can be entirely blamed on a scapegoat named Springfield. \"We wouldnt be here if Springfield were prioritizing education funding,\" CPS interim CEO Jesse Ruiz said Thursday, as Chicago... Mayor Rahm Emanuel had a chance to sacrifice the diversion of $55 million in taxes to a hotel near McCormick Place. He could have invested some of that tax increment financing money in the pension system instead. Emanuel had a chance to sacrifice his relationship with the banking community by suing the banks that are siphoning $100 million from CPS as a result of toxic financial deals brokered by his hand-picked CPS board president, David Vitale. Emanuel has refused to try to recoup these dollars, which he could invest in the pension system. Aramark Corp. and SodexoMAGIC Corp. failed to keep CPS schools clean, but Emanuel and CPS would not sacrifice their relationship with those companies by voiding their $340 million in contracts. Some of that money could have been invested in the pension system. Emanuels appointed school board gave SUPES Academy $20 million to provide \"training\" that I believewas poor in quality and completely unresponsive to the districts professional development needs. That money could have been invested in the pension system. I was in love with Mayor Richard M. Daley. It was a platonic love, like the kind you feel for your uncle, but it was true. I never met him, but I admired him from afar  the love for his city, the devotion to his wife, the commitment to greening Chicago, from the 600,000 trees he reportedly had... I was in love with Mayor Richard M. Daley. It was a platonic love, like the kind you feel for your uncle, but it was true. I never met him, but I admired him from afar  the love for his city, the devotion to his wife, the commitment to greening Chicago, from the 600,000 trees he reportedly had... City Hall, with such a blatant history of being unwilling to make well-connected and powerful bankers and businessmen sacrifice, has the audacity to announce that it has no choice but to make children sacrifice their education. This mayor is like a man who just bought a sports car, an entertainment center and a vacation home, and then tells his children theyll have to sacrifice on clothing because he has to pay their grocery bill. Emanuel says one thing, but his behavior says another. He has put investor profits over investing in our teachers and their classrooms. He wants us to get used to that. I will never get used to that. And neither should you. Troy LaRaviere is the principal of Blaine Elementary School.]", "Date": "20150707", "Author": "[ Troy LaRaviere]", "Link": "http://www.chicagotribune.com/news/opinion/commentary/ct-cps-layoffs-schools-blaine-perspec-0612-20150707-story.html", "Title": "[ Why does Rahm Emanuel put business ahead of our children?]"}