{"Content": "[ After dipping his toe in the online world of Twitter years ago, President Barack Obama is now jumping in head-first, popping off tweets at all hours of the day about pop culture, sports and even Supreme Court rulings. Although the White House has used Twitter throughout Obamas presidency, until recently its been a highly scripted endeavor, with press aides composing and releasing tweets about Obamas agenda at strategic times. Only occasionally would Obama post to Twitter himself, identifying a bona fide presidential tweet by appending his initials. Now Obama is composing his own tweets almost daily, weighing in on issues of the day from any location, without the filter of his press office. Hes been tweeting with increased frequency since inaugurating his personal twitter account, @POTUS, earlier this summer. Hello, Twitter! Its Barack. Really! Obama wrote in May. Six years in, theyre finally giving me my own account. So how, exactly, does a president tweet? Obama, who has been known to use an iPad and a Blackberry, can send tweets from a variety of secure devices, according to the White House. Obama gives his team a heads up before he tweets, and his staff says he sometimes agrees to tweet about topics his aides suggest. In the six weeks since Obama kicked off the account, he has already amassed more than 3 million followers. He follows only 66 Twitter users  mostly sports teams, federal agencies and top government officials. He briefly set a record for attracting a million followers faster than any other Twitter user. But Obamas record was quickly broken by Caitlyn Jenner. Josh Earnest, the White House press secretary, says Obama was enthusiastic about having the chance to use venues like Twitter to communicate with people. Hes really taken to the idea, Earnest said. A look at some of Obamas recent tweets:, Gay marriage, Obamas first reaction to the Supreme Courts historic ruling legalizing gay marriage nationwide came not in a press release or a Rose Garden appearance but through his Twitter account. Today is a big step in our march toward equality, Obama tweeted on June 26. Gay and lesbian couples now have the right to marry, just like anyone else. Holy guacamole , When an enthusiastic debate broke out on Twitter this month about including peas in guacamole, Obama took to Twitter to say he had no appetite for the added ingredient. He responded to the pea-laden recipe in The New York Times during a Twitter town hall  a medium the White House has been trying out in which the president takes questions from Americans directly on Twitter. There are two ways a world leader can embrace social media: Hand over the Twitter and Facebook accounts to pros, or explore, blunder and waste precious time doing it on your own. The ministers and heads of state who choose the second path are more attractive to followers looking for interesting... There are two ways a world leader can embrace social media: Hand over the Twitter and Facebook accounts to pros, or explore, blunder and waste precious time doing it on your own. The ministers and heads of state who choose the second path are more attractive to followers looking for interesting... Respect the NYT, but not buying peas in guac, the president wrote, offering his personal recipe: Onions, garlic, hot peppers. Classic. Bring in the band, After Obama tweeted that hed spent his morning listening to the new album from The Black Keys, the rock band tweeted back asking if they could use Air Force One for their upcoming gigs. A few hours later  at 8 p.m. on a weeknight  Obama tweeted his response to the band: Its not mine; just a loaner. Maybe you can come play at the White House sometime instead?, No word on whether the group will be rocking out at 1600 Pennsylvania Ave. No. 1 fan , Obama congratulated the American soccer team and midfielder Carli Lloyd for their victory Sunday night in the Womens World Cup. What a win for Team USA! Obama wrote, adding: Your country is so proud of all of you. Come visit the White House with the World Cup soon.]", "Date": "20150707", "Author": "NULL", "Link": "http://www.chicagotribune.com/business/ct-obama-on-twitter-20150707-story.html", "Title": "[ Obama chimes in on pop culture, 140 characters at a time]"}