{"Content": "[ Now that most of our information -- and the information that news organizations use as raw material -- is delivered by technology platforms such as social networks, what we know about the world is potentially hackable. Propagandists no longer have to convince professional news organizations to spread their stories; they just have to embed them into social media news feeds. Employees of the Russian propaganda machine, in particular, seem to be focused on finding ways to game the modern news delivery system. And though their techniques arent yet perfect, theyre making significant progress. In a recent post on Medium.com, John Borthwick and Gilad Lotan of Betaworks, the New York City-based venture capital firm, detailed two cases in which hackers -- apparently originating from Russia in both instances -- attempted to mess with the flow of news in the West. One of the two operations succeeded and the other failed. The first case can be called up with a Google search of the terms \"ISIS France support\". That will yield, near the top of the first results page, stories from Newsweek and Vox.com describing the results of a poll carried out for the Russian state-owned propaganda network, Russia Today. According to the survey, 16 percent of French citizens, and 27 percent of those aged 18-24, have a positive opinion of Islamic State. This, of course, is utter nonsense: the 27 percent number, for example, is based on a sample of only 105 young French people. Yet reporters from Vox and Newsweek saw the numbers in a tweet and wrote pieces citing the poll, not realizing it was bunk. The Vox story went viral on Twitter, spread by people who often added credulous comments endorsing the report. Eventually, The Washington Post did a lengthy piece debunking the survey -- but it sits lower in Google search results than the Vox piece. \"Media hacks,\" Betaworks chief executive Borthwick wrote, \"take advantage of the decontextualized structure of real time news feeds -- you see a Tweet from a known news site, with a provocative headline and maybe the infographic image included - - you retweet it.\" People often do that without actually reading the story, much less thinking about it. As the story gains in popularity, Google will begin suggesting related search terms to its users -- and presto, a piece of misinformation turns into something \"everybody knows.\", Years ago hackers planted malicious software on computer systems that control parts of the United States critical infrastructure, including pieces of the electrical grid, gas and water systems. The malware, which the Department of Homeland Security warned about only last month, was dubbed BlackEnergy... Years ago hackers planted malicious software on computer systems that control parts of the United States critical infrastructure, including pieces of the electrical grid, gas and water systems. The malware, which the Department of Homeland Security warned about only last month, was dubbed BlackEnergy... The \"news hack\" observed by Lotan, chief data scientist at Betaworks, was more sophisticated and disturbing, even though it was ultimately unsuccessful. Several months ago, on Sept. 11, Twitter accounts registered under American-sounding names started spreading the story of a chemical factory explosion in Centerville, Louisiana. A Wikipedia page was created for the fake catastrophe, using Wikipedia editor identities that had been developed over some time. There was also a YouTube video in which Islamic State fighters supposedly claimed responsibility for the terror attack and a Facebook page for a nonexistent news outlet called Louisiana News, which backed up the Islamic State story. A Tweetstorm ensued, but no respectable news outlets picked up the story. It was too easy to disprove and it didnt help that its creators had made mistakes. The Wikipedia editor, for example, who created the article on the Centerville disaster had too brief a history with the crowdsourced encyclopedia to sustain an entry of this magnitude: site administrators quickly flagged the page and shut it down. It was also clear that the Tweetstorm had been initiated in Russia one day before the supposed explosion; Lotan points out that many of the Twitter accounts that spread the story were created by mass-posting software. \"As more of our information propagation mechanisms are embedded within networks,\" Borthwick wrote, \"it will become harder for malicious and automated accounts to operate in disguise. Whoever ran this hoax was extremely thorough, yet still unable to hack the network and embed the hoax within a pre-existing community of real users.\", This doesnt mean, however, that those who initiated the hack arent learning from their mistakes -- and from the successful example of the Russia Today piece. Clearly, its easier to embed an idea in the modern audiences collective mind if one first makes it attractive for news organizations with a wide reach. That might mean leveraging one of the many successful media outlets that prioritize clicks over substance, and snappy headlines over sound judgment. But one can also try to get lucky and fool popular writers for more traditional news organizations. They, too, are in search of clicks. Propaganda is most easily spread on social media in the form of unverifiable but nice-looking data such as survey results or below-the-radar news stories. Items about chemical factory explosions are a bit too high-profile to slide by unnoticed: readers will wonder why traditional media arent on the case. When it comes to contaminating the Russian- and Ukrainian- language news flows, the unofficial propaganda armies of the Russian-Ukrainian conflict have already progressed well beyond these simple findings. My Facebook and Twitter feeds are full of links to supposedly legitimate sites teeming with tweetable \"news stories\" about the latest Russian or Ukrainian atrocities, fake Western reports on the war in eastern Ukraine and other such fare. After months of dealing with this, I no longer even click on the links (unless they are especially comic), but I see hundreds of people reposting them as though they were credible. And with the Moscows propaganda machine using increasingly sophisticated tactics -- as documented by the site Stopfake.org, which battles Russian troll and bot armies on Ukraines behalf - - I still fear I may be taken in one day. In the two cases documented by Betaworks, the Kremlin trolls -- who work in special factories and are paid per story - - have simply attempted to treat Western audiences to English- language versions of their domestic fare. If that doesnt occur more often, thats because the Kremlin propaganda machine is more concerned with keeping President Vladimir Putins domestic support from eroding than with muddying Western news streams. But when the war in Ukraine quiets down, Putins war on the West will not. Western journalists will need to practice distinguishing between real news and misinformation that very closely resembles it. And, of course, Russia will not be the only country using these techniques to sow unreasonable fears among its opponents or undermine the popularity of their politicians. Corporations, too, may be tempted to resort to news hacking in order to gain a competitive edge. This means the role of traditional journalistic practices such as old-fashioned fact-checking and informed analysis is destined to grow. The anarchic world in which the content of mass media is determined by its users creates new dangers that only those who vaguely remember pre-Internet values can ultimately defuse. Leonid Bershidsky, a Bloomberg View contributor, is a Berlin-based writer. ]", "Date": "20150311", "Author": "[ Leonid Bershidsky]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-russia-is-hacking-your-social-media-news-feed-20150311-story.html", "Title": "[ Russia is hacking your social media news feed]"}