{"Content": "[ TexasGovernorRickPerrymade his first court appearance on Thursday to answer felony abuse of power charges and afterward criticized a special prosecution that has cast a shadow over his possible Republican presidential run in 2016. Lawyers forPerryasked the court to dismiss the charges, saying special prosecutor Michael McCrumdid not properly take the oath for his post. The governor did not address the court during the hearing, which covered procedural matters. Perrytold reporters afterward that he was acting within his legal duties as governor and the special prosecutor was not complying with constitutional and statutory requirements. \"Exercising proper jurisprudence is not a technicality. It is a requirement essential to the rule of law,\"Perrysaid. In court, special prosecutor McCrum dismissed the defense accusations as groundless and said all proper procedures were followed. In recent trips to states that have key presidential primaries,Perryhas tried to use the criminal proceedings to rally support within theRepublican Partyby portraying himself as the victim of a partisan prosecution. Perryhas ranked near the bottom of possible candidates among Republicans in support polls but has seen a slight increase in support since the August indictment, which came as he was gaining national attention for attacking theObama administrationover its immigration policies. TexasGovernorRick Perry, a possible Republican presidential candidate in 2016, said on Saturday an indictment against him for abuse of power was a political move that he intends to fight. Perry was indicted on Friday by a grand jury in Travis County, a Democratic stronghold in the heavily Republican... TexasGovernorRick Perry, a possible Republican presidential candidate in 2016, said on Saturday an indictment against him for abuse of power was a political move that he intends to fight. Perry was indicted on Friday by a grand jury in Travis County, a Democratic stronghold in the heavily Republican... The case, however, could scare off major Republican donors in the party who see it causing long-term damage that would make it difficult forPerryto win the presidential race if he is nominated, analysts said. Perrywas indicted by a grand jury inTravis County, a Democratic stronghold in heavily RepublicanTexas, over his veto of funding for a state ethics watchdog that has investigated prominentTexasRepublicans. He was charged with abuse of official capacity, a first-degree felony, and coercion of a public official, a third-degree felony. The longest-serving governor in the states history,Perrybecame the target of an ethics investigation last year after he vetoed $7.5 million in funding for thestate public integrity unitrun from theTravis County district attorneys office. Perrys veto was widely viewed as intended to force the resignation ofTravis County District AttorneyRosemary Lehmberg, a Democrat, after she had pleaded guilty to drunken driving. , Here are a few of the possible White House contenders in 2016:, Opponents have saidPerrymay have been looking to put an ally in charge of the unit, extending what they say is cronyism in his administration. Perryhas been governor ofTexassince December 2000. He did not seek re-election this month as he tests the waters for another presidential run. He dropped out of a gaffe-filled campaign for the 2012 Republican presidential nomination but has been attempting a political comeback.]", "Date": "20141106", "Author": "[ Reuters]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-rick-perry-20141106-story.html", "Title": "[ Texas Gov. Rick Perry slams abuse of power charge at court hearing]"}