{"Content": "[ The small Arizona town where Kayla Jean Mueller grew up began gathering in grief Tuesday upon learning that the 26-year-old aid worker who traveled the world on a quest to help others died while in the hands of Islamic State militants. A small memorial on the courthouse plaza began to grow rapidly as word spread that Muellers death had been confirmed. The Islamic State group reported Friday that Muller, whose 18-month captivity had largely been kept secret in an effort to save her, had died in a recent Jordanian airstrike targeting the militants. On Tuesday, her parents and U.S. officials said they were now certain of her death, although officials said they could not confirm how she died. \"What a fine, fine woman and a tribute to Prescott,\" said 15-year resident Tina Nemeth. \"Its just so sad, it really is, and everyone feels exactly the same. Its a shock it hit Prescott. Were not that big of a town.\", The former territorial capital of Arizona has only recently begun to recover from a devastating 2013 wildfire that claimed the lives of 19 members of an elite firefighting squad. Stickers featuring the fire crews logo and bearing the number \"19\" are still fixed to vehicles all around the town of 40,000 people. The mountain towns picturesque courthouse lawn is still recognizable to some outsiders as the site of the dramatic martial-arts fight scene in the 1971 film \"Billy Jack.\", On Tuesday, it was filled with members of the media waiting to hear from Muellers family, which lives about 10 minutes away at the end of a winding dirt road. Sheriffs deputies have blocked the road since Friday. \"We are heartbroken to share that weve received confirmation that Kayla Jean Mueller, has lost her life,\" Muellers parents, Carl and Marsha Mueller, said in a statement released earlier. \"Kayla was a compassionate and devoted humanitarian. She dedicated the whole of her young life to helping those in need of freedom, justice, and peace.\", President Barack Obama said Mueller, who assisted humanitarian organizations working with Syrian refugees, \"epitomized all that is good in our world.\", \"No matter how long it takes, the United States will find and bring to justice the terrorists who are responsible for Kaylas captivity and death,\" the president said. The White House said Obama had spoken with Muellers parents and offered his condolences and prayers. Mueller is the fourth American to die while being held by Islamic State militants. Three other Americans  journalists James Foley and Steven Sotloff and aid worker Peter Kassig  were beheaded by the group. Journalist Austin Tice disappeared in August 2012 while covering Syrias civil war. Its not clear what entity is holding him, but it is not believed to be the Islamic State group or the Syrian government, his family has said. Mueller was taken hostage in August 2013 while leaving a hospital in Syria. Her identity was long kept secret out of fears for her safety. An attempt to rescue Mueller and other American hostages occurred in a July 4 raid previously disclosed by the Pentagon. U.S. special forces commandos conducted a predawn raid on a prison in Raqqa, Islamic States stronghold in Syria. But the mission was unsuccessful because hostages, which included Mueller as well as Foley and Sotloff, already had been moved from the site. We never stopped trying to get her, said a defense official, who wasnt authorized to speak publicly on the matter. We never lost that focus. Obama confirmed Tuesday that Mueller was one of the hostages Delta Force commandos attempted to rescue in a raid on an oil refinery facility in northern Syria in summer 2014. The two dozen commandos arrived after the hostages had been moved, Obama said. I deployed an entire operation  at significant risk  to rescue not only her but the other individuals who had been held, and probably missed them by a day or two, Obama said during an interview with BuzzFeed News. Obama said the U.S. has a commitment to devote enormous resources to free American hostages anywhere in the world. Jordan, which has launched a barrage of strikes in recent days in retaliation for the gruesome killing of one of its pilots at the hands of the militants, disputed the groups report of Muellers death. In the U.S. there was growing certainty that the claim from IS about the airstrike was false. White House spokesman Josh Earnest said that Jordans airstrikes had targeted an IS weapons compound near the groups stronghold of Raqqa in northern Syria that had been targeted before, and that there was no evidence of civilians in the area ahead of the strike. Added a U.S. intelligence official: \"She was not killed in that airstrike.\", Muellers parents released a letter Tuesday that their daughter had written them while in captivity. In the undated letter, Mueller said she was, \"in a safe location, completely unharmed.\", \"I am also fighting from my side in the ways I am able + I have a lot of fight left inside of me,\" she wrote. \"I am not breaking down + I will not give in no matter how long it takes.\", Secretary of State John Kerry said the U.S. was \"unshaken\" in its resolve to defeat the Islamic State, a group he called an \"ugly insult to the civilized world.\", SYMPATHY FOR MUELLERS FAMILY, Excerpts of statements released by members of Arizonas congressional delegation regarding the reported confirmation of the death of Kayla Jean Mueller of Prescott, Arizona:, SEN. JOHN MCCAIN, R-Ariz. \"I am heartbroken for the Mueller family at the loss of their beautiful, beloved daughter, Kayla. The thoughts and prayers of the people of Arizona, America, and the civilized world are with the Mueller family at this terrible hour. Kayla devoted her young life to helping people in need around the world, to healing the sick and bringing light to some of the darkest and most desperate places on Earth.\", SEN. JEFF FLAKE, R-Ariz. \"The death of Kayla Mueller - a Prescott native - can be laid squarely at the feet of ISIL. She deserves to be remembered for dedicating her life to the service of others. I join so many across Arizona and around the globe in offering my deepest condolences to Kaylas family. The best thing Congress can do now is authorize the mission against ISIL to let our allies and our adversaries know that we are united in our resolve.\", REP. ANN KIRKPATRICK, D-Ariz. \"Today, the news of Kayla Muellers death is felt around the world, but there is nowhere it cuts deeper than here at home in Arizona. Kayla grew up here, played in our playgrounds, studied at our schools, and volunteered in our community. But she didnt stay here - she was compelled by compassion to work in faraway places devastated by war and violence. \", REP. KYRSTEN SINEMA, D-Ariz. \"I am saddened by the news that the Mueller family has lost their daughter, Kayla. I join all Arizonans and all Americans in sending our thoughts to their family and the entire community of Prescott. \"Kayla committed her life to the causes of peace and global justice. Her work on behalf of humanitarian causes will never be forgotten and her legacy of love and generosity, even in the face of terror, will be forever remembered.\", REP. PAUL GOSAR, R-Ariz. \"Arizona, as well as our nation, has lost a piece of its heart_an ambassador of good will. But this nation never relents, and it never gives up. The American people must be resolved now to bring justice to Kaylas captors. We must put an end to this monstrous violence based on intolerance. We must endeavor to remain brave and strong in the face of those who wish to terrify, just as Kayla did.\", REP. MATT SALMON, R-Ariz. \"Kara Mueller demonstrated the best that America has to offer the world. Her tireless dedication to alleviating suffering and seeking peace for all will be forever remembered. Only the most malicious of enemies would seek to capture and threaten such a person for their own gains. This is the enemy we face today.\", REP. RAUL GRIJALVA, D-Ariz. \"This tragedy further emphasizes that the reign of terror brought by ISIS must be stopped, once and for all. While the United States must support efforts to end the madness, only a coordinated response led and fully endorsed by Arab nations in the region will stop the bloodshed. Kayla placed herself in harms way to alleviate suffering where it was happening most. Her death underscores the profound need for Arab nations to unite and fight for the peace she gave her life to help bring to their region.\", Associated Press, Los Angeles Times]", "Date": "20150210", "Author": "[ Tribune wire reports]", "Link": "http://www.chicagotribune.com/news/nationworld/chi-american-hostage-dead-20150210-story.html", "Title": "[ Killed American hostage was among those U.S. tried to free in July raid]"}