{"Content": "[ How often do you see this kind of overwhelming bipartisan sentiment in Congress? The U.S. House voted 400 to 25 on Thursday to require congressional review of any deal with Iran on nuclear weapons. A week earlier, the Senate voted 98 to 1. A reluctant President Barack Obama will sign the legislation. Thats good. Congress will have an opportunity to give strict scrutiny to potential vulnerabilities in an agreement. Speaking of vulnerabilities, we note some significant news this week from the Russians. Vitaly Churkin, Russias ambassador to the United Nations, made clear this week that U.N. economic sanctions on Iran will not automatically be reinstated if Iran violates the terms of a nuclear agreement. \"There can be no automaticity, none whatsoever\" in reimposing those sanctions, Churkin said. That goes to the heart of whats known as the \"snap-back\" provision. If the U.S. and its allies sign a deal with Tehran, economic sanctions will be eased. What if, months later, Iran cheats on the accords terms? The Obama administration says not to worry, the economic sanctions that crippled Tehrans economy and forced it to the bargaining table would be quickly and automatically reimposed. \"If Iran violates the deal, sanctions can be snapped back into place,\" Obama has said. Congress on Thursday sent President Barack Obama a bill to give lawmakers the power to review and potentially reject a nucleardeal with Iran. The House overwhelmingly passed the measure, 400-25, a reflection of lawmakers insistence on having a say in what could be a significant international... Congress on Thursday sent President Barack Obama a bill to give lawmakers the power to review and potentially reject a nucleardeal with Iran. The House overwhelmingly passed the measure, 400-25, a reflection of lawmakers insistence on having a say in what could be a significant international... Snap-back has a reassuring punchiness to it. Swift and certain punishment. If Iran cheats, it pays. The details of how a snap-back would be triggered are still being worked out. But the odds are stacked against this strategy. A snap-back would be triggered by a finding that Iran is cheating. But if the nuclear accord does not empower international inspectors to go anywhere in Iran, including military installations, at any time, the chances of sniffing out Iranian violations are substantially diminished. Even if inspectors found evidence of cheating, it could take weeks, months, even years for such evidence to be corroborated and widely accepted. \"The reality is that any cheating by Iran would always be incremental and never egregious,\" former CIA Director Michael Hayden, former top International Atomic Energy Agency official Olli Heinonen and Council on Foreign Relations senior fellow Ray Takeyh wrote in a Washington Post op-ed in March. \"Irans habit of lulling the world with a cascade of small infractions is an ingenious way to advance its program without provoking a crisis.\", The U.S. may be able to reimpose its sanctions quickly, but what about similar, and just as vital, economic pressure from the European Union and the U.N.? The EU usually requires the political cover of a Security Council resolution before it imposes sanctions. But Russia and China would likely veto any move to reimpose sanctions. And as Churkin made clear this week, Russia will oppose any U.N. sanctions snap-back. Bottom line: Moscow and Beijing seek closer ties with Iran. Many other countries, especially Americas European allies, also have been chafing for years to get back into business with Tehran. These banks and companies wont easily be shoved to the exits again. Once sanctions are lifted, once Iran is free to move about the worlds financial system, the threat of a snap-back fades. A final nuclear deal hinges on the size and timing of economic relief for Iran. Within hours of the tentative agreement last month, U.S. and Iranian negotiators were sniping at each other over interpretations of when and how sanctions would be lifted. The U.S. said sanctions would be eased in stages, as Iran fulfilled its part of the bargain. Iran said sanctions would be completely lifted once it signed the deal. Would Iran play nice? British authorities recently reported to the U.N. that Iran is buying nuclear materials linked to blacklisted firms, according to Reuters. If true, that means Tehran is violating U.N. resolutions aimed at curbing its nuclear program. Iran came to the bargaining table because international economic sanctions stifled its economy. Those sanctions gathered momentum over years. Dismantling those sanctions too fast would reward Iran for signing a deal rather than complying with a deal. Better to drive a tougher bargain now that cuts off Irans path to the bomb than rely on a shaky snap-back strategy if Iran cheats.]", "Date": "20150515", "Author": "[ Editorial Board]", "Link": "http://www.chicagotribune.com/news/opinion/editorials/ct-iran-snap-back-edit-0516-20150515-story.html", "Title": "[ Iran sanctions and the shaky snap-back]"}