{"Content": "[ Cook County Board President Toni Preckwinkles sales tax hike is playing better on Wall Street than back home. Moodys Investors Service called Preckwinkles 1-percentage-point tax hike a \"credit positive\" in a statement issued Thursday. The ratings agency noted that Preckwinkle has pledged to use most of the estimated $474 million a year from the tax hike to restore financial health to the countys underfunded pension system  a move that will give buyers of county bonds greater confidence that theyve made a reliable investment over the long haul. But the Moodys view isnt all rosy. The ratings agency indicated that state law might need changing to allow the county to put more money into its pension system. It also contends that the sales tax increase, which will give Chicago the highest sales tax of any major U.S. city at the start of next year, \"effectively removes a sales tax increase as a politically palatable revenue option for other overlapping units of local government, namely Chicago, which will need to make substantial budgetary adjustments to address its pension challenges.\", Preckwinkle has said shes taking a needed step to ensure the countys financial stability moving forward. \"Moodys announcement ... recognizes that the steps we are taking are critical components of a long-term comprehensive financial plan,\" Frank Shuftan, a county spokesman, said in a statement. The county portion of the sales tax will increase from 0.75 percent to 1.75 percent. The overall sales tax in Chicago would rise to 10.25 percent. hdardick@tribpub.com, Its going to cost more to shop in Cook County. The countys board last week approved a 1-percentage-point increase in the sales tax, a reversal of a reversal of the same tax a half decade or so ago, a tax that got Todd Stroger ousted as board president and saw Toni Preckwinkle installed. Now Preckwinkle... Its going to cost more to shop in Cook County. The countys board last week approved a 1-percentage-point increase in the sales tax, a reversal of a reversal of the same tax a half decade or so ago, a tax that got Todd Stroger ousted as board president and saw Toni Preckwinkle installed. Now Preckwinkle... Twitter @ReporterHal]", "Date": "20150723", "Author": "[ Hal Dardick]", "Link": "http://www.chicagotribune.com/news/local/politics/ct-cook-county-sales-tax-0724-20150723-story.html", "Title": "[ Preckwinkle sales tax hike plays well on Wall Street]"}